{"relation": [["First Edition. — VOL. II.", "Page", "2", "14", "23", "26", "30", "32", "36", "72", "91", "108", "118", "120", "124", "147-150", "152", "157", "232", "247", "248", "256", "260", "266", "286", "299", "316", "337", "356", "359 et seq.", "373", "380"], ["Present Edition.", "Page", "331", "341", "347", "349", "352", "353", "357", "383", "398", "411", "417", "419", "423", "438-441", "443", "446", "495-6", "505", "506", "513-514", "516", "521", "534", "542-3", "556", "572", "586", "588 et seq.", "598-9", "603"], ["———", "", "Brush-like scales of male Mallotus.", "Further facts on courtship of fishes, and the spawning of Macropus.", "Dufossé on the sounds made by fishes.", "Belt on a frog protected by bright colouring.", "Further facts on mental powers of snakes.", "Sounds produced by snakes; the rattlesnake.", "Combats of Chameleons.", "Marshall on protuberances on birds' heads.", "Further facts on display by the Argus pheasant.", "Attachment between paired birds.", "Female pigeon rejecting certain males.", "Albino birds not finding partners, in a state of nature.", "Direct action of climate on birds' colours.", "Further facts on the ocelli in the Argus pheasant.", "Display by humming-birds in courtship.", "Cases with pigeons of colour transmitted to one sex alone.", "Taste for the beautiful permament enough to allow of sexual selection with the lower animals.", "Horns of sheep originally a masculine character.", "Castration affecting horns of animals.", "Prong-horned variety of Cervus virginianus.", "Relative sizes of male and female whales and seals.", "Absence of tusks in male miocene pigs.", "Dobson on sexual differences of bats.", "Reeks on advantage from peculiar colouring.", "Difference of complexion in men and women of an African tribe.", "Speech subsequent to singing.", "Schopenhauer on importance of courtship to mankind.", "Revision of discussion on communal marriages and promiscuity.", "Power of choice of woman in marriage, amongst savages.", "Long-continued habit of plucking out hairs may produce an inherited effect."]], "pageTitle": "Darwin, C. R. 1882. The descent of man, and selection in relation to sex. London: John Murray. 2nd edition, fifteenth thousand.", "title": "", "url": "http://darwin-online.org.uk/content/contentblock?itemID=F955&basepage=1&hitpage=145&viewtype=side", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 2, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989897.84/warc/CC-MAIN-20150728002309-00087-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 60497887, "recordOffset": 60139526, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{302271=47 Quoted in 'Anthropological Review,' 1864, p. 158., 859920=5 Dr. Morse has lately discussed this subject in his paper on the Adaptive Coloration of Mollusca, 'Proc. Boston Soc. of Nat. Hist.' vol. xiv., April, 1871., 171228=47 Quoted by Prof. Canestriniin the 'Annuario,' &c., 1867, p. 90., 922069=41 'Insects of New England,' 1842, p. 133., 710809=12 Dr. Campbell, in 'Proc. Zoolog. Soc.' 1869, p. 138. See also an interesting paper, by Lieut. Johnstone, in 'Proc. Asiatic Soc. of Bengal,' May, 1868., 499361=5 'Evidence as to Man's Place in Nature,' 1863, p. 70, et passim., 538518=30 Mr. Lockwood believes (as quoted in 'Quart. Journal of Science,' April, 1868, p. 269), from what he has observed of the development of Hippocampus, that the walls of the abdominal pouch of the male in some way afford nourishment. On male fishes hatching the ova in their mouths, see a very interesting paper by Prof. Wyman, in 'Proc. Boston Soc. of Nat. Hist.' Sept. 15, 1857; also Prof. Turner, in 'Journal of Anat. and Phys.' Nov. 1, 1866, p. 78. Dr. Günther has likewise described similar cases., 997650=11 Mr. Wallace in 'Hardwicke's Science Gossip,' Sept. 1867, p. 193., 88011=28 Canestrini quotes Hyrtl. ('Annuario della Soc. dei Naturalisti, Modena, 1867, p. 97) to the same effect., 502202=6 Isid. Geoffroy, 'Hist. Nat. Gén.' tom. ii. 1859, p. 217., 1031256=32 'The Naturalist in Nicaragua, 1874, p. 385., 630361=53 Sir Andrew Smith, as quoted by Knox, 'Races of Man' 1850, p. 473., 631262=58 Major Tulloch, in a paper read before the Statistical Society, April 20th, 1840, and given in the 'Athenæum,' 1840, p. 353., 91268=32 See also some remarks, and the drawings of the ears of the Lemuroidea, in Messrs. Murie and Mivart's excellent paper in 'Transact. Zoolog. Soc.' vol. vii. 1869, pp. 6 and 90., 944775=63 Pyrodes pulcherrimus, in which the sexes differ conspicuously, has been described by Mr. Bates in 'Transact. Ent. Soc.' 1869, p. 50. I will specify the few other cases in which I have heard of a difference in colour between the sexes of beetles. Kirby and Spence ('Introduct. to Entomology,' vol. iii. p. 301) mention a Cantharis, Meloe, Rhagium, and the Leptura testacea; the male of the latter being testaceous, with a black thorax, and the female of a dull red all over. These two latter beetles belong to the family of Longicorns. Messrs. R. Trimen and Waterhouse, jun., inform me of two Lamellicorns, viz., a Peritrichia and Trichius, the male of the latter being more obscurely coloured than the female. In Tillus elongatus the male is black, and the female always, as it is believed, of a dark blue colour, with a red thorax. The male, also, of Orsodacna atra, as I hear from Mr. Walsh, is black, the female (the so-called O. ruficollis) having a rufous thorax., 455345=12 'Hereditary Genius,' 1870, pp. 132-140., 575893=19 Prof. Nägeli has carefully described several striking cases in his 'Botanische Mittheilungen,' B. ii. 1866, s. 294-369. Prof. Asa Gray has made analogous remarks on some intermediate forms in the Compositæ of N. America., 914529=32 'Proc. Boston Soc. of Nat. Hist.' vol. xi. April, 1868., 324250=70 Quoted by C. S. Wake, 'Chapters on Man,' 1868, p. 101., 603529=to 1858, the decrease was 19.42 per cent. Some of the tribes, thus carefully examined, lived above a hundred miles apart, some on the coast, some inland; and their means of subsistence and habits differed to a certain extent (p. 28). The total number in 1858 was believed to be 53,700, and in 1872, after a second interval of fourteen years, another census was taken, and the number is given as only 36,359, shewing a decrease of 32.29 per cent.!41 Mr. Fenton, after shewing in detail the insufficiency of the various causes, usually assigned in explanation of this extraordinary decrease, such as new diseases, the profligacy of the women, drunkenness, wars, &c., concludes on weighty grounds that it depends chiefly on the unproductiveness of the women, and on the extraordinary mortality of the young children (pp. 31, 34). In proof of this he shews (p. 33) that in 1844 there was one non-adult for every 2.57 adults; whereas in 1858 there was only one non-adult for every 3.27 adults. The mortality of the adults is also great. He adduces as a further cause of the decrease the inequality of the sexes; for fewer females are born than males. To this latter point, depending perhaps on a widely distinct cause, I shall return in a future chapter. Mr. Fenton contrasts with astonishment the decrease in New Zealand with the increase in Ireland; countries not very dissimilar in climate, and where the inhabitants now follow nearly similar habits. The Maories themselves (p. 35) \"attribute their decadence, in some measure, to the introduction of new food and clothing, and the attendant change of habits;\" and it will be seen, when we consider the influence of changed conditions on fertility, that they are probably right. The diminution began between the years 1830 and 1840; and Mr. Fenton shews (p. 40) that about 1830, the art of manufacturing putrid corn (maize), by long steeping in water, was discovered and largely practised; and this proves that a change of habits was beginning amongst the natives, even when New Zealand was only thinly inhabited by Europeans. When I visited the Bay of Islands in 1835, the dress and food of the inhabitants had already been much modified: they raised potatoes, maize, and other agricultural produce, and exchanged them for English manufactured goods and tobacco., 484561=37 Dr. F. Müller has made some good remarks to this effect in the 'Reise der Novara: Anthropolog. Theil,' Abtheil. iii. 1868 s. 127., 722684=21 Prof. Sachs ('Lehrbuch der Botanik,' 1870, s. 633) in speaking of the male and female reproductive cells, remarks, \"verhält sich die eine bei der Vereinigung activ...die andere erscheint bei der Vereinigung passiv.\", 905107=19 'Modern Classification of Insects,' vol. ii. 1840, p. 526., 184483=60 'The Annals of Rural Bengal,' by W. W. Hunter, 1868, p. 259., 135477=14 Godron, 'De l'Espèce,' 1859, tom. ii. livre 3. Quatrefages, 'Unité de l'Espèce Humaine,' 1861. Also Lectures on Anthropology, given in the 'Revue des Cours Scientifiques,' 1866-1868., 572981=18 See a good discussion on this subject in Waitz, 'Introduct. to Anthropology,' Eng. translat. 1863, pp. 198-208, 227. I have taken some of the above statements from H. Tuttle's 'Origin and Antiquity of Physical Man,' Boston, 1866, p. 35., 212412=79 'Philosophical Transactions, 1869, p. 513., 123374=2 With respect to the \"Cranial forms of the American aborigines,\" see Dr. Aitken Meigs in 'Proc. Acad. Nat. Sci.' Philadelphia, May, 1868. On the Australians, see Huxley, in Lyell's 'Antiquity of Man,' 1863, p. 87. On the Sandwich Islanders, Prof. J. Wyman, 'Observations on Crania,' Boston, 1868, p. 18., 130059=12 Blumenbach, 'Treatises on Anthropolog.' Eng. translat., 1865, p. 205., 829400=90 'Proc. Ent. Soc. London,' Feb. 17, 1868., 338083=78 'Religion, Moral, &c., der Darwin'schen Art-Lehre,' 1869, s. 53. It is said (Dr. W. Lauder Lindsay, 'Journal of Mental Science,' 1871, p. 43), that Bacon long ago, and the poet Burns, held the same notion., 449572=10 For Mr. Wallace, see 'Anthropolog. Review,' as before cited. Mr. Galton in 'Macmillan's Magazine,' Aug. 1865, p. 318; also his great work, 'Hereditary Genius,' 1870., 215610=82 'Comptes-rendus des Sciences,' &c., June 1, 1868., 792913=56 Social Science Assoc. of Philadelphia, 1874., 250505=3 'The American Beaver and his Works,' 1868., 805096=67 'Ibis,' 1860, p. 137; and 1867, p. 369., 109032=49 With respect to inheritance, see Dr. Struthers in the 'Lancet,' Feb. 15, 1873, and another important paper, ibid., Jan. 24, 1863, p. 83. Dr. Knox, as I am informed, was the first anatomist who drew attention to this peculiar structure in man; see his 'Great Artists and Anatomists,' p. 63. See also an important memoir on this process by Dr. Gruber, in the 'Bulletin de l'Acad. Imp. de St. Pétersbourg,' tom. xii. 1867, p. 448., 725914=24 'Proceedings Royal Soc.' vol. xvi. July 1868, pp. 519 and 524., 670508=78 'Ueber die typische Anordnung der Furchen und Windungen auf den Grosshirn-Hemisphären des Menschen und der Affen.' 'Archiv für Anthropologie,' iii., 1868., 535101=where it is either normal and symmetrical, or abnormal and unilateral. Dr. Zouteveen has given me references on this subject, more especially to a paper by Prof. Halbertsma, in the 'Transact. of the Dutch Acad. of Sciences,' vol. xvi. Dr. Günther doubts the fact, but it has now been recorded by too many good observers to be any longer disputed. Dr. M. Lessona writes to me, that he has verified the observations made by Cavolini on Serranus. Prof. Ercolani has recently shewn ('Acad. delle Scienze,' Bologna, Dec. 28, 1871) that eels are androgynous., 905205=20 Anwendung, &c., 'Verh. d. n. V. Jahrg.' xxix. p. 80. Mayer, in 'American Naturalist,' 1874, p. 236., 256314=6 For the evidence on this head, see Mr. J. Traherne Moggridge's most interesting work, 'Harvesting Ants and Trap-door Spiders,' 1873, p. 126, 128., 596819=30 'Transact. Internat. Congress of Prehistoric Arch.' 1868, pp. 172-175. See also Broca (translation) in 'Anthropological Review,' Oct. 1868, p. 410., 446603=7 'Ancient Law,' 1861, p. 22. For Mr. Bagehot's remarks, 'Fortnightly Review' April 1, 1868, p. 452., 77=RECORD: Darwin, C. R. 1882. The descent of man, and selection in relation to sex. London: John Murray. 2nd edition, fifteenth thousand., 205943=74 Häckel has an excellent discussion on the steps by which man became a biped: 'Natürliche Schöpfungsgeschichte,' 1868, s. 507. Dr. Büchner ('Conférences sur la Théorie Darwinienne,' 1869, p. 135) has given good cases of the use of the foot as a prehensile organ by man; and has also written on the manner of progression of the higher apes, to which I allude in the following paragraph: see also Owen ('Anatomy of Vertebrates,' vol. iii p. 71) on this latter subject., 401998=33 See the very interesting discussion on Suicide in Lecky's 'History of European Morals,' vol. i, 1869, p. 223. With respect to savages, Mr. Winwood Reade informs me that the negroes of West Africa often commit suicide. It is well known how common it was amongst the miserable aborigines of South America, after the Spanish conquest. For New Zealand, see the voyage of the \"Novara,\" and for the Aleutian Islands, Müller, as quoted by Houzeau, 'Les Facultés Mentales,' &c., tom. ii. p. 136., 377774=23 Hume remarks ('An Enquiry Concerning the Principles of Morals,' edit. of 1751, p. 132), \"There seems a necessity for confessing that the happiness and misery of others are not spectacles altogether indifferent to us, but that the view of the former...communicates a secret joy; the appearance of the latter...throws a melancholy damp over the imagination.\", 722580=20 'Essays and Observations.' edited by Owen, vol. i. 1861, p. 194., 785612=49 For Norway and Russia, see abstract of Prof. Faye's researches, in 'British and Foreign Medico-Chirurg. Review,' April, 1867, pp. 343, 345. For France, the 'Annuaire pour l'An 1867,' p. 213. For Philadelphia, Dr. Stockton-Hough, 'Social Science Assoc.' 1874. For the Cape of Good Hope, Quetelet as quoted by Dr. H. H. Zouteveen, in the Dutch Translation of this work (vol. i. p. 417), where much information is given on the proportion of the sexes., 177774=54 Since the first edition of this book appeared, Mr. Wood has published another memoir in the 'Phil. Transactions,' 1870, p. 83, on the varieties of the muscles of the human neck, shoulder, and chest. He here shews how extremely variable these muscles are, and how often and how closely the variations resemble the normal muscles of the lower animals. He sums up by remarking, \"It will be enough for my purpose if I have succeeded in shewing the more important forms which, when occurring as varieties in the human subject, tend to exhibit in a sufficiently marked manner what may be considered as proofs and examples of the Darwinian principle of reversion, or law of inheritance, in this department of anatomical science.\", 771865=46 'Das Ganze der Taubenzucht,' 1837, s. 21, 24. For the case of the streaked pigeons, see Dr. Chapuis, 'Le pigeon voyageur Belge,' 1865, p. 87., 478809=31 I am much indebted to Mr. John Morley for some good criticisms on this subject: see, also, Broca, 'Les Sélections,' 'Revue d'Anthropologie,' 1872., 314708=62 Lectures on 'Mr. Darwin's Philosophy of Language,' 1873., 792044=Horses.—Mr. Tegetmeier has been so kind as to tabulate for me from the 'Racing Calendar' the births of race-horses during a period of twenty-one years, viz., from 1846 to 1867; 1849 being omitted, as no returns were that year published. The total births were 25,560,58 consisting of 12,763 males and 12,797 females, or in the proportion of 99.7 males to 100 females. As these numbers are tolerably large, and as they are drawn from all parts of England, during several years, we may with much confidence conclude that with the domestic horse, or at least with the race-horse, the two sexes are produced in almost equal numbers. The fluctuations in the proportions during successive years, 680479=2 Kirby and Spence, 'Introduction to Entomology,' vol. iii. 1826, p. 309., 66153=3 Dr. W. Lauder Lindsay has treated this subject at some length in the 'Journal of Mental Science,' July 1871; and in the 'Edinburgh Veterinary Review,' July 1858., 557565=7 'Diversity of Origin of the Human Races,' in the 'Christian Examiner,' July 1850., 997754=12 See also, on this subject, Mr. Weir's paper in 'Transact. Ent. Soc.' 1869, p. 23., 145240=29 It is a singular and unexpected fact that sailors are inferior to landsmen in their mean distance of distinct vision. Dr. B. A. Gould ('Sanitary Memoirs of the War of the Rebellion,' 1869, p. 530), has proved this to be the case; and he accounts for it by the ordinary range of vision in sailors being \"restricted to the length of the vessel and the height of the masts.\", 467027=24 I have taken the mean of the quinquennial means, given in 'The Tenth Annual Report of Births, Deaths, &c., in Scotland,' 1867. The quotation from Dr. Stark is copied from an article in the 'Daily News,' Oct. 17th, 1868, which Dr. Farr considers very carefully written., 458256=15 'Hereditary Genius,' 1870, p. 330., 896315=11 H. W. Bates, in 'Journal of Proc. Linn. Soc.' vol. vi. 1862, p. 74. Mr. Wonfor's observations are quoted in 'Popular Science Review,' 1868, p. 343., 917633=36 'Ueber der Tonapparat der Locustiden, ein Beitrag zum Darwinismus,' 'Zeitsch. für wissensch. Zoolog.' B. xxii. 1872, p. 100., 214712='Revue d'Anthropologies,' 1873; see also, as quoted in C. Vogt's 'Lectures on Man,' Eng. translat. 1864, pp. 88, 90. Prichard, 'Phys. Hist. of Mankind,' vol. i. 1838, p. 305., 1021659=27 On this whole subject see 'The Variation of Animals and Plants under Domestication,' 1868, vol. ii. chap. xxiii., 250586=4 'The Principles of Psychology, 2nd edit. 1870, pp. 418-443., 647464=69 On the odour of the skin, Godron, 'Sur l'Espèce,' tom. ii. p. 217. On the pores in the skin, Dr. Wilckens, 'Die Aufgaben der Landwirth. Zootechnik,' 1869, s. 7., 600120=35 Sproat, 'Scenes and Studies of Savage Life,' 1868, p. 284., 218079=84 Schaaffhausen gives from Blumenbach and Busch, the cases of the spasms and cicatrix, in 'Anthropolog. Review,' Oct. 1868, p. 420. Dr. Jarrold ('Anthropologia,' 1808, pp. 115, 116) adduces from Camper and from his own observations, cases of the modification of the skull from the head being fixed in an unnatural position. He believes that in certain trades, such as that of a shoemaker, where the head is habitually held forward, the forehead becomes more rounded and prominent., 744386=35 'Novæ species Quadrupedum e Glirium ordine,' 1778, p. 7. On the transmission of colour by the horse, see 'Variation of Animals, &c., under Domestication,' vol. i. p. 51. Also vol. ii. p. 71, for a general discussion on 'Inheritance as limited by Sex.', 209210=76 'On the Primitive Form of the Skull,' translated in 'Anthropological Review,' Oct. 1868, p. 428. Owen ('Anatomy of Vertebrates,' vol. ii. 1866, p. 551) on the mastoid processes in the higher apes., 570035=16 M. de Quatrefages has given ('Anthropolog. Review,' Jan. 1869, p. 22) an interesting account of the success and energy of the Paulistas in Brazil, who are a much crossed race of Portuguese and Indians, with a mixture of the blood of other races., 132325=\"With kine and horses, Kurnus! we proceed By reasonable rules, and choose a breed For profit and increase, at any price: Of a sound stock, without defect or vice. But, in the daily matches that we make, The price is everything: for money's sake, Men marry: women are in marriage given The churl or ruffian, that in wealth has thriven, May match his offspring with the proudest race: Thus everything is mix'd, noble and base! If then in outward manner, form, and mind, You find us a degraded, motley kind, Wonder no more, my friend! the cause is plain, And to lament the consequence is vain.\" (The Works of J. Hookham Frere, vol. ii. 1872, p. 334.), 979631=2 See my 'Journal of Researches, 1845, p. 33. Mr. Doubleday has detected ('Proc Ent. Soc.' March, 905020=18 'The Malay Archipelago,' vol. ii. 1869, p. 313., 630466=54 See De Quatrefages on this head, 'Revue des Cours Scientifiques,' Oct. 17, 1868, p. 731., 289471=34 'Lettres Phil. sur l'Intelligence des Animaux,' nouvelle édit. 1802, p. 86., 256498=7 'Recherches sur les Mœurs des Fourmis,' 1810, p. 173., 69231=9 With respect to insects see Dr. Laycock, \"On a General Law of Vital Periodicity,\" 'British Association,' 1842. Dr. Macculloch, 'Silliman's North American Journal of Science,' vol. xvii. p. 305, has seen a dog suffering from tertian ague. Hereafter I shall return to this subject., 759422=40 Antilocapra Americana. I have to thank Dr. Canfield for information with respect to the horns of the female: see also his paper in 'Proc. Zoolog. Soc.' 1866, p. 109. Also Owen, 'Anatomy of Vertebrates,' vol. iii. p. 627., 123214=1 'Investigations in Military and Anthropolog. Statistics of American Soldiers,' by B. A. Gould, 1869, p. 256., 184351=59 Mr. Sedgwick, 'British and Foreign Medico-Chirurg. Review,' July, 1863, p. 170., 155092=37 Prof. Laycock sums up the character of brute-like idiots by calling them theroid; 'Journal of Mental Science,' July, 1863. Dr. Scott ('The Deaf and Dumb,' 2nd edit., 1870, p. 10) has often observed the imbeciles smelling their food. See, on this same subject, and on the hairiness of idiots, Dr. Maudsley, 'Body and Mind,' 1870 pp. 46-51. Pinel has also given a striking case of hairiness in an idiot., 1021487=26 H. W. Bates, 'The Naturalist on the Amazons,' vol. ii. 1863, p. 228. A. R. Wallace, in 'Transact. Linn. Soc.' vol. xxv. 1865, p. 10., 219001=through the water; nor would it be injurious to them from the loss of warmth, as the species, which inhabit the colder regions, are protected by a thick layer of blubber, serving the same purpose as the fur of seals and otters. Elephants and rhinoceroses are almost hairless; and as certain extinct species, which formerly lived under an Arctic climate, were covered with long wool or hair, it would almost appear as if the existing species of both genera had lost their hairy covering from exposure to heat. This appears the more probable, as the elephants in India which live on elevated and cool districts are more hairy87 than those on the lowlands. May we then infer that man became divested of hair from having aboriginally inhabited some tropical land? That the hair is chiefly retained in the male sex on the chest and face, and in both sexes at the junction of all four limbs with the trunk, favours this inference—on the assumption that the hair was lost before man became erect; for the parts which now retain most hair would then have been most protected from the heat of the sun. The crown of the head, however, offers a curious exception, for at all times it must have been one of the most exposed parts, yet it is thickly clothed with hair. The fact, however, that the other members of the order of Primates, to which man belongs, although inhabiting various hot regions, are well clothed with hair, generally thickest on the upper surface,88 is opposed to the supposition that man became naked through the action of the sun. Mr. Belt believes89 that within the tropics it is an advantage to man to be destitute of hair, as he is thus enabled to free himself of the multitude of ticks (acari) and other parasites, with which he is often infested, and which sometimes cause ulceration. But whether this evil is of sufficient magnitude to have led to the denudation of his body through natural selection, may be doubted, since none of the many quadrupeds inhabiting the tropics have, as far as I know, acquired any specialised means of relief. The view which seems to me the most probable is that man, or rather primarily woman,, 670712=79 'Zur Entwickelungs Geschichte der Furchen und Windungen der Grosshirn-Hemisphären im Fœtus des Menschen.' 'Archiv für Anthropologie,' iii., 1868., 783500=48 'Twenty-ninth Annual Report of the Registrar-General for 1866.' In this report (p. xii.) a special decennial table is given., 856918=4 I have given ('Geolog. Observations on Volcanic Islands,' 1844, p. 53) a curious instance of the influence of light on the colours of a frondescent incrustation, deposited by the surf on the coast-rocks of Ascension, and formed by the solution of triturated sea-shells., 221288=88 Isidore Geoffroy St.-Hilaire remarks ('Hist. Nat. Générale,' tom. ii. 1859, pp. 215-217) on the head of man being covered with long hair; also on the upper surfaces of monkeys and of other mammals being more thickly clothed than the lower surfaces. This has likewise been observed by various authors. Prof. P. Gervais ('Hist. Nat. des Mammifères,' tom. i. 1854, p. 28), however, states that in the Gorilla the hair is thinner on the back, where it is partly rubbed off, than on the lower surface., 882976=20 Aug. Vinson ('Aranéides des Iles de la Réunion,' pl. vi. figs. 1 and 2) gives a good instance of the small size of the male, in Epeira nigra. In this species, as I may add, the male is testaceous and the female black with legs banded with red. Other even more striking cases of inequality in size between the sexes have been recorded ('Quarterly Journal of Science,' 1868, July, p. 429); but I have not seen the original accounts., 793085=58 During eleven years a record was kept of the number of mares which proved barren or prematurely slipped their foals; and it deserves notice, as shewing how infertile these highly-nurtured and rather closely-interbred animals have become, that not far from one-third of the mares failed to produce living foals. Thus during 1866, 809 male colts and 816 female colts were born, and 743 mares failed to produce offspring. During 1867, 836 males and 902 females were born, and 794 mares failed., 942747=Order, Coleoptera (Beetles).—Many beetles are coloured so as to resemble the surfaces which they habitually frequent, and they thus escape detection by their enemies. Other species, for instance diamond-beetles, are ornamented with splendid colours, which are often arranged in stripes, spots, crosses, and other elegant patterns. Such colours can hardly serve directly as a protection, except in the case of certain flower-feeding species; but they may serve as a warning or means of recognition, on the same principle as the phosphorescence of the glow-worm. As with beetles the colours of the two sexes are generally alike, we have no evidence that they have been gained through sexual selection; but this is at least possible, for they may have been developed in one sex and then transferred to the other; and this view is even in some degree probable in those groups which possess other well-marked secondary sexual characters. Blind beetles, which cannot of course behold each other's beauty, never, as I hear from Mr. Waterhouse, jun., exhibit bright colours, though they often have polished coats; but the explanation of their obscurity may be that they generally inhabit caves and other obscure stations., 765328=45 In some other species of the Duck family the speculum differs in a greater degree in the two sexes; but I have not been able to discover whether its full development occurs later in life in the males of such species, than in the male of the common duck, as ought to be the case according to our rule. With the allied Mergus cucullatus we have, however, a case of this kind: the two sexes differ conspicuously in general plumage, and to a considerable degree in the speculum, which is pure white in the male and greyish-white in the female. Now the young males at first entirely resemble the females, and have a greyish-white speculum, which becomes pure white at an earlier age than that at which the adult male acquires his other and more strongly-marked sexual differences: see Audubon, 'Ornithological Biography,' vol. iii. 1835, pp. 249-250., 171127=46 'The anatomy of Expression,' 1844, pp. 110, 131., 640963=65 See, for instance, Quatrefages ('Revue des Cours Scientifiques,' Oct. 10, 1868, p. 724) on the effects of residence in Abyssinia and Arabia, and other analogous cases. Dr. Rolle ('Der Mensch, seine Abstammung,' &c., 1865, s. 99) states, on the authority of Khanikof, that the greater number of German families settled in Georgia, have acquired in the course of two generations dark hair and eyes. Mr. D. Forbes informs me that the Quichuas in the Andes vary greatly in colour, according to the position of the valleys inhabited by them., 896502=12 'The Naturalist in Nicaragua,' 1874, pp. 316-320. On the phosphorescence of the eggs, see 'Annals and Mag. of Nat. Hist.' 1871, Nov., p. 372., 111762=50 Mr. St. George Mivart, 'Transact. Phil. Soc.' 1867, p. 310., 70564=12 This remark is made with respect to Cynocephalus and the anthropomorphous apes by Geoffroy Saint-Hilaire and F. Cuvier, 'Hist. Nat. des Mammifères,' tom. i. 1824., 713719=16 'The Ibis,' vol. iii. 1861, p. 133, on the Progne Widow-bird. See also on the Vidua axillaris, ibid. vol. ii. 1860, p. 211. On the polygamy of the Capercailzie and Great Bustard, see L. Lloyd, 'Game Birds of Sweden,' 1867, p. 19, and 182. Montagu and Selby speak of the Black Grouse as polygamous and of the Red Grouse as monogamous., 193094=65 Messrs. Murie and Mivart in their 'Anatomy of the Lemuroidea' ('Transact. Zoolog. Soc.' vol. vii. 1869, pp. 96-98) say, \"some muscles are so irregular in their distribution that they cannot be well classed in any of the above groups.\" These muscles differ even on the opposite sides of the same individual., 889469=2 These organs in the male often differ in closely-allied species, and afford excellent specific characters. But their importance, from a functional point of view, as Mr. R. MacLachlan has remarked to me, has probably been overrated. It has been suggested, that slight differences in these organs would suffice to prevent the intercrossing of well-marked varieties or incipient species, and would thus aid in their development. That this can hardly be the case, we may infer from the many recorded cases (see, for instance, Bronn, 'Geschichte der Natur,' B. ii. 1843, s. 164; and Westwood, 'Transact. Ent. Soc.' vol. iii. 1842, p. 195) of distinct species having been observed in union. Mr. MacLachlan informs me (vide 'Stett. Ent. Zeitung,' 1867, s. 155) that when several species of Phryganidæ, which present strongly-pronounced differences of this kind, were confined together by Dr. Aug. Meyer, they coupled, and one pair produced fertile ova., 9867=September, 1874., 292726=39 The 'Indian Field,' March 4, 1871., 250391=2 'L'Instinct chez les Insectes,' 'Revue des Deux Mondes,' Feb. 1870, p. 690., 1000190=13 'Westminster Review,' July 1867, p. 16., 914624=33 'Nouveau Manuel d'Anat. Comp.' (French translat.), tom. i 1850, p. 567., 618971=45 On the close relationship of the Norfolk Islanders, see Sir W. Denison, 'Varieties of Vice-Regal Life,' vol. i., 1870, p. 410. For the Todas, see Col. Marshall's work, 1873, p. 110. For the Western Islands of Scotland, Dr. Mitchell, 'Edinburgh Medical Journal,' March to June, 1865., 452458=11 Prof. H. Fick ('Einfluss de Naturwissenschaft auf das Recht,' June, 1872) has some good remarks on this head, and on other such points., 67274=7 Brehm, 'Thierleben,' B. i. 1864, s. 75, 86. On the Ateles, s. 105. For other analogous statements, see s. 25, 107., 314804=63 The judgment of a distinguished philologist, such as Prof. Whitney, will have far more weight on this point than anything that I can say. He remarks ('Oriental and Linguistic Studies,' 1873, p. 297), in speaking of Bleek's views: \"Because on the grand scale language is the necessary auxiliary of thought, indispensable to the development of the power of, 91170=31 Mr. St. George Mivart, 'Elementary Anatomy,' 1873, p. 396., 792997=57 'Anthropological Review,' April, 1870, p. cviii., 874440=14 'Travels in the Interior of Brazil,' 1846, p. 111. I have given, in my 'Journal of Researches,' p. 463, an account of the habits of the Birgus., 804891=66 'Ibis,' vol. ii. p. 260, as quoted in Gould's 'Trochilidæ,' 1861, p. 52. For the foregoing proportions, I am indebted to Mr. Salvin for a table of his results., 782489=Man.—In England during ten years (from 1857 to 1866) the average number of children born alive yearly was 707,120, in the proportion of 104.5 males to 100 females. But in 1857 the male births throughout England were as 105.2, and in 1865 as 104.0 to 100. Looking to separate districts, in Buckinghamshire (where about 5000 children are annually born) the mean proportion of male to female births during the whole period of the above ten years, was as 102.8 to 100, whilst in N. Wales (where the average annual births are 12,873) it was as high as 106.2 to 100. Taking a still smaller district, viz., Rutlandshire (where the annual births average only 739), in 1864 the male births were as 114.6, and in 1862 as only 97.0 to 100; but even in this small district the average of the 7385 births during the whole ten years, was as 104.5 to 100; that is in the same ratio as throughout England.48 The proportions are sometimes slightly disturbed by unknown causes; thus Prof., 729149=30 For mankind, see Dr. J. Stockton Hough, whose conclusions are given in the 'Pop. Science Review,' 1874, p. 97. See Girard's observations on the Lepidoptera, as given in the 'Zoological Record,' 1869, p. 347., 336092=77 See an able article on the 'Physical Elements of Religion,' by Mr. L. Owen Pike, in 'Anthropolog. Review,' April, 1870, p. lxiii., 425901=49 See his remarkable work on 'Hereditary Genius,' 1869, p. 349. The Duke of Argyll ('Primeval Man,' 1869, p. 188) has some good remarks on the contest in man's nature between right and wrong., 111861=51 \"On the Caves of Gibraltar,\" 'Transact. Internat. Congress of Prehist. Arch.' Third Session, 1869, p. 159. Prof. Wyman has lately shewn (Fourth Annual Report, Peabody Museum, 1871, p. 20), that this perforation is present in thirty-one per cent. of some human remains from ancient mounds in the Western United States, and in Florida. It frequently occurs in the negro., 680589=3 'Birds of New Zealand.' 1872, p. 66., 504977=9 On the hair in Hylobates, see 'Nat. Hist. of Mammals,' by C. L. Martin, 1841, p. 415. Also, Isid. Geoffroy on the American monkeys and other kinds, 'Hist. Nat. Gén.' vol. ii. 1859, p. 216, 243, Eschricht, ibid. s. 46, 55, 61. Owen, 'Anat. of Vertebrates,' vol. iii. p. 619. Wallace, Contributions to the Theory of Natural Selection,' 1870, p. 344., 417225=43 Good instances are given by Mr. Wallace in 'Scientific Opinion,' Sept. 15, 1869; and more fully in his 'Contributions to the Theory of Natural Selection,' 1870, p. 353., 713620=15 The Eared Seals, 'American Naturalist.' vol. iv. Jan. 1871., 602404=The decrease of the Maories of New Zealand has been carefully investigated by Mr. Fenton, in an admirable Report, from which all the following statements, with one exception, are taken.40 The decrease in number since 1830 is admitted by every one, including the natives themselves, and is still steadily progressing. Although it has hitherto been found impossible to take an actual census of the natives, their numbers were carefully estimated by residents in many districts. The result seems trustworthy, and shows that during the fourteen years, previous, 811759=73 Yarrell, 'Hist. British Fishes.' vol. i. 1826, p. 307; on the Cyprinus carpio, p. 331; on the Tinca vulgaris, p. 331; on the Abramis brama, p. 336. See, for the minnow (Leuciscus phoxinus), 'Loudon's Mag. of Nat. Hist.' vol. v. 1832, p. 682., 982575=3rd, 1845, p. 123) a peculiar membranous sac at the base of the front wings, which is probably connected with the production of the sound. For the case of Thecophora, see 'Zoological Record,' 1869, p. 401. For Mr. Buchanan White's observations, 'The Scottish Naturalist,' July 1872, p. 214., 463800=20 'On the Laws of the Fertility of Women,' in 'Transact. Royal Soc.,' Edinburgh, vol. xxiv. p. 287; now published separately under the title of 'Fecundity, Fertility, and Sterility,' 1871. See, also, Mr. Galton, \"Hereditary Genius,' pp. 352-357, for observations to the above effect., 302177=46 The Rev. Dr. J. M'Cann, 'Anti-Darwinism,' 1869, p. 13., 528745=25 But I am bound to add that some competent judges dispute this conclusion; for instance, M. Giard, in a series of papers in the 'Archives de Zoologie Expérimentale,' for 1872. Nevertheless, this naturalist remarks, p. 281, \"L'organisation de la larve ascidienne en dehors de toute hypothèse et de toute théorie, nous montre comment la nature peut produire la disposition fondamentale du type vertébré (l'existence d'une corde dorsale) chez un invertébré par la seule condition vitale de l'adaptation, et cette simple possibilité du passage supprime l'abîme entre les deux sous-règnes, encore bien qu'en ignore par où le passage s'est fait en réalité.', 829228=89 'Observations on N. American Neuroptera,' by H. Hagen and B. D. Walsh, 'Proc. Ent. Soc. Philadelphia,' Oct. 1863, pp. 168, 223, 239., 600218=36 Bagehot, 'Physics and Politics,' 'Fortnightly Review,' April 1, 1868, p. 455., 985752=5 See also Mr. Bates's paper in 'Proc. Ent. Soc. of Philadelphia,' 1865, p. 206. Also Mr. Wallace on the same subject, in regard to Diadema, in 'Transact. Entomolog. Soc. of London,' 1869, p. 278., 795254=Sheep.—The sexes of sheep are not ascertained by agriculturists until several months after birth, at the period when the males are castrated; so that the following returns do not give the proportions at birth. Moreover, I find that several great breeders in Scotland, who annually raise some thousand sheep, are firmly convinced that a larger proportion of males than of females die during the first year or two. Therefore the proportion of males would be somewhat larger at birth than at the age of castration. This is a remarkable coincidence with what, as we have seen, occurs with mankind, and both cases probably depend on the same cause. I have received returns from four gentlemen in England who have bred Lowland sheep, chiefly Leicesters, during the last ten to sixteen years; they amount altogether to 8965 births, consisting of 4407 males and 4558 females; that is in the proportion of 96.7 males to 100 females. With respect to Cheviot and black-faced sheep bred in Scotland, I have received returns from six breeders, two of them on a large scale, chiefly for the years 1867-1869, but some of the returns extend back to 1862. The total number recorded amounts of 50,685, consisting of 25,071 males and 25,614 females, or in the proportion of 97.9 males to 100 females. If we take the English and Scotch returns together, the total number amounts to 59,650, consisting of 29,478 males and 30,172 females, or as 97.7 to 100. So that with sheep at the age of castration the females are certainly in excess of the males, but probably this would not hold good at birth.59, 141839=20 Dr. Brakenridge, 'Theory of Diathesis,' 'Medical Times,' June 19 and July 17, 1869., 324177=69 'Nature,' Jan. 6th, 1870, p. 257., 343327=5 Sir B. Brodie, after observing that man is a social animal ('Psychological Enquiries,' 1854, p. 192), asks the pregnant question, \"ought not this to settle the disputed question as to the existence of a moral sense?\" Similar ideas have probably occurred to many persons, as they did long ago to Marcus Aurelius. Mr. J. S. Mill speaks, in his celebrated work, 'Utilitarianism,' (1864, pp. 45, 46), of the social feelings as a \"powerful natural sentiment,\" and as \"the natural basis of sentiment for utilitarian morality.\" Again he says, \"Like the other acquired capacities above referred to, the moral faculty, if not a part of our nature, is a natural out-growth from it; capable, like them, in a certain small degree of springing up spontaneously.\" But in opposition to all this, he also remarks, \"if, as is my own belief, the moral feelings are not innate, but acquired, they are not for that reason less natural.\" It is with hesitation that I venture to differ at all from so profound a thinker, but it can hardly be disputed that the social feelings are instinctive or innate in the lower animals; and why should they not be so in man? Mr. Bain (see, for instance, 'The Emotions and the Will,' 1865, p. 481) and others believe that the moral sense is acquired by each individual during his lifetime. On the general theory of evolution this is at least extremely improbable. The ignoring of all transmitted mental qualities will, as it seems to me, be hereafter judged as a most serious blemish in the works of Mr. Mill., 282901=26 Mr. Belt, in his most interesting work, 'The Naturalist in Nicaragua,' 1874 (p. 119), likewise describes various actions of a tamed Cebus, which, I think, clearly shew that this animal possessed some reasoning power., 489973=1 Isidore Geoffroy St.-Hilaire gives a detailed account of the position assigned to man by various naturalists in their classifications: 'Hist. Nat. Gén.' tom. ii. 1859, pp. 170-189., 69127=8 Dr. W. Lauder Lindsay, 'Edinburgh Vet. Review,' July 1858, p. 13., 932813=52 'Transact. Ent. Soc.' vol. i. 1836, p. lxxxi., 126454=5 'Proc. Royal Soc.' 1867, p. 544; also 1868, pp. 483, 524. There is a previous paper 1866, p. 229., 707842=11 Pallas, 'Spicilegia Zoolog., Fasc. xii. 1777, p. 29. Sir Andrew Smith, 'Illustrations of the Zoology of S. Africa,' 1849, pl. 29, on the Kobus. Owen, in his 'Anatomy of Vertebrates' (vol. iii. 1868, p. 633) gives a table shewing incidentally which species of antelopes are gregarious., 190330=63 See some good remarks to this effect by W. Stanley Jevons, \"A Deduction from Darwin's Theory,\" 'Nature,' 1869, p. 231., 531864=26 This is the conclusion of Prof. Gegenbaur, one of the highest authorities in comparative anatomy: see 'Grundzüge der vergleich. Anat.' 1870, s. 876. The result has been arrived at chiefly from the study of the Amphibia; but it appears from the researches of Waldeyer (as quoted in 'Journal of Anat. and Phys.' 1869, p. 161), that the sexual organs of even \"the higher vertebrata are, in their early condition, hermaphrodite.\" Similar views have long been held by some authors, though until recently without a firm basis., 78235=16 Prof. Wyman in 'Proc. of American Acad. of Sciences,' vol. iv. 1860, p. 17., 363267=20 See his extremely interesting paper on 'Gregariousness in Cattle, and in Man,' 'Macmillan's Mag.' Feb. 1871, p. 353., 836000=are not large, and as the census was not accurate, uniform results cannot be expected. It should be borne in mind in this and the following cases, that the normal state of every population is an excess of women, at least in all civilised countries, chiefly owing to the greater mortality of the male sex during youth, and partly to accidents of all kinds later in life. In 1858, the native population of New Zealand was estimated as consisting of 31,667 males and 24,303 females of all ages, that is in the ratio of 130.3 males to 100 females. But during this same year, and in certain limited districts, the numbers were ascertained with much care, and the males of all ages were here 753 and the females 616; that is in the ratio of 122.2 males to 100 females. It is more important for us that during this same year of 1858, the non-adult males within the same district were found to be 178, and the non-adult females 142, that is in the ratio of 125.3 to 100. It may be added that in 1844, at which period female infanticide had only lately ceased, the non-adult males in one district were 281, and the non-adult females only 194, that is in the ratio of 144.8 males to 100 females., 890468=3 'The Practical Entomologist,' Philadelphia, vol. ii. May, 1867, p. 88., 292643=38 'Saugethiere von Paraguay,' 1830, s. 51-56., 499290=4 'Proc. Zoolog. Soc.' 1863, p. 4., 147285=The Quechua Indians inhabit the lofty plateaux of Peru; and Alcide d'Orbigny states33 that, from continually breathing a highly rarefied atmosphere, they have acquired chests and lungs of extraordinary dimensions. The cells, also, of the lungs are larger and more numerous than in Europeans. These observations have been doubted, but Mr. D. Forbes carefully measured many Aymaras, an allied race, living at the height of between 10,000 and 15,000 feet; and he informs me34 that they differ conspicuously from the men of all other races seen by him in the circumference and length of their bodies. In his table of measurements, the stature of each man is taken at 1000, and the other measurements are reduced to this standard. It is here seen that the extended arms of the Aymaras are shorter than those of Europeans, and much shorter than those of Negroes. The legs are likewise shorter; and they present this remarkable peculiarity, that in every Aymara measured, the femur is actually shorter than the tibia. On an average, the length of the femur to that of the tibia is as 211 to 252; whilst in two Europeans, measured at the same time, the femora to the tibiæ were as 244 to 230; and in three Negroes as 258 to 241. The humerus is likewise shorter relatively to the forearm. This shortening of that part of the limb which is nearest to the body, appears to be, as suggested to me by Mr. Forbes, a case of compensation in, 275=REVISION HISTORY: Scanned and OCRed by John van Wyhe 5.2007, proofread and corrected by Sue Asscher 8.2007. RN2, 991655=7 See the interesting article in the 'Westminster Review,' July 1867, p. 10. A woodcut of the Kallima is given by Mr. Wallace in 'Hardwicke's Science Gossip,' Sept. 1867, p. 196., 195439=67 'Quarterly Review,' April 1869, p. 392. This subject is more fully discussed in Mr. Wallace's 'Contributions to the Theory of Natural Selection,' 1870, in which all the essays referred to in this work are republished. The 'Essay on Man' has been ably criticised by Prof. Claparède, one of the most distinguished zoologists in Europe, in an article published in the 'Bibliothèque Universelle,' June 1870. The remark quoted in my text will surprise every one who has read Mr. Wallace's celebrated paper on 'The origin of Human Races deduced from the Theory of Natural Selection,' originally published in the 'Anthropological Review,' May 1864, p. clviii. I cannot here resist quoting a most just remark by Sir J. Lubbock ('Prehistoric Times,' 1865, p. 479) in reference to this paper, namely, that Mr. Wallace, \"with characteristic unselfishness, ascribes it (i. e. the idea of natural selection) unreservedly to Mr. Darwin, although, as is well known, he struck out the idea independently, and published it, though not with the same elaboration, at the same time.\", 838802=98 This is given in the Rev. H. T. Cheever's 'Life in the Sandwich Islands,' 1851, p. 277., 762109=42 I am greatly indebted to Prof. Victor Carus for having made enquiries for me, from the highest authorities, with respect to the merino sheep of Saxony. On the Guinea coast of Africa there is, however, a breed of sheep in which, as with merinos, the rams alone bear horns; and Mr. Winwood Reade informs me that in one case observed by him, a young ram, born on Feb. 10th, first shewed horns on March 6th, so that in this instance, in conformity with rule, the development of the horns occurred at a later period of life than in Welsh sheep, in which both sexes are horned., 1000269=14 For instance, Lithosia; but Prof. Westwood ('Modern Class. of Insects,' vol. ii. p. 390) seems surprised at this case. On the relative colours of diurnal and nocturnal Lepidoptera, see ibid. pp. 333 and 392; also Harris, 'Treatise on the Insects of New England,' 1842, p. 315., 479002=32 'On the Origin of Civilisation,' 'Proc. Ethnological Soc.,' Nov. 26, 1867., 962138=73 Wollaston, 'On certain Musical Curculionidæ,' 'Annals and Mag. of Nat. Hist.' vol. vi. 1860, p. 14., 856787=3 See, for instance, the account which I have given in my 'Journal of Researches,' 1845, p. 7., 899390=13 Robinet, 'Vers à Soie,' 1848, p. 207., 212107=78 Dujardin, 'Annales des Sc. Nat.' 3rd series Zoolog. tom. xiv. 1850, p. 203. See also Mr. Lowne, 'Anatomy and Phys. of the Musca vomitoria,' 1870, p. 14. My son, Mr. F. Darwin, dissected for me the cerebral ganglia of the Formica rufa., 295944=42 'Primeval Man,' 1869, pp. 145, 147., 108746=48 M. C. Martins (\"De l'Unité Organique,\" in 'Revue des Deux Mondes,' June 15, 1862, p. 16), and Häckel ('Generelle Morphologie,' B. ii. s. 278), have both remarked on the singular fact of this rudiment sometimes causing death., 994686=8 Mr. G. Fraser, in 'Nature,' April 1871, p. 489., 896069=10 E. Doubleday, 'Annals and Mag. of Nat. Hist.' vol. i. 1848, p. 379. I may add that the wings in certain Hymenoptera (see Shuckard, 'Fossorial Hymenop.' 1837, pp. 39-43) differ in neuration according to sex., 239849=96 'Primeval Man,' 1869, p. 66., 603304=40 'Observations on the Aboriginal Inhabitants of New Zealand,' published by the Government, 1859., 633886=61 In the spring of 1862 I obtained permission from the Director-General of the Medical department of the Army, to transmit to the surgeons of the various regiments on foreign service a blank table, with the following appended remarks, but I have received no returns. \"As several well-marked cases have been recorded with our domestic animals of a relation between the colour of the dermal appendages and the constitution; and it being notorious that there is some limited degree of relation between the colour of the races of man and the climate inhabited by them; the following investigation seems worth consideration. Namely, whether there is any relation in Europeans between the colour of their hair, and their liability to the diseases of tropical countries. If the surgeons of the several regiments, when stationed in unhealthy tropical districts, would be so good as first to count, as a standard of comparison, how many men, in the force whence the sick are drawn, have dark and light-coloured hair, and hair of intermediate or doubtful tints; and if a similar account were kept by the same medical gentle-, 66353=4 A Reviewer has criticised ('British Quarterly Review,' Oct. 1st, 1871, p. 472) what I have here said with much severity and contempt; but as I do not use the term identity, I cannot see that I am greatly in error. There appears to me a strong analogy between the same infection or contagion producing the same result, or one closely similar, in two distinct animals, and the testing of two distinct fluids by the same chemical reagent., 630594=55 Livingstone's 'Travels and Researches in S. Africa,' 1857, pp. 338, 329. D'Orbigny, as quoted by Godron, 'De l'Espèce,' vol. ii. p. 266., 466617=22 These quotations are taken from our highest authority on such questions, namely, Dr. Farr, in his paper 'On the Influence of Marriage on the Mortality of the French People,' read before the Nat. Assoc. for the Promotion of Social Science, 1858., 311517=56 Vogt, 'Mémoire sur les Microcéphales,' 1867, p. 169. With respect to savages, I have given some facts in my 'Journal of Researches,' &c., 1845, p. 206., 554529=6 As quoted by Nott and Gliddon, 'Types of Mankind,' 1854, p. 439. They give also corroborative evidence; but C. Vogt thinks that the subject requires further investigation., 941241=61 M. Perrier in his article 'la Sélection sexuelle d'après Darwin' ('Revue Scientifique,' Feb. 1873, p. 868), without apparently having reflected much on the subject, objects that as the males of social bees are known to be produced from unfertilised ova, they could not transmit new characters to their male offspring. This is an extraordinary objection. A female bee fertilised by a male, which presented some character facilitating the union of the sexes, or rendering him more attractive to the female, would lay eggs which would produce only females; but these young females would next year produce males; and will it be pretended that such males would not inherit the characters of their male grandfathers? To take a case with ordinary animals as nearly parallel as possible: if a female of any white quadruped or bird were crossed by a male of a black breed, and the male and female offspring were paired together, will it be pretended that the grandchildren would not inherit a tendency to blackness from their male grandfather? The acquirement of new characters by the sterile worker-bees is a much more difficult case, but I have endeavoured to show in my 'Origin of Species,' how these sterile beings are subjected to the power of natural selection., 202330=70 'Quarterly Review,' April 1869, p. 392., 174833=53 The Rev. Dr. Haughton, after giving ('Proc. R. Irish Academy' June 27, 1864, p. 715) a remarkable case of variation in the human flexor pollicis longus, adds, \"This remarkable example shews that man may sometimes possess the arrangement of tendons of thumb and fingers characteristic of the macaque; but whether such a case should be regarded as a macaque passing upwards into a man, or a man passing downwards into a macaque, or as a congenital freak of nature, I cannot undertake to say.\" It is satisfactory to hear so capable an anatomist, and so embittered an opponent of evolutionism, admitting even the, 383868=26 I have given one such case, namely of three Patagonian Indians who preferred being shot, one after the other, to betraying the plans of their companions in war ('Journal of Researches,' 1845, p. 103)., 829134=88 'Die Strich, Zug oder Wanderheuschrecke,' 1828, p. 20., 627621=49 'On Anthropology,' translation 'Anthropolog. Review,' Jan. 1868, p. 38., 805357=With Fish the proportional numbers of the sexes can be ascertained only by catching them in the adult or nearly adult state; and there are many difficulties in arriving at any just conclusion.69 Infertile females might readily be mistaken for males, as Dr. Günther has remarked to me in regard to trout. With some species the males are believed to die soon after fertilising the ova. With many species the males are of much smaller size than the females, so that a large number of males would escape from the same net by which the females were caught. M. Carbonnier,70 who has especially attended to the natural history of the pike (Esox lucius), states that many males, owing to their small size, are devoured by the larger females; and he believes that the males of almost all fish are exposed from this same cause to greater danger than the females. Nevertheless, in the few cases in which the proportional numbers have been actually observed, the males appear to be largely in excess. Thus Mr. R. Buist, the superintendent of the Stormontfield experiments, says that in 1865, out of 70 salmon first landed for the purpose of obtaining the ova, upwards of 60 were males. In 1867 he again \"calls attention to the vast disproportion of the males to the females. We had at the outset at least ten males to one female.\" Afterwards females sufficient for obtaining ova were procured. He adds, \"from the great proportion of the males, they are constantly fighting and tearing each other on the spawning-beds.\"71 This disproportion, no doubt, can be accounted for in part, but whether wholly is doubtful, by the males ascending the rivers before the females. Mr. F. Buckland remarks in regard to trout, that \"it is a curious fact that the males preponderate very largely in number over the females. It invariably happens that when the first rush of fish is made to the net, there will be at least seven or eight males to one female found captive. I cannot quite account for this; either the males are more numerous than the females, or the latter seek safety by concealment rather than flight.\" He then adds, that by carefully searching the banks, sufficient females for obtaining ova can be found.72 Mr. H. Lee informs me that out of 212 trout, taken for this purpose in Lord Portsmouth's park, 150 were males and 62 females., 801322=that in Scandinavia the broods of the capercailzie and black-cock contain more males than females; and that with the Dal-ripa (a kind of ptarmigan) more males than females attend the leks or places of courtship; but this latter circumstance is accounted for by some observers by a greater number of hen birds being killed by vermin. From various facts given by White of Selborne,64 it seems clear that the males of the partridge must be in considerable excess in the south of England; and I have been assured that this is the case in Scotland. Mr. Weir on enquiring from the dealers, who receive at certain seasons large numbers of ruffs (Machetes pugnax), was told that the males are much the more numerous. This same naturalist has also enquired for me from the birdcatchers, who annually catch an astonishing number of various small species alive for the London market, and he was unhesitatingly answered by an old and trustworthy man, that with the chaffinch the males are in large excess: he thought as high as 2 males to 1 female, or at least as high as 5 to 3.65 The males of the blackbird, he likewise maintained, were by far the more numerous, whether caught by traps or by netting at night. These statements may apparently be trusted, because this same man said that the sexes are about equal with the lark, the twite (Linaria montana), and goldfinch. On the other hand, he is certain that with the common linnet, the females preponderate greatly, but unequally during different years; during some years he has found the females to the males as four to one. It should, however, be borne in mind, that the chief season for catching birds does not begin till September, so that with some species partial migrations may have begun, and the flocks at this period often consist of hens alone. Mr. Salvin paid particular attention to the sexes of the humming-birds in Central America, and he is convinced that with most of the species the males are in excess; thus one year he procured 204 specimens belonging to ten species, and these consisted of 166 males and of only 38 females. With two other species the females were in excess: but the proportions apparently vary either during different seasons or in different localities; for on one occasion the males of Campylopterus hemileucurus were to the females as 5 to 2, and on another occasion66 in exactly the reversed ratio. As bearing on this latter point, I may add, that Mr. Powys found in Corfu and Epirus the sexes of the chaffinch keeping apart, and \"the females by far the most numerous;\" whilst in Palestine Mr. Tristram found \"the male flocks appearing greatly to exceed the female in number.\"67 So again with the Quiscalus major, Mr. G. Taylor68 says, that in Florida there were \"very few females in proportion to the males,\" whilst in Honduras the proportion was the other way, the species there having the character of a polygamist., 265649=14 Dr. Bateman 'On Aphasia,' 1870, p. 110., 711096=14 See Dr. Dobson's excellent paper in 'Proc. Zoolog. Soc.' 1873- p. 241., 638223=63 'Man a Special Creation,' 1873, p. 119., 939065=58 P. Huber, 'Recherches sur les Mœurs des Fourmis,' 1810, pp. 150, 165., 253774=5 'Contributions to the Theory of Natural Selection,' 1870, p. 212., 517319=18 'Anthropological Review,' April, 1867, p. 236., 893091=6 We have here a curious and inexplicable case of dimorphism, for some of the females of four European species of Dytiscus, and of certain species of Hydroporus, have their elytra smooth; and no intermediate gradations between the sulcated or punctured, and the quite smooth elytra have been observed. See Dr. H. Schaum, as quoted in the 'Zoologist,' vol. v.-vi. 1847-48, p. 1896. Also Kirby and Spence, 'Introduction to Entomology,' vol. iii. 1826, p. 305., 817834=Mr. Doubleday has called my attention to M. Staudinger's82 list of Lepidoptera, which gives the prices of the males and females of 300 species or well-marked varieties of butterflies (Rhopalocera). The prices for both sexes of the very common species are of course the same; but in 114 of the rarer species they differ; the males being in all cases, excepting one, the cheaper. On an average of the prices of the 113 species, the price of the male to that of the female is as 100 to 149; and this apparently indicates that inversely the males exceed the females in the same proportion. About 2000 species or varieties of moths (Heterocera) are catalogued, those with wingless females being here excluded on account of the difference in habits between the two sexes: of these 2000 species, 141 differ in price according to sex, the males of 130 being cheaper, and those of only 11 being dearer than the females. The average price of the males of the 130 species, to that of the females, is as 100 to 143. With respect to the butterflies in this priced list, Mr. Doubleday thinks (and no man in England has had more experience), that there is nothing in the habits of the species which can account for the difference in the prices of the two sexes, and that it can be accounted for only by an excess in the number of the males. But I am bound to add that Dr. Staudinger informs me, that he is himself of a different opinion. He thinks that the less active habits of the females and the earlier emergence of the males will account for his collectors securing a larger number of males than of females, and consequently for the lower prices of the former. With respect to specimens reared from the caterpillar-state, Dr. Staudinger believes, as previously stated, that a greater number of females than of males die whilst confined in the cocoons. He adds that with certain species one sex seems to preponderate over the other during certain years., 514026=16 Häckel has come to this same conclusion. See 'Ueber die Entstehung des Menschengeschlechts,' in Virchow's 'Sammlung. gemein. wissen. Vorträge,' 1868, s. 61. Also his 'Natürliche Schöpfungsgeschichte,' 1868, in which he gives in detail his views on the genealogy of man., 193463=66 Limits of Natural Selection, 'North American Review,' Oct. 1870, p. 295., 665553=77 Gratiolet's words are (l. c. p. 39): \"Dans le fœtus dont il s'agit les plis cérébraux postérieurs sont bien développés, tandis que les plis du lobe frontal sont à peine indiqués.\" The figure, however (Pl. iv. fig. 3), shews the fissure of Rolando, and one of the frontal sulci, plainly enough. Nevertheless, M. Alix, in his 'Notice sur les travaux anthropologiques de Gratiolet' (Mém. de la Société d'Anthropologie de Paris,' 1868, page 32.), writes thus: \"Gratiolet a eu entre les mains le cerveau d'un fœtus de Gibbon, singe éminemment supérieur, et tellement rapproché de l'orang, que des naturalistes très-compétents l'ont rangé parmi les anthropoïdes. M. Huxley, par exemple, n'hésite pas sur ce point. Eh bien, c'est sur le cerveau d'un fœtus de Gibbon que Gratiolet a vu les circonvolutions du lobe temporo-sphénoidal déjà développées lorsqu'il n'existent pas encore de plis sur le lobe frontal. Il était donc bien autorisé à dire que, chez l'homme les circonvolutions apparaissent d'a en ω, tandis que chez les singes elles se développent d'ω en α.\", 332315=76 Tylor, 'Early History of Mankind,' 1865, p. 6. See also the three striking chapters on the Development of Religion, in Lubbock's 'Origin of Civilisation,' 1870. In a like manner Mr. Herbert Spencer, in his ingenious essay in the 'Fortnightly Review' (May 1st, 1870, p. 535), accounts for the earliest forms of religious belief throughout the world, by man being led through dreams, shadows, and other causes, to look at himself as a double essence, corporeal and spiritual. As the spiritual being is supposed to exist after death and to be powerful, it is propitiated by various gifts and ceremonies, and its aid invoked. He then further shews that names or nicknames given from some animal or other object, to the early progenitors or founders of a tribe, are supposed after a long interval to represent the real progenitor of the tribe; and such animal or object is then naturally believed still to exist as a spirit, is held sacred, and worshipped as a god. Nevertheless I cannot but suspect that there is a still earlier and ruder stage, when, 115453=53 Owen, 'On the Nature of Limbs,' 1849, p. 114., 832461=91 Another great authority with respect to this class, Prof. Thorell of Upsala ('On European Spiders,' 1869-70, part i. p. 205), speaks as if female spiders were generally commoner than the males., 1003464=16 See Mr. Wormald on this moth: 'Proc. Ent. Soc.' March 2nd, 1868., 578862=21 See Prof. Huxley to this effect in the 'Fortnightly Review,' 1865, p. 275., 296019=43 'Prehistoric Times,' 1865, p. 473, &c., 982961=4 'Zoological Record,' 1869, p. 347., 758782=39 I am much obliged to Mr. Cupples for having made enquiries for me in regard to the Roebuck and Red Deer of Scotland from Mr. Robertson, the experienced head-forester to the Marquis of Breadalbane. In regard to Fallow-deer, I have to thank Mr. Eyton and others for information. For the Cervus alces of N. America, see 'Land and Water,' 1868, pp. 221 and 254; and for the C. Virginianus and strongyloceros of the same continent, see J. D. Caton, in 'Ottawa Acad. of Nat. Sc. 1868, p. 13. For Cervus Eldi of Pegu, see Lieut. Beaven, 'Proc. Zoolog. Soc.' 1867, p. 762., 600335=37 All the statements here given are taken from 'The last of the Tasmanians,' by J. Bonwick, 1870., 218792=86 Quoted by Schaaffhausen, in 'Anthropolog. Review,' Oct. 1868, p. 419., 274363=21 'Facultés Mentales des Animaux,' 1872, tom. ii. p. 181., 793705=are closely like those which occur with mankind, when a small and thinly-populated area is considered; thus in 1856 the male horses were as 107.1, and in 1867 as only 92.6 to 100 females. In the tabulated returns the proportions vary in cycles, for the males exceeded the females during six successive years; and the females exceeded the males during two periods each of four years; this, however, may be accidental; at least I can detect nothing of the kind with man in the decennial table in the Registrar's Report for 1866., 865447=9 See Sir J. Lubbock in 'Annals and Mag. of Nat. Hist.' vol. xi. 1853, pl. i. and x.; and vol. xii. (1853) pl. vii. See also Lubbock in 'Transact. Ent. Soc.' vol. iv. new series, 1856-1858, p. 8. With respect to the zig-zagged antennæ mentioned below, see Fritz Müller, 'Facts and Arguments for Darwin,' 1869, p. 40, foot-note., 932446=49 B. D. Walsh, the 'Pseudo-neuroptera of Illinois,' in 'Proc. Ent. Soc. of Philadelphia,' 1862, p. 361., 834412=That this result would follow from the above form of infanticide seems almost certain; that is if we assume that a sex-producing tendency is inherited. But as the above numbers are so extremely scanty, I have searched for additional evidence, but cannot decide whether what I have found is trustworthy; nevertheless the facts are, perhaps, worth giving. The Maories of New Zealand have long practised infanticide; and Mr. Fenton95 states that he \"has met with instances of women who have destroyed four, six, and even seven children, mostly females. However, the universal testimony of those best qualified to judge, is conclusive that this custom has for many years been almost extinct. Probably the year 1835 may be named as the period of its ceasing to exist.\" Now amongst the New Zealanders, as with the Todas, male births are considerably in excess. Mr. Fenton remarks (p. 30), \"One fact is certain, although the exact period of the commencement of this singular condition of the disproportion of the sexes cannot be demonstratively fixed, it is quite clear that this course of decrease was in full operation during the years 1830 to 1844, when the non-adult population of 1844 was being produced, and has continued with great energy up to the present time.\" The following statements are taken from Mr. Fenton (p. 26), but as the numbers, 292527=37 Savage and Wyman in 'Boston Journal of Nat. Hist.' vol. iv. 1843-44, p. 383., 368625=21 See the first and striking chapter in Adam Smith's 'Theory of Moral Sentiments.' Also Mr. Bain's 'Mental and Moral Science,' 1868, p. 244, and 275-282. Mr. Bain states, that, \"sympathy is, indirectly, a source of pleasure to the sympathiser;\" and he accounts for this through reciprocity. He remarks that \"the person benefited, or others in his stead, may make up, by sympathy and good offices returned, for all the sacrifice.\" But if, as appears to be the case, sympathy is strictly an instinct, its exercise would give direct pleasure, in the same manner as the exercise, as before remarked, of almost every other instinct., 181407=57 See the ever memorable 'Essay on the Principle of Population,' by the Rev T. Malthus, vol. i. 1826, p. 6, 517., 613109=43 The foregoing statements are taken chiefly from the following works: 'Jarves' History of the Hawaiian Islands,' 1843, p. 400-407. Cheever, 'Life in the Sandwich Islands,' 1851, p. 277. Ruschenberger is quoted by Bonwick, 'Last of the Tasmanians,' 1870, p. 378. Bishop is quoted by Sir E. Belcher, 'Voyage Round the World,' 1843,, 789874=53 With the savage Guaranys of Paraguay, according to the accurate Azara ('Voyages dans l'Amérique merid.' tom. ii. 1809, p. 60, 179), the women are to the men in the proportion of 14 to 13., 867349=10 See a paper by Mr. C. Spence Bate, with figures, in 'Proc. Zoolog. Soc.' 1868, p. 363; and on the nomenclature of the genus, ibid. p. 585. I am greatly indebted to Mr. Spence Bate for nearly all the above statements with respect to the chelæ of the higher crustaceans., 341003=4 Mr. Bain gives a list ('Mental and Moral Science,' 1868, p. 543-725) of twenty-six British authors who have written on this subject, and whose names are familiar to every reader; to these, Mr. Bain's own name, and those of Mr. Lecky, Mr. Shadworth Hodgson, Sir J. Lubbock, and others, might be added., 799473=With respect to the Fowl, I have received only one account, namely, that out of 1001 chickens of a highly-bred stock of Cochins, reared during eight years by Mr. Stretch, 487 proved males and 514 females; i.e., as 94.7 to 100. In regard to domestic pigeons there is good evidence either that the males are produced in excess, or that they live longer; for these birds invariably pair, and single males, as Mr. Tegetmeier informs me, can always be purchased cheaper than females. Usually the two birds reared from the two eggs laid in the same nest are a male and a female; but Mr. Harrison Weir, who has been so large a breeder, says that he has often bred two cocks from the same nest, and seldom two hens; moreover, the hen is generally the weaker of the two, and more liable to perish., 662566=75 'Transactions of the Zoological Society,' vol. v. 1862., 560172=9 'On the Phenomena of Hybridity in the Genus Homo,' Eng. translat. 1864., 142262=22 'Investigations,' &c. By B. A. Gould, 1869, p. 288., 550734=1 'History of India,' 1841, vol. i. p. 323. Father Ripa makes exactly the same remark with respect to the Chinese., 6337=DURING the successive reprints of the first edition of this work, published in 1871, I was able to introduce several important corrections; and now that more time has elapsed, I have endeavoured to profit by the fiery ordeal through which the book has passed, and have taken advantage of all the criticisms which seem to me sound. I am also greatly indebted to a large number of correspondents for the communication of a surprising number of new facts and remarks. These have been so numerous, that I have been able to use only the more important ones; and of these, as well as of the more important corrections, I will append a list. Some new illustrations have been introduced, and four of the old drawings have been replaced by better ones, done from life by Mr. T. W. Wood. I must especially call attention to some observations which I owe to the kindness of Prof. Huxley (given as a supplement at the end of Part I.), on the nature of the differences between the brains of man and the higher apes. I have been particularly glad to give these observations, because during the last few years several memoirs on the subject have appeared on the Continent, and their importance has been, in some cases, greatly exaggerated by popular writers., 909417=With respect to the object of the music, Dr. Hartman, in speaking of the Cicada septemdecim of the United States, says,26 \"the drums are now (June 6th and 7th, 1851) heard in all directions. This I believe to be the marital summons from the males. Standing in thick chestnut sprouts about as high as my head, where hundreds were around me, I observed the females coming around the drumming males.\" He adds, \"this season (Aug. 1868) a dwarf pear-tree in my garden produced about fifty larvæ of Cic. pruinosa; and I several times noticed the females to alight near a male while he was uttering his clanging notes.\" Fritz Müller writes to me from S. Brazil that he has often listened to a musical contest between two or three males of a species with a particularly loud voice, seated at a considerable distance from each other: as soon as one had finished his song, another immediately began, and then another. As there is so much rivalry between the males, it is probable that the females not only find them by their sounds, but that, like female birds, they are excited or allured by the male with the most attractive voice., 211977=77 'Die Grenzen der Thierwelt, eine Betrachtung zu Darwin's Lehre,' 1868, s. 51., 1009981=22 'Rambles of a Naturalist in the Chinese Seas,' 1868, p. 182., 443439=6 Mr. Wallace gives cases in his 'Contributions to the Theory of Natural Selection,' 1870, p. 354., 997525=10 See the interesting observations by Mr. T. W. Wood, 'The Student,' Sept. 1868, p. 81., 792801=55 Leuckart (in Wagner 'Handwörterbuch der Phys,' B. iv. 1853, s. 774., 463595=19 'Fraser's Magazine,' Sept. 1868, p. 353. 'Macmillan's Magazine, Aug. 1865, p. 318. The Rev. F. W. Farrar ('Fraser's Mag.,' Aug. 1870, p. 264) takes a different view., 171347=48 These papers deserve careful study by any one who desires to learn how frequently our muscles vary, and in varying come to resemble those of the Quadrumana. The following references relate to the few points touched on in my text: 'Proc. Royal Soc. vol. xiv. 1865, pp. 379-384; vol. xv. 1866, pp. 241, 242; vol. xv. 1867, p. 544; vol. xvi. 1868, p. 524. I may here add that Dr. Murie and Mr. St. George Mivart have shewn in their Memoir on the Lemuroidea ('Transact. Zoolog. Soc.' vol. vii. 1869, p. 96), how extraordinarily variable some of the muscles are in these animals, the lowest members of the Primates. Gradations, also, in the muscles leading to structures found in animals still lower in the scale, are numerous in the Lemuroidea., 479116=33 'Primeval Man,' 1869., 835797=95 'Aboriginal Inhabitants of New Zealand; Government Report,' 1859, p. 36., 890640=5 'Modern classification of Insects,' vol. ii. 1840, pp. 205, 206. Mr. Walsh, who called my attention to the double use of the jaws, says that he has repeatedly observed this fact., 475995=29 Mr. Galton, 'Macmillan's Magazine,' August, 1865, p. 325. See also, 'Nature,' 'On Darwinism and National Life,' Dec. 1869, p. 184., 448987=9 'Fraser's Magazine,' Sept. 1868, p. 353. This article seems to have struck many persons, and has given rise to two remarkable essays and a rejoinder in the 'Spectator,' Oct. 3rd and 17th, 1868. It has also been discussed in the 'Q. Journal of Science,' 1869, p. 152, and by Mr. Lawson Tait in the 'Dublin Q. Journal of Medical Science,' Feb. 1869, and by Mr. E. Ray Lankester in his 'Comparative Longevity,' 1870, p. 128. Similar views appeared previously in the 'Australasian,' July 13, 1867. I have borrowed ideas from several of these writers., 129517=10 'Hereditary Genius: an Inquiry into its Laws and Consequences, 1869., 321150=67 See the very interesting parallelism between the development of species and languages, given by Sir C. Lyell in 'The Geolog. Evidences of the Antiquity of Man,' 1863, chap. xxiii., 838715=97 'History of the Sandwich Islands,' 1843, p. 93., 600560=As they continued rapidly to decrease, and as they themselves thought that they should not perish so quickly elsewhere, they were removed in 1847 to Oyster Cove in the southern part of Tasmania. They then consisted (Dec. 20th, 1847) of fourteen men, twenty-two women and ten children.38 But the change of site did no good. Disease and death still pursued them, and in 1864 one man (who died in 1869), and three elderly women alone survived. The infertility of the women is even a more remarkable fact than the liability of all to ill-health and death. At the time when only nine women were left at Oyster Cove, they told Mr. Bonwick (p. 386), that only two had ever borne children: and these two had together produced only three children!, 641543=66 Harlan, 'Medical Researches,' p. 532. Quatrefages ('Unité de l'Espèce Humaine,' 1861, p. 128) has collected much evidence on this head., 630777=56 See a paper read before the Royal Soc. in 1813, and published in his Essays in 1818. I have given an account of Dr. Wells' views in the Historical Sketch (p. xvi.) to my 'Origin of Species.' Various cases of colour correlated with constitutional peculiarities are given in my 'Variation of Animals under Domestication,' vol. ii. pp. 227, 335., 620611=We can see why it is that aborigines, who have long inhabited islands, and who must have been long exposed to nearly uniform conditions, should be specially affected by any change in their habits, as seems to be the case. Civilised races can certainly resist changes of all kinds far better than savages; and in this respect they resemble domesticated animals, for though the latter sometimes suffer in health (for instance European dogs in India), yet they are rarely rendered sterile, though a few such instances have been recorded.47 The immunity of civilised races and domesticated animals is probably due to their having been subjected to a greater extent, and therefore having grown somewhat more accustomed, to diversified or varying conditions, than the majority of wild animals; and to their having formerly immigrated or been carried from country to country, and to different families or sub-races having inter-crossed. It appears that a cross with civilised races at once gives to an aboriginal race an immunity from the evil consequences of changed conditions. Thus the crossed offspring from the Tahitians and English, when settled in Pitcairn Island, increased so rapidly that the island was soon overstocked; and in June 1856 they were removed to Norfolk Island. They then consisted of 60 married persons and 134 children, making a total of 194. Here they likewise increased so rapidly, that although sixteen of them returned to Pitcairn Island in 1859, they numbered in January 1868, 300 souls;, 259374=9 Quoted by Dr. Lauder Lindsay, in his 'Physiology of Mind in the Lower Animals;' 'Journal of Mental Science,' April 1871, p. 38., 994772=9 'Einfluss der Isolirung auf die Artbildung,' 1872, p. 58., 939174=59 'Proc. Entomolog. Soc. of Philadelphia,' 1866, pp. 238-239., 797584=calves; i.e., in the proportion of 94.4 males to 100 females. The Rev. W. D. Fox informs me that in 1867 out of 34 calves born on a farm in Derbyshire only one was a bull. Mr. Harrison Weir has enquired from several breeders of Pigs, and most of them estimate the male to the female births as about 7 to 6. This same gentleman has bred Rabbits for many years, and has noticed that a far greater number of bucks are produced than does. But estimations are of little value., 603141=39 For these cases, see Bonwick's 'Daily Life of the Tasmanians,' 1870, p. 90: and the 'Last of the Tasmanians,' 1870, p. 386., 982877=3 'The Scottish Naturalist,' July 1872, p. 213., 629675=I afterwards found that this same idea had long ago occurred to Dr. Wells.56 It has long been known that negroes, and even mulattoes, are almost completely exempt from the yellow-fever, so destructive in tropical America.57 They likewise escape to a large extent the fatal intermittent fevers, that prevail along at least 2600 miles of the shores of Africa, and which annually cause one-fifth of the white settlers to die, and another fifth to return home invalided.58 This immunity in the negro seems to be partly inherent, depending on some unknown peculiarity of constitution, and partly the result of acclimatisation. Pouchet59, 363092=18 See also Hooker's 'Himalayan Journals,' vol. ii, 1854, p. 333., 587690=25 'On Analogous Forms of Implements,' in 'Memoirs of Anthropolog. Soc.' by H. M. Westropp. 'The Primitive Inhabitants of Scandinavia,' Eng. translat. edited by Sir J. Lubbock, 1868, p. 104., 108656=47 'Annuario della Soc. d. Nat.' Modena, 1867, p. 94., 308181=53 See some good remarks on this head by Prof. Whitney, in his 'Oriental and Linguistic Studies,' 1873, p. 354. He observes that the desire of communication between man is the living force, which, in the development of language, \"works both consciously and unconsciously; consciously as regards the immediate end to be attained; unconsciously as regards the further consequences of the act.\", 654715=71 'Convolutions of the Human Cerebrum Topographically Considered, 1866, p. 12., 145124=28 Paget, 'Lectures on Surgical Pathology,' vol. ii. 1853, p. 209., 271353=18 'Les Mœurs des Fourmis,' 1810, p. 150., 209040=75 Prof. Broca, La Constitution des Vertèbres caudales; 'La Revue d'Anthropologie,' 1872, p. 26, (separate copy)., 513896=15 Messrs. Murie and Mivart on the Lemuroidea, 'Transact. Zoolog. Soc.' vol. vii. 1869, p. 5., 560282=10 See the interesting letter by Mr. T. A. Murray, in the 'Anthropolog. Review,' April 1868, p. liii. In this letter Count Strzelecki's statement that Australian women who have borne children to a white man, are afterwards sterile with their own race, is disproved. M. A. de Quatrefages has also collected ('Revue des Cours Scientifiques,' March 1869, p. 239), much evidence that Australians and Europeans are not sterile when crossed., 148788=Physiology,' &c., 1822, p. 404) on this same subject. M. Giraud-Teulon has recently collected ('Revue des Cours Scientifiques,' 1870, p. 625) a large and valuable body of evidence proving that the cause of short-sight, \"C'est le travail assidu de près.\", 196579=68 Quoted by Mr. Lawson Tait in his 'Law of Natural Selection,'—'Dublin Quarterly Journal of Medical Science,' Feb. 1869. Dr. Keller is likewise quoted to the same effect., 761766=41 I have been assured that the horns of the sheep in North Wales can always be felt, and are sometimes even an inch in length, at birth. Youatt says ('Cattle,' 1834, p. 277), that the prominence of the frontal bone in cattle penetrates the cutis at birth, and that the horny matter is soon formed over it., 899563=15 'Journal of Proc. Ent. Soc.' Feb. 4th, 1867, p. lxxi., 522690=21 Elaborate tables are given in his 'Generelle Morphologie' (B. ii. s. cliii. and s. 425); and with more especial reference to man in his 'Natürliche Schöpfungsgeschichte,' 1868. Prof. Huxley, in reviewing this latter work ('The Academy,' 1869, p. 42) says, that he considers the phylum or lines of descent of the Vertebrata to be admirably discussed by Häckel, although he differs on some points. He expresses, also, his high estimate of the general tenor and spirit of the whole work., 405278=35 See, for instance, Mr. Hamilton's account of the Kaffirs, 'Anthropological Review,' 1870, p. xv., 347049=6 Mr. H. Sidgwick remarks, in an able discussion on this subject (the 'Academy,' June 15th, 1872, p. 231), \"a superior bee, we may feel sure, would aspire to a milder solution of the population question.\" Judging, however, from the habits of many or most savages, man solves the problem by female infanticide, polyandry and promiscuous intercourse; therefore it may well be doubted whether it would be by a milder method. Miss Cobbe, in commenting ('Darwinism in Morals,' 'Theological Review,' April, 1872, p. 188-191) on the same illustration, says, the principles of social duty would be thus reversed; and by this, I presume, she means that the fulfilment of a social duty would tend to the injury of individuals; but she overlooks the fact, which she would doubtless admit, that the instincts of the bee have been acquired for the good of the community. She goes so far as to say that if the theory of ethics advocated in this chapter were ever, 710998=13 Dr. Gray, in 'Annals and Mag. of Nat. Hist.' 1871, p. 302., 265553=13 W. C. L. Martin, 'Nat. Hist. of Mammalia,' 1841, p. 405., 550885=2 A vast number of measurements of Whites, Blacks, and Indians, are given in the 'Investigations in the Military and Anthropolog. Statistics of American Soldiers,' by B. A. Gould, 1869, pp. 298-358; 'On the capacity of the lungs,' p. 471. See also the numerous and valuable tables, by Dr. Weisbach, from the observations of Dr. Scherzer and Dr. Schwarz, in the 'Reise der Novara: Anthropolog. Theil,' 1867., 431611=1 'Anthropological Review,' May, 1864, p. clviii., 94231=33 Ueber das Darwin'sche Spitzohr, Archiv für Path. Anat. und Phys. 1871, p. 485., 356438=10 Mr. Belt gives the case of a spider-monkey (Ateles) in Nicaragua, which was heard screaming for nearly two hours in the forest, and was found with an eagle perched close by it. The bird apparently feared to attack as long as it remained face to face; and Mr. Belt believes, from what he has seen of the habits of these monkeys, that they protect themselves from eagles by keeping two or three together. 'The Naturalist in Nicaragua,' 1874, p. 118., 991564=6 The Naturalist on the Amazons,' vol. i. 1863, p. 19., 913867=28 I state this on the authority of Köppen, 'Ueber die Heuschrecken in Südrussland,' 1866, p. 32, for I have in vain endeavoured to procure Körte's work., 956837=68 'The Malay Archipelago,' vol. ii. 1869, p. 276. Riley, Sixth 'Report on insects of Missouri,' 1874, p. 115., 631926=states that the negro regiments recruited near the Soudan, and borrowed from the Viceroy of Egypt for the Mexican war, escaped the yellow-fever almost equally with the negroes originally brought from various parts of Africa and accustomed to the climate of the West Indies. That acclimatisation plays a part, is shewn by the many cases in which negroes have become somewhat liable to tropical fevers, after having resided for some time in a colder climate.60 The nature of the climate under which the white races have long resided, likewise has some influence on them; for during the fearful epidemic of yellow-fever in Demerara during 1837, Dr. Blair found that the death-rate of the immigrants was proportional to the latitude of the country whence they had come. With the negro the immunity, as far as it is the result of acclimatisation, implies exposure during a prodigious length of time; for the aborigines of tropical America who have resided there from time immemorial, are not exempt from yellow fever; and the Rev. H. B. Tristram states, that there are districts in Northern Africa which the native inhabitants are compelled annually to leave, though the negroes can remain with safety., 525628=23 At the Falkland Islands I had the satisfaction of seeing, in April 1833, and therefore some years before any other naturalist, the locomotive larvæ of a compound Ascidian, closely allied to Synoicum, but apparently generically distinct from it. The tail was about five times as long as the oblong head, and terminated in a very fine filament. It was, as sketched by me under a simple microscope, plainly divided by transverse opaque partitions, which I presume represent the great cells figured by Kovalevsky. At an early stage of development the tail was closely coiled round the head of the larva., 408152=39 See on this subject copious evidence in Chap. vii. of Sir J. Lubbock, 'Origin of Civilisation,' 1870., 311084=55 'On the Origin of Language,' by H. Wedgwood, 1866. 'Chapters on Language,' by the Rev. F. W. Farrar, 1865. These works are most interesting. See also 'De la Phys. et de Parole,' par Albert Lemoine, 1865, p. 190. The work on this subject, by the late Prof. Aug. Schleicher, has been translated by Dr. Bikkers into English, under the title of 'Darwinism tested by the Science of Language,' 1869., 744026=34 These facts are given on the high authority of a great breeder, Mr. Teebay; see Tegetmeier's 'Poultry Book,' 1868, p. 158. On the characters of chickens of different breeds, and on the breeds of the pigeon, alluded to in the following paragraph, see 'Variation of Animals,' &c., vol. i. pp. 160, 249; vol. ii. p. 77., 289744=36 'Proc. Zoolog. Soc.' 1864, p. 186., 728726=29 Prof. Mantegazza is inclined to believe ('Lettera a Carlo Darwin,' 'Archivio per l'Anthropologia,' 1871, p. 306) that the bright colours, common in so many male animals, are due to the presence and retention by them of the spermatic fluid; but this can hardly be the case; for many male birds, for instance young pheasants, become brightly coloured in the autumn of their first year., 725568=23 'Reise der Novara: Anthropolog. Theil,' 1867, s. 216-269. The results were calculated by Dr. Weisbach from measurements made by Drs. K. Scherzer and Schwarz. On the greater variability of the males of domesticated animals, see my 'Variation of Animals and Plants under Domestication,' vol, ii. 1868, p. 75., 870359=11 'Hist. Nat. des Crust.' tom. ii. 1837, p. 50., 425611=48 A writer in the 'North British Review' (July 1869, p. 531), well capable of forming a sound judgment, expresses himself strongly in favour of this conclusion. Mr. Lecky ('Hist. of Morals' vol. i. p. 143) seems to a certain extent to coincide therein., 805175=68 'Ibis,' 1862, p. 137., 887121=26 Walckenaer et P. Gervais, 'Hist. Nat. des Insectes: Apteres,' tom. iv. 1847, pp. 17, 19, 68., 838624=96 'Narrative of a Tour through Hawaii,' 1826, p. 298., 716874=17 Noel Humphreys, 'River Gardens,' 1857., 360276=16 'De l'Espece et de la Classe,' 1869, p. 97., 271431=19 Quoted in Dr. Maudsley's 'Physiology and Pathology of Mind,' 1868, pp. 19, 220., 935446=53 See abstract in the 'Zoological Record' for 1867, p. 450., 804402=64 'Nat. Hist. of Selborne,' letter xxix. edit. of 1825, vol. i. p. 139., 786100=50 In regard to the Jews, see M. Thury, 'La Loi de Production des Sexes,' 1863, p. 25., 402551=34 See Mr. Bagehot, 'Physics and Politics,' 1872, p. 72., 553304=5 With respect to the figures in the famous Egyptian caves of Abou-Simbel, M. Pouchet says ('The Plurality of the Human Races,' Eng. translat., 1864, p. 50), that he was far from finding recognisable representations of the dozen or more nations which some authors believe that they can recognise. Even some of the most strongly-marked races cannot be identified with that degree of unanimity which might have been expected from what has been written on the subject. Thus Messrs. Nott and Gliddon ('Types of Mankind,' p. 148), state that Rameses II., or the Great, has features superbly European; whereas Knox, another firm believer in the specific distinctness of the races of man ('Races of Man,' 1850, p. 201), speaking of young Memnon (the same as Rameses II., as I am informed by Mr. Birch), insists in the strongest manner that he is identical in character with the Jews of Antwerp. Again, when I looked at the statue of Amunoph III., I agreed with two officers of the establishment, both competent judges, that he had a strongly-marked negro type of features; but Messrs. Nott and Gliddon (ibid. p. 146, fig. 53), describe him as a hybrid, but not of \"negro intermixture.\", 399133=30 Dr. Prosper Despine, in his 'Psychologie Naturelle,' 1868 (tom. i. p. 243; tom. ii, p. 169) gives many curious cases of the worst criminals, who apparently have been entirely destitute of conscience., 407978=37 Lecky, 'History of European Morals,' vol. i. 1869, p. 109., 144702=24 'History of Greenland,' Eng. translat. 1767, vol. i. p. 230., 657972=In view of these facts I do not hesitate in this year 1874, to repeat and insist upon the proposition which I enunciated in 1863.74, 440510=5 See a remarkable series of articles on 'Physics and Politics' in the 'Fortnightly Review,' Nov. 1867; April 1, 1868; July 1, 1869, since separately published., 129638=11 Mr. Bates remarks ('The Naturalist on the Amazons,' 1863, vol. ii. p. 159), with respect to the Indians of the same South American tribe, \"no two of them were at all similar in the shape of the head; one man had an oval visage with fine features, and another was quite Mongolian in breadth and prominence of cheek, spread of nostrils, and obliquity of eyes.\", 615960=vol. i. p. 272. I owe the census of the several years to the kindness of Mr. Coan, at the request of Dr. Youmans of New York; and in most cases I have compared the Youmans figures with those given in several of the above-named works. I have omitted the census for 1850, as I have seen two widely different numbers given., 728442=27 'Archiv für Path. Anat. und Phys.' 1871, p. 488., 627928=52 Pallas, 'Act. Acad. St. Petersburg,' 1780, part ii. p. 69. He was followed by Rudolphi, in his 'Beyträge zur Anthropologie,' 1812. An excellent summary of the evidence is given by Godron, 'De l'Espèce,' 1859, vol. ii. p. 246, &c., 329959=73 'The Spectator,' Dec. 4th, 1869, p. 1430., 951281=64 'Proc. Entomolog. Soc. of Philadelphia,' 1864, p. 228., 117042=54 Leuckart, in Todd's 'Cyclop. of Anat.' 1849-52, vol. iv. p. 1415. In man this organ is only from three to six lines in length, but, like so many other rudimentary parts, it is variable in development as well as in other characters., 73177=15 The human embryo (upper fig.) is from Ecker, 'Icones Phys.,' 1851-1859, tab. xxx. fig. 2. This embryo was ten lines in length, so that the drawing is much magnified. The embryo of the dog is from Bischoff, 'Entwicklungsgeschichte des Hunde-Eies,' 1845, tab. xi. fig. 42 B. This drawing is five times magnified, the embryo being twenty-five days old. The internal viscera have been omitted, and the uterine appendages in both drawings removed. I was directed to these figures by Prof. Huxley, from whose work, 'Man's Place in Nature,' the idea of giving them was taken. Häckel has also given analogous drawings in his 'Schöpfungsgeschichte.', 274695=23 'Die Bewegungen der Thiere,' &c., 1873, p. 11., 228162=92 'Proc. Zoolog. Soc.,' 1872, p. 210., 340789=2 'Dissertation on Ethical Philosophy,' 1837, p. 231, &c., 314205=59 See remarks on this head by Dr. Maudsley, 'The Physiology and Pathology of Mind,' 2nd edit. 1868, p. 199., 902448=17 'Transact. Linnean Soc.' vol. xxvi. 1868, p. 296., 880343=18 'A History of the Spiders of Great Britain,' 1861-64. For the following facts, see pp. 77, 88, 102., 520046=19 'Elements of Geology,' 1865, pp. 583-585. 'Antiquity of Man,' 1863, p. 145., 304405=51 See a discussion on this subject in Mr. E. B. Tylor's very interesting work, 'Researches into the Early History of Mankind,' 1865, chaps. ii. to iv., 560942=asserts that he has known mulatto families which have intermarried for several generations, and have continued on an average as fertile as either pure whites or pure blacks. Enquiries formerly made by Sir C. Lyell on this subject led him, as he informs me, to the same conclusion.12 In the United States the census for the year 1854 included, according to Dr. Bachman, 405,751 mulattoes; and this number, considering all the circumstances of the case, seems small; but it may partly be accounted for by the degraded and anomalous position of the class, and by the profligacy of the women. A certain amount of absorption of mulattoes into negroes must always be in progress; and this would lead to an apparent diminution of the former. The inferior vitality of mulattoes is spoken of in a trustworthy work13 as a well-known phenomenon; and this, although a different consideration from their lessened fertility, may perhaps be advanced as a proof of the specific distinctness of the parent races. No doubt both animal and vegetable hybrids, when produced from extremely distinct species, are liable to premature death; but the parents of mulattoes cannot be put under the category of extremely distinct species. The common Mule, so notorious for long life and vigour, and yet so sterile, shews how little necessary connection there is in hybrids between lessened fertility and vitality; other analogous cases could be cited., 959921=71 'Ann. Soc. Entomolog. France,' 1866, as quoted in 'Journal of Travel,' by A. Murray, 1868, p. 135., 56854=1 As the works of the first-named authors are so well known, I need not give the titles; but as those of the latter are less well known in England, I will give them:—'Sechs Vorlesungen über die Darwin'sche Theorie:' zweite Auflage, 1868, von Dr. L. Büchner; translated into French under the title 'Conférences sur la Théorie Darwinienne,' 1869. 'Der Mensch, im Lichte der Darwin'schen Lehre,' 1865, von Dr. F. Rolle. I will not attempt to give references to all the authors who have taken the same side of the question. Thus G. Canestrini has published ('Annuario della Soc. d. Nat.,' Modena, 1867, p. 81) a very curious paper on rudimentary characters, as bearing on the origin of man. Another work has (1869) been published by Dr. Francesco Barrago, bearing in Italian the title of \"Man, made in the image of God, was also made in the image of the ape.\", 472865=28 'Hereditary Genius,' 1870, pp. 357-359. The Rev. F. W. Farrar ('Fraser's Mag.,' Aug. 1870, p. 257) advances arguments on the other side. Sir C. Lyell had already ('Principles of Geology,' vol. ii. 1868, p. 489) in a striking passage called attention to the evil influence of the Holy Inquisition in having, through selection, lowered the general standard of intelligence in Europe., 964699=76 Schiödte, translated in 'Annals and Mag. of Nat. Hist.' vol. xx. 1867, p. 37., 168547=42 'Anatomy of Vertebrates,' vol. iii. 1868, p. 323., 801120=63 On the authority of L. Lloyd, 'Game Birds of Sweden,' 1867, pp. 12, 132., 511352=13 'Transact. Zoolog. Soc.' vol. vi. 1867, p. 214., 633656=60 Quatrefages, 'Unité de l'Espèce Humaine,' 1861, p. 205. Waitz, 'Introduct. to Anthropology,' translat. vol. i. 1863, p. 124. Livingstone gives analogous cases in his 'Travels.', 121910=IT is manifest that man is now subject to much variability. No two individuals of the same race are quite alike. We may compare millions of faces, and each will be distinct. There is an equally great amount of diversity in the proportions and dimensions of the various parts of the body; the length of the legs being one of the most variable points.1 Although in some quarters of the world an elongated skull, and in other quarters a short skull prevails, yet there is great diversity of shape even within the limits of the same race, as with the aborigines of America and South Australia—the latter a race \"probably as pure and homogeneous in blood, customs, and language as any in existence\"—and even with the inhabitants of so confined an area as the Sandwich Islands.2 An eminent dentist assures me that there is nearly as much diversity in the teeth as in the features. The chief arteries so frequently run in abnormal courses, that it has been found useful for surgical purposes to calculate from 1040 corpses how often each course prevails.3 The muscles are eminently variable: thus those of the foot were found by Prof. Turner4 not to be strictly alike in any two out of fifty bodies; and in some the deviations were considerable., 908533=24 'Zeitschrift für wissenschaft Zoolog.' B. xvii. 1867, s. 152-158., 609438=We here see that in the interval of forty years, between 1832 and 1872, the population has decreased no less than sixty-eight per cent.! This has been attributed by most writers to the profligacy of the women, to former bloody wars, and to the severe labour imposed on conquered tribes and to newly introduced diseases, which have been on several occasions extremely destructive. No doubt these and other such causes have been highly efficient, and may account for the extraordinary rate of decrease between the years 1832 and 1836; but the most potent of all the causes seems to be lessened fertility. According to Dr. Ruschenberger of the U.S. Navy, who visited these islands between 1835 and 1837, in one district of Hawaii, only twenty-five men out of 1134, and in another district only ten out of 637, had a family with as many as three children. Of eighty married women, only thirty-nine had ever borne children; and \"the official report gives an average of half a child to each married couple in the whole, 832694=92 See, on this subject, Mr. O. P. Cambridge, as quoted in 'Quarterly Journal of Science,' 1868, p. 429., 139312=19 'Memoirs, Anthropolog. Soc. vol. iii. 1867-69, pp. 561, 565, 567., 883652=23 Theridion (Asagena, Sund.) serratipes, 4-punctatum et guttatum; see Westring, in Kroyer, 'Naturhist. Tidskrift,' vol. iv. 1842-1843, p. 349; and vol. ii. 1846-1849, p. 342. See, also, for other species, 'Araneæ Suecicæ,' p. 184., 78610=20 'Proc. Soc. Nat. Hist.' Boston, 1863, vol. ix. p. 185., 298996=45 'Conférences sur la Théorie Darwinienne,' French translat. 1869, p. 132., 99610=37 'The Physiology and Pathology of Mind,' 2nd edit. 1868, p. 134., 808776=71 'The Stormontfield Piscicultural Experiments,' 1866, p. 23. The 'Field' newspaper, June 29th, 1867., 828808=85 Walsh, in 'The American Entomologist,' vol. i. 1869, p. 103. F. Smith, 'Record of Zoological Literature,' 1867, p. 328., 707536=10 On the Gorilla, Savage and Wyman, 'Boston Journal of Nat. Hist.' vol. v. 1845-47, p. 423. On Cynocephalus, Brehm, 'Illust. Thierleben,' B. i. 1864, s. 77. On Mycetes, Rengger, 'Naturgesch.: Säugethiere von Paraguay,' 1830, s. 14, 20. Cebus, Brehm, ibid. s. 108., 870559=13 Fritz Müller, 'Facts and Arguments for Darwin,' 1869, pp. 25-28., 465340=It was established from an enormous body of statistics, taken during 1853, that the unmarried men throughout France, between the ages of twenty and eighty, die in a much larger proportion than the married: for instance, out of every 1000 unmarried men, between the ages of twenty and thirty, 11.3 annually died, whilst of the married only 6.5 died.23 A similar law was proved to hold good, during the years 1863 and 1864, with the entire population above the age of twenty in Scotland: for instance, out of every 1000 unmarried men, between the ages of twenty and thirty, 14.97 annually died, whilst of the married only 7.24 died, that is less than half.24 Dr. Stark remarks on this, \"Bachelorhood is more destructive to life than the most unwholesome trades, or than residence in an unwholesome house or district where there has never been the most distant attempt at sanitary improvement.\" He considers that the lessened mortality is the direct result of \"marriage, and the more regular domestic habits which attend that state.\" He admits, however, that the intemperate, profligate, and criminal classes, whose duration of life is low, do not commonly marry; and it must likewise be admitted that men with a weak constitu-, 838539=In a census of all the islands in 1850,98 the males of all ages, 790108=54 Babbage, 'Edinburgh Journal of Science,' 1829, vol. i. p. 88; also p. 90, on still-born children. On illegitimate children in England, see 'Report of Registrar-General for 1866,' p. xv., 505370=10 'Origin of Species,' 5th edit. 1869, p. 194. 'The Variation of Animals and Plants under Domestication,' vol. ii. 1868, p. 348., 102486=39 Paget, 'Lectures on Surgical Pathology,' 1853, vol. i. p. 71., 374333=22 This fact, the Rev. L. Jenyns states (see his edition of 'White's Nat. Hist. of Selborne,' 1853, p. 204), was first recorded by the illustrious Jenner, in 'Phil. Transact.' 1824, and has since been confirmed by several observers, especially by Mr. Blackwall. This latter careful observer examined, late in the autumn, during two years, thirty-six nests; he found that twelve contained young dead birds, five contained eggs on the point of being hatched, and three, eggs not nearly hatched. Many birds, not yet old enough for a prolonged flight, are likewise deserted and left behind. See Blackwall, 'Researches in Zoology,' 1834, pp. 108, 118. For some additional evidence, although this is not wanted, see Leroy, 'Lettres Phil.' 1802, p. 217. For Swifts, Gould's 'Introduction to the Birds of Great Britain,' 1823, p. 5. Similar cases have been observed in Canada by Mr. Adams; 'Pop. Science Review,' July, 1873, p. 283., 1027892=29 'Transact. Linn. Soc.' vol. xxiii. 1862, p. 495., 812076=74 Leuckart quotes Meinecke (Wagner, 'Handwörterbuch der Phys.' B. iv. 1853, s. 775) that the males of Butterflies are three or four times as numerous as the females., 862784=6 See his beautiful monograph on 'British Annelids,' part i. 1873, p. 3., 725480=22 'Vortage über Viehzucht,\" 1872, p. 63., 131695=13 Mitford's 'History of Greece,' vol. i. p. 282. It appears also from a passage in Xenophon's 'Memorabilia,' B. ii. 4 (to which my attention has been called by the Rev. J. N. Hoare), that it was a well recognised principle with the Greeks, that men ought to select their wives with a view to the health and vigour of their children. The Grecian poet, Theognis, who lived 550 B.C., clearly saw how important selection, if carefully applied, would be for the improvement of mankind. He saw, likewise, that wealth often checks the proper action of sexual selection. He thus writes:, 460958=18 E. Ray Lankester, 'Comparative Longevity,' 1870, p. 115. The table of the intemperate is from Neison's 'Vital Statistics.' In regard to profligacy, see Dr. Farr, Influence of Marriage on Mortality,' 'Nat. Assoc. for the Promotion of Social Science,' 1858., 976138=79 M. P. de la Brulerie, as quoted in 'Journal of Travel,' A. Murray, vol. i. 1868, p. 135., 587917=26 Westropp, 'On Cromlechs,' &c., 'Journal of Ethnological Soc.' as given in 'Scientific Opinion,' June 2nd, 1869, p. 3., 893918=9 'Insecta Maderensia,' 1854, p. 20., 54975=any degree new. Lamarck long ago came to this conclusion, which has lately been maintained by several eminent naturalists and philosophers; for instance, by Wallace, Huxley, Lyell, Vogt, Lubbock, Büchner, Rolle, &c.,1 and especially by Häckel. This last naturalist, besides his great work, 'Generelle Morphologie' (1866), has recently (1868, with a second edit. in 1870), published his 'Natürliche Schöpfungsgeschichte,' in which he fully discusses the genealogy of man. If this work had appeared before my essay had been written, I should probably never have completed it. Almost all the conclusions at which I have arrived I find confirmed by this naturalist, whose knowledge on many points is much fuller than mine. Wherever I have added any fact or view from Prof. Häckel's writings, I give his authority in the text; other statements I leave as they originally stood in my manuscript, occasionally giving in the foot-notes references to his works, as a confirmation of the more doubtful or interesting points., 401492=31 See an able article in the 'North British Review,' 1867, p. 395. See also Mr. W. Bagehot's articles on the Importance of Obedience and Coherence to Primitive Man, in the 'Fortnightly Review,' 1867, p. 529, and 1868, p. 457, &c., 935543=54 Kirby and Spence, 'Introduct. to Entomology,' vol. ii. 1818, p. 35., 174490=51 'Journal of Anat. and Phys.' May, 1872, p. 421., 221858=89 The 'Naturalist in Nicaragua,' 1874, p. 209. As some confirmation of Mr. Belt's view, I may quote the following passage from Sir W. Denison ('Varieties of Vice-Regal Life,' vol. i. 1870, p. 440): \"It is said to be a practice with the Australians, when the vermin get troublesome, to singe themselves.\", 481576=34 'Royal Institution of Great Britain,' March 15, 1867. Also, 'Researches into the Early History of Mankind,' 1865., 637498=62 'Anthropological Review,' Jan. 1866, p. xxi. Dr. Sharpe also says, with respect to India ('Man a Special Creation,' 1873, p. 118), \"that it has been noticed by some medical officers that Europeans with light hair and florid complexions suffer less from diseases of tropical countries than persons with dark hair and sallow complexions; and, so far as I know, there appear to be good grounds for this remark.\" On the other hand, Mr. Heddle, of Sierra Leone \"who has had more clerks killed under him than any other man,\" by the climate of the West African Coast (W. Reade, 'African Sketch Book,' vol. ii. p. 522), holds a directly opposite view, as does Capt. Burton., 73100=14 'Man's Place in Nature,' 1863, p. 67., 925918=43 Landois has recently found in certain Orthoptera rudimentary structures closely similar to the sound-producing organs in the Homoptera; and this is a surprising fact. See 'Zeitschr. für wissensch, Zoolog.' B. xxii. Heft 3, 1871, p. 348., 162107=39 See Dr. A. Farre's well-known article in the 'Cyclopædia of Anatomy and Physiology,' vol. v. 1859, p. 642. Owen, 'Anatomy of Vertebrates,' vol. iii., 1868, p. 687. Professor Turner in 'Edinburgh Medical Journal,' February 1865., 317172=thinking, to the distinctness and variety and complexity of cognitions to the full mastery of consciousness; therefore he would fain make thought absolutely impossible without speech, identifying the faculty with its instrument. He might just as reasonably assert that the human hand cannot act without a tool. With such a doctrine to start from, he cannot stop short of Müller's worst paradoxes, that an infant (in fans, not speaking) is not a human being, and that deaf-mutes do not become possessed of reason until they learn to twist their fingers into imitation of spoken words.\" Max Müller gives in italics ('Lectures on Mr. Darwin's Philosophy of Language,' 1873, third lecture) the following aphorism: \"There is no thought without words, as little as there are words without thought.\" What a strange definition must here be given to the word thought!, 854213=2 'De l'Espèce et de la Class.' &c., 1869, p. 106., 914072=29 Gilbert White, 'Nat. Hist. of Selborne,' vol. ii. 1825, p. 262., 112279=52 Quatrefages has lately collected the evidence on this subject. 'Revue des Cours Scientifiques,' 1867-1868, p. 625. In 1840 Fleischmann exhibited a human fœtus bearing a free tail, which, as is not always the case, included vertebral bodies; and this tail was critically examined by the many anatomists present at the meeting of naturalists at Erlangen (see Marshall in Niederländischen Archiv für Zoologie, December 1871)., 728535=28 The conclusions recently arrived at by Dr. J. Stockton Hough, on the temperature of man, are given in the 'Pop. Science Review,' Jan. 1st, 1874, p. 97., 862893=7 See M. Perrier, 'L'Origine de l'Homme d'après Darwin,' 'Revue Scientifique,' Feb. 1873, p. 866., 152380=36 'Mémoire sur les Microcéphales,' 1867, pp. 50, 125, 169, 171, 184-198., 887253=1 Sir J. Lubbock, 'Transact. Linnean Soc.' vol. xxv. 1866, p. 484. With respect to the Mutillidæ see Westwood, 'Modern Class. of Insects,' vol. ii. p. 213., 314350=60 Many curious cases have been recorded. See, for instance, Dr. Bateman 'On Aphasia,' 1870, p. 27, 31, 53, 100, &c. Also, 'Inquiries Concerning the Intellectual Powers,' by Dr. Abercrombie, 1838, p. 150., 883469=21 Kirby and Spence, 'Introduction to Entomology,' vol. i. 1818, p. 280., 410198=41 This term is used in an able article in the 'Westminster Review,' Oct. 1869, p. 498. For the \"Greatest happiness principle,\" see J. S. Mill, 'Utilitarianism,' p. 17., 407838=36 Mr. M'Lennan has given ('Primitive Marriage,' 1865, p. 176) a good collection of facts on this head., 1030835=31 Wallace, 'Transact. Linn. Soc.' vol. xxv. 1865, p. 1; also, 'Transact. Ent. Soc.' vol. iv. (3rd series), 1867, p. 301. Trimen, 'Linn. Transact.' vol. xxvi. 1869, p. 497. Riley, 'Third Annual Report on the Noxious Insects of Missouri,' 1871, pp. 163-168. This latter essay is valuable, as Mr. Riley here discusses all the objections which have been raised against Mr. Bates' theory., 142370=23 'Säugethiere von Paraguay,' 1830, s. 4., 563846=13 'Military and Anthropolog. Statistics of American Soldiers,' by B. A. Gould, 1869, p. 319., 481729=35 'Primitive Marriage,' 1865. See, likewise, an excellent article, evidently by the same author, in the 'North British Review,' July, 1869. Also, Mr. L. H. Morgan, 'A Conjectural Solution of the Origin of the Class, System of Relationship,' in 'Proc. American Acad. of Sciences,' vol. vii. Feb. 1868. Prof. Schaaffhausen ('Anthropolog. Review,' Oct. 1869, p. 373) remarks on \"the vestiges of human sacrifices found both in Homer and the Old Testament.\", 584977=24 Tylor's 'Early History of Mankind,' 1865: with respect to gesture-language, see p. 54. Lubbock's 'Prehistoric Times,' 2nd edit. 1869., 340887=3 'Metaphysics of Ethics,' translated by J. W. Semple, Edinburgh, 1836, p. 136., 762720=43 'Ueber die knöchernen Schädelhöcker der Vögel' in the 'Niederlandischen Archiv für Zoologie,' Band I. Heft 2, 1872., 353880=9 Brehm, 'Thierleben,' B. i. 1864, s. 52, 79. For the case of the monkeys extracting thorns from each other, see s. 54. With respect to the Hamadryas turning over stones, the fact is given (s. 76) on the evidence of Alvarez, whose observations Brehm thinks quite trustworthy. For the cases of the old male baboons attacking the dogs, see s. 79; and with respect to the eagle, s. 56., 259611=11 A critic, without any grounds ('Quarterly Review,' July, 1871, p. 72), disputes the possibility of this act as described by Brehm, for the sake of discrediting my work. Therefore I tried and found that I could readily seize with my own teeth the sharp little claws of a kitten nearly five weeks old., 606132=41 'New Zealand,' by Alex. Kennedy, 1873, p. 47., 602982=38 This is the statement of the Governor of Tasmania, Sir W. Denison, 'Varieties of Vice-Regal Life,' 1870, vol. i. p. 67., 908312=23 These particulars are taken from Westwood's 'Modern Class. of Insects,' vol. ii. 1840, page 422. See, also, on the Fulgoridæ, Kirby and Spence, 'Introduct.' vol. ii. page 401., 318178=65 See some good remarks to this effect by Dr. Maudsley, 'The Physiology and Pathology of Mind,' 1868, p. 199., 457967=13 Quatrefages, 'Revue des Cours Scientifiques,' 1867-68, p. 659., 812284=75 'The Naturalist on the Amazons,' vol. ii. 1863, p. 228, 347., 1000585=15 Such differences between the upper and lower surfaces of the wings of several species of Papilio, may be seen in the beautiful plates to Mr. Wallace's 'Memoir on the Papilionidæ of the Malayan Region,' in 'Transact. Linn. Soc.' vol. xxv, part i. 1865., 804511=65 Mr. Jenner Weir received similar information, on making enquiries during the following year. To shew the number of living chaffinches caught, I may mention that in 1869 there was a match between two experts, and one man caught in a day 62, and another 40, male chaffinches. The greatest number ever caught by one man in a single day was 70., 594206=29 Translation in 'Anthropological Review,' Oct. 1868, p. 431., 460884=17 'Hereditary Genius,' 1870, p. 347., 1018319=24 Wallace on the Papilionidæ of the Malayan Region, in 'Transact. Linn. Soc.' vol. xxv. 1865, pp. 8, 36. A striking case of a rare variety, strictly intermediate between two other well-marked female varieties, is given by Mr. Wallace. See also Mr. Bates, in 'Proc. Entomolog. Soc.' Nov. 19th, 1866, p. xl., 123738=3 'Anatomy of the Arteries,' by R. Quain. Preface, vol. i. 1844., 265728=15 Quoted by Vogt, 'Mémoire sur les Microcéphales,' 1867, p. 168., 105565=42 Dr. Webb, 'Teeth in Man and the Anthropoid Apes,' as quoted by Dr. C. Carter Blake in 'Anthropological Review,' July 1867, p. 299., 88454=30 Prof. A. Macalister, 'Annals and Mag. of Nat. History,' vol. vii., 1871, p. 342., 63688=1 'Grosshirnwindungen des Menschen,' 1868, s. 96. The conclusions of this author, as well as those of Gratiolet and Aeby, concerning the brain, will be discussed by Prof. Huxley in the Appendix alluded to in the Preface to this edition., 149110=32 Prichard, 'Phys. Hist. of Mankind,' on the authority of Blumenbach, vol. i. 1851, p. 311; for the statement by Pallas, vol. iv. 1844, p. 407., 840438=99 Dr. Coulter, in describing ('Journal R. Geograph. Soc.,' vol. v. 1835, p. 67) the state of California about the year 1830, says that the natives, reclaimed by the Spanish missionaries, have nearly all perished, or are perishing, although well treated, not driven from their native land, and kept from the use of spirits. He attributes this, in great part, to the undoubted fact that the men greatly exceed the women in number; but he does not know whether this is due to a failure of female offspring, or to more females dying during early youth. The latter alternative, according to all analogy, is very improbable. He adds that \"infanticide, properly so called, is not common, though very frequent recourse is had to abortion.\" If Dr. Coulter is correct about infanticide, this case cannot be advanced in support of Col. Marshall's view. From the rapid decrease of the reclaimed natives, we may suspect that, as in the cases lately given, their fertility has been diminished from changed habits of life., 505536=11 'An Introduction to the Classification of Animals,' 1869, p. 99., 476165=30 'Last Winter in the United States,' 1868, p. 29., 823929=With reference to the other Orders of insects, I have been able to collect very little reliable information. With the stag-beetle (Lucanus cervus) \"the males appear to be much more numerous than the females;\" but when, as Cornelius remarked during 1867, an unusual number of these beetles appeared in one part of Germany, the females appeared to exceed the males as six to one. With one of the Elateridæ, the males are said to be much more numerous than the females, and \"two or three are often found united with one female;84 so that here polyandry seems to prevail.\" With Siagonium (Staphylinidæ), in which the males are furnished with horns, \"the females are far more numerous than the opposite sex.\" Mr. Janson stated at the Entomological Society that the females of the bark-feeding Tomicus villosus are so common as to be a plague, whilst the males are so rare as to be hardly known., 224956=90 Mr. St. George Mivart, 'Proc. Zoolog. Soc.' 1865, pp. 562, 583. Dr. J. E. Gray, 'Cat. Brit. Mus.: Skeletons.' Owen, 'Anatomy of Vertebrates,' vol. ii. p. 517. Isidore Geoffroy, 'Hist. Nat. Gén.' tom. ii. p. 244., 144815=25 'Intermarriage.' By Alex. Walker, 1838, p. 377., 378180=24 'Mental and Moral Science,' 1868, p. 254., 295859=41 'The Malay Archipelago,' vol. i. 1869, p. 87., 82003=25 For instance M. Richard ('Annales des Sciences Nat.,' 3rd series, Zoolog. 1852, tom. xviii. p. 13) describes and figures rudiments of what he calls the \"muscle pédieux de la main,\" which he says is sometimes \"infiniment petit.\" Another muscle, called \"le tibial postérieur,\" is generally quite absent in the hand, but appears from time to time in a more or less rudimentary condition., 820025=82 'Lepidopteren-Doubletten Liste,' Berlin, No. x. 1866., 808915=72 'Land and Water,' 1868, p. 41., 99713=38 Eschricht, Ueber die Richtung der Haare am menschlichen Körper, 'Müller's Archiv für Anat. und Phys.' 1837, s. 47. I shall often have to refer to this very curious paper., 174372=50 Mr. Champneys in 'Journal of Anat. and Phys.' Nov., 1871, p. 178., 964821=77 Westring has described (Kroyer, 'Naturhist. Tidskrift,' B. ii. 1848-49, p. 334) the stridulating organs in these two, as well as in other families. In the Carabidæ I have examined Ealphrus uliginosus and Blethisa multipunctata, sent to me by Mr. Crotch. In Blethisa the transverse ridges on the furrowed border of the abdominal segment do, 203077=73 \"The Hand,\" &c. 'Bridgewater Treatise,' 1833, p. 38., 298870=44 Mr. Hookham, in a letter to Prof. Max Müller, in the 'Birmingham News,' May 1873., 539061=31 Maddle. C. Royer has suggested a similar view in her 'Origine de l'Homme,' &c., 1870., 928932=46 Mr. Ch. Horne, in 'Proc. Ent. Soc' May 3, 1869, p. xii., 318090=64 'Essays on Free-thinking,' &c., 1873, p. 82., 1027980=30 'Proc. Ent. Soc.' Dec. 3rd, 1866, p. xlv., 228250=93 'Proc. Zoolog. Soc.,' 1872, p. 786., 883578=22 'Proc. Zoolog. Soc.' 1871, p. 621., 560075=8 'Transact. R. Soc. of Edinburgh,' vol. xxii. 1861, p. 567., 911236=25 'Transact. New Zealand Institute,' vol. v. 1873, p. 286., 420063=45 'The Thoughts of the Emperor M. Aurelius Antoninus,' Eng. translat., 2nd edit., 1869, p. 112. Marcus Aurelius was born A.D. 121., 914175=30 Harris, 'Insects of New England,' 1842, p. 128., 280143=25 Prof. Huxley has analysed with admirable clearness the mental steps by which a man, as well as a dog, arrives at a conclusion in a case analogous to that given in my text. See his article, 'Mr. Darwin's Critics,' in the 'Contemporary Review,' Nov. 1871, p. 462, and in his 'Critiques and Essays,' 1873, p. 279., 168649=43 'Generelle Morphologie,' 1866, B. ii. s. clv., 627732=50 'The Annals of Rural Bengal,' 1868, p. 134., 360359=17 'Die Darwin'sche Art-Lehre,' 1869, s. 54., 332188=75 'The Worship of Animals and Plants,' in the 'Fortnightly Review,' Oct. 1, 1869, p. 422., 511439=14 Mr. St. G. Mivart, 'Transact. Phil. Soc.' 1867, p. 410., 865146=8 'Facts and Arguments for Darwin,' English translat. 1869, p. 20. See the previous discussion on the olfactory threads. Sars has described a somewhat analogous case (as quoted in 'Nature,' 1870, p. 455) in a Norwegian crustacean, the Pontoporeia affinis., 98802=36 The account given by Humboldt of the power of smell possessed by the natives of South America is well known, and has been confirmed by others. M. Houzeau ('Études sur les Facultés Mentales,' &c., tom. i. 1872, p. 91) asserts that he repeatedly made experiments, and proved that Negroes and Indians could recognise persons in the dark by their odour. Dr. W. Ogle has made some curious observations on the connection between the power of smell and the colouring matter of the mucous membrane of the olfactory region, as well as of the skin of the body. I have, therefore, spoken in the text of the dark-coloured races having a finer sense of smell than the white races. See his paper, 'Medico-Chirurgical Transactions,' London, vol. liii., 1870, p. 276, 78775=22 I had written a rough copy of this chapter before reading a valuable paper, \"Caratteri rudimentali in ordine all' origine del uomo\" ('Annuario della Soc. d. Nat.,' Modena, 1867, p. 81), by G. Canestrini, to which paper I am considerably indebted. Häckel has given admirable discussions on this whole subject, under the title of Dysteleology, in his 'Generelle Morphologie' and 'Schöpfungsgeschichte.', 434633=3 Morlot, 'Soc. Vaud. Sc. Nat.' 1860, p. 294., 271550=20 Dr. Jerdon, 'Birds of India, vol. i. 1862, p. xxi. Houzeau says that his parokeets and canary-birds dreamt: 'Facultés Mentales,' tom. ii. p. 136., 905348=21 See Mr. B. T. Lowne's interesting work, 'On the Anatomy of the Blow-fly, Musca vomitoria,' 1870, p. 14. He remarks (p. 33) that, \"the captured flies utter a peculiar plaintive note, and that this sound causes other flies to disappear.\", 877359=15 Mr. Ch. Fraser, in 'Proc. Zoolog. Soc.' 1869, p. 3. I am indebted to Mr. Bate for Dr. Power's statement., 256590=8 All the following statements, given on the authority of these two naturalists, are taken from Rengger's 'Naturgesch. der Säugethiere von Paraguay,' 1830, s. 41-57, and from Brehm's 'Thierleben,' B. i. s. 10-87., 274465=22 Mr. L. H. Morgan's work on 'The American Beaver,' 1868, offers a good illustration of this remark. I cannot help thinking, however, that he goes too far in underrating the power of Instinct., 599013=When Tasmania was first colonised the natives were roughly estimated by some at 7000 and by others at 20,000. Their number was soon greatly reduced, chiefly by fighting with the English and with each other. After the famous hunt by all the colonists, when the remaining natives delivered themselves up to the government, they consisted only of 120 individuals,37 who were in 1832 transported to Flinders Island. This island, situated between Tasmania and Australia, is forty miles long, and from twelve to eighteen miles broad: it seems healthy, and the natives were well treated. Nevertheless, they suffered greatly in health. In 1834 they consisted (Bonwick, p. 250) of forty-seven adult males, forty-eight adult females, and sixteen children, or in all of 111 souls. In 1835 only one hundred were left., 747268=36 Dr. Chapuis, 'Le Pigeon Voyageur Belge,' 1865, p. 87. Boitard et Corbié, 'Les Pigeons de Volière,' &c. 1824, p. 173. See, also, on similar differences in certain breeds at Modena, 'Le variazioni dei Colombi domestici,' del Paolo Bonizzi, 1873., 1015533=23 'Nature,' April 27th, 1871, p. 508. Mr. Meldola quotes Donzel, in 'Soc. Ent. de France,' 1837, p. 77, on the flight of butterflies whilst pairing. See also Mr. G. Fraser, in 'Nature,' April 20th, 1871, p. 489, on the sexual differences of several British butterflies., 423118=47 Maudsley, 'Body and Mind,' 1870, p. 60., 70773=13 Huxley, 'Man's Place in Nature,' 1863, p. 34., 2977=LONDON: JOHN MURRAY, ALBEMARLE STREET. 1882., 351268=8 Mr. R. Brown in 'Proc. Zoolog. Soc.' 1868, p. 409., 324028=the Rev. F. W. Farrar, in an interesting article, entitled 'Philology and Darwinism' in 'Nature,' March 24th, 1870, p. 528., 135733=15 'Hist. Gén. et Part. des Anomalies de l'Organisation,' in three volumes, tom. i. 1832., 458069=14 See the fifth and sixth columns, compiled from good authorities, in the table given in Mr. E. R. Lankester's 'Comparative Longevity,' 1870, p. 115., 168747=44 Carl Vogt's 'Lectures on Man,' Eng. translat. 1864, p. 151., 563145=vinces of the Animal World,' Charleston, 1855, p. 44., 680295=1 Westwood, 'Modern Class. of Insects,' vol. ii. 1840, p. 541. For the statement about Tanais, mentioned below, I am indebted to Fritz Müller., 508139=12 This is nearly the same classification as that provisionally adopted by Mr. St. George Mivart ('Transact. Philosoph. Soc.' 1867, p. 300), who, after separating the Lemuridæ, divides the remainder of the Primates into the Hominidæ, the Simiadæ which answer to the Catarhines, the Cebidæ, and the Hapalidæ,—these two latter groups answering to the Platyrhines. Mr. Mivart still abides by the same view; see 'Nature,' 1871, p. 481., 581604=22 'Lectures on Man,' Eng. translat. 1864, p. 468., 572681=17 For instance with the aborigines of America and Australia. Prof. Huxley says ('Transact. Internat. Congress of Prehist. Arch.' 1868, p. 105), that the skulls of many South Germans and Swiss are \"as short and as broad as those of the Tartars,\" &c., 283371=29 I am glad to find that so acute a reasoner as Mr. Leslie Stephen ('Darwinism and Divinity, Essays on Free-thinking,' 1873, p. 80), in, 156121=symmetrically on the breast; and more especially from one case, in which a single efficient mamma occurred in the inguinal region of a woman, the daughter of another woman with supernumerary mammæ. But I now find (see, for instance, Prof. Preyer, 'Der Kampf um das Dasein,' 1869, s. 45) that mammæ erraticæ occur in other situations, as on the back, in the armpit, and on the thigh; the mammæ in this latter instance having given so much milk that the child was thus nourished. The probability that the additional mammæ are due to reversion is thus much weakened; nevertheless, it still seems to me probable, because two pairs are often found symmetrically on the breast; and of this I myself have received information in several cases. It is well known that some Lemurs normally have two pairs of mammæ on the breast. Five cases have been recorded of the presence of more than a pair of mammæ (of course rudimentary) in the male sex of mankind; see 'Journal of Anat. and Physiology,' 1872, p. 56, for a case given by Dr. Handyside, in which two brothers exhibited this peculiarity; see also a paper by Dr. Bartels, in 'Reichert's and du Bois-Reymond's Archiv.,' 1872, p. 304. In one of the cases alluded to by Dr. Bartels, a man bore five mammæ, one being medial and placed above the navel; Meckel von Hemsbach thinks that this latter case is illustrated by a medial mamma occurring in certain Cheiroptera. On the whole, we may well doubt if additional mammæ would ever have been developed in both sexes of mankind, had not his early progenitors been provided with more than a single pair., 819912=81 Blanchard, 'Métamorphoses, Mœurs des Insectes,' 1868, pp. 215-226., 839325=amount to 36,272, and the females to 33,128, or as 109.49 to 100. The males under seventeen years amounted to 10,773, and the females under the same age to 9593, or as 112.3 to 100. From the census of 1872, the proportion of males of all ages (including half-castes) to females, is as 125.36 to 100. It must be borne in mind that all these returns for the Sandwich Islands give the proportion of living males to living females, and not of the births; and judging from all civilised countries the proportion of males would have been considerably higher if the numbers had referred to births.99, 331865=74 See an excellent article on this subject by the Rev. F. W. Farrar, in the 'Anthropological Review,' Aug. 1864, p. ccxvii. For further facts see Sir J. Lubbock, 'Prehistoric Times,' 2nd edit. 1869, p. 564; and especially the chapters on Religion in his 'Origin of Civilisation,' 1870., 502444=8 Quoted by Reade, 'The African Sketch Book,' vol. i., 1873. p. 152., 360039=14 As Mr. Bain states, \"effective aid to a sufferer springs from sympathy proper:\" 'Mental and Moral Science,' 1868, p. 245., 886893=25 Hilgendorf, however, has lately called attention to an analogous structure in some of the higher crustaceans, which seems adapted to produce sound; see 'Zoological Record,' 1869, page 603., 192994=64 Latham, 'Man and his Migrations,' 1851, p. 135., 78437=18 'Die Grosshirnwindungen des Menschen,' 1868, s. 95., 526273=24 'Mémoires de l'Acad. des Sciences de St. Pétersbourg,' tom. x. No. 15, 1866., 808507=69 Leuckart quotes Bloch (Wagner, 'Handwörterbuch der Phys.,' B. iv. 1853, s. 775), that with fish there are twice as many males as females., 644437=67 See Prof. Schauffhausen, translat. in 'Anthropological Review,' Oct. 1868, p. 429., 66827=5 'Naturgeschichte der Säugethiere von Paraguay,' 1830, s. 50., 741469=33 'The Variation of Animals and Plants under Domestication,' vol. ii. 1868, p. 75. In the last, 95967=35 Müller's 'Elements of Physiology,' Eng. translat., 1842, vol. ii. p. 1117. Owen, 'Anatomy of Vertebrates,' vol. iii. p. 260; ibid. on the Walrus, 'Proc. Zoolog. Soc.' November 8th, 1854. See also R. Knox, 'Great Artists and Anatomists,' p. 106. This rudiment apparently is somewhat larger in Negroes and Australians than in Europeans, see Carl Vogt, 'Lectures on Man,' Eng. translat. p. 129., 138943=18 For the Polynesians, see Prichard's 'Physical Hist. of Mankind,' vol. v. 1847, p. 145, 283. Also Godron, 'De l'Espece,' tom. ii. p. 289. There is also a remarkable difference in appearance between the closely-allied Hindoos inhabiting the Upper Ganges and Bengal; see Elphinstone's 'History of India,' vol. i. p 324., 658246=72 Notes more especially on the bridging convolutions in the Brain of the Chimpanzee, 'Proceedings of the Royal Society of Edinburgh,' 1865-6., 174243=49 See also Prof. Macalister in 'Proc. R. Irish Academy,' vol. x. 1868, p. 124., 289110=32 For additional evidence, with details, see M. Houzeau, 'Les Facultés Mentales,' tom. ii. 1872, p. 147., 616306=44 'The Indian Medical Gazette, Nov. 1, 1871, p. 240., 914262=31 'The Naturalist on the Amazons,' vol. i. 1863, p. 252. Mr. Bates gives a very interesting discussion on the gradations in the musical apparatus of the three families. See also Westwood, 'Modern Class.' vol. ii. pp. 445 and 453., 816185=79 'Proc. Entomolog. Soc.' Feb. 17th, 1868., 837232=In the Sandwich Islands, the males exceed the females in number. Infanticide was formerly practised there to a frightful extent, but was by no means confined to female infants, as is shewn by Mr. Ellis,96 and as I have been informed by Bishop Staley and the Rev. Mr. Coan. Nevertheless, another apparently trustworthy writer, Mr. Jarves,97 whose observations apply to the whole archipelago, remarks:—\"Numbers of women are to be found, who confess to the murder of from three to six or eight children;\" and he adds, \"females from being considered less useful than males were more often destroyed.\" From what is known to occur in other parts of the world, this statement is probable; but must be received with much caution. The practice of infanticide ceased about the year 1819, when idolatry was abolished and missionaries settled in the Islands. A careful census in 1839 of the adult and taxable men and women in the island of Kauai and in one district of Oahu (Jarves, p. 404), gives 4723 males and 3776 females; that is in the ratio of 125.08 to 100. At the same time the number of males under fourteen years in Kauai and under eighteen in Oahu was 1797, and of females of the same ages 1429; and here we have the ratio of 125.75 males to 100 females., 935754=56 See an interesting article, 'The Writings of Fabre,' in 'Nat. Hist. Review,' April 1862, p. 122., 177483=possibility of either of his first propositions. Prof. Macalister has also described ('Proc. R. Irish Acad.' vol. x. 1864, p. 138) variations in the flexor pollicis longus, remarkable from their relations to the same muscle in the Quadrumana., 606551=The decrease of the native population of the Sandwich Islands is as notorious as that of New Zealand. It has been roughly estimated by those best capable of judging, that when Cook discovered the Islands in 1779, the population amounted to about 300,000. According to a loose census in 1823, the numbers then were 142,050. In 1832, and at several subsequent periods, an accurate census was officially taken, but I have been able to obtain only the following returns:, 187215=61 'Primitive Marriage,' 1865., 357115=13 As quoted by Mr. L. H. Morgan, 'The American Beaver,' 1868, p. 272. Capt. Stansbury also gives an interesting account of the manner in which a very young pelican, carried away by a strong stream, was guided and encouraged in its attempts to reach the shore by half a dozen old birds., 663060=So far as the structure of the adult brain is concerned, then, the very considerable additions to our knowledge, which have been made by the researches of so many investigators, during the past ten years, fully justify the statement which I made in 1863. But it has been said that, admitting the similarity between the adult brains of man and apes, they are nevertheless, in reality, widely different, because they exhibit fundamental differences in the mode of their development. No one would be more ready than I to admit the force of this argument, if such fundamental differences of development really exist. But I deny that they do exist. On the contrary, there is a fundamental agreement in the development of the brain in men and apes., 832919=94 'The Todas,' 1873, pp. 100 111, 194, 196., 929027=47 The Œcanthus nivalis. Harris, 'Insects of New England,' 1842, p. 124. The two sexes of Œ. pellucidus of Europe differ, as I hear from Victor Carus, in nearly the same manner., 164461=40 'Annuario della Soc. dei Naturalisti in Modena,' 1867, p. 83. Prof. Canestrini gives extracts on this subject from various authorities. Laurillard remarks, that as he has found a complete similarity in the form, proportions, and connection of the two malar bones in several human subjects and in certain apes, he cannot consider this disposition of the parts as simply accidental. Another paper on this same anomaly has been published by Dr. Saviotti in the 'Gazzetta delle Cliniche,' Turin, 1871, where he says that traces of the division may be detected in about two per cent. of adult skulls; he also remarks that it more frequently occurs in prognathous skulls, not of the Aryan race, than in others. See also G. Delorenzi on the same subject; 'Tre nuovi casi d' anomalia dell' osso, malare,' Torino, 1872. Also, E. Morselli, 'Sopra una rara anomalia dell' osso malare,' Modena, 1872. Still more recently Gruber has written a pamphlet on the division of this bone. I give these references because a reviewer, without any grounds or scruples, has thrown doubts on my statements., 320684=66 Macgillivray, 'Hist. of British Birds,' vol. ii. 1839, p. 29. An excellent observer, Mr. Blackwall, remarks that the magpie learns to pronounce single words, and even short sentences, more readily than almost any other British bird; yet, as he adds, after long and closely investigating its habits, he has never known it, in a state of nature, display any unusual capacity for imitation. 'Researches in Zoology,' 1834, p. 158., 85305=26 Prof. W. Turner, 'Proc. Royal Soc. Edinburgh,' 1866-67, p. 65., 551328=3 See, for instance, Mr. Marshall's account of the brain of a Bushwoman, in 'Phil. Transact.' 1864, p. 519., 514355=17 Dr. C. Forsyth Major, 'Sur les Singes Fossiles trouvés en Italie:' 'Soc. Ital. des Sc. Nat.' tom. xv. 1872., 149438=34 Mr. Forbes' valuable paper is now published in the 'Journal of the Ethnological Soc. of London,' new series. vol. ii. 1870, p. 193., 212684=skulls from graves in Paris were larger than those from vaults of the twelfth century, in the proportion of 1484 to 1426; and that the increased size, as ascertained by measurements, was exclusively in the frontal part of the skull—the seat of the intellectual faculties. Prichard is persuaded that the present inhabitants of Britain have \"much more capacious brain-cases\" than the ancient inhabitants. Nevertheless, it must be admitted that some skulls of very high antiquity, such as the famous one of Neanderthal, are well developed and capacious.81 With respect to the lower animals, M. E. Lartet,82 by comparing the crania of tertiary and recent mammals belonging to the same groups, has come to the remarkable conclusion that the brain is generally larger and the convolutions are more complex in the more recent forms. On the other hand, I have shewn83 that the brains of domestic rabbits are considerably reduced in bulk, in comparison with those of the wild rabbit or hare; and this may be attributed to their having been closely confined during many generations, so that they have exerted their intellect, instincts, senses and voluntary movements but little., 917433=34 'Zeitschrift für wissenschaft. Zoolog.' B. xvii. 1867, s. 117., 597006=31 Dr. Gerland 'Ueber das Aussterben der Naturvölker,' 1868, s. 82., 469995=25 Dr. Duncan remarks ('Fecundity, Fertility,' &c., 1871 p. 334) on this subject; \"At every age the healthy and beautiful go over from the unmarried side to the married, leaving the unmarried columns crowded with the sickly and unfortunate.\", 631431=59 'The Plurality of the Human Race' (translat.), 1864, p. 60., 484339=36 Sir J. Lubbock, 'Prehistoric Times,' 2nd edit. 1869, chap. xv. and xvi. et passim. See also the excellent 9th chapter in Tylor's 'Early History of Mankind,' 2nd edit., 1870., 1036600=33 'Proc. Entomolog. Soc.' Dec. 3rd, 1866, p. xlv., and March 4th, 1867, p. lxxx., 88155=29 'The Diseases of the Ear,' by J. Toynbee, F.R.S., 1860, p. 12. A distinguished physiologist, Prof. Preyer, informs me that he had lately been experimenting on the function of the shell of the ear, and has come to nearly the same conclusion as that given here., 588183=28 'Prehistoric Times,' 1869, page 574., 581691=23 'Die Racen des Schweines,' 1860, s. 46. 'Vorstudien für Geschichte, &c., Schweineschädel,' 1864, s. 104. With respect to cattle, see M. de Quatrefages, 'Unité de l'Espèce Humaine,' 1861, p. 119., 81663=23 Some good criticisms on this subject have been given by Messrs. Murie and Mivart, in 'Transact. Zoolog. Soc.' 1869, vol. vii. p. 92., 686168=4 M. Perrier advances this case ('Revue Scientifique,' Feb. 1, 1873, p. 865) as one fatal to the belief in sexual selection, inasmuch as he supposes that I attribute all the differences between the sexes to sexual selection. This distinguished naturalist, therefore, like so many other Frenchmen, has not taken the trouble to understand even the first principles of sexual selection. An English naturalist insists that the claspers of certain male animals could not have been developed through the choice of the female! Had I not met with this remark, I should not have thought it possible for any one to have read this chapter and to have imagined that I maintain that the choice of the female had anything to do with the development of the prehensile organs in the male., 963935=74 Landois, 'Zeitschrift für wiss. Zoolog.' B. xvii. 1867, s. 127., 340638=1 See, for instance, on this subject, Quatrefages, 'Unité de l'Espèce Humaine,' 1861, p. 21, &c., 396098=29 E. B. Tylor in 'Contemporary Review,' April, 1873, p. 707., 167509=41 A whole series of cases is given by Isid. Geoffroy St.-Hilaire, 'Hist. des Anomalies,' tom. iii. p. 437. A reviewer ('Journal of Anat. and Physiology,' 1871, p. 366) blames me much for not having discussed the numerous cases, which have been recorded, of various parts arrested in their development. He says that, according to my theory, \"every transient condition of an organ, during its development, is not only a means to an end, but once was an end in itself.\" This does not seem to me necessarily to hold good. Why should not variations occur during an early period of development, having no relation to reversion; yet such variations might be preserved and accumulated, if in any way serviceable, for instance, in shortening and simplifying the course of development? And again, why should not injurious abnormalities, such as atrophied or hypertrophied parts, which have no relation to a former state of existence, occur at an early period, as well as during maturity?, 597218=33 See remarks to this effect in Sir H. Holland's 'Medical Notes and Reflections,' 1839, p. 390., 719180=18 Kirby and Spence, 'Introduction to Entomology,' vol. iii. 1826, p. 342., 851297=1 'Archives de Zoolog. Expér.,' Oct. 1872, p. 563., 726105=26 'Massachusetts Medical Soc. ii. No. 3, 1868, p. 9., 880482=19 This author has recently published a valuable essay on the 'Caratteri sessuali secondarii degli Arachnidi,' in the 'Atti della Soc. Veneto-Trentina di Sc. Nat. Padova,' vol. i. Fasc. 3, 1873., 789494=52 'West Riding Lunatic Asylum Reports,' vol. i. 1871, p. 8. Sir J. Simpson has proved that the head of the male infant exceeds that of the female by 3-8ths of an inch in circumference, and by 1-8th in transverse diameter. Quetelet has shewn that woman is born smaller than man; see Dr. Duncan, 'Fecundity, Fertility, Sterility,' 1871, p. 382., 786223=51 'British and Foreign Medico-Chirurg. Review,' April, 1867, p. 343. Dr. Stark also remarks ('Tenth Annual Report of Births, Deaths, &c., in Scotland,' 1867, p. xxviii.) that \"These examples may suffice to shew that, at almost every stage of life, the males in Scotland have a greater liability to death and a higher death-rate than the females. The fact, however, of this peculiarity being most strongly developed at that infantile period of life when the dress, food, and general treatment of both sexes are alike, seems to prove that the higher male death-rate is an impressed, natural, and constitutional peculiarity due to sex alone.\", 553209=4 Wallace, 'The Malay Archipelago,' vol. ii. 1869, p. 178., 877503=16 Claus, 'Die freilebenden Copepoden,' 1863. s. 35., 794242=Dogs.—During a period of twelve years, from 1857 to 1868, the births of a large number of greyhounds, throughout England, were sent to the 'Field' newspaper; and I am again indebted to Mr. Tegetmeier for carefully tabulating the results. The recorded births were 6878, consisting of 3605 males and 3273 females, that is, in the proportion of 110.1 males to 100 females. The greatest fluctuations occurred in 1864, when the proportion was as 95.3 males, and in 1867, as 116.3 males to 100 females. The above average proportion of 110.1 to 100 is probably nearly correct in the case of the greyhound, but whether it would hold with other domesticated breeds is in some degree doubtful. Mr. Cupples has enquired from several great breeders of dogs, and finds that all without exception believe that females are produced in excess; but he suggests that this belief may have arisen from females being less valued, and from the consequent disappointment producing a stronger impression on the mind., 105839=44 'On the Primitive Form of the Skull,' Eng. translat. in 'Anthropological Review' Oct. 1868, p. 426., 959607=69 'Entomological Magazine,' vol. i. 1833, p. 82. See also on the conflicts of this species, Kirby and Spence, ibid. vol. iii. p. 314; and Westwood, ibid. vol. i. p. 187., 624790=48 These details are taken from 'The Mutineers of the \"Bounty,\"' by Lady Belcher, 1870; and from 'Pitcairn Island,' ordered to be printed by the House of Commons, May 29th, 1863. The following statements about the Sandwich Islanders are from the 'Honolulu Gazette,' and from Mr. Coan., 126603=6 'Proc. R. Irish Academy,' vol. x. 1868, p. 141., 393213=28 'Insanity in Relation to Law;' Ontario, United States, 1871, p. 14., 356925=11 'Annals and Mag. of Nat. Hist.,' November, 1868, p. 382., 502304=7 'Ueber die Richtung der Haare,' &c., Müller's 'Archiv für Anat. und Phys.' 1837, s. 51., 420231=46 Letter to Mr. Mill in Bain's 'Mental and Moral Science,' 1868, p. 722., 644559=68 Mr. Catlin states ('N. American Indians,' 3rd edit. 1842, vol. I. p. 49) that in the whole tribe of, 168859=45 C. Carter Blake, on a jaw from La Naulette, 'Anthropolog. Review,' 1867, p. 295. Schaaffhausen, ibid. 1868, p. 426., 472775=27 Mr. Greg, 'Fraser's Magazine,' Sept. 1868, p. 357., 1003751=18 'Proc. Ent. Soc. of London,' July 6, 1868, p. xxvii., 800909=61 'Illustrations of the Zoology of S. Africa,' 1849, pl. 29., 63962=2 'Leç. sur la Phys.' 1866, p. 890, as quoted by M. Dally, 'L'Ordre des Primates et le Transformisme,' 1868, p. 29., 919343=38 Landois, 'Zeitsch. f. wiss. Zoolog.' B. xvii. 1867, s. 121, 122., 544603=the existing tidal Ascidians. Many instances of such periodic processes might be given, as the gestation of mammals, the duration of fevers, &c. The hatching of eggs affords also a good example, for, according to Mr. Bartlett ('Land and Water,' Jan. 7, 1871), the eggs of the pigeon are hatched in two weeks: those of the fowl in three; those of the duck in four; those of the goose in five; and those of the ostrich in seven weeks. As far as we can judge, a recurrent period, if approximately of the right duration for any process or function, would not, when once gained, be liable to change; consequently it might be thus transmitted through almost any number of generations. But if the function changed, the period would have to change, and would be apt to change almost abruptly by a whole week. This conclusion, if sound, is highly remarkable; for the period of gestation in each mammal, and the hatching of each bird's eggs, and many other vital processes, thus betray to us the primordial birthplace of these animals., 187295=62 A writer in the 'Spectator' (March 12th, 1871, p. 320) comments as follows on this passage:—\"Mr. Darwin finds himself compelled to reintroduce a new doctrine of the, 812512=77 Quoted by Trimen, 'Transect. Ent. Soc.' vol. v. part iv. 1866, p. 330., 126702=7 'Act. Acad. St. Petersburg,' 1778, part ii. p. 217., 434400=2 After a time the members or tribes which are absorbed into another tribe assume, as Sir Henry Maine remarks ('Ancient Law,' 1861, p. 131), that they are the co-descendants of the same ancestors., 493608=3 Westwood, 'Modern Class of Insects,' vol. ii. 1840, p. 87., 1005580=19 Harris, 'Treatise,' &c., edited by Flint, 1862, p. 395., 1006656=21 It is remarkable, that in the Shetland Islands the male of this moth, instead of differing widely from the female, frequently resembles her closely in colour (see Mr. MacLachlan, 'Transact. Ent. Soc.' vol. ii. 1866, p. 459). Mr. G. Fraser suggests ('Nature,' April 1871, p. 489) that at the season of the year when the ghost-moth appears in these northern islands, the whiteness of the males would not be needed to render them visible to the females in the twilight night., 85407=27 See my 'Expression of the Emotions in Man and Animals,' 1872, p. 144., 935890=57 'Journal of Proc. of Entomolog. Soc.' Sept. 7th, 1863, p. 169., 622681=So again in the interval between the census of 1866 and 1872 the natives of full blood in the Sandwich Islands decreased by 8081, whilst the half-castes, who are believed to be healthier, increased by 847; but I do not know whether the latter number includes the offspring from the half-castes, or only the half-castes of the first generation., 610556=island.\" This is almost exactly the same average as with the Tasmanians at Oyster Cove. Jarves, who published his History in 1843, says that \"families who have three children are freed from all taxes; those having more, are rewarded by gifts of land and other encouragements.\" This unparalleled enactment by the government well shews how infertile the race had become. The Rev. A. Bishop stated in the Hawaiian 'Spectator' in 1839, that a large proportion of the children die at early ages, and Bishop Staley informs me that this is still the case, just as in New Zealand. This has been attributed to the neglect of the children by the women, but it is probably in large part due to innate weakness of constitution in the children, in relation to the lessened fertility of their parents. There is, moreover, a further resemblance to the case of New Zealand, in the fact that there is a large excess of male over female births: the census of 1872 gives 31,650 males to 25,247 females of all ages, that is 125.36 males for every 100 females; whereas in all civilised countries the females exceed the males. No doubt the profligacy of the women may in part account for their small fertility; but their changed habits of life is a much more probable cause, and which will at the same time account for the increased mortality, especially of the children. The islands were visited by Cook in 1779, by Vancouver in 1794, and often subsequently by whalers. In 1819 missionaries arrived, and found that idolatry had been already abolished, and other changes effected by the king. After this period there was a rapid change in almost all the habits of life of the natives, and they soon became \"the most civilised of the Pacific Islanders.\" One of my informants, Mr. Coan, who was born on the islands, remarks that the natives have undergone a greater change in their habits of life in the course of fifty years than Englishman during a thousand years. From information received from Bishop Staley, it does not appear that the poorer classes have ever much changed their diet, although many new kinds of fruit have been introduced, and the sugar-cane is in universal use. Owing, however, to their passion for imitating Europeans, they altered their manner of dressing at an early period, and the use of alcoholic drinks became very general. Although these changes appear inconsiderable, I can well believe, from what is known with respect to animals, that they might suffice to lessen the fertility of the natives.43, 283157=27 'The Moor and the Loch,' p. 45. Col. Hutchinson on 'Dog Breaking,' 1850, p. 46., 726016=25 Proc. Royal Irish Academy,' vol. x. 1868, p. 123., 674648=80 For example, M. l'Abbé Lecomte in his terrible pamphlet 'Le Darwinisme at l'origine de l'Homme,' 1873., 650870=70 'Die Grosshirn-Windungen des Menschen;' 'Abhandlungen der K. Bayerischen Akademie,' Bd. x., 1868., 138780=17 'Investigations in Military and Anthrop. Statistics,' &c. 1869, by B. A. Gould, p. 93, 107, 126, 131, 134., 816265=80 Quoted by Dr. Wallace in 'Proc. Ent. Soc.' 3rd series, vol. v 1867, p. 487., 1036718=34 See Mr. J. Jenner Weir's paper on Insects and Insectivorous Birds, in 'Transact. Ent. Soc.' 1869, p. 21; also Mr. Butler's paper, ibid. p. 27. Mr. Riley has given analogous facts in the 'Third Annual Report on the Noxious Insects of Missouri,' 1871, p. 148. Some opposed cases are, however, given by Dr. Wallace and M. H. d'Orville: see 'Zoological Record,' 1869, p. 349., 289259=33 See, with respect to birds on oceanic islands, my 'Journal of Researchers during the voyage of the \"Beagle,\"' 1845, p. 398. 'Origin of Species,' 5th edit. p. 260., 304299=50 'Facultés Mentales des Animaux,' tom. ii. 1872, p. 346-349., 764583=44 In the common peacock (Pavo cristatus) the male alone possesses spurs, whilst both sexes of the Java Peacock (P. muticus) offer the unusual case of being furnished with spurs. Hence I fully expected that in the latter species they would have been developed earlier in life than in the common peacock; but M. Hegt of Amsterdam informs me, that with young birds of the previous year, of both species, compared on April 23rd, 1869, there was no difference in the development of the spurs. The spurs, however, were as yet represented merely by slight knobs or elevations. I presume that I should have been informed if any difference in the rate of development had been observed subsequently., 383387=25 I refer here to the distinction between what has been called material and formal morality. I am glad to find that Prof. Huxley ('Critiques and Addresses,' 1873, p. 287) takes the same view on this subject as I do. Mr. Leslie Stephen remarks ('Essays on Freethinking and Plain Speaking,' 1873, p. 83), \"the metaphysical distinction between material and formal morality is as irrelevant as other such distinctions.\", 464126=21 'Tenth Annual Report of Births, Deaths, &c., in Scotland, 1867, p. xxix., 523229=22 'Palæontology,' 1860, p. 199., 327070=72 See some good remarks on the simplification of languages, by Sir J. Lubbock, 'Origin of Civilisation, 1870, p. 278., 308619=54 Hon. Daines Barrington in 'Philosoph. Transactions,' 1773, p. 262. See also Dureau de la Malle, in 'Ann. des. Sc. Nat.' 3rd series, Zoolog. tom. x. p. 119., 286437=30 See 'Madness in Animals,' by Dr. W. Lauder Lindsay, in 'Journal of Mental Science,' July 1871., 277512=24 'Facultés Mentales des Animaux,' 1872, tom. ii. p. 265., 825189=84 Günther's 'Record of Zoological Literature,' 1867, p. 260. On the excess of female Lucanus, ibid. p. 250. On the males of Lucanus in England, Westwood, 'Modern Class. of Insects,' vol. i. p. 187. On the Siagonium, ibid. p. 172., 658425=73 Flower 'On the Anatomy of Pithecia Monachus,' 'Proceedings of the Zoological Society,' 1862., 410413=42 Mill recognises ('System of Logic,' vol. ii. p. 422) in the clearest manner, that actions may be performed through habit without the anticipation of pleasure. Mr. H. Sidgwick also, in his Essay on Pleasure and Desire ('The Contemporary Review,' April 1872. p. 671), remarks: \"To sum up, in contravention of the doctrine that our conscious active impulses are always directed towards the production of agreeable sensations in ourselves, I would maintain that we find everywhere in consciousness extra-regarding impulse, directed towards something that is not pleasure; that in many cases the impulse is so far incompatible with the self-regarding that the two do not easily co-exist in the same moment of consciousness.\" A dim feeling that our impulses do not by any means always arise from any contemporaneous or anticipated pleasure, has, I cannot but think, been one chief cause of the acceptance of the intuitive theory of morality, and of the rejection of the utilitarian or \"Greatest happiness\" theory. With respect to the latter theory, the standard and the motive of conduct have no doubt often been confused, but they are really in some degree blended., 808689=70 Quoted in the 'Farmer,' March 18, 1869, p. 369., 979424=1 Apatura Iris: 'The Entomologist's Weekly Intelligence,' 1859, p. 139. For the Bornean Butterflies, see C. Collingwood, 'Rambles of a Naturalist,' 1868, p. 183., 490199=2 Some of the most interesting facts ever published on the habits of ants are given by Mr. Belt, in in his 'Naturalist in Nicaragua,' 1874. See also Mr. Moggridge's admirable work, 'Harvesting Ants,' &c., 1873, also 'L'Instinct chez les Insectes,' by M. George Pouchet, 'Revue des Deux Mondes,' Feb. 1870, p. 682.}", "textBeforeTable": "PRINCIPAL ADDITIONS AND CORRECTIONS TO THE PRESENT EDITION. OF THE TABLE [page vii] September, 1874. DOWN, BECKENHAM, KENT, structure; nor must we forget what I have called \"correlated\" growth, meaning, thereby, that various parts of the organisation are in some unknown manner so connected, that when one part varies, so do others; and if variations in the one are accumulated by selection, other parts will be modified. Again, it has been said by several critics, that when I found that many details of structure in man could not be explained through natural selection, I invented sexual selection; I gave, however, a tolerably clear sketch of this principle in the first edition of the 'Origin of Species,' and I there stated that it was applicable to man. This subject of sexual selection has been treated at full length in the present work, simply because an opportunity was here first afforded me. I have been struck with the likeness of many of the half-favourable criticisms on sexual selection, with those which appeared at first on natural selection; such as, that it would explain some few details, but certainly was not applicable to the extent to which I have employed it. My conviction of the power of sexual selection remains unshaken; but it is probable, or almost certain, that several of my conclusions will hereafter be found erroneous; this can hardly fail to be the case in the first treatment of a subject.", "textAfterTable": "150 58-9 Disappearance of the tail in man and certain monkeys. 169 134-5 Injurious forms of selection in civilised nations. 180 143 Indolence of man, when free from a struggle for existence. 193 151 Gorilla protecting himself from rain with his hands. 208, note. 161, note Hermaphroditism in fish. 209 163 Rudimentary mammæ in male mammals. 239 188-190 Changed conditions lessen fertility and cause ill-health amongst savages. 245 195-6 Darkness of skin a protection against the sun. 250 199-206 Note by Professor Huxley on the development of the brain in man and apes. 256 209-210 Special organs of male parasitic worms for holding the female.", "hasKeyColumn": true, "keyColumnIndex": 2, "headerRowIndex": 0}