{"relation": [["Response", "Whenever they're available", "Often", "Sometimes", "Seldom", "Never", "No Response"], ["# of Respondents", "323", "310", "499", "333", "261", "55"], ["% of Respondents", "18.1%", "17.4%", "28.0%", "18.7%", "14.7%", "3.1%"]], "pageTitle": "WebAIM: Screen Reader User Survey #4 Results", "title": "When a \"skip to main content\" or \"skip navigation\" link is available on a page, how often do you use it?", "url": "http://webaim.org/projects/screenreadersurvey4/", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 24, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988930.94/warc/CC-MAIN-20150728002308-00061-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 259448678, "recordOffset": 259432284, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{28375=The amount of customization is almost identical to what was reported in January 2009. Those with disabilities were more than twice as likely to customize their screen readers than those without disabilities., 29775=47.8% answered \"Yes\" to this question in October 2009 and 60.4% in December 2010. The positive perception of free or low-cost screen readers is increasing., 45950=When compared to responses to the December 2010 survey, there has been a slight increase in the usage of \"skip\" links, though usage is very mixed. This increase in usage seems to be somewhat in conflict with the increase in the use of headings and landmarks as reported above., 26846=Prevalence of JavaScript support was up only slightly from December 2010 (98.4%). 70% of those with JavaScript disabled were using Firefox (presumably with the NoScript add-on enabled) and 17% were using Lynx on Linux., 3565=In May 2012, WebAIM conducted a survey of preferences of screen reader users. We received 1782 valid responses to this survey. This was a follow-up survey to the original WebAIM Screen Reader User Survey of January 2009 and the follow-up surveys from October 2009 and December 2010., 36620=As with primary mobile screen readers, VoiceOver usage increased sharply since December 2010 (27.1% to 48.7%) while nearly every other mobile screen reader decreased in usage., 22424=The use of braille output has decreased only slightly since October 2009. As one would expect, the use of braille output is higher among respondents with a disability., 14265=While JAWS is still the most popular screen reader, it has seen a significant decline in primary usage - down to 49% from 66.4% in October 2009 and 59.2% in December 2010. Window-Eyes and ZoomText saw small increases in primary screen reader usage while VoiceOver saw a small decrease in usage. NVDA saw continued increase in usage, up to 13.7% from 2.9% in 2009 and 8.6% in 2010 (a nearly 500% increase in just 2.5 years). Perhaps most surprising is the significant increase in usage of System Access or System Access to Go, jumping to 10.4% from only 4.7% in December 2010., 21007=When compared to October 2009, cost has notably increased as a main reason for using their primary screen reader. This may help explain the shift to less expensive screen readers. Only 1.7% of JAWS users cited Cost as the main reason for using it, compared to 48.3% of NVDA users and 30.3% of System Access users. Availability was cited as the primary reason by VoiceOver users. Existing Comfort/Expertise was cited as the primary reason by JAWS, Window-Eyes, and ZoomText users., 39578=Respondents report that social media sites are only slightly less accessible than was reported in December 2010., 10716=When considering respondents who indicated that they use multiple devices, 1058 respondents (59%) use both a desktop computer and a laptop. 739 respondents (41%) use a screen reader on all three devices. Only 10 respondents reported using a screen reader exclusively on a mobile device., 52213=© 2015 WebAIM, 42580=The use of headings to find information has increased from 50.8% to 60.8% since October 2009. These responses show the prevalent use of headings. Those with advanced screen reader proficiency are more likely to use headings (66% use headings) than those with beginner proficiency (42% use headings). Conversely, those with advanced screen reader proficiency are much less likely to read through the page (5.4%) than those with beginner proficiency (18.4% read through the page)., 31275=This represents a 600% increase in mobile screen reader usage in just over 3 years (only 12% reported using a mobile screen reader in January 2009), though a less significant increase over the 66.7% that reported using a mobile screen reader in December 2010. Those with advanced screen reader proficiency were much more likely to use a screen reader on a mobile device than those with low screen reader proficiency (81% to 49%). Respondents in North America were less likely to use a mobile screen reader than respondents from every other region represented (68% in North America compared to 82% in Europe/UK and 88% in Australia/Oceania, for example).}", "textBeforeTable": "Screen Reader Proficiency 7% 126 No 93% 1610 Yes % of Respondents # of Respondents Response Do you use a screen reader due to a disability? Disability Reported 0.7% 12 Central America and Caribbean 0.9% 16 South America 1.7% 29 Africa/Middle East 3.4% 58 Australia and Oceania 4.8% 82 Asia 15.4% 262 Europe/UK 73.1% 1246 North America % of Respondents # of Respondents Response Region of Respondents Region Demographics We hope to conduct additional surveys of this nature again in the future. If you have recommendations or questions you would like us to ask, please contact us. The sample was not controlled and may not represent all screen reader users. Total responses (n) for each question may not equal 1782 due to respondents not answering that particular question. Totals may not equal 100% due to rounding. A few disclaimers and notices: In May 2012, WebAIM conducted a survey of", "textAfterTable": "# of Respondents % of Respondents Advanced 1125 64.2% Intermediate 588 33.6% Beginner 38 2.2% Internet proficiency has generally remained the same across all surveys. Devices Used On which of the following devices do you use a screen reader? Device # of Respondents % of Respondents Desktop computer 1402 80.8% Laptop 1344 77.4% Mobile device 1056 60.8% When considering respondents who indicated that they use multiple devices, 1058 respondents (59%) use both a desktop computer and a laptop. 739 respondents (41%) use a screen reader on all three devices. Only 10 respondents reported using a screen reader exclusively on a mobile device. Operating System Operating System Response # of Respondents % of Respondents Windows 1547 87% Apple 151 8.5% iOS 59 3.4% Linux 13 0.7% Android 5 0.3% Nokia 3 0.2% Operating system data above was detected from the system used to complete the survey. Of the iOS devices, 46 were using iPhones, 12 were", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}