{"relation": [["", "Calories", "Total Carbohydrate", "Vitamin A (as vitamin A palmitate)", "Vitamin C (as calcium ascorbate)", "Vitamin D (as ergocalciferol)", "Vitamin E (as d-alpha tocopherol acetate)", "Thiamin (as thiamin mononitrate)", "Riboflavin (as riboflavin)", "Niacin (as niacinamide)", "Vitamin B6 (as pyridoxine HCl)", "Folic Acid (as folic acid)", "Vitamin B12 (cyanocobalamin)", "Biotin (as d-biotin)", "Pantothenic Acid (as d-calcium pantothenate)", "Calcium (as calcium carbonate)", "Iodine (as potassium iodide)", "Magnesium (as magnesium oxide)", "Zinc (as zinc oxide)", "Manganese (as TRAACS® manganese glycinate chelate)"], ["Amount Per Serving", "5", "2 g", "2,500 IU", "60 mg", "500 IU", "30 IU", "1.5 mg", "1.7 mg", "20 mg", "2 mg", "400 mcg", "6 mcg", "50 mcg", "10 mg", "150 mg", "150 mcg", "40 mg", "15 mg", "1 mg"], ["%Daily Value", "", "1%*", "50%", "100%", "125%", "100%", "100%", "100%", "100%", "100%", "100%", "100%", "17%", "100%", "15%", "100%", "10%", "100%", "50%"]], "pageTitle": "AlternaVites Kids Multivitamin & Mineral Crystals Raspberry Cotton Candy 30 Pkts - Swanson Health Products", "title": "", "url": "https://www.swansonvitamins.com/alternavites-kids-multivitamin-mineral-crystals-raspberry-cotton-candy-30-pkts?adobeRecordId=ATV002&quantity=1", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990177.43/warc/CC-MAIN-20150728002310-00230-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 914284507, "recordOffset": 914251573, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{86826=†Ratings based on results of the 2015 ConsumerLab.com Vitamin and Supplement Users Survey. More information at www.consumerlab.com/survey2015., 87829=© 2015 Swanson Health Products}", "textBeforeTable": "Servings Per Container: 30 Serving Size: 1 Packet (0.09 oz/2.5 g) Supplement Facts Kids Multivitamin & Mineral Crystals Raspberry Cotton Candy Product Label: AlternaVites Kids is a quick-melting multivitamin and mineral crystal formula with zero grams of sugar and no artificial colors, flavors or sweeteners. Just mix into yogurt, pudding, shakes or smoothies. Can also be sprinkled on top of fruit. Contains no animal products or by-products. Certified kosher pareve. Raspberry Cotton Candy flavor. 30 individually wrapped packets. Raspberry Cotton Candy flavor Free of aspartame and high fructose corn syrup Quick-melting multivitamin & mineral crystals for kids Kids Multivitamin & Mineral Crystals Raspberry Cotton Candy Product Description: If you are dissatisfied for any reason, we'll give you a full refund and pay return shipping. Lee Swanson, President of Swanson Health Products Risk-Free Purchase Guarantee Watch now to learn more \"With my personal 100% money-back satisfaction guarantee, you have nothing to lose and great savings to gain.\" Lee Swanson, President of Swanson Health Products Why Shop Swanson® Brands?", "textAfterTable": "*Percent Daily Values are based on a 2,000 calorie diet. Other ingredients: Mannitol, Xylitol, Natural Flavors, Mono-and Diglycerides, Crospovidone, Stearic Acid. Contains 2% or less of Maltodextrin, Malic Acid. DIRECTIONS FOR USE: As a dietary supplement, children 4 years of age and older - take 1 stick pack per day or as directed by a health care professional. Powder can be poured onto tongue directly from packet or from a spoon. Gradually pour a SMALL amount of crystals onto the FRONT of the tongue Close mouth, allow crystals to dissolve and swallow Repeat until stick pack is empty PLEASE NOTE: It is recommended that you do not pour the entire contents of package on the tongue at once - slow and gradual \"sprinklings\" are best. Each packet of crystals can also be mixed into yogurt, smoothies, puddings, shakes, etc. Entire packet must be consumed to supply the daily dosage. Warnings: Take only as directed. Do not exceed suggested dosage. This product is not recommended for children under 2 years of age due to choking hazard. Keep this product out of the reach of children. In case of accidental overdose, call a doctor or poison control immediately. Long-term intake of high levels of Vitamin A (excluding that sourced from beta-carotene) may increase the risk of osteoporosis in adults. Do not take this product if taking other Vitamin A supplements. Do not use if safety seal is broken or missing, or if packets", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}