{"relation": [["Patient Ratings", "Ease of Appointment", "Promptness", "Courteous Staff", "Accurate Diagnosis", "Bedside Manner", "Spends Time with Me", "Follows Up After Visit"], ["", "3.9", "3.6", "3.9", "3.6", "3.8", "3.6", "3.5"]], "pageTitle": "Dr. Neeraj Gupta, MD - Otolaryngologist in Gainesville, VA", "title": "", "url": "http://www.vitals.com/doctors/Dr_Neeraj_J_Gupta.html", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989826.86/warc/CC-MAIN-20150728002309-00051-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 824841851, "recordOffset": 824814365, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{29968=Copyright © 2015 Vitals. US Patent No. 8, 694, 441. All Rights Reserved.}", "lastModified": "Sat, 01 Aug 2015 20:59:45 GMT", "textBeforeTable": "The overall average patient rating of Dr. Neeraj Gupta is Good. Dr. Gupta has been reviewed by 23 patients who have provided 9 comments. The rating is 3.5 out of 5 stars. (9) Patient comments (23)   3.5 Read patient reviews Patient Reviews View full profile Insurance accepted (31) Map & directions (5) Address & phone number (5) Areas of expertise What's important to you Awards & distinctions Patient reviews (9) Medical school rankings Hospital details & ratings (8) Qualifications View the full profile to get information on: Learn more about Dr. Neeraj Gupta: A medical license is required for a doctor to practice medicine in a particular state. Requirements vary by state but most require, at a minimum, post-graduate training in the doctor’s specific specialty. An NPI number is a national identifier unique to an individual health care provider and is managed by the Center for Medicare & Medicaid Services (CMS). License & Identifications }); window.app.advert.display('skyscraper');", "textAfterTable": "Prepare before visiting Dr. Gupta Home Allergies Patient Education Learn all about home allergies and symptoms of mold, pet, dust and other types of indoor allergy issues with Vitals patient education guide. Before Visiting Dr. Gupta Learn More More Patient Guides & Topics Face Lift Seasonal Allergies More Patient Guides & Topics Specialties & Research Dr. Neeraj Gupta, MD is board certified in Otolaryngology. More Specialties & Research Education & Awards Dr. Gupta graduated from Northeastern Ohio Universities, Rootstown. More Education & Awards Affiliations Dr. Gupta has 8 hospital affiliations: Inova Fairfax Hospital  Inova Fair Oaks Hospital  More Affiliations Languages Spanish Korean Hindi", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}