{"relation": [["Generic Name", "carbamazepine", "gabapentin", "oxcarbazepine", "pregabalin", "topiramate"], ["Brand Name", "Epitol, Tegretol, Gralise, Neurontin, Trileptal, Lyrica, Topamax", "Epitol, Tegretol, Gralise, Neurontin, Trileptal, Lyrica, Topamax", "Epitol, Tegretol, Gralise, Neurontin, Trileptal, Lyrica, Topamax", "Epitol, Tegretol, Gralise, Neurontin, Trileptal, Lyrica, Topamax", "Epitol, Tegretol, Gralise, Neurontin, Trileptal, Lyrica, Topamax"]], "pageTitle": "Anticonvulsants for Chronic Pain: Healthwise Medical Information on eMedicineHealth", "title": "", "url": "http://www.emedicinehealth.com/script/main/art.asp?articlekey=136904&ref=127828", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 2, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988924.75/warc/CC-MAIN-20150728002308-00046-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 429249871, "recordOffset": 429227544, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{20316=Gronseth G, et al. (2008). Practice parameter: The diagnostic evaluation and treatment of trigeminal neuralgia (an evidence-based review): Report of the Quality Standards Subcommittee of the American Academy of Neurology and the European Federation of Neurological Societies. Neurology, 71(15): 1183–1190., 23117=© 1995-2014 Healthwise, Incorporated. Healthwise, Healthwise for every health decision, and the Healthwise logo are trademarks of Healthwise, Incorporated.}", "textBeforeTable": "Examples Slideshow: 10 Secrets to Brighter, Whiter Teeth Dental (Oral) Health Quiz Slideshow: Common Dental Problems and Procedures Anticonvulsants for Chronic Pain « Go Back A A A Font Size >sleep disorders a-z list>sleep disorders center> anticonvulsants for chronic pain healthwise article", "textAfterTable": "How It Works Experts do not know exactly how anticonvulsants work to reduce chronic pain. They may block the flow of pain signals from the central nervous system. Why It Is Used Anticonvulsant drugs typically are used to control seizures in people who have epilepsy. These drugs may also be used to treat other painful conditions, such as postherpetic neuralgia and fibromyalgia. How Well It Works Some anticonvulsant drugs may work better than others for certain conditions. Anticonvulsants seem to work best when they are used for nerve pain. Examples of nerve pain include postherpetic neuralgia and diabetic peripheral neuropathy. About 7 out of 10 people with nerve pain who take carbamazepine have some relief from their pain, at least for a short time.1 Gabapentin helps about 3 to 4 out of 10 people who take it for nerve pain.2 Anticonvulsants can reduce some persistent low back pain.3 Pregabalin helps between 3 and 5 out of 10 people who take it for nerve pain, especially postherpetic neuralgia, diabetic peripheral neuropathy, and fibromyalgia.", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}