{"relation": [["", "Annual Pass type", "Premier AP (both coasts)", "Premium AP", "Annual Pass", "DVC Premium AP", "DVC Annual Pass", "Florida Premium AP", "Florida Annual Pass", "Florida Seasonal Pass", "Florida Weekday Select", "Florida Epcot After 4"], ["", "New", "$1062.45", "$803.01", "$675.21", "$644.33", "$516.33", "$644.33", "$516.53", "$339.74", "$233.24", "$190.64"], ["", "Renewal", "$1062.45", "$680.54", "$574.04", "$542.09", "$435.59", "$542.09", "$435.59", "$286.49", "$197.03", "$158.69"]], "pageTitle": "MousePlanet Park Guide - Walt Disney World - Walt Disney World", "title": "", "url": "http://www.mouseplanet.com/guide/2/Walt-Disney-World", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 1, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042981525.10/warc/CC-MAIN-20150728002301-00078-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 594155855, "recordOffset": 594126780, "tableOrientation": "HORIZONTAL", "textBeforeTable": "Annual Passes 830.70/ 809.40 772.13/ 750.83 734.85/ 713.55 702.90/ 681.60 649.65/ 628.35 585.75/ 564.45 511.20/ 489.90 436.65/ 416.42 334.41/ 320.57 N/A 10 Day 9 Day 8 Day 7 Day 6 Day 5 Day 4 Day 3 Day 2 Day 1 Day Base Ticket with Both Options and No Expiration   468.60/ 447.30 457.95/ 436.65 447.30/ 426.00 436.65/ 415.35 426.00/ 404.70 415.35/ 394.05 404.70/ 383.40 383.40/ 363.17 291.81/ 277.97 191.70/ 185.31 10 Day 9 Day 8 Day 7 Day 6 Day 5 Day 4 Day 3 Day 2 Day 1 Day Base Ticket with Park Hopper and Water Park Options  ", "textAfterTable": "Premier Pass: This pass, equivalent to a Premium Annual Pass at both Disneyland and Walt Disney World, costs $1,029 (plus tax) per year. On-Site Ticket Purchase: Ticket booths can be found at the main gates of Animal Kingdom, Epcot, and Disney's Hollywood Studios. The main ticket booths for Magic Kingdom are located at the Transportation & Ticket Center, though tickets can also be purchased at the Guest Relations window to the right of the main entrance gates of the park. You can also purchase park tickets at any of the resort hotels on property. Online Ticket Purchase: Tickets can be purchased online directly from Disney. Advance purchase discounts are available for tickets good for four days or longer. Other Purchase Locations: Just get to Florida and everybody will be trying to sell you tickets to Walt Disney World, though most of the \"Ticket Discount Centers\" are fronts for timeshare organizations and purchases will come with hard sells. Many hotels in the area of Walt Disney World also sell park tickets. You can also make your ticket purchases at any Disney Store (including annual passes). Parking, Directions, and Transportation - Hide Section Walt Disney World is located in Lake Buena Vista, Florida, just outside of Kissimmee and about 20 miles southwest of Orlando and Orlando International Airport. From the", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}