{"relation": [["Census Year", "1841", "1851", "1861", "1871", "1891"], ["Piece No.", "H.O. 107 / 645", "H.O. 107 / 2106", "R.G. 9 / 2364", "R.G. 10 / 3377", "R.G. 12 / 2596"]], "pageTitle": "GENUKI: Stainton by Langworth, LIN", "title": "", "url": "http://www.genuki.org.uk/big/eng/LIN/Stainton/", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 2, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042992201.62/warc/CC-MAIN-20150728002312-00220-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 463525533, "recordOffset": 463517331, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{6254=This parish is nNortheast of Lincoln parish and city and just south of Snelland parish. The Langworth rivulet runs through the parish. The parish covered about 2,800 acres in 1841, reduced by World War One1900 to only 1,452 acres.}", "lastModified": "Thu, 21 May 2015 02:19:18 GMT", "textBeforeTable": "The table below gives census piece numbers, where known: Check our Census Resource page for county-wide resources. The parish was in the North-East sub-district of the Lincoln Registration District. Census Return to top of page The Orchard Cemetery is a relatively new burial ground for both humans and their pets. It is at 31 Hawthorn Road near Reasby (just north of Stainton village by the railway crossing). The cemetery has a website. Cemeteries Note: There is more than one Stainton in Lincolnshire. Schools Population Poorhouses, Poor Law, etc. Politics and Governance Names, Personal Military Records Maps History Description and Travel Civil Registration Church Records Church History Census Cemeteries Stainton by Langworth Nearby Places Lincolnshire Towns & Parishes     Contents     Lincolnshire", "textAfterTable": "Return to top of page Church History The Anglican parish church is dedicated to Saint John the Baptist. The church is a small, plain stone structure. The original church here was built in the 14th century. The church was rebuilt in 1795. The church was restored in 1885. The church is a Grade II listed building with British Heritage. The church only seats 80. Richard CROFT has a photo of St. John's on Geo-graph, taken in 2005. Here is a photo of St. John's Church, taken by Ron COLE (who retains the copyright): Return to top of page Church Records The Anglican parish register dates from 1720. The LFHS has published several marriage and burial indexes for the Lawres Deanery to make your search easier. In the early 1900's, this parish was in the Wraggoe Deanery. The Lincolnshire FHS has a Loan Library service which has the parish registers on microfiche for Baptisms from 1720 to 1812 and Marriages from 1720 to 1812. Check our Church Records page for county-wide resources. Return to top of page Civil Registration The parish was in the North-East sub-district of the Lincoln Registration District. Check our Civil Registration page for", "hasKeyColumn": false, "keyColumnIndex": -1, "headerRowIndex": 0}