{"relation": [["Role", "First section of the small intestine.", "Primary site of digestion and absoption.", "Role is to absorb remaining water and transport feces to anus.", "Metabolizes nutrients and secretes bile.", "Both and endocrine and exocrine gland. Releases Insulin and Glucagon"], ["Body Part", "", "", "", "", ""]], "pageTitle": "Digestive Roles Quiz - By MaxC2892", "title": "", "url": "http://www.sporcle.com/games/MaxC2892/digestive-roles", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 2, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988065.26/warc/CC-MAIN-20150728002308-00110-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 715780719, "recordOffset": 715758572, "tableOrientation": "HORIZONTAL", "textBeforeTable": "Full Results Challenge Friends Replay Game Share Result Average Score: % % correct You got Enter answer: Challenge Play Timer 07:00 ll Score 0/15 var showNext = true; function displayAnswer(answerSlot, answer, gameOver) { /* If the game is over and either bonus answers are wrong, or the showNext flag has been set to false, we won't display the answer text */ var showAnswer = (gameOver === true && (_spwr || !showNext)) ? false : showans; var theAnswer = (!showAnswer &&", "textAfterTable": "Role Body Part First section of the small intestine. Primary site of digestion and absoption. Role is to absorb remaining water and transport feces to anus. Metabolizes nutrients and secretes bile. Both and endocrine and exocrine gland. Releases Insulin and Glucagon Role Body Part A salivary gland located in the mouth. Digestion/absoption is usually completed by the time it reaches this part of the small intestine. Final structure of digestive tract where waste exits. Final section of the small intestine; role is to transport feces to colon. Responsible for grinding up food in the mouth. You're not logged in! Compare scores with friends on all Sporcle quizzes.", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}