{"relation": [["Talk Title", "Accessibility Support for Designers in Adobe Creative Suite", "Access to PDF: Developments in Support of Assistive Technology with Adobe Acrobat", "Accessible eBooks, ePub, DAISY, and Adobe", "Accessible Web Conferencing Update", "Adobe Flex and Adobe AIR for Accessible Rich Internet Applications", "Assistive Technology Access to Adobe Flash and PDF", "Understanding the End User Role in PDF Accessibility (with AFB Consulting)", "PDF Accessibility – Best Practices for Authoring", "Video Accessibility for Deaf and Hard of Hearing Users in Adobe Flash"], ["File types Available", "PDF PPT", "PDF", "PDF PPTX", "PDF PPTX", "PDF PPTX", "PDF PPT", "PDF PPT", "PDF PPT", "PDF PPTX"]], "pageTitle": "Dreamweaver « Adobe Accessibility", "title": "Adobe Accessibility Talks at CSUN 2010", "url": "https://blogs.adobe.com/accessibility/category/dreamweaver", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988310.3/warc/CC-MAIN-20150728002308-00330-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 850344839, "recordOffset": 850336637, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{5423=Last week, members of the Adobe accessibility team attended the California State University’s “Technology and Persons with Disabilities Conference” – aka CSUN. This is a big event in accessibility each year and if you are interested in accessibility you should consider attending in 2009. Adobe participated in four talks at CSUN:}", "textBeforeTable": "As promised, we’ve posted the slides from the Adobe talks at CSUN. Tweet Slides from CSUN 2010 Talks March 31, 2010 Posts in Category \"Dreamweaver\" Adobe Accessibility adobe.com      ", "textAfterTable": "10:43 AM Permalink March 20, 2008 CSUN 2008 Talks Tweet Last week, members of the Adobe accessibility team attended the California State University’s “Technology and Persons with Disabilities Conference” – aka CSUN. This is a big event in accessibility each year and if you are interested in accessibility you should consider attending in 2009. Adobe participated in four talks at CSUN: IAccessible2 Development: An Accessibility API that Works for Assistive Technologies and Applications. This was a panel discussion involving IT and assistive technology companies. Accessible PDF Authoring Techniques. This was a talk by Greg Pisocky and Pete DeVasto from Adobe and Brad Hodges from the American Foundation for the Blind. The presentation slides are available. Rich Internet Applications with Flash and Dreamweaver. This was a talk by Matt May and Andrew Kirkpatrick discussing Flash and AJAX accessibility, related to Adobe’s SPRY framework, Flash and Flex. The presentation slides are available. Accessible Internet Video. This was a talk by Andrew Kirkpatrick on how you can deliver the most accessible experience in video online using Flash. The presentation slides are available. I’m going to post the main demonstration example shortly. Please take a look and let us know if you have any comments. 9:16 AM Permalink", "hasKeyColumn": false, "keyColumnIndex": -1, "headerRowIndex": 0}