{"relation": [["", "Mucolase", "Amylase Thera-blend™", "Protease Thera-blend™", "Glucoamylase", "Beta Glucanase", "Lipase Thera-blend™", "Alpha Galactosidase", "Cellulase Thera-blend™", "Xylanase", "Phytase/Pectinase", "Hemicellulase", "Invertase"], ["Amount Per Serving", "60 mg", "29,700 DU", "90,000 HUT", "100 AG", "120 BGU", "1,000 FCCFIP**", "200 GALU", "800 CU", "1,100 XU", "700 Endo-PGU", "60 HCU", "10 INVU"], ["%Daily Value", "*", "*", "*", "*", "*", "*", "*", "*", "*", "*", "*", "*"]], "pageTitle": "Enzymedica MucoStop 48 Caps - Swanson Health Products", "title": "", "url": "https://www.swansonvitamins.com/enzymedica-mucostop-48-caps", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042985140.15/warc/CC-MAIN-20150728002305-00066-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 928231987, "recordOffset": 928203185, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{83451=†Ratings based on results of the 2015 ConsumerLab.com Vitamin and Supplement Users Survey. More information at www.consumerlab.com/survey2015., 84454=© 2015 Swanson Health Products}", "textBeforeTable": "Servings Per Container 24 Serving Size 2 Capsules Supplement Facts MucoStop Product Label: MucoStop contains Mucolase, a high-potency mucolytic enzyme. Enzymedica uses an exclusive Thera-blend process for its protease, lipase, amylase and cellulase. Each of these enzymes actually represents multiple strains that are blended to increase potency in varying pH levels. Vegetarian & Vegan. Vegetarian & Vegan Supports sinus health MucoStop plant-based enzyme blend MucoStop Product Description: If you are dissatisfied for any reason, we'll give you a full refund and pay return shipping. Lee Swanson, President of Swanson Health Products Risk-Free Purchase Guarantee Watch now to learn more \"With my personal 100% money-back satisfaction guarantee, you have nothing to lose and great savings to gain.\" Lee Swanson, President of Swanson Health Products Why Shop Swanson® Brands? MucoStop contains Mucolase, a high-potency mucolytic enzyme. Enzymedica uses an exclusive Thera-blend process for its protease, lipase, amylase and cellulase. Each of these enzymes actually represents multiple strains that are blended to increase potency in varying pH", "textAfterTable": "*Daily Value not established. Other ingredients: 100% vegetarian capsule (cellulose, water). **FCCFIP is the newest addition to the fourth version of the Food Chemical Codex. The FCC is the only FDA approved way of measuring plant based enzymes. Recommended usage: Two capsules three times a day on an empty stomach (1 hour before or two hours after meal). More may be taken if needed. Contains no dairy, preservatives, salt, sucrose, soy, wheat, yeast, nuts, gluten, artificial colors or flavors. Terms and Ingredient Definitions MucoStop Swanson $25.49 Add To Order Quantity: Add To Order Recently Viewed Items Look here for", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}