{"relation": [["ATTRIBUTE TYPE", "Architecture", "Availability", "", "Interface Stability", "MT-Level"], ["ATTRIBUTE VALUE", "All", "SUNWcsl (32–bit)", "SUNWcslx (64–bit)", "Evolving", "MT-Safe"]], "pageTitle": "", "title": "", "url": "http://docs.oracle.com/cd/E19253-01/816-5170/6mbb5esnq/index.html", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988511.77/warc/CC-MAIN-20150728002308-00086-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 68381040, "recordOffset": 68372838, "tableOrientation": "HORIZONTAL", "lastModified": "Thu, 06 Jan 2011 09:36:29 GMT", "textBeforeTable": "See attributes(5) for descriptions of the following attributes: Attributes This routine creates an RPC server handle over doors and returns a pointer to it. Doors is a transport mechanism that facilitates fast data transfer between processes on the same machine. for the given program The user may set the size of the send buffer with the parameter sendsz. If sendsz is 0, the corresponding default buffer size is 16 Kbyte. If successful, the svc_door_create() routine returns the service handle. Otherwise it returns NULL and sets a value for rpc_createerr. The server is not registered with rpcbind(1M). svc_door_create() This routine creates a connection-oriented RPC service and returns a pointer to it. This routine returns NULL if it fails, and an error message is logged. The users may specify the size of the send and receive buffers with the parameters sendsz and recvsz; values of 0 choose suitable defaults. The file descriptor fildes should be open and bound. The server is not registered with the rpcbind(1M) service. svc_vc_create() svc_tp_create() creates a server handle for the network specified by netconf, and registers itself with the rpcbind service. dispatch is called when there is a remote procedure call for the given prognum and versnum; this requires calling svc_run(). svc_tp_create() returns the service handle if it succeeds, otherwise a NULL is returned and an error message is logged.", "textAfterTable": "See Also rpcbind(1M), rpc(3NSL), rpc_clnt_create(3NSL), rpc_svc_calls(3NSL), rpc_svc_err(3NSL), rpc_svc_reg(3NSL), attributes(5) SunOS 5.10  Last Revised Aug 2001 Name | Synopsis | Description | Attributes | See Also © 2010, Oracle Corporation and/or its affiliates", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}