{"relation": [["Type", "Journal Article", "Journal Article", "Journal Article", "Journal Article", "Journal Article", "Journal Article", "Journal Article", "Journal Article", "Journal Article"], ["Products of NCEAS Research", "Anderson, Corey; Epperson, Bryan K.; Fortin, Marie-Josée; Holderegger, Rolf; James, Patrick M.; Rosenberg, Michael S.; Scribner, Kim T.; Spear, Stephen. 2010. Considering spatial and temporal scale in landscape-genetic studies of gene flow. Molecular Ecology. Vol: 19(17). Pages 3565-3575.", "Epperson, Bryan K. 2010. Spatial correlations at different spatial scales are themselves highly correlated in isolation by distance processes. Molecular Ecology Resources. Vol: 10. Pages 845-853.", "Epperson, Bryan K.; McRae, Brad H.; Scribner, Kim T.; Cushman, Samuel A.; Rosenberg, Michael S.; Fortin, Marie-Josée; James, Patrick M.; Murphy, Melanie A.; Manel, Stephanie; Legendre, Pierre; Dale, Mark. 2010. Utility of computer simulations in landscape genetics. Molecular Ecology. Vol: 19(17). Pages 3549â\u0080\u00933564.", "Legendre, Pierre; Fortin, Marie-Josée. 2010. Comparison of the Mantel test and alternative approaches for detecting complex multivariate relationships in the spatial analysis of genetic data. Molecular Ecology Resources. Vol: 10. Pages 831-844. (Online version)", "Manel, Stephanie; Poncet, Benedicte N.; Legendre, Pierre; Gugerli, Felix; Holderegger, Rolf. 2010. Common factors drive adaptive genetic variation at different spatial scales in Arabis alpina. Molecular Ecology. Vol: 19(17). Pages 3824-3835. (Online version)", "Manel, Stephanie; Joost, Stephane; Epperson, Bryan K.; Holderegger, Rolf; Storfer, Andrew T.; Rosenberg, Michael S.; Scribner, Kim T.; Bonin, Aurelie; Fortin, Marie-Josée. 2010. Perspectives on the use of landscape genetics to detect genetic adaptive variation in the field. Molecular Ecology. Vol: 19(17). Pages 3760-3772.", "Rico, Yessica; Juergen Boehmer, Hans; Wagner, Helene H. 2012. Determinants of actual functional connectivity for calcareous grassland communities linked by rotational sheep grazing. Landscape Ecology. Vol: 27(2). Pages 199-209. (Online version)", "Spear, Stephen; Balkenhol, Niko; Fortin, Marie-Josée; McRae, Brad H.; Scribner, Kim T. 2010. Use of resistance surfaces for landscape genetic studies: Considerations for parameterization and analysis. Molecular Ecology. Vol: 19. Pages 3576-3591.", "Storfer, Andrew T.; Murphy, Melanie A.; Spear, Stephen; Holderegger, Rolf; Waits, Lisette. 2010. Landscape genetics: Where are we now? . Molecular Ecology. Vol: 19(17). Pages 3496-3514."]], "pageTitle": "An interdisciplinary approach to advancing landscape genetics | NCEAS", "title": "", "url": "https://www.nceas.ucsb.edu/projects/12352", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 2, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042991076.30/warc/CC-MAIN-20150728002311-00243-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 916770007, "recordOffset": 916757946, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{20091=National Center for Ecological Analysis and Synthesis 735 State Street, Suite 300, Santa Barbara, CA 93101 Copyright © 2013 The Regents of the University of California, All Rights Reserved UC Santa Barbara, Santa Barbara CA 93106 | 805-893-8000 Terms of Use | Accessibility | webmaster [at] nceas.ucsb.edu (Contact)}", "textBeforeTable": "Working Group Participants Participants and Meetings }); }); } $(\"#weather\").html(' '+error+''); error: function(error) { }, $(\"#weather\").html(html); html += ' '+weather.currently+''; html += ' '+weather.city+', '+weather.region+''; html = ' '+weather.temp+'°'+weather.units.temp+''; success: function(weather) { unit: 'f', woeid: '', location: 'Santa Barbara, CA', $.simpleWeather({ var $ = jQuery; jQuery(document).ready(function() { .smaller{ font-size: .8em; } .simple-list li{ margin-left: 0px; } .simple-list{ list-style: none; margin-bottom: 20px; margin-left: 0px; } #taxi-container .popover{ margin-left: -100px; }", "textAfterTable": "Mark Dale dalem@unbc.ca University of Northern British Columbia Bryan K. Epperson epperson@msu.edu Michigan State University Marie-Josée Fortin mariejosee.fortin@utoronto.ca University of Toronto Rolf Holderegger rolf.holderegger@wsl.ch Swiss Federal Institute for Forest, Snow and Research (WSL) Patrick M. James pjames@ualberta.ca University of Toronto Pierre Legendre pierre.legendre@umontreal.ca Université de Montréal Stephanie Manel stephanie.manel@ujf-grenoble.fr Université Aix-Marseille Brad H. McRae bmcrae@tnc.org The Nature Conservancy Melanie A. Murphy melanie.murphy@uwyo.edu Colorado State University Michael S. Rosenberg msr@asu.edu Arizona State University Noah Rosenberg rnoah@umich.edu University of Michigan Kim T. Scribner scribne3@msu.edu Michigan State University Stephen Spear sfspear@uidaho.edu Washington State University Andrew T. Storfer astorfer@wsu.edu Washington State University Lisette Waits lwaits@uidaho.edu University of Idaho Jerome Mathieu jerome.mathieu@snv.jussieu.fr University of California, Santa Barbara Hugh P. Possingham h.possingham@uq.edu.au Michael F. Antolin michael.antolin@colostate.edu Colorado State University Aurelie Bonin aurelie.bonin@ujf-grenoble.fr Université Joseph Fourier Helene H. Wagner helene.wagner@utoronto.ca University of Toronto, Mississauga Products: Publications, Reports, Datasets, Presentations, Visualizations Type Products of NCEAS Research Journal Article Anderson, Corey; Epperson, Bryan K.; Fortin, Marie-Josée; Holderegger, Rolf; James, Patrick M.; Rosenberg, Michael S.; Scribner, Kim T.; Spear,", "hasKeyColumn": false, "keyColumnIndex": -1, "headerRowIndex": 0}