{"relation": [["PLATE", "I.", "II.", "", "III.", "", "IV.", "", "V.", "", "VI.", "", "VII.", "", "VIII.", ""], ["", "Fig. 1,", "Fig. 1.", "Fig. 3.", "Fig. 1.", "Fig. 4.", "Fig. 1.", "Fig. 4.", "Fig 1.", "Fig. 3.", "Fig. 1.", "Fig. 4.", "Fig. 1.", "Fig. 3.", "Fig. 1.", "Fig. 3."], ["", "Catenicella lorica, p. 6, natural size; fig. 2, front; fig. 3. back.", "Catenicella ventricosa, p. 7, front; fig. 2, back.", "Catenicella hastata, p. 7, front; fig. 4, back.", "Catenicella ventricosa, p. 7, (var.) front; fig. 2, back; fig. 3, ovicell.", "Catenicella ventricosa, p. 7, (var. maculata) front; fig. 5, back.", "Catenicella aurita, p. 8, front; fig. 2, back; fig. 3, ovicell.", "Catenicella amphora, p. 8, front; fig. 5,back.", "Catenicella plagiostoma, p. 8, front; fig. 2, back.", "Catenicella cribraria, front; fig. 4, back.", "Catenicella margaritacea, p. 9, front; fig. 2, side view; fig. 3, back.", "Catenicella carinata, p. 12, front; fig. 5, ovicell; fig. 6, side view.", "Catenicella formosa, p. 9, front; fig. 2, back.", "Catenicella gibbosa, p. 12, front; fig. 4, back.", "Catenicella perforata, p. 10, front; fig. 2, back and side views.", "Catenicella ringens, p. 10, front; fig. 4, back."]], "pageTitle": "Busk, G. 1852. Catalogue of marine Polyzoa in the collection of the British Museum. Part I. Cheilostomata (part). London: Trustees of the British Museum.", "title": "", "url": "http://darwin-online.org.uk/content/contentblock?itemID=A532.1&basepage=1&hitpage=1&viewtype=text", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988317.67/warc/CC-MAIN-20150728002308-00218-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 56692263, "recordOffset": 56672143, "tableOrientation": "HORIZONTAL", "TableContextTimeStampBeforeTable": "{1=File last updated 2 July, 2012}", "TableContextTimeStampAfterTable": "{26978=Anguinaria spatulata, Lamk. Anim. s. Vert. ii. 143, ed. 2. ii. 196; Stark. Elem. ii. 439; Thompson, Ann. Nat. Hist. v. 252; Couch, Zooph. Cornw. 44; Corn. Faun. iii. 103. pl. 19. fig. 2; Johnst. Hist. Brit. Zooph. ed. 2. 290. t. 50. figs. 7, 8; Busk, Trans. Microsc. Soc. 1848, 15., 73289=Citation: John van Wyhe, editor. 2002-. The Complete Work of Charles Darwin Online. (http://darwin-online.org.uk/), 25225=Anguinaria, Lamk. 1812 (no char.);Johnst. Br. Zooph. ed. 2. 292., 3705=August 1, 1852., 21199=Scruparia, sp. Oken, Lehrb. Nat. 90, 1816., 26488=Ætea Anguina, Lamx. Bull. Soc. Phil. 1812, iii. 184; Corall. 65. pl. 3. fig. 6; Exp. Méth. 9. t. 65. fig. 15; Gray, Brit. Rad. 133., 25127=Ætea, Lamx. Bull. Soc. Phil. 1812, char.; Gray, Brit. Rad. 133., 77=RECORD: Busk, G. 1852. Catalogue of marine Polyzoa in the collection of the British Museum. Part I. Cheilostomata (part). London: Trustees of the British Museum., 25318=Falcaria β, Oken, Lehrb. Nat. 91, 1815., 9585=Ciliobrachiata, Farre, Phil. Trans. 1837., 21145=Cellaria, sp. Soland.; Lamk. 1816., 1475=1852., 21047=Bicellaria, sp. Blainv. 1830., 23890=Catenicella divaricata, Blainv. D. S. N. 1830, lx. 427; Man. Act., 26816=Anguinaria Anguina, Flem. Brit. Anim. 542; Lister, Phil. Trans. 1834, 385. pl. 12. fig. 4; Blainv. Act. 467. pl. 79. fig. 3., 300=REVISION HISTORY: Transcribed (single key) by AEL Data, corrections by John van Wyhe 8.2009. RN1, 9705=Polypiaria (pars), Blainv. Dict. Sci. Nat. 1830, lx. 364.}", "textBeforeTable": "DESCRIPTION OF PLATES. [page break] This species approaches very nearly to a Membranipora, and from the total absence of any moveable appendages, might perhaps be regarded as a type of a distinct genus: as, however, it is a solitary instance of the form, and agrees in the structure of the polyzoary with the above two species, it has been associated with them and not with the Membraniporidæ. Hab. New Zealand, Lyall. Straits of Magellan, Darwin. Cells decumbent, boat-shaped, entirely open; two short marginal spines on each side near the top. Ovicell—? Avicularium—? 3. DIACHORIS INERMIS. Pl. LXXII. Hab. Straits of Magellan, Darwin; New Zealand, Lyall. Cells semi-erect, open in front, oval; mouth circular with a thickened and raised margin. A pedunculate and articulated, capitate avicularium attached to the margin of the cell near the top on each side. Ovicell—?. (Frondose, with cells on both sides, and also loosely adnate.) 2. DIACHORIS MAGELLANICA. Pl. LXVII. The frond, although, as explained above, not strictly adnate, as it seems to have no attachments, is usually spread loosely over other Polyzoa. There is no appearance of a moveable mandible in the lanceolate appendages, which nevertheless most probably represent avicularia. These organs are of a lanceolate form, with an elevated ridge or keel along the back, and slightly concave beneath: they project in front, slightly depending, and at the base of each is a rounded eminence. Diachoris crotali, Busk, Voy. of Rattlesn. 382. tab. i. figs. 10, 12. Hab. Bass' Strait.", "textAfterTable": "[page] ii IX. Fig. 1. Catenicella elegans, p. 10 (var. South Africa), front; fig. 2, back; fig. 3 (var. Australia), front; fig. 4, back. X. Fig. 1. Catenicella cornuta, p. 11, front; fig. 2, back; fig. 3, side view. Fig. 4. Catenicella umbonata, p. 11, front; fig. 5, back. XI. Fig. 1. Catenicella taurina, p. 12, front; fig. 2, back; fig. 3, with ovicells; fig, 4, spines replaced by avicularia. XII. Fig. 1. Calpidium ornatum, p. 15, natural size; fig. 2, front. XIII. Fig. 1. Calpidium ornatum, p. 15, front view of bifurcation; fig. 2, back of cell. XIV. Fig. 1. Alysidium lafontii, p. 14, front of cell; fig. 2, side view, showing the avicularium; fig. 3, back; fig. 4. back, at a bifurcation; fig. 5, natural size. Fig. 6. Alysidium parasiticum, p. 14, front, with an ovicell; fig. 7, back; fig. 8, side view; fig. 9, natural size. XV. Fig. 1. Ætea anguina, p. 31. Fig. 2. Ætea dilatata, p. 31. XVI. Fig. 1. Beania australis, p. 32; fig. 2, portion of cell to show the lateral processes; fig. 3, a more highly magnified view of the costœ. Fig. 4. Caberea boryi, p. 38, front; fig. 5, back. XVII. Fig.1 Hippothoa patagonica, p. 30.", "hasKeyColumn": false, "keyColumnIndex": -1, "headerRowIndex": 0}