{"relation": [["Topics", "Taxes", "Termination of pregnancy", "Terrorism", "Torture", "Trafficking and smuggling of human beings", "Transparency"], ["Competences / description", "International administrative assistance in tax matters, Tax evasion", "see Criminal law", "Fight against terrorism, terror attacks", "Prevention of torture, CPT, cxecution of sentences and measures", "Recruitment, transportation, harbouring or receipt of persons for the purpose of exploitation, facilitating a person’s illegal entry into Switzerland or another Schengen member state", "Öffentlichkeitsprinzip der Verwaltung, Zugang zu amtlichen Dokumenten, Transparenz bei Vergütungen des Verwaltungsrates und der Geschäftsleitung"]], "pageTitle": "FAQ – Frequently asked questions - SEM", "title": "", "url": "https://www.fedpol.admin.ch/content/bfm/en/home/themen/einreise/faq.0067.html", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 45, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042992201.62/warc/CC-MAIN-20150728002312-00147-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 902102579, "recordOffset": 902059289, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{177762=The Principality of Liechtenstein has been part of the Schengen area since 19 December 2011., 180141=On 5 April 2010, Type C and Type D visas were given parity of treatment as far as freedom to travel within the Schengen area for up to 90 days in any 180-day period is concerned., 209010=However, entry into Switzerland will be granted if proof of a person's Italian citizenship can be provided. See also chapter 3, question «May citizens of an EU or EEA member state who are travelling on a non-valid travel document or without a travel document made out in their name enter Switzerland?», 162626=The Federal Assembly, on 28 September 2012, approved a priority bill amending the Asylum Act, thus abolishing the possibility of applying for asylum from abroad. However, people of non-Swiss citizenship who for compelling reasons feel required to leave their home countries and wish to apply for asylum in Switzerland may file a visa application with a Swiss diplomatic representation. The representation will determine whether compelling reasons exist warranting the issuance of a visa for Switzerland. Applicants are eligible for a visa if it may be presumed that they are in imminent and serious danger of bodily harm. People who for compelling reasons have left their home countries and are staying in a third state are considered at no risk., 188799=Press release, 29 November 2013 Temporary visa facilitation for Syrian nationals lifted, 179002=Please note that people who hold a valid residence permit from Great Britain, Ireland, Canada or who have a Green Card from the USA and wish to enter Switzerland may be subject to visa requirements. These requirements have been in effect since 12 December 2008., 204254=As of 26 June 2012, Switzerland no longer recognises the names of children listed in passports from Schengen countries as being valid for entry. Each child needs to have his or her own travel document., 188432=The directive of 4 September 2013 on the easing of visa requirements for relatives of Syrian nationals living in Switzerland expired on 29 November 2013. However, applications submitted before 29 November 2013 are still processed according to the directive of 4 September 2013., 259233=to the top Last modification 01.05.2015}", "lastModified": "Tue, 04 Aug 2015 21:52:50 GMT", "textBeforeTable": "A SEM Close Topics A-Z Topics A-Z x S Search Links Contact Service navigation EN IT FR DE Language selection State Secretariat for Migration Post and Telecommunications Surveillance Service ISC-FDJP: IT Service Centre BTM: Beobachtungsstelle für technische Massnahmen FAOA: Federal Audit Oversight Authority METAS: Federal Institute of Metrology SICL: Swiss Institute of Comparative Law IIP: Swiss Federal Institute of Intellectual Property NCPT: National Commission for the Prevention of Torture ESchK: Eidgenössische Schiedskommission für die Verwertung von Urheberrechten und verwandten Schutzrechten FGB: Welcome to the website of the Federal Gaming Board SEM: State Secretariat for Migration fedpol: Federal Office of Police FOJ: Federal Office of Justice", "textAfterTable": "Topics Competences / description C Topics Competences / description Citizenship Swiss nationality, naturalisation Civil status Marriage, divorce, registered partnerships Compulsory measures Cooperation Crime Delinquency Crime prevention Eurojust Criminal law D Topics Competences / description E Topics Competences / description Employment law Illegal employment Employment market Europe Expulsion see", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}