{"relation": [["Requirement", "MLG 205", "COM 449", "ENG 457", "COM 402", "SPA 315", "FRE 315", "SPA 316", "GER 315"], ["Class Name", "Cross-Cultural Understanding", "Intercultural Communication", "History of the English Language", "Listening", "Spanish Civilization*", "French Civilization*", "Latin American Civilization*", "German Civilization*"], ["Hours", "3", "3", "3", "3", "3", "3", "3", "3"]], "pageTitle": "TESOL/ELL Certificate Program | Modern Languages | Mississippi College", "title": "", "url": "http://mc.edu/academics/departments/modern-languages/tesol/", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 1, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989510.73/warc/CC-MAIN-20150728002309-00158-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 147995111, "recordOffset": 147980915, "tableOrientation": "HORIZONTAL", "textBeforeTable": "The courses for this certificate program include: This is a four course program that meets the required guidelines for an add-on endorsement by the Mississippi Department of Education for English as a Second Language.  This is available for currently certified Mississippi teachers, and as a bonus, Mississippi College offers a 30% tuition reduction for all teachers K-12. ELL Certification At the undergraduate level, students may also choose to minor in TESOL.  The minor consists of 18 hours, including the four courses for the ELL certificate and 6 additional hours. The department offers a certificate program (ELL certificate) in TESOL at the graduate and undergraduate level.  The purpose of the certificate program is to develop qualified students who have an interest in teaching English to non native English Speakers.  This is an interdisciplinary program with courses in linguistics, teacher training and pedagogy, research, and multicultural understanding, incorporating the departments of Modern Languages, Education, English, and Communication. TESOL Certificate Form Faculty Voyagers Application Careers Study Abroad Languages Offered TESOL/ELL Certificate Program Undergraduate Programs Menu Modern Languages News", "textAfterTable": "ENG 457 History of the English Language 3 COM 402 Listening 3 SPA 315 Spanish Civilization* 3 FRE 315 French Civilization* 3 SPA 316 Latin American Civilization* 3 GER 315 German Civilization* 3 * Course is taught in its respective language Prospective Students Admissions Tuition & Financial Aid Majors & Degrees Schedule Visit Apply Current Students MyMC Moodle Faculty Webpages Library Academic Catalog Faculty & Staff Committees & Councils Faculty & Staff Meetings University Policies Strategic Planning Institutional Research Alumni & Friends Get Involved MC Athletics Beacon Magazine Give to MC Alumni Chapters Facebook", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}