{"relation": [["Census Year", "1841", "1851", "1861", "1871", "1891"], ["Piece No.", "H.O. 107 / 644", "H.O. 107 / 2109 & 2110", "R.G. 9 / 2375", "R.G. 10 / 3391 thru 3392B", "R.G. 12 / 2603"]], "pageTitle": "England GenWeb Project - Lincolnshire, Spilsby", "title": "", "url": "http://www.rootsweb.ancestry.com/~englin/S/spilsby.htm", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 1, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438043058631.99/warc/CC-MAIN-20150728002418-00334-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 695451834, "recordOffset": 695443632, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{3131=The Library: holds the baptismal and burial records for parts of the Bolingbroke Deanery for the period of 1754-1812., 18150=© 2003 EnglandGenWeb Project, 7704=The town of Spilsby was described in White's 1842 Directory as \"a small, but thriving and well-built market town... pleasantly seated on an eminence, which overlooks an extensive tract of marshes and fens\". Eresby is a small hamlet just south of town. If you are planning a visit:, 7349=126 miles north of London, Spilsby parish and town sits between Skegness on the coast and Horncastle in the Wold hills, and is about ten miles southwest of Alford. Partney parish is to the north and Toynton St. Peter parish to the south. The parish covered about 2,340 acres in 1842.}", "textBeforeTable": "The table below gives census piece numbers, where known: Check our Census Resource page for county-wide resources. The parish was in the Spilsby sub-district of the Spilsby Registration District. Top Census A cemetery of one acre was formed in 1883 on Boston Road. The Library: holds the baptismal and burial records for parts of the Bolingbroke Deanery for the period of 1754-1812. Top Cemeteries Closed Tues, Thursday and Sunday Saturday 10:00 - 13.00 Opening Hours 10.00 - 16.00 Mon and Fri Tele: 01 522 782 010, Fax: 01775 768931 Spilsby, Lincs, PE23 5ED 2 West End Villas Spilsby Library Archives and Libraries Local Library: Schools Population Poorhouses, Poor Law, etc. Politics and Governance Names, Personal Military Records Military History Maps Manors Land and Property History Description and Travel Civil Registration Church Records Church History Census Cemeteries Archives and Libraries Spilsby", "textAfterTable": "Top Church History At Eresby there was a chapel, and in 1349 Sir John WILLOUGHBY made it collegiate for a master and twelve priests. The Anglican parish church is dedicated to St. James. The church is built of green sandstone. The earliest parts of the church date to the early 14th century. The church seats about 750. The Anglican parish churchyard was closed to most burials in 1884. Here is a photo of St. James, taken by (and copyright of) Wendy PARKINSON. Here is a photo of St. James Church, taken by Ron COLE (who retains the copyright): Top Church Records The Anglican parish register dates from 1562. We have the beginning of a parish register extract in a pop-up text file. Your additions and corrections are welcomed. The LFHS has published several marriage and burial indexes for the Bolingbroke Deanery to make your search easier. The Wesleyan, Primitive and Independent Methodists each had large chapels in the town. The Independent Methodists built a new chapel in 1866 and used the old one as a Sunday School. The Wesleyans built a new chapel at the Market Place in 1878. The Catholic Church is dedicated to Our Lady", "hasKeyColumn": false, "keyColumnIndex": -1, "headerRowIndex": 0}