{"relation": [["Box", "4", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", ""], ["Files/Description", "A & E Monthly August 1996", "Entertainment Weekly September 19, 1997", "Good Housekeeping August, 1992", "Hello", "September 6, 1997 September 13, 1997 September 27, 1997 Special Royal Issue, n.d.", "Illustrated London News", "Royal Year 1987 Royal Issue 1990", "Life February, 1993", "McCall’s December, 1997", "Maclean’s", "August 25, 1997 September 8, 1997 September 15, 1997", "Newsweek", "September 8, 1997 September 15, 1997 September 22, 1997 Commemorative Issue Diana a Celebration of Her Life, “on sale until Nov. 3, 1997”", "Royal Magazine", "Vol. 1, #1-2,4", "Spy November, 1991", "Stern 11-9-97", "Time", "March 11, 1996 September 8, 1997 September 15, 1997 TV Guide Sept. 20, 1997", "U.S. News and World Report September 15, 1997", "Vanity Fair", "February, 1993 July, 1997 October, 1997", "Vogue October, 1997", "Young Royals", "#4-6"]], "pageTitle": "Andrews' Princess Diana Collection | MSU Libraries Special Collections Finding Aids", "title": "", "url": "http://findingaids.lib.msu.edu/spc/index.php?p=collections/controlcard&id=189", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 4, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042981576.7/warc/CC-MAIN-20150728002301-00165-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 90176859, "recordOffset": 90157347, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{18186=Following a vacation on a yacht in the Mediterranean in the summer of 1997, Diana began a relationship with the yacht owner’s son, Dodi Fayed.  Early Sunday morning August 31, 1997, they had an automobile accident in a tunnel in Paris.  Dodi and the driver died at the scene of the accident.  Diana died two hours later at La Pitié-Salpêtrière Hospital in Paris.  Bodyguard Trevor Rees-Jones, unconscious for two weeks, recovered., 31302=People Weekly 25 Years Special Anniversary Issue, March 15-22, 1999, 17339=Diana was an unremarkable student.  From 1978-80 she taught small children dancing, worked at Young England Kindergarten, Pimlico, London, and was a private nanny.  She met Prince Charles for the second time in July, 1980.  He proposed to her and she accepted him on Feb. 6, 1981.  Diana and Charles married July 29, 1981, at St. Paul’s Cathedral, London., 31011=People Weekly the Diana Years Photo Special Collectors’ Edition, c1996, 16673=Diana (Lady Diana Frances Spencer), Princess of Wales, 1961-1997, was born July 1, 1961, at Park House, Sandringham, Norfolk, the third daughter of (Edward) John ‘Spencer,  Viscount Althorp, later eighth Earl Spencer, 1924-1992, and his first wife, the Hon. Frances Ruth Burke Roche, b. 1936.  Her siblings are Jane, Sarah, and Charles.  Jane married Robert Fellowes, a private secretary to Queen Elizabeth II.  Sarah dated Charles, the Prince of Wales.  Diana first met Prince Charles, the oldest child/son of Queen Elizabeth II and Prince Phillip, in 1977, when he came to Althrop, which is near Sandringham, for the shooting., 45835=© 2010 Michigan State University Board of Trustees. MSU is an affirmative-action, equal-opportunity employer., 31392=People Weekly 25 Amazing Years Collector’s Edition, c1999, 17728=The couple had two sons, Princes William and Henry (Harry), born in 1982 and 1984, respectively.  Their marriage, sadly, was not a long-term success; he was 13 years older than she was and they had quite different personal interests and temperaments.  Charles, Diana, and their relationship itself were continually in the media spotlight and this did not help any.  Both took lovers; they separated in 1992, and divorced in 1996., 19158=Read the entry on Diana in the Oxford Dictionary of National Biography, c 2004, vol. 16, pp. 16-21 for more information., 31104=People Weekly Tribute Diana Princess of Wales 1961-1997 Special Collector’s Issue, Fall, 1997, 31561=Diana an Amazing Life, the People Cover Stories 1981-1997, n.d., 31472=People Weekly Favorite Pictures Special Collector’s Edition, c2000, 31220=People Weekly the Diana Years, Commemorative Edition, c1997}", "textBeforeTable": "These books are part of the catalogued Special Collections Russel Nye Popular Culture Collection. Series I: Books Description of series: Series VI: Pamphlets under 50 Pages, Unpaged Items, Items without OCLC Cataloging Records, Cassette Tape of the Royal Wedding, and Ephemera Series V: Miscellaneous Magazines Series IV: Royalty Monthly Series III: Majesty Series II: People Weekly Series I: Books Arrangement: Processing Note: Processed by Agnes Haigh Widder, 2010. Read the entry on Diana in the Oxford Dictionary of National Biography, c 2004, vol. 16, pp. 16-21 for more information. Diana was wildly popular with people in the British Isles and, indeed, around the world as Princess of Wales.  She engaged in much charitable work, particularly with causes of children, HIV/AIDS, personal relationships, eating disorders, and against landmines.  Her capacity for empathy and its demonstration in public set a new standard for the Royal family.  The press’ attention to her was continual, which is why this collection of material is noteworthy. Following a vacation on a yacht in the Mediterranean in the summer of 1997, Diana began a relationship with the yacht owner’s son, Dodi Fayed.  Early Sunday morning August 31, 1997, they had an automobile accident in a tunnel in Paris.  Dodi and the driver died at the scene of the accident.  Diana died two hours later at La", "textAfterTable": "  March 11 August 25 Sept. 15 (2 copies) September 22 October 13 October 20 December 1   1998   August 31   1999   July 5 August 23   2000   April 24 July 3   2001   June 25 October 8 People Weekly Extra the Diana Years Special Photo Issue Spring, 1996 People Weekly the Diana Years Photo Special Collectors’ Edition, c1996 People Weekly Tribute Diana Princess of Wales 1961-1997 Special Collector’s Issue, Fall, 1997 People Weekly the Diana Years, Commemorative Edition, c1997 People Weekly 25 Years Special Anniversary Issue, March 15-22, 1999 People Weekly 25 Amazing Years Collector’s Edition, c1999 People Weekly Favorite Pictures Special Collector’s Edition, c2000 Diana an Amazing Life, the People Cover Stories 1981-1997, n.d. Series III: Includes the following issues of Majesty: Box Files/Description 2 Vol. 4, #6-9, 11-12   Vol. 5, #1-4, 6-8, 10   Vol. 6, #1,12", "hasKeyColumn": true, "keyColumnIndex": 1, "headerRowIndex": 0}