{"relation": [["Cap", "First 1GB", "1GB - 10TB", "10TB - 50TB", "50TB - 150TB", "150TB - 500TB", "500TB - 1PB", "1PB - 5PB", "Over 10PB"], ["Price", "Free", "$0.140/GB", "$0.135/GB", "$0.130/GB", "$0.120/GB", "Contact Provider", "Contact Provider", "Contact Provider"]], "pageTitle": "Amazon Web Services Provider Report | CloudHarmony", "title": "", "url": "https://cloudharmony.com/provider/aws", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 47, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989510.73/warc/CC-MAIN-20150728002309-00330-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 855582919, "recordOffset": 855538633, "tableOrientation": "HORIZONTAL", "TableContextTimeStampBeforeTable": "{19403=Amazon Web Services (AWS) is a spinoff of online retailer Amazon Inc., based in Seattle, WA. AWS launched in 2006 as one of the first cloud infrastructure services, based on leveraging information gathered from the infrastructure and technology developed to maintain Amazon.com. Estimated earnings were $2.1 billion in 2012. AWS offers cloud services in nine regions, including four in the US, one in Europe, two in Asia, one in Australia, and one in Brazil. Services include Linux and Windows compute instances, object storage, content delivery network (CDN), domain name system (DNS), and more. Key market differentiators include rapid innovation, aggressive pricing, massive scalability, many high-profile clients such as Netflix, and a comprehensive set of services.}", "TableContextTimeStampAfterTable": "{4228=The date that this list was compiled. For Alexa, this is the date that the list was downloaded. For Fortune 500, this is June 1 of the year the list pertains to (e.g. 6/1/2014 = Fortune 500 2014)}", "textBeforeTable": "Measured Availability http://aws.amazon.com/ec2-sla/ SLA Link AWS will use commercially reasonable efforts to make Amazon EC2 and Amazon EBS each available with a Monthly Uptime Percentage (defined below) of at least 99.95%, in each case during any monthly billing cycle (the \"Service Commitment\"). In the event Amazon EC2 or Amazon EBS does not meet the Service Commitment, you will be eligible to receive a Service Credit. 99.95% SLA Service Level Agreement (SLA) Service Availability Close This section lists the provider's service level agreement (SLA), and actual availability metrics from our monitoring of this service. Service Availability ap-southeast-2 [2] ap-southeast-1 [2] ap-northeast-1 [3] ap-china-1 Asia eu-west-1 [3] eu-central-1 [2] Europe sa-east-1 [2] South America us-west-2 [3] us-west-1 [3] us-gov-west-1 [2] us-east-1 [5] North America 3 Number of Data Centers us-west-2 Provider Code Portland, OR US Location", "textAfterTable": "99.9972% 99.9984% eu-central-1 100% 100% 99.9983% 99.9992% 99.9994% 99.9994% 99.9996% eu-west-1 100% 100% 100% 100% 100% 100% 99.9999% sa-east-1 100% 99.9883% 99.9927% 99.9945% 99.9963% 99.9918% 99.9938% us-east-1 100% 100% 100% 100% 100% 100% 99.9989% us-west-1 100% 100% 100% 100% 100% 100% 100% us-west-2 100% 100% 100% 100% 100% 100% 100% Service has not been monitored for the full duration of this interval Service Marketshare This section presents marketshare estimates based on our analysis. To capture this information we periodically analyze websites of top Alexa 10k and Fortune 500 organizations and use a variety of techniques to correlate cloud services uses. The correlation techniques includes hotname patterns, IP/CIDR blocks and ASN matching in both primary and related hostnames including in CNAME chains. Known co-branded SaaS sites are excluded. Close Service Marketshare List Name The name of the list this marketshare summary pertains to Close  List Name  List Date The date that this list was compiled. For Alexa, this is the date that the list was downloaded. For Fortune 500, this is June 1 of the year the list pertains to (e.g. 6/1/2014 = Fortune 500 2014) Close  List Date ", "hasKeyColumn": false, "keyColumnIndex": -1, "headerRowIndex": 0}