{"relation": [["Role in the trade sector", "Salesman", "Cargo boss", "Cargo employee/guides", "Independent tradesmen", "Petty guide", "Designer", "Translator in textile shop", "Caterers"], ["Number of Nigerian respondents", "3", "4", "6", "5", "1", "1", "0", "5"]], "pageTitle": "1. Introduction", "title": "", "url": "http://www.mdpi.com/2071-1050/5/7/2856/xml", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 1, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989507.42/warc/CC-MAIN-20150728002309-00064-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 585130115, "recordOffset": 585097127, "tableOrientation": "HORIZONTAL", "TableContextTimeStampBeforeTable": "{49968=This lively academic debate is reflected in various policy arenas. Since the establishment of the Global Commission on International Migration in 2003, migration-development has become a true global policy field [23]. While the development impact of human movements is celebrated by many stakeholders, including governments of receiving and sending countries, as well as NGOs and diaspora communities [24,25], its practical outcomes in terms of policy initiatives illustrate the conflicting logics of this celebrated link between human mobility and development. The debate seems to balance between two opposing logics: (1).}", "TableContextTimeStampAfterTable": "{11967=Before I got this cargo I worked at another cargo here in Osmanbey for 2.5 years and there I learned the job. That was necessary to arrive at this position. Since last December I have my own cargo…I came to Istanbul in 2006 and I soon got involved in trade, which was really helpful to learn the tricks and to become big … So now it was time for me to lead a cargo myself and to become the boss. You need papers for this, because of that I could get this place…And right now I have a good life here. I have got everything … My life is good, I can go wherever I want., 15265=“Europe is far now. I will not travel anymore. I am sure when you visit me in 2010 I will still be around here. I am happy now.”.}", "lastModified": "Fri, 15 May 2015 16:49:36 GMT", "textBeforeTable": "Migrants’ career paths. Table 1 sustainability-05-02856-t001_Table 1 provides an overview of different career paths of migrants who are (or have been) involved in transnational trade (the respondents who are not related to trade are not included in the table). Table 1 ]. 19 ). The informal jobs they take up include: casual labor in the construction or manufacturing sector (unstable income; payment between €6.5 and €21.5 a day, working hours variable); production and welding work in factories (rather stable income; payment between €6.5 and €87 per week for 55–88 working hours); and cleaning and dish-washing in restaurants and hotels (rather stable income; payment around €85 a week for around 70 working hours). Additionally, some Nigerians go to tourist places (e.g., Izmir, Antalya) during high seasons to work as street vendors or as cleaners in restaurants and hotels [ Table 1 ] (see 19 To understand migrants’ career prospects in the transnational trade sector, it is important to realize that the majority of our respondents has had a bumpy career with ups and downs in Istanbul’s informal economic sectors [ 6. Trade Careers Of course, flying in and out of Istanbul is costly for the Nigerian customers in question. Therefore, they attempt to build-up trust relationships with the cargo shops and guides they have met previously. This relationship enables the customer to arrange his import/export from a distance. Usually, he", "textAfterTable": "4 months Transnational trade Abdul 4 years Football–factory work–transnational trade–designer Jacob 3 years Football–no job–petty job–transnational trade Ethan 2 years Study scholarship–no job–factory work–petty job–Turkish language school–informal teacher of English language, transnational trade Oliver 1 year Owner Nigerian restaurant Olivia 3 years Working in Nigerian restaurant–co-owner of Nigerian restaurant Lewis 6 years No job–petty job–transnational trade Luke 6 years No job–transnational trade Benji 8 months Transnational trade Samuel 5 years No job–petty job–factory work–ghetto boss–Turkish language school– informal teacher of English language–transnational trade–work in Church–informal teacher of English language James 3 year Unknown–Turkish language school–transnational trade Charlie 3 years No job–petty job–factory work–no job–factory work– o job–transnational trade–no job–transnational trade Eric 6 months Petty job–factory work–working in Turkish restaurant–transnational trade Emmanuel 1 year Football–no job–factory work–no job–Working in Nigerian restaurant Rufus 1 month", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}