{"relation": [["Rating", "1500", "1800", "2100", "2400", "2700", "3000"], ["Weekly Points Cap", "1343", "1940", "2533", "2849", "2849", "3000"]], "pageTitle": "Conquest Points - Breaking Skulls and Buying Stuff - World of Warcraft", "title": "", "url": "http://eu.battle.net/wow/en/blog/9999051/", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988317.67/warc/CC-MAIN-20150728002308-00112-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 84927919, "recordOffset": 84910938, "tableOrientation": "HORIZONTAL", "TableContextTimeStampBeforeTable": "{841=Your point cap is based on your highest active personal rating from the previous week. For an arena team rating to be considered active, the team must have played at least one match during the previous week, and you must have played in at least 30% of the team’s total matches that week. In the case of rated battlegrounds, to be considered active you need to have played a minimum of one single match in the previous week. If you don’t meet either of these requirements during one week, the following week your point cap will temporarily return to the default of 1343 until you again meet the above requirements to be considered active for the next week.}", "TableContextTimeStampAfterTable": "{1379=You can check your current total number of Conquest Points at any time in your character's Currency tab. For more detailed information, open the PvP menu and click on the Conquest tab, where you'll find how close you are to the weekly cap and how many points you'll earn by winning an Arena or Rated Battleground match. You can check out what the Conquest Point vendors have to offer in the Champions' Hall in Stormwind or the Hall of Legends in Orgrimmar.}", "textBeforeTable": "Here are some sample ratings and corresponding point caps: Your point cap is based on your highest active personal rating from the previous week. For an arena team rating to be considered active, the team must have played at least one match during the previous week, and you must have played in at least 30% of the team’s total matches that week. In the case of rated battlegrounds, to be considered active you need to have played a minimum of one single match in the previous week. If you don’t meet either of these requirements during one week, the following week your point cap will temporarily return to the default of 1343 until you again meet the above requirements to be considered active for the next week. If you want to be able to earn more than 1,343 Conquest Points in a single week, then you'll need to increase your personal rating above 1,500 by participating in Rated Arenas or Rated Battlegrounds. Only your best personal rating counts, and as you improve and bring your rating over 1,500, your weekly point cap will rise as well -- and if you manage to achieve a very high rating, your weekly cap could approach 3,000. Note: There's no benefit to hoarding large amounts of Conquest Points since they'll be converted into Honor (or Justice Points, for Valor) when the next tier of items becomes available, and there are no plans to extend the 4,000 point cap on the", "textAfterTable": "You can check your current total number of Conquest Points at any time in your character's Currency tab. For more detailed information, open the PvP menu and click on the Conquest tab, where you'll find how close you are to the weekly cap and how many points you'll earn by winning an Arena or Rated Battleground match. You can check out what the Conquest Point vendors have to offer in the Champions' Hall in Stormwind or the Hall of Legends in Orgrimmar. Now that you know what you're fighting for, it's time to show Azeroth your incredible PvP skills. Confront your foes. Fight! Win! Share: Tweet", "hasKeyColumn": false, "keyColumnIndex": -1, "headerRowIndex": 0}