{"relation": [["Page No.", "", "", "1.", "2.", "3.", "4.", "5.", "6.", "7.", "8.", "9.", "10.", "11.", "12.", "13.", "14.", "15.", "16.", "17.", "18.", "19.", "20.", "21.", "22.", "23.", "24.", "25.", "26."], ["Casualty Description", "COVER", "NOTICE", "Dead (Combat)", "Dead (Combat)", "Dead (Combat)", "Dead (Combat)", "Dead (Combat)", "Dead (Combat)", "Dead (Combat)", "Dead (Combat)", "Dead (Combat)", "Dead (Combat)", "Missing", "Wounded", "Wounded", "Wounded", "Wounded", "Wounded", "Wounded", "Wounded", "Wounded", "Wounded", "Wounded", "Wounded", "Wounded", "Wounded", "Dead (Prison Camp) and Released Prisoners", "Released Prisoners"], ["Image Size", "(223457 bytes)", "(262349 bytes)", "(329215 bytes)", "(381329 bytes)", "(402372 bytes)", "(356443 bytes)", "(411963 bytes)", "(384550 bytes)", "(405206 bytes)", "(394558 bytes)", "(354350 bytes)", "(389122 bytes)", "(206395 bytes)", "(397147 bytes)", "(350505 bytes)", "(346502 bytes)", "(404880 bytes)", "(399705 bytes)", "(401392 bytes)", "(394645 bytes)", "(388402 bytes)", "(403863 bytes)", "(377636 bytes)", "(332761 bytes)", "(383403 bytes)", "(286739 bytes)", "(324902 bytes)", "(366204 bytes)"]], "pageTitle": "WWII Casualties: Mississippi", "title": "", "url": "http://archives.gov/research/military/ww2/navy-casualties/mississippi.html", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990177.43/warc/CC-MAIN-20150728002310-00191-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 13620556, "recordOffset": 13612354, "tableOrientation": "HORIZONTAL", "textBeforeTable": "Index | Descriptive Information | More World War II links Table of Contents by State State Summary of War Casualties from World War II for Navy, Marine Corps, and Coast Guard Personnel from: Mississippi --> Online Guides and Research Aids in the Regions Published Research Guides Citing Records in the National Archives Research by Federal Agency Guide to Federal Records Research Tools and Resources --> More Topics. . . JFK Assassination Holocaust Era Assets Bankruptcy Records African Americans Native Americans World War II State Department and Diplomacy Veterans' Service Records Genealogy Often-Requested Records Access to Archival Databases", "textAfterTable": "Top of Page DESCRIPTIVE INFORMATION National Archives Identifier: 305209 Title: State Summary of War Casualties from World War II for Navy, Marine Corps, and Coast Guard Personnel from Mississippi, 1946 Creator: Department of the Navy. Bureau of Naval Personnel. (1942-09/18/1947) ( Most Recent) Type of Archival Materials: Textual Records Level of Description: Item from Record Group 24: Records of the Bureau of Naval Personnel. This list identifies those men on active duty with the United States Navy, Marine Corps and Coast Guard, whose deaths resulted directly from enemy action or from operational activities against the enemy in war zones from December 7, 1941, to the end of World War II. Casualties which occurred in the United States, or as a result of disease, homicide, or suicide anywhere are not included. Entries in the list are arranged into the following sections: Dead (Combat), Dead (Prison Camp), Missing, Wounded and Released Prisoners, and thereunder alphabetically by name. The list includes the rank of the decedent, and the name, address and relationship of next-of-kin. Location: Modern Miitary Records LICON, Textual Archives Services Division (NWCTM) National Archives at College Park, 8601 Adelphi Road, College Park, Md 20740-6001 PHONE:301-837-3510, FAX: 301-837-1752, EMAIL: inquire@nara.gov For More WWII Information see: The Military Records page in Genealogy. The Military Resources: World War II page from the Archives Library Information Center", "hasKeyColumn": false, "keyColumnIndex": -1, "headerRowIndex": 0}