{"relation": [["Drive combination", "4x 2.5-inch hot-swap drive bays", "8x 2.5-inch hot-swap drive bays", "4x 2.5-inch hot-swap drive bays + 8x 1.8-inch hot-swap SSD bays", "8x 1.8-inch hot-swap SSD bays", "16x 1.8-inch hot-swap SSD bays"], ["Backplanes required", "1x 4x 2.5\" HS 12Gb SAS HDD Backplane, 44X4104", "2x 4x 2.5\" HS 12Gb SAS HDD Backplane, 44X4104", "1x 4x 2.5\" HS 12Gb SAS HDD Backplane, 44X4104 1x 8x 1.8\" HS 12Gb SAS HDD Backplane, 44X4106", "1x 8x 1.8\" HS 12Gb SAS HDD Backplane, 44X4106", "2x 8x 1.8\" HS 12Gb SAS HDD Backplane, 44X4106"], ["Number of controllers supported", "1", "1", "2", "1", "2"]], "pageTitle": "IBM Redbooks | System x3950 X6 (3837)", "title": "", "url": "http://www.redbooks.ibm.com/abstracts/tips1132.html?Open", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 10, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990123.20/warc/CC-MAIN-20150728002310-00254-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 669780603, "recordOffset": 669743424, "tableOrientation": "HORIZONTAL", "TableContextTimeStampBeforeTable": "{18941=Changes in the June 19 update: * Corrected the supported quantity for the 3.84TB 6 Gb SAS Enterprise Capacity SSD (part number 00NA671), 20861=This document is being moved! In September 2015, this document will be moved to lenovopress.com and will no longer be available on the IBM Redbooks site. Please bookmark the URL http://lenovopress.com/TIPS1132 to access this specific document both today and after the migration in September. Learn more}", "TableContextTimeStampAfterTable": "{30423=Memory options Lenovo DDR3 memory is compatibility tested and tuned for optimal System x performance and throughput. Lenovo memory specifications are integrated into the light path diagnostics for immediate system performance feedback and optimum system uptime. From a service and support standpoint, Lenovo memory automatically assumes the system warranty, and Lenovo provides service and support worldwide. The x3950 X6 supports DDR3 memory operating at speeds up to 1600 MHz. The server supports up to 192 DIMMs when all eight processors are installed, 24 DIMMs per processor. Each processor has four memory channels that are implemented using Scalable Memory Interface generation 2 (SMI2) chips, and the server implements three DIMMs per channel. The processor and the corresponding memory DIMM slots are on the Compute Book. The following table lists the memory options that are available for x3950 X6. Table 5. Memory options, 159111=External disk storage expansion The server supports attachment to external storage expansion enclosures, such as the EXP2500 series, by using the ServeRAID M5120 SAS/SATA Controller. The server can also be attached to supported external storage systems, such as the IBM DS3500 series, by using a supported HBA (see the earlier \"Storage HBA\" section). The following table shows the RAID controllers and options for external disk storage expansion. Table 22. RAID controllers and options for external disk storage expansion, 229340=Publish Date 18 February 2014, 229398=Last Update 19 June 2015, 229991=IBM Form Number TIPS1132}", "lastModified": "Mon, 03 Aug 2015 23:22:15 GMT", "textBeforeTable": "Standard specifications The following table lists the standard specifications. Table 1. Standard specifications Back to top Locations of key components and connectors The following figure shows the front of the x3950 X6 server. Figure 2. Front view of the System x3950 X6 The following figure shows the rear of the x3950 X6 server. Figure 3. Rear view of the System x3950 X6 Back to top Three-year customer-replaceable unit and onsite limited warranty, 9x5 next business day. Optional service upgrades are available. Built-in diagnostic tests, using Dynamic Systems Analysis (DSA) Preboot, speed up troubleshooting tasks to reduce service time. Solid-state drives (SSDs) offer better reliability than traditional mechanical HDDs for greater uptime. IBM Systems Director® provides proactive systems management. It offers comprehensive systems management tools that help increase uptime, reduce costs, and improve productivity through advanced server management capabilities. Industry-standard Advanced Encryption Standard (AES) NI support for faster and stronger encryption. Two integrated Trusted Platform Modules (TPMs) 1.2 support enables advanced cryptographic functionality, such as digital signatures and remote attestation. Integrated industry-standard Unified Extensible Firmware Interface (UEFI) enables improved", "textAfterTable": "Disk drive bays Up to thirty-two 1.8-inch eXFlash SSD bays, or up to 16x eight 2.5-inch hot-swap SAS/SATA bays. Maximum internal storage Up to 28.8 TB with 1.8 TB 2.5-inch SAS HDDs, up to 25.6 TB with 1.6 TB 2.5-inch SAS SSDs, or up to 25.6 TB with 800 GB 1.8-inch SATA SSDs. RAID support 12 Gb SAS/SATA RAID 0, 1, or 10 with ServeRAID M5210; optional upgrades to RAID 5 or 50 are available (zero-cache; 1 GB non-backed cache; 1 GB or 2 GB flash-backed cache). Upgrades to RAID 6 or 60 available for M5210 with 1 GB or 2 GB upgrades. Optical and tape bays None. Network interfaces Mezzanine LOM (ML2) slot for dual-port 10 GbE cards with SFP+ or RJ-45 connectors or quad-port GbE cards with RJ-45 connectors. See Table 2. Dedicated 1 GbE port for systems management. PCI Expansion slots Up to 22 PCIe slots plus two dedicated Mezzanine LOM slots. The slots are as follows: Four PCIe 3.0 x8 slots for internal RAID controllers (in two Storage Books) Four PCIe 3.0 x16 slots (x16-wired), half length, full height (in two Primary I/O Books) Two PCIe 3.0 x16 (x8-wired),", "hasKeyColumn": false, "keyColumnIndex": -1, "headerRowIndex": 0}