{"relation": [["Formatting Code", "", "", ".........", "...", "<b>...</b>", "<i>...</i>", "...", "...", "...", "...", "...", "..."], ["Effect", "Line break", "Horizontal rule", "Lists: ordered list, unordered list, and list item", "Paragraph", "Bold", "Italic", "Teletype or monospaced", "Larger font", "Smaller font", "Preformatted: layout defined by whitespace and line break characters preserved", "Span the enclosed text", "Anchor"]], "pageTitle": "Using Output Components - 11g Release 1 (11.1.1.5.0)", "title": "", "url": "http://docs.oracle.com/cd/E25054_01/web.1111/b31973/af_output.htm", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 4, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042982745.46/warc/CC-MAIN-20150728002302-00066-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 73343107, "recordOffset": 73316472, "tableOrientation": "HORIZONTAL", "lastModified": "Thu, 20 Sep 2012 18:01:54 GMT", "textBeforeTable": "Table 16-1 Formatting Codes for Use in af:outputFormatted Values Only certain formatting and character codes can be used. Table 16-1 lists the formatting codes allowed for formatting values in the outputFormatted component. 16.2.2 What You May Need to Know About Allowed Format and Character Codes in the outputFormatted Component styleClass attribute takes precedence. styleClass attributes are both set, the styleUsage and Note: If the Figure 16-3 styleUsage Attribute Values Figure 16-3 shows how the styleUsage values apply styles to the component. pageStamp instruction inContextBranding Expand the Common section of the Property Inspector and set the value attribute to the value to be displayed. If you are using the outputFormatted component, use HTML formatting codes to format the text as needed, as described in Table 16-1 and Table 16-2. The outputFormatted component also supports the styleUsage attribute whose values are the following predefined styles for the text: Output Text (Active) from the Component Palette. activeOutputText component by dragging an outputText component.", "textAfterTable": "Table 16-2 lists the character codes for displaying special characters in the values. Table 16-2 Character Codes for Use in af:outputFormatted Values Character Code Character &lt; Less than &gt; Greater than &amp; Ampersand &reg; Registered &copy; Copyright &nbsp; Nonbreaking space &quot; Double quotation marks The attributes class, style, and size can also be used in the value attribute of the outputFormatted component, as can href constructions. All other HTML tags are ignored. Note: For security", "hasKeyColumn": true, "keyColumnIndex": 1, "headerRowIndex": 0}