{"relation": [["Year", "1801", "1831", "1841", "1871", "1881", "1891", "1901", "1911", "1921"], ["Inhabitants", "94", "102", "90", "102", "117", "118", "227", "514", "746"]], "pageTitle": "England GenWeb Project - Lincolnshire, Healing", "title": "", "url": "http://www.rootsweb.ancestry.com/~englin/H/healing.htm", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 2, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989142.82/warc/CC-MAIN-20150728002309-00198-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 684366662, "recordOffset": 684358460, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{13911=© 2004 EnglandGenWeb Project}", "textBeforeTable": "Top Population Bastardy cases would be heard in the Grimsby petty session hearings. In 1890, this parish was transferred to the new Grimsby Poor Law Union. This parish was part of the Caistor Poor Law Union. The Common Lands were enclosed here in 1839. Top Poorhouses, Poor Law, etc. District governance is provided by the North-East Lincolnshire Council. The Healing Parish Council meets at the Village Hall. They will not do family history lookups for you. The council does publish a monthly \"Village News\" which is distributed to residents of Healing. In April, 1968, this Civil Parish was enlarged by 593 acres at the abolition of Great Coates Civil Parish. Kelly's 1900 and 1913 Directories of Lincolnshire report, perhaps erroneously, that the parish is in the North Lindsey division of the county. The parish was in the ancient Bradley Haverstoe Wapentake in the Central Lindsey district in the parts of Lindsey. This place was an ancient parish in Lincolnshire and became a modern Civil Parish when those were established. Top Politics and Governance The name derives from the Old English Haegel+ingas, meaning \"settlement of the family or followers of a man named Haegel\". It appears as Hegelinge in the 1086 Domesday Book. [A. D. Mills, \"A", "textAfterTable": "Top Schools The children of the parish attended school in Stallingborough and Great Coates. A Public Elementary School was built here in 1910 for 102 children. See our Schools page for more information on researching school records. Top Return to the Alphabetical Index Last updated on 26-March-2015 Click here to send any questions and/or comments about this site to the Lincolnshire County Coordinator. © 2004 EnglandGenWeb Project", "hasKeyColumn": false, "keyColumnIndex": -1, "headerRowIndex": 0}