{"relation": [["", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", ""], ["new text begin Column A new text end", "new text begin 326B.82, subd. 2 new text end", "new text begin 326B.82, subd. 3 new text end", "new text begin 326b.82, subd. 5 new text end", "new text begin 326B.82, subd. 7 new text end", "new text begin 326B.82, subd. 8 new text end", "new text begin 326B.82, subd. 9 new text end", "new text begin 326B.82, subd. 10 new text end", "new text begin 326B.821, subd. 4 new text end", "new text begin 326B.821, subd. 5 new text end", "new text begin 326B.821, subd. 5a new text end", "new text begin 326B.821, subd. 6 new text end", "new text begin 326B.821, subd. 7 new text end", "new text begin 326B.821, subd. 8 new text end", "new text begin 326B.821, subd. 9 new text end", "new text begin 326B.821, subd. 10 new text end", "new text begin 326B.821, subd. 11 new text end", "new text begin 326B.821, subd. 12 new text end", "new text begin 326B.821, subd. 13 new text end", "new text begin 326B.821, subd. 14 new text end", "new text begin 326B.821, subd. 15 new text end", "new text begin 326B.821, subd. 16 new text end", "new text begin 326B.821, subd. 17 new text end", "new text begin 326B.821, subd. 18 new text end", "new text begin 326B.821, subd. 19 new text end", "new text begin 326B.821, subd. 20 new text end", "new text begin 326B.821, subd. 22 new text end", "new text begin 326B.821, subd. 23 new text end", "new text begin 326B.821, subd. 24 new text end"], ["new text begin Column B new text end", "new text begin 326B.091, subd. 2a new text end", "new text begin 326B.091, subd. 2b new text end", "new text begin 326B.091, subd. 2c new text end", "new text begin 326B.091, subd. 4a new text end", "new text begin 326B.091, subd. 5a new text end", "new text begin 326B.091, subd. 5c new text end", "new text begin 326B.091, subd. 7 new text end", "new text begin 326B.0981, subd. 17 new text end", "new text begin 326B.0981, subd. 3 new text end", "new text begin 326B.0981, subd. 4 new text end", "new text begin 326B.0981, subd. 5 new text end", "new text begin 326B.0981, subd. 6 new text end", "new text begin 326B.099, subd. 1 new text end", "new text begin 326B.099, subd. 2 new text end", "new text begin 326B.099, subd. 3 new text end", "new text begin 326B.099, subd. 4 new text end", "new text begin 326B.0981, subd. 7 new text end", "new text begin 326B.0981, subd. 8 new text end", "new text begin 326B.0981, subd. 9 new text end", "new text begin 326B.0981, subd. 10 new text end", "new text begin 326B.0981, subd. 11 new text end", "new text begin 326B.099, subd. 5 new text end", "new text begin 326B.0981, subd. 12 new text end", "new text begin 326B.0981, subd. 13 new text end", "new text begin 326B.0981, subd. 14 new text end", "new text begin 326B.0981, subd. 2 new text end", "new text begin 326B.0981, subd. 15 new text end", "new text begin 326B.0981, subd. 16 new text end"]], "pageTitle": "Chapter 4 - Minnesota Session Laws", "title": "", "url": "https://www.revisor.mn.gov/laws/?id=4&doctype=Chapter&year=2011&type=1", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 55, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990445.44/warc/CC-MAIN-20150728002310-00146-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 924172239, "recordOffset": 924115226, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{331426=(a) All deleted text begin single-sectiondeleted text end used manufactured homes reinstalled less than 24 months from the date of installation by the first purchaser must be reinstalled in compliance with subdivision 1c. All deleted text begin single-sectiondeleted text end used manufactured homes reinstalled more than 24 months from the date of installation by the first purchaser may be reinstalled without a frost-protected foundation if the home is reinstalled in compliance with Minnesota Rules, chapter 1350, for above frost-line installations and the notice requirement of subdivision 1f is complied with by the seller and the purchaser of the deleted text begin single-sectiondeleted text end used manufactured home., 366233=Copyright © 2011 by the Revisor of Statutes, State of Minnesota. All rights reserved., 365622=new text begin Unless otherwise specified, this act is effective retroactively from July 1, 2011, and supersedes and replaces funding authorized by order of the Second Judicial District Court in Case No. 62-CV-11-5203. new text end, 82858=new text begin (2) The commissioner must report to the legislative committees having jurisdiction over economic development issues by January 10 each year on the following: methodologies and processes for soliciting and evaluating grant proposals; criteria and methodology for selecting grant recipients; methods and procedures for monitoring the use of grant awards including expenditures for administrative expenses by grant recipients; and methods for measuring outcomes and accomplishments of grant recipients including but not limited to the total number of youth served by each grant recipient, number of job placements, job search, training or placement services, education or other employment-related services, preemployment skill development, average wage of jobs, amount of private funds leveraged, return on investment to the state, and ongoing solicitation and feedback from interested parties regarding ongoing improvement and enhancement to the competitive grant program. The commissioner must also report on department expenditures related to the administration and monitoring of grants under this subdivision. new text end, 365995=Presented to the governor July 19, 2011, 250242=(b) The commissioner shall in a manner determined by the commissioner, without the need for any rulemaking under chapter 14, phase in the renewal of water conditioning master and journeyman licenses from one year to two years. By June 30, 2011, all renewed water conditioning contractor deleted text begin and installerdeleted text end licenses shall be two-year licenses. The Plumbing Board may by rule prescribe for the expiration and renewal of licenses., 246490=(c) Applications for contractor licenses shall be made to the commissioner, with all fees required by section 326B.092. All contractor licenses shall expire on December 31 of each odd-numbered year after issuance or renewal., 317330=No person shall sell or offer for sale in this state any used manufactured home manufactured after June 14, 1976, or install for occupancy any used manufactured home manufactured after June 14, 1976, unless the used manufactured home complies with the Notice of Compliance Form as provided in this subdivision. If manufactured after June 14, 1976, the home must bear a label as required by the secretary. The Notice of Compliance Form shall be signed by the seller and purchaser indicating which party is responsible for either making or paying for any necessary corrections prior to the sale and transferring ownership of the manufactured home., 197747=If the fee for the permit issued is fixed in amount the surcharge is equivalent to one-half mill (.0005) of the fee or 50 cents, except that effective July 1, 2010, until June 30, deleted text begin 2011deleted text endnew text begin 2013new text end, the permit surcharge is equivalent to one-half mill (.0005) of the fee or $5, whichever amount is greater. For all other permits, the surcharge is as follows:, 197262=To defray the costs of administering sections 326B.101 to 326B.194, a surcharge is imposed on all permits issued by municipalities in connection with the construction of or addition or alteration to buildings and equipment or appurtenances after June 30, 1971. The commissioner may use any surplus in surcharge receipts to award grants for code research and development and education., 130298=new text begin $68,000 each year is for grants to area labor management committees. Grants may be awarded for a 12-month period beginning July 1 each year. Any unencumbered balance remaining at the end of the first year does not cancel but is available for the second year. new text end, 244097=An unlicensed individual may register by completing and submitting to the commissioner an application form provided by the commissioner, with all fees required by section 326B.092. A completed application form must state the date the individual began training, the individual's age, schooling, previous experience, and employer, and other information required by the commissioner. The new text begin Plumbing new text endBoard may prescribe rules, not inconsistent with this section, for the registration of unlicensed individuals. Applications for initial registration may be submitted at any time. Registration must be renewed annually and shall be for the period from July 1 of each year to June 30 of the following year., 59066=new text begin (e)(1) $356,000 the first year is a onetime appropriation from the general fund for a grant to BioBusiness Alliance of Minnesota for bioscience business development programs to promote and position the state as a global leader in bioscience business activities. These funds may be used to create, recruit, retain, and expand biobusiness activity in Minnesota; implement the destination 2025 statewide plan; update a statewide assessment of the bioscience industry and the competitive position of Minnesota-based bioscience businesses relative to other states and other nations; and develop and implement business and scenario-planning models to create, recruit, retain, and expand biobusiness activity in Minnesota. new text end, 249988=(a) Each initial water conditioning master and water conditioning journeyman license shall be effective for more than one calendar year and shall expire on December 31 of the year after the year in which the application is made., 32244=amending Minnesota Statutes 2010, sections 116J.035, by adding a subdivision; 116J.551, subdivision 1; 181.723, subdivision 5; 182.6553, subdivision 6; 268A.15, subdivision 4; 326B.04, subdivision 2; 326B.091; 326B.098; 326B.13, subdivision 8; 326B.148, subdivision 1; 326B.42, subdivisions 8, 9, 10, by adding subdivisions; 326B.435, subdivision 2; 326B.438; 326B.46, subdivisions 1, 1a, 1b, 2, 3; 326B.47, subdivisions 1, 3; 326B.49, subdivision 1; 326B.56, subdivision 1; 326B.58; 326B.82, subdivisions 2, 3, 7, 9; 326B.821, subdivisions 1, 5, 5a, 6, 7, 8, 9, 10, 11, 12, 15, 16, 18, 19, 20, 22, 23; 326B.865; 326B.89, subdivisions 6, 8; 327.32, subdivisions 1a, 1b, 1e, 1f, 7; 327.33, subdivision 2; 327C.095, subdivision 12; 341.321; Laws 2009, chapter 78, article 1, section 18; proposing coding for new law in Minnesota Statutes, chapters 116J; 326B; repealing Minnesota Statutes 2010, sections 326B.82, subdivisions 4, 6; 326B.821, subdivision 3; Laws 2007, chapter 135, article 2, section 34., 142016=new text begin The unexpended balance as of June 30, 2011, estimated to be $1,575,000, of funds collected for unemployment insurance state administration under Minnesota Statutes, section 268.18, is transferred to the general fund before the closing of fiscal year 2011. new text end, 245860=(b) All initial journeyman plumber's licenses shall be effective for more than one calendar year and shall expire on December 31 of the year after the year in which the application is made. All master plumber's licenses shall expire on December 31 of each even-numbered year after issuance or renewal. The commissioner shall in a manner determined by the commissioner, without the need for any rulemaking under chapter 14, phase in the renewal of master and journeyman plumber's licenses from one year to two years. By June 30, 2011, all renewed master and journeyman plumber's licenses shall be two-year licenses., 77869=new text begin (2) The commissioner must report to the legislative committees having jurisdiction over economic development issues by January 10 each year on the following: methodologies and processes for soliciting and evaluating grant proposals; criteria and methodology for selecting grant recipients; methods and procedures for monitoring the use of grant awards including expenditures for administrative expenses by grant recipients; and methods for measuring outcomes and accomplishments of grant recipients including but not limited to the total number of job placements by each grant recipient, average wage of jobs in which clients served by grant recipients are placed, specific job skills developed and measures of improved employability or employment opportunities by the clients of the grant recipients, amount of private funds leveraged, return on investment to the state, and ongoing solicitation and feedback from interested parties regarding ongoing improvement and enhancement to the competitive grant program. The commissioner must also report on department expenditures related to the administration and monitoring of grants under this subdivision. new text end, 142432=new text begin In fiscal years 2012 and 2013, the unexpended balance of funds collected for unemployment insurance state administration under Minnesota Statutes, section 268.18, estimated to be $900,000 each year, is transferred to the general fund before the closing of each fiscal year. new text end, 64675=new text begin (2) The commissioner must report to the legislative committees having jurisdiction over economic development issues by January 10 each year on the following: methodologies and processes for soliciting and evaluating grant proposals; criteria and methodology for selecting grant recipients; methods and procedures for monitoring the use of grant awards including expenditures for administrative expenses by grant recipients; and methods for measuring outcomes and accomplishments of grant recipients including but not limited to the total number of new jobs created by each grant recipient, average wage of new jobs created, amount of private funds leveraged, number of new businesses created and the number of new jobs per business, return on investment to the state, and ongoing solicitation and feedback from interested parties regarding ongoing improvement and enhancement to the competitive grant program. The commissioner must also report on department expenditures related to the administration and monitoring of grants under this subdivision. new text end, 59943=new text begin (2) The BioBusiness Alliance must report each year by February 15 to the committees of the house of representatives and the senate having jurisdiction over bioscience industry activity in Minnesota on the use of funds; the number of bioscience businesses and jobs created, recruited, retained, or expanded in the state since the last reporting period; the competitive position of the biobusiness industry; and utilization rates and results of the business and scenario-planning models and outcomes resulting from utilization of the business and scenario-planning models. new text end, 364935=new text begin This section is effective January 1, 2012. new text end, 309579=new text begin This section is effective January 1, 2012. new text end, 216530=deleted text begin (a) A persondeleted text endnew text begin An individualnew text end who on August 1, 2010, deleted text begin holdsdeleted text endnew text begin possesses new text end a valid certificate deleted text begin authorized bydeleted text endnew text begin meeting the requirements of new text end the American Society of Sanitary Engineering (ASSE) new text begin Standard 6010 and is a qualified brazer new text endin accordance with deleted text begin standards recommended bydeleted text endnew text begin the provisions required in new text end the National Fire Protection Association deleted text begin under NFPAdeleted text endnew text begin (NFPA)new text end 99C is exempt from the new text begin licensing new text endrequirements of subdivision 2new text begin and may install, maintain, and repair a medical gas systemnew text end. This exemption applies only if the deleted text begin persondeleted text endnew text begin individualnew text end maintains a valid certification deleted text begin authorized by the ASSEdeleted text endnew text begin in accordance with ASSE Standard 6010 and the brazer qualifications in NFPA 99C, and is certified by the commissioner under rules adopted by the Minnesota Plumbing Boardnew text end., 43188=new text begin The sums shown in the columns marked \"Appropriations\" are appropriated to the agencies and for the purposes specified in this article. The appropriations are from the general fund, or another named fund, and are available for the fiscal years indicated for each purpose. The figures \"2012\" and \"2013\" used in this article mean that the appropriations listed under them are available for the fiscal year ending June 30, 2012, or June 30, 2013, respectively. \"The first year\" is fiscal year 2012. \"The second year\" is fiscal year 2013. \"The biennium\" is fiscal years 2012 and 2013. new text end, 348558=(c)new text begin If the unencumbered fund balance in the manufactured home relocation trust fund is less than $1,000,000 as of June 30 of each year,new text end the commissioner of management and budget shall deleted text begin annuallydeleted text end assess each manufactured home park owner by mail the total amount of $12 for each licensed lot in their park, payable on or before September 15 of deleted text begin eachdeleted text endnew text begin thatnew text end year. The commissioner of management and budget shall deposit deleted text begin thedeleted text endnew text begin anynew text end payments in the Minnesota manufactured home relocation trust fund. On or before July 15 of each year, the commissioner of management and budget shall prepare and distribute to park owners a letter explainingnew text begin whether funds are being collected for that year, information aboutnew text end the collection, an invoice for all licensed lots, and a sample form for the park owners to collect information on which park residents have been accounted for.new text begin If assessed under this paragraph,new text end the park owner may recoup the cost of the $12 assessment as a lump sum or as a monthly fee of no more than $1 collected from park residents together with monthly lot rent as provided in section 327C.03, subdivision 6. Park owners may adjust payment for lots in their park that are vacant or otherwise not eligible for contribution to the trust fund under section 327C.095, subdivision 12, paragraph (b), and deduct from the assessment accordingly., 250818=(c) All water conditioning contractor licenses shall expire on December 31 of the year after issuance or renewal., 73257=new text begin (g) $5,245,000 each year is from the general fund and $6,830,000 each year is from the workforce development fund for extended employment services for persons with severe disabilities or related conditions under Minnesota Statutes, section 268A.15. Of the general fund appropriation, $125,000 each year is to supplement funds paid for wage incentives for the community support fund established in Minnesota Rules, part 3300.2045. Notwithstanding Minnesota Rules, parts 3300.2030 to 3300.2055, the commissioner may adjust contracts with eligible extended employment providers in order to achieve required reductions through June 30, 2013. new text end, 96391=new text begin For the rental housing assistance program for persons with a mental illness or families with an adult member with a mental illness under Minnesota Statutes, section 462A.2097. new text end, 212206=new text begin (d) The Plumbing Board shall adopt expedited rules under section 14.389 that are related to the certification of backflow prevention rebuilders and backflow prevention testers. Section 326B.13, subdivision 8, does not apply to these rules. Notwithstanding the 18-month limitation under section 14.125, this authority expires on December 31, 2014. new text end, 180047=(b) Individuals who are applying for or renewing a residential building contractor or residential remodeler license under sections 326B.197, 326B.802, 326B.805, 326B.81, 326B.815, 326B.821 to 326B.86, 326B.87 to 326B.885, and 327B.041, and any rules promulgated pursuant thereto, may simultaneously apply for or renew an independent contractor exemption certificate. The commissioner shall create an application form that allows for the simultaneous application for both a residential building contractor or residential remodeler license and an independent contractor exemption certificate. If individuals simultaneously apply for or renew a residential building contractor or residential remodeler license and an independent contractor exemption certificate using the form created by the commissioner, individuals shall only be required to provide, in addition to the information required by section 326B.83 and rules promulgated pursuant thereto, the sworn statement required by paragraph (a), clause (8), and any additional information required by this subdivision that is not also required by section 326B.83 and any rules promulgated thereto. deleted text begin When individuals submit a simultaneous application on the form created by the commissioner for both a residential building contractor or residential remodeler license and an independent contractor exemption certificate, the application fee shall be $150.deleted text end An independent contractor exemption certificate that is in effect before March 1, 2009, shall remain in effect until March 1, 2013, unless revoked by the commissioner or canceled by the individual., 146663=new text begin This section is effective retroactively from July 1, 2010. new text end, 219564=deleted text begin (b) A person who on August 1, 2010, possesses a current Minnesota master or journeyman plumber's license and a valid certificate authorized by the ASSE in accordance with standards recommended by the National Fire Protection Association under NFPA 99C is exempt from the requirements of subdivision 2 and may install, maintain, and repair deleted text end deleted text begin a medical gas system. This exemption applies only if a person maintains a valid Minnesota master or journeyman plumber's license and valid certification authorized by the ASSE. deleted text end, 163406=The commissioner of employment and economic development shall evaluate the extended employment program to determine whether the purpose of extended employment as defined in subdivision 2 is being achieved. new text begin The evaluation must include information for the preceding funding year derived from the independent compliance audits of extended employment service providers submitted to the department on or before October 31 of each year. new text endThe evaluation must include an assessment of whether workers in the extended employment program are satisfied with their employment. A written report of this evaluation must be prepared at least every two years and made available to the public., 323850=The water heater enclosure in this home is required to have interior finish with a flame spread rating not exceeding 25 deleted text begin feetdeleted text end, as specified in the 1976 United States Department of Housing and Urban Development Code governing manufactured housing construction., 366047=Signed by the governor July 20, 2011, 9:05 a.m., 318265=This notice must be completed and signed by the purchaser(s) and the seller(s) of the used manufactured home described in the purchase agreement and on the bottom of this notice before the parties transfer ownership of a used manufactured home constructed after June 14, 1976., 175506=This is a onetime appropriation. deleted text begin The Combative Sports Commission expires on July 1, 2011, unless the commissioner of finance determines that the commission's projected expenditures for the fiscal biennium ending June 30, 2013, will not exceed the commission's projected revenues for the fiscal biennium ending June 30, 2013, from fees and penalties authorized in Minnesota Statutes 2008, chapter 341.deleted text end, 369087=700 State Office Building, 100 Rev. Dr. Martin Luther King Jr. Blvd., St. Paul, MN 55155 ♦ Phone: (651) 296-2868 ♦ TTY: 1-800-627-3529 ♦ Fax: (651) 296-0569, 57145=new text begin (b) $1,022,000 the first year and $1,022,000 the second year are from the general fund for contaminated site cleanup and development grants under Minnesota Statutes, section 116J.554. The base funding for this program is $1,272,000 each year beginning in fiscal year 2014 and thereafter. new text end, 322993=The furnace compartment of the home is required to have interior finish with a flame spread rating not exceeding 25 deleted text begin feetdeleted text end, as specified in the 1976 United States Department of Housing and Urban Development Code governing manufactured housing construction., 62305=new text begin (h) $189,000 the first year is from the workforce development fund for entrepreneur and small business development direct professional business assistance in Blue Earth, Brown, Faribault, Le Sueur, Martin, Nicollet, Sibley, Watonwan, and Waseca Counties. These services must include, but are not limited to, preventure assistance for individuals considering starting a business. Funds must be awarded to an organization or organizations that can demonstrate leverage of at least an equal amount of federal funds. Any balance in the first year does not cancel but is available in the second year. The grant recipient must report to the commissioner by February 1 of each year that the organization receives a grant with the number of customers served; the amount of direct consulting hours delivered; the number of new businesses started; the amount of capital accessed for business start-up or expansion; and the number of jobs created and retained in each county. The commissioner must report to the house of representatives and senate committees with jurisdiction over economic development finance on the effectiveness of these programs for assisting in the development of entrepreneurs and small businesses. This is a onetime appropriation. new text end}", "textBeforeTable": "JOBS, ECONOMIC DEVELOPMENT, AND HOUSING APPROPRIATIONS ARTICLE 1 BE IT ENACTED BY THE LEGISLATURE OF THE STATE OF MINNESOTA: amending Minnesota Statutes 2010, sections 116J.035, by adding a subdivision; 116J.551, subdivision 1; 181.723, subdivision 5; 182.6553, subdivision 6; 268A.15, subdivision 4; 326B.04, subdivision 2; 326B.091; 326B.098; 326B.13, subdivision 8; 326B.148, subdivision 1; 326B.42, subdivisions 8, 9, 10, by adding subdivisions; 326B.435, subdivision 2; 326B.438; 326B.46, subdivisions 1, 1a, 1b, 2, 3; 326B.47, subdivisions 1, 3; 326B.49, subdivision 1; 326B.56, subdivision 1; 326B.58; 326B.82, subdivisions 2, 3, 7, 9; 326B.821, subdivisions 1, 5, 5a, 6, 7, 8, 9, 10, 11, 12, 15, 16, 18, 19, 20, 22, 23; 326B.865; 326B.89, subdivisions 6, 8; 327.32, subdivisions 1a, 1b, 1e, 1f, 7; 327.33, subdivision 2; 327C.095, subdivision 12; 341.321; Laws 2009, chapter 78, article 1, section 18; proposing coding for new law in Minnesota Statutes, chapters 116J; 326B; repealing Minnesota Statutes 2010, sections 326B.82, subdivisions 4, 6; 326B.821, subdivision 3; Laws 2007, chapter 135, article 2, section 34. relating to economic development; modifying certain economic development fees, licensing provisions, and programs; modifying certain occupational continuing education requirements; clarifying and modifying regulation of medical gas system and manufactured home provisions; requiring reports; appropriating money for jobs, economic development, and housing purposes; An act CHAPTER 4--S.F.No. 2 Key: (1) language to be deleted (2) new language Version List", "textAfterTable": "Sec. 3. new text begin DEPARTMENT OF EMPLOYMENT AND ECONOMIC DEVELOPMENT new text end new text begin Subdivision 1. new text end new text begin Total Appropriation new text end new text begin $ new text end new text begin 61,198,000 new text end new text begin $ new text end new text begin 56,198,000 new text end new text begin Appropriations by Fund new text end new text begin 2012 new text end", "hasKeyColumn": false, "keyColumnIndex": -1, "headerRowIndex": 0}