{"relation": [["S.N", "1", "2", "3", "4", "5", "6", "7", "8", "9"], ["Method Name & Purpose", "Public Overrides Sub Close Closes the current StreamWriter object and the underlying stream.", "Public Overrides Sub Flush Clears all buffers for the current writer and causes any buffered data to be written to the underlying stream.", "Public Overridable Sub Write (value As Boolean) Writes the text representation of a Boolean value to the text string or stream. (Inherited from TextWriter.)", "Public Overrides Sub Write (value As Char) Writes a character to the stream.", "Public Overridable Sub Write (value As Decimal) Writes the text representation of a decimal value to the text string or stream.", "Public Overridable Sub Write (value As Double) Writes the text representation of an 8-byte floating-point value to the text string or stream.", "Public Overridable Sub Write (value As Integer) Writes the text representation of a 4-byte signed integer to the text string or stream.", "Public Overrides Sub Write (value As String) Writes a string to the stream.", "Public Overridable Sub WriteLine Writes a line terminator to the text string or stream."]], "pageTitle": "VB.Net - Text Files", "title": "", "url": "http://www.tutorialspoint.com/vb.net/vb.net_text_files.htm", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 1, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987228.91/warc/CC-MAIN-20150728002307-00340-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 808272099, "recordOffset": 808263897, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{11251=© Copyright 2015. All Rights Reserved.}", "lastModified": "Wed, 29 Jul 2015 20:08:30 GMT", "textBeforeTable": "The StreamReader class also inherits from the abstract base class TextReader that represents a reader for reading series of characters. The following table describes some of the commonly used methods of the StreamReader class: The StreamReader Class The StreamReader and StreamWriter classes are used for reading from and writing data to text files. These classes inherit from the abstract base class Stream, which supports reading and writing bytes into a file stream. Next Page   Previous Page google_ad_channel = \"\"; google_ad_type = \"image\"; google_ad_format = \"468x60_as\"; google_ad_height = 60; google_ad_width = 468; google_ad_client = \"pub-7133395778201029\";", "textAfterTable": "line = sr.ReadLine() End While End Using Catch e As Exception ' Let the user know what went wrong. Console.WriteLine(\"The file could not be read:\") Console.WriteLine(e.Message) End Try Console.ReadKey() End Sub End Module Guess what it displays when you compile and run the program! The StreamWriter Class The StreamWriter class inherits from the abstract class TextWriter that represents a writer, which can write a series of character. The following table shows some of the most commonly used methods of this class: S.N Method Name & Purpose 1 Public Overrides Sub Close Closes the current StreamWriter object and the underlying stream. 2 Public Overrides Sub Flush Clears all buffers for the current writer and causes any buffered data to be written to the underlying stream. 3 Public Overridable Sub Write (value As Boolean) Writes the text representation of a Boolean value to the text string or stream. (Inherited from TextWriter.) 4 Public Overrides Sub Write (value As Char) Writes a character to the stream. 5 Public Overridable Sub Write (value As Decimal) Writes the text representation of a decimal value to the text string or stream. 6 Public Overridable Sub Write (value As Double) Writes the text representation of an 8-byte floating-point value to the text string or stream. 7 Public Overridable Sub Write (value As", "hasKeyColumn": false, "keyColumnIndex": -1, "headerRowIndex": 0}