{"relation": [["Latest Articles", "OLD MACDONALDâ\u0080\u0099S SMARM", "AN EXPERT VIEW", "EQUALITY EQUALS ENVY", "RETURN TO THE POD", "MONEY SAFE"], ["", "27", "14", "14", "2", "33"]], "pageTitle": "OILY AL | Daily Telegraph Tim Blair Blog", "title": "", "url": "http://blogs.news.com.au/dailytelegraph/timblair/index.php/dailytelegraph/comments/oily_al", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989790.89/warc/CC-MAIN-20150728002309-00173-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 33622871, "recordOffset": 33589617, "tableOrientation": "HORIZONTAL", "TableContextTimeStampBeforeTable": "{4495=When Bin Laden was killed in May 2011, ABC TV took live coverage from Al Jazeera.  That was the last straw for me and I have hardly watched ABC TV since., 19716=It was 41.8C at 4pm. And I can remember the day in 1976 as well, went to the local swimming pool if I remember correctly., 21460=In case you are interested, January 4th 1976, some coincidence eh, and the previous record 40.8C. So all their warming alarmist crap amounts to is 0.1degrees C in 36 years, or zero really since that would be within the margin of error for readings taken back in 1976 and converted from Fahrenheit., 21879=Speaking of climate alarmists, the ABC over and over on every bulletin, particularly during the Tassie bushfire coverage, made sure everyone knew it was not just the hottest January day ever recorded on the 4th at 40.9C, but in fact the hottest day ever recorded in 120 years of records. The one thing they didn’t tell everyone was what was the previous maximum and when was it recorded., 17411=What a year 2012 was: the Gaia Guy recanted and Al G sold his soul to the devil and big oil. Way to go, big fella!}", "textBeforeTable": "Commenting for this article is no longer available, try one of the articles below for more from the Tim Blair blog. > 2  1  Newest first    Page 1 of 2       Oldest | Show google_skip = 6; google_safe = 'high'; google_encoding = 'utf8'; google_language = 'en'; google_ad_type = 'text'; google_max_num_ads = '3'; google_ad_output = 'js'; google_ad_channel = 'blogs'; google_ad_client = 'ca-nd-dailytelegraph_js'; // substitute for client_id var googleAdType = 2;", "textAfterTable": "Recently Popular THE DRAGON WITH THE GIRL TATTOO 226 THE MANY MOODS OF CLEMENTINE FORD 176 WORSE THAN THE SOMME 166 CROWN OUR CRAZY QUEEN IN 2015 165 A FRIGHTBAT'S FATE 165 Advertisement Latest Articles Article OLD MACDONALDâ\u0080\u0099S SMARM 27 AN EXPERT VIEW 14 EQUALITY EQUALS ENVY 14 RETURN TO THE POD 2 MONEY SAFE 33 HE HAS LODGED A COMPLAINT 45 WHEN SYDNEY BOOED 29 SHARING CARING 44 ALL-PURPOSE ELIXIR FOR WHATEVER AILS YOU 34", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}