{"relation": [["Environment Variable", "SI_ARCH", "SI_BEGIN", "SI_CLASS", "SI_DISKLIST", "SI_DISKSIZES", "SI_DOMAINNAME", "SI_FINISH", "SI_HOSTADDRESS", "SI_HOSTNAME", "SI_INSTALLED", "SI_INST_OS", "SI_INST_VER", "SI_KARCH", "SI_MEMSIZE", "SI_MODEL", "SI_NETWORK", "SI_NUMDISKS", "SI_OSNAME", "SI_ROOTDISK", "SI_ROOTDISKSIZE", "SI_TOTALDISK"], ["Value", "The hardware architecture of the install client. The SI_ARCH variable is set when the arch keyword is used in the rules file.", "The name of the begin script, if one is used.", "The name of the profile that is used to install the install client.", "A comma-separated list of disk names on the install client. The SI_DISKLIST variable is set when the disksize keyword is used and matched in the rules file. The SI_DISKLIST and SI_NUMDISKS variables are used to determine the physical disk to use for the rootdisk. rootdisk is described in How the System's Root Disk Is Determined.", "A comma-separated list of disk sizes on the install client. The SI_DISKSIZES variable is set when the disksize keyword is used and matched in the rules file.", "The domain name. The SI_DOMAINNAME variable is set when the dommainname keyword is used and matched in the rules file.", "The name of the finish script, if one is used.", "The install client's IP address.", "The install client's host name. The SI_HOSTNAME variable is set when the hostname keyword is used and matched in the rules file.", "The device name of a disk with a specific operating system on the disk, for example, Solaris, SunOS, or System V. The SI_INSTALLED variable is set when the installed keyword is used and matched in the rules file. SI_INST_OS and SI_INST_VER are used to determine the value of SI_INSTALLED.", "The name of the operating system. SI_INST_OS and SI_INST_VER are used to determine the value of SI_INSTALLED.", "The version of the operating system. SI_INST_OS and SI_INST_VER are used to determine the value of SI_INSTALLED.", "The install client's kernel architecture. The SI_KARCH variable is set when the karch keyword is used and matched in the rules file.", "The amount of physical memory on the install client. The SI_MEMSIZE variable is set when the memsize keyword is used and matched in the rules file.", "The install client's model name. The SI_MODEL variable is set when the model keyword is used and matched in the rules file.", "The install client's network number. The SI_NETWORK variable is set when the network keyword is used and matched in the rules file.", "The number of disks on an install client. The SI_NUMDISKS variable is set when the disksize keyword is used and matched in the rules file. The SI_NUMDISKS and SI_DISKLIST variables are used to determine the physical disk to use for the rootdisk. rootdisk is described in How the System's Root Disk Is Determined.", "The operating system release on the Solaris software image. For example, you can use the SI_OSNAME variable in a script if you are installing the Solaris software on systems that are based on the version of the operating system on the Solaris Operating System DVD or the Solaris Software - 1 CD image.", "The device name of the disk that is represented by the logical name rootdisk. The SI_ROOTDISK variable is set when the disksize or the installed keyword is set to rootdisk in the rules file. The SI_ROOTDISK variable sets the device to boot from during the installation. Note – You cannot set the place of installation by using the probe keyword “rootdisk” in the rules file. For information on the \"rootdisk\" variable that is set in a JumpStart profile, see How the System's Root Disk Is Determined.", "The size of the disk that is represented by the logical name rootdisk. The SI_ROOTDISKSIZE variable is set when the disksize or the installed keyword is set to rootdisk in the rules file.", "The total amount of disk space on the install client. The SI_TOTALDISK variable is set when the totaldisk keyword is used and matched in the rules file."]], "pageTitle": "", "title": "", "url": "http://docs.oracle.com/cd/E19253-01/820-4042/jumpstartreference-1/index.html", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 66, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988317.67/warc/CC-MAIN-20150728002308-00120-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 73126355, "recordOffset": 73096417, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{139092=Specifies the patch ID numbers that are to be installed. The list should be a list of comma-separated Solaris patch IDs. The patches are installed in the order specified in the list. Do not add a space after the comma, for example: 112467-01,112765-02.}", "lastModified": "Thu, 06 Jan 2011 11:25:22 GMT", "textBeforeTable": "Table 8–1 Descriptions of Rule Keywords and Values Table 8–1 describes the keywords and values that you can use in the rules file. For detailed instructions to create a rules file, see Creating the rules File. Rule Keywords and Values Probe Keywords and Values Custom JumpStart Environment Variables Profile Keywords and Values Rule Keywords and Values This chapter lists keywords and values that you can use in the rules file, profiles, and begin and finish scripts. Chapter 8 Custom JumpStart (Reference) Next: Part II Appendixes Previous: Chapter 7 Installing With Custom JumpStart (Examples) Solaris 10 5/08 Installation Guide: Custom JumpStart and Advanced Installations Part I Using Custom JumpStart  > Chapter 8 Custom JumpStart (Reference) Solaris 10 5/08 Installation Guide: Custom JumpStart and Advanced Installations  > Documentation Home  >", "textAfterTable": "memsize 64-128 The example tries to match a system with a physical memory size between 64 and 128 Mbytes.  If you have a system that is already installed, the output of the prtconf command, line 2, reports the system's physical memory size. model actual_platform_name A system's platform name. See the Solaris Sun Hardware Platform Guide at http://docs.sun.com for a list of valid platform names. To find the platform name of an installed system, use the uname -i command or the output of the prtconf command, line 5. Note – If the actual_platform_name contains spaces, you must replace spaces with underscores (_). Example: SUNW,Sun_4_50 network network_num A system's network number, which the JumpStart program determines by performing a logical AND between the system's IP address and the subnet mask.   Example:   network 192.168.2.0 The example tries to match a system with a 192.168.2.8 IP address, if the subnet mask is 255.255.255.0.  osname Solaris_x", "hasKeyColumn": false, "keyColumnIndex": -1, "headerRowIndex": 0}