{"relation": [["Max.Voltage Rating Of Equipment", "250 Volts", "600 Volts", "5 KV", "8 KV", "15 KV", "25 KV", "35 KV", "46 KV", "69 KV"], ["Megger Size", "500 Volts", "1,000 Volts", "2,500 Volts", "2,500 Volts", "2,500 Volts", "5,000 Volts", "15,000 Volts", "15,000 Volts", "15,000 Volts"], ["Min.IR Value", "25 MΩ", "100 MΩ", "1,000 MΩ", "2,000 MΩ", "5,000 MΩ", "20,000 MΩ", "100,000 MΩ", "100,000 MΩ", "100,000 MΩ"]], "pageTitle": "Insulation Resistance (IR) Values | Electrical Notes & Articles", "title": "", "url": "https://electricalnotes.wordpress.com/2012/03/23/insulation-resistance-ir-values/", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 3, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438044160065.87/warc/CC-MAIN-20150728004240-00187-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 858367751, "recordOffset": 858311888, "tableOrientation": "HORIZONTAL", "TableContextTimeStampBeforeTable": "{80906=dear mr Parmar first of all thanks for sharing the information, 48663=Please let me know the documentary evidence of acceptable IR limits refering to IEC 61439 standard., 60387=Hello Jignesh Parmar,, 226145=IR Value of Motor as per NETA ATS 2007. Section 7.15.1, 19161=Jignesh Parmar has completed M.Tech (Power System Control), B.E(Electrical). He is member of Institution of Engineers (MIE),India. Membership No:M-1473586.He has more than 13 years experience in Transmission -Distribution-Electrical Energy theft detection-Electrical Maintenance-Electrical Projects (Planning-Designing-Technical Review-coordination -Execution). He is Presently associate with one of the leading business group as a Deputy Manager at Ahmedabad,India. He has published numbers of Technical Articles in \"Electrical Mirror\", \"Electrical India\", \"Lighting India\", \"Industrial Electrix\"(Australian Power Publications) Magazines. He is Freelancer Programmer of Advance Excel and design useful Excel base Electrical Programs as per IS, NEC, IEC,IEEE codes. He is Technical Blogger and Familiar with English, Hindi, Gujarati, French languages. He wants to Share his experience & Knowledge and help technical enthusiasts to find suitable solutions and updating themselves on various Engineering Topics., 227703=As per IEEE 43 Standard 1974,2000, 211259=1000 MΩ, 265951=March 23, 2012 124 Comments, 118143=excellent article. the formula for insulation resistance of a cable per 1000 ft. how to calculate it per meter or per feet. pl explain, 48706=Hello Mr. Jignesh Parmar,, 182737=i wish to contact mr parmar by e mail, 188345=About Jignesh.Parmar Jignesh Parmar has completed M.Tech (Power System Control), B.E(Electrical) from Gujarat University. He has more than 13 years experience in Power Transmission-Power Distribution-Electrical energy theft detection-Electrical Maintenance-Electrical Projects(Planning-Designing-coordination-Execution). He is Presently associate with one of the leading business group as a Deputy Manager at Ahmedabad,India. He is Freelancer Programmer of Advance Excel and design useful Excel Sheets of Electrical Engineering as per IS,NEC,IEC,IEEE codes. He is technical Author for \"Electrical Mirror\" and \"Electrical India\" Magazines. He is Technical Blogger and Familiar with English, Hindi, Gujarati, French languages. He wants to Share his experience & knowledge and help technical enthusiasts to find suitable solutions and updating themselves on various Engineering Topics., 82225=Sir, appreciate your ideas and procedures. May i know ,whether there is any necessity or mandatory rules saying that the speaker cables to be meggered? if yes,then what should be the applied voltage?, 177371=i wish to contact mr j.parmar by e mail. pl send your e mail to me, 141065=Thanks parmar ji very use full information regarding IR value of electric motors, 252329=(PEARL Standard / NETA MTS-1997 Table 10.1)}", "lastModified": "Wed, 05 Aug 2015 10:23:59 GMT", "textBeforeTable": "The recommended ratings of the insulation testers are given below: Insulation testers with test voltage of 500, 1000, 2500 and 5000 V are available.  Selection of IR Testers (Megger): Even when not required by the end customer, many wire and cable manufacturers use the insulation resistance test to track their insulation manufacturing processes, and spot developing problems before process variables drift outside of allowed limits. The measurement of insulation resistance is a common routine test performed on all types of electrical wires and cables. As a production test, this test is often used as a customer acceptance test, with minimum insulation resistance per unit length often specified by the customer. The results obtained from IR Test are not intended to be useful in finding localized defects in the insulation as in a true HIPOT test, but rather give information on the quality of the bulk material used as the insulation. Introduction: March 23, 2012 124 Comments Insulation Resistance (IR) Values Calculate % Voltage Regulation of Small Distribution Line. → ← Star-Delta Starter Uncategorized Comments Posts", "textAfterTable": "1000V To 2500V 4100V 1000V To 5000V  Measurement Range of Megger: Test voltage Measurement Range 250V DC 0MΩ to 250GΩ 500V DC 0MΩ to 500GΩ 1KV DC 0MΩ to 1TΩ 2.5KV DC 0MΩ to 2.5TΩ 5KV DC 0MΩ to 5TΩ  Precaution while Meggering: Before Meggering: Make sure that all connections in the test circuit are tight. Test the megger before use, whether it gives INFINITY value when not connected, and ZERO when the two terminals are connected together and the handle is rotated. During Meggering: Make sure when testing for earth, that the far end of the conductor is not touching, otherwise the test will show faulty insulation when such is not actually the case. Make sure that the earth used when testing for earth and open circuits is a good one otherwise the test will give wrong information Spare conductors should not be meggered when other working conductors of the same cable are connected to the respective circuits. After completion of cable Meggering: Ensure that all conductors have been reconnected properly. Test the functions of Points, Tracks", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}