{"relation": [["+ Primary Statistics", "Strength", "Perception", "Endurance", "Charisma", "Intelligence", "Agility", "Luck"], ["", "06", "09", "08", "01", "06", "08", "07"]], "pageTitle": "K-9 - The Fallout wiki - Fallout: New Vegas and more", "title": "", "url": "http://fallout.wikia.com/wiki/K-9", "hasHeader": true, "headerPosition": "MIXED", "tableType": "RELATION", "tableNum": 13, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042992543.60/warc/CC-MAIN-20150728002312-00315-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 84429515, "recordOffset": 84395883, "tableOrientation": "HORIZONTAL", "lastModified": "Mon, 27 Jul 2015 18:06:57 GMT", "textBeforeTable": "Primary StatisticsEdit StatisticsEdit Childkiller or their Karma drops below -101, he will leave permanently. K-9 will not join a player with low Karma and negative reputations. However, if K-9 is in the party and the player becomes a The player must kill Dr. Schreber. It is recommended that he/she closes the sound lab door first, considering it is sound-proofed, and will prevent a fight against the rest of the base. The player must repair K-9's leg mechanisms with a drive mechanism. One is available in the mechanic's shop right on the Enclave base inside a locker. Using this part on K-9 will fix him (this does not use the Repair skill); no other repairs are required. To obtain K-9, you must complete two requirements: Fix K-9: He can be found in Dr. Schreber's office at the Navarro facility. He is non-operational when first found, and requires some physical repairs. QuestsEdit no", "textAfterTable": "+ Secondary Statistics Stage 1 Stage 2 Stage 3 Stage 4 Hit Points 129 131 133 137 Armor Class 8 8 8 9 Action Points 15 16 17 19 Carry Weight 175 175 175 175 Melee Damage 17 18 19 21 Sequence 29 30 31 34 Healing Rate 2 2 2 2 + Tagged Skills Stage 1 Stage 2 Stage 3 Stage 4 Unarmed 110% 120% 130% 152% InventoryEdit Apparel Weapon Other items - - - NotesEdit", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}