{"relation": [["Level", "11", "20", "33", "45", "56"], ["Skill Rune", "Northern Breeze Reduce the Spirit cost of Tempest Rush to 25 Spirit and increase its damage to 500% weapon damage as Holy.", "Tailwind Increases your movement speed while using Tempest Rush by 25%.", "Flurry After you stop channeling Tempest Rush, you cause an icy blast to all enemies within 15 yards. The damage of the explosion increases by 150% weapon damage as Cold while channeling. Tempest Rush's damage turns into Cold.", "Electric Field Enemies within 20 yards take an additional 135% weapon damage as Lightning every second. Tempest Rush's damage turns into Lightning.", "Bluster Enemies hit are knocked back and deal 20% reduced damage for 4 seconds. Tempest Rush's damage turns into Fire."]], "pageTitle": "Tempest Rush - Game Guide - Diablo III", "title": "", "url": "http://eu.battle.net/d3/en/class/monk/active/tempest-rush", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 1, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042982745.46/warc/CC-MAIN-20150728002302-00103-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 85177500, "recordOffset": 85161543, "tableOrientation": "HORIZONTAL", "textBeforeTable": "Skill Runes } ]); return false;\"> customRating: 'http://media.blizzard.com/global-video-player/ratings/d3/en-gb.jpg' flvPath: '/monk/tempest-rush.flv', flvBase: 'http://media.blizzard.com/d3/flash/skills', height: 540, width: 960, Charge directly through your enemies, dealing 390% weapon damage while running. Cost: 30 Spirit Tempest Rush 5 Epiphany 61 Mantra of Conviction 30 Mantra of Healing 26 Mystic Ally 22 Inner Sanctuary 22 Mantra of Retribution 21 Secondary Unlocked at level", "textAfterTable": "Note: Information on this page is based on a level 70 character. Loading Comments… An error has occurred loading comments. Diablo III Game Guide Classes Monk Active Skills Tempest Rush Support Europe - English (EU) Region Americas Europe", "hasKeyColumn": false, "keyColumnIndex": -1, "headerRowIndex": 0}