{"relation": [["Sense", "work", "corruption", "tissue", "spade/shovel", "proper name", "??"], ["BNC (BrE)", "33", "14", "42", "7", "0", "4"], ["COCA (AmE)", "2", "29", "62", "0", "6", "3"]], "pageTitle": "separated by a common language: graft", "title": "", "url": "http://separatedbyacommonlanguage.blogspot.com/2012/01/graft.html?showComment=1329226776122", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042982745.46/warc/CC-MAIN-20150728002302-00199-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 210910207, "recordOffset": 210862268, "tableOrientation": "HORIZONTAL", "TableContextTimeStampBeforeTable": "{141236=I grew up in the USA and have lived in England since 2006. I had a Japanese flatmate in London who told me about a disappointing afternoon where he was in Chinatown and went to a massage place. He studies bodywork and was disappointed to get a bad massage and an offer of sexual release. When he told me about his experience I listened sympathetically and said that Chinatown has some sleazy places (which sent us to his English-Japanese dictionary). That's an illustration of what 'sleazy' means to me -- something sexual that is some combination of illicit, immoral, illegal, and generally a bit depressing., 79874=Today's top story: \"Intractable Afghan Graft Hampering U.S. Strategy.\" (http://www.nytimes.com/2012/03/08/world/asia/corruption-remains-intractable-in-afghanistan-under-karzai-government.html), 180964=The \"work\" sense has an entry in the Australian National Dictionary, giving a British dialect source. Eric Partridge, in his slang dictionary, also thought this sense had come to be mostly used in Australian and New Zealand. The Australian citations include examples with no qualifying adjective, e.g. \"I’ve been out of graft for months...\" from 1892. There are also examples showing that the usage was regarded as being local to Australia and New Zealand, as in a NZ reference from 1853 :\"I could make more money by 'hard graft', as they call labour in the colonies.\" And from a 1913 Henry Lawson story: \"'I've been used to hard work' (they call 'graft' work in England).\" As an Australian, I have the feeling that \"graft\" is not much used in this sense today, except in phrases like \"hard graft\". In the absence of any publicly accesible corpus of Australian English, it's hard to test this, but a search of news stories using \"grafter\" produced a few examples from sports stories - for example, in a 2009 article in the Melbourne \"Age\": \"As a footballer, he was a grafter, the proverbial workhorse forward.\" I think sports writing is often the last refuge for dated colloquialisms., 104424=Rich The OED of 1989 and later does include graft='corruption' but all the pre-1933 quotations are from American texts or texts describing America or quoting Americans. The current OED also includes these senses for boodle 2 a. Counterfeit money. U.S. slang. 2b. Money acquired or spent illegally or improperly, esp. in connection with the obtaining or holding of public offices; the material means or gains of bribery and corruption; also, money in general. slang (orig. U.S.). In quotations from British and Irish authors boodle means simply 'money' — used like spondoolics or dosh. I don't remember ever in my long life having heard the word —but then If I had, the meaning would have been so obvious that it wouldn't really have registered. The agent-noun boodler is backed by two American quotations, but also one from the English Liberal politician CGF Masterman in 1909 The average citizen‥is not yet convinced that its [sc. Socialism's] adherents will make a better job of it than the ‘boodlers’ and ‘blood suckers’. It didn't catch on., 189059=The \"work\" sense has an entry in the Australian National Dictionary, giving a British dialect source. (The AND is accessible online at http://203.166.81.53/and/index.php.) Eric Partridge, in his slang dictionary, also thought this sense had come to be mostly used in Australian and New Zealand. The Australian citations include examples with no qualifying adjective, e.g. \"I’ve been out of graft for months...\" from 1892. There are also examples showing that the usage was regarded as being local to Australia and New Zealand, as in a NZ reference from 1853 :\"I could make more money by 'hard graft', as they call labour in the colonies.\" And from a 1913 Henry Lawson story: \"'I've been used to hard work' (they call 'graft' work in England).\" As an Australian, I have the feeling that \"graft\" is not much used in this sense today, except in phrases like \"hard graft\". In the absence of any publically accesible corpus of Australian English, it's hard to test this, but a search of news stories using \"grafter\" produced a few examples from sports stories - for example, in a 2009 article in the Melbourne \"Age\": \"As a footballer, he was a grafter, the proverbial workhorse forward.\" I think sports writing is often the last refuge for dated colloquialisms., 131327=A famous talk, given in 1905 by a New York State Senator, on what he called \"honest graft\": http://www.panarchy.org/plunkitt/graft.1905.html We read this one in high school American History. I add my voice to the chorus of Americans who've never heard of the graft=work meaning., 176409=I too did not know either graft 'work' or hard graft 'hard work' until today, and I think neither one is normal AmE. An interesting word in this connection is job, which once meant (as the stately OED has it) 'a public office or position of trust which is turned to personal gain or political advantage; a transaction in which duty or the public interest is sacrificed for the sake of such an advantage.' This is first recorded in 1667 and for the last time in 1888 (though a few outliers in scare quotes, showing that they are abnormal usages, appear in 1915, 1936, and 1979)., 164434=As a BrE speaker the first time I remember hearing the corruption sense was in Kenya, in about 2003, on a news report on their corruption commission. I've since heard it used in UK news reports describing foreign corruption. Local corruption scandals seem to either get their own description like cash for questions and loans for lordships or be described as \"bungs\"., 106988=Curiously, \"graft\" in the sense of unethical behavior by public officials, is not listed in my 1899 ten volume Century Dictionary, or in the 1933 OED, but does make the grade in the 1909 Webster's New International unabridged. My 1929 Funk and Wagnall's has this citation: \"The boodler sells his official vote or buys official acts contrary to the Law. He is a grafter, but a grafter is not necessarily a boodler. Grafting may or may not be lawful. It is either a special privilege exercised contrary to law or one the law itself may give.\" Gov. Jos. W. Folk, NY Evening Post, Nov. 23, '05. I don't think \"boodler\" ever made it to Britain, and is nearly forgotten in the US., 158940=In Br.English there is of course the verb 'graft' = 'to work (hard)'; and noun grafter = 'one who works (hard)' is also not uncommon. The only sense for the latter in the American corpus appears to be the 'one who takes part in corruption, deceit' sense. The spade sense looks to derive from graft/graff v. 'dig' (ultimately related to grave) acc. to the OED. OED suggests that grift 'obtain money by deception etc.' is a modification of graft, and hence grifter 'swindler, con artist' etc., cf. the novel 'The Grifters' and its 1990 film adaptation.}", "lastModified": "Tue, 28 Jul 2015 21:39:44 GMT", "textBeforeTable": "graft from each corpus, the use of particular senses breaks down as: Taking a sample of 100 sentences containing a noun hard graft. For AmE it was only 6 of 640 (less than 1%), for BrE 28/145 (19%). graft in either corpus consisted of the phrase Mark Davies' interface) can give some indication.  First I looked at how much of the use of the noun Corpus of Contemporary American English and the British National Corpus (via corpora, the go-to So, how well-known are the senses in AmE and BrE? A quick look at our (chiefly AmE) Glossary of Words of County Glouster lists it as meaning 'work', so perhaps it has dialectal origins there. Neither of these senses of the word, then, seems to be terribly old, but because they're colloquial and dialectal, they'll have unwritten histories going back further. hard graft in 1853. An 1890 'slang' and the first citation is in the phrase graft; the OED lists them separately and doesn't have an etymology it trusts for the 'work' sense either. The 'work' sense is also listed as graft may or may not come from the 'work' sense of This sense of Fraud, and the lack of integrity that is expected in any transaction involving a public official. Bribery and dishonest dealings in the performance of public or official acts. Graft usually implies", "textAfterTable": "So, the first thing to notice is that the 'work' meaning is indeed much more common in BrE. Both cases in the AmE sample were hard graft. Most of the 'work' uses in BrE were also modified by an adjective, but in addition to hard, there was honest, sheer, real, tireless etc.  Second thing to notice: the 'corruption' sense is hardly unknown in BrE--but about half as frequent as in AmE. In both corpora, tissue grafts (on trees, skin, veins, bones, etc.) are the most common kind of graft. Third, the 'spade/shovel' sense is particular to BrE. The OED defines it as 'a narrow crescent-shaped spade used by drainers', and its only citation is from a 1893 Worcestershire dialect glossary. One of the corpus examples mentioned it as a Norfolk term--these are not particularly close to each other, but who knows what was really happening dialectally 100 years ago or what changed in the 100 years till the BNC. (I mention shovel because of the American tendency to use the term instead of spade, discussed back here.) And then there are more people or at least more famous people named Graft in the US than the UK (probably the former, it's a German name). The ?? cases were those that I couldn't really tell the meaning of in the little bit of text I was given (e.g.", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}