{"relation": [["", "", "", "", "", "", "", "", "", "", "", ""], ["Ball Locking", "Series", "Material", "Quick Release", "Plate Type", "Panoramic Rotation", "Lateral Tilt", "Independent Pan Lock", "Ball Friction Setting", "Working Height", "Weight", "Load Capacity"], ["yes yes", "2 2", "magnesium magnesium", "yes yes", "quick release - with 1/4-20'' screw quick release - with 1/4-20'' screw", "360 ° 360 °", "+100° / -18° tilt range +100° / -18° tilt range", "yes yes", "yes yes", "11 11", "0.500 kg 1.1 lbs", "14 kg 30.86 lbs"]], "pageTitle": "Series 2 Magnesium Center Ball Head, Quick Release C GH2780QR - Center Ball Heads | Gitzo", "title": "", "url": "http://www.gitzo.us/series-2-quick-release-center-ball-head-with-bubble-sphere", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 12, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042981969.11/warc/CC-MAIN-20150728002301-00026-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 478297339, "recordOffset": 478277314, "tableOrientation": "HORIZONTAL", "TableContextTimeStampBeforeTable": "{10521=view other products in this series: Centre Ball Head Series 1 Quick Release D GH1780QD Centre Ball Head Series 2 Quick Release D GH2780QD Centre Ball Head Series 3 Quick Release D GH3780QD Safari Collection Series 1 Center Ball Head, Quick Release GH1780FQR Safari Collection Series 2 Center Ball Head, Quick Release GH2780FQR Series 1 Ball Head QR - Black GH1781QR Series 1 Center Ball Head with Bubble Sphere GH1780 Series 1 Quick Release Center Ball Head with Bubble Sphere GH1780QR Series 2 Ball Head QR - Black GH2781QR Series 2 Magnesium Center Ball Head with Bubble Sphere GH2780 Series 2 Magnesium Center Ball Head, Quick Release C GH2780QR Series 3 Magnesium Center Ball Head GH3780 Series 3 Magnesium Center Ball Head, Quick Release C GH3780QR Series 3 Magnesium Center Ball Head, Quick Release C GH3781QR}", "TableContextTimeStampAfterTable": "{42489=In 1996 Gitzo was the first to use Magnesium in camera supports. Magnesium comes in different grades and Gitzo only uses material of the highest grade quality. It offers significant weight savings being 30% lighter than aluminum. In our magnesium casting every functional bolt and screw works on threads reinforced by high quality steel inserts for a lifetime performance, 60705=Manfrotto Distribution Inc. | 10 Mountainview Road, Ste 320 South, Upper Saddle River, NJ 07458 USA | T: (201) 818-9500 | F: (201) 818-9177 Operational Hours: Monday - Friday 9:00 am-5:30 pm EST Other brands distributed by Manfrotto Distribution in the United States:, 60521=© 2015 VitecGroup Italia Spa — Gitzo is a registered trademark of Gitzo Sa and is distributed in the United States by}", "textBeforeTable": "Metric Imperial| Units: specs GH2780QR ball head, is designed to be an extremely balanced product, that not only guarantee a high max load, but that also maximizes other key features, too often overlooked by the end users. These features include smoothness, minimized drift angle, lightweight, low gravity center, greater tilt angles, compactness, ergonomics, safety and the Quick Release system. spare parts description Select to compare view other products in this series: Centre Ball Head Series 1 Quick Release D GH1780QD Centre Ball Head Series 2 Quick Release D GH2780QD Centre Ball Head Series 3 Quick Release D GH3780QD Safari Collection Series 1 Center Ball Head, Quick Release GH1780FQR Safari Collection Series 2 Center Ball Head, Quick Release GH2780FQR Series 1 Ball Head QR - Black GH1781QR Series 1 Center Ball Head with Bubble Sphere GH1780 Series 1 Quick Release Center Ball Head with Bubble Sphere GH1780QR Series 2 Ball Head QR - Black GH2781QR Series 2 Magnesium Center", "textAfterTable": "features spring assisted double lock The new center SADL (Spring Assisted Double Lock) is a patent pending system that combines two locking systems in one, that maximizes both locking power and ball smoothness. A high friction metal guarantees a high efficiency lock, the PTFE bushing controlled by a pre-loaded spring maximizes smoothness and control. safe grip Safe Grip is a material that gives a safer lock between your camera and the head plate, preventing the camera from moving or slipping. It is used on quick release plates and in applications where the camera equipment is screwed to the support to reduce pivoting and twisting. separate pan control When using a ball head, the ability to lock and unlock the panoramic movement independent of front-back or lateral tilt movements is convenient for panoramic photography and when a high level of control is required. leveling bubble", "hasKeyColumn": false, "keyColumnIndex": -1, "headerRowIndex": 0}