{"relation": [["Keyword", "subtitles", "captions", "descriptions", "chapters", "metadata"], ["State", "Subtitles", "Captions", "Descriptions", "Chapters", "Metadata"], ["Brief description", "Transcription or translation of the dialogue, suitable for when the sound is available but not understood (e.g. because the user does not understand the language of the media resource's soundtrack). Displayed over the video.", "Transcription or translation of the dialogue, sound effects, relevant musical cues, and other relevant audio information, suitable for when the soundtrack is unavailable (e.g. because it is muted or because the user is deaf). Displayed over the video; labeled as appropriate for the hard-of-hearing.", "Textual descriptions of the video component of the media resource, intended for audio synthesis when the visual component is unavailable (e.g. because the user is interacting with the application without a screen while driving, or because the user is blind). Synthesized as separate audio track.", "Chapter titles, intended to be used for navigating the media resource. Displayed as an interactive list in the user agent's interface.", "Tracks intended for use from script. Not displayed by the user agent."]], "pageTitle": "4.8.6 The video element — HTML5 (Edition for Web Authors)", "title": "", "url": "http://www.w3.org/TR/2011/WD-html5-20110113/author/video.html", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989790.89/warc/CC-MAIN-20150728002309-00028-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 842865631, "recordOffset": 842829766, "tableOrientation": "HORIZONTAL", "lastModified": "Tue, 08 Feb 2011 19:40:22 GMT", "textBeforeTable": "The kind attribute is an enumerated attribute. The following table lists the keywords defined for this attribute. The keyword given in the first cell of each row maps to the state given in the second cell. The track element allows authors to specify explicit external timed text tracks for media elements. It does not represent anything on its own. }; readonly attribute TextTrack track; attribute boolean default; attribute DOMString label; attribute DOMString srclang; attribute DOMString src; attribute DOMString kind; interface HTMLTrackElement : HTMLElement {   DOM interface:   default   label   srclang   src   kind   Global attributes   Content attributes:   Empty.   Content model:   flow content. media", "textAfterTable": "The attribute may be omitted. The missing value default is the subtitles state. The src attribute gives the address of the text track data. The value must be a valid non-empty URL potentially surrounded by spaces. This attribute must be present. The srclang attribute gives the language of the text track data. The value must be a valid BCP 47 language tag. This attribute must be present if the element's kind attribute is in the subtitles state. [BCP47] The label attribute gives a user-readable title for the track. This title is used by user agents when listing subtitle, caption, and audio description tracks in their user interface. The value of the label attribute, if the attribute is present, must not be the empty string. Furthermore, there must not be two track element children of the same media element whose kind attributes are in the same state, whose srclang attributes are both missing or have values that represent the same language, and whose label attributes are again both missing or both have the same value. The default attribute, if specified, indicates that the track is to be enabled if the user's preferences do not indicate that another track would be more appropriate. There must not", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}