{"relation": [["Account name", "", "Net portfolio holdings of Maiden Lane LLC (1)", "", "Outstanding principal amount of loan extended by the Federal Reserve Bank of New York (2)", "Accrued interest payable to the Federal Reserve Bank of New York (2)", "Outstanding principal amount and accrued interest on loan payable to JPMorgan Chase & Co. (3)"], ["Wednesday Dec 30, 2009", "", "26,667", "", "28,820", "413", "1,248"]], "pageTitle": "FRB: H.4.1 Release-- Factors Affecting Reserve Balances -- December 31, 2009", "title": "", "url": "https://www.federalreserve.gov/releases/h41/20091231/h41.htm", "hasHeader": true, "headerPosition": "MIXED", "tableType": "RELATION", "tableNum": 5, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042992201.62/warc/CC-MAIN-20150728002312-00247-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 903548119, "recordOffset": 903515647, "tableOrientation": "HORIZONTAL", "lastModified": "Thu, 07 Jan 2010 21:35:34 GMT", "textBeforeTable": "  1. Guaranteed by Fannie Mae, Freddie Mac, and Ginnie Mae. Current face value of the securities, which is the  remaining principal balance of the underlying mortgages. 2. Current face value. Generally settle within 180 days and include commitments associated with outright  transactions as well as dollar rolls. 3. This amount is included in other Federal Reserve assets in table 1 and in other assets in table 10 and table 11.     4. Information on Principal Accounts of Maiden Lane LLC Millions of dollars         910     Cash and cash equivalents (3)                                                                                                                                                                             0     Commitments to sell mortgage-backed securities (2)                                                 154,984     Commitments to buy mortgage-backed securities (2)                                                                                                                                                   908,257     Mortgage-backed securities held outright (1)                                                                                                                                                    Wednesday Dec 30, 2009 Account name  Note: Components may not sum to totals because of rounding. --- Not applicable.   1. Excludes the loans from the Federal Reserve Bank of New York (FRBNY) to Commercial Paper Funding Facility LLC, Maiden  Lane LLC, Maiden Lane II LLC, Maiden Lane III LLC, and TALF LLC. The loans were eliminated when preparing the FRBNY's", "textAfterTable": "1. Fair value. Fair value reflects an estimate of the price that would be received upon selling an asset if  the transaction were to be conducted in an orderly market on the measurement date. Revalued quarterly.  This table reflects valuations as of September 30, 2009. Any assets purchased after this valuation date  are initially recorded at cost until their estimated fair value as of the purchase date becomes available. 2. Book value. This amount was eliminated when preparing the Federal Reserve Bank of New York's statement  of condition consistent with consolidation under generally accepted accounting principles. Refer to  the note on consolidation accompanying table 11. 3. Book value. The fair value of these obligations is included in other liabilities and capital in table 1  and in other liabilities and accrued dividends in table 10 and table 11.   Note: On June 26, 2008, the Federal Reserve Bank of New York (FRBNY) extended credit to Maiden Lane LLC under the authority of section 13(3) of the Federal Reserve Act. This limited liability company was formed to acquire certain assets of Bear Stearns and to manage those assets through time to maximize repayment of the credit extended and to minimize disruption to financial markets. Payments by Maiden Lane LLC from the proceeds of the net portfolio holdings will be made in the following order: operating expenses of the LLC, principal due to the", "hasKeyColumn": true, "keyColumnIndex": 1, "headerRowIndex": 0}