{"relation": [["Type of business", "Grocery store", "Grain and flax", "Butcher shop and cattle trade", "Restaurant and tavern", "Food products, eggs", "Beverages", "Textile products and furs", "Leather and shoe store", "Haberdashery and house utensils", "Medicine and cosmetics", "Watches, jewels and optics", "Hardware products", "Bicycles and electrical equipment", "Heating materials and cattle food", "Machines, transportation", "Stationery and books", "Other"], ["Total", "12", "10", "22", "7", "8", "2", "13", "6", "7", "5", "2", "6", "2", "1", "3", "4", "6"], ["Owned by Jews", "11", "9", "14", "4", "8", "2", "12", "6", "6", "4", "2", "6", "1", "1", "2", "1", "1"]], "pageTitle": "Protecting Our Litvak Heritage (Pages 230-259)", "title": "", "url": "http://www.jewishgen.org/Yizkor/Lithuania6/Lit6_230.html", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 12, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990611.52/warc/CC-MAIN-20150728002310-00006-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 533699734, "recordOffset": 533683340, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{4749=In the middle of the nineteenth century, Jews constituted the majority of Rasein's population. In 1857, out of a total of 8,516 residents, about 5,000 (about 59%) were Jews., 3285=Ships sailing on the Dubysa (about 8 km. from the town) and the Neman (Nemunas) rivers were able to establish contact with Kovno by 1912. During the period of independent Lithuania (1918-1940), Rasein remained a district administrative center, but because of its distance from the railway line (about 17 km.) and the lack of a paved road (which was not constructed until 1939), it suffered economically and its population decreased. Jewish settlement until after World War I, 10867=In 1899 a delegate from Rasein took part in the regional conference of Zionist Societies which took place in Vilna., 5437=In 1865, and again in 1883, fires caused great damage. On the eve of Pesakh 1886, fire broke out and more then 200 Jewish families were left roofless and destitute. Help was received from former Rasein citizens in South Africa. In 1888, 50 Jewish houses burned down. Muraviov, the Gubernator (head of the Gubernia) transfered 800 rubles from the government to help victims of the fire. During World War I, Rasein Jews stayed in town and traded with the German occupation army. At this time many wholesale businesses opened, supplying goods all over Lithuania., 2070=Until 1795, Rasein was a part of the Polish-Lithuanian Kingdom. That same year, when Poland was divided up for the third time by the three superpowers of those times (Russia, Prussia and Austria), Lithuania was split between Russia and Prussia. Like most of Lithuania, Rasein became a part of the Russian Empire, first in the Vilna province (Gubernia) and from 1843 as a district administrative center in the Kovno Gubernia., 8003=Despite this situation, a list of 74 Rasein Jews, who in 1871 donated money for victims of the great famine in Persia, was published in the Hebrew newspaper HaMagid in that year (see Appendix 2)., 10993=Names of 234 Rasein Jews appear in lists of donors for the settlement of Eretz-Yisrael, as published in the Hebrew newspaper Hamelitz in 1893-1903 (see Appendix 3), and thirteen names appear in a list from 1907. Among the fundraisers were Yehudah Vigodsky, Hayim-Yisrael Zaks, Avraham-Aba Klivansky and Yits'hak Agushevitz., 3835=Jews settled in Rasein in the seventeenth century, and in 1662 there were at least 111 Jews (50 men, 61 women), excluding children. Rasein's Jewish community was one of the first in Lithuania and was known as Yerushalayim D'Zamut. During the period of the autonomy of Lithuanian Jews, Va'ad Medinath Lita (1623-1764), Rasein was included in the Keidan Galil (District)., 10238=In 1886, a branch of Hovevei Zion movement was active in town. At the end of the nineteenth century Rasein Jews acquired 130 shares in the bank of the Zionist organization (Otsar Hityashvuth HaYehudim), and several hundred Rubles were collected for the settlement of Eretz-Yisrael. At this time, courses for studying Hebrew and the Bible were opened in town, with about forty girls participating. A society named Daughters of Zion and Evident Language was created for this purpose, making efforts to teach Hebrew to local Jewish girls. This initiative can be attributed to Nehamah Lapidoth., 13892=Society and Economics Although the independence of Lithuania was proclaimed on February 16, 1918, the German army ruled in Rasein until the autumn of that year. As German rule waned, the local authority, where Jews played an important role, took over. The municipal council consisted of twelve members, five of them Jews. (Adv. M. Levi, the merchant Kaplan, the tinsmith Katz and two others, Yehudah and David whose surnames are not known). A local youngster named Avraham Mogilevsky, later an officer in the Lithuanian army, excelled in the temporary auxiliary police force, which numbered sixty men. In the printing press of a local Jew named Kadushin, postage stamps of the town Rasein were printed, long before the government post office began to issue stamps. Lazar Sudak, a Jewish student, published a newspaper in Lithuanian entitled Zemaitija for several months, in which news and announcements of local rules were printed., 8952=A cholera epidemic caused the death of many Jews in 1903. The community, headed by the two rabbis, supplied free medical help., 14855=According to the first census performed by the new Lithuanian government in 1923, 5,270 residents lived in Rasein, 2,035 (39%) being Jews., 16540=For the elections to the first Lithuanian Seimas (Parliament) in October 1922, Rasein's Jews voted as follows: the Zionist list received 493 votes, Akhduth 136 and the Democrats 182., 7549=In 1913, sixteen Rasein Jews were supporters of the Agudath Yisrael Fund. During the years of famine 1869-1871, a committee was established to help the poor. Long tables for 1,500 people were placed alongside the Beth Midrash, and every needy person received half a kilogram of bread per day. The Tomkhei Aniyim (Supporters of the Poor) society also donated 500 rubles, a large sum, to the Central Help Committee in Memel., 13608=During World War I, in May 1915, when the Russian rulers published an order exiling all Jews from the Kovno Gubernia, Rasein's Jews remained in the town. During the Period of Independent Lithuania (1918-1940), 15524=Following the Law of Autonomies for Minorities issued by the new Lithuanian government, the Minister for Jewish Affairs, Dr. Menachem (Max) Soloveitshik, ordered elections to community committees, Va'adei Kehilah, to be held in the summer of 1919. In Rasein, a community committee was elected at the end of 1919, which functioned until about the beginning of 1926, when the autonomy was annulled by a new Lithuanian government. In 1921 the committee consisted of fifteen members: four from Tseirei Zion, one from Akhduth (Agudath Yisrael), one from the General Zionists, one non-party and eight independent. During its existence the committee collected taxes according to law and looked after all aspects of Jewish life. Sub-committees were used to collect taxes, for appeals, for the bath house, for culture and education, for the administration of the community's property, for social aid and for inspection (control). Gedalyah Halperin was elected chairman of the committee., 6792=Among the rabbis who officiated in Rasein during this period, many were well known for their scholarship and public service: Avraham Lisker who lived in the middle of the seventeenth century; Mosheh Tseitlin (1812-1857), served in Rasein 1848-1856; Avraham-Shemuel Rabinovitz (1809-1869), published many books and was known as a community worker; Alexander-Mosheh Lapidoth, (1819-1906) Rabbi in Rasein for forty years 1866-1906, an ardent preacher and Hovev Zion, who published books and many articles in newspapers, engaging in polemics with the young intellectuals Yehudah-Leib Gordon and Mosheh-Leib Lilienblum. The official rabbi nominated by the authorities, who served for 39 years, was Avraham (Abali) Yofe, who died in 1902., 22285=The Jewish Popular bank (Folksbank) played an important role in the economic life of Rasein's Jews. In 1920 it had 191 members, in 1927 there were 560 and in 1929, 504. In the mid-1930s the economic situation of the Jews began to deteriorate. One reason was the blatant propaganda of the Association of Lithuanian Merchants (Verslas), which campaigned against buying from Jewish shops. The Lithuanians established consumer cooperatives competing with Jewish trade. Jewish exporters of eggs, flax, grains and timber lost their living. The livelihood of Jewish artisans also declined, because Lithuanian artisans moved away from villages and settled in town. In 1934 Jews were attacked physically. During these years many Jews emigrated to America, South Africa and Mexico, with some youths emigrating to Eretz-Yisrael., 2519=In 1812 Napoleon's army passed through the town, and almost totally destroyed it. During the Polish rebellion of 1831 the town suffered badly. In 1848 and again in 1893 cholera epidemics raged in Rasein, causing hundreds of deaths., 25992=Copyright ©1999-2014 by JewishGen, Inc. Updated 13 Aug 2011 by OR, 4940=In 1876, Rasein's population was 10,889, including 8,481 Jews (78%). Trade was almost exclusively in Jewish hands, and there were also many Jewish artisans: 45 tailors, 30 shoemakers and six watchmakers. However, due to the many restrictions that the Czarist rulers imposed upon the Jews, their economic situation deteriorated, and as a result many emigrated, mainly to South Africa., 1342=Rasein (in Yiddish) lies in the center of Lithuania, near the main road between Kaunas and Klaipeda (Memel), about 73 km. northwest of Kovno. Rasein is one of the oldest towns in Lithuania, being mentioned in historical documents dating from 1253., 9656=A Hebrew library was established in 1910, in addition to the Yiddish one that already existed. In 1835, the Hebrew writer, Avraham Mapu (1808-1867) arrived in Rasein, and lived there for seven years. His Hebrew love story, \u0093Ahavath Zion\u0094, was the first ever written, and made a great impression on the entire Jewish world., 11795=Among those born in Rasein who emigrated to Eretz-Yisrael in the 1880s and 1890s were: Rabbi Eliezer HaCohen who, arriving in Jerusalem in 1884, refused to make his living as a rabbi and instead repaired shoes in the old city; his son Mihal, who was one of the editors of the Hebrew periodicals HaLevanon and Ariel and a founder of Nahalath Shivah, a neighborhood in Jerusalem; another son, Eliyahu-Shaul, a doctor in the Galilee and in Petakh Tikvah; Yehoshua Berman arrived in the land in 1876 and was a Shohet in Jerusalem; Yits'hak-Aizik Ben-Tovim (Bendet) arrived in the 1890s and became the head of Hovevei Zion in Yafo and one of the first activists of the Mizrahi party in Eretz-Yisrael., 21776=In 1925 there were two Jewish doctors, one dentist and two Jewish dental practitioners., 17576=According to the government survey of 1931, Rasein had 116 shops, 90 Jewish owned (78%). The business distribution of these is given in the table below:, 1607=One of the first Catholic churches was built there in 1421. At the end of the fifteenth century Rasein was granted the Magdeburg rights, which gave it the status of a town, and during the sixteenth century it was the most important town in Zamut (Zemaitija). In 1580 the nobility of the region assembled in Rasein to elect its delegates to the Warsaw Seim, and in 1585 it became the permanent site of the regional Seim, the Seimik., 11373=In 1902, 162 Shekalim were sold in Rasein. And in the same year a Society of Hebrew Speakers, whose members were obliged to speak only Hebrew during their meetings, came into being. Zionist youths founded a library with books in Hebrew, Yiddish and Russian. The Bund party also had much influence in the Jewish community, which sometimes led to confrontations between its members and the Zionists., 23141=By 1939 there were 149 telephone subscribers, 46 of them in Jewish homes and businesses., 5334=The Russian census of 1897 showed 7,455 residents in Rasein, 3,484 of them being Jews (47%)., 17162=Rasein Jews made their living during this period in trade, industry and crafts, with a few in agriculture. In 1924 the Association of Jewish Retailers and the General Association of Jewish Merchants were established. The Retailers Association established a purchasing cooperative in response to a Lithuanian association which held a monopoly for the wholesale trade of sugar, salt, herring and kerosene., 9989=Zionist activity in Rasein began in the 1880s and consisted of propaganda and the collection of money for the settlement of Eretz-Yisrael. In 1884, fifty pictures of Mosheh Motefiori, used to promote fundraising, were sold locally., 8248=In 1878, a hospital was built, supported by former Raseiners in America and by the local municipality. In 1879, the Bikur Holim society was organized, and in 1880-81 the Gemiluth Hesed society was established, with 500 rubles as a starting fund, supplying free meals to forty families. Bread and heating materials for the needy were sold at low prices and seventy pairs of shoes were distributed among them. In 1883 the Hakhnasath Orkhim society built a house for passing travelers, where they were provided with accommodation and food. In 1907, a Moshav Zekeinim (Home for the Aged) was established by the community, helped by a bequest from the native-born Soloveitchik., 16747=The 1921 municipal council elections resulted in seven Jews being elected, out of seventeen council members. The elections of 1931 brought five Jews to the council of twelve: Max Levy, Noakh Yisrael, Mosheh Ziv, Gedalyah Halperin and Meir Zusmanovitz. However the elections of 1934 showed only three Jews among the twelve members elected. For some time a local Jew named Leibovitz served as deputy mayor., 12557=Mosheh ben Shelomoh-Zalman Markovitz (1867-1936) was born in Nemoksht (Nemaksciai), but lived most of his life in Rasein. He was a shoemaker and learned to read and write later in life. Despite this, Markovitz published several biographies of rabbis and other Jewish personages. His books, including Shem HaGedolim Ha Shelishi (The Third Book of The Names of the Great), Vilna 5670 (1910), concentrated mainly on their works, which had been partly lost but thus became known again., 9089=In 1853, a school directed by Rabinovitz was established, but most Jewish children were educated at the Talmud Torah (which had about 100 boys in 1883), where, in addition to Torah, Russian and arithmetic were also taught. In 1888, a School for Teaching Crafts to Jewish Children was opened in Rasein. The school budget was based mostly on the meat tax (Karobka).}", "textBeforeTable": "According to the government survey of 1931, Rasein had 116 shops, 90 Jewish owned (78%). The business distribution of these is given in the table below: Rasein Jews made their living during this period in trade, industry and crafts, with a few in agriculture. In 1924 the Association of Jewish Retailers and the General Association of Jewish Merchants were established. The Retailers Association established a purchasing cooperative in response to a Lithuanian association which held a monopoly for the wholesale trade of sugar, salt, herring and kerosene. The 1921 municipal council elections resulted in seven Jews being elected, out of seventeen council members. The elections of 1931 brought five Jews to the council of twelve: Max Levy, Noakh Yisrael, Mosheh Ziv, Gedalyah Halperin and Meir Zusmanovitz. However the elections of 1934 showed only three Jews among the twelve members elected. For some time a local Jew named Leibovitz served as deputy mayor. For the elections to the first Lithuanian Seimas (Parliament) in October 1922, Rasein's Jews voted as follows: the Zionist list received 493 votes, Akhduth 136 and the Democrats 182. Following the Law of Autonomies for Minorities issued by the new Lithuanian government, the Minister for Jewish Affairs, Dr. Menachem (Max) Soloveitshik, ordered elections to community committees, Va'adei Kehilah, to be held in the summer of 1919. In Rasein, a community committee was elected at the end of 1919, which functioned until about the", "textAfterTable": "The main income of most of the Jews was on the weekly market days, which took place on Mondays and Thursdays. Of the 40 light industrial businesses, 27 (67%) were owned by Jews. Type of factory Total Jewish owned Printing press, binderies 1 1 Textile: wool, flax, knitting 3 0 Sawmills and furniture, tar production 6 3 Flour mills, bakeries, beverages, candies 14 11 Dresses, footwear 6 5 Leather industry: production, cobbling 3 3 Other: barbers, photographers, jewelers 4 4 In 1925 there were two Jewish doctors, one dentist and two Jewish dental practitioners. Eighty-nine Jewish artisans could be found in the town in 1937: twenty tailors, fourteen butchers, twelve shoemakers, six stitchers, four hatters, four barbers, three bakers, three locksmiths, three tinsmiths, three watchmakers, two knitters, two painters, two cloth dyers, two seamstresses, an electrician, a book binder, a printer, a carpenter, a blacksmith, a photographer and three others. The Jewish Popular bank (Folksbank) played an important role in the economic life of Rasein's Jews. In 1920 it had 191 members, in 1927 there were 560", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}