{"relation": [["Model Number", "A20m", "A20p", "A21e(2628)", "A21m (except Sxx models)", "A21p", "A22m (except Sxx models)", "A22p", "T20", "T21", "X20", "X21"], ["BIOS Version That Fixes The Bug", "1.08 (IWET54WW)[12]", "1.05 (IVET62WW)[13]", "1.07 (KUET30WW)[14]", "1.02 (KXET24WW)[15]", "1.04 (KYET27WW)[16]", "1.02 (KXET24WW)[15]", "1.04 (KYET27WW)[16]", "1.10 (IYET49WW)[17]", "1.04 (KZET22WW)[18]", "2.16 (IZET96WW)[19]", "2.16 (IZET96WW)[19]"]], "pageTitle": "Difference between revisions of \"Laptops/9.2\" - PC-BSD Wiki", "title": "Table 2.22.2a: ThinkPad BIOS Versions with Known Bug [Tables 1]", "url": "http://wiki.pcbsd.org/index.php?title=Laptops&diff=25237&oldid=24231", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 3, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988860.88/warc/CC-MAIN-20150728002308-00014-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 269735415, "recordOffset": 269716267, "tableOrientation": "HORIZONTAL", "textBeforeTable": "If you wish to install PC-BSD® on an older IBM/Lenovo ThinkPad laptop, it is important to first check your ThinkPad model number to see if its BIOS has a known bug. This bug is rather nasty and will render the computer completely unbootable--even the BIOS will be inaccessible. This situation occurs as the BIOS thinks that the PC-BSD® (FreeBSD) partition number represents the IBM repair partition. The only way to get the affected laptop to boot again is to physically remove the hard drive, insert it into another laptop, wipe the drive, and insert the drive back into the system. While the hard drive is in the other system, you will note that PC-BSD® boots just fine as the problem is with the BIOS, not the hard drive. Once the BIOS is accessible again, you should upgrade (or possibly downgrade) the BIOS to a version number that fixes this bug. See Table 2.2a for the models which are affected, the BIOS version number that fixes the bug, and links to the BIOS software should you need to upgrade your BIOS. The BIOS needs to incorporate the fix \"The system cannot boot from a hard disk drive with partition ID of n5h where n is 1 or greater\". Some Thinkpads have a BIOS bug that prevents them from booting from GPT labelled disks. If you are unable to boot into a new installation, restart the installer and go into Advanced Mode in the", "textAfterTable": "Acer Laptops with Known Bug In models 2920z and 4920G, there is an issue with the BIOS settings for the HPET timer. The solution is to set a hardware hint[20]. Boot the installation media and select \"7. Escape to the loader prompt\" when you see the menu shown in Figure 2.2a. Figure 2.2a: PC-BSD® Boot Menu At the resulting prompt, type: set hint.hpet.0.allowed_irqs=\"0x400000\" boot You should now be able to install PC-BSD®. Once the installer boots for the first time, you will need to repeat that command in order to boot into PC-BSD®. Once you are in PC-BSD®, you can make the hint permanent by carefully adding this line to /boot/loader.conf as the superuser: hint.hpet.0.allowed_irqs=\"0x400000\" MacBooks Before starting, you should review the MacBook on FreeBSD Wiki[21]. Starting in PC-BSD® 9.0-RC1, support has been added for installing directly to Mac OS X BootCamp partitions. First, you can install an OS X boot manager, such as rEFIt", "hasKeyColumn": false, "keyColumnIndex": -1, "headerRowIndex": 0}