{"relation": [["", "1.", "2.", "3.", "4.", "5.", "6.", "7.", "8.", "9.", "10.", "11.", "12.", "13.", "14.", "15.", "16.", "17.", "18.", "19.", "20.", "21.", "22.", "23.", "24.", "25."], ["", "ORCHIS MASCULA .. .. .. .. .. .. .. .. ..", "ORCHIS MASCULA POLLINIA OF .. .. .. .. .. ..", "ORCHIS PYRAMIDALIS .. .. .. .. .. .. .. ..", "MOTH'S HEAD AND PROBOSCIS, WITH ATTACHED POLLINIA", "OPHRYS MUSCIFERA .. .. .. .. .. .. .. ..", "OPHRYS ARANIFERA .. .. .. .. .. .. .. ..", "OPHRYS ARACHNITES .. .. .. .. .. .. .. ..", "OPHRYS APIFERA .. .. .. .. .. .. .. .. ..", "PERISTYLUS VIRIDIS .. .. .. .. .. .. .. ..", "GYMNADENIA CONOPSEA .. .. .. .. .. .. ..", "HABENARIA CHLORANTHA .. .. .. .. .. .. ..", "POLLINIA OF HABENARIA CHLORANTHA AND BIFOLIA ..", "CEPHALANTHERA GRANDIFLORA .. .. .. .. ..", "PTEROSTYLIS LONGIFOLIA .. .. .. .. .. .. ..", "EPIPACTIS PALUSTRIS .. .. .. .. .. .. .. ..", "EPIPACTIS LATIFOLIA .. .. .. .. .. .. .. ..", "SPIRANTHES AUTUMNALIS .. .. .. .. .. .. ..", "LISTERA OVATA .. .. .. .. .. .. .. .. ..", "MALAXIS PALUDOSA .. .. .. .. .. .. .. ..", "MASDEVALLIA FENESTRATA .. .. .. .. .. ..", "DENDROBIUM CHRYSANTHUM .. .. .. .. .. ..", "CATTLEYA .. .. .. .. .. .. .. .. .. ..", "DIAGRAM ILLUSTRATIVE OF THE STRUCTURE OF THE VANDEÆ .. .. .. .. .. .. .. .. ..", "POLLINIA OF VANDEÆ .. .. .. .. .. .. ..", "POLLINIUM OF ORNITHOCEPHALUS .. .. .. .. .."], ["PAGE", "8", "12", "18", "31", "46", "50", "51", "53", "62", "65", "69", "74", "81", "87", "94", "101", "107", "116", "130", "136", "139", "144", "150", "154", "160"]], "pageTitle": "Darwin, C. R. 1877. The various contrivances by which orchids are fertilised by insects. London: John Murray. 2d edition.", "title": "", "url": "http://darwin-online.org.uk/content/contentblock?itemID=F801&basepage=1&hitpage=148&viewtype=side", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986625.58/warc/CC-MAIN-20150728002306-00031-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 60466247, "recordOffset": 60279394, "tableOrientation": "HORIZONTAL", "TableContextTimeStampBeforeTable": "{1=File last updated 2 July, 2012}", "TableContextTimeStampAfterTable": "{8535=GRAY, ASA.—On Platanthera hookeri, in a review of the first edition of the present work.—American Journal of Science and Arts, vol. xxxiv. July 1862, p. 143., 183413=Although I have often searched for nectar within the cup of the labellum, I have never found even a trace. The terminal portion of the labellum is frosted with globular papillæ of an orange colour, and within the cup there are several transversely wrinkled, longitudinal ridges of a darker orange tint. These ridges are often gnawed by some animal, and I have found minute, bitten-off fragments lying within the base of the cup. In the summer of 1862 the flowers were visited less frequently by insects than is usual, as shown by the unbroken state of the pollen-masses; nevertheless,, 10696=ROHRBACH, P.—'Ueber Epipogium gmelini.'—Gekrönte Preisschrift, Göttingen, 1866., 134385=drawn out of its pouch a movement of depression commences, by which the pollinium if attached to the front of an insect's head would be brought into a proper position for striking the stigma. When a pollen-mass is placed on the stigma and then with-drawn, the elastic threads by which the packets are tied together break, and leave several packets on the viscid surface. In all other Orchids the meaning of these several contrivances is unmistakably clear—namely, the downward movement of the lip of the rostellum when gently pushed—the viscidity of the disc—the depression of the caudicle as soon as the disc is exposed to the air—the rupturing of the elastic threads—and the conspicuousness of the flower. Are we to believe that these adaptations for cross-fertilisation in the Bee Ophrys are absolutely purposeless, as would certainly be the case if this species has always been and will always be self-fertilised? It is, however, just possible that insects, although they have never been seen to visit the flowers, may at rare intervals transport the pollinia from plant to plant, during such seasons as that of 1868, when the pollinia did not all fall out of the anther-cells so as to reach the stigmas. The whole case is perplexing in an unparalleled degree, for we have in the same flower elaborate contrivances for directly opposed objects., 175292=† 'Journ. Linn. Soc. Bot.' vol. vii. 1863, p. 144., 83939=* 'Gardener's Chronicle,' 1861, p. 73. Mr. Marshall's communication was in answer to some remarks of mine on this subject previously published in the 'Gardener's Chronicle,' 1860, p. 528., 53682=* M. M. Girard caught a longicorn beetle, Strangalia atra, with a tuft of the pollen-masses of this orchis attached to the front of its mouth: 'Annales de la Soc. Entomolog. de France,' tom ix. 1869, p. xxxi., 356770=* 'Journal of Linn. Soc. Bot.' vol. viii. 1864, p. 130. There is a drawing of this species in Paxton's 'Mag. of Botany,' vol. v. p. 31, but it is too complicated to be reproduced. There is also a drawing of C. feildingii in 'Journal of Hort. Soc.' vol. iii. p. 16. I am indebted to Mr. Thiselton Dyer for informing me of these figures., 542879=* This fact does not now appear to me so surprising as it formerly did, for my son Francis has shown ('Transact. Linn. Soc.' 2nd series, Bot. vol. i. 1876, p. 149) with what extraordinary quickness the awn of Stipa twists and untwists when exposed to dry and damp air. These movements being due, as he has shown, to the twisting and untwisting of the separate cells., 87534=In the second lot of O. morio, in the preceding list, we see the injurious effects of the extraordinary cold and wet season of 1860 on the visits of insects, and, consequently, on the fertilisation of this Orchid, very few seed-capsules having been produced., 350564=† 'Bot. Zeitung,' 1868, p. 630., 400108=sep. two lower sepals., 559072=* 'The Effects of Cross and Self-fertilisation in the Vegetable Kingdom,' 1876., 28922=* Delpino has found ('Ult. Osservazioni sulla Dicogamia,' Part ii. 1875, p. 150) a memoir by Waetcher, published in 1801 in Roemer's 'Archiv für die Botanik,' t. ii. p. 11, which apparently has remained unknown to everyone else. In this memoir Waetcher, who does not seem to have been acquainted with Sprengel's work, shows that insects are necessary for the fertilisation of various orchids, and describes well the wonderful structure of Neottia., 101835=* My son Francis has described and figured this organ in the 'Q. Journal of Microscopical Science,' vol. xv. 1875, p. 385., 478020=* From Irmisch's ('Beiträge zur Biologie der Orchideen,' 1853, pp. 78 and 42) description of the development of the flower-bud of Cypripedium, it would appear that there is a tendency to the formation of a free filament in front of the labellum, as in the case of Glossodia before mentioned; and this will perhaps account for the absence of spiral vessels, proceeding from the anterior ovarian group and coalescing with the column. In Uropedium, a genus which A. Brongniart ('Annal. des. Sc. Nat.,' 3rd series, Bot. tom. xiii. p. 114) considers closely allied to, and even perhaps a monstrosity of, Cypripedium, a third fertile anther occupies this same position., 269=REVISION HISTORY: Scanned by John van Wyhe 3.2006; transcribed (double key) by AEL Data 5.2006. RN3, 529288=* This subject has been fully discussed in my work 'On the Effects of Cross and Self-fertilisation in the Vegetable Kingdom,' 1876, p. 402., 466358=† 'Linn. Transact.' vol. xvi. p. 696–701. Link in his 'Bemerkungen über der Bau der Orchideen' ('Botanische Zeitung,' 1849, p. 745) seems to have also trusted to transverse sections. Had he traced the vessels upwards I cannot believe that he would have disputed Brown's view of the nature of the two anthers in Cypripedium. Brongniart in his admirable paper ('Annales des Sciences Nat.' tom. xxiv. 1831) incidentally shows the course of some of the spiral vessels., 194920=* 'Transact. New Zealand Institute,' vol. v. 1873, p. 352; and vol. vii. p. 351., 173328=† 'Journ. Linn. Soc. Bot.' vol. ix. 1865, p. 156., 126256=* 'Journ. Linn. Soc.' vol. viii. 1865, p. 258., 8300=GRAY, ASA.—On Platanthera (Habenaria) and Gymnadenia in 'Enumeration of Plants of the Rocky Mountains.'—American Journal of Science and Arts, Second Series, vol. xxxiv., No. 101, Sept. 1862, p. 33., 93495=† Quoted by J. G. Kurr in his 'Untersuchungen über die Bedeutung der Nektarien.' 1833, s. 28. See also 'Das entdeckte Geheimniss,' s. 403., 458334=† 'Verh. d. Nat. Ver. für Pr. Rheinland und Westfal.' Jahrg. xxv. III. Folge, v. Bd. p. 1: see also 'Befruchtung der Blumen,' 1873, p. 76., 13155=WEALE, J. P. MANSEL.—'Notes on some Species of Habenaria found in South Africa.'—Journal of Linnean Society, vol. xiii. 1871, p. 47., 157062=† 'American Journal of Science,' vol. xxxiv. 1862, p. 426, and footnote p. 260; and vol. xxxvi. 1863, p. 293. In the latter paper he adds some remarks on G. flava and nivea., 89179=* In the summer of 1875, which was a very wet one, I gathered six unusually fine spikes of O. pyramidalis. These bore 302 flowers, excluding fourteen which were still fully expanded and capable of being fertilised; and on this occasion only 119 flowers produced capsules, 183 having failed to do so. Six spikes of O. maculata bore 187 flowers, of which eighty-two produced capsules, 105 having failed., 456410=* See also 'American Journal of Science,' vol. xxxiv. 1862, p. 427., 305803=† 'Journal of Horticulture,' 1863, p. 206 and 287: in the latter paper Mr. Gosse gives an account of his microscopical examination of the self-fertilised seeds., 78444=* Some remarks to this effect were given in my \"Notes on the Fertilisation of Orchids,\" in 'Annals and Mag. of Nat. Hist.' Sept. 1869, p. 2., 28167=I must premise that Christian Konrad Sprengel, in his curious and valuable work, 'Das entdeckte Geheimniss der Nature,' published in 1793, gave an excellent outline of the action of the several parts in the genus Orchis; for he well knew the position of the stigma, and he discovered that insects were necessary to remove the pollen-masses.* But he overlooked many curious contrivances,—a consequence, apparently, of his belief that the stigma generally receives pollen from the same flower. Sprengel, likewise, has partially described the structure of Epipactis; but in the case of Listera he entirely misunderstood the remarkable phenomena characteristic of that genus, which has been well described by Dr. Hooker in the 'Philosophical Trans-, 221920=* 'Ueber den Blüthenbau von Epipogium,' &c. 1866; see also Irmisch, 'Beiträge zur Biologie der Orchideen,' 1853, p. 55., 514879=* Auguste de Saint Hilaire ('Leçons de Botanique,' &c., 1841, p. 447) says that the elastic threads exist in the early bud, after the pollen-grains have been partly formed, as a thick creamy fluid. He adds that his observations on Ophrys apifera have shown him that this fluid is secreted by the rostellum, and is slowly forced drop by drop into the anther. Had not so eminent an authority made this statement, I should not have noticed it. It is certainly erroneous. In buds of Epipactis latifolia I opened the anther, whilst perfectly closed and free from the rostellum, and found the pollen-grains united by elastic threads. Cephalanthera grandi-, 225439=* 'Amer. Journal of Science,' vol. xxxiv. 1862, p, 427. I formerly thought that with this plant and Spiranthes. it was the labellum which moved from the column to allow of the more free entrance of insects; but Professor Gray is convinced that it is the column which moves., 66828=* The late Prof. Treviranus has confirmed ('Botanische Zeitung,' 1863, p. 241) all my observations, but points out two unimportant inaccuracies in the drawing which I have given., 77=RECORD: Darwin, C. R. 1877. The various contrivances by which orchids are fertilised by insects. London: John Murray. 2d edition., 354378=* 'Bot. Zeitung,' 1868, p. 164., 97856=† 'Handbook of the British Flora,' 1858, p. 501., 192071=† 'Proc. Boston Soc. Nat. Hist.' vol. ix. 1863, p. 182., 177239=* 'Journ. Linn. Soc. Bot.' vol. xiii. 1871, p. 45., 134107=* 'Bot. Zeitung,' 1863, p. 241. This botanist at first doubted my observations on Ophrys apifera and aranifera, but has since fully confirmed them., 338379=* Mr. Belt suggests ('The Naturalist in Nicaragua,' 1874, p. 133) that the great length of the nectary of this plant serves to prevent other moths which are not well-adapted for the fertilisation of the flowers from sucking the nectar, and that its development can thus be accounted for. I have no doubt of the truth of this principle, but it is hardly applicable here, as the moth has to be compelled to drive its proboscis as deeply down as possible into the flower., 8083=BRONN, H. G.—'Charles Darwin, über die Einrichtungen zur Befruchtung britischer und ausländischer Orchideen.' With an Appendix by the Translator on Stanhopea devoniensis. Stuttgart, 1862., 11192=MOGGRIDGE, J. TRAHERNE, on Ophrys.—'Flora of Mentone,' 1867 (?). Plates 43, 44, 45., 402489=* 'Journ. Linn. Soc. Bot.' vol. viii. 1864, p. 127., 9304=SCUDDER, J. H.—On Pogonia ophioglossoides. Proceedings of the Boston Society of Natural History, vol. ix. April, 1863., 103466=† Treviranus confirms ('Bot. Zeitung,' 1863, p. 10) a statement made by Salisbury, that when the filaments in the flowers of another leguminous plant, Edwardsia, fall off, or when they are cautiously separated, a large quantity of sweet fluid flows from the points of separation; and as beforehand there was no trace of any such fluid, it must have been contained, as Treviranus remarks, within the cellular tissue. I may add an apparently similar, but really distinct case, namely, the presence of nectar in several monocotyledonous plants (as described by Ad. Brongniart in 'Bull. Soc. Bot. de France,' tom. i. 1854, p. 75) between the two walls (feuillets) which form the divisions of the ovarium. But the nectar in this case is conducted to the outside by a channel; and the secreting surface is homologically an exterior surface., 608715=Citation: John van Wyhe, editor. 2002-. The Complete Work of Charles Darwin Online. (http://darwin-online.org.uk/), 78620=† M. Ménière (in 'Bull. Bot. Soc. de France,' tom. i. 1854, p. 370) says he saw in Dr. Guépin's collection, bees collected at Saumur with the pollinia of Orchids attached to their heads; and he states that a person who kept bees near the Jardin de la Faculté (at Toulouse?) complained that his bees returned from the garden with their heads charged with yellow bodies, of which they could not free themselves. This is good evidence how firmly the pollinia are attached. There is, however, nothing to show whether the pollinia in these cases belonged to the genus Orchis or to some other genus of the family., 352452=* 'Bot. Zeitung,' 1863, Oct. 30, et seq., and Aug. 4, 1865., 14147=FITZGERALD, R. D.—'Australian Orchids.' Part I. 1875, Part II. 1876. Sydney, New South Wales., 10373=MOGGRIDGE, J. TRAHERNE.—'Observations on some Orchids of the South of France.'—Journal of Linnean Society, Botany, vol. viii. No. 32, 1865, p. 256., 118995=We here see that, out of 207 flowers examined, not half had been visited by insects. Of the eighty-eight flowers visited, thirty-one had only one pollinium removed. As the visits of insects are indispensable for the fertilisation of this Orchid, it is surprising (as in the case of Orchis fusca) that the flowers have not been rendered more attractive to insects. The number of seed-capsules produced is proportionably even less than the number of flowers visited by insects. The year 1861 was extraordinarily favourable to this species in this part of Kent, and I never saw such numbers in flower; accordingly I marked eleven plants, which bore forty-nine flowers, but these produced only seven capsules. Two of the plants each bore two capsules, and three other plants each bore one, so that no less than six plants did not produce a single capsule! What are we to conclude from these facts? Are the conditions of life unfavourable to this species, though during the year just alluded to it was so numerous in some places as to deserve to be called quite common? Could the plant nourish more seed; and would it be of any advantage to it to produce more seed? Why does it produce so many flowers, if it already produces a sufficiency of seeds? Something seems to be out of order in its mechanism or in its conditions. We shall presently see that Ophrys apifera or the Bee Ophrys, 535310=* 'Bulletin Bot. Soc. de France,' tom. ii. 1855, p. 352., 47793=* Dr. H. Müller ('Die Befruchtung der Blumen durch Insekten,' 1873, p. 84) has timed humble-bees at work on the spikes of flowers of Orchis mascula, and finds that this statement is correct., 555155=* 'Gardener's Chron.' 1862, p. 192., 8978=GRAY, ASA.—On Platanthera (Habernaria) flava and Gymnadenia tridentata.—American Journal of Science and Arts, vol. xxxvi. Sept. 1863, p. 292., 454435=† 'Bedeutung der Nektarien, 1833, p. 29., 10902=HILDEBRAND, F.—'Die Geschlechter-Vertheilung bei den Pflanzen,' &c. Leipzig, 1867, p. 51, et seq., 495607=* 'Beiträge zur Kenntniss der Befruchtung,' 1844, p. 236., 12571=MÜLLER, FRITZ.—'Umwandlung von Staubgefässen in Stempel bei Begonia. Uebergang von Zwitterblüthigkeit in Getrenntblüthigkeit bei Chamissoa. Triandrische Varietät eines monandrischen Epidendrum.'—Botanische Zeitung, No. 10, 1870, p. 149., 118553=ciently, the following cases show. During several years before 1858 I occasionally examined some flowers and found that only thirteen out of 102 had one or both pollinia removed. Although at the time I recorded in my notes that most of the flowers were partly withered, I now think that I must have included many young flowers, which might perhaps have been subsequently visited; so I prefer trusting to the following observations., 11512=HILDEBRAND.—'Notizen über die Geschlechtsverhältnisse brasilianischer Pflanzen. Aus einem Briefe von Fritz Müller.'—Botanische Zeitung, No. 8, 1868, p. 113., 5125=PALÆONTOGRAPHICAL SOCIETY, 1851., 470152=* See Brown's observations under Apostasia in Wallich's 'Plantæ Asiaticæ rariores,' 1830, p. 74., 198851=* 'Transact. New Zealand Institute,' vol. vii. 1875, p. 349., 8712=ANDERSON, J.—'Fertilisation of Orchids.'—Journal of Horticulture and Cottage Gardener, April 21, 1863, p. 287., 12843=WEALE, J. P. MANSEL.—'Note on a Species of Disperis found on the Kageberg, South Africa.'—Journal of Linnean Society, Botany, vol. xiii. 1871, p. 42., 572738=* Gärtner, 'Beiträge zur Kenntniss der Befruchtung,' 1844, p. 135., 97084=* Kurr ('Bedeutung der Nektarien,' 1833, p. 123) cut off the nectaries of fifteen flowers of Gymnadenia conopsea, and they did not produce a single capsule: he also treated in the same manner fifteen flowers of Platanthera or Habenaria bifolia, and these set only five capsules; but then it should be observed that the nectaries of both these orchids contain free nectar. He also cut off the corolla, leaving the nectary, of forty flowers of Orchis morio, and these set no capsules; and this case shows that insects are guided to the flowers by the corolla. Sixteen flowers of Platanthera treated in the same manner bore only one capsule. Similar experiments made by him on Gymnadenia seem to me open to doubt., 12300=MOGGRIDGE, J. TRAHERNE.—'Ueber Ophrys insectifera, L. (part).—Verhandlungen der Kaiserl. Leop. Carol. Akad. (Nova Acta), tom. xxxv. 1869., 200372=* For Bourbon see 'Bul. Soc. Bot. de France,' tom. i. 1854, p. 290. For Tahiti see H. A. Tilley, 'Japan, the Amour, &c.,' 1861, p. 375. For the East Indies see Morren in 'Annals and Mag. of Nat. Hist.' 1839, vol. iii. p. 6. I may give an analogous but more striking case from Mr Fitzgerald, who says \"that Sarcochilus parviflorus (one of the Vandeæ) produces capsules not unfrequently in the Blue Mountains of New South Wales; removed from thence to Sydney, a number of plants, though flowering well, have not borne any seed if left to themselves, though invariably fertile when the pollen-masses were removed and placed on the stigma.\"Yet the Blue Mountains are less than one hundred miles distant from Sydney., 133867=1829, p. 25, says: \"Mr. Price has frequently witnessed attacks made upon the Bee Orchis by a bee, similar to those of the troublesome Apis muscorum.\" What this sentence means I cannot conjecture., 464252=* I believe his latest views are given in his celebrated paper, read Nov. 1–15, 1831, and published in the 'Linnean Transactions,' vol. xvi. p. 685., 124412=* 'Fecondazione nelle Piante Antocarpee,' 1867, p. 20., 307088=* See also 'Bot. Zeitung,' 1869, p. 226, and 1870, p. 152., 10048=CRÜGER.—'A few Notes on the Fecundation of Orchids, and their Morphology.'—Journal of Linnean Society, Botany, vol. viii. No. 31, 1864, p. 127., 9810=TRIMEN, R.—'On the Fertilisation of Disa grandiflora, Linn.'—Journal of Linnean Society, Botany, vol. vii. 1863, p. 144., 7855=List of Papers and Books bearing on the Fertilisation of the Orchideæ, which have been published since the appearance of the First Edition of this Work in 1862, arranged in Chronological Order., 13938=DELPINO.—'Ulteriori Osservazioni sulla Dicogamia nel Regno vegetale.' Parte seconda, fase. ii. Milan, 1875, pp. 149, 150., 412738=thorax. When the bee walks about, the pollen-mass lies flat on the back and wings; but when the insect enters a female flower, always with the labellum turned upwards, the pollinium, which is hinged to the gland by elastic tissue, falls back by its own weight and rests on the anterior face of the column. When the insect returns backwards from the flower, the pollinia are caught by the upper margin of the stigmatic cavity, which projects a little beyond the face of the column; and if the gland be then detached from the back of the insect, or the tissues which connect the pollinia with the caudicle, or this with the gland, break, fecundation takes place.\" Dr. Crüger sent me specimens of the humble-bees which he caught gnawing the labellum, and these consist of Euglossa nov. spec., cajennensis and piliventris., 553216=† Mr. Bree, in 'Loudon's Mag. of Nat. Hist,' vol. ii. 1829, p. 70., 525493=* The fullest and the most able discussion on this difficult subject is by Professor H. G. Bronn in his 'Entwickelungs-Gesetze der Organischen Welt,' 1858., 13003=WEALE, J. P. MANSEL.—'Some Observations on the Fertilisation of Disa macrantha.'—Journal of Linnean Society, vol. xiii. 1871, p. 45., 393720=* 'Transactions of the Linnean Soc.' vol. xvii. p. 522. Another account by Dr. Lindley appeared in the 'Botanical Register,' fol. 1951, of a distinct species of Myanthus and Monachanthus appearing on the same scape: he alludes also to other cases. Some of the flowers in these cases were in an intermediate condition, which is not surprising, seeing that in diœcious plants we sometimes have a partial resumption of the characters of both sexes. Mr. Redgers of River-hill informs me that he imported from Demerara a Myanthus, and that when it flowered a second time it was metamorphosed into a Catasetum. Dr. Carpenter ('Comparative Physiology,' 4th edit. p. 633) alludes to an analogous case which occurred at Bristol. Lastly Dean Herbert informed me many years ago that Catasetum luridum flowered and kept true for nine years in the Botanic Garden at York; it then threw up a scape of a Myanthus, which as we shall presently see is an hermaphrodite, intermediate in form between the male and female. M. Duchartre has given a full historical account of the appearance of these forms on the same plant, in 'Bull. de la Soc. Bot. de France,' vol. ix. 1862, p. 113., 271018=Mr. James Veitch, jun., has generously given me many beautiful Orchids, some of which were of especial service. Mr. R. Parker also sent me an extremely valuable series of forms. Lady Dorothy Nevill most kindly placed her magnificent collection of Orchids at my disposal. Mr. Rucker of West Hill, Wandsworth, sent me repeatedly large spikes of Catasetum, a Mormodes of extreme value and some Dendrobiums. Mr. Rodgers of Sevenoaks has given me interesting information. Mr. Bateman, so well known for his magnificent work on Orchids, sent me a number of interesting forms, including the wonderful Angræcum sesquipedale. I am greatly indebted to Mr. Turnbull of Down for allowing me the free use of his hothouses, and for giving me some interesting Orchids; and to his gardener, Mr. Horwood, for his aid in some of my observations., 136122=* 'The Effects of Cross and Self-Fertilisation in the Vegetable Kingdom,' 1876., 459952=* Selenipedium palmifolium is one of the Cypripedeæ, and according to Dr. Crüger ('Journ. Linn. Soc. Bot.' vol. viii. 1864, p. 134) bears very fragrant flowers, which \"in all probability are always impregnated by insects. The labellum is, like some Aristolochia-flowers, constructed after the fish-pot system, i. e. a funnel-shaped opening conducts into it, and insects find it difficult to escape through the same. The only other opening near the base of the labellum is partly closed by the sexual apparatus, and the insect has to force its way out there.\", 104396=§ 'Ult. Osservazioni sulla Dicogamia,' 1875, p. 121., 305726=* 'Journ. Linn. Soc. Bot.' vol. viii. 1864, p. 131., 376385=* 'Bull. de la Soc. Bot. de France,' tom. i. 1854, p. 367., 354435=† 'Bulletin de la Soc. Bot. de France,' tom. ii. 1855, p. 351., 11286=WEALE, J. P. MANSEL.—'Notes on the Structure and Fertilisation of the Genus Bonatea, with a special description of a Species found at Bedford, South Africa.'—Journal of Linnean Society, Botany, vol. x. 1867, p. 470., 272409=† Sir James Smith, I believe. first noticed this fact in the 'English Flora,' vol. iv. p. 47, 1828. Towards the summit of the spike the lower sepal does not depend, as represented in the woodcut (fig. 19, A), but projects nearly at right angles. Nor are the flowers always so completely twisted round as here represented., 173021=* Mr. J. Mansel Weale has described ('Journ. Lin. Soc. Bot.' vol. xiii. 1871, p. 47) the method of fertilisation of two South African species of Habenaria: one of these is remarkable from the pollinia not undergoing any movement or change of position when removed from their cases., 454351=* 'American Journal of Science,' vol. xxxiv. 1862, p. 428., 131494=During most years the pollen-masses of the many hundred flowers which were examined, adhered with the rarest exceptions to the stigma, with their discs still enclosed within the pouches. But in the year 1868, from some cause the nature of which I cannot conjecture, out of 116 flowers gathered in two localities in Kent, seventy-five retained both pollinia in their cells; ten had one pollinium, and only thirty-one had both adhering to the stigma. Long and often as I have watched plants of the Bee Ophrys, I have never seen one visited by any insect.* Robert Brown imagined, 264082=* This unnatural sickly-looking plant has generally been supposed to be parasitic on the roots of the trees under the shade of which it lives; but, according to Irmisch ('Beiträge zur Biologie und Morphologie der Orchideen,' 1853, s. 25), this certainly is not the case., 218952=To show how effectually the flowers are fertilised, I may add that during the wet and cold season of 1860 a friend in Sussex examined five spikes bearing eighty-five expanded flowers; of these, fifty-three had the pollinia removed, and thirty-two had them in place: but as many of the latter were immediately beneath the buds, a larger number would almost certainly have been afterwards remowed. In Devonshire I found a spike with nine open flowers, and the pollinia in all were removed with one exception, and in this case a fly, too small to remove the pollinia, had become glued to the rostellum, and had there miserably perished., 394918=† The 'Vegetable Kingdom,' 1853, p. 178., 177315=† 'Journ. Linn Soc. Bot.' vol. xiii. 1871, p. 42., 13298=CHEESEMAN, T. F.—'On the Fertilisation of the New Zealand Species of Pterostylis.'—Transactions of the New Zealand Institute, vol. v. 1873, p. 352., 2826=1877., 537211=* 'Journ. Linn. Soc. Bot.' 1864, vol. viii. p. 129., 334695=* See letter with a drawing by Hermann Müller, 'Nature,' 1873, p. 223., 443408=sep. sepals., 13456=MÜLLER, HERMANN,—'Die Befruchtung der Blumen durch Insekten,' &c. Leipzig, 1873, pp. 74–86., 245769=* 'Australian Orchids,' part ii. 1876., 12059=DARWIN, CHARLES.—'Notes on the Fertilisation of Orchids.'—Annals and Magazine of Natural History, Sept. 1869., 9166=JOURNAL OF HORTICULTURE AND COTTAGE GARDENER.—March 17, 1863, p. 206. 'On Orchid Cultivation, Cross-breeding, and Hybridising.', 446393=* Quoted by Irmisch, 'Beiträge zur Biologie der Orchideen,' 1853, p. 22., 381962=From the large size of the flower, more especially of the viscid disc, and from its wonderful power of adhesion, I formerly inferred that the flowers were visited by large insects, and this is now known to be the case. The viscid matter sticks so firmly after it has set hard, and the pedicel is so strong (though very thin and only one-twentieth of an inch in breadth at the hinge), that to my surprise a pollinium attached to an object supported for a few seconds a weight of 1262 grains, or nearly three ounces; and it supported for a considerable time a slightly less weight. When, 11781=MÜLLER, FRITZ.—'Ueber Befruchtungserscheinungen bei Orchideen.'—Botanische Zeitung, No. 39, 1868, p. 629., 171114=* 'American Journal of Science,' vol. xxxiv. 1862, pp. 143, 259, and 424, and vol. xxxvi. 1863, p. 292., 73025=* 'Nature,' Dec. 31, 1874, p. 169., 71073=† 'Journ. Linn. Soc. Bot.' vol. viii. 1865, p. 256. He gives also a figure of Orchis hircina., 10805=DELPINO.—'Sugli Apparecchi della Fecondazione nelle Piante antocarpee.'Florence, 1867., 12457=MÜLLER, FRITZ.—'Ueber einige Befruchtungserscheinungen.'—Botanische Zeitung, No. 14, 1869, p. 224., 81755=* I am indebted to Mr. Parfitt for an examination of this moth, which is mentioned in the 'Entomologist's Weekly Intelligencer,' vol. ii. p. 182, and vol. iii. p. 3, Oct. 3, 1857. The pollinia were erroneously thought to belong to Ophrys apifera. The pollen had changed from its natural green colour to yellow; on washing it, however, and drying it, the green tint returned., 6035=THE first edition of this work was published early in the year 1862, and has been for some time out of print. During the two or three years after its appearance I received, through the kindness of various correspondents in different parts of the world, a large number of letters, especially from Fritz Müller in South Brazil, communicating to me many new and curious facts, and calling my attention to some errors. Various memoirs on the fertilisation of orchids have also since been published, and I have myself examined several new and striking forms. A large amount of matter has thus been accumulated; but the present volume would be rendered much too long if the whole were introduced. I have, therefore, selected only the more interesting facts, and have given a brief abstract of the several published papers. The work has thus been remodelled; and the additions and corrections are so numerous that I have found it impossible to follow my usual plan of giving a list of them. I have, however,, 11902=MÜLLER, HERMANN.—'Beobachtungen an westfälishen Orchideen.'—Verhandlungen des nat. Vereins für Pr. Rheinl. u. Westf. 1868 and 1869., 164824=* 'Nature,' Sept. 12, 1872, p. 393., 13819=MÜLLER, HERMANN.—'Alpine Orchids adapted to Cross-fertilisation by Butterflies.'—Nature, Dec. 31, 1874., 529453=† Kurr, 'Ueber die Bedeutung der Nektarien,' 1833, p. 28., 9668=TREVIRANUS.—'Nachträgliche Bemerkungen über die Befruchtung einiger Orchideen.'—Botanische Zeitung, No. 32, 1863, p. 241., 5298=PALÆONTOGRAPHICAL SOCIETY, 1854., 396666=* Dr. Hance writes to me that he has in his collection a plant of Catasetum tridentatum, from the West Indies bearing a tine capsule; but it does not appear to have been ascertained that this particular flower was that of Catasetum, and there is no great improbability in a single flower of Monachanthus being produced by a plant of Catasetum, as well as a whole scape, which we know has often occurred. J. G. Beer says (quoted by Irmisch, 'Beiträge zu Biologie der Orchideen,' 1853, p. 22) that during three years he tried in vain to fertilise Catasetum, but on one occasion, by placing only the viscid disc of a pollinium within the stigma, a ripe fruit was produced; but it may be asked, Did the seeds contain embryos?, 104566=lower and first opened flowers. But this statement is completely contradicted by my observations previously given, from which it follows that very many of the upper flowers are fertilised; for instance, on a spike of O. pyramidalis with between fifty and sixty flowers, no less than forty-eight had their pollinia removed. Nevertheless, as soon as I learnt that Delpino still believed in Sprengel's view, I selected during the unfavourable season of 1875 six old spikes of O. maculata, and divided each into halves, so as to observe whether many more capsules were produced by the lower than by the upper half. This certainly was not always the case; for in some of the spikes no difference could be detected between them; in others there were more capsules in the lower, while in others there were more in the upper half. A spike of O. pyramidalis examined in the same manner produced twice as many capsules in the upper as in the lower half. Bearing in mind these facts and others before given, it appears to me incredible that the same insect should go on visiting flower after flower of these Orchids, although it never obtains any nectar. Insects, or at least bees, are by no means destitute of intelligence. They recognise from a distance the flowers of the same species, and keep to them as long as they can. When humble-bees have bitten holes through the corolla, as they often do, so as to reach the nectar more easily, hive-bees immediately perceive what has been done and take advantage of the perforations. When flowers having more than a single nectary are visited by many bees, so that the nectar is exhausted in most of them, the bees which afterwards visit such flowers insert their proboscides only into one of the nectaries, and if they find this exhausted, they instantly pass on to another flower. Can it be believed that bees which, 414510=* 'Bot. Zeitung,' 1868, p. 630., 13567=CHEESEMAN, T. F.—'On the Fertilisation of Acianthus cyrtostilis.'—Transactions of the New Zealand Institute, vol. vii. 1874 (issued 1875), p. 349., 472054=* Link remarks on the manner of coherence of the labellum to the column in his \"Bemerkungen\" in 'Bot. Zeitung,' 1849, p. 745., 191987=* 'Ult. Osservaz. sulla Dicogamia,' part ii. 1875, p. 149., 10531=TRIMEN, R.—'On the Structure of Bonatea speciosa, Linn., with reference to its Fertilisation.'—Journal of Linnean Society, vol. ix. 1865, p. 156., 320079=* I may here remark that Delpino ('Fecondazione nelle Plante,' Firenze, 1867, p. 19) says he has examined flowers of Vanda, Oncidium, Epidendrum, Phaius, and Dendrobium, and is able to confirm in general my statements., 9442=TREVIRANUS.—'Ueber Dichogamie nach C. C. Sprengel und Ch. Darwin. § 3. Orchideen.'—Botanische Zeitung, No. 2, 1863, p. 9., 138056=* These forms are illustrated by beautiful coloured drawings in the 'Flora of Mentone,' pl. 43 to 45; and in his memoir in the 'Verhandlungen der Kaiserl. Leop. Car. Akad.' (Nov. Act.), tom. xxxv. 1869., 446496=† Lindley's 'Vegetable Kingdom,' 1853, p. 177. He has also published in the 'Botanical Register,' fol. 1951, a case of two forms appearing on the same scape of another species of Cycnoches. Mr. Bateman also says that C. egertonianum has been known to produce in Guatemala and once in England scapes of a purple-flowered and widely different species of Cycnoches; but that it generally produces in England scapes of the common yellow C. ventricosum., 11023=HILDEBRAND, F.—'Frederigo Delpino's Beobachtungen über die Bestäubungsvorrichtungen bei den Phanerogamen.'—Botanische Zeitung, No. 34, 1867, p. 265., 394984=‡ Brongniart states ('Bull. de la Soc. Bot. de France,' tom. ii. 1855, p. 20) that M. Neumann, a skilful fertiliser of Orchids, could never succeed in fertilising Catasetum., 8833=GOSSE, P. H.—'Microscopic Observation on some Seeds of Orchids.'—Journal of Horticulture and Cottage Gardener, April 21, 1863, p. 287., 10207=SCOTT, J.—'On the Individual Sterility and Cross-impregnation of certain Species of Oncidium.'—Journal of Linnean Society, vol. viii. No. 31, 1864, p. 162., 557160=† Transact. New Zealand Inst.' vol. vii. 1875, p. 351., 383656=* M. Baillon ('Bull. de la Soc. Bot. de France,' tom. i. 1854, p. 285) states that Catasetum luridum ejects its pollinia always in a straight line, and in such a direction that it sticks fast to the bottom of the concavity of the labellum; and he imagines that in this position it fertilises the flower in a manner not clearly explained. In a subsequent paper in the same volume (p. 367) M. Ménière justly disputes M. Baillon's conclusion. He remarks that the anther-case is easily detached, and sometimes naturally detaches itself; the pollinia then swing downwards by the elasticity of the pedicel, the viscid disc still remaining attached to the roof of the stigmatic chamber. M. Ménière hints that, by the subsequent and progressive retraction of the pedicel, the pollen-masses might be carried into the stigmatic chamber. This is not possible in the three species which I have examined, and would be useless. But M. Ménière himself then goes on to show how important insects are for the fertilisation of Orchids; and apparently infers that their agency comes into play with Catasetum, and that this plant does not fertilise itself. Both M. Baillon and M. Ménière correctly describe the curved position in which the elastic pedicel lies before it is sot free. Neither of these botanists seems to be aware that the species of Catasetum (at least the five which I have examined) are exclusively male plants., 296668=* 'Journal of Horticulture,' 1863, pp. 206, 287., 245833=† 'Philosophical Transactions,' 1854, p. 259., 31130=* 'Linnean Transactions,' 1833, vol. xvi. p. 704., 14070=LUBBOCK, SIR J.—'British Wild Flowers.' London, 1875, pp. 162–175., 175455=nectar and that the flowers are very conspicuous, it is remarkable that they are rarely visited by insects. Mr. Trimen wrote to me in 1864 that he had lately examined seventy-eight flowers, and only twelve of these had one or both pollinia removed by insects, and only five had pollen on their stigmas. He does not know what insects occasionally fertilise the flowers; but Mrs. Barber has more than once seen a large fly, allied to Bombylius, with the pollinia of Disa polygnoides attached to the base of its proboscis. Mr. Weale states* that D. macrantha differs from D. grandiflora and cornuta in producing plenty of seed, and is remarkable from often fertilising itself. This follows from \"a very slight jerk, when the flower is fully expanded, sufficing to eject the pollinia from their widely open anther-cases, and to bring them into contact with the stigma. This in nature is not unseldom the case, as I have repeatedly found many flowers thus fertilised.\" He has, however, no doubt that the flowers are likewise cross-fertilised by nocturnal insects. He adds that D. grandiflora in being so seldom fertilised by insects offers a case like that of Ophrys muscifera; whilst D. macrantha in being often self-fertilised closely corresponds with Ophrys apifera; but this latter species seems to be invariably self-fertilised., 9950=WEST OF SCOTLAND HORTICULTURAL MAGAZINE.—'Fertilisation of Orchids,' Sept. 1863, p. 65., 350357=* 'Journ. Linn. Soc. Bot.' vol. viii. 1864, p. 130. Bronn has described the structure of Stanhopea devoniensis, in his German translation of the first edition of this work., 29486=actions' for 1854. Dr. Hooker has given a full and accurate account, with drawings, of the structure of the parts; but from not having attended to the agency of insects, he did not fully understand the object gained. Robert Brown,* in his celebrated paper in the 'Linnean Transactions,' expresses his belief that insects are necessary for the fructification of most Orchids; but adds, that the fact of all the capsules on a dense spike not infrequently producing seed, seems hardly reconcilable with this belief: we shall hereafter find that this doubt is groundless. Many other authors have given facts and expressed their belief, more or less fully, on the necessity of insect-agency in the fertilisation of Orchids., 465679=* Professor Asa Gray has described in the 'American Journal of Science.' July 1866, a monstrous flower of Cypripedium candidum, and remarks on it, \"here we have (and perhaps the first direct) demonstration that the orchideous type of flower has two staminal verticils, as Brown always insisted.\" Dr. Crüger also advances evidence ('Journ. Linn. Soc. Bot.' vol. viii. 1864, p. 132) in favour of the presence of five whorls of organs; but he denies that the homologies of the parts can be deduced from the course of the vessels, and he does not admit that the labellum is formed by the union of one petal with two petaloid stamens.}", "textBeforeTable": "LIST OF WOODCUTS. [page xv] INDEX .. .. .. .. .. .. .. .. .. .. .. ..294 Gradation of organs, of the rostellum, of the pollen-masses—Formation of the caudicle—Genealogical affinities—Secretion of nectar—Mechanism of the movement of the pollinia—Uses of the petals—Production of seed—Importance of trifling details of structure—Cause of the great diversity of structure in the flowers of Orchids—Cause of the perfection of the contrivances—Summary on insect-agency—Nature abhors perpetual self-fertilisation .. .. .. .. ..Page 247–293 GRADATION OF ORGANS, &c.—CONCLUDING REMARKS. CHAPTER IX. [page] xiv Cypripedium, differs much from all other Orchids—Labellum in the form of a slipper with two small orifices by which insects can escape—Manner of fertilisation by small bees of the genus Andrena—Homological nature of the several parts of the flowers of the Orchideæ—Wonderful amount of modification which they have undergone .. .. .. .. .. .. .. 226–246 CYPRIPEDEÆ—HOMOLOGIES OF THE FLOWERS OF ORCHIDS. CHAPTER VIII. Catasetidæ, the most remarkable of all Orchids—The mechanism by which the pollinia of Catasetum are ejected to a distance and are transported by insects—Sensitiveness of the horns of the rostellum—Extraordinary difference in the male, female, and hermaphrodite forms of Catasetum tridentatum—Mormodes ignea, curious structure of the flowers; ejection of the pollinia—Mormodes luxata—Cycnoches ventricosum, manner of fertilisation .. .. .. .. .. .. .. .. .. 178–225 VANDEÆ continued.—CATASETIDÆ. CHAPTER VII. Pages 149–177 Structure of the column and pollinia—Importance of the elasticity", "textAfterTable": "[page] xvi PAGE 26. CALANTHE MASUCA .. .. .. .. .. .. .. .. 161 27. CORYANTHES SPECIOSA .. .. .. .. .. .. .. 174 28. CATASETUM SACCATUM .. .. .. .. .. .. .. 182 29. 183 30. CATASETUM TRIDENTATUM .. .. .. .. .. .. 194 31. MONACHANTHUS AND MYANTHUS .. .. .. .. .. 199 32. MORMODES IGNEA .. .. .. .. .. .. .. .. 209 33. CYCNOCHES VENTRICOSUM .. .. .. .. .. .. .. 222 34. CYCNOCHES VENTRICOSUM SECTION THROUGH BUD .. .. 223 35. CYPRIPEDIUM .. .. .. .. .. .. .. .. 227 36. TRANSVERSE SECTION OF FLOWER OF AN ORCHID .. 236 37. ROSTELLUM OF CATASETUM .. .. .. .. .. .. 256 38. DISC OF GYMNADENIA CONOPSEA .. .. .. .. .. 272 P. S.—I am much indebted to Mr. G. B. Sowerby for the pains which he has taken in making the Diagrams as intelligible as possible. [page 1] ON THE FERTILISATION OF ORCHIDS BY INSECTS, &c. &c.", "hasKeyColumn": false, "keyColumnIndex": -1, "headerRowIndex": 0}