{"relation": [["Valuation", "Price/Earnings", "Price/Sales", "Price/Book", "Price/Cash Flow", "TEV/Sales"], ["CRPB", "14.9x", "3.0x", "1.6x", "--", "--"], ["Industry Range", "", "", "", "Not Meaningful", "Not Meaningful"]], "pageTitle": "CALIFORNIA REPUBLIC BANCORP (CRPB:OTC US): Stock Quote & Company Profile - Businessweek", "title": "", "url": "http://www.bloomberg.com/research/stocks/snapshot/snapshot.asp?ticker=CRPB", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 3, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988650.53/warc/CC-MAIN-20150728002308-00227-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 340638319, "recordOffset": 340614963, "tableOrientation": "HORIZONTAL", "TableContextTimeStampBeforeTable": "{36894=+1 212 318 2000, 36562=+65 6212 1000}", "TableContextTimeStampAfterTable": "{15159=California Republic Bancorp Presents at Sandler O'Neill + Partners West Coast Financial Services Conference, Mar-11-2015 . Venue: Phoenix, Arizona, United States., 13152=California Republic Bancorp announced earnings results for the fourth quarter and full year ended Dec. 31, 2014. For the three months ended December 31, 2014, net income was $2.5 million, or $0.37 per basic common shares, compared with $2.6 million, or $0.50 per basis common shares, for the same period a year earlier. Net income for the fourth quarter of 2014 was directly impacted by costs associated with continuing to build automobile lending platform, and with costs for execution and completion of the equity and debt offerings. Earnings per share for the fourth quarter of 2014 were also impacted by the dilutive effect of the issuance of the new additional common shares. Net interest income grew 48%, or $4.0 million to $12.3 million for the three months ended December 31, 2014 compared with $8.3 million for the same period a year ago. For the year the company reported record pre-tax income of $20.1 million for the year ended 2014 compared with $8.4 million for the same period a year earlier. Net income was $12.0 million, or $2.12 per basic common share, for the year ended 2014 compared with $4.7 million, or $0.91 per basic common share, for all of 2013, which represents a 153% year-over-year increase. Return on average equity and return on average assets were 15.94% and 1.31%, respectively for the twelve months ended December 31, 2014 compared with 8.14% and 0.66%, respectively for the same period in 2013. For the twelve months ended December 31, 2014, net interest income grew 42%, or $12.3 million to $41.7 million compared with $29.4 million for the same period a year earlier., 11553=California Republic Bancorp reported unaudited consolidated earnings results for the first quarter ended March 31, 2015. For the quarter, the company reported pre-tax income of $5.8 million compared with $5.2 million for the same period a year earlier. Net income was $3.5 million, or $0.45 per basic common share, after the fully dilutive effect on EPS due to the issuance of 2.4 million additional common shares in the fourth quarter of 2014, compared with $3.0 million, or $0.56 per basic common share, for the same period a year earlier. Return on average equity and return on average assets were 9.9% and 1.2%, respectively compared with 19.1% and 1.5%, respectively for the same period in 2014. The company’s ROE was also impacted by raising $65.0 million in common equity in the fourth quarter of 2014. Net interest income grew 43%, or $3.8 million, to $12.9 million compared with $9.0 million for the same period a year ago. Book value per share was $18.47 compared to $12.49 a year ago. Total interest income was $13.695 million compared with $9.611 million for the same period a year ago. Income before income taxes was $5.822 million compared with $5.196 million for the same period a year ago., 4838=California Republic Bancorp operates as the bank holding company for California Republic Bank that provides various commercial banking products and services in the United States. It accepts various deposits products, such as business and personal checking accounts, business analyzed checking accounts, business NOW checking accounts, personal and business savings accounts, business and personal money market accounts, business and personal certificate of deposits, and interest on lawyers’ trust accounts. The company also offers various lending products, including lines of credit, asset based lines, term loans, and commercial real estate loans, as well as business credit cards. In addition, it provides contractor retention escrow accounts; private banking solutions for high-net worth investors, professionals, and entrepreneurs; and wire transfers and online banking services. Further, the company offers cash management products and services, such as account analysis, master agreement accounts, account reconciliation, remote deposit capture, online cash management, automated clearing house, bill pay, lockbox, positive pay, zero balancing accounts, merchant cards, reverse wires, statements on CD Rom, corporate credit card, courier, and bank by mail services. Additionally, it operates an indirect auto finance business, which purchases auto contracts from both franchised and independent automobile dealerships throughout Arizona, California, Illinois, Iowa, Kansas, Missouri, Nevada, Oklahoma, Texas, and Washington. As of April 29, 2015, the company had four full-service branches serving Southern California located in Newport Beach, Beverly Hills, Irvine, and Westlake Village, as well as a loan production office located in San Diego. California Republic Bancorp was founded in 2007 and is headquartered in Irvine, California.}", "textBeforeTable": "Industry Average CRPB Industry Analysis   // ]]> } document.write(BW_adsys('Right3')); if (window.BW_adsys) { // <script type=\"text/javascript\"> <div class=\"\" style=\"width:300px; margin: auto; \"> <div class=\"ad\"> </div> </table> </tbody> </tr> <td class=\"noDataRR\" style=\"border:none;\" colspan=\"3\"><a class=\"link_xs\" href=\"../../sectorandindustry/industries/industrydetail.asp?code=401010\">View Industry Companies</a></td> <tr> </tr> <td colspan=\"4\" align=\"center\">No competitor information is available for CRPB.</td> <tr> <tbody> </thead> </tr> <td width=\"50\" align=\"right\">Change</td> <td width=\"75\" align=\"right\">Last</td> <td>Company</td> <tr> <thead> <table class=\"colRight\" width=\"100%\" cellpadding=\"0\" cellspacing=\"0\"> <div class=\"clear\"></div> </div> <p class=\"note fLeft\" style=\"width:64%; text-align: right; padding: 5px 0; border-top: 3px solid #6B7B84; margin-top: 20px;\">Market data is delayed at least 15 minutes.</p> <h2 class=\"sectionTitle fLeft\" style=\"width: 35%; border-bottom: 0;\">CRPB Competitors</h2> <div style=\"border-bottom: 1px solid #ccc; overflow: hidden;\"> <div class=\"\"> </div> </table> </tbody> </tr> <td width=\"75\" align=\"right\" class=\"noBorder\"><img src=\"/cgi-bin/upload.dll/file.png?z05ae110az467dbc9fd4524b7eb18632dba100d5e9\" width=\"60\" height=\"15\" galleryimg=\"no\" symbol=\"US;CRPB\" /></td> <td align=\"right\" width=\"45\" class=\"noBorder\"><span class=\"negData\">-0.20</span></td> <td align=\"right\" class=\"noBorder\">$29.50 <span class=\"xSmGreyTxt\">USD</span></td> <td scope=\"row\"> <a class=\"link_xsb\" style=\"text-align:left\" target=\"_top\" href=\"../../stocks/snapshot/snapshot.asp?ticker=CRPB\"> CRPB:US </a> </td> <tr class=\"lastRow\"> <tbody> </thead> </tr> <td colspan=\"4\">Recently Viewed</td> <tr> <thead> <table class=\"miniTable\" summary=\"Recently viewed\"> </form> </fieldset> <a style=\"font-size:11px;\" target=\"_top\" href=\"../../common/symbollookup/symbollookup.asp\">Company Lookup</a> <input type=\"image\" name=\"submit\" src=\"http://images.businessweek.com/gen/buttons/stock_go_btn.gif\" align=\"absmiddle\" /> <input type=\"text\" id=\"lookupSymbol\" class=\"symbol\" autocomplete=\"off\" name=\"symbol\" value=\"Stock, Fund, or ETF\" onfocus=\"if(this.value == 'Stock, Fund, or ETF') this.value = '';\" onblur=\"if(this.value ==", "textAfterTable": "View Detailed CRPB Financials  |  View Sector Analysis Sponsored Financial Commentaries Sponsored Links Browse Companies A B C D E F G H I J K L M N O P Q R S T U V W X Y Z  |  0 1 2 3 4 5 6 7 8 9 Report Data Issue To contact CALIFORNIA REPUBLIC BANCORP, please visit www.crbnk.com. Company data is provided by Capital IQ. Please use this form to report any data issues. Information Missing - Please enter your information in the following field(s): Company Name Your Name* Your E-Mail Address*", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}