{"relation": [["Rank", "1", "2", "3", "4", "5", "6", "7", "8", "13"], ["Driver (Machine)", "Yvan MULLER (Citroen C-Elysee WTCC)", "Jose LOPEZ (Citroen C-Elysee WTCC)", "Sebastien LOEB (Citroen C-Elysee WTCC)", "Gianni MORBIDELLI (Chevrolet RML Cruze TC1)", "Tom CORONEL (Chevrolet RML Cruze TC1)", "Tiago MONTEIRO (Honda Civic WTCC)", "Norbert MICHELISZ (Honda Civic WTCC)", "Gabriele TARQUINI (Honda Civic WTCC)", "Mehdi BENNANI (Honda Civic WTCC)"]], "pageTitle": "Honda Worldwide | WTCC Series 2014 Round 07: Belgium", "title": "Race 1", "url": "http://world.honda.com/WTCC/2014/07belgium/race/index.html", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989507.42/warc/CC-MAIN-20150728002309-00157-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 255871097, "recordOffset": 255862895, "tableOrientation": "HORIZONTAL", "TableContextTimeStampBeforeTable": "{6660=WTCC World Touring Car Championship 2014, 1915=Monteiro acknowledged the congratulations of the Castrol Honda team for his hard work. “I had hoped for better results actually but it was very difficult to resist the challenges but the Civic is undamaged which is good news as we ship the cars to Argentina this week. We will now be able to test some new components in July which we hope will give us more performance for the second half of the year.”, 1009=At the end of the European sector of the 2014 World Touring Car Championship Alessandro Mariani, Managing Director of J.A.S. Motorsport was positive about the Spa result. “It was a very good weekend for Tiago. For Race 2 he was very near the podium. I am happy with the results on this difficult track. Now we need new parts to increase our performance for the second half of the season.”}", "lastModified": "Sun, 16 Nov 2014 15:38:14 GMT", "textBeforeTable": "WTCC World Touring Car Championship Round 07: Belgium Norbert Michelisz,Gabriele Tarquini At the end of the European sector of the 2014 World Touring Car Championship Alessandro Mariani, Managing Director of J.A.S. Motorsport was positive about the Spa result. “It was a very good weekend for Tiago. For Race 2 he was very near the podium. I am happy with the results on this difficult track. Now we need new parts to increase our performance for the second half of the season.” Whilst Norbert Michelisz enjoyed his first ever race at Spa he had expected better result after qualifying. “I had some tricky moments with contact and other cars positions and could not close the gap on the competition.” Gabriele was also disappointed. “I had contact in Race 1 which was at the very quick place on this circuit and could have been quite dangerous and in Race 2 we were just missing speed where these long straights make it difficult for us.” Monteiro acknowledged the congratulations of the Castrol Honda team for his hard work. “I had hoped for better results actually but it was very difficult to resist the challenges but the Civic is undamaged which is good news as we ship the cars to Argentina this week. We will now be able to test some", "textAfterTable": "Race 2 Rank Driver (Machine) 1 Jose LOPEZ (Citroen C-Elysee WTCC) 2 Yvan MULLER (Citroen C-Elysee WTCC) 3 Tom CORONEL (Chevrolet RML Cruze TC1) 4 Tiago MONTEIRO (Honda Civic WTCC) 5 Sebastien LOEB (Citroen C-Elysee WTCC) 6 Gianni MORBIDELLI (Chevrolet RML Cruze TC1) 7 Norbert MICHELISZ (Honda Civic WTCC) 8 Gabriele TARQUINI (Honda Civic WTCC) 11 Mehdi BENNANI (Honda Civic WTCC) Related Links Honda Worldwide | WTCC - FIA World Touring Car Championship Belgium Honda Worldwide site Home | Site Map | Site Index | About this Site Copyright, Honda Motor Co., Ltd. and its subsidiaries and affiliates. All Rights Reserved.", "hasKeyColumn": true, "keyColumnIndex": 1, "headerRowIndex": 0}