{"relation": [["Instance", "_Total", "ActiveScripting", "ANALYSISCOMMAND", "ANALYSISQUERY", "CmdExec", "Distribution", "Dts", "LogReader", "Merge", "PowerShell", "QueueReader", "Snapshot", "TSQL"], ["Description", "Information for all job steps.", "Information for job steps that use the ActiveScripting subsystem.", "Information for job steps that use the ANALYSISCOMMAND subsystem.", "Information for job steps that use the ANALYSISQUERY subsystem.", "Information for job steps that use the CmdExec subsystem.", "Information for job steps that use the Distribution subsystem.", "Information for job steps that use the Integration Services subsystem.", "Information for job steps that use the LogReader subsystem.", "Information for job steps that use the Merge subsystem.", "Information for job steps that use the PowerShell subsystem.", "Information for job steps that use the QueueReader subsystem.", "Information for job steps that use the Snapshot subsystem.", "Information for job steps that execute Transact-SQL."]], "pageTitle": "SQL Server Agent, JobSteps Object", "title": "", "url": "https://technet.microsoft.com/en-us/library/ms180921(v=sql.105).aspx", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 1, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988311.72/warc/CC-MAIN-20150728002308-00113-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 898877333, "recordOffset": 898861389, "tableOrientation": "HORIZONTAL", "textBeforeTable": "The table below contains the SQLAgent:JobSteps counters. The SQL Server Agent JobSteps performance object contains performance counters that report information about SQL Server Agent job steps. The table below lists the counters that this object contains. SQL Server 2016 SQL Server 2005 SQL Server 2008 SQL Server 2012 SQL Server 2014 Other Versions SQL Server 2008 R2 SQL Server Agent, JobSteps Object SQL Server, Workload Group Stats Object SQL Server, Wait Statistics Object SQL Server, User Settable Object SQL Server, Transactions Object SQL Server,", "textAfterTable": "LogReader Information for job steps that use the LogReader subsystem. Merge Information for job steps that use the Merge subsystem. PowerShell Information for job steps that use the PowerShell subsystem. QueueReader Information for job steps that use the QueueReader subsystem. Snapshot Information for job steps that use the Snapshot subsystem. TSQL Information for job steps that execute Transact-SQL. See Also Concepts Creating Job Steps Using Performance Objects Other Resources Monitoring Resource Usage (System Monitor) Was this page helpful? Yes No Not accurate Not enough depth Need more code examples Tell us more... (1500 characters", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}