{"relation": [["Number", "1.", "2.", "3.", "4.", "5.", "6.", "7.", "8.", ""], ["Accomplishment", "Internships", "Working a job during college", "Your college major", "Volunteer experience", "Extracurricular activities", "How relevant were your classes", "Your college GPA", "Your college's prestige", ""], ["% in Importance", "23", "21", "13", "12", "12", "8", "8", "5", ""]], "pageTitle": "Alliant Blog | Resumes that win jobs for recent college grads", "title": "", "url": "http://www.alliantcreditunion.org/blog/entry/2014/07/resumes-that-win-jobs-for-recent-college-grads", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990445.44/warc/CC-MAIN-20150728002310-00064-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 289047839, "recordOffset": 289039637, "tableOrientation": "HORIZONTAL", "lastModified": "Tue, 04 Aug 2015 05:21:33 GMT", "textBeforeTable": "Employers are usually bombarded by resumes for open jobs. If you’re a recent college grad, your odds of scoring an interview are increased when you rank high in these attributes (on a scale of 1 to 100). Note: your work track record trumps the list despite the old catch-22 adage that “you can’t get the job without the experience and you can’t get experience without the job.” These accomplishments will help make your resume gain positive attention: Resumes that win jobs for recent college grads", "textAfterTable": "    July 1, 2014 by Paul Brucker Source: Chronicle of Higher Education Survey of Employers Categories Career & Education For Millennials: How to balance retirement planning with your other financial goals Meet Alliant’s 2014 National Education Program winners Three types of “good” debt 2014 Members Scholarship winners Resumes that win jobs for recent college grads More posts tagged Career & Education» Newsletters Boost your savings or reduce your debt by an entire paycheck – painlessly! Traveling to Portugal? Make the most of your money Helping women pursue their unique retirement needs How to make a staycation feel like a vacation The allure of the suburbs for millennials More posts in Members Circle » 800-328-1935 | ABA", "hasKeyColumn": true, "keyColumnIndex": 1, "headerRowIndex": 0}