{"relation": [["Valuation", "Price/Earnings", "Price/Sales", "Price/Book", "Price/Cash Flow", "TEV/Sales"], ["RTEX", "6.3x", "0.5x", "0.2x", "3.9x", "NM"], ["Industry Range", "", "", "", "", "Not Meaningful"]], "pageTitle": "R T EXPORTS LTD (RTEX:Mumbai): Stock Quote & Company Profile - Businessweek", "title": "", "url": "http://www.bloomberg.com/research/stocks/snapshot/snapshot.asp?ticker=RTEX:IN", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 3, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989443.69/warc/CC-MAIN-20150728002309-00085-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 325428571, "recordOffset": 325406062, "tableOrientation": "HORIZONTAL", "TableContextTimeStampBeforeTable": "{36533=+1 212 318 2000, 36201=+65 6212 1000}", "TableContextTimeStampAfterTable": "{7262=RT Exports Ltd., Board Meeting, May 22, 2015. Agenda: To approve auditors of the company., 9395=RT Exports Ltd. reported unaudited standalone earnings results for the third quarter and nine months ended December 31, 2014. For the quarter, the company reported total income from operations of INR 3.515 million compared to INR 12.416 million a year ago. Loss from operations before other income, finance costs and exceptional items was INR 1.003 million compared to profit from operations before other income, finance costs and exceptional items of INR 3.267 million a year ago. Loss from ordinary activities before tax was INR 0.439 million compared to profit from ordinary activities before tax of INR 2.392 million a year ago. Net loss for the period was INR 0.439 million or INR 0.10 per basic and diluted share before and after extraordinary items compared to net profit for the period of INR 2.392 million or INR 0.55 per basic and diluted share before and after extraordinary items a year ago. For the nine months, the company reported total income from operations of INR 19.665 million compared to INR 28.393 million a year ago. Profit from operations before other income, finance costs and exceptional items was INR 3.502 million compared to loss from operations before other income, finance costs and exceptional items of INR 10.820 million a year ago. Loss from ordinary activities before tax was INR 3.302 million compared to profit from ordinary activities before tax of INR 7.864 million a year ago. Net loss for the period was INR 0.142 million or INR 0.03 per basic and diluted share before and after extraordinary items compared to net profit for the period of INR 6.864 million or INR 1.57 per basic and diluted share before and after extraordinary items a year ago., 4800=R.T. Exports Limited trades in agricultural commodities products in India and internationally. The company operates through Agro; Business of Handling, Storage and transportation; Services; and Rent segments. Its agricultural commodities products comprise rice, rajgira, etc. The company also exports bundi rice under the White Pearl brand name; and Indian basmati rice and other agri products to the United States, the United Kingdom, European countries, Saudi Arabia, Kuwait, the United Arab Emirates, etc. In addition, it offers handling, storage, and transportation services for food grains; and rental services. The company was incorporated in 1980 and is based in Mumbai, India., 7746=RT Exports Ltd. reported audited standalone earnings results for the fourth quarter and year ended March 31, 2015. For the quarter, the company reported net sales/income from operation of INR 62.059 million compared to INR 21.321 million a year ago. Profit from operation before other income, financial costs and exceptional items was INR 9.267 million compared to loss of INR 7.698 million a year ago. Profit from ordinary activities before tax was INR 4.569 million against loss of INR 7.078 million a year ago. Net profit for the period was INR 6.479 million or INR 1.49 per basic and diluted share, compared to loss of INR 6.723 million or INR 1.54 per basic and diluted share a year ago. For the year, the company reported net sales/income from operation of INR 81.724 million compared to INR 49.714 million a year ago. Profit from operation before other income, financial costs and exceptional items was INR 5.765 million compared to INR 3.122 million a year ago. Profit from ordinary activities before tax was INR 1.267 million against INR 0.786 million a year ago. Net profit for the period was INR 6.437 million or INR 1.48 per basic and diluted share, compared to INR 0.141 million or INR 0.03 per basic and diluted share a year ago.}", "textBeforeTable": "Industry Average RTEX Industry Analysis   // ]]> } document.write(BW_adsys('Right3')); if (window.BW_adsys) { // <script type=\"text/javascript\"> <div class=\"\" style=\"width:300px; margin: auto; \"> <div class=\"ad\"> </div> </table> </tbody> </tr> <td class=\"noDataRR\" style=\"border:none;\" colspan=\"3\"><a class=\"link_xs\" href=\"../../sectorandindustry/industries/industrydetail.asp?code=301010\">View Industry Companies</a></td> <tr> </tr> <td colspan=\"4\" align=\"center\">No competitor information is available for RTEX.</td> <tr> <tbody> </thead> </tr> <td width=\"50\" align=\"right\">Change</td> <td width=\"75\" align=\"right\">Last</td> <td>Company</td> <tr> <thead> <table class=\"colRight\" width=\"100%\" cellpadding=\"0\" cellspacing=\"0\"> <div class=\"clear\"></div> </div> <p class=\"note fLeft\" style=\"width:64%; text-align: right; padding: 5px 0; border-top: 3px solid #6B7B84; margin-top: 20px;\">Market data is delayed at least 15 minutes.</p> <h2 class=\"sectionTitle fLeft\" style=\"width: 35%; border-bottom: 0;\">RTEX Competitors</h2> <div style=\"border-bottom: 1px solid #ccc; overflow: hidden;\"> <div class=\"\"> </div> </table> </tbody> </tr> <td width=\"75\" align=\"right\" class=\"noBorder\"><img src=\"/cgi-bin/upload.dll/file.png?z02ae0f0az720a59e10b0a4dd981f2dde3f15359e5\" width=\"60\" height=\"15\" galleryimg=\"no\" symbol=\"IN;512565\" /></td> <td align=\"right\" width=\"45\" class=\"noBorder\"><span class=\"negData\">-0.50</span></td> <td align=\"right\" class=\"noBorder\">9.50 <span class=\"xSmGreyTxt\">INR</span></td> <td scope=\"row\"> <a class=\"link_xsb\" style=\"text-align:left\" target=\"_top\" href=\"../../stocks/snapshot/snapshot.asp?ticker=RTEX:IN\"> RTEX:IN </a> </td> <tr class=\"lastRow\"> <tbody> </thead> </tr> <td colspan=\"4\">Recently Viewed</td> <tr> <thead> <table class=\"miniTable\" summary=\"Recently viewed\"> </form> </fieldset> <a style=\"font-size:11px;\" target=\"_top\" href=\"../../common/symbollookup/symbollookup.asp\">Company Lookup</a> <input type=\"image\" name=\"submit\" src=\"http://images.businessweek.com/gen/buttons/stock_go_btn.gif\" align=\"absmiddle\" /> <input type=\"text\" id=\"lookupSymbol\" class=\"symbol\" autocomplete=\"off\" name=\"symbol\" value=\"Stock, Fund, or ETF\" onfocus=\"if(this.value == 'Stock, Fund, or ETF') this.value = '';\" onblur=\"if(this.value ==", "textAfterTable": "View Detailed RTEX Financials  |  View Sector Analysis Sponsored Financial Commentaries Sponsored Links Browse Companies A B C D E F G H I J K L M N O P Q R S T U V W X Y Z  |  0 1 2 3 4 5 6 7 8 9 Report Data Issue To contact R T EXPORTS LTD, please visit www.rtexports.com. Company data is provided by Capital IQ. Please use this form to report any data issues. Information Missing - Please enter your information in the following field(s): Company Name Your Name* Your E-Mail Address*", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}