{"relation": [["Patient Ratings", "Ease of Appointment", "Promptness", "Courteous Staff", "Accurate Diagnosis", "Bedside Manner", "Spends Time with Me", "Follows Up After Visit"], ["", "2.3", "2.3", "2.3", "1.0", "1.9", "1.0", "1.9"]], "pageTitle": "Dr. David Durand, DO - Family Practitioner in Lincoln, NE", "title": "", "url": "http://www.vitals.com/doctors/Dr_David_R_Durand.html", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989142.82/warc/CC-MAIN-20150728002309-00044-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 824839363, "recordOffset": 824812116, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{32801=Copyright © 2015 Vitals. US Patent No. 8, 694, 441. All Rights Reserved.}", "lastModified": "Wed, 29 Jul 2015 15:28:45 GMT", "textBeforeTable": "The overall average patient rating of Dr. David Durand is Below Average. Dr. Durand has been reviewed by 3 patients who have provided 1 comments. The rating is 1.5 out of 5 stars. (1) Patient comments (3)   1.5 Read patient reviews Patient Reviews View full profile Insurance accepted Map & directions (2) Address & phone number (2) Areas of expertise What's important to you Awards & distinctions Patient reviews Medical school rankings Hospital details & ratings (3) Qualifications View the full profile to get information on: Learn more about Dr. David Durand: A medical license is required for a doctor to practice medicine in a particular state. Requirements vary by state but most require, at a minimum, post-graduate training in the doctor’s specific specialty. An NPI number is a national identifier unique to an individual health care provider and is managed by the Center for Medicare & Medicaid Services (CMS). License & Identifications }); window.app.advert.display('skyscraper'); window.advert_queue.push(function()", "textAfterTable": "Prepare before visiting Dr. Durand Sinusitis Patient Education Read our sinusitis patient education guide to learn all about acute and chronic sinus conditions and treatment options. Before Visiting Dr. Durand Learn More More Patient Guides & Topics Binge-Eating Disorder Birth Control Diabetes Diabetic Macular Edema Eating Disorders Food Allergies GERD Gout Home Allergies Influenza Insomnia Intrauterine Devices (IUD) Lyme Disease Menopause Restless Leg Syndrome Seasonal Allergies Smoking", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}