{"relation": [["Primer Name", "1.5: −94", "2.5: −215", "3.5: −190", "4.5: 35", "5.5':253", "6.C:785", "7.C:477", "8.C: 219", "9.C:482", "10.C:980", "11.C:1469"], ["Sequence 5'3'", "CCA TAT TCA CGC AAC TGA T", "CTA CGA GAT CAC CTT CAC G", "CTG AGC CTT TAC GAG CAG G", "GCA GGT TTA CTG CTT TC", "CTGAGCCTTTACGAGCAGG", "TCA GAA TTA CTG AGC TAC", "GGA ACG AAG CGC TTC ATC GA", "GCT TGG GGA TCC TGA ATC", "GAG ATG CTG TTT CCC ACA AC", "ATA GAG AGT CCC AAT ATC C", "GCT GTC ACT AGA ACG GAC C"]], "pageTitle": "1. Introduction", "title": "", "url": "http://www.mdpi.com/2218-273X/2/2/228/xml", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987866.61/warc/CC-MAIN-20150728002307-00106-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 570870463, "recordOffset": 570849391, "tableOrientation": "HORIZONTAL", "TableContextTimeStampBeforeTable": "{15504=DNA distances among Triticum and Aegilops species (1000 trials). Distance Matrix was calculated using the Jukes-Cantor correction method. Base positions 123 in the codon and gap weighting 0.0 were used.}", "lastModified": "Wed, 13 May 2015 16:38:10 GMT", "textBeforeTable": "sequence using PCR. Primers with bold face font gave common positive PCR results with all tested species. orf256 Nucleotide sequence of primers that were used to detect the Table 1 biomolecules-02-00228-t001_Table 1 ]. 24 ) were designed on the sequence of orf256 gene to cover different parts of the gene [ Table 1 Various specific primers ( 2.1. DNA Primer 2. Experimental Section species and their evolutionary changes. Aegilops and Triticum species. These molecular characteristics of orf256 suggest that this is a rapidly changing gene and make it a suitable molecular handle for evolutionary studies. In this study, orf256 was used as a molecular tool to establish a DNA fingerprint and phylogenetic relationship among Aegilops and Triticum , and the presence of a related sequence in rice, (3) the specific transcriptional and translational characteristics of orf256 depending on the source of the nucleus and the relationship to cytoplasmic male sterility, and (4) the lack of a known function for orf256. This gives a good opportunity to follow changes in its sequence, its location, its rearrangement, and its presence or absence in T. temopheevii , its presence in T. aestivum , (2) the absence of orf256 in the mitochondrial DNA of T. aestivum and T. temopheevii Previous studies on orf256 showed some interesting features including (1) the close evolutionary history of . Aegilops", "textAfterTable": "2.2. Growth of Wheat Shoots Wheat seeds were surface sterilized [ 13 , 25 ]. About 20 g of clean wheat seeds were soaked for 20 hr in 100 mL of 10 ppm ampicillin (Sigma) solution. The antibiotic solution was drained off and 100 mL of 0.1% silver nitrate (w/v) was added. Seeds were shaken vigorously for 10 min, and the silver nitrate solution was replaced with 100 mL of 0.5% of NaCl solution. After 10 min of vigorous shaking, seeds were rinsed three times with sterile, deionized water. Sterilized seeds were spread on 0.1% water agar in a sterilized plastic container and kept in the dark for 7–10 days at room temperature. Shoots were harvested and used directly for mitochondrial isolation or freeze dried for genomic DNA isolation. 2.3. Freeze drying of Wheat Shoots 10-day-old shoots were freeze dried in (Alpha 1–2 LO plus Christ, Vacuubrand, Germany). Dried shoots were ground in a coffee grinder to fine powder and used for DNA isolation. 2.4. Isolation of Mitochondria Wheat mitochondria were isolated according to Song and Hedgcoth [ 26 ]. Mitochondrial pellets were stored at −20 °C. 2.5. Isolation of DNA DNA was isolated from 10-day-old wheat shoots and or wheat mitochondria of Triticum and Aegilops species ( Table 2 ). DNA was isolated using plant DNA isolation kit (Qiagen, California, USA) following manufacturer", "hasKeyColumn": true, "keyColumnIndex": 1, "headerRowIndex": 0}