{"relation": [["Stratum", "Blocks in large sampling entities (SEMOS >1,200) and large tracts", "Blocks in large sampling entities (SEMOS >1,200) and small tracts", "Blocks in small sampling entities", "Blocks in smaller sampling entities", "Blocks in smallest sampling entities"], ["Smallest Entity Measure of Size (SEMOS) and Tract Measure of Size (TMOS)", "TMOS >2,000", "TMOS ≤2,000", "800 ≤SEMOS ≤1,200", "200 ≤SEMOS", "SEMOS"]], "pageTitle": "Chapter 4. Sample Design and Selection - Design and Methodology: American Community Survey - Survey ACS 2010 (1-Year Estimates) - Social Explorer", "title": "", "url": "http://www.socialexplorer.com/data/ACS2010/documentation/dd1c4f59-e1b1-49e0-9b71-34b3b9c1972b", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 2, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986451.45/warc/CC-MAIN-20150728002306-00156-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 709218591, "recordOffset": 709197507, "tableOrientation": "HORIZONTAL", "textBeforeTable": "Sampling Strata Thresholds for the ACS/PRCS Table 4.1 7AINSA is a general term used to describe American Indian and Alaska Native Village statistical areas. For detailed technical information on the Census Bureau's American Indian and Alaska Native Areas Geographic Program for Census 2000, see Federal Register Notice Vol. 65, No. 121, June 22, 2000. 6The 12 states are considered \"strong\" MCD states and are: Connecticut, Maine, Massachusetts, Michigan, Minnesota, New Hampshire, New Jersey, New York, Pennsylvania, Rhode Island, Vermont, and Wisconsin. 5Functioning governments have elected officials who can provide services and raise revenue. Footnotes: If the SEMOS is greater than or equal to 1,200, the stratum assignment for the block is based on the MOS for the census tract that contains it. The MOS for each tract (TMOS) is obtained by summing the estimated number of occupied HUs across all of its blocks. Using SEMOS and TMOS, blocks are assigned to the five strata as defined in Table 4.1 below. These strata are consistent with the sampling categories used in Census 2000 except for the category for sampling entities with MOS less than 800, which has been split into two categories for ACS. 7) and Tribal Subdivisions, the estimated number of occupied HUs is also multiplied by the proportion of its population that responded as American Indian or Alaska Native (either alone or in combination) in Census", "textAfterTable": "The figure shows a census block that is in City A and is also contained in School District 1. Therefore, it is contained wholly in three sampling entities: County (not shown). Place with active and functioning government-City A. School district. FIGURE 4.2: ASSIGNMENT OF BLOCKS (AND THEIR ADDRESSES) TO SECOND-STAGE SAMPLING STRATA (Note that the land area of a sampling entity does not necessarily correlate to its MOS) Example 1: Suppose the MOS for City A is 600 and the MOS for School District 1 is 1,100. Then the SEMOS for the census block is 600 and it is placed in the 200 ≤SEMOS ≤800 stratum. Example 2: Suppose the MOS for City A is 1,300 and the MOS for School District 1 is 1,400, then the SEMOS for the block is 1,300. Since the SEMOS for the block is greater than 1,200, the block will be assigned to one of the two strata with SEMOS >1,200 depending on the size of the census tract (TMOS-not shown in the diagram). In this example, suppose the TMOS is 1,800, then the census block will be placed in the 1,200 Determining the Sampling Rates back to top", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}