{"relation": [["gucci size", "16", "17", "18", "19", "20", "21", "22", "23", "24", "25", "26", "27", "28", "29", "30", "31", "32", "33"], ["length (mm)", "100", "106", "112", "118", "120", "127", "133", "140", "147", "153", "160", "167", "173", "180", "187", "193", "200", "207"]], "pageTitle": "Gucci - kids white leather horsebit loafer 340745BLN009014", "title": "", "url": "http://www.gucci.com/no/styles/340745BLN009014", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988305.14/warc/CC-MAIN-20150728002308-00227-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 477273711, "recordOffset": 477240631, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{33430=Generelle Betingelser for Salg Oppdatert 27. Januar 2012, 36475=Kunder oppfordres til å lese disse Generelle Betingelsene som er tilgjengelige på Websiden nøye for å kunne akseptere, lagre og gjenskape dem i samsvar med E-handelsloven, 23. Mai 2005, nr. 35 (“Implementasjon av Directive 2000/31/EC on certain legal aspects of information society services, in particular electronic commerce, in the Internal Market – heretter “E-handelsloven”). En kopi av disse Generelle Betingelsene sendes under enhver omstendighet til Kunden via e-post, som nærmere beskrevet i disse Generelle Betingelsene paragraf 7. Kontraktene som inngås med Kunder vil arkiveres av Gucci, og være tilgjengelige for Kunden via Kundens konto på Websiden., 5989=Clients are required to carefully read the General Conditions, which have been made available on the Website to enable Clients to acknowledge, store and reproduce them pursuant to Norwegian Ecommerce Act of 23 May 2005, No. 35(“Implementation of Directive 2000/31/EC on certain legal aspects of information society services, in particular electronic commerce, in the Internal Market – hereinafter,“Ecommerce Act”).A copy of the General Conditions shall in any case be sent to the Client by email, as set out in Paragraph 7 of these General Conditions. Contracts with the Clients will be archived by Gucci with access for the Clients via the Website through their account., 2927=General Conditions of Sale Updated to January 27 2012}", "textBeforeTable": "to determine your child's shoe size, measure the length of the foot while standing. children's shoe size guide Size guide Please select a size 340745 BLN00 9014 GUCCI.Product.initMobileScroll(); }); } catch(e) {}", "textAfterTable": "add to wish list Add to shopping bag Purchase information English | Norwegian General Conditions of Sale Updated to January 27 2012 1. General provisions 2. Identification of the vendor 3. Information on Products and their availability 4. Price 5. Purchases 6. Method of payment 7. Conclusion of the contract 8. Invalidity of the order proposal 9. Transport and delivery 10. Dispatching and delivery confirmation 11. Wrapping or packaging 12. Personalised Products 13. Right of withdrawal and cancellation of orders 14. Replacement of Products 15. Lack of conformity 16. Errors or inaccuracies 17. Guarantee of authenticity and intellectual property rights 18. Applicable law and competent jurisdiction 19. Contacts", "hasKeyColumn": false, "keyColumnIndex": -1, "headerRowIndex": 0}