{"relation": [["Length", "3", "4", "5", "6", "7"], ["Bonus Points", "0", "5", "10", "25", "50"]], "pageTitle": "GSN Cash Games", "title": "", "url": "https://www.worldwinner.com/cgi/rules/index.html?g=scrabblecubes&amp;game_id=35", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 1, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989018.40/warc/CC-MAIN-20150728002309-00197-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 929718108, "recordOffset": 929709906, "tableOrientation": "HORIZONTAL", "TableContextTimeStampBeforeTable": "{2429=The game has a time limit (usually four minutes) displayed at the top of the game screen. The clock always displays the time remaining. When the clock reaches 0:00, the game ends. There is no time bonus in SCRABBLE Cubes, so there is no reason not to use up every second.}", "TableContextTimeStampAfterTable": "{6907=© 1999-2015 GSN Games, Inc.}", "textBeforeTable": "After the above points have been calculated, an additional bonus is awarded for each word based on its length. The bonus increases with each additional letter: Letter bonuses are always calculated before word bonus multipliers. \"Double Word\" and \"Triple Word\" bonuses are not multiplied together if more than one is used. In that case, only the higher multiplier will be applied. Using a letter on a \"Double Letter\" bonus cube will award double the value of the letter, and using a letter on a \"Triple Letter\" bonus cube will triple the value of the letter. Using a letter on a \"Double Word\" or \"Triple Word\" bonus cube will double or triple the cumulative value of the word, respectively. 10 4 8 4 4 1 1 1 1 10 3 1 1 3 1 5 8 1 4 2 4 1 2 3 3 1 Value Z Y X W V U T S R Q P O N M L K J I H G F E D C B A Letter Points are awarded for each legal word made. Individual tiles have the following point value per tile: Game Scoring You may", "textAfterTable": "Game Strategy You get a lot more points for longer words; try to spot those six- and seven-letter words before making shorter words. Making a lot of three-letter words will use up your cubes without giving you as many points. Look for things that can lengthen your words: the letter S to form plurals; endings such as ER, ED, and ING; or prefixes such as RE and UN. Try to make use of the most valuable letters on the \"Double Letter\" and \"Triple Letter\" bonus cubes, and try to save \"Double Word\" and \"Triple Word\" bonuses for the most valuable words you can form. Using the two types of bonus cubes together can result in some particularly high-scoring words. Try to use up cubes on the near side of the pile first. This will allow you access to more letters, whereas using up letters at the back of the pile will create \"holes\" in the cube that will make forming words more difficult. Don't wantonly remove cubes manually - you might find yourself with all your cubes gone, but plenty of time left. On the other hand, don't be afraid to manually remove a cube if you're having trouble finding words. Did You Know? The game SCRABBLE was created in 1938 by an architect named Alfred Mosher Butts. At that time the game was known as Criss-Crosswords. In 1948, the rights to Criss-Crosswords were purchased", "hasKeyColumn": false, "keyColumnIndex": -1, "headerRowIndex": 0}