{"relation": [["dct:abstract", "dct:accessRights", "dct:accrualMethod", "dct:accrualPeriodicity", "dct:accrualPolicy", "dct:alternative", "dct:audience", "dct:available", "dct:bibliographicCitation", "dct:conformsTo", "dct:coverage", "dct:description", "dct:educationLevel", "dct:extent", "dct:format", "dct:hasPart", "dct:identifier", "dct:instructionalMethod", "dct:isPartOf", "dct:isRequiredBy", "dct:language", "dct:license", "dct:mediator", "dct:medium", "dct:rights", "dct:relation", "dct:requires", "dct:spatial", "dct:subject", "dct:tableOfContents", "dct:temporal", "dct:title", "dct:type", "dct:valid"], ["Descriptive metadata", "Provenance: How", "Descriptive Metadata", "Descriptive metadata", "Descriptive metadata", "Descriptive metadata", "Descriptive metadata", "Provenance: When", "Descriptive metadata", "Descriptive metadata", "Descriptive metadata", "Descriptive metadata", "Descriptive metadata", "Descriptive metadata", "Descriptive metadata", "Descriptive metadata", "Descriptive metadata", "Descriptive metadata", "Descriptive metadata", "Descriptive metadata", "Descriptive metadata", "Provenance: How", "Descriptive metadata", "Descriptive metadata", "Provenance: How", "Descriptive metadata", "Descriptive metadata", "Descriptive metadata", "Descriptive metadata", "Descriptive metadata", "Descriptive metadata", "Descriptive metadata", "Descriptive metadata", "Provenance: When"], ["Summary of the resource. Thus, not part of its provenance.", "Agents who can access the resource (security status). Since the privileges of the resource are part of the description of the resource, the property has been excluded from the mapping.", "Method by which items are added to a collection. Since this term does not describe the activity or the entities participating on the activity (just the plan followed), it is out of the scope of the mapping.", "Frequency of the addition of items to a collection.", "Policy associated with the insertion of items to a collection. It could be used to enrich the qualified involvement, but there is no direct mapping of this relationship.", "Refers to an alternative title of the resource. For example \"The Bible\" might be also known as \"The Holy Book\". Titles are not identifiers, so this property cannot be mapped to prov:alternateOf.", "The audience for whom the resource is useful.", "Property that states when a resource is available. There is no direct mapping between this property and the PROV notions of generation and invalidation.", "Property that relates the literal representing the bibliographic citation of the resource to the actual resource (e.g., :el_Quijote dct:bibliographicCitation \"Miguel de Cervantes Saavedra: El Quijote, España\").", "Indicates the standard to which the resource conforms to (if any).", "Topic of the resource.", "An account of the resource.", "The educational level of the audience for which the resource is intended.", "Size or duration of the resource.", "Format of the resource.", "A resource that is included in the current resource. Since entity composition is out of the scope of PROV, this property has been excluded from the mapping", "\"An unambiguous reference to the resource within a given context.\"", "\"A process, used to engender knowledge, attitudes and skills, that the described resource is designed to support\".", "Inverse of dct:hasPart.", "Property used to describe that the current resource is required for supporting the function of another resource. This is not related to the provenance of the resource, since it refers to something that may not have happened yet (e.g., a programming scripts' dependency on another dependency).", "Language of the resource.", "License of the resource. It has been left out of the mapping because there is no term in PROV-O to represent this information.", "Entity that mediates access to the resource.", "Material of the resource.", "Metadata about the rights of the resource.", "Term used to identify \"A related resource\", which might not be related to the provenance of the described resource.", "Inverse property of dct:isRequiredBy (see dct:isRequiredBy).", "Spatial characteristics of the content of the resource (e.g., the book is about Spain). Thus it cannot be mapped to prov:hadLocation.", "Subject of the resource.", "List of subunits of the resource.", "Temporal characteristics of which the resource refers to (e.g., a book about 15th century).", "Title of the resource.", "Type of the resource.", "\"Date (often a range) of validity of a resource.\" This property could correspond to PROV's generation and invalidation of the resource or one of its specializations. However, dct:valid can be used to set expiry dates (e.g., resource valid until 2015), which is not provenance (it is not about past events). Thus this property is left out of the mapping."]], "pageTitle": "Dublin Core to PROV Mapping", "title": "Table 9: List of properties excluded from the mapping", "url": "http://www.w3.org/TR/2013/NOTE-prov-dc-20130430/", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 8, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042991076.30/warc/CC-MAIN-20150728002311-00019-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 820155403, "recordOffset": 820119336, "tableOrientation": "HORIZONTAL", "TableContextTimeStampBeforeTable": "{76207=This document was produced by a group operating under the 5 February 2004 W3C Patent Policy. W3C maintains a public list of any patent disclosures made in connection with the deliverables of the group; that page also includes instructions for disclosing a patent. An individual who has actual knowledge of a patent which the individual believes contains Essential Claim(s) must disclose the information in accordance with section 6 of the W3C Patent Policy., 86222=Copyright © 2013 W3C® (MIT, ERCIM, Keio, Beihang), All Rights Reserved. W3C liability, trademark and document use rules apply., 70511=The Dublin Core Metadata Initiative (DCMI) [DCMI] provides a core metadata vocabulary (commonly referred to as Dublin Core) for simple and generic resource descriptions [DCTERMS]. The original Dublin Core Metadata Element Set was created in 1995 and contains fifteen broadly defined properties that are still in use. Properties identified using the original namespace URI http://purl.org/dc/elements/1.1/ have no specified ranges, meaning that arbitrary values can be used as objects. In order to assign ranges, DCMI replicated the fifteen properties using the namespace URI http://purl.org/dc/terms/. Additional properties and classes beyond the original fifteen were coined using this namespace URI. In this document, properties and classes using the /terms/ namespace URI are referred to, simply, as DC Terms.}", "TableContextTimeStampAfterTable": "{16206=We would also like to acknowledge Schloss Dagstuhl - Leibniz Center for Informatics, because significant progress was made on this document at Dagstuhl Seminar 12091 (Principles of Provenance) that took place from February 26 to March 2, 2012., 16576=Members of the Provenance Working Group at the time of publication of this document were: Ilkay Altintas (Invited expert), Reza B'Far (Oracle Corporation), Khalid Belhajjame (University of Manchester), James Cheney (University of Edinburgh, School of Informatics), Sam Coppens (iMinds - Ghent University), David Corsar (University of Aberdeen, Computing Science), Stephen Cresswell (The National Archives), Tom De Nies (iMinds - Ghent University), Helena Deus (DERI Galway at the National University of Ireland, Galway, Ireland), Simon Dobson (Invited expert), Martin Doerr (Foundation for Research and Technology - Hellas(FORTH)), Kai Eckert (Invited expert), Jean-Pierre EVAIN (European Broadcasting Union, EBU-UER), James Frew (Invited expert), Irini Fundulaki (Foundation for Research and Technology - Hellas(FORTH)), Daniel Garijo (Ontology Engineering Group, Universidad Politécnica de Madrid), Yolanda Gil (Invited expert), Ryan Golden (Oracle Corporation), Paul Groth (Vrije Universiteit), Olaf Hartig (Invited expert), David Hau (National Cancer Institute, NCI), Sandro Hawke (W3C/MIT), Jörn Hees (German Research Center for Artificial Intelligence (DFKI) Gmbh), Ivan Herman, (W3C/ERCIM), Ralph Hodgson (TopQuadrant), Hook Hua (Invited expert), Trung Dong Huynh (University of Southampton), Graham Klyne (University of Oxford), Michael Lang (Revelytix, Inc.), Timothy Lebo (Rensselaer Polytechnic Institute), James McCusker (Rensselaer Polytechnic Institute), Deborah McGuinness (Rensselaer Polytechnic Institute), Simon Miles (Invited expert), Paolo Missier (School of Computing Science, Newcastle university), Luc Moreau (University of Southampton), James Myers (Rensselaer Polytechnic Institute), Vinh Nguyen (Wright State University), Edoardo Pignotti (University of Aberdeen, Computing Science), Paulo da Silva Pinheiro (Rensselaer Polytechnic Institute), Carl Reed (Open Geospatial Consortium), Adam Retter (Invited Expert), Christine Runnegar (Invited expert), Satya Sahoo (Invited expert), David Schaengold (Revelytix, Inc.), Daniel Schutzer (FSTC, Financial Services Technology Consortium), Yogesh Simmhan (Invited expert), Stian Soiland-Reyes (University of Manchester), Eric Stephan (Pacific Northwest National Laboratory), Linda Stewart (The National Archives), Ed Summers (Library of Congress), Maria Theodoridou (Foundation for Research and Technology - Hellas(FORTH)), Ted Thibodeau (OpenLink Software Inc.), Curt Tilmes (National Aeronautics and Space Administration), Craig Trim (IBM Corporation), Stephan Zednik (Rensselaer Polytechnic Institute), Jun Zhao (University of Oxford), Yuting Zhao (University of Aberdeen, Computing Science).}", "lastModified": "Thu, 25 Apr 2013 13:47:25 GMT", "textBeforeTable": "Table 9 and Table 10 list the properties and classes excluded from the mapping, either because they are not suitable or because they do not represent provenance information. Regarding the classes, it is important to note that when a class is found to be defined as the range of some DC property that does not describe the provenance of a resource (but its descriptive metadata), it has been left out of the mapping rather than adding it as a subclass of prov:Entity (e.g., dct:MediaType, dct:Standard). 3.5 List of terms excluded from the mapping Figure 4. Ordering activities to conflate blank nodes. The creation activity occurs before the publishing activity. Figure 4 shows a graphical example with two different activities (creation and publication) that happened at different points in time. Creation precedes publication, so instead of creating different blank nodes for their respective usage and generation, both activities share the same blank node (_:createdEntity). 2) Another solution is to sort all the activities according to their logical order, if known, and conflate the specialized entity (blank node) result of one activity with the specialized entity (blank node) input of the subsequent activity. Figure 3. Using complementing properties to conflate blank nodes. Dates are", "textAfterTable": "Table 10: List of classes excluded from the mapping DC Term Category Rationale dct:AgentClass Descriptive metadata Specialization of rdfs:Class to define classes or groups of Agents (like dct:Agent. None of the PROV classes are defined similarly, so it is our of the scope of the mapping. dct:FileFormat Descriptive metadata Format of a digital resource. This class is the range of dct:format and normally is associated to literals (such as \".doc\", \"jpg\", etc.). Therefore it is not part of this mapping. dct:Frequency Descriptive metadata Frequency to which items are added to a collection. dct:Jurisdiction Descriptive metadata Defined as \"The extent or range of judicial, law enforcement, or other authority.\" This class is used to describe a particular aspect of a resource for which the provenance is not further described. Therefore it is not part of this mapping. dct:MediaType Descriptive metadata File format or physical medium. This class is the range of dct:format and normally is associated to literals (such as \"paper\", \"PNG\", etc.). Therefore it is not part of this mapping. dct:MediaTypeOrExtent Descriptive metadata Superclass of dct:MediaType. This class is the range of dct:format and is normally associated to literals (such as \"paper\", \"PNG\", etc.). Therefore it is not part of this mapping. dct:PeriodOfTime Descriptive metadata Interval of time (start and end dates).", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}