{"relation": [["Search", "ebola", "ebola virus", "rolling circle", "how did viruses evolve", "mimivirus", "despair posters", "flaviviridae", "lassa fever", "bacterial dna replication", "ebola virus patients", "viroblogy", "where did viruses evolve from", "ebola pictures", "rift valley fever", "what did viruses evolve from", "geminivirus", "west nile virus structure", "ebola patient", "where h1n1 came from", "ebola virus pictures"], ["Views", "577", "64", "44", "29", "21", "19", "17", "14", "11", "11", "9", "9", "9", "9", "9", "8", "8", "8", "7", "7"]], "pageTitle": "rolling circle | ViroBlogy", "title": "", "url": "https://rybicki.wordpress.com/tag/rolling-circle/", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990217.27/warc/CC-MAIN-20150728002310-00276-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 899765871, "recordOffset": 899740473, "tableOrientation": "HORIZONTAL", "TableContextTimeStampBeforeTable": "{9257=Posted on November 21, 2007 Some news on the failure of the Merck Adenovirus 5-vectored HIV vaccine, 8711=Posted on November 10, 2007 Some microbiology-related poetry…., 41632=“Brazilian scientists roll out a transgenic pinto bean (Phaseolus vulgaris) engineered to fend off one of the crop’s most devastating enemies: the golden mosaic virus. Approved on 15 September by the Brazilian National Technical Commission on Biosafety (CTNBio), the transgenic bean uses RNA interference to shut down replication of the virus [reported originally in Mol Plant Microbe Interac in 2007].”, 5253=Posted on July 24, 2007 Exploring what it means to be “alive”, 6393=Posted on August 27, 2007 Musings on rolling circle replication in viruses, 7457=Posted on September 11, 2007 News of how a single virus is suspected in the causation of “colony collapse disorder” of bee hives in the USA, 5907=Posted on August 3, 2007 News on inferring “ancestor sequences” for HIV to help make broadly effective vaccines, 8105=Posted on September 14, 2007 Description of natural insertions of virus gene fragments into a variety of organisms and how they elicit pathogen-derived resistance, 6955=Posted on August 29, 2007 H5N1 highly pathogenic avian influenza virus mutates…, 38486=Geminiviruses are no exception: a number of papers have explored silencing suppression by geminiviruses, with a review by Dave Bisaro prominent among them.  Who is also famous for singing “Born to be Wild” in a Spanish karaoke bar in 1994 with a number of other geminivirologists, who called themselves “Subgroup IV” – but I digress., 4178=Posted on June 8, 2007 A personal history of teaching Virology via the Web., 9906=Posted on November 30, 2007 Description of a unique newly-described virus that looks like a chimaera of a papillomavirus and a polyomavirus, 4759=Posted on June 26, 2007 Musings on what viruses are., 10437=Posted on January 15, 2008 Review of a paper describing the receptor for the H5N1 HA protein, 13100=Updated 28th September 2011}", "TableContextTimeStampAfterTable": "{23215=I have been at UCT since I came to Cape Town on holiday from Zambia in 1974, and fell in love with the place. I obtained a BSc in Chemistry and Microbiology in 1976, an Hons in Virology in 1977, an MSc in Virology in 1979, and a PhD in the same discipline in 1984. I became a Lecturer in Virology in 1981, and have risen through the ranks to become a Professor in Microbiology (in January 2003). I am also a Founder Member of the Institute of Infectious Disease and Molecular Medicine (IIDMM) based in the Health Sciences Faculty.}", "textBeforeTable": "It is quite educational sometimes, to look and see what it is people are looking for, when they end up on ViroBlogy.  Here are the queries over the course of the last month: 18 April, 2011 What are you looking for? Tags:cell, DNA virus, Evolution, geminivirus, hepresvirus, poxvirus, RdRp, replicase, retrovirus, reverse transcription, RNA virus, RNA world, rolling circle, virus, virus origin Posted in Evolution, General, Viruses | Leave a Comment » Pathways on information flow for RNA viruses I have updated the blog on virus origins quite considerably – new pictures, more detail, more speculation! 28 September, 2011 Virus Origins II Tags:begomovirus, Brasil, Brazil, geminivirus, golden mosaic, post-transcriptional gene silencing, resistance, rolling circle,", "textAfterTable": "I count 6 mentions of Ebola, 4 of virus evolution generally…and a gratifyingly high number of queries on rolling circle replication, given our lab’s interest in it.  Of course, I have had long had an obsession with Ebola and similar nasties, and have been deeply interested in the evolution of viruses ever since I started studying them, so it is good to see others share my interests! So in the spirit of giving people what they want, look for blog posts with titles like “The evolution of viruses using rolling circle replication: its complete non-relevance to Ebola and H1N1 influenza viruses”.  But seriously – I will be putting up some more posts around the most popular subject areas, if only to help make sure that The Truth Gets Out There. Ed Rybicki Tags:Ebola, Evolution, H1N1, rolling circle Posted in Evolution, General, General Virology, Influenza viruses, Viruses | 3 Comments » Virus origins: from what did viruses evolve or how did they initially arise? 19 March, 2008 This was originally written as an Answer to a Question posted to Scientific American Online; however, as what they published was considerably shorter and simpler than what", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}