{"relation": [["GEL NAIL SERVICES", "Natural Overlay", "French Overlay", "Gel Extensions", "French Extensions", "Natural Fill", "French Fill", "Gel Pedicure", "Gel French Pedicure", "Nail Repair", "Nail Design", "Gel Nail Removal"], ["PRICE", "$55", "$62", "$70", "$77", "$50", "$55", "$70", "$77", "$7 ea.", "$3 ea.", "$20"]], "pageTitle": "Gel Nails - Aru Spa and Salon", "title": "", "url": "http://www.aruspa.com/services/gel-nails/", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989018.40/warc/CC-MAIN-20150728002309-00182-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 290895823, "recordOffset": 290830035, "tableOrientation": "HORIZONTAL", "lastModified": "Thu, 01 Jan 1970 00:00:00 GMT", "textBeforeTable": "Beautiful, Healthy, Natural-looking nails! Our gel nails are designed to be flexible and strong while imitating the shape and density of your natural nail. En Vogue Gel Nails system has worked to excel over other artificial nail systems, combining a weightless, natural look and feel with long-lasting resiliency. En Vogue Gel Nails are specifically designed to be odour free and and have zero toxic impact. The gel nails are completely non-porous, guaranteed to never yellow and always maintain their natural look. Gel Nails Gel Nails Gel Nails Service Home Page Services Contact Us Appointments Contact Us Now Hiring! Blog", "textAfterTable": "Make An Appointment OPI GelColor Polish OPI GelColor Polish is a great innovation in natural nail color in longer lasting formulation. OPI GelColor is a Gel mixture that dries in only 30 seconds under LED lights the newest technology in Gel Nails. The result is a high shine gel that goes on and cures thinner than any gel on the market. OPI Gel Color has a staying power that lasts 2 weeks and in some cases even longer. OPI Gel Polish is available in 30 different colors including their most popular! Why OPI GelColor Polish? OPI Gel Color Polish does not damage your nails like other Gels as there is no filing involved. It also adds an extra layer of strength to your nails. OPI GelColor Polish requires no upkeep. You will need to come in for a removal, as we don’t recommend taking it off at home, to avoid any damage to your nails. With OPI Gel Color Polish you also have the option of purchasing the matching nail polish color to touch up growth and extend the life of your Gels for an extra week! OPI GelColor® SERVICES PRICE Add OPI GelColor to a Manicure. $15 Add OPI GelColor to a Pedicure. $15", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}