{"relation": [["Ways of Transportation", "Subway Line 15", "Subway Transfer Tips", "Subway Line 10", "Subway Line 13", "Bus Line"], ["Traveling Guidance", "The subway line 15 can help you get to the China International Exhibition Center (New Venue); you can take subway line 15 from Wangjing West Station.", "You can enter the subway system from any entrance and transfer to line 15 at the Wangjing West Station to the China International Exhibition Center (New Venue)", "Shaoyaoju (transfer station)→Line 13→Wangjing West (transfer station) → Line 15→China International Exhibition Center", "Wangjing West (transfer station)→Line 15→China International Exhibition Center", "You can also take buses 915,915(2), 915(3), 916, 918, 923, 934, 936 from Dongzhimen, and get off at Maliandian or Hualikan station, and then walk to the New International Exhibition Center."]], "pageTitle": "＿Transportation_", "title": "", "url": "http://www.ciaacexpo.com/html/Transportation.html", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988840.31/warc/CC-MAIN-20150728002308-00192-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 377010433, "recordOffset": 377002231, "tableOrientation": "HORIZONTAL", "lastModified": "Thu, 23 Apr 2015 01:50:56 GMT", "textBeforeTable": "  Add: 88 Yuxiang Rd., Tianzhu Zone, Shunyi Dist., Beijing 101318, P. R. China Venue: China International Exhibition Center (New Venue) In order to ensure the international visitors and exhibitors getting to the New International Exhibition Center successfully, the organization committee has arranged some suitable transportation routes. Please read the following transportation tips carefully and choose the most convenient ways for the transportation.    Transportation Home > Travel Guide > Transportation Hotels Restaurants Transportation Travel Guide YASN In News", "textAfterTable": "Subway-taking Tips： The China International Exhibition Center (New Venue) is located in the Shunyi District in Beijing. Just 15 minutes taking subway line 15 will reach the event venue from the downtown. Beijing Subway Map (Click in large) About Us | Contact Us | Travel Guide | Join Us | Links     27F, Tower A, North Ring Center, 18 Yumin Rd., Xicheng Dist., Beijing 100029, P.R. China Tel: +86-10-5797-0888 | Fax: +86-10-5797-0999 | Email: info@yasn.com.cn Copyright 2008 YASN International Exhibition Co., Ltd. All rights reserved.", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}