{"relation": [["Training", "Internal medicine training (Direct patient responsibility 20 months)", "Research training (80%)", "Ambulatory clinics during research training (10%)", "Additional clinical training during research (10%)", "Total training", "Internal Medicine examination"], ["Duration", "24 months", "36 months", "1/2 day per week", "May be intermittent or block time", "5 years", "Summer, R-5"]], "pageTitle": "Research Pathway Policies & Requirements | Become Certified by ABIM | American Board of Internal Medicine", "title": "Internal Medicine Research Pathway", "url": "http://www.abim.org/certification/policies/research-pathway-policies-requirements.aspx", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042982745.46/warc/CC-MAIN-20150728002302-00109-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 277076322, "recordOffset": 277060724, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{19717=© 2004 - 2015 American Board of Internal Medicine. All rights reserved. | The ABIM logo is a registered trademark of the American Board of Internal Medicine.}", "textBeforeTable": "The ABIM Certification examination and ABIM certificate are the same for all ABIM candidates whether they pursue the research pathway or standard internal medicine training. Trainees in the subspecialty research pathway must be certified in internal medicine at the time of application to be eligible to apply for Certification in a subspecialty. Subspecialty research trainees may be admitted to the Certification examination in internal medicine in the summer of PGY-4, as long as two required years of accredited training in internal medicine and one year of accredited subspecialty training have been completed satisfactorily. Trainees in the internal medicine research pathway may be admitted to the Certification examination in internal medicine in the summer of PGY- 5 after successful completion of four years of training, which must include 24 months of accredited training in internal medicine and 24 months of research training. Documentation that the resident will be in full-time residency training or in a position with 80 percent involvement in mentored research during PGY-5 will be required at the time of application. Certification Examination in Internal Medicine Examinations Top Ratings of satisfactory clinical performance must be maintained annually for each trainee in the ABIM Research Pathway. Time spent in continuity outpatient clinic during non-clinical training is in addition to the requirement for full-time clinical training. During subspecialty research training, at least one-half day per week must be spent in an ambulatory clinic. During internal medicine research training, 20 percent of each year must be spent in", "textAfterTable": "Certification Examination in a Subspecialty A subspecialty examination may be taken in the fall of PGY-6 (adolescent medicine; allergy and immunology; critical care medicine; endocrinology, diabetes, and metabolism; geriatric medicine; hematology; hospice and palliative medicine; infectious disease; nephrology; medical oncology; pulmonary disease; rheumatology; sleep medicine or sports medicine) or in the fall of PGY-7 (cardiology, gastroenterology, hematology/oncology, pulmonary/critical care, or rheumatology/allergy and immunology). At the time of application, documentation will be required that the resident will be in full-time fellowship training or in a position with 80 percent involvement in mentored research for the duration of the year. To reiterate, the ABIM subspecialty examinations and ABIM certificates are the same for all ABIM candidates whether they pursue the research pathway or standard subspecialty training. Subspecialty Research Pathway Training Duration * based on the subspecialty Internal medicine training (Direct patient responsibility 20 months) 24 months Subspecialty clinical training 12 to 24 months* Research training (80%) 36 months Ambulatory clinic during research training (10%) 1/2 day per week Total training 6 or 7 years* Internal medicine examination Summer, R-4 Subspecialty Fall, R-6 or 7* During internal medicine research training, 20 percent of each year must be spent in clinical experiences including a half-day per week in a continuity clinic. During subspecialty research", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}