{"relation": [["Sub-programs", "Unemployment Mortgage Assistance", "Mortgage Reinstatement Assistance", "Principal Reduction Program", "Transition Assistance Program", "Total"], ["Funding disbursed so far", "$126.3 million", "$67 million", "$27.5 million", "$258,000", "$221.4 million"], ["Homeowners helped", "6700", "3676", "581", "54", "11,011"]], "pageTitle": "Are mortgage-aid programs too little, too late? | SanDiegoUnionTribune.com", "title": "", "url": "http://www.sandiegouniontribune.com/news/2012/jan/21/help-may-be-past-due/4/", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988922.24/warc/CC-MAIN-20150728002308-00067-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 696666735, "recordOffset": 696644733, "tableOrientation": "HORIZONTAL", "TableContextTimeStampBeforeTable": "{2034=The money comes from the Treasury’s $700 billion Troubled Asset Relief Program, or TARP, which bailed out private companies to stabilize the country following the 2008 financial meltdown., 701=So far, only a sliver of the $2 billion in state aid, about 11 percent, has been set aside or used. State officials have until 2017 to disburse the money., 2746=A high school marching band that played at President Barack Obama’s inauguration welcomed him at a Feb. 19, 2010, town hall at Henderson, Nev. — where Obama first publicly mentioned the “Hardest Hit Fund.” The idea was to set aside money for the worst-off states in employment and home prices., 4865=Those who pan the program say the assistance, funded by taxpayer dollars, isn’t enough to stem a crisis that shoved California into third place in foreclosure filings last year, with foreclosure-ridden Nevada and Arizona leading, based on recent numbers from Irvine-based data company RealtyTrac. The latest numbers from DataQuick show close to 9,500 homeowners in San Diego County alone were foreclosed upon from January to November 2011.}", "TableContextTimeStampAfterTable": "{2931=It’s been in the Cole family for more than 60 years, and one of the first things 43-year-old Melanie Cole will tell you is that her husband, Lee, 52, was born there. She’ll also tell you they were on the brink of losing the house after they were both laid off in 2010. She was a dog groomer and he was a bike assembler for Huffy., 12881=The national program, which started in spring 2009, has counted more than 615,000 trial modifications that have been canceled because homeowners defaulted on their trial payments, because they lacked documentation and for other reasons, based on the most recent data from the U.S. Treasury. Of those 615,000, 27 percent went on to start or complete the foreclosure process., 33024=© 1995-2015 The San Diego Union-Tribune, LLC | 350 Camino de la Reina, San Diego, CA 92108}", "lastModified": "Sat, 01 Aug 2015 22:27:14 GMT", "textBeforeTable": ".tableizer-table th {background-color: #7AA1B4; color: #000; font-weight: normal;} table.tableizer-table {border: 1px solid #CCC; font-family: Arial, Helvetica, sans-serif; font-size: 12px;} .tableizer-table td {padding: 4px; margin: 3px; border: 1px solid #ccc;}", "textAfterTable": "San Diego County numbers Sub-programs Funding disbursed so far Homeowners helped Unemployment Mortgage Assistance $8 million 440 Mortgage Reinstatement Assistance $3.7 million 200 Principal Reduction Program $2.2 million 47 Transition Assistance Program $35,000 7 Total $13.9 million 694 Who's getting help? The midcentury home sitting among residential distress is a rarity in Paradise Hills, a neighborhood in southeastern San Diego where about 46 percent of mortgages are under water. The area also has one of the highest foreclosure rates in the county, DataQuick numbers say. It’s been in the Cole family for more than 60 years, and one of the first things 43-year-old Melanie Cole will tell you is that her husband, Lee, 52, was born there. She’ll also tell you they were on the brink of losing the house after they were both laid off in 2010. She was a dog groomer and he was a bike assembler for Huffy. Requirements To be eligible, applicants must: • Own and occupy their homes as their primary residence. • Not exceed $729,750 in current unpaid principal balances on", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}