{"relation": [["Game size", "Small and not in basement", "Medium with less than 100K fans", "Large", "AAA", "All other cases (may be including before size is researched)"], ["Formula", "9", "9", "k = 3-tl, clamped between 0 and 3 10 - k", "k = 5-tl, clamped between 0 and 3 m = 3-ec, clamped between 0 and 3 10 - k - 0.6 * m", "10"]], "pageTitle": "Review Algorithm/1.4.4 - Game Dev Tycoon Wiki", "title": "", "url": "http://gamedevtycoon.wikia.com/wiki/Review_Algorithm", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 1, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990603.54/warc/CC-MAIN-20150728002310-00181-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 98612419, "recordOffset": 98584753, "tableOrientation": "HORIZONTAL", "lastModified": "Mon, 08 Jun 2015 12:18:32 GMT", "textBeforeTable": "Let tl be the tech level defined as average of Tech levels of all Graphic features in custom engine (Raw Data : Tech Level) and Tech Level of used platform (Tech Levels of platforms). The technical expertise factor is computed as follows: The first thing the game does is to check whether it is possible for the game to get a perfect score. If ec >= 2, a perfect score of 10/10/10/10 is possible. Otherwise (in particular if the game is of small size, you cannot assign staff to single pieces of the game) the maximum possible score will always be 10/10/10/9. For each development focus that has an importance of ≥ 0.9 for the genre of the game, count the number of experts (in the corresponding dev focus) assigned. Let this number be ec. Perfect score and Technical expertiseEdit PreparationsEdit [show] Contents Necessary data tables will be in the article Raw Data You can know your exact game/review scores by using Game Flags to enable the console, which will give you useful messages throughout your playthrough. Only one score", "textAfterTable": "Examples and ConsequencesEdit Only experts determine whether a perfect score is possible, for all games sizes (except small, for which cannot assign individual developers). The tech level has an effect on technical expertise only for large and AAA games but it always has an effect on calculating base points of the game which effect amout of tech and design points of the game so the score too. For large games, a tech level greater 3 and for AAA games a tech level greater 5 has no additional effect technical expertise. Moreover, for AAA games you need at least tech level 3 to increase technical expertise (note that for AAA games, k is indeed calculated with 5 as a base level but clamped to 3). Experts have an effect on the technical expertise factor only for AAA games.  Calculating Target Game ScoreEdit To calculate the game's review score, we compare it to a \"Target Game Score\" and if we achieve that, we get maximum possible review score (determined by technical expertise factor), and if not, we get a portion of that based on how close we came to it. Three values are used to calculate the Target Game Score: Top Score is the highest game score (g, above) ever achieved (updated only when the review score s>=9)", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}