{"relation": [["Name", "FILEFORMS= System Option", "FILESYSOUT= System Option", "PRINTINIT System Option", "PRNGETLIST System Option", "SYSPRINT= System Option"], ["Syntax and Description", "FILEFORMS=operating-environment-form Specifies the default SYSOUT form for a print file. Product: Base SAS Document: SAS Companion for z/OS", "FILESYSOUT=sysout-class Specifies the default SYSOUT CLASS for a printer file. Product: Base SAS Document: SAS Companion for z/OS", "PRINTINIT | NOPRINTINIT Initializes the procedure output file. Product: Base SAS Document: SAS Companion for z/OS", "PRNGETLIST | NOPRNGETLIST specifies whether printers that are attached to the system are recognized. Product: Base SAS Document: SAS Companion for Windows", "SYSPRINT= * | DUMMY | ddname Specifies the handling of output that is directed to the default print file. Product: Base SAS Document: SAS Companion for z/OS"]], "pageTitle": "System Options Syntax Sorted by Category :: SAS(R) 9.2 Language Reference by Name, Product, and Category", "title": "", "url": "http://support.sas.com/documentation/cdl/en/allprodslang/63337/HTML/default/syntaxByCategory-systemOption.htm", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 22, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042991019.80/warc/CC-MAIN-20150728002311-00081-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 228906903, "recordOffset": 228837114, "tableOrientation": "HORIZONTAL", "textBeforeTable": "Communications: Email System Options Syntax by Category Next Page | Previous Page --> *** Begin Body ***", "textAfterTable": "Document: SAS Language Reference: Dictionary EMAILPW= System Option EMAILPW= \" password\" Specifies an e-mail logon password. Product: Base SAS Document: SAS Language Reference: Dictionary EMAILSYS System Option -EMAILSYS SMTP | name-of-script EMAILSYS=SMTP | name-of-script Specifies the e-mail protocol to use for sending electronic mail. Product: Base SAS Document: SAS Companion for the UNIX Environments EMAILSYS= System Option EMAILSYS= interface Specifies the e-mail protocol to use for sending electronic mail. Product: Base SAS Document: SAS Companion for z/OS", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}