{"relation": [["Fund", "Vanguard S&P 500 Index (VFINX)", "UBS S&P 500 Index A (PSPIX)", "American Beacon S&P 500 Index Plan (AAFPX)", "Allegiant S&P 500 Index A (AEXAX)", "Morgan Stanley S&P 500 Index A (SPIAX)", "Dreyfus S&P 500 Index (PEOPX)", "E*TRADE S&P 500 Index (ETSPX)"], ["Expense ratio", "0.15%", "0.70% (plus a 2.5% load!)", "0.63%", "0.60% (plus a 2.5% load!)", "0.58% (plus a 5.25% load!)", "0.50%", "0.09%"]], "pageTitle": "Fees Count in ETFs, Too", "title": "", "url": "http://www.fool.com/investing/etf/2008/05/12/fees-count-in-etfs-too.aspx", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989897.84/warc/CC-MAIN-20150728002309-00339-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 441844747, "recordOffset": 441821074, "tableOrientation": "HORIZONTAL", "TableContextTimeStampBeforeTable": "{28241=By Selena Maranjian | More Articles May 12, 2008 | Comments (0)}", "TableContextTimeStampAfterTable": "{17908=DocumentId: 642337, ~/Articles/ArticleHandler.aspx, 8/3/2015 11:20:08 AM, 19695=Selena Maranjian has been writing for the Fool since 1996 and covers basic investing and personal finance topics. She also prepares the Fool's syndicated newspaper column and has written or co-written a number of Fool books. For more financial and non-financial fare (as well as silly things), follow her on Twitter... Follow @SelenaMaranjian}", "textBeforeTable": "The same story It's the same with regular mutual funds -- including index funds. Let's consider the noble S&P 500 index fund, for example. Vanguard, known for its low fees, among other things, has long offered an S&P 500 index fund, sporting an expense ratio of 0.15%. These days, though, every Thomas, Richard, and Harold on Wall Street offers an S&P 500 index fund, with a wide range of expense ratios: For example, look at the iShares MSCI Emerging Markets (NYSE: EEM  ) and Vanguard Emerging Markets (AMEX: VWO  ) ETFs. The former charges 0.75% per year, while the latter charges 0.30%. The former, though, recently was four times as big as the latter. In case you're thinking that a 0.45% difference isn't such a big deal, let's imagine that you have $10,000 invested in each of the ETFs, and that they each earn an annual average return of 10% per year for a decade. Subtracting the fees, they'll earn 9.25% and 9.7%, respectively. The iShares ETF will grow to $24,222, while the Vanguard ETF will grow to $25,239. That's a difference of more than $1,000! But not all ETFs are the same, at least in regard to their fees. As Matthew Hougan of Index Universe recently noted, there are lots of puzzling pairs of ETFs out there. The", "textAfterTable": "Data from Morningstar. I included that last fund (and there are scores of S&P 500 index funds out there) just to show you that there may be more low-fee funds around than you think. So don't think of paying as much as 0.70% per year (plus a one-time load fee) for the same mix of S&P 500 companies like Amgen (Nasdaq: AMGN  ) and Monsanto (NYSE: MON  ) that you can get a lot cheaper elsewhere. You can also invest in the S&P 500 inexpensively via ETFs. The iShares S&P 500 Index (NYSE: IVV  ) sports an expense ratio of 0.09%, while SPDRs (AMEX: SPY  ) sports fees of 0.08%. The bottom line here: Keep looking at fees and seek out low ones. A slightly lower fee can make a world of difference to your bottom line.            Keep learning Read all about ETFs and how they offer some valuable advantages over traditional mutual funds in our ETF Center. These articles may also be of interest: Vanguard Cuts ETF Fees Again Why ETFs Beat Mutual Funds ETFs That May Be Ready to Burst If", "hasKeyColumn": false, "keyColumnIndex": -1, "headerRowIndex": 0}