{"relation": [["8 key stats", "eFG%", "OR%", "DR%", "AstR", "TOR", "Blk%", "Stl%", "FTR", "Ortg"], ["MU players who've been in top 500", "Thomas 98th in 2010, Lockett 286th and 335th in 2011", "Gardner 15th*, 37th in 2011*", "No top 500 players on MU roster", "Cadougan 63rd, 153rd in 2011, Lockett 452nd in 2011", "Thomas 222nd in 2011, Jamil 469th", "Otule 35th*, Jamil 135th", "Derrick 68th*, Blue 323rd in 2011, Lockett 396th and 350th in 2011", "Otule 14th*, Gardner 33rd* and 44th in 2011*, Lockett 91st and 350th in 2011, Blue 234th, Cadougan 329th, Thomas 498th in 2010", "Gardner 3rd and 19th in 2011, Thomas 268th in 2010 and 478th in 2011"]], "pageTitle": "Cracked Sidewalks: Jake Thomas dunk contest win points again to balanced MU attack; Only Michigan St., Indiana, UCLA & Arizona can match MUs 10 top 1000 players", "title": "", "url": "http://www.crackedsidewalks.com/2012/10/jake-thomas-dunk-contest-win-points.html", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986022.41/warc/CC-MAIN-20150728002306-00258-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 388565143, "recordOffset": 388538925, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{12796=Written by JohnPudner at 12:32 AM  }", "lastModified": "Mon, 20 Jul 2015 03:22:46 GMT", "textBeforeTable": ".tableizer-table th {background-color: #104E8B; color: #FFF; font-weight: bold;} table.tableizer-table {border: 1px solid #CCC; font-family: Arial, Helvetica, sans-serif; font-size: 12px;} .tableizer-table td {padding: 4px; margin: 3px; border: 1px solid #ccc;} Thank you to Midwest Ballers for the mix from Friday's Midnight Madness, where Jake Thomas probably shocked many readers by winning the dunk contest. And while some may certainly have judged Jamil Wilson's between the legs dunk as the best on the attached footage, I hope the video will show that Jake could be a lot more than just the best pure 3-point shooter at Marquette since Steve Novak. Buzz's two transfers are MUs only two players to have been among the national leaders in 3 of the main 8 categories on www.kenpom.com as shown on the table below (last year NBC Sports picked up on my post here noting that Jae Crowder may be the best overall player in the country for ranking so high in 5 of 8).   Trent Lockett is the name that jumps out, as he has been among the best in the nation in three categories (eFG% of best shooters, Stl% as best at steals and FTR as best at getting to the line for free throws).  Jake Thomas is all the way in the top 100 in shooting (98th in eFG%), but also in the top 500 in protecting the ball (Turnover Ratio) and just makes the top 500 on getting to the line (Free Throw", "textAfterTable": "* - indicates did not play 40% of minutes so not listed as leader at www.kenpom.com, but this is the rank the player would have had with enough minutes (e.g. if neither Gardner or Otule were hurt last year). Certainly some will be quick to note their initial skepticism over Thomas ability to contribute at the Big East level after piling up his top 100 shooting year against lesser competition.  However, when we then turn to www.valueaddbasketball.com, which adjusts for competition, Jake Thomas is still a top 700 offensive player (top 28% of all D1 players) and a top 1000 overall player even after accounting for South Dakota's weak defense. I do not know if that means Thomas will be in Buzz's final 7 or 8 man rotation or not - but I am very confident he would be in the 7-man rotation for most BCS schools.  The beauty of Marquette this year is the depth, which really may be the best in the country.  As you can see from the table below, only 28 teams in the country have even seven players among the best 1000 in the country, so just about anyone on Marquette's roster could be in the rotation of any other team.", "hasKeyColumn": false, "keyColumnIndex": -1, "headerRowIndex": 0}