{"relation": [["Side Effect", "Nausea/vomiting", "Weight gain", "Diarrhea", "Sleepiness", "Sexual problems (such as decreased sex drive or difficulty getting an erection)"], ["Medicines Most Likely To Cause This Side Effect", "Venlafaxine (Effexor®, Effexor XR®) Paroxetine (Paxil®)", "Mirtazapine (Remeron®, Remeron SolTab®) Between 2 and 7 pounds in 6 to 8 weeks", "Sertraline (Zoloft®)", "Trazodone (Desyrel®)", "Paroxetine (Paxil®, Paxil CR®) Escitalopram (Lexapro®), fluoxetine (Prozac®, Prozac Weekly®), paroxetine (Paxil®, Paxil CR®), or sertraline (Zoloft®) had more sexual side effects than bupropion (Wellbutrin®, Wellbutrin SR®, Wellbutrin XL®)"]], "pageTitle": "Medicines for Treating Depression: A Review of the Research for Adults - Consumer Summary | AHRQ Effective Health Care Program", "title": "", "url": "http://effectivehealthcare.ahrq.gov/search-for-guides-reviews-and-reports/?pageaction=displayproduct&productID=1142&PC=mhb", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 1, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986625.58/warc/CC-MAIN-20150728002306-00152-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 75112593, "recordOffset": 75096682, "tableOrientation": "HORIZONTAL", "TableContextTimeStampBeforeTable": "{5854=Consumer Summary – Jul. 30, 2012, 2942=Researchers funded by the Agency for Healthcare Research and Quality (AHRQ), a Federal Government research agency, reviewed 248 studies published between January 1980 and January 2011 on second-generation antidepressants. This report updates research first reported in 2007 and includes newer medicines. You can read the report at www.effectivehealthcare.ahrq.gov/secondgenantidep.cfm.}", "TableContextTimeStampAfterTable": "{24556=The information in this summary comes from the report Second-Generation Antidepressants in the Pharmacologic Treatment of Adult Depression: An Update of the 2007 Comparative Effectiveness Review, December 2011.}", "textBeforeTable": "This summary looks at research only on the medicines used to treat depression called antidepressants. Your doctor may have you see a talk therapist in addition to taking medicine. Ask your doctor about the benefits and risks of adding talk therapy to your treatment. Depression is treated with medicines, talk therapy (where a person talks with a trained professional about his or her thoughts and feelings; sometimes called \"psychotherapy\" or \"counseling\"), or a combination of the two. How is depression treated? Understanding Your Choices You may not notice some of these symptoms, but people living and working around you may see them. Thoughts of suicide. Feelings of excessive or inappropriate guilt. Finding it hard to think or concentrate. Strong feelings of despair, worthlessness, or hopelessness. Not eating as much or eating more, whether or not you are hungry. Losing interest in usual activities such as favorite hobbies, time with family members, or evenings out with friends. Changes in your sleeping habits such as sleeping poorly or sleeping more than usual. Not everyone with depression feels sad or down. Other symptoms of depression include: Depression is a serious but treatable problem that should not be ignored. Many people require some form of treatment by a doctor or other health care professional for their depression. Depression is different from feeling sad or down every now and then. People with depression feel sad, lack energy,", "textAfterTable": "Yes Fluvoxamine Remeron®; Remeron SolTab® Yes, for some doses Mirtazapine Serzone®** Yes Nefazodone Paxil®; Paxil CR® Yes Paroxetine Zoloft® Yes Sertraline Desyrel® Yes Trazodone Effexor®; Effexor XR® Yes, for some doses Venlafaxine What do the letters SR, CR, XR, and XL after the brand name mean? Medicines with these letters are forms of the medicine that delay or extend the release of the medicine in your body. This means that the medicine stays in your body for longer periods of time and you may be able to take the medicine less often. Wellbutrin SR® is a sustained-release medicine. You take this medicine twice a day. Paxil CR® is a controlled-release medicine. You take this medicine once a day. Effexor XR®, Wellbutrin XL®, and Prozac Weekly® are extended-release medicines. You take Wellbutrin XL® and Effexor XR® once a day. You take Prozac Weekly® once a week. How do these medicines work? Antidepressant medicines help improve the way your brain uses certain chemicals that control mood or stress. What does research say about how well these medicines help people with depression? All of the antidepressant medicines work about as well as each other to improve the symptoms of depression and the quality of life for people with depression. All of the antidepressant medicines work about as well as each other in keeping depression symptoms from coming back. How", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}