{"relation": [["Place Type", "Airports", "Hospitals", "Major Tourist Attractions/Landmarks", "Police/Fire Stations", "Gas Stations"], ["Minimum locks", "4", "4", "4", "3", "3"]], "pageTitle": "Canada - waze", "title": "Place Minimum Locking Rank Standard", "url": "https://wiki.waze.com/wiki/index.php/Canada?title=Map_Editing_Guidelines_for_Poland_(draft)", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 3, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988650.6/warc/CC-MAIN-20150728002308-00008-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 901929307, "recordOffset": 901900150, "tableOrientation": "HORIZONTAL", "TableContextTimeStampBeforeTable": "{37039=Ontario Statute: R.S.O. 1990, c. H.8, s. 143. Highway Traffic Act}", "lastModified": "Mon, 20 Jul 2015 18:19:49 GMT", "textBeforeTable": "If the current lock or traffic lock is higher than the minimum standards listed below, please don't lower the lock. Segments that have restricted turns must be locked to a minimum Level 3. Canada has active \"Traffic Locks\", these locks are based on usage from users. They are limited to a max rank of 4, but can be any rank below. Locking Standard In places where they are retained, they should have their city name set and the \"None\" box checked for Street Name. They should also be changed to Parking Lot street type. This is particularly relevant to basemapped areas that included them -- e.g. Saskatchewan -- small towns should certainly have the alleyways removed. Alleys should not be added to the map. In some cases (e.g. Vancouver and Toronto areas), we have left the ones in place, but in most cases they should be removed. Alleys Differentiation between a major and minor highway is largely based on its destination and importance of the route.  Also, a highway with a letter suffix in its number should generally be one type lower than the corresponding highway without the letter suffix. For example Hwy 19A in Courtenay is major highway, one type lower than Hwy 19 (freeway), and Hwy 4A in Coombs is minor highway, one type lower than Hwy 4 (major highway). Additionally, streets that are named \"Highway\" (e.g. Barnet Highway in Burnaby) may also receive a", "textAfterTable": " Primary Street  2  Street  1  :|:|:|:|:Railroad:|:|:|:|:  4 Place Editing PUR should be reviewed for accuracy, once approved all relevant information pertaining to the place should be entered. Please use each company's website to gather all the information you can. Once a place is complete please lock to rank 3. This practice will prevent app trusted users and most IGN editors from making incorrect changes to places we know are right. App trusted users and IGN editors are rarely rank 3. Following are general standards for place locking in Canada: Place Minimum Locking Rank Standard Place Type Minimum locks Airports 4 Hospitals 4 Major Tourist Attractions/Landmarks 4 Police/Fire Stations 3 Gas Stations 3", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}