{"relation": [["Valuation", "Price/Earnings", "Price/Sales", "Price/Book", "Price/Cash Flow", "TEV/Sales"], ["SPD", "0.9x", "0.8x", "0.7x", "0.9x", "NM"], ["Industry Range", "", "", "", "", "Not Meaningful"]], "pageTitle": "SPAN DIAGNOSTIC LTD (SPD:Mumbai): Stock Quote & Company Profile - Businessweek", "title": "", "url": "http://www.bloomberg.com/research/stocks/snapshot/snapshot.asp?ticker=SPD:IN", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 3, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988311.72/warc/CC-MAIN-20150728002308-00300-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 346635887, "recordOffset": 346609156, "tableOrientation": "HORIZONTAL", "TableContextTimeStampBeforeTable": "{36199=+65 6212 1000, 36531=+1 212 318 2000}", "TableContextTimeStampAfterTable": "{4812=Span Diagnostics Limited manufactures, markets, and trades diagnostics reagents, diagnostics instruments, and allied products in India and internationally. It is developing products in the area of immunology, hybridoma, biochemistry, molecular biology, instrumentation, and bio materials. Its products include clinical chemistry, heamostasis, histology, analytical, staining solution, hematology, and immuno diagnostic reagents; and antibiotic discs, as well as biochemistry analyzers, and immunology and allergy instruments. The company also offers contract manufacturing services for various purified protein molecules, such as antigens, primary and secondary antibodies, tissue proteins, and polyclonal and monoclonal antibodies, as well as customized manufacturing for rapid diagnostic tests, ELISA, colored antigens, blood grouping and typing anti-sera, infectious disease controls, clinical chemistry reagents, and other services. In addition, it provides animal housing services; hybridoma facility for in vitro and in vivo antibody productions and their purification; and custom services for monoclonal and polyclonal antibody production. Span Diagnostics Limited exports its products to approximately 90 countries. The company offers its products through distributors and e-spanol, a portal for online purchase. Span Diagnostics Limited was founded in 1972 and is based in Surat, India., 9972=Span Diagnostics Limited reported audited standalone and consolidated earnings results for the fourth quarter and year ended March 31, 2015. The company reported total income from operations of INR 88.536 million, loss from operations before other income, finance cost and exceptional items of INR 44.336 million, profit from ordinary activities before tax of INR 429.045 million, net profit of INR 356.960 million or INR 49.06 million against total income from operations of INR 216.980 million, profit from operations before other income, finance cost and exceptional items of INR 3.494 million, loss from ordinary activities before tax of INR 6.664 million, net loss of INR 12.611 million or INR 1.73 million a year ago. For the year, the company reported total income from operations of INR 728.738 million, loss from operations before other income, finance cost and exceptional items of INR 43.533 million, profit from ordinary activities before tax of INR 406.787 million, net profit of INR 351.530 million or INR 48.31 million against total income from operations of INR 786.612 million, loss from operations before other income, finance cost and exceptional items of INR 8.196 million, loss from ordinary activities before tax of INR 42.261 million, net loss of INR 51.399 million or INR 7.06 million a year ago. For the quarter, the group reported total income from operations of INR 94.156 million, loss from operations before other income, finance cost and exceptional items of INR 47.361 million, profit from ordinary activities before tax of INR 472.316 million, net profit of INR 412.664 million or INR 56.72 million against total income from operations of INR 223.508 million, profit from operations before other income, finance cost and exceptional items of INR 220.970 million, loss from ordinary activities before tax of INR 11.660 million, net loss of INR 20.418 million or INR 2.81 million a year ago. For the year, the group reported total income from operations of INR 756.310 million, profit from operations before other income, finance cost and exceptional items of INR 48.002 million, profit from ordinary activities before tax of INR 447.767 million, net profit of INR 389.851 million or INR 53.58 million against total income from operations of INR 813.253 million, loss from operations before other income, finance cost and exceptional items of INR 9.629 million, loss from ordinary activities before tax of INR 48.169 million, net loss of INR 62.774 million or INR 8.65 million a year ago., 12848=Span Diagnostics Limited announced that they will report fiscal year 2015 results on May 30, 2015, 9459=Span Diagnostics Limited, Board Meeting, Jul 11, 2015. Agenda: To consider quarterly results.}", "textBeforeTable": "Industry Average SPD Industry Analysis   // ]]> } document.write(BW_adsys('Right3')); if (window.BW_adsys) { // <script type=\"text/javascript\"> <div class=\"\" style=\"width:300px; margin: auto; \"> <div class=\"ad\"> </div> </table> </tbody> </tr> <td class=\"noDataRR\" style=\"border:none;\" colspan=\"3\"><a class=\"link_xs\" href=\"../../sectorandindustry/industries/industrydetail.asp?code=351010\">View Industry Companies</a></td> <tr> </tr> <td colspan=\"4\" align=\"center\">No competitor information is available for SPD.</td> <tr> <tbody> </thead> </tr> <td width=\"50\" align=\"right\">Change</td> <td width=\"75\" align=\"right\">Last</td> <td>Company</td> <tr> <thead> <table class=\"colRight\" width=\"100%\" cellpadding=\"0\" cellspacing=\"0\"> <div class=\"clear\"></div> </div> <p class=\"note fLeft\" style=\"width:64%; text-align: right; padding: 5px 0; border-top: 3px solid #6B7B84; margin-top: 20px;\">Market data is delayed at least 15 minutes.</p> <h2 class=\"sectionTitle fLeft\" style=\"width: 35%; border-bottom: 0;\">SPD Competitors</h2> <div style=\"border-bottom: 1px solid #ccc; overflow: hidden;\"> <div class=\"\"> </div> </table> </tbody> </tr> <td width=\"75\" align=\"right\" class=\"noBorder\"><img src=\"/cgi-bin/upload.dll/file.png?z04ae0f0az6d5df5169c3147468ce8ea71f2fe5c39\" width=\"60\" height=\"15\" galleryimg=\"no\" symbol=\"IN;524727\" /></td> <td align=\"right\" width=\"45\" class=\"noBorder\"><span class=\"posData\">+0.65</span></td> <td align=\"right\" class=\"noBorder\">60.15 <span class=\"xSmGreyTxt\">INR</span></td> <td scope=\"row\"> <a class=\"link_xsb\" style=\"text-align:left\" target=\"_top\" href=\"../../stocks/snapshot/snapshot.asp?ticker=SPD:IN\"> SPD:IN </a> </td> <tr class=\"lastRow\"> <tbody> </thead> </tr> <td colspan=\"4\">Recently Viewed</td> <tr> <thead> <table class=\"miniTable\" summary=\"Recently viewed\"> </form> </fieldset> <a style=\"font-size:11px;\" target=\"_top\" href=\"../../common/symbollookup/symbollookup.asp\">Company Lookup</a> <input type=\"image\" name=\"submit\" src=\"http://images.businessweek.com/gen/buttons/stock_go_btn.gif\" align=\"absmiddle\" /> <input type=\"text\" id=\"lookupSymbol\" class=\"symbol\" autocomplete=\"off\" name=\"symbol\" value=\"Stock, Fund, or ETF\" onfocus=\"if(this.value == 'Stock, Fund, or ETF') this.value = '';\" onblur=\"if(this.value ==", "textAfterTable": "View Detailed SPD Financials  |  View Sector Analysis Sponsored Financial Commentaries Sponsored Links Browse Companies A B C D E F G H I J K L M N O P Q R S T U V W X Y Z  |  0 1 2 3 4 5 6 7 8 9 Report Data Issue To contact SPAN DIAGNOSTIC LTD, please visit www.span.co.in. Company data is provided by Capital IQ. Please use this form to report any data issues. Information Missing - Please enter your information in the following field(s): Company Name Your Name* Your E-Mail Address*", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}