{"relation": [["Component", "Intel Pentium G860 3.0GHz Dual-Core Processor", "Cooler Master Hyper 212 EVO 82.9 CFM Sleeve Bearing CPU Cooler", "Foxconn H61MX Micro ATX LGA1155 Motherboard", "Crucial Ballistix Sport 8GB (2 x 4GB) DDR3-1600 Memory", "Seagate Barracuda 500GB 3.5\" 7200RPM Internal Hard Drive", "Gigabyte Radeon HD 7770 1GB Video Card", "Total:"], ["Estimated Wattage", "8W - 65W", "5W - 10W", "15W - 60W", "9W - 9W", "4W - 20W", "20W - 80W", "61W - 244W"]], "pageTitle": "Intel Pentium G860, Gigabyte Radeon HD 7770, Antec One - System Build - PCPartPicker", "title": "", "url": "http://pcpartpicker.com/p/nRmjXL", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 1, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989178.64/warc/CC-MAIN-20150728002309-00164-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 185037315, "recordOffset": 185021042, "tableOrientation": "HORIZONTAL", "textBeforeTable": "Note: Wattages are estimates only. Actual power draw may differ from listed values. Reason: Loading... Part List Price History (Excluding Tax and Combo Deals) Flag compatibility notes as incorrect Antec One ATX Mid Tower Case has front panel USB 3.0 ports, but the Foxconn H61MX Micro ATX LGA1155 Motherboard does not have onboard USB 3.0 headers. Compatibility Notes * Some physical dimension restrictions cannot (yet) be automatically checked, such as cpu cooler / RAM clearance with modules using tall heat spreaders. nearby in-store pickup prices) your selected merchants and only including * Using $212.88 Total: $1.99 Shipping: -$25.00 Mail-in Rebates: $235.89 Base Total: Buy OutletPC $21.55", "textAfterTable": "Show Prices From: All Merchants Your Preferred Merchant List Single Merchant: AdoramaAmazonB&HBest BuyDell Small BusinessDirectronHarman KardonLogic SupplyLogitechMac MallMechanical KeyboardsMicro CenterMonopriceMwaveNCIX USNZXTNeweggOther World ComputingOutletPCPCMSuperBiiz Loading... CPU CPU Cooler Motherboard Memory Storage Video Card Power Supply Case Cooling Case Fans Fan Controllers Thermal Compound Software Operating Systems Drives Optical Drives External Storage External Hard Drives Displays Monitors Expansion Sound Cards Wired Networking Wireless Networking Peripherals Headphones", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}