{"relation": [["Conference", "ACC", "The American", "C-USA", "Mountain West", "Sun Belt"], ["New members", "Syracuse, Pittsburgh, Notre Dame (partial member)", "Houston, Memphis, SMU, UCF", "FAU, FIU, Louisiana Tech, Middle Tennessee, North Texas, UTSA", "Utah State, San Jose State", "Georgia State, Texas State"]], "pageTitle": "Stewart Mandel: Reinvented American Athletic Conference eager to build brand - College Football - SI.com", "title": "", "url": "http://www.si.com/college-football/2013/07/01/american-athletic-conference-launch", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 1, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987628.47/warc/CC-MAIN-20150728002307-00058-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 696386539, "recordOffset": 696356602, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{9103=Furthermore, nearly all the American's remaining members lack the level of fan support that the sport's bluebloods enjoy. Removing Louisville and Rutgers, none of the conference's remaining members ranked among the top 40 in average attendance last season. East Carolina, which joins in 2014, was the highest at No. 45 (47,013 per game). Seven of the eventual 12 members averaged fewer than 30,000 fans per game. (Navy will become the 12th member when it joins in 2015.), 9648=The league also has struggled to secure appealing bowl tie-ins for the six-year cycle beginning in 2014. Three current bowl partners -- Russell Athletic (Orlando), Belk (Charlotte) and Pinstripe (New York) -- have reached deals with other leagues. The American is expected to retain tie-ins with the ESPN-owned Beef 'O' Brady's (St. Petersburg) and BBVA Compass (Birmingham) and pick up the Military Bowl (Washington, D.C.). It's also trying to retain the Liberty Bowl in Memphis, where it will host its first basketball tournament. And as previously reported, the conference is expected to start its own bowl in Miami against a conference to be determined., 7376=Key early nonconference games include Temple visiting Notre Dame (Aug. 31), Connecticut hosting Michigan (Sept. 21), UCF visiting Penn State (Sept. 14) and hosting South Carolina (Sept. 28) and USF visiting Michigan State (Sept. 7) and hosting Miami (Sept. 28). SMU faces an in-state trifecta: It hosts Texas Tech (Aug. 31) before visiting Texas A&M (Sept. 21) and TCU (Sept. 28)., 6520=It's a lofty goal, though it certainly helps to have one more year with Louisville, the reigning Sugar Bowl champion and a likely preseason top-10 team. A strong showing by the Cardinals in their one season wearing an \"A\" patch would certainly help boost public perception of the league. Even better, however, would be for one or more of its holdover teams to make a BCS run. Cincinnati (2008 and '09) and Connecticut (2010) have both done so in recent years., 8581=American programs will start off facing a gargantuan financial gap with schools in the Power Five. It's hard to place the conference in the same breath as, say, the Pac-12, when the American's new television agreement reached with ESPN last February is worth a reported $20 million per year from 2014-20; Pac-12 schools will soon split more than $20 million per season. (The American also distributed about $100 million in exit fees and postseason revenue to its current members.), 11220=\"The Big East had to reinvent itself several times, but it's always made the school coming in better,\" said Aresco, noting that Louisville and Cincinnati were \"nowhere near where they are now\" before joining in 2005. \"That's going to happen with the new teams because they're going to play better competition. They're going to have a TV deal with good exposure.\", 3062=*Note: Idaho and New Mexico State will compete as independents in 2013., 3502=July 1 is the date every year when the various conference realignment changes take effect. This year, those changes include Syracuse, Pittsburgh and Notre Dame's first day in the ACC, and Xavier, Creighton and Butler's first day in the basketball conference now known as the Big East. But after 21 seasons, the Big East football brand is no more. The conference that once produced Michael Vick, Donovan McNabb, Ray Rice and Steve Slaton is still based in Providence and retains much of the same staff, but it has been entirely rebranded. By 2015, it will have turned over nearly its entire membership in the span of three years., 4500=Not since eight WAC schools broke off and formed the Mountain West in 1999 has a completely new name entered the FBS conference lexicon. The launch of the American (its expected shorthand) is unusual in a number of ways, one being that its first year of existence is also the last of college football's existing postseason structure. For a year at least, newcomers UCF, Houston, SMU and Memphis will be able to say they're part of a BCS conference, with the American's 2013 champion still an automatic qualifier for one of the five major bowls. Come next season, however, when Louisville and Rutgers depart and East Carolina, Tulane and Tulsa enter the fold, the league will no longer officially be linked with the so-called Power Five (ACC, Big Ten, Big 12, Pac-12 and SEC).}", "lastModified": "Thu, 30 Jul 2015 20:52:51 GMT", "textBeforeTable": "FBS conference additions that take effect July 1: New year, new conference Mike Aresco hopes to strengthen the American Athletic Conference's brand over the next several years. Photo: AP Updated: Wed May. 28, 2014 Posted: Mon Jul. 1, 2013 Email Facebook Twitter by Stewart Mandel Reinvented American Athletic Conference eager to build brand", "textAfterTable": "*Note: Idaho and New Mexico State will compete as independents in 2013. As of Monday, the American Athletic Conference is officially a thing. July 1 is the date every year when the various conference realignment changes take effect. This year, those changes include Syracuse, Pittsburgh and Notre Dame's first day in the ACC, and Xavier, Creighton and Butler's first day in the basketball conference now known as the Big East. But after 21 seasons, the Big East football brand is no more. The conference that once produced Michael Vick, Donovan McNabb, Ray Rice and Steve Slaton is still based in Providence and retains much of the same staff, but it has been entirely rebranded. By 2015, it will have turned over nearly its entire membership in the span of three years. \"We could easily say, 'This is our new conference,' but it's really a reinvented conference, and it's getting a fresh start,\" said commissioner Mike Aresco. Not since eight WAC schools broke off and formed the Mountain West in 1999 has a completely new name entered the FBS conference lexicon. The launch of the American (its expected shorthand) is unusual in a number of ways, one being that its first year of existence is also the last of college football's existing postseason structure. For a year at least, newcomers UCF, Houston, SMU and Memphis will be able to say they're", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}