{"relation": [["How the content is loaded", "Initial content, SWF-based application", "Initial content, HTML-based application", "SWF loaded by SWF content", "SWF library loaded by HTML content using", "SWF loaded by HTML content using AIR or Flash Player APIs (such as flash.display.Loader)", "SWF loaded by HTML content using or tags (or the equivalent JavaScript APIs)"], ["How the API version is determined", "SWF version of the loaded file", "Application descriptor namespace", "Version of the loading content", "Application descriptor namespace", "Application descriptor namespace", "SWF version of the loaded file"]], "pageTitle": "Adobe AIR 1.5 * Setting AIR application properties", "title": "", "url": "http://help.adobe.com/en_US/AIR/1.5/devappsflex/WS5b3ccc516d4fbf351e63e3d118666ade46-7ff1.html", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 1, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042991076.30/warc/CC-MAIN-20150728002311-00338-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 110281323, "recordOffset": 110263488, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{37104=x, y, width, height (Optional) The initial bounds of the main window of the application. If you do not set these values, the window size is determined by the settings in the root SWF file or, in the case of HTML, by the operating system. The maximum values for width and height are each 2880.}", "textBeforeTable": "When an AIR application loads SWF content, the version of the AIR and Flash Player APIs available to that content depends on how the content is loaded. The following table shows how the API version is determined based on the loading method: For HTML-based applications, the runtime version specified in the application descriptor alone determines which version of the AIR and Flash Player APIs are available to the application. The HTML, CSS, and JavaScript behaviors are always determined by the version of Webkit used in the installed AIR runtime, not by the application descriptor. For SWF-based applications, the AIR runtime version specified in the application descriptor determines the maximum SWF version that can be loaded as the initial content of the application. Applications that specify AIR 1.0 or AIR 1.1 can only use SWF9 (Flash Player 9) files as initial content — even when run using the AIR 1.5 runtime. Applications that specify AIR 1.5, or higher, can use either SWF9 or SWF10 (Flash Player 10) files as initial content. The SWF version determines which version of the AIR and Flash Player APIs are available. If a SWF9 file is used as the initial content of an AIR 1.5 application, that application will only have access to the AIR 1.1 and Flash Player 9 APIs. Furthermore, behavior changes made to existing APIs in AIR 1.5 or Flash Player 10 will not be effective. (Important security-related changes to APIs are an exception to this principle and can be applied", "textAfterTable": "When loading a SWF file of a different version than the loading content, you can run into the two problems: Loading SWF10 content by SWF9 (or earlier) — References to AIR 1.5 and Flash Player 10 APIs in the loaded content will be unresolved Loading SWF9 (or earlier) content by SWF10 — APIs changed in AIR 1.5 and Flash Player 10 may behave in ways that the loaded content does not expect. minimumPatchLevel Deprecated — do not use. Defining the application identity The following elements define the id, publisherID, version, name, filename, description, and copyright information: <id>TestApp</id> <publisherID>48B5E02D9FB21E6389F73B8D17023320485DF8CE.1</publisherID> <version>2.0</version> <filename>TestApp</filename> <name> <text xml:lang=\"en\">Hello AIR</text> <text xml:lang=\"fr\">Bonjour AIR</text> <text xml:lang=\"es\">Hola AIR</text> </name> <description>An MP3 player.</description> <copyright>Copyright (c) 2008 YourCompany, Inc.</copyright> id An identifier string for the application, known as the application ID. The attribute value is restricted to the following characters: 0–9 a–z A–Z . (dot) - (hyphen) The value must contain 1 to 212 characters. This element is required. The id string uniquely identifies the application. publisherID (Optional) Specifies the publisher ID to use when creating an update for an application published with AIR 1.5.2, or earlier. If the application to be updated has no publisher ID, omit the publisherID tag. In order for an AIR file to update an existing version of an", "hasKeyColumn": true, "keyColumnIndex": 1, "headerRowIndex": 0}