{"relation": [["Button", "Send/Receive", "New", "Reply", "Reply to All", "Forward", "Print", "Delete", "Junk", "Cancel", "Previous", "Next"], ["How the button functions", "Allows Evolution to send and receive all email.", "Opens a new email message dialog box.", "Replies to the person who has sent you an email.", "Replies to everyone who was included in the email that you have received.", "Forwards the email message to another person.", "Prints the email.", "Deletes the message.", "Marks the email as junk.", "Cancels whatever you are doing.", "Moves to the previous email in your folder.", "Moves to the next email in your folder."]], "pageTitle": "User Guide - Communications - FedoraProject", "title": "", "url": "http://fedoraproject.org/w/index.php?title=User_Guide_-_Communications&oldid=80700", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 1, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989178.64/warc/CC-MAIN-20150728002309-00321-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 93924315, "recordOffset": 93906249, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{44273=Copyright © 2015 Red Hat, Inc. and others. All Rights Reserved. For comments or queries, please contact us.}", "textBeforeTable": "Evolution allows you to create, store and send email by clicking the appropriate buttons located on the menu. Using Evolution To add a new account in the future, or to modify an existing account, launch the preferences dialog from the Edit > Preferences menu. In the dialog that appears, press the [Add] button to launch the Evolution Account Assistant again. The Receiving Email and Sending Email screens both require information from the e-mail provider. The Identity screen relates to personal information about the account, including Name, Organization and Address. There is also a Reply-To field, which will allow you to specify that recipients of mail from this account can reply to a different email address. Running the software for the first time displays the Evolution Setup Assistant wizard. Answer these questions using information provided by your ISP or e-mail provider. Start Evolution in KDE, using KMenu > Applications > Internet > Email menu entry. Start Evolution, in GNOME, using the Applications > Office > Evolution on the top menu bar. To configure an e-mail account: Configuring Evolution Evolution is a full featured email program. In addition to email it is a personal information manager(PIM), has a calendar, task manager and an address book for your contacts. More documentation for Evolution is available at: http://www.gnome.org/projects/evolution/documentation.shtml", "textAfterTable": "Thunderbird Thunderbird Is Mozilla’s email application, it is easy to organize, secure and customizable. You can install Thunderbird by clicking on System > Adnminstration > Add/Remove Software. In the Add/Remove Software find window type Thunderbird (next to the binoculars) and press [Enter]. Then select Thunderbird and the Calendar plugin if you would like. If you are moving from Windows to Fedoral wait to install the Calendar plugin. Now click [Apply] to start the installation. More information is available at: http://www.mozilla.org/support/thunderbird/ Configuring Thunderbird To configure your email account you will need the email information provided by your internet service or email provider. Open Thunderbird by going to the menu bar and click on Applications > Internet > Thunderbird. The first time you start Thunderbird the Account Wizard opens to guide you through the set up of your account. If the Account Wizard does not open select > Create New Account, in the current window , to open the wizard. Select Email account and press [Next]. Fill in your name and email address, click [Next]. Now choose POP or IMAP and type in the names of the Incoming and Outgoing servers and select [Next]. In this window, fill in your User Name for your email provider. Normally your Incoming and Outgoing User", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}