{"relation": [["Used for", "3 Stars Low Back Pain (Trypsin, Chymotrypsin) 4 to 8 tablets a day of proteolytic enzymes containing trypsin and chymotrypsin, and/or bromelain", "3 Stars Low Back Pain (Trypsin, Chymotrypsin) 4 to 8 tablets a day of proteolytic enzymes containing trypsin and chymotrypsin, and/or bromelain", "3 Stars Pancreatic Insufficiency Consult a qualified medical practitioner", "3 Stars Sprains and Strains 4 to 8 tablets a day of proteolytic enzymes containing trypsin, chymotrypsin, and/or bromelain", "2 Stars Celiac Disease Consult a qualified healthcare practitioner", "2 Stars Indigestion, Heartburn, and Low Stomach Acidity Consult a qualified healthcare practitioner", "2 Stars Osteoarthritis 90 mg of bromelain and 48 mg of trypsin, with 100 mg of rutosid, taken in enteric-coated pills three times per day", "2 Stars Tendinitis Several tablets per day of proteolytic enzymes", "1 Star Acne Rosacea Refer to label instructions", "1 Star Allergies and Sensitivities and Food Allergies Refer to label instructions", "1 Star Chronic Candidiasis Refer to label instructions", "1 Star Crohn’s Disease Refer to label instructions", "1 Star Low Back Pain Refer to label instructions"], ["Why", "Supplementing with a combination of the enzymes trypsin and chymotrypsin may improve low back pain. Three double-blind trials have investigated the effects of supplementing a combination of the enzymes trypsin and chymotrypsin for seven to ten days on severe low back pain with or without accompanying leg pain. Eight tablets per day were given initially in all trials, but in two trials the number of pills was reduced to four per day after two to three days. One of these trials reported small, though statistically significant improvements, for some measures in people with degenerative arthritis of the lower spine.1 People with sciatica-type leg pain had significant improvement in several measures in one trial,2 while another found the enzymes were not much more effective than a placebo.3 These trials included chronic low back conditions, so their relevance to acute LBP alone may be limited.", "Supplementing with a combination of the enzymes trypsin and chymotrypsin may improve low back pain. Three double-blind trials have investigated the effects of supplementing a combination of the enzymes trypsin and chymotrypsin for seven to ten days on severe low back pain with or without accompanying leg pain. Eight tablets per day were given initially in all trials, but in two trials the number of pills was reduced to four per day after two to three days. One of these trials reported small, though statistically significant improvements, for some measures in people with degenerative arthritis of the lower spine.1 People with sciatica-type leg pain had significant improvement in several measures in one trial,2 while another found the enzymes were not much more effective than a placebo.3 These trials included chronic low back conditions, so their relevance to acute LBP alone may be limited.", "Digestive enzymes are the mainstay of pancreatic insufficiency treatment and have been shown to reduce pain and steatorrhea associated with pancreatitis. The mainstay of treatment for pancreatic insufficiency is replacement of digestive enzymes , using supplements prepared from pig pancreas (pancrelipase) or fungi.7 Enzyme supplements have been shown to reduce steatorrhea8 , 9 associated with pancreatitis, while pain reduction has been demonstrated in some,10 , 11 though not all,12 , 13 double-blind studies. Digestive enzyme preparations that are resistant to the acidity of the stomach are effective at lower doses compared with conventional digestive enzyme preparations.14 Some enzyme preparations are produced with higher lipase enzyme content for improved fat absorption, but one controlled study of chronic pancreatitis found no advantage of this preparation over one with standard lipase content.15 People with more severe pancreatic insufficiency or who attempt to eat a higher-fat diet require more enzymes,16 but large amounts of pancreatic digestive enzymes are known to damage the large intestine in some people with diseases causing pancreatic insufficiency.17 , 18 , 19 Therefore, a qualified healthcare practitioner should be consulted about the appropriate and safe amount of enzymes to use. Many otherwise healthy people suffer from indigestion , and some doctors believe that mild pancreatic insufficiency can be a cause of indigestion. A preliminary study of people with indigestion reported significant improvement in almost all of those given pancreatic enzyme supplements.20 One double-blind trial found that giving pancreatic enzymes to healthy people along with a high-fat meal reduced bloating, gas, and abdominal fullness following the meal.21 Stomach surgery patients often have decreased pancreatic function, malabsorption , and abdominal symptoms, including steatorrhea, but digestive enzyme supplementation had no effect on steatorrhea in two of three double-blind studies of stomach surgery patients,22 , 23 , 24 although some other symptoms did improve.25 , 26 Patients who have surgery to remove part of the pancreas often have severe steatorrhea that is difficult to control with enzyme supplements.27 In one double-blind study, neither high-dose nor standard-dose pancreatin was able to eliminate steatorrhea in over half of the pancreas surgery patients studied.28", "Proteolytic enzymes, including bromelain, may be helpful in healing sprains and strains because they are anti-inflammatory and appear to promote tissue healing. Several preliminary trials have reported reduced pain and swelling, and/or faster healing in people with a variety of conditions using either bromelain,29 papain from papaya, 30 , 31 or a combination of trypsin and chymotrypsin.32 Double-blind trials have reported faster recovery from athletic injuries, including sprains and strains, and earlier return to activity using eight tablets daily of trypsin/chymotrypsin,33 , 34 , 35 , 36 four to eight tablets daily of papain,37 eight tablets of bromelain (single-blind only),38 or a combination of these enzymes.39 However, one double-blind trial using eight tablets per day of trypsin/chymotrypsin to treat sprained ankles found no significant effect on swelling, bruising , or overall function.40 Bromelain is measured in MCUs (milk clotting units) or GDUs (gelatin dissolving units). One GDU equals 1.5 MCU. Strong products contain at least 2,000 MCU (1,333 GDU) per gram (1,000 mg). A supplement containing 500 mg labeled “2,000 MCU per gram” would have 1,000 MCU of activity, because 500 mg is half a gram. Some doctors recommend 3,000 MCU taken three times per day for several days, followed by 2,000 MCU three times per day. Some of the research, however, uses smaller amounts, such as 2,000 MCU taken in divided amounts in the course of a day (500 MCU taken four times per day). Other enzyme preparations, such as trypsin/chymotrypsin, have different measuring units. Recommended use is typically two tablets four times per day on an empty stomach, but as with bromelain, the strength of trypsin/chymotrypsin tablets can vary significantly from product to product.", "Some evidence suggests that enzyme supplements may be useful at the beginning of dietary treatment for this disease. People with celiac disease often do not produce adequate digestive secretions from the pancreas, including lipase enzymes 41 In a double-blind trial, children with celiac disease who received a pancreatic enzyme supplement along with a gluten-free diet gained significantly more weight in the first month than those treated with only a gluten-free diet.42 However, this benefit disappeared in the second month, suggesting enzyme supplements may only be useful at the beginning of dietary treatment.", "Lipase, a pancreatic enzyme, aids in the digestion of fats and may improve digestion in some people. Lipase , a pancreatic enzyme , aids in the digestion of fats and may improve digestion in some people. In a double-blind trial, a timed-release form of pancreatic enzymes was shown to significantly reduce gas, bloating, and fullness after a high-fat meal.43 Participants in this study took one capsule immediately before the meal and two capsules immediately after the meal. The three capsules together provided 30,000 USP units of lipase , 112,500 USP units of protease, and 99,600 USP units of amylase. However, the amount of pancreatic enzymes needed may vary from person to person, and should be determined with the help of a doctor.", "In one study, people with painful osteoarthritis of the knee who received an oral enzyme-flavonoid preparation saw more improvement in pain and joint function than those who took a nonsteroidal anti-inflammatory (NSAID). In a double-blind study, a group of people with painful osteoarthritis of the knee received an oral enzyme -flavonoid preparation or a nonsteroidal anti-inflammatory (NSAID) for six weeks. While both treatments relieved pain and improved joint function, the enzyme-flavonoid product appeared to be slightly more effective than the NSAID. No serious side effects were seen.44 The enzyme-flavonoid product used in this study was Phlogenzym (Mucos Pharma, Geretsried, Germany). Each enteric-coated tablet contained 90 mg of bromelain, 48 mg of trypsin, and 100 mg of rutosid (a derivative of the flavonoid rutin); one tablet was given three times a day.", "Supplementing with digestive enzymes may reduce the severity of symptoms and speed healing. Alternative healthcare practitioners frequently recommend proteolytic enzymes for various minor injuries. Research demonstrates that these enzymes are well absorbed when taken by mouth,45 , 46 and preliminary47 , 48 , 49 , 50 and double-blind51 , 52 , 53 , 54 trials have shown their effectiveness for reducing pain and swelling associated with various injuries and for speeding up the healing process. Unfortunately, many of these studies did not specifically identify the patients’ injury, so it is unclear whether the positive results included improvements in tendinitis.", "Digestive enzymes have been reported anecdotally to improve rosacea symptoms. Some people with rosacea have been reported to produce inadequate stomach acid .55 In a preliminary trial, supplemental hydrochloric acid, along with vitamin B complex, improved some cases of rosacea in people with low stomach-acid production.56 Similarly, improvement in rosacea has been reported anecdotally after supplementation with pancreatic digestive enzymes , and a controlled study found that rosacea patients produced less pancreatic lipase than healthy people.57 Controlled trials are needed to evaluate the effects of hydrochloric acid and digestive enzyme supplements in rosacea. Hydrochloric acid supplements should not be taken without the supervision of a healthcare practitioner.", "Proteolytic enzymes may theoretically reduce allergy symptoms by breaking down undigested protein to sizes that are too small to cause allergic reactions. According to one theory, allergies are triggered by partially undigested protein. Proteolytic enzymes may reduce allergy symptoms by further breaking down undigested protein to sizes that are too small to cause allergic reactions.58 Preliminary human evidence supports this theory.59 Hydrochloric acid secreted by the stomach also helps the digestion of protein, and preliminary research suggests that some people with allergies may not produce adequate amounts of stomach acid.60 , 61 , 62 However, no controlled trials have investigated the use of enzyme supplements to improve digestion as a treatment for food allergies.", "Digestive enzymes inhibit the overgrowth of candida and prevent it from becoming established in the small intestine. It is unknown if taking pancreatic enzymes or betaine HCl (hydrochloric acid) tablets is beneficial for chronic candidiasis. Nonetheless, some doctors recommend improving digestive secretions with these agents. Hydrochloric-acid secretion from the stomach, pancreatic enzymes, and bile all inhibit the overgrowth of Candida and prevent its penetration into the absorptive surfaces of the small intestine.63 , 64 , 65 Decreased secretion of any of these important digestive components can lead to overgrowth of Candida in the gastrointestinal tract. Consult a physician for more information.", "Supplementing with enzymes might improve the nutrient malabsorption that is often associated with Crohn’s disease. People with Crohn’s disease may be deficient in pancreatic enzymes , including lipase .66 In theory, supplementing with enzymes might improve the nutrient malabsorption that is often associated with Crohn’s disease. However, people with Crohn’s disease considering supplementation with enzymes should consult a doctor.", "Several trials have reported reduced pain and swelling, and/or faster healing in people with a variety of conditions who use papain. Several preliminary trials have reported reduced pain and swelling, and/or faster healing in people with a variety of conditions using either bromelain,67 papain from papaya, 68 , 69 or a combination of trypsin and chymotrypsin.70 Double-blind trials have reported faster recovery from athletic injuries, including sprains and strains, and earlier return to activity using eight tablets daily of trypsin/chymotrypsin,71 , 72 , 73 , 74 four to eight tablets daily of papain,75 eight tablets of bromelain (single-blind only),76 or a combination of these enzymes.77 However, one double-blind trial using eight tablets per day of trypsin/chymotrypsin to treat sprained ankles found no significant effect on swelling, bruising , or overall function.78"]], "pageTitle": "Digestive Enzymes, Cam Information in Evansville, IN - St. Mary's Health System", "title": "", "url": "http://www.stmarys.org/body.cfm?id=805&action=detail&AEProductID=HW_CatholicCam&AEArticleID=hn-2840008", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 36, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989178.64/warc/CC-MAIN-20150728002309-00038-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 734573303, "recordOffset": 734544498, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{131774=84. Shaw D et al. Traditional remedies and food supplements: a 5-year toxicological study (1991-1995). Drug Safety 1997;17:342-56., 120057=21. Suarez F, Levitt MD, Adshead J, Barkin JS. Pancreatic supplements reduce symptomatic response of healthy subjects to a high fat meal. Dig Dis Sci 1999;44:1317-21., 128458=66. Hegnhoj J, Hansen CP, Rannem T, et al. Pancreatic function in Crohn's disease. Gut 1990;31:1076-9., 140146=Copyright © 2014 Aisle7. All rights reserved. Aisle7.com, 131563=83. Suarez F, Levitt MD, Adshead J, Barkin JS. Pancreatic supplements reduce symptomatic response of healthy subjects to a high fat meal. Dig Dis Sci 1999;44:1317-21., 139838=Last Review: 04-15-2014, 130256=77. Baumüller M. Therapy of ankle joint distortions with hydrolytic enzymes—results from a double blind clinical trial. In Hermans GPH, Mosterd WL, eds. Sports, Medicine and Health. Amsterdam: Excerpta Medica, 1990, 1137., 124322=43. Suarez F, Levitt MD, Adshead J, Barkin JS. Pancreatic supplements reduce symptomatic response of healthy subjects to a high fat meal. Dig Dis Sci 1999;44:1317-21., 140504=The information presented in Aisle7 is for informational purposes only. It is based on scientific studies (human, animal, or in vitro), clinical experience, or traditional usage as cited in each article. The results reported may not necessarily occur in all individuals. For many of the conditions discussed, treatment with prescription or over the counter medication is also available. Consult your doctor, practitioner, and/or pharmacist for any health problem and before using any supplements or before making any changes in prescribed medications. Information expires June 2015., 123488=39. Baumüller M. Therapy of ankle joint distortions with hydrolytic enzymes—results from a double blind clinical trial. In Hermans GPH, Mosterd WL, eds. Sports, Medicine and Health. Amsterdam: Excerpta Medica, 1990, 1137., 124103=42. Carroccio A, Iacono G, Montalto G, et al. Pancreatic enzyme therapy in childhood celiac disease. A double-blind prospective randomized study. Dig Dis Sci 1995;40:2555-60., 128314=65. Sarker SA, Gyr R. Non-immunological defense mechanisms of the gut. Gut 1990;33:1331-7 [review].}", "textBeforeTable": "This supplement has been used in connection with the following health conditions: 1 Star For an herb, supported by traditional use but minimal or no scientific evidence. For a supplement, little scientific support. 2 Stars Contradictory, insufficient, or preliminary studies suggesting a health benefit or minimal health benefit. 3 Stars Reliable and relatively consistent scientific data showing a substantial health benefit. For over a decade, our team has combed through thousands of research articles published in reputable journals. To help you make educated decisions, and to better understand controversial or confusing supplements, our medical experts have digested the science into these three easy-to-follow ratings. We hope this provides you with a helpful resource to make informed decisions towards your health and well-being. Our proprietary “Star-Rating” system was developed to help you easily understand the amount of scientific support behind each supplement in relation to a specific health condition. While there is no way to predict whether a vitamin, mineral, or herb will successfully treat or prevent associated health conditions, our unique ratings tell you how well these supplements are understood by the medical community, and whether studies have found them to be effective for other people.", "textAfterTable": "How It Works How to Use It The digestive enzymes—proteolytic enzymes, lipases , and amylases—are generally taken together. Pancreatin, which contains all three digestive enzymes, is rated against a standard established by the U.S. Pharmacopeia (USP). For example, “4X pancreatin” is four times stronger than the USP standard. Each “X” contains 25 USP units of amylase, 2 USP units of lipase, and 25 USP units of protease (or proteolytic enzymes). Three to four grams of 4X pancreatin (or a lower amount at higher potency) with each meal is likely to help digest food in some people with pancreatic insufficiency. Those with chronic pancreatitis need to discuss enzyme intakes with their physician. Under medical supervision, seriously ill people with pancreatic insufficiency caused by pancreatitis are given very high levels of enzymes to improve fat digestion. In one successful trial, enough pancreatin was used with each meal to supply slightly over 1,000,000 USP units of lipase.79 Because pancreatin is rapidly emptied from the stomach during digestion, people taking these enzymes may obtain better results by spreading out supplementation throughout the meal.80 Supplemental enzymes that state only product weight, but not activity units, may lack potency. Where to Find It Only small amounts of the animal-based proteolytic enzymes, trypsin and chymotrypsin, are found in the diet; however, the pancreas can synthesize these", "hasKeyColumn": false, "keyColumnIndex": -1, "headerRowIndex": 0}