{"relation": [["Land use type", "Agriculture", "Forest", "Snow-covered", "Pasture", "Water", "Settlements and roads", "Others(wasteland, barren land and slopes0", "Total"], ["Total area (1,000 ha)", "2,653.3", "5,533.4", "2,246.2", "1,978.5", "400.0", "103.3", "1,803.3", "14,718.0"], ["Share (%)", "18.0", "37.6", "15.3", "13.4", "2.7", "0.7", "12.3", "100.0"]], "pageTitle": "Farm-made aquafeeds", "title": "Table 1. Land use in Nepal", "url": "http://www.fao.org/docrep/003/V4430E/V4430E06.htm", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 17, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989891.18/warc/CC-MAIN-20150728002309-00319-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 446463559, "recordOffset": 446423357, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{25885=Anon. 1990. Statistik Perikanan Indonesia. Direktoral Jenderal Perikanan. 74 p., 26426=Bastari, T. 1989. Status dan Proyeksi Bahan Baku Pakan Ikan. Temu Karya Ilmiah, p. 6-10. In Penelitian Menuju Swasembada Pakan Ikan Budidaya. Jakarta, 30-31 August 1989. Pusat Penelitian dan Pengembangan Perikanan. Badan Penelitian dan Pengembangan Pertanian., 24783=Figure 1. Share of shrimp culture systems in Indonesia in 1987 and projection for 1995, 24514=Assumptions: Intensive ponds-private investment progamme, 5 t/ha/yr, 1.6:1 FCR Semi-intensive ponds-intensification progamme, 1.2t/ha/yr, 1.0:1 FCR Extensive ponds-0.03 t/ha/yr, 89186=Research and development of aquafeeds is one of the responsibilities of the Department of Fisheries. The Department acknowledged the importance of formulated feeds when it established the feed section of the Fisheries Research Institute (FRI) in Penang in 1976. Since the establishment of the research branch of the Brackishwater Aquaculture Research Centre (BARC) in Johor in 1979, the feed section has been expanded to cover pond growout feeds for marine fish and shrimp. When the National Prawn Fry Production and Research Centre (NAPFRE) in Kedah was established in 1987, its feed section concentrated on larval and postlarval feeds for shrimp and other crustaceans (Figures 5 and 6). Research on freshwater fish feeds began in 1975 at the Freshwater Fish Research Centre (FFRC) in Malacca. Several universities also carry out aquafeed research, including the Universiti Pertanian Malaysia. The mailing addresses of the above institutes are given in Annex 1., 94449=Fisheries Department of Malaysia 81550 Gelang Patah Johor, 27905=Martosubroto, P. and N. dan Nurzali. 1985. Sumberdaya Perikanan dan Industri Tepung Ikan. Rapat Teknis Tepung Ikan, Jakarta, 28-29 May 1985. Badan Penelitian dan Pengembangan Pertanian., 91155=Total annual production of freshwater fish was around 9,700 t in 1990. Based on experience in the production of freshwater fish, the apparent feed conversion (AFCR) is estimated at 2.5. Thus 24,300 t of feed would be sufficient to feed all the cultured freshwater fish in the country, assuming that all fish were given formulated feeds alone. Pond experiments have shown that, in the case of black tiger shrimp and seabass, an AFCR of 2.5 can also be obtained with local feeds. Therefore another 12,800 t of feed would be sufficient to produce the 1990 production (5,100 t) of brackishwater/marine finfish and shrimp. The total feed for aquaculture species calculated in this arbitary way would amount to 37,100 t/yr, or 119 t/day (for 312 working day per year)., 109019=Source: FDD Annual Report 1991/92 (unpublished), 28588=Poespodiharno, S. 1985. Peronasalahan Produksi dan Konsumsi Tepung Ikan. Rapat Technis Tepong Ikan. Jakarta, 28-29 May, 1985. Pusat Penelitan dan Pengenbangan Perikanan. Badan Penelitian dan Pengenbangan Pertanian., 93993=Yaakob, A. 1991. Studies on monoculture of freshwater prawn: effectiveness and viability. Paper presented at the IRPA Seminar (Socio-economic Sector), UUM, Kedah, Malaysia., 149948=Pantha, M.B. 1991. History of fish culture in Nepal: past, present situation and future strategies (unpublished). 16 p., 99942=The per caput availability of fresh fish was 0.86 kg/yr and of dried/ processed fish 0.01 kg/yr in 1990/91 (Table 3). Exports of fresh fish have declined from an estimated 3,000 t in the mid eighties to a few hundred tons annually, probably due to the overall effect of fish disease outbreaks (EUS) and increasing domestic demand., 149440=FDD. 1991. Fisheries Development Division Budgeting Norms for 1991/92. 25 p., 106192=Systematic aquaculture began in the late 1950's with the introduction of the exotic common carp. By 1960, fingerlings of common carp were successfully produced and distributed to fish farmers. Chinese carps (silver, bighead, and grass carps) were introduced after 1965, when induced breeding techniques were also adopted for the indigenous fish rohu, mrigal and catla (Pantha 1979). Fish polyculture, using all the seven fish species, started after 1980, with the launching of the First and Second Aquaculture Development Projects (Pantha 1991)., 117971=Based on the total feed and manure used in the private sector (Tables 9 and 10) and the total production (Table 5), feeding costs are only US$ 65/t of fish produced. This is mainly due to the fact that a large proportion of the fish production comes from village ponds. Most of the feeding and manuring is done by farmers who constructed their ponds after 1980. Therefore the national average cost of feeding and manuring is low, compared to that in other countries. In the government sector the feed and manuring cost of fingerling production is US$ 1.42/1,000 fingerlings (US$ 1.27 for feed and US$ 0.15 for fertilizers). In the case of market-sized fish production under the outreach programme, the cost of feed and manuring is US$ 242/t (US$ 180 for feed and US$62 for fertilizers). Since the average farm-gate value of fish in Nepal is US$ 0.825/kg, the value of the national farmed production is nearly US$ 7.7 million. National feed and manure costs are less than 10% of this figure., 141421=Organic manure (1% N, 0.7% P2O5) is applied to broodstock ponds at 2,000 t/ha as a basal dose during pond preparation. Inorganic fertilizers are used at a 1:2 N:P ratio, i.e., 917 kg of urea and about 1,900 kg of TSP. One-sixth of this is applied as a basal dose and the remainder is split into 23 doses at 15-day intervals., 97570=Nepal is predominantly agricultural. Nearly 90% of the population is involved in agriculture, which includes livestock, forestry and fisheries, accounting for about 56% of G.D.P. in 1990/91 (CBS 1992). Per caput animal protein consumption was 7.5 kg/yr in 1990, out of which fisheries contributed 809 g/yr (10.8%). Crops represented 61% of the agricultural GDP, while livestock contributed 27%, forestry 11% and fisheries only about 1%. The GDP per caput is estimated to be about US$ 170 in 1988/89. Agriculture accounts for about 75% of exports and it absorbs more than 90% of the labour force., 98189=The total nutrients available per caput per day, in terms of calories, protein and fat in 1990/91 were 2,288 kcal, 61.5 g and 30.4 g respectively. The contribution of fish and fish products was extremely low (Table 2)., 107110=The fish production statistics of Nepal show that from 1979/80 to 1991/92 the fish culture area increased from 890 ha to 4,664 ha (424%) and aquaculture production rose from 1,150 t to 9,296 t (708%) (Table 5). Average capture fisheries production and the per caput fish consumption increased in the same period by 140% and 136%, respectively., 76355=About 311,000t of trash fish was available in the country in 1990. Trash fish was used for feeding cultured finfish and crustaceans (like mud crab) and for manufacturing fish meal., 70869=Figure 2. Cultured finfish and crustacean production in Malaysia by major species groups in 1990, 150304=Rajbanshi, K.G. 1982. A general bibliography on fish and fisheries of Nepal. Royal Nepal Academy, Kathmandu. 96 p., 93620=Anon. 1991. Annual Fisheries Statistics 1990. Department of Fisheries, Malaysia. 172 p. Pathmasothy, S. 1989. The culture of all-male, all-female and mixed-sex batches of Nile tilapia in static pond, 9 p. In A.A. Jothy (ed.) Proceedings of Fisheries Research Seminar, 1988. Department of Fisheries, Kuala Lumpur., 25567=Anon. 1989. Status dan Perkembangan Industri Pakan, p. 1-20. In Temu Karya llmiah Penelitian Menuju Program Swasembada Pakan Ikan Budidaya. Jakarta, 30-31 August 1989. Pusat Penelitian dan Pengembangan Perikanan. Badan Penelitian dan Pengembangan Pertanian., 18387=Further increases in production are likely, particularly in shrimp culture. This is supported by intensification, the rate of which is around 10% per year, and by the expansion of the area under shrimp farming. Accordingly, the requirement for feed will also increase. However, the increase in the amount of feed required will not exactly correspond to the scale of intensification, since the latter also includes semi-intensive systems. So far the FCR in intensive pond culture is about 1.6:1, while in semi-intensive pond culture it is 2.0:1. The average production in intensive ponds is about 5 t/ha/yr. In semi-intensive ponds, it is around 1.2 t/ha/yr. The potential for the use of aquafeeds for shrimp culture, as estimated by Hardjolukito in 1989, is shown in Table 16 and Figures 1 and 2., 101147=The demand for fish is very high and is met mainly by domestic production but partly by importing fish from neighbouring countries. Fish exports to India declined from 290 t in 1986/87 (APROSC 1989) to about 11 t in 1990/91 (MSD 1992)., 26987=Djajasewaka, H. and P. Sumpeno. 1986. Peranan Pakan Dalam Budidaya Ikan dan Udang, Seminar Hari Pangan Sedunia ke VI. Jakarta, 16 October 1986., 26746=Djajasewaka, H. and S. Ningrum. 1985. Kualitas dan Kuantitas Tepung Ikan dalam Ransum Ikan. Rapat Teknik Tepung Ikan. Jakarta, 28-29 May 1985, Badan Penelitian dan Pengembangan Pertanian., 27477=Hardjolukito, S. 1989 b. Potensi Pengem bangan Usaha Pabrik Pakan Udang dan Peranan Pola TIR dalam distribusinya. Lokakarya Efisiensi Penggunaan Pakan Udang. Direktorat Jenderal Perikanan., 26018=Anon. 1992. Buletin Warta Mina No. 68. Direktorat Jenderal Perikanan, Jakarta. 43 p. Ariyani, F. 1989. Pemanfaatan Limbang Udang Sebagai Komponen Pakan Udang, p. 96-106. In Temu Karya Ilmiah Menuju Swasembada Pakan Ikan Budidaya. Jakarta, 30-31 August 1989. Pusat Penelitian dan Pengembangan Perikanan. Badan Penelitian dan Pengembangan Pertanian., 7632=A decree of the Minister of Industry No. 37/M/SK/3/1992 which refers to the establishment of Indonesian standards for the shrimp feed industry. The principle of this decree covers quality standards (Table 14), sampling methods, formulation, and labeling. Standards for labeling include the trade mark, the nature of the feed, net weight, ingredients and nutritive content., 117028=Even before 1980, fish farming was considered to be a profession only for the fishermen caste or for farmers of low status. The government has given first priority to exploiting the waters of village ponds by adopting low cost fish culture technologies. Fish culture practices started first with the monoculture of common carp, which was followed by polyculture, in which emphasis was given to those species which thrive best on natural plankton food., 65336=UTAMA, C.M. 1993. Aquafeeds and feeding strategies in Malaysia, p.282-296. In M.B. New, A.G.J. Tacon and I. Csavas (eds.) Farm-made aquafeeds. Proceedings of the FAO/ AADCP Regional Expert Consultation on Farm-Made Aquafeeds, 14-18 December 1992, Bangkok, Thailand, FAO-RAPA/AADCP, Bangkok, Thailand, 434 p., 116093=From the data given in the Tables 6 and 8, which are based on a field survey of private fish farmers conducted by the Department of Food and Agricultural Marketing Service in 1991, it is obvious that the farmers are stocking common carp at 21%, Chinese carps at 36% and Indian major carps at 43%, while the government recommendation is 25% common carp, 55% Chinese carps and 20% Indian major carps. This is mainly because the farmers get higher market prices and better keeping quality during marketing for Indian major carps than for Chinese carps. Two groups of carps are cultivated, which have different feeding habits, namely:, 27184=Hardjolukito, S. 1989 a. Prospek Pengembangan Pabrik Pakan Udang Dalam Persangan Dengan Pakan Impor Pada Situasi Pasaaran Udang yang menurun, p. 88-94. In Prosiding Lokakarya Industri Budidaya Udang. Balai Budidaya Air Payau Jepara., 150472=Sharma, B.P. 1989. Status of Aquaculture Development in Nepal. 10p. In Aquaculture in Asia. Asian Fisheries Society, Indian Branch, Bombay, India., 95119=PANTHA, M.B. 1993. Aquafeeds and feeding starategies in Nepal, p. 297-316. In M.B. New, A.G.J. Tacon and I. Csavas (eds.) Farm-made aquafeeds. Proceedings of the FAO/ AADCP Regional Expert Consultation on Farm-Made Aquafeed, 14-18 December 1992, Bangkok, Thailand. FAO-RAPA/AADCP, Bangkok, Thailand, 434 p., 19193=The development of aquafeeds for other species also has good potential, due to the increase in the number of species cultured in both brackish and freshwater. As noted before, according to fisheries statistics for 1990, the production of freshwater aquaculture in cages is increasing rapidly, by 44.3% per year. This trend is likely to continue. Finally, common carp and red tilapia will require higher quality feed than that currently available., 148927=APROSC. 1989. ADB Evaluation Division - Impact study of agriculture financing in Nepal. APROSC Agricultural sector strategy of the Eighth Plan (1990-95). 55 p., 65748=The aquaculture industry in Malaysia is basically categorized into freshwater and brackishwater culture. Freshwater culture sites consist of freshwater ponds, freshwater cages and ex-mining pools. On the other hand, brackishwater culture includes brackishwater ponds, brackishwater cages, cockle, mussel and oyster culture (Figure 1). The area of fresh water and brackishwater aquaculture in 1990 is shown in Table 1., 29109=Wahyono, U. 1989. Status Produksi Udang Indonesia. Lokakarya Industri Udang. Jepara, 25- 28 September 1989., 150819=Terashima, A. 1984. Three new species of the Cyprinid genus Schizothorax from Lake Rara, North Western Nepal. Japanese Journal of Ichthyology 31 (2):122-135., 28384=Mathius, I.W. 1992. Penggunaan hijauan glicinidia sebagai pakan pengganti hijauan lomtoro. Jurn. Penelitian dan Pengembangan Pertanian, Vol. X, 1:1-7., 28856=Poernomo, A. 1985. Persyaratan Pakan Untuk Budidaya Pantai. Rapat Teknis Tepung Ikan. Jakarta, 28-29 May 1985. Pusat Penelitian dan Penembangan Perikanan. Badan Penelitian dan Pengembangan Pertanian., 149140=CBS. 1991. Statistical Year Book of Nepal. Central Bureau of Statistics, Kathmandu, Nepal. 15 p., 103596=Nepal, with an average width of 193 km and a difference in elevation of more than 8,800 m, has, within some river systems, habitats ranging from cold to warm water, and a corresponding range in fish species. Since almost all rivers flow into the Ganga river system in India, this also enriches the fish fauna of Nepalese rivers, although there are some non-migratory fish species. 172 indigenous fish species in the various water systems were reported by Rajbanshi (1982) and 176 by Terashima (1984). These occur from a few hundred metres elevation to 4,000 m above sea level. Besides these, ten warm and coldwater fish and one prawn species have been introduced into Nepal since 1956. Exotic fish species recommended for warm water aquaculture are common carp (Cyprinus carpio), silver carp (Hypophthalmichthys molitrix), bighead carp (Aristichthys nobilis), and grass carp (Ctenopharyngodon idella), along with three high-value indigenous fish species, namely rohu (Labeo rohita), mrigal (Cirrhinus mrigala) and catla (Catla catla)., 67380=* ponds constructed in 1990 Source: Department of Fisheries, Malaysia (1991)., 27719=Jangkaru, Z. 1981. Intensive Fish Culture in Indonesia. Indonesian Agricultural Reasarch and Development Journal, Vol. III, 4:95-98., 148665=ADB. 1991. Agricultural Research Study. Fisheries and Agricultural Research in Nepal: 1975- 2005. A study team report prepared for the National Agricultural Research Centres and ADB (Ts. No. 1182, NEP). 90 p., 67512=Total aquaculture production in Malaysia was about 52,300 t in 1990 (Anon. 1991). Cockle production, at 37,514 t, accounts for 71 %, freshwater fish culture production, estimated at 9,690 t, accounts for 19% and brackishwater/ marine finfish and shrimp culture production, estimated at 5,100 t, accounts for 10% of total annual aquaculture production. The production, broken down by culture systems and by species, is shown in Tables 2 and 3, respectively, and illustrated in Figure 2., 150679=Sharma, K.R. 1992. Some thoughts on irrigation sector. Gorkhapatra, 21 September 1992., 112481=Figure 1. Fish production in Nepal in 1991/92 (total production 16,516 t), 94362=11800 Glugor Penang, 716=The shrimp hatchery business is also developing. Martosubroto and Wibisono (1989) reported that, up to 1989, 113 hatchery companies have been recorded. In the last two years, hundreds of backyard hatchery units have also been developed. Unfortunately, this rapid development has not been instantly followed by adequate domestic feed supply. So far, 90 % of the larval feed required is still imported., 25100=Anon. 1985 a. Kemungkinan Pengalokasian Sebagian Sumberdaya Hayati Perikanan Untuk Bahan Baku Tepung Ikan. Rapat Teknis Tepung Ikan, Jakarta, 28-29 May 1985. Badan Penelitian dan Pengembangan Pertanian., 97204=60-80% of the annual precipitation falls during the monsoon season (June to September); rainfall depends on the southeast winds. The average annual rainfall is about 1,600 mm. An extreme maximum temperature of 44°C was recorded at Dhangadhi in 1983. The population of the country is about 18.5 million, with a growth rate of 2.08% per annum (CBS 1992)., 12575=Presidential Decree No. 85, 1982 regulates the use of the shrimp by-catch which has to be rendered to the Fisheries State Enterprise for utilization according to the public interest., 149570=MSD. 1992. Food Balance Sheet of Nepal, 1990/91. Marketing Service Division. 29 p., 149290=CBS. 1992. Statistical Pocket Book, Nepal. Central Bureau of Statistics, Kathmandu, Nepal. 12 p., 149706=Pantha, M.B. 1979. Induced spawning of Catla catla, 12 p. In Proceedings of the Fourth National Fisheries Seminar, 22-29 November 1979, FDC, Harihar Bhawan, Kathmandu, Nepal., 28144=Martosubroto, P. and R. Wibisono. 1989. Menuju Industri Budidaya Udang Berwawasan Lingkungan, p. 116-122. In Prosiding Lokakarya Industri Budidaya Udang. Balai Budidaya Air Payau., 145224=There is no specific regulation for aquafeed manufacturing but there is a feedstuff law enacted in 1976, and feedstuff by-laws of 1984, which give detailed rules and regulations regarding the procurement, storage, marketing and quality control of animal feeds generally. These are only available in the Nepali language., 146539=In the near future about 78,000 ha of new reservoirs are expected to be constructed for hydro-power generation. Pond area is expected to expand in the low-lying parts of the paddy field area. Similarly, the area of irrigated rice is expected to increase by 700,000 ha by the end of the 10th Five Year Plan period, e.g. by 2005. Visualizing the country's existing water resources and its future potential, there is great scope for expansion, in terms of area and intensification, of fish production in Nepal., 12311=A circular letter of the Minister of Agriculture to all governors, dated 4 October 1973, states that the fish meal supply can be obtained from fisheries waste products, and was issued to reinforce efforts to increase village processing industries., 72138=Most local feed mills, with their long experience in animal feed production, can source ingredients globally. However, for the sake of freshness, local or regional supplies are preferred. The main feed ingredients imported into Malaysia in 1990 are shown in Table 4, while the proximate composition of some of the available feed ingredients is shown in Table 5., 112636=Figure 2. Cultured and captured fish production in Nepal in 1991/92, 66240=Figure 1. Estimated aquaculture production in Malaysia in 1990, 126315=Although there are more than 30 feed mills in Nepal, with production capacities of 1-10 t/day, all except one produce only animal and poultry feeds. The Animal Feed Production and Development Committee (AFPDC), Hetauda, is operated by the public sector and is responsible for producing fish feeds, as well as cattle and popultry feeds. The total amount of fish feed No.1 (22% protein) and No.3 (16% protein) supplied to government fish farms in 1991/92 was 14 t and 95 t, respectively (Table 13). The AFPDC imported 931 t of nine types of feed ingredients and feed additives in 1991/92 from India (Table 14), out of which only some ingredients were used for the manufacturing of fish feeds., 109076=Seven fish species (all carps) are recommended by the government for polyculture. Stocking densities range from 7,000- 15,000/ha, depending on the intensity of production, but stocking is reduced to 5,000-10,000/ha when using large fingerlings of 2-3\" size. The total pond area, total fish production and average yield for each species is shown in Table 6. The total fish production of the country coming from capture and culture operations in different water bodies was 16,516 t in 1991/92 (Table 7). The percentage of total fish production from different water bodies for 1991/92 is given in Figures 1 and 2. Stocking rates, fish mortality, average weight of harvested fish and the yield of each species is given in Table 8., 25356=Anon. 1985 b. Permasalahan Produksi dan Konsumsi Tepung Ikan. Rapat Teknis Tepung Ikan, Jakarta, 28-29 May 1985. Badan Penelitian dan Pengembangan Pertanian., 150121=Pradhan, B. 1987. Potential of reservoir fishery development in Asia, 12 p. In Proceedings of a Workshop, Kathmandu. IDRC.}", "textBeforeTable": "Commercial feeds are applied to both intensive and semi-intensive tiger shrimp culture. At present, feeding regimes in semi-intensive culture are almost the same as those in intensive ones, except for feeding frequency (Table 12). The different characteristics of intensive and semi-intensive culture are shown in Table 13. Farmers operating traditional ponds usually rely on natural food and household waste products. Sometimes the farmers themselves make simple artificial feeds, such as mixtures of fine rice bran and soybean cake. Commercial feeds given in intensive freshwater aquaculture are fed at about 3 % of biomass per day. For common carp and red tilapia, feed is broadcast over the surface of the water. ON-FARM FEEDING STRATEGIES Fish farmers in Indonesia formulate their feeds using raw materials which are readily available and meet the nutrient requirements. Formulated feeds made by researchers are better than those made by farmers, because they use feed additives. For research purposes purified diets are often used. Some freshwater fish farmers, however, still prepare feed for themselves. The feed is made by means of simple equipment, such as manual meat mincers. They use easily available local raw materials, such as rice bran, cassava leaves, soybean cake, etc. These on-farm feeds are usually used for common carp, gourami and red tilapia. Currently the majority of fish farmers applying intensive technology prefer to use commercial feeds rather than to make their own feed. This is because the former are considered more practical, whereas making on-farm feeds requires a lot of time", "textAfterTable": "9 3 29-35 2.1 9 4 2.4 8 3 36-42 3.5 8 4 3.8 7 3 43-49 5.5 6 5 5.9 6 3 50-56 7.2 5 5 7.7 5 4 57-63 9.0 4 5 9.5 4 4 64-70 11.5 4 5 12.0 4 4 71-77 14.5 3.5 6 15.0 3.5 4 78-84 17.0 3.5 6 18.0 3.5 5 85-91 20.0 3.5 6 21.0 3.0 5 92-98 22.5 3.0 6-7 23.5 3.0 5 99-105 25.0 3.0 6-7 27.0 3.0 5 106-112 27.5 3.0 6-7 29.5 2.5 5 113-120 30.5 2.5 6-7 32.5 2.5 5 120< 33.5 2.5 6-7 34.5 2.5 5 Table 13. Characteristics of Penaeus monodon culture systems in Indonesia Characteristics Intensive Semi-intensive Notes Size of pond (m²) 5,000-8,000 5,000-10,000 applied before stocking according to the density of the natural food Stocking density (pc/m²) 30-35 10-13 Fertilization once in 5-7 days once in 5-7 days Water depth (cm) 120-160 80-110 %placed in feeding trays Water exchange (%/day) 30-40 10-15 Paddlewheel aerators (pc) 4-8 none Feeding control (%) 1-2.5 1-2 Feed conversion rate (FCR) 1.6-2:1 1.1-1.3:1 MAJOR INSTITUTIONS INVOLVED IN AQUAFEED RESEARCH AND DEVELOPMENT Several institutions are involved in fish", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}