{"relation": [["REACTION", "Negative", "One Plus", "Two Plus", "Three Plus", "Four Plus"], ["SYMBOL", "-", "+", "++", "+++", "++++"], ["CRITERIA", "No wheal. Erythema absent or very slight (not more than 1 mm diameter).", "Wheal absent or very slight erythema present (not more than 3 mm diameter).", "Wheal not more than 3mm or erythema not more than 5mm diameter.", "Wheal between 3mm and 5mm diameter, with erythema. Possible pseudopodia and itching.", "A larger reaction with itching and pain."]], "pageTitle": "Allergenic Extract, Fruit and Vegetable - FDA prescribing information, side effects and uses", "title": "", "url": "http://www.drugs.com/pro/allergenic-extract-fruit-and-vegetable.html", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042981753.21/warc/CC-MAIN-20150728002301-00119-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 414381423, "recordOffset": 414344557, "tableOrientation": "HORIZONTAL", "TableContextTimeStampBeforeTable": "{1822=4. Reid,M.J., Lockey,R.F., Turkeltaub,P.C., Platts-Mills,T.A.E., Survey of fatalities from skin testing and immunotherapy 1985-1989. Journal of Allergy Clin. Immunol. 92 (1): 6-15, July 1993., 35268=Local Reactions consisting of erythema, itching, swelling tenderness and sometimes pain may occur at the injection site. These reactions may appear within a few minutes to hours and persist for several days. Local cold applications and oral antihistamines may be effective treatment. For marked and prolonged local reactions the use of antihistamines or anti-inflammatory medications may be dictated. Serious adverse reactions should be reported to Nelco Laboratories immediately and a report can be filed to: MedWatch, The FDA Medical Product Problem Reporting Program, at 5600 Fishers Lane, Rockville, MD 20852-9787, call 1-800-FDA-1088., 41194=GENERAL: Epinephrine 1:1000 should be available as well as personnel trained in administering emergency treatment. Allergenic Extracts are not intended for intravenous injections. For safe and effective use of allergenic extracts, sterile diluents, sterile vials, sterile syringes should be used and aseptic precautions observed when making a dilution and/or administering the allergenic extract injection. A sterile tuberculin syringe graduated in 0.1 ml units to measure each dose for the prescribed dilution should be used. To reduce the risk of an occurrence of adverse reactions, begin with a careful personal history plus a physical exam. Confirm your findings with scratch or intradermal skin testing., 1322=6. Lockey, R.F., Bukantz, S.C., Allergen Immunotherapy. New York,NY: Marcel Dekker Inc., 1991., 33520=If systemic or anaphylactic reaction, does occur, apply a tourniquet above the site of injection and inject intramuscularly or subcutaneously 0.3 to 0.5ml of 1:1000 Epinephrine Hydrochloride into the opposite arm. The dose may be repeated in 5-10 minutes if necessary. Loosen the tourniquet at least every 10 minutes. The Epinephrine Hydrochloride 1:1000 dose for infants to 2 years is 0.05 to 0.1 ml, for children 2 to 6 years it is 0.15 ml, for children 6-12 years it is 0.2 ml., 48711=Serious adverse reactions should be reported to Nelco Laboratories immediately and a report filed to: MedWatch, The FDA Medical Product Problem Reporting Program, at 5600 Fishers Lane, Rockville, Md. 20852-9787, call 1-800-FDA-1088., 25200=Do not perform intradermal test with allergens which have evoked a 2+ or greater response to a Scratch test. Clean test area with alcohol, place sites 5 cm apart using separate sterile tuberculin syringe and a 25 gauge needle for each allergen. Insert needle tip, bevel up, into intracutaneous space. Avoid injecting into blood vessel, pull back gently on syringe plunger, if blood enters syringe change position of needle. The recommended dosage and range for intradermal testing is 0.05 ml of not more than 100 pnu/ml or 1:1000 w/v (only if puncture test is negative) of allergenic extract. Inject slowly until a small bleb is raised. It is important to make each bleb the same size., 1988=3. Lockey, R.F., Bukantz, S.C., Allergen Immunotherapy. New York,NY: Marcel Dekker Inc., 1991., 42527=Epinephrine 1:1000 should be available., 1559=5. Murray, A.B., Ferguson, A., Morrison, B., The frequency and severity of cat allergy vs dog allergy in atopic children. J. Allergy Clin. Immunolo: 72, 145-9, 1983., 8913=Example 1: If a 1:10 w/v extract is available and it is desired to use a 1:1,000 w/v extract substitute as follows:, 2427=1 Jacobs, Robert L., Geoffrey W.Rake,Jr., et.al. Potentiated Anaphylaxis in Patients with Drug-induced Beta-adrenergic Blockade. J.Allergy & Clin. Immunol., 68(2): 125-127. August 1981., 2152=2 Ishizaka,K.: Cellular Events in the IgE Antibody Response. Adv. in Immuno. 23:50-75, 1976., 8341=Using a sterile technique, remove 0.10 ml of extract from the 1:10 vial and place it into a vial containing 9.90 ml of sterile diluent. The resulting ratio will be a 10 ml vial of 1:1,000 w/v.}", "TableContextTimeStampAfterTable": "{741048=Copyright © 2000-2015 Drugs.com. All rights reserved., 739771=Drugs.com provides accurate and independent information on more than 24,000 prescription drugs, over-the-counter medicines and natural products. This material is provided for educational purposes only and is not intended for medical advice, diagnosis or treatment. Data sources include Micromedex® (updated July 13th, 2015), Cerner Multum™ (updated July 2nd, 2015), Wolters Kluwer™ (updated July 2nd, 2015) and others. To view content sources and attributions, please refer to our editorial policy.}", "textBeforeTable": "Skin tests are graded in terms of the wheal and erythema response noted at 10 to 20 minutes. Wheal and erythema size may be recorded by actual measurement as compared with positive and negative controls. A positive reaction consists of an area of erythema surrounding the scarification that is larger than the control site. For uniformity in reporting reactions, the following system is recommended. (6) Interpretation of Scratch Test The recommended usual dosage for Scratch testing is one drop of allergen applied to each scratch site. Do not let dropper touch skin. Always apply a control scratch with each test set. Sterile Diluent (for a negative control) is used in exactly the same way as an active test extract. Histamine may be used as a positive control. Scratch or prick test sites should be examined at 15 and 30 minutes. To prevent excessive absorption, wipe off antigens producing large reactions as soon as the wheal appears. Record the size of the reaction. Allergenic extracts for diagnostic use are to be administered in the following manner: To scratch surface of skin, use a circular scarifier. Do not draw blood. Tests sites should be 4 cm apart to allow for wheal and flare reaction. 1-30 scratch tests may be done at a time. A separate sterile scratch instrument is to be used on each patient to prevent transmission of homologous serum hepatitis or other infectious agents from one patient to another.", "textAfterTable": "Diagnostic Use: Intradermal Skin Testing Method Do not perform intradermal test with allergens which have evoked a 2+ or greater response to a Scratch test. Clean test area with alcohol, place sites 5 cm apart using separate sterile tuberculin syringe and a 25 gauge needle for each allergen. Insert needle tip, bevel up, into intracutaneous space. Avoid injecting into blood vessel, pull back gently on syringe plunger, if blood enters syringe change position of needle. The recommended dosage and range for intradermal testing is 0.05 ml of not more than 100 pnu/ml or 1:1000 w/v (only if puncture test is negative) of allergenic extract. Inject slowly until a small bleb is raised. It is important to make each bleb the same size. Interpretation of Intradermal Test: The patient's reaction is graded on the basis of size of wheal and flare as compared to control. Use 0.05 ml sterile diluent as a negative control to give accurate interpretation. The tests may be accurately interpreted only when the saline control site has shown a negative response. Observe patient for at least 30 minutes. Tests can be read in 15-20 minutes. Edema, erythema and presence of pseudopods, pain and itching may be observed in 4 plus reactions. For uniformity in reporting reactions the following system is recommended. (6)", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}