{"relation": [["Active duty after 09/10/2001", "At least 36 months", "At least 30 continuous days and discharged due to service-connected disability", "At least 30 months < 36 months", "At least 24 months < 30 months", "At least 18 months < 24 months *", "At least 12 months < 18 months *", "At least 6 months < 12 months *", "At least 90 days < 6 months *"], ["Percentage of maximum benefit", "100", "100", "90", "80", "70", "60", "50", "40"]], "pageTitle": "WOU: Veteran benefits chapter 33", "title": "", "url": "http://www.wou.edu/provost/registrar/veterans/chapter33.php", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988305.14/warc/CC-MAIN-20150728002308-00184-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 840383622, "recordOffset": 840367228, "tableOrientation": "HORIZONTAL", "TableContextTimeStampBeforeTable": "{2425=Includes veterans who served a minimum of 90 aggregate days (or 30 continuous days and discharged due to service-connected disability) of active duty service on or after September 11, 2001. Active duty time includes full-time, other than active duty for training, in a regular component of the Armed Forces. Call or order to active duty in a reserve component of the Armed Forces. Active duty does not included: AGR under Title 32, Service Academy Contract, period under ROTC 10 U.S.C 2107(b), or service used for purpose of loan repayment. Eligibility is retained if active duty is continued, honorably discharged, discharged for condition that interfered with duty (CIWD), discharged for disability that existed prior to service (EPTS), or discharged for hardship (HDSP)., 1622=Effective August 1, 2009 but not payable until October 1, 2011, the Post-9/11 G.I. Bill will be expanded to include Active Service performed by National Guard members under title 32 U.S.C. for the purpose of organizing, administering, recruiting, instructing, or training the National Guard; or under section 502(f) for the purpose of responding to a national emergency.}", "textBeforeTable": "Percentages for benefits are based on total service after 09/10/2001. Delimiting date: 15 years from last qualifying period of active duty. Transfer of benefits to chapter 33 from another educational program (such as chapter 30, chapter 1606, and chapter 1607) is irrevocable. The relinquished chapter may not be returned to at a later date. Chapter 31 is not an educational program and will not be relinquished by electing chapter 33. If relinquishing chapter 30 the amount of entitlement granted under chapter 33 will be limited to the length of the remaining chapter 30 benefits unless chapter 30 entitlement is exhausted prior to electing chapter 33. If chapter 30 benefits are exhausted, then the limit of 48 months of combined benefits under multiple educational assistance programs administered by Veterans' Administration applies. Limited to 48 months of combined benefits under multiple educational assistance programs administered by Veterans' Administration. Generally 36 months of benefits under chapter 33. Entitlement   Effective August 1, 2009 but not payable until October 1, 2011, the Post-9/11 G.I. Bill will be expanded to include Active Service performed by National Guard members under title 32 U.S.C. for the purpose of organizing, administering, recruiting, instructing, or training the National Guard; or under section 502(f) for the purpose of responding to a national emergency.   Includes veterans who served a minimum of 90 aggregate days (or 30 continuous days and discharged due to service-connected disability) of active duty service", "textAfterTable": "*excludes entry level and skill training; those eligible under both the 70% and 80% rating will be paid at 70%. back to top   Benefits Percentage of tuition and fees charged Payment is sent directly to the school about 30 days from certification. Effective August 1, 2011, there is no maximum for public school in-state (resident) tuition and fees. Private and foreign school costs are capped at $17,500 annually. The Yellow Ribbon Program still exists for out-of-state (non-resident or WUE) fees and costs above the cap. Not available for Active Duty Members and their spouses as their tuition and fees are paid in full. Not available for Fry Scholarship participants (children of active duty service members who died on active duty since 09/11/01). Tuition & Fees at WOU. Effective March 5, 2011, active duty members pursuing a degree at more than half-time are limited to net cost for tuition and fees prorated based on the eligibility tiers (40% - 100%) previously established for Veterans. The same limitations apply to transferee spouses of active duty service members. Percentage of monthly base allowance for housing (BAH) Rate of pursuit must be greater than 50% to receive the BAH. In other words, the number of credits the student is enrolled in divided by the minimum number", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}