{"relation": [["", "", "", "", "", "", "", "", "", "", ""], ["Spell", "Meteor", "Magelight", "Soultrap", "Equilibrium", "Fire Rune", "Steadfast Ward", "Persuasive Will", "Potency", "Greater Ward", "Stability"], ["Type", "Ultimate", "Active", "Active", "Active", "Active", "Active", "Passive", "Passive", "Passive", "Passive"]], "pageTitle": "Mages Guild", "title": "", "url": "http://elderscrollsonline.info/mages-guild", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989018.48/warc/CC-MAIN-20150728002309-00296-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 81098075, "recordOffset": 81086859, "tableOrientation": "HORIZONTAL", "textBeforeTable": "Mages Guild Skills Though the guild is a public organisation, you need to prove that you can become its member. To be able to enter the Guild you have to find several books found throughout Tamriel. The books can be found absolutely everywhere: in caves, bandit camps, houses and so on. Travel, explore the world and you should find the books along your travels. How to join the Mages Guild in ESO? Though anyone can use the services of the guild, members always receive a discount. But membership bonuses exceed just decreased prices. Each member of the guild in Elder Scrolls Online receives extra quests and can master an extra talent tree. The hub of the Mages Guild is situated in the Arcane University of Cyrodiil. The guild is led by the Council of Mages and Arch-Mage. The Council serves to solve all important questions regarding general guild policy. The guild can be found throughout Tamriel with halls in the majority of cities. Unlike the Dark Brotherhood and Thieves Guild, the Mages Guild is absolutely legal. Presently the aim of the guild is to provide magic services to people. Anyone can visit a Mages guild store where magical portions, ingredients and magical goods are sold. People may also approach the Mages guild to hire Mages to banish rabid spirits and other phantoms. Mages can also enchant your armour, weapon and other items. Mages Guild is one of 4 main guilds in Elder Scrolls Online. Members of", "textAfterTable": "Comments Josh Ham 03 january 2014, 11:43 # ↓ 0 What kind of books must you find in Tamriel? Duelist 04 january 2014, 00:23 # ↑ ↓ 0 You can find different lore books while traveling in Tamriel. It is a tradition of all TES games to allow player reading such books. Some of them can be really helpful. There is no information about the benefits of books in ESO. All we know is that a player will have to find several books to join Mages Guild, but I am sure a player will be able to get other benefits, maybe skill points.", "hasKeyColumn": false, "keyColumnIndex": -1, "headerRowIndex": 0}