{"relation": [["Pos", "C", "1B", "2B", "SS", "3B", "LF", "CF", "RF", "P"], ["AL Total Zone Total Fielding", "Salvator Perez, CLE (12)", "Steve Pearce, BAL (13)", "Jonathan Schoop, BAL (16)", "J.J. Hardy, BAL (14)", "Kyle Seager, SEA (23)", "Alex Gordon, KC (25)", "Lorenzo Cain, KC (18)", "Kevin Kiermaier, TB (12)", ""], ["NL Total Zone Total Fielding", "Wilson Ramos, WAS (8)", "Justin Morneau, COL (11)", "Anthony Rendon, WAS (12)", "Jordy Mercer, PIT (21)", "Chase Headley, SD/NYY (18)", "Khris Davis, MIL (13)", "Billy Hamilton, CIN (14)", "Jason Heyward, ATL (30)", ""]], "pageTitle": "dustin pedroia at Nationals Arm Race", "title": "", "url": "http://www.nationalsarmrace.com/?tag=dustin-pedroia", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 5, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989042.37/warc/CC-MAIN-20150728002309-00131-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 614013551, "recordOffset": 613966485, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{77689=Washington has sent a decent number of players to play in the WBC over the years, with very mixed results for the team’s interests.  In 2006 the team sent seven different players to the inaugural WBC:, 85187=Which leaves our large contingent of American players.  A couple of writers have started postulating on these rosters (David Schoenfield‘s very early guess as to a potential USA roster is here, Baseball Continuum’s latest projection is here).  So using these two posts as a starting point, lets go position-by-position and give some thoughts as to who may get some consideration.  Keep in mind the WBC rosters are generally very reliever heavy, since no starter is going to be “allowed” to pitch a complete game in March., 25258=Now that Derek Jeter has wound down own his 2014 retirement tour, and the fact that we’ve seen some recent player movement that has eliminated some HoF candidates from being one-teamers, I thought this was a good topic to pick back up., 63544=6. Justin Verlander, Detroit Tigers.  He’s struggled this year as compared to his typical lofty achievements, but he already owns the career trifecta of awards (RoY, MVP, Cy Young).   He’s signed through 2019 with a 2020 option, at which point he’ll be 37.    He probably won’t get to 300 wins but he could broach 250 with excellent career numbers.  Will he stay with Detroit?  It seems like a safe bet., 76595=I read a quickie piece with some Mike Rizzo quotes from the Washington Time’s beat reporter Amanda Comak on November 11th, 2012 and there was an interesting tidbit at the bottom: per Comak,  Rizzo has not been approached yet about any Washington Nationals participation in the WBC, but would approach each request on a “case-by-case basis” to determine what is in the best interests of the team.  This got me thinking about possible Nats representatives on 2013 WBC teams., 76459=Harper makes perfect sense to represent the US in 2013 WBC. Photo GQ magazine Mar 2012, 44967=September 10th, 2013 at 8:57 am, 81068=Now, which Nats may play for the 2013 teams?  First off, looking at the Nationals 40-man roster, we have become an amazingly heavy USA-born team (we’ll get to non-40man roster players in a moment). Thanks to the Nats big board resource (originated by Brian Oliver and now maintained by “SpringfieldFan”), which has the country of origin for players, here’s a breakdown of the home-country of our current 36 active (as of November 15th, 2012) roster players:, 31563=October 24th, 2014 at 8:57 am, 67120=1. Felix Hernandez, Seattle Mariners.  Signed through 2019 for just absolutely ridiculous money (he’ll make $27M in the year 2019).  Of course, he’s just 27 now so he’ll still have some career left by then.  Will he stay in Seattle?  A good bet.  Will he continue to look like a hall-of-famer?  Also a good bet, despite his velocity loss.   But like any other guy who’s only 27, its hard to project 10-15 years down the road, especially for pitchers., 24795=In June of 2013, in the midst of the Mariano Rivera retirement tour, I posted about one-team Hall of Famers and whether they were a dying breed in modern baseball.  I figured that they were, that free agency had ruined the iconic “one team” home-town legend that we grew up knowing (especially in DC, with Cal Ripken Jr. just up the road)., 119282=December 9th, 2010 at 1:40 pm, 77255=Lets take a quick look at the Nationals representatives on WBC teams from the past, talk about whether its really in the best interests of the team to even let these guys play, and then talk about who may be candidates for the 2013 WBC regardless., 5845=Here’s the 2014 Fielding Bible Awards, which (if you’re not aware) is a Bill James-driven website that uses a committee of national writers to select the winners (the site is here and you can read about their methodology).  Bolded are also GG winners:, 29581=I used to think Zimmerman was on track, especially after his monster 2009 season.  Now I think he’s destined to be just a middle of the order solid hitter on teams with better hitters surrounding him.  Think Scott Rolen.  Braun may be one of the best players in the NL, but getting caught with PEDs not once but twice will prevent him from ever being enshrined no matter what kind of career he puts together.  The fall-off of the San Francisco duo of pitchers speaks for itself; what the heck happened to Lincecum?  Similarly, Weaver now looks like a guy who peaked during his expected peak years and now is settling into being a slightly better-than-average pitcher.  Fair?  Maybe not, but his ERA+ for 2014 is 104; not exactly Kershaw-territory., 20479=November 11th, 2014 at 9:44 am, 72458=July 15th, 2013 at 10:45 am, 1346=Last year, I created a little spreadsheet upon the announcement of the Gold Glove winners, to see how they compared to various defensive metric leaders (2013 xls link here).  And I threw in the “Fielding Bible” award winners, since that has now taken over as the “accepted” list of the year’s best defensive players, thanks to the Gold Gloves continuing to pick inexplicable players (this  year’s repeat “I cannot believe he won” player again being Adam Jones).  But, as we’ve seen, the Gold Gloves are getting better, and the days of picking someone like a statue-esque Derek Jeter and/or a nearly permanent DH in Rafael Palmeiro seem to now be over., 82945=Who from the Nationals franchise may make a 2013 WBC roster?  First off, thanks to James Wagner‘s 11/15/12 NatsJournal post we already know of three WBC participants; Solano is on the Columbian team, minor leaguer Jimmy Van Ostrand is on the Canadian team, and A-ball catcher Adrian Nieto is on the Spanish team.  Curacao qualifies to play with the Netherlands, and I’d guess that Bernadina would make a great choice considering the lack of Dutch players in baseball (Baseball Continuum’s projections agree.  And as of 12/4/12 he’s officially been listed as a Netherlands participant).. Venezuela is already qualified for the main draw and has a relatively strong possible team.  The Baseball Continuum blog posted an early projection of the Venezuelan team and listed Flores as a likely participant (specifically mentioning that Ramos wasn’t considered due to injury recovery; I’d suspect these two players to switch based on Ramos’ recovery and Flores’ awful 2012).   If Henry Rodriguez was healthy i’d guess he would be on that list too, but his season-ending surgery probably precludes his participation.  The Dominican Republic has perhaps the strongest depth and has no need for the recently called up Perez among its outfield depth.  Maya’s defection eliminates him from discussion for the Cuban team.  (12/4/12 update): Chien-Ming Wang has been announced as a member of Chinese Taipei’s team (for the purposes of this article I investigated all 2012 Nats)., 78323=The tournament was marred for the team by a blown UCL ligament to Ayala, who had undergone elbow surgery earlier in the off-season but pitched for his home country anyway.  The team did not want Ayala to participate in the inaugural event, did not want him used by the Mexican team, and team officials were “livid” by the injury, which cost Ayala the season and cost the team its 8th inning setup guy.  Ayala recovered to pitch again in 2008 but was never as effective, and was shipped out in 2009 for a PTBNL.  Coincidentally, I suspect the team still harbors some ill-will towards Ayala to this day.  Meanwhile the other two relievers who participated both experienced regressions in form; Cordero’s ERA nearly doubled (from 1.82 to 3.19) from his breakout 2005 season while Majewski’s numbers dipped slightly before he was traded in the big Cincinnati deal of 2006., 70333=6. Joey Votto, Cincinnati Reds.  Here’s a fun fact: Votto trails our own Ryan Zimmerman in career war despite being a year older.   He’s signed with Cincinnati with options through 2024, at which point he’ll be 41, so he’s almost guaranteed to be a one-team guy.  Will he accumulate enough accomplishments to be a Hall of Famer?  So far so good.  He’s one of the most feared hitters in the league and seems to be getting better., 2779=First, your 2014 Gold Glove winners: bold are also Fielding Bible winners, and red are the most egregiously bad selections., 43188=Q: Do the Nationals tweak for 2014, or do they need to make big changes in the roster. What do you think of these predictions: LaRoche becomes an expensive bench player, Span and Gio traded., 56543=August 12th, 2013 at 7:17 am, 66271=4. Jimmy Rollins, Philadelphia Phillies.  Rollins is the subject of a long, long running joke amongst my close friends.  One die-hard Philly fan made his argument that Rollins was a sure-fire Hall of Famer, and the rest of us mocked him for being such a homer.   In reality, his Hall of Fame case likely ends up being really debatable.   He has a smattering of career accomplishments but not nearly as many as (say Barry Larkin, the most recent elected SS).   Now, does Rollines remain in Philadelphia?  Probably; he’s signed through 2015, at which point he’ll be 37.  I can see Philadelphia keeping him on board with a 2 year deal at that point., 1189=Alex Gordon was one of the best defensive players in baseball, by any measure in 2014. photo 365rundown.com, 85968=(Note: I’m still considering our Free Agents as “Nats players” for the purposes of this analysis, since this really goes position by position from our 2012 team to find candidates)., 115284=The Red Sox’s signing of Carl Crawford to a 7yr, $142M contract (a contract undoubtedly pushed skyward by the Nats Jayson Werth deal a few days earlier)  makes for a rather imposing possible Red Sox Lineup in 2011.  Here’s a probable opening day lineup:, 79472=In 2009, the team had 5 participants:, 117251=Ellsbury is exactly what the Nats need; leadoff center fielder who shows more promise and more self control than our current leadoff/CF Nyjer Morgan.  He lost most of 2010 to injury but in 2009 lead the league in stolen bases and would give us good defense in center per his uzr/150 rankings.  He’s cost contained (not yet arbitration eligible) and we’d control him for at least 3 more years., 2348=So, now that we’ve announced the 2014 Gold Glove winners, lets also look at the league leaders in various defensive metrics., 2584=This data is in the following spreadsheet for 2014 on Google Docs., 64352=1. Todd Helton, Colorado Rockies.   He turns 40 in August, has played his entire career with Colorado and is in the final year of a two-year deal.  His production has vastly tailed off the last two years and I can’t see him playing again after this season.  But, we haven’t heard any retirement news either, so I wonder if he’s going to be one of these one-teamers that tries to play one season too long.  Chances of Hall-of-Fame:  33%.   I think he’s going to have the same issues that Larry Walker is having; despite a career 134 OPS+ his home OPS is nearly 200 points higher than his road OPS, and I think writers will believe him to be an offensive juggernaut borne of Denver., 52710=Over in the American league, the playoff situation may be murky, but the MVP race is pretty straight-forward.  There is a lot to shake out in terms of the playoff positions and the candidates from those teams don’t seem to stand out as much.  But as with 2012, there are two leading MVP candidates and we seem set to have the same arguments this year as last.  But lets go team by team:, 68919=4. Evan Longoria, Tampa Bay Rays.   He’s signed with options through 2023.  He’s always on the short list of the best third basemen (offensively and defensively) in the majors.   He’s already had a series of all-time highlight moments in his career.  But from a cumulative accolades stand point, he’s very much lacking.  While he won the 2008 Rookie of the Year award, the closest he’s come to an MVP is 6th, and his 2013 All-Star snub means he’s only appeared in the game 3 times.  I think he’s going to need a run of healthy, strong seasons to really put his name in the HoF mix., 16544=Adam Jones scored a -8.1 FRAA; ranking him 1187th out of 1212 players for 2014.  I’m not kidding.  That’s how bad a selection for the Gold Glove Jones was., 112734=November 3rd, 2011 at 11:57 am, 62682=5. Robinson Cano, New York Yankees.  He’s about half way through his career, but his numbers and accolades keep piling up.  Pretty soon we’re going to look up and he’s going to have 400 homers and a career BA above .300 as a 2nd baseman with a slew of top 5 MVP finishes, and we’ll be asking ourselves where Cano ranks in the pantheon of baseball 2nd basemen.  Here’s the canonical list of 2nd basemen elected to the hall of fame in the last 50 years: Roberto Alomar, Ryne Sandberg, Rod Carew and Joe Morgan.  Do you think Cano belongs there?  Now, will Cano stay a Yankee?  We’ll soon find out: he’s just played out his two option years and has not been extended.  Are the Yankees preparing to let him walk?, 79890=The WBC seemed to energize particularly Dunn, who enjoyed playing in a post-season atmosphere for the first (and only) time in his career.  Nobody suffered any injuries, but Hanrahan in particular may have been affected by his lack of a proper spring training; he posted a 7.71 ERA for the team while losing the closer spot and was shipped to Pittsburgh.  Ironically, Rivera also experienced a huge regression of form, going from a 3.96 ERA in 2008 to a 6.10 ERA in 2009 and was eventually released., 28755=These are all perennial all-stars, kings of the game, but none of them really screams out “Hall of Famer” right now.  I may be slightly down on these guys (especially Hamels, who might be more than borderline right now).  I’ve thrown Zimmermann in there thanks to his second stellar season in a row and his no-hitter; he’s likely to have another top 5 Cy Young finish in 2014 and with a few more such seasons he may put himself into the conversation.  Of course, the odds are that he departs the Nats after 2015, so he may be off the list anyway., 93727=November 21st, 2012 at 10:59 am, 62205=4. Joe Mauer, Minnesota Twins.  Its hard to envision someone being more of a franchise player than Mauer; born in Minnesota, High School in Minnesota, 1st overall draft pick by the Minnesota Franchise.  Massive contract with full no-trade through 2018.  I think Mauer will be a Twin for life.   Hall of Fame chances?  Looking pretty good; already has an MVP and has a career .323 BA for a catcher, pretty impressive., 65646=3. David Wright, New York Mets.  He’s in his 10th season with the Mets and is signed through 2020, so his chances of being a career one-teamer seem high.  Not 100% though; He’ll be 37 at the end of this deal and may want a couple more seasons; will he be productive enough and stay healthy enough to earn another short-term deal that late in his career?  Is he trending towards the Hall of Fame?  Probably not; he’s got plenty of All Star appearances, Gold Gloves and Silver Sluggers but relatively little MVP love.  In this respect he needs his team to be better., 72791=Tagged with albert pujols, alex rodriguez, chase utley, chipper jones, clayton kershaw, cole hamels, david wright, derek jeter, dustin pedroia, evan longoria, felix hernandez, jered weaver, jimmy rollins, joe mauer, joe morgan, joey votto, justin morneau, justin verlander, mariano rivera, matt cain, paul pierce, payton manning, roberto alomar, robinson cano, rod carew, ryan braun, ryan zimmerman, ryne sandberg, stephen strasburg, todd helton, troy tulowitzki, yasiel puig, 67641=2. Dustin Pedroia, Boston Red Sox.  Pedroia doesn’t seem like a guy who is mentioned in the same breath as hall-of-famers, especially when compared to Cano above.  But here’s what Pedroia has that Cano doesn’t: A Rookie of the Year award AND an MVP award.  Pedroia has bounced back in 2013 from a couple of injury-plagued years and has put him self back in position to gain MVP votes if Boston makes the post-season.  Will he stay in Boston?  Seems like hit; he seems like a classic career Red Sox Captain-in-the-making., 80561=This begs the question; do we even WANT our pitchers playing on this team?  The first two WBCs have shown pretty distinctly that our pitchers have regressed greatly after playing.  This only makes sense: the spring training routines are greatly impacted to play in this event.  We may see a ton of front-office resistance to specific guys (especially those coming off injury) playing in the 2013 event.  Which could affect the eligibility of some specific players for 2013., 26093=I’m not sure Helton will make the Hall; if Larry Walker can’t get in because people think his numbers were inflated by Colorado’s home park, then Helton will be in the same boat.  His embarrassing, ridiculous DUI arrest in mid 2013 while driving to get lottery tickets (despite the fact that he has more than $160M in career earnings just in salary alone) certainly won’t help his case.}", "textBeforeTable": "Last stat: Baseball Reference’s Total Zone Fielding Adam Jones scored a -8.1 FRAA; ranking him 1187th out of 1212 players for 2014.  I’m not kidding.  That’s how bad a selection for the Gold Glove Jones was. Interestingly, Jean Segura shines highly here (the supposed “best defensive player in the league” Andrelton Simmons only scored a 10.0 in FRAA).   And this stat really favors the play of some random players: I had no idea who Kevin Kiermaier or Ender Inciarte were before doing this post, nor did I know what position they played. Tyson Ross, SD (3.7) Dallas Keuchel, HOU (6.7) P Jason Heyward, ATL (26.4) Kevin Kiermaier, TB (8.3) RF Ender Inciarte, ARI (11.0) Jacoby Ellsbury, NYY (12.0) CF Khris Davis, MIL (6.6) Alex Gordon, KC (12.2) LF Nolan Arenado, COL (14.3) Kyle Seager, SEA (20.5) 3B Jean Segura, MIL (23.6) Alexei Ramierez, CWS (8.1) SS Chase Utley, PHI (6.9) Jason Kipnis, CLE (9.5) 2B Adrian Gonzalez, LAD (11.4) Steve Pearce, BAL (7.7) 1B C NL FRAA AL FRAA Pos", "textAfterTable": "Check it out: our own Wilson Ramos is on this list as the “leader” for the NL.  Which, no offense to Ramos, makes you question at least the catcher rankings for this stat.  Rendon also factors in for his partial season at 2B.  But overall, this seems like the least reliable defensive stat. As mentioned above, both our GG finalists (LaRoche and Span) seem to have been nominated on reputation only; neither of them appeared near the top on any of these statistical measures (unlike last year, when Span at least was a leader in Total Zone) Did I miss any good defensive metrics?  Do you have one you like more or less than these?  I know there’s other stats out there; I can update this analysis with more of them. So, how did the Gold Gloves do this year in selecting the most deserving winners?  Pretty good.  Alex Gordon was the AL leader for left fielders in every stat.  I think they picked the two correct short stops.  Catchers are difficult to measure.  They absolutely screwed up the AL Center fielder (though to be fair; there were four statistical measures presented and four different AL center field leaders.  Excellent defensive players who jump around (Lorenzo Cain, Ben Zobrist) make the awards somewhat challenging in some cases. Written by Todd Boss November 11th, 2014 at 9:44 am Posted in", "hasKeyColumn": false, "keyColumnIndex": -1, "headerRowIndex": 0}