{"relation": [["Conjugation", "yo había", "tú habías", "él/ella/ello/uno había", "usted había", "nosotros habíamos", "vosotros habíais", "ellos/ellas habían", "ustedes habían"], ["Translation", "I used to have", "You (informal) used to have", "He/she/one used to have", "You (formal) used to have", "We used to have", "You all (informal) used to have", "They used to have", "You all (formal) used to have"]], "pageTitle": "Conjugating the Spanish Verb Haber (to Have) - For Dummies", "title": "The Imperfect Tense of Haber", "url": "http://www.dummies.com/how-to/content/conjugating-the-spanish-verb-haber-to-have.html", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 3, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990123.20/warc/CC-MAIN-20150728002310-00144-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 415495547, "recordOffset": 415474386, "tableOrientation": "HORIZONTAL", "textBeforeTable": "} document.write('", "textAfterTable": "Conjugating the Spanish Verb Haber (to Have) Spanish verbs fall into different groups, and each group is conjugated a little differently. Haber (ah-bvehr) (to have) is used only with compound tenses. It serves as a helping verb that completes an action; the action is expressed with the past participle. With the addition of haber, a verb in the past tense becomes more past, a conditional statement can be completed, and a future action can be finished. Haber turns did into had done, would into would have, and will into will have. Haber is a verb that sometimes acts like a regular -er verb, and other times it acts like an irregular verb. All seven tenses of haber are included here to aid your understanding of compound tenses. When you add a past participle to the present tense of haber, you form the present perfect tense. Here’s haber conjugated in the present tense: The Present Tense of H aber Conjugation Translation yo he I have tú has You (informal) have", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}