{"relation": [["", "p", "rb", "a", "s", "b"], ["TOR", "Lowry 31", "Valanciunas 13", "Lowry 7", "Lowry 5", "3 players 1"], ["BKN", "Pierce 33", "Garnett 11", "Williams 11", "3 players 2", "4 players 1"]], "pageTitle": "Raptors at Nets - January 27, 2014 - Game Preview, Play by Play, Scores and Recap on NBA.com", "title": "", "url": "http://www.nba.com/games/20140127/TORBKN/gameinfo.html", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 4, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988650.53/warc/CC-MAIN-20150728002308-00138-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 609575091, "recordOffset": 609545046, "tableOrientation": "HORIZONTAL", "TableContextTimeStampBeforeTable": "{3143=7:30 PM ET - Barclays Center, Brooklyn, NY}", "TableContextTimeStampAfterTable": "{18725=THE STAT: The Nets are 0-2 against the Raptors in 2014 and 10-0 against the rest of the NBA., 12040=NEW YORK (AP) The Toronto Raptors are the only thing standing between the Brooklyn Nets and a perfect 2014., 8805=Brooklyn set a season best for points allowed while holding the Celtics to 37.8 percent shooting from the field. It also marked the regular-season homecoming for Paul Pierce and Kevin Garnett, who helped Boston win the 2008 NBA title before being traded to the Nets in the offseason., 15515=Lowry scored six straight points before Amir Johnson made a pair of free throws during an 8-0 run that gave Toronto a 94-85 lead with about 8 minutes to play. The Nets answered with nine in a row to tie it on Alan Anderson's jumper, and after Valanciunas' basket, Pierce nailed consecutive 3-pointers to make it 100-96 with 2:37 remaining., 12417=Toronto dropped Brooklyn to 10-2 in January and opened a 2 1/2-game lead in the Atlantic Division over the Nets, who would be on the doorstep of the division lead if they could solve their neighbors to the north., 12647=\"These guys are chasing us but they're putting it together. They're playing well,\" Raptors point guard Kyle Lowry said. \"We're the only team that beat them in 2014. I mean, that's a tough team. They had the game and we made a play and we made a shot.\", 19623=NOTABLE: Lowry sank a shot from well beyond halfcourt just before the halftime buzzer to give the Raptors a one-point lead, while Shaun Livingston's short jumper at the end of the third quarter was ruled to have come after time expired. ... Three technical fouls were called within a three-minute span in the third quarter, on Lowry, Pierce and Kevin Garnett. Pierce said he was assessed a technical for discarding his gum near the basket, which he said he does every game. ... DeMar DeRozan sat out for the Raptors with a sprained foot., 10790=\"I've seen him shoot the ball before and with DeMar going down he stepped it up,\" Lowry said. \"That's what a team does.\", 171998=Copyright © 2015 NBA Media Ventures, LLC. All rights reserved. No portion of NBA.com may be duplicated, redistributed or manipulated in any form. By accessing any information beyond this page, you agree to abide by the Privacy Policy / Your California Privacy Rights and Terms of Use. • | Advertise on NBA.com | NBA.com Help | Fan Relations FAQ | Career Opportunities, 9436=The Nets' only defeat during their hot stretch came Jan. 11 against the Raptors, who got 26 points from DeRozan in a 96-80 victory. DeRozan, though, sprained his left foot in Saturday's 126-118 loss to the Los Angeles Clippers after scoring 10 points in just over 21 minutes., 8152=The Brooklyn Nets' only blemish in 2014 came at the hands of the Toronto Raptors, who got a solid performance from DeMar DeRozan in that contest., 14712=Jonas Valanciunas had 20 points and 13 rebounds for the Raptors, who played without injured leading scorer DeMar DeRozan. Terrence Ross, who tied a franchise record with 51 points and made 10 3-pointers Saturday, had a quiet 10 points on 3-of-9 shooting., 10221=Ross did his best to pick up the slack, tying Vince Carter's franchise record with a career-high 51 points while hitting 10 of 17 from 3-point range. He nearly doubled his previous career high of 26 set on Jan. 2., 15349=Andray Blatche scored 20 points for the Nets, who lost 96-80 in Toronto on Jan. 11, a night after they played two overtimes in a victory over Miami., 13604=Lowry finished with 31 points and seven assists for the Raptors, who clinched a winning record in consecutive months for the first time since December 2009 and January 2010., 10948=Ross scored 14 points in the win over Brooklyn but had only seven in a 102-100 loss to the Nets on Nov. 26, as Blatche scored 24 and Joe Johnson added 21.}", "textBeforeTable": "42 48 Points in the Paint: 4 10 Biggest Lead: 10 12 Fast Break Pts: 17 18 Turnovers 5 10 Offensive Rebounds 36 43 Total Rebounds BKN TOR FT % 3FG% FG % 81.8% 80.8% 45.8% 40.9% 48.1% 46.8%       BKN TOR UP NEXT: For the Raptors, Wednesday vs. Orlando, Friday @ Denver, Saturday @", "textAfterTable": "  11/26 - BKN 102 @ TOR 100 01/11 - BKN 80 @ TOR 96 01/27 - TOR 104 @ BKN 103 03/10 - TOR 97 @ BKN 101 Shop Toronto Raptors Jerseys Shop Brooklyn Nets Jerseys Download Game Book Toronto Raptors (23-21) field goalsrebounds   pos min fgm-a 3pm-a ftm-a +/- off def tot ast pf st to bs ba pts S. Novak F 21:55 0-5 0-4 0-0 +6 0 0 0 1 0 0 0 0 0 0 A. Johnson F 30:18 2-5 0-0 4-4 +2 3 3 6 1 3 0 3", "hasKeyColumn": true, "keyColumnIndex": 1, "headerRowIndex": 0}