{"relation": [["Deal Score", "Above 88", "Above 68", "Above 50", "Between 40 and 50", "Between 30 and 40", "Less than 30", "Less than 15"], ["Category", "Amazing", "Great", "Good", "Okay", "So-so", "Bad", "Awful"]], "pageTitle": "FAQ, Frequently Asked Questions | SeatGeek", "title": "", "url": "https://seatgeek.com/faq/", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 1, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987135.9/warc/CC-MAIN-20150728002307-00101-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 890111751, "recordOffset": 890077549, "tableOrientation": "HORIZONTAL", "TableContextTimeStampBeforeTable": "{3376=SeatGeek was founded in September 2009 by Jack Groetzinger & Russell D'Souza and is made in New York City by the talented folks you see on our Team page. You can also find a short list of SeatGeek investors on our Press page at seatgeek.com/press.}", "textBeforeTable": "At SeatGeek, we group tickets into several categories based on their Deal Score: Deal Scores can range from 1 to 100. Deals at either end of this range are rare, but a 100 means that this is one of the best ticket deals on SeatGeek. Conversely, a 1 is a very, very bad deal. What is a good Deal Score? Deal Scores are based on an absolute scale, meaning that a Deal Score of a higher number is always a better deal than a Deal Score of a lower number — even across different events. We factor in lots of things while calculating deal score, and we're always tinkering to make it better. Some of the factors that influence Deal Score are: historical ticket prices for the performer and the venue, the row location, the expected sightline from the section, and the quality of the other available tickets for the event. How is Deal Score calculated? Deal Score is a number based on a fancy math calculation made by SeatGeek that tells you exactly how good a deal you're looking at. You can use Deal Score to quickly find the best deals, buy with confidence, and save money in the process. What is Deal Score? Unfortunately, no. We don't have reliable information about the handicap-accessibility of venues. We've found that", "textAfterTable": "What does a blue dot or blue Deal Score mean? Blue is the color assigned to ticket listings for which Deal Score cannot be calculated. This usually happens when SeatGeek can't make sense of the ticket information that is provided on the seller's website. (For example: non-standard section names or numbers.) A blue dot or Deal Score doesn't necessarily signify a bad deal — just that SeatGeek doesn't know enough to give a good answer. I really like math. Can I learn more about Deal Score? We've written about Deal Score several times on the SeatGeek blog. Here's the first half of a great two-part article by Steve, the chief data scientist behind Deal Score. What is SeatGeek's \"tracker\" feature? Tracker is a list of your favorite artists, teams, and upcoming events. When you track a performer or event on SeatGeek, we use it to… notify you of relevant things like just-announced shows or drops in ticket prices for events that you want to attend make recommendations about other artists and events in your area that we think you'll like How do I adjust my tracker settings? You can view, add, or remove artists or events from your tracker list at seatgeek.com/account/tracker. You can", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}