{"relation": [["Sample Code", "Free", "PESSynth 10P", "PESSynth 10P 4D", "PESComm 10P", "PESComm 10P 4D", "PNH2 10P 4D 5P", "PNH2 10P 8D 5P", "PNH2 10P 5D 2P", "PNH2 10P 5D 4P"], ["% Yield *", "27.93 ± 0.07", "26.46 ± 0.06", "28.42 ± 0.06", "27.14 ± 0.12", "26.22 ± 0.07", "25.85 ± 0.07", "25.73 ± 0.07", "24.50 ± 0.06", "26.10 ± 0.06"], ["Activity* (mmol pNP min−1cm−2)", "558.68 ± 1.23", "529.27 ± 1.22", "568.48 ±1.22", "542.75 ± 2.44", "524.37 ± 1.22", "517.02 ± 1.22", "514.57 ± 1.22", "490.07 ± 1.22", "521.92 ± 1.22"]], "pageTitle": "1. Introduction", "title": "", "url": "http://www.mdpi.com/2077-0375/2/2/198/xml", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 1, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986451.45/warc/CC-MAIN-20150728002306-00140-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 564081343, "recordOffset": 564057194, "tableOrientation": "HORIZONTAL", "TableContextTimeStampBeforeTable": "{26217=Based on the 1H NMR spectrum, chemical shifts between 7.01 and 7.89 ppm correspond to the aromatic protons of PES positioned close to the ether linkage (–O–) or sulfone group (–SO2–). Characteristic peaks in the FTIR spectrum at wave-numbers of 1327.7, 1156.7, and 1282.1 cm−1 indicated the presence of C–O–C and –SO2 functional groups within the structure of the product. According to the results and the data analysis, the structure of synthesized PES is described as shown in Figure 2.}", "TableContextTimeStampAfterTable": "{28768=We are indebted to Yana Maolana Syah, Fida Madayanti Warganegara, Henk Miedema, Arie Zwijnenburg, Anna Casadella, and Megawati Zunita for their kind cooperation. We greatly appreciate the assistance of Gert Alberda for thermal analysis, Evgeny Polushkin for SEM analysis, Annie van Dam and Hjalmar Permentier for MALDI-TOF analysis. Vincent Voet is acknowledged for his careful revision of the current manuscript.}", "lastModified": "Thu, 14 May 2015 04:35:09 GMT", "textBeforeTable": "lipases. Mucor miehei Enzyme loading for all immobilized Table 1 membranes-02-00198-t001_Table 1 . Table 1 lipases onto the solid support is shown in Mucor miehei Enzyme loading tests were performed to determine the amount of immobilized enzymes per membrane surface area. Protein determination has been carried out by a BCA protein assay. The enzyme loading of all immobilized lipase onto the PES membranes, a physical interaction between the lipase and the solid support was formed. On the other hand, lipase immobilization onto the PES–NH2 membranes gave rise to both physical interactions and chemical bonding between the lipase and its solid support. Mucor miehei lipase). During the immobilization of Mucor miehei lipase was carried out in a rotary shaker for 24 h on pH 7 PBS buffer (which is the optimum pH for Mucor miehei The immobilization of 2.3. Immobilization of <italic>Mucor miehei</italic> Lipase ]. 42 Based on the analysis of the SEM images, the membranes obtained form two layers (top layer and sub layer). The top layer has a smaller and denser pore-size than the sub layer, therefore indicating that the top layer plays an important role in membrane selectivity. Meanwhile, macro-voids that are present in the sub layer have a function as support and affect its mechanical strength of the membranes. Such membranes are known as asymmetric membrane, first developed by Loeb-Sourirajan [", "textAfterTable": "11. PESNH-10/D4/P5 850.89 ± 0.57 12. PESNH-10/D8/P5 873.62 ± 0.57 * Standard deviation values were calculated from three replicated experiments. Based on these results, the enzyme loading is affected by the type and concentration of additives, and the functional groups along the polymer chain. The enzyme loading represents the amount of Mucor miehei lipase that is physically adsorbed or chemically attached to the polymer. In principle, the higher membrane porosity will increase the surface area for enzyme attachment leading to an increase in attached lipases. In this case, addition of DBP will increase the enzyme loading because of its properties as plasticizer. Looking at its structure, DBP has ester moieties that could form physical interactions with the enzyme [ 43 ]. Therefore, the addition of DBP during the membrane preparation will increase the enzyme loading. On the other hand, the addition of PEG may increase the performance of immobilized enzymes. However, if the concentration of PEG is too high, homogeneity of the membrane porosity will increase, and the lipase will leach out from the solid support. Different functional groups on the polymer backbone would also give rise to a difference in enzyme loading. In this study, the presence of amine moieties increased the enzyme loading value. This indicates that strong physical interactions or ionic or covalent bonds between PES–NH2 and the", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}