{"relation": [["NVP", "CREDITCARDTYPE", "ACCT", "EXPDATE", "FIRSTNAME", "LASTNAME", "PROFILESTARTDATE", "BILLINGPERIOD", "BILLINGFREQUENCY", "AMT"], ["SOAP", "CreditCardDetails.CreditCardType", "CreditCardDetails.CreditCardNumber", "CreditCardDetails.ExpMonth and CreditCardDetails.ExpYear", "CreditCardDetails.CardOwner.PayerName.FirstName", "CreditCardDetails.CardOwner.PayerName.LastName", "RecurringPaymentProfileDetails.BillingStartDate", "ScheduleDetails.PaymentPeriod.BillingPeriod", "ScheduleDetails.PaymentPeriod.BillingFrequency", "ScheduleDetails.PaymentsPeriod.Amount"]], "pageTitle": "Integrating Recurring Payments - PayPal Developer", "title": "", "url": "https://developer.paypal.com/webapps/developer/docs/classic/paypal-payments-pro/integration-guide/WPRecurringPayments/", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 1, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990123.20/warc/CC-MAIN-20150728002310-00051-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 847765304, "recordOffset": 847757102, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{10516=Copyright © 1999 - 2014 PayPal. All rights reserved.}", "lastModified": "Wed, 29 Jul 2015 04:19:38 GMT", "textBeforeTable": "The following table lists the fields that are required in the CreateRecurringPaymentsProfile request for recurring payments using direct payments. After you have collected the information, call the CreateRecurringPaymentsProfile API operation (NVP, SOAP) for each profile to be created. The CreateRecurringPaymentsProfile request must contain all required credit card information and must not contain a value for the TOKEN field. Merchants who offer free trial periods or plan to bill the first installment of a recurring payment at a later date may find it worthwhile to use the card verification feature. This feature allows merchants to verify the buyer's card, as a potential loss mitigation tool, before saving the card information and creating the buyer's recurring payment profile. Recurring payments with Direct Payment enables a recurring payment to be associated with a debit or credit card. For these payments, you must collect on your website all necessary information from your buyer, including billing amount and buyer's credit card information. Recurring Payments With Direct Payment An alphanumeric string (generated by PayPal) that uniquely identifies a recurring profile. You can specify the Profile ID in the TransactionSearch API operation to obtain all payments associated with the identified profile. Profile ID If a payment fails for any reason, PayPal adds that amount to the profile's outstanding balance. Outstanding balance The amount the buyer pays for each billing cycle. Payment amount An optional subscription period before the regular payment", "textAfterTable": "The CreateRecurringPaymentsProfile response contains a Profile ID, which is an encoded string that uniquely identifies the recurring payments profile. As with all direct payments, PayPal is completely invisible to your buyer before, during, and after the purchase. PayPal does not send an email receipt to the buyer, nor will the buyer's credit card statement indicate that PayPal processed the payment. For more options when creating a recurring payments profile, see Options for Creating a Recurring Payments Profile in the Express Checkout guide. Recurring Payments in Express Checkout See the Recurring Payments section in the Express Checkout integration guide for a complete list of features and integration information. Declined Payments When some card issuers decline payment, they transmit within the API output a 1-2 digit payment advice code to the merchant. The format of the API output is PaymentAdviceCode=<Code>, where <Code> is the 1 or 2-digit payment advice code. Payment Advice Codes Visa and MasterCard send payment advice codes. It is important that merchants capture these codes and determine if the cardholder would like to cancel the recurring payment transaction. The code contains additional information about why the payment was declined. For example, the advice code may tell you that the card has been terminated or that the transaction was declined for insufficient funds. Payment advice codes for Visa and MasterCard include the following card-holder initiated codes: MasterCard Response Values and Definitions Response Code Possible reason for decline", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}