{"relation": [["Gold Required", "2000", "4000", "7000", "10000", "20000"], ["Upgrade", "Level 2 Poltergust", "Level 2 Darklight", "Level 3 Poltergust", "Level 3 Darklight", "Super Poltergust"]], "pageTitle": "Luigi's Mansion: Dark Moon FAQ/Walkthrough for 3DS by super_luigi16 - GameFAQs", "title": "", "url": "http://www.gamefaqs.com/3ds/632930-luigis-mansion-dark-moon/faqs/66768?page=3", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 1, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986451.45/warc/CC-MAIN-20150728002306-00182-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 453087859, "recordOffset": 453071465, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{47770=--------------------------- (c) 2013 super_luigi 16 ---------------------------, 42830=This guide is the sole property of the account holder of the \"super_luigi16\" account. It may not be reproduced under any circumstances except for personal or private use. It may not be distributed publicly in any manner without the written consent of the owner. The only website that is allowed to have this guide posted is gamefaqs.com. Use of this guide on any other website is a violation of copyright, and is prohibited by law. If you would like to have this guide posted on your website, you must have advance written permission of the owner (feel free to contact me). Copyright 2012 \"super_luigi16\", 52169=© 2015 CBS Interactive Inc. All rights reserved.SitemapAdvertisePrivacy PolicyAd ChoiceTerms of Use}", "textBeforeTable": "This is the COMPLETE list of all upgrades. Poltergust upgrades allow you increase the damage done by your electrical shocks if you charge your suction up more--Level 2 deals 20 points of damage and Level 3 deals 50 points of damage. The Darklight upgrades allow you to shine the Darklight longer without it burning through Luigi's skin. Finally, the Poltergust upgrade makes it much easier to trigger electrical shocks by increasing ghost resistance sensitivity. Each of these upgrades requires gold--each mission's gold is added to the running total. If you need to grind for gold, I recommend the latter levels as they can net you 2000+ gold if you really grab everything. B-2 is a good early choice otherwise. Anyway, here is the table: Appendix B: Poltergust Upgrades  Coming Soon! The table below is your directory before the in-depth information. Each ghost has its name listed which is linked to the ghost's in-depth information. The ghost's HP is listed next along with its element and weaknesses. These are the most pertinent highlights. The ghost's locations are also listed out, and those locations are linked to their respective sections in the Walkthrough. Welcome to Appendix A where we're all about ghosts! This section's all about your primary adversaries, so that's why it's first in the long list of Appendices. Remember that I only try to inform you of pertinent information, so don't expect random facts about the ghosts or anything", "textAfterTable": "Appendix C: Gem Locations While I do cover the Gems in the guide, this section will detail where the Gems are located--it's a good starting place if you're missing a particular Gem. The Gems in each mansion are named after some sort of precious metal, so I will call them as such here. Otherwise, they're simply \"gems.\" In the tables below, I abbreviate the cardinal directions to their initials: N = North, S = South, E = East, and W = West. My descriptions are terse mostly because you can look where they are in the Walkthrough if you're having that much trouble pinning them down. I try to place clarifying notes--commonly when a specific level if the area is accessible in more than level but the Gem is not--when necessary. The tables are broken up by mansion/precious metal type: Gloomy Manor - New Amethyst Shape Number Room Details Disk 1 Mudrrom Exterior NW tree. Rounded Triangle 2 Front Yard W Flower. Rectanble 3 Parlor Digital clock. Pin 4 Studio Look in camera; behind wall. Teardrop 5 Entrance Suit of armor; shoot head at NW painting (A-3 only!) Octagon 6 Dining Room Vault on ceiling. Rhombus 7", "hasKeyColumn": true, "keyColumnIndex": 1, "headerRowIndex": 0}