{"relation": [["Update Snapshot", "GroundCar Score™", "Registered Company Name", "Full Contact Info", "License Info", "Airport Transfer Rates", "Meter or Hourly Rates", "Cancellation Policy", "Fleet Pictures"], ["Co. Results", "40", "Displayed", "Displayed", "Not Displayed", "Not Displayed", "Not Displayed", "Not Displayed", "Displayed"], ["State Results", "31 Average", "97% Displayed", "42% Displayed", "1% Displayed", "18% Displayed", "16% Displayed", "13% Displayed", "73% Displayed"]], "pageTitle": "Meridian Transportation Resources LLC in Portland, OR | Ground Transportation Reviews", "title": "", "url": "http://www.transportationreviews.com/or/profiles/meridian-transportation-resources-portland-or-profile.php", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 2, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988250.59/warc/CC-MAIN-20150728002308-00253-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 761487776, "recordOffset": 761479574, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{10045=Smart Ride Media™ All Rights Reserved 2007-2015 Terms of Service | Advertise | Buy Domains}", "textBeforeTable": "GroundSnapshot ™ Meridian Transportation Resources LLC www.columbiagorgetours.net Refer to our state regulatory page for additional information about agencies which may regulate Meridian Transportation Resources LLC. Edit Info 1 = Poor, 2 = Below Avg., 3 = Average, 4 = Above Avg., 5 = Great N/A Driver Attire N/A Driver Attitude N/A Vehicle Appearance N/A Timeliness N/A Ease of Reservation N/A Value N/A Recommended N/A CONSUMER RATING 0 TOTAL REVIEWS: 40 GROUNDCAR SCORE™ RATINGS SUMMARY SERVICE TYPE: Charter Bus SERVICE AREA: Northwest state, Portland Company Information Meridian Transportation Resources LLC 1521 North Jantzen Ave Portland, OR 97217 541-298-7064 www.columbiagorgetours.net Submit a Customer Review The Oregon airport ground transportation company called Meridian Transportation Resources LLC which is located in Portland, Oregon was recently rated by our editors and received a GroundCar Score rating of 40. Scores range from 0 to 100. Companies with a high transparency score generally communicate important travel information on their website which may also include transfer rates going to and from Oregon area airports and or other", "textAfterTable": "Company Name(s) displayed on www.columbiagorgetours.net MTR Western Snapshot Footnotes: The Registered Company Name is the name which is registered with the Motor Carrier Transportation Division (MCTD) within the Oregon Department of Transportation (ODOT) and or the Oregon Secretary of State. The Motor Carrier Transportation Division (MCTD) regulates all authorized ground transportation companies who operate within the state of Oregon and whom are under their direct supervision. State Results are compiled from all Oregon ground transportation companies who are listed on www.TransportationReviews.com. - Top of Page - Smart Ride Media™ All Rights Reserved 2007-2015 Terms of Service | Advertise | Buy Domains Disclaimer: The reviews posted on the site are written by travelers who claim to be a customer of an airport ground transportation company. Customer ratings, feedback, comments, testimonials and opinions contained within displayed reviews, do not represent the views of www.TransportationReviews.com (the site) which is owned by Smart Ride Media™. Companies and Visitors are responsible for policing all written reviews and to notify the site about any potential false rating & review which may violate the site guidelines. The GroundCar Score™ is an objective score that is based on the site interpretation of transparency. The site does not guarantee accuracy of displayed data nor endorse or recommend any companies. All users of the site should", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}