{"relation": [["Statistic", "Market cap", "Price/book", "Price/sales", "Forward P/E", "Cash/debt", "Total stores", "Revenue breakdown (mrq)", "Competitors"], ["Result (TTM or Most Recent Available)", "$44.3 billion", "8.5", "3.2", "22.6", "$2.46 billion / $0.55 billion", "18,278", "Americas: $2.84 billion Channel Development: $0.38 billion Europe/Middle East/Africa: $0.31 billion China/Asia Pacific: $0.21 billion", "Dunkin' Brands Green Mountain Coffee Roasters"]], "pageTitle": "Analysts Debate: Is Starbucks Still a Top Stock? - DailyFinance", "title": "", "url": "http://www.dailyfinance.com/2013/04/13/analysts-debate-is-starbucks-still-a-top-stock/?source=edddlftxt0860001", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988511.77/warc/CC-MAIN-20150728002308-00109-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 391034479, "recordOffset": 391007193, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{27195=Sean's take There's not much to say about Starbucks that its first-quarter earnings report in January didn't already spell out for investors. China is a hot spot of growth, with the China/Asia Pacific region delivering 28% revenue growth, while global same-store sales throughout the remainder of the company remain strong -- up 6%, thanks to incredible branding, increase traffic, solid pricing power, and a knack for staying ahead of the innovative curve., 40235=Copyright © 1995 - 2013 The Motley Fool, LLC. All rights reserved. The Motley Fool has a disclosure policy., 28584=Finally, I saw the collaborative side of Starbucks that keeps its friends close and its enemies closer. When Dunkin' Brands formed a strategic partnership with Green Mountain in February 2011, Starbucks followed suit just weeks later with a partnership of its own with Green Mountain.}", "textBeforeTable": "Starbucks by the numbers Here's a quick snapshot of the company's most important numbers: In that spirit, we three Fools have banded together to find the market's best and worst stocks, which we'll rate on The Motley Fool's CAPS system as outperformers or underperformers. We'll be accountable for every pick based on the sum of our knowledge and the balance of our decisions. Today, we'll be discussing Starbucks , the world's largest coffee-shop chain. The Motley Fool has been making successful stock picks for many years, but we don't always agree on what a great stock looks like. That's what makes us \"motley,\" and it's one of our core values. We can disagree respectfully, as we often do. Investors do better when they share their knowledge. × Read More » %BloggerLongBio% About View All Posts » Why Caribbean Vacations Are Becoming Big Business for Airlines, Cruise Lines, and Even Rail Lines Harley-Davidson Owners Recall When Their Bikes Didn't Need So Many Repairs Sikorsky's Newest Helicopter Is Nearly as Fast as an Airplane -- And It's Got Rockets Recent Posts Updated Apr 14th 2013 8:00AM Apr 13th 2013 3:40PM", "textAfterTable": "Sources: Yahoo! Finance, Starbucks 10-Q. mrq = most recent quarter. Source: Wikimedia commons.  Sean's take There's not much to say about Starbucks that its first-quarter earnings report in January didn't already spell out for investors. China is a hot spot of growth, with the China/Asia Pacific region delivering 28% revenue growth, while global same-store sales throughout the remainder of the company remain strong -- up 6%, thanks to incredible branding, increase traffic, solid pricing power, and a knack for staying ahead of the innovative curve. Earlier this week, I broke down Starbucks' outperformance into three rudimentary building blocks. I saw the company first as an innovator that remodeled and refreshed its stores to make them more inviting and reworked its food line to appeal to healthier eaters. Next, I envisioned Starbucks as an emulator that saw a concept from another vendor and ran with it. This is what prompted Starbucks to develop its own single-serve brewing and espresso machine known as the Verismo to take on Green Mountain's dominant Keurig system, and this is also what drove it to emulate Whole Foods Market by striking deals with local and organic growers to bring more nutritious food choices and drinks into its stores. Finally, I saw the collaborative side of Starbucks that keeps its friends close and its enemies closer. When Dunkin' Brands", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}