{"relation": [["", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", ""], ["FAULT", "ACTIVE FAULT", "SLIP RATE", "TECTONIC CREEP", "FOCUS", "EPICENTER", "P WAVE", "S WAVE", "SURFACE WAVE", "MATERIAL AMPLIFICATION", "DIRECTIVITY", "RICHTER MAGNITUDE", "MOMENT MAGNITUDE", "MODIFIED MERCALLI SCALE", "EARTHQUAKE CYCLE", "DILANTANCY-DIFFUSION MODEL", "LIQUEFACTION", "TSUNAMIS", "SEISMIC GAP", "CAPABLE FAULT", "MAXIMUM CREDIBLE EARTHQUAKE", "SEISMIC HAZARD MAP", "MAGMA", "SHIELD VOLCANO", "BASALT", "TEPHRA", "PYROCLASTIC", "LAVA TUBE", "COMPOSITE VOLCANO", "ANDESITE", "VOLCANIC DOME", "RHYOLITE", "CALDERA", "HOT SPRINGS AND GEYSERS", "CALDERA ERUPTIONS", "LAVA FLOW", "ASH FLOW", "LATERAL BLASTS", "PYROCLASTIC FLOW", "DERIS FLOW/MUDFLOW"], ["fracture or a fracture system along which rocks have been displaced", "fault that has moved in the last 10,000 years", "the ratio of slip (displacement) to the time interval over which that slip occurred", "gradual displacement not accompanied by felt earthquakes.", "the point or area within the earth where the earthquake rupture starts", "point on the earth's surface directly above the focus", "Also called compressional waves. The fastest set of earthquake vibrations. They move through the Earth in compression and expansion motions.Primary waves are able to travel through both solids and liquids.", "also called shear waves can travel only through solid material", "A type of seismic wave that travels along Earth's surface. Love Waves (horizontal ground movement), Rayleigh Waves (rolling motion)", "the intensity of shaking also depends on the tupe of geologic material.the amplitude of the shaking can be increased", "results when the amplitude of seismic waves increases in the direction of fault rupture", "measure of the amount of energy released.", "has a more sound physical base and is applicable over a wider range of ground motions that is the Richter magnitude, so it has been encouraged in reporting earthquake statistics", "has 12 divisions of intensity based on observations concerning the severity of shaking during an earthquake", "related to a drop in elastic strain following an earthquake and re accumulation of strain prior to the next event", "assumes that the first stage in earthquake development is an increase of elastic strain in rocks that causes them to dilate after stress on the rock reaches one-half the rocks breaking strength.", "transformation of water-saturated granular material from a solid to a liquid state.", "A large sea wave normally produced by sudden movement of the ocean floor caused by an earthquake or volcanic eruption. These waves can travel at high speeds across an ocean basin and cause great destruction when they reach land.", "areas along active fault zones that are capable of producing large earthquakes but have not produced one recently", "fault that has exibited movement at least once in the last 50,000 years or multiple movements in the last 500,000 years", "believable event based on the tectonic environment historic earthquakes and paleoseismicity", "earthquake risk associated with a particular area is shown on a seismic hazard map", "molten rocks that includes a small component of dissolved gases", "formed by fluid lava flow (rather than explosive eruptions). flow after flow pours out in all directions from a central summit vent, or group of vents, building a broad, gently sloping dome shape, with a profile mush like that of a warriors shield.", "composed mostly of feldspar and ferromagnesian minerals", "all types of volcanic debris ejected from a volcano", "broken fire", "very close to the surface, but they insulate the magma, keeping it hot and fluid", "associated with a magma of intermediate silica content (about 60%) which is more viscous than the lower silicate magma of shield volcanos", "composed mostly of soda- and lime- rich feldspar and ferromagnesian minerals with small amounts of quartz.", "characterized by viscous magma with a relatively high silica content (about 70%)", "composed of potassium and soda-rich feldspar, quartz, and minor ferromagnesian minerals", "gigantic, often circular depressions resulting from explosive ejection of magma and subsequent collapse", "groundwater that comes into contact with hot rock becomes heated, and in some cases the heated discharges at the surface", "a collapse following very rare but extremely violent eruptions", "basaltic, andesitic, rhyolitic", "a tremendous quantity of rock fragments, natural glass fragments, and gas are blown high into the air by explosions from the volcano", "explosions of gas and ash from the side of a volcano", "one of the most lethal aspects of volcanic eruptions.", "produced when a large volume of loose volcanic ash and other ejecta becomes saturated and unstable and moves suddenly downslope."]], "pageTitle": "Geology Test # 4 Flashcards - Cram.com", "title": "", "url": "http://www.cram.com/flashcards/geology-test-4-608922", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438043060830.93/warc/CC-MAIN-20150728002420-00252-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 385673383, "recordOffset": 385647323, "tableOrientation": "HORIZONTAL", "TableContextTimeStampBeforeTable": "{12576=by blegginator9, Apr. 2008}", "textBeforeTable": "Back Front 40 Cards in this Set Clone Export Print Share through Card Range To Study Click or Press Spacebar to Begin » Click to flip 1/40 Progress Play button Play button A key: Read text to speech.a key H key: Show hint (3rd side).h key Up/Down arrow keys: Flip the card between the front and back.down keyup key Right/Left arrow keys: Navigate between flashcards.right arrow keyleft arrow key How to", "textAfterTable": "", "hasKeyColumn": false, "keyColumnIndex": -1, "headerRowIndex": 0}