{"relation": [["Size", "X-Small", "Small", "Medium", "Large", "X-Large"], ["Circumference of Wrist", "Up to 6.5\"", "6.5\" - 7.25\"", "7.25\" - 8.25\"", "8.25\" - 9\"", "9\" - 10\""]], "pageTitle": "BraceAbility Thumb Spica Splint | Wrist Brace with Thumb Joint Support", "title": "", "url": "http://www.braceability.com/thumb-spica-brace", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988650.53/warc/CC-MAIN-20150728002308-00312-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 343146095, "recordOffset": 343126554, "tableOrientation": "HORIZONTAL", "TableContextTimeStampBeforeTable": "{3629=The palmar stay of this spica thumb brace can be removed for a more flexible fit, or it can be left in place for more support. There is also a removable thumb stay to give users options as to support and immobilization.  , 4002=This CMC joint brace is convenient in that it only immobilizes the thumb; other fingers are left unrestricted. In fact, contouring at the palmar crease makes the brace especially accommodating for full finger movement. The CMC thumb support also has extra contouring at the MP of the fifth finger (pinky) to allow for palmar spread (splaying the fingers)., 51249=Monday to Friday - 9:00AM - 4:30PM Central Time}", "textBeforeTable": "Sizing Chart SIZING: Measure the Circumference of your Wrist - X-Small, Up to 6.5\" - Small, 6.5\" - 7.25\" - Medium, 7.25\" - 8.25\" - Large, 8.25\" - 9\" - X-Large, 9\" - 10\" Color: Black Treats de Quervain’s Syndrome, rheumatoid arthritis, thumb sprains and more Durable, breathable and padded material Easy to adjust and secure loop-and-lock closure Removable rigid thumb stay Removable & adjustable palmar stay Contouring at the MP joint of the fifth finger to permit finger spreading Contouring at the palmar crease for greater finger function This wrist and thumb splint for immobilizing the MP and CMC thumb joints is designed with attention to function as well as user-comfort. Some of its features that cater to these ends include: MP and CMC Thumb Support If one sprains the thumb by falling onto an outstretched hand or wiping out while skiing with poles, for instance, he or she may need to immobilize the thumb via an immobilizing thumb support for several weeks to allow the swelling to reside and healing to take place.  BraceAbility offers a number of braces for sports injuries. A CMC joint can also be helpful in reducing the painful swelling of the joints associated with rheumatoid arthritis. Treatment for this condition largely involves pain management and learning how best to protect the joints. Immobilizing the joints of the thumb and wrist area via a spica thumb splint that leaves the other fingers free is one such way to", "textAfterTable": "Measurement point: Circumference of wrist. Additional Information L Code: L3807 You May Also Like Corflex Thumbster Pediatric Thumb Splint for Kids $24.99 Corflex Target Hitchhiker's Thumb Hyperextension Brace $16.99 Corflex Thumbster Soft Thumb Immobilizer $30.99 Bauerfeind RhizoLoc Thumb Stabilizer $134.95 $79.95", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}