{"relation": [["Course Requirements", "Advocacy", "Civil Procedure I", "Constitutional Law I", "Contracts", "Contract Negotiation", "Criminal Law", "Foundations of Law", "Professional Responsibility", "Property", "Regulatory State", "Research, Writing & Analysis", "Torts I", "*Total Credit Hours for Required Courses", "Electives", "Total Credits Required to Graduate"], ["Credit Hours", "2", "4", "2", "4", "1", "3", "1**", "3", "4", "2", "2", "4", "32", "56", "88"]], "pageTitle": "Required Curriculum: Michigan State University College of Law", "title": "Required Courses Students Entering Fall 2011 or Later", "url": "http://alumni@law.msu.edu/academics/ac-juris-req.html", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988065.26/warc/CC-MAIN-20150728002308-00026-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 7511990, "recordOffset": 7503788, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{15708=**Effective with the Fall 2015 Entering J.D. Class., 17997=Law College Building » 648 N. Shaw Lane » East Lansing, MI 48824-1300 » 517-432-6800 » fax 517-432-6801 » law@law.msu.edu, 17653=Updated July 14, 2015, 16958=Students who enter MSU Law in Fall 2008 or later are required, for graduation, to complete at least one upper-level course that includes instruction in trial and appellate advocacy, alternative methods of dispute resolution, counseling, interviewing, negotiating, problem solving, factual investigation, organization and management of legal work, or drafting. Such instruction must engage each student in skills performances that are assessed by the instructor, including feedback. The skills component must receive weight in the final grade for each course that is at least equivalent to one credit hour (e.g., 50% in a two credit hour course, or 25% in a four credit hour course.)}", "lastModified": "Tue, 14 Jul 2015 19:08:21 GMT", "textBeforeTable": "The following are required for graduation. Required Curriculum Intellectual Property Law Global Food Law Dubai American Legal System LL.M. & M.J. Graduation Requirements Study Abroad Dual Degrees Courses Moot Court Journals Real-World Experience Centers & Institutes Focus Areas & Certificates Electives Required Curriculum Juris Doctor Advancement Staff Giving & Naming Opportunities Donors & Giving Societies Support MSU College of Law Leave a Lasting Legacy with a Planned Gift Alumni Notes & Updates Scholarships Alumni Association Alumni & Donors Careers Accounting Financial Aid Library Technology Services Get Involved » Student Engagement » Diversity Services » Academic Success Student Support Academics Registrar Current Students LL.M. & M.J. » Admitted Candidates » Request Information » Events » Scholarships » Apply J.D. Affiliation with MSU About MSU Law", "textAfterTable": "*Students who have a cumulative grade point average of less than 2.50 at the conclusion of his/her first two regular semesters (fall/spring) are required to choose at least 14 credits of classes from the following core courses to complete the requirements for graduation:  Administrative Law, Basic Income Taxation, Business Enterprises, Constitutional Law II, Criminal Procedure I, Decedents' Estates and Trusts, Evidence, Payment Systems, Sales and Leases, Secured Transactions. **Effective with the Fall 2015 Entering J.D. Class. Upper Level Writing Requirement In view of the fact that lawyers and other members of the legal profession are commonly called upon to communicate their expertise in writing, the faculty of the Michigan State University College of Law has instituted an upper level writing requirement (the ULWR) in order to assure that every student who graduates from this law school will have had the experience of researching, analyzing and writing about legal issues on a more sophisticated and in-depth level than is generally possible during the first year of law school. The benefits of the ULWR are twofold. Each College student will not only acquire enhanced research, analytical and writing skills, but also will produce a paper that may be used as a writing sample for job interviews and/or that may improve the student's credentials if the paper is published in a law review or bar journal. Detailed information regarding the ULWR can be found in the MSU Law Student Handbook. Professional Skills Requirement Students who enter MSU Law", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}