{"relation": [["Domains (TLD)", "orange.com", "orange.net", "orange.org", "orange.info", "orange.biz", "orange.eu"], ["Status", "Expires in 4 months", "Expires in 6 months", "This domain is booked", "This domain is booked", "Expires in 8 months", "This domain is booked"], ["", "", "", "", "", "", ""]], "pageTitle": "doladowania.orange.pl | Website Review for doladowania.orange.pl | WooRank.com", "title": "", "url": "https://www.woorank.com/en/www/doladowania.orange.pl", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 7, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990112.92/warc/CC-MAIN-20150728002310-00005-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 933812019, "recordOffset": 933752454, "tableOrientation": "HORIZONTAL", "textBeforeTable": "Easy to solve Low impact Headings 0.9009009009009 Improve the Meta Description Check your Google™ Webmaster Tools (Search Appearance > HTML Improvements) for any warning messages to identify meta descriptions that are too long/short or duplicated across more than one page. A good description acts as a potential organic advertisement and encourages the viewer to click through to your site. Ensure that each of your web pages have a unique meta description that is explicit and contains your most important keywords for each page (these appear in bold when they match part or all of the user’s search query). Meta descriptions allow you to influence how", "textAfterTable": "Show more Show less ? Great, your website is structured using HTML headings (<H1> to <H6>). Use your keywords in the headings and make sure the first level (<H1>) includes your most important keywords. Never duplicate your title tag content in your header tag. While it is important to ensure every page has an <H1> tag, never include more than one per page. Instead, use multiple <H2> - <H6> tags. Add the important keywords in <H> headings Keywords Cloud konta 10 usługi 8 zasileń 8 danych 8 regulaminem 8 prepaid 8 się 7 umowy 6 osobowych 6 ? This Keyword Cloud provides an insight into the frequency of keyword usage within the", "hasKeyColumn": true, "keyColumnIndex": 1, "headerRowIndex": 0}