{"relation": [["Dungeon", "Normal", "Tutorial", "Ranked", "Snake Pit", "Library", "Crypt", "Factory", "Campaign", "Gauntlet", "The Boss Hive (v0.2)"], ["Special Features", "All unlocked enemies may appear.", "Includes four preset levels to ease players into the game.", "Monsters have 20% attack bonus. Scored may be submitted online.", "Monsters: serpents, gorgons, naga. Bosses: Jormungandr, Medusa.", "Monsters: warlocks, dragonspawn, imps. Bosses: Matron of Flame, Aequitas.", "Monsters: zombies, wraiths, vampires. Bosses: Tormented One, Frank the Zombie.", "Monsters: meat men, animated armour, golems. Bosses: Iron Man, Super Meat Man.", "Monsters: Dragonspawn, Goats, Goblins, Gorgons, Imps, Naga, Serpents", "Monsters: ???", "Monsters: All enemies, including challenge exclusives, may appear."], ["Unlock", "Available at start.", "Available at start.", "Defeat the Normal dungeon using all Tier 3 classes.", "Defeat the Normal dungeon using any character.", "Defeat the Normal dungeon using all Tier 1 classes.", "Defeat the Normal dungeon using all Tier 2 classes.", "Defeat the Normal dungeon using all Tier 3 classes.", "Gain access to all the playable races (including the class/race combos).", "Defeat the Normal dungeon using all Tier 3 classes.", "Unlock all Races, including the 3 Race/Class combos."]], "pageTitle": "Difference between revisions of \"Alpha:Dungeon\" - DDwiki", "title": "", "url": "http://www.qcfdesign.com/wiki/DesktopDungeons/index.php?title=Alpha:Dungeon&diff=4767&oldid=2751", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 1, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990114.79/warc/CC-MAIN-20150728002310-00061-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 670962804, "recordOffset": 670951605, "tableOrientation": "HORIZONTAL", "textBeforeTable": "There are 6 types of dungeons in the game. Overview 4.5 The Boss Hive (v0.2) 4.4 Factory 4.3 Crypt 4.2 Library 4.1 Snake pit 4 Challenge dungeons 3 Ranked 2 Normal Dungeon 1 Overview Contents Each session of Desktop Dungeons is played in a randomly generated 20x20 block dungeon. Dungeons are populated with enemies, altars to gods, glyphs, powerups, gold, and stores. Revision as of 04:57, 17 June 2011         Completing this dungeon with 4 Classes unlocks a \"Special Class\" +   Populated by every type of enemy in the game. Monsters all have increased stats and boss abilities. +   +   === The Boss Hive (v0.2) === +  ", "textAfterTable": "Normal Dungeon This is the standard game mode. The normal dungeon is created with the following objects: 39 of any of the unlocked Monsters. The monster levels are distributed as such: 10x L1, 5x L2, 4x L3, 4x L4, 4x L5, 3x L6, 3x L7, 3x L8, 2x L9 and 1x L10. This grants a total of 149 Experience (just enough for Level 8) to be earned before confronting the boss, unless the various ways of gaining bonus experience are utilised. 3 each of the following items: Health Powerup, Mana Powerup, Attack Powerup, Health Potion and Mana Potion. A Thief will cause 4 of each to be created. 10 piles of gold, randomly containing 1 to 3 gold each. A Thief will have 3 extra piles of gold spawned for them. An additional pile of gold will also be created for every 2 Classes that complete the Snake Pit Challenge. This creates a maximum of 19 piles of gold, and 22 for Thieves. 3 Shops. A Tinker will cause 6 more shops to be created, and an extra shop will appear for every 3 Classes that complete the Factory Challenge. This creates a maximum of 9 shops, and 15 for Tinkers. 5 Glyphs. Both Thief and Wizard will cause an extra Glyph", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}