{"relation": [["", "CAP, n (%)", "HD-NCP, n (%)", "LD-NCP, n (%)", "Agatston score index", "Coronary arteries with plaques determined", "1 vessel, n (%)", "2 vessels, n (%)", "3 vessels and more, n (%)", "ACEI/ARBs, n (%)", "Aspirin, n (%)", "Other antiagregants, n (%)", "Statins, n (%)", "Metformin, n (%)"], ["Patients with known CAD (n = 126)", "96 (95% CI = 31–102)", "31 (95% CI = 21–56)", "25 (95% CI = 13–48)", "586 (95% CI = 401–838)", "", "46 (36.5%)", "42 (33.3%)", "38 (30.2%)", "126 (100%)", "98 (77.8%)", "6 (4.8%)", "94 (74.6%)", "41 (32.5%)"]], "pageTitle": "1. Introduction", "title": "", "url": "https://www.mdpi.com/2077-0383/2/3/32/xml", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 1, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988317.67/warc/CC-MAIN-20150728002308-00204-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 916873779, "recordOffset": 916855350, "tableOrientation": "HORIZONTAL", "TableContextTimeStampBeforeTable": "{21892=All the statistical analyses were performed in SPSS for Windows v. 20.0 (SPSS Inc., Chicago, IL, USA, 2011). Continuous variables are presented as mean ± SD, mean and 95% CI or median and interquartile range. Categorical variables are expressed as frequencies and percentage. An independent group t-test was used to compare all the interval parameters matching the criteria of normality and homogeneity of variance. For interval parameters that fail to match these criteria, the non-paramentric Mann-Whitney test was used to compare variables. Categorical variables and frequencies were compared using Chi2 test and Fisher exact test of independence. SUA frequencies were normally distributed (using the Kolmogorov-Smirnov test), and data were not positively skewed. Frequencies of CMCs and hs-CRP concentrations were not distributed. The data, however, were not transformed. The potential factors that may be associated with CMCs were identified first with the univariate analysis (ANOVA), and then the independent predictors of a decrease in CMCs were searched with the multivariate one-step backward logistic regression analysis, initially including variables for which a p value < 0.1 was achieved from the univariate analysis. The odds ratio (RR) and confidence intervals (95% CI) were calculated for factors independently associated with a decrease in circulating CMCs. A calculated difference of p < 0.05 was considered significant.}", "TableContextTimeStampAfterTable": "{34097=This research received no specific grant from any funding agency in the public, commercial, or not-for-profit sectors. The study results were presented as a poster presentation on the 20th International Postgraduate Course of Cardiovascular Disease, Davos, Switzerland, 10–15 February 2013.}", "lastModified": "Thu, 14 May 2015 03:35:33 GMT", "textBeforeTable": "General characteristics of study patients. Table 1 jcm-02-00032-t001_Table 1 . Calcified atherosclerotic plaques were determined in 96% of patients; HD-NCP and LD-NCP were found in 31% and 25% respectively. The median of the Agatston score index was 586 (95% CI = 401–838). Coronary arteries with plaques were determined in 36.5%; 33.3%; and 20.2% for one vessel, two vessels, three and more vessels respectively. Table 2 Baseline angiographic and treatment characteristics of patients with known CAD are presented in . Two groups of persons surveyed (healthy volunteers and patients with known CAD) were compared in terms of demographics, smoking, body mass index, CAD family history, mean systolic BP, heart rate, creatinin, fasting glucose and eGFR. Patients with known CAD, however, had hyperlipidaemia (44.4%), arterial hypertension (66.7%), T2DM (36.5%). An increase in HbA1c, serum uric acid, hs-CRP, LDL cholesterol, and triglycerides, as well as a decrease in HDL cholesterol were found in patients with known CAD when compared with healthy volunteers. Mediana of a 10-year Framingham General Cardiovascular Risk in patients with known CAD and in healthy volunteers was 23% and 2% respectively. Table 1 General characteristics of study patients are presented in 4. Results and Discussion < 0.05 was considered significant. p value < 0.1 was achieved from the univariate analysis. The odds ratio (RR) and confidence intervals (95% CI) were calculated for factors independently associated with a decrease in circulating", "textAfterTable": "HbA1c, % 3.8 (95% CI = 3.1–4.6) 6.8 (95% CI = 4.1–9.5) 0.001 Fasting glucose, mmol/L 4.11 (95% CI = 3.2–5.5) 5.20 (95% CI = 3.3–9.7) 0.07 Creatinin, μmol/L 65.7 (95% CI = 53.1–80.5) 72.3 (95% CI = 58.7–92.6) 0.48 SUA, mmol/L 17.1 (95% CI = 9.1–25.7) 23.8 (95% CI = 15.8–31.3) 0.05 hs-CRP, mg/L 1.15 (95% CI = 0.11–3.18) 4.95 (95% CI = 3.15–9.80) 0.001 TC, mmol/L 4.1 (95% CI = 3.1–5.0) 5.1 (95% CI = 3.9–6.1) 0.012 LDL cholesterol, mmol/L 2.75 (95% CI = 2.44–3.6) 3.23 (95% CI = 3.11–4.4) 0.014 HDL cholesterol, mmol/L 1.01 (95% CI = 0.92–1.2) 0.91 (95% CI = 0.89–1.12) 0.012 Mean systolic BP, mm Hg 127.30 ± 5.66 130.90 ± 8.41 0.44 Heart rate, beats per min 68.56 ± 3.17 70.52 ± 3.34 0.52 LV EF, % 65.40 ± 0.87 42.80 ± 0.76 0.001", "hasKeyColumn": false, "keyColumnIndex": -1, "headerRowIndex": 0}