{"relation": [["Minute", "80", "78", "76", "73", "70", "68", "66", "64", "62", "60", "58", "56", "53", "50", "46", "44", "41", "40", "39", "37", "35", "33", "30", "28", "27", "26", "20", "19", "15", "13", "10", "9", "6", "3", "0", "-5", "-10", "-15", "-30"], ["Commentary", "Roberts takes it up and it is turned over again but O'Driscoll can't control it so the home side have another scrum. The Lions turn it over again and O'Brien carries it up strongly. O'Driscoll sums up the situation well and puts a perfectly-weighted grubber kick in for Davies who goes over for the TRY. Halfpenny lands the CONVERSION to make it a 64-0 victory for the Lions who scored 10 tries to nil.", "The Lions come again as they look for one last try but a forward pass from Maitland means the Country XV will have a late scrum.", "The Lions drive another maul towards the line but it is brought down quickly so they go out to Cuthbert and the Country XV go off their feet. Jones finds O'Driscoll in the corner and they go to the TMO who rules that he had a foot in touch.", "It is a poor throw from Best and hacked ahead by Roberts. Halfpenny fumbles and Trist kicks ahead. Maitland is there but takes it over the tryline so the Country XV have an attacking scrum. The forwards rumble towards the line before it goes wide but a big tackle from O'Driscoll ends that attack.", "They send it wide and Cuthbert finds some space before kicking ahead. Ahwang is there and puts it into touch so the Lions will have a line-out outside the 22.", "Ahwang makes an intercept on the Lions' 22 but he could not control it so the Lions have a scrum.", "It is shifted out to O'Driscoll who is brought down just in front of the poles but it is recycled and O'Brien goes over for the TRY. Halfpenny adds the CONVERSION and the Lions lead 57-0.", "The Country XV are caught in their 22 and O'Brien makes the turnover this time. It goes out to Maitland who links up with Halfpenny in the left corner but they are held up over the line.", "Alun-Wyn Jones goes offside at the maul so the Country XV can clear again. They bash it up in midfield but it is stolen on the ground and Davies is away again. Hogg ghosts through a gap but a poor pass from Faletau halts their momentum and Stevens drops a simple pass.", "They set the maul and Best breaks away. Hogg takes it up and loses it forward in the tackle so Roberts clears. The Lions come again through Cuthbert and Butler does not release in the tackle so the Lions have another line-out in the 22.", "The Lions run it from their own 22 with Maitland stepping past a few defenders. The forwards take over as they approach halfway and Davies breaks the line. He gets it away to O'Driscoll and they are on the 22 now. The Country XV go offside so they set up an attacking line-out.", "The Country XV send it wide as they look to come from their own half but it is turned over and worked out to Halfpenny who cruises over for the TRY. He adds the CONVERSION himself to bring up the 50.", "The Lions come again with O'Brien and Heaslip making ground towards the 22 but they hold on too long on the ground so Roberts can clear it.", "Another big scrum from the Lions but Roberts scrambles it into touch. They maul it into the 22 and Hogg has a crack this time. It is spun out wide and O'Driscoll is there to stroll over for the TRY. Halfpenny misses the kick and the Lions lead 43-0.", "Halfpenny drops another simple ball so the home side have a scrum just outside their 22. Roberts gives it to Catt who is shut down quickly and it is turned over. The Lions shift it wide to Maitland who turns it on the inside to Tipuric but he can't hold on.", "The Country XV go wide but Gibbon spills it forward so the Lions have the scrum this time. Maitland breaks the line and finds Roberts in support but his wide ball goes to ground and the Country XV clear it.", "Hogg kicks the second half off and Roberts bangs it into touch immediately. The Lions surge over halfway but Halfpenny, who is on for North, loses it forward in the tackle.", "The Country XV collapse the scrum so the Lions have one last crack before half-time. The line-out is stolen and hacked into touch to bring an end to the first half, join us in ten minutes for the second half.", "Roberts clears but Cuthbert claims it and links up with Maitland who takes it up to the 22. O'Driscoll finds Roberts with a great offload, but a forward pass from Hogg sees the move break down.", "Snowden scuffs it off the side of his boot, but it goes into touch near halfway. The Lions bash it up in midfield and then Murray switches back to the left and finds some space. Cuthbert finds O'Brien on his outside and he has a go at the tryline but he was forced into touch just short.", "The Lions come again but a forward pass from Murray to North gives the Country XV some respite in the form of a scrum.", "They spread it down the hands and some slick passing sees North go over in the left corner for his second TRY. Hogg misses the kick but the Lions lead 38-0.", "A slight knock from the Lions as they look to attack off the restart. A scrum to Countries on the Lions 10-metre line.", "TRY for the Lions. Richard Hibbard holds the ball at the back of the maul and he goes over for the try. Stuart Hogg's CONVERSION is good and the Lions lead 33-0.", "The Lions kick the penalty to the corner and look to set up the driving maul.", "The Lions are on the attack inside the Country XV 22. Searching for that next try but they win a penalty.", "The ball is stolen on the ground by Tipuric and swung out to North who races away and finds Maitland on his outside. He gives it back to North who has run the length of the field to score the TRY. Hogg slots the CONVERSION to make it 26-0.", "The Country XV claim another loose ball and this is a great chance for them right on the tryline. They bash away at the line and the Lions give away a few penalties on defence.", "Roberts kicks deep as the Country XV look for some territory but the chasers are offside so the Lions have another line-out on the 22. It is stolen and cleared by Snowden. Maitland is there and his kick is charged down but the ball goes into touch deep in the Lions 22.", "Trist spills the ball into touch so the Lions have another chance. Hogg breaks the line in midfield after taking a pass from Tipuric and he has too much pace for the cover defence as he goes over for the TRY. He bounces the kick off the post and the Lions lead 19-0.", "The Lions take it wide again and cuthbert steps inside as he goes over the 22, he pops a pass to Murray in support and the scrumhalf is over for the TRY. Hogg adds the easy CONVERSION and they lead 14-0.", "Maitland takes it up but it is turned over and cleared by Snowden. Hogg finds a good touch as the Lions keep the Country XV in their own half. Tipuric claims a loose ball and storms into the 22, and it is sent out wide to Cuthbert who scores the TRY in the corner. Hogg nails the touchline CONVERSION to make it 7-0.", "The Country XV engage early so the Lions have the put-in this time. It is a massive shove and they go left but O'Brien is tackled into touch. The clearance is charged but goes dead so it will be a drop-out.", "O'Driscoll gives it to Roberts but the country XV turn it over and Snowden clears. Cuthbert runs it back and the forwards are there in support. Roberts goes over the gainline but Murray fumbles it at the base so the Country XV have the first scrum.", "Roberts kicks the game off and Hogg kicks it long. It is returned and Maitland claims it. The Lions shift it wide and Maitland grubbers ahead but it goes into touch.", "Conditions are good in Newcastle, so we should be in for an open and entertaining game.", "There is not much Super Rugby experience in the Country team, so they will be out to prove a point against their more illustrious rivals.", "The home side look to have their work cut out for them here as they face a Lions team full of players looking to push for a spot in the starting Test team.", "Welcome to live coverage of the match between the British and Irish Lions and a combined New South Wales and Queensland team from Newcastle. The Lions have not lost yet on their tour, and they look like they will have too much firepower again today."]], "pageTitle": "British & Irish Lions - NSW-Queensland vs B&I Lions live match coverage", "title": "", "url": "http://www.rugby365.com/15-british-irish-lions-2013/1117-nsw-queensland-vs-b-i-lions/score", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 5, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989178.64/warc/CC-MAIN-20150728002309-00057-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 693729496, "recordOffset": 693721294, "tableOrientation": "HORIZONTAL", "textBeforeTable": "Commentary DGs Red cards Yellow cards Penalty tries Leigh Halfpenny (56min), Leigh Halfpenny (66min), and Leigh Halfpenny (80min) Conversions Penalties Conor Murray (10min), George North (20min), Richard Hibbard (28min), George North (33min), Leigh Halfpenny (56min), Sean O'Brien (66min), and Jonathan Davies (80min) Tries B&I Lions NSW-Queensland   Result : Match status Steve Walsh (Australia) : Referee Newcastle : Venue Tue, 11 June 2013 - 11h30 : Kick-off Tue, 11 June 2013 - 19h30 : Kick-off local time 64 B&I Lions 0 NSW-Queensland British & Irish Lions LIVE MATCH COVERAGE", "textAfterTable": "NSW-Queensland Players 15 Nathan Trist 14 Alex Gibbon 13 Lewie Catt 12 Tareta-Junior Siakisini 11 Tom Cox 10 Angus Roberts 9 Michael Snowden 8 Tim Davidson 7 Jarrad Butler 6 Richard Stanford 5 Blake Enever 4 Phoenix Battye 3 Tim Metcher 2 Josh Mann-Rae 1 Haydn Hirsimaki Substitutes 23 Dale Ahwang 22 Shaun McCarthy 21 Adam McCormack 20 Trent Dyer 19 Rory Arnold 18 Rikki Abraham 17 Dylan Evans 16 Tom Kearney B&I Lions Players 15 Leigh Halfpenny 14 Tommy Bowe 13 Jonathan Davies 12 Jamie Roberts", "hasKeyColumn": false, "keyColumnIndex": -1, "headerRowIndex": 0}