{"relation": [["Measurement in Inches", "21 1/8", "21 1/2", "21 7/8", "22 1/4", "22 5/8", "23", "23 1/2", "23 7/8", "24 1/4"], ["Hat Size", "6 3/4 - S", "6 7/8 - S", "7 - M", "7 1/8 - M", "7 1/4 - L", "7 3/8 - L", "7 1/2 - XL", "7 5/8 - XL", "7 3/4 - XXL"], ["European Size", "54", "55", "56", "57", "58", "59", "60", "61", "62"]], "pageTitle": "J-Hats Godfather - Wool Felt Homburg", "title": "", "url": "http://www.hatsinthebelfry.com/product/j-hats-godfather-22871.html", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989897.84/warc/CC-MAIN-20150728002309-00217-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 493449779, "recordOffset": 493429908, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{105608=Attn: Returns & Exchanges Hats in the Belfry 407 Headquarters Drive, Suite 6 Millersville, MD 21108, 82179=Sku: j-hats-godfather-22871, 105265=8. Christmas holiday season.  All items purchased between November 11th and December 25th are exchangeable and returnable until January 25th.}", "textBeforeTable": "Costume and Theatrical Hats Most of our costume hats are one size fits all. Many of these are adjustable and others offer a universal fit. These hats will normally fit any adult size head, small- xlarge. Some of our theatrical quality hats are sized. These hats are sized in the same way that men's hats and caps are sized so check the chart above to determine the size needed. Men's Hats & Caps There are three types of sizing available in men's hats and caps. Numerical sizing and alpha sizing (small-xlarge) being the most popular with an occasional one size fits all. At the bottom of this page you will find instructions on measuring your head as well as chart to determine your numerical and alpha sizing. A one size fits all generally will fit a head with the circumference of 21 1/2\" - 23\" or a medium/large. Some one size fits all hats will fit a smaller or bigger head depending on the style. Please call us at 1-888-999-HATS or email us if you have sizing concerns. Women's Hats Most women's hats are available only in One Size Fits Most. Actual sizing varies from designer to designer, but in general they will fit a head with a circumference of 21 1/2\"- 22 1/4\". Some hats will fit a smaller or bigger head depending on the style. Please call us at 1-888-999-HATS or email us if you have sizing concerns. You've", "textAfterTable": "- Fitting your head isn't an exact science or a guarantee of fit. - Measuring Your Head Using a tape measurer, a string and ruler, or print out our custom measuring tool, measure from the back of your head bringing the ends together at the center of your forehead right above your eyebrows. Use the chart below to determine your size, rounding to the nearest 1/8\" as necessary. Shipping Orders must be placed by 1pm EST for expedited shipping. All shipments outside of the continental U.S. can reference below shipping rates. Domestic Shipping Rates Shipping Type Price Range Shipping Cost Economy Ground: 5-10 business days $0.01 to $49.99 $4.95   $50 to $99.99 $7.95   $100 And Up Free       USPS Ground: 3-6 business days (Sat delivery)   $10.95 UPS Regular Ground: 2-5 est. business days $0.01 to $49.99 $14.95   $50 to $99.99 $16.95  ", "hasKeyColumn": false, "keyColumnIndex": -1, "headerRowIndex": 0}