{"relation": [["Port name", "MSExchangeADTopologyPorts", "MSExchangeTransportPorts", "EdgeTransportPorts", "MSExchangeAntispamUpdatePorts", "MSExchangeEdgeSyncPorts", "MSExchangeTransportLogSearchPorts", "MSExchangeMonitoringPorts"], ["Associated executable file", "MSExchangeADTopologyService.exe", "MSExchangeTransport.exe", "EdgeTransport.exe", "Microsoft.Exchange.AntispamUpdateSvc.exe", "Microsoft.Exchange.EdgeSyncSvc.exe", "MSExchangeTransportLogSearch.exe", "Microsoft.Exchange.Monitoring.exe"]], "pageTitle": "Exchange 2010 Security Guide: Exchange 2010 Help", "title": "", "url": "https://technet.microsoft.com/en-us/library/bb691338(EXCHG.140).aspx", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 21, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986625.58/warc/CC-MAIN-20150728002306-00136-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 881800815, "recordOffset": 881760916, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{129522=With the release to manufacturing (RTM) version of Exchange 2010, a Unified Messaging server can communicate on port 5060/TCP, which is unsecured, or on port 5061/TCP, which is secured, but not on both. With Exchange 2010 Service Pack 1 (SP1), a Unified Messaging server listens on port 5060/TCP and on port 5061/TCP at the same time., 45164=By default, IIS version 6.0 and IIS version 7.0, which is installed with Windows Server and Windows Server 2008 respectively, have security-related configuration settings that are similar to those made by the IIS Lockdown Tool. Therefore, you do not have to run the IIS Lockdown Tool on Web servers that are running IIS version 6.0 or IIS version 7.0. However, if you are upgrading from an earlier version of IIS to IIS version 6.0 or IIS version 7.0, we recommend that you run the IIS Lockdown Tool to enhance the security of your Web server. , 67586=For more information about how to remove Outlook client access to Exchange 2010, see All versions of Outlook are allowed to access the server., 58368=After you have upgraded to Outlook 2003 or Outlook 2007, verify that you have installed a file-level antivirus software product on all desktop computers. In addition, take the following steps:, 98572=All traffic between Hub Transport servers is encrypted by using TLS with self-signed certificates that are installed by default by Exchange 2010 Setup., 168069=The following services are enabled by the Exchange 2010 registration file (Exchange2007.xml) for the Hub Transport server role., 93597=The following table provides information about ports, authentication, and encryption for data paths between Hub Transport servers and Edge Transport servers, and to and from other Exchange 2010 servers and services., 51899=These two changes mean that antivirus vendors must provide Exchange 2010–specific software. Antivirus software that is written for earlier versions of Exchange Server is unlikely to operate correctly with Exchange 2010., 91399=With mutual TLS authentication, each server verifies the connection with the other server by validating a certificate that is provided by that other server. In this scenario, where messages are received from external domains over verified connections in an Exchange 2010 environment, Outlook 2007 will display a \"Domain Secured\" icon., 87534=After you optimize the security of your communications between clients and the Exchange 2010 server, you must optimize the security of the communications between the Exchange 2010 server and other servers in your organization. By default, HTTP, Exchange ActiveSync, POP3, and IMAP4 communication between the Client Access server and other servers, such as Exchange 2010 servers that have the Mailbox server role installed, domain controllers, and global catalog servers, is encrypted., 67017=Older versions of Outlook contained vulnerabilities that can potentially increase the spread of viruses. As a best practice, you should allow Exchange 2010 to only accept MAPI connections from the Outlook 2007,, Outlook 2003, and Outlook 2002 clients. By restricting the versions of Outlook clients that can connect to Exchange, you can greatly reduce the risk of virus and other malware attacks. As a best practice, we recommend that you reduce and standardize the software versions that run in your organization., 122817=When an Exchange 2010 Client Access server is communicating with a Mailbox server that is running Exchange Server 2003, it is a best practice to use Kerberos and disable NTLM authentication and Basic authentication. Additionally, it is a best practice to configure Outlook Web App to use forms-based authentication with a trusted certificate. For Exchange ActiveSync clients to communicate through the Exchange 2010 Client Access server to the Exchange 2003 back-end server, Integrated Windows Authentication must be enabled on the Microsoft-Server-ActiveSync virtual directory on the Exchange 2003 back end server. To use Exchange System Manager on the Exchange 2003 server to manage authentication on an Exchange 2003 virtual directory, download and install the hot fix referenced in Microsoft Knowledge Base article 937301, Event ID 1036 is logged on an Exchange 2007 server that is running the CAS role when mobile devices connect to the Exchange 2007 server to access mailboxes on an Exchange 2003 back-end server. , 54157=The most important position for messaging antivirus software is at the first line of defense in your organization. In Exchange 2010, the first line of defense is at the perimeter network on the Edge Transport server., 25919=This guide is written for the IT administrator who is responsible for securing the Exchange 2010 deployment. It's designed to help the IT administrator understand and manage the overall security environment where Exchange is installed. The following information is included in this guide:, 38939=WSUS is not the only Microsoft Update management solution available. For more information about which Microsoft Update management solution best meets your needs, see MBSA, MU, WSUS, Essentials 2007 or SMS 2003?., 141528=Open a Command Prompt window. Type the following command to use the SCW command-line tool to register the Exchange 2010 extension with the local security configuration database:, 51026=Viruses, worms, and other malicious content transmitted by e-mail systems are a destructive reality faced by most Microsoft Exchange administrators. Therefore, you must develop a defensive antivirus deployment for all messaging systems. This section provides best practice recommendations for the deployment of antivirus software for Exchange 2010 and Microsoft Office Outlook 2007., 34297=This section describes some best practices for getting secure and staying secure in an Exchange 2010 environment., 28308=In early 2002, Microsoft introduced the Trustworthy Computing initiative. Since Trustworthy Computing was introduced, the development process at Microsoft and in the Exchange Server team has focused on developing software that is secure-by-default. For more information, see Trustworthy Computing., 158879=The Exchange 2010 registration files that are used by the SCW specify the port executables according to their default location. In most cases, the default location is at %Programfiles%\\Microsoft\\Exchange Server\\bin. If you have installed Exchange into a different location, you must edit the <Path> value in the <Port> section of the Exchange 2010 registration files to indicate the correct installed location., 159974=The following services are enabled by the Exchange 2010 registration file (Exchange2007.xml) for the Mailbox server role., 68499=In Exchange 2010, attachment filtering lets you apply filters at the server level to control the attachments that users receive. Attachment filtering is increasingly important in today's environment, where many attachments contain harmful viruses or unsuitable material that may cause significant damage to the user's computer or to the organization by damaging important documentation or releasing sensitive information to the public., 158447=The registration files are installed in the %Programfiles%\\Microsoft\\Exchange Server\\Scripts directory when you install Exchange 2010., 90087=Exchange 2010 includes a new feature set that is named \"Domain Security.\" Domain Security refers to the set of functionality in Exchange 2010 and Outlook 2007 that provides a relatively low-cost alternative to S/MIME or other message-level security solutions. The purpose of the Domain Security feature set is to provide administrators a way to manage secured message paths over the Internet with business partners. After these secured message paths are configured, messages that have successfully traveled over the secured path from an authenticated sender are displayed to users as \"Domain Secured\" in the Outlook and Outlook Web App interface., 24292=Applies to: Exchange Server 2010 Topic Last Modified: 2009-02-23, 180124=The following services are enabled by the Exchange 2010 registration file (Exchange2007.xml) for the Unified Messaging server role., 147724=On the Select Server Roles page, select the Exchange 2010 roles that you have installed on the computer, and then click Next., 101978=The Protocol Analysis agent is used by the Sender Reputation feature in Exchange 2010. This agent also makes various connections to outside proxy servers to determine inbound message paths for suspect connections., 57697=We strongly recommend that your users run the latest version of Outlook. If you run outdated e-mail clients on the desktop, you take a serious risk because of the object model and attachment-handling behavior in older e-mail clients. By default therefore, Microsoft Office Outlook 2003 and Office Outlook 2007 are the only MAPI clients from which Exchange 2010 accepts connections. For more information about the risks associated with running older versions of e-mail clients, see Taking Steps to Secure Outlook., 138821=The Exchange Server role extensions enable you to use the SCW to create a security policy that is specific to the functionality that is required for each Microsoft Exchange server role. The extensions are provided with Exchange 2010 and must be registered before you can create a custom security policy., 28709=In Exchange 2010, Trustworthy Computing was implemented in the following four core areas:, 91773=For more information about how to plan for and deploy Domain Security in your organization, see White Paper: Domain Security in Exchange 2007., 99721=By default, traffic between Edge Transport servers in different organizations is encrypted. By default, Exchange 2010 Setup creates a self-signed certificate and TLS is enabled. This allows any sending system to encrypt the inbound SMTP session to Microsoft Exchange. Also by default, Exchange 2010 tries TLS for all remote connections., 39879=Exchange 2010 also uses the Microsoft Update infrastructure to keep the anti-spam filters up-to-date. By default, with manual updates, the administrator must visit Microsoft Update to download and install the content filter updates. The content filter update data is updated and available for download every two weeks., 98753=All traffic between Edge Transport servers and Hub Transport servers is authenticated and encrypted. The underlying mechanism for authentication and encryption is mutual TLS. Instead of using X.509 validation, Exchange 2010 uses direct trust to authenticate the certificates. Direct trust means that the presence of the certificate in Active Directory or ADAM validates the certificate. Active Directory is considered a trusted storage mechanism. When direct trust is used, it doesn't matter if the certificate is self-signed or signed by a certification authority. When you subscribe an Edge Transport server to the Exchange organization, the Edge Subscription publishes the Edge Transport server certificate in Active Directory for the Hub Transport servers to validate. The Microsoft Exchange EdgeSync service updates ADAM with the set of Hub Transport server certificates for the Edge Transport server to validate., 136195=For more information about permissions, delegating roles, and the rights that are required to administer Exchange 2010, see Important: Update for Permissions in Exchange 2010., 157249=This topic describes the services and ports that are enabled for each Exchange 2010 server role when you run the SCW with the default Exchange 2010 registration files., 175951=The following services are enabled by the Exchange 2010 registration file (Exchange2007.xml) for the Client Access server role., 137125=You must perform this procedure on each Exchange 2010 server to which you want to apply a SCW security policy by using the SCW., 47415=For more information about how to create Exchange 2010 templates for the SCW, see the section, \"Using the Security Configuration Wizard to Secure Windows for Exchange Server Roles,\" later in this guide., 100433=Exchange 2010 also supports Domain Security. Domain Security refers to the set of functionality in Exchange 2010 and Outlook 2007 that provides a low-cost alternative to S/MIME or other message-level over-the-Internet, security solutions. The purpose of the Domain Security feature set is to provide administrators a way to manage secured message paths between domains over the Internet. After these secured message paths are configured, messages that have successfully traveled over the secured path from an authenticated sender are displayed to users as \"Domain Secured\" in the Outlook and Outlook Web App interface. For more information, see Understanding Domain Security., 64414=For a detailed white paper about how MSIT deployed an Exchange 2010 server antivirus solution, see Microsoft Exchange Server 2007 Edge Transport and Messaging Protection., 158010=Exchange 2010 includes two registration files for SCW. The general Exchange 2010 registration file is called Exchange2007.xml. It defines the security configuration for all Microsoft Exchange server roles, except the Edge Transport server role. The registration file for the Edge Transport server role is called Exchange2007Edge.xml. It defines the security configuration for Edge Transport servers., 33962=Let's look at some basic best practices that will help you create and maintain a more secure environment. Generally, just keeping software and antivirus signature files up-to-date, and running analyzer tools periodically are the most effective ways to optimize your Exchange 2010 environment for security. , 85437=Although the default, self-signed certificate is supported for Exchange ActiveSync and Outlook Web App, it is not the most secure method of authentication. In addition, it is not supported for Outlook Anywhere. For additional security, consider configuring your Exchange 2010 Client Access server to use a trusted certificate from either a third-party commercial certification authority (CA) or a trusted Windows Public Key Infrastructure (PKI) CA. You can configure authentication separately for Exchange ActiveSync, Outlook Web App, Outlook Anywhere, POP3, and IMAP4., 120220=Client Access server to Exchange 2010 Mailbox server, 54667=In Exchange 2010, agents act on transport events, much like event sinks in earlier versions of Microsoft Exchange. Third-party developers can write customized agents to take advantage of the underlying Exchange MIME-parsing engine for robust transport-level antivirus scanning., 48331=This section provides best practice recommendations for keeping your Exchange 2010 environment secure., 59094=Consider adopting a general policy to run file-level scanning on all desktop and server computers in your organization. Therefore, all Exchange Server computers should have some form of file-level antivirus scanning running on them. For each server role, you must perform additional configuration to file-level scanning so that certain directories, file types, and processes are not scanned. For example, we recommend that you never run file-level antivirus software against the Exchange store databases. For specific configuration information, see File-Level Antivirus Scanning on Exchange 2010., 92699=By default, nearly all data paths used by Exchange 2010 are protected. This section provides details about ports, authentication, and encryption for all data paths used by Exchange 2010. The Notes sections following each table clarify or define non-standard authentication or encryption methods., 139161=You must perform the registration procedure on each Exchange 2010 server to which you want to apply an SCW security policy. Two extension files are required for the various Exchange 2010 server roles. For the Mailbox, Hub Transport, Unified Messaging, and Client Access server roles, register the Exchange2007.xml extension file. For the Edge Transport server role, register the Exchange2007Edge.xml extension file., 55205=In addition, Microsoft Forefront Security for Exchange Server includes a transport antivirus agent for Exchange 2010. For more information about how to install and configure the Forefront Security for Exchange Server antivirus agent, see Protecting Your Microsoft Exchange Organization with Microsoft Forefront Security for Exchange Server., 131948=Exchange 2010 provides an SCW template for each Exchange 2010 server role. By using this template with the SCW, you can configure the Windows operating system to lock down services and ports that are not needed for each Exchange server role. When you run the SCW, you create a custom security policy for your environment. You can apply the custom policy to all Exchange servers in your organization. You can configure the following functionality by using the SCW:, 76554=The file filtering functionality that is provided by Forefront Security for Exchange Server includes advanced features that are unavailable in the default Attachment Filter agent that is included with Exchange Server 2007 Standard Edition.}", "textBeforeTable": "Secure by default   One goal of Exchange 2010 was to develop a system in which most network communications are encrypted by default. Except for Server Message Block (SMB) cluster communications and some Unified Messaging (UM) communications, this goal was met. By using self-signed certificates, the Kerberos protocol, Secure Sockets Layer (SSL), and other industry standard encryption techniques, almost all Exchange 2010 data is protected on the network. In addition, role-based setup makes it possible to install Exchange 2010 so that only the services, and the permissions related to those services, are installed with a specific and appropriate server role. In earlier versions of Exchange Server, all services for all functionality had to be installed.  Secure by design   Exchange 2010 was designed and developed in compliance with The Trustworthy Computing Security Development Lifecycle. The first step in creating a more secure messaging system was to design threat models and test each feature as it was designed. Multiple security-related improvements were built into the coding process and practices. Build-time tools detect buffer overruns and other potential security threats before the code is checked into the final product. Of course, it is impossible to design against all unknown security threats. No system can guarantee complete security. However, by including secure design principles into the whole design process, Exchange 2010 is more secure than earlier versions have been. In Exchange 2010, Trustworthy Computing was implemented in the following four core areas: In early 2002, Microsoft introduced the Trustworthy Computing initiative. Since Trustworthy Computing was introduced, the development process at", "textAfterTable": "Getting Secure The following tools are provided by Microsoft to help create a secure environment. Run the following tools before you install Exchange 2010: Microsoft Update Exchange Best Practices Analyzer Microsoft Baseline Security Analyzer Internet Information Services (IIS) Lockdown Tool and URLScan, only for environments in which you are running Windows Server 2003 after you have upgraded from Windows 2000 Server. Exchange templates for the Security Configuration Wizard (SCW) Microsoft Update Microsoft Update is a new service that offers the same downloads as Windows Update—plus the latest updates for other Microsoft programs. It can help keep your computer more secure and performing at its best. A key feature of Microsoft Update is Windows Automatic Update. This feature automatically installs high-priority updates that are critical to the security and reliability of your computer. Without these security updates, your computer is more vulnerable to attack from cyber-crooks and malicious software (or malware). The most reliable way to receive Microsoft Update is to have the updates delivered automatically to your computer by using Windows Automatic Updates. You can turn on Automatic Updates when you sign up for Microsoft Update. Windows will then analyze the Microsoft software that is installed on your computer for any", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}