{"relation": [["Strength:", "Intelligence:", "Speed:", "Endurance:", "Rank:", "Courage:", "Firepower:", "Skill:", "Total:"], ["5.0", "5.0", "7.0", "8.0", "4.0", "8.0", "5.0", "3.0", "45"]], "pageTitle": "Beachcomber - Transformers Revenge of the Fallen", "title": "", "url": "http://www.seibertron.com/vsd/character/beachcomber/4811", "hasHeader": true, "headerPosition": "NONE", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987228.91/warc/CC-MAIN-20150728002307-00293-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 691123151, "recordOffset": 691105501, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{41772=17,430 pages were recently viewed by 927 unique visitors. This page loaded in 0.02695 seconds and was viewed 1 times on Thursday, July 30th 2015 9:35am CDT}", "lastModified": "Thu, 19 Sep 2013 01:04:25 GMT", "textBeforeTable": "There was a time when neither BEACHCOMBER nor DEADLIFT was interested in warfare. BEACHCOMBER spent his time exploring the barren wilderness of remote planets, while DEADLIFT enjoyed his function of transporting deactivated DECEPTICONS to the smelting pools for repurposing. Now, however, the war has drawn both of them into its grip, and the two find themselves in a close-quarters fight to the finish. Tech Specs [ Back To Top ] Product Images Scout Class Subgroup: Autobot Faction: Transformers Revenge of the Fallen Series: Product Images Tech Spec, Jump to: Beachcomber Sightings VSD gallery googletag.cmd.push(function() { googletag.display('div-gpt-ad-1409550685887-1'); });", "textAfterTable": "[ Back To Top ] Transformers News Transformers IDW Torchbearers ArtworkTransformers IDW Torchbearers Artwork Autobot August Promotion with Clash of the Transformers Exclusive Toysrus Robots in Disguise SublineAutobot August Promotion with Clash of the Transformers Exclusive Toysrus Robots in Disguise Subline Video Review for Transformers Generations Combiner Wars Legends RodimusVideo Review for Transformers Generations Combiner Wars Legends Rodimus", "hasKeyColumn": false, "keyColumnIndex": -1, "headerRowIndex": 0}