{"relation": [["Industry Type", "Total of all sectors", "Health Care and Social Assistance", "Retail Trade", "Professional, Scientific, and Technical Services", "Other Services (except Public Administration)", "Finance and Insurance", "Construction", "Accommodation and Food Services", "Real Estate and Rental and Leasing", "Administrative and Support and Waste Management and Remediation Services", "Wholesale Trade", "Transportation and Warehousing", "Information", "Manufacturing", "Arts, Entertainment, and Recreation", "Educational Services", "Management of Companies and Enterprises", "Agriculture, Forestry, Fishing and Hunting", "Industries not classified"], ["Count", "845", "170", "123", "90", "78", "76", "61", "53", "40", "39", "38", "17", "14", "13", "12", "11", "8", "1", "1"]], "pageTitle": "Zip Code 32503 Map and Demographics", "title": "", "url": "http://www.mapszipcode.com/florida/pensacola/32503/", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042985140.15/warc/CC-MAIN-20150728002305-00085-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 574434987, "recordOffset": 574426785, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{10534=The table outlines the top 5 positions of zip code 32503 on our zip code ranking charts. For example, a rank of 10 means that a zip code ranks #10 on the list of the top zip codes in America for a particular value. The lists were created for all zip codes in America with the population of 1000 residents or higher.}", "textBeforeTable": "Zip Code 32503 Business Counts by Industry (population, housing, education, family, transportation...) zip code 32503 demographics data See all Med. Rent $844 Med. Home Value $141,700 Density 2,797.89 / sqml. Population 34,416 Zip Code 32503 » Pensacola » Escambia County » Florida State » Home Zip Code 32503 Profile --> tweet share Zip Codes Within Radius Distance Calculator More Tools ⇓ Top Lists Compare Browse", "textAfterTable": "Pensacola vs. Zip Code 32503 Comparative Analysis Population 13.73% of Pensacola residents live in zip code 32503. The average male population in Pensacola is 22.76% lower then the male population of zipcode 32503. The average female population in Pensacola is 30.99% lower then the female population of zipcode 32503. The largest racial group in zip code 32503 is white with 63.29%. Most residents occupy detached units with 26.26% of the total population of Pensacola. Family The ratio of married to non-married couples in zip code 32503 is 1:0.6. This compares to the married to non-married couples ratio of 1:0.47 in Pensacola. The highest number of families in zip code 32503 earn $50,000 to $100,000. The highest number of families in Pensacola earn $50,000 to $100,000. Household The highest number of households in zip code 32503 earn $30,000 or less. The highest number of households in Pensacola earn $30,000 or less. The largest household size in zip code 32503 is 2 people per household in comparison to that of 2 people in Pensacola. Most residents of zip code 32503 speak English as their first language with Other European language (excluding English or Spanish) being the second most spoken language. In comparison, most residents of Pensacola speak English with Spanish being the second most", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}