{"relation": [["Item #", "1", "2", "3", "", "4", "5", "6", "7"], ["Amount", "", "", "", "", "", "", "", ""], ["Monthly Income/Monthly Expenses/Allocations", "Take Home Pay (monthly, after witholding taxes)", "Monthly Income from other sources", "Savings Plan (monthly amount)", "Add items 1 and 2, then subtract item 3 to get estimated income", "Fixed Expenses (monthly)", "Variable Expenses (average over 12 months)", "Occasional Expenses (average over 12 months)", "Add items 4 – 6 to get estimated monthly expenses"]], "pageTitle": "How to prepare your personal budget | Peoples Voice: The Official Blog of The Real Peoples Bank", "title": "", "url": "http://blog.peoplesbanknc.com/budget", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438043062635.98/warc/CC-MAIN-20150728002422-00114-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 30393979, "recordOffset": 30381639, "tableOrientation": "HORIZONTAL", "textBeforeTable": "A big reason that most people don’t do budgets is because they think it is too complicated and too hard to do. But actually, doing a budget is not hard. Living by it, yes, that’s hard, but doing it is not complicated, we promise. Try these simple steps using the template and instructions below: Everybody agrees they need a budget. Here are simple steps to preparing a budget that works for you. by Peoples Bank October 9, 2012 Posted on How to prepare your personal budget Online security best-practice: Be aware and informed. → ← Here’s a simple retirement plan for small businesses Post navigation Peoples Progress", "textAfterTable": "  Write down your monthly take-home pay. Or if you’re out of work, your unemployment compensation. If you’re in sales – or work on commission – you may have to estimate, since your income may vary from month to month. List income you receive from any source, like a part-time job, a tax refund, gifts, unemployment, public assistance, dividends, and alimony or child support. Add the entries to determine your actual income for that month. Keep in mind, some of these amounts may fluctuate. List how much you deposit in savings each month from your take-home income, even if it’s only a small amount. List your fixed monthly expenses – the predictable, set amounts for the must-have items and services that you pay for each month – like rent or mortgage, car payment, and telephone, cable, or Internet access. List your variable expenses – the amounts that change, as well as the expenses you pay weekly, monthly, quarterly, semi-annually, or every year – like groceries, clothing, haircuts, property taxes, auto and homeowners insurance, and gas and electric. Divide variable expenses by 12 to get monthly average. List estimates for once-in-a-while expenses – like birthday and wedding gifts, or holiday gifts and entertainment.Divide variable expenses by 12 to get monthly average. Total your fixed, variable and once-in-a-while expenses to get a monthly estimate. Congratulations! You have just done a simple budget. If after paying your bills and putting money in savings, you still have funds, you can carry", "hasKeyColumn": true, "keyColumnIndex": 2, "headerRowIndex": 0}