{"relation": [["Dates", "July 10, 2015", "July 7 - 9, 2015", "June 16 - 17, 2015", "May 17 - 21, 2015", "May 7 - 8, 2015", "April 24 - 28, 2015", "April 18 - 19, 2015", "February 21 - 26, 2015", "February 21 - 24, 2015", "February 19 - 20, 2015", "February 1 - 5, 2015", "January 23 - 25, 2015", "November 12 - 14, 2014", "November 7 - 8, 2014", "August 27 - 30, 2014", "June 17 - 20, 2014", "June 16 - 20, 2014", "May 22 - 23, 2014", "May 18 - 21, 2014", "May 8 - 10, 2014", "April 4 - 8, 2014", "March 3 - 6, 2014", "February 22 - 26, 2014", "February 21 - 22, 2014", "February 15 - 20, 2014", "January 28 - 31, 2014", "January 26 - 30, 2014", "November 29 - 30, 2013", "September 8 - 11, 2013", "August 24 - 27, 2013", "June 13 - 14, 2013", "June 12 - 15, 2013", "May 8 - 10, 2013", "April 22, 2013", "March 4 - 7, 2013", "February 23 - 27, 2013", "February 20 - 23, 2013", "February 9 - 14, 2013", "January 28 - 30, 2013", "January 27 - 31, 2013", "December 10 - 14, 2012", "November 4 - 8, 2012", "August 22 - 25, 2012", "May 26 - 31, 2012", "February 25 - 29, 2012", "February 4 - 9, 2012", "January 29 - Feb 2, 2012", "November 3 - 4, 2011", "September 10 - 12, 2011", "September 1 - 3, 2011", "June 9 - 11, 2011", "May 14, 2011", "April 30 - May 3, 2011", "April 16 - 20, 2011", "April 8 - 9, 2011", "March 24 - 27, 2011", "February 12 - 17, 2011", "February 11 - 12, 2011", "January 31 - February 3, 2011", "November 9 - 12, 2010", "November 4 - 5, 2010", "October 14 - 17, 2010", "September 1-3, 2010", "August 22-26, 2010", "August 18-22, 2010", "May 22 - 25, 2010", "May 16-20, 2010", "May 5-8, 2010", "April 5 - 8, 2010", "March 1 – 4, 2010", "February 13 - 18, 2010", "February 6 - 10, 2010"], ["Meeting Name/Location", "Volumetric Modulated Arc Therapy (VMAT) QA", "Medical Accelerator Quality Assurance Atlanta, GA", "3rd MR in RT Symposium Lund, Sweden", "ACR 2015 Annual Meeting Washington, DC", "2nd Annual WUSTL Symposium on Optimizing MRI-Guided Radiotherapy St. Louis, MO", "ESTRO-EFOMP-AAPM Joint Session Barcelona, Spain", "Hands-on Fluoroscopy Testing Workshop Wichita, KS", "SPIE Medical Imaging Conference 2015 Orlando, FL", "Winter Institute of Medical Physics (WIMP) Breckenridge, CO", "International Conference on Physics in Medicine and Clinical Neuro-electrophsiology (PMCN2015) Dhaka, Bangladesh", "6th Annual Canadian Winter School on Quality and Safety in Radiation Oncology British Columbia, Canada", "Computed Tomography Hands-On Workshop Houston, TX", "4th Medical Physics Meeting at Universidad de la Frontera Chile", "2nd National Meeting on Medical Physics Columbia", "International Workshop on Modern Clinical Radiotherapy Jakarta, Indonesia", "International Workshop on Monte Carlo Techniques in Medical Physics Quebec City, Canada", "AAPM/IOMP - ISEP Radiotherapy course on: \"QA and Dosimetry of Emerging Radiotherapy Techniques\" Tallinn, Estonia", "MR in RT Workshop St. Louis Missouri", "XII Argentinean Meeting of Medical Physics/ I Meeting of Medical Physics of the Americas/ I AATMN Meeting of Nuclear Medicine and Diagnostic Imaging Buenos Aires, Argentina", "RSS 2014 SRS/SBRT Scientific Meeting Minneapolis, MN", "ESTRO 33 Vienna, Austria", "Margaret Cancer Centre Accelerator Technology Education Course Toronto, Canada", "Winter Institute of Medial Physics Breckenridge, CO", "Image Gently/ALARA CT Summit Orlando, FL", "SPIE Medical Imaging Conference 2014 San Diego, CA", "The Physics of Advanced Radiotherapy Techniques: The Role of Medical Images Santiago, Chile", "5th Annual Canadian Winter School-Quality and Safety in Radiation Oncology Quebec, Canada", "School on Medical Physics Monteviedo, Uruguay", "9th International Conference on Dose, Time and Fractionation in Radiation Oncology Madison, WI", "VI Congress of the Latin American Medical Physics Association (ALFIM) Guanacaste, Costa Rica", "Joint Workshop: Technology for Innovation in Radiation Oncology Bethesda, MD", "4th Biannual Congress of Radio-Chemotherapy and the 7th Medical Physics Meeting Córdoba, Argentina", "Radiation Safety in Computed Tomography: A Virtual Symposium UC San Francisco", "Color in Medical Imaging Summit Silver Spring, MD", "Princess Margaret Cancer Centre Accelerator Technology Education Course Toronto, CANADA", "Winter Institute of Medical Physics Breckenridge, CO", "2013 SRS/SBRT Scientific Meeting Carlsbad, CA", "2013 SPIE Medical Imaging Meeting Lake Buena Vista, FL", "2013 HPS Mid-Year Topical Meeting \"Medical Health Physics and Accelerator Dosimetry\" Scottsdale, Arizona", "4th Annual COMP Winter School-\"Quality and Safety in Radiation Oncology\" Quebec, CANADA", "ICTP-IAEA Workshop on Transitioning from 2D to 3D Conformal Radiotherapy and Intensity Modulated Radiation Therapy Trieste, Italy", "2012 IC3D Dose: 7th International Conference on 3D Radiation Dosimetry Sydney, Australia", "International Workshop: New Technologies in Modern Radiotherapy Bangkok, Thailand", "2012 World Congress on Medical Physics and Biomedical Engineering Beijing, China", "Winter Institute of Medical Physics Breckenridge, Colorado", "2012 SPIE Medical Imaging Meeting San Diego, CA", "COMP Winter School on Quality and Safety in Radiation Oncology Whistler, British Columbia, Canada", "Memphis Bio Imaging Symposium Memphis, TN", "International Symposium QA and QC in Radiation Medicine Kuala Lumpur, Malaysia", "12th European Organizations of Medical Physicists EFOMP Congress Trinity College, Dublin, Ireland", "5th Annual Body MRI: Update Course Atlanta, GA", "Radiation Safety in Radiation Oncology: Issues to Consider in your Practice Washington, DC", "28th Annual Meeting of the American College of Medical Physics (ACMP) Chattanooga, Tennessee", "18th International Conference on Medical Physics (ICMP) Porto Alegre, Brazil", "Advancing Quality and Safety Improvement in Radiation Oncology Philadelphia, PA", "Modern Radiotherapy and Therapeutic Physics Colombo, Sri Lanka", "SPIE Medical Imaging Conference Orlando, FL", "International Workshop on Developing a Radiation Protection Culture Charleston, SC", "2011 The Canadian Organization of Medical Physics (COMP) Winter School Mont Tremblant, Quebec", "International Symposium on Standards, Applications and Quality Assurance in Medical Radiation Dosimetry Vienna, Austria", "Seventh Annual Memphis BioImaging Symposium and preconference workshop Memphis, TN", "The 2nd Symposium of Sino-American Network for Therapeutic Radiology and Oncology (SANTRO) Hangzhou, China", "International conference on Radiation Protection Medicine Varna, Bulgaria", "The International Conference on 3D Radiation Dosimetry (IC3DDose) Hilton Head Island, South Carolina", "Great Wall 2010 International Congress on Medical Physics Shanghai, China", "American College of Medical Physics (ACMP) San Antonio, Texas", "V CONGRESO LATINOAMERICA DE FISICA MEDICA, III CONGRESO PERUANO DE FISICA MEDICA, (5th ALFIM Congress of Medical Physics and 3rd Peruvian Congress of Medical Physics) Cusco, Peru", "Modern Radiation Oncology Meeting HO CHI MINH CITY, VIETNAM", "4th Joint Symposium on Computational Medical Physics Houston, Texas", "International Conference on Radiation Medicine (ICRM) Riyadh, Saudi Arabia", "SPIE Medical Imaging 2010 Conference San Diego, CA", "Winter Institute of Medical Physics (WIMP) Summit County, CO"], ["Endorsed/Co-Sponsored", "Endorsed", "Endorsed", "Endorsed", "Endorsed", "Endorsed", "Endorsed", "Endorsed", "Endorsed", "Endorsed", "Endorsed", "Endorsed", "Endorsed", "Endorsed", "Endorsed", "Endorsed", "Endorsed", "Co-Sponsored", "Endorsed", "Co-Sponsored", "Endorsed", "Endorsed", "Endorsed", "Endorsed", "Endorsed", "Endorsed", "Endorsed", "Endorsed", "Co-Sponsored", "Endorsed", "Co-Sponsored", "Co-Sponsored", "Co-Sponsored", "Endorsed", "Endorsed", "Endorsed", "Endorsed", "Endorsed", "Endorsed", "Co-Sponsored", "Endorsed", "Co-Sponsored", "Endorsed", "Endorsed", "Endorsed", "Endorsed", "Endorsed", "Endorsed", "Endorsed", "Endorsed", "Co-Sponsored", "Endorsed", "Co-Sponsored", "Co-Sponsored", "Co-Sponsored", "Endorsed", "Endorsed", "Co-Sponsored", "Co-sponsored", "Co-Sponsored", "Co-Sponsored", "Endorsed", "Co-Sponsored", "Co-Sponsored", "Co-Sponsored", "Endorsed", "Endorsed", "Co-Sponsored", "Endorsed", "Endorsed", "Endorsed", "Co-Sponsored", "Endorsed"]], "pageTitle": "AAPM Meetings", "title": "", "url": "https://www.aapm.org/meetings/", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 20, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988922.24/warc/CC-MAIN-20150728002308-00129-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 892045491, "recordOffset": 892010559, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{11645=The AAPM Annual Meeting & Exhibition held in late July or early August draws about 4,000 participants to the world’s largest program of scientific, educational and professional presentations plus technical exhibits and social programs that targets the medical physics community specifically., 14241=AAPM collaborates with the Radiological Society of North America (RSNA) in preparing scientific and educational programs that relate to medical physics for its annual meeting held in late November or early December. This is the world’s largest meeting of the radiological professions.}", "textBeforeTable": "AAPM also Endorses or Sponsors a wide variety of scientific and educational meetings nationally and internationally through its outreach programs. AAPM collaborates with the Radiological Society of North America (RSNA) in preparing scientific and educational programs that relate to medical physics for its annual meeting held in late November or early December. This is the world’s largest meeting of the radiological professions. Meetings of AAPM Chapters vary from single lecture evening presentations to whole day meetings in a local or regional setting and provide an opportunity to build local collegiality. AAPM Group meetings are committees, task groups, working groups and others who meet as necessary throughout the year. The AAPM supports virtual meetings of its committees using a variety of web-related tools. AAPM Specialty Meetings are opportunities to study a more focused medical physics topic in a regional setting as well as virtual meetings or Webinars. The very popular annual AAPM Summer School provides an opportunity for the intensive study of a broad medical physics topic in an informal setting that provides an opportunity to build national collegiality.", "textAfterTable": "2012 March 17 - 20 Dallas, TX Meeting Home Pictures 2011 April 30 - May 3 Chattanooga, TN Meeting Program 2010 May 22 - 25 San Antonio, TX Meeting Program 2009 May 2 - 5 Virginia Beach, VA Meeting Program 2008 May 3 - 6 Seattle, WA Meeting Program Future Summer Schools Year Dates Location Links Medical Physics Leadership Academy 2016 June 12 - 16 Westfields Marriott Conference Center Chantilly, VA Meeting Home Summer School Archive Year Dates Location Links Proton Therapy: Physical Principles and Practice 2015 June 14 - 18 Colorado College Colorado Springs, CO Meeting Home Pictures", "hasKeyColumn": false, "keyColumnIndex": -1, "headerRowIndex": 0}