{"relation": [["Action", "Registration", "Introduction", "Honor Code (Non-disclosure Agreement)", "Tutorial", "Examination Section 1", "Break", "Examination Section 2", "Survey", "Total Appointment Time"], ["Time Allotted", "Arrive 30 minutes prior to the scheduled start time", "Up to 2 minutes", "Up to 3 minutes", "Optional; up to10 minutes", "2 hours", "Optional; up to 30 minutes", "2 hours", "Up to 15 minutes", "Approximately 5 hours"]], "pageTitle": "Exam Day: What to Expect | The American Board of Pediatrics", "title": "", "url": "https://www.abp.org/content/exam-day-what-expect", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 2, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988317.67/warc/CC-MAIN-20150728002308-00085-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 904691392, "recordOffset": 904674998, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{19019=If you have any questions regarding your examination day, call the ABP at (919) 929-0461 from 8:30 am to 5:00 pm Eastern Time or visit the Contact ABP page.}", "textBeforeTable": "General Pediatrics Certification Examination Day Schedule* The examination is divided into examination sections containing multiple-choice questions. The appointment time includes registration, introduction, tutorial, the examination, optional breaks, and a survey. What is the schedule for examination day? If you are taking the Pediatric Cardiology Examination, you should use the link in your portfolio to access the tutorial. Yes. If you have never taken a computer-based examination at Prometric, it is highly recommended that you review the brief tutorial on the ABP's Web site to become familiar with the functionality of the computer-based examination. You will also be able to review a tutorial during your examination at the testing center. You will have 15 minutes to review the introduction and tutorial before your examination begins. The time used to review the tutorial will not be counted against your examination time. Will I be given the opportunity to take a tutorial? The materials developed by the ABP for its in-training, certification, and maintenance of certification examinations and other certification activities are copyrighted as the sole property of the ABP and may not be reproduced in any way. Reproduction of copyrighted material, in whole or in part, is a federal offense. Irrespective of copyright, any attempt to distribute ABP certification, maintenance of certification or in-training exam materials, in whole or in part, undermines the fairness of the certification process and will be considered unethical,", "textAfterTable": "Break Optional; up to 15 minutes Examination Section 4 1 hour and 45 minutes Survey Up to 15 minutes Total Appointment Time Approximately 9 hours   Maintenance of Certification (MOC) Examination Day Schedule* Action Time Allotted Registration Arrive 30 minutes prior to the scheduled start time Introduction Up to 2 minutes Honor Code (Non-disclosure Agreement) Up to 3 minutes Tutorial Optional; up to10 minutes Examination Section 1 2 hours Break Optional; up to 30 minutes Examination Section 2 2 hours Survey Up to 15 minutes Total Appointment Time Approximately 5 hours   Subspecialty In-Training Examination (SITE) Day Schedule* Action Time Allotted Registration Arrive 30 minutes prior to the scheduled start time Introduction Up to 2 minutes Honor Code (Non-disclosure Agreement) Up to 3 minutes Tutorial Optional; up to10 minutes Examination Section 1 2 hours Break Optional; up to 30 minutes Examination Section 2 2 hours Survey Up to 15 minutes Total Appointment Time Approximately 5", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}