{"relation": [["#", "1", "2", "3", "4", "5", "6", "7", "8", "9"], ["Domain", "zango.com", "justupit.com", "interval.in", "hindilinks4u.net", "desihits.com", "crickethighlights.info", "bollywoodhungama.com", "bhejafry.net", "apnicommunity.com"]], "pageTitle": "apnaview.com - apnaview » watch hindi movies online free - home", "title": "", "url": "http://seohunt.biz/rep/apnaview.com", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 12, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990112.50/warc/CC-MAIN-20150728002310-00268-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 211767475, "recordOffset": 211743091, "tableOrientation": "HORIZONTAL", "TableContextTimeStampBeforeTable": "{1267=IP address of apnaview.com is 96.30.38.140, country where the site was registered - United States.. 23,463 site pages are viewed per day. Total age of apnaview.com is 6 years 4 months 16 days. According to the data obtained from Alexa.com, the rank of apnaview.com in the internet is #62,345. The total daily traffic of the site is 2.4GB (United States is the main traffic source). About 7,110 users visit apnaview.com every day. The analyzed website's PageRank is 0 out of 10. The lower Alexa Traffic Rank has the analyzed the higher its popularity among Internet users and they visit it more often. Our analysis says that the daily revenue of the site is 23.68 $ per day and its estimated worth - 16,576 $. The average time of page load on this site is 1.412 seconds. apnaview.com is listed in DMOZ}", "TableContextTimeStampAfterTable": "{26048=96.30.38.140 - server's IP address, United States - country of registration, 25173=apnaview.com is 6 years, 4 month, 16 days old. Expiration date - 2014-01-08., 26968=fondata nel 1926, la scuola corale giacomo puccini di sassuolo (mo) è attualmente un coro misto, composto da circa 50 elementi, diretto dal maestro francesco saguatti., 22813=Websites that are related to 96.30.38.140 IP address.}", "textBeforeTable": "Low Traffic Rank indicates that the analyzed website gets a lot of visitors. Traffic Rank Search(%) Time on site Bounce(%) Pageviews/Users(%) Pageviews(%) Reach(%) Traffic Rank Site Info by Alexa Alexa Traffic Graph Analysis 71.5GB Traffic volume(per month) 47,539 Rank in primary country 7,110 Amount of visitors per day Favicon apnaview » watch hindi movies online free - home Title 1.412 Mean Time Load n/a Pages in Google SERP 23.68 $ Daily revenue from ads United States Alexa main country United States Server location 2.4GB Traffic volume(per day) 96.30.38.140 Hosting ip address 0+ Adult rating #62,345 Alexa rank 0 Google PR 0 Yandex CY 182 Backlinks by Alexa 322,000 Google backLinks 23,463 Pages viewed(per day) 16,576 $ Website worth Web Site Analytics IP address of apnaview.com is 96.30.38.140, country", "textAfterTable": "0.00264% -1.57% Pageviews(%) Average percentage of global pageviews. Pageviews(%) Trend 0.000095% -15.76% 0.000080% +30% 0.000069% +1.0% Pageviews/Users(%) Average percentage of daily unique pegeviews per visitor. Pageviews/Users(%) Trend 3.3 +30% 2.7 +15% 2.58 +2% Bounce(%) Average percentage of site visits consisting of one pageview. Bounce(%) Trend 31.0% +33% 28.7% -12% 28.5% -7% Time on site Estimated average time spent on site. Time on site Trend 2:31 +31% 2:05 +23% 1:49 +21% Search(%) Average percentage of total World Wide Web users that come to the analyzed site from various search engines. Search(%) Trend 26.5% -1% 24.3% -10% 23.9% 0% Period: 7 days1 month3 months6 months1 year2 years3 years4 years", "hasKeyColumn": true, "keyColumnIndex": 1, "headerRowIndex": 0}