{"relation": [["GPU", "Quadro K6000", "Quadro K5200", "Quadro K5000", "Quadro K4200", "Quadro K4000", "Quadro K2200", "Quadro K2000", "Quadro K2000D", "Quadro K620", "Quadro K600", "Quadro K420", "Quadro 410", "Quadro Plex 7000"], ["Compute Capability", "3.5", "3.5", "3.0", "3.0", "3.0", "5.0", "3.0", "3.0", "5.0", "3.0", "3.0", "3.0", "2.0"]], "pageTitle": "💻 CUDA GPUS | NVIDIA Developer", "title": "", "url": "https://developer.nvidia.com/cuda-gpus", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 2, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988312.76/warc/CC-MAIN-20150728002308-00040-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 877618049, "recordOffset": 877602079, "tableOrientation": "HORIZONTAL", "lastModified": "Fri, 31 Jul 2015 22:10:25 +0000", "textBeforeTable": "Tesla Workstation Products CUDA-Enabled Tesla Products If you have an older NVIDIA GPU you may find it listed on our legacy CUDA GPUs page Click the sections below to expand Learn about Quadro for professional visualization Learn about Tesla for technical and scientific computing Find out all about CUDA and GPU Computing by attending our GPU Computing Webinars and joining our free-to-join CUDA Registered developer Program. NVIDIA GPUs power millions of desktops, notebooks, workstations and supercomputers around the world, accelerating computationally-intensive tasks for consumers, professionals, scientists, and researchers. CUDA GPUs CUDA GPUs Tools & Ecosystem CUDA ZONE Home Login Register Now", "textAfterTable": "CUDA-Enabled Quadro Products Quadro Desktop Products GPU Compute Capability Quadro K6000 3.5 Quadro K5200 3.5 Quadro K5000 3.0 Quadro K4200 3.0 Quadro K4000 3.0 Quadro K2200 5.0 Quadro K2000 3.0 Quadro K2000D 3.0 Quadro K620 5.0 Quadro K600 3.0 Quadro K420 3.0 Quadro 410 3.0 Quadro Plex 7000 2.0 Quadro Mobile Products GPU Compute Capability Quadro K5100M 3.0 Quadro K500M 3.0 Quadro K4100M 3.0 Quadro K3100M 3.0 Quadro K2200M 5.0 Quadro K2100M 3.0 Quadro K1100M 3.0 Quadro K620M 5.0", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}