{"relation": [["Method", "Method", "Method", "Method", "Method", "Method", "Method", "Method", "Method", "Method", "Method", "Method", "Method"], ["__hash__", "opt_help", "opt_version", "parseOptions", "postOptions", "parseArgs", "__str__", "getSynopsis", "getUsage", "_generic_flag", "_gather_flags", "_gather_parameters", "_gather_handlers"], ["Define a custom hash function so that Options instances can be used as dictionary keys. This is an internal feature used to implement the parser. Do not rely on it in application code.", "Display this help and exit.", "Display Twisted version and exit.", "The guts of the command-line parser.", "I am called after the options are parsed.", "I am called with any leftover arguments which were not options.", "Undocumented", "Returns a string containing a description of these options and how to pass them to the executed file.", "Undocumented", "Undocumented", "Gather up boolean (flag) options.", "Gather options which take a value.", "Gather up options with their own handler methods."]], "pageTitle": "twisted.tap.ftp.Options : API documentation", "title": "", "url": "http://twistedmatrix.com/documents/13.0.0/api/twisted.tap.ftp.Options.html", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 1, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986451.45/warc/CC-MAIN-20150728002306-00131-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 242930986, "recordOffset": 242922784, "tableOrientation": "HORIZONTAL", "lastModified": "Wed, 03 Apr 2013 09:21:31 GMT", "textBeforeTable": "Inherited from Options: Specify a file containing username:password login info for authenticated connections. (DEPRECATED; see --help-auth instead) opt_password_file Method Undocumented __init__ Method Part of twisted.tap.ftp View Source View In Hierarchy t.t.f.Options(usage.Options, strcred.AuthOptionMixin) : class documentation Go to the latest version of this document. No class docstring", "textAfterTable": "Inherited from AuthOptionMixin: Class Variable supportedInterfaces An iterable object that returns credential interfaces which this application is able to support. Class Variable authOutput A writeable object to which this options class will send all help-related output. Default: sys.stdout Method supportsInterface Returns whether a particular credentials interface is supported. Method supportsCheckerFactory Returns whether a checker factory will provide at least one of the credentials interfaces that we care about. Method addChecker Supply a supplied credentials checker to the Options class. Method opt_auth Specify an authentication method for the server. Method opt_help_auth Show all authentication methods available. Method opt_help_auth_type Show help for a particular authentication type. Method _checkerFactoriesForOptHelpAuth Return a list of which authTypes will be displayed by --help-auth. This makes it a lot easier to test this module. def __init__(self, *a, **kw): (source) overrides twisted.python.usage.Options.__init__ Undocumented def opt_password_file(self, filename): (source) Specify a file containing username:password login info for authenticated connections. (DEPRECATED; see --help-auth instead)", "hasKeyColumn": true, "keyColumnIndex": 2, "headerRowIndex": 0}