{"relation": [["", "Performance 5-yr return", "Expense ratio", "Risk 5 year sharpe ratio", "Net assets", "Average market cap", "Average P/E", "Portfolio turnover"], ["MITYX", "--", "1.59%", "--", "$32.9M", "$699.2M", "20.7", "14%"], ["Category", "+15.95%", "1.26%", "0.99", "$895.4M", "$2.9B", "20.6", "14%"]], "pageTitle": "MITYX - Morgan Dempsey Small/Micro Cap Value Mutual Fund Quote - CNNMoney.com", "title": "", "url": "http://money.cnn.com/quote/mutualfund/mutualfund.html?symb=MITYX", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 3, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990900.28/warc/CC-MAIN-20150728002310-00069-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 161157671, "recordOffset": 161136919, "tableOrientation": "HORIZONTAL", "TableContextTimeStampBeforeTable": "{28935=© 2015 Cable News Network. A Time Warner Company. All Rights Reserved. Terms under which this service is provided to you. Privacy Policy. .}", "TableContextTimeStampAfterTable": "{20966=Most stock quote data provided by BATS. Market indices are shown in real time, except for the DJIA, which is delayed by two minutes. All times are ET. Disclaimer. Morningstar: © 2015 Morningstar, Inc. All Rights Reserved. Factset: FactSet Research Systems Inc. 2015. All rights reserved. Chicago Mercantile Association: Certain market data is the property of Chicago Mercantile Exchange Inc. and its licensors. All rights reserved. Dow Jones: The Dow Jones branded indices are proprietary to and are calculated, distributed and marketed by DJI Opco, a subsidiary of S&P Dow Jones Indices LLC and have been licensed for use to S&P Opco, LLC and CNN. Standard & Poor's and S&P are registered trademarks of Standard & Poor’s Financial Services LLC and Dow Jones is a registered trademark of Dow Jones Trademark Holdings LLC. All content of the Dow Jones branded indices © S&P Dow Jones Indices LLC 2015 and/or its affiliates.}", "textBeforeTable": "Peer Comparisonvs. Small blend Data through -- +7.10% Since inception   -4.87% 1 year -- 5 years   -5.61% 3 months +8.95% 3 years   -3.92% 1 month Performance Investment Objective The investment seeks long-term capital appreciation. Under normal market conditions, at least 80% of the fund's net assets, plus the amount of any borrowings for investment purposes, will be invested in common stocks and other equity securities of micro-cap and small-cap companies. In addition to common stocks, equity securities may also include preferred stocks, convertible debt securities, and other investment companies and exchange-traded funds (\"ETFs\") that invest in equity securities of micro-cap and small-cap companies. Chart  vs. S&P 500  vs. Category 3 month6 month1 year3 year5 year10 year", "textAfterTable": "Money 50: Best Mutual Funds » There are thousands of mutual funds to choose from. Get Money Magazine’s picks in all major categories. Fund Management and Purchase Info Fund family Morgan Dempsey Capital Management, LLC Fund manager & tenure Brian Rafn / 4 Years Minimal initial investment $2,500.00 Minimum IRA investment -- Holdings U.S. stock 96.31% Cash 3.69% International stock 0.00% Fixed income 0.00% Other 0.00% Top 5 Sectors Portfolio weighting Business service  -- Consumer goods  -- Consumer service  -- Energy  -- Financial service  -- Top 10 Holdings Portfolio weighting RGR Sturm Ruger & Co Inc 6.60% MCS Marcus Corp 5.28% JJSF J & J Snack Foods Corp 5.11%", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}