{"relation": [["Mac Model", "Mac Pro Xeon 2.4GHz 8-core 6GB RAM (Mid 2010)", "Mac Pro Xeon 2.8GHz quad-core 3GB RAM (Mid 2010)", "27-inch iMac Core i5 3.1GHz quad-core (Mid 2011)", "27-inch iMac Core i5 2.7GHz quad-core (Mid 2011)", "21.5-inch iMac Core i7 2.8GHz quad-core BTO (Mid 2011)", "21.5-inch iMac Core i5 2.7GHz quad-core (Mid 2011)", "21.5-inch iMac Core i5 2.5GHz quad-core (Mid 2011)", "Mac mini Core i7 2.7GHz dual-core SSD BTO (Mid 2011)", "Mac mini Core i5 dual-core 2.5GHz (Mid 2011)", "Mac mini Core i5 2.3GHz dual-core (Mid 2011)", "17-inch MacBook Pro Core i7 2.4GHz quad-core (Late 2011)", "15-inch MacBook Pro Core i7 2.4GHz quad-core (Late 2011)", "15-inch MacBook Pro Core i7 2.2GHz quad-core (Late 2011)", "13-inch MacBook Pro Core i7 2.8GHz dual-core (Late 2011)", "13-inch MacBook Pro Core i5 2.4GHz dual-core (Late 2011)", "13-inch MacBook Air Core i7 1.8GHz dual-core 256GB flash storage BTO (Mid 2011)", "13-inch MacBook Air Core i5 1.7GHz dual-core 256GB flash storage (Mid 2011)", "13-inch MacBook Air Core i5 1.7GHz dual-core 128GB flash storage (Mid 2011)", "11-inch MacBook Air Core i7 1.8GHz dual-core 128GB flash storage BTO (Mid 2011)", "11-inch MacBook Air Core i5 1.6GHz dual-core 128GB flash storage (Mid 2011)", "11-inch MacBook Air Core i5 1.6GHz dual-core 64GB flash storage (Mid 2011)"], ["iMovie '11 Import Two-Minute Clip from Camera Archive", "50.3", "63.8", "66.1", "73.4", "62.0", "74.4", "77.6", "77.3", "113.3", "118.8", "68.3", "70.2", "82.2", "95.8", "109.3", "97.5", "100.0", "100.3", "99.0", "111.5", "115.1"], ["iMovie '11 Share Movie to iTunes for Mobile Devices", "59.0", "60.9", "53.4", "59.8", "54.9", "61.8", "63.4", "62.8", "78.2", "102.9", "54.9", "52.6", "60.8", "79.0", "88.2", "106.8", "109.3", "110.7", "100.9", "114.9", "118.5"]], "pageTitle": "Macworld's new Speedmark 7 benchmark suite | Macworld", "title": "", "url": "http://www.macworld.com/article/1162105/macworlds_new_speedmark_7_benchmark_suite.html", "hasHeader": true, "headerPosition": "MIXED", "tableType": "RELATION", "tableNum": 4, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042991019.80/warc/CC-MAIN-20150728002311-00169-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 565443903, "recordOffset": 565409763, "tableOrientation": "HORIZONTAL", "TableContextTimeStampBeforeTable": "{1411=Our baseline system, which is given a score of 100 and is what we compare the individual test performance of each system to, is a 2010 Mac mini with a 2.4GHz Core 2 Duo processor, 2GB of RAM, a 320GB 5400-rpm hard drive, and integrated Nvidia GeForce 320M graphics. A second system, a 2010 MacBook with very similar specifications, also earned a Speedmark 7 score of 100., 353=Below is a chart of Speedmark 7 scores of all the Macs in Apple's current lineup. You can also see the Speedmark 7 scores of all the Macs we have tested, including models from 2010, 2009, and 2008., 1022=The fastest system overall of the current Mac lineup is a build-to-order (BTO) 2011 21.5-inch iMac with a quad-core 2.8GHz Core i5 processor; it has a Speedmark 7 score of 244. The fastest standard configuration Mac we’ve tested so far, earning a Speedmark 7 score of 241, is a 2011 27-inch iMac with a quad-core 3.1GHz Core i5 processor. The fastest overall of all the systems we’ve tested with Speedmark 7 is a BTO 2.93GHz Core i7 iMac from 2010 with an internal SSD; this system earned a Speedmark 7 score of 264. The system with the slowest Speedmark 7 score of all the Macs we have tested is a 2008 MacBook Air with a 1.6GHz Core 2 Duo processor., 2028=One thing that doesn’t change is 2.4GHz Core 2 Duo Mac mini from 2010 that serves as Speedmark’s baseline system to which each Mac’s performance is compared. By keeping the same “100” system as the previous version of Speedmark, it should be easier to compare older systems tested with Speedmark 6.5 to the systems tested with the new Speedmark 7.}", "TableContextTimeStampAfterTable": "{51382=Another test that takes advantage of drive speed as well as processor speed. The latest MacBook Airs fared well in this test, with three of the top ten test times. They were beaten by BTO iMacs with SSDs and the 2010 8-core Mac Pro., 5129=Compressing a 4GB folder is more of a CPU test than a storage test, with the 2011 iMacs and their Sandy Bridge processors posting the fastest times with speeds between 190 and 200 seconds. Mac Pros with their Xeon processors didn’t fare as well. The 2010 8-core 2.4GHz Mac Pro took 277 seconds to complete the task. Older MacBook Airs were the slowest at this task, with the 2010 11-inch 1.4GHz Core 2 Duo MacBook Air taking nearly 10 minutes to compress the 4GB folder., 34164=Maxon’s Cinebench’s OpenGL test measures the performance of the graphics card in the system and gives a result in frames per second, so the higher the score, the better. The 2011 iMacs are fastest, with up to 47.7 frames per second in the tests. Early MacBook Airs struggled to approach 5 frames per second., 20954=The Share to iTunes test is the first to show a benefit of more than four cores. The 2.4GHz Xeon 8-core Mac Pro finished the test just one second slower than the fastest overall Mac, a 2010 BTO 2.93GHz i7 iMac with SSD drive. In the iMovie Share to iTunes Mobile test, the 2009 2.26GHz Xeon 8-core Mac Pro came in third place of all the Macs we tested. As with Pages, the 2.93GHz iMac with the SSD was faster than the same system without it; 19 percent faster in the import and 16 percent faster when sharing the file to iTunes., 47372=This test hits both the hard drive and the processor. iMacs with SSDs performed the best, a 2010 27-inch 2.93GHz iMac with SSD finished the test in 74 seconds, 15 percent faster than the same system with a standard hard drive., 59413=This test shows how well a graphics cards can handle modern 3D games. CPU can play a small role in performance, but our Portal 2 test is really about GPU speed. In this test, scores are framerates, and higher scores are better,. No system was better than our 2011 27-inch 3.1GHz Core i5 quad-core i5 iMac that displayed 231 frames per second. The slowest Mac was a 2008 13-inch 2.4GHz Core 2 Duo MacBook that was only able to display 26 frames per second., 4598=The duplicate and uncompress tasks demonstrate the speed of the system’s internal storage. Flash drives do much better in this test. The flash storage in the 2011 MacBook Airs are the fastest that we’ve tested so far, taking between 22 and 25 seconds to duplicate the 2GB folder and between 43 and 50 seconds to uncompress a 4GB zip file. These scores are around three times faster than scores of our baseline Mac mini, which took 79 seconds to duplicate the folder and 165 seconds to uncompress the 4GB zip file., 59341=Portal 2 test: Timedemo (1280-by-800), 16644=The Pages test favors Core i5 and i7 processors, though faster internal drives help. iMacs lead the pack; if you include older Macs, Core 2 Duo systems (especially older MacBook Airs) pull up the rear. The 2011 21.5-inch 2.7GHz Core i5 quad-core iMac finished in 71.4 seconds, while the 2010 11-inch 1.4GHz Core 2 Duo MacBook Air took 196 seconds. A 2010 BTO 2.93GHz Core i7 iMac with a SSD finished the test 16 percent faster than the same system with a standard hard drive installed., 95632=© 1998-2015, IDG Consumer & SMB, 43293=The Photoshop Action Script test uses a 100MB file, and involves running various filters and tasks, as well as importing RAW files. Processors, RAM and drive speed all come into play on this test. The 2010 eight-core Mac Pro posted the fastest time, followed closely by BTO iMacs outfitted with SSDs., 4210=(The charts below include all the Macs in Apple's current lineup. You can also see the Speedmark 7 scores of all the Macs we have tested, including models from 2010, 2009, and 2008.), 34489=Maxon’s Cinebench CPU isolates the CPU. Like HandBrake and MathematicaMark, the Cinebench CPU test can take full advantage of up to 64 processor threads. The Mac Pro with eight cores (seen as having 16 virtual cores by the application thanks to Intel’s Hyper Threading technology) finished the test in less than a minute. A 2009 MacBook Air took more than 10 minutes to finish., 63554=You can also see the Speedmark 7 scores of all the Macs we have tested, including models from 2010, 2009, and 2008.}", "lastModified": "Tue, 04 Aug 2015 13:02:02 GMT", "textBeforeTable": "Speedmark 7: Current Mac lineup Below is a chart of Speedmark 7 scores of all the Macs in Apple's current lineup. You can also see the Speedmark 7 scores of all the Macs we have tested, including models from 2010, 2009, and 2008. The fastest system overall of the current Mac lineup is a build-to-order (BTO) 2011 21.5-inch iMac with a quad-core 2.8GHz Core i5 processor; it has a Speedmark 7 score of 244. The fastest standard configuration Mac we’ve tested so far, earning a Speedmark 7 score of 241, is a 2011 27-inch iMac with a quad-core 3.1GHz Core i5 processor. The fastest overall of all the systems we’ve tested with Speedmark 7 is a BTO 2.93GHz Core i7 iMac from 2010 with an internal SSD; this system earned a Speedmark 7 score of 264. The system with the slowest Speedmark 7 score of all the Macs we have tested is a 2008 MacBook Air with a 1.6GHz Core 2 Duo processor. Our baseline system, which is given a score of 100 and is what we compare the individual test performance of each system to, is a 2010 Mac mini with a 2.4GHz Core 2 Duo processor, 2GB of RAM, a 320GB 5400-rpm hard drive, and integrated Nvidia GeForce 320M graphics. A second system, a 2010 MacBook with very similar specifications, also earned a Speedmark 7 score of 100. Which system was the best overall performer? Look no", "textAfterTable": "Zip 4GB Folder Unzip 4GB File Mac Pro Xeon 2.4GHz 8-core 6GB RAM (Mid 2010) 44.3 277.0 89.0 Mac Pro Xeon 2.8GHz quad-core 3GB RAM (Mid 2010) 40.4 244.2 91.4 27-inch iMac Core i5 3.1GHz quad-core (Mid 2011) 43.9 205.2 88.8 27-inch iMac Core i5 2.7GHz quad-core (Mid 2011) 45.5 198.7 89.7 21.5-inch iMac Core i7 2.8GHz quad-core BTO (Mid 2011) 46.4 195.8 84.3 21.5-inch iMac Core i5 2.7GHz quad-core (Mid 2011) 46.2 190.1 85.1 21.5-inch iMac Core i5 2.5GHz quad-core (Mid 2011) 41.5 213.8 84.0 Mac mini Core i7 2.7GHz dual-core SSD BTO (Mid 2011) 29.0 203.4 49.2 Mac mini Core i5 2.5GHz dual-core (Mid 2011) 65.6 240.9 148.8 Mac mini Core i5 2.3GHz dual-core (Mid 2011) 64.7 248.7 144.0 17-inch MacBook Pro Core i7 2.4GHz quad-core (Late 2011) 55.8 223.4 123.5 15-inch MacBook Pro Core i7 2.4GHz quad-core (Late 2011) 52.7 217.4 131.6 15-inch MacBook Pro Core i7 2.2GHz quad-core (Late 2011) 74.4 245.5 168.9 13-inch MacBook Pro Core i7 2.8GHz dual-core (Late 2011) 54.1 208.0 114.8 13-inch MacBook Pro Core i5 2.4GHz dual-core (Late 2011) 68.6 249.1 146.4 13-inch MacBook Air Core i7 1.8GHz dual-core 256GB flash storage BTO (Mid 2011) 22.3 235.5 40.5 13-inch MacBook", "hasKeyColumn": false, "keyColumnIndex": -1, "headerRowIndex": 0}