{"relation": [["Part", "REGEXP", "Replacement", "Command", "In", "Out", "Block"], ["What it does", "This is a javascript regular expression to match against", "The text you want to replace with (not available in premium widgets)", "Commands to send when REGEXP matches. Not in all releases yet (only in cbe00*).", "If checked, it'll be applied to any incoming IRC chat", "If checked, it'll be applied to any outgoing IRC chat", "If checked, do not send or show text."]], "pageTitle": "Filters - Mibbit Wiki", "title": "", "url": "http://wiki.mibbit.com/index.php/Filters", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 1, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988840.31/warc/CC-MAIN-20150728002308-00049-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 254678639, "recordOffset": 254670694, "tableOrientation": "HORIZONTAL", "lastModified": "Sat, 07 Feb 2015 21:27:08 GMT", "textBeforeTable": "Just go to Prefs -> Filters and setup your own. How to Use Filters are a simple yet useful system to replace (main client only) or block text. They can be applied to incoming or outgoing IRC chat. Main client and Premium Widgets Only search navigation, Jump to: From Mibbit Wiki Filters", "textAfterTable": "Note that the filters are applied from first to last, only once. For the regular expression syntax, see https://developer.mozilla.org/En/Core_JavaScript_1.5_Guide/Regular_Expressions If part of the regex is going to be in the replacement, place it in parenthesis, and call it by $<number> where the number is signified by which set of parenthesis it is. Possible Usages For the main client: Replace irritating abbreviations: BRB -> Be right back i18n -> internationalization Filter out offensive words: Damn -> by the beard of Zeus! Store commonly used responses: tellWidget -> \"The widget is a fantastic thing that you can find more info about here.....\" default: \\bmibbiturl\\b -> http://www.mibbit.com/chat/ (\\b = word boundary) Use a matched text within the replaced string \\b([^ ]+)url\\b -> http://www.$1.com -> mozillaurl -> http://www.mozilla.com Examples ^gn$ Matches only if you send \"gn\". Will not match \" gn\" or \"gn \" or \"You have a gn\". [Start of line][g][n][End of line]", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}