{"relation": [["Pane", "Performance", "Conditions", "Consumer Usage", "Breakdown by Client Address", "Violation Alerts", "Custom Charting", "Custom Breakdown"], ["Description", "Provides data about started transactions, completed transactions, condition alerts, average response time, and maximum response time. The data is displayed in graphic form as well as using a grid view.", "Provides information about condition alerts that have been triggered in a given time period: the name of the condition that was met, the endpoint where the condition alert was triggered, and the number of condition alerts triggered. Conditions must have been defined for this information to be collected and displayed.", "Displays performance information segmented by consumer for the given time period: started transactions, completed transactions, average response time, and maximum response time. Consumers must have been defined and consumer segmentation enabled for this information to be collected and displayed.", "Displays performance information segmented by client IP address: started transactions, completed transactions, average response time, and maximum response time. The client address is the machine host name from which the request was sent. The table lists all client addresses that sent requests, and displays the aggregated performance measurements associated with each client address. Segmentation by client IP address must be enabled for this data to be collected and displayed.", "Displays information about service level agreement (SLA) violations. The display distinguishes between warning alerts and failure alerts. The graph shows aggregate measurements for violation alerts. The grid view lists more detailed information: showing alerts for each SLA policy. SLAs must have been created for this information to be collected and displayed.", "Lets you set up a customized chart and table similar to the Performance pane, but with instruments of your choosing. Click Choose Instruments, and select the instruments you want displayed in the chart and table. You can select multiple instruments. When you set up a custom chart/table for a transaction, it is available for any selected transaction.", "You can set up a custom table of numeric instruments segmented in various ways. Click Choose Instruments and select the instruments that you want displayed in the table. Click Choose Segments and select how you want to segment the measurements. You can select multiple segments."]], "pageTitle": "Monitoring Business Applications", "title": "", "url": "http://docs.oracle.com/cd/E24628_01/install.121/e24215/bussapps_apm.htm", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990900.28/warc/CC-MAIN-20150728002310-00186-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 79466663, "recordOffset": 79435770, "tableOrientation": "HORIZONTAL", "lastModified": "Thu, 30 Jul 2015 00:03:58 GMT", "textBeforeTable": "Table 18-1 Panes Within Analysis Tab The Analysis tab displays detailed current performance and usage information for the selected transaction. It contains the panes described in Table 18-1. 18.9.2 Analyzing Transaction Information A grid view showing the logical and physical operations that make up the transaction, and the following instruments for each: violation alerts, average response time, maximum response time, throughput, and faults. The Delay analysis pane, which you can use in conjunction with the map pane, provides a graphical rendering of the proportion of the overall response time that is spent in each hop (link) of the transaction. Each colored area of the grid corresponds to a transaction link. Clicking within a colored region highlights its corresponding link in the map and displays the percentage of the response time taken up by that hop. At the bottom of this pane, a graph shows the average and maximum response times, and the number of started transactions. Clicking within the pane displays a vertical red line that shows how the colored proportions correspond to message traffic flows. A map of the transaction detailing average response times for each transaction link. Place the cursor over each service icon to obtain detailed performance information for that service. The thickness of the arrows indicates throughput. A Measurement and Baselines pane detailing the number", "textAfterTable": "18.9.3 Viewing Alerts The Alerts tab shows information about all alerts occurring in the given time period. Business Transaction Management issues the following types of alerts: Service level agreement alerts issued when a deviation occurs from the standards of performance you have defined for a transaction. Condition alerts issued when a condition is satisfied. Conditions can test for faults, specific property values, or a missing message. System alerts issued to provide information about the health of the monitoring infrastructure. The grid view shows the following information for each alert: time of occurrence, an icon denoting the severity of the alert, the source of the alert, the instrument measured, and for SLA alerts, the enforcement value. To obtain more information about a given alert, click the Inspector icon to open an inspector window. Service level agreement alerts are also reported as events in Incident Manager. For more information on accessing these events, see Section 18.7, \"Monitoring KPI and SLA Alert Reporting\". 18.9.4 Viewing Transaction Instances The Instances tab allows you to view captured transaction instances. A transaction usually executes many times in a given period. If you have enabled transaction instance logging or if you have enabled fault monitoring, Business Transaction Management tracks the flow of messages included in", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}