{"relation": [["", "BRCA Positive Non-serous Ovarian", "BRCA Positive Serous Ovarian", "BRCA Negative Non-serous Ovarian", "BRCA Negative Serous Ovarian", "BRCA Positive Non-triple Negative Breast", "BRCA Positive Triple Negative Breast", "BRCA Negative Triple Negative Breast"], ["Description", "Patients with non-serous ovarian cancer who have a harmful mutation in the \"breast cancer genes\" BRCA1 or BRCA2. (Serous tumors are the most common subtype of ovarian cancer; other subtypes are grouped together as \"non-serous\" in this study).", "Patients with serous ovarian cancer who have a harmful mutation in the \"breast cancer genes\" BRCA1 or BRCA2. (Serous tumors are the most common subtype of ovarian cancer).", "Patients with non-serous ovarian cancer who do not have a harmful mutation in the \"breast cancer genes\" BRCA1 or BRCA2", "Patients with serous ovarian cancer who do not have a harmful mutation in the \"breast cancer genes\" BRCA1 or BRCA2", "Patients with non-Triple negative breast cancer (non-TNBC) who have a harmful mutation in the \"breast cancer genes\" BRCA1 or BRCA2. Non-TNBC are cancers that have receptors for oestrogen, progesterone or Her2", "Patients with Triple negative breast cancer (TNBC) who have a harmful mutation in the \"breast cancer genes\" BRCA1 or BRCA2. TNBC are cancers that don’t have receptors for oestrogen, progesterone or Her2 (Some commonly used breast cancer treatments don’t work for TNBC)", "Patients with Triple negative breast cancer (TNBC) who do not have a harmful mutation in the \"breast cancer genes\" BRCA1 or BRCA2."]], "pageTitle": "Phase II Study of AZD2281 in Patients With Known BRCA Mutation Status or Recurrent High Grade Ovarian Cancer or Patients With Known BRCA Mutation Status/ Triple Neg Breast Cancer - Study Results - ClinicalTrials.gov", "title": "", "url": "https://clinicaltrials.gov/ct2/show/results/NCT00679783?sect=X0125&view=results", "hasHeader": true, "headerPosition": "MIXED", "tableType": "RELATION", "tableNum": 12, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988650.6/warc/CC-MAIN-20150728002308-00282-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 881205583, "recordOffset": 881193304, "tableOrientation": "HORIZONTAL", "textBeforeTable": "Reporting Groups The study enrolled both known BRCA mutation carriers and patients with unknown BRCA status. Those with unknown status at entry had to provide a DNA sample for BRCA. One participant in arm 4 discontinued before receiving study drug and is excluded from the safety analysis set mutation analysis. Study data are summarised by confirmed mutation status. Significant events and approaches for the overall study following participant enrollment, but prior to group assignment Pre-Assignment Details The first patient was enrolled on July 8, 2008 and efficacy and safety data were collected up to the data cut-off of March 26, 2010. Patients were enrolled at 6 centres in Canada. Of the 112 patients who gave informed consent 21 patients failed eligibility criteria or withdrew their consent and were not allocated to treatment. Key information relevant to the recruitment process for the overall study, such as dates of the recruitment period and locations Recruitment Details   Hide Participant Flow   Participant Flow", "textAfterTable": "Participant Flow:   Overall Study     BRCA Positive Non-serous Ovarian     BRCA Positive Serous Ovarian     BRCA Negative Non-serous Ovarian     BRCA Negative Serous Ovarian     BRCA Positive Non-triple Negative Breast     BRCA Positive Triple Negative Breast     BRCA Negative Triple Negative Breast   STARTED     4 [1]   13 [1]   3 [1]   45 [1]   5 [1]   5 [1]   16 [1] COMPLETED     2 [2]   10 [2]   2 [2]   25", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}