{"relation": [["ID Number", "ID 332396", "ID 379070", "ID 379693", "ID 394506", "ID 397525"], ["Description", "iControl now supports all user roles and granted partition accesses.", "Users with the roles of Administrator, Application Security Administrator, and Resource Administrator have write permissions. Users with the role of Application Security Editor have the rights as a Guest.", "If the /ts/var/license/current file is empty, then after a user renews an expired license, the Enforcer applies configuration changes.", "We optimized the Enforcer's memory allocation for large requests.", "SMTP, FTP, and HTTP protocol profiles are no longer unassigned by the system after you restart the system. Previously, this occurred if these profiles were created in partitions other than /Common."]], "pageTitle": "AskF5 | Release Note: BIG-IP PSM 11.3.0", "title": "", "url": "https://support.f5.com/kb/en-us/products/big-ip_psm/releasenotes/product/relnote-psm-11-3-0.html", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988061.16/warc/CC-MAIN-20150728002308-00047-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 889911047, "recordOffset": 889885208, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{60890=Installation may create a UCS file without database configuration (ID 207422, ID 211521, formerly CR120190, formerly CR127965) If you try to install this version by running the command image2disk --nomoveconfig, or liveinstall with the database variable LiveInstall.MoveConfig set to disabled, and you have WebAccelerator, Application Security Manager, or Protocol Security Manager provisioned or enabled in the target install slot, the system does not save the database configuration in the UCS file. To correctly install the current version and save your database configuration and installation, see Installing the current version and saving the database configuration and installation in the Workarounds for known issues section of this release note., 54184=Ctrl+C does not stop recovery program (ID 222670, formerly CR 122942) Pressing the control and C keys simultaneously on the keyboard now correctly stops the recovery program recover_db.pl. In previous releases, it did not., 58775=Reaping process changed (ID 351291 and ID 353526) The Enforcer does not accept new transactions when they reach the Enforcer’s memory limit. The Enforcer does also not accept more transactions than the configured number of the new internal parameter max_allowed_trans is reached. The internal parameter number_jobs_to_abort was removed since it is no longer relevant. When the value of max_allowed_trans is reached, if bypass is disabled, the system logs the message: trans_open: Not enough UMU memory to start a new trans. If bypass is enabled, the system logs the message: trans_open: Not enough UMU memory to start a new trans --> Bypassing ASM., 72769=Copyright © 2012, F5 Networks, Inc. All rights reserved., 13710=Original Publication Date: 07/28/2015, 17733=Important: We no longer support the provisioning of three or more modules on all platforms with less than 6.5 GB of memory because there is not enough RAM to support all three modules running at once. This includes the 1600 platform, the 3600 platform, and VCMP guests. In addition, platforms with less than 6.5 GB memory cannot be upgraded to v.11.3.0 if three or more modules are provisioned. Note that upgrades from 10.0.x display only an \"upgrade failed\" message as a software status. All other versions show a clear error message, guiding the users to SOL13988. Before upgrading a BIG-IP system with less than 6.5 GB of memory, make sure you have only one or two modules provisioned.}", "textBeforeTable": "This release includes the following fixes. Fixes in this release ResponseBufferSize request_buffer_size max_filtered_html_length long_request_buffer_size Also, the following system variables (internal parameters) were removed from the Configuration utility: XSS/SQL-injection attack detected XML data does not comply with format settings Malformed XML data Illegal HTTP status in response Data Guard: Information leakage detected The following HTTP violations were removed: Data guard settings XML Defense and Response Checks settings Removed Items XML defense checks, XSS/SQL-injection checks, response checks, and Data Guard checks were removed from Protocol Security Manager. Therefore the following settings were removed from HTTP profile properties configuration: To configure a DoS profile, navigate to Security > DoS Protection > DoS Profiles, click Create, and enable the Protocol Security (DNS) setting. To view event logs of DoS attacks on a DNS server, navigate to Security > Event Logs > DoS > Protocol (DNS). The number of packets per second that must be exceeded in order to indicate to the system that there is an attack. How much of an increase in DNS query traffic is legal before the system tracks malformed and malicious DNS queries. Which DNS query types you want the system to detect in packets. DoS protection With the addition of the DNS protocol to PSM, you can protect your DNS server from a DoS attack. You create a DoS profile that sets the conditions under which the system determines that your DNS server is", "textAfterTable": "[ Top ] Features and fixes introduced in prior releases New features introduced in 11.2.1 There were no new features introduced in version 11.2.1. Fix introduced in 11.2.1 This release includes the following fix from version 11.2.1. ID Number Description ID 386698 When a 401 response arrives instead the expected 100-continue message, and the client continues with the payload, the Enforcer no longer resets the connection. New features introduced in 11.2.0 There were no new features introduced in version 11.2.0. Fixes introduced in version 11.2.0 This release includes the following fixes from version 11.2.0. ID Number Description ID 341862 We added the internal parameter is_ramcache_ignored to enable you to configure the system to ignore the RAM cache, regarding PSM behavior. By default, the system does not ignore the RAM cache. To ignore RAM cache, set the value of this parameter to 1. ID 381283 Due to a change made by MacAfee, we changed the default value for the virus_header_name internal parameter from X-Virus-Name to X-Infection-Found. You can now use a number of strings for the value of the Advanced Configuration System Variable (internal parameter) virus_header_name by using the comma character (,) as a delimiter. New features introduced in 11.1.0 Route Domain Support In the Configuration utility, when you enter the SMTP disallowed sender IP address,", "hasKeyColumn": false, "keyColumnIndex": -1, "headerRowIndex": 0}