{"relation": [["Total Years of Service", "At least 2 years, but less than 4 years", "At least 4 years, but less than 6 years", "At least 6 years, but less than 8 years", "At least 8 years, but less than 10 years", "At least 10 years, but less than 12 years", "At least 12 years, but less than 14 years", "At least 14 years, but less than 16 years", "At least 16 years, but less than 18 years", "At least 18 years, but less than 20 years", "At least 20 years"], ["Annual Payment", "$250", "$426", "$626", "$850", "$1,062", "$1,250", "$1,500", "$1,688", "$1,900", "$2,000"]], "pageTitle": "Oklahoma Department of Corrections - Benefits", "title": "", "url": "http://ok.gov/doc/Organization/Administrative_Services/Personnel/Benefits.html", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 1, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987866.61/warc/CC-MAIN-20150728002307-00183-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 188014543, "recordOffset": 187997397, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{26535=Ken Skidmore, Human Resources Manager P.O. Box 11400 Oklahoma City, OK 73136-0400 Telephone: (405) 425-7160 Fax: (405) 425-7256, 26897=Justin Giudice, Human Resources Management Specialist IV Phone: (405) 425-2871           Fax: (405) 425-7256, 41032=Normal Retirement An eligible employee may elect to retire on the first day of the month coinciding with or following the 62nd birthday if the employee has six or more years of full-time equivalent employment with a participating employer. Employees also become eligible for normal retirement on or after the date upon which the sum of a member's age and number of years credited service totals 80 except that employees who became members on or after July 1, 1992, become eligible for normal retirement when the sum of their ages and years of credited service total 90. State employees will receive 2% of their salary for every year of service., 44669=Productivity Enhancement Program – All employees, other than temporary, are eligible to compete for recognition, which may include a cash award of up to $10,000, through the submission of proposals by which the department can improve work efficiency or which results in operational cost savings. For more information, call (405) 425-2511., 27540=Nakita Gregory, Administrative Programs Officer II Phone: (405) 425-2733           Fax: (405) 425-7236, 27226=Tim Peters, Human Resources Management Specialist III Phone: (405) 425-2541           Fax: (405) 425-7256}", "lastModified": "Fri, 21 Mar 2014 16:49:01 GMT", "textBeforeTable": "Longevity payments will be made in accordance with the statutory Longevity Pay Plan and may be paid in conjunction with main payroll for the month of the employee's anniversary date. Longevity Pay   Return to Top Organizational Leave — Qualifying employees are entitled to take leave with pay up to three days a year to attend meetings of job-related professional organizations of which they are a member. Military Leave — Employees are eligible for paid military leave for a period of 30 days per federal fiscal year when ordered to military duty or service. Leave Sharing — Permanent employees with more than 12 months of service who have exhausted accrued sick and annual leave and are absent from work because they suffer from, or have a relative or household member who suffers from, a serious, extreme, or life threatening illness or injury, and who are eligible for family leave, are eligible to receive annual or sick leave donated by state employees. Family Medical Leave — Employees with at least 12 months of service who have worked at least 1,250 hours in the preceding 12 months may take family leave, not to exceed 12 weeks in a 12 month period for qualifying events. Family leave is deducted from existing leave balances or may be taken as leave without pay. Sick Leave — Sick leave is to be used when an employee is unable to", "textAfterTable": "For every additional 2 years over 20, $200 will be added to the $2,000 Return to Top   Retirement For full and part-time employees, a retirement plan is provided for the purpose of providing lifetime benefits.  The benefits in the plan are paid in addition to any supplemental benefits received from social security. Normal Retirement An eligible employee may elect to retire on the first day of the month coinciding with or following the 62nd birthday if the employee has six or more years of full-time equivalent employment with a participating employer. Employees also become eligible for normal retirement on or after the date upon which the sum of a member's age and number of years credited service totals 80 except that employees who became members on or after July 1, 1992, become eligible for normal retirement when the sum of their ages and years of credited service total 90. State employees will receive 2% of their salary for every year of service. Correctional Officers, Probation & Parole Officers and Fugitive Apprehension Agents Correctional officers, probation and parole officers and fugitive apprehension agents may retire with a minimum of 20 full years of full-time equivalent employment as a correctional officer, a probation and parole officer or as a fugitive apprehension agent. If eligibility for retirement is reached earlier (as provided above), a correctional officer, a probation and parole officer or a fugitive apprehension agent may elect to", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}