{"relation": [["", "Life Expectancy (Male)", "Life Expectancy (Female)", "Infant Mortality/1000 live births", "Obesity Rate (Male)", "Obesity Rate (Female)", "HC spending as % of GDP (2005)", ""], ["U.S.", "74.8", "80.1", "6.8", "31.1", "32.2", "16.0%", ""], ["Canada", "77.4", "82.4", "5.3", "17.0", "19.0", "10.4%", ""]], "pageTitle": "Is Health Care in Canada All Its Cracked Up to Be? | Dr Terry Simpson", "title": "", "url": "http://www.yourdoctorsorders.com/2012/07/canadian-health-care-myths/", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986451.45/warc/CC-MAIN-20150728002306-00057-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 834107607, "recordOffset": 834080160, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{54193=September 6, 2012 at 9:12 am, 44839=July 27, 2012 at 2:33 pm, 49741=July 29, 2012 at 7:44 pm, 37465=June E. O’Neill and Dave M. O’Neill (2008) “Health Status, Health Care and Inequality: Canada vs. the U.S.,” Forum for Health Economics & Policy: Vol. 10: Iss. 1 (Frontiers in Health Policy Research), Article 3. O’Neill JE; O’Neill DM (2007) “Health Status, Health Care and Inequality: Canada vs. the U.S.” NBER working paper #13429., 47317=July 27, 2012 at 3:17 pm, 37073=Physician satisfaction graph taken from The Washington Post: http://www.washingtonpost.com/blogs/ezra-klein/post/meme-busting-doctors-are-all-leaving-canada-to-practice-in-the-us/2011/06/03/AGVdAuHH_blog.html, 51565=September 6, 2012 at 7:36 am, 35385=In Canada, the main reason for an unmet need was because the wait was too long or the treatment was unavailable. In the U.S., most people who do not receive treatment fail to do so because of cost considerations. However, Canada has more family physicians per 1000 people than the United States does, and their needs continue to be met., 12517=July 27, 2012 By Dr. Terry Simpson, 51949=I love your articles. They are so informative. You are absolutely right about wait times in the US. I live in a mid size town in North Western Ohio. I remember a few years ago when I was having some problems and my family doctor wanted me to see a GI specialist. He told his nurse to call and get me an appointment with a local practice that had 8 GI specialists. The nurse came back into the room and said they told her they would schedule my appointment and send me a letter at home with the date and time. This was in Feb.. About a week later I received a letter with my appointment and it was for the middle of August! When I read that I laughed out loud knowing it had to be a mistake so I called their office and unfortunately for me it was not a mistake as this was their earliest appointment time for new patients. There was no way the issues I were having could wait that long to be checked. When I returned to my family doc in another week or so for follow up he came right in the room and said “Why haven’t I gotten a report from that GI doc yet”?…..I showed him the letter they had sent me and that I had verified that appointment. He excused himself from the room and came back in about 10 minutes later to tell me he had just called the GI doc himself and talked with him and my appointment was now in 2 days. Thankfully this happened and once in the practice I never had an issue getting appointments. I could literally call them this morning and see my Doc this afternoon if I needed to but new patients getting referrals is a whole other story., 61749=Copyright © 2015 Dr. Terry Simpson, MD * Phoenix & Scottsdale Arizona * 85260 * 480.500.5080, 36703=References: Health Aff May 2002 vol. 21 no. 3 19-31}", "textBeforeTable": "Basic Statistics The myths surrounding the Canadian health care system and how they take care of their patients continue to mount – so here are a few hard statistics that will give you some pause. But we need to place the statistics in context. July 27, 2012 By Dr. Terry Simpson Canadian Health Care Myths Health News / Canadian Health Care Myths Home / You are here: Weight Loss Videos Most Popular Sous Vide Skeptical Medicine Medical Issues Lap-Band Healthy Eating Health News Coffee Articles Contact Dr.", "textAfterTable": "The Canadian Drain- Coming to America for Health Care Canadians do come to the US for health care  – but let us compare apples to apples here. If a province does not have the specific health care  service, the province pays for the person to come to the US and get that service. And in rural provinces, the population is often too small to support medical specialists. Compare that to the rural United States, if there is not a specialist in a small town a patient is (and there are not in most of the rural states) referred to the major cities for specialty health care. Here is the difference- if they are referred from the United States there is no payment involved – just directions on where to go. If the Canadian government refers you for specialized health care it comes with the assurance that the health care is paid for. If you need specialized health care, for some rare diseases or specialized treatments, and have the means, you can go to Arizona Heart, for example, to have your thoracic aortic aneurysm taken care of with a stent, instead of having major, high risk chest surgery. If you have a brain tumor you, and insurance or means, you can go to Duke University that has the best experience with brain tumors (as a friend of mine did from Alaska, and Ted Kennedy did when he had his brain tumor). At my own center, we are the only", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}