{"relation": [["Number", "000-099", "100-199", "200-299", "300-399", "386-387", "400-499", "500-599", "600-899", "799", "899"], ["", "", "", "", "", "", "", "", "", "", ""], ["Eligibility", "Non-credit course", "Primarily freshman course", "Primarily sophomore course", "Junior, senior course not acceptable for credit toward graduate degrees", "Campus-wide internship courses; refer to information describing Experiential Learning", "Junior, senior course acceptable for credit toward some graduate degree", "Professional School course (Dentistry, Architecture, Law, Medicine) or post-baccalaureate course", "Course restricted to graduate students", "Master Thesis credit", "Doctoral Dissertation credit"]], "pageTitle": "University of Maryland Undergraduate Catalog 2015-2016", "title": "", "url": "http://www.umd.edu/catalog/index.cfm/show/content.chapter/c/50/program/3889", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 1, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990112.50/warc/CC-MAIN-20150728002310-00135-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 786861600, "recordOffset": 786845957, "tableOrientation": "HORIZONTAL", "TableContextTimeStampBeforeTable": "{1133=Undergraduate Catalog 2015-2016}", "TableContextTimeStampAfterTable": "{135481=The following list includes undergraduate courses that have been approved as of May 2014.  Courses added after that date do not appear in this list.  Courses eliminated after that date may still appear.  Not every course is offered regularly.  Students should consult the Schedule of Classes at www.testudo.umd.edu to ascertain which courses are actually offered during a given semester. COURSE NUMBERING SYSTEM}", "textBeforeTable": "The following list includes undergraduate courses that have been approved as of May 2014.  Courses added after that date do not appear in this list.  Courses eliminated after that date may still appear.  Not every course is offered regularly.  Students should consult the Schedule of Classes at www.testudo.umd.edu to ascertain which courses are actually offered during a given semester. COURSE NUMBERING SYSTEM Approved Courses Administrators, Officials and Faculty Approved Courses Appendix R: POLICY ON ACADEMIC ACHIEVEMENT IN INTERCOLLEGIATE ATHLETICS V-2.20 Appendix Q: POLICY ON STUDENT SOCIAL MEDIA PRIVACY Appendix P: UNIVERSITY OF MARYLAND IMMUNIZATION POLICY V-1.00(H) Appendix O: UNIVERSITY OF MARYLAND POLICY ON PROMOTING RESPONSIBLE ACTION IN MEDICAL EMERGENCIES (APPROVED BY THE PRESIDENT V-1.00(J) Appendix N: TRANSFER CREDIT POLICY MARYLAND HIGHER EDUCATION COMMISSION (TITLE 13 B) Appendix M: UNIVERSITY OF MARYLAND POLICY ON THE COLLECTION, USE AND PROTECTION OF ID NUMBERS VI-26.00(A) Appendix L: COMPLETION OF INTERRUPTED DEGREE Appendix K: POLICY ON PARTICIPATION BY STUDENTS IN CLASS EXERCISES THAT INVOLVE ANIMALS Appendix J: UNIVERSITY OF MARYLAND PROCEDURES FOR REVIEW OF ALLEGED ARBITRARY AND CAPRICIOUS GRADING--UNDERGRADUATE STUDENTS III-1.20(B)", "textAfterTable": "  Use the search box below to view the approved courses. Select Program:   < < List All Programs > > AASP - African American Studies AAST - Asian American Studies AGNR - Agriculture and Natural Resources AMSC - Applied Mathematics & Scientific Computation AMST - American Studies ANSC - Animal Science ANTH - Anthropology AOSC - Atmospheric and Oceanic Science ARAB - Arabic ARCH - Architecture AREC - Agricultural and Resource Economics ARHU - Arts and Humanities ARMY - Army ARSC - Air Science ARTH - Art History & Archaeology ARTT - Art Studio ASTR - Astronomy BCHM - Biochemistry BIOE - Bioengineering BIOM - Biometrics BMGT - Business and Management BSCI - Biological Sciences Program BSCV - CIVICUS BSGC - Global Communities BSOS - Behavioral and Social Sciences BSST - Terrorism Studies CCJS - Criminology and Criminal Justice CHBE - Chemical and Biomolecular Engineering CHEM - Chemistry CHIN - Chinese CLAS - Classics CMLT - Comparative Literature CMSC - Computer Science COMM - Communication CPBE - College Park Scholars-Business, Society, and Economy CPET - College Park Scholars-Environment, Technology & Economy CPGH - College Park Scholars-Global Public Health CPJT - College Park Scholars-Justice", "hasKeyColumn": true, "keyColumnIndex": 2, "headerRowIndex": 0}