{"relation": [["", "1). Load Retention:", "2). Film Memory:", "3). Film Yield:", "4). Puncture Resistance:", "5). Cling of the Film:", "6). Visual Clarity:", "7). Noise on unwind:"], ["Blown Stretch Film", "More holding power, won't re-stretch once applied", "Higher ability to shrink back to original size after stretch", "Stretches much farther to cover more pallets with less film", "Manufacturing process allows greater resistance to breaking", "1 sided cling, great for higher load retention", "Not crystal clear, can make reading and scanning harder, but has a lower gloss reducing reflections", "Loud when releasing from the roll"], ["Cast Stretch Film", "Stretches easily, even after applied to pallet which can cause shifting", "Minimal ability to go back to original state after stretching", "Additional stretching can be obtained easier through lower micron blown films (Conversion Chart)", "Standard tearing can occur when stressed too much", "Naturally clingy on both sides, can make pallets stick together", "Perfectly clear, makes reading and scanning in warehouse light easy, but a higher gloss makes reflections annoying.", "Very quiet when unwound from the stretch roll"]], "pageTitle": "Learn the Differences Between Blown & Cast Stretch Wraps and Films Online at RocketIndustrial.com", "title": "", "url": "http://www.rocketindustrial.com/resource-center/differences-blown-cast-stretch-film.html", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 1, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989331.34/warc/CC-MAIN-20150728002309-00096-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 689379863, "recordOffset": 689359656, "tableOrientation": "HORIZONTAL", "textBeforeTable": "7 Points of Comparison Add to Cart $68.71 $79.90 Cast Stretch Film 20 inch Extended Handle Stretch Wrap Add to Cart $51.06 $59.57 Cast Stretch Film 15\" 80 Gauge Hand Stretch Wrap Add to Cart $1,996.80 $2,356.22 Cast Stretch Film Evolve Stretch Wrap - 75 Gauge Add to Cart", "textAfterTable": "Stretch Wrap Machines and Supplies Fox Stretch Wrapper Manual Stretch Wrapper $5,950.00 $5,695.00 Add to Cart Cousins Switch Stretch Wrapper Semi-Automatic Stretch Wrapper $9,540.00 $9,190.00 Add to Cart Automatic A-Arm Stretch Wrapper Automatic Stretch Wrapper $10,990.00 Add to Cart Rocket Industrial Resource Center About", "hasKeyColumn": false, "keyColumnIndex": -1, "headerRowIndex": 0}