{"relation": [["", "Sand and coral", "White coral rock", "Yellow sand", "Hard lava", "White coral rock", "Blue clay", "Tough clay and coral", "Blue clay", "Hard coral rock", "Soft coral"], ["Thickness Feet", "38", "22", "43", "47", "110", "25", "65", "30", "40", "30"], ["Depth Feet", "", "60", "103", "150", "260", "285", "350", "380", "420", "450"]], "pageTitle": "Darwin, C. R. 1889. The structure and distribution of coral reefs. 3d edition. With a preface to the third edition by Francis Darwin and an appendix by T. G. Bonney. London: Smith Elder and Co.", "title": "", "url": "http://darwin-online.org.uk/content/contentblock?itemID=F277&basepage=1&hitpage=365&viewtype=side", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 2, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990114.79/warc/CC-MAIN-20150728002310-00213-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 58772707, "recordOffset": 58545869, "tableOrientation": "HORIZONTAL", "TableContextTimeStampBeforeTable": "{1=File last updated 2 July, 2012}", "TableContextTimeStampAfterTable": "{32166=1 A brief account of my views on coral formations, now published in my Journal of Researches, was read May 31, 1837, before the Geological Society, and an abstract has appeared in the Proceedings., 577508=1 In Three Cruises of the Blake, vol. i. p. 74, Prof. A. Agassiz states that 'all the evidence accumulated by Dana, Darwin, Ehrenberg, Quoy, and Gaimard tends to show that the limit of reef-building corals is to be found at about twenty fathoms.' Prof. Agassiz's views in regard to Florida do not appear to have met with universal acceptance among American men of science; for instance, Mr. W. H. Dall (Geology of Florida, Amer. Journ. Sci., 3rd ser. xxxiv. p. 161, 1877) says that in the southern part of Florida he saw no coral-rock or coral-reef formation: 'The coral formation observed by Agassiz in the region in the Keys must be of very limited scope, as it has not been identified from the mainland of Florida by any modern geologist.' Further, Prof. A. Heilprin in a paper on Explorations in Florida (Transactions Wagner Inst. Sci. Philadelphia, May 1887), noticed in the above-named volume (p. 230), says: 'No observed facts sustain the coral theory of formation propounded by Agassiz. They prove, on the contrary, that the coral tract of Florida is confined to a border region on the south and south-east, and there are no tertiary reefs whatever.' But he admits that the southern area is one of shallow sea formation, so that there has been a gradual uniform progressive elevation over the whole., 10047=DOWN, BECKNHAM, KENT February 1874., 502280=1 [The following interesting account of Zanzibar is contained in a letter from Captain Wharton, found among Mr. Darwin's papers:— 'Zanzibar seems to me to have undergone several motions of subsidence and upheaval, the latter being the latest; it appears now to have been for many years nearly stationary. 'The island at present is surrounded with a nearly perfectly flat, dead, altered coral ledge, more or less dry at low water, without doubt the result of long action of the sea on the upheaved ancient and compressed coral of which the island is principally formed. This action has worn away the sea face of the land to the level of low water for a distance, in some instances, of 1½ miles inside the original high-water line, which now remains as a steep rim, dropping to 10 and 20 fathoms almost immediately, with (on the outside of the island) 100 fathoms within a quarter of a mile. I could see no sign of this ledge extending seaward, though there is living coral on its steep face visible a few feet below at low water, but this is not abundant, as it is on some of the detached reefs off the island. 'The present high-water line of the island at the back of this flat area is, for the major part of its perimeter, a cliff of the same old coral from 10 to 20 feet in height, undermined by the waves, and overhanging, in some places, to a marvellous extent, showing the hardness and cohesion of the material, and giving a notion of the long period of time necessary to wear it away. As a further proof of this is the fact of very few lately detached pieces being seen at the foot of the cliffs, though the blocks, when they do fall, must be large and not easily moved by the sea. 'In most parts of the island the tops of these low cliffs run back from the sea nearly level for a greater or less distance, showing water-worn coral wherever the surface rock is exposed, and indicating another stationary period or one of very slow upheaval. Out of this level the higher lands of the island rise. 'Zanzibar is intersected by what may be regarded as 3 lines of hills running north and south, the highest of them being 450 feet above the sea. 'I regret to add that I cannot say of what formation these hills may be; I cannot call to mind any rock beyond the coral, which crops out at considerable heights (in one instance 250 feet), but there is a good deal of hardened clay or mudstone, which generally appears in the ravines, &c., and on the bare sides of the hills, but there may be other rock lying under this. 'The valleys, or rather flat plains, between the ranges of hills, are mostly (particularly to the south) coral, worn and roughened, undoubtedly by water. These are generally about 50 feet above the sea. Several isolated hills of coral stand on these plains, their bases being undermined and worn precisely as the present cliffs, and their flat summits present the same appearance. 'The whole thickness of the coral of Zanzibar must be very great. 'The coast of the mainland about Zanzibar is similar to the island, and, as far as I know them, Pemba, Monfia, and the coast far north and south are the same. 'The outlying and detached reefs are of two kinds, those growing up with living coral, and those of dead coral, like the island washing gradually away. Of these latter many still have level islets and rocks on them, remnants of a former upheaval; others afford a foundation to coral sand-banks that are dry high at low water, and others are perfectly smooth and covered at high water, being just awash at low tide. Of the second of these, are the reefs referred to by you at page 258 as described by Lieut. Boteler as sand-banks. That description is erroneous. 'One island, mentioned in the beginning of the century, had by Capt. Owen's time (1825) been reduced to a sand-head always visible. Now (1874) even this has entirely disappeared, and the reef on which is stood is flat and bare. 'This is the only instance in which I have been able to make any reliable comparison between Capt. Owen's chart and mine, as to reduction of reefs. 'As to the perhaps still more interesting question of growing coral, I have been unable to make any such, as Owen's work was so cursory and hurried that it is impossible to know whether he struck the shoalest part of a reef. 'There is, indeed, one instance that, if not isolated, might have been of use. He describes a particular shoal as being a 'knoll with deep water all round,' and in his chart, 7 fathoms is marked on it and 25 fathoms around. That patch has now only 1½ fathoms on it and 20 fathoms round. 'This, altogether, looks like upheaval of the whole bottom; but as in most instances our soundings agree remarkably well, I cannot think that that can be so. On the other hand, the reef is so small and the bottom so clear, that it is difficult to understand how they could have missed the shoaler water if it existed then, as it is very plain to see. 'Other reefs, with from 7 to 10 fathoms on them, seem not to have altered. 'W. J. S. WHARTON, Commander R.N. 'Mauritius: Sept. 15, 1874.], 707225=Volume I. was published on January I, 1885, and a volume has been issued every three months since that date., 203302=It may, however, be inferred from the following facts, that the rate under favourable circumstances would be far from slow. Dr. Allan of Forres has given, in his MS. Thesis deposited in the library of the Edinburgh University, the following account of some experiments, which he tried during his travels in the years 1830 to 1832 on the east coast of Madagascar. 'To ascertain the rise and progress of the coral family, and fix the number of species met with at Foul Point (lat. 17° 40′ ;), twenty species of coral were taken of the reef and planted, 401925=long. 178° 30′ ; W., on which the Gledstanes was wrecked in 1837. It is apparently of large size, and extends in a N.W. and S.E. line: very few islets have been formed on it. The lagoon seems to be shallow; at least, the deepest part which was surveyed was only three fathoms. Mr. Couthouy (Remarks. p. 38) describes this island under the name of Ocean Island. Considerable doubts should be entertained regarding the nature of a reef of this kind, with a very shallow lagoon, and standing far from any other atoll, on account of the possibility of a crater or flat bank of rock lying at the proper depth beneath the surface of the water, having afforded a foundation for a ring-formed coral-reef. I have, however, thought myself compelled, from its large size and symmetrical outline, to colour it blue. Some information and references are given by Dana (Corals and Coral Islands, pp. 324, 365) with respect to the reefs and islets extending for 2,000 miles in a N.W. line from Hawaii., 395158=this island is in the close vicinity of other low islands, and as it is said that the natives make reservoirs of water in old cocoa-nut trees (which shows the nature of the land), I have no doubt it is an atoll, and have coloured it blue.—York Island (8° S., 172° W.) is described by Commodore Byron (chap: x. of his Voyage) as an atoll; blue.—Sydney Island (4° S., 172° W.) is about three miles in diameter, with its interior occupied by a lagoon (Captain Tromelin, Annal. Marit. 1829, p. 297); coloured blue.—Hull Island is situated 60 miles to the west of Sydney Island, and is described by Wilkes (U.S. Exploring Expedition, vol. iii. p. 369) as a lagoon-island; coloured blue.—Phœnix Island (4° S., 171° W.) is nearly circular, low sandy, not more than two miles in diameter, and very steep outside (Tromelin, Annal Marit. 1829, p. 297): it may be inferred that this island originally contained a lagoon, but I have not coloured it.—New Nantucket (0° 15′ ; N., 174° W.): from the French chart it must be a low island; I can find nothing more about it, or about Mary Island; both uncoloured.—Gardner Island (5° S., 174° W.), from its position, is certainly the same as Kemin Island, and is described (Krusenstern, p. 435, Appen. to Mem. published 1827) as having a lagoon in its centre; coloured blue., 413760=ELLICE GROUP.—Oscar, Peyster, and Ellice Islands are figured in Arrowsmith's Chart of the Pacific (corrected to 1832) as atolls, and are said to be very low; blue.2—Nederlandisch Island: I am greatly indebted to the kindness of Admiral Krusenstern for sending me the original documents concerning this island. From the plans given by Captains Eeg and Khremtshenko, and from the detailed account given by the former, it appears that it is a narrow coral-island, about two miles long, containing a small lagoon. The sea is very deep close to the shore, which is fronted by sharp coral-rocks. Captain Eeg compares the lagoon with that of other coral-islands; and he distinctly says, the land is 'very low.' I have therefore coloured it blue. Admiral Krusenstern (supplément au Recueil des Mémoires Hydrographiques publiés en 1826 et 1827, &c. &c. St. Petersburg, 1835) states that it shores are 80 feet high; this probably arose from the height of the cocoa-nut trees, with which it is covered, being mistaken for land.—Grand Cocal is said in Krusenstern's Memoir to be low, and to be surrounded by a reef; it is small, and therefore probably, 4269=THE FIRST EDITION of this book appeared in 1842, and since then only one important work on the same subject has appeared, namely, in 1872, by Professor Dana, on Corals and Coral-Reefs. In this work he justly says that I have not laid sufficient weight on the mean temperature of the sea, in determining the distribution of coral-reefs; but neither a low temperature nor the presence of mud-banks accounts, as it appears to me, for the absence of coral-reefs through-out certain areas; and we must look to some more recondite cause. Professor Dana, also, insists that volcanic action prevents the growth of coral-reefs much more effectually than I had supposed; but how the heat or poisonous exhalations from a volcano, 189270=4 Since the preceding pages (of the first edit.) have been printed off, I have received from Sir C. Lyell an interesting pamphlet, entitled Remarks upon Coral-Formations, &c., by J. Couthouy, Boston, United States, 1842. A statement (p. 6) is here given on the authority of the Rev. J. Williams, corroborating the above remarks on the antiquity of certain individual corals, namely, that at Upolu, one of the Navigator islands, 'particular clumps of coral are known to the fishermen by name, derived from either some particular configuration or tradition attached to them, and handed down from time immemorial.', 251906=1 M. Desmoulins in Comptes Rendus, 1840, p. 837., 218457=2 Voyage Round the World, 1843, p. 379, vol. i., 470983=Point St. Jago is fringed by a reef; as are (Horsburgh, vol. ii. p. 437) the Three Friars off Silanguin Bay. Between Point Capones and Playa Honda, the coast is 'lined by a coral-reef, stretching out nearly a mile in some places' (Horsburgh); and Mr. Cuming visited some fringing-reefs on other parts of the coast, namely, near Puebla, Iba, and Mansinglor. In the neighbourhood of Solon-solon Bay, the shore is lined (Horsburgh, vol. ii. p. 439) by coral-reefs, stretching out a great way: there are also reefs about the islets off Solamague; and as I am informed by Mr. Cuming, near St. Catalina, and a little north of it. The same gentleman informs me that there are reefs on the S.E. point of this island in front of Samar, extending from Malalabon to Bulusan. These appear to be the principal fringing-reefs on the coasts of Luzon; and they have all been coloured red. Mr. Cuming informs me that none of them have deep water within; although it appears from Horsburgh that some few extend to a considerable distance from the land. Within the Philippine Archipelago, the shores of the islands do not appear to be commonly fringed, with the exception of the S. shore of Masbate, and nearly the whole of Bohol; which are both coloured red. On the S. shore of Magindanao, Bunwoot Island is surrounded (according to Forrest, Voyage, p. 253) by a coral-reef, which in the chart appears one of the fringing class. With respect to the eastern coasts of the archipelago, I have not been able to obtain any account. Prof. Semper has recently published a notice (Zeitschr. f. Wissensch. Zoologie, Bd. xiii. 1863, p. 558) respecting the coral-reefs of this archipelago. It appears that some of them come under the class of barrier-reefs; but as I have not seen a chart on a large scale, and know nothing about the depth of the water outside the reefs, nor about the slope of the encircled land, I cannot judge whether they properly come under the barrier class., 445474=BONIN OR ARZOBISPO GROUP.—Peel Island has been examined by Captain Beechey, to whose kindness I am much indebted fro giving me information regarding it: 'at Port Lloyd there is a great deal of coral; and the inner harbour is entirely formed by coral-reefs, which extend outside the port along the coast.' Captain Beechey, in another part of his letter to me, alludes to the reefs fringing the island in all directions; but at the same time it must be observed that the surf washes the volcanic rocks of the coast in the greater part of its circumference. This island has certainly been elevated at least 50 feet within the recent period (see Journal of Geolog. Soc. 1855, p. 532). I do not know whether the other islands of the archipelago are fringed; I have coloured Peel island red.—Grampus Island, to the eastward, does not appear (Meare's Voyage, p. 95) to have any reefs, nor does Rosario Island (from Lutké's chart), which lies to the westward. Respecting the few other islands in this part of the sea, namely the Sulphur Islands, with an active volcano, and those lying between Bonin and Japan (situated near the extreme limit in latitude at which reefs can grow), I have not been able to find any clear account., 557210=SUMMARY OF THE PRINCIPAL CONTRIBUTIONS TO THE HISTORY OF CORAL REEFS SINCE THE YEAR 1874., 223961=2 Journal of the Royal Geograph. Soc. 1831, p. 218., 346035=3 Notices of the East Indian Arch., Singapore, 1828, p. 6, and Append. p. 43., 195029=2 Voyage Round the World, vol. i. 1843, p. 369., 420013=Caledonia on the one hand, and the Fidji group on the other. Nevertheless, I have been assured by Mr. G. Bennett, that coral grows vigorously on their shores; as, indeed, will be further shown in some of the following notices. As, therefore, these islands are not encircled, and as coral grows vigorously on their shores, we might almost conclude, without further evidence, that they are fringed, and hence I have applied the red colour with rather greater freedom than in other instances.—Matthew's Rock, an active volcano, some way south of the group (of which a plan is given in atlas of the Astrolabe'sVoyage) does not appear to have reefs of any kind about it.—Annatom, the southernmost of the Hebrides: from a rough woodcut given in the United Service Journal (1831, part iii. p. 190), accompanying a paper by Mr. Bennett, it appears that the shore is fringed; coloured red.—Tanna: Forster, in his Observations (p. 22), says Tanna has on its shores coral-rock and madrepores; and the younger Forster, in his account (vol. ii. p. 269), speaking of the harbour, says the whole S.E. side consists of coral-reefs, which are overflowed at high water: part of the southern shore in Cook's chart is represented as fringed; coloured red.—Immer is described (United Service Journ. 1831, part iii. p. 192) by Mr. Bennett as being of moderate elevation, with cliffs appearing like sandstone; coral grows in patches on its shore, but I have not coloured it; and I mention these facts because Immer might have been thought, from Forster's classification (Observations, p. 14), to have been a low island, or even an atoll.—Erromango Island: Cook (Second Voyage, vol. ii. p. 45, 4to edit.) speaks of rocks everywhere lining the coast, and the natives offered to haul his boat over the breakers to the sandy beach: Mr. Bennett, in a letter to the editor of the Singapore Chron., alludes to the reefs on its shores. It may, I think, be safely inferred from these passages that the shore is fringed in parts of coral-reefs; coloured red.—Sandwich, 425580=NEW CALEDONIA.—The great barrier-reefs on the shores of this island have already been described (Fig. 5, Plate II.). They have been visited by Labillardière, Cook, and the northern Point by D'Urville; this latter part so closely resembles an atoll that I have coloured it dark blue. The Loyalty group is situated to the east of New Caledonia; some at least of the islands are formed of upraised coral-rock, and are fringed with living reefs; see Rev. W. B. Clarke, in Journal of Geolog. Soc. 1847, p. 61; coloured red. North of this group there are some extensive low reefs (called Astrolabe and Beaupré2), which do not seem to be atoll-formed: these are left uncoloured., 404862=Beveridge Reef, 20° S., 167° W., is described in the Naut. Mag. (May 1833, p. 442) as ten miles long in a N. and S. line, and eight wide; 'in the inside of the reef, there appears deep water;' there is a passage near the S.W. corner: this therefore seems to be a submerged atoll, and is coloured blue., 328840=1 Voyage Round the World, vol. i. 1843, p. 382., 252296=face there are a few worn patches of conglomerate coral-rock of about the size of hovels; and these Captain Moresby considers as being, without doubt, the last remnants of islets; so that here an atoll has been converted into an atoll-formed reef. The inhabitants of the Maldiva Archipelago, as long ago as 1605, declared, 'that the high tides and violent currents were always diminishing the number of the islands:'1 and I have already shown, on the authority of Captain Moresby, that the work of destruction is still in progress; but that on the other hand the first formation of some islets is known to the present inhabitants. In such cases, it would be exceedingly difficult to detect a gradual subsidence of the foundation on which these mutable structures rest., 570897=1 Agassiz, Alexander. The Tortugas and Florida Reefs. Mem. Amer. Acad. Arts and Sci., vol. xi. p. 107, 1885. In Three Cruises of the Blake, vol i. (Bulletin of the Museum of Comparative Zoology, Harvard College, vol. xiv., 1888), a chapter is devoted to the Florida Reefs. As, however, the line of argument and the principal facts are identical with those given above, I have not thought it necessary to give a separate analysis. A convenient and clear summary of the views of Semper, Rein, Murray, and Agassiz is given by Prof. A. Geikie in his presidential address to the Royal Physical Society of Edinburgh in 1883 (Proc. vol. viii. p. 1)., 321509=the belief that these islands have recently subsided; though not proving the fact. At Keeling atoll, however, I have described certain appearances, which seem directly to show that the surface subsided there during the late earthquakes. In the Caroline Archipelago, the island of Pouynipète (Plate I. fig. 7), from being encircled by a great barrier-reef, must have subsided, in accordance with our theory; and in the New South Wales Lit. Advert. Feb. 1835, there is an account of this island, (subsequently confirmed by Mr. Campbell,) in which it is said, 'At the N.E. end, at a place called Tamen, there are ruins of a town, now only accessible, by boats, the waves reaching to the steps of the houses..' Hence it would appear that the island must have subsided since these houses were built. Mr. Hales also states, from information acquired during the U.S. Exploring Expedition, that certain buildings on this island are now in the water: 'what were once paths are now passages for canoes, and when the walls are broken down the water enters the enclousres.'1 Vanikoro, according to the Chevalier Dillon, is often violently shaken by earthquakes, and there, the unusual depth of the channel between the shore and the reef, the wall-like structure on the inner side of the reef, the small quantity of low alluvial land at the foot of the mountains, and the almost entire absence of islets on the reef, all seem to show that this island has not remained long at its present level.2 At the Society Archipelago, on the other hand,, 417929=MARSHALL GROUP.—We are well acquainted with this group from the excellent charts of the separate islands, made during the two voyages of Kotzebue: a reduced one of the whole group may be seen in Krusenstern's Atlas, and in Kotzebue's Second Voyage. The group consists (with the exception of two little islands which probably have had their lagoon filled up) of a double row of 23 large and well-characterized atolls, from the examination of which Chamisso drew up his well-known account of coral formations. I include in this group Gaspar Rico, or Cornwallis Island, which is described by Chamisso (Kotzebue's First Voyage, vol. iii. p. 179) 'as a low sickle-formed group, with mould only on the windward side.' Gaspard Island is considered by some geographers as a distinct island lying N.E. of the group, but it is not entered in the chart by Krusenstern; left un-coloured. In the S.W. part of this group lies Baring Island, of which little is known (see Krusenstern's Appendix, 1835, p. 149). I have left it uncoloured; but Boston Island I have coloured blue, as it is described (ibid.) as consisting of 14 small islands, which, no doubt, inclose a lagoon, as represented in a chart in the Coquille's atlas.— Three islands, Aur, Kawen and Gaspar Rico, are written in the French chart with capital letters; but this is an error, for from the account given by Chamisso in Kotzebue's First Voyage, they are certainly low. The nature, position, and even existence of the shoals and small islands north of the Marshall group are doubtful., 556835=1 There is an interesting account of this reef, containing particulars of some borings undertaken in 1874, by Mr. J. C. Hawkshaw, in the Quarterly Journal of the Geological Society for 1879 (vol.xxxv.p.239).], 250398=two other islands.1 According to a tradition which was communicated to Captain FitzRoy, it is believed in the Low Archipelago that the arrival of the first ship caused a great inundation which destroyed many lives. Mr. Stutchbury relates that in 1825, the western side of Chain Atoll in the same group, was completely devastated by a hurricane, and not less than 300 lives lost: 'in this instance it was evident, even to the natives, that the hurricane along was not sufficient to account for the violent agitation of the ocean.'2 That considerable changes have taken place recently in some of the atolls in the Low Archipelago, appears certain from the case of Matilda Island given in the last chapter. With respect to Whitsunday and Gloucester Islands in this same group, we must either attribute great inaccuracy to their discoverer, the famous circumnavigator Wallis, or believe that they have undergone a considerable change in the period of fifty-nine years between his voyage and that of Captain Beechey. Whitsunday Island is described by Wallis as 'about four miles long, and three wide,' now it is only one mile and a-half long. The appearance of Gloucester Island, in Captain Beechey's words,3 'has been accurately described by its discoverer, but its present form and extent differ materially.' Blenheim reef in the Chagos group, consists of a water-washed annular reef thirteen miles in circumference, surrounding a lagoon ten fathoms deep; on its sur-, 340123=Still proceeding westward we come to the New Hebrides. On these islands, Mr. G. Bennett (author of Wanderings in New South Wales) informs me that he found much coral at a great altitude, which he considered of recent origin.2 The Loyalty Islands are situated west of the New Hebrides, and not far from New Caledonia; and one of these islands has been clearly shown by the Rev. W. B. Clarke (Journal of Geolog. Soc. 1847, p. 61) to consist wholly of coral-rock, and to have been raised within a recent period by at least two distinct elevations to the height of 250 feet. The shores are now fringed by reefs. Respecting Santa Cruz and the Saloman Archipelago3 I have no information; but at New Ireland, which forms the northern point of the, 90947=1 Principles of Geology, vol. iii. p. 289. [Vol. ii. p. 609, ed. 1872.], 347574=2 Travels in Ceylon, p. 13. This madreporitic formation is mentioned by M. Cordier in his report to the Institute (May 4, 1839) on the voyage of the Chevrette, as one of immense extent, and belonging to the latest tertiary period., 3192=For all that distinguishes the present from the second edition the reader has to thank Professor BONNEY. He has added occasional footnotes (distinguished by square brackets), and he has given, in the form of an appendix, a careful summary of the more important memoirs published since 1874., 707368=A further Volume will be published on January 1, April 1, July 1, and October 1 of each year until the completion of the work., 218364=1 Corals and Coral Islands, 1872, p. 116., 352792=3 These references only relate to works published before 1842, the date of the first edition of this book. On Florida and the north shores of the Gulf of Mexico, Rogers' Report to Brit. Assoc. vol. iii. p. 14.—On the shores of Mexico, Humboldt, Polit. Essay on New Spain, vol. i. p. 62. (I have also some corroborative facts with respect to the shores of Mexico.)—Honduras and the Antilles, Lyell's Principles, 5th ed. vol. iv. p. 22.—Santa Cruz and Barbadoes, Prof. Hovey, Silliman's Journ. vol. xxxv. p.74.—St. Domingo, Courrojolles Jour. de Phys. tom liv. p. 106.—Bahamas United Services Journ. No. lxxi. pp. 218 and 224.—Jamaica, De la Beche, Geol. Man. p. 142.—Cuba, Taylor in Lond. and Edin. Phil. Mag. vol. xi. p. 17. Dr. Daubeney also at a meeting of the Geolog. Soc. orally described some very modern beds lying on the N.W. parts of Cuba. I might have added many other less important references. [See Appendix II.], 11699=May 2, 1842., 7910=1 A friendly reply from Professor Dana, contesting some of the points mentioned above, will be found in Nature, Sept. 1874, p.408., 426737=AUSTRALIAN BARRIER-REEF.—This great reef, which has already been described, has been coloured from the charts of Flinders and King. Jukes has given many details respecting it in the Voyage of H.M.S. Fly (vol. i. 1847, chap. xiii.). In the northern parts, an atoll-formed reef, lying outside the barrier, has been described by Bligh, and is coloured dark blue. In the space between Australia and New Caledonia, called by Flinders the Corallian Sea, there are numerous reefs. Of these, some are represented in Krusenstern's Atlas as having an atoll-like structure;1 namely, Bampton Shoal, Frederic, Vine or Horse-shoe, and Alert Reefs; these have been coloured dark blue., 701388=The First Volume, containing 'PAULINE' and 'SORDELLO,' was published on the 26th of April, 1888., 641923=1 Points in the Geological History of the islands Maui and Oahu. By J. D. Dana, Amer. Jour. Sci. vol. xxxvii. p. 81 (February 1889). I am indebted to my friend Professor Judd for calling my attention to this article., 377544=109° W., from a drawing appended to a MS. plan in the Admiralty, does not appear to be an atoll, but Sir E. Belcher (Voyage round the World, vol. i. 1843, p. 255) speaks of it as of coral-formation, with deep water within the lagoon; left uncoloured. The eastern part of the Pacific presents an enormous area without any islands, except Easter and Gomez, which do not appear to be surrounded by reefs., 235355=What cause, then, has given to atolls and barrier-reefs their characteristic forms? Let us see whether an important deduction does not follow from the following facts,—first, that reef-building corals only flourish at a very limited depth,—and secondly, that throughout areas of vast dimensions, none of the coral-reefs and coral-islets rise to a greater height above the level of the sea than that attained by matter thrown up by the waves and winds. I do not make this latter statement vaguely; I have carefully sought for descriptions of every island in the inter-tropical seas; and my task has been in some degree facilitated by a map of the Pacific, corrected in 1834 by MM. D'Urville and Lottin, in which the low islands are distinguished from the high ones (even from those much less than a hundred feet in height) by being written without a capital letter.1 I have also ascertained, chiefly from the writings of Cook, Kotzebue, Bellingshausen, Duperrey, Beechey, and Lutké regarding the Pacific; and from Moresby2 with respect to the Indian Ocean, that in the following cases the term 'low island' strictly means land of the height com-, 711779=Citation: John van Wyhe, editor. 2002-. The Complete Work of Charles Darwin Online. (http://darwin-online.org.uk/), 26850=is lashed by the breakers of an ocean never at rest. Well did Fran&ccedil;ois Pyrard de Laval, in the year 1605, exclaim, 'C'est une merueille de voir chacun de ces atollons, enuironné d'un grand banc de pierre tout autour, n'y ayant point d'artifice humain.' The above sketch of Whitsunday Island, in the S. Pacific, taken from Capt. Beechey's admirable Voyage, although excellent of its kind, gives but a, 440355=shore, and there are spaces within them, not opposite to any valley, from 10 to 15 fathoms deep. According to a MS. chart of the group by Lieut. Elmer in the Admiralty, there is a large space within the reef with deepish water: although the high land does not hold a central position with respect to the reefs, as is generally the case, I have little doubt that the reefs of the Pelew Islands ought to be ranked in the barrier class, and I have coloured them pale blue. In Lieut. Elmer's chart there is a horse-shoe-formed shoal, 13 miles N.W. of Pelew, with 15 fathoms within the reef, and some dry banks on it; coloured dark blue.—Spanish, Martires, Sanserot, Pulo Anna and Mariere Islands are not coloured, because I know nothing about them, excepting that according to Krusenstern, the second, third, and fourth mentioned, are low, placed on coral-reefs, and therefore perhaps include a lagoon; but Pulo Mariere is a little higher. Since the above remarks were written Prof. Semper has published and interesting article (Zeitschr. f. Wissensch. Zoologie, Bd. xiii. 1863, p. 558) on these islands. He states that the southern islands consist of coral-rock, upraised to the height of from 400 to 500 feet; and some of them, before their upheaval, seem to have existed as atolls. They are now merely fringed by living reefs. The northern islands are volcanic, deeply indented by bays, and are fronted by barrier-reefs. To the north there are three true atolls. Prof. Semper doubts whether the whole group has subsided, partly from the fact of the southern islands being formed of upraised coral-rock; but there seems to me no improbability in their having originally subsided, then having been upraised (probably at the time when the volcanic rocks to the north were erupted), and again having subsided. The existence of atolls and barrier-reefs in close proximity is manifestly not opposed to my views. On the other hand, the presence of reefs fringing the southern islands is opposed to my views, as such reefs generally indi-, 549594=Supplement on a remarkable Bar of Sandstone off Pernambuco, on the Coast of Brazil. (Originally published in the Philosophical Magazine, October 1841, p. 257.), 341=REVISION HISTORY: Scanned by John van Wyhe, transcribed (single key) by AEL Data 7.2009, corrections by van Wyhe 8.2009. RN2, 390569=blue.—Raivaivai, or Vivitao: Mr. Williams informs me that the reef is here distant from the shore; Mr. Ellis, however, says that this is certainly not the case on one side of the island; and he believed that the water within the reef is not deep; hence I have left it uncoloured.—Lancaster Reef, described in Naut. Map. 1833 (p. 693), as an extensive crescent-formed coral-reef, has not been coloured.—Rapa, or Oparree: from the accounts given of it by Ellis and Vancouver, there does not appear to be any reef.—I. de Bass is an adjoining island, of which I cannot find any account.—Kemin Island: Krusenstern seems hardly to know its position, and gives no further particulars., 408417=Amargura coloured, for I have not seen plans of them on a large scale, and I do not know whether they are fringed: Amargura is said (Athenæum, 1848, p. 40) to have been lately in violent eruption., 325259=2 Corals and Coral Islands, 1872, pp. 199, 345. See also Mr. Couthouy's Remarks on Coral Formations. [See Wilkes' Exploring Expedition, vol. i. chap. xv.], 343353=4 P. W. Graves, Journal of Geological Soc. 1855, p. 532., 316034=1 Corals and Coral Islands, 1872, p. 325., 413396=Independence Island, 10° S., 179° E., is described by Mr. G. Bennett (United Service Journ. 1831, part ii. p. 197) as a low island of coral formation; it is small, and does not appear to contain a lagoon, although an opening through the reef is referred to. A lagoon probably once existed, and has since been filled up; left uncoloured., 209829=1 L'Institut, 1846, p. 111., 398949=1 [Prof. Dana, noticing this remark in Silliman's Amer. Jour., Dec. 1874, states the result of further enquiries on his part from the Rev. Mr. M'Coan, long a resident of Hilo:—'With respect to your enquiry whether there is any elevated coral-reef rock around the shores of Hawaii, I would reply that I think not.… Honolulu, on the island of Oahu, is built much of it upon the elevated coral-reef rock, and there are large areas in the district of Waiana and other portions of the Oahu shores: but there is nothing of this kind on Hawaii. You are aware that corals, even under the water, are on the weather [eastern] side of this island not abundant.' In the Narrative of the Challenger Voyage (p. 699) reefs are mentioned as occurring at Honolulu.], 388376=attached; coloured red.—Atiu, or Wateeo: a moderately elevated, hilly island, like the others of the group; the reef is described in Cook's Voyage as attached to the shore, and about 100 yards wide; coloured red.—Fenoua-iti: Cook describes this island as very low, not more than six or seven feet in height (vol. i. book ii. chap. iii. 1777); in the chart published in the Coquille's atlas, a reef is engraved close to the shore: this island is not mentioned in the list given by Mr. Williams (p. 16) in the Narrative of Missionary Enterprise; nature doubtful; but as it lies so near Atiu, it has been unavoidably coloured red.—Rarotonga: Mr. Williams informs me that this is a lofty basaltic island, with an attached reef; coloured red.—There are three other islands, Rourouti, Roxburgh, and Hull, of which I have not been able to obtain any account, and have left them uncoloured. Hull Island, in the French chart, is written with small letters as being low.—Mangaia: height about 300 feet; 'the surrounding reef joins the shore' (Williams's Narrative, p. 18); coloured red.—Rimetara: Mr. Williams informs me that the reef is rather close to the shore; but, from information given me by Mr. Ellis, the reef does not appear to be quite so closely attached to it as in the foregoing cases: the island is about 300 feet high (Naut. Mag. 1839, p. 738); coloured red.—Rurutu: Mr. Williams and Mr. Ellis inform me that this island has an attached reef; coloured red. It is described by Cook under the name of Oheteroa: he says it is not surrounded like the neighbouring islands, by a reef; but he must mean a distant reef.—Toubouai: in Cook's chart (Second Voyage, vol. ii. p. 2) the reef is laid down in a part at the distance of one mile, and in another part at the distance of two miles from the shore; Mr. Ellis (Polynes. Res vol. iii. p. 381) says the low land round the base of the island is very extensive; and this gentleman informs me that the water within the reef appears deep; coloured, 77=RECORD: Darwin, C. R. 1889. The structure and distribution of coral reefs. 3d edition. With a preface to the third edition by Francis Darwin and an appendix by T. G. Bonney. London: Smith Elder and Co., 63782=stumps of others on the beach, where the inhabitants assured us the cocoa-nut could not now grow. Capt. FitzRoy pointed out to me, near the settlement, the foundation posts of a shed, now washed by every tide, but which the inhabitants stated, had seven years before stood above high water-mark. In the calm waters of the lagoon, directly connected with a great, and therefore stable ocean, it seems very improbable that a change in the currents, sufficiently great to cause the water to eat into the land on all sides, should have taken place within a limited period. From these considerations, I inferred, that probably the atoll had lately subsided to a small amount; and this inference was strengthened by the circumstance, that in 1834, two years before our visit, the island had been shaken by a severe earthquake, and by two slighter ones during the ten previous years. If, during these subterranean disturbances, the atoll did subside, the downward movement must have been very small, as we must conclude from the fields of dead coral still lipping the surface of the lagoon, and from the breakers on the western shore not having yet regained the line of their former action. The subsidence must also, have been preceded by a long period of rest, during which the islets extended to their present size, and the living margin of the reef grew either upwards, or as I believe outwards, to its present distance from the beach., 81128=2 Kotzebue's First Voyage, vol. ii. p. 16 Lieut. Nelson, in his excellent memoir in the Geological Transactions (vol. ii. p. 105), alludes to the rocky points mentioned by Kotzebue, and infers that they consist of Serpulæ, which compose incrusting masses on the reefs of Bermudas, as they likewise do on a sandstone-bar off the coast of Brazil, as described by me in the London Phil. Journal, Oct. 1841. I have added my description as a short supplement to the present volume. These masses of Serpulæ hold the same position, relatively to the action of the sea, with the Nulliporæ on the coral-reefs in the Indian and Pacific oceans., 511958=guish on the chart from reefs, I have not coloured the upper part red. Towards the mouth, however, where the water is rather deeper, the islands of Ormuz and Larrack, appear so regularly fringed, that I have coloured them red. There are certainly no atolls in the Persian Gulf. The shores of Immaum, and of the promontory forming the southern headland of the Persian Gulf, seem to be without reefs. The whole S.W. part of Arabia Felix, except one or two small patches, and the shores of Socotra appear from the charts and the memoir of Captain Haines (Geograph.Journ. 1839, p. 125) to be without reefs. I believe there are no extensive coral-reefs on any part of the coasts of India, except on the low promontory of Madura (as already mentioned) in front of Ceylon., 305065=1 I have also made considerable use of the geological part of Berghaus' Physcial Atlas. Beginning at the eastern side of the Pacific, I have added to the number of the volcanos in the southern part of the Cordillera, and have coloured Juan Fernandez according to observations collected during the voyage of the Beagle (Geol. Trans. v. p. 601). I have added a volcano at Albemarle Island, one of the Galapagos Archipelago (see my Journal of Researches, p. 457). In the Sandwich group there are no active volcanos, except at Hawaii; but the Rev. W. Ellis informs me there are streams of lava apparently modern on Maui, having a very recent appearance, which can be traced to the craters whence they flowed. The same gentleman informs me that there is no reason to believe that any active volcano exists in the Society Archipelago; nor are there any known in the Samoa or Navigator group, although some of the streams of lava and craters there appear recent. In the Friendly group, the Rev. J. Williams says (Narrative of Missionary Enterprise, p. 29) that Toofoa and Proby Islands are active volcanoes. I infer from Hamilton's Voyage in the Pandora (p. 95), that Proby Island is synonymous with Onuuafou, but I have not ventured to colour it. There can be no doubt respecting Toofoa; and Captain Edwards (Von Buch, p. 386) found the lava of a recent eruption at Amargura still smoking. Berghaus marks four active volcanos actually within the Friendly group; but I do not known on what authority; I may mention that Maurelle describes Latte as having a burnt-up appearance; I have marked only Toofoa and Armagura. South of the New Hebridges lies Matthews Rock, which is described as an active crater in the voyage of the Astrolabe. Between it and the volcano on the eastern side of New Zealand lies Brimstone Island, which from the high temperature of the water in the crater may be ranked as active (Berghaus Vorbemerk,II. Lief. S. 56). Malte Brun, vol. xii. p. 231, says that there is a volcano near Port St. Vincent, in New Caledonia: I believe this to be an error, arising from smoke seen on the opposite coast by Cook (2nd voyage, vol. ii. p. 23), which smoke went out at night. The Mariana Islands, especially the northern ones, contain many craters (see Freycinet's Hydrog. Descript.) which are not active. Von Bunch, however, states (p. 462), on the authority of La Peyrouse, that there are no less than seven volcanos between these islands and Japan. Gemelli Careri (Chruchill's Collect. vol. iv. p. 458) says there are two active volcanos in lat. 23° 30′ ; and in lat. 24°; but I have not coloured them. From the statements in Beechey's Voyage (p. 518, 4to edit). I have coloured one in the northern part of the Bonin group. M. S. Julien has clearly made out form Chinese manuscripts not very ancient (Comptes Rendus, 1840, p. 832), that there are two active volcanos on the eastern side of Formosa. In the map appended to the first edition I marked an active volcano in Torres Straits, and gave my authority; but Mr. Jukes informs me that there certainly is no volcano there; a wooded island on fire having been mistaken for one. Mr. M'Clelland (Report of Committee for Investigating Coal in India, p. 39) has shown that the volcanic band which passes through Barren Island must be extended northwards. It appears by an old chart, that Cheduba was once an active volcano (see also Silliman's North American Journal, vol. xxxviii. p. 385). In Berghaus' Phys. Atlas, 1840 (No. 7 of Geological Part) a volcano on the coast of Pondicherry is said to have burst forth in 1757. Ordinarie (Hist, Nat. des Volcans, p 218) says that there is one at the mouth of the Persian Gulf, but I have not coloured, it as he gives no particulars. A volcano in Amsterdam, or St. Paul's, in the southern part of the Indian Ocean, has been seen (Naut. Mag. 1838, p. 842) in action. Dr. J. Allan, of Forres, informs me in a letter that, when he was at Joanna, he saw flames at night, apparently volcanic, issuing from the Chief Comoro Island, and that the Arabs assured him that they were volcanic, adding that the volcano burnt more during the wet season: I have marked this as a volcano, though with some hesitation, as the flames may have arisen from gaseous sources., 405824=1 [It is an atoll.—Capt. Wharton. Rose Island has a lagoon six to twelve fathoms deep and an entrance to it of four fathoms. Except two small banks, one supporting a group of trees, it is under water at high tide.—Letter from Prof. Dana to Mr. Darwin, July 21, 1874.], 603855=great quantities of débris, torn from the outer slopes, are constantly carried over the rim of the reef and tend to fill it up. Hence it follows that in a lagoon entirely surrounded by dry land, or nearly so, as is the case at Diego Garcia, the tendency to accumulation of material within the lagoon would be less than in submerged or incomplete atolls, for débris cannot be swept over into the lagoon, and the only constructive agency is the growth of coral. If the power of solution of sea-water is so great, it must be supposed that in complete or nearly complete atolls the lagoon would be deepening rather than shallowing; yet at Diego Garcia the lagoon is obviously shallowing in many places, and has nowhere increased in depth since Captain Moresby's survey in 1837. Indeed, the southern part seems to have shoaled a fathom since that time, and this is the more remarkable, since the S.E. trade winds are by far the most constant and strongest winds there and tend to accumulate material at the northern rather than at the southern end. The fact is, that these winds sweep the sand out of the southern part, and thus leave an area particularly favourably situated for the growth of corals. Mr. Murray points out that larger atolls generally have deeper lagoons than small atolls, and urges this fact in support of his theory; but here again the facts in the Chagos group are against him. Victory Bank is a submerged atoll, the Solomons is an atoll with a large extent of dry land; in each the lagoon attains a depth of 17–18 fathoms, and in Diego Garcia the lagoon, although far larger, does not attain a greater depth. Peros Banhos is far smaller than the Great Chagos Bank, yet in both the lagoons attain nearly the same maximum depth, viz., 41 fathoms for Peros Banhos, 44 fathoms for the Great Chagos Bank. Speaker's Bank is very little larger than Peros Banhos; its lagoon is far shallower, having a maximum depth of 24 fathoms.', 206674=1 Mr. Stutchbury (West of England Journal, No. I. p. 50) has described a specimen of Agaricia, 'weighing 2 lbs. 9 oz., which surrounds a species of oyster, whose age could not be more than two years, and yet is completely enveloped by this dense coral.' I presume that the oyster was living when the specimen was procured; otherwise the fact tells nothing. Mr. Stutchbury also mentions an anchor, which had become entirely encrusted with coral in fifty years; other cases, however, are recorded of anchors having long remained amidst coral-reefs without having become coated. The anchor of the Beagle, in 1832, after having been down exactly one month at Rio de Janeiro, was so thickly coated by two species of Tubularia, that large spaces of the iron were entirely concealed; the tufts of this horny zoophyte were between two and three inches in length. Spallanzani states (Travels, Eng. Translat. vol. iv. p. 313) that in the Mediterranean, the red coral of commerce is usually dredged every ten years, during which time it grows to a height of one foot. It grows, however, at different rates in different places. It has been erroneously attempted to compute the rate to growth of a reef, from the fact mentioned by Captain Beechey of the Chamagigas being embedded in coral rock. But it should be remembered, that some species of this genus invariably live, both whilst young and old, in cavities, which the animal has the power of enlarging with its growth. I saw many of these shells thus embedded in the outer 'flat' of Keeling atoll, which is composed of dead rock; and therefore the cavities in this case had not relation whatever to the growth of coral. M. Lesson, also, speaking of this shell (Partie Zoolog., Voyage de la Coquille), has remarked, 'que constamment ses valves étaient engagées complètement dans la masse des Madrépores.', 380776=The SOCIETY ARCHIPELAGO is separated by a narrow space from the Low Archipelago; and in their parallel direction they manifest some relation to each other. I have already described the general character of the reefs of these encircled islands. In the atlas of the Coquille's Voyage there is a good general chart of the group, and separate plans of some of the islands. Tahiti, the largest island in the group, is almost surrounded, as seen in Cook's chart, by a reef from half a mile to a mile and a half from the shore, with from 10 to 30 fathoms within it. Some considerable submerged reefs, lying parallel to the shore, with a broad and deep space within, have lately been discovered on the N.E. coast of the island, (Naut. Mag. 1836, p. 264,) where none are laid down by Cook. At Eimeo the reef, 'which like a ring surrounds it, is in some places one or two miles distant from the shore, in others united to the beach' (Ellis, Polynesian Researches, vol. i. p. 18, 12mo., 455657=which is generally shallow, even in places where the land seems to be somewhat precipitous, I have not coloured them. Houtman's Abrolhos (lat. 28° S. on west coast) have lately been surveyed by Captain Wickham (as described in Naut. Mag. 1841, p. 511): they lie on the edge of a steeply-shelving bank, which extends about 30 miles seaward, along the whole line of coast. The two southern reefs, or islands, enclose a lagoon-like space of water, varying in depth from 5 to 15 fathoms, and in one spot with 23 fathoms. The greater part of the land has been formed on their inland sides, by the accumulation of fragments of corals; the seaward face consisting of nearly bare ledges of rock. Some of the specimens, brought home by Captain Wickham, contained fragments of marine shells, but others did not; and these closely resembled a formation at King George's Sound, principally due to the action of the wind on calcareous dust, which I have described in my work on Volcanic Islands. From the extreme irregularity of these reefs with their lagoons, and from their position on a bank, the usual depth of which is only 30 fathoms, I have not ventured to class them with atolls, and hence have left them uncoloured.—Rowley Shoals: these lie some way from the N.W. coast of Australia: according to Captain King (Narrative of Survey, vol. i. p. 60), they are of coral-formation. They rise abruptly from the sea, and Captain King found no bottom with 170 fathoms close to them. Three of them are crescent-shaped; a third oval reef of the same group is entirely submerged (Lyell, Principles of Geolog., book iii. chap. xviii.);1 coloured blue.—Scott's Reefs, lying north of Rowley Shoals, are briefly described by Captain Wickham (Naut. Mag., 1841, p. 440) as of great size, of a circular form, and 'with smooth water within, forming probably a lagoon of great extent. There is a break on the western side, where there probably, 481974=informed, any reef.—CEYLON: a space of about 80 miles in length on the south-western and southern shores of these islands has been described by Mr. Twynam (Naut. Mag.1836, pp. 356 and 518); and parts appear to be regularly fringed by coral-reefs, which extend from a quarter to half a mile from the shore. These reefs are in places breached, and afford safe anchorage for the small trading craft. Outside, the sea gradually deepens; there is 40 fathoms about six miles off shore: I have coloured these reefs red. In the published charts of Ceylon, reefs also appear to fringe several parts of the south-eastern shores, coloured red.—At Venloos Bay the shore is likewise fringed. North of Trincomalee there are also reefs of the same character. The sea off the northern part of Ceylon is exceedingly shallow; and therefore I have not coloured the reefs which partially fringe portions of the shores, and the adjoining islets, as well as the Indian promontory of Madura., 453678=ISLANDS NEAR TIMOR.—The account of the following islands is taken from Captain D. Kolff's Voyage in 1825, translated by Mr. W. Earl from the Dutch.—Lette has 'reefs extending along shore at the distance of half a mile from the land.'—Moa has reefs on the S.W. part.—Lakor has a reef lining its shore; these islands are coloured red.—Still more eastward, Luan, differently from the last-mentioned islands, has an extensive reef; it is steep outside, and within there is a depth of 12 feet; from these facts it is impossible to decide to which class this island belongs.—Kissa, off the point of Timor, has its 'shore fronted by a reef, steep too on the outer side, over which small proahs can go at the time of high water;' coloured red.—Timor: most of the points, and some considerable spaces of the northern shore, are seen in Freycinet's chart to be fringed by coral-reefs; and mention is made of them in the accompanying Hydrog. Memoir; coloured red.—Savu, S.W. of Timor, appears in Flinders' chart to be fringed; but I have not coloured it, as I do not know that the reefs are of coral.—Sandalwood Island has, according to Horsburgh (vol. ii. p. 607), a reef on its southern shore, four miles distant from the land; as the neighbouring sea is deep, and generally bold, this probably is a barrier-reef, but I have not ventured to colour it., 4025=CAMBRIDGE: February 28, 1889., 2777=SMITH, ELDER, & CO., 15 WATERLOO PLACE 1889, 605929=Mr. Bourne passes on to consider the opinion expressed by certain authors that the favourable conditions for coral growth in the external slopes of a reef consist in the increased food supply brought by the superficial currents of the ocean. This explanation, for reasons given, he regards as incomplete, being of opinion that the direction and velocity of currents are the most important circumstances. His observations, he states, are confirmed in every particular by those made by Dr. Hickson in Celebes, and communicated by him to the British Association in 1887.1 Mr. Bourne expresses the result of his observations in the following words:—, 163416=3 [Mr. S. J. Whitmee (Nature, August 12, 1875, p. 291) states that in Savaii (Samoan group), one of four examples of islands which Professor Dana brings forward as instances indicating that recent volcanic action has prevented the formation of extensive coral-reefs, the cause is more probably the depth of water on the coast. Moreover, parts of Savaii differ in change of level from the rest of the island, and it is in these (the upheaved regions) that coral-reefs are almost wanting. He also says that after examining 'a good many intertropical islands of the Pacific belonging to the three orders—(1) Volcanic islands with fringing coral-reefs, such as Samoa, the New Hebrides, &c.; (2) Atolls, such as the Low Archipelago, Ellice, Gilbert Islands, &c.; (3) Upraised coral-islands, such as Niuè or Savage Island, part of the Friendly, the Loyalty Islands, &c.'—he has been the more firmly convinced, the further he has gone, of the dorrectness of Mr. Darwin's theory. Mr. R. Webb (Nature, id. p. 475) disputes Mr. Whitmee's statement as to the upheaval of the above-mentioned part of Savaii. (From materials collected by Mr. Darwin.)], 132771=1 The foregoing details are taken chiefly from Flinders' Voyage to Terra Australis, vol. ii. p. 88; but these have been corrected by the account given by Prof. Jukes, Narrative of the Voyage of the Fly, vol. i. 1847, chap. xiii., 423428=SANTA-CRUZ GROUP.—Vanikoro (Fig. 1, Plate I.) offers a striking example of a barrier-reef: it was first described by the Chevalier Dillon, in his Voyage, and was surveyed in the Astrolabe; coloured pale blue.—Tikopia and Fataka Islands appear, from the descriptions of Dillon and D'Urville, to have no reefs: Anouda is a low, flat island, surrounded by cliffs, (Astrolabe, Hydrog. and Krusenstern Mem. vol. ii. p. 432); these are uncoloured.—Toupoua (Otooboa of Dillon) is stated by Captain Tromelin (Annales Marit. 1829, p. 289) to be almost entirely included in a reef, lying at the distance of two miles from the shore. There is a space of three miles without any reef, which, although indented with bays, offers no anchorage from the extreme depth of the water close to the shore. Captain Dillon also speaks, 7138=The late Professor Jukes, in his account of the voyage of H.M.S. Fly, published in 1847, devoted a chapter to the Barrier-Reefs of Australia, and thus concludes: 'After seeing much of the Great Barrier-reefs, and reflecting much upon them, and trying if it were possible by any means to evade the conclusions to which Mr. Darwin has come, I cannot help adding that his hypothesis is perfectly satisfactory to my mind, and rises beyond a mere hypothesis into the true theory of coral-reefs.', 377978=THE LOW OR PAUMOTU ARCHIPELAGO.—This group consists of about 80 atolls: it would be quite superfluous to refer to descriptions of each. In D'Urville and Lottin's chart, one island (Wolchonsky) is written with a capital letter, signifying, as explained in a former chapter, that it is a high island; but this must be a mistake, as the orginal chart by Bellingshausen shows that it is a true atoll. Captain Beechey says of the 32 groups which he examined (of the greater number of which I have seen beautiful MS. charts in the Admiralty), that 29 now contain lagoons, and he believes the other three orginally did so. Bellingshausen (see an account of this Russian voyage, in the Biblioth. des Voyages, 1834, p. 443) says that the 17 islands which he discovered resembled each other in structure, and he has given charts on a large scale of all of them. Kotzebue has given plans of several; Cook and Bligh mention others; a few were seen during the voyage of the Beagle; and notices of other atolls are scattered through several publications. The Actœon group in this archipelago has lately been discovered (Geograph. Journ., vol. vii. p. 454); it consists of three small and low islets, one of which has a lagoon. Another lagoon-island has been discovered (Naut. Mag. 1839, p. 770) in 22° 4′ ; S. and 136° 20′ ; W. Dana, in his work on Corals and Coral Islands, gives a full account of this archipelago. Towards the S.E. there are some islands of a different nature: Elizabeth Island is described by Beechey (p. 46, 4to edit.) as fringed by reefs, at the distance, 409000=Wallis Island, 13° S., 176° W.: a chart and view of this island in Wallis's Voyage (4to edit.) shows that it is encircled.1 A view of it in the Naut. Mag. July 1833, p. 376, shows the same fact. Nine islands, most of them high, are said in Wilkes U.S. Exploring Expedition (vol. ii. p. 157) to be enclosed within the same reef, through which, it is asserted, ships can enter; coloured blue., 545110=FLORIDA.—An account of the reefs on this coast, together with references to various authorities, will be found in Professor Dana's work on Corals and Coral Islands, 1872, p. 204.1, 397352=given some account of it (Remarks, p. 46) from the Hawaiian Spectator; he believes it has lately undergone a small elevation, but his evidence does not appear to me satisfactory; the deepest part of the lagoon is said to be only ten feet; nevertheless, I have coloured it blue.—Fanning Island (4° N., 158° W.), according to Captain Tromelin (Ann. Maritim. 1829, p. 283), is an atoll: his account, as observed by Krusenstern, differs from that given in Fanning's Voyage (p. 224), which, however, is far from clear; coloured blue.—Washington Island (4° N., 159° W.) is engraved as a low island in D'Urville's chart, but is described by Fanning (p. 226) as having a much greatest elevation than Fanning Island, and hence I presume it is not an atoll; not coloured.—Palmyra Island (6° N., 162° W.) is an atoll divided into two parts (Krusenstern's Mem. Suppl. p. 50, also Fanning's Voyage, p. 233); blue.—Smyth's, or Johnston's Islands (17° N., 170° W.): Captain Smyth, R.N., has had the kindness to inform me that they consist of two very low small islands, with a dangerous reef off the east end of them; Captain Smyth does not recollect whether these islets, together with the reef, surrounded a lagoon; uncoloured., 323096=1 Professor Dana also concludes from these facts that the island is subsiding; see Corals and Coral Islands, 1872, p. 330., 141036=1 This fact is stated on the authority of the Officier du Roi, in his extremely interesting 'Voyage à l'Isle de France,' undertaken in 1768. According to Captain Carmichael (Hooker's Bot. Misc., vol. ii. p. 316), on one part of the coast there is a space of sixteen miles without a reef., 162454=1 The mean temperature of the surface sea, from observations made by the direction of Captain FitzRoy on the shores of the Galapagos Islands, between the 16th of September and the 20th of October, 1835, was 68° Fahr. The lowest temperature observed was 58°·5 at the S.W. end of Albemarle Island; and on the west coast of this island, it was several times 62° and 63°. The mean temperature of the sea in the Low Archipelago of atolls, and near Tahiti, from similar observations made on board the Beagle, was (although further from the equator) 77°·5, the lowest any day being 76°·5. Therefore we have here a difference of 9°·5 in mean temperature, and 18° in extremes; a difference doubtless quite sufficient to affect the distribution of organic beings in the two area., 433516=notices collected by Horsburgh, it appears that some of the many islands composing it are high, with a bold outline; and others are low, small, and interlaced with reefs. All the high islands appear to be fronted by distant reefs rising abruptly from the sea, and within some of which, there is reason to believe that the water is deep. I have therefore little doubt that they belong to the barrier class. In the southern part of the group, we have Elisabeth Island, which is surrounded by a reef at the distance of a mile; and two miles eastward of it (Krusenstern, Append. 1835, p. 42) there is a little island containing a lagoon. Near here, also, lies Circular Reef (Horsburgh Direct. Vol. ii. p. 796, 8th edit.), 'three or four miles in diameter, having deep water inside with an opening at the N.N.W. part: the reef on the outside is steep to.' I have from these data, coloured the group pale blue, and Circular Reef dark blue.—The Anachorites, Echequier, and Hermites consist of innumerable low islands of coral formation, which probably are atolls; but not being able to ascertain this, I have not coloured them, nor Durour Island, which is described by Carteret as low., 512797=RED SEA.—My information is chiefly derived from the admirable charts published by the East India Company in 1836, from personal communication with Captain Moresby, one of the surveyors, and from the excellent memoir, 'Ueber die Natur der Corallen-Bänken des Rothen Meeres,' by Ehrenberg. The plains immediately bordering the Red Sea seem to consist chiefly of a sedimentary formation of the newer tertiary period. The shore is, with the exception of a few parts, fringed by coral-reefs. The water is generally profoundly deep close to the shore; but this fact, which has attracted the attention of most voyagers, seems to have no necessary connection with the presence of reefs; for Captain Moresby particularly observed that, in lat. 24° 10′ on the eastern side, there is a piece of coast with very deep water close to it, without any reefs, but not differing in any other respect from the usual coast line. The most remarkable feature in the Red Sea is the chain of submerged banks, reefs, and islands lying some way from the shore, chiefly on the eastern side; the space within being deep enough to admit safe navigation in small vessels. The banks are generally of an oval form, and some miles in width; but, 438069=Lutké (vol. ii. p. 304) seems to have thought that all the low islands, with only one exception, contained lagoons. The most southern island in the group, namely, Piguiram, is not coloured, because I have found no account of it. Nougouor, or Monte Verdison, which was not visited by Lutké, is described and figured by Mr. Bennett (United Service Journal, Jan. 1832) as an atoll. All the before-mentioned islands have been coloured blue. It must, however, be stated that between Ualan and Pouynipète, the three McAskill Islands rise to a height of from 40 to 100 feet, and consist, according to Dana (Corals and Coral Islands, p. 306), of coral-rock; whether they are encircled or fringed by coral-reefs does not seem to be known., 203956=apart on a sand-bank three feet deep at low water. Each portion weighed ten pounds, and was kept in its place by stakes. Similar quantities were placed in a clump and secured as the rest. This was done in December 1830. In July following, each detached mass was nearly level with the sea at low water, quite immovable, and several feet long, stretching, like the parent reef, in the line of the coast-current from north to south. The masses accumulated in a clump were found equally increased, but some of the species in such unequal ratios as to be growing over each other.'1 The loss of Dr. Allan's magnificent collection by shipwreck, unfortunately prevents its being known to what genera these corals belonged; but from the numbers experimented on, it is certain that all the more conspicuous kinds must have been included. Dr. Allan informs me, in a letter, that he believes it was a Madrepora which grew most vigorously. One may be permitted to suspect that the level of the sea might possibly have been somewhat different at the two stated periods; nevertheless, it is quite evident that the growth of the ten-pound masses, during the six or seven months at the end of which they were found to be immovably fixed2 and several feet in length, must have been very great. The fact of the, 558856=consultation with several of his friends (including myself, whom he had asked to aid him in preparing the new edition for the press), accordingly decided to reprint 'The Structure and Distribution of Coral Reefs' from the edition of 1874, subject only to a few press corrections, and to give any important emendations or additions in the form of notes, so arranged as to be easily distinguished from those written by the late author. As regards the extent and amount of the additional matter, we thought that, as the volume was never intended as a text-book for examination purposes, it was needless to endeavour to concentrate within its pages every result of recent work, and it would suffice to call attention to the more important points, which would almost certainly have been noticed by the author in any new edition., 559690=Therefore, from a few papers left by Mr. Darwin, from information kindly supplied by Capt. Wharton and other friends, and from my own reading, I have added a few footnotes to the text, and have given in this appendix a summary of the papers which appeared to me of special importance among those which have been published since 1874. No attempt has been made to compile a bibliography of the literature of 'Coral Reefs.' This was a task, as I told Mr. F. Darwin candidly at the outset, which my previous studies and present occupations would not permit me to undertake, and it was also one which, for the reason above given, seemed to me needless. I believe, however, that I have looked through most of the recent literature, and I have selected therefrom certain papers, in which, as it seemed to me, the arguments for and against Mr. Darwin's theory were stated with considerable fulness. The remainder have been passed over, either because they did not contain original information, or because they would have supplied additional details, on the one side or the other, rather than fresh arguments. In making this selection I have been influenced, 375957=IN the beginning of the last chapter I stated the principles on which the map has been coloured. There only remains to be said, that it is an exact copy of one by M. C. Gressier, published by the Dépôt Général de la Marine, in 1835. The names have been altered into English, and the longitude has been reduced to that of Greenwich. The colours were first laid down on accurate charts, on a large scale. The data, on which the volcanos historically known to have been in action, have been marked with vermilion, were given in a note to the last chapter. I will commence my description on the eastern side of the map, and will describe each group of islands consecutively, proceeding westward across the Pacific and Indian Oceans, and ending with the West Indies., 193284=2 Corals and Coral Islands, 1872, p. 193. See also Mr. Couthouy's pamphlet above referred to.}", "textBeforeTable": "[page] 117 2 I will here record the few facts which I have been able to collect as to the depths, both within and without the tropics, inhabited by 1 [This remark has, by anticipation, a direct bearing on an important part of Mr. Murray's hypothesis. See Appendix II.] the accumulation of small organic bodies into great masses.1 Every fact in geology proclaims that neither the dry land nor the bed of the sea retains the same level for indefinite periods. As well might it be imagined that the British seas would in time become choked up with beds of oysters, or that the numerous small corallines off the inhospitable shores of Tierra del Fuego would in time form a solid and extensive coral-reef.2 [page] 116 I 2 2 Journal of the Royal Geograph. Soc. 1831, p. 218. 1 [The general conclusions of this paragraph do not appear to have been disturbed by recent researches, though Mr. Guppy (Proc. Roy. Soc. Edin. xiii. p. 857, see Appendix II.) argues in favour of the possibility of reefs occasionally beginning to grow at depths of at least 50 fathoms; and in the Reports of the Challenger Expedition (Report on the Reef-building Corals, p. 35) cases of species which build reefs, living at a depth of 40 fathoms, and in two instances even at 70 fathoms, are recorded. Still even here it is admitted that 'the zone of", "textAfterTable": "40 and 57 Chonus Arch. 45° Ditto 48 S. Cruz 50° Eschara 30 Tierra del Fuego 53° Ditto 48 S. Cruz R. 50° Retepora 40 Cape Horn Ditto 100 C. Good Hope 34° Quoy and Gaimard, Ann. Scien. Nat., t. vi. p. 284. Millepora, a strong coral with cylindrical branches, of a pink colour, about two inches high, resembling in the form of its orifices M. aspera of Lamarck 94 and 30 E. Chiloe 43° Tierra del Fuego 53° Coralium 120 Barbary 33° N. Peyssonel, in paper read to Royal Society May, 1752. Antipathes 16 Chonos 45° Gorgonia (or an allied form) 160 Abrolhos, on the coast of Brazil, 18° Capt. Beechey informed me of this fact in a letter. those corals and corallines which we have no reason to suppose ever materially aid in the construction of a reef. Mr. Stokes also showed me a Caryophyllia which was dredged up alive by Captain King from a depth of 80 fathoms off Juan Fernandez, in lat. 33° S. Ellis (Nat. Hist. of Coralline, p. 96) states that Ombellularia was procured in lat. 79° N. sticking to a line from the depth of 236 fathoms; hence this coral either must have been floating loose, or was entangled in a stray line at the bottom. Off Keeling atoll a compound Ascidia (Sigillina) was brought", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}