{"relation": [["Filing Status/Qualification", "Married/Registered Domestic Partner (RDP) filing jointly or qualifying widow(er)", "Single, married/RDP filing separately, or head of household", "Dependent", "Blind", "Age 65 or older"], ["Exemption amount", "$208", "$104", "$321", "$104", "$104"]], "pageTitle": "2012 California Tax Rates and Exemptions | California Franchise Tax Board", "title": "", "url": "https://www.ftb.ca.gov/forms/2012_California_Tax_Rates_and_Exemptions.shtml", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 1, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987866.61/warc/CC-MAIN-20150728002307-00251-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 910352763, "recordOffset": 910336156, "tableOrientation": "HORIZONTAL", "TableContextTimeStampBeforeTable": "{216=The rate of inflation in California, for the period from July 1, 2011, through June 30, 2012, was 1.9%. The 2012 personal income tax brackets are indexed by this amount.}", "TableContextTimeStampAfterTable": "{16715=* If you turn 65 on January 1, 2013, you are considered to be age 65 at the end of 2012.}", "textBeforeTable": "Exemption credits The Mental Health Services Tax Rate is 1% for taxable income in excess of $1,000,000. The AMT rate for individuals is 7% The maximum rate for individuals is 12.3% Individual tax rates 3.5% S corporation bank and financial rate 1.5% S corporation rate 6.65% Alternative Minimum Tax (AMT) rate 10.84% Banks and financials 8.84% Corporations other than banks and financials Tax rate Entity type Corporate tax rates The rate of inflation in California, for the period from July 1, 2011, through June 30, 2012, was 1.9%. The 2012 personal income tax brackets are indexed by this amount. --> this time. We apologize for any inconvenience. We will perform maintenance on our website from 4:00 a.m. to 7:00 a.m., Friday, January 24. You may experience delays or intermittent outages during Attention Contact Us Tax Professionals Businesses Individuals Home Archive Site 2012 California Tax Rates and Exemptions", "textAfterTable": "Phaseout of exemption credits Higher-income taxpayers' exemption credits are reduced as follows: Filing status Reduce each credit by: For each: Federal AGI exceeds: Single $6 $2,500 $169,730 Married/RDP filing separately $6 $1,250 $169,730 Head of household $6 $2,500 $254,599 Married/RDP filing jointly $12 $2,500 $339,464 Qualifying widow(er) $12 $2,500 $339,464 When applying the phaseout amount, apply the $6/$12 amount to each exemption credit, but do not reduce the credit below zero. If a personal exemption credit is less than the phaseout amount, do not apply the excess against a dependent exemption credit. Standard deductions The standard deduction amounts for: Filing status Deduction amount Single or married/RDP filing separately $3,841 Married/RDP filing jointly, head of household, or qualifying widow(er) $7,682 The minimum standard deduction for dependents $950 Reduction in itemized deductions Itemized deductions must be reduced by the lesser of 6% of the excess of the taxpayer's federal AGI over the threshold amount or 80% of the amount of itemized deductions otherwise allowed for the taxable year. Filing status AGI threshold Single or married/RDP filing separately $169,730 Head of household $254,599 Married/RDP filing jointly or qualifying widow(er) $339,464 Nonrefundable Renter's credit This", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}