{"relation": [["Code Y02E", "10/00", "20/00", "30/00", "40/00", "50/00", "60/00", "70/00"], ["Description", "Energy generation through renewable energy sources", "Combustion technologies with mitigation potential", "Energy generation of nuclear origin", "Technologies for efficient electrical power generation, transmission or distribution", "Technologies for the production of fuel of non-fossil origin", "Technologies with potential or indirect contribution to GHG emissions mitigation", "Other energy conversion or management systems reducing GHG emissions"], ["Comment", "Geothermal, hydro, oceanic, solar (PV and thermal), wind", "CHP, CCPP, IGCC, synair, cold flame, etc.", "Fusion and fission", "Reactive power compensation, efficient operation of power networks, etc.", "Biofuels, from waste", "Energy storage (batteries, ultracapacitors, flywheels...), hydrogen technology, fuel cells, etc.", "Synergies among renewable energies, fuel cells and energy storage"]], "pageTitle": "EPO - Technologies durables", "title": "", "url": "http://www.epo.org/news-issues/issues/classification/classification_fr.html", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042992543.60/warc/CC-MAIN-20150728002312-00018-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 430357731, "recordOffset": 430341773, "tableOrientation": "HORIZONTAL", "lastModified": "Tue, 04 Aug 2015 22:27:07 GMT", "textBeforeTable": "This is what the breakdown for a specific energy type looks like (example solar energy): Start searching for sustainable technologies on Espacenet See more details on searching sustainable technologies Updates on Y02 and Y04S Other climate change mitigation areas include Y02B, namely relating to Buildings, including the residential sector, Y02T relating to the Transportation of goods and persons, and Y04S for \"Smart Grids\" technologies, such as remote network operation, smart metering, electric and hybrid vehicles interoperability, and energy trading and marketing. Find out more in our e-learning module The so-called Y02 subclasses include areas related to specific clean energy technologies, namely Y02C (greenhouse gases- capture and storage/sequestration or disposal) and Y02E (greenhouse gases - emissions reduction technologies related to energy generation, transmission or distribution). See the list of all external partners To ensure their relevance, the categories were defined with the help of experts in the field, both from within the EPO and with the help of external partners, including the Intergovernmental Panel on Climate Change (IPCC). The EPO has established a new classification scheme for technical attributes of technologies that can be loosely referred to as climate change mitigation. This makes it easier to retrieve patent document that cover these technologies. Access to patents", "textAfterTable": "Taking solar energy as an example, this is what a specific energy type looks like in the new scheme: Code Y02E Description 10/40 Solar thermal energy 10/41 Tower concentrators 10/42 Dish collectors 10/43 Fresnel lenses 10/44 Heat exchange systems 10/45 Trough concentrators 10/46 Solar-thermal plants for electricity generation, e.g. Rankine, Stirling solar-thermal generators 10/47 Mountings or tracking 10/48 Mechanical power, e.g. thermal updraft 10/50 Photovoltaic (PV) energy 10/52 PV systems with concentrators 10/54 Material technologies 10/54B CuInSe2 material PV cells 10/54D Dye sensitized solar cells 10/54F Solar cells from Group II-VI materials 10/54H Solar cells from Group III-V materials 10/54J", "hasKeyColumn": false, "keyColumnIndex": -1, "headerRowIndex": 0}