{"relation": [["Problem Category", "Tire problems", "Tire Tread/belt problems", "Tire Blowout problems", "Tire Pressure Monitoring System problems", "Tire Sidewall problems", "Tire Bulge problems", "Spare Tire problems"], ["Number of Problems", "25", "6", "6", "2", "1", "1", "1"]], "pageTitle": "Toyota Sequoia Spare Tire Problems", "title": "", "url": "http://www.carproblemzoo.com/toyota/sequoia/spare-tire-problems.php", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989510.73/warc/CC-MAIN-20150728002309-00137-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 352561252, "recordOffset": 352553050, "tableOrientation": "HORIZONTAL", "TableContextTimeStampBeforeTable": "{873=Full size spare tire does not fit over front wheels if vehicle is equipped with the optional trd brake package because the calipers are larger. Toyota states that in the event of a front flat, the solution is to remove a rear tire, place the spare on the rear then remove the flat front tire and replace it with the rear tire. Toyota refused to replace the original spare with one that fits on the front. See all problems of the 2008 Toyota Sequoia.}", "textBeforeTable": "Other Common Tire related problems of Toyota Sequoia Full size spare tire does not fit over front wheels if vehicle is equipped with the optional trd brake package because the calipers are larger. Toyota states that in the event of a front flat, the solution is to remove a rear tire, place the spare on the rear then remove the flat front tire and replace it with the rear tire. Toyota refused to replace the original spare with one that fits on the front. See all problems of the 2008 Toyota Sequoia. Failure Date: 10/15/2008   Spare Tire problem of the 2008 Toyota Sequoia 1 Toyota Sequoia owners have reported 1 problem related to spare tire (under the tire category). (adsbygoogle = window.adsbygoogle || []).push({}); Spare Tire Problems of Toyota Sequoia ﻿ Spare Tire » Tire » Sequoia » Toyota", "textAfterTable": "﻿ Related: Toyota Sequoia Overview Toyota Sequoia Service Bulletins Toyota Sequoia Safety Recalls ©2015, CarProblemZoo.com All rights reserved. Contact • Privacy • Reference Fuel Economy Most Improved Crash Report Recalls Bulletins", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}