{"relation": [["Patient Ratings", "Ease of Appointment", "Promptness", "Courteous Staff", "Accurate Diagnosis", "Bedside Manner", "Spends Time with Me", "Follows Up After Visit"], ["", "3.3", "2.3", "3.3", "1.9", "2.0", "3.0", "1.9"]], "pageTitle": "Dr. Daniel Bradford, MD - Family Practitioner in Riverside, CA", "title": "", "url": "http://www.vitals.com/doctors/Dr_Daniel_J_Bradford.html", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042991076.30/warc/CC-MAIN-20150728002311-00266-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 811333243, "recordOffset": 811307934, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{32684=Copyright © 2015 Vitals. US Patent No. 8, 694, 441. All Rights Reserved.}", "lastModified": "Sun, 02 Aug 2015 17:05:24 GMT", "textBeforeTable": "The overall average patient rating of Dr. Daniel Bradford is Good. Dr. Bradford has been reviewed by 12 patients who have provided 2 comments. The rating is 3.5 out of 5 stars. (2) Patient comments (12)   3.5 Read patient reviews Patient Reviews View full profile Insurance accepted (32) Map & directions (2) Address & phone number (2) Areas of expertise What's important to you Awards & distinctions Patient reviews (2) Medical school rankings Hospital details & ratings (3) Qualifications View the full profile to get information on: Learn more about Dr. Daniel Bradford: A medical license is required for a doctor to practice medicine in a particular state. Requirements vary by state but most require, at a minimum, post-graduate training in the doctor’s specific specialty. An NPI number is a national identifier unique to an individual health care provider and is managed by the Center for Medicare & Medicaid Services (CMS). License & Identifications }); window.app.advert.display('skyscraper');", "textAfterTable": "Prepare before visiting Dr. Bradford Influenza Patient Education Learn all about influenza and common symptoms of the flu as well as treating this type of viral infection. Before Visiting Dr. Bradford Learn More More Patient Guides & Topics Binge-Eating Disorder Birth Control Diabetes Diabetic Macular Edema Eating Disorders Food Allergies GERD Gout Home Allergies Insomnia Intrauterine Devices (IUD) Lyme Disease Menopause Restless Leg Syndrome Seasonal Allergies Sinusitis", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}