{"relation": [["Amend:", "§ 646.141 (section heading)", "§ 646.142", "§ 646.143 (introductory text)", "§ 646.146", "§ 646.146", "§ 646.147(a) (introductory text)", "§ 646.147(b)", "§ 646.150(a)", "§ 646.153 (introductory text)", "§ 646.154(b)"], ["By removing the reference to:", "Subpart", "Subpart", "Subpart", "Subpart", "§ 46.147", "§ 46.143", "§ 46.143", "§§ 46.146 and 46.147", "§§ 46.146 through 46.147", "Subpart"], ["And adding in its place:", "Part.", "Part.", "Part.", "Part.", "§ 646.147.", "§ 646.143.", "§ 646.143.", "§§ 646.146 and 646.147.", "§§ 646.146through 646.147", "Part."]], "pageTitle": "Federal Register | Reorganization of Title 27, Code of Federal Regulations", "title": "Amendment Table for Part 646 Back to Top", "url": "https://www.federalregister.gov/articles/2003/01/24/03-1657/reorganization-of-title-27-code-of-federal-regulations", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 13, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042981525.10/warc/CC-MAIN-20150728002301-00103-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 899256655, "recordOffset": 899224227, "tableOrientation": "HORIZONTAL", "TableContextTimeStampBeforeTable": "{20353=Draft Recommended Aquatic Life Ambient Water Quality Chronic Criterion for Selenium-Freshwater 2015, 26664=A Rule by the Environmental Protection Agency on 07/27/2015}", "TableContextTimeStampAfterTable": "{53164=Posted by Ben Jordi on June 4, 2015, 53832=Posted by Ben Jordi on June 1, 2015, 53224=On June 2, 2015, the Office of the Federal Register (OFR) hosted its 3rd Annual Federal Register Liaison Conference in the National Archives’ McGowan Theater. What exactly is a Federal... Continue reading →, 209157=18 U.S.C. 2341-2346, unless otherwise noted., 131028=This final rule is not a significant regulatory action as defined in Executive Order 12866. Accordingly, this final rule is not subject to the analysis this Executive Order requires., 212379=Dated: January 15, 2003., 52525=Posted by Ben Jordi on June 22, 2015, 81305=Section 1111 of the Homeland Security Act further provides that the Bureau will retain its identity as a distinct entity within the Department of Justice known as the Bureau of Alcohol, Tobacco, Firearms, and Explosives (ATF). The functions retained by the Department of the Treasury are the responsibility of a new Alcohol and Tobacco Tax and Trade Bureau (TTB). The split of the Bureau's functions takes effect on January 24, 2003., 212786=[FR Doc. 03-1657 Filed 1-23-03; 8:45 am], 79644=This rule is effective on January 24, 2003., 212182=Dated: January 14, 2003., 80540=On November 25, 2002, the President signed into law the Homeland Security Act of 2002, Pub. L. No. 107-296, 116 Stat. 2135 (2002). Under title XI, subtitle B, section 1111 of the Act, the “authorities, functions, personnel, and assets” of the Bureau of Alcohol, Tobacco and Firearms, Department of the Treasury (the Bureau), are transferred to the Department of Justice, with the exception of certain enumerated authorities that are retained by the Department of the Treasury. The authorities retained by the Secretary of the Treasury include the administration and enforcement of chapters 51 and 52 of the Internal Revenue Code, sections 4181 and 4182 of the Internal Revenue Code, and title 27 of the United States Code., 147382=22 U.S.C. 2778., 73871=The Homeland Security Act of 2002 divides the Bureau of Alcohol, Tobacco and Firearms, Department of the Treasury, into two separate agencies, the Bureau of Alcohol, Tobacco, Firearms, and Explosives (ATF) in the Department of Justice, and the Alcohol and Tobacco Tax and Trade Bureau (TTB) in the Department of the Treasury. These changes require reorganization of title 27 of the Code of Federal Regulations. This final rule renames chapter I, establishes a new chapter II in 27 CFR, and removes certain regulations from chapter I and recodifies them in the new chapter II., 212594=Dated: January 21, 2003., 129420=The provisions of the Paperwork Reduction Act of 1995, Public Law 104-13, 44 U.S.C. chapter 35, and its implementing regulations, 5 CFR part 1320, do not apply to this final rule because there are no new or revised recordkeeping or reporting requirements.}", "textBeforeTable": "The following are derivation tables for each of these recodified parts: Part 179, Machine Guns, Destructive Devices, and Certain Other Firearms, which becomes part 479. Part 178, Commerce in Firearms and Ammunition, which becomes part 478; and Part 55, Commerce in Explosives, which becomes part 555; Part 47, Importation of Arms, Ammunition and Implements of War, which becomes part 447; Part 46, Subpart F—Distribution of Cigarettes, which becomes part 646; As noted, this final rule removes four existing parts and one existing subpart in 27 CFR concerning firearms, ammunition, explosives, and contraband cigarettes from chapter I and recodifies them in the new chapter II. These are: This final rule does not make any changes to the current requirements of the regulations in 27 CFR. It merely divides the Bureau's current regulations between the new TTB and ATF. In the near future, TTB and the Department of Justice will individually make the necessary technical corrections to their regulations required by the division of the Bureau into the two new bureaus. This may include changes to agency names and addresses, agency acronyms, Web site addresses, delegation order numbers, position titles, and cross references within the regulations. Title 27, Code of Federal Regulations (27 CFR), currently contains one chapter titled “Chapter I—Bureau of Alcohol, Tobacco and Firearms, Department of the Treasury.” Since the Act divides", "textAfterTable": "447.35 47.35 Subpart E   447.41 47.41 447.42 47.42 447.43 47.43 447.44 47.44 447.45 47.45 447.46 47.46 Subpart F   447.51 47.51 447.52 47.52 447.53 47.53 447.54 47.54 447.55 47.55 447.56 47.56 447.57 47.57 447.58 47.58 Subpart G   447.61 47.61 447.62 47.62 447.63 47.63 Derivation Table for Part 478 Back to Top The requirements of section: Are derived from section: Subpart A   478.1 178.1 478.2 178.2 Subpart B   478.11 178.11 Subpart C   478.21 178.21 478.22 178.22 478.23 178.23 478.24 178.24 478.25 178.25 478.25a 178.25a 478.26 178.26 478.27 178.27 478.28 178.28", "hasKeyColumn": false, "keyColumnIndex": -1, "headerRowIndex": 0}