{"relation": [["Dec-2008", "Dec-22-2008", "Dec-19-2008", "Dec-19-2008", "Dec-16-2008", "Dec-15-2008", "Dec-12-2008", "Dec-4-2008", "", "Nov-2008", "Nov-26-2008", "Nov-25-2008", "Nov-24-2008", "Nov-21-2008", "Nov-17-2008", "Nov-14-2008", "Nov-10-2008", "", "Oct-2008", "Oct-31-2008", "Oct-31-2008", "Oct-31-2008", "Oct-30-2008", "Oct-29-2008", "Oct-28-2008", "Oct-20-2008", "Oct-15-2008", "Oct-8-2008", "Oct-7-2008", "Oct-6-2008", "Oct-3-2008", "Oct-2-2008", "Oct-2-2008", "", "Sep-2008", "Sep-29-2008", "Sep-29-2008", "Sep-29-2008", "Sep-26-2008", "Sep-25-2008", "Sep-24-2008", "Sep-18-2008", "Sep-16-2008", "Sep-12-2008", "Sep-10-2008", "Sep-9-2008", "Sep-5-2008", "Sep-5-2008", "Sep-5-2008", "Sep-4-2008", "", "Aug-2008", "Aug-28-2008", "Aug-25-2008", "Aug-22-2008", "Aug-21-2008", "Aug-21-2008", "Aug-20-2008", "Aug-18-2008", "Aug-18-2008", "Aug-18-2008", "Aug-15-2008", "Aug-15-2008", "Aug-14-2008", "Aug-14-2008", "Aug-13-2008", "Aug-12-2008", "Aug-12-2008", "Aug-12-2008", "Aug-12-2008", "Aug-8-2008", "Aug-7-2008", "Aug-7-2008", "Aug-1-2008", "", "Jul-2008", "Jul-31-2008", "Jul-25-2008", "Jul-24-2008", "Jul-23-2008", "Jul-21-2008", "Jul-18-2008", "Jul-17-2008", "June 11-2008", "Jul-11-2008", "Jul-9-2008", "Jul-8-2008", "Jul-7-2008", "Jul-3-2008", "", "Jun-2008", "Jun-27-2008", "Jun-27-2008", "Jun-26-2008", "Jun-25-2008", "Jun-23-2008", "Jun-23-2008", "Jun-19-2008", "Jun-18-2008", "Jun-16-2008", "Jun-13-2008", "Jun-12-2008", "Jun-11-2008", "Jun-11-2008", "Jun-9-2008", "Jun-9-2008", "Jun-6-2008", "Jun-6-2008", "Jun-4-2008", "", "May-2008", "May-23-2008", "May-20-2008", "May-19-2008", "May-19-2008", "May-19-2008", "May-19-2008", "May-16-2008", "May-15-2008", "May-15-2008", "May-15-2008", "May-14-2008", "May-14-2008", "May-13-2008", "May-13-2008", "May-13-2008", "May-6-2008", "May-5-2008", "May-5-2008", "May-5-2008", "", "Apr-2008", "Apr-28-2008", "Apr-25-2008", "Apr-24-2008", "Apr-24-2008", "Apr-24-2008", "Apr-23-2008", "Apr-22-2008", "Apr-17-2008", "Apr-16-2008", "Apr-15-2008", "Apr-10-2008", "Apr-9-2008", "Apr-8-2008", "Apr-7-2008", "Apr-7-2008", "Apr-4-2008", "", "Mar-2008", "Mar-31-2008", "Mar-28-2008", "Mar-19-2008", "Mar-19-2008", "Mar-14-2008", "Mar-14-2008", "Mar-14-2008", "Mar-7-2008", "Mar-7-2008", "Mar-6-2008", "", "Feb-2008", "Feb-26-2008", "Feb-20-2008", "Feb-19-2008", "Feb-19-2008", "Feb-14-2008", "Feb-8-2008", "", "Jan-2008", "Jan-24-2008", "Jan-24-2008", "Jan-23-2008", "Jan-22-2008", "Jan-18-2008", "Jan-15-2008", "Jan-11-2008", "Jan-7-2008", "Jan-7-2008", "Jan-7-2008", "Jan-5-2008", "Jan-4-2008", "Jan-4-2008", "Jan-2-2008", "Jan-2-2008", "Jan-2-2008", ""], ["", "DES Workshop on the Comprehensive Shoreland Protection Act Workshop to be held in Portsmouth, Wednesday, January 21, 2009", "New Federal/State Requirements for Biodiesel", "New Hampshire CO2 Allowance Auction Goes Smoothly Auction Nets Over $4 million for NH Energy Efficiency Programs", "Public Service Announcement Take Steps to Prevent Plumbing Pipes from Freezing", "New Hampshire to Auction Carbon Allowances as part of Regional Greenhouse Gas Initiative", "New Hampshire Climate Change Policy Task Force Meeting Monday, December 15, 9 a.m. to 2 p.m. at NH Audubon in Concord", "Eliminating the Risk of Carbon Monoxide Poisoning in your Home Public Service Announcement by Commissioner Burack included", "", "", "New Hampshire Coastal Program Accepting Grant Applications", "NH Designated Rivers Local River Management Advisory Committees (LACs) Win the 2008 Spirit of New Hampshire Volunteer Service Award", "DES Announces Reporting Requirement for Geothermal Well Data", "November 2008 Capital Region Food Program Distribution Benefits From NH Department Of Environmental Services Food Drive", "DES Reminds Public of New Pool and Spa Safety Rules", "DES Announces New Members of Aspiring Leaders Program Program Promotes Environmental Leadership", "New Hampshire Climate Change Policy Task Force Meeting Friday November 21, 8 a.m. to 2:30 p.m. at NH Audubon in Concord", "", "", "Public Hearing Notice: The New Hampshire Guidelines for Coordinated Lake Management and Shoreland Protection Plans Public Hearing on November 18 in Manchester", "New Sustainable Land Use Planning Handbook Available Innovative Development Guidance for Cities and Towns", "DES Seeks Input on Thermostat Recycling Plan Comments Due November 14, 2008", "Governor Lynch Recognizes Winners of 2008 Governor's Award for Pollution Prevention Anheuser-Busch Inc. Merrimack brewery and Southeastern Container Inc. of Hudson, are the 2008 recipients of the prestigious award", "Department of Justice Superior Court Orders Windsor man to pay $100,000 in penalties for violating the Groundwater Protection Act and oil discharge laws", "DES and BIA to Host Water Symposium Daylong symposium on Nov. 18 will feature presentations from EPA Regional Administrator Robert Varney and DES Commissioner Tom Burack.", "Climate Change Policy Task Force Wants to Hear From You! New Actions Items Under Consideration", "Attend the 2008 Watershed Conference", "DES Announces Solid Waste Disposal Tonnages and Recycling Rates for Municipalities", "New Hampshire Climate Change Policy Task Force Meeting Friday October 10, 9 a.m. to 4 p.m. at Plymouth State University", "Public Information Meeting: DES and DHHS to Discuss Findings of Health Consultation and Cancer Incidence for the Town of Bethlehem", "Public Hearing Notice: The New Hampshire Guidelines for Coordinated Lake Management and Shoreland Protection Plans Public Hearing on October 21 in Strafford", "DES and USGS complete stream gage installations for 2008 Stream gages provide essential data for managing New Hampshire's water resources", "DES accepting grant applications from municipalities and nonprofit public water suppliers to protect critical water supply lands", "", "", "DES Workshop on the Comprehensive Shoreland Protection Act Workshop Wednesday, October 8, 2008 in West Lebanon", "2008 Governor’s Award for Pollution Prevention Honorable Mention Awards Companies from Durham, Lincoln, Londonderry and Manchester Honored", "RGGI States’ First CO2 Auction Off to a Strong Start", "Public Listening Sessions on Climate Change Action Plan - September 29 in Gorham Sites in Conway and Lincoln tied to the meeting via Interactive Video", "US Environmental Protection Agency EPA Awards New Hampshire $492,200 for Clean Diesel Projects Part of Nearly $2.4 Million State and Federal Grants Funded Across New England", "Public Listening Sessions on Climate Change Action Plan – September 25 in Keene and Lebanon", "New Hampshire Volunteers Participate in Worldwide Beach Cleanup", "Public Listening Session on Climate Change Action Plan – September 18 in Manchester", "DES Reminds Residents of Licensing Requirement for Water Well Contractors and Pump Installers", "New Hampshire Climate Change Policy Task Force To Hold Public Listening Sessions on New Hampshire Climate Change Action Plan", "Public Hearing Notice: The New Hampshire Guidelines for Coordinated Lake Management and Shoreland Protection Plans", "New Hampshire Climate Change Policy Task Force Meeting", "State Announces Its 2008 Fall Drawdown of Lakes", "DES Signs Partnership Agreement with Breathe New Hampshire", "State Issues Cyanobacteria Warning for Phillips Pond, Sandown", "", "", "John J. Paonessa Company, Inc. Agrees to Pay $2,965 for Air Pollution Violations", "State Issues Cyanobacteria Warning for Showell Pond, Sandown", "State Issues Cyanobacteria Warning for Lake Monomonac, Rindge", "Merrimack Village Dam Removal Celebrated", "State Issues Cyanobacteria Warning for Hunkins Pond, Sanbornton", "FEMA Issues Final Report: Independent Evaluation of Recent Flooding in New Hampshire", "Pepperweed Patrol Preventing Northward Spread of Invasive Plant", "Preventing and Dealing with Mold after Heavy Rains", "State Issues Cyanobacteria Warning for Country Pond, Kingston", "State Issues Cyanobacteria Warning for Webster Lake, Franklin", "State Issues Cyanobacteria Advisory for French Pond, Henniker", "DES Recognizes Epping Auto Salvage for Environmental Achievement", "New Isinglass River Management Plan Completed", "US Environmental Protection Agency EPA Provides $201,450 for Environmental Monitoring of New Hampshire Shoreline Beaches", "Media Advisory Merrimack Village Dam Removal Ceremony, August 21", "State Issues Cyanobacteria Warning for Mirror Lake, Tuftonboro", "New Law in Effect Regarding Outdoor Wood Boilers", "State Issues Cyanobacteria Warning for Forest Lake, Winchester", "DES Announces New Members of Aspiring Leaders Program", "Public Hearing Notice The New Hampshire Guidelines for Coordinated Lake Management and Shoreland Protection Plans – Laconia", "Public Hearing Notice The New Hampshire Guidelines for Coordinated Lake Management and Shoreland Protection Plans – Dover", "Public Hearing Notice Nomination of the Ammonoosuc River, Upper Reach into the New Hampshire Rivers Management and Protection Program", "", "", "New Hampshire Climate Change Policy Task Force Meeting", "Environmental Services Offers Guidance in Storm Damaged Areas", "DES and Ski NH Sign Partnership Agreement", "State Issues Cyanobacteria Warning for Halfmoon Pond-Kingston", "Department of Justice Luminescent Systems-Inc. to Pay $90,000 Environmental Penalty", "DES-DHHS and NH Fish and Game Issue Lobster Tomalley Advisory", "State Declares Air Quality Action Day", "ASAP Auto Salvage Ordered to Shut Down and Clean Up", "New Hampshire’s First Dam Removal for 2008 Begins", "Upcoming Workshop Focuses on Greener Ski Resorts", "DES Workshop on the Comprehensive Shoreland Protection Act", "State Declares Air Quality Action Days", "DES Recognizes Ponderosa Salvage for Environmental Achievement", "", "", "State Issues Cyanobacteria Warning for Winnisquam Lake", "What the heck join the Secchi Dip-in", "DES to Defer Final Decision on Lower Liberty Hill Road-Gilford Remedial Action Plan Addendum", "New Durham First Community in New Hampshire to Pass Ordinance Based on Land Conservation Plan", "DES funds effort to update the 1989 Lower Merrimack River Corridor Management Plan", "Nomination of the Cocheco River into the New Hampshire Rivers Management and Protection Program", "New Hampshire – Maine Port Partners Conduct Area Exercise", "DES Seeks Input on Brownfields Identification and Selection Process", "Join the Pepperweed Patrol", "Granite State Clean Cities Coalition and Oyster River School District Announce Successful Biodiesel Project", "Independent Evaluation of Recent Flooding in New Hampshire", "Office of the Governor Governor Lynch Signs Law Joining Regional Greenhouse Gas Initiative", "DES Pollution Prevention Program Releases Updated Version of Planning for Profits… A Guide to Pollution Prevention for NH Businesses", "State Declares Air Quality Action Day", "DES and EPA Team up with Local Volunteers and Municipalities to Improve the Water Quality in the Souhegan River and Furnace Brook", "State Declares Air Quality Action Days", "The Rivers Management and Protection Program Turns Twenty!", "DES Announces Natural Mean High Water Elevation of Silver Lake in Tilton/Belmont", "", "", "Boaters Urged to Help Protect the Waterbodies They Use", "Formal collaboration against invasive plant species begins New Group takes root in our coastal watershed View the Partnership Agreement", "In Recognition of Achievements In Employee Safety-Alice Peck Day Health Systems Receives Prestigious SHARP Certification Renewal", "DES to participate in survey of nation’s rivers and streams", "DES Brownfields Program Awards Brownfields Cleanup Grant of $200,000 to City of Nashua", "Final Public Informational Meeting Suncook River Geomorphology-based Alternatives Study", "DES Brownfields Program Awards Brownfields Cleanup Grant of $200,000 to Tri-County Community Action Program-Inc.", "DES Workshop on the Comprehensive Shoreland Protection Act", "Deadline for NHPPP Governor’s Award is fast approaching", "Partners to Launch Formal Collaboration Against Invasive Plant Species", "New Hampshire Climate Change Policy Task Force Meeting", "Opinion/Editorial Test your well water for known health risks Tom Burack-New Hampshire Department of Environmental Services Commissioner", "Opinion/Editorial RGGI is good for New Hampshire Tom Burack-New Hampshire Department of Environmental Services Commissioner", "Media Advisory Clean Water Week Celebration", "Workshop Offered for Volunteers Interested in Lake Monitoring", "Media Advisory DES To Award Brownfields Cleanup Grants to the City of Lebanon Tri-County Community Action Program-Inc. and the City of Nashua", "Enactment of Changes to Comprehensive Shoreland Protection Act Effective July 1-2008 instead of April 1-2008", "Volunteers Brave Stormy Weather to Cleanup Cain’s Brook", "Drinking Water Week is May 4-10", "", "", "Air Quality Awareness Week-April 28 to May 2", "New Hampshire Fish Consumption Guidelines Updated", "2007 Volunteer River Assessment Program Reports Now Available Online", "DES Announces First Members of Aspiring Leaders Program", "2008 Training Workshops Offered for Volunteers Interested in River Monitoring", "April Vacation Volunteers needed for Brook Clean-up", "United States Environmental Protection Agency New Hampshire Citizens Receive Earth Day Honors with Prestigious Regional EPA Environmental Award", "DES extends public comment period for Lower Liberty Hill Road Remedial Action Plan Addendum", "Earth Day Opinion/Editorial \"Take a Hike-Game Boy!\" Thomas S. Burack-Department of Environmental Services Commissioner", "Ace Hardware and DES Partner on Free Lamp Recycling", "DES and NH Association of Regional Planning Commissions Sign Partnership Agreement", "DES hosts Public Meeting regarding the Public Health Assessment for Liberty Hill Road", "Department of Justice New Hampshire to Receive $1.2 Million from Clean Air Act Settlement", "United States Environmental Protection Agency Three Brownfields Grants Awarded in New Hampshire // Part of nearly $10 Million Funded Across New England", "DES Establishes Protected Instream Flows for the Souhegan River", "Fish and Game Department Bring the Family to Discover WILD New Hampshire Day-April 26-2008", "", "", "DES to implement the revised Comprehensive Shoreland Protection Act April 1-2008 Pending Legislation May Change Effective Date", "It’s Lights Out New Hampshire!", "Office of the Governor Gov. Lynch Commends House Passage of Bill Allowing New Hampshire to Join Regional Greenhouse Gas Initiative", "DES Wants to Know About Your Earth Day Events DES Webpage Provides List of Earth Day Events", "New Hampshire Department of Environmental Services and US Army Corps of Engineers sign New Hampshire In-Lieu Fee Agreement Program balances growth with natural resource conservation", "Public Informational Meeting Suncook River Geomorphology-based Alternatives Study Epsom Central School, 282 Black Hall Rd, Epsom, NH Wednesday, March 26, 2008 from 5:30 to 9:00 p.m.", "DES Seeks Strategic Planning Input from Public Public asked to complete short online survey by April 7th", "Workshop to Help Auto Salvage Yards Be Environmentally Responsible", "Workshops about Auto Salvage Yard Licensing", "Public Meeting Announcement Independent Evaluation of Recent Flooding in New Hampshire Second Public Information Meeting to be held on March 18, 2008 in Bedford", "", "", "Apply for the 2008 Governor’s Award for Pollution Prevention", "Star Island Corporation Agrees to Pay $3,200 for Air Pollution Violations", "Fish and Game Department Have a Wild Time at Discover WILD New Hampshire Day Events Calendar Notice for Saturday-April 26", "DES Accepts North Country Environmental Services provides Waste Control Evaluation Report", "New Hampshire Climate Change Action Plan Public Listening Session", "Department of Justice Court Rejects Federal Mercury Rules", "", "", "Auto Salvage Yard Environmental Compliance Training", "Auto Salvage Yard Licensing Workshops for Municipalities", "Attend DES and NH Marine Trades Association Workshop", "City Of Rochester Agrees To Pay $12,500 Fine For Burning Down Four Buildings", "Governor Lynch Kick’s Off First Meeting of Climate Change Policy Task Force", "State Launches Climate Change Web Portal", "Cranmore Mountain Resort Recognized for Going Green State Announces Reductions in Greenhouse Gases", "State Declares Air Quality Action Day Unhealthy Air Pollution Levels Predicted to Continue into Tuesday", "Cranmore Mountain Resort Recognized for Going Green State Announces Reductions in Greenhouse Gases", "MEDIA ADVISORY Cranmore Mountain Resort Leads NH Ski Industry in Greenhouse Gas Reduction Activities Media Event Highlights Biodiesel Weekend January 11, 2008 – 10:00 a.m.", "State Declares Air Quality Action Day Unhealthy Air Pollution Levels Predicted for Sunday and Monday", "January is National Radon Awareness Month", "Weather-Related Public Service Announcement \"Snow & Ice Can Damage Fuel Storage Tanks\"", "Nylon Corporation of America agrees to pay $5,400 for Air Pollution Violations", "MtBE Widespread in New Hampshire’s Groundwater", "PUBLIC NOTICE Draft Total Maximum Daily Load Studies For Chlorides in Waterbodies in the Vicinity of the I-93 Corridor from Massachusetts to Manchester-NH Available for Public Comment PUBLIC COMMENT PERIOD Jan-2-2008 to Jan-31-2008", ""]], "pageTitle": "Press Releases 2008 - Media Center - NH Department of Environmental Services", "title": "", "url": "http://des.nh.gov/media/pr/2008/index.htm", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 2, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042981753.21/warc/CC-MAIN-20150728002301-00168-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 62424231, "recordOffset": 62405807, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{2449=| December | November | October | September | August | July | June| May | April | March | February | January |}", "lastModified": "Wed, 17 Jun 2015 15:47:03 GMT", "textBeforeTable": "| December | November | October | September | August | July | June| May | April | March | February | January | Archived Press Releases Archive 2008 Press Releases Press Releases > Media Center > DES Home >   Commissioner's Office Air Resources Division Waste Management Div. Water Division Boards and Committees The Department Media Center Home Press Releases In The News Featured Publications Audio/Video/Podcasts Surveys/Polls Commissioner Speeches eNews Signup Contact Us Media Center", "textAfterTable": "    Adobe Acrobat Reader format. Download a free reader from Adobe. NH Department of Environmental Services | 29 Hazen Drive | PO Box 95 | Concord, NH 03302-0095 (603) 271-3503 | TDD Access: Relay NH 1-800-735-2964 | Hours: M-F, 8am-4pm NH.gov | privacy policy | accessibility policy copyright 2014. State of New Hampshire", "hasKeyColumn": false, "keyColumnIndex": -1, "headerRowIndex": 0}