{"relation": [["Grade Last Tested", "3", "4", "5", "6", "7", "8", "11"], ["Scores used in Growth Model Calculation", "Actual Grade 3 Scores", "Projected Scores in Grade 6", "Projected Scores in Grade 7", "Projected Scores in Grade 8", "Projected Scores in Grade 8", "Projected Scores in Grade 11", "Actual Grade 11 Scores"]], "pageTitle": "Pennsylvania Dept of Education - Academic Achievement Report", "title": "", "url": "http://paayp.emetric.net/District/Educators/c6/114068103?schoolID=", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 1, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989790.89/warc/CC-MAIN-20150728002309-00041-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 181031894, "recordOffset": 181015946, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{11823=TWIN VALLEY SD met all AYP Measures (Graduation, Attendance, Academic Performance, and Test Participation) in 2011-12. This is good news! This district/LEA is on track to meet the goal of all students reaching proficiency., 17964=Well done! This district/LEA has performed well this year, and appears to be on track to meet the goal of all students attaining proficiency in Reading and Math by the year 2014.}", "textBeforeTable": "The Growth Model recognizes the efforts of schools and districts/LEAs whose students have not achieved proficiency but are on trajectories towards proficiency on future PSSA exams. The Growth Model will be calculated for Performance Indicators (i.e., the all student group and up to nine subgroups). Projected scores are calculated for all students - including students who are proficient. If a projected score cannot be calculated for a particular student, the studentâ\u0080\u0099s actual score is used. The Growth Model will be applied to an AYP Performance Indicator only if the indicator cohort has not met AYP performance by any of the existing goals or targets. Actual, not projected, PASA scores, PSSA-M scores, 3rd grade scores, and 11th grade scores are always used, as well as the scores for any students with insufficient data points to make a projection. Did this district/LEA meet any AYP measures through the Growth Model? Top Grades 6-8 Reading Performance of the Economically Disadvantaged student group. Grades 6-8 Mathematics Performance of the IEP-Special Education student group. Grades 6-8 Reading Performance of the IEP-Special Education student group. Grades 3-5 Reading Performance of the IEP-Special Education student group. Grades 3-5 Reading Performance of the White non-Hispanic student group. Grades 3-5 Reading Performance of the Students Overall group. For TWIN VALLEY SD, the Safe Harbor targets for test performance were met in: Safe", "textAfterTable": "TWIN VALLEY SD met AYP measures by the Growth Model in: Grades 3-5 Mathematics Performance of the IEP-Special Education student group. Grades 3-5 Reading Performance of the Economically Disadvantaged student group. Grades 3-5 Mathematics Performance of the Economically Disadvantaged student group. Top Did this district/LEA meet any AYP measures through the appeals process? When initial AYP results are announced each year, schools and districts/LEAs have the opportunity to review the data that is utilized to determine AYP and request changes through the Bureau of Assessment and Accountability to correct any errors. Also, schools and districts/LEAs have the opportunity to appeal the AYP rulings through the Pennsylvania Department of Education if they believe their AYP identification was in error for statistical or other substantive reasons. Since all test performance targets/goals to meet AYP were met by TWIN VALLEY SD, appeals were not applicable. Top What does this report mean for TWIN VALLEY SD? Well done! This district/LEA has performed well this year, and appears to be on track to meet the goal of all students attaining proficiency in Reading and Math by the year 2014. This district/LEA may wish to review its improvement strategies and create an improvement plan to continue to meet AYP next year.", "hasKeyColumn": true, "keyColumnIndex": 1, "headerRowIndex": 0}