{"relation": [["Application", "WB", "ELISA", "IHC-P", "ICC/IF", "IHC"], ["Abreviews", "", "", "", "", ""], ["Notes", "1/500 - 1/1000. Detects a band of approximately 190 kDa (predicted molecular weight: 151 kDa).", "1/20000.", "Use at an assay dependent concentration.", "1/100.", "Use at an assay dependent concentration. ab171870-Rabbit polyclonal IgG, is suitable for use as an isotype control with this antibody."]], "pageTitle": "Anti-VEGF Receptor 2 (phospho Y951) antibody (ab38473) | Abcam", "title": "", "url": "http://www.abcam.com/VEGF-Receptor-2-phospho-Y951-antibody-ab38473.html", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987628.47/warc/CC-MAIN-20150728002307-00258-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 273171651, "recordOffset": 273134207, "tableOrientation": "HORIZONTAL", "TableContextTimeStampBeforeTable": "{46684=Azerbaijan}", "TableContextTimeStampAfterTable": "{54853=Asked on Aug 31 2007, 48102=Submitted Oct 18 2008, 38504=Asked on Dec 22 2011, 34654=Asked on Dec 28 2011, 36168=Answered on Dec 28 2011, 52425=Submitted Sep 19 2007, 53787=BATCH NUMBER -- NOT SPECIFIED -- ORDER NUMBER -- NOT SPECIFIED -- DESCRIPTION OF THE PROBLEM No signal in the position of 190k SAMPLE SD-rat endothelial cell PRIMARY ANTIBODY dilution 1: 1000 in TBST with 2% BSA DETECTION ..., 4154=Target information above from: UniProt accession P35968 The UniProt Consortium The Universal Protein Resource (UniProt) in 2010 Nucleic Acids Res. 38:D142-D148 (2010) ., 42350=Asked on Dec 21 2011, 40014=Answered on Dec 22 2011, 33974=Thank you for your email and suggestions. May I request to proceed with a refund for the antibody? Thanks Regards, 43860=Answered on Dec 21 2011, 56360=Answered on Aug 31 2007}", "textBeforeTable": "The application notes include recommended starting dilutions; optimal dilutions/concentrations should be determined by the end user. Our Abpromise guarantee covers the use of ab38473 in the following tested applications. Applications Cancer Types of disease Metabolism Hypoxia Metabolism processes Pathways and Processes Metabolism Endothelial Cells Cell Markers Cardiovascular Markers Cardiovascular Response to hypoxia Cancer Metabolism Cancer Endothelial Markers Endothelial Progenitors Stem Cells Growth factor receptors Oncoproteins Oncoproteins/suppressors Cancer Angiogenic growth factors Angiogenesis Invasion/microenvironment Cancer VEGF Growth factors Cancer Surface Molecules Hematopoietic Progenitors Stem Cells VEGF Growth Factors/Hormones Signal Transduction Receptor Tyrosine Kinases Tyrosine Kinases Protein Phosphorylation Signal Transduction Host Virus Interaction Interspecies Interaction Microbiology VEGF Receptors VEGF Growth Factors", "textAfterTable": "Target FunctionReceptor for VEGF or VEGFC. Has a tyrosine-protein kinase activity. The VEGF-kinase ligand/receptor signaling system plays a key role in vascular development and regulation of vascular permeability. In case of HIV-1 infection, the interaction with extracellular viral Tat protein seems to enhance angiogenesis in Kaposi's sarcoma lesions. Involvement in diseaseDefects in KDR are associated with susceptibility to hemangioma capillary infantile (HCI) [MIM:602089]. HCI are benign, highly proliferative lesions involving aberrant localized growth of capillary endothelium. They are the most common tumor of infancy, occurring in up to 10% of all births. Hemangiomas tend to appear shortly after birth and show rapid neonatal growth for up to 12 months characterized by endothelial hypercellularity and increased numbers of mast cells. This phase is followed by slow involution at a rate of about 10% per year and replacement by fibrofatty stroma. Sequence similaritiesBelongs to the protein kinase superfamily. Tyr protein kinase family. CSF-1/PDGF receptor subfamily. Contains 7 Ig-like C2-type (immunoglobulin-like) domains. Contains 1 protein kinase domain. Post-translational modificationsPhosphorylated. Dephosphorylated by PTPRB. Dephosphorylated by PTPRJ at Tyr-951, Tyr-996, Tyr-1054, Tyr-1059, Tyr-1175 and Tyr-1214. Cellular localizationMembrane. Target information above from: UniProt accession P35968 The UniProt Consortium The Universal Protein Resource (UniProt) in 2010 Nucleic Acids", "hasKeyColumn": false, "keyColumnIndex": -1, "headerRowIndex": 0}