{"relation": [["Checklist", "Check the physical media to ensure there are no damaged parts.", "Verify that the SFP (small form-factor pluggable) devices in use are those authorized by Cisco and that they are not faulty.", "Verify that you have enabled the port by right-clicking the port in Device Manager and selecting enable or by using the no shut CLI command.", "Right-click the port in Device Manager or use the show interface CLI command to verify the state of the interface. Refer to Table 8-1 for reasons why a port may be in a down operational state.", "Verify that you if you have one host-optimized port configured as an ISL, you have not connected to the other three ports in the port group.", "Verify that no ports on a Generation 2 module are out of service."], ["Check off", "", "", "", "", "", ""]], "pageTitle": "Cisco MDS SanOS Troubleshooting Guide -- Troubleshooting Ports - DocWiki", "title": "", "url": "http://docwiki.cisco.com/w/index.php?title=Cisco_MDS_SanOS_Troubleshooting_Guide_--_Troubleshooting_Ports&diff=35495&oldid=35489", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 2, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988317.67/warc/CC-MAIN-20150728002308-00247-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 78600527, "recordOffset": 78567287, "tableOrientation": "HORIZONTAL", "textBeforeTable": "Troubleshooting a SAN problem involves gathering information about the configuration and connectivity of individual devices and the entire SAN fabric. In the case of port interfaces, begin your troubleshooting activity as follows: Initial Troubleshooting Checklist For a complete description of port modes, administrative states, and operational states, refer to the Cisco MDS 9000 Family Configuration Guide and the Cisco MDS 9000 Fabric Manager Configuration Guide. The operational status represents the current status of a specified attribute such as the interface speed. This status cannot be changed and is read-only. Some values may not be valid when the interface is down (such as the operation speed). The administrative configuration does not change unless you modify it. This configuration has various attributes that you can configure in administrative mode. Each interface has an associated administrative configuration and operational status: Each physical Fibre Channel interface in a switch can operate in one of several port modes: E port, F port, FL port, TL port, TE port, SD port, and B port. In addition to these modes, each interface can be configured in auto or Fx port modes. These modes determine the port type during interface initialization. Before a switch can relay frames from one data link to another, the characteristics of the interfaces through which the frames are received and sent must be defined. The configured interfaces can be Fibre Channel interfaces, Gigabit Ethernet interfaces, the", "textAfterTable": "Note: Use the show running interface CLI command to view the interface configuration in Cisco SAN-OS Release 3.0(1) or later. The interface configuration as seen in the show running-config CLI command output is no longer consolidated. Table 8-1 Reason Codes for Nonoperational States Reason Code Description Applicable Mode Link failure or not connected The physical layer link is not operational. All SFP not present The small form-factor pluggable (SFP) hardware is not plugged in. Initializing The physical layer link is operational and the protocol initialization is in progress. Reconfigure fabric in progress The fabric is currently being reconfigured. Offline The Cisco SAN-OS software waits for the specified R_A_TOV time before retrying initialization. Inactive The interface VSAN is deleted", "hasKeyColumn": false, "keyColumnIndex": -1, "headerRowIndex": 0}