{"relation": [["", "One to one", "One to many", "", "Many to one", "", "Many to many", "", ""], ["1990censusblock", "601", "101P", "101P", "410", "503", "404", "501P", "502P"], ["2000censusblock", "1017", "3028", "2834", "2554P", "2554P", "1007P", "1007P", "1008P"]], "pageTitle": "Appendix A. Census 2000 Geographic Terms and Concepts - Summary File 1 Technical Documentation - Survey Census 2000 - Social Explorer", "title": "", "url": "https://www.socialexplorer.com/data/C2000/documentation/bc9d69d5-25ed-475b-938c-81829edfb40c", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 2, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988048.90/warc/CC-MAIN-20150728002308-00128-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 929661931, "recordOffset": 929626058, "tableOrientation": "HORIZONTAL", "textBeforeTable": "The census block relationship files, which are available only in computer-readable form, present relationships of the 1990 census and Census 2000 blocks on the basis of whole blocks or part blocks (\"P\"). The following relationships can be derived: Changes to the boundaries for census tracts and, for the first time, for census blocks are available in relationship files, which are only available in computer-readable form. The census tract relationship files feature the relationship of census tracts/block numbering areas at the time of the 1990 census to census tracts for Census 2000, and vice versa, including partial relationships. For the first time, the census tract relationship files show a measure of the magnitude of change using the proportion of the length of roads and sides of roads contained in partial census tracts. This information can be used to proportion the data for the areas where census tracts have changed. The historical counts shown for counties, county subdivisions, places, and American Indian, Alaska Native, and Native Hawaiian areas are not updated for such changes, and thus reflect the population and housing units in each entity as delineated at the time of each decennial census. Boundary changes are not reported for some entities, such as census designated places and block groups. Statistical entity boundaries generally are reviewed by local, state, or tribal governments and can have changes to adjust boundaries to visible features to better define the geographic area", "textAfterTable": "Block relationship files are available to compare the following sets of census blocks: 1990 tabulation block to 2000 collection block, 2000 collection block to 2000 tabulation block, and 1990 tabulation block to 2000 tabulation block. Census tract relationship files and block relationship files are not geographic equivalency files. For a true areal comparison between the census tracts/block numbering areas and blocks used for the 1990 census and the census tracts and blocks used for Census 2000 (as well as other geographic areas), it is necessary to use the 2000 TIGER/Line® files. The 2000 TIGER/Line files will contain 1990 and 2000 boundaries for counties and statistically equivalent entities, county subdivisions, places, American Indian areas, Alaska Native village statistical areas, census tracts, census blocks, and by derivation from the census blocks, block groups. Census Block back to top Census blocks are areas bounded on all sides by visible features, such as streets, roads, streams, and railroad tracks, and by invisible boundaries, such as city, town, township, and county limits, property lines, and short, imaginary extensions of streets and roads. Generally, census blocks are small in area; for example, a block bounded by city streets. However, census blocks in sparsely settled areas may contain many square miles of territory. All territory in the United States, Puerto", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}