{"relation": [["", "Buck deer", "Doe deer", "Bull elk", "Cow elk", "Bull moose", "Cow moose", "Buck pronghorn", "Doe pronghorn", "Wild turkey"], ["Public", "2.5", "N/A", "N/A", "N/A", "N/A", "N/A", "N/A", "N/A", "N/A"], ["Private", "3.1", "N/A", "N/A", "N/A", "N/A", "N/A", "N/A", "N/A", "N/A"]], "pageTitle": "Hunt tables and maps", "title": "", "url": "http://wildlife.utah.gov/maps/public/details_cwmu.php?cwmu_id=2011001", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 3, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988061.16/warc/CC-MAIN-20150728002308-00016-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 256596531, "recordOffset": 256583045, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{21426=The Blue Creek Cooperative Wildlife Management Unit (CWMU) is located west of Portage, Utah near the Idaho - Utah Stateline, on the West Hills. Higher elevations are on the eastside of the Unit ranging from 6400 feet in the north to 6600 feet in the southeast. All drainages flow from east to west, and though not named they range from 5300 feet elevation to 6000 feet. The most common elevation is 6300 feet but ranges from 5300 feet to 6800 feet with an elevation difference of 1500 feet. Fifty-two percent (52%) of the CWMU elevation ranges between 5700 feet and 6500 feet an elevation difference of 800 feet. Agriculture (114) is the dominant land cover type on the Blue Creek Cooperative Wildlife Management Unit (CWMU). Agriculture covers over three quarters of the CWMU. The only other land cover types covering much area are the Inter-Mountain Basins Big Sagebrush Shrubland (48) and Inter-Mountain Basins Semi-Deseret Grassland (76). One of the Blue Creek Cooperative Wildlife Mangement Unit (CWMU) nearest weather stations, PLYMOUTH (426938), is 18.7 km southeast of the southeast edge of the CWMU. PLYMOUTH has thirty-four (34) years of records, 1940 - 2008. During the FALL (September, October and November) the average precipitation is 3.39 inches, but it can be as high as 8.54 inches or as low as 0.96 inch. During the 91-day FALL period, 16 days will experience greater than or equal to 0.01 inch of precipitation, 9 days of greater than or equal to 0.10 inch, or 2 days of the greater than or equal to 0.50 inch of precipitation. Snowfall during the FALL averages 2.5 inches but can be as high as 11.0 inches. FALL temperature at PLYMOUTH averages 47.0 degrees F. but can be as high as 94.0 degrees F. or as low as 5.0 degrees F. During the FALL, 49 days will be below freezing (32 degrees F.) and 3 day above 90 degrees F.}", "textBeforeTable": "An estimate of the property size and the public/private composition Property size Best time to contact: 7am - 7pm Phone: 435-279-3300 Name: Clair Zollinger Access contact Wildlife management unit(s): Box Elder (1a) Counties: Box Elder Location The Blue Creek Cooperative Wildlife Management Unit (CWMU) is located west of Portage, Utah near the Idaho - Utah Stateline, on the West Hills. Higher elevations are on the eastside of the Unit ranging from 6400 feet in the north to 6600 feet in the southeast. All drainages flow from east to west, and though not named they range from 5300 feet elevation to 6000 feet. The most common elevation is 6300 feet but ranges from 5300 feet to 6800 feet with an elevation difference of 1500 feet. Fifty-two percent (52%) of the CWMU elevation ranges between 5700 feet and 6500 feet an elevation difference of 800 feet. Agriculture (114) is the dominant land cover type on the Blue Creek Cooperative Wildlife Management Unit (CWMU). Agriculture covers over three quarters of the CWMU. The only other land cover types covering much area are the Inter-Mountain Basins Big Sagebrush Shrubland (48) and Inter-Mountain Basins Semi-Deseret Grassland (76). One of the Blue Creek Cooperative Wildlife Mangement Unit (CWMU) nearest weather stations, PLYMOUTH (426938), is 18.7 km southeast of the southeast edge of the CWMU. PLYMOUTH has thirty-four (34) years of records, 1940 - 2008. During the FALL (September, October and November) the average", "textAfterTable": "Public Private Buck deer 2.5 3.1 Doe deer N/A N/A Bull elk N/A N/A Cow elk N/A N/A Bull moose N/A N/A Cow moose N/A N/A Buck pronghorn N/A N/A Doe pronghorn N/A N/A Wild turkey N/A N/A Hunter success Hunter success is the percent of hunters who successfully harvested an animal, reported for years in which data is available. Public Private Buck deer 100 55.5 Doe deer N/A N/A Bull elk N/A N/A Cow elk N/A N/A Bull moose N/A N/A Cow moose N/A N/A Buck pronghorn N/A N/A Doe pronghorn N/A N/A Wild turkey N/A N/A", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}