{"relation": [["", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", ""], ["Class", "ActivationObject", "ActiveXObjectConstructor", "ArgumentsObject", "ArrayConstructor", "ArrayLiteral", "ArrayObject", "ArrayPrototype", "ArrayWrapper", "AssemblyCustomAttributeList", "AST", "ASTList", "BinaryOp", "Binding", "BitwiseBinary", "Block", "BlockScope", "BooleanConstructor", "BooleanObject", "BooleanPrototype", "BreakOutOfFinally", "Closure", "CmdLineException", "CmdLineOptionParser", "COMCharStream", "COMFieldInfo", "COMMethodInfo", "COMPropertyInfo", "Context", "ContinueOutOfFinally", "Convert", "DateConstructor", "DateObject", "DatePrototype", "DebugBreak", "DebugConvert", "DocumentContext", "DynamicFieldInfo", "Empty", "EndOfFile", "EnumeratorConstructor", "EnumeratorObject", "EnumeratorPrototype", "Equality", "ErrorConstructor", "ErrorObject", "ErrorPrototype", "Eval", "EvalErrorObject", "Expando", "FieldAccessor", "ForIn", "FunctionConstructor", "FunctionDeclaration", "FunctionExpression", "FunctionObject", "FunctionPrototype", "FunctionWrapper", "GlobalObject", "Globals", "GlobalScope", "Hide", "Import", "In", "Instanceof", "JSAuthor", "JSConstructor", "JScriptCodeProvider", "JScriptException", "JSField", "JSFieldInfo", "JSFunctionAttribute", "JSLocalField", "JSMethod", "JSMethodInfo", "JSObject", "JSParser", "JSPrototypeObject", "JSScanner", "JSVariableField", "LateBinding", "LenientArrayPrototype", "LenientBooleanPrototype", "LenientDateConstructor", "LenientDatePrototype", "LenientEnumeratorPrototype", "LenientErrorPrototype", "LenientFunctionPrototype", "LenientGlobalObject", "LenientMathObject", "LenientNumberPrototype", "LenientObjectPrototype", "LenientRegExpPrototype", "LenientStringConstructor", "LenientStringPrototype", "LenientVBArrayPrototype", "MathObject", "MemberInfoList", "MethodInvoker", "Missing", "Namespace", "NoContextException", "NotRecommended", "NumberConstructor", "NumberObject", "NumberPrototype", "NumericBinary", "NumericUnary", "ObjectConstructor", "ObjectPrototype", "Override", "Package", "ParserException", "Plus", "PostOrPrefixOperator", "RangeErrorObject", "ReferenceAttribute", "ReferenceErrorObject", "RegExpConstructor", "RegExpMatch", "RegExpObject", "RegExpPrototype", "Relational", "ReturnOutOfFinally", "Runtime", "ScriptBlock", "ScriptFunction", "ScriptObject", "ScriptStream", "SimpleHashtable", "StackFrame", "StrictEquality", "StringConstructor", "StringObject", "StringPrototype", "SuperTypeMembersSorter", "SyntaxErrorObject", "Throw", "Try", "TypedArray", "TypeErrorObject", "Typeof", "TypeReflector", "UnaryOp", "URIErrorObject", "VBArrayConstructor", "VBArrayObject", "VBArrayPrototype", "VsaItem", "VsaItems", "With"], ["Description", "Infrastructure. Represents an object that is taking part in a scope hierarchy. This class contains methods for resolving scope and for getting member information. It belongs to the compilation and run-time state category.", "Infrastructure. Represents a prototype-based object that is defined by a constructor function. This class belongs to the built-in object model category.", "Infrastructure. Represents the information that is used to call a function. This includes the function, the caller, the arguments, and information about the stack frame. This class belongs to the objects and functions category.", "Infrastructure. Represents a prototype-based object that is defined by a constructor function. This class belongs to the built-in object model category.", "Infrastructure. This class is used by the JScript parser to represent an array literal.", "Infrastructure. Represents an array object. This class belongs to the built-in object model category.", "Infrastructure. Provides static methods and properties for ArrayObject objects. All methods of this class are called by passing in a reference to the object that is requesting access to the method. This class belongs to the built-in object model category.", "Infrastructure. Wraps an array to create a JScript ArrayObject. This class wraps either a .NET Framework Array object or a JScript ArrayObject object.", "Infrastructure. This class is used by the JScript parser to store the attributes that are assigned to an assembly.", "Infrastructure. Represents the abstract syntax tree that is used to parse JScript code.", "Infrastructure. Maintains a list of AST elements. This class belongs to the abstract syntax tree category.", "Infrastructure. Represents the base class for classes that perform operations on two operands, such as Plus, Equality, and Relational. This class belongs to the abstract syntax tree category.", "Infrastructure. Represents a reference to a class member, callable expression, or variable name. This class attempts to resolve the reference to the correct value at compile time.", "Infrastructure. Performs bitwise binary operations. This class belongs to the abstract syntax tree category.", "Infrastructure. Represents a block in JScript. This class is used mainly by the JSParser to create Block objects when it parses code. This class belongs to the abstract syntax tree category.", "Infrastructure. Represents the scope of a block of code that is taking part in a scope hierarchy and that can be pushed onto the global scope stack. For example, this class can represent the scope of a try block.", "Infrastructure. Represents a prototype-based object that is defined by a constructor function. This class belongs to the built-in object model category.", "Infrastructure. Represents a Boolean object. This class belongs to the built-in object model category.", "Infrastructure. Provides static methods and properties for BooleanObject objects. All methods of this class are called by passing in a reference to the object that is requesting access to the method. This class belongs to the built-in object model category.", "Infrastructure. Represents the exception state when code execution breaks out of a finally block.", "Infrastructure. Represents a closure function. This class belongs to the objects and functions category.", "Infrastructure. Represents errors that occur when you run the command-line compiler jsc.exe.", "Infrastructure. Determines whether options that are specified to the command-line compiler jsc.exe are correctly formed, and reads the arguments if any are included.", "Infrastructure. Represents a stream that sends its data to an IMessageReceiver. The data is stored in a buffer until the data is flushed or the stream is closed.", "Infrastructure. Enables JScript to communicate with an external COM field. This class is used by an external COM implementation to expose its objects to JScript because JScript needs a managed MemberInfo in order to bind to an external object.", "Infrastructure. Enables JScript to communicate with an external COM method. This class is used by an external COM implementation to expose its objects to JScript because JScript needs a managed MemberInfo in order to bind to an external object.", "Infrastructure. Enables JScript to communicate with an external COM property. This class is used by an external COM implementation to expose its objects to JScript because JScript needs a managed MemberInfo in order to bind to an external object.", "Infrastructure. Represents JScript source code. This class belongs to the compilation and run-time state category.", "Infrastructure. Represents the exception state when code execution continues out of a finally block.", "Infrastructure. Converts data from one type to another. This is a utility class.", "Infrastructure. Represents a prototype-based object that is defined by a constructor function. This class belongs to the built-in object model category.", "Infrastructure. Represents a date object. This class belongs to the built-in object model category.", "Infrastructure. Provides static methods and properties for DateObject objects. All methods of this class are called by passing in a reference to the object that is requesting access to the method. This class belongs to the built-in object model category.", "Infrastructure. This class is used by the JScript parser to represent a breakpoint in a debugger.", "Infrastructure. Converts data from one type to another. Includes methods that convert values to String objects so that they can be displayed by the debugger.", "Infrastructure. Represents a source code file that is written in the JScript language.", "Infrastructure. Represents field information. This class is used to return fields of expando classes and script arrays to the debugger.", "Infrastructure. Represents the value of a variable that has not been instantiated.", "Infrastructure. This class is used by the JScript parser to represent reaching the end of a file as an exception. Code can throw this error to stop the parser.", "Infrastructure. Represents a prototype-based object that is defined by a constructor function. This class belongs to the built-in object model category.", "Infrastructure. Represents an enumerator object. This class belongs to the built-in object model category.", "Infrastructure. Provides static methods and properties for EnumeratorObject objects. All methods of this class are called by passing in a reference to the object that is requesting access to the method. This class belongs to the built-in object model category.", "Infrastructure. Performs comparison operations. This class belongs to the abstract syntax tree category.", "Infrastructure. Represents a prototype-based object that is defined by a constructor function. This class belongs to the built-in object model category.", "Infrastructure. Represents an error object. This class belongs to the built-in object model category.", "Infrastructure. Provides static methods and properties for ErrorObject objects. All methods of this class are called by passing in a reference to the object that is requesting access to the method. This class belongs to the built-in object model category.", "Infrastructure. Evaluates JScript code. This class belongs to the abstract syntax tree category.", "Infrastructure. Represents an error that occurs when the eval method is used. For more information, see eval Method (Visual Studio - JScript).", "Infrastructure. Indicates that a class or method is an expando class or method.", "Infrastructure. Represents a field accessor.", "Infrastructure. Represents the JScript for...in statement. This class belongs to the abstract syntax tree category.", "Infrastructure. Represents a prototype-based object that is defined by a constructor function. This class belongs to the built-in object model category.", "Infrastructure. Represents a function declaration. This class belongs to the abstract syntax tree category.", "Infrastructure. Represents a function object. This class belongs to the abstract syntax tree category.", "Infrastructure. Represents a function object.", "Infrastructure. Provides static methods and properties for FunctionObject objects. All methods of this class are called by passing in a reference to the object that is requesting access to the method. This class belongs to the built-in object model category.", "Infrastructure. Binds the members of a function to an object.", "Infrastructure. Stores constants, data type information, utility functions, and references to prototype-based objects. This class belongs to the built-in object model category.", "Infrastructure. Stores references to all globally available types and manages the stack. This class belongs to the compilation and run-time state category.", "Infrastructure. Represents the global scope.", "Infrastructure. Indicates that a method or field hides a method or field in a base class.", "Infrastructure. Imports namespaces for use in code. This class belongs to the abstract syntax tree category.", "Infrastructure. Determines whether an object is contained in another object. This class belongs to the abstract syntax tree category.", "Infrastructure. Determines whether an object can be coerced to the type of another object. This class belongs to the abstract syntax tree category.", "Infrastructure. Provides services for authoring JScript code in an editor.", "Infrastructure. Wraps a FunctionObject.", "Infrastructure. Provides access to instances of the JScript code generator and code compiler.", "Infrastructure. The exception that is thrown by JScript to notify a common language runtime (CLR) host or program that an error occurred. A JScriptException usually takes a JSError enumeration value.", "Infrastructure. Supports all fields in JScript. This is the base class for all fields that are defined by JScript. This class belongs to the name binding category.", "Infrastructure. Wraps a FieldInfo object.", "Infrastructure. Used with JSFunctionAttributeEnum to annotate the calling conventions of methods and constructors that are generated by the JScript compiler.", "Infrastructure. Represents a local variable.", "Infrastructure. Represents a JScript method. This class belongs to the name binding category.", "Infrastructure. Wraps a MethodInfo object.", "Infrastructure. Represents an object in JScript. This class belongs to the objects and functions category.", "Infrastructure. Parses JScript code. This class belongs to the scanning and parsing category. For more information about scanning and parsing, see Create a Language Compiler for the .NET Framework.", "Infrastructure. Adds a constructor function property to a JSObject for early binding purposes. This class belongs to the objects and functions category.", "Infrastructure. Scans JScript code searching for individual units of code, or tokens. This class belongs to the scanning and parsing category. For more information about scanning and parsing, see Create a Language Compiler for the .NET Framework.", "Infrastructure. Supports variable fields in JScript. This is the base class for parameters, local variables, global variables, and class members.", "Infrastructure. Represents a reference to a class member, callable expression, or variable name. This class attempts to resolve the reference to the correct value at run time.", "Infrastructure. Stores objects that represent the static methods of the ArrayPrototype class. The LenientArrayPrototype class belongs to the built-in object model category.", "Infrastructure. Stores objects that represent the static methods of the BooleanPrototype class. The LenientBooleanPrototype class belongs to the built-in object model category.", "Infrastructure. Stores objects that represent the static methods of the DateConstructor class. The LenientDateConstructor class belongs to the built-in object model category.", "Infrastructure. Stores objects that represent the static methods of the DatePrototype class. The LenientDatePrototype class belongs to the built-in object model category.", "Infrastructure. Stores objects that represent the static methods of the EnumeratorPrototype class. The LenientEnumeratorPrototype class belongs to the built-in object model category.", "Infrastructure. Stores objects that represent the static methods of the ErrorPrototype class. The LenientErrorPrototype class belongs to the built-in object model category.", "Infrastructure. Stores objects that represent the static methods of the FunctionPrototype class. The LenientFunctionPrototype class belongs to the built-in object model category.", "Infrastructure. Stores constructor function objects, data type information, and objects that represent the static methods of the GlobalObject class. The LenientGlobalObject class belongs to the built-in object model category.", "Infrastructure. Stores objects that represent the static methods of the MathObject class. The LenientMathObject class belongs to the built-in object model category.", "Infrastructure. Stores objects that represent the static methods of the NumberPrototype class. The LenientNumberPrototype class belongs to the built-in object model category.", "Infrastructure. Stores objects that represent the static methods of the ObjectPrototype class. The LenientObjectPrototype class belongs to the built-in object model category.", "Infrastructure. Stores objects that represent the static methods of the RegExpPrototype class. The LenientRegExpPrototype class belongs to the built-in object model category.", "Infrastructure. Stores objects that represent the static methods of the StringConstructor class. The LenientStringConstructor class belongs to the built-in object model category.", "Infrastructure. Stores objects that represent the static methods of the StringPrototype class. The LenientStringPrototype class belongs to the built-in object model category.", "Infrastructure. Stores objects that represent the static methods of the VBArrayPrototype class. The LenientVBArrayPrototype class belongs to the built-in object model category.", "Infrastructure. Provides constants and static methods for trigonometric functions, logarithmic functions, and other common mathematical functions. This class belongs to the built-in object model category.", "Infrastructure. Maintains a list of MemberInfo elements.", "Infrastructure. Represents the invoker for a particular method. Used by the JSMethodInfo class to invoke methods.", "Infrastructure. Represents the value of a variable that has been instantiated but that has not yet had its value set.", "Infrastructure. Represents a namespace.", "Infrastructure. The exception that is thrown when there is no code Context associated with a JScriptException.", "Infrastructure. Indicates that a method or field is not recommended.", "Infrastructure. Represents a prototype-based object that is defined by a constructor function. This class belongs to the built-in object model category.", "Infrastructure. Represents a number object. This class belongs to the built-in object model category.", "Infrastructure. Provides static methods and properties for NumberObject objects. All methods of this class are called by passing in a reference to the object that is requesting access to the method. This class belongs to the built-in object model category.", "Infrastructure. Performs binary operations on numeric operands. This class belongs to the abstract syntax tree category.", "Infrastructure. Performs unary operations on numeric operands. This class belongs to the abstract syntax tree category.", "Infrastructure. Represents a prototype-based object that is defined by a constructor function. This class belongs to the built-in object model category.", "Infrastructure. Provides static methods and properties for JSObject objects. All methods of this class are called by passing in a reference to the object that is requesting access to the method. This class belongs to the built-in object model category.", "Infrastructure. Indicates that a method or field overrides a method or field in a base class.", "Infrastructure. Creates packages of JScript code for use by other code. This class belongs to the abstract syntax tree category.", "Infrastructure. This class is used by the JScript parser to represent parser exceptions.", "Infrastructure. Performs addition and concatenation operations. This class belongs to the abstract syntax tree category.", "Infrastructure. Performs increment and decrement operations that correspond to the prefix and postfix syntax. This class belongs to the abstract syntax tree category.", "Infrastructure. Represents a range error. For example, a range error can occur when you use an incorrect index to access an array element.", "Infrastructure. Represents a reference to an assembly.", "Infrastructure. Represents a reference error. For example, a reference error can occur when you reference an undeclared variable.", "Infrastructure. Represents a prototype-based object that is defined by a constructor function. This class belongs to the built-in object model category.", "Infrastructure. Represents the results from a regular expression match. This class belongs to the built-in object model category.", "Infrastructure. Represents a regular expression object. This class belongs to the built-in object model category.", "Infrastructure. Provides static methods and properties for RegExpObject objects. All methods of this class are called by passing in a reference to the object that is requesting access to the method. This class belongs to the built-in object model category.", "Infrastructure. Performs relational comparison operations. This class belongs to the abstract syntax tree category.", "Infrastructure. Represents the exception state when code execution returns out of a finally block.", "Infrastructure. Provides utility functions.", "Infrastructure. Represents a block of JScript code. This class belongs to the abstract syntax tree category.", "Infrastructure. Represents a prototype-based object that is defined by a constructor function. Most of the constructor function classes, such as DateConstructor, NumberConstructor, StringConstructor, and ObjectConstructor, inherit from this class. This class belongs to the objects and functions category.", "Infrastructure. Supports all JScript classes. This is the ultimate base class of all JScript classes. This class belongs to the objects and functions category.", "Infrastructure. Represents a stream of data. This class sends its data to either a COMCharStream or a Console stream.", "Infrastructure. A hash table for the internal storage of items.", "Infrastructure. Represents a stack frame for executing code. This class contains methods for resolving scope. It belongs to the compilation and run-time state category.", "Infrastructure. Performs comparison operations. This class belongs to the abstract syntax tree category.", "Infrastructure. Represents a prototype-based object that is defined by a constructor function. This class belongs to the built-in object model category.", "Infrastructure. Represents a string object. This class belongs to the built-in object model category.", "Infrastructure. Provides static methods and properties for StringObject objects. All methods of this class are called by passing in a reference to the object that is requesting access to the method. This class belongs to the built-in object model category.", "Infrastructure. Stores members from base classes and interfaces.", "Infrastructure. Represents a syntax error. For example, a syntax error can occur when you omit a semicolon.", "Infrastructure. Throws an exception. This class belongs to the abstract syntax tree category.", "Infrastructure. Identifies blocks of code to run in error handling scopes. This class belongs to the abstract syntax tree category.", "Infrastructure. Represents a reflectable reference to the Array class. This class stores the element type of a typed array, but this class does not store data.", "Infrastructure. Represents a type error. For example, a type error can occur when you pass an object of one type to a method that expects an object of another type.", "Infrastructure. Determines the data types of objects. This class belongs to the abstract syntax tree category.", "Infrastructure. Provides an implementation of GetMember that is faster than GetMember.", "Infrastructure. Represents the base class for classes that perform operations on single operands, such as Typeof and PostOrPrefixOperator. This class belongs to the abstract syntax tree category.", "Infrastructure. Represents a Uniform Resource Identifier (URI) error. For example, a URI error can occur when you try to encode or decode a URI.", "Infrastructure. Represents a prototype-based object that is defined by a constructor function. This class belongs to the built-in object model category.", "Infrastructure. Represents a VBArray object. This class belongs to the built-in object model category.", "Infrastructure. Provides static methods and properties for VBArrayObject objects. All methods of this class are called by passing in a reference to the object that is requesting access to the method. This class belongs to the built-in object model category.", "Infrastructure. Represents items added to the .NET script engine. This includes code items, reference items, and global items.", "Infrastructure. Represents a collection of IVsaItem objects that can be addressed either by name or by index.", "Infrastructure. Represents the with statement. This class belongs to the abstract syntax tree category."]], "pageTitle": "Microsoft.JScript Namespace ()", "title": "", "url": "https://msdn.microsoft.com/en-us/library/Microsoft.JScript.aspx", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986357.49/warc/CC-MAIN-20150728002306-00132-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 877434343, "recordOffset": 877405560, "tableOrientation": "HORIZONTAL", "textBeforeTable": "Classes The Microsoft.JScript namespace contains classes that support compilation and code generation using the JScript language. .NET Framework 1.1 .NET Framework 2.0 .NET Framework 3.0 .NET Framework 3.5 .NET Framework 4 Other Versions .NET Framework 4.6 and 4.5 Microsoft.JScript Namespace With Class VSAITEMTYPE2 Enumeration VsaItems Class VsaItem Class VBArrayPrototype Class VBArrayObject Class", "textAfterTable": "Interfaces   Interface Description COMMemberInfo Infrastructure. Defines methods that enable JScript to communicate with an external COM member. This interface is used by an external COM implementation to expose its objects to JScript because JScript requires a managed MemberInfo to bind to an external object. IActivationObject Infrastructure. Defines methods for resolving scope. This interface is implemented by all objects that take part in a scope hierarchy. IAuthorServices Infrastructure. Defines services for authoring JScript code in an editor. IColorizeText Infrastructure. Defines services for colorizing text when JScript code is being authored in an editor. IDebugConvert Infrastructure. Defines a set of utility methods that convert data from one type to another. Includes methods that convert values", "hasKeyColumn": false, "keyColumnIndex": -1, "headerRowIndex": 0}