{"relation": [["OS", "Windows 8.1 32-Bit", "Windows 8.1 64-Bit", "Windows Vista 32-Bit", "Windows Vista 64-Bit", "Windows 7 32-Bit", "Windows 7 64-Bit", "Windows 8 32-Bit", "Windows 8 64-Bit", "Windows XP 32-Bit", "Windows XP 64-Bit"], ["Popularity", "0.09%", "0.27%", "7.11%", "1.41%", "4.16%", "3.30%", "0.16%", "0.23%", "1.50%", "0.22%"]], "pageTitle": "Intel(R) ICH9 Family PCI Express Root Port 1 - 2940 Driver Download - PC Pitstop Driver Library", "title": "", "url": "http://www.pcpitstop.com/libraries/driver/detail.asp?driver=Intel(R)~ICH9~Family~PCI~Express~Root~Port~1~-~2940.html", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 30, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987866.61/warc/CC-MAIN-20150728002307-00015-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 632528051, "recordOffset": 632514283, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{132730=Introducing Driver Matic. In May 2007, PC Pitstop announced a revolutionary technology called Driver Matic. Driver Matic allows the installation of a driver with the click of a button. Prior to Driver Matic, all drivers had to be installed differently and required significant user involvement. Now with Driver Matic, a PC can have up to date drivers automatically. Driver Matic has been integrated into both PC Matic and Driver Alert 2.0. Driver Matic finally has made it simple and easy to keep your drivers up to date. Only at PC Pitstop.}", "textBeforeTable": "Popularity Subscribe to TechTalk › Get more tips New drivers can unlock additional features for a device that may not have been available before. If you receive notification from a program or a manufacturer that a newer driver is available, it would be a good idea to check the release notes and see what’s different than the driver you’re already using. › Also, with many wireless adapters it is important to stay current as updates often contain security fixes. A driver update may also improve stability and performance, or may fix issues with games, programs and power management. If a hardware device isn't functioning properly, or if a program or game that you're installing states that it requires newer drivers, a driver update will be in order. Tips from the PitCrew Find out how to make your computer faster by running our Free Performance Scan. To find the latest driver for your computer we recommend running our Free Driver Scan. Introducing Driver Matic. In May 2007, PC Pitstop announced a revolutionary technology called Driver Matic. Driver Matic allows the installation of a driver with the click of a button. Prior to Driver Matic, all drivers had to be installed differently and required significant user involvement. Now with Driver Matic, a PC can have up to date drivers automatically. Driver", "textAfterTable": "Software PC Pitstop PC Matic PC Pitstop PC Magnum PC Pitstop Optimize 3.0 PC Pitstop Driver Alert 2.0 PC Pitstop Disk MD WinPatrol Plus Support FAQs Forums TechExpress Product Support Troubleshooting PC Pitstop Helpdesk Libraries Top Running Processes Top Malicious Processes Top Software Most Recent 50 Drivers PC Satisfaction Top File Extensions Forums Fix My PC Internet Tests Viruses & Spyware Tech Talk Tips 'n' Tricks Site Feedback PC Pitstop © Copyright 2015 PC Pitstop, All Rights Reserved EULA Privacy Policy Terms & Conditions Facebook Twitter YouTube TechTalk", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}