{"relation": [["CLASS", "A", "B", "C", "D", "E", "F"], ["TEST LOAD", "15kN", "125kN", "250kN", "400kN", "600kN", "900kN"], ["APPLICATION", "Pedestrian areas, domestic driveways", "Car Parks and pedestrian areas, with no heavy vehicular traffic.", "Car Parks, service stations, forecourts, industrial . Areas with slow moving traffic. (Up to 500mm from kerb & 200mm in to verge path).", "Carriage Ways, public highway use.", "For use in locations of high wheel loads . e.g. heavy loading bay.", "Areas of extremely high loads . e.g. airports and dock yards."]], "pageTitle": "Linear Drainage Channels", "title": "", "url": "http://www.areco.co.uk/linear-drainage.htm", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 3, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988598.68/warc/CC-MAIN-20150728002308-00002-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 295167997, "recordOffset": 295159795, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{3726=Linear Drainage Channels are available in a range of sizes and materials, there usage varies from domestic driveways , car parks, carriageways and commercial heavy load applications. Materials range from polyproplyene, stainless steel and polymer concrete. The end use of the drain will determine which type is suitable for a specific application and the different grades that comply to BS EN124: 1994 are shown below., 16959=ARECO Ltd, Unit 2A Coppice Park, Coppice Lane, Aldridge, Walsall, West Midlands WS9 9AA Telephone: 01922 743553     Fax: 01922 743554}", "lastModified": "Fri, 28 Sep 2012 09:32:24 GMT", "textBeforeTable": "Linear Drainage Channels are available in a range of sizes and materials, there usage varies from domestic driveways , car parks, carriageways and commercial heavy load applications. Materials range from polyproplyene, stainless steel and polymer concrete. The end use of the drain will determine which type is suitable for a specific application and the different grades that comply to BS EN124: 1994 are shown below. Product Range   Linear Drainage Channels      ", "textAfterTable": "Dependant on the application or the area the drain is used on linear drainage channels can be supplied with built in falls or regular depth channels. Regular depth channels are normally used for short lengths of drain where a natural fall occurs. Built in fall channels are more suited to larger flat areas such as car parks. Domestic Channels A range of drains are available from polyproplyene base and grating to polymer concrete bases with Galvanised steel gratings. Junction boxes end caps and leaf guards are available. Polyproplyene Drainage Channel Concrete base with steel grating   Commercial Channels Channels used vary according to application from polymer concrete base with galvanised steel edges and a range of gratings to polymer concrete with iron cast edge rail with iron slotted grating. On many commercial channels different styles of grating are available. Medium duty channels are normally supplied with a 2 point locking system per metre, heavy duty channels are normally supplied with an 8 point per metre locking system. Heavy Duty Commercial Channel Medium Duty Commercial Channel Large capacity linear drainage channels are also available, these are based on", "hasKeyColumn": false, "keyColumnIndex": -1, "headerRowIndex": 0}