{"relation": [["Reported Crimes", "murders", "forcible rapes", "robberies", "aggravated assaults", "burglaries", "larceny-thefts", "motor vehicle thefts"], ["Number", "16,204", "95,136", "420,637", "894,348", "2.2 million", "7.1million", "1.2 million"], ["% increase/decrease from 2001", "+1.0", "+4.7", "-0.7", "-1.6", "+1.7", "-0.6", "+1.4"]], "pageTitle": "Federal Bureau of Investigation", "title": "", "url": "https://www2.fbi.gov/page2/oct03/ucr102703.htm", "hasHeader": true, "headerPosition": "MIXED", "tableType": "RELATION", "tableNum": 6, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989234.2/warc/CC-MAIN-20150728002309-00179-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 948738001, "recordOffset": 948729799, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{2970=Find out in the FBI's just-released annual report, Crime in the United States, 2002. The Bureau has been compiling these national crime statistics, which serve as a barometer of lawlessness, since 1930., 5315=And the answers to the questions above? 1. The American Northeast had the lowest crime rate, with 2,889 serious crimes per 100,000 people. The South, the highest: 4,722 crimes per 100,000 people. 2. Women accounted for 23% of those arrested in 2002. 3. About 1.2 million vehicles were reported stolen in 2002. 4. 64% of murders were solved -- the highest clearance rate of all serious crimes., 4477=What's the big picture of crime in 2002? The total number of serious crimes (11.9 million) was slightly higher -- by less than one-tenth of one percent -- than in 2001... but 16% lower than ten years ago, in 1993., 4759=· Violent crime (murder, rape, robbery, and aggravated assault) in 2002 was down nearly 1% from 2001 -- and almost 26% lower than in 1993. · Property crimes (burglary, larceny-theft, motor vehicle theft) increased one-tenth of one percent from 2001 -- down 14.5% compared with 1993., 3240=Where did the data come from? From over 17,000 city, county, and state law enforcement agencies that represent 93% of the U.S. population. All their local data on murders, forcible rapes, robberies, aggravated assaults, burglaries, larceny-thefts, and motor vehicle thefts in 2002.}", "textBeforeTable": "10/27/03 Want to know which region of the country has the lowest crime rate? What percentage of those arrested are women? How many cars were reported stolen in 2002? What percentage of murders are solved? The latest crime rate in your state? Find out in the FBI's just-released annual report, Crime in the United States, 2002. The Bureau has been compiling these national crime statistics, which serve as a barometer of lawlessness, since 1930. Where did the data come from? From over 17,000 city, county, and state law enforcement agencies that represent 93% of the U.S. population. All their local data on murders, forcible rapes, robberies, aggravated assaults, burglaries, larceny-thefts, and motor vehicle thefts in 2002. Who uses it? Lots of people. Law enforcement agencies, to formulate their budgets and assess the operation of their police forces. Sociologists and criminal justice researchers, to study the nature, cause, and movement of crime over time. Legislators, to help them write anti-crime measures. Chambers of commerce and tourism agencies, to promote low-crime areas to businesses and tourists. And, importantly for you the reader, the news media -- to make sure you know about the state of crime in your neighborhood. In Director Mueller's words, \"We're pleased to cooperate with law enforcement agencies around", "textAfterTable": " ", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}