{"relation": [["Cause of death", "Automobile accident", "Gunfire", "Gunfire (Accidental)", "Heart attack", "Motorcycle accident", "Struck by train", "Struck by vehicle", "Training accident", "Vehicle pursuit", "Vehicular assault", "Weather/Natural disaster"], ["Number of deaths", "24", "25", "2", "2", "6", "2", "10", "1", "5", "6", "1"]], "pageTitle": "Texas Highway Patrol - Wikipedia, the free encyclopedia", "title": "", "url": "https://en.wikipedia.org/wiki/Texas_Highway_Patrol", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 1, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988922.24/warc/CC-MAIN-20150728002308-00342-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 864323535, "recordOffset": 864289028, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{18323=As of 2015, the Texas Highway Patrol employs 2,162 sworn troopers, making up roughly 60% of the Texas DPS' commissioned personnel. Despite the size of the highway patrol and its unique name and function, however, many Texans refer to troopers simply as \"DPS\", referencing the THP's parent agency. Some are unaware that an entity by the name of \"Texas Highway Patrol\" even exists, or is distinct from its parent., 38975=Early uniforms included a blue-grey blouse and brown pants, typically worn with black motorcycle boots. These uniforms also featured a bow tie and Sam Browne belts.[14] Troopers of this era wore peaked caps and diamond-shaped badges, with a single patch worn on the left shoulder; until the current uniform was instituted, the patch was circular. This uniform style was used until approximately 1960, when the current uniform was adopted. Until about 1972, the uniform continued to feature a Sam Browne belt, and it was not until the mid-2000s that a standardized patch design was used for all members of the patrol. Prior to this change (which is today being slowly integrated into other Texas DPS divisions), differently colored patches identified whether a trooper worked in the highway patrol, drivers license, or license and weight (commercial vehicle) units. Red patches with blue lettering indicated highway patrol, Blue patches with red lettering indicated drivers license, and grey patches with blue lettering indicated license and weight. Capitol Police had their own unique blue patch depicting the capitol building in yellow and Capitol security wore tan patches with brown lettering., 50279=Many changes to salaries and promotional requirements were made in response to a 10% drop in the number of troopers between 2004 and 2010, when an audit was conducted. The audit determined that Highway Patrol troopers were being paid far less annually than officers at many metropolitan police departments and sheriff's offices. The problem had been present for many years, but had gone unresolved because the Texas State Legislature sets state employee salary, not individual agencies. Additionally, state agencies had been asked to cut approximately 10% of their budgets between 2010 and 2012, making lawmakers hesitant to approve a larger budget for DPS. However, many legislators also feared that the decrease in size of the DPS, which was predicted to worsen, would result in a gradual lapse in quality of service. As a result, a 20% pay increase in the salary of most Texas DPS officials was approved in 2012. Additional legislative measures are intended to shield DPS from most future budget cuts., 15070=From 1845 (when Texas was annexed to the United States) until the early 20th century, the Rangers were the only form of state law enforcement available. The force was temporarily disbanded by the federal government after the Civil War, and replaced with the short-lived Texas State Police. This agency lasted only three years before the Texas Rangers were reorganized. Until the introduction of the automobile, they remained the only state criminal law enforcement agency in Texas., 24038=Trainees are housed at DPS headquarters in Austin and receive training both there and at a driving and firing range in Williamson County, north of Austin. Academies are paramilitary in nature and are physically and mentally demanding. Academies are styled as Class A/B-(Year), and last anywhere from 18 to 28 weeks. On average, two academies are held per year; this number can be altered by the Texas DPS director as necessary. Hands-on material covered includes weapons training, accident investigation, self-defense, pursuit driving, and intense physical readiness. Classroom study, such as fraudulent document recognition and legal and ethics code study, also plays a large role in cadets' training. Due to the difficult nature of the academy, some classes have graduated fewer than 20% of the starting number. Class B-2013 graduated 102 troopers out of an initial class of 126, an 81% graduation rate; Class A-2014 graduated 107 troopers of an original 143, a success rate of 75%.[4], 7457=The highway patrol was founded in 1929 as the Highway Motor Patrol, the first statewide law enforcement agency in Texas since the establishment of the Texas Rangers in 1823, and the first such force to be uniformed and regularly trained. Since 1935, the agency has operated under its current name. Since its inception with just 60 officers, then known as \"inspectors\", the Texas Highway Patrol has grown to meet the increasing volume of vehicular traffic on Texas roads, modern security threats, and the requirements of twenty-first century policing, currently employing over 2,100 sworn troopers., 33177=These deployments of large numbers of troopers have been criticized by some. Many troopers complained about participating in the operation, and others were injured during pursuits and struggles with Mexican cartels. Between January 2005 and June 2009, Hidalgo County troopers were involved in 656 vehicle pursuits - 30 times the average for troopers in other counties - with only about 40% of suspects being apprehended.[8] Some experts also question the patrol's aggressive pursuit tactics, which often involve shooting out the tires of fleeing vehicles and performing roadblock techniques. Controversy about the role of firearms in pursuits arose in October 2012 after a THP sharpshooter in a helicopter opened fire on a suspected drug smuggler, accidentally killing two illegal immigrants who were concealed within the vehicle.[9], 32370=Since 2006, the Texas Highway Patrol has participated in Operations Linebacker and Border Star, programs launched by Governor Rick Perry intended to increase law enforcement along the Texas-Mexico border. The patrol's role in Operation Border Star is to deploy large numbers of troopers to the border in order to add an increased deterrent to drug traffickers and human smugglers. The plan calls for troopers from across the state to serve approximately one week each patrolling border counties, particularly in South Texas; deployments rotate constantly to maintain a steady presence along the border. Similar deployments took place during Operations Rio Grande and Wrangler (2006 and 2007, respectively)., 13650=Early law enforcement in Texas began with the establishment of the Texas Rangers in 1823 by Stephen F. Austin. The Rangers were originally formed to protect American settlers from Indian attacks, and over the years transformed into a paramilitary force. Rangers fought in the Texas Revolution, Mexican-American War, and Civil War. They quickly developed an international reputation for their exploits and perceived fearlessness (Mexican soldiers nicknamed them \"Texas Devils\" for their scouting and fighting abilities). From 1823 to 1845, they were a territorial force made up of volunteers charged with fighting Native Americans, guarding the Mexican border, and capturing thieves, murderers, and other criminals, occasionally by controversial methods. Nonetheless, it was not until the latter stages of the 19th century and the Texas cattle boom that the Rangers took on a law enforcement, rather than frontier militia, role., 19094=In 2013, the Texas Highway Patrol was divided into seven regions and nineteen districts.[3], 15794=The Texas Highway Patrol was established in 1929 as the Texas Highway Motor Patrol, tasked with enforcing traffic laws on Texas roads. The original force was made up of about 60 officers who patrolled on motorcycles, often in pairs. Because of this, it was not uncommon for troopers to drive criminals to jail in the offenders' own cars, then return later for the motorcycle left on the side of the road. When the Texas Department of Public Safety was formed in 1935, the Highway Motor Patrol was transferred into that department and was renamed the Texas Highway Patrol. The use of motorcycles was phased out after World War II, and cars became troopers' main mode of transportation. Two-way radio and teletype were also added in the late 1940s, allowing troopers to communicate with regional dispatch centers. The Aviation Unit was established in 1949 with the purchase of a single-engine aircraft based in Austin., 46843=Troopers are armed with the SIG Sauer P226 chambered in .357 SIG. In 2013, Texas DPS officials announced that they would be switching to the Smith & Wesson M&P 9-millimeter handgun as the standard-issue sidearm for troopers, due to higher round capacity over the SIG Sauer. Troopers already issued .357 sidearms would be allowed to continue using them.[17] However, the transition was suspended after recruits at the A-2014 class, the first to train with the new weapons, reported functional concerns about the guns after repeated firing.[18], 56003=Patrolmen Holloway Daniel \"H.D.\" Murphy and Edward Bryan Wheeler, both stationed in Fort Worth, were on routine patrol on State Highway 114 in Grapevine when they noticed a car parked on intersecting Dove Road. Believing the vehicle's occupants were in need of assistance, the troopers approached the car. They were unaware that the car's occupants were Bonnie Parker, Clyde Barrow, and Henry Methvin, outlaws wanted in several states for a string of robberies, kidnappings, and murders - including those of multiple police officers - that began in 1932 and had brought the gang nationwide attention., 34849=Operation Border Star was replaced in 2014 by Operation Strong Safety., 41967=In 2012, the Texas DPS decided to replace its aging fleet of Ford Crown Victorias with Dodge Chargers. A small number of Ford's Explorer-based Police Interceptor Utility vehicles were purchased for use mainly in the Texas Panhandle.[15], 49143=As of fiscal year 2010, troopers were being paid almost 20% less than officers in many municipal police departments, according to a state-conducted audit. Consequently, increased salaries for troopers were approved for 2014 by the 2012 Texas legislative session., 55773=The Grapevine Slayings were the murders of two Texas Highway Patrolman on April 1, 1934 by members of the Barrow Gang, popularly known as Bonnie and Clyde.}", "lastModified": "Fri, 31 Jul 2015 01:15:46 GMT", "textBeforeTable": "The causes of death are as follows: Since the establishment of the Texas Highway Patrol, 84 troopers have died in the line of duty. Fallen officers[edit] Asian: 1% African-American/Black: 11% Hispanic: 22% White: 66% Female: 5% Male: 95% Source: Demographics[edit] DPS also made an effort to fill state trooper vacancies. Recruitment efforts were increased across the country, particularly focusing on military members preparing to leave active duty. Recruiters traveled as far as California, North Carolina, and Michigan in search of potential applicants. In previous years, troopers who received promotions were typically required to move to fill available posts throughout the state. However, concurrent with the legislative decision to increase trooper pay, an internal decision was made by the Texas DPS to relax this method, allowing troopers to have more say in where they are stationed upon being promoted. The decision was based on a trend of troopers being required to live hours away from their families in order to prevent their spouses from having to leave steady employment.[19] Many changes to salaries and promotional requirements were made in response to a 10% drop in the number of troopers between 2004 and 2010, when an audit was conducted. The audit determined that Highway Patrol troopers were being paid far less annually than officers at many metropolitan police departments", "textAfterTable": "All fallen Highway Patrol troopers are publicly honored at the Texas Peace Officers' Memorial in Austin, a memorial at the Texas Department of Public Safety headquarters, and by various memorial markers throughout the state. Grapevine Slayings[edit] The Grapevine Slayings were the murders of two Texas Highway Patrolman on April 1, 1934 by members of the Barrow Gang, popularly known as Bonnie and Clyde. Patrolmen Holloway Daniel \"H.D.\" Murphy and Edward Bryan Wheeler, both stationed in Fort Worth, were on routine patrol on State Highway 114 in Grapevine when they noticed a car parked on intersecting Dove Road. Believing the vehicle's occupants were in need of assistance, the troopers approached the car. They were unaware that the car's occupants were Bonnie Parker, Clyde Barrow, and Henry Methvin, outlaws wanted in several states for a string of robberies, kidnappings, and murders - including those of multiple police officers - that began in 1932 and had brought the gang nationwide attention. As the patrolmen approached the car, they were unexpectedly met with gunfire. Trooper Wheeler was struck first and was killed instantly, his service weapon still holstered. Upon witnessing the death of his colleague, Trooper Murphy, a recent academy graduate on one of his first patrols, attempted to retrieve a shotgun from his motorcycle. However, he was shot before he", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}