{"relation": [["Catcher", "Brad Ausmus", "Russell Martin", "Jason Varitek", "Jose Molina", "Joe Mauer", "Paul LoDuca", "Javier Lopez", "Brad Ausmus", "Jose Molina", "Johnny Estrada", "Brad Ausmus", "Jonathan Lucroy", "Jason Varitek", "Ramon Hernandez", "Tony Pena", "Joe Mauer", "Mike Scioscia", "Ramon Hernandez", "Russell Martin", "Carlton Fisk"], ["season", "2000", "2008", "2007", "2012", "2010", "2003", "2000", "2005", "2008", "2004", "2006", "2011", "2002", "2002", "1991", "2005", "1989", "2001", "2010", "1990"], ["pitches", "10863", "10861", "9404", "6347", "7778", "9057", "9615", "8576", "6665", "9127", "9282", "9637", "9202", "9298", "9954", "7461", "8353", "9756", "7138", "7733"], ["Run Value", "36", "30", "26", "25", "23", "23", "23", "22", "22", "21", "20", "20", "19", "19", "18", "18", "18", "18", "18", "18"]], "pageTitle": "Baseball Prospectus | The Stats Go Marching In: Catcher Framing Before PITCHf/x", "title": "", "url": "https://baseballprospectus.com/article.php?articleid=20596", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 7, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986423.95/warc/CC-MAIN-20150728002306-00025-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 868270643, "recordOffset": 868244778, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{17754=2000, 16859=Enough talk—here are the 20 best RetroFraming seasons since 1988., 25259=1990, 14170=Given the good agreement of RetroFraming with the PITCHf/x-based numbers, we can move on to showing some numbers going back to 1988, keeping in mind that we’ll less likely see extreme values with this metric., 23362=1991, 14393=Single-season achievements The best catcher-framing season of the last quarter century belongs to Brad Ausmus, with 36 runs saved for the 2000 Detroit Tigers., 12601=Comparing Retrosheet and PITCHf/x numbers Obviously, the first thing to do before calculating and showing numbers going back to 1988 is to test how the rankings based on Retrosheet-only data compare with the PITCHf/x version for the years that have the more detailed data., 7813=May 16, 2013, 18638=2007, 24138=1989, 9781=The Method Going back to 1988, Retrosheet has data with a fair degree of completeness for pitch sequences, indicating the outcome (ball, called strike, swinging strike, foul, and so on) of every pitch thrown., 22103=2011, 21323=2004, 24479=2001, 13742=One important difference between the two methods is the distribution of ratings. The PITCHf/x-based numbers are more dispersed: when one considers catcher-seasons with at least 1500 pitches caught, the standard deviation is close to 13 runs for the PITCHf/x numbers and about 7.5 for the Retrosheet ones. That means the Retrosheet-based values (I’ll call them “RetroFraming”) will yield more conservative results., 20546=2005, 32196=41128, 19749=2003, 18975=2012, 18197=2008, 12911=Let’s start by showing a scatterplot featuring framing runs saved (prorated to 5,000 pitches caught*) by catchers in the seasons from 2008 to 2012. The darker dots denote a higher number of pitches caught, signifying more reliable estimates., 60369=This is awesome. Is there a particular reason that Scoscia had such a great season in 1989 yet fares so poorly in the overall analysis?, 21660=2006, 19412=2010, 22442=2002, 48598=Here's one from ex-BPer Dan Turkenkopf: http://blog.stealingfirst.com/2008/04/02/switching-a-ball-to-a-strike/, 74708=Copyright © 1996-2015 Baseball Prospectus, LLC.            Surprise Me!, 14803=Here a note is due. In the previous section, I warned that RetroFraming numbers give more conservative results: in fact, there is no trace of a 50-run season. A recent revision of my algorithm has changed Jose Molina’s PITCHf/x framing value for 2012 to 41 runs, but that would still make it higher than Ausmus’ 2000. RetroFraming has Molina’s 2012 at 25 runs saved, which is quite a difference.}", "lastModified": "Wed, 29 Jul 2015 11:38:14 GMT", "textBeforeTable": "Enough talk—here are the 20 best RetroFraming seasons since 1988. Teams with analytically minded front offices are already making seven-figure decisions based on numbers like these. The PITCHf/x-based method is more precise and less likely to be pulling in other aspects of a catcher’s defensive performance, so for seasons where both methods are available, I would tend to trust its output over the Retrosheet estimate. If you’re skeptical that the big numbers associated with the PITCHf/x approach could be accurate, Mitchel Lichtman’s testing from last year might lay some of your concerns to rest.   According to either method, a good framing catcher can be expected to bring his team a handful of extra wins in a single season.   There are two metrics that strongly agree: no catcher over the past five years is rated above average by one and below average by the other.   I know such discrepancies can be enough for some people to turn away altogether from this article and others on framing, as they often do when two play-by-play-based fielding metrics disagree on an evaluation of any position player. However, what I make of these numbers is this: Here a note is due. In the previous section, I warned that RetroFraming numbers give more conservative results: in fact, there is no trace of a 50-run season. A recent revision of my algorithm has changed Jose Molina’s PITCHf/x", "textAfterTable": "At age 40 Carlton Fisk was still capable of a top-20 season. In a subsequent section, I’ll take a look at aging curves for the framing skill. In case you’re wondering, the worst season belongs to framing whipping-boy Ryan Doumit (2008) by a mile, with Jason Kendall (2000) and Jorge Posada (2005) just a bit better. Career framers Ausmus also gets the career laurel as the cumulative king of framing for the past quarter century. In an 18-year career behind the plate, he added roughly one win per season through his ability to earn extra strike calls. Once more, the purported divide between scouting and statistical analysis is revealed to be a false one: way before numbers-based discussions on framing were made, teams were willing to give playing time to weak-hitting catchers like Ausmus because of their defensive ability. Catcher pitches Run value Brad Ausmus 135045 179 Jose Molina 49116 122 Jason Varitek 107444 111 Joe Mauer 58510 102 Russell Martin 67441", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}