{"relation": [["Description", "Processor", "Operating System", "Memory", "Dimensions", "Weight", "Graphics", "Optical Drive", "Sound", "Hard Disk Drive", "Integrated Comunications", "Connectors"], ["IdeaCentre A530 Desktop", "Intel® Core™ i7-4700MQ Intel® Core™ i5-4200HM Intel® Core™ i3-4000M", "Windows 8", "Up to 16GB DDR3-1600 MHz (2 DIMM slots)", "Monitor - 561 mm x 345 mm x 21.5 mm 22\" x 13.6\" x 0.8\" Base - only 32 mm x 211 mm x 337 mm 1.3\" x 8.3\" x 13.3\"", "9.8 kg / 21.6 lbs (average)", "NVIDIA® GeForce® 740A 2GB", "DVD / Blu-ray Disc™ RAMBO", "2.0 stereo speakers DVD /", "Up to 1TB HDD or up to 1TB hybrid SSHD storage", "WiFi 802.11 b/g/n, Bluetooth® 4.0 (optional)", "4 x USB 3.0, HDMI-out, HDMI-in, 6-in-1 card reader, mic, headphone"]], "pageTitle": "Lenovo A530 | 23\" All-in-One Desktop PC | | Lenovo Ireland", "title": "", "url": "http://shop.lenovo.com/ie/en/desktops/lenovo/a-series/a530/", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 1, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042981969.11/warc/CC-MAIN-20150728002301-00141-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 221967983, "recordOffset": 221895993, "tableOrientation": "HORIZONTAL", "TableContextTimeStampBeforeTable": "{121013=Ends 31st July}", "TableContextTimeStampAfterTable": "{20818=Limits: Orders limited to 5 computers per customer. For larger quantities, go to the “Where to Buy” section of the website for details of resellers and retailers of Lenovo products Digital River, International SARL is the authorised reseller and merchant of the products and services offered within this store. Offerings and Availability:All offers subject to availability. Offers, prices, specifications and availability may change without notice. Digital River will contact you and cancel your order if the product becomes unavailable or if there was a pricing or typographic error. Product offerings and specifications advertised on this website may be changed at any time and without notice. Models pictured are for illustration purposes only. Lenovo is not responsible for photographic or typographic errors.. PCs shown here are shipped with an operating system. Prices: Web prices advertised include VAT. Prices and offers in the cart are subject to change until the order is submitted. *Pricing - savings referenced off regular Lenovo web prices. Reseller prices may differ from those advertised here. Battery: These systems do not support batteries that are not genuine Lenovo-made or authorised. Systems will continue to boot, but may not charge unauthorized batteries. Lenovo has no responsibility for the performance or safety of unauthorized batteries, and provides no warranties for failures or damage arising out of their use. **Battery life is based on the MobileMark® 2007 methodology and is an estimated maximum. Actual battery life may vary based on many factors, including screen brightness, active applications, features, power management settings, battery age and conditioning, and other customer preferences. General: Review key information provided by Microsoft®that may apply to your system purchase, including details on Windows 8, Windows 7, and potential upgrades/downgrades. Lenovo makes no representation or warranty regarding third-party products or services. Trademarks: Lenovo, ThinkPad, IdeaPad, ThinkCentre, ThinkStation and the Lenovo logo are trademarks of Lenovo. Microsoft, Windows, Windows NT, and the Windows logo are trademarks of Microsoft Corporation. Ultrabook, Celeron, Celeron Inside, Core Inside, Intel, Intel Logo, Intel Atom, Intel Atom Inside, Intel Core, Intel Inside, Intel Inside Logo, Intel vPro, Itanium, Itanium Inside, Pentium, Pentium Inside, vPro Inside, Xeon, and Xeon Inside are trademarks of Intel Corporation in the U.S. and/or other countries. Other company, product or service names may be trademarks or service marks of others. © Lenovo 2015. All rights reserved.}", "lastModified": "Tue, 28 Jul 2015 03:29:52 GMT", "textBeforeTable": "--> No Additional Links No User Guide Lenovo A530 DesktopTech Specs Tech Specs About Reevoo Read more reviews Scores 8.0 out of 10 based on 4 reviews 8.0 Overall rating 7.0 Value for money 7.3", "textAfterTable": "Software Offerings Offerings Description SECURITY AND SUPPORT Lenovo® Assistant Lenovo® Companion Lenovo® Eye Distancing Lenovo® Rescue System Lenovo® Support McAfee LiveSafe Security (30-day free trial) PRODUCTIVITY CyberLink Power2Go Lenovo® Cloud Storage by Sugar Sync Microsoft® Office 2010 Nitro PDF Reader Offerings Description MULTIMEDIA Lenovo® Education Portal Lenovo® Game Portal Dolby® Home Theater V4 CyberLink Power DVD FilmOn INTERNET SOLUTIONS Bookmark Toolbar IE 10 Accessories & Services Lenovo A530 DesktopAccessories & Services Microsoft Office Lenovo N70 A Wireless Laser Mouse (0B44660) The N70A Wirless Laser Mouse is a three-button device with a nano dongle that uses 2.4G wireless technology for ease of control and a laser sensor for precision tracking.", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}