{"relation": [["Molecular Function", "transcription regulatory region DNA binding", "nucleic acid binding transcription factor activity", "sequence-specific DNA binding RNA polymerase II transcription factor activity", "transcription factor binding transcription factor activity", "sequence-specific DNA binding", "transcription regulatory region sequence-specific DNA binding", "RNA polymerase II regulatory region DNA binding"], ["IC (bits)", "1.448", "1.656", "1.997", "1.506", "1.722", "2.027", "2.12"], ["H-Score", "38.43", "27.83", "7.81", "5.88", "5.26", "5.1", "4.8"]], "pageTitle": "Domain assignment for YBR150C from Saccharomyces cerevisiae SGD", "title": "", "url": "http://supfam.org/SUPERFAMILY/cgi-bin/gene.cgi?genome=sc&seqid=YBR150C", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 6, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990611.52/warc/CC-MAIN-20150728002310-00024-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 232621713, "recordOffset": 232613511, "tableOrientation": "HORIZONTAL", "textBeforeTable": "Cellular Component Biological Process Molecular Function H-score (hypergeometric score) indicates the strength of assigning an ontological term to this domain architecture. Assignments with higher scores are of a better quality. Details for the methodology be found on the dcGO website. Information Content (IC) is an information theoretic score measured in bits of how informative it is to assign a given ontological term to a domain archtecture. The higher the score the more informative it is to talk about the term given the domain architecture. (show help) The top 10 most specific Gene Ontology terms for each namespace assigned to this domain architecture as determined by Gene Ontology term assignment details         Further Details: 0.0099 Colicin E immunity proteins Family 0.0641 Colicin E immunity proteins Superfamily E-value Classification Classification Level Region: 300-353", "textAfterTable": "5.26 transcription regulatory region sequence-specific DNA binding 2.027 5.1 RNA polymerase II regulatory region DNA binding 2.12 4.8 Biological Process IC (bits) H-Score positive regulation of transcription from RNA polymerase II promoter 1.46 42 positive regulation of transport 1.312 42 alcohol metabolic process 1.491 36.35 polyol metabolic process 2.009 36.35 single-organism carbohydrate metabolic process 1.414 36.35 interspecies interaction between organisms 1.586 27.89 cellular polysaccharide metabolic process 1.957 24.93 glucan metabolic process 2.152 24.93 response to lipid 1.438 24.16 cellular response to oxygen-containing compound 1.272 24.16 Protein sequence External link(s) Locus: YBR150C   Protein: S000000354 Sequence length 1094 Comment TBS1 SGDID:S000000354, Chr II from 544487-541203, reverse complement, Verified ORF, \"Putative protein of unknown function; the authentic, non-tagged protein is detected in highly purified mitochondria in high-throughput studies\" Sequence  MNMDSGITSSHGSMDKTQKQSSEWAANQKHNQRVENTRVLMGPAVPAMPPVPSNFPPVPT GTIMSPQLSPFPDHRLRHHPLAHMMPADKNFLAYNMESFKSRVTKACDYCRKRKIRCTEI EPISGKCRNCIKYNKDCTFHFHEELKRRREEALNNKGNGKSVKKPRLDKENKFKDENFDI AVRSRNTSSTDSSPKLHTNLSQEYIGVSAGKSASDKEDTWPDFVPIDRTVLEKIELNHTK VAGKVFVLEEICKNMKGTIEKLAEKSKIDVIDKEYMKRPKRKQYSKALLTKQKMFHFRQN VLSHLTDEEFLSPINEMFTTTFKYSILQTKLVLDFSFRSASSPSSDNILYPLPRLAIAKR LLKNIKCPSLASLLHIVDVDQCLQFADVHFDPAKGRLTSSQAFLLNICLCLGATVTNFEE KQELVDEDNHETYYFEKFELWRLRSFTFLNSVYYYHKLSVARADMTALKALLLLAKFAQQ KISASSAVKVLSVAIKVALDLRLNLHSTYEDLELDEIIKRRRLWCYCFSTDKFFSVVLSR PPFLKEENTDVLTDESYVELFRDKILPNLSIKYDDSKLEGVKDIVSVVNLLANHLEYVPY IQSYFLSRLSLIESQIYYSCFSIRTTLDDTLDEIIENVLENQKALDRMRDDLPTILSLEN YKENMRILSLDSSKLDFEVSCCTTILLHLRWYHQKITLSLFVISIIGDNLDQRESSRHDI AEIIRRSRLDFKRNCIEVLNILKDFEYYPTVQNEFLYFSLTTVFSMFLYLSEIMVNDEHA METGYIIGLLRDTHTRMLGSEERCLSVHNLKWQTSLFFYTFFLRSTMEKFNLTSKYAKFY AFDSNYYEGVLNRLVKHTRESKDDMVELLKTSFINKEKMAAFGSFVTEDQEKMEVSFNIF NEITIQDLNFLQFSSIPKLWENKTLEPGEEYHHSNGTNTDNNETTGADDTDDNNNNNNNN NKNGNNSSSTINNNNNNYSNSNNNDNDNNINDDDDDDDDDDDDDDDDDDDDDNDDDYSNN GADDDEEDDDYDRSLFPTGLASLLDASYPERTANDYRDENEQSNKLFEKIEGHLEHGVFF YDRDFFFKNVCVKM Download sequence", "hasKeyColumn": false, "keyColumnIndex": -1, "headerRowIndex": 0}