{"relation": [["Project Component", "Engineering & Design", "Construction", "Agency Cost", "Vehicles", "Claims", "(Subtotal)", "Inflation", "Cost of Capital", "Total Cost"], ["Actual DBOM Cost", "$75 M", "430 M", "25 M", "93 M", "0", "($623 M)", "0", "$107 M", "$730 M"], ["Design/Bid/Build Cost", "$86 M", "475 M", "65 M", "99 M", "20 M", "($745 M)", "45 M", "$285 M", "$1,075 M"]], "pageTitle": "Report to Congress on Public-Private Partnerships, 12/04 - United States Department of Transportation", "title": "", "url": "http://www.fhwa.dot.gov/reports/pppdec2004/index.htm", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 5, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989018.40/warc/CC-MAIN-20150728002309-00252-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 439662355, "recordOffset": 439484599, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{520886=[36] Ibid., Battelle, Performance-Based Contracting for the Highway Construction Industry: An Evaluation of the Use of Innovative Contracting and Performance Specifications in Highway Construction, Final Report prepared at the request of Koch Industries, Inc., Executive Summary, February 2003, 1., 9772=Figure 2.1 Sponsors and Features of Highway Financing Figure 2.2 Contracting Methods Involving Different Levels of Private Involvement Figure 2.3 Federal Finance Tools for Surface Transportation Projects Figure 2.4 GARVEEs: State Participation as of March 2004 Figure 2.5 State Infrastructure Banks: Pilot Program Participation as of March 2004 Figure 2.6 Hudson-Bergen Light Rail DBOM Example Figure 2.7 Transit Grant Anticipation Bond Issuances, 121354=The Task Force continues to explore ideas for improving the FHWA’s support for public-private partnerships and plans on developing several new products by the end of 2004., 571990=[289] Texas Comptroller of Public Accounts, Paving the Way: A Review of the Texas Department of Transportation, January 2001,. Chap. 4.2, 8, citing a telephone interview with Steve Richards, project manager, Morrison Knudsen, August 18, 2000. http://www.window.state.tx.us/txdot., 430698=This $130 million privately financed, fully automated facility is a 10-mile, four-lane toll project is located within the median of an existing eight-lane freeway between State Route 55 in Orange County and the Riverside County line. This project connects rapidly growing residential areas in Riverside and San Bernardino counties with major employment centers in Orange and Los Angeles counties. The facility was opened to traffic on December 27, 1995, and is America's first toll road to employ variable congestion pricing. To maintain free-flow conditions, tolls vary during the day with traffic volumes, directional flow, and other factors. The facility is the world's first fully automated toll road utilizing electronic transponders to collect tolls., 518935=[30] Ibid.; and “Transit Oriented Development: State of the Practice, Future Benefits,” Transit Cooperative Research Program (TCRP) Report No. 102, Federal Transit Administration, to be published in 2004., 541770=[111]Battelle, Performance-Based Contracting for the Highway Construction Industry: An Evaluation of the Use of Innovative Contracting and Performance Specifications in Highway Construction, Final Report, prepared at the request of Koch Industries, Inc., February 2003, 8. http://www.ncppp.org/resources/papers/battellereport.pdf., 536121=[89] Louisiana TIMED Program Web site, \"TIMED Program Fact Sheet,\" February 2004, http://www.timedla.com/upload/files/programoverview/program%20fact%20sheet.pdf., 226272=Recognizing the need to improve and maintain highway infrastructure despite limited public funds, Germany began updating its laws in 1994 and is now moving towards implementing public-private partnerships. Faced with nearly a half-trillion deutschmarks in needed improvements and only 20.8 billion deutschmarks budgeted toward improvements, Germany has recognized that it is no longer in a position to carry out all needed road inprovements from its tax revenues.[134] As a result, the German government has recognized the need to legally clear the way and facilitate public-private partnerships in transportation infrastructure., 592446=[405] \"Federal Credit Program: Ground Breaks on SR 125 South Toll Road,\" FHWA's Innovative Finance Quarterly, Vol. 9, No. 3, Summer 2003, http://www.fhwa.dot.gov/innovativefinance/ifq93.htm#federal_credit finance., 594355=[413] BridgePros Web site, “Tacoma Narrows Bridge,” Web site last updated February 6, 2004 (last accessed July 15, 2004), 555510=[183] U.S. General Accounting Office, Highways and Transit: Private Sector Sponsorship of and Investment in Major Projects Has Been Limited, (GAO-04-419), March 25, 2004, 21-22, http://www.gao.gov/new.items/d04419.pdf; Intermodal Surface Transportation Efficiency Act of 1991, Pub. L. No. 102-240, §1012(b), 105 Stat. 1914, 1938 (1991); and Transportation Equity Act for the 21st Century, Pub. L. No. 105-178, §1216, 112 Stat. 107, 211-214 (1998) as amended by the TEA 21 Restoration Act, Pub. L. No. 105-206, §9006(b), 112 Stat. 685, 848 (1998)., 425304=On April 15, 1996, the Utah Department of Transportation (UDOT) requested approval from the Federal Highway Administration (FHWA) to use design-build for the I-15 Corridor Reconstruction Project under the provisions of SEP-14. By utilizing repetitive bridge design and components bridge construction, productivity was greatly increased. The cost of the proposal for the base price plus construction and maintenance options was $1.352 billion, making this the largest single highway contract (traditional or design-build) in the country. As a part of the requirements of SEP-14, this project had an evaluation component throughout the duration of the project. Annual evaluation reports are available since 1998., 568607=[273] Congressional Budget Office, Innovative Financing of Highways: An Analysis of Proposals, January 1998, 51. http://www.cbo.gov/showdoc.cfm?index=320&sequence=0., 527979=[51] Battelle, Performance-Based Contracting for the Highway Construction Industry: An Evaluation of the Use of Innovative Contracting and Performance Specifications in Highway Construction, Final Report, prepared at the request of Koch Industries, Inc., February 2003, 44; see also, ibid., 11, “Generally design-build projects in the construction industry have shown substantial schedule reductions over traditional design-bid-build. Sanvido showed in a Construction Industry Institute research report that design-build projects were completed 33 percent earlier than design-bid-build projects based on 351 U.S. building projects from 1992-1997. Other advantages include a single point of responsibility for the project and the increased opportunity to use innovative designs, materials, and construction methods and techniques.” http://www.ncppp.org/resources/papers/battellereport.pdf., 520011=[33] Mary E. Peters, Federal Highway Administrator, excerpts from remarks as prepared for delivery to Associated General Contractors of America (AGC), 85th Annual Convention Highway and Transportation Contractors Division Meeting, Orlando, Florida, March 12, 2004. http://www.fhwa.dot.gov/pressroom/re040312.htm., 69944=In the late 1980s some States began exploring the potential for the private sector to augment State highway construction programs. About this time, States also began exploring ways to expedite highway construction while maintaining quality and reducing the impact on the traveling public. Under the auspices of FHWA’s SEP-14, created in 1990, States began to evaluate several potential contracting options, including cost-plus-time bidding, lane rental, and the use of warranties for specific project features. States also began evaluating the use of design-build contracting, especially for the more complex projects that are being constructed today to shift cost exposure to the private sector design-build contractor. Use of alternative contracting techniques continues to grow around the country, primarily for projects with tight timetables or high impact on the traveling public., 556471=[185] Congressional Budget Office, Toll Roads: A Review of Recent Experience, February 1997, 20. http://www.cbo.gov/showdoc.cfm?index=4014&sequence=0., 570064=[280] Congressional Budget Office, Toll Roads: A Review of Recent Experience, February 1997, 19. http://www.cbo.gov/showdoc.cfm?index=4014&sequence=0., 540447=[108] Battelle, Performance-Based Contracting for the Highway Construction Industry: An Evaluation of the Use of Innovative Contracting and Performance Specifications in Highway Construction, Final Report, prepared at the request of Koch Industries, Inc., February 2003, 15. http://www.ncppp.org/resources/papers/battellereport.pdf., 553799=[175] Duane D. Stanford, “A GA 316 Makeover: Toll Road to Athens? Contractors Pay Now, Collect Later,” The Atlanta Journal-Constitution, January 22, 2004, A1., 480246=Funds made available through TIFIA credit instruments. TIFIA is the most complex and most far reaching of the credit assistance programs. Because funds can be made available directly to a public-private partnership, it is often viewed as the most critical transportation program created by Congress that is aimed at the public-private partnerships discussed in this report. Certain Federal conditions apply comprehensively to an action that is the beneficiary of a TIFIA loan. These include Title VI of the Civil Rights Act of 1964, NEPA, and the Uniform Act. Other Federal requirements would apply to the same extent that would be the case if the TIFIA project were to be funded with grant funds (i.e., Davis-Bacon, DBE). Thus, the extent to which Federal conditions apply depends upon what types of funds are being applied to the specific construction project contract being undertaken by the recipient of the TIFIA loan., 534593=[83] Texas Comptroller of Public Accounts, Paving the Way: A Review of the Texas Department of Transportation, January 2001,. Chap. 4.2, 5, citing “Work Thrives in San Antonio,” Engineering News-Record, June 5, 2000, 16. http://www.window.state.tx.us/txdot., 219948=In the past decade, the use of public-private partnerships in the United Kingdom has proved a remarkable remedy. A recent survey by Her Majesty’s Treasury shows that out of 61 public-private partnership projects, nearly 90 percent were completed early or on time.[126] Projects that were not completed on time were completed within three months of the scheduled completion date.[127] As a result of these successes, Britain has sought to utilize public-private partnerships to a much greater extent; in 2003-2004 investment is projected to make up 11 percent of total investment in public services (approximately $61.3 billion). A total of 451 public-private partnership projects have been completed, including 34 hospitals and 239 new and refurbished schools., 249718=Another example is a poll conducted by the Chicago Tribune in 2001 in response to the Governor's proposal to phase-out toll roads in Illinois.[189] The poll indicated that a majority of those polled opposed the plan to eliminate tolls. Statewide, 41 percent of those persons surveyed disapproved of the Governor's proposal and 37 percent supported it. [190] Among those polled that use the Illinois toll roads on a regular basis 54 percent opposed the proposal, whereas 41 percent supported the proposal.[191] One of the more significant findings of the poll was the overwhelming opposition to an increase in the State's gas tax—almost 75 percent of those surveyed opposed such an increase.[192] Furthermore, 80 percent of those surveyed who live outside the Chicago area and 70 percent of those surveyed who live in the Chicago area opposed using gas tax revenue to compensate for lost toll revenue.[193], 286891=Also, relatively small construction firms can contract jointly with engineering firms to provide the expertise required under a design-build contract, which may result in greater competition. Experience indicates that large projects are in reality done by local subcontractors. When the E-470 Authority in Colorado entered into a $321 million design-build contract in 1995 with Morrison Knudsen and Fluor Daniel, they subcontracted all of the construction work to local contractors.[289], 566705=[264] Amy Oakes, \"Work on Part of Route 125 Under Way: The Southern Portion Has Been Much Delayed,\" San Diego Union-Tribune, September 13, 2003, B7., 533185=[76] Dr. Keith Molenaar, The Design-Build Pilot Project Evaluation: A Measurement for the Process, Time, Cost, and Quality, SR 500 Thurston Way Interchange in Vancouver, WA, prepared at the request of the Washington State Department of Transportation, January 2003, Executive Summary. http://www.wsdot.wa.gov/biz/InnvContract/pdf/finalrptDBUofCo.pdf., 130051=Following three years of renovation at a cost of $160 million, Union Station reopened on September 29, 1988. Union Station was redeveloped as a bustling retail center and intermodal transportation facility, connecting the Washington Metro with Amtrak, the Maryland Area Rail Commuter, the Virginia Railway Express, intercity buses, and Metro bus service. In addition to over 130 unique shops and restaurants, Union Station is the hub for Amtrak's headquarters and executive offices., 118139=On May 14, 2003, the Administration transmitted the Safe, Accountable, Flexible, and Efficient Transportation Equity Act of 2003 (SAFETEA) to the Congress for consideration.[27] This legislation included several proposals that would encourage the formation of public-private partnerships. Subsequently, both the House of Representatives and the Senate introduced their own surface transportation reauthorization proposals.[28] These Congressional proposals included several concepts that were part of the Administration’s SAFETEA proposal. At the time of this report, Congress was still considering these surface transportation reauthorization bills. These provisions are discussed in greater detail in Chapter VI, U.S. DOT Recommendations., 1122=This document is also available for download in PDF format: pppdec2004 (878 KB). Best for Printing To view PDF files, you can use the Adobe® Reader®., 514145=[6] National Council for Public Private Partnerships, AECOM CONSULT, and Parsons Brinckerhoff, Ltd., \"Partnerships in Transportation Workshops, Final Report\" prepared at the request of the Federal Highway Administration, March 17, 2004, 2., 518137=[28] H.R. 3550, 108th Cong. (2003). The Senate amended S.1072 by striking the Administration’s bill and substituting the Senate proposal., 526860=[45] Texas Comptroller of Public Accounts, Paving the Way: A Review of the Texas Department of Transportation, January 2001,. Chap. 4.1, citing Utah Technology Transfer Center, “Warranty Best Practices Guide,” 5 (http://www.ic.usu.edu/IC-Overview/Warranty/warranty%20implimentation%20best.htm). http://www.window.state.tx.us/txdot., 96577=States are finding GARVEEs to be an attractive financing mechanism to bridge funding gaps and accelerate construction of major corridor projects. As of June 2004, 10 States and the Virgin Islands have issued just over $5 billion in GARVEE bonds. Figure 2.4 illustrates what States have issued GARVEEs, what States have the authority to issue GARVEEs, and considering or seeking the authority to issue GARVEEs as of June 2004. Ohio, the first State to leverage Federal dollars through GARVEEs, sold five GARVEE issues in the FY 1998-2004 period, totaling $439 million. The proceeds of these issues are helping to finance Spring-Sandusky corridor improvements, the new Maumee River Bridge, and the Southeast Ohio Plan., 589989=[395] Virginia Department of Transportation, “VDOT Opens Final Portion of the Pocahontas Parkway, Route 895,\" press release, October 22, 2002., 191355=As part of its implementation strategy to accelerate the remaining TIMED projects, the DOTD in December 2001 selected the Louisiana TIMED Managers (LTM) as the consultant team to assist with management of the program. LTM, serving as an extension of the DOTD staff, is a joint venture of Parsons Brinckerhoff, Gulf Engineers and Consultants, and the LPA Group. The multidisciplinary team is responsible for the financial management of the entire program as well as design management, right-of-way acquisition and relocation, construction engineering, and inspection. LTM is contractually obligated with incentives to achieve the TIMED program objectives and expedite completion of the TIMED program.[91], 525559=[40] Virginia Department of Transportation, “Route 288 Is In Full Gear – Construction Begins on Completing the Western Loop around Richmond. Public-Private Partnership Saves Money and Time on High Profile Road Project,” press release, May 31, 2001. http://www.virginiadot.org/infoservice/news/CO05312001-rt288.asp., 438327=Construction on the Thurston Way Interchange began in April 2001, and was completed by October 2002. The final project costs are estimated at $26.8 million, meeting the project targets and more than a year earlier than with the conventional design-bid-build method., 68861=Indeed, the Federal-Aid Highway Act of 1956, although allowing 2102 miles of existing toll roads to be incorporated into the original Interstate System, prohibited the use of Federal-aid funding for the construction of new toll Interstate highways. Tolls were only permitted on new bridges, tunnels, and approaches, provided an agreement was signed that would require these facilities to become free upon collection of sufficient tolls to liquidate any outstanding debt (“free-up agreements”). Federal law has changed a number of times since 1956, with regard to the use of Federal-aid funding on the Interstate System and on other highway facilities. Currently, 23 U.S.C 301 continues to restrict tolling on federally aided facilities, except as provided under 23 U.S.C. 129 and two pilot programs., 526375=[43] Battelle, Performance-Based Contracting for the Highway Construction Industry: An Evaluation of the Use of Innovative Contracting and Performance Specifications in Highway Construction, Final Report, prepared at the request of Koch Industries, Inc., February 2003, 6. http://www.ncppp.org/resources/papers/battellereport.pdf., 434552=To finance the Greenway, investors put up $40 million in cash and secured $310 million in privately placed taxable debt. Ten institutional investors led by CIGNA Investments, Prudential Power Funding Associates (a unit of the Prudential Insurance Company of America), and John Hancock Mutual Life Insurance Company provided $258 million in long-term, fixed-rate notes (due in 2022 and 2026). Three banks (Barclays, NationsBank, and Deutsche Bank AG) agreed to provide part of the construction funding and $40 million in revolving credit. Loans are to be repaid with toll revenues, and the financing is secured by a first mortgage and security interest in the developer's right, title, and interest in the facility., 520401=[34] Battelle, Performance-Based Contracting for the Highway Construction Industry: An Evaluation of the Use of Innovative Contracting and Performance Specifications in Highway Construction, Final Report prepared at the request of Koch Industries, Inc., February 2003, 2. http://www.ncppp.org/resources/papers/battellereport.pdf., 551604=[164] Apogee Research, Inc., Summary of the Federal Highway Administration's Symposium on Overcoming Barriers to Public-Private Partnerships, prepared at the request of the Federal Highway Administration, (FHWA-PL-94-026), May 1994, 11., 531750=[71] Battelle, Performance-Based Contracting for the Highway Construction Industry: An Evaluation of the Use of Innovative Contracting and Performance Specifications in Highway Construction, Final Report, prepared at the request of Koch Industries, Inc., February 2003, 9. http://www.ncppp.org/resources/papers/battellereport.pdf., 516578=[20] Department of Defense and Emergency Supplemental Appropriations for Recovery from and Response to Terrorist Attacks on the United States Act, 2002, Pub. L. No. 107-117, § 1108, 115 Stat. 2230, 2332 (2002)., 236265=Despite the fact that 28 States have taken legislative action to accommodate the use of design-build, State procurement laws continue to be an impediment to using the design-build project delivery method in the public sector. In ZweigWhites’s 2003 Design-Build Survey of Design and Construction firms, nearly half (46 percent) of the survey respondents report that procurement laws in their States have effectively shut them out of acquiring public-sector design-build work.[158] This percentage is the highest in the six years that ZweigWhite has conducted the Design-Build survey.[159], 599255=[437] Surface Transportation Assistance Act of 1982, Pub. L. No. 97-424, § 165, 96 Stat. 2097, 2136-2137 (1983)., 532236=[73] Alameda Corridor Transportation Authority, “Alameda Corridor Readies Mid-Corridor Design-Build Contract for Approval,” press release, Oct. 1, 1998, http://www.acta.org/Releases/releases_18.html., 169515=SR 91 and SR 125 South projects: In 1989, the California legislature passed AB 680, which allowed for the creation of highway franchises. AB 80 amended State law to permit the State of California to award franchise agreements for the design, construction, operations and maintenance of highway facilities. This created two of the most innovative road procurements in the Nation. The toll financing for these procurements allowed these projects to be built far sooner than scheduled. A California Department of Transportation (Caltrans) official told GAO the State had identified the need to add lanes to SR 91 in 1983 and had proposed adding High Occupancy Vehicle lanes in 1988. The SR 91 Express Lanes opened in 1995 but would likely not have been built until 2001 without private-sector involvement.[61] State Road 91 was privately financed at a cost of $125.6 million, paid for mostly through a combination of equity and bank and institutional debt.[62] The project generates revenue through tolling, with the toll prices varying by time of day though “congestion management pricing.” Revenue has increased steadily in recent years, as the volume of traffic increased from 7.3 million trips in 1999 to 9.5 million in 2002, and revenue increasing from $19.5 million in 1999 to $29 million in 2002., 530787=[67] Congressional Budget Office, Innovative Financing of Highways: An Analysis of Proposals, January 1998, Chap. 5, 6. http://www.cbo.gov/showdoc.cfm?index=320&sequence=0., 79705=In the early 1990s, the FHWA gave SEP-14 approval to hundreds of cost-plus-time bidding, lane rental and warranty projects. Since 1990, over 300 design-build projects have been approved under SEP-14. Most States have used at least one of the innovative practices under SEP-14. In 1995, based on the collective experience of the States, the FHWA decided that cost-plus-time bidding, lane rental, and warranty clauses were techniques suitable for use on a nonexperimental, operational basis., 479641=Funds made available through a State Infrastructure Bank. Two SIB pilot programs are authorized, the first under section 350 of the National Highway System Designation Act of 1995 (NHS Act) and the second under section 1511 of TEA-21.[423] Federal requirements do not apply to SIB assistance from repaid SIB loan funds for the 39 SIBs authorized under the 1995 National Highway System Act. Federal requirements do apply to SIB assistance from SIB repayments for SIBs authorized under the TEA-21 (2 currently in operation)., 438911=State Route 125 is one of four different public-private partnerships authorized by the California legislature in 1991. SR 125 was designed as a toll road connecting the only commercial port of entry in San Diego to the regional freeway network, expanding international and regional trade in the area., 66145=The relationship between the new State Highway agencies and the Federal government that followed from the 1916 Act was strengthened by the Federal-Aid Highway Act of 1921, which created the State/Federal partnership—the hallmark of the program to this day., 569215=[275] Apogee Research, Inc., Implications of Change in Procedures and Laws to Advance Public-Private Partnerships, prepared at the request of the Federal Highway Administration , (FHWA-PL-95-026), April 30, 1995, 23., 273551=The SR 125 South project in San Diego, California, is an example of how the environmental process can cause significant delays in the development of a public-private partnership project. Although the California Department of Transportation (Caltrans) and California Transportation Ventures entered into a partnership agreement in 1989, challenges from environmental interests delayed the start of construction on the project until July 2003.[264] It was not until March 2003 that litigation challenging the final record of decision on the environmental impact statement for the project was resolved in favor of Caltrans.[265], 571432=[287] Figure from the Washington Group International, “New Ways of Doing Business in the 21st Century,” power point presented to the FHWA, March 2004., 550524=[158] “Study Finds State Procurement Laws Impeded Design/Build Use,” Concrete Products, April 1, 2003, http://concreteproducts.com/mag/concrete_study_finds_state/index.html. “Firms based in the Mid-Atlantic (63%), Mountain (57%), and North Central (45%) regions of the United States are most likely to report being shut out of public-sector design/build projects due to state procurement laws.”, 546571=[131] Bureau of Transport and Communications Economics, Working Paper 33: Benefits of Private Sector Involvement in Road Provision: A Look at the Evidence, 1996, http://www.bte.gov.au/docs/wp33.pdf., 601181=[447] U.S. General Accounting Office, Disadvantaged Businesses: Critical Information Is Needed to Understand Program Impact, (GAO-01-586), June 2001. 36. http://www.gao.gov/new.items/d01586.pdf., 85556=The innovative financing program was established using statutory authority granted under Section 307(a) of title 23 of the U.S. Code (now 23 U.S.C. 502). Section 307(a) permits the FHWA to engage in a wide range of research projects, including those related to highway finance. As part of this research effort, the FHWA tested selected policies and procedures so that specific transportation projects could be advanced through the use of non-traditional financing concepts, many of which were later enacted into law in the National Highway System Designation Act of 1995.[12] These non-traditional funding concepts included applying private funds to the State match or allowing partial obligations on advance construction projects., 597769=[431] Apogee Research, Inc., Implications of Change in Procedures and Laws to Advance Public-Private Partnerships, prepared at the request of the Federal Highway Administration , (FHWA-PL-95-026), April 30, 1995, 8., 557565=[194] Parsons Brinckerhoff and the Texas Transportation Institute, A Guide for HOT Lane Development, prepared at the request of the Federal Highway Administration (FHWA-OP-03-009), 2003, 82., 188822=The contract, signed by SCDOT in July 1999, calls for each CRM to assist SCDOT in more than $760 million worth of road and bridge work to be completed within seven years. By partnering with the CRMs, the SCDOT avoided having to hire an estimated 500 employees to handle the additional workload. This is the first public-private partnership of this magnitude in the United States. The FHWA has worked closely with SCDOT to administer this partnership and a number of other innovative financing programs.[87], 444414=Financing for the project is provided by both CODOT and the RTB. CODOT will finance $671 million through GARVEE bonds, and approximately $117 million through sales and use tax revenue. The RTD, through a full funding grant agreement, will provide $525 million, as well as $320 million in bond proceeds and $34 million from local funds. A law signed by Governor Bill Owens in 1999 allowed Colorado to use Transportation Revenue Anticipation Notes (TRANS) for budgeting purposes, permitting the project to proceed without having to divert funds from the State’s budget., 10907=Figure 4.1 Subcontractor Cost Analysis March 2004, 573044=[294] Intermodal Surface Transportation Efficiency Act of 1991, P.L. No. 102-204 § 1012 9 (b), 105 Stat. 1914, 1938 (1991); Transportation Equity Act for the 21st Century , P.L. No. 105-178, § 1216 (a), 112 Stat. 107, 211-212 (1998); and TEA-21Restoration Act, P.L. No. 105-206 § 9006 (b), 112 Stat. 685, 848 (1998)., 591031=[400] Battelle, Performance-Based Contracting for the Highway Construction Industry: An Evaluation of the Use of Innovative Contracting and Performance Specifications in Highway Construction, Final Report, prepared at the request of Koch Industries, Inc., February 2003, 33. http://www.ncppp.org/resources/papers/battellereport.pdf., 585736=[375] Apogee Research, Inc., Implications of Change in Procedures and Laws to Advance Public-Private Partnerships, prepared at the request of the Federal Highway Administration , (FHWA-PL-95-026), April 30, 1995, 11., 25838=House Report 108-243 (2003) accompanying the FY 2004 Department of Transportation Appropriations Act requested the U.S. Department of Transportation (DOT) to prepare a report identifying the impediments to the formation of large, capital-intensive highway and transit projects involving public-private partnerships. U.S. DOT was also asked to work with States and local entities to identify and eliminate existing impediments. This report addresses both of those goals by pulling from existing literature on public-private partnerships and by gathering comments from States, law firms, contractors, and trade associations with experience in these projects. These comments, gathered from stakeholders, do not necessarily represent the position of the U.S. DOT, but are included in response to the Committee on Appropriation’s request according to the direction given by the House Report., 567232=[266] Apogee Research, Inc., Implications of Change in Procedures and Laws to Advance Public-Private Partnerships, prepared at the request of the Federal Highway Administration , (FHWA-PL-95-026), April 30, 1995, 19., 568084=[271] Congressional Budget Office, Toll Roads: A Review of Recent Experience, February 1997, 19. http://www.cbo.gov/showdoc.cfm?index=4014&sequence=0., 564232=[246] Congressional Budget Office, Toll Roads: A Review of Recent Experience, February 1997, 17. http://www.cbo.gov/showdoc.cfm?index=4014&sequence=0., 551076=[160] “Survey Results Show Design/Build Is No Panacea,” Plumbing and Mechanical Magazine, March 2001, http://www.pmmag.com/pm/cda/articleinformation/features/bnp__features__item/0,,21876,00+en-uss_01dbc.html., 10411=Figure 3.1 Florida Cost and Time Overruns (1997-98) Figure 3.2 Eastern Federal Lands Highway Division Projects Construed Pursuant to the A+B Bidding Process Figure 3.3 Risk Matrix for Public-Private Partnerships Figure 3.4 Quality between Warranted and Non Warranted Projects in Wisconsin Figure 3.5 Innovative Building Approaches v. Traditional Procurement, 169011=Standard and Poor lowered the rating on the bonds from “stable” to “negative” in 2002 because of significantly lower traffic performance than had been expected. This lowered revenue to the point where the debt service reserve account had to be used to meet debt service requirements. At the time of the downgrade, average daily traffic stood at 10,000 transactions, 64 percent less than the 28,000 originally forecasted.[60], 515187=[12] National Highway System Designation Act of 1995, Pub. L. No. 104-59, §§308, 311, 313(b), and 322, 109 Stat. 568, 582-585 and 591 (1995)., 594935=[416]“State Public-Private Partnership Legal Score Card: Enabling Laws for Transportation Partnerships,” Public Works Financing, February 2004, 7; and information provided by Nossaman, Guthner, Knox & Elliott, LLP., 596837=[427] Isaiah J. Poole, \"Gas Tax Alternatives for a Nation on the Road,\" CQ Weekly, April 17, 2204, 919., 174494=For example, when the Dulles Greenway partially defaulted on its debt in 1996, Virginia was not liable for the debt, nor did the debt affect the State’s credit rating. Similarly, both the Pocahontas Parkway’s and Southern Connector’s bond ratings have been lowered to below investment grade; however, this has no effect on either Virginia’s or South Carolina’s credit ratings.[69] But, States that expect to utilize public-private partnerships as part of their long-term financial management strategy have an interest in not letting private bond ratings fall to the point where investors will not purchase future issues. Both the private and public sectors have much to learn about the public's willingness to pay tolls in different situations, and how to manage the risks of short-term revenue shortfalls., 20935=Developer Financing: a type of financing where a private party finances the construction or expansion of a public facility in exchange for the right to build residential housing, commercial stores, and/or industrial facilities on the site. This type of financing often takes the form of capacity credits, impact fees, or exactions. “Public-Private Partnerships: Terms Related to Building and Facility Partnerships.” GAO/GDD-99-71, April 1999, http://www.gao.gov/special/pubs/Gg99071.pdf, 576464=[315] Moody’s Investors Service, “Moody’s Analytic Approach To TIFIA: The Credit Impact Of The Springing Lien,” Municipal Credit Research, January 2002., 168051=The Connector 2000 Association financed the project costs of $217.7 million through the sale of tax-free toll revenue bonds, which will be repaid by toll revenue over a 35-year term.[57] The Connector 2000 Association is a local not-for-profit corporation set up to finance and operate a facility and is the first public-private transportation project in the United States to be financed using a 63-20 (not-for-profit, as defined by the IRS) corporation.[58] The bonds included $66.2 million in tax-exempt senior current interest bonds, $87.4 million in tax-exempt rated senior capital appreciation bonds, $46.6 million in tax-exempt unrated subordinate capital appreciation bonds, and a $17.5 million contribution from the South Carolina Department of Transportation.[59], 537434=[95] Battelle, Performance-Based Contracting for the Highway Construction Industry: An Evaluation of the Use of Innovative Contracting and Performance Specifications in Highway Construction, Final Report, prepared at the request of Koch Industries, Inc., February 2003, 22. http://www.ncppp.org/resources/papers/battellereport.pdf., 162794=One form of public-private partnership is emerging in the area of highway maintenance. As noted in the 2002 AASHTO “Guide for Methods and Procedures in Contract Maintenance,” States are procuring maintenance and preservation services in a variety of ways. Two distinct contracting methods are typically employed by the States. The most common type specifies the means and methods to be used to accomplish specific maintenance activities. This type of contract is referred to as specification-based. The other type of contract is performance-based, in which all risks for the maintenance of certain assets are transferred from the agency to the contractor in accordance with level-of-service requirements outlined in the contract. This form of procurement is often referred to as asset management. Although contracting out asset management may be new to many transportation agencies, a number of State agencies have been using these techniques for more than ten years. One example is the long-term contract for maintenance of 250 miles on several interstate routes in Virginia over a 5.5 year performance period., 554903=[181] U.S. General Accounting Office, Highways and Transit: Private Sector Sponsorship of and Investment in Major Projects Has Been Limited, (GAO-04-419), March 25, 2004, 21-22. http://www.gao.gov/new.items/d04419.pdf., 537916=[97] Mark A. Ehlen, “Life-cycle Costs of New Construction Materials,” Journal of Infrastructure Systems, Vol. 3 (December 1997), 129., 415535=By using a professional services contract to outsource design and construction management to the same company (the Project Development Contractor or PDC), the State was able to gain many of the efficiencies found in design-build projects -- flexibility, quicker construction, cost savings, and streamlined decisionmaking. The PDC contract was awarded to Mesa, LLC, a division of Koch Materials Company, in the summer of 1998. Project design was outsourced to CH2M HILL by Mesa, while Flatiron Structures Company managed the project construction., 568315=[272] Apogee Research, Inc., Implications of Change in Procedures and Laws to Advance Public-Private Partnerships, prepared at the request of the Federal Highway Administration, (FHWA-PL-95-026), April 30, 1995, 23., 561202=[219] Cherian George, William Streeter, and Scott Trommer, \"Bliss, Heartburn, and Toll Road Forecasts,\" Fitch Public Finance, November, 12, 2003, http://www.fitchibca.com/corporate/reports/report.cfm?rpt_id=189364&sector_flag=8&marketsector=1&detail., 560597=[216] Congressional Budget Office, Toll Roads: A Review of Recent Experience, February 1997, 18. http://www.cbo.gov/showdoc.cfm?index=4014&sequence=0., 108474=The TIFIA program, which was enacted in 1998 as part of TEA-21, allows U.S. DOT to provide direct credit assistance to sponsors of major transportation projects.[23] The TIFIA credit program offers three distinct types of financial assistance—direct loans, loan guarantees, and standby lines of credits. These instruments are designed to address the varying requirements of projects throughout their life cycles. The amount of Federal credit assistance may not exceed 33 percent of total eligible project costs. The TIFIA project sponsors may be public or private entities, including State and local governments, special purpose authorities, transportation improvement districts, and private firms or consortia., 567768=[270] Congressional Budget Office, Innovative Financing of Highways: An Analysis of Proposals, January 1998, 51. http://www.cbo.gov/showdoc.cfm?index=320&sequence=0., 525940=[41] Washington Group International, “New Ways of Doing Business in the 21st Century,” (power point presented to the FHWA) September 23, 2003., 158405=The FHWA anticipates that a final report will be available in late 2004., 282991=Subcontractor Cost Analysis March 2004[287], 527558=[48] “Technical Corner: New Mexico Corridor 44 Project Warranty,” FHWA's Innovative Finance Quarterly, Vol. 5, No. 2, Summer/Fall 1999, http://www.fhwa.dot.gov/innovativefinance/ifq52.htm#tech., 517982=[27] H.R. 2088, 108th Cong. (2003) and S.1072, 108th Cong. (2003)., 564941=[250] Apogee Research, Inc., Summary of the Federal Highway Administration's Symposium on Overcoming Barriers to Public-Private Partnerships, prepared at the request of the Federal Highway Administration, (FHWA-PL-94-026), May 1994, 13., 503624=Over the past decade, both the public and private sector have increasingly looked to design-build as the preferred project-delivery methodology because of its benefits of faster project delivery and reduced costs.[456] In recognition of this preference, the Transportation Equity Act for the 21st Century (TEA-21) authorized the use of design-build contracting for projects whose total project costs exceed $50 million ($5 million for Intelligent Transportation System (ITS) projects). TEA-21 also required the Secretary of Transportation to issue design-build regulations for the Federal-aid highway program.[457] Accordingly, the FHWA issued the design-build final rule on December 10, 2002, which took effect on January 9, 2003.[458], 598619=[435] Associated Builders and Contractors Web site, \"Associated Builders and Contractors Legislative Position of Prevailing Wage / Davis-Bacon Act,\" January 2004, http://www.abc.org/user-assets/Documents/Government%20Affairs/IssueBriefs/DavisBaconAct.pdf., 420543=In December 2000, Virginia DOT (VDOT) entered into a public private partnership with APAC-Virginia Inc. of Danville, Virginia to complete Route 288. This arrangement was made possible by the PPTA., 591440=[401] California Department of Transportation Innovative Finance Web site, “Private Investment Public Infrastructure – AB 680 Private Toll Road Program,” May 2003, http://www.dot.ca.gov., 570376=[282] Apogee Research, Inc., Implications of Change in Procedures and Laws to Advance Public-Private Partnerships, prepared at the request of the Federal Highway Administration , (FHWA-PL-95-026), April 30, 1995, 23., 539616=[104] Mervyn K. Lewis, “Risk Management in Public-Private Partnerships,” Center for Globalization and Europeanization of the Economy, Discussion Paper No. 12, CeGE Research Workshop at the George-August-University in Gottingen, Germany, June 2001, 13. http://www.cege.wiso.uni-goettingen.de/Dokumente/Diskussion/discuss_12.pdf., 224935=Several examples from Australia serve to highlight the benefits of public-private partnerships in road construction and maintenance. In Sydney’s Liverpool region, the responsibility for roadway maintenance switched during the years of 1991 and 1992 from the Road and Traffic Authority to a private contractor, Boral. During the same time, maintenance costs fell by 40 percent. The BTCE reports that the cost reduction was accomplished mainly though Boral’s flexible employment practices such as subcontracting and shifting work hours. Another example comes from the Clare District Council in rural South Australia. There, the Council divided its road grading work between public employees and private contractors as part of a pilot test. For the public employees, the cost per kilometer graded was about $60. For the private contractor, cost was a low $30. Finally, the governments of Queensland and the Northern Territory took different approaches to maintenance work on the Barkly Highway. Maintenance work on the Queensland stretch was done by public employees, while work on the Northern Territory portion was done by private contractors. For the public employees, the cost per kilometer of road maintained was $3,356, while for the private contractors costs were only $690., 403183=First stage of construction to begin 2005., 547616=[137] Apogee Research, Inc., Implications of Change in Procedures and Laws to Advance Public-Private Partnerships, prepared at the request of the Federal Highway Administration , (FHWA-PL-95-026), April 30, 1995, vi., 146720=In February 2003, Battelle, on behalf of Koch Industries, compared the use of traditional methods of contracting to the use of innovative contracting methods.[34] Although data comparing the use of innovative contracting with traditional procurement is rare, the case studies reviewed by Battelle found that the use of performance-based contracting, a form of public-private partnership, can result in cost savings ranging from 6 to 40 percent.[35] Appendix A includes a chart, prepared by Battelle, providing examples of construction and maintenance projects built by public-private partnerships and the cost savings for each. It should be noted that there are a lot of variations in the accuracy and quality of engineer estimates, so this may limit the utility of this comparison. FHWA is working to improve the accuracy and quality of engineer's estimates. Additionally, Appendices B and C provide additional information about projects built by public-private partnerships and any time and cost savings for these projects., 87910=Although TE-045, by design, provided no new Federal funds to participating States, the initiative has nonetheless supported significant increases in investment levels. The use of investment tools such as flexible match and section 129 loans resulted in additional funding being available to accelerate high priority projects that would otherwise have been deferred, or used to advance projects that likely would never have been constructed in the absence of TE-045.[15] As of March 2004, more than 100 projects with a total construction value of $7 billion have been approved., 441945=The project will add a High Occupancy Vehicle lane and an auxiliary lane in each direction, providing increased capacity to the most severely congested stretch of the SR 22. Construction is set to be complete in December of 2007., 602982=[457] Transportation Equity Act for the 21st Century, Pub. L. No. 105-178, §1307, 112 Stat. 107, 229-231 (1998)., 535261=[85] South Carolina Department of Transportation Web site, “SCDOT 27 in 7 Peak Performance: How South Carolina is Building 27 Years of Road and Bridge Projects in Just 7 Years,” http://www.dot.state.sc.us/inside/pdfs/27in7.pdf; and, Federal Highway Administration, FHWA Innovative Finance Primer, (FHWA-AD-02-004), April 2002, 45-46. http://www.fhwa.dot.gov/innovativefinance/ifp/ifprimer.pdf., 595830=[423] National Highway System Designation Act of 1995, Pub. L. No. 104-59, § 350, 109 Stat. 568, 618-622 (1995) and Transportation Equity Act for the 21st Century, Pub. L. No. 105,-178, §1511, 112 Stat. 107, 251-255 (1998)., 345132=On May 14, 2003, the Administration sent to Congress its surface transportation reauthorization proposal—SAFETEA. SAFETEA included a number of provisions to increase State and local flexibility and the efficiency of project delivery. At the time of writing, Congress was considering the surface transportation reauthorization legislation. The U.S. DOT believes that its SAFETEA proposals would help to overcome some of the impediments to the formation of public-private partnerships identified in Chapters IV and V of this report., 80204=On December 10, 2002, based on its experience with SEP-14 and as required by section 1307 of TEA-21, the FHWA issued a final rulemaking for the design-build contracting method. In keeping with the definition of a “qualified project” in section 1307, the FHWA Division Administrators were delegated the authority to approve design-build projects greater than $50 million on an operational basis and smaller design-build projects on an experimental basis under SEP-14. The FHWA’s 2002 final rule has two provisions that have a significant bearing on the use of Federal-aid highway funds and the Federal-aid approval process as it relates to the most innovative public-private partnerships. These two provisions are as follows:, 65699=The Federal-aid Highway Act of 1916 was a landmark piece of legislation that authorized $75 million for use on highways primarily in rural areas. It required each State to have a State highway agency with engineering professionals to carry out the Federal-aid highway program. This provision led to the formation of State Highway Departments in all States and further institutionalized the role of the State in providing major highways., 603417=[460] Nancy C. Smith, \"A Critique of FHWA's Proposed Draft Design-Build Regulations,\" Public Works Financing, November 2001, 1., 585012=[370] U.S. General Accounting Office, Highways and Transit: Private Sector Sponsorship of and Investment in Major Projects Has Been Limited, (GAO-04-419), March 25, 2004, 15. http://www.gao.gov/new.items/d04419.pdf., 594192=[412] Washington Group International, “Contemporary Transit Systems” presentation, June 2004., 562262=[226] Highway Economic Requirements System, Volume IV: Technical Report, Federal Highway Administration, December 2000., 513106=[1] The General Accounting Office officially changed its name to the Government Accountability Office on July 7, 2004., 117210=The FHWA also periodically sponsors a comprehensive Transportation Finance Conference with the Transportation Research Board. To date, three conferences have been held in 1997, 2000, and 2002. The objectives of these conferences are: (1) to educate Federal, State and local officials in new transportation infrastructure and operations financing mechanisms, their structure, and the benefits and costs of implementing such techniques; and (2) to explore the development of additional new funding mechanisms and sources. As part of these conferences, the FHWA holds pre-conference workshops on the state of the practice of transportation finance. Additionally, each year the FHWA conducts a transportation finance workshop during the annual meeting of the Transportation Research Board., 454051=The WVDOT estimates that the partnership will save roughly $145 million, bringing the estimated costs from $300 million down to $155 million. This same section’s start date may also be rescheduled, moving up from 2009 to sometime in 2004. Construction will also be shortened by one year., 178195=Utah I-15: This reconstruction project serves as an excellent example of the potential for time savings when using design-build. The I-15 project would have taken an estimated 7 years under traditional design-bid-build contracting, but was actually completed in 4.5 years using the design-build method.[71] The Utah Department of Transportation selected the design-build method in order to accelerate the reconstruction of I-15 before the opening of the 2002 Winter Olympic Games in Salt Lake City. The project required the reconstruction of 16.3 miles of highway, including the demolition and reconstruction of 142 bridges. The I-15 project was opened to traffic in May 2001, five months before the scheduled completion date of October 2001.[72], 540132=[106] Richard Norment, “PPPs - American Style,” The PFI Journal, 39 (October 2002), 27. http://www.ncppp.org/howpart/PFIArticle.pdf., 545755=[128] Torlid Skogsholm, Minister of Transport and Communications, welcoming address, the Fourth Annual PPP Forum, Oslo, Norway, October 20, 2003, http://odin.dep.no/sd/engelsk/aktuelt/nyheter/028051-990009/dok-bn.html., 122016=Private contracting has supported public transportation service since the inception of the Urban Mass Transportation Administration (now the Federal Transit Administration (FTA)) in 1964. Although public transportation is now provided almost entirely through municipal and State funded entities, these same public transportation services could not function without the private sector. Public transportation agencies regularly contract for revenue service, vehicle and non-vehicle maintenance, administrative and support services, and systems development., 405014=Legislative appropriations passed in May 2003. Regional Transportation Investment District (RTID) is developing a potential funding package for approval by the voters., 600204=[441] Isaiah J. Poole, \"Transportation Money Comes with Strings,\" CQ Weekly, April 10, 2004, 851., 570969=[286] This definition of \"mega-project\" is based on section 1802 of the Administration's surface transportation reauthorization proposal (Safe, Accountable, Flexible, and Efficient Transportation Equity Act of 2003 or \"SAFETEA\") that would amend 23 U.S.C. §106 to include, among other things, a $100 million threshold for financial planning and reporting requirements., 167696=The South Carolina Southern Connector: In 1998, after a proposal in the General Assembly to increase the motor fuel tax did not pass, the State authorized a private consortium to build the Southern Connector, which had been on South Carolina’s transportation plans since 1968.[56], 558350=[199] Parsons Brinckerhoff and the Texas Transportation Institute, A Guide for HOT Lane Development, prepared at the request of the Federal Highway Administration (FHWA-OP-03-009), 2003, 28., 37105=Chapter VI summarizes the U.S. DOT legislative proposals included in the Administration's surface transportation reauthorization proposal — the Safe, Accountable, Flexible, and Efficient Transportation Equity Act of 2003 (SAFETEA) — that should facilitate public-private partnerships., 403095=FEIS issued to January 2003. Record of Decision (ROD) signed by FHWA March 2003., 538444=[99] Steve Lockwood, Public and Private Roles in Highway Network Development:  An Agenda for Future Research on Institutions and Regulations, STELLA Conference on Transport and Sustainability , Athens, Greece, 2004, 2., 435616=The shortfall in toll revenues from the project has brought problems for its investors. They had projected toll revenues for the first year at $27 million; $7 million was to go for operating costs and $20 million toward the $30 million in annual interest. When those revenues did not materialize, the investors began to miss their quarterly interest payments of $7 million each. However, they won approval from lenders to skip the payments for the rest of the year, avoiding foreclosure through the end of 1997. In December 1997, the sponsors were discussing a further extension of their standstill agreement with the lenders., 22276=Public-Private Partnership: a contractual agreement formed between public and private sector partners, which allows more private sector participation than is traditional. The agreements usually involve a government agency contracting with a private company to renovate, construct, operate, maintain, and/or manage a facility or system. While the public sector usually retains ownership in the facility or system, the private party will be given additional decision rights in determining how the project or task will be completed. The term public-private partnership defines an expansive set of relationships from relatively simple contracts (e.g., A+B contracting), to development agreements that can be very complicated and technical (e.g., design-build-finance-operate-maintain). In the context of this report, the term public-private-partnership is used for any scenario under which the private sector would be more of a partner than they are under the traditional method of procurement. Further, the broad definition used for public-private partnerships includes many elements that are applied fairly regularly on appropriate projects. “Public-Private Partnerships: Terms Related to Building and Facility Partnerships.” GAO/GDD-99-71, April 1999, http://www.gao.gov/special/pubs/Gg99071.pdf, 105065=State Infrastructure Banks: Pilot Program Participation as of March 2004, 439947=The developers expect the project to be completed in October 2006, years ahead of when it would have been completed with traditional funding. The project is saving public monies with the infusion of investment by private entities acting in economic self-interest, such as local real estate developers who have donated $48 million of land for right-of-way, and the investors contributing more than $150 million in private at-risk equity. Private equity and financing have accounted for 78 percent of the project’s costs.[405], 67683=Immediately after World War II, States increasingly recognized that modern, high quality highway systems were needed to meet growing demands for personal and commercial travel. The Pennsylvania Turnpike was the first of the modern highways to be constructed, and it was an immediate success. Between 1945 and 1955, many States, mainly located in the North and East, began to build turnpikes on their primary intercity travel corridors. These turnpikes typically were administered by public turnpike commissions or turnpike authorities that usually were not part of the State highway agency, but were separate State agencies. They were not private enterprises as many of the earlier turnpike companies had been. The tradition of publicly-provided highways had become so deeply ingrained that few thought of involving the private sector in financing and operating highways. But, States also recognized that motorists were willing to pay tolls for the comfort, convenience and speed provided by the new turnpikes. By issuing bonds and charging tolls States could construct the needed highways much sooner than if they had to finance them primarily from fuel tax revenues., 586951=[382] Battelle, Performance-Based Contracting for the Highway Construction Industry: An Evaluation of the Use of Innovative Contracting and Performance Specifications in Highway Construction, Final Report, prepared at the request of Koch Industries, Inc., February 2003, 25-28. http://www.ncppp.org/resources/papers/battellereport.pdf., 575385=[309] Apogee Research, Inc., Summary of the Federal Highway Administration's Symposium on Overcoming Barriers to Public-Private Partnerships, prepared at the request of the Federal Highway Administration, (FHWA-PL-94-026), May 1994, 12., 186619=Innovative ways to manage projects can also result in access to alternative funding and project efficiencies that will result in significant time savings. South Carolina and Louisiana have each developed nontraditional programs to deliver much needed transportation facilities sooner than could be achieved through conventional contracting methods. Through the use of innovative financing mechanisms and private sector management resources, these two States have been able to drastically cut the construction time for transportation projects. In South Carolina, the South Carolina Department of Transportation (SCDOT) is advancing 27 years of road and bridge projects in just seven years. Similarly, the Louisiana Department of Transportation and Development (DOTD) is scheduled to deliver 16 specific transportation projects by 2010., 125372=Joint Development is the use of public transportation property originally acquired with Federal grant dollars for transit-related development. This may occur in the form of development in air rights above a transit station, or it may involve the use of land area adjacent to the station. A 1992 study commissioned by the Federal Transit Administration identified 117 projects nationwide, involving a combination of air-rights and ground lease arrangements.[29] These projects have generated ground rent, lease, or one-time access rights revenues for the public transportation provider. In these projects, the public transportation agency makes land or air rights available to a developer. In some instances, the agency is not able, under its charter, to participate in development activity (which would produce lease revenue), so it undertakes a cost-sharing agreement with the developer, who agrees to perform certain functions such as station maintenance, security, or access control, in exchange for the development opportunity. In most cases, however, the transit agency has collected substantial revenues. The Washington Metropolitan Area Transit Authority (WMATA) air rights agreement in Bethesda, Maryland for example, produces $1.6 million in rents annually., 171549=In the case of the SR 125 South Toll Road project, a $140 million TIFIA loan is an essential element of the project’s financial plan, which also includes senior bank debt as well as private equity. This project demonstrates how innovative finance can attract private investment to transportation projects. Over $150 million in private at-risk equity was invested in this project. In addition, local real estate developers are donating approximately $48 million of land for right-of-way. If the SR 125 South project had not been advanced as a private financed facility under AB 680, operation would have been delayed to 2020 or later, according to Caltrans., 517391=[25] Federal Highway Administration, Exploring Key Issues in Public-Private Partnerships for Highway Development, Searching for Solutions: A Policy Discussion Series, No. 2, (FHWA-PL-92-023), June 1992 ., 533609=[77] “Innovation Paves the Way for the Massachusetts Route 3 North Project,” FHWA's Innovative Finance Quarterly, Vol. 6, No. 3, Fall 2000, http://www.fhwa.dot.gov/innovativefinance/ifq63.htm., 598071=[432] Notice listing Federal environmental laws and Executive Order applicable to the development and review of transportation infrastructure projects, 69 Fed. Reg. 25451 (May 6,2004)., 276819=Another large risk for private investors is tort liability.[270] The Congressional Budget Office, in its 1997 memorandum on toll roads, noted that potential tort liability poses a significant risk to private investors in road projects.[271] Transportation projects are prone to incidents involving personal injury.[272] Accidents involving deaths, injuries, and damage to the environment (as might happen in multi-vehicle collisions or crashes with trucks carrying hazardous materials) may result in sizeable financial losses to the private partner.[273] Concerns about tort liability can affect the structuring of public-private partnerships. For example, the Government Accountability Office found that ownership of SR 91 was returned to the State because the private partner did not want to assume the tort liability for operating the toll road.[274] Because of tort liability, transactions may have to be structured in a way that does not produce the greatest public advantage., 602398=[454] Apogee Research, Inc., Implications of Change in Procedures and Laws to Advance Public-Private Partnerships, prepared at the request of the Federal Highway Administration , (FHWA-PL-95-026), April 30, 1995, 17., 419384=The massive bridge on the Pocahontas Parkway became the Vietnam Veterans Memorial Bridge on Sept. 20, the same day the remaining westbound lanes were opened to traffic; eastbound lanes and a portion of the westbound lanes opened in May. This bridge offers the area's third major James River crossing., 452397=About $800 million of tax-exempt bond financing is required to support the proposed Tacoma Narrows Bridge project. The state has funded $50 million and provided certain tax exemptions and tax deferrals that help to reduce the project costs. Upon opening, a toll will be charged to cross the new Tacoma Narrows Bridge in the eastbound direction. The toll will initially be set at $3.00. Future tolls will be set by the Transportation Commission with recommendations by the Citizen Advisory Committee appointed by the Governor. Citizen Committee members must reside within the project area. The project notice to proceed was provided to the design-builder in September 2002. The project is scheduled to be completed in early 2008., 442627=The $1.4 billion project was financed primarily through senior-lien revenue bonds ($1.079 billion). Additionally, a $120 million in standby Federal line of credit, $91 million in junior-lien bonds, $38 million in project revenue certificates, and other sources helped fund the project. The project’s sole sources of revenue are tolls, development impact fees, and interest earnings. Opening in 1996, the toll road is currently operating at 83 percent of projections., 248811=For example, a poll conducted in January 2004 by the Star Tribune in Minnesota found that those surveyed would be more willing to finance new highway construction with tolls, rather than an increase in the gas tax.[186] Of those polled, 69 percent indicated a preference for tolling to finance highway construction, rather than an increase in the State gas tax.[187] Only 23 percent of those polled indicated a preference for an increase in the State gas tax rather than tolls.[188] This poll was conducted by the newspaper to determine public opinion about the proposed regional \"Fast Lane\" network in the Twin Cities area. Tolls would be charged on new capacity added to existing freeways., 510888=One of the nine exemptions covers trade secrets and commercial or financial information that is obtained from a person and is privileged or confidential (“confidential business information”).[467] In addition, the courts have ruled that the Trade Secrets Act (18 U.S.C. 1905) is co-extensive with the FOIA exemption for confidential business information. Therefore, Federal agencies have an additional basis for withholding trade secrets that form part of a private sector proposal. If, in response to a FOIA request, the agency determines that it may be required to release material submitted that may or may not fall under the definition of confidential business information, the submitter will be notified prior to the agency’s final determination and given an opportunity to specify why these records should not be released. Pursuant to Executive Order 12600, this procedure is universally used across the Federal government and is an integral part of the U.S. DOT FOIA regulations.[468], 408882=The E-470 highway, one of the first roads in the nation built with a public-private partnership, was completed on January 3, 2003. At 47 miles in length, the toll highway runs along the eastern perimeter of the Denver metropolitan area from State Highway C-470 at I-25 south, running north along the western edge of the Denver International Airport, and eventually intersecting with I-25 North. The highway is managed by the E-470 Public Highway Authority, a consortium of local governments having jurisdiction over areas the highway passes through., 65251=Over time private involvement in highway infrastructure investment and operation declined as States and the Federal government increased the pace of road construction to open new lands and increase economic development. In 1806, the Federal government passed legislation to fund the National Road, also known as the Cumberland Road. This road stretched from Maryland through Pennsylvania, over the Cumberland Mountains, to the Ohio River., 536359=[90] \"Technical Corner: Accelerating Highway and Bridge Projects in Louisiana,\" FHWA's Innovative Finance Quarterly, Vol. 9, No. 2, Spring 2003, http://www.fhwa.dot.gov/innovativefinance/ifq92.htm#tech_corner., 213898=As a new approach to procurement, public-private partnerships create significant challenges to both the public and private sector partners. States using public-private partnerships have experienced an initial sharp increase in workload as they adapt their procedures for guaranteeing the timeliness, efficiency, and safety of a project to fit the unusual requirements of public-private partnerships. Virginia, for example, experienced a noticeable increase in the amount of time senior officials spent on projects built under the Public-Private Transportation Act of 1995. The private sector can also experience difficulties with public-private partnerships. Smaller contractors and designers have expressed concern that it is difficult for them to bid on public-private partnership work because the projects tend to be larger than their firms can manage. Public-private partnerships also tend to shift risks away from the public sector and toward the private sector. This shift in risk can frequently be so significant that smaller firms are not able to absorb it, and as a result, cannot bid on the work., 303117=Finally, the TIFIA program is an innovative example of using public-sector financial participation to leverage private capital. However, few transportation projects are undertaken in many States that meet the current $100 million threshold for the TIFIA program. Some suggest that the project cost threshold be reduced to at least $50 million to broaden the range of projects eligible for TIFIA.[317] Such a reduction in the project cost threshold was proposed by the Administration in the surface transportation reauthorization bill – the Safe, Accountable, Flexible, and Efficient Transportation Equity Act of 2003 or SAFETEA., 560223=[214] Apogee Research, Inc., Implications of Change in Procedures and Laws to Advance Public-Private Partnerships, prepared at the request of the Federal Highway Administration , (FHWA-PL-95-026), April 30, 1995, 12., 556702=[186] Laurie Blake, \"Minnesota Poll: 69% Comfortable with Toll Roads\" Star Tribune, January 28, 2004, 1A., 599978=[439] See 128 D.C.R. H8985 (Dec. 6, 1982)., 549213=[150] Congressional Budget Office, Innovative Financing of Highways: An Analysis of Proposals, January 1998, 37. http://www.cbo.gov/showdoc.cfm?index=320&sequence=0., 538741=[100] Mervyn K. Lewis, “Risk Management in Public-Private Partnerships,” Center for Globalization and Europeanization of the Economy, Discussion Paper No. 12, CeGE Research Workshop at the George-August-University in Gottingen, Germany, June 2001, 9. http://www.cege.wiso.uni-goettingen.de/Dokumente/Diskussion/discuss_12.pdf., 551917=[165] Apogee Research, Inc., Implications of Change in Procedures and Laws to Advance Public-Private Partnerships, prepared at the request of the Federal Highway Administration , (FHWA-PL-95-026), April 30, 1995, 11., 519759=[32] Mary E. Peters, Federal Highway Administrator, speech, Canal Road Intermodal Connector Meeting, Gulfport, Mississippi, October 21, 2003, http://fhwa.dot.gov/pressroom/re)31021.htm., 552869=[169] Virginia Department of Transportation, \"Public-Private Transportation Act of 1995 Implementation Guidelines,\" April 2001,http://www.virginiadot.org/business/resources/PPTA-overview.pdf., 603304=[459] 66 Fed. Reg. 53288, October 19, 2001., 540941=[110] Ibid., 5; see also Mervyn K. Lewis, “Risk Management in Public-Private Partnerships,” Center for Globalization and Europeanization of the Economy, Discussion Paper No. 12, CeGE Research Workshop at the George-August-University in Gottingen, Germany, June 2001, 11. http://www.cege.wiso.uni-goettingen.de/Dokumente/Diskussion/discuss_12.pdf , “Drafting the delivery specifications for a project in a manner that accurately and clearly communicates the requirements of the project that minimize any prescription as to how the service is to be delivered or the asset maintained encourages innovation among the bids concerning the range of service delivery options and pricing proposals, which should in turn provide government with value for money.”, 576707=[316] Committee Print 105-85, 105th Congress; 2nd Session; Transportation Equity Act for the 21st Century as amended by the TEA-21 Restoration Act Together with Explanatory Materials, 543 (October 1998)., 69670=Once construction of the Interstate System began, proposals for additional toll roads languished. By 1963, the last of the toll roads planned before Interstate System construction began opened, and few additional proposals were seriously considered for many years., 573456=[295] Karen J. Hedlund, The Case for Tax-Exempt Financing of Public-Private Partnerships, 1998, 5. http://www.reason.org/HEDLPDF.PDF., 550145=[155] National Society of Professional Engineers, “Design/Build in the Public Sector (#1726),”, July 1995, http://www.nspe.org/govrel/gr2-ps1726.asp., 574557=[303] Apogee Research, Inc., Implications of Change in Procedures and Laws to Advance Public-Private Partnerships, prepared at the request of the Federal Highway Administration , (FHWA-PL-95-026), April 30, 1995, 8., 554034=[176] Apogee Research, Inc., Summary of the Federal Highway Administration's Symposium on Overcoming Barriers to Public-Private Partnerships, prepared at the request of the Federal Highway Administration, (FHWA-PL-94-026), May 1994, 13., 423944=The rest of the project, from Lucks Lane to the Powhatan County line is expected to be completed by mid-2004. APAC-Virginia, Inc. oversees construction on the rest of Route 288, from the Powhatan County line to I-64 in Goochland County. This segment, funded under Virginia's Public-Private Transportation Act of 1995, is scheduling completion by mid-2004., 486157=Significant time and financial risk are associated with obtaining the proper environmental clearances and permits, particularly if an EIS is required.[431] In FY 2003, the median time for completing EISs for highway projects was slightly over five and one-half years. However, court challenges concerning the EIS process for a particular project can add time and cost to a project. In addition to the length of time, the uncertainty surrounding the amount of time to complete an EIS discourages the private sector from pursuing public-private partnerships., 599442=[438] See An Act to apportion certain funds for construction of the National System of Interstate and Defense Highways for fiscal year 1985 and to increase the amount authorized to be expended for emergency relief under Title 23, United States Code, and for other purposes, Pub. L. No. 98-229, § 10, 98 Stat. 55, 57 (1984); and Intermodal Surface Transportation Efficiency Act of 1991, Pub. L. No. 102-240, § 1048, 105 Stat. 1914, 1999-2000 (1991)., 92094=Toll credits are being used extensively by States with toll facilities. As of November 24, 2003, 21 States had accumulated $13.2 billion in toll credits. The credits are being applied in a variety of ways, depending on the State's needs. Missouri reserves its toll credits for situations where project matching funds are unavailable in order to effectively increase Federal funding to 100 percent of project costs. Ohio uses toll credits as a match on GARVEE projects and also shares its toll credits with local government agencies for both highway and transit projects. The Florida DOT has been applying toll credits on a statewide basis since 1993. Today Florida is using toll credits on almost every new Federal-aid project, so that most of its Federal highway program is effectively 100 percent federally funded, freeing up State dollars for State-administered projects. However, toll credits do not increase the funding available for transportation., 491623=In section 165 of the Surface Transporation Assistance Act of 1982, Congress required that all steel, cement, and manufactured products used in a project funded with money made available from the Federal-aid highway program must be manufuctured in the United States.[437] Subsequently, Congress amended this provision to include iron products and to remove cement products from its application.[438] In enacting section 165, Congress sought to address the U.S. trade deficit and unemployment, and to ensure that revenues generated by the Federal gasoline tax will be spent on American products.[439] In interpreting this provision, the FHWA has stated that the manufacturing of a product begins with the initial melting and mixing, and continues through the coating stage. Any process which modifies the chemical content, the physical size or shape, or the final finish is considered a manufacturing process. These processes include rolling, extruding, machining, bending, grinding, drilling, and coating. An exception to the Buy America requirements may be made when the purchase of such materials would cost 25 percent more than foreign alternatives; if the cost of such materials does not exceed one-tenth of one percent of the total contract cost or $2,500, whichever is greater; or if the FHWA grants a waiver.[440], 215014=In addition, private sector funding does not always ensure financial solvency when the project financing is secured by tolls or other revenue streams from the project. Sometimes public use is not as high as projected, resulting in revenues that are inadequate to pay off the debt on the project. An example of this is the Dulles Greenway, a project that was initially financed with equity contributions from the TRIP II partnership, bank loans, and long-term, fixed rate notes. After construction costs of roughly $340 million, the project ran into financial troubles. Traffic and revenues were initially lower than expected, in part due to improvements made by the State to a competing road, State Route 7. As a result, TRIP II went into default on its loans and note agreements in 1996. Refinancing occurred in 1996, allowing it to create project reserve funds and issue $370 million in senior bonds and $76 million in subordinate bonds. While the project is still yet to make a profit for its investors, development in the area is increasing and bringing with it increased usage of the Greenway.[121], 588782=[390] Cathy Proctor, “Final Leg of E-470 Nears Completion,” Denver Business Journal, December 12, 2002. http://www.bizjournals.com/denver/stories/2002/12/16/story1.html., 596522=[426] Congressional Budget Office, Innovative Financing of Highways: An Analysis of Proposals, January 1998, 9. http://www.cbo.gov/showdoc.cfm?index=320&sequence=0., 437457=In April of 1999, the Washington State Department of Transportation (WSDOT) began a project to build a new interchange at the intersection of Washington State Road 500 and Thurston Way. The new interchange was aimed at reconfiguring SR 500 traffic in an effort to improve safety, create better road conditions, improve pedestrian and bicycle connections, increase intersection capacity, and decrease congestion. This project became the first design-build endeavor in the State of Washington, allowing the WSDOT to accelerate the construction schedule and minimize construction costs., 435276=The Greenway opened to traffic in September 1995. Initially, the toll was $1.75 each way, but when traffic fell short of projected levels, the toll was reduced to $1.00. Lowering the toll attracted more users but not enough to increase total revenues. Consequently, in July 1997, the Greenway's operators raised the toll to $1.15., 129365=The public-private partnerships do not always involve the public transportation agency directly. In Washington, DC, for example, the Union Station redevelopment took place through an act of Congress, under the leadership of the U.S. Secretary of Transportation. In 1981, Congress enacted the Union Station Redevelopment Act of 1981, which called on Transportation Secretary Elizabeth Dole to develop an ambitious plan for the commercial development of the station with the goal of making it financially self-sufficient. A unique public-private partnership was formed to faithfully restore the building to its original state and create a viable mixed use transportation center., 226974=The Act Concerning the Private Financing of the Construction of Certain Parts of Highways came into force in 1994, providing the legal basis for privately financing highways and establishing the right of investors to charge toll fees. Yet the limited scope of the legislation only allowed such partnerships to be utilized in the construction of bridges, tunnels, and mountain roads. Proponents of public-private partnerships in Germany have called for the relaxation of laws so that private funding can finance more projects, and private entities can not only construct highways, but operate them as well. The private contractor could then either charge a toll for road use, or be paid by the State on a “shadow toll” basis.[135], 114604=The FHWA’s dialogue on public-private partnerships explored a very broad array of opportunities and challenges, with discussion ranging from “how-to” issues, such as the public sector’s role in overseeing subcontracts, to visionary possibilities of the private sector building and operating most projects and the public sector taking a subordinate role. Perspectives of a diverse group of workshop participants were shared with others in the FHWA’s 1992 report, “Exploring Key Issues in Public-Private Partnerships for Highway Development.”[25], 565497=[254] Parsons Brinckerhoff and the Texas Transportation Institute, A Guide for HOT Lane Development, prepared at the request of the Federal Highway Administration (FHWA-OP-03-009), 2003, 82., 132424=Tren Urbano: This project, in downtown San Juan, Puerto Rico, is a rapid rail (Metro) system of 11 miles in extent with 17 stations. It has been in planning and development since 1972, and was originally proposed as a light rail system. By the time FTA signed a Full Funding Grant Agreement for the project, it had evolved into a rapid rail system, with projected ridership of over 100,000 per day in its opening year. The project was procured by the Puerto Rico Highway and Transportation Authority as a Design-Build contract. Siemens Corporation is the prime contractor, responsible for 60 percent of the total project, including right-of-way, track, systems, and vehicles. The 17 stations, accounting for 40 percent of the project, are the responsibility of several local subcontractors to Siemens. The project was originally scoped at $1.375 billion. However, weather, lawsuit, Federal requirement, and funding issues have delayed the project significantly. The current estimate to complete the initial 17-station segment is now over $2.3 billion., 561551=[220] Apogee Research, Inc., Implications of Change in Procedures and Laws to Advance Public-Private Partnerships, prepared at the request of the Federal Highway Administration, (FHWA-PL-95-026), April 30, 1995, 22., 545341=[126] Spence, G, Head of Private Finance Unit, HM Treasury, \"HM Treasury’s Recent Proposals in Relation to Financing: A Practical Guide to the Latest Financing Issues in PFI/PPP\", transcript of City and Financial Conference, December 9, 2003, 29., 604247=[465] Apogee Research, Inc., Summary of the Federal Highway Administration's Symposium on Overcoming Barriers to Public-Private Partnerships, prepared at the request of the Federal Highway Administration, (FHWA-PL-94-026), May 1994, 17-18 and 25., 553588=[174] Duane D. Stanford, “Ga. 316 Expected to Be First Fast-Tracked Toll Road,” The Atlanta Journal-Constitution, January 5, 2004, E2., 148938=Florida Cost and Time Overruns (1997-98)[38], 566940=[265] U.S. General Accounting Office, Highways and Transit: Private Sector Sponsorship of and Investment in Major Projects Has Been Limited, (GAO-04-419), March 25, 2004, 46. http://www.gao.gov/new.items/d04419.pdf., 593717=[410] “TIFIA Credit Program: Transportation Secretary Announces TIFIA Project Selections,” FHWA's Innovative Finance Quarterly, Vol. 6, No. 3, Fall 2003, 43-44, http://www.fhwa.dot.gov/innovativefinance/ifq63.htm., 402749=$800,000 in Federal funding through the Puget Sound Regional Council (PSRC) in late February, which will be used to continue project design work through November 2003.The Regional Transportation Investment (RTID) District is developing a Puget Sound tri-county transportation tax package which may be included on the November 2003 ballot., 597027=[428] Apogee Research, Inc., Implications of Change in Procedures and Laws to Advance Public-Private Partnerships, prepared at the request of the Federal Highway Administration , (FHWA-PL-95-026), April 30, 1995, 21; and comment provided by John Cline of the c2group., 549691=[153] U.S. General Accounting Office, Highways and Transit: Private Sector Sponsorship of and Investment in Major Projects Has Been Limited, (GAO-04-419), March 25, 2004, 21, citing information provided by Nossaman, Guthner, Knox, and Elliott, LLP. http://www.gao.gov/new.items/d04419.pdf., 451267=The construction of a second bridge along the Tacoma Narrows began in October of 2002, and is designed to significantly increase traffic flow and reduce congestion for commuters. The project includes the addition of a 3.4-mile segment of SR 16, along with the new suspension bridge being built parallel to the existing Tacoma Narrows Bridge, which will span 5,400 feet., 602772=[456] Karen J. Hedlund, The Case for Tax-Exempt Financing of Public-Private Partnerships, 1998, 4. http://www.reason.org/HEDLPDF.PDF., 426024=As part of the evaluation of the I-15 Design/Build Project, the UDOT wanted to examine the use of performance specifications on the project. The UDOT had not used performance specifications on previous projects so their use was new to the Department. The 2000 evaluation report presents an analysis of the performance specifications used on the I-15 Design/Build Project through the end of the year 2000. The report is based upon interviews conducted with key UDOT staff members, their consultants, one representative of the contractor’s team, and a review of the specifications included in the request for proposal (RFP) and used for the project., 597505=[430] Notice listing Federal environmental laws and Executive Order applicable to the development and review of transportation infrastructure projects, 69 Fed. Reg. 25451 (May 6, 2004)., 418783=The Route 895 project, the first ever constructed under Virginia's Public-Private Transportation Act of 1995, was completed in September 2002, $10 million below its original $324 million contract., 542519=[115] Battelle, Performance-Based Contracting for the Highway Construction Industry: An Evaluation of the Use of Innovative Contracting and Performance Specifications in Highway Construction, Final Report, prepared at the request of Koch Industries, Inc., February 2003, 36. http://www.ncppp.org/resources/papers/battellereport.pdf. The scores represent the frequency of occurrence of each negative event. A high source represents a low frequency of occurrence and they are an overall higher quality, while a low score represents a high frequency and they are an overall lower quality., 97376=GARVEEs: State Participation as of June 2004, 575011=[306] Karen J. Hedlund, The Case for Tax-Exempt Financing of Public-Private Partnerships, 1998, 4-5. http://www.reason.org/HEDLPDF.PDF., 66411=Another major development was the use of fuel taxes to finance Federal and State highway programs. Beginning in the early 1900s, States and the Federal Government have increasingly relied on fuel taxes and other user fees to finance highway construction programs. The first Federal fuel tax was levied in 1932 at the rate of 1 cent per gallon. The rate varied between 1 and 2 cents per gallon until 1956 when the Highway Trust Fund was created. Since then, the Federal tax rate increased to its current level of 18.4 cents per gallon on gasoline, but the last excise tax increase was more than ten years ago. State fuel tax rates have followed a similar pattern.[11] During the era of Interstate Highway System construction, motor fuel tax increases were much easier to get approved than during the post-Interstate era when many States have had difficulty getting fuel tax increases approved by the electorate. The use of Federal user taxes like the fuel tax did not begin until July 1, 1956 (the first day of FY 1957). While the Federal fuel tax has indeed existed since 1932 and vehicle related taxes began even earlier in 1917, there was no connection between the revenue raised and highway funding., 555198=[182] Apogee Research, Inc., Summary of the Federal Highway Administration's Symposium on Overcoming Barriers to Public-Private Partnerships, prepared at the request of the Federal Highway Administration, (FHWA-PL-94-026), May 1994, 9., 603863=[463] Apogee Research, Inc., Implications of Change in Procedures and Laws to Advance Public-Private Partnerships, prepared at the request of the Federal Highway Administration , (FHWA-PL-95-026), April 30, 1995, 25., 447417=Thus far, all construction projects have come in between 7 percent and 20 percent below the engineer’s estimates. In January of 2004, all of the right-of-way required for the construction of SH 45 and Loop 1 was acquired. Phase I of the project, SH 130, is now due to be competed in 2007., 543181=[116] Dr. Keith Molenaar, The Design-Build Pilot Project Evaluation: A Measurement for the Process, Time, Cost, and Quality, SR 500 Thurston Way Interchange in Vancouver, WA, prepared at the request of the Washington State Department of Transportation, January 2003, Executive Summary. http://www.wsdot.wa.gov/biz/InnvContract/pdf/finalrptDBUofCo.pdf., 535882=[88] Federal Highway Administration, FHWA Innovative Finance Primer, (FHWA-AD-02-004), April 2002, 45-46. http://www.fhwa.dot.gov/innovativefinance/ifp/ifprimer.pdf., 167081=Dulles Greenway: In 1993, the Toll Road Investors Partnership, L.P. (TRIP II) was formed to build the Dulles Greenway, a four-lane 14-mile private toll road extending from the Dulles Toll Road to the Dulles International Airport. Under the franchise agreement, TRIP II owns the franchise for the Dulles Greenway and developed it as a private, for-profit venture. The partnership is responsible for all costs associated with operating and maintaining the road, including the costs of State troopers assigned to the toll road.[55], 418280=The Pocahontas Parkway is the first construction project implemented and completed under Virginia's innovative Public-Private Transportation Act of 1995 (PPTA). The Act allows for both private and public funding to meet the growing transportation needs of the State. VDOT can consider proposals from private entities to build highways or other transportation facilities when they are needed using private money rather than waiting until they can be funded with State or Federal funds., 252776=However, even the general public support for SR 91 was limited. A non-compete clause was included in the project agreement for SR 91 to protect the investment of the private investor—the California Private Transportation Company (CPTC).[200] In the non-compete clause, California Department of Transportation (Caltrans) agreed not to make improvements or add capacity to the existing general-purpose lane on SR 91 without consulting CPTC.[201] When Caltrans sought to add capacity to the existing lanes in 1999, CPTC objected.[202] This objection raised public opposition and ultimately led to a lawsuit seeking nullification of the non-compete clause.[203] In public-private partnership projects, it is important to ensure that the public does not perceive the private partner as maximizing profits through excessive peak tolls, while the public agency does nothing to relieve congestion on free facilities., 19735=Build-Own-Operate: a private contractor constructs and operates a facility while retaining ownership. The private sector is under no obligation to the government to purchase the facility or take title. “Public-Private Partnerships: Terms Related to Building and Facility Partnerships.” GAO/GDD-99-71, April 1999, http://www.gao.gov/special/pubs/Gg99071.pdf, 515405=[13] Infrastructure Management Group, Inc. and Maryland and Government Finance Group, Inc., An Evaluation of the TE-045 Innovative Finance Research Initiative prepared at the request of the Federal Highway Administration, October 1996,Chap. 1, http://www.fhwa.dot.gov/innovativefinance/evalcov.htm., 554590=[180] Apogee Research, Inc., Summary of the Federal Highway Administration's Symposium on Overcoming Barriers to Public-Private Partnerships, prepared at the request of the Federal Highway Administration, (FHWA-PL-94-026), May 1994, 22., 600868=[446] Apogee Research, Inc., Summary of the Federal Highway Administration's Symposium on Overcoming Barriers to Public-Private Partnerships, prepared at the request of the Federal Highway Administration, (FHWA-PL-94-026), May 1994, 21., 544690=[123] Romania: Ministry of Transport, Constructions and Tourism, Public Private Partnership: Opportunities for Major Investments in Romania, December 10, 2003, http://www.mt.ro/forum%20ppp/Bota%20final%20Dec%202003.pdf., 238700=To date, the private sector has had limited opportunities to partner with States and invest in highway infrastructure projects. For example, according to an analysis prepared by a law firm that represents various State and local transportation agencies involved in projects utilizing private sector participation, as of February 2004, 23 States have legal authority for private sector participation in transportation projects.[166] (See Appendix G) Of these 23 States, however, only 21 have legal authority to utilize private-sector participation in highway projects.[167] The law authorizing California to enter into public-private partnerships for transportation projects was repealed in 2004 and New Jersey let its authority expire in 2002.[168], 122639=The private sector often bids for the provision of park and ride services, particularly for start-up commuter rail or commuter bus operations. In large urban systems peak-hour express services may be contracted out. Today, most paratransit services for the elderly and persons with disabilities are provided under contract, as are van-pool services. Finally, some cities contract for their fixed-route, local service. In some cases, this includes commuter rail services, such as in Dallas/Ft. Worth or South Florida. In rural public transportation service, over 57% of obligations ($48.9 million) were expended for contracted service in 2003., 401129=WSDOT and the City have identified a favored plan. More detailed engineering and environmental analysis will need to be completed before a final plan is selected mid 2004., 45349=As requested by the House Report accompanying the FY 2004 DOT Appropriation Act, Chapter IV explores the major impediments to the formation of public-private partnerships. These impediments include State laws and policies, local opposition, private sector concerns, Federal requirements attached to Federal funding, and Federal financing. This chapter serves as a compilation of the impediments that have been identified by the commenters to the report and in the information used in this report and is not necessarily suggesting changes to Federal law. The Administration's SAFETEA proposal contains recommendations that address some of these impediments. Others will require further analysis to assess the most effective way to respond. A discussion of Federal funding and financing is included because it has been cited as a possible barrier due to the requirements that must be followed when a State or locality elects to use Federal money on a project. The literature on public-private partnerships notes that the complexity of Federal laws can limit private-sector participation in highway and transit projects., 407803=The project was constructed at a cost of $2.4 billion by the Alameda Corridor Transportation Authority—a joint powers agency known as ACTA and governed by the cities and ports of Los Angeles and Long Beach and the Los Angeles County Metropolitan Transportation Authority. The Alameda Corridor opened on time and on budget on April 15, 2002. It was funded through a unique blend of public and private sources, including $1.16 billion in proceeds from bonds sold by ACTA; a $400 million loan by the U.S. Department of Transportation; $394 million from the ports; $347 million in grants administered by the Los Angeles County Metropolitan Transportation Authority and $130 million in other state and federal sources and interest income. Debts are retired with fees paid by the railroads for transportation of cargo on the Alameda Corridor and for cargo transported into and out of the region by rail even if the Alameda Corridor is not used., 568923=[274] U.S. General Accounting Office, Highways and Transit: Private Sector Sponsorship of and Investment in Major Projects Has Been Limited, (GAO-04-419), March 25, 2004, 23. http://www.gao.gov/new.items/d04419.pdf., 444991=Construction on the T-Rex project will finish in September of 2006, being completed without any new or increased taxes., 108118=A variety of types of financing assistance can be offered by a SIB, with loans being the most popular form of SIB assistance. As of March 31, 2004, 32 States had entered into 373 loan agreements with a dollar value of almost $4.8 billion., 114137=In November 1991, about one month prior to the enactment of the first post-Interstate highway act, the Intermodal Surface Transportation Efficiency Act of 1991 (ISTEA), the FHWA convened a policy workshop about public-private partnerships. The purpose of the workshop was to focus attention on the broad range of issues and tradeoffs that may be associated with changes in public and private roles in the provision of transportation facilities and services., 170950=After signing a noncompete clause with project developers, California was barred from making improvements on competing roadways. But when public pressure forced California to make improvements to the nontolled lanes of SR 91, the Orange County Transit Authority (OCTA) reached an agreement to purchase SR 91 for $207.5 million. OCTA took possession of the road in January 2003. The sale was contingent on State legislation authorizing OCTA to buy and operate the toll road, eliminating the noncompete clause from the agreement.[63], 236988=In the 1997 edition of the survey, firms projected a median 80 percent increase in the gross revenue they would derive from design-build projects in the following three years.[160] However, the 2000 survey found that firms see a more moderate 25 percent increase in the gross revenue they expect to derive from design-build work in the next three years.[161] The 2000 survey attributed these results to design-build's sluggish expansion into public sector work, an area that many companies consider to be a source of future growth for design-build.[162] The percentage of firms that reported procurement laws in their State effectively shut them out of acquiring public sector design-build work increased from 35 percent in 1998 to 41 percent in 2000.[163], 240836=In 2003, Texas enacted House bill 3588, which provides a myriad of new tools to assist in the delivery of transportation projects and in the formation of public-private partnerships. House bill 3588, among other things, allows the formation of Regional Mobility Authorities (RMAs), expands the tolling authority of the State, authorizes Comprehensive Development Agreements (CDAs), and provides flexibility in funding the Trans Texas Corridor. The RMAs allow individual or multiple counties to develop a regional approach to transportation needs. RMAs may issue bonds or collect tolls, including converting an existing segment of the State’s highway system to a toll road with the approval of the Texas Transportation Commission. RMAs have the authority to purchase rights-of-way and may lease portions of the land for non-transportation related purposes. The RMAs also may use surplus revenue for other transportation projects.[170], 525274=[39] Virginia Department of Transportation, “VDOT Opens Final Portion of the Pocahontas Parkway, Route 895,\" press release, October 22, 2002. http://www.virginiadot.org/infoservice/news/RICH10232002-poca-ramp.asp., 400632=The Authority is preparing a program-level EIR/EIS which will be available to the public in August 2003., 243054=Georgia also enacted legislation in 2003 allowing the formation of public-private partnerships. Senate bill 257 allows private entities to bypass the State's typical bid procedures and instead to submit unsolicited, sealed proposals for projects already in the State's transportation plan. The State then is required to ask for competing proposals on the project. In early 2004, the GA DOT announced that it had received the first proposal under the new law to turn Ga. 316, which runs from Atlanta to Athens, into a toll road.[174] The project would include HOV lanes, new interchanges and overpasses, and miles of access roads.[175], 190486=Initially, it was anticipated that the 16 specific projects included in the TIMED program would all be let for construction by 2005 before a $.04 per gallon tax would expire. However, in light of higher project costs, the Louisiana Department of Transportation and Development (DOTD) estimated that the TIMED program would not be completed until at least 2031 using traditional pay-as-you-go funding. Recognizing that completion of the TIMED projects was vital to the State’s economic development, DOTD commenced a plan to accelerate completion of the remaining projects of the TIMED program. The goal of this stepped-up plan is to complete the TIMED program in 10 years. It is estimated that the remaining cost of the TIMED program from April 2003 is approximately $2.5 billion in 2003 dollars.[90], 543690=[118] Battelle, Performance-Based Contracting for the Highway Construction Industry: An Evaluation of the Use of Innovative Contracting and Performance Specifications in Highway Construction, Final Report, prepared at the request of Koch Industries, Inc., February 2003, 13. http://www.ncppp.org/resources/papers/battellereport.pdf., 516860=[21] Congressional Budget Office, Innovative Financing of Highways: An Analysis of Proposals, January 1998, xi. http://www.cbo.gov/showdoc.cfm?index=320&sequence=0., 569751=[279] Apogee Research, Inc., Summary of the Federal Highway Administration's Symposium on Overcoming Barriers to Public-Private Partnerships, prepared at the request of the Federal Highway Administration, (FHWA-PL-94-026), May 1994, 23., 571663=[288] John R. Heisse II, “'Best Value' Procurement: How Federal and State Governments Are Changing the Bidding Process,” April 29, 2002, 9, http://www.constructionweblinks.com/resources/Industry_Reports__Newsletters/April_29_2002/best_value_procurement.htm., 547008=[134] Clifford Chance, LLP, Public Private Partnerships in Germany: The Private Financing of Transport Infrastructure Projects, March 2001, http://www.cliffordchance.com/uk/pdf/PPPinGermany.pdf., 497489=The requirements of the DBE program could be an impediment to the formation of public-private partnerships. DBE requirements may require contractors to subcontract a certain portion of the work. In addition, prime contractors may have to reach out to business entities with which they do not have a prior or on-going relationship. According to a 2001 GAO Report, 13 State departments of transportation and transit agencies reported incurring $250,000 in litigation costs attributable to the Federal DBE program.[447] Although it has been asserted that the DBE program may have contracting costs, 99 percent of the State departments of transportation and transit authorities surveyed by GAO in 2001 had not conducted surveys or analyses to determine the impact of the DBE program on contracting costs.[448] The USDOT has not conducted such an analysis and the DBE program has never been raised as a bar to the implementation of the projects by public-private partnerships., 476459=While Federal conditions attach when a project is constructed with Federal funds, the operation of a number of Federal laws also results in these conditions applying to a much broader scope of projects. Most environmental laws, and particularly the National Environmental Policy Act, 42 U.S.C. § 4321, et seq., often apply to the entire action, even if only a small portion receives Federal funds. The reason is that actions must be analyzed between “logical termini” and cannot be segmented.[418] Moreover, environmental reviews must consider the “cumulative and secondary impacts” of actions.[419] “Connected actions” must be considered together.[420] Even when no funding is involved, these laws can come into play because they normally apply to approvals and permitting actions as well as to grant decisions. Some laws apply to recipients of Federal funds, no matter where those funds are used. The civil rights laws, and particularly title VI of the Civil Rights Act of 1964, as amended, apply in this way. Some highway safety requirements, such as the standards set forth in the Manual on Uniform Traffic Control Devices, normally must be applied on a system-wide basis., 589577=[394] Battelle, Performance-Based Contracting for the Highway Construction Industry: An Evaluation of the Use of Innovative Contracting and Performance Specifications in Highway Construction, Final Report, prepared at the request of Koch Industries, Inc., February 2003, 31-32. http://www.ncppp.org/resources/papers/battellereport.pdf., 557056=[189] Rick Pearson, \"Tolls Not a Big Issue, But the Traffic Is, \"Chicago Tribune, May 16, 2001, 1., 64940=In 1792, the first turnpike was chartered and became known as the Philadelphia and Lancaster Turnpike in Pennsylvania. The boom in turnpike construction resulted in the incorporation of more than 50 turnpike companies in Connecticut, 67 in New York, and others in Massachusetts and around the country., 222020=In April 2003, the Norwegian Public Roads Administration signed the first public-private partnership contract in Norwegian history, partnering with a private company that will build, operate, and maintain the “E39 Klett-Bardshaug,” situated in the middle of Norway. The company will be responsible for the road for a period of 25 years. Under the contract, tolling will be run by a State-owned, non-profit company, and the private partner will be paid solely based upon the terms of the public-private partnership contract. The Ministry estimates that the construction period has been reduced by 50 percent—from 4 years to 2 years., 439221=A 9.25-mile section of SR 125 is being constructed as a privately financed and operated toll road, featuring electronic toll collection. In accordance with legislation passed in 1989, San Diego Expressway LP holds a franchise with California and will finance and build the highway, then transfer ownership to the State. The partnership will then lease it back from the state, operating and maintaining the highway for 35 years. The 35-year franchise will allow the developer to set market rate tolls, with a maximum of 18.5 percent return on total investment. Control of the highway will then revert to the State. Other portions of the highway, providing connections to the toll road, are being through public funds., 253946=The I-15 toll lanes in San Diego, California, also illustrate the importance of local support. Based on the growth of vehicles using I-15 over the last decade and the success of the HOT lanes, the San Diego Association of Governments (SANDAG) and Caltrans have broken ground on a project to expand capacity in the I-15 corridor.[204] An 800-person telephone survey of I-15 users conducted in fall 2001 indicated that the majority of motorists supported the lanes, and that motorists with the most extensive experience with the FasTrak lanes were the most ardent supporters.[205] Ninety-one percent of users supported having a time-saving option on I-15, and 66 percent of I-15 users who did not use the FasTrak lanes supported them.[206] Moreover, I-15 users overwhelmingly supported the facility’s expansion with HOT lanes, and tolling of new lanes was preferred over providing new free lanes. The tolling option was preferred over adding regular lanes by a wide margin (37% for priced lanes vs. 26% for regular lanes). It appears that a large share of the public in San Diego have grown to understand the value of priced lanes, and that simply providing new general purpose lanes, without fees or other restrictions, will not help much in relieving congestion due to continuing increases in traffic., 152103=Pocahontas Parkway (Route 895): The Commonwealth of Virginia experienced the cost-saving benefits that can be achieved by the use of a public-private partnership on the Pocahontas Parkway (Route 895), the first project constructed under Virginia's Public-Private Transportation Act of 1995 (VPPTA). According to VDOT, through the use of an innovative design-build-finance contract, the project came in $10 million below the original $324 million estimated cost of the project.[39], 156987=In 1998, the Transportation Equity Act for the 21st Century (TEA-21) became the new funding legislation for the nation’s surface transportation programs. Included in TEA-21 was section 1307(f) which required that a comprehensive national study be conducted to evaluate the effectiveness of design-build contracting in the Federal-aid highway program, with the results subsequently reported to Congress. FHWA contracted with Science Application International Corporation (SAIC) and AECOM Consult, Inc. to perform this study, whose objectives are to:, 572353=[290] Congressional Budget Office, Innovative Financing of Highways: An Analysis of Proposals, January 1998, x-xi. http://www.cbo.gov/showdoc.cfm?index=320&sequence=0., 180739=Route 3 North: In August 1999, the Massachusetts Legislature authorized $385 million for Route 3 North to make a number of improvements to this highway, The design-build-operate delivery method of the project was the first of its kind in the State and allowed the Route 3 North project to be completed in 42 months, rather than the initially estimated 9 years—cutting the delivery time by more than half.[77], 538123=[98] Congressional Budget Office, Innovative Financing of Highways: An Analysis of Proposals, January 1998, Chap. 5, 13. http://www.cbo.gov/showdoc.cfm?index=320&sequence=0., 493205=The Buy America requirement can impede the formation of public-private partnerships because of the additional costs that may be added to a project. For example, the San Francisco Bay Bridge project received approval in 2002 for $237 million of Federal-aid highway funds. [441] However, the Buy America requirements would add $120 million to the cost of the project—almost half the amount of the Federal funding for the project.[442], 546043=[129] Nevil Gibson, “Long, winding road, Editor’s INSIGHT, ” The National Business Review, December 3, 2002. http://www.nbr.co.nz/print/print.asp?id=4580&cid=14&cname=Editor’s+insight., 119102=In October 2003, the FHWA formed a Public-Private Partnership Task Force, headed by the FHWA’s Chief Counsel, to explore ways the FHWA could address impediments to the formation of public-private partnerships and actions the FHWA should take to encourage their formation. The Task Force consists of representatives from FHWA program offices and the policy office, and it has explored opportunities to assist States interested in developing the use of public-private partnerships to meet growing demands for highway infrastructure., 596144=[424] Apogee Research, Inc., Implications of Change in Procedures and Laws to Advance Public-Private Partnerships, prepared at the request of the Federal Highway Administration , (FHWA-PL-95-026), April 30, 1995, 21., 136948=Grant Anticipation Notes (GANs) or Bonds have been used by public transportation agencies in the same way as States have used GARVEEs. The mechanism was first used in the early 1990’s, when the Tri-County Metropolitan Transit District (Tri-Met) in Portland, Oregon leveraged a $1 million loan with the anticipation of a $35 million grant for its new light rail system. Due to its relatively high cost and complexity, the mechanism was not used again until TEA-21 was enacted. Minimum Guaranteed Funding Levels and mass transit account funding provided the economic security that financial markets demanded. Since 1997, over $2.5 billion in GANs have been issued for mass transportation, as shown in Figure 2.7., 552210=[166] U.S. General Accounting Office, Highways and Transit: Private Sector Sponsorship of and Investment in Major Projects Has Been Limited, (GAO-04-419), March 25, 2004, 20. http://www.gao.gov/new.items/d04419.pdf., 421912=Approximately 17.5 miles of Route 288 will be built in three projects between the Powhite Parkway Extension (Route 76) in Chesterfield County and Interstate 64 in Goochland County. One VDOT-managed segment of Route 288 stretches from Route 76 to Charter Colony Parkway in Chesterfield County and the other VDOT-managed segment stretches from Charter Colony Parkway to the Powhatan County line. APAC-Virginia, Inc. oversees construction on the rest of Route 288, from the Powhatan County line to I-64 in Goochland County, funded under Virginia's PPTA. The Lucks Lane overpass and a portion of Route 288, from Route 76 to the Lucks Lane interchange, is already open to motorists. The rest of the project is expected to be completed in sections throughout 2004., 192128=The accelerated implementation of the remaining $2.5 billion TIMED program will be funded through a combination of revenue bonds and pay-as-you-go funding. About 83 percent of the program costs will be funded from revenue bond proceeds with pay-as-you-go funding accounting for the remaining 17 percent. The sources of the pay-as-you-go funds are the monthly collections of the Act No. 16 taxes and interest earnings on the TIMED fund balance. Legislation passed in 1998 extended the $.04 per gallon tax until all TIMED projects are complete and all outstanding bonds or other indebtedness issued for the TIMED projects have been paid in full, whichever is later.[92], 589109=[392] Transportation Finance Task Force, Report to Governor Bill Owens , March 2004, http://www.dot.state.co.us/TransportationFINANCETASKFORCEREPORT040204.pdf., 436252=The 1988 enabling legislation passed by the General Assembly prohibited the State from bailing out the Greenway or other such facilities. Nevertheless, after the disappointing results of the first few months of the toll road's operation, the Virginia legislature considered such action. In the end, it rejected a bailout; however, it voted to allow the speed limit on the Greenway to rise (from 55 to 65 miles per hour) in hopes of attracting more motorists., 577117=[318] Congressional Budget Office, Innovative Financing of Highways: An Analysis of Proposals, January 1998, xi. http://www.cbo.gov/showdoc.cfm?index=320&sequence=0.., 593405=[409] Congressional Budget Office, Innovative Financing of Highways: An Analysis of Proposals, January 1998. http://www.cbo.gov/showdoc.cfm?index=320&sequence=0., 526160=[42] National Society of Professional Engineers, “Design/Build in the Public Sector (#1726),”, July 1995, http://www.nspe.org/govrel/gr2-ps1726.asp., 433442=In response to growing interest in private investment in transportation facilities, Virginia's General Assembly in 1988 authorized private development of toll roads in the commonwealth. A group of investors, the Toll Road Investors Partnership II, thought that a toll road linking Washington's Dulles International Airport and Leesburg, Virginia, would be a promising investment. Their analysis was based on residential and commercial growth in the area, which was causing increased congestion on existing arterial roads serving the corridor., 451651=Building the first long-span suspension bridge in the United States since 1964, the $800 million project is a public-private partnership between the Washington State Department of Transportation (WSDOT) and Tacoma Narrows Constructors (TNC)., 601533=[449] Apogee Research, Inc., Implications of Change in Procedures and Laws to Advance Public-Private Partnerships, prepared at the request of the Federal Highway Administration , (FHWA-PL-95-026), April 30, 1995, 17., 115218=In November and December 2003, the FHWA sponsored three “Partnerships in Transportation Workshops” in Washington State, Minnesota, and Texas. A final report was issued on March 17, 2004, summarizing workshop discussions and conclusions.[26] Workshop participants included State and local elected officials, State and local transportation officials, and private sector representatives who have been involved in public private-partnerships. At the workshops, State transportation departments indicated the need for Federal leadership to forge and implement successful public-private partnerships. Despite significant experience with public-private partnerships since the 1991 workshop, some State transportation agency staff remained uncertain about public-private partnership basics, including how to select and define candidate projects, develop project solicitation documents, and negotiate with private entities. While some participants saw great revenue potential, others perceived public-private partnerships as the public sector abdicating its infrastructure responsibilities to private companies., 77105=The FHWA established SEP-14 in 1990 at the recommendation of the Transportation Research Board. The purpose of SEP-14 is to identify, evaluate, and document innovative contracting practices that have the potential to reduce the life cycle cost of projects while maintaining product quality. Within the regulatory requirements of the Federal-aid highway program, there is some degree of flexibility and thus SEP-14 was developed to provide the States with a vehicle to explore new concepts in construction contracting. These concepts often involve new and expanded roles for the private sector, and many also provide strong performance incentives for the private sector. Most projects undertaken under the SEP-14 program, however, have not involved private sector financing of highway projects. Even when no private money is directly involved in the construction and operation of the SEP-14 projects, many of the special construction techniques used place far greater responsibilities on the contractor. Thus, because of the greater role assumed by the private sector, they are considered public-private partnerships in this report., 559286=[208] Apogee Research, Inc., Implications of Change in Procedures and Laws to Advance Public-Private Partnerships, prepared at the request of the Federal Highway Administration , (FHWA-PL-95-026), April 30, 1995, 7., 82701=Therefore, in two cases, the FHWA again used SEP-14 to allow States to try alternative approaches. On February 27, 2004 the FHWA approved the Texas Department of Transportation (TxDOT) request for a waiver of many of the FHWA’s design-build requirements for the I-35 High Priority Trans-Texas Corridor Project. This waiver is significant in two important aspects. First, it will allow TxDOT to proceed with the procurement of the project developer in advance of the conclusion of the NEPA review process. To maintain an independent, unbiased NEPA review process, the TxDOT has contracted with an independent consultant to assist in the development of the NEPA document. Secondly, the I-35 waiver will also allow TxDOT to proceed with the procurement of the corridor developer at a very early stage in the project development process. It is expected that the final executed development agreement will contain provisions for the negotiation of scope and price as the project develops. Prior to executing the development agreement, the TxDOT and the FHWA Texas Division will develop formal procedures for verifying price reasonableness and developing an independent estimate. This procedure should ensure fair pricing for all work done under the development agreement. In addition, the FHWA allowed the Virginia DOT to proceed with the procurement of the I-81 corridor project subject to compliance with NEPA requirements., 591696=[402] Congressional Budget Office, Innovative Financing of Highways: An Analysis of Proposals, January 1998, Chapter 5, 4-6. http://www.cbo.gov/showdoc.cfm?index=320&sequence=6. Citations within case study have been deleted., 601998=[452] National Council for Public Private Partnerships, AECOM CONSULT, and Parsons Brinckerhoff, Ltd., Partnerships in Transportation Workshops, Final Report prepared at the request of the Federal Highway Administration, March 17, 2004, 10., 514531=[8]Congressional Budget Office, Innovative Financing of Highways: An Analysis of Proposals, January 1998, 2. http://www.cbo.gov/showdoc.cfm?index=320&sequence=0., 547909=[138] Battelle, Performance-Based Contracting for the Highway Construction Industry: An Evaluation of the Use of Innovative Contracting and Performance Specifications in Highway Construction, Final Report, prepared at the request of Koch Industries, Inc., February 2003, 3. http://www.ncppp.org/resources/papers/battellereport.pdf., 419694=Traffic and revenues for this project have been lower than expected. Demand is not quite half of that expected and the road’s builder, Fluor Corp., is having difficulty paying off its bonds.[396] In November 2002, Fitch placed its rating of the parkways bonds on a negative watch. In December 2002, Standard and Poor’s lowered its rating of the bonds to below investment grade. In August 2004, State officials agreed to raise tolls from $1.50 to $2.00 to generate more revenue. Fluor is also seeking approval to build an interchange to a new development to increase demand.[397], 220895=Norway’s widely distributed population and long distances results in an extensive network—approximately 27,000 kilometers of State roads and 64,000 of regional and local roadways. Facing risings costs of maintaining existing roadways and constructing new ones, the Norwegian parliament began discussing the use of public-private partnerships in February 2001.[128] The parliament then selected three road projects to test if the public-private partnership model will lead to greater efficiency through time and cost savings., 432982=In April 2002, the Orange County Transportation Authority (OCTA) reached an agreement in concept to purchase the private toll road project for $207.5 M. In September 2002, AB 1010, Chapter 688 (2002) allowed OCTA to purchase the toll road from CPTC. OCTA took possession of the toll road on January 3, 2003., 547360=[136] Mary E. Peters, Federal Highway Administrator, speech, Canal Road Intermodal Connector Meeting, Gulfport, Mississippi, October 21, 2003, http://fhwa.dot.gov/pressroom/re)31021.htm., 528948=[52] U.S. General Accounting Office, Highways and Transit: Private Sector Sponsorship of and Investment in Major Projects Has Been Limited, (GAO-04-419), March 25, 2004, 15. http://www.gao.gov/new.items/d04419.pdf., 513890=[5] Norman Y. Mineta, Secretary of Transportation, interview by Rebecca Roberts, http://www.pbs.org/kged/springboard/segments/48/interview.html (accessed May 27, 2004, site now discontinued)., 70839=In 1991, ISTEA was enacted and established a new vision for surface transportation in the United States. ISTEA permitted the use of tolls to a much greater degree on Federal-aid facilities, including allowing Federal-aid to be used to construct new, non-Interstate System toll highways. This expansion of the use of tolls also included a congestion pricing pilot program. For the first time, private entities were allowed to own toll facilities and States were allowed to loan the Federal share of a project's cost to another public agency or private entity constructing the project. This trend in giving States greater flexibility in utilizing innovative financing and operating methods continued with subsequent surface transportation acts. These further advances will be discussed later in this chapter., 429175=The project includes a 1.5-mile tunnel under the MSP airport runways and taxiways, 26 light rail vehicles, and a total of 17 stations, with 12 stations on the Hiawatha Corridor, three stations in Bloomington, and a station serving the Mall of America. The project expects to serve 24,800 average weekday boardings by 2020., 84433=In response to Executive Order 12893 (\"Principles for Federal Infrastructure Investment\"), which establishes cost-effective infrastructure investment as priority for Federal agencies, and in recognition of the need to explore new financing strategies, the FHWA announced the Innovative Finance Program—Test and Evaluation Project (TE-045) in a Federal Register notice dated April 8, 1994. The term \"innovative finance\" describes techniques that supplement traditional highway financing methods. These techniques can provide mechanisms for the direct investment of private sector funds in a surface transportation project. They also may lay the foundation for a public-private partnership by providing a ready and secure source of funds that make a project more likely to attract private involvement. Alternatively, these financing techniques might precipitate the creation of a public-private partnership by providing funds for such a large project or number of projects that private sector involvement is needed to provide additional management and staff to supplement State resources., 558083=[198] Ibid., 28, citing State of California, Department of Transportation, Continuation Study to Evaluate the Impacts of SR 91 Value-Priced Express Lanes: Final Report, December 2000., 574181=[301] Karen J. Hedlund, The Case for Tax-Exempt Financing of Public-Private Partnerships, 1998, 4, citing Federal Reserve Board of Governors Statistical Release G. 13, March 13, 1998. http://www.reason.org/HEDLPDF.PDF., 560828=[217] Apogee Research, Inc., Implications of Change in Procedures and Laws to Advance Public-Private Partnerships, prepared at the request of the Federal Highway Administration , (FHWA-PL-95-026), April 30, 1995, 22., 400470=Legislature recently signed a bill that places a nearly $10 billion general obligation bond on the November 2004 ballot to fund planning and construction., 556159=[184] Apogee Research, Inc., Summary of the Federal Highway Administration's Symposium on Overcoming Barriers to Public-Private Partnerships, prepared at the request of the Federal Highway Administration, (FHWA-PL-94-026), May 1994, 9., 410372=Despite those setbacks, the road was also completed ahead of schedule. The final segment of the project was completed on January 3, 2003, a full five weeks ahead of schedule., 553140=[170] Texas Department of Transportation, “Drafting the Future,” August 2003, >http://www.dot.state.tx.us/dtf/DraftingtheFuture.pdf., 590712=[399] Virginia Department of Transportation, “Route 288 Is In Full Gear – Construction begins on completing the western loop around Richmond. Public Private Partnership saves money and time on high profile road project,” press release, May 31, 2001., 443511=The T-REX project is a collaboration between the Colorado Department of Transportation (CODOT), the Regional Transportation Board (RTB), the Federal Highway Administration, and the Federal Transit Administration, along with input from Colorado citizens, businesses, and motorists. Endorsed by Colorado voters, the design-build project aims to replace aging highways with more modern, efficient highways, as well as a light rail system. T-Rex will widen 14 miles of I-25 and 4 miles of I-225. The project also includes a new drainage system, the reconstruction of several interchanges and bridges, and improved pedestrian and bicycle access. Ultimately, the project will link the two largest employment centers in the region (the Southeast Business District and the Denver Central Business District). A design-build contract was awarded in June 2001, with construction beginning September 2001., 411466=In August of 1999, the Massachusetts Legislature authorized $385 million for Route 3 North to make a number of improvements to this busy highway, which stretches from Burlington, Massachusetts to the New Hampshire border. These improvements included an additional travel lane in each direction, improvements on 13 interchanges, the replacement of 40 bridges, and the addition of a median shoulder and 30-foot clear zone. The design-build-operate delivery method of the project was the first of its kind in the State., 135931=Las Vegas Monorail: In May of 2000, the Governor of Nevada created the Las Vegas Monorail Corporation (LVMC) by appointing members to its board of directors. LVMC was responsible for the issuance of $650 million in revenue bonds to finance the construction of the first phase of the Las Vegas Monorail, running 3.7 miles from Sahara Avenue to Tropicana Avenue and serving seven stations in downtown Las Vegas. Design, construction, maintenance and operation are the responsibility of the Master System Developer. The actual project sponsor is the Regional Transit Commission (RTC), which is the transit provider for Clark County and the city of Las Vegas. This project is the first totally privately financed public transportation project in the U.S., although it is seeking Federal funds for its second phase. The project went into revenue service in July of 2004, within budget although several months late., 527349=[47] New Mexico State Highway and Transportation Department New Mexico Corridor 44 Project: A New Paradigm in Highway Construction, July 1998., 130543=Today, Union Station is one of the most visited destination in the nation's Capitol with over 25 million visitors a year. World-class exhibitions and international cultural events are hosted here for the public to enjoy. Private special events such as the Presidential Inaugural Ball and citywide galas are celebrated in the grand halls. In 2003, the Union Station operation generated over $1 million in lease revenues from the retail and food establishments within its confines. WMATA’s involvement is in the form of a fee simple ownership of the ground-level entrance to the subway station, and a connection agreement from within Union Station., 126708=A survey undertaken in 2003 by Robert Cervero for the Transportation Research Board[30] revealed that, among 29 transit systems responding, over 100 joint development projects were identified. Of the respondents, 17 were rail systems and 12 were bus only systems. While the rail system projects predominated, nevertheless, 18 joint development projects were identified around bus facilities. These included mixed-commercial development, office, institutional, residential, and civic facilities. One such example is the Center Station at John Deere Commons in downtown Moline, Illinois. Developed around the MetroLINK bus transfer center, it includes offices, a convention center, hotel, parking structure, and various pedestrian amenities. MetroLINK receives a ground rent, as well as a negotiated private contribution, and construction and operating cost sharing., 133502=Hudson-Bergen Light Rail: A two-phase, $1.1 billion light rail startup system, this was a Design-Build-Operate-Maintain or DBOM project. The partnership between New Jersey Transit and Washington Group International (formerly Raytheon Infrastructure) resulted in early completion of the project at substantial cost saving. The combination of the DBOM contract with Grant Anticipation Bonds ensured consistent progress on construction and realized cost savings of over $300 million, as the following comparison shows (see Figure 2.6). The first segment of the Hudson-Bergen Light Rail went into revenue service in April of 2000—nearly five years ahead of projections., 516194=[18] National Highway System Designation Act of 1995, Pub. L. No. 104-59, §350, 109 Stat. 568, 618-622 (1995)., 39282=In the House Report accompanying the FY 2004 Department of Transportation (DOT) Appropriations Act, the House Committee on Appropriations requested the Secretary of Transportation prepare and submit a report on public-private partnerships. The Committee report specified the following:, 224132=The Australian Bureau of Transport and Communications Economics (BTCE) reports that contracting out roadwork will help to reduce the public costs of road construction and maintenance.[131] While private investment in roads is a relatively recent development in Australia, the government has reported that “[p]rivate toll roads appear to be built with fewer delays and at lower cost, compared to public untolled roads.”[132] By 1995, private contractors were already performing 27 percent of the maintenance on public roads and 42 percent of the construction.[133] Both numbers have been increasing since., 562458=[227] Apogee Research, Inc., Implications of Change in Procedures and Laws to Advance Public-Private Partnerships, prepared at the request of the Federal Highway Administration , (FHWA-PL-95-026), April 30, 1995, 22., 531184=[69] U.S. General Accounting Office, Highways and Transit: Private Sector Sponsorship of and Investment in Major Projects Has Been Limited, (GAO-04-419), March 25, 2004, 15. http://www.gao.gov/new.items/d04419.pdf., 113469=As of June 2004, $3.5 billion in TIFIA credit assistance has been made available to 11 projects, supporting over $15 billion in project costs., 565764=[255] Apogee Research, Inc., Implications of Change in Procedures and Laws to Advance Public-Private Partnerships, prepared at the request of the Federal Highway Administration , (FHWA-PL-95-026), April 30, 1995, 19., 440685=Crossing most of the major North/South freeways and arterial corridors in central Orange County, the SR 22 is a vital California road suffering from poor traffic flow due to increases in population and travel. To remedy this problem, Caltrans accepted a design-build option to rebuild the roadway on October 11, 2001. Included in the construction plans are the SR 22 HOV project, building High Occupancy Vehicle lanes in each direction between the Costa Mesa Freeway and Valley View Street., 533875=[78] Battelle, Performance-Based Contracting for the Highway Construction Industry: An Evaluation of the Use of Innovative Contracting and Performance Specifications in Highway Construction, Final Report, prepared at the request of Koch Industries, Inc., February 2003, 32. http://www.ncppp.org/resources/papers/battellereport.pdf., 246394=State and Federal officials have a long history of commitment to \"free\" roads and have had difficulty generating enthusiasm for toll facilities, particularly in the face of public resistance.[182] Political and cultural resistance to tolling is reflected in the Federal-aid highway program, which as early as 1916 prohibited the use of tolls on federally funded roadways. Even today, tolling on the Interstate Highway System is prohibited except for two pilot programs that allow tolling of Interstates in limited situations—the value pricing pilot program established in 1991 and reauthorized in 1998, and the Interstate System reconstruction and rehabilitation pilot program authorized in 1998.[183] The public view towards tolls must change before the private sector will feel confident enough to pursue public-private partnerships and be able to gain financing and community support.[184], 72719=Another activity that continues is the development around public transportation facilities. Congressman Andrew Young of Georgia inserted language in the National Urban Mass Transportation Act of 1974 (Public Law 93-503) that made certain kinds of transportation projects eligible for Federal reimbursement. Specifically, Section 3(a)(1)(D) provided Federal assistance for:, 506225=Although the design-build regulation represents a significant step in facilitating public-private partnerships, it also contains a provision that has been cited as an impediment to public-private partnerships. The design-build regulation prohibits a State from issuing a \"request for proposals\" (RFP) until the NEPA process is complete in accordance with 23 U.S.C. 112(b)(3)(B), which states that design-build projects \"shall not commence before compliance with section 102 of the National Environmental Policy Act of 1969 (42 U.S.C. 4332).[462] States have criticized this provision as being a cumbersome restriction that discourages innovation and causes delays. Some States also believe that the NEPA process will be enhanced by having the private developer supply engineering studies, technical information, and other support to the transportation agency during the NEPA process. Because the NEPA analysis is typically accomplished as part of preliminary design, when many key, large scale design decisions are made by someone other than the design-build contractor, this process can discourage or prevent the use of innovative ideas and solutions proposed by the design-build contractor., 573666=[296] Ibid., 1; citing Federal Reserve Board of Governors Statistical Release G. 13, March 13, 1998., 98028=Colorado is advancing a multi-billion dollar program of strategic statewide projects, including the multimodal Southeast Corridor project, through GARVEE financings. As of May 2004, the Colorado Department of Transportation has sold $1.5 billion in GARVEEs in five separate issues. In Arkansas, a total of $575 million in GARVEE bonds were issued in the 2000-2002 period, to help accelerate the financing of 380 miles of Interstate system highway improvements., 374148=Construction of second segment expected to be complete in 2005., 559826=[212] Congressional Budget Office, Innovative Financing of Highways: An Analysis of Proposals, January 1998, 50. http://www.cbo.gov/showdoc.cfm?index=320&sequence=0., 371267=Scheduled for completion in 2008., 429688=The project utilized the design-build method with separate contracts for light rail vehicles (24 to 26 cars) and airport tunnel. Two tunnels are being built adjacent to each other to carry northbound and southbound train traffic. Each tunnel is 7,400 feet (1.4 miles) in length. Crews have completed boring both north and southbound tunnels, and are working on the Lindbergh Terminal and Humphrey Terminal stations. The Metropolitan Airports Commission is overseeing construction of the tunnels and both airport stations. The Hiawatha entered revenue service on July 1, 2004, and in its first week of revenue operation it carried 93,000 passengers. Early projections were for weekly trips to average 55,400. The week did include three home games by the Minnesota Twins, but this is estimated to have made a difference of just 12,000 trips., 517668=[26] National Council for Public Private Partnerships, AECOM CONSULT, and Parsons Brinckerhoff, Ltd., \"Partnerships in Transportation Workshops, Final Report\" prepared at the request of the Federal Highway Administration, March 17, 2004., 564625=[249] Congressional Budget Office, Innovative Financing of Highways: An Analysis of Proposals, January 1998, 51. http://www.cbo.gov/showdoc.cfm?index=320&sequence=0., 590206=[396] Steven Ginsberg, “Virginia Courting Private Sector to Plan, Fund Road Projects; Partnerships Are a Trend,” The Washington Post, July 5, 2004, B1 and B5., 518352=[29] Robert Cervero, Peter Hall, and John Landis, Transit Joint Development in the United States, Monograph No. 42, August 1992, Institute of Urban and Regional Development, National Transit Access Center, University of California, Berkeley. Also released as Transit Joint Development in the United States: A Review and Evaluation of Recent Experiences and an Assessment of Future Potential, Urban Mass Transit Administration (now the Federal Transit Administration), U.S. Department of Transportation., 539299=[103] Public Private Partnerships: The Government’s Approach, published with the permission of the HM Treasury on behalf of the Controller of Her Majesty’s Stationary Office, 2000, 11 http://www.hm-treasury.gov.uk/media/1D111/80.pdf#page=1., 532780=[75] Battelle, Performance-Based Contracting for the Highway Construction Industry: An Evaluation of the Use of Innovative Contracting and Performance Specifications in Highway Construction, Final Report, prepared at the request of Koch Industries, Inc., February 2003, 32. http://www.ncppp.org/resources/papers/battellereport.pdf., 239647=Virginia was one of the first States to enact a comprehensive public-private partnership law. The Public-Private Transportation Act of 1995 enables Virginia to enter into contracts authorizing private entities to acquire, construct, improve, maintain, and operate certain transportation facilities. According to Virginia's implementation guidelines, the intent of the legislation is to \"encourage public/private ventures for transportation facilities which may result in the availability of facilities in a more timely or less costly fashion and to facilitate to the greatest extent possible the federal pooling and funding mechanisms to the end that transportation financing be expanded and accelerated and have the greatest possible flexibility in contracting between public and private entities.\"[169] The Act allows private entities to submit both solicited and unsolicited project proposals, and the steps involved in evaluating, selecting, and implementing the projects are similar for both types. Private entities also may propose innovative financing methods, such as user fees or service payments.}", "lastModified": "Wed, 25 Feb 2015 07:45:16 GMT", "textBeforeTable": "Sponsors and Features of Highway Financing[10] Figure 2.1 In between the extremes of public and private provision of roads are partnerships between government and private firms for building transportation projects. The roles and responsibilities of each partner in financing the project are specified in contracts between the parties, as illustrated by Figure 2.1. In the majority of cases, the private sector risks some capital and is rewarded if the investment is successful. The partners often form a new entity—either a special-purpose government agency or a private, nonprofit corporation—to finance and oversee the project. Another nontraditional arrangement is that of a government contracting with a private firm to operate and maintain a roadway that the government has built. Great Britain is experimenting with such a form on a limited basis, but the United States has yet to explore its possibilities in any systematic way. [9] Some partnership arrangements may involve several or all of these functions. Regardless of the specific functions involved, partnership arrangements are intended to provide greater flexibility to achieve transportation program objectives by altering traditional public and private sector roles to take better advantage of the skills and resources that private sector firms can provide.[7] However, even when the private sector has a high level of participation, the government will continue to play a role in granting permits, ensuring safety, verifying fulfillment of environmental requirements, or even exercising its power of eminent", "textAfterTable": "Dulles Greenway (Virginia). Design, Build, Finance, Operate (concession or franchise) Under the DBFO contracting method the private sector is responsible for all or a major part of project financing as well as facility design, construction, operation, and maintenance. Typically the facility reverts to the State after 25+ years. Revenues to the private sector can come from direct user charges, payments from the public sector, or both. Operations typically would be covered by performance incentives, and contracts would have to include such things as maximum rate of return, non-compete clauses, and maximum toll rates, etc. SR-91and SR-125 (California) Southern Connector Toll Road (South Carolina), Massachusetts Rt. 3, Las Vegas monorail. Design, Build, Operate, Maintain (concession or franchise) This is similar to the DBFO contract, but involves a lesser role by the private sector in project finance. Like the DBFO, the private sector assumes major responsibilities for project design, construction methods, operations, and maintenance. Payments from the public sector may include performance incentives/disincentives for operational performance and physical condition. Central Texas Turnpike Project, Hudson Bergen Light Rail (New Jersey), I-15 (Utah), Seattle monorail. Design, Build, Warrant Based on general information concerning the type of facility desired and the performance expected from that facility, the private sector is given the responsibility for design and construction of the facility. This promotes innovation in design and efficiencies in the construction process since the same firm or group of firms are responsible for both design and construction.", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}