{"relation": [["Product", "LCD/LED Television", "Plasma Television", "MP3 Player, Music Center", "DVD Player/Recorder, Set top box, Home Theatre", "Digital Video Camcorder", "Digital Still Camera"], ["Warranty Period", "1 year", "1 year", "1 year", "1 year", "1 year", "1 year"], ["Special Warranty Conditions", "This Warranty does not cover the cost of installation and de-installation of wall mounted units", "This Warranty does not cover the cost of installation and de-installation of wall mounted units", "", "", "", ""]], "pageTitle": "title", "title": "", "url": "http://www.samsung.com/nz/support/warrantyinformation/test2.html", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 1, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988860.88/warc/CC-MAIN-20150728002308-00099-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 686470491, "recordOffset": 686452885, "tableOrientation": "HORIZONTAL", "TableContextTimeStampBeforeTable": "{2267=If you purchased the Samsung consumer product in New Zealand for the purposes of a business, it is hereby agreed that the provisions of the Consumer Guarantees Act 1993 do not apply in accordance with section 43(2) of the Act.}", "TableContextTimeStampAfterTable": "{33831=If you purchased the Samsung consumer product in New Zealand for the purposes of a business, it is hereby agreed that the provisions of the Consumer Guarantees Act 1993 do not apply in accordance with section 43(2) of the Act.}", "textBeforeTable": "Out-Box: - Parts and accessories purchased from Authorised Samsung Resellers and Distributors are generally covered under this Warranty from a 3 month to 1 year warranty period. Please refer to the specific period below. In-Box: - All remote controls purchased with the Samsung consumer product are covered under this Warranty for the same period as the Samsung consumer product purchased. - All other Samsung parts and accessories (including batteries) purchased together with the Samsung consumer product are covered under this Warranty for a period of 6 months. Generally Samsung will replace the defective part or accessory which is the subject of the claim during this 6 month period. - You will only be able to make a claim under this Warranty for lost or missing Samsung parts and accessories if, with your claim, you are able to provide satisfactory evidence that the relevant item was missing from the box or other storage or packaging material originally supplied by Samsung. The table below this sub-paragraph identifies the periods under which a claim may be made under this Warranty for replacement of a part or accessory. However, you may also have statutory rights outside of these periods. The parts and accessories are divided into those which are supplied within the box of the Samsung consumer product for which they are to be used (In-Box), and those which are supplied separately from a Samsung consumer product for use with", "textAfterTable": "Samsung OEM and Print Solutions Software n/a 90 days   Compressors, Motors, PDP and LCD Panels Unit warranty 12 months or as specified on warranty card   Lamps for Digital Projectors 1 year (or 500 hrs) whichever comes first 3 months   Other Parts, Accessories 6 months 3 months   Other Consumables n/a 3 months   II.  PARTS AND LABOUR WARRANTY Unless specified, this Warranty covers corresponding costs for parts and labour which may be required to repair the Samsung consumer product, part or accessory if Samsung or its agent repair the item under this Warranty. III.  WARRANTY BY PRODUCT TABLE The table below in this sub-paragraph summarises Samsung's preferred approach to resolving claims under this Warranty, although each claim is assessed on its own merits. Please refer to Part I, paragraph (III)(F) for the range of Samsung's responses to a claim under this Warranty in accordance with the table below. In some instances the appropriate response to the claim will differ from the approach noted below. Digital Media Products Product Warranty Period Special Warranty Conditions LCD/LED Television 1 year This Warranty does not cover the cost of installation and de-installation of wall mounted units", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}