{"relation": [["", "Calories", "Total Carbohydrate 1%†", "Sugars **", "Vitamin C 10% (as ascorbic acid)", "Vitamin E 5% (as di-alpha-tocopheryl acetate)", "Tresalbio® ** Salvia hispanica Extract and fish oil concentrate omega fatty acid blend", "ALA **: (from Salvia hispanica extract)", "DHA ** (from fish oil concentrate)", "EPA ** (from fish oil concentrate)"], ["Amount Per Serving", "20", "4 g", "3 g", "6 mg", "1.5 IU", "200 mg", "78 mg", "32 mg", "10 mg"], ["% Daily Value 4 yrs. & Up", "", "**", "**", "15%", "15%", "**", "**", "**", "**"]], "pageTitle": "L'il Critters Omega-3 Gummy Fish 60 Gummies - Swanson Health Products", "title": "", "url": "https://www.swansonvitamins.com/lil-critters-omega-3-gummy-fish-60-gummies?adobeRecordId=LCR001&quantity=1", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988250.59/warc/CC-MAIN-20150728002308-00147-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 935280319, "recordOffset": 935251871, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{86567=†Ratings based on results of the 2015 ConsumerLab.com Vitamin and Supplement Users Survey. More information at www.consumerlab.com/survey2015., 87570=© 2015 Swanson Health Products}", "textBeforeTable": "Servings Per Container 30 Serving Size 2 Gummy FIsh Supplement Facts Omega-3 Gummy Fish Product Label: Omega-3 Gummy Fish from L'il Critters--Kids Love 'em, Parents Trust Them! Natural lemonade, cherryade and strawberry lemonade flavors. Contains no wheat (gluten), milk, eggs, peanuts or tree nuts. Natural colors & flavors. Gluten free 32 mg of DHA per serving Omega-3 Gummy Fish for kids Omega-3 Gummy Fish Product Description: If you are dissatisfied for any reason, we'll give you a full refund and pay return shipping. Lee Swanson, President of Swanson Health Products Risk-Free Purchase Guarantee Watch now to learn more \"With my personal 100% money-back satisfaction guarantee, you have nothing to lose and great savings to gain.\" Lee Swanson, President of Swanson Health Products Why Shop Swanson® Brands? Omega-3 Gummy Fish from L'il Critters--Kids Love 'em, Parents Trust Them! Natural lemonade, cherryade and strawberry lemonade flavors. Contains no wheat (gluten), milk, eggs, peanuts or tree nuts. Natural colors & flavors. Gluten free", "textAfterTable": "†Percent Daily Values are based on a 2,000 calorie diet. **Daily Value not established. Other ingredients: Glucose Syrup, Sucrose, Gelatin, Natural Flavors, Citric Acid, Colors (Carrot and Blueberry Juices, Black Carrot Juice Extract, Turmeric), Soy Lecithin, Lactic Acid and Fumaric Acid. Suggested Use: As a dietary supplement, parents may give each child up to two (2) L'il Critters® Omega-3 Gummy Fish™ per day. Instruct child to chew each gummy fish carefully and thoroughly. Take only as directed. Do not exceed suggested dosage. If your child has a medical condition or is on medication, please consult a physician before using this product. Not recommended for children under two years of age due to choking. Do not use if inner seal is broken or missing. This product may settle during shipping. Store at room temperature. Do not expose to excessive heat or moisture. Natural colors will darken over time. This does not alter the potency of the product. Keep out of reach of children. This product contains natural colors & flavors. Contains no wheat (gluten), milk, eggs, peanuts or tree nuts. Terms and Ingredient Definitions Omega-3 Gummy Fish Swanson $5.25 Add To Order Quantity:", "hasKeyColumn": true, "keyColumnIndex": 1, "headerRowIndex": 0}