{"relation": [["Instance Name", "The Deadmines", "Ragefire Chasm", "Wailing Caverns", "Shadowfang Keep", "Stormwind Stockade", "Blackfathom Deeps", "Gnomeregan", "The Scarlet Monastery – Graveyard", "The Scarlet Monastery – Library", "The Scarlet Monastery – Armory", "The Scarlet Monastery – Cathedral", "Razorfen Kraul", "Maraudon – Purple Crystals", "Maraudon – Orange Crystals", "Maraudon – Pristine Waters", "Uldaman", "Dire Maul – East", "Scholomance", "Dire Maul – West", "Razorfen Downs", "Dire Maul – North", "Stratholme – Main Gate", "Zul’farrak", "Stratholme – Service Entrance", "Blackrock Depths – Prison", "Blackrock Depths – Upper City", "The Sunken Temple", "Lower Blackrock Spire", "Upper Blackrock Spire"], ["Level Range", "15-21", "15-21", "15-25", "16-26", "20-30", "20-30", "24-34", "26-36", "29-39", "32-42", "35-45", "30-40", "30-40", "32-42", "34-44", "35-45", "36-46", "38-48", "39-49", "40-50", "42-52", "42-52", "44-54", "46-56", "47-57", "51-61", "50-60", "55-65", "55-65"], ["Minimum Level", "10", "10", "10", "11", "15", "15", "19", "21", "21", "21", "21", "25", "25", "25", "25", "30", "31", "33", "34", "35", "37", "37", "39", "37", "42", "42", "45", "48", "48"]], "pageTitle": "Patch Notes | Psynister's Notebook | Page 2", "title": "", "url": "https://psynister.wordpress.com/category/world-of-warcraft/patch-notes/page/2/", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986148.56/warc/CC-MAIN-20150728002306-00034-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 885239759, "recordOffset": 885198408, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{76151=Posted by Psynister on March 9, 2010 in Blog, Patch Notes, World of Warcraft, 96024=Posted by Psynister on February 26, 2010 in Patch Notes, World of Warcraft, 91915=Not a whole lot of information there, but not too bad either. Looks like we’ll have another raid ready to go before Cataclysm hits, which makes me think we might be leaning more towards that November date for it’s release after all since we know of at least 2 patches now before it hits., 88934=Posted by Psynister on February 26, 2010 in Patch Notes, 82020=Posted by Psynister on March 3, 2010 in Patch Notes, 44313=Posted by Psynister on December 1, 2010 in Leveling, Patch Notes, Reputation, World of Warcraft, 27622=Posted by Psynister on December 2, 2010 in Patch Notes, Professions, Races, Reputation, Share Your Opinion, World of Warcraft, 68916=Posted by Psynister on June 24, 2010 in Patch Notes, Share Your Opinion}", "textBeforeTable": "And remember, the racial tabards are available to all of your toons. So if you’re going to do a lot of random dungeons then you might as well slap on a tabard and get your reputation and Ambassador achievements early on. It only takes about 10 dungeons in your level range to get from Neutral to Exalted with each race. That led me on a quest to find out which dungeons had changed their level requirements on us, and I happened to stumble onto such a list this morning. A lot of them stayed the same, or at least close enough that it doesn’t really make that much of a difference, while others took on pretty big changes. There have been a lot of changes with the 4.x patches, and with so many changes it’s often easy to overlook some them. Recently my wife has decided to level a Hunter and in our quest to get her some good one-handed weapons from dungeons we found out that the level requirements for one of them in particular (RFK) had changed. 01 Dec New Level Ranges: Dungeons and Battlegrounds Tags: 4.0.3a, Alliance, Class Quests, Dual Spec, Dual Specialization,", "textAfterTable": "Most of the low level dungeons didn’t change a whole lot, though we did see a small drop in Gnomeregan’s level. The most surprising one to me was Razorfen Kraul which jumped up to a level 30-40 instance which pushed it’s companion instance, Razorfen Downs, up to a level 40-50 instance. I’m not sure what the reasoning was for those changes unless they just felt there weren’t enough options in those brackets. As we push on into the mid-level range of vanilla instances we also see a drop in Marauden’s level as well as Dire Maul. One of the most surprising changes of all for me was seeing Scholomance as 38-48 when that was always one of the top instances in vanilla to me. Moving on to the later levels we see much of the same, though several off them got slight modifications to level ranges. Stratholme dropped a few levels which makes me really happy as I actually have a chance of getting it in my random queues while leveling now. Blackrock Depths jumps up a bit as does Sunken Temple, and Upper and Lower Blackrock Spire cap us off as the highest level dungeons. Most of these changes don’t mean a whole lot for leveling your toons except that you’ll see a few new faces while leveling if you’re a fan of LFG (like me). If you also share my love of hunting down specific pieces of gear while you level though, then you might", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}