{"relation": [["", "Bromelain", "Boswellia", "Bovine Cartilage", "Devil's Claw Root Extract", "White Willow Bark Extract", "Yucca Leaf Extract", "Feverfew Extract", "Celery Seed Extract", "Papain Extract", "Proprietary Blend of Australian Herbs"], ["Amount Per Serving", "150 mg", "75 mg", "50 mg", "31 mg", "25 mg", "25 mg", "15 mg", "8 mg", "4 mg", "130 mg"], ["%Daily Value", "†", "†", "†", "†", "†", "†", "†", "†", "†", "†"]], "pageTitle": "American BioSciences Flex Solve 24/7 60 Tabs - Swanson Health Products", "title": "", "url": "https://www.swansonvitamins.com/american-biosciences-flex-solve-24-7-60-tabs?adobeRecordId=AMB008&quantity=1", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987228.91/warc/CC-MAIN-20150728002307-00325-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 917993071, "recordOffset": 917968261, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{82487=© 2015 Swanson Health Products, 81484=†Ratings based on results of the 2015 ConsumerLab.com Vitamin and Supplement Users Survey. More information at www.consumerlab.com/survey2015.}", "textBeforeTable": "Servings Per Container: 60 Serving Size: 1 tablet Supplement Facts Flex Solve 24/7 Product Label: American BioSciences Flex Solve 24/7, the next generation of natural joint support formula, goes beyond glucosamine and chondroitin supplements. This is a unique blend of natural muco-polysaccharides with European and Australian herbs that work synergistically to fortify optimal joint function. Fast acting & effective Promotes joint flexibility Healthy joint support formula Flex Solve 24/7 Product Description: If you are dissatisfied for any reason, we'll give you a full refund and pay return shipping. Lee Swanson, President of Swanson Health Products Risk-Free Purchase Guarantee Watch now to learn more \"With my personal 100% money-back satisfaction guarantee, you have nothing to lose and great savings to gain.\" Lee Swanson, President of Swanson Health Products Why Shop Swanson® Brands? American BioSciences Flex Solve 24/7, the next generation of natural joint support formula, goes beyond glucosamine and chondroitin supplements. This is a unique blend of natural muco-polysaccharides with European and Australian herbs that", "textAfterTable": "† Daily Value not established. Other ingredients: Plant derived cellulose, magnesium stearate, colloidal silica. Directions: As a dietary supplement, take one tablet twice a day on an empty stomach. For additional support, take 2 tablets twice daily. Do not purchase if seal is broken. Keep out of reach of children. Do not use if you are hypersensitive to any ingredient in this formula or allergic to pineapples or papayas. Pregnant or lactating women and individuals taking prescription medications should consult a healthcare professional before use. Product of Australia. Terms and Ingredient Definitions Flex Solve 24/7 Swanson $31.69 Add To Order Quantity: Add To Order Shipping", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}