{"relation": [["Tool", "Cisco Security Advisories Responses, and Notices", "Bug Toolkit (registered customers only)", "Cisco Product/Technology Support", "Feature Navigator (registered customers only)", "Software Advisor (registered customers only)", "Download Software ( registered customers only)", "Cisco Security Intelligence Operations", "End-of-Life", "Cisco Applied Mitigation Bulletins", "How to Choose a Cisco IOS Software Release"], ["Description", "The Cisco PSIRT creates and maintains publications for security issues that affect Cisco products.", "Searches for known bugs based on software version, feature set, and keywords.", "Documentation for each release of Cisco IOS and NX-OS Software.", "Find releases that support a set of software features and platforms, and compare different releases.", "Compares IOS releases, matches IOS features to releases, and determines which software release supports a given hardware device.", "Download software, select by product type.", "Early-warning intelligence, threat and vulnerability analysis, and proven Cisco mitigation solutions to help protect networks.", "End-of-Life information.", "These bulletins describe techniques that use Cisco product abilities to detect and mitigate exploits.", "Provides guidelines to help choose the most appropriate Cisco IOS Software release to meet requirements and provides suggestions and tools to aid in this process."]], "pageTitle": "White Paper: Cisco IOS and NX-OS Software Reference Guide - Cisco Systems", "title": "", "url": "http://www.cisco.com/web/about/security/intelligence/ios-ref.html?referring_site=bodynav", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 11, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988065.26/warc/CC-MAIN-20150728002308-00180-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 361210999, "recordOffset": 361175103, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{69225=Figure 8a. Cisco IOS Software Packaging Model for 1900, 2900, and 3900 Series Integrated Services Routers, 97473=Cisco IOS Release 15.0 Feature Sets and Memory Recommendations for Cisco 1900, 2900 and 3900 Series Routers http://www.cisco.com/en/US/prod/collateral/iosswrel/ps8802/ps5460/product_bulletin_c25-566278_ps10537_Products_Bulletin.html, 46354=Figure 6a. Cisco IOS NX-OS Software Numbering for the Nexus 4000 and 5000 Series Switches and Nexus 1000 Virtual Switches, 95182=Cisco IOS XE Software for Cisco ASR 1000 Series Routers http://www.cisco.com/en/US/prod/collateral/routers/ps9343/product_bulletin_c25-448387.html, 80386=Figure 12 shows the output of the show version command on a Cisco 1002 router, the system image file name is shown in bold., 70636=Please see Cisco IOS Release 15.0 Feature Sets and Memory Recommendations for Cisco 1900, 2900, and 3900 Series Routers for more details., 97104=Cisco Software Activation and Compatibility Document http://www.cisco.com/en/US/docs/switches/lan/catalyst3750e_3560e/software/release/12.2_50_se/configuration/note/swactivn.html#wp52909, 94937=Cisco IOS XE Software for Cisco ASR 1000 Series Routers http://www.cisco.com/en/US/products/ps6642/prod_white_papers_list.html, 64050=For more information about Cisco advisories, please review Cisco Advisory Product Bulletin #1654., 40180=The Cisco IOS XE Software numbering scheme uses a major release, release version, and rebuild scheme. For more details see the Cisco IOS XE Software for Cisco ASR 1000 Series Router bulletin and Cisco IOS XE to Cisco IOS Version Number Mapping., 40714=Cisco IOS XE Software contains a number of components, including IOS daemon (IOSd), Interface Manager, Forwarding Manager, Chassis Manager, and others. For a list of Cisco IOS XE Software components see Troubleshoot Cisco ASR 1000 Series Aggregation Services Routers Crashes. The numeric scheme is the primary designation for Cisco IOS XE Software and applies to the collection of all components. The IOSd is a very visible component, it incorporates the routing protocol functionality and is essentially Cisco IOS Software code running as a user process. The origins of IOSd trace back to the Cisco IOS Software 12.2S release family. The IOSd uses a release designation that includes the letters XN and has a versioning scheme that is similar to the one used by Cisco IOS Software. Each version of Cisco IOS XE Software has an associated IOSd Cisco IOS Software version. See the Cisco ASR 1000 Series Release Notes for the mapping of the ASR IOS XE Software versions to the IOSd Cisco IOS versions., 30246=Note 1: Cisco IOS Software 12.0SY train is a descendant of the highly popular 12.0S train. The Cisco IOS Software 12.0S train was used in several platforms, but it is currently deployed mostly on the Cisco 12000 platform., 68177=Cisco IOS Packaging was introduced on Cisco access routers in May 2003, Cisco LAN switches in April 2005, and Cisco mid-range routers in July 2005. Refer to the Cisco IOS Packaging page for additional information about Cisco IOS Packaging., 46672=The platform designator is N for the Nexus 5000 Series Switches, E for the Nexus 4000 Series Switches, and S for the Nexus 1000 Series Switches. In addition, the Nexus 1000 virtual switch uses a two letter platform designation where the second letter indicates the hypervisor vendor that the virtual switch is compatible with, for example V for VMware. Applicable features, functions, and fixes in the platform independent code are present in the platform dependent release, in Figure 6a above, applicable fixes in Cisco NX-OS Software Release 4.0(1a) are present in the 4.0(1a)N1(1a) release., 74949=For further information on the advantages and disadvantages of running individual sub-packages or a complete Cisco IOS XE Software consolidated package, and the process of extracting the individual sub-packages, see Cisco ASR 1000 Series Aggregation Services Router Software Configuration Guide and the Cisco IOS XE Software for Cisco ASR 1000 Series Routers bulletin., 96404=Cisco IOS Software Product Lifecycle Dates & Milestones http://www.cisco.com/en/US/prod/collateral/iosswrel/ps8802/ps6969/ps1835/prod_bulletin0900aecd801eda8a_ps6350_Products_Bulletin.html, 68720=Cisco Integrated Services Routers Generation Two (ISR G2) 1900, 2900, and 3900 Series support services on demand through the use of software licensing which enables customers to realize operational savings through ease of software ordering and management. When an order is placed for a new ISR G2 platform, the router is shipped with a single universal Cisco IOS Software image and a license is used to enable the corresponding feature set packages as shown in Figure 8a below.}", "textBeforeTable": "Table 1. Summary of the Most Significant Trains in the Cisco IOS and NX-OS Software Release Families To expedite the availability of new hardware support, a short-lived release can branch out of the technology train. For example, Cisco IOS Software Release 12.4(4)XD was a short-lived release that that contained features from 12.4(4)T and introduced support for the Cisco 7200 VXR Series Routers with NPE-G2, then support for the NPE-G2 was integrated into the 12.4T train with 12.4(11)T. The releases that start with an uppercase X after the closing parenthesis are called X-releases and are considered a short-lived release. In the Cisco IOS Software 15.0 release family a new strategy is in place, reminiscent to the one used in the Cisco IOS Software 12.2SX train. Unlike previous software release families, Cisco IOS 15.0 release family does not diverge into separate M and T trains but into M and T releases in the same train. For example, the first release in the Cisco IOS Software 15.0 release family is 15.0(1)M, where M indicates it is an extended maintenance release. An extended maintenance release is ideal for long-term maintenance and will provide rebuilds for 44 months. Not all releases in the Cisco IOS Software 15.0 release family will be extended maintenance releases; there will also be standard maintenance releases that receive the latest features and hardware support. The standard maintenance releases will have an uppercase T in their designation. Not all software families have separate mainline and technology trains. An example of this", "textAfterTable": "  12.2SE Provides Cisco IOS Software functionality and hardware support for mid-range and low-end Ethernet LAN switching for enterprise access and distribution networks, and mid-range and low-end Metro Ethernet for service provider edge networks that include the Cisco Catalyst 2960 Series, Cisco Catalyst 3550 Series, and Cisco Catalyst 3750 Series Switches.   12.2SG Provides Cisco IOS Software functionality and hardware support for the Cisco Catalyst 4500 Series Supervisor Engine II-Plus, Cisco Catalyst 4500 Series Supervisor Engine II-Plus-TS, Cisco Catalyst 4500 Series Supervisor II-Plus-10GE, Cisco Catalyst 4500 Supervisor Engine IV, Cisco Catalyst 4500 Supervisor Engine V, Cisco Catalyst 4500 Series Supervisor Engine V-10GE, Cisco Catalyst 4500 Supervisor Engine 6-E, Cisco Catalyst 4900 Series Switches, and Cisco Catalyst 4900M Switch.   12.2SR Provides Cisco IOS Software functionality and hardware support for high-end Metro Ethernet and MPLS PE for service provider edge networks.   12.2SX Provides Cisco IOS Software functionality and hardware support for high-end Ethernet LAN switching for enterprise access, distribution, core, and data center networks. Cisco IOS Software Modularity is a feature set available in the 12.2SX train. Cisco IOS XE Software 3.10 3.9 3.8 3.7 Cisco IOS XE Software is a Cisco IOS Software implementation that is optimized for compact routers at the network edge that deliver in-service software upgrades and software redundancy in", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}