{"relation": [["Estimated Number of", "school based youth benefiting", "non-school based youth benefiting", "elders benefiting", "artists participating", "individuals benefiting", "proposal events", "opportunities for public participation"], ["Response", "0", "3,000", "0", "6", "5,000", "3", "3"], ["Instructions to the Applicant", "Enter the number of individuals under the age of 18 that are expected to be participating in organized school based cultural events. This figure should reflect a portion of the total individuals benefiting.", "Enter the number of individuals under the age of 18 that are expected to be participating in non-school based cultural events. This figure should reflect a portion of the total individuals benefiting.", "Enter the number of individuals over the age of 65 that are expected to benefit from the proposal activities. This figure should reflect a portion of the total individuals benefiting.", "Enter the estimated number of professional artists that will be directly involved in providing artistic services specifically identified with the proposal. Include living artists whose work is represented in an exhibition regardless of whether the work was provided by the artist or by an institution. This figure should reflect a portion of the total individuals benefiting.", "Give the total number of individuals that are expected to be involved in proposal activities as artists, non-artists, participants, or audience members. This number should include the values listed for youth, elders and artists.", "How many different events will be produced or presented within the grant period as a part of this proposal? Be sure to list different events, not performances. For example, a musical performed 10 times is only one event, but a musical performed 10 times and workshop done once are two events.", "Each event will have one or more opportunities for public participation. For example a musical performed 10 times is one event with 10 opportunities for public participation."]], "pageTitle": "Example Application #16.5.200.104", "title": "", "url": "http://apply.florida-arts.org/view/exampleApplication/?id=4078", "hasHeader": true, "headerPosition": "MIXED", "tableType": "RELATION", "tableNum": 2, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042981525.10/warc/CC-MAIN-20150728002301-00164-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 9935961, "recordOffset": 9920331, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{8620=Founded in 2001, AWAH was,and,is the only organization in the Jacksonville area with a dedicated program designed to develop arts in healthcare for children with chronic or life-threatening illnesses. Over the past decade, AWAH has provided high quality arts in healthcare programming to more than 30,000 children and their families in the community., 8978=Through a successful, long-term partnership with Wolfson Children's Hospital in Jacksonville, the program utilizes a variety of visual arts as a key for self-expression, a motivational tool, a coping mechanism and a form of interaction for the young in need. In response to a request by Nemours Children's Clinic, AWAH expanded the program in 2004 to provided program services to oncology and hematology patients. AWAH also has expanded services to Ronald McDonald House and Kids Together Against Cancer. Our program is adaptable to the individual patient and the place in the healthcare facility. i.e. isolation, group participation, disabilities. Our training is consistent through the development of our concise Policy and Procedures Manual., 15413=Art with a Heart in Healthcare will also have a role in the upcoming annual conference of 2015 for the Global Alliance for Arts and Health. This is an international conference bringing awareness of the benefits arts has in the health place., 3409=Art with a Heart in Healthcare (AWAH) provides professionally trained artists to patients at Wolfson Children's Hospital (WCH). Using paints, brushes, pastels and paper, and other multi-disciplinary mediums, the AWAH team of trained staff artists, volunteers, University of North Florida interns and visiting artists create works of art for and with children ages 4 to 19. Experiences staff artists function as a patient's guide to transform pain, anxiety and isolation into hope, empowerment and a sense of accomplishment during the very difficult period of hospitalization. The proposed application is to continue a part-time artist to work in conjunction with Wolfson Children's Hospital's Child Life Services and Behavioral Health Unit to provide additional artistic services and supervised and trained volunteers for the expansion of the hospital. Wolfson's has added four new pediatric floors that will include more family suites and support areas, as well as additional surgery, research and education facilities to ensure that the children continue to have access to the finest care and treatment. This artist will impact over 1400 patients and families with personalized art experiences in the hospital setting., 5095=Activities and Timeline: AWAH currently has three part-time staff artists, 5 contact artists and 8 volunteers to provide music and art for critically ill children at WCH for over 40 hours per week, six days a week. With the expansion of the hospital to include four additional floors of child healthcare and expansion of Behavioral Health, the need for creative resources will continue in 2015. This part-time artist, working 30 hours a week for fifty weeks, will work with the AWAH team, Child Life Services and Behavioral Health to identify those patients in need of arts as a therapeutic module to relief the stress of pain, anxiety and hospitalization. Please see attached Artist-in-resident responsibilities/duties.}", "textBeforeTable": "Proposal Information A. Application Details Application 16.5.200.104 Art With a Heart in Healthcare, Inc. Return to example applications.", "textAfterTable": "Applicant Information Item Response Corporate Name Art With a Heart in Healthcare, Inc. DBA Name N/A Federal Employer ID 26-1313805 Principal Address 841 Prudential Drive, Suite 150 Jacksonville, FL 32207-8329 County Duval Applicant Email Address loripresto@att.net Grant Contact Lori Presto, Operations Director Authorized Official Melissa Roland, Chairman of the Board Website www.artwithaheart.info B. Excellence (Up to 40 points) These are the application responses associated with the Excellence and Innovation review criterion. Mission Statement Art with a Heart in Healthcare provides personalized fine art experiences that enhance the healing process for patients and their families. Proposal Description Instructions to the Applicant Describe the proposal for which you are requesting funding. Include goals, fully measurable objectives, activities, and a timeline. If you are an LAA or SSO, please include a statement that describes the services provided to your audience (including membership) and how those services are provided. Art with a Heart in Healthcare (AWAH) provides professionally trained artists to patients at Wolfson Children's Hospital (WCH). Using paints, brushes, pastels and paper, and other multi-disciplinary mediums, the AWAH team of trained staff artists, volunteers, University of North Florida interns and visiting artists create works of art for and with children ages 4 to 19. Experiences staff artists function as a patient's guide to transform pain, anxiety and", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}