{"relation": [["RDF Property", "Definition:", "Range:", "Usage note:", "Example:", "See also:"], ["pav:authoredBy", "An agent that originated or gave existence to the work that is expressed by the digital resource.", "rdfs:Resource", "The author of the content of a resource may be different from the creator of the resource representation (although they are often the same). See pav:createdBy for a discussion.", "The object of the triple should point to a URL that representes the person responsible for authoring the content, e.g. http://orcid.org/0000-0002-5711-4872.", "pav:createdBy"]], "pageTitle": "Dataset Descriptions for the Open Pharmacological Space", "title": "", "url": "http://www.openphacts.org/specs/2013/WD-datadesc-20130912/", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 28, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987628.47/warc/CC-MAIN-20150728002307-00293-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 626848091, "recordOffset": 626806506, "tableOrientation": "HORIZONTAL", "TableContextTimeStampBeforeTable": "{62183=The research leading to these results has received support from the Innovative Medicines Initiative (IMI) Joint Undertaking under grant agreement n° 115191, resources of which are composed of financial contribution from the European Union's Seventh Framework Programme (FP7/2007-2013) and EFPIA companies’ in kind contribution., 10215=An example is given below based on the ChemSpider deployment. (Note the use of an empty-string relative URI (<>) as a syntactic shortcut for the URI of the document that contains the statements; the real deployment has a date versioned URI such as ftp://ftp.rsc-us.org/OPS/20130408/void_2013-04-08.ttl.), 32017=The date issued property is used to capture the date a dataset is issued for public release which may also be the date it was created. This can be used to distinguish the version of a dataset where there are no version numbers, e.g. datasets that are continually updated and do not have fixed version numbers, particularly those that contain on-going user generated content. The date issued should be specified as an xsd:dateTime literal. Where values are unknown then these should be set to the start of the time period, e.g. for a dataset issued on the 23 July 2013 but we do not need to capture the time we would use the literal value \"2013-07-23T00:00:00\"^^xsd:dateTime.}", "lastModified": "Thu, 12 Sep 2013 16:15:51 GMT", "textBeforeTable": "Properties Provenance, Authoring and Versioning Ontology foaf:primaryTopic See also: Relates a document, e.g. a DatasetDescription, to the things that the document is about, e.g. Datasets. Usage note: foaf:Document Domain: A topic of some page or document. Definition: foaf:topic RDF Property foaf:topic See also: Relates a document, e.g. a DatasetDescription, to the main thing the document is about, e.g. Dataset. The value of this property is a URI that appears in the dataset description. foaf:primaryTopic is a functional property which means that it can be used at most once. Usage note: foaf:Document Domain: The primary topic of some page or document. Definition: foaf:primaryTopic RDF Property foaf:homepage, dcat:landingPage See also: For the ChemSpider RDF dataset, the foaf:page property could point to the associated MIRIAM record http://www.ebi.ac.uk/miriam/main/collections/MIR:00000138. For more details see Section 2.1 of the VoID Specification. Example: Specifies a webpage or document for the resource. Points", "textAfterTable": "RDF Property pav:authoredOn Definition: The date this resource was authored. Range: rdfs:Literal typed as xsd:dateTime . Usage note: The dateTime is encoded as a literal in \"yyyy-mm-ddThh:mm:sszzzzz\" form (ISO 8601 Date and Time Formats). If the specific day or month are not known, then 01 should be specified. If the specific hour, minute or second are not known, then 00 should be specified. If the timezone is not known then Z should be specified. RDF Property pav:createdBy Definition: An agent primary responsible for making the digital artifact or resource representation. Range: rdfs:Resource Usage note: This property is distinct from forming the content, which is indicated with pav:contributedBy or its subproperties; pav:authoredBy, which identifies who authored the knowledge expressed by this resource; and pav:curatedBy, which identifies who curated the knowledge into its current form. Example: The object of the triple should point to a URL that representes the person or tool responsible for creating the digital artifact, e.g. http://orcid.org/0000-0002-5711-4872. See also: pav:authoredBy, pav:createdWith RDF Property", "hasKeyColumn": false, "keyColumnIndex": -1, "headerRowIndex": 0}