{"relation": [["County", "", "Flagler", "Sumter", "Pinal", "Osceola", "Franklin", "Culpeper", "Washington", "Kendall", "St. Lucie", "Rockwall"], ["State", "", "FL", "FL", "AZ", "FL", "WA", "VA", "UT", "IL", "FL", "TX"], ["Percent increase", "", "14.8", "12.8", "10.2", "9.5", "9.4", "9.3", "8.6", "8.5", "8.2", "7.7"]], "pageTitle": "Fastest growing housing markets - Aug. 21, 2006", "title": "", "url": "http://money.cnn.com/2006/08/21/real_estate/Fastest_growing_housing_markets/index.htm?postversion=2006082209", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 5, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986357.49/warc/CC-MAIN-20150728002306-00156-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 162723743, "recordOffset": 162707349, "tableOrientation": "HORIZONTAL", "TableContextTimeStampBeforeTable": "{128=© 2015 Cable News Network. A Time Warner Company. All Rights Reserved. Terms under which this service is provided to you. Privacy Policy. .}", "TableContextTimeStampAfterTable": "{37840=The market's housing stock expanded by 14.8 percent, or 5,000 units, in the 12 months ended July 1, 2005, the most recent data available., 58973=Most stock quote data provided by BATS. Market indices are shown in real time, except for the DJIA, which is delayed by two minutes. All times are ET. Disclaimer. Morningstar: © 2015 Morningstar, Inc. All Rights Reserved. Factset: FactSet Research Systems Inc. 2015. All rights reserved. Chicago Mercantile Association: Certain market data is the property of Chicago Mercantile Exchange Inc. and its licensors. All rights reserved. Dow Jones: The Dow Jones branded indices are proprietary to and are calculated, distributed and marketed by DJI Opco, a subsidiary of S&P Dow Jones Indices LLC and have been licensed for use to S&P Opco, LLC and CNN. Standard & Poor's and S&P are registered trademarks of Standard & Poor’s Financial Services LLC and Dow Jones is a registered trademark of Dow Jones Trademark Holdings LLC. All content of the Dow Jones branded indices © S&P Dow Jones Indices LLC 2015 and/or its affiliates.}", "textBeforeTable": "The top ten U.S. counties ranked by housing growth rate. Fastest growing counties .sm10 { font-size: 10px; } .cc11 { font:normal 11px Arial; padding:3px;} .cc10 { font:normal 11px Arial; padding:3px;}", "textAfterTable": "Source:U.S. Census Bureau There were 124.5 million housing units in the entire United States, a 1.5 percent increase from a year earlier. Three of the top four fastest-growing counties were in Florida, with Sumter County - 12.8 percent growth - at No. 2. Pinal County, Arizona, was third with a 10.2 percent increase, but another Arizona county, Maricopa, recorded the largest numerical increase of any U.S. county; it added 52,000 homes during the 12 months, a 3.7 increase. Nevada added homes at a faster pace than any other state; its growth rate of 4.4 percent was three times the rate of the nation as a whole. Florida was the numerical leader with 246,842. Rhode Island added just 1,505 homes, a 0.3 percent increase, the lowest rate in the nation. Washington, D.C., which added 1,175, was the lowest in terms of sheer numbers, but its rate of growth was 0.4 percent, just nosing out \"Little Rhody.\" Latest home prices for 151 markets Vacation home market in a funk Best places to live: See the 100 finalists  Find mortgage rates in your area", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}