{"relation": [["Template Name", "Access Review Remediation Notice", "Bulk Attestation Notice", "Policy Violation Notice", "Access Scan Begin Notice", "Access Scan End Notice"], ["Purpose", "Sent to remediators by an access review when user entitlements are initially created in a remediating state.", "Sent to attestors by an access review when they have pending attestations.", "Sent to remediators by an audit policy scan when violations occur.", "Sent to an access scan owner when an access review starts a scan.", "Sent to an access scan owner when an access scan completes."]], "pageTitle": "Chapter 13 Identity Auditing: Basic Concepts (Sun Identity Manager 8.1 Business Administrator's Guide)", "title": "", "url": "http://docs.oracle.com/cd/E19225-01/820-5822/byayv/index.html", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 1, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988922.24/warc/CC-MAIN-20150728002308-00212-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 71471527, "recordOffset": 71463325, "tableOrientation": "HORIZONTAL", "lastModified": "Thu, 16 Jun 2011 09:16:08 GMT", "textBeforeTable": "Table 13–1 Identity Auditing Email Templates Identity Auditing uses email-based notification for a number of operations. For each of these notifications, an email template object is used. The email template allows the headers and body of email messages to be customized. Email Templates To look up how to perform other identity auditing tasks in the Administrator interface, see Table B–8. This quick reference tells you where to go to start a variety of auditing tasks. Identity Auditing Tasks Interface Reference For more information about this feature, see Managing Access Reviews. The Access Reviews tab enables you to launch, terminate, delete, and monitor the progress of your access reviews. It displays a summary report of the scan results with information links that enable you to access more detailed information about the review status and pending activities. Access Reviews Use the Manage Access Scans tab to create, modify, and delete access scans. Here you can define scans that you want to run or schedule for periodic access reviews. For more information about this feature, see Periodic Access Reviews and Attestation. Manage Access Scans Detailed information about these tasks follows in the section A Sample Audit Policy Scenario. Delete a policy Select a policy to view or edit Create an audit policy From the Manage Policies page, you can work with audit policies to accomplish these", "textAfterTable": "Enabling Audit Logging Before you can begin managing compliance and access reviews, the Identity Manager audit logging system must be enabled and configured to collect audit events. By default, the auditing system is enabled. An Identity Manager administrator with the Configure Audit capability can configure auditing. Identity Manager provides the Compliance Management audit configuration group. Use the following steps to view or modify events stored by the Compliance Management group: Log in to the Administrator interface (Logging in to the Identity Manager End-User Interface). Select Configure from the menu bar, and then click Audit. On the Audit Configuration page, select the Compliance Management audit group name. Note – For more information about setting up audit configuration groups, see Configuring Audit Groups and Audit Events. For information about how the audit system records events, see Chapter 10, Audit Logging About Audit Policies An audit policy defines account limits for a set of users of one or more resources. It comprises rules that define the limits of a policy and workflows to process violations after they occur. Audit scans use the criteria defined in an audit policy to evaluate whether violations have occurred in your organization. The following components comprise an audit policy:", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}