{"relation": [["FEES & CHARGES", "Card purchase and Annual Fee", "Secondary Card purchase (applied to the card balance)", "Load and reload", "Point of sale transaction - international", "Point of sale transaction - domestic", "ATM transaction - international", "ATM transaction - domestic", "Over the counter cash - international", "Over the counter cash - domestic", "FX mark-up where a Transaction is performed in a currency different from the currencies available on the card", "Available balance enquiry - online", "Available balance enquiry - ATM", "Available balance enquiry - online", "PIN reminder*", "Card renewal", "Card replacement fee - damaged/lost/stolen", "Redemption processing fee"], ["HKD", "Free", "75.00", "Free", "Free", "25.00", "Free", "25.00", "70.00 plus 2% of withdrawal amount", "70.00 plus 2% of withdrawal amount", "2.49%", "Free", "4.50", "Free", "Free", "Free", "75.00", "25.00"]], "pageTitle": "Caxton FX | Frequently asked questions", "title": "", "url": "https://www.caxtonfx.com/faqs", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 18, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986451.45/warc/CC-MAIN-20150728002306-00291-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 885915507, "recordOffset": 885876975, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{124639=You can transact a maximum of £50,000 when using our Caxton FX FastPay service. If you wish to transfer currency over this amount, you can use our Telephone transfer Service, by calling 0845 658 2223., 125366=If you do need further information you can watch our Online Payment demo or call us on 0845 658 2223., 110773=The Prepaid Card programme is managed by Caxton FX Ltd, Portland House, Bressenden Place, London SW1E 5BH. If you are unhappy in any way with your currency card or the way it is managed, tell us by using the e-mail enquiry facility on the website so we can investigate the circumstances for you. Any complaints you have will be dealt with quickly and fairly. You may be able to take unresolved complaints to the Financial Ombudsman Service at South Quay Plaza, 183 Marsh Wall, London E14 9SR. Telephone: 0845 080 1800 and e-mail: enquiries@financial-ombudsman.org.uk, 105343=You can redeem the funds on your currency card at any time, in whole or in part. To do so, please either send us an e-mail using the Contact us facility on the website, or contact us by telephone on 0845 222 2639 from the UK or +44 20 7201 0526, requesting redemption and indicating the amount to be redeemed., 119356=The maximum Auto Top-Up value is £1000, €1500 and $2000, 134981=If you are still experiencing difficulty, after speaking to your bank, please contact the Caxton FX helpdesk by calling 0845 658 2223., 135605=No. You can make as many international transfers as you need. We do ask that the amount you transfer online is between £100 and £20,000. If you need to transfer currency to an amount over £20,000 please call us on 0845 658 2223 for details about our Currency Services., 109387=The card has expired and you have not confirmed that you need a replacement; please check the expiry date on the card itself. If you need help, please call 0845 222 2639 from the UK or +44 20 7201 0526 when calling internationally, or email info@caxtonfxcard.com, 120459=You can redeem the funds on your currency card at any time, in whole or in part. To do so, please ensure you have switched off the Auto Top-Up facility then either send us an e-mail using the Contact us facility on the website, or contact us by telephone on 0845 222 2639 from the UK or +44 20 7201 0526, requesting redemption and indicating the amount to be redeemed., 92118=If you lose your card, it's stolen or you suspect that your card has been used by someone, you must tell us as soon as you can by calling our 24-hour lost and stolen helpline on 0333 123 1812 from the UK or from outside the UK +44 207 201 0526 when calling internationally. We will then cancel your card. We will ask the police to investigate any suspected misuse of your card and they may need more information and assistance from you. We will refund the amount of any transactions which the investigations show are not authorised by you, provided you have kept your card and PIN secure. However, if the investigations show that any disputed transaction was authorised by you, or you have not kept your card or PIN secure, we will not refund the transaction amount., 125590=A beneficiary is the payee or the details of the account to which you wish to send money overseas. Call us on 0845 658 2223 to discuss your needs and for a rate quote., 141515=© 2015 Caxton FX Limited. All rights reserved. Caxton FX Limited authorised and regulated by the Financial Conduct Authority (reg no: 431844). Registered with HM Revenue and Customs as a Money Service Business (reg no: 12149429). Registered in England and Wales (reg no: 04610337). Registered office: Portland House, Bressenden Place, London SW1E 5BH., 116535=You can reload your card free of charge by logging into the cardholder area of the website. Alternatively, you can do it by telephone. Just call us on 0845 222 2639 from the UK or +44 20 7201 0526 when calling internationally. You can also load your currency card via SMS., 111580=Call us on 0845 222 2639 from the UK or +44 20 7201 0526 when calling internationally or email us., 108143=You have a legal right to cancel your currency card within 14 days of receiving it. Under these terms and conditions, you also have the right to cancel your currency card at any time after this 14-day period. If your currency card is cancelled, we will immediately block your card so it cannot be used. You will not be entitled to a refund of money you have already spent on transactions authorised, pending or any fees for use of the card before it is cancelled. You can cancel your currency card by sending an email to us using the Contact us function on the website or by calling us on 0845 222 2639 from the UK or +44 20 7201 0526 when calling internationally., 113964=If you lose your card, it's stolen or you suspect that your card has been used by someone, you must tell us as soon as you can by calling our 24-hour lost and stolen helpline on 0845 222 2639 from the UK or from outside the UK +44 207 201 0526 when calling internationally. We will then cancel your card. We will ask the police to investigate any suspected misuse of your card and they may need more information and assistance from you. We will refund the amount of any transactions which the investigations show are not authorised by you, provided you have kept your card and PIN secure. However, if the investigations show that any disputed transaction was authorised by you, or you have not kept your card or PIN secure, we will not refund the transaction amount., 137503=Yes. Caxton FX Limited is authorised and regulated by the Financial Conduct Authority under the Financial Services and Markets Act 2000 as well as the Payment Services Regulations 2009. For more information on the security of your funds please click here.}", "textBeforeTable": "HUF NOK DKK SEK PLN HKD JPY ZAR NZD AUD CAD CHF USD EUR GBP Fees, Charges & Limits in: You can find a full list of all load limits below: Are there any minimum or maximum load limits? Yes you can. You can load your card with Sterling and we will convert into the local currency at the time of the transaction.  Can I load Sterling onto my card and use it on my travels? Yes you can. You can have any of the currencies listed above on your card at any one time. Simply choose the currency you want to load from the drop down within your account. I’ve loaded my Caxton FX card with Euros. Can I load another currency onto my card? NOK Norwegian Krone PLN Polish Zloty HUF Hungarian Forint SEK Swedish Krona JPY Japanese Yen AUD Australian Dollar USD US Dollar", "textAfterTable": "Limits GBP Minimum load 100 Maximum single load 6,500.00 Maximum total available balance 6,500.00 Maximum number of loads per day 2 Maximum load amount per year 50,000.00 Maximum number of point of sale Transactions per 24-hour period 20 Maximum number of ATM withdrawals per 24-hour period 2 Maximum value of single ATM withdrawal 300 FEES & CHARGES EUR Card purchase and Annual Fee Free Secondary Card purchase (applied to the card balance) 6.50 Load and reload Free Point of sale transaction - international Free Point of sale transaction - domestic 2.00 ATM transaction - international Free ATM transaction - domestic 2.00 Over the counter cash - international 6.00 plus 2% of withdrawal amount Over the counter cash - domestic 6.00 plus 2% of withdrawal amount", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}