{"relation": [["Subcommand", "create", "delete", "disable", "enable", "export", "list", "list-props", "monitor", "reset", "set", "show", "status", "unmonitor"], ["Purpose", "Creates new logical host name resources.", "Deletes logical host name resources.", "Disables logical host name resources.", "Enables logical host name resources.", "Exports logical host name resource configuration,", "Displays a list of the logical host name resources.", "Displays a list of the properties of the logical host name resources.", "Turns on monitoring for logical host name resources.", "Clears an error flag that is associated with logical host name resources.", "Sets specified properties of the logical host name resources.", "Displays the configuration of logical host name resources.", "Displays the status of logical host name resources.", "Turns off monitoring for logical host name resources."]], "pageTitle": "Object-Oriented Command Set Overview (Sun Cluster Data Services Planning and Administration Guide for Solaris OS)", "title": "", "url": "http://docs.oracle.com/cd/E19787-01/820-4682/gbhaz/index.html", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 8, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989826.86/warc/CC-MAIN-20150728002309-00073-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 69803466, "recordOffset": 69795264, "tableOrientation": "HORIZONTAL", "lastModified": "Wed, 26 Jan 2011 09:42:00 GMT", "textBeforeTable": "claccess: Manage Sun Cluster Access Policies for Nodes Table A–2 The following tables list the commands in the object-oriented command set and the subcommands available with each command. Object-Oriented Command Set Overview Next: Appendix B Standard Properties Previous: Object-Oriented Command Names and Aliases Sun Cluster Data Services Planning and Administration Guide for Solaris OS Appendix A Sun Cluster Object-Oriented Commands  > Object-Oriented Command Set Overview Sun Cluster Data Services Planning and Administration Guide for Solaris OS  > Documentation Home  >", "textAfterTable": "combine Combines the specified DID instance with a new destination instance.  export Exports configuration information for a cluster device.  list Displays all device paths.  monitor Turns on monitoring for the specified disk paths.  populate Populates the global-devices namespace.  refresh Updates the device configuration information that is based on the current device trees on a cluster node.  rename Moves the specified DID instance to a new DID instance.  repair Performs a repair procedure on the specified device instances.  replicate Configures DID devices for use with controller-based replication.  set Sets the properties of the specified device.  show Displays a configuration report for all specified device paths.  status Displays the status", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}