{"relation": [["Rule", "1", "10", "21", "22", "23", "285"], ["Description", "If they want their money back, give it to them.", "Greed is dead.", "Never place profit above friendship.", "Latinum tarnishes, but family is forever.", "Money can never replace dignity.", "A good dead is its own reward."], ["Episode", "DS9 : Prophet Motive", "DS9 : Prophet Motive", "DS9 : Prophet Motive", "DS9 : Prophet Motive", "DS9 : Prophet Motive", "DS9 : Prophet Motive"]], "pageTitle": "Rules of Acquisition List", "title": "", "url": "http://www.ditl.org/paglistrules.php?Filter=2&ListReset=Yes&ListID=Reviews&ListReset=Yes", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 3, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989126.22/warc/CC-MAIN-20150728002309-00079-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 403161069, "recordOffset": 403152867, "tableOrientation": "HORIZONTAL", "textBeforeTable": "Rules of Acquisition List Show All Rating systemDirector statisticsWriter statisticsEpisode statistics Games All books Fallen Gods Synthesis Over a Torrent Sea Sword of Damocles Orion's Hounds The Red King Taking Wing Lost Souls Mere Mortals Gods of Night Quotable Star Trek DS9 Nitpickers TNG Nitpickers TOS Nitpickers Star Charts The Art of Star Trek Inside Star Trek Mr Scott's Guide The Klingon Dictionary VOY Companion DS9 Companion TNG Companion DS9 Tech Manual TNG Tech Manual TOS Tech Manual Chronology Encyclopedia Star Into Darkness Star Trek XI Nemesis Insurrection First Contact Generations Undiscovered Country The Final Frontier The Voyage Home Statistics Games Books Other Titan Destiny Books", "textAfterTable": "22 Latinum tarnishes, but family is forever. DS9 : Prophet Motive 23 Money can never replace dignity. DS9 : Prophet Motive 285 A good dead is its own reward. DS9 : Prophet Motive Additionally, the Voyager episode \"False Profits\" featured Neelix telling two Ferengi stranded in the Delta Quadrant that rule of acquisition number 299 was \"When you exploit someone, it never hurts to thank them\". We do not know if this is an accurate quotation; if it is, then we would need to believe that the Ferengi have added extra rules sometime prior to Voyagers accident and that Neelix has read up on these since. In DS9's \"House of Quark\", Quark himself suggested an additional rule: Rule 286, \"When Morn leaves, it's all over\". Quark was bemoaning the state of his business at the time, and it is unlikely that this rule is a real one. Yellow text = Canon source Green text = Backstage source Cyan text = Novel White text = DITL speculation Copyright Graham Kennedy Page views : 34,151 Last updated : 1 Jan 1970", "hasKeyColumn": true, "keyColumnIndex": 1, "headerRowIndex": 0}