{"relation": [["Hebrew", "כֹּל עוֹד בַּלֵּבָב פְּנִימָה", "נֶפֶשׁ יְהוּדִי הוֹמִיָּה", "וּלְפַאֲתֵי מִזְרָח, קָדִימָה,", "עַיִן לְצִיּוֹן צוֹפִיָּה,", "", "עוֹד לֹא אָבְדָה תִּקְוָתֵנוּ,", "הַתִּקְוָה בַּת שְׁנוֹת אַלְפַּיִם", "לִהְיוֹת עַם חָפְשִׁי בְּאַרְצֵנוּ,", "אֶרֶץ צִיּוֹן וִירוּשָׁלַיִם."], ["Transliteration", "Kol ‘od balevav penimah", "Nefesh yehudi homiyah,", "Ul(e)fa’atei mizrach kadimah,", "‘Ayin letziyon tzofiyah;", "", "‘Od lo avdah tikvateinu,", "Hatikvah bat sh(e)not ’alpayim,", "Lihyot ‘am chofshi b(e)’artzeinu,", "’Eretz-Tziyon viy(e)rushalayim."], ["English translation", "As long as in the heart, within,", "A Jewish soul still yearns,", "And onward, towards the ends of the east,", "an eye still gazes toward Zion;", "", "Our hope is not yet lost,", "The hope of two thousand years old,", "To be a free nation in our land,", "The land of Zion and Jerusalem."]], "pageTitle": "Hatikvah - Wikipedia, the free encyclopedia", "title": "", "url": "https://en.wikipedia.org/wiki/Hatikvah", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 2, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988511.77/warc/CC-MAIN-20150728002308-00172-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 878369639, "recordOffset": 878334582, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{18151=The text of Hatikvah was written in 1878 by Naphtali Herz Imber, a Jewish poet from Zolochiv, a city often referred to by its nickname \"The City of Poets\",[1] in the Kingdom of Galicia and Lodomeria, Austro-Hungary, today Zolochiv, Ukraine. Imber emigrated to the Land of Israel in the early 1880s and lived in two or more of the first Jewish colonies. The foundation of Hatikvah is Imber's nine-stanza poem named Tikvatenu [Our Hope] . In this poem Imber puts into words his thoughts and feelings in the wake of the establishment of Petah Tikva, one of the first Jewish settlements in the Land of Israel under Ottoman rule. Published in Imber's first book Barkai [The Shining Morning Star], Jerusalem, 1886 ,[2] the poem was subsequently adopted as an anthem by the \"Hovevei Zion\" and later by the Zionist Movement at the First Zionist Congress in 1897. The text was later revised by the settlers of Rishon LeZion, subsequently undergoing a number of other changes., 21668=A former member of the Sonderkommando reports that the song was spontaneously sung by Czech Jews in the entryway to the Auschwitz-Birkenau gas chamber in 1944. While singing they were beaten by Waffen-SS guards.[4], 56614=Some Arab Israelis object to Hatikvah due to its explicit allusions to Judaism. In particular, the text’s reference to the yearnings of “a Jewish soul” is often cited as preventing non-Jews from personally identifying with the anthem. In 2001, Saleh Tarif, the first Arab appointed to the Israeli cabinet in Israel's history, refused to sing \"Hatikvah\".[7] Ghaleb Majadale, who in January 2007 became the first Muslim to be appointed as a minister in the Israeli cabinet, sparked a controversy when he publicly refused to sing the anthem, stating that the song was written for Jews only.[8] In 2012, Salim Joubran, an Israeli Arab justice on Israel's Supreme Court, did not join in singing \"Hatikva\" during a ceremony honoring the retirement of the court's chief justice, Dorit Beinisch[9], 26626=The adaptation of the music for Hatikvah was done by Samuel Cohen in 1888. Cohen himself recalled many years later that he had hummed Hatikvah based on the melody from the song he had heard in Romania, Carul cu boi [The Ox Driven Cart] ., 21287=The British Mandate government briefly banned its public performance and broadcast from 1919, in response to an increase in Arab anti-Zionist political activity.[3], 23647=The melody for Hatikvah derives from La Mantovana, a 16th-century Italian song, composed by Giuseppe Cenci (Giuseppino del Biado) ca. 1600 with the text \"Fuggi, fuggi, fuggi da questo cielo\". Its earliest known appearance in print was in the del Biado's collection of madrigals. It was later known in early 17th-century Italy as Ballo di Mantova . This melody gained wide currency in Renaissance Europe, under various titles, such as the Pod Krakowem (folk song) (in Polish) , Cucuruz cu frunza-n sus [Maize with up-standing leaves] (in Romanian)  and the Kateryna Kucheryava (in Ukrainian) .[5] The melody is also very similar to musical theme famously used by the Czech composer Bedřich Smetana in his symphonic poem celebrating Bohemia, Má vlast, as Vltava (also known under the German title as Die Moldau). Smetana's work was, however, based on Czech folk song \"Kočka leze dírou\"., 13399=\"Hatikvah\" (Hebrew: הַתִּקְוָה, pronounced [hatikˈva], lit. English: \"The Hope\") is the national anthem of Israel. Its lyrics are adapted from a poem by Naftali Herz Imber, a Jewish poet from Złoczów, then part of the Kingdom of Galicia and Lodomeria, Austria-Hungary, (today, Zolochiv, Ukraine). Imber wrote the first version of the poem in 1877, while the guest of a Jewish scholar in Iași, Romania. The romantic anthem's theme reflects the Jews' 2000-year-old hope of returning to the Land of Israel, restoring it, and reclaiming it as a sovereign nation., 22552=When the State of Israel was established in 1948, Hatikvah was unofficially proclaimed the national anthem. However, it did not officially become the national anthem until November 2004, when it was sanctioned by the Knesset in an amendment to the Flag and Coat-of-Arms Law (now renamed the Flag, Coat-of-Arms, and National Anthem Law)., 54743=Some observant Jews object to Hatikvah on the grounds that the anthem is too secular and lacks sufficient religious emphasis, such as not mentioning God or the Torah. Thus, some religious Zionists have altered the song by switching the word \"חופשי\" (free, which in modern Hebrew can allude to a secular Jew being free of mitzvot) with the word \"קודש\" (holy), thus reading the line: \"To be a holy nation\", referring to the verse in Exodus 19:6 \"וְאַתֶּם תִּהְיוּ לִי מַמְלֶכֶת כֹּהֲנִים וְגוֹי קָדוֹש\" (you shall be for Me a kingdom of priests and a holy nation).}", "lastModified": "Sat, 25 Jul 2015 10:24:18 GMT", "textBeforeTable": "The official text of the national anthem corresponds to the first stanza and amended refrain of the original nine-stanza poem by Naftali Herz Imber. Along with the original Hebrew, the corresponding transliteration[a] and English translation are listed below. Official text[edit] The harmony of Hatikvah follows a minor scale, which is often perceived as mournful in tone and is rarely encountered in national anthems. There is a modulating shift to Major key as the words Tikvatenu and Hatikva appear, both mingled with a romantic octave leap which gives new dramatic energy to the melodic line. As the title \"The Hope\" and the words suggest, the import of the song is optimistic and the overall spirit uplifting. The adaptation of the music for Hatikvah was done by Samuel Cohen in 1888. Cohen himself recalled many years later that he had hummed Hatikvah based on the melody from the song he had heard in Romania, Carul cu boi [The Ox Driven Cart] . The melody for Hatikvah derives from La Mantovana, a 16th-century Italian song, composed by Giuseppe Cenci (Giuseppino del Biado) ca. 1600 with the text \"Fuggi, fuggi, fuggi da questo cielo\". Its earliest known appearance in print was in the del Biado's collection of madrigals.", "textAfterTable": "Hatikvah Sorry, your browser either has JavaScript disabled or does not have any supported player. You can download the clip or download a player to play the clip in your browser. Recorded in 2004 Problems playing this file? See media help. Vocal Sorry, your browser either has JavaScript disabled or does not have any supported player. You can download the clip or download a player to play the", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}