{"relation": [["Key Features", "High density and low power architecture", "Multiple power management modes with power gating and multi-voltage operation", "Flexible margining features", "Optional integrated pipeline", "Soft Error repair", "Advanced test features", "Pseudo Scan"], ["Benefits", "Minimizes die area to reduce die and packaging cost", "Flexible power management allows packaging cost reduction, competitive product with higher battery life", "Allows yield/performance tradeoff", "Allows high throughput", "Enables yield optimization", "Enhances product quality and minimizes field returns", "1. Cuts down test time drastically by orders of magnitude reducing overall product test cost significantly 2. Improved product quality lowers field failures"]], "pageTitle": "ROM - ARM", "title": "", "url": "http://www.arm.com/products/physical-ip/embedded-memory-ip/rom.php", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988065.26/warc/CC-MAIN-20150728002308-00170-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 320315003, "recordOffset": 320289907, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{78367=© ARM Ltd. Copyright 1995-2015}", "textBeforeTable": "Depending upon foundry, geometry and flavor the Register file compilers support multiple features to ensure optimal implementation of all types of designs Targeted for power sensitive handheld markets, these Low Power memories reduce leakage current by up to 30% over the standard memories. These memories are . Multiple power management modes available providing up to 20x reduction in leakage in power down mode over the regular standby mode                            High Density memories are 30% smaller compared to High speed memories and designed for high array efficiency. Targeted for mainstream and cost sensitive applications, these memories and can achieve up to 7000Kbits/sq mm at 28nm technology.                       Lowest risk solutions with ARM memories being used by IDMs, fabless start-ups, IC companies and design houses backed up by a knowledgeable customer support team available in multiple time zones Memory subcircuits optimized over multiple sub ranges to provide power, performance and area close to a custom design. Broad support for all leading EDA vendors ensuring quick time to market Flexible business models like ‘free library program’ and ‘try before you buy’ allowing lowest cost of ownership High density and low power ROM memories suitable for BOOT code ROM (Read Only Memory) is for the permanent storage of data within an SoC or other integrated circuit application. ARM offers both Via", "textAfterTable": "Power grid supported in all the advance nodes (90 nm and below). Multiple options for power rings supported in mature nodes. Metal 4 used as a top metal layer. 32nm ROM Compiler   Memory solution  Architecture Maximum size  Mux  ViaROM  High Density  1M bits  8, 16, 32 40/45nm ROM Compiler  Memory solution     Architecture Maximum size Mux  ViaROM  High Density  1M bits      8, 16, 32     ARM ROM (Read Only Memory) Embedded Memory IP may be used in complex SoC designs that require many types of IP across the design. In addition to ROM IP, ARM offers a wide variety of compatible Processor to Pads IP including ARM Processor, Multimedia, System and Physical IP, with which to develop your SoC. Visit  DesignStart to find ARM IP solutions for your SoC and start designing today. ARM Physical IP   ARM Processor IP   ARM System IP   ARM Multimedia IP   SRAM Memory Cortex-A9 Peripherals  ", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}