{"relation": [["Exposed Lingerie", "Small", "Medium", "Large", "XL", "Small/Medium", "Large/XL", "One Size", "XXL", "XXXL", "One Size Queen"], ["UK Dress size", "6 - 8", "10 - 12", "14 - 16", "18 - 20", "6 - 12", "14 - 20", "6 - 20", "22 - 24", "26 - 28", "22 - 26"]], "pageTitle": "Exposed Liquid Plus Size Cupless Merry Widow and G-String Set at Lovehoney - Free Shipping & Returns on Bras, Basques & Corsets", "title": "", "url": "http://www.lovehoney.com/product.cfm?p=17945", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987552.57/warc/CC-MAIN-20150728002307-00181-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 566154508, "recordOffset": 566138543, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{17443=Order over the phone: Call 1-866-647-9194 and quote code 22124.}", "textBeforeTable": "Bust - measure the fullest part of the bust from the armpit. All bra cup sizes are equivalent to a size “B”. They are not full coverage so the amount of cleavage will vary depending on the person’s actual cup size. Exposed Size Chart Material: Wet Look How it feels Washing instructions: Hand wash only Contains latex: No Essential info Product Description As shiny as PVC, this wet-look merry widow set is sure to impress! With built-in garter straps, a matching thong and a revealing cut, this tiny two-piece will make you look and feel fabulous. Made of the stretchy wet-look materials that have become synonymous with the Exposed Liquid range, this piece of lingerie is perfect fas bedroom and fetish wear. The low-cut neckline is completely cupless but the clever fit gives your bust a real boost! The open back and thick straps really give you that gorgeous fetish look and the attached garter straps allow you to attach absolutely any suspender stockings (sold separately). The supplied matching G-string is super small and super sexy, but we can't guarantee that it will stay on for long...", "textAfterTable": "  Exposed Lingerie US Dress size Small 4 - 6 Medium 8 - 10 Large 12 - 14 XL 16 - 18 Small/Medium 4 - 10 Large/XL 12 - 18 One Size 4 - 18 XXL  20 - 22 XXXL 24 - 26 One Size Queen 20 - 24   Explore more from our collections… Bondage > Fetish Clothing > Bras, Basques & Corsets Sexy Lingerie > Sexy Plus Size 14+ > Basques and Corsets All Exposed products Customer Reviews Exposed Liquid Plus Size Cupless Merry Widow and G-String Set 9 out of 10 9 out of 10 (9 reviews) Write your own review Order by: Newest Most helpful Rating I was worried, but it's great Reviewed: October 8, 2013 by sjohnson@jamaicabearings.com, a Straight Married Female Being a size 16 I always worry that lingerie will not fit, but this did! This really looks hot on, doesn't make", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}