{"relation": [["File name", "04", "15", "33", "34", "35", "36"], ["Number of data items", "149", "196", "225", "225", "225", "75"]], "pageTitle": "Chapter 9. Users Updates - Summary File 1 Technical Documentation - Survey Census 2000 - Social Explorer", "title": "", "url": "http://www.socialexplorer.com/data/C2000/documentation/7226814d-3423-4f14-9276-b07e4cd762d0", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 5, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988650.6/warc/CC-MAIN-20150728002308-00034-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 709487795, "recordOffset": 709467287, "tableOrientation": "HORIZONTAL", "textBeforeTable": "INDEX TO SUMMARY FILE 1 GEOGRAPHY NOTES back to top Geography Notes March 2005 In Census 2000, during the conversion process of making the race write-in entries on the enumerator-filled questionnaire consistent with those in the mailout/mailback questionnaire, a step was inadvertently omitted. This resulted in an overstatement by about 1 million people reporting more than one race (or about 15 percent of the Two or More Races population). This overstatement almost entirely affects race combinations involving Some Other Race with the five race groups identified by the Office of Management and Budget (White, Black or African American, American Indian or Alaska Native, Asian, and Native Hawaiian or Other Pacific Islander). The overstatement does not significantly affect the totals for the Office of Management and Budget race groups reporting a single race (race alone) or the reporting of the single race and at least one other race (race alone or in combination). back to top Data Note 5 October 2002 For further information about rounding methods, see the specific discussion of \"Rounding\" under DERIVED MEASURES in Appendix B, Definitions of Subject Characteristics in the Summary File 1 Technical Documentation. Discrepancies are due solely", "textAfterTable": "7 Tennessee 8 Wisconsin Geography Note 1 back to top Alaska: 02 Nelson Lagoon Alaska Native village statistical area (ANVSA) (AIANHH 7025) erroneously contains block 2010, census tract 1 (000100) in Aleutians East census area (01598), Aleutians East Borough (013). This block should have not been coded to any ANVSA (9999). This is incorrect in both the PL 94-171 data products and Summary File (SF) data products. This note applies to American FactFinder (AFF), CD-ROM, and redistricting data downloaded from the FTP site. Internal Errata ID 02-003 May 2001 Geography Note 2 back to top California: 06 Los Angeles city (FIPS code 44000) erroneously contains block 1011, census tract 4002.03 (400203) in East San Gabriel Valley CCD (FIPS code 90810), Los Angeles County (FIPS code 037), CA (FIPS code 06). This block should have been coded to the place Balance of East San Gabriel Valley CCD (FIPS code 99999). This is incorrect in both the PL 94-171 data products and Summary File (SF) data products. This note applies to American FactFinder (AFF), CD-ROM, and redistricting data downloaded from the FTP side. Internal", "hasKeyColumn": false, "keyColumnIndex": -1, "headerRowIndex": 0}