{"relation": [["Valuation", "Price/Earnings", "Price/Sales", "Price/Book", "Price/Cash Flow", "TEV/Sales"], ["RLJE", "NM", "0.0x", "0.2x", "NM", "NM"], ["Industry Range", "Not Meaningful", "", "", "Not Meaningful", "Not Meaningful"]], "pageTitle": "RLJ ENTERTAINMENT INC (RLJE:NASDAQ CM): Stock Quote & Company Profile - Businessweek", "title": "", "url": "http://www.bloomberg.com/research/stocks/snapshot/snapshot.asp?ticker=RLJE", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 3, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989142.82/warc/CC-MAIN-20150728002309-00045-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 321653391, "recordOffset": 321629787, "tableOrientation": "HORIZONTAL", "TableContextTimeStampBeforeTable": "{36865=+1 212 318 2000, 36533=+65 6212 1000}", "TableContextTimeStampAfterTable": "{11445=RLJ Entertainment Inc. previously disclosed that in conjunction with the $31 million private placement of convertible preferred stock transaction closed on May 20, 2015, RLJ Entertainment, Inc. agreed to reduce its Board of Directors size from nine to seven. The changes in directors, as previously announced, include the addition of two new independent directors as representatives of the holders of the convertible preferred stock and the resignation of four directors. On June 4, 2015, the company notified The NASDAQ Stock Market LLC that it was not in compliance with the board committee composition requirements as set forth in NASDAQ Listing Rule 5605 due to the director resignations announced on June 5, 2015. As a result, the company has one vacant position on its audit committee and two vacant positions on its compensation committee, which vacancies are not in compliance with NASDAQ Listing Rule 5605. On June 15, 2015, in response to the company’s notification, the company received a notice from NASDAQ confirming that the company is not in compliance with the independent director requirement as set forth in NASDAQ Listing Rule 5605. The Notice Letter indicates that consistent with NASDAQ Listing Rule 5605(c)(4) and 5605(d)(4), NASDAQ will provide the company with a cure period to regain compliance as follows: (i) until the earlier of the company's next annual shareholders' meeting or June 4, 2016 or (ii) if the company's next annual shareholders' meeting is held before December 8, 2015, then the company must evidence compliance no later than December 8, 2015. The Board of Directors expects to appoint one additional independent director to its audit committee and two additional independent directors to its compensation committee at its upcoming Board meeting to be held on June 30, 2015., 15809=RLJ Entertainment, Inc. announced unaudited consolidated earnings results for the first quarter ended March 31, 2015. For the quarter, the company reported revenues of $26,116,000, loss from operations of $7,340,000, loss before provision for income tax of $10,312,000 and net loss of $10,630,000 or $0.84 per basic and diluted share compared to revenue of $30,272,000, loss from operations of $6,373,000, loss before provision for income tax of $9,763,000 and net loss of $10,071,000 or $0.81 per basic and diluted share a year ago. Adjusted LBITDA was $3,416,000 compared to $6,704,000 a year ago. The increase in Adjusted LBITDA is primarily attributable to lower expenditures on content investments, which declined during the current period because the company is not currently producing any new content within its IP-Licensing segment. The decrease in revenue is primarily driven by the company's wholesale and direct-to-consumer segments., 13629=RLJ Entertainment Inc. announced that it received a letter from The NASDAQ Stock Market LLC (\"NASDAQ\") stating that the bid price of the Company's common stock for the last 30 consecutive business days had closed below the minimum $1.00 per share required for continued listing under Listing Rule 5550(a)(2). The NASDAQ notification letter does not result in any immediate delisting of the Company's common stock, and the stock will continue to trade uninterrupted on The NASDAQ Capital Market under the symbol \"RLJE.\" RLJ Entertainment has been provided an automatic grace period of 180-calendar days, or until December 2, 2015, to regain compliance. If at any time during the 180-day grace period, the minimum closing bid price per share of the Company's common stock closes at or above $1.00 for a minimum of ten consecutive business days (the NASDAQ Staff has the discretion to monitor the stock price for up to 20 trading days), RLJE would regain compliance. In the event the Company does not regain compliance within this grace period, it may be eligible to receive an additional 180-day grace period, provided that RLJ Entertainment meets the continued listing requirement for market value of publicly held shares and all other initial listing standards for The NASDAQ Capital Market, with the exception of the minimum bid price requirement, and provides written notice of its intention to cure the minimum bid price deficiency during the second 180-day grace period. In the event the Company is not able to regain compliance by the end of the applicable grace period, the Company's securities would be subject to delisting. RLJ Entertainment management intends to monitor the stock price and is considering available actions that could regain compliance.}", "textBeforeTable": "Industry Average RLJE Industry Analysis   // ]]> } document.write(BW_adsys('Right3')); if (window.BW_adsys) { // <script type=\"text/javascript\"> <div class=\"\" style=\"width:300px; margin: auto; \"> <div class=\"ad\"> </div> </table> </tbody> </tr> <td class=\"noDataRR\" style=\"border:none;\" colspan=\"3\"><a class=\"link_xs\" href=\"../../sectorandindustry/industries/industrydetail.asp?code=254010\">View Industry Companies</a></td> <tr> </tr> <td align=\"right\"><span class=\"negData\">-52.00</span></td> <td align=\"right\">&yen;3,533 <span class=\"xSmGreyTxt\">JPY</span></td> <td><a class=\"link_xsb\" href=\"../snapshot/snapshot.asp?ticker=6758:JP\">Sony Corp</a></td> <tr> </tr> <td align=\"right\"><span class=\"unchanged\">0.00</span></td> <td align=\"right\">2.25 <span class=\"xSmGreyTxt\">INR</span></td> <td><a class=\"link_xsb\" href=\"../snapshot/snapshot.asp?ticker=PRMC:IN\">Paramount Communications Ltd</a></td> <tr> </tr> <td align=\"right\"><span class=\"posData\">+0.16</span></td> <td align=\"right\">$39.18 <span class=\"xSmGreyTxt\">USD</span></td> <td><a class=\"link_xsb\" href=\"../snapshot/snapshot.asp?ticker=LGF:US\">Lions Gate Entertainment Corp</a></td> <tr> </tr> <td align=\"right\"><span class=\"posData\">+11.70</span></td> <td align=\"right\">333.70 <span class=\"xSmGreyTxt\">GBp</span></td> <td><a class=\"link_xsb\" href=\"../snapshot/snapshot.asp?ticker=ETO:LN\">Entertainment One Ltd</a></td> <tr> </tr> <td align=\"right\"><span class=\"negData\">-0.0076</span></td> <td align=\"right\">$0.63 <span class=\"xSmGreyTxt\">USD</span></td> <td><a class=\"link_xsb\" href=\"../snapshot/snapshot.asp?ticker=CIDM:US\">Cinedigm Corp</a></td> <tr> <tbody> </thead> </tr> <td width=\"50\" align=\"right\">Change</td> <td width=\"75\" align=\"right\">Last</td> <td>Company</td> <tr> <thead> <table class=\"colRight\" width=\"100%\" cellpadding=\"0\" cellspacing=\"0\"> <div class=\"clear\"></div> </div> <p class=\"note fLeft\" style=\"width:64%; text-align: right; padding: 5px 0; border-top: 3px solid #6B7B84; margin-top: 20px;\">Market data is delayed at least 15 minutes.</p> <h2 class=\"sectionTitle fLeft\" style=\"width: 35%; border-bottom: 0;\">RLJE Competitors</h2> <div style=\"border-bottom: 1px solid #ccc; overflow: hidden;\"> <div class=\"\"> </div> </table> </tbody> </tr> <td width=\"75\" align=\"right\" class=\"noBorder\"><img src=\"/cgi-bin/upload.dll/file.png?z03ae100az8fc09376897541ab8795ebf88e345e4f\" width=\"60\" height=\"15\" galleryimg=\"no\" symbol=\"US;RLJE\" /></td> <td align=\"right\" width=\"45\" class=\"noBorder\"><span class=\"negData\">-0.0077</span></td> <td align=\"right\" class=\"noBorder\">$0.40 <span class=\"xSmGreyTxt\">USD</span></td>", "textAfterTable": "View Detailed RLJE Financials  |  View Sector Analysis Sponsored Financial Commentaries Sponsored Links Browse Companies A B C D E F G H I J K L M N O P Q R S T U V W X Y Z  |  0 1 2 3 4 5 6 7 8 9 Report Data Issue To contact RLJ ENTERTAINMENT INC, please visit www.rljentertainment.com. Company data is provided by Capital IQ. Please use this form to report any data issues. Information Missing - Please enter your information in the following field(s): Company Name Your Name* Your E-Mail Address*", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}