{"relation": [["Stat", "IP", "BB/9", "K/9", "aLI", "RE24", "WPA"], ["Pearson’s R", "-.181", ".018", ".179", ".071", "-.054", "-.011"], ["p-value", "<.001", ".496", "<.001", ".006", ".035", ".683"]], "pageTitle": "Good For (More Than) One: Multi-Inning Saves | How Do I Baseball?", "title": "", "url": "http://howdoibaseball.com/2013/11/10/good-for-more-than-one-multi-inning-saves/", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989234.2/warc/CC-MAIN-20150728002309-00243-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 118482051, "recordOffset": 118457497, "tableOrientation": "HORIZONTAL", "TableContextTimeStampBeforeTable": "{5485=This first chart is simply a count of all of the multi-inning saves (let’s shorten it to MIS moving forward), broken down by year. The various coloured tiles denote a pitcher — as we can see, there were quite a few pitchers who notched a MIS back in the day, with quite a few of them notching multiple MISs in a season. The number at the end of each row is the number of MISs for a season; we can already see a drastic change in the role of a MIS, with 2005 being a particular watershed year for the ‘death’ of the MIS., 4588=Of the relievers with 10 or more MISs between our years of interest, we find one — ONE — who is still currently active moving into the 2013 offseason: Philadelphia Phillies closer Jonathan Papelbon. Adjusting the criteria to include pitchers who have made an appearance in the last three years and we grab one more pitcher, the aforementioned Rivera. All in all, this list is dominated by some of the bigger closer names of the 1980’s and 1990’s. Right now, there is a strong chance that the dying breed of the MIS closer is more truth than happenstance., 6114=So with that, let’s look at some data, all courtesy of Baseball-Reference.com and their invaluable Play Index tool. Using said tool, we will look at all saves of 1.1 innings or more between 1988 and 2013., 426=Again, we see some interesting trends, with an additionally interesting drop in aLI from 2008 to the past season; WPA doesn’t appear to have much change across the quarter century, with RE24 also showing a little drop off in the last couple of years, but making a return to pre-2010 values.}", "TableContextTimeStampAfterTable": "{2122=In spite of a number of stats showing us the MIS of years past are not the same as the few that we do see in our current day game, we haven’t seen the death of this quirky save just yet. In fact, an encouraging spike in MISs in 2013 — a jump to 44 after only 17 being notched in 2012 — shows us that with some help from the likes of Uehara as well as Los Angeles Angels of Anaheim’s Ernesto Frieri and veteran Carlos Marmol doing their bit to keep the MIS alive, perhaps we shouldn’t be so quick to pen the eulogy of the multi-inning save.}", "textBeforeTable": "Doing a Pearson’s correlation on all of these stats of interest across year, we get the following results: Again, we see some interesting trends, with an additionally interesting drop in aLI from 2008 to the past season; WPA doesn’t appear to have much change across the quarter century, with RE24 also showing a little drop off in the last couple of years, but making a return to pre-2010 values. Let’s grab a couple more stats that can help evaluate the quality of a reliever’s outing — average leverage index (aLI), run average by 24 based out situations (RE24), and win probability added (WPA). I will leave it to the reader to peruse this reference to get a better idea of the finer grain details of each of these stats. In a broad sense, looking at these stats, we can get a feel of how valuable and crucial these MISs were to the success of the team. So far, we have one solid and one potential change in the MIS over the last 25 years — more strikeouts per outing as of late, with the more recent MIS outings being shorter in duration as compared to those of yesteryear. Cool? I guess. While the walk (in orange) and inning (in red) rates are a little tough to see given how close the data run together, we do see a couple of trends — strikeout", "textAfterTable": "Created with the HTML Table Generator We find four of the six stats have a statistically significant correlation with year (P-value less than .05); in particular, a significant negative correlation between IP and RE24 and year and a significant positive correlation between K/9 and aLI and year is found. One caveat — RE24 is an additive stat, so the fact it trends significantly with innings pitched isn’t a huge deal. However, the fact that we find small (all Pearson’s R’s are very small, below .30) but significant trends in innings, strikeouts, and aLI do portend to the MIS evolving over the last 25 years. In spite of a number of stats showing us the MIS of years past are not the same as the few that we do see in our current day game, we haven’t seen the death of this quirky save just yet. In fact, an encouraging spike in MISs in 2013 — a jump to 44 after only 17 being notched in 2012 — shows us that with some help from the likes of Uehara as well as Los Angeles Angels of Anaheim’s Ernesto Frieri and veteran Carlos Marmol doing their bit to keep the MIS alive, perhaps we shouldn’t be so quick to pen the eulogy of the multi-inning save. Koji Uehara (Photo credit: Keith Allison)", "hasKeyColumn": false, "keyColumnIndex": -1, "headerRowIndex": 0}