{"relation": [["Fields", "Industry", "Portal Name", "Industry", "Company Address", "Regional Settings"], ["Description", "Select the industry to which your organization belongs to.", "This is automatically generated. You can also set your own portal name. This is important because, client portal helps your customers to access their quotes, invoices and make online payments.", "Select the industry in which your company focusses itself, from the drop down.", "Enter the address of your company.", "Enter the other basic details such as Currency, Language, Time Zone and Address."]], "pageTitle": "Simple Invoicing Software For Small Business : Zoho Invoice", "title": "", "url": "https://www.zoho.com/invoice/help/getting-started/welcome.html", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438044271733.81/warc/CC-MAIN-20150728004431-00176-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 928264152, "recordOffset": 928255950, "tableOrientation": "HORIZONTAL", "lastModified": "Thu, 30 Jul 2015 13:35:41 GMT", "textBeforeTable": "Step 1 : Organizational Details Just after the sign up process gets over, you will be navigated to a simple 5-page setup, where we will help you in capturing the basic information required in setting up your account, and you can start invoicing immediately. Setting Up your Account P.S: A verification mail will be sent to your email id. Click on the link provided in your mail to confirm and verify your email id. Once you finish the verification, your account will be activated. Now click on the Sign Up button to finish your sign up process and to start setting up your account. Your Country. Password for your Zoho Invoice account Your Email Address Your Name Your Company name To get started quickly, click on the Sign Up button from our Zoho Invoice homepage. You will have to fill up a simple sign up form comprising of, Signing Up Mobile users can run run Zoho Invoice on their iOS, Android & Windows platforms. Internet Explorer Opera Mozilla Firefox - Recommended Safari - Recommended Google Chrome - Recommended Currently Zoho Invoice has been tested to work brilliantly on the following browsers, click on the respective link to download or update your browser. To use Zoho Invoice you only need a Web", "textAfterTable": "Step 2 : Taxes If you collect tax from your customers for the product you deliver or the service you render, please enter your tax details. Step 3 : Setting up an Online Payment Gateway To get paid faster, set up an online payment gateway from some of the top payment gateway service providers supported by Zoho Invoice. Step 4 : Invoice Templates Select a template from the list of templates we have for invoice module. The template you select will be used while sending invoices to your customers. Contact our customer support 24/5 (Monday - Friday) US +1 (888) 900 9646 UK +44 (20) 35647890 Australia +61-2-80662898 India +91-44-66997000 Sales Enquiry sales@zohocorp.com Support Email support@zohoinvoice.com Want a feature? SUGGEST TOP", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}