{"relation": [["MODEL", "T2 3dr", "T2 5dr", "TR 3dr", "TR 3dr", "TR 3dr", "TR 5dr", "TR 5dr", "TR 5dr", "TR 5dr", "SR 3dr", "SR 5dr", "SR 5dr", "T Spirit 5dr", "T Spirit 5dr"], ["ENGINE", "1.0 VVT-i 5MT", "1.0 VVT-i 5MT", "1.0 VVT-i 5MT", "1.33 Dual VVT-i 6MT", "1.4 D-4D 6MT", "1.0 VVT-i 5MT", "1.33 Dual VVT-i 6MT", "1.33 Dual VVT-i 6MT MDS", "1.4 D-4D 6MT", "1.33 Dual VVT-i 6MT", "1.33 Dual VVT-i 6MT", "1.33 Dual VVT-i MDS", "1.33 Dual VVT-i 6MT", "1.33 Dual VVT-i MDS"], ["OTR PRICE", "£11,170", "£11,670", "£12,260", "£12,760", "£14,260", "£12,760", "£13,260", "£14,260", "£14,760", "£13,335", "£13,835", "£14,835", "£14,385", "£15,385"]], "pageTitle": "2012 Toyota Yaris Opens New Chapter in the Model's Success Story +VIDEO", "title": "", "url": "http://www.theautochannel.com/news/2011/08/19/004277-2012-toyota-yaris-opens-new-chapter-models-success-story-video.html", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 3, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438044160065.87/warc/CC-MAIN-20150728004240-00308-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 745809279, "recordOffset": 745793766, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{13241=On-the-road prices for new Yaris start at £11,170. Insurance groups will be announced in August., 9459=   • SEE ALSO: 2011 Toyota Yaris Review - A Big Man In A Small Car, 7511=LONDON - August 19, 2011: The current Yaris won praise for its roomy interior, durability and versatility, the efficiency of its engines and its easy-to-drive character around town. New Yaris will consolidate these strengths and go further to offer sharper, contemporary styling, a step-up in quality, even greater agility and a breakthrough in affordable multimedia connectivity with Toyota Touch and Go., 11831=UK range and prices New Yaris will be offered in the UK in four grades – T2, TR, SR and T Spirit – which deliver an emphatic combination of high specification, quality and great value for money. Cars are available to order now, with first deliveries to customers from mid-September., 22113=Copyright © 1996-2015 The Auto Channel. Contact Information, Credits, and Terms of Use. These following titles and media identification are Trademarks owned by The Auto Channel, LLC and have been in continuous use since 1987 : The Auto Channel, Auto Channel and TACH all have been in continuous use world wide since 1987, in Print, TV, Radio, Home Video, Newsletters, On-line, and other interactive media; all rights are reserved and infringement will be acted upon with force.}", "textBeforeTable": "On-the-road prices for new Yaris start at £11,170. Insurance groups will be announced in August. The SR, available exclusively with the 1.33-litre Dual VVT-i petrol engine, has a sportier profile with a range of interior and exterior styling elements. Equipment highlights include 16-inch alloy wheels, rear roof spoiler, front fog lamps, part-leather upholstery, rear privacy glass and lowered suspension.    T Spirit focuses on premium features and is available in five-door format with the 1.33- litre Dual VVT-i petrol engine. Principal equipment of the T Spirit grade includes a panoramic glass roof, dual-zone climate control, automatic headlights and windscreen wipers, auto-dimming rear view mirror and smart entry and start. The heart of the range is the TR. Expected to command two thirds of new Yaris sales, it is available with all engine and transmission combinations, in three and five-door bodystyles. Key features of the TR include15-inch alloy wheels, air conditioning, Vehicle Stability Control (VSC) and Toyota Touch with touchscreen audio controls, Bluetooth and rear parking camera UK range and prices New Yaris will be offered in the UK in four grades – T2, TR, SR and T Spirit – which deliver an emphatic combination of high specification, quality and great value for money. Cars are available to order now, with first deliveries to customers from mid-September. * Guideline figures prior to official homologation. The 1.4-litre D-4D engine is fitted as standard with a diesel particulate filter (DPF) and is matched to a six-speed manual transmission. It produces", "textAfterTable": "Search The Auto Channel", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}