{"relation": [["Charts (2009)", "Australian Albums (ARIA)[79]", "Belgian Albums (Ultratop Flanders)[80]", "Belgian Albums (Ultratop Wallonia)[81]", "Danish Albums (Hitlisten)[82]", "Dutch Albums (MegaCharts)[83]", "European Top 100 Albums (Billboard)[84]", "Finnish Albums (Suomen virallinen lista)[85]", "German Albums (Official Top 100)[86]", "Hungarian Albums (MAHASZ)[87]", "Italian Albums (FIMI)[88]", "Japanese Albums (Oricon)[47]", "Mexican Albums (Top 100 Mexico)[89]", "Swedish Albums (Sverigetopplistan)[90]", "Swiss Albums (Schweizer Hitparade)[91]", "UK Albums (OCC)[92]", "Charts (2010)", "European Top 100 Albums (Billboard)[93]", "Charts (2012)", "Italian Albums (FIMI)[94]"], ["Position", "73", "23", "47", "29", "59", "19", "2", "77", "29", "21", "47", "30", "46", "61", "40", "Position", "99", "Position", "92"]], "pageTitle": "Celebration (Madonna album) - Wikipedia, the free encyclopedia", "title": "", "url": "https://en.wikipedia.org/wiki/Celebration_(Madonna_album)", "hasHeader": true, "headerPosition": "MIXED", "tableType": "RELATION", "tableNum": 12, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042981753.21/warc/CC-MAIN-20150728002301-00124-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 863265791, "recordOffset": 863207955, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{51843=\"Celebration\" was the first single from the compilation. A first preview of the song was added on the performance for \"Holiday\" on her 2009 leg of the Sticky & Sweet Tour. It was to be released to radio stations on August 3, 2009.[8] However, the single leaked on to the internet, so the date was changed to July 31, 2009. The digital download was also released on this date due to the leak.[51] Remixes of the song were released to dance clubs on July 24, 2009.[52] \"Celebration\" received mixed reviews from contemporary critics. The song reached the top of the charts in countries like Finland, Italy and Sweden, while reaching the top-ten in other European nations. It became Madonna's fifty-fifth entry to the Billboard Hot 100 and her fortieth number-one song on the Billboard Hot Dance Club Songs chart.[53][54], 54787=The track, \"It's So Cool\", debuted on the official charts of Finland, Italy and Sweden at numbers 8, 20 and 30 respectively, due to digital downloads.[57] \"Broken\", the fourth song recorded for the album but not used, was eventually released in 2012 as a promotional vinyl single. It was written by Madonna, Paul Oakenfold, Ian Green and Ciaran Gribbin and produced by Madonna and Oakenfold. The single was given to Madonna's fanclub Icon's official members as a free 12\" vinyl, as a part of their membership. It was eventually given to members in late 2012.[58], 45267=In the United Kingdom, Celebration debuted at number one, selling 77,000 copies in the first week. It became Madonna's eleventh number-one release on the UK Albums Chart, tying her with Elvis Presley as the solo act with the most number-one albums in the British chart history.[33][34] The album was certified platinum by the British Phonographic Industry (BPI) for shipment of 300,000 copies across the United Kingdom.[35] According to the Official Charts Company, Celebration has sold 370,231 copies in the United Kingdom as of February 2013.[36] From 2009 to 2012, the album had three separate chart runs within the top 100 of the albums chart.[37] It re-entered the chart again on March 1, 2015, at number 38 with sales of 2,476 copies, following the release of her single \"Living for Love\" from 13th studio album, Rebel Heart.[38][39] The album also reached the top of the charts in Belgium (Flanders), Denmark, Germany and Italy, while in Austria, Belgium (Wallonia), Finland, Netherlands, Norway, Portugal, Spain, Sweden and Switzerland the album debuted within the top ten of the official charts.[40] In France the album debuted atop the French Compilation Albums Chart, and receiving a platinum certification from Syndicat National de l'Édition Phonographique (SNEP) for shipment of 100,000 copies.[41][42] It also debuted at number one on Billboard‍ '​s European Top 100 Albums chart, topping the chart for four consecutive weeks.[43] Celebration was certified double platinum by Federazione Industria Musicale Italiana (FIMI) for shipments of 120,000 copies.[44] In total, Celebration sold over a million copies across Europe, earning a platinum certification from the International Federation of the Phonographic Industry (IFPI).[45] In Japan, Celebration reached a peak of number three on the Oricon albums chart and was placed at number 47 on the Oricon year end rankings, selling 177,194 copies, and earning a gold certification.[46][47][48] In terms of units, it is estimated that Celebration has sold about four million copies worldwide.[49], 53665=On December 11, 2009 it was confirmed by Madonna's official website that \"Revolver\" would be released as the second and final single off the album in some territories. The digital maxi single was released in many countries on December 29, 2009, followed by a CD maxi single in the US in late January 2010 and a 12\" vinyl single in early February 2010.[55] Contemporary critics gave a mixed review of the song. Some praised the chorus line \"My love's a revolver\" while others felt that it was underwhelming and not on par with Madonna's previous songs. \"Revolver\" has charted in the lower regions of the official charts of Belgium, Canada, Finland and the United Kingdom while reaching number four on the Billboard Hot Dance Club Songs chart of United States. This was Madonna's last single of the 2000s.[56], 7349=Celebration is the third greatest hits album by American singer-songwriter Madonna, and the final release under her contract with Warner Bros. Records, her record company since 1982. The release follows her two previous greatest hits albums, The Immaculate Collection (1990) and GHV2 (2001). The compilation was released in many different formats including a one-disc edition and a deluxe double disc. A compilation DVD, entitled Celebration: The Video Collection, was released to accompany the audio versions. The album includes three new tracks, the title track which is included on all versions, \"Revolver\" which is included on the deluxe editions and \"It's So Cool\" which is included as a bonus track on some of the iTunes Store deluxe digital versions. A fourth track, \"Broken\", was recorded for the album but not used; eventually it was released in 2012 as a limited edition promotional vinyl single for fanclub members., 15582=On July 22, 2009, Warner Bros. Records officially announced the release date as September 28, 2009 and confirmed the name of the album as Celebration through Madonna's official website.[8] The compilation was available in a case of two, as well as a single CD.[8] The songs on the album were re-mastered and chosen by Madonna and her fans, while covering the whole expanse of her career.[8] A DVD titled Celebration: The Video Collection was released which included several music videos of Madonna that have never appeared on a DVD before. It includes the completed video of the single \"Celebration\".[6][8] The cover for Celebration was created by street pop artist Mr. Brainwash who is best known for \"throwing modern cultural icons into a blender and turning it up to eleven\".[8] Celebration was made available for pre-order on iTunes Store on September 1, 2009, to coincide with the music video release of \"Celebration\". The standard (1 disc) and deluxe editions (2 discs) are available, as well as an iTunes exclusive Premium Edition which includes each track available on the 2-Disc Edition, as well as a new track entitled \"It's So Cool\", and thirty MP4 music videos.[6], 41570=In the United States, Celebration debuted at number seven, with 72,000 copies sold in its first week.[21] It was present on the chart for a total of 12 weeks and was certified gold by the Recording Industry Association of America (RIAA) on November 23, 2009, indicating shipment of 500,000 units.[22][23] In April 2010, the album got a boost in sales from the Glee episode titled The Power of Madonna. The album re-entered the Billboard 200 at position 85 with sales of 6,000 and a 219% gain.[24] In February 2012 after her appearance on the Super Bowl XLVI halftime show, the album again entered the Billboard 200 at number 24 with sales of 16,000 copies and a 1,341% gain from previous week.[25] In Canada, the album debuted at the top of the Canadian Albums Chart, with sales of 17,000 copies.[26] In Australia and New Zealand, Celebration debuted at numbers eight and two on the official charts, respectively.[27][28] It was certified gold in both Australia and New Zealand, by the Australian Recording Industry Association (ARIA) and Recording Industry Association of New Zealand (RIANZ), indicating shipements of 35,000 and 7,500 copies respectively.[29][30] The album also debuted at number one position on the Gfk Chart-Track albums chart in Ireland, earning a platinum certification from the Irish Recorded Music Association (IRMA) for shipment of 15,000 copies of the album.[31][32], 12786=On March 18, 2009, Madonna's publicist Liz Rosenberg announced the plans for the release of a greatest hits package by September.[1] She also added that Madonna had plans to go to the studio and record new material for the album.[2][3] The next day, Madonna's manager, Guy Oseary, asked fans on his Twitter for input regarding the track listing of the greatest hits album.[2] It was later confirmed that she wrote three new tracks for the album, with Paul Oakenfold being confirmed as producer for two of the new songs.[4] Attitude magazine reported in an interview with Oakenfold that the tracks he produced with Madonna are called \"Broken (I'm Sorry)\" and \"Celebrate\". He stated that the new music is \"lyrically classic Madonna with an edgy modern sound.\"[5] Her official website also confirmed the presence of the track \"Revolver\", featuring rapper Lil Wayne, when they announced the final track listing for the CD and DVD on August 26, 2009.[6] With The Times, Madonna shared her thoughts on the release:}", "lastModified": "Mon, 27 Jul 2015 03:38:01 GMT", "textBeforeTable": "Weekly charts[edit] Charts[edit] DVD — 47 music videos on two DVD discs[8] Amazon Deluxe edition — 38 tracks edition with two bonus remixes of \"Celebration\" iTunes Deluxe video edition — 68 tracks edition, including 38 audio tracks (including bonus material: \"It's So Cool\" and a remix of \"Celebration\") and 30 music videos iTunes Deluxe edition — 38 tracks edition including a bonus track remix of \"Celebration\" and \"It's So Cool\" Digital Deluxe — 37 tracks edition with bonus remix of \"Celebration\" Digital download — 18 tracks edition, this version contains the album edit version of \"Frozen\" and not the full album version which is on the deluxe edition LP — 36 tracks edition on four LP vinyl discs CD Deluxe edition — 36 tracks edition on two discs[8] CD Standard edition — 18 tracks edition, this version contains the album edit version of \"Frozen\" and not the full album version which is on the deluxe edition[8] Formats[edit] 3:41 \"Celebration\"   68. 4:13 \"", "textAfterTable": "New Zealand Albums (RMNZ)[28] 2 Norwegian Albums (VG-lista)[72] 3 Polish Albums (ZPAV)[73] 3 Portuguese Albums (AFP)[74] 2 Russia (NPFF)[75] 1 Scottish Albums (OCC)[34] 1 Spanish Albums (PROMUSICAE)[76] 2 Swedish Albums (Sverigetopplistan)[77] 2 Swiss Albums (Schweizer Hitparade)[78] 3 UK Albums (OCC)[34] 1 US Billboard 200[22] 7 Year-end charts[edit] Charts (2009) Position Australian Albums (ARIA)[79] 73 Belgian Albums (Ultratop Flanders)[80] 23 Belgian Albums (Ultratop Wallonia)[81] 47 Danish Albums (Hitlisten)[82] 29 Dutch Albums (MegaCharts)", "hasKeyColumn": false, "keyColumnIndex": -1, "headerRowIndex": 0}