{"relation": [["Checklist", "Verify licensing requirements. See the Cisco MDS 9000 Family Fabric Manager Configuration Guide.", "Verify that you are not configuring IPsec with IPv6.", "Verify that auto-zone and CFS distribution are enabled for iSLB.", "If an Ethernet PortChannel is configured between the IPS module and an Ethernet switch, verify that any VRRP load balancing policy on the Ethernet switch is based on source/destination IP address.", "Verify that iSCSI is enabled on the required switches in the fabric, and for the required Gigabit Ethernet interfaces. See the Cisco MDS 9000 Family Fabric Manager Configuration Guide for details."], ["Check off", "", "", "", "", ""]], "pageTitle": "Cisco MDS SanOS Troubleshooting Guide -- Troubleshooting IP Storage Services - DocWiki", "title": "", "url": "http://docwiki.cisco.com/w/index.php?title=Cisco_MDS_SanOS_Troubleshooting_Guide_--_Troubleshooting_IP_Storage_Services&diff=35402&oldid=35401", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 3, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989018.40/warc/CC-MAIN-20150728002309-00262-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 74239527, "recordOffset": 74186466, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{220886=Use the metric CLI command in iSLB configuration mode. The default value is 1000., 171812=The default MTU size of an Ethernet network is 1500, while the Fibre Channel networks generally support maximum frame sizes of 2148 bytes. This means that an iSCSI gateway must divide the Fibre Channel frames into two TCP segments or IP fragments while transferring from the Fibre Channel side to the IP side depending on how this division is implemented within the device., 189834=Use the show iscsi remote-node fcp-session-detail CLI command to view details of the session status. (See Example 20-4.) The RcvDataFieldSize will be set to the maximum 2048 if the MTU is increased on the Gigabit Ethernet interface that corresponds to this iSCSI remote node. Use the Target FCID field to verify that the local port, rather than a remote port that is reached through an ISL link, is used for the storage target to avoid suboptimal access to storage., 131424=Figure 20-11 shows a failed iSCSI login for the Windows 2000 driver., 186665=Use the show ips stats tcp CLI command to view TCP statistics (see Example 20-3). If the retransmitted value in the segment continues to increase, it shows that either the IP network in the middle has issues or the TCP peer has problems acknowledging the data that the IPS sends to it. If the MTU of this interface is higher than the MSS of the iSCSI client, then the split packets value increases. For example, the client MTU default is 1500, which equates to an MSS value of 1460, but the IPS Gigabit Ethernet MTU changed to 2500., 63547=The static route must be set for FCIP tunnels. This route could also be ip route 10.10.11.0 255.255.255.0 interface gigabitethernet 2/8., 173391=Any value starting with 64 K (> 65535 = 0xFFFF bytes) will automatically trigger TCP window scaling according to RFC 1323. The IPS TCP window scaling begins only when the remote peer (iSCSI client in this case) requests it. This means that you need to configure the TCP stack of your client to trigger this functionality (see Figure 20-13)., 130170=Figure 20-10 shows a successful iSCSI login for the Windows 2000 driver.}", "textBeforeTable": "Begin troubleshooting IP storage services issues by checking the following issues: Initial Troubleshooting Checklist iSLB should not be configured with Fabric Manager. Use Device Manager, which supports iSLB with CFS distribution. iSLB VRRP load balancing is based on the number of initiators and not on the number of sessions. If you configure an initiator to see more targets than other initiators (resulting in more sessions on this initiator), you should configure this initiator with a higher load metric. If IVR and iSLB features are enabled in the same fabric, there should be at least one switch in the fabric that has both of these features enabled. That switch must do any zoning related configuration and activation (for normal zones, IVR zones, or iSLB zones) or there may be traffic disruption in the fabric. If there are more than 200 initiators in the running configuration, you must lower the number of initiators to below 200 before disabling iSCSI. Maximum number of initiators in the pending configuration--200. Before adding more initiators, you must commit the configuration first. iSLB can be used without CFS distribution but if iSLB auto-zone feature is used, traffic disruption occurs when any zone set is activated. Maximum number of switches in a fabric that can have iSLB with CFS enabled--4. Maximum number of iSCSI sessions per IPS port in either transparent or proxy initiator", "textAfterTable": "Common Troubleshooting Tools in Fabric Manager Use the following Fabric Manager procedures to access IP interfaces, FCIP, and iSCSI: Choose Switches > Interfaces to access IP interfaces. Choose ISLs > FCIP to access FCIP. Choose End Devices > iSCSI to access iSCSI. Common Troubleshooting Commands in the CLI Use the following commands to troubleshoot IP interface, FCIP, and iSCSI issues: show ip show ips arp show ipv6 traffic show ips ipv6 show fcip show iscsi Use the following commands to troubleshoot iSLB issues: show islb initiator [configured] - Displays all iSLB initiators that have logged into the switch. Use the configured keyword to see all iSLB initiators that have been configured. show islb session - Verifies that all expected iSCSI sessions are up. show islb merge status - Displays the status of iSLB merge in the fabric. If the merge is in progress, it shows the identity of the two switches in the fabric. If the merge failed, it shows the reason for the merge failure. show", "hasKeyColumn": false, "keyColumnIndex": -1, "headerRowIndex": 0}