{"relation": [["Sex", "Female", "Female Spayed", "Male", "Male Castrated", "(Normal Population %)"], ["N", "1136", "2106", "964", "726", ""], ["Percent", "23% (21%)", "43% (33%)", "19% (25%)", "15% (21%)", ""]], "pageTitle": "Tumors with Differentiation to Hair Follicular Structures | Oncolink - Cancer Resources", "title": "", "url": "http://es.oncolink.org/types/article1.cfm?id=9520", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 10, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989018.40/warc/CC-MAIN-20150728002309-00089-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 83311611, "recordOffset": 83280996, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{14248=Supported by the Savannah and Barry French Poodle Memorial Fund University of Pennsylvania School of Veterinary Medicine Ultima Vez Modificado: 21 de agosto del 2005}", "textBeforeTable": "Epidemiology Synonyms: Intracutaneous Cornifying Epithelioma (ICE), Squamous Papilloma Definition: A benign tumor characterized by peripheral proliferation of basaloid epithelial cells with differentiation to squamous epithelium resembling the normal follicular infundibulum/isthmus. Introduction Infundibular Keratinizing Acanthoma (IKA) References Malignant Pilomatricoma Pilomatricoma Malignant Trichoepithelioma Trichoepithelioma Trichoblastoma Isthmic Tricholemmoma Inferior Tricholemmoma Tricholemmoma Infundibular Keratinizing Acanthoma During embryologic development of the skin and adnexal structures the pilar germ emerges at an angle from the underside of the epidermis. Under the influence of inductive mesenchymal cells, which will form the papillum of the hair, the cells extend into the deep dermis. Here differentiation of the hair germ in to the hair bulb occurs. The hair shaft, the outer root sheath and inner root sheath are formed from the hair bulb. These tumors show differentiation to hair follicular structures. There is a marked variability in the histopathologic appearance of these tumors, and there may be some variability within a single tumor when examined by light microscopy. This variability is due to the complex histology of the normal hair which is mimicked by these tumors showing hair follicular differentiation. Introduction Michael H. Goldschmidt, MSc, BVMS, MRCVS, Diplomate ACVP Professor and Head, Laboratory of Pathology and Toxicology Chief, Surgical Pathology Department of Pathobiology Frances S. Shofer, PhD, Adjunct Associate Professor of Epidemiology and Biostatistics", "textAfterTable": "Breeds at Increased Risk N Probability OR 95% Confidence Interval Norwegian Elkhound 106 <0.0001 32.1 25.8 39.9 Tibetan Terrier 16 <0.0001 14.8 8.8 24.9 Kerry Blue Terrier 34 <0.0001 9.8 6.9 14.0 Pekingese 33 <0.0001 5.7 4.0 8.1 Briard 7 0.00076 4.9 2.3 10.5 German Shepherd 343 < 0.0001 4.6 4.1 5.2", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}