{"relation": [["Model", "PLXO8", "PLXO12", "PLXO18", "PLXO26", "PLXO30", "PLXO36", "PLXO48"], ["Size and Coverage", "8\" diameter, covers small areas and spot applications", "12\" diameter, covers small areas and spot applications", "18\" diameter, covers areas up to 15 ft.", "26\" diameter, covers areas up to 20 ft.", "30\" diameter, covers areas up to 25 ft.", "36\" diameter, covers areas up to 35 ft.", "48\" diameter, covers areas up to 45 ft."], ["Mounting Hardware Included", "Single bracket", "Single bracket", "Single bracket", "Dual brackets", "Dual brackets", "Dual brackets", "Dual brackets"]], "pageTitle": "See All Circular Acrylic Heavy Duty Outdoor Convex Security Mirror: Industrial Safety Mirrors: Amazon.com: Industrial & Scientific", "title": "", "url": "http://www.amazon.com/Circular-Acrylic-Outdoor-Convex-Security/dp/B005C6BSZS", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 7, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042982745.46/warc/CC-MAIN-20150728002302-00150-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 302423375, "recordOffset": 302356186, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{52397=See All Industries manufactures safety and security mirrors. The company, founded in 1958, is headquartered in Chicago, IL.}", "textBeforeTable": "Specifications The See All circular acrylic Heavy Duty outdoor convex security mirror is a circular, convex, acrylic mirror for outdoor use that reflects a wide angle image at a diminished size to extend a field of view to help a person see around obstacles for safety, or monitor a wide area for efficient surveillance. Acrylic is shatter resistant, weighs less than glass, and reflects a clear, bright image. The mirror comes with mounting hardware that makes the mirror angle adjustable after installation. It has an ABS (acrylonitrile butadiene styrene) plastic backing for resistance to impact and wear, with a vinyl-coated aluminum edge for weather resistance in outdoor applications. Product Description give feedback on images?  Would you like to click here Product Warranty: For warranty information about this product, please 4.2 out of 5 stars  See all reviews (85 customer reviews) }); }); } jQuery(this).acrPopover(); if (typeof jQuery(this).acrPopover === 'function') { jQuery('.acr-popover,#searchTemplate .asinReviewsSummary').each(function() { amznJQ.onReady('acrPopover', function() { }); })(jQuery); }); setTimeout(function() { amznJQ.declareAvailable('acrPopover'); }, 10); amznJQ.onCompletion('amznJQ.criticalFeature', function() { window.onCacheUpdateReselect_average_customer_reviews = jqInit; window.onCacheUpdate_average_customer_reviews = jqInit; window.onAjaxUpdate_average_customer_reviews =", "textAfterTable": "Mirrors installed with a single bracket can be adjusted to almost any angle. Mirrors installed with dual brackets can be adjusted to a wide range of angles along one axis. Safety mirrors are used to help increase visibility in a variety of locations; for example, in hallway intersections and sharp turns, and in driveways and loading docks where drivers have to back up or enter traffic. Safety mirrors are sometimes called security mirrors, and they can be used to extend the view of security personnel, or to help monitor factory workers and automated processes to improve quality control and productivity. For convex mirrors, objects will appear to be further away than they are, and will be easier to see in a larger mirror. Depending on visibility conditions and the viewer's eyesight, objects will usually be recognizable within about 1 ft. of distance (including distance from eye to mirror, and from mirror to object) for each inch in mirror diameter. See All Industries manufactures safety and security mirrors. The company, founded in 1958, is headquartered in Chicago, IL.", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}