{"relation": [["Name", "Required?", "Variable Length?", "Accept wildcard characters?", "Accept Pipeline Input?", "Position?"], ["Value", "false", "false", "false", "true (ByValue)", "named"], ["PSMAML Attribute", "required", "variableLength", "globbing", "pipelineInput", "position"]], "pageTitle": "Move-ClusterGroup", "title": "", "url": "https://technet.microsoft.com/en-us/library/ee461002.aspx", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 2, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988048.90/warc/CC-MAIN-20150728002308-00271-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 902919000, "recordOffset": 902903045, "tableOrientation": "HORIZONTAL", "textBeforeTable": "Attributes Data Type: string Default Value: Specifies the name of the cluster to run this cmdlet on. If you type \"-Cluster .\" or omit the parameter, the cmdlet runs on the local cluster. Cluster Parameters Moving a resource group is a way of simulating failover. It is also an appropriate step to take in preparation for routine maintenance on a node. Detailed Description Wait Cluster Node Name InputObject Move-ClusterGroup [-InputObject <psobject>] [[-Name] <string>] [[-Node] <string>] [-Cluster <string>] [-Wait <int>] [<CommonParameters>]     Copy  Syntax Move a clustered service or application (a resource group) from one node to another in a failover cluster. Move-ClusterGroup Move-ClusterGroup Update-ClusterVirtualMachineConfiguration", "textAfterTable": "Value Attributes Name Value PSMAML Attribute Required? true required Variable Length? false variableLength InputObject Specifies the cluster group to move. Default Value: Data Type: psobject Attributes Name Value PSMAML Attribute Required? false required Variable Length? false variableLength Accept wildcard characters? false globbing Accept Pipeline Input? true (ByValue) pipelineInput Position? named position Value Attributes Name Value PSMAML Attribute Required? true required Variable Length? false variableLength Name Specifies the name of the cluster group to move.", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}