{"relation": [["Region", "AFRICA", "ASIA", "EUROPE", "NORTH AMERICA (BAHAMAS)", "OCEANIA", "SOUTH AMERICA, and the CARIBBEAN"], ["All DV Chargeability Areas Except Those Listed Separately", "21,500", "9,100", "20,625", "11", "1,200", "1,425"], ["", "Except: Egypt: 17,900 Ethiopia: 14,150 Nigeria: 9,900", "", "", "", "", ""]], "pageTitle": "Visa Bulletin for March 2008", "title": "", "url": "http://travel.state.gov/content/visas/english/law-and-policy/bulletin/2008/visa-bulletin-for-march-2008.html", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 3, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987552.57/warc/CC-MAIN-20150728002307-00199-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 256079464, "recordOffset": 256060192, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{75154=Entitlement to immigrant status in the DV category lasts only through the end of the fiscal (visa) year for which the applicant is selected in the lottery. The year of entitlement for all applicants registered for the DV-2008 program ends as of September 30, 2008. DV visas may not be issued to DV-2008 applicants after that date. Similarly, spouses and children accompanying or following to join DV-2008 principals are only entitled to derivative DV status until September 30, 2008. DV visa availability through the very end of FY-2008 cannot be taken for granted. Numbers could be exhausted prior to September 30., 62163=1.  This bulletin summarizes the availability of immigrant numbers during March. Consular officers are required to report to the Department of State documentarily qualified applicants for numerically limited visas; the Bureau of Citizenship and Immigration Services in the Department of Homeland Security reports applicants for adjustment of status. Allocations were made, to the extent possible under the numerical limitations, for the demand received by February 8th in the chronological order of the reported priority dates. If the demand could not be satisfied within the statutory or regulatory limits, the category or foreign state in which demand was excessive was deemed oversubscribed. The cut-off date for an oversubscribed category is the priority date of the first applicant who could not be reached within the numerical limits. Only applicants who have a priority date earlier than the cut-off date may be allotted a number. Immediately that it becomes necessary during the monthly allocation process to retrogress a cut-off date, supplemental requests for numbers will be honored only if the priority date falls within the new cut-off date. 2. Section 201 of the Immigration and Nationality Act (INA) sets an annual minimum family-sponsored preference limit of 226,000. The worldwide level for annual employment-based preference immigrants is at least 140,000. Section 202 prescribes that the per-country limit for preference immigrants is set at 7% of the total annual family-sponsored and employment-based preference limits, i.e., 25,620. The dependent area limit is set at 2%, or 7,320.   3.  Section 203 of the INA prescribes preference classes for allotment of immigrant visas as follows:, 72050=Employment Third Preference Other Workers Category:  Section 203(e) of the NACARA, as amended by Section 1(e) of Pub. L. 105-139, provides that once the Employment Third Preference Other Worker (EW) cut-off date has reached the priority date of the latest EW petition approved prior to November 19, 1997, the 10,000 EW numbers available for a fiscal year are to be reduced by up to 5,000 annually beginning in the following fiscal year. This reduction is to be made for as long as necessary to offset adjustments under the NACARA program.  Since the EW cut-off date reached November 19, 1997 during Fiscal Year 2001, the reduction in the EW annual limit to 5,000 began in Fiscal Year 2002., 77490=The cut-off date movement for March in several Employment categories has been greater than those experienced in recent months. Advancement of the cut-off dates at this time should prevent a situation later in the fiscal year where there are large amounts of numbers available but not enough time to use them. If the expected increase in CIS number use materializes, future cut-off date movements could slow or stop., 79806=Department of State Publication 9514 CA/VO: February 8, 2008, 73644=For March, immigrant numbers in the DV category are available to qualified DV-2008 applicants chargeable to all regions/eligible countries as follows. When an allocation cut-off number is shown, visas are available only for applicants with DV regional lottery rank numbers BELOW the specified allocation cut-off number:, 75786=C.  ADVANCE NOTIFICATION OF THE DIVERSITY (DV) IMMIGRANT CATEGORY RANK CUT-OFFS WHICH WILL APPLY IN APRIL For April, immigrant numbers in the DV category are available to qualified DV-2008 applicants chargeable to all regions/eligible countries as follows. When an allocation cut-off number is shown, visas are available only for applicants with DV regional lottery rank numbers BELOW the specified allocation cut-off number:, 68931=*NOTE:  For March, 2A numbers EXEMPT from per-country limit are available to applicants from all countries with priority dates earlier than 01MAY02. 2A numbers SUBJECT to per-country limit are available to applicants chargeable to all countries EXCEPT MEXICO with priority dates beginning 01MAY02 and earlier than 15APR03. (All 2A numbers provided for MEXICO are exempt from the per-country limit; there are no 2A numbers for MEXICO subject to per-country limit.), 71769=The Department of State has available a recorded message with visa availability information which can be heard at:  (area code 202) 663-1541. This recording will be updated in the middle of each month with information on cut-off dates for the following month., 72847=Section 203(c) of the Immigration and Nationality Act provides a maximum of up to 55,000 immigrant visas each fiscal year to permit immigration opportunities for persons from countries other than the principal sources of current immigration to the United States. The Nicaraguan and Central American Relief Act (NACARA) passed by Congress in November 1997 stipulates that beginning with DV-99, and for as long as necessary, up to 5,000 of the 55,000 annually-allocated diversity visas will be made available for use under the NACARA program. This reduction has resulted in the DV-2008 annual limit being reduced to 50,000. DV visas are divided among six geographic regions. No one country can receive more than seven percent of the available diversity visas in any one year., 79201=The Department of State also has available a recorded message with visa cut-off dates which can be heard at: (area code 202) 663-1541. The recording is normally updated by the middle of each month with information on cut-off dates for the following month.}", "lastModified": "Thu, 30 Jul 2015 18:13:20 GMT", "textBeforeTable": "For March, immigrant numbers in the DV category are available to qualified DV-2008 applicants chargeable to all regions/eligible countries as follows. When an allocation cut-off number is shown, visas are available only for applicants with DV regional lottery rank numbers BELOW the specified allocation cut-off number: Section 203(c) of the Immigration and Nationality Act provides a maximum of up to 55,000 immigrant visas each fiscal year to permit immigration opportunities for persons from countries other than the principal sources of current immigration to the United States. The Nicaraguan and Central American Relief Act (NACARA) passed by Congress in November 1997 stipulates that beginning with DV-99, and for as long as necessary, up to 5,000 of the 55,000 annually-allocated diversity visas will be made available for use under the NACARA program. This reduction has resulted in the DV-2008 annual limit being reduced to 50,000. DV visas are divided among six geographic regions. No one country can receive more than seven percent of the available diversity visas in any one year. B.  DIVERSITY IMMIGRANT (DV) CATEGORY Employment Third Preference Other Workers Category:  Section 203(e) of the NACARA, as amended by Section 1(e) of Pub. L. 105-139, provides that once the Employment Third Preference Other Worker (EW) cut-off date has reached the priority date of the latest EW petition approved prior to November 19, 1997, the 10,000 EW numbers available for a fiscal year are to be reduced by up to 5,000 annually beginning in the following fiscal year. This reduction is to be made for", "textAfterTable": "Entitlement to immigrant status in the DV category lasts only through the end of the fiscal (visa) year for which the applicant is selected in the lottery. The year of entitlement for all applicants registered for the DV-2008 program ends as of September 30, 2008. DV visas may not be issued to DV-2008 applicants after that date. Similarly, spouses and children accompanying or following to join DV-2008 principals are only entitled to derivative DV status until September 30, 2008. DV visa availability through the very end of FY-2008 cannot be taken for granted. Numbers could be exhausted prior to September 30. C.  ADVANCE NOTIFICATION OF THE DIVERSITY (DV) IMMIGRANT CATEGORY RANK CUT-OFFS WHICH WILL APPLY IN APRIL For April, immigrant numbers in the DV category are available to qualified DV-2008 applicants chargeable to all regions/eligible countries as follows. When an allocation cut-off number is shown, visas are available only for applicants with DV regional lottery rank numbers BELOW the specified allocation cut-off number: Region All DV Chargeability Areas Except Those Listed Separately   AFRICA 21,500 Except: Egypt: 17,900 Ethiopia: 14,150 Nigeria: 9,900 ASIA 9,100   EUROPE 20,625    NORTH AMERICA (BAHAMAS) 11   OCEANIA 1,200   SOUTH AMERICA, and the CARIBBEAN 1,425   D.  EMPLOYMENT VISA AVAILABILITY The cut-off date movement for March in several Employment categories", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}