{"relation": [["Round", "1", "2", "3", "4", "5"], ["Minimum Bid", "0", "2", "4", "2", "0"], ["Maximum Bid", "3", "5", "7", "9", "11"]], "pageTitle": "Rules of Card Games: Baseborn", "title": "", "url": "http://www.pagat.com/invented/baseborn.html", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438043060830.93/warc/CC-MAIN-20150728002420-00095-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 633450002, "recordOffset": 633441800, "tableOrientation": "HORIZONTAL", "lastModified": "Thu, 12 Sep 2013 22:29:00 GMT", "textBeforeTable": "At the beginning of each round, each player receives 10 chips (to add to however many they had before), and is dealt 5 cards with which to play. The next card from the deck is turned face up and the players simultaneously decide how many chips they will bid for it. The minimum and maximum bids depend on the round being played, as follows: In this game players bid for cards with the aim of winning the pot by collecting a flush: five cards of the same suit. The game is played in five rounds, and the first player who make a flush in each round wins points and also chips to use for bidding in subsequent rounds. // --> pmad('bvirtubalwar.nicholasb','egmail.come') Invented Games > Baseborn Home Page > A-Z Home //--> google_ad_height = 50;} google_ad_width = 320; google_ad_slot = \"4219012637\"; /* Mobile banner */ }else{ google_ad_height = 60; google_ad_width = 468; google_ad_slot = \"1581106760\"; }else", "textAfterTable": "The player who bid highest takes the face-up card, and all bids are paid to the bank. If no one has a flush (five cards of the same suit), another card is turned up and the players bid for it in the same way as before. If there is a tie for highest bid, no one gets the card. The bids of the players who are tied are given to the bank but the other players' bids remain on the table. A new card is turned up alongside the unsold card, and there is now an auction for both cards together. The players who tied in the previous auction decide on their new bids; the other players just leave their previous bids in play. If there is now a single highest bidder, that player takes both cards and all bids go to the bank. If there is another tie for highest, possibly involving players who did not tie for highest before, once again the bids of the tieing players go to the bank and another card is turned up alongside those on the table. This process is repeated as often as necessary, until someone buys all the face up cards from the table. A player who succeeds in collecting a flush (five cards of the same suit) declares it and wins the round. This player takes all the chips from the bank and is awarded the points for the round according to the following table.", "hasKeyColumn": false, "keyColumnIndex": -1, "headerRowIndex": 0}