{"relation": [["Statistical Summary:", "Shots", "Shots on goal", "Saves", "Corner Kicks", "Fouls", "Offside"], ["UM", "9", "6", "5", "4", "12", "2"], ["UF", "12", "6", "6", "2", "8", "1"]], "pageTitle": "Early Goal by Ameera Abdullah Gives No. 12 Florida Soccer 1-0 Win versus Mississippi - GatorZone.com", "title": "", "url": "http://www.gatorzone.com/story.php?id=14603", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 4, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987127.36/warc/CC-MAIN-20150728002307-00312-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 458042379, "recordOffset": 458027469, "tableOrientation": "HORIZONTAL", "TableContextTimeStampBeforeTable": "{8702=1:07, 4128=1:33, 23697=The Gators were awarded a free kick within the first minute of play. Abdullah put the 35-yard free kick in at the far post for her fifth goal of the season, which moved her into a three-way share of Florida\u0092s 2008 goals lead. She now owns 60 career points off of 22 goals and 16 assists. She became the 14th Gator to pass the 50-career points mark in the Sept. 28 match versus Tennessee and now three matches later, she becomes the eighth Florida player in the program\u0092s 14-year history to earn 60 or more points as a Gator., 7181=1:10, 1024=Next up, Florida continues action versus SEC Western Division rivals when plays host to Mississippi State on Sunday, Oct. 12. MSU lost 2-1 at South Carolina Friday. Sunday is Senior Day for Gator soccer and Florida\u0092s three seniors - Ameera Abdullah, Megan Kerns and Liz Ruberry will be honored in a pre-match ceremony. The first 1,000 fans at Sunday\u0092s match receive water bottles courtesy of Dodge. Following Sunday\u0092s match, all kids 12 & under can come to the field for a skills clinic conducted by several Gator soccer players. Live, streaming video can also be seen at www.GatorZone.com \u0096 just click on the GatorVision icon for more information. Adam Schick and Matthew Stubbington will cover the action Sunday., 22913=The goal was a boost for the Gators, who knew Mississippi would be a tough challenge as the two teams came into the match ranked No. 1 (UF) and No. 2 (UM) in the current Southeastern Conference standings. The earliest UF goal previously scored this season also came by Abdullah when she hit the first goal of 2008 at Colorado in the 13th minute.}", "TableContextTimeStampAfterTable": "{5633=90:00, 20537=© 1998 - 2015 University Athletic Assoc., Inc., Sun Sports & IMG College. All Rights Reserved.}", "textBeforeTable": "font-family:Arial\">  Next up, Florida continues action versus SEC Western Division rivals when plays host to Mississippi State on Sunday, Oct. 12. MSU lost 2-1 at South Carolina Friday. Sunday is Senior Day for Gator soccer and Florida\u0092s three seniors - Ameera Abdullah, Megan Kerns and Liz Ruberry will be honored in a pre-match ceremony. The first 1,000 fans at Sunday\u0092s match receive water bottles courtesy of Dodge. Following Sunday\u0092s match, all kids 12 & under can come to the field for a skills clinic conducted by several Gator soccer players. Live, streaming video can also be seen at www.GatorZone.com \u0096 just click on the GatorVision icon for more information. Adam Schick and Matthew Stubbington will cover the action Sunday. font-family:Arial\">  Florida outshot UM 12-9 and the two teams each turned in six shots on goal. UM goalkeeper Megan Vickery turned in five saves Friday.   One of the Rebels\u0092 best looks at the goal came in the 78th minute when senior Amy Bayles took a 14-yard shot that curved toward the upper far post corner. UF goalkeeper Meghan Berlingo read the ball perfectly, leaping to make the catch and end the play. The Mississippi front line tested Berlingo in the later portion of the match, as she made three of her career-high six saves in the final 12 minutes.  ", "textAfterTable": "    Minutes Saves GA Mississippi Megan Vickery 90:00 5 1 Florida Meghan Berlingo 90:00 6 0   Statistical Summary: UM UF Shots", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}