{"relation": [["", "W", "ERA", "WHIP", "K/9", "BB/9", "FIP", "BABiP"], ["Humber", "3", "3.18", "0.95", "5.16", "2.18", "3.27", "0.213"], ["Tomlin", "5", "2.56", "0.85", "4.61", "1.54", "4.44", "0.178"]], "pageTitle": "Josh Tomlin and Phil Humber: Ownership Quandries | FanGraphs Fantasy Baseball", "title": "", "url": "http://www.fangraphs.com/fantasy/tomlin-and-humber/", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 14, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989178.64/warc/CC-MAIN-20150728002309-00109-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 440134255, "recordOffset": 440107755, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{71400=by Erik Hahmann - May 20, 2011}", "lastModified": "Sun, 02 Aug 2015 19:34:11 GMT", "textBeforeTable": "If Humber searched for himself on any of the various fantasy sites and glanced at his ownership percentages he might be outraged, like how an NFL player feels when he discovers his Madden counterpart isn’t nearly as good as he would like to believe himself to be. He’s owned in only 18% of Yahoo! leagues, and 9.8% of ESPN leagues. On the other hand, Tomlin’s ownership rates are 64% and 88.7% respectively. That’s a huge gap for two pitchers who are having very similar seasons. Let’s take a look at the numbers: I mean players more evenly matched in the skill set department. Two such pitchers, Josh Tomlin and Phil Humber, caught my eye this week. I’m going to try something new here, so bear with me. Have you ever looked at two players who were having very similar seasons, but had vastly difference ownership percentages? I’m not talking about after one week when small sample sizes rule the day and someone like Chris Shelton is putting up numbers similar to Albert Pujols. We all knew Shelton was a bum and Pujols a star.  by Erik Hahmann - May 20, 2011 Josh Tomlin and Phil Humber: Ownership Quandries googletag.cmd.push(function () { googletag.display('div-gpt-ad-1349421924281-27'); });", "textAfterTable": "Pretty close, right? First, both pitchers have been excellent thus far. However, they each come with the caveat that they’re not likely to remain this good due to unsustainably low BABiP’s. Humber has a low FIP , so he hasn’t done it all with smoke and mirrors, but unless he’s turned a huge corner in his career it’s hard to see him sustaining that number, not to mention his 3.4% HR/FB ratio. Tomlin, however, is doing it with the aforementioned smoke and mirrors. His current BABiP is the lowest for any starter in baseball by 18 points. He doesn’t strike anyone out and has an extremely high strand rate of 86.2%.  He’s the epitome of lucky at the moment. If each pitcher has been fairly lucky this season in their performance, why the big disparity in ownership? I have a few ideas. Won/Loss record Tomlin has five wins. Humber has three. When you’ve made less than 10 starts, five wins sticks out a bit more. While Humber has been lucky in his individual performance, he’s been unlucky in run support. The White Sox are scoring just 2.98 runs a game for him, which is the 9th lowest in the American League. Contrast that with Tomlin who, at 8.20 runs a game, is getting the second most support in all of baseball. Shiny New Toy Syndrome This is only Tomlin’s second big league season, and he threw less than 80 innings last year. He had the veil of relative", "hasKeyColumn": false, "keyColumnIndex": -1, "headerRowIndex": 0}