{"relation": [["GEMMA MASSEY", "Age: 28 Hometown: Tamworth, England Eyes: Brown Hair: Brunette Height: 5’2″ Measurements: 32E-22-32", "twitter.com/LadyGemmaMassey", "twitter.com/LadyGemmaMassey", "twitter.com/LadyGemmaMassey", "twitter.com/LadyGemmaMassey", "twitter.com/LadyGemmaMassey"], ["JESSIE SHANNON", "Age: 26 Hometown: Whittemore, MI Eyes: Blue Hair: Black Height: 5’6″ Measurements: 34DD-24-36", "jessieshannon.com", "jessieshannon.com", "jessieshannon.com", "jessieshannon.com", "jessieshannon.com"]], "pageTitle": "99X Pornstar Catfight: Gemma Massey vs. Jessie Shannon [PHOTOS]", "title": "", "url": "http://therockstation99x.com/99x-pornstar-catfight-gemma-massey-vs-jessie-shannon-photos/", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988458.74/warc/CC-MAIN-20150728002308-00128-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 236151939, "recordOffset": 236128165, "tableOrientation": "HORIZONTAL", "textBeforeTable": "Without any further ado, two hot pornstars go Mujer a Mujer for the 99X Catfight Championship! LET’S GET READY TO RUMBLE! Welcome to the 99X Catfight!  Blonde Brit beauty Sophie Reade – who knocked fellow Page 3 girl Sammy Braddy off her 4-0 run to the Catfight Hall of Fame – had a short tenue as 99X Catfight champion.  In a title fight decided by a mere 1% of the vote,  Jessie Shannon squeaked by Sophie to become our new champion! In her first title defense, Jessie faces another Brit, feisty brunette Gemma Massey! It’s a face-to-face, cheek-to-cheek, and boob-to-boob knockdown-dragout for the XXX Championship of the World! The winner goes on to face another contestant tomorrow, while the loser grabs a bucket and mob and cleans up the mess. Five wins in a row puts the winner in the 99X Catfight Hall of Fame! twitter.com/LadyGemmaMassey/twitter.com/JessieShannon2 Share on Twitter Share on Facebook April 29, 2013 9:35 PM By renfield 99X Pornstar Catfight: Gemma Massey vs. Jessie Shannon [PHOTOS]", "textAfterTable": "99X Pornstar Catfight: Who’s the Hottest Pornstar of All? Filed Under: 99X Rated, Gemma Massey, Jessie Shannon, porn, porn star Category: 99X Catfight, Babes, Photos, Poll, Sex Share on Facebook Share on Twitter More Leave a comment Send to a friend! Print this page", "hasKeyColumn": false, "keyColumnIndex": -1, "headerRowIndex": 0}