{"relation": [["", "Research Highlights", "Beamline and instrument R&D", "Stories about ALS people", "Explanations of research techniques", "Meeting/seminar/workshop reports", "Operations/accelerator physics updates", "User Services Updates", "Other (See #6, below)"], ["HIGH", "95%", "70", "59", "60", "65", "57", "60", ""], ["LOW", "5%", "30", "41", "40", "35", "43", "40", ""]], "pageTitle": "ALSNews Vol. 282", "title": "", "url": "http://www-als.lbl.gov/index.php/science-highlights/science-highlights/304-alsnews-vol-282.html", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 4, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986357.49/warc/CC-MAIN-20150728002306-00142-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 267294106, "recordOffset": 267278165, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{29353=ALSNews will be taking the month of December off. We will return in the new year with our January 30, 2008, issue. Have a happy and safe holiday!, 5401=Requests for special operations use of the \"scrubbing\" shift should be sent to Rick Bloemhard ( This e-mail address is being protected from spambots. You need JavaScript enabled to view it , x4738) by 1:00 p.m. Friday., 1431=Call for general user proposals: Due January 15, 2008, 17232=Last month, the American Association for the Advancement of Science (AAAS) announced the election of its 2007 fellows. ALS Deputy Division Director Ben Feinberg was one of the five Berkeley Lab scientists selected for this honor. AAAS fellows, a tradition that began in 1874, are chosen by their peers for their distinguished contributions to science research, teaching, technology, or administration. Ben was elected \"for outstanding contributions to user facilities, especially the Advanced Light Source.\" Ben and the other new fellows will be recognized for their contributions at the Fellows Forum on February 16, 2008, during the AAAS Annual Meeting in Boston. See the November 16, 2007, issue of The View for a complete list of Berkeley Lab honorees., 26549=Call for general user proposals: Due January 15, 2008, 8807=Diamondoids are nanometer-sized molecules that feature diamond-crystal cage structures. Adamantane, the smallest member in the family, consists of one cage structure, diamantane two, triamantane three, tetramantane four, and so on. On all of these, the dangling bonds on the outer surfaces are terminated by hydrogen atoms. Because of their potential to possess novel properties of both diamond and nanomaterial, intensive efforts have been made to synthesize the larger diamondoid molecules, but to no avail. This situation was finally changed in 2003 when significant quantities of higher diamondoids were found in petroleum by researchers in MolecularDiamond Technologies. Now, scientists from Berkeley Lab, Stanford University, Lawrence Livermore National Laboratory, and Germany have used photoelectron spectroscopy at the ALS to reveal an intriguing feature: monochromatized electron emission from a self-assembled monolayer of diamondoids. This discovery has immediately attracted the attention of people who are searching for materials for next-generation electron emitters. Read more..., 10364=Publication about this research: W.L. Yang, J.D. Fabbri, T.M. Willey, J.R.I. Lee, J.E. Dahl, R.M.K. Carlson, P.R. Schreiner, A.A. Fokin, B.A. Tkachenko, N.A. Fokina, W. Meevasana, N. Mannella, K. Tanaka, X.J. Zhou, T. van Buuren, M.A. Kelly, Z. Hussain, N.A. Melosh, and Z.-X. Shen, \"Monochromatic electron photoemission from diamondoid monolayers,\" Science 316, 1460 (2007)., 26650=The User Services Office is accepting general user proposals from scientists who wish to conduct research in the general sciences at the ALS during the running period from July through December 2008. The deadline for submissions is Tuesday, January 15, 2008. (This deadline does not apply to protein crystallography proposals, which have a separate process and schedule.) To submit a new proposal, go to the online form, \"ALS General User Proposal and Request for Beamtime.\", 1509=The 2006 ALS Activity Report is now available, 28660=The 2006 ALS Activity Report is now available, 7517=This work was supported by the Director, Office of Science, Office of Basic Energy Sciences, of the U.S. Department of Energy under Contract No. DE-AC02-05CH11231. Disclaimer., 28753=The 2006 ALS Activity Report is now available. Go to the Activity Reports archive page to download a PDF copy. For more information on obtaining a printed copy, see \"Obtaining Printed Copies of ALS Publications\" on the ALS Publications Web page., 14375=This e-mail address is being protected from spambots. You need JavaScript enabled to view it I would like to thank the ALS users community for voting in this year's ALS Users' Executive Committee (UEC) election. Voting started slowly but ended on a strong note after a number of encouraging get-out-the-vote emails from the UEC and ALS staff. At this time, the election results are in and we will welcome four new members next year: Yves Acremann (Stanford Linear Accelerator Center); Phil Heimann (Berkeley Lab); Wayne Stolte (University of Nevada, Las Vegas); and the new student representative, Anne Sakdinawat (UC Berkeley and UC San Francisco). The newly elected members will take office for a three-year term beginning January 1, 2008. UEC vice chair Hendrik Ohldag (Stanford Linear Accelerator Center) will take over as chair, and I will serve as an ex-officio UEC member in 2008. Read more about new UEC members and continuing members on the ALS-UEC Nominating and Voting Web site., 4184=For the user runs from October 31 – November 20:, 4305=Failure of a circuit board in the SRRF system on November 14 resulted in the loss of approximately 26 hours of scheduled beam time., 18410=Howard Padmore, ALS Division Deputy for Experimental Systems, has been elevated to the rank of fellow by the Optical Society of America (OSA) Board of Directors at their meeting in September in San Jose, California. OSA members who have served with distinction in the advancement of optics are eligible for nomination to the rank of fellow. The number of fellows is limited to ten percent of the total membership. The Society recognizes Howard for his pioneering contributions to the application of x-ray optics to scientific research using synchrotron radiation.}", "lastModified": "Wed, 29 Jul 2015 09:22:50 GMT", "textBeforeTable": ". 1. Rate interest in following types of articles: //--> document.write( 'span>' ); document.write( 'This e-mail address is being protected from spambots. You need JavaScript enabled to view it Last month, we asked our readers to fill out a short survey. We've tallied the results, and they appear below as percentages. Thanks to all of you who responded. We welcome your feedback at any time. Send comments to This e-mail address is being protected from spambots. You need JavaScript enabled to view it", "textAfterTable": "2. Rate the level of writing: Just Right 92% Too Technical 3 Not Technical Enough 5 3. Delivery frequency preferred: Every two weeks 19% Once per month 76 Every two months 5 4. Delivery method preferred: Text-only email with full articles 10.0% Text-only email with links to Web for full articles 37.5 HTML email (Web look) with full articles 20.0 HTML email w/ links to web for full articles 22.5 Email notice only w/ link to full Web newsletter 2.5 Email w/ pdf attachment 7.5 5. Web format preferred: One-page, scrolling newsletter 73% Home page w/ short blurbs to longer articles 27 6. General Comments* Several readers responded with comments such as \"great job,\" and we thank you so much for your support. In addition, here are some specific suggestions readers provided: \"Please add an RSS feed to the article delivery\" \"Keep it short with links to the detailed information\" \"Articles on ALS policy/funding/politics announcements\" \"More technical details in (not just statistics) in", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}