{"relation": [["", "", "", "", "", "", "", "", "", "", "", "", "", ""], ["", "Water", "Glycerin", "Disodium EDTA", "Zn2+-complexed peptide", "Ascorbyl Glucoside", "Tetrahecyldecyl ascorbate", "Carrot Root extract", "Soybean seed extract", "Carbopol", "Lecithin hydrogenated", "Cetyl Caprylate", "Phenoxyethanol", ""], ["", "qs", "2-10%", "0.2%", "0.001-2%", "0.001-2%", "0.00001-2%", "0.001-2%", "0.001-1%", "0.1-2%", "0.1-1%", "2-15%", "0.1-1%", ""]], "pageTitle": "Cosmetic uses of modified stressed yeast extracts and related compositions - Avon Products, Inc.", "title": "", "url": "http://www.freepatentsonline.com/8575106.html", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 7, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438043062723.96/warc/CC-MAIN-20150728002422-00176-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 460420967, "recordOffset": 460365578, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{23674=Inflammation also contributes to skin discoloration and has other deleterious effects on the appearance of skin. Ruiz-Maldonado et al. (1997) Semin Cutan Med. Surrg. 16(1):36-43; Tomita et al. (1989) Dermatologica 179 Suppl 1:49-53. For example, inflamed acne lesions can lead to scarring (Holland et al. Semin Cutan Med Surg. 2005 June; 24(2):79-83); and the cumulative degenerative effects of inflammation have been shown to exacerbate intrinsic (chronological) and extrinsic (photo) aging of human skin. Pillai, et al. (2005) Int J Cosmet Sci. February; 27(1):17-34; Bissett, et al. (1990) Photodermatol. Photoimmunol. Photomed. 7:153-8; Thornfeldt, C R (2008) J. Cosmet. Dermatol. 7:78-82. A key inflammatory mediator, tumor necrosis factor-alpha (TNFa), is believed to be responsible for both acute and chronic skin inflammation., 53063=In certain preferred embodiments, the extract is fractionated using centrifugation, filtration and/or chromatography systems to isolate a dominant peptide fraction. The stressed yeast extract can be purified to enrich small molecular weight peptides, within a 1000 to 3000 Da range, wherein peptides comprising the hexameric peptide SEQ ID NO:1 (Phe-Val-Ala-Pro-Phe-Pro) is the dominant fraction. The peptides can be substantially isolated from other components of the stressed yeast extract, and preferably include less than the full-length proteins from which they are derived., 25428=Hyaluronic acid is another component of skin that plays a role in its aesthetic appearance. Hyaluronic acid is a glycosaminoglycan (GAG) found in the skin, as part of the extracellular matrix (ECM). With age, however, GAG synthesis and overall GAG skin content appear to decline. Smith et al. J. Invest. Dermatol., 1962, 39, pages 347-350; Fleischmajer et al. Biochim. Biophys. Acta, 1972, 279, pages 265-275; Longas et al. Carbohydr. Res., 1987, 159, pages 127-136. It is believed that this reduction in GAG contributes to age-related changes in the skin's mechanical properties, including, for example, changes in tissue hydration, as well as plumpness and protection against free radicals. Carrino et al., Arch Biochem Biophys. 2000 Jan. 1; 373(1):91-101; Vogel et al., Z Gerontol. 1994 May-June; 27(3):182-5; Lanir et al., J Biomech Eng. 1990 February; 112(1):63-9); Wiest et al. J Dtsch Dermatol Ges. 2008 March; 6(3):176-80; Bert et al. Biorheology. 1998 May-June; 35(3):211-9., 132172=Non-limiting emulsifiers include emulsifying waxes, emulsifying polyhydric alcohols, polyether polyols, polyethers, mono- or di-ester of polyols, ethylene glycol mono-stearates, glycerin mono-stearates, glycerin di-stearates, silicone-containing emulsifiers, soya sterols, fatty alcohols such as cetyl alcohol, acrylates, fatty acids such as stearic acid, fatty acid salts, and mixtures thereof. Some preferred emulsifiers include soya sterol, cetyl alcohol, stearic acid, emulsifying wax, acrylates, silicone containing emulsifiers, and mixtures thereof. Other specific emulsifiers that can be used with the compositions described herein include, but are not limited to, one or more of the following: C10-30 alkyl acrylate crosspolymer; Dimethicone PEG-7 isostearate; acrylamide copolymer; mineral oil; sorbitan esters; polyglyceryl-3-diisostearate; sorbitan monostearate; sorbitan tristearate; sorbitan sesquioleate; sorbitan monooleate; glycerol esters such as glycerol monostearate and glycerol monooleate; polyoxyethylene phenols such as polyoxyethylene octyl phenol and polyoxyethylene nonyl phenol; polyoxyethylene ethers such as polyoxyethylene cetyl ether and polyoxyethylene stearyl ether; polyoxyethylene glycol esters; polyoxyethylene sorbitan esters; dimethicone copolyols; polyglyceryl esters such as polyglyceryl-3-diisostearate; glyceryl laurate; Steareth-2, Steareth-10, and Steareth-20, to name a few. Additional emulsifiers are provided in the INCI Ingredient Dictionary and Handbook 11th Edition 2006, the disclosure of which is hereby incorporated by reference. These emulsifiers typically will be present in the composition in an amount from about 0.001% to about 10% by weight, in particular in an amount from about 0.01% to about 5% by weight, and more preferably, from about 0.1% to about 3% by weight. Based on the teachings herein, a person skilled in the art will be able to select a suitable emulsifier, or any other materials described herein, and/or in an amount thereof, such that one or more of the desired properties of the cosmetic compositions of the instant invention can be preserved., 136932=The water-in-silicone emulsion may be emulsified with a nonionic surfactant (emulsifier) such as, for example, polydiorganosiloxane-polyoxyalkylene block copolymers, including those described in U.S. Pat. No. 4,122,029, the disclosure of which is hereby incorporated by reference. These emulsifiers generally comprise a polydiorganosiloxane backbone, typically polydimethylsiloxane, having side chains comprising -(EO)m- and/or -(PO)n- groups, where EO is ethyleneoxy and PO is 1,2-propyleneoxy, the side chains being typically capped or terminated with hydrogen or lower alkyl groups (e.g., C1-6, typically C1-3). Other suitable water-in-silicone emulsifiers are disclosed in U.S. Pat. No. 6,685,952, the disclosure of which is hereby incorporated by reference herein. Commercially available water-in-silicone emulsifiers include those available from Dow Corning under the trade designations 3225C and 5225C FORMULATION AID; SILICONE SF-1528 available from General Electric; ABIL EM 90 and EM 97, available from Goldschmidt Chemical Corporation (Hopewell, Va.); and the SILWET series of emulsifiers sold by OSI Specialties (Danbury, Conn.)., 75141=Accordingly, another aspect of the instant invention relates to cosmetic use of compositions comprising a calcium influx inhibitor for skin and/or hair lightening. A “calcium influx inhibitor” as used herein refers to any compound that acts to decrease, reduce, block, or otherwise inhibit the entry of calcium into pigment cells. The term is used interchangeably herein with “calcium channel inhibitor.” Calcium influx inhibitors will include compounds known in the art to regulate calcium entry into pigment cells, such as, without limitation, 2-aminoethyl diphenylborate (2-APB). For example, this compound is known to specifically block calcium entry into cells, including into pigment cells. Other known calcium influx inhibitors include, without limitation, Aminohexahydrofluorene, Bepridil, Calcicludine, Calciseptine, Calmidazolium chloride, Nifedipine, Verapamil, FS2 (Dendroaspis polylepis polylepis), Galanin, Protopine, Tetrahydropalmatine, Somatostatin-14, L-Stepholidinealverine and its salts; as well as manganese and its salts, magnesium and it salts. See, e.g., EP 1419764; Int. Pat. Appl. Pub. No. WO 2006048671; and U.S. Pat. Appl. Pub. No. 2009/0028826. Cosmetic compositions comprising calcium influx inhibitors surprisingly act to decrease melanin synthesis, and accordingly find use in skin or hair lightening products, e.g., for treating and/or preventing skin hyper-pigmentation, or bleaching hair. Calcium influx inhibitors that are capable of treating and/or preventing hyper-pigmented skin also can be referred to as “skin lighteners.” When used for lightening hair, they also can be referred to “hair lighteners.” Compositions used in hyper-pigmentation applications will comprise an effective amount of one or more calcium influx inhibitors to treat and/or prevent hyper-pigmentation, such as, e.g., to lighten skin/hair in an affected area., 163979=Modified yeast peptide fractions comprising a zinc-complexed peptide comprising SEQ ID NO:1 were tested in vitro for the ability to increase enzymatic activity of a member of the KLK family, specifically, recombinant human (rh) KLK5. Recombinant human KLK5 (R&D Systems Cat No. 1108-SE) was pre-incubated with modified yeast peptide fractions comprising different concentrations of zinc-complexed peptide comprising SEQ ID NO:1, including 0.1%, 0.01%, and 0.001% zinc-complexed peptide. Following pre-treatment, KLK5 activity was assessed by measuring the rate of peptide bond cleavage of a synthetic substrate. The substrate was conjugated to a quenched fluorescent group (Boc-V-P-R-AMC Fluorogenic Peptide Substrate, R&D Systems, Cat No. ES011), so that upon cleavage of the adjacent peptide bond, the fluorescence is revealed, resulting in a measureable emission at a wavelength of 612 nm when excited at a wavelength of 340 nm. An increase in the fluorescence reading indicates increased rhKLK5 activity., 118283=Further, the skin-lightening, anti-inflammatory, and/or anti-lipid properties of the compositions described herein can also contribute to their anti-aging properties. For example, inflammation has been shown to activate various matrix degrading metalloproteases, leading to abnormal matrix degradation that may contribute to skin aging. Pillai, et al. (2005) Int J Cosmet Sci. February; 27(1):17-34. Inflammation also has been shown to exacerbate intrinsic and extrinsic aging of human skin by causing an accumulation of reactive oxygen species, which damage cellular proteins, lipids and carbohydrates that then accumulate in dermal and epidermal compartments. Pillai, et al. (2005) Int J Cosmet Sci. February; 27(1):17-34; Bissett, et al. (1990) Photodermatol. Photoimmunol. Photomed. 7:153-8; Thornfeldt, C R (2008) J. Cosmet. Dermatol. 7:78-82. Inflammation is known to also contribute to skin discoloration, for example, hyper-pigmentation in the skin has been observed post-inflammation. Ruiz-Maldonado et al. (1997) Semin Cutan Med Surg. 16(1):36-43; Tomita et al. (1989) Dermatologica. 179 Suppl 1:49-53); Holland et al. Semin Cutan Med Surg. 2005 June; 24(2):79-83. Skin discoloration, along with oiliness and/or areas of cellulite, can further contribute to an appearance of aging. Again without wishing to be bound to theory, the combined actions of compositions described herein can provide synergistic skin benefits, in certain embodiments, e.g., by exhibiting two or more of the following modulatory activities: decreasing melanin synthesis, decreasing TNFa production, decreasing PPARs signaling, decreasing metalloproteinase activity, increasing collagen synthesis, increasing hyaluronic acid production, and increasing KLKs activity., 93553=Further, it can be noted that the lipids whose production is reduced by certain compositions of the instant invention are distinguished from membrane lipids, such as those found in lipid bilayers. Bilayer lipids include, for example, lipids in the bilayers of the stratum corneum, or other cutaneous lipids, such as cholesterol, cholesterol esters, free fatty acids, and ceramindes that make up the lipid bilayers of skin. See, e.g., U.S. Pat. Appl. Pub. No. 2006/0110815., 54676=The hexameric peptide also can be synthesized using recombinant expression systems. Generally, this involves creating a DNA sequence that encodes the desired peptide, placing the DNA in an expression cassette under the control of a particular promoter, expressing the peptide in a host, isolating the expressed peptide and, if required, renaturing the peptide. See, e.g., U.S. Pat. No. 7,030,231. DNA encoding peptides comprising SEQ ID NO:1 can be prepared by any suitable method including, for example, cloning and restriction of appropriate sequences or direct chemical synthesis by methods such as the phosphotriester method of Narang et al. (1979) Meth. Enzymol. 68: 90 99; the phosphodiester method of Brown et al. (1979) Meth. Enzymol. 68: 109 151; the diethylphosphoramidite method of Beaucage et al. (1981) Tetra. Lett., 22: 1859 1862; and the solid support method of U.S. Pat. No. 4,458,066. Chemical synthesis may produce a single stranded oligonucleotide, which may be converted into double-stranded DNA by hybridization with a complementary sequence or by polymerization with a DNA polymerase using the single strand as a template., 78820=In some embodiments, the cosmetic compositions for treating and/or preventing hyper-pigmentation, e.g., lightening skin (or hair), further comprise at least one other skin lightener (or at least one other hair lightener). For example, the cosmetic composition comprising a modified peptide comprising a metal-complexed peptide comprising SEQ ID NO:1, and/or other calcium influx inhibitor, in an amount effective to treat and/or prevent hyper-pigmentation may further comprise at least one other skin lightener (or at least one other hair lightener). For example, a tyrosine inhibitor, including any of the tyrosine inhibitors disclosed in KR 2005095167; JP 2003252743 and JP 61260009, may be included, in some embodiments. Any other substances that can be applied to the skin (or hair) to lighten the skin (or hair) may also be used as an additional skin (or hair) lightener with the compositions described herein. Examples of skin lighteners include, without limitation, hydroquinone, kojic acid, licorice and/or its derivatives, ascorbic acid and/or its derivatives, arbutin, bearberry extract, Glycyrrhiza glabra and its derivatives, Chlorella vulgaris extract, perilla extract, coconut fruit extract, and/or other depigmenting agents. Perilla extract is disclosed as a whitening agent, e.g., in U.S. Pat. No. 5,980,904 and Japanese Publications Nos. 07025742, 07187989, 10265322, 2001163759, and 2001181173. Coconut fruit extract is disclosed as a whitening agent in Japanese Patent No. 2896815B2., 53656=In some embodiments, the hexameric peptide itself is synthesized, e.g., using automated chemical synthesis or recombinant means, and re-added to the yeast peptide fraction, e.g., to artificially increase the concentration of the hexameric peptide in the yeast peptide fraction. For example, the relatively short molecules may be synthesized using standard chemical peptide synthesis as a single contiguous peptide. Solid phase synthesis can be used, in which the C-terminal amino acid of the sequence is attached to an insoluble support followed by sequential addition of the remaining amino acids in the sequence. Techniques for solid phase synthesis are described, e.g., by Barany and Merrifield, Solid-Phase Peptide Synthesis; pp. 3 284; in The Peptides: Analysis, Synthesis, Biology. Vol. 2: Special Methods in Peptide Synthesis, Part A.; in Merrifield, et al. (1963) J. Am. Chem. Soc., 85: 2149 2156; and in Stewart et al. (1984) Solid Phase Peptide Synthesis, 2nd ed. Pierce Chem. Co., Rockford, Ill., 27835=Many of the physiological processes in play in the development of undesirable skin or hair have counterparts in eukaryotic microorganisms, such as yeast, and yeasts extracts have been used in cosmetic applications. For example, in response to heat, UV radiation, or other stress, yeast are known to produce factors that promote cell proliferation or viability. See, e.g., U.S. Pat. No. 2,239,345. Stressed yeast lysates containing such factors have been described and have been indicated for use in cosmetic applications directed to counteracting the effects of certain stresses on the skin. For example, UV-stressed yeast lysates have been used in cosmetic applications. See, e.g., U.S. Pat. Nos. 5,643,587; 5,676,956; and 5,776,441. More recently, ozone-stressed yeast lysates have been described as useful in protecting skin cells from the harmful effects of ozone. See, e.g., U.S. Pat. Nos. 6,461,857 and 6,858,212 to Scholz et al; and U.S. Pat. Appl. Pub. Nos. 2003/0198682 and 2006/0110815. Nonetheless, these earlier cases failed to recognize certain cosmetic uses and failed to identify active ingredients within the cellular lysates., 44305=For example, yeast proteins induced or up-regulated in response to stress, such as UV exposure, can be determined by comparing the proteins present in stressed yeast extracts to those present in extracts of yeast not subjected to the same stress, using for example comparative two-dimensional polyacrylamide gel electrophoresis. See, e.g., U.S. Pat. App. Publ. 2006/0110815. Another approach involves running a yeast gene microarray to identify yeast genes whose expression changes in response to the stress, e.g., to determine which genes are induced, up-regulated, turned off, or down-regulated in response to the stress. Such comparisons can indicate a number of yeast heat shock proteins induced or up-regulated in response to stress, and the identified proteins can be analyzed to determine whether or not they contain SEQ ID NO:1. Different yeasts that may be analyzed include, without limitation: Arthroascus, Aureobasidium, Botryoascus, Brettanomyces, Candida, Citeromyces, Clavispora, Cryptococcus, Debaryomyces, Dekkera, Filobasidium, Guilliermondella, Hansenula, Haneseniaspora, Hormoascus, Klockera, Kluyveromyces, Leucosporidium, Lipomyces, Malassezia, Metschnikowia, Nadsonia, Nematospora, Oosporidium, Pachysolen, Pachytichospora, Penicillium, Pichia, Prototheca, Rhodosporidium, Rhodotorula, Saccharomyces, Saccharomycodes, Saccharomycopsis, Schizosaccharomyce, Schwanniomyces, Sporobolomyces, Sporopachydermia, Tremella, Trichosporan, Trigonopsis, Torulaspora, Torulopsis, Williopsis, Yarrowia, Zygosaccharomyces and the like, and any of those found to produce proteins or peptides comprising SEQ ID NO:1 may be used, as well as combinations thereof. SEQ ID NO:1 has also been found in transmembrane proteins of Saccharomyces cerevisiae and may also occur in the transmembrane proteins of one or more other species, such as one or more of the other yeast species listed above., 73545=Pigmentation of the skin (including the lips) and hair is determined by the level and type of melanin present in the epidermis or hair fiber. For example, the greater the epidermal level of DHI-melanin, the darkest type of melanin, the darker the skin. As noted above, melanin is synthesized in specialized organelles called melanosomes within pigment cells (also called pigment-producing cells or melanocytes), and the process begins with the conversion of the amino acid tyrosine to dopaquinone by the enzyme tyrosinase. Most other skin lightening approaches have relied upon tyrosinase inhibitors applied to the skin to decrease melanin synthesis. See, e.g., Korean Patent No. KR 2005095167; and Japanese Patent Nos. JP 2003252743, and JP 61260009. These cases, however, as well as Japanese Patent Nos. JP 2002234828 and JP 2001151631, used extracts obtained from non-stressed yeast, that is, from yeast that had not been exposed to one or more stresses. Without wishing to be bound by theory, it is believed that the modified peptide fractions comprising metal-complexed peptides comprising SEQ ID NO:1 do not rely upon a tryrosine inhibitor to decrease melanin synthesis, but appear to have a different mechanism of action. Indeed, it has been surprisingly found that compositions of the instant invention decrease melanin synthesis by inhibiting calcium influx into pigment cells. Furthermore, it has been surprisingly found that compositions comprising other calcium influx inhibitors also can be used in cosmetic applications against hyper-pigmentation. See Example 1 below., 111573=Exfoliating enzymes in the skin, such as the KLKs, are also involved in skin aging. KLKs are a family of proteases residing in the stratum corneum of human skin that aid exfoliation of dead skin cells by breaking down proteins responsible for cell-to-cell cohesion. Kishibe M et al. 2006 “Kallikrein 8 Is Involved in Skin Desquamation in Cooperation with Other Kallikreins.” J. Biol. Chem. 282: 5834-5841. In the stratum corneum, cell-to-cell cohesion depends primarily on proteins known as the corneodesmosomes. Corneodesmosomes are known to be broken down by KLKs during skin remodeling and renewal, allowing dead cells to slough off of the skin surface. This exfoliation of dead cells improves the skin's aesthetic appearance, e.g., by preventing build up of dead cells on the skin surface that give the skin a dry, rough, dull appearance. Exfoliation can leave skin feeling smoother and looking fresher, and may also augment penetration of other skin actives. It is believed that with age, however, corneodesmosome turnover slows down, allowing a build up of dead cells on the skin surface. Without wishing to be bound by theory, it is believed that the modified yeast peptide fractions comprising metal-complexed peptide comprising SEQ ID NO:1 can act to increase KLKs activity, thereby reducing one or more unwanted features associated with skin aging, e.g., reducing dryness and/or improving skin luster and/or brightness. See Example 7 below. Up-regulation of KLK activity can increase the rate of shedding dead skin, and thus naturally enhance skin exfoliation., 12090=This application claims priority to U.S. Provisional Patent Application Ser. No. 61/238,427, filed Aug. 31, 2009, the contents of which are hereby incorporated by reference in their entirety., 108411=Loss of hyaluronic acid over time also plays a role in skin aging. Hyaluronic acid is a glycosaminoglycan (GAG) found in the skin as part of the ECM. GAGs are long unbranched polymers of repeating disaccharide units, mainly composed of hexosamine, hexose, hexuronic acid moieties, or sulfates thereof. GAGs bind to proteins in the skin to form proteoglycans, which contribute to the growth, preservation, and repair of skin. Hyaluronic acid, in particular, has been reported to be responsible for hydration of the skin, nutrient exchange, and protection against free radicals. Wiest et al. J Dtsch Dermatol Ges. 2008 March; 6(3):176-80; Bert et al. Biorheology. 1998 May-June; 35(3):211-9. It also has been reported, however, that as skin ages over time, GAG synthesis declines and the overall GAG content in the skin decreases. Smith et al. in J. Invest. Dermatol., 1962, 39, pages 347-350; Fleischmajer et al. Biochim. Biophys. Acta, 1972, 279, pages 265-275; Longas et al. Carbohydr. Res., 1987, 159, pages 127-136. This reduction in GAG and hyaluronic acid content in the skin is believed to contribute to age-related changes in the mechanical properties of skin, particularly changes in tissue hydration and resiliency. Carrino et al., Arch Biochem Biophys. 2000 Jan. 1; 373(1):91-101; Vogel et al., Z Gerontol. 1994 May-June; 27(3):182-5; Lanir et al., J Biomech Eng. 1990 February; 112(1):63-9). Without wishing to be bound by theory, it is believed that the modified yeast peptide fractions comprising a metal-complexed peptide comprising SEQ ID NO:1 can act to increase hyaluronic acid production, thereby reducing one or more of the unwanted features associated with skin aging, e.g., by improving skin hydration and resiliency. See Example 6 below., 184032=© 2004-2015 FreePatentsOnline.com. All rights reserved. Privacy Policy & Terms of Use. A SumoBrain Solutions Company, 138131=Examples of water-in-silicone emulsifiers include, but are not limited to, dimethicone PEG 10/15 crosspolymer, dimethicone copolyol, cetyl dimethicone copolyol, PEG-15 lauryl dimethicone crosspolymer, laurylmethicone crosspolymer, cyclomethicone, dimethicone copolyol, dimethicone copolyol, caprylic/capric triglycerides, polyglyceryl-4 isostearate, cetyl dimethicone copolyol, hexyl laurate, dimethicone copolyol, cyclopentasiloxane, and any combination of two or more of these. Preferred examples of water-in-silicone emulsifiers include, without limitation, PEG/PPG-18/18 dimethicone (trade name 5225C, Dow Corning), PEG/PPG-19/19 dimethicone (trade name BY25-337, Dow Corning), Cetyl PEG/PPG-10/1 dimethicone (trade name Abil EM-90, Goldschmidt Chemical Corporation), PEG-12 dimethicone (trade name SF 1288, General Electric), lauryl PEG/PPG-18/18 methicone (trade name 5200 FORMULATION AID, Dow Corning), PEG-12 dimethicone crosspolymer (trade name 9010 and 9011 silicone elastomer blend, Dow Corning), PEG-10 dimethicone crosspolymer (trade name KSG-20, Shin-Etsu), dimethicone PEG-10/15 crosspolymer (trade name KSG-210, Shin-Etsu), and dimethicone PEG-7 isostearate. The water-in-silicone emulsifiers typically will be present in the composition in an amount from about 0.001% to about 10% by weight, in particular in an amount from about 0.01% to about 5% by weight, and more preferably, below 1% by weight., 134319=The oil phase may comprise one or more volatile and/or non-volatile silicone oils. Volatile silicones include cyclic and linear volatile dimethylsiloxane silicones. In some embodiments, the volatile silicones may include cyclodimethicones, including tetramer (D4), pentamer (D5), and hexamer (D6) cyclomethicones, or mixtures thereof. Particular mention may be made of the volatile cyclomethicone-hexamethyl cyclotrisiloxane, octamethyl-cyclotetrasiloxane, and decamethyl-cyclopentasiloxane. Suitable dimethicones are available from Dow Corning under the name Dow Corning 200® Fluid and have viscosities ranging from about 0.65 to about 600,000 centistokes or higher. Suitable non-polar, volatile liquid silicone oils are disclosed in U.S. Pat. No. 4,781,917, herein incorporated by reference in its entirety. Additional volatile silicones materials are described in Todd et al., “Volatile Silicone Fluids for Cosmetics”, Cosmetics and Toiletries, 91:27-32 (1976), herein incorporated by reference in its entirety. Linear volatile silicones generally have a viscosity of less than about 5 centistokes at 25° C., whereas the cyclic silicones have viscosities of less than about 10 centistokes at 25° C. Examples of volatile silicones of varying viscosities include Dow Corning 200, Dow Corning 244, Dow Corning 245, Dow Corning 344, and Dow Corning 345, (Dow Corning Corp.); SF-1204 and SF-1202 Silicone Fluids (G.E. Silicones); GE 7207 and 7158 (General Electric Co.); and SWS-03314 (SWS Silicones Corp.). Linear, volatile silicones include low molecular weight polydimethylsiloxane compounds such as hexamethyldisiloxane, octamethyltrisiloxane, decamethyltetrasiloxane, and dodecamethylpentasiloxane, to name a few.}", "textBeforeTable": "Exemplary cosmetic compositions comprising modified yeast peptide fractions comprising a zinc-complexed peptide comprising SEQ ID NO:1 for topical application to the skin are provided below. The compositions are provided in the form of an essence that finds use in anti-aging and/or skin lightening applications. Skin Lightening and/or Anti-Aging Essence Formulation Example 8 It was observed that modified peptide fractions comprising 0.1%, 0.01%, and 0.001% zinc-complexed peptide comprising SEQ ID NO:1 stimulated KLK5 activity by 23%, 27% and 31% respectively, surprisingly giving an inverse dose-response. The results suggest that topical application of compositions comprising modified yeast peptide fractions comprising a metal-complexed peptide comprising SEQ ID NO:1 can increase KLKs activity, thereby enhancing exfoliation and reducing one or more unwanted features associated with skin aging, e.g., by improving skin luster and/or brightness. Modified yeast peptide fractions comprising a zinc-complexed peptide comprising SEQ ID NO:1 were tested in vitro for the ability to increase enzymatic activity of a member of the KLK family, specifically, recombinant human (rh) KLK5. Recombinant human KLK5 (R&D Systems Cat No. 1108-SE) was pre-incubated with modified yeast peptide fractions comprising different concentrations of zinc-complexed peptide comprising SEQ ID NO:1, including 0.1%, 0.01%, and 0.001% zinc-complexed peptide. Following pre-treatment, KLK5 activity was assessed by measuring the rate of peptide bond cleavage of a synthetic substrate. The substrate was conjugated to a quenched fluorescent group (Boc-V-P-R-AMC", "textAfterTable": "Water qs Glycerin 2-10% Pentylene Glycol 2-5% Disodium EDTA 0.2% Xanthan gum 0.2-2% Silica 0.2-2% Zn2+-complexed peptide 0.001-2% Ascorbyl Glucoside 0.001-2% Phenoxyethanol 0.1-1% Example 10 Skin Lightening and/or Anti-Aging Cream Formulation Exemplary cosmetic compositions comprising modified yeast peptide fractions comprising a zinc-complexed peptide comprising SEQ ID NO:1 for topical application to the skin are provided below. The compositions are provided in the form of a cream that finds use in anti-aging and/or skin lightening applications. Water qs Glycerin 2-10% Disodium EDTA 0.2% Zn2+-complexed peptide 0.001-2% Ascorbyl Glucoside 0.001-2% Tetrahecyldecyl ascorbate 0.00001-2% Carrot Root extract 0.001-2% Soybean seed extract 0.001-1% Carbopol 0.1-2% Lecithin hydrogenated 0.1-1% Cetyl Caprylate 2-15% Phenoxyethanol 0.1-1% Example 11 Skin Lightening and/or Anti-Aging SPF 20 Day Cream Formulation Exemplary cosmetic compositions comprising", "hasKeyColumn": false, "keyColumnIndex": -1, "headerRowIndex": 0}