{"relation": [["Year", "2013", "2012", "2012", "2012", "2012", "2011", "2011", "2011", "2011", "2011", "2011", "2011"], ["Title / Rationale", "Science of Nutrition in Medicine Conference Organisation: Sydney, May Description: .", "Vasoactive Nutrients and Brain Function Organisation: Canadian Nutrition Society Description: Invited Speaker at annual conference.", "Circulatory dysfunction and chronic inflammation: a common target for nutrient intervention Organisation: Nutrition Society of Australia Newcastle Group meeting Description: .", "Student Masterclass Organisation: Nutrition Society of Australia annual meeting Description: .", "Resveratrol 2012 Organisation: University of Leicester Description: .", "Omega Index Organisation: RCPA AACB Chemical Pathology Course", "Cardiometabolic/mental health benefits of vasoactive nutrients Organisation: University of Newcastle", "Cardiometabolic and mental health benefits of vasoactive nutrients Organisation: Science of Nutrition in Medicine and Healthcare Conference", "Cardiovascular, metabolic and mental health benefits of vasoactive nutrients Organisation: Therapeutic Applications of Functional Foods Description:", "Nutrition and Health & Shape Up for Life Organisation: CPDENT: Dental Practice Update Description:", "Nutraceuticals in Health and Disease Organisation: 5th International Conference on Mechanisms of Action of Nutraceuticals Description:", "Erythrocyte omega-3 levels - an alternative basis for intake recommendations Organisation: Australasian Section of the American Oil Chemists Society Description: Invited speaker at Health and nutrition session."]], "pageTitle": "Professor Peter Howe / Staff Profile / The University of Newcastle, Australia", "title": "", "url": "http://www.newcastle.edu.au/profile/peter-howe", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 5, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989891.18/warc/CC-MAIN-20150728002309-00160-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 609115743, "recordOffset": 609052651, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{30878=Epidemiological evidence of an inverse association between consumption of long-chain omega-3 polyunsaturated fatty acids (LC n-3 PUFA) and obesity has been conflicting, even though studies in animal models of obesity and limited human trials suggest that LC n-3 PUFA consumption may contribute to weight loss. We used baseline data from a convenience sample of 476 adults (291 women, 185 men) participating in clinical trials at our Centre to explore relationships between erythrocyte levels of LC n-3 PUFA (a reliable indicator of habitual intake) and measures of adiposity, viz. body mass index (BMI), waist circumference (WC) and body fat (BF) assessed by dual-energy X-ray absorptiometry. Means Â± SD of assessments were BMI: 34 Â± 7 and 31 Â± 5 kg/m2; WC: 105 Â± 16 and 110 Â± 13 cm; BF: 48 Â± 5 and 35% Â± 6% in women and men respectively. Erythrocyte levels of eicosapentaenoic acid (EPA) and docosahexaenoic acid (DHA) were similar in men and women while docosapentaenoic acid (DPA) was higher and EPA + DHA (Omega-3 Index) slightly lower in men than in women. Both DHA and EPA + DHA correlated inversely with BMI, WC and BF in women while DPA correlated inversely with BF in men. Quartile distributions and curvilinear regression of the Omega-3 Index versus BMI revealed a steep rise of BMI in the lower range of the Omega-3 Index in women, but no association in men. Thus the results highlight important gender differences in relationships of specific LC n-3 PUFA in erythrocytes to markers of adiposity. If these reflect causal relationships between LC n-3 PUFA consumption and risk of obesity, gender specific targeted interventions should be considered. Â© 2014 by the authors; licensee MDPI, Basel, Switzerland., 65584=A number of intervention studies have reported that the prevalence of obesity may be in part inversely related to dairy food consumption while others report no association. We sought to examine relationships between energy, protein and calcium consumption from dairy foods (milk, yoghurt, cheese, dairy spreads, ice-cream) and adiposity including body mass index (BMI), waist (WC) and hip circumference (HC), and direct measures of body composition using dual energy X-ray absorptiometry (% body fat and abdominal fat) in an opportunistic sample of 720 overweight/obese Australian men and women. Mean (SD) age, weight and BMI of the population were 51 Â± 10 year, 94 Â± 18 kg and 32.4 Â± 5.7 kg/m2, respectively. Reduced fat milk was the most commonly consumed dairy product (235 Â± 200 g/day), followed by whole milk (63 Â± 128 g/day) and yoghurt (53 Â± 66 g/day). Overall dairy food consumption (g/day) was inversely associated with BMI, % body fat and WC (all p < 0.05). Dairy protein and dairy calcium (g/day) were both inversely associated with all adiposity measures (all p < 0.05). Yoghurt consumption (g/day) was inversely associated with % body fat, abdominal fat, WC and HC (all p < 0.05), while reduced fat milk consumption was inversely associated with BMI, WC, HC and % body fat (all p < 0.05). Within a sample of obese adults, consumption of dairy products, dairy protein, and calcium was associated with more favourable body composition. Â© 2013 by the authors; licensee MDPI, Basel, Switzerland., 380278=July 19, 2013, 377972=April 27, 2015, 54953=Nuts are rich in many nutrients that can benefit multiple cardiometabolic functions, including arterial compliance, blood pressure, inflammation, glucoregulation and endothelial vasodilatation. Impaired vasodilatation may contribute to impaired cognitive performance due to poor cerebral perfusion. The present narrative review examines associations between nut consumption, vascular health and cognitive function. It includes a systematic search which identified seventy-one epidemiological or intervention studies in which effects of chronic nut consumption on blood pressure, glucoregulation, endothelial vasodilator function, arterial compliance, inflammatory biomarkers and cognitive performance were evaluated. Weighted mean changes were estimated where data were available; they indicate that nut consumption reduces blood pressure and improves glucoregulation, endothelial vasodilator function and inflammation, whilst a limited number of studies suggest that nut consumption may also improve cognitive performance. Further clinical trials are warranted to explore relationships between nut consumption, endothelial function and cognitive function. Â© 2014 The Authors., 379079=January 8, 2015, 168459=The relationship between circulating adrenaline and blood pressure was examined by manipulating plasma adrenaline levels in both normotensive and hypertensive rats: bilateral adrenalmedullectomy was performed in spontaneously hypertensive rats and stroke-prone spontaneously hypertensive rats; adrenaline bitartrate was infused chronically (25-32 Âµg/kg/h s.c.) into Wistar Kyoto, Sprague Dawley and stroke-prone rats via osmotic minipumps. Arterial and venous catheters were subsequently implanted for direct measurement of mean arterial pressure, blood sampling and drug administration in conscious rats. Adrenaline infusion for 5-6 weeks in Wistar Kyoto rats did not affect resting blood pressure (118 Â± 3 versus 119 Â± 1 mmHg in controls) even though plasma adrenaline was elevated 12-fold. Plasma noradrenaline was marginally elevated. Blood pressure was also unaffected by adrenaline infusion in Sprague Dawley or stroke-prone hypertensive rats. One week after adrenal medullectomy, plasma adrenaline was reduced 89% in spontaneously hypertensive rats, but blood pressure was unaffected. Ten weeks after adrenal medullectomy in young stroke-prone rats, resting blood pressure was slightly higher (167 Â± 2 mmHg) than in control rats (157 Â± 2 mmHg), although adrenaline was reduced by 34% in plasma and 67% in adrenal glands. Nitroprusside was infused acutely to lower blood pressure and reflexly elevate plasma noradrenaline. Neither of these responses were affected by chronic adrenaline infusion or adrenal medullectomy. In both adrenaline-infused Wistar Kyoto and medullectomised stroke-prone rats, autonomic blockade reduced blood pressure to a similar extent as in controls, indicating that the degree of sympathetic vasoconstriction was not altered by either treatment. Moreover, pressor responses to i.v. phenylephrine were similar in all groups, indicating that changes in plasma adrenaline did not affect post-synaptic receptor sensitivity. We conclude that elevated plasma adrenaline seen in spontaneous hypertensive rats is unlikely to contribute to their hypertension. Â© 1994 Informa UK Ltd All rights reserved: reproduction in whole or part not permitted., 27980=Cross-sectional studies have reported positive relationships between serum lutein concentrations and higher physical activity levels. The purpose of the study was to determine whether increasing plasma lutein levels increases physical activity. Forty-four older adults (BMI, 25.3 Â± 2.6 kg/m2; age, 68.8 Â± 6.4 year) not meeting Australian physical activity guidelines (150 min/week of moderate to vigorous activity) were randomized to consume capsules containing 21 mg of lutein or placebo with 250 mL of full-cream milk per day for 4 weeks and encouraged to increase physical activity. Physical activity was assessed by self-report, pedometry and accelerometry (daily activity counts and sedentary time). Exercise self-efficacy was assessed by questionnaire. Thirty-nine participants competed the study (Lutein = 19, Placebo = 20). Lutein increased plasma lutein concentrations compared with placebo (p < 0.001). Absolute and percentage changes in plasma lutein were inversely associated with absolute (r = -0.36, p = 0.03) and percentage changes (r = -0.39, p = 0.02) in sedentary time. Percentage change in plasma lutein was positively associated with the percentage change in average daily activity counts (r = 0.36, p = 0.03). Exercise self-efficacy did not change (p = 0.16). Lutein increased plasma lutein, which was associated with increased physical activity and reduced sedentary time in older adults. Larger trials should evaluate whether Lutein can provide health benefits over the longer term. Â© 2014 by the authors; licensee MDPI, Basel, Switzerland., 161716=Having found that circulating adrenaline (AD) is selectively elevated in stroke-prone spontaneously hypertensive rats (SHRSP) compared with Wistar-Kyoto rats (WKY), we extended the comparison to include other normotensive and hypertensive rat strains. Aortic catheters were implanted in young (5-7 weeks) and old (7-9 months) WKY, Black-Hooded Wistar (BHW), Sprague Dawley (SD), spontaneously hypertensive rats (SHR) and SHRSP for repeated measurement of mean arterial pressure (MAP) and blood sampling under conscious resting conditions. In the young SHR and SHRSP, MAP was already significantly higher than in age-matched WKY but MAP in the SD rats was similar. Plasma AD was significantly higher in SHR and lower in SD rats when compared with WKY. There was no difference in plasma noradrenaline (NA) between strains at this age. At the older age, MAP was 40-60 mmHg higher in SHR and SHRSP than in WKY and BHW but was significantly lower in the SD strain. Circulating AD did not differ between the normotensive strains but was 3-4 times higher in the hypertensive strains. Plasma NA was elevated in SHR only. The acute reduction of MAP caused by ganglion blockade (an index of the sympathetically mediated component of resting blood pressure) was greater in SHR and SHRSP than in WKY at the older age only. However, the residual MAP after ganglion blockade was significantly higher in the hypertensive strains at both ages. Regression analysis showed that in the older rats, plasma AD was correlated with resting MAP, the reduction in MAP with ganglion blockade, the residual MAP and plasma NA. In the young rats, however, plasma AD levels were not correlated with either plasma NA or resting MAP. Thus, even though plasma AD is elevated in the hypertensive strains at an early age, it is not clear whether this increase contributes to the pathogenesis of hypertension. Â© 1994 Informa UK Ltd All rights reserved: reproduction in whole or part not permitted., 165309=In the present study, we compared the blood pressure in the SHR-SP and in the spontaneously hypertensive rat (SHR) after dietary administration of fish oil from 4 to 17 weeks of age. The retarding influence of dietary fish oils on the development of hypertension was prominent in the SHR (26 mmHg) and not evident in the SHR-SP (8 mmHg). The enhanced development of blood pressure in both the SHR and the SHR-SP is characterised by an elevated maximum contraction in the mesenteric vascular bed to sympathetic nerve stimulation and to injected noradrenaline. In SHR, but not SHR-SP, this maximum contraction was significantly attenuated by dietary fish oil. Likewise, acetylcholine mediated relaxation of the isolated aorta was enhanced in preparations from the SHR but not the SHR-SP. These physiological changes were also associated with a change in the total n-3 polyunsaturated fatty acids (PUFAs) content in vascular tissue, which were inversely proportional to the prevailing blood pressure values seen in all three strains of rat receiving dietary fish oils. Platelet activated thromboxane production was equally depressed in WKY (Wistar Kyoto), SHR and SHR-SP rats. The results indicate that the blood pressure lowering effect of fish oil when administered during the period of development of hypertension is much greater in the SHR than it is in the SHR-SP. Furthermore the lowering of blood pressure by fish oil administration is related to a restoration of normal vascular contraction and normal vascular relaxation, but not related to a suppression of serum thromboxane production. Â© 1994 Informa UK Ltd All rights reserved: reproduction in whole or part not permitted., 79413=Objectives: Excessive shortening of the telomeric ends of chromosomes is a marker of accelerated aging. Oxidative stress and nutritional deficiency may influence this process. The aim of this study was to investigate the effect of Â¿-3 polyunsaturated fatty acid (Â¿-3 PUFA) supplementation on telomeric shortening in elderly individuals with mild cognitive impairment (MCI). Methods: Thirty-three adults ages > 65 y with MCI were randomized to receive a supplement richÂ¿in the long-chain Â¿-3 PUFAs eicosapentaenoic acid (EPA; 1.67 g EPA + 0.16 g docosahexaenoic acid DHA/d; n = 12) or DHA (1.55 g DHA + 0.40 g EPA/d; n = 12), versus Â¿-6 PUFA linoleic acid (LA;Â¿2.2 g/d; n = 9) for 6 mo. Results: The intervention did not show an increase in telomere length with treatment and there was a trend toward telomere shortening during the intervention period. Linear mixed modeling produced a robust model although statistically underpowered. Telomere shortening was greatest in the LA group (d = 0.21) than in the DHA (d = 0.12) and EPA groups (d = 0.06). Increased erythrocyte DHA levels were associated with reduced telomere shortening (r = -0.67; P = 0.02) in the DHA group. Conclusion: Telomeric shortening may be attenuated by Â¿-3 PUFA supplementation, requiring further investigation in larger samples. Crown Copyright Â© 2013., 49835=OBJECTIVES:: To investigate whether obesity is associated with musculoskeletal pain in children. MATERIALS AND METHODS:: Obese (n=107) and healthy-weight (n=132) 10-to 13-year-old children (132 males, 107 females) participated in an observational case-control study. Children self-reported pain location (excluding abdominal pain), pain intensity (current and prior week), and pain prevalence (overall and lower limb) using the Pediatric Pain Questionnaire. Body composition was assessed (dual-energy x-ray absorptiometry) and children wore an accelerometer for 8 days. RESULTS:: After adjustment for accelerometry (weekly average counts per hour) and socioeconomic status, obese children had more intense pain (worst pain, P=0.006), pain in more locations (P=0.005), and a higher prevalence of lower limb pain (60% vs. 52% respectively, P=0.012) than healthy-weight children. Significant relationships were observed between body mass index and total pain locations (P=0.004, unadjusted and adjusted) and worst pain intensity (P=0.009, adjusted for socioeconomic status/accelerometry). There were no significant relationships between percent body fat and pain variables (unadjusted/adjusted analyses, P=0.262 to 1.0). DISCUSSION:: Obesity in children was associated with increased overall and lower limb musculoskeletal pain, for which body mass index was a stronger predictor than adiposity. Clinicians treating obese children should screen for pain and prescribe exercise programs that take their symptoms into account. Copyright Â© 2013 by Lippincott Williams & Wilkins., 158950=Na+ transport activity was measured in cheek cells from untreated hypertensive subjects and age-matched normotensive controls identified from a blood pressure screening program. Cheek cells were isolated by a simple mouth wash procedure and Na+ transport activity was measured as the proton-dependent uptake of 22Na+ using a rapid filtration assay. The rate of Na+ uptake was about 45% lower in hypertensive subjects and this difference persisted in a follow up study 2 years later involving those subjects who remained untreated for their hypertension. The proton independent Na+ uptake was also reduced by about 46% in the hypertensive group. The increase in the rate of cheek cell Na+ transport with increasing transcellular proton gradient values was also significantly lower in hypertensive subjects. The reduced cheek cell Na+ transport observed in hypertensive subjects may indicate decreased activity of the Na+/H+ antiporter and/or changes in the ion permeability properties of the cheek cell plasma membrane in the hypertensive state. This novel assay provides a biochemically based method for discriminating between normotensive and hypertensive subjects and makes use of tissue which can be obtained in a relatively non-invasive manner. Â© 1994 Informa UK Ltd All rights reserved: reproduction in whole or part not permitted., 69728=The aim of this study was to determine if changes in omega-3 polyunsaturated fatty acid status following tuna oil supplementation correlated with changes in scores of depression. A total of 95 volunteers receiving treatment for major depression were randomised to consume 8 Ã\u0097 1 g capsules per day of HiDHA (2 g DHA, 0.6 g EPA and 10 mg Vitamin E) or olive oil (placebo) for 16 weeks, whilst undergoing weekly counseling sessions by trained clinical psychologists using a standard empirically validated psychotherapy. Depression status was assessed using the 17 item Hamilton rating scale for depression and the Beck Depression Inventory by a psychodiagnostician who was blind to the treatment. Blood was taken at baseline and 16 weeks (n = 48) for measurement of erythrocyte fatty acids. With HiDHA supplementation, erythrocyte DHA content rose from 4.1 Â± 0.2 to 7.9 Â± 0.4 % (mean Â± SEM, p < 0.001) of total fatty acids but did not change (4.0 Â± 0.2 to 4.1 Â± 0.2 %) in the olive oil group. The mean changes in scores of depression did not differ significantly between the two groups (-12.2 Â± 2.1 for tuna oil and -14.4 Â± 2.3 for olive oil). However, analysis of covariance showed that in the fish oil group there was a significant correlation (r = -0.51) between the change in erythrocyte DHA and the change in scores of depression (p < 0.05). Further study of the relationship between DHA and depression is warranted. Â© 2013 AOCS., 193584=Eighty-eight untreated subjects (mean age 58.6 Â± 1.1 years; 73 males and 15 females) with diastolic blood pressure between 90 and 100 mmHg were recruited to the study. Subjects were seen fortnightly and after four pre-diet visits were randomised into a normal sodium intake group (44 subjects receiving > 80 mmol sodium daily in the diet plus 80 mmol of sodium supplement as eight slow release sodium chloride tablets daily) or a low sodium intake group (44 subjects receiving < 80 mmol sodium daily in the diet plus eight slow release sodium chloride placebo tablets daily). Eight weeks later, subjects crossed over to the alternate tablets while continuing with the reduced sodium diet for another period o f 8 weeks. The difference in urine sodium between the low sodium phase and the normal sodium phase was 67 2 4 mmol/day independent of the order in which the treatments were given: the corresponding difference in urine potassium excretion was 1.2 5 1.4 mmol/day and was not significant. The differences in systolic and diastolic blood pressures between the low sodium and normal sodium phases for all 88 subjects were 3.6 Â± 0.7 mmHg (95% confidence intervals 2.2-5.0) and 2.1 Â± 0.4 mmHg (95% confidence intervals 1.3-2.9) respectively, and were independent of the order in which treatments were given (p < 0.005). On the other hand, comparison of the blood pressures of the two cohorts of subjects as parallel groups during the first test phase revealed that the falls in pressure were greater by 5.3 Â± 1.4 (95% confidence intervals 2.7-8.1) mmHg (systolic) and 3.4 Â± 0.8 (95% confidence intervals 1.8-5.0) mmHg (diastolic) in subjects with low sodium intake compared with those with normal sodium intake. These differences in blood pressure reduction obtained by analysis of the crossover study and of the parallel group study were not significant, with clear overlap of the 95% confidence intervals. Moderate dietary salt restriction causes reductions in blood pressure and around 3.5-5.5 mmHg (systolic) and 2-3.5 mmHg (diastolic) of these falls can be attributed specifically to reduction o f sodium chloride intake. Â© 1989 Informa UK Ltd All rights reserved: reproduction in whole or part not permitted., 394117=Copyright 2015 CRICOS Provider Number 00109J The University of Newcastle, Australia, 73678=Background: We have previously demonstrated acute dose-dependent increases of flow-mediated dilatation (FMD) in the brachial artery after resveratrol consumption in mildly hypertensive, overweight/obese adults. Resveratrol supplementation has also been shown to increase cerebral blood flow acutely, without affecting cognition. Objectives: To evaluate the effects of chronic resveratrol supplementation on both FMD and cognitive performance. Method: Twenty-eight obese but otherwise healthy adults (BMI: 33.3Â±0.6kg/m 2) were randomized to take a single 75 mg capsule of trans-resveratrol (Resvida) or placebo daily for 6 weeks each in a double-blind crossover supplementation trial. Blood pressure, arterial compliance, FMD, and performance on the Stroop Color-Word Test were assessed at the end of each 6-week intervention period while fasted and at least 18 h after taking the last daily capsule. An additional capsule of the same supplement was then taken. FMD assessment was repeated 1 h later. Results: Chronic resveratrol supplementation for 6 weeks was well tolerated and resulted in a 23% increase in FMD compared with placebo (P = 0.021, paired t-test). The extent of increase correlated negatively with baseline FMD (r= -0.47, P=0.01). A single dose of resveratrol (75 mg) following chronic resveratrol supplementation resulted in a 35% greater acute FMD response than the equivalent placebo supplementation. These FMD improvements remained significant after adjusting for baseline FMD. Blood pressure, arterial compliance, and all components of the Stroop Color-Word Test were unaffected by chronic resveratrol supplementation. Conclusion: Daily resveratrol consumption was well tolerated and has the potential to maintain healthy circulatory function in obese adults. Â© 2013 Wolters Kluwer Health Lippincott Williams & Wilkins., 46619=Methotrexate (MTX) chemotherapy is known to cause bone loss which lacks specific preventative treatments, although clinically folinic acid is often used to reduce MTX toxicity in soft tissues. This study investigated damaging effects of MTX injections (0.75 mg/kg/day for 5 days) in rats and potential protective benefits of fish oil (0.25, 0.5, or 0.75 ml/100 g/day) in comparison to folinic acid (0.75 mg/kg) in the tibial metaphysis. MTX treatment significantly reduced height of primary spongiosa and volume of trabecular bone while reducing density of osteoblasts. Consistently, MTX reduced osteogenic differentiation but increased adipogenesis of bone marrow stromal cells, accompanied by lower mRNA expression of osteogenic transcription factors Runx2 and Osx, but an up-regulation of adipogenesis-related genes FABP4 and PPAR-Â¿. MTX also increased osteoclast density, bone marrow osteoclast formation, and mRNA expression of proinflammatory cytokines IL-1, IL-6, TNF-a, and RANKL/OPG ratio in bone. Fish oil (0.5 or 0.75 ml/100 g) or folinic acid supplementation preserved bone volume, osteoblast density, and osteogenic differentiation, and suppressed MTX-induced cytokine expression, osteoclastogenesis, and adipogenesis. Thus, fish oil at 0.5 ml/100 g or above is as effective as folinic acid in counteracting MTX-induced bone damage, conserving bone formation, suppressing resorption and marrow adiposity, suggesting its therapeutic potential in preventing bone loss during MTX chemotherapy. Â© 2013 Orthopaedic Research Society. Published by Wiley Periodicals, Inc. J Orthop Res 32:587-596, 2014. Â© 2013 Orthopaedic Research Society. Published by Wiley Periodicals, Inc., 40728=Objectives: Excessive shortening of the telomeric ends of chromosomes is a marker of accelerated aging. Oxidative stress and nutritional deficiency may influence this process. The aim of this study was to investigate the effect of Â¿-3 polyunsaturated fatty acid (Â¿-3 PUFA) supplementation on telomeric shortening in elderly individuals with mild cognitive impairment (MCI). Methods: Thirty-three adults ages > 65 y with MCI were randomized to receive a supplement rich in the long-chain Â¿-3 PUFAs eicosapentaenoic acid (EPA; 1.67 g EPA + 0.16 g docosahexaenoic acid DHA/d; n = 12) or DHA (1.55 g DHA + 0.40 g EPA/d; n = 12), versus Â¿-6 PUFA linoleic acid (LA; 2.2 g/d; n = 9) for 6 mo. Results: The intervention did not show an increase in telomere length with treatment and there was a trend toward telomere shortening during the intervention period. Linear mixed modeling produced a robust model although statistically underpowered. Telomere shortening was greatest in the LA group (d = 0.21) than in the DHA (d = 0.12) and EPA groups (d = 0.06). Increased erythrocyte DHA levels were associated with reduced telomere shortening (r = -0.67; P = 0.02) in the DHA group. Conclusion: Telomeric shortening may be attenuated by Â¿-3 PUFA supplementation, requiring further investigation in larger samples. Â© 2014.}", "textBeforeTable": "Fields of Research Pathophysiology Omega-3 Fatty Acids Nutrients and Metabolism Mental Health Human Nutrition Cardiovascular and metabolic health Cardiorespiratory Physiology Bioactive nutrients Keywords Master of Science, University of Oxford - UK Bachelor of Science, University of Sydney PhD, Monash University Qualifications Peter has held several significant leadership roles in collaborative research concentrations at Australian universities and is currently Director of the Clinical Nutrition Research Centre (CNRC), a collaborative initiative between research concentrations at University of Newcastle, University of South Australia and Swinburne University of Technology. He previously founded the following research collaborations: Smart Foods Centre (an ARC Key Centre of Teaching and Research at the University of Wollongong); Nutritional Physiology Research Centre, University of South Australia; ATN Centre for Metabolic Fitness Peter has also built strategic alliances with both primary producers and food manufacturers to develop healthier foods and he convenes the Annual Industry Forum for Nutrition Research. He has also worked as a consultant with many organisations including Food Standards Australia New Zealand and the Australian Food & Grocery Council. Collaborations Peter was the inaugural Director of the Smart Foods Centre at the University of Wollongong (1999) and founded and directed the Nutritional Physiology Research Centre at the University of South Australia (2003-2009). He was also Director and Chair of Executive Committee for the Australian Technology Network Centre for", "textAfterTable": "1/06/2005 -  Research Professor University of South Australia Nutritional Physiology Australia 1/01/2001 -  Membership - Nutrition Australia Nutrition Australia Australia 1/01/1998 - 31/12/2000 Membership - Australasian Clinical Research Network (Management Committee) Australasian Clinical Research Network (Management Committee) Australia 1/01/1997 -  Membership - American Oil Chemists Society (Australasian Chapter) American Oil Chemists Society (Australasian Chapter) United States 1/01/1995 -  Membership - International Society for the Study of Fatty Acids & Lipids International Society for the Study of Fatty Acids & Lipids Australia 1/01/1986 -  Membership - International Society of Hypertension International Society of Hypertension Australia 1/01/1984 -  Fellow - Nutrition Society of Australia Nutrition Society of Australia Australia 1/01/1980 -  Membership - High Blood Pressure Research Council of Australia High Blood Pressure Research Council of Australia Australia Invitations Keynote Speaker Year Title / Rationale 2011 Nutrients and Circulatory Function Organisation: Food Industry Forum for Nutrition Research Participant Year Title / Rationale 2014 5th International Conference on Natural Products for Health and Beauty Organisation: Phuket, May Description: . 2014 8th Congress, International Society for Nutrigenetics & Nutrigenomics Organisation: Gold Coast, May Description: . 2013 Omega-3 Symposium & AAOCS Biennial Workshop Organisation: Newcastle, November Description: . 2012 Vasoactive", "hasKeyColumn": false, "keyColumnIndex": -1, "headerRowIndex": 0}