{"relation": [["Time", "7:30", "8:30", "11:00", "11:30", "1:00", "2:00", "3:30", "4:00", "6:00"], ["Activity / Session", "breakfast (provided)", "Getting Acquainted and Setting the Stage Welcome; Introductions Ian Fette, Norman Sadeh, Lorrie Cranor; Carnegie Mellon University: Web Security Requirements: A Phishing Perspective (slides) Dieter Bartl and Matthias Stoffel; SIZ: Optimising authentication features in the web browser (slides) Chuck Wade; FSTC: Financial Industry Requirements for Better Mutual Authentication (slides)", "break", "General Requirements and Problem Analysis Jeffrey Nelson, David Jeske; Google, Inc: Limits to Anti-Phishing (slides) Drew Dean; Yahoo!, Inc: Authentication for web services (slides) Robert W Capps II; World Savings Bank: Digital Authentication for an Analog World: Why Authentication Processes Fail and How Do We Fix Them (slides)", "lunch (provided)", "Candidate Technologies I: Metadata. Phil Archer; ICRA: The QUATRO approach to Transparency and Usability of Web Authentication (slides) Mary Ellen Zurko, Dave Wilson; IBM: Using History, Collaboration, and Transparency to Provide Security (slides) Kenneth Wright II; World Savings Bank: Position paper (slides)", "break", "Candidate Technologies II: Chrome. Tyler Close; HP: Petname Tool: Enabling web site recognition using the existing SSL infrastructure (slides) Amir Herzberg; Bar Ilan University: Protecting Web Users from Malicious Content and Sites (slides) Sebastian Gajek and Ahmad-Reza Sadeghi; Ruhr University Bochum: Client Authentication in Federations Using a Security Mode (slides) Phillip Hallam-Baker; VeriSign Inc: Secure Internet Letterhead (slides)", "End of Day (dinner not provided)"]], "pageTitle": "Program", "title": "", "url": "http://www.w3.org/2005/Security/usability-ws/program", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989178.64/warc/CC-MAIN-20150728002309-00019-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 831284101, "recordOffset": 831275899, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{9686=$Id: program.html,v 1.24 2006/04/21 23:06:48 roessler Exp $}", "lastModified": "Fri, 21 Apr 2006 23:06:48 GMT", "textBeforeTable": "Day 1 (Wednesday, 15 March 2006) See also the list of all accepted papers. See: Workshop Site Workshop Program Toward a More Secure Web - W3C Workshop on Usability and Transparency of Web Authentication", "textAfterTable": "Day 2 (Thursday, 16 March 2006) Time Activity / Session 7:30 breakfast (provided) 8:30 Candidate Technologies III: Protocols. Prasanta Behera, Naveen Agarwal; Yahoo, Inc: A confidence model for web browsing (slides) Frederick Hirsch and Hubert A. Le Van Gong; Nokia and Sun: Approaches to Simplify Server Authentication (slides) Andy Ozment and Stuart E. Schechter and Rachna Dhamija; MIT Lincoln Laboratory (AO, SES) and Harvard University (RD): Web Sites Should Not Need to Rely On Users to Secure Communications (slides) John Linn, Burt Kaliski, Moti Yung, Magnus Nyström; RSA Laboratories (JL, BK, MY) and RSA Security Inc. (MN): Applying Context to Web Authentication (slides) 10:30 break 11:00 Candidate Technologies IV: Identity. John Merrells and Dick Hardt; SXIP Identity: Position Paper for the W3C Workshop on Transparency and Usability of Web Authentication (slides) Kaliya Hamlin, Phillip J. Windley, Aldo Castaneda; Identity Woman & Identity Commons (KH), Brigham Young University (PJW), The Story of Digital Identity (AC): Identity Rights Agreements and Provider Reputation. Identity Commons Position Paper. (slides) Michael B. Jones; Microsoft Corporation: The Identity Metasystem: A User-Centric, Inclusive Web Authentication Solution (slides) 12:30 lunch (provided) 1:30 Candidate Technologies V: Browsers. George Staikos; KDE:", "hasKeyColumn": false, "keyColumnIndex": -1, "headerRowIndex": 0}