{"relation": [["", "1", "2", "3", "4", "5", "6", "7", "8", "9", "10"], ["Track Listing", "Boogie Is My Name", "My New next Door Neighbor", "Big Butt Sara", "Potato Patch", "House Party Boogie", "Short Skirt and Big Legs", "Lowdown Dirty Rat", "Jimmyroll", "Cry'n Won't Do No Good", "Demons of the Body"]], "pageTitle": "Music Maker Relief Foundation", "title": "", "url": "https://shop.musicmaker.org/products/47-boogie-is-my-name", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988250.59/warc/CC-MAIN-20150728002308-00238-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 885662176, "recordOffset": 885653974, "tableOrientation": "HORIZONTAL", "TableContextTimeStampBeforeTable": "{1097=I have been friends with Jerry ever since I went to visit him at his home in Gadsden, Alabama in 1995. During that visit, we recorded an acoustic CD which we released a few years ago. In 1999 I arranged a CD deal for Jerry that was produced by the legendary Mike Vernon with guests such as Jonnie Johnson, Jimmie Vaughn and others. Unfortunately, the label Cello soon went out of business after the CD's release in 1991. That was a very difficult time for Jerry. Since that incident, Jerry has grown extremely skeptical about recording and has traveled less and less to perform., 502=Drummer/producer Ardie Dean and I have been encouraging Jerry to keep recording his songs as he keeps on writing them (and cracking us up singing them to us on the phone). So earlier this summer, Ardie and Greg \"Boom\" Rowell got Jerry in the studio and made yet another magnificent Jerry \"Boogie\" McCain release. Jerry lets the world know that yes there is still real blues being written and recorded in 2003. Hats off to this grand master! -Tim Duffy}", "TableContextTimeStampAfterTable": "{6975=© 2012 Music Maker Relief Foundation, Inc..}", "textBeforeTable": "Drummer/producer Ardie Dean and I have been encouraging Jerry to keep recording his songs as he keeps on writing them (and cracking us up singing them to us on the phone). So earlier this summer, Ardie and Greg \"Boom\" Rowell got Jerry in the studio and made yet another magnificent Jerry \"Boogie\" McCain release. Jerry lets the world know that yes there is still real blues being written and recorded in 2003. Hats off to this grand master! -Tim Duffy I have been friends with Jerry ever since I went to visit him at his home in Gadsden, Alabama in 1995. During that visit, we recorded an acoustic CD which we released a few years ago. In 1999 I arranged a CD deal for Jerry that was produced by the legendary Mike Vernon with guests such as Jonnie Johnson, Jimmie Vaughn and others. Unfortunately, the label Cello soon went out of business after the CD's release in 1991. That was a very difficult time for Jerry. Since that incident, Jerry has grown extremely skeptical about recording and has traveled less and less to perform. McCain, a brilliant man who writes hilarious songs, has been recording since the '50s on a host of legendary Southern record labels such as Excello and Trumpet. \"Jerry 'Boogie' McCain is among the greatest post war American harp players.\" -Tim Duffy, MMRF President iTunes Add to Shopping Bag", "textAfterTable": "See How You Can Help » Shop Now » You May Also Like Give Us A Shout Business: Music Maker Relief Foundation PO Box 1358 Hillsborough, NC  27278 Physical 224 West Corbin Street Hillsborough, NC  27278 Phone (919) 643-2456 Fax (888) 238-8592 General Information info@musicmaker.org Booking booking@musicmaker.org Radio Servicing aaron@musicmaker.org Development corinne@musicmaker.org Media Contact", "hasKeyColumn": true, "keyColumnIndex": 1, "headerRowIndex": 0}