{"relation": [["Solution", "Enterprise File Sync and Share", "User File Sharing", "Home Directory Consolidation", "Compliance Archiving", "Microsoft Hyper-V", "Microsoft SQL Server", "Hybrid Cloud Backup"], ["Description", "Gain control over your employees’ data. HP StoreEasy with included Microsoft® Work Folders and optional Citrix ShareFile enables users to securely access their data stored on-premise under IT control from anywhere at anytime. Deploying Work Folders in HP StoreEasy 1000 and 3000 (PDF, 884 KB)", "Facilitate user collaboration behind your firewall. HP StoreEasy delivers simple yet sophisticated multi-protocol file access over SMB and NFS, so users can share files regardless of their computer’s operating system. Heterogeneous file sharing on HP StoreEasy Storage White Paper (PDF, 694 KB)", "Empower users while increasing security and control by consolidating home directories. With rich features including folder redirection, offline files, and roaming user profiles, HP StoreEasy makes storing user data in a centralized location rather than on user controlled devices a snap. Data Consolidation Best Practices White Paper (PDF, 397 KB)", "Preserve your data with iTernity Compliant Archive Software (iCAS). Sitting between over 70 different business applications and HP StoreEasy, iCAS prevents your data from being manipulated or deleted. Your key to legally compliant data archiving (PDF, 590 KB)", "Get the storage reliability and performance you need for your virtualied environment with Microsoft Hyper-V and HP StoreEasy Storage. Using an optimized and integrated combination of software capabilities, this solution lets you adapt to your rapidly changing needs. Virtualization best practices using Hyper-V and HP StoreEasy Storage (PDF, 153 KB)", "Improve the performance and reliability of SQL Server with HP StoreEasy Storage. With your SQL Server database stored on SMB 3.0 File Share on StoreEasy, you benefit from the combined throughput of all network adapters and can transparently fall back to the remaining network adapters should one component fail. HP StoreEasy Storage Performance Best Practice Guidelines for SQL (PDF, 159 KB)", "Backup data on-premise and in the cloud with HP LiveVault powered by HP StoreEasy. Now including TurboRestore Appliance installation software, it is even easier to deploy StoreEasy as an onsite turnkey backup appliance within LiveVault’s secure cloud and hybrid cloud data protection solution. ESG: HP Helps SMBs to Protect Their Data and Keep Their Businesses Safe (PDF, 592 KB)"]], "pageTitle": "HP StoreEasy Storage | HP® Hong Kong", "title": "", "url": "http://www8.hp.com/hk/en/products/data-storage/storeeasy.html", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 1, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438044160065.87/warc/CC-MAIN-20150728004240-00229-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 857177711, "recordOffset": 857154016, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{91743=Gain control over your employees’ data. HP StoreEasy with included Microsoft® Work Folders and optional Citrix ShareFile enables users to securely access their data stored on-premise under IT control from anywhere at anytime. Deploying Work Folders in HP StoreEasy 1000 and 3000 (PDF, 884 KB), 122213=© 2015 Hewlett-Packard Development Company, L.P., 78564=HP StoreEasy 1000 Storage}", "lastModified": "Wed, 05 Aug 2015 10:47:20 GMT", "textBeforeTable": "What are you looking for? HP StoreEasy data sheet What’s new? Complete refresh of HP StoreEasy Storage family, now with factory-included HP LiveVault TurboRestore Appliance and Vision Solutions Double-Take Availability installation software Focus on your business, not your file storage HP StoreEasy Storage is the #1 NAS product family under $15K USD range in units.1 Count on optimized, efficient, secure and highly available storage that simply addresses file and application storage challenges, no matter the size of your business. Straightforward features and new enhancements mean simpler installation and monitoring of utilization and health status.  ", "textAfterTable": "Why choose HP StoreEasy Storage? Optimized—tailored for file storage with pre-configured hardware and OS, installation wizards, best practices-driven provisioning tool Efficient—save money and time as you file sync and share from anywhere, plus non-intrusive sub-file deduplication Secure—keep data protected always with built-in encryption, sophisticated access controls, and onboard antivirus and backup software  Highly available—prevent business and user disruption with continuous health monitoring, online self-healing and maintenance Companion Products Backup your HP StoreEasy to cloud with HP LiveVault. You can manage data protection, long-term retention, and improve your disaster recovery readiness in a secure cloud storage grid with 24x7 monitoring. Find out more about free 30-day trial", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}