{"relation": [["Seasons", "Christmas", "Winter White Sale", "Winter", "Spring Break", "Spring/Summer/Fall"], ["Season Dates", "12/21-1/2", "12/11-20, 1/3-1/31, 3/20-27", "2/1-3/11", "3/12-3/19", "3/27-12/9"], ["Rates", "$295.00", "$220.00", "$240.00", "$295.00", "$109.00"]], "pageTitle": "Resort Properties of AngelFire", "title": "", "url": "http://www.resortpropertiesofangelfire.com/details.php?lid=124", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 1, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988311.72/warc/CC-MAIN-20150728002308-00068-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 678854214, "recordOffset": 678846012, "tableOrientation": "HORIZONTAL", "TableContextTimeStampBeforeTable": "{2543=800-338-2589 575-377-6441}", "TableContextTimeStampAfterTable": "{3192=Holiday reservations must be paid in full 30 days in advance of arrival. Cancellations for all holiday periods require 30 days notice prior to date of arrival and 15 days notice in advance of arrival on all other reservations. Holiday time frame includes Christmas and Spring Break dates. Minimum stay December 21 - January 2 and March 12 - 19 is 3 nights. Minimum stay all other times is 2 nights. All one night stays must be approved. All rates subject to change without notice, except those guaranteed with advance deposit. A one time $25 booking fee will be added to all reservations as well as clean fee plus tax.}", "textBeforeTable": "Facilities   Cedars #6 - 2 bedroom/2 bath - Sleeps 4 Located only 4 blocks from the slopes this unit features a gas fireplace, w/d, tv, vcr and dvd player.  This unit has 1 queen bed and 2 twin beds. Cedars #6 Description Cedars #6 Condos 52 N. Angel Fire Rd., Suite 7 P.O. Box 829 Angel Fire, NM 87710 Resort Properties of Angel Fire rentals@angelfirenewmexico.us 800-338-2589 575-377-6441 Contact Us --> Owner Login Links Before You Visit Maps & Policies Event Calendar Owning in Angel Fire Property Management Long Term Rentals Search Check Availability All Homes Condos Vacation Rentals Home Page", "textAfterTable": "Christmas 12/21-1/2 $295.00 Winter White Sale 12/11-20, 1/3-1/31, 3/20-27 $220.00 Winter 2/1-3/11 $240.00 Spring Break 3/12-3/19 $295.00 Spring/Summer/Fall 3/27-12/9 $109.00 Additional items that will be added to total Package: Condo Booking Fees Cleaning Rate $26.83 $70.50 The rate below is for Long Term Rentals Package: Condo Season Dates Weekly Rates Monthly Rates $693.00 $1500.00 Select Reservation Dates Loading... Daily Lodging Rate Policies 50% DEPOSIT REQUIRED TO CONFIRM RESERVATIONS. REMAINING BALANCES ARE DUE IN FULL 30 DAYS PRIOR TO ARRIVAL DATE ON ALL HOLIDAY RESERVATIONS AND 15 DAYS PRIOR TO ARRIVAL DATE DURING ALL OTHER TIMES. Holiday reservations must be paid in full 30 days in advance of arrival. Cancellations for all holiday periods require 30 days notice prior to date of arrival and 15 days notice in advance of arrival on all other reservations. Holiday time frame includes Christmas and Spring Break dates. Minimum stay December 21 - January 2 and March 12 - 19 is 3 nights. Minimum stay all other times is 2 nights. All one night", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}