{"relation": [["ESL e-Write Analytic Score Domains", "Development: the reasons, examples, and details that are used to support the stated or implied position", "Focus: the clarity and consistency with which the main idea(s) or point of view is maintained", "Organization: the clear, logical sequencing of ideas and the use of effective transitional devices to show relationships among ideas", "Language Use: variety and correctness of sentence structures and word choices, and control of grammar and usage (e.g., word order, word forms, verb tense and agreement)", "Mechanics: errors in spelling, capitalization, and punctuation in relation to meaning", "Overall Score"], ["ESL e-Write Analytic Score Weights", "35%", "10%", "15%", "35%", "5%", "100%"]], "pageTitle": "ACT Compass® | Score Scale for ESL Essay Test (e-Write) | ACT", "title": "", "url": "http://act.org/compass/tests/scale_esl.html", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 5, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988311.72/warc/CC-MAIN-20150728002308-00315-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 2713281, "recordOffset": 2705192, "tableOrientation": "HORIZONTAL", "textBeforeTable": "Score Scale for ESL Essay Test (e-Write)   Contact Us Resources Reporting English as a Second Language Mathematics Writing Essay Writing Skills Reading Tests Features and Benefits For Technical Staff For Test Administrators For Students Home ACT Compass® Search ABOUT ACT RESEARCH & POLICY PRODUCTS SOLUTIONS Careers News Contact Us -->", "textAfterTable": "Score Focus Domain Description 1 Focus cannot be judged due to the brevity of the response. 2 Focus may be difficult to judge due to the brevity of the response; any digressions generally do not lead back to the task. 3 Focus is usually maintained on the main idea(s); any digressions usually lead back to the task. 4 Focus is adequately maintained on the main idea(s); any minor digressions lead back to the task. 5 Focus is maintained clearly on the main idea(s). 6 A sharp focus is maintained consistently on the main idea(s). Score Organization Domain Description 1 Little or no organizational structure is apparent. 2 The essay shows an understanding of the need for organization. Transitional words are rarely if ever used. There is minimal evidence of a beginning, middle and end to the essay. 3 Some organization may be evident. Transitions, if used, are generally simple and predictable. The introduction and conclusion, if present, may be undeveloped. 4 The essay demonstrates little evidence of the logical sequencing of ideas, but there is an adequate organizational structure and some transitions are used. There is an underdeveloped introduction and there may be no conclusion. 5 The essay demonstrates sequencing of ideas that is mostly logical, and appropriate", "hasKeyColumn": false, "keyColumnIndex": -1, "headerRowIndex": 0}