{"relation": [["Opening days", "Lunch", "Dinner"], ["Mon", "closed", "open"], ["Tue", "closed", "open"], ["Wed", "closed", "open"], ["Thu", "closed", "open"], ["Fri", "closed", "open"], ["Sat", "closed", "open"], ["Sun", "closed", "open"]], "pageTitle": "Economic hotel PORTO ALEGRE - ibis Porto Alegre Aeroporto", "title": "", "url": "http://www.ibis.com/gb/hotel-5670-ibis-porto-alegre-aeroporto/index.shtml", "hasHeader": true, "headerPosition": "FIRST_COLUMN", "tableType": "RELATION", "tableNum": 1, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042981856.5/warc/CC-MAIN-20150728002301-00242-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 516433871, "recordOffset": 516411981, "tableOrientation": "VERTICAL", "TableContextTimeStampAfterTable": "{7778=Opening hours : 19:00 - 22:30, 37637=©ibis.com 2015}", "textBeforeTable": "Opening hours : 19:00 - 22:30 Type of cuisine : International Air conditioning LA TABLE Catering of the ibis Porto Alegre Aeroporto hotel Start your day well! The breakfast buffet of ibis hotels has delicious options for all tastes, including breads, cookies, cold cut, cereals, fruits, cakes, jams, honey, yogurt, juices, scrambled eggs, milk, coffee, tea and chocolate. All-you-can-eat breakfast buffet Breakfast of the ibis Porto Alegre Aeroporto hotel Catering > Breakfast > Quality Labels Other Services Shopping and services Internet connectivity Fax machine Business services in hotel Wi-Fi in the communal areas 3 WIFI access 3 Wi-Fi in your room 3 Wi-Fi at the hotel 3 Multimedia access Info and business services Reduced mobility rooms: 3 Wheelchair access Facilities for disabled Private outdoor parking 2 Private indoor parking 2 Public outdoor parking 3 Parking", "textAfterTable": "The right choice to feel good. The conviviality of a buffet showcasing traditional dishes. A simple way to share. BAR Opening hours : 24 H Opening days Mon Tue Wed Thu Fri Sat Sun Midday open open open open open open open Evening open open open open open open open The Bar: a friendly place to get together at any time of day. Meetings and Seminars > Sustainable development > Meeting rooms at the ibis Porto Alegre Aeroporto hotel Room capacity according to layout Room name Theatre U-shape Boardroom Classroom Banquet Height Surface GARIBALDI 40 20 0 20 0 3.50 m 40 m² Equipment available on request Audio and video equipment WIFI access Number of meeting rooms Sustainable development PLANET 21 is our 21 commitments to sustainable", "hasKeyColumn": false, "keyColumnIndex": -1, "headerRowIndex": 0}