{"relation": [["Service", "Water/sewer", "Power (elec)", "Garbage", "Fire", "Police", "Medical", "Schools", "Library", "Arts", "Roads", "County"], ["Provider", "Olympic View Water District", "SnoCo PUD", "Rabanco", "Fire District No 01", "SnoCo Sheriff", "STEVENS MEMORIAL HOSPITAL", "EDMONDS SCHOOL DISTRICT NO 15", "SNOISLE REGIONAL LIBRARY", "S SNO CO ARTS STAD CENTER", "SNOHOMISH COUNTY - ROAD", "SNOHOMISH COUNTY - CNT"], ["Esperance pays", "direct bill", "direct bill", "direct bill", "tax", "tax", "tax", "tax", "tax", "tax", "tax", "tax"]], "pageTitle": "Politics: Esperance Annexation", "title": "", "url": "http://www.seanet.com/~hgg9140/politics/esperance/index.html", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 1, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989507.42/warc/CC-MAIN-20150728002309-00052-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 707809840, "recordOffset": 707795359, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{3097=The comment period closes August 12. Please let him know you opinion. Given the deadline, email is best., 10073=Bill Sheets. \"City talking annexation of Esperance area\". Edmonds Enterprise. Friday, April 02, 2004, 16081=Here was the Edmonds City Council's view of the situation in 2003 (when they were facing a budget shortfall for 2004). Administrative Services Director Dan Clements explained the 2004 budget..., 20653=2005-06-11: Gary Nelson (3rd District County Council rep) confirmed to M. Luke that the COunty would not initiate annexation and was not encouraging the City to make that move. He did say they'd probably endorse it if it came up., 18419=(NOTE: By waiting over a year to leverage the 2004 presidential race, Edmonds enhanced the difficulty of the 15% requirement.), 12173=A typical Esperance home is paying $12.60 per $1000 in taxes. Apparently we are not freeloaders. And of course we pay direct utility bills as well. The services include:, 18554=2005-01-06: I've just heard that we may need to be present at the meeting in which the annexation resolution is passed, in order to contest it and start the 45 day clock., 16764=(emphasis added) http://www.ci.edmonds.wa.us/CityCouncil/CouncilArchives/2003/11/cm031108.htm, 8688=Bill Sheets. Everett Herald, Nov 21, 2004 (http://www.heraldnet.com/stories/04/11/21/loc_annex001.cfm, 26078=For the same reason radio antennas are an issue up on the Esperance ridgeline, cell phone companies want to place towers in the area. And, because each company wants its own tower, we could potentially get an overlapping forest of towers. For example, a 150 foot cell tower is proposed for the Shurgard storage facility on Highway 99, overshadowing Esperance. THere is a hearing at Edmonds City Council meeting room, Wed Feb 2, 7:00PM., 17577=In 2003 state annexation law was changed to simplify annexation of areas fully surrounded by cities. Edmonds now has two legal approaches available:, 25874=See City Council, February 17, 2004 minutes, 7727=Bill Sheets \"City talking annexation of Esperance area\" Edmonds Enterprise, Friday April 02, 2004., 10790=2005-06-21: R. Marin's questions about annexing just the Highway 99 strip indicate the concept map isn't entirely dead., 15188=2005-06-14: I've just heard that council members consider the enforcement vigorous and appropriate, and that in the final settlement there was no limit on tree height. I'll try to follow up, but that doesn't change the tenor of the meeting last year. I'd prefer a council which looked the developer square in the eye and said, \"You broke the rules; you lose the permit. When the trees have regrown we'll talk again.\", 8274=...In early 2005, residents again will have to vote against annexation to keep it from happening. Edmonds plans to act under a new state law that allows cities to annex unincorporated \"islands\" without requiring approval from the people who live in the area., 5965=Community open house on March 3 at Esperance Baptist Church, 7812 224th St SW, from 7-9 PM., 10441=2005-05-27: Edmonds planners have told us the map is out of date. It was on the website when we went to the initial meetings this time around. An Edmonds businees has recently tried to get a chunk of that residential area rezoned business. It would be fair to say the map represents a likely future if Esperance folks were not pushing back., 11124=2005-05-25: The hot rezoning issue right now is the County plan, which marks a residential area in Chapel as business. There is a petition in process to get this error fixed., 20043=Yes you can vote. The 2004 general election turnout will just set the number of signatures needed to validate a petition. If you are a registered voter in the Esperance area, you can sign petitions and vote in elections., 17381=Michael Plunkett, President Edmonds City Council. Edmonds Beacon, pg 4. December 9, 2004., 8558=City officials will begin proceedings in January, and the unincorporated area could join Edmonds as soon as April.}", "lastModified": "Sat, 06 Aug 2005 00:01:10 GMT", "textBeforeTable": "A typical Esperance home is paying $12.60 per $1000 in taxes. Apparently we are not freeloaders. And of course we pay direct utility bills as well. The services include: http://www1.co.snohomish.wa.us/Departments/Assessor/Services/FAQ/Taxes.htm The average 2002 tax rate in Snohomish County is about $13.46 per $1000 of assessed valuation. Rates vary from area to area and from year to year, but multiplying the number of thousands of dollars of price or cost by 13.46 will provide a rough estimate of taxes. Tax rates ranged from a low of $9.27 to a high of $15.70 depending on where you live in the county. At http://www.ci.edmonds.wa.us/codes.stm, you find the concept_map, which already has chunks of Esperance sliced off for business development. 2005-05-27: Edmonds planners have told us the map is out of date. It was on the website when we went to the initial meetings this time around. An Edmonds businees has recently tried to get a chunk of that residential area rezoned business. It would be fair to say the map represents a likely future if Esperance folks were not pushing back. 2005-06-21: R. Marin's questions about annexing just the Highway 99 strip indicate the concept map isn't entirely dead. 3.2. Hypothesis: Edmonds wants to rezone single family homes into commercial property. As I understand it, Edmonds assures us they will zone as the County zones. 2005-05-25: The hot rezoning issue right now is the County plan, which", "textAfterTable": "Many of us also support small businesses, and have shopped in downtown Edmonds for decades. We pay to use Francis Anderson Center facilities. We attend school events (and pay same as everyone else). What exactly would Edmonds provide beyond these services? The press releases mention enhanced parks. Where was that to occur? There is one existing park: Chase Lake. There is a candidate park (Esperance Elementary). What is Edmonds's record on that? Esperance citizens who protected Chase Lake are not convinced Edmonds was on the side of the environment. Further, this is the same city council that accepted clearcutting of the slope above Marina Park. Sure, there were penalties and some replanting. But the project wasn't stopped in its tracks until the trees regrew. The hillside is still ugly and bare. 2005-06-14: I've just heard that council members consider the enforcement vigorous and appropriate, and that in the final settlement there was no limit on tree height. I'll try to follow up, but that doesn't change the tenor of the meeting last year. I'd prefer a council which looked the developer square in the eye and said, \"You broke the rules; you lose the permit. When the trees have regrown we'll talk again.\" This track record raises concern that any new parks would be a token bribe so we would let most of the undeveloped land be turned into another business park. 3.4. Hypothesis: Edmonds wants a net increase in revenues", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}