{"relation": [["Strength:", "Intelligence:", "Speed:", "Endurance:", "Rank:", "Courage:", "Firepower:", "Skill:", "Total:"], ["8.0", "8.0", "9.0", "9.0", "9.0", "9.0", "6.0", "8.0", "66"]], "pageTitle": "Soundwave - Cybertron, Galaxy Force - Transformers", "title": "", "url": "http://www.seibertron.com/vsd/character/soundwave/3259/", "hasHeader": true, "headerPosition": "NONE", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988312.76/warc/CC-MAIN-20150728002308-00070-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 693450967, "recordOffset": 693430943, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{54193=18,111 pages were recently viewed by 879 unique visitors. This page loaded in 0.61119 seconds and was viewed 1 times on Friday, July 31st 2015 4:54pm CDT}", "lastModified": "Thu, 19 Sep 2013 01:04:25 GMT", "textBeforeTable": "He is known by many names, though Soundwave is his most well-known one, and the one that inspires fear in Autobot and Decepticon alike. One of the mightiest, most straightforward warriors from Planet X, Soundwave is nonetheless a devastatingly subtle plotter. He prefers not to stab his victims in the back only because he enjoys seeing the look of betrayal in their eyes. Highly skilled in the techniques of espionage, he never enters battle without the knowledge he needs to win. Kis companion Laserbeak - equipped with a cloaking device - is able to infiltrate even the most well-guarded facilities. Tech Specs [ Back To Top ] Product Images Voyager Class Subgroup: Decepticon Faction: Galaxy Force Cybertron, Series: Cartoon Appearances Comic Appearances, Product Images, Transformers Universe, Tech Spec, Jump to: Soundwave Sightings VSD", "textAfterTable": "[ Back To Top ] Marvel's Transformers Universe Profile Profile: Soundwave remembers the glory of Planet X, the great destiny meant for its people. He remembers the shining steel plains of the hypergas foundries, the soaring domes of the cities, the blazing cones and glittering clusters of giant thrusters and prodigious planet-busting weaponry. He remembers those who fell before its might, whole worlds subjugated and made slaves, moons and stars carved to pieces and fed into the vast World Furnaces that powered his home. But most of all, he remembers the bright and blazing star it became in the moment before its destruction, consumed by its own energies, and all because of the resistance of Gigantion. Before the radioactive cloud of vapor that had been Planet X had even ceased tainting the Giant Planet sunrise, Soundwave and the other survivors were plotting their revenge. Their sunless slave worlds were in rebellion, and they were too few to retake even one. The vast knowledge base of Planet X had been lost forever, but some few among the survivors were scholars. They pooled their knowledge to determine what they had might serve to deal with the Giant Planet as their world have been dealt with. The learning of Planet X ran deep, especially in matters of conquest and destruction. Among their surviving lore they found common threads of the story of an ancient power; a", "hasKeyColumn": false, "keyColumnIndex": -1, "headerRowIndex": 0}