{
    "relation": [
        [
            "Cited Patent",
            "US3388318 *",
            "US3460121 *",
            "US3503261 *",
            "US3560948 *",
            "US3597676 *",
            "US3684924 *",
            "US3757195 *",
            "US3797008 *"
        ],
        [
            "Filing date",
            "Jul 30, 1963",
            "Oct 24, 1965",
            "Nov 1, 1967",
            "Dec 17, 1968",
            "Jun 5, 1969",
            "Sep 10, 1971",
            "Aug 11, 1972",
            "Jan 21, 1972"
        ],
        [
            "Publication date",
            "Jun 11, 1968",
            "Aug 5, 1969",
            "Mar 31, 1970",
            "Feb 2, 1971",
            "Aug 3, 1971",
            "Aug 15, 1972",
            "Sep 4, 1973",
            "Mar 12, 1974"
        ],
        [
            "Applicant",
            "Onnetics Inc",
            "Berkeley Scient Lab",
            "Fischer & Porter Co",
            "Hitachi Ltd",
            "Hercules Inc",
            "Westinghouse Electric Corp",
            "Honeywell Inc",
            "Nittan Co Ltd"
        ],
        [
            "Title",
            "Hall effect constant power regulator",
            "Signalling and communication system",
            "Resistance to current converter",
            "Signal telemetering system using pair transmission lines",
            "Thermistor circuit for use in an angular movement sensing device",
            "Electrical system with energy barrier",
            "Isolated two wire signal transmitter",
            "Fire detecting system"
        ]
    ],
    "pageTitle": "Patent US4016480 - Dual function coupling system and method - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US4016480?ie=ISO-8859-1",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 5,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987628.47/warc/CC-MAIN-20150728002307-00301-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 470414971,
    "recordOffset": 470393421,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Patent Citations What has been described is a method and apparatus for coupling an additional signal to an integrated circuit having a voltage regulator. While particular embodiments of the invention have been shown and described, it will be obvious to those skilled in the art that changes and modifications may be made without departing from the invention in its broader aspects and, therefore, the aim in the appended claims is to cover all such changes and modifications as fall within the true spirit and scope of the invention. Signal means 13' couples a positive going signal voltage (indicated by waveform 50) via capacitors 54 and 57 and resistor 56 to load 16 and, in the manner described above, conduction in transistor 60 is increased such that the voltage at load 16 remains substantially constant. This increased conduction also results in an increased voltage across resistor 64. Detecting means 12' comprises a transistor 80 having an emitter 81 coupled to terminal 15, a base 82 coupled to collector 63 of transistor 60 and a collector 83 coupled to ground via a resistor 84. The emitter-base voltage of transistor 80 is established by the collector current of transistor 60 flowing through resistor 64. Under normal conditions transistor 80 is non-conducting because the voltage across resistor 64 is insufficient to turn it on. With the increased conduction of transistor 60 in response to applied signal 50, the voltage developed exceeds the",
    "textAfterTable": "* Cited by examiner Non-Patent Citations Reference 1 * Barr, Remotely Powered Measurement Systems, IBM Technical Disclosure Bulletin, vol. 13, No. 8, Jan. 1971, pp. 2255, 2256. * Cited by examiner Referenced by Citing Patent Filing date Publication date Applicant Title US4103219 * Oct 5, 1976 Jul 25, 1978 Rca Corporation Shunt voltage regulator US4198621 * Nov 14, 1977 Apr 15, 1980 Crowcon (Instruments) Limited Electrical remote sensing system US4272758 * Sep 12, 1978 Jun 9, 1981 Compagnie Internationale Pour L'informatique Cii Honeywell Bull (Societe Anonyme) Arrangement for providing a power supply and transmitting electrical signs between two devices using a small number of contacts US4607247 * Aug 12, 1985 Aug 19, 1986 The Babcock & Wilcox Company",
    "hasKeyColumn": true,
    "keyColumnIndex": 3,
    "headerRowIndex": 0
}