{
    "relation": [
        [
            "Date",
            "May 10, 1995",
            "Sep 28, 2000",
            "Sep 30, 2004",
            "Nov 13, 2008",
            "Mar 25, 2011"
        ],
        [
            "Code",
            "AS",
            "FPAY",
            "FPAY",
            "FPAY",
            "AS"
        ],
        [
            "Event",
            "Assignment",
            "Fee payment",
            "Fee payment",
            "Fee payment",
            "Assignment"
        ],
        [
            "Description",
            "Owner name: HITACHI, LTD., JAPAN Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNORS:TANAKA, NAOTAKA;YAGUCHI, AKIHIRO;KITANO, MAKOTO;AND OTHERS;REEL/FRAME:007488/0404 Effective date: 19950428",
            "Year of fee payment: 4",
            "Year of fee payment: 8",
            "Year of fee payment: 12",
            "Owner name: RENESAS ELECTRONICS CORPORATION, JAPAN Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNOR:HITACHI, LTD.;REEL/FRAME:026109/0528 Effective date: 20110307"
        ]
    ],
    "pageTitle": "Patent US5637914 - Lead frame and semiconductor device encapsulated by resin - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US5637914?dq=6,712,702",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 8,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990123.20/warc/CC-MAIN-20150728002310-00004-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 499575823,
    "recordOffset": 499546661,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{46043=FIG. 3 shows the lead frame structure of another conventional example according to JP-A-4-91464 including a dam member 3 between a chip pad supporting lead 5 and an outer lead 2b adjacent thereto. Due to high rigidity of the supporting lead 5 with two supporting points, the lead frame is cambered through the similar mechanism as for the case of FIG. 2. Camber in the lead frame disadvantageously causes peeling of a die bonding layer, deformation of the leads after a wire bonding process, and hindrance when transporting the lead frame in a semiconductor manufacturing process., 44788=According to the JP-A-58-28841, the dam bar is fabricated with an insulating tape; whereas, various resins are employed according to the JP-A-2-122660, JP-A-310955, and JP-A-4-91464. The fabrication of the dam bar on a lead frame using an insulating tape or resins requires a pressurized molding process in a high temperature. Since the insulating tape and resins generally have a coefficient of linear expansion larger than that of materials of the lead frame (particularly, Fe-42Ni), the overall lead frame disadvantageously cambers due to the difference in the coefficient of linear expansion therebetween when an adhesive agent or resin is hardened on a surface of the tape., 42982=However, recently, due to increasing tendency of capacity of semiconductor devices, the number of pins of a semiconductor device package becomes greater, which necessitates a lead frame of a finer pitch construction having a lead pitch of 0.3 mm to 0.5 mm. This leads to a technological problem that it is difficult to conduct the cutting process of the dam bar by use of a metal mold. Even if the process is conducted, the production cost will be considerably increased. For this problem, to remove the cutoff process using a metal mold, there have been proposed methods of creating a dam bar in which, in place of the forming of the dam bar in the monoblock structure, an insulating tape and a resin are used as members of the dam. Reference is to be made to, for example, the JP-A-58-28841, JP-A-2-122660, JP-A-310955, and JP-A-4-91464.}",
    "textBeforeTable": "Patent Citations While the present invention has been described with reference to the particular illustrative embodiments, it is not to be restricted by those embodiments but only by the appended claims. It is to be appreciated that those skilled in the art can change or modify the embodiments without departing from the scope and spirit of the present invention. FIG. 11 shows an upper-surface view of the semiconductor device in which the dam portion is removed. Since a portion of the dam member 3 is also formed in the resin molding process as shown in FIG. 8, when the dam portion is removed by an organic solvent or the like, there appears a gap 13 in the portion from which the dam portion is removed. In a case of a semiconductor device using a lead frame according to the present invention, the gap 13 appears only in the periphery of the outer leads 2b. In a case of a semiconductor device using a lead frame according to the prior inventions, the dam member 3 of FIG. 10 is entirely removed. Consequently, it can be appreciated that the depression appears in a continuous fashion between the chip pad supporting lead 5 undergone the cutting process and the outer lead 2b adjacent thereto. Furthermore, the dam portion is made of an insulating organic substance. In consequence, although there arises no problem in the state, the dam portion can be easily",
    "textAfterTable": "Title not available JPS57192058A * Title not available * Cited by examiner Referenced by Citing Patent Filing date Publication date Applicant Title US5812381 * Aug 8, 1996 Sep 22, 1998 Sony Corporation Lead frame and integrated circuit package using the lead frame US5821610 * Jul 14, 1997 Oct 13, 1998 Nec Corporation Leadframe allowing easy removal of tie bars in a resin-sealed semiconductor device US5825081 * Oct 11, 1996 Oct 20, 1998 Kabushiki Kaisha Toshiba Tape carrier and assembly structure thereof US5929512 * Mar 18, 1997 Jul 27, 1999 Jacobs; Richard L. Urethane encapsulated integrated circuits and compositions therefor US5937279 * Apr 21, 1998 Aug 10, 1999 Kabushiki",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}