{
    "relation": [
        [
            "Date",
            "Apr 18, 2005",
            "Nov 14, 2007",
            "Dec 2, 2010",
            "Nov 20, 2014",
            "Jun 5, 2015"
        ],
        [
            "Code",
            "AS",
            "AS",
            "FPAY",
            "FPAY",
            "AS"
        ],
        [
            "Event",
            "Assignment",
            "Assignment",
            "Fee payment",
            "Fee payment",
            "Assignment"
        ],
        [
            "Description",
            "Owner name: XPONENT PHOTONICS INC., CALIFORNIA Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNORS:BLAUVELT, HENRY A.;VERNOOY, DAVID W.;REEL/FRAME:016094/0091 Effective date: 20050315",
            "Owner name: HOYA CORPORATION USA,CALIFORNIA Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNOR:XPONENT (ASSIGNMENT FOR THE BENEFIT OF CREDTORS), LLC;REEL/FRAME:020156/0485 Effective date: 20071113",
            "Year of fee payment: 4",
            "Year of fee payment: 8",
            "Owner name: HOYA CORPORATION USA, CALIFORNIA Free format text: ASSIGNEE CHANGE OF ADDRESS;ASSIGNOR:HOYA CORPORATION USA;REEL/FRAME:035841/0450 Effective date: 20150605"
        ]
    ],
    "pageTitle": "Patent US7228032 - Apparatus and methods for launching an optical signal into multimode optical ... - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US7228032?dq=6076065",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 9,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987628.47/warc/CC-MAIN-20150728002307-00091-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 464216247,
    "recordOffset": 464189649,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{6440=Various waveguide core configurations, and various waveguide core and cladding material combinations, may be employed for achieving desired injected beam size and shape. For example, the elliptical injected beam shapes shown in FIGS. 5B and 5C may be readily produced with a properly designed planar waveguide. By varying the planar waveguide sufficiently gradually along its length (i.e., substantially adiabatically), most desired beam sizes and/or shapes may be obtained for injection into the multimode waveguide without introducing unacceptable levels of optical loss. A single-mode waveguide may typically be employed, although a multimode waveguide may be suitably employed under some conditions. Some examples of suitable planar waveguides may be found in prior-filed U.S. provisional Appl. No. 60/466,799 filed Apr. 29, 2003, prior-filed U.S. non-provisional application Ser. No. 10/609,018 filed Jun. 27, 2003, and prior-filed U.S. non-provisional application Ser. No. 10/836,641 filed Apr. 29, 2004, each of said applications being hereby incorporated by reference as if fully set forth herein. Other suitable planar waveguide types or configurations may be employed as well, and shall fall within the scope of the present disclosure and/or appended claims. Injected beam sizes may typically range between about 1 μm and about 10 μm, 15 μm, or even 20 μm in diameter (at typical visible and near-IR wavelengths employed for fiber-optic telecommunications), and may differ in the two transverse dimensions. Spatially selective material processing may be employed for forming injection waveguides and grooves or other alignment structures in precise relative positions and orientations, limited only by the accuracy of the lithographic or other processes employed. Sub-micron alignment accuracy may be routinely achieved using many standard spatially-selective material processing techniques. A groove for receiving the end of a multimode fiber and a single-mode injection waveguide may be formed together on a common waveguide substrate. The core of the injection waveguide may be engineered to yield the desired beam size and shape at its end, while the depth and angle of the groove relative to the waveguide are engineered to yield the proper radial and/or angular displacements for the multimode fiber seated in the groove. Once a particular set of launch conditions are established for a given multimode fiber, those conditions may be readily implemented, and reliably and reproducibly achieved, by fabrication of a suitably designed planar waveguide substrate 101 with the injection waveguide 110 and a groove 120 for receiving the multimode fiber 200, and subsequent mounting of the multimode fiber on the waveguide substrate seated in the groove. Multiple such structures may be fabricated concurrently on a common substrate wafer using spatially selective material processing applied on a wafer scale.}",
    "TableContextTimeStampAfterTable": "{80405=Many commercially available gradient-index multimode fibers, including multimode fiber deployed in legacy networks, are specified to exhibit a transmission bandwidth greater than or equal to about 400 or 500 MHz-km at transmission wavelengths around 1300 nm. Examples or such legacy multimode optical fibers may include A1a.1, A1a.2, and A1b fibers described in the IEC 60793-2-10 standards document; many other examples of legacy multimode optical fiber exist, and any may employed within the scope of the present disclosure or appended claims. The bandwidth specification typically assumes an overfilled launch condition (i.e., nearly all optical modes supported by the multimode optical fiber, including modes with significant amplitude near index defects, receive a portion of the launched optical signal). Such a launch condition typically results in unacceptably high optical loss upon launch, and typical single mode sources, such as single mode fiber, are not well-suited for overfilling the multimode fiber. Launching of a single mode beam, from a single mode fiber or other single mode source, may be less lossy than an overfilled launch and may in some instances achieve the bandwidth specification. However, in other instances a launched single mode may in fact exhibit a decreased bandwidth (relative to an overfilled launch) due to variations in the launch conditions leading to variations in the distribution of modes receiving fractions of the injected optical signal. Radial offset of an injected beam from a single mode source by more than about its beam radius (1/e2 of maximum intensity half width in the radial offset direction), together with angular offset in the azimuthal direction of such an injected beam by more than about its divergence half angle (half maximum intensity half width in the azimuthal direction), may result in an operationally significant reduction of modal dispersion. Increasing the radial offset to about 1.5 to 2 times the injected beam radius typically results in operationally significant reduction of modal dispersion. Expanding the injected beam in the azimuthal dimension (thereby decreasing the corresponding divergence) may result in further reduction of modal dispersion. Note that injected optical beam size, shape, divergences, radial position, and angular offset (i.e., propagation direction) are defined just within the multimode fiber entrance face, and that refraction upon entering the multimode fiber end face must be accounted for in designing an optical system for achieving the desired launch conditions. Many different combinations of launch conditions may yield decreased multimode dispersion and improvement of the multimode fiber transmission bandwidth in the presence of various multimode fiber index defects or combinations thereof., 58059=This application claims benefit of prior-filed co-pending provisional App. No. 60/536,176 entitled “Apparatus and methods for launching an optical signal into multimode optical fiber” filed Jan. 12, 2004 in the name of Henry A. Blauvelt, said provision application being incorporated by reference as if fully set forth herein. This application claims benefit of prior-filed co-pending provision App. No. 60/547,273 entitled “Apparatus and methods for launching an optical signal into multimode optical fiber” filed Feb. 24, 2004 in the names of Henry A. Blauvelt and David W. Vernooy, said provision application being incorporated by reference as if fully set forth herein., 107350=One exemplary type of planar optical waveguide that may be suitable for use with optical components disclosed herein is a so-called PLC waveguide (Planar Lightwave Circuit). Such waveguides typically comprise silica or silica-based waveguides (often ridge or buried waveguides; other waveguide configuration may also be employed) supported on a substantially planar silicon substrate (often with an interposed silica or silica-based optical buffer layer). Sets of one or more such waveguides may be referred to as planar waveguide circuits, optical integrated circuits, or opto-electronic integrated circuits. A PLC substrate with one or more PLC waveguides may be readily adapted for mounting one or more optical sources, lasers, modulators, and/or other optical devices adapted for end-transfer of optical power with a suitably adapted PLC waveguide. A PLC substrate with one or more PLC waveguides may be readily adapted (according to the teachings of U.S. Pat. App. Pub. No. 2003/0081902, U.S. provisional App. No. 60/466,799, U.S. non-provisional application Ser. No. 10/609,018, and U.S. non-provisional application Ser. No. 10/836,641, each hereby incorporated by reference as if fully set forth herein) for mounting one or more optical sources, lasers, modulators, photodetectors, and/or other optical devices adapted for transverse-transfer of optical power with a suitably adapted PLC waveguide (mode-interference-coupled, or substantially adiabatic, transverse-transfer; also referred to as transverse-coupling).}",
    "textBeforeTable": "Patent Citations For purposes of the present disclosure and appended claims, the conjunction “or” is to be construed inclusively (e.g., “a dog or a cat” would be interpreted as “a dog, or a cat, or both”; e.g., “a dog, a cat, or a mouse” would be interpreted as “a dog, or a cat, or a mouse, or any two, or all three”), unless: i) it is explicitly stated otherwise, e.g., by use of “either . . . or”, “only one of . . . ”, or similar language; or ii) two or more of the listed alternatives are mutually exclusive within the particular context, in which case “or” would encompass only those combinations involving non-mutually-exclusive alternatives. It is intended that equivalents of the disclosed exemplary embodiments and methods shall fall within the scope of the present disclosure and/or appended claims. It is intended that the disclosed exemplary embodiments and methods, and equivalents thereof, may be modified while remaining within the scope of the present disclosure or appended claims. While particular examples have been disclosed herein employing specific materials and/or material combinations and having particular dimensions and configurations, it should be understood that many materials and/or material combinations may be employed in any of a variety of dimensions and/or configurations while remaining within the scope of inventive concepts disclosed and/or claimed herein. It should be pointed out that while wafer-scale processing sequences are set forth as examples,",
    "textAfterTable": "Oct 23, 2012 Corning Incorporated Coated optical fibers and related apparatuses, links, and methods for providing optical attenuation US8326157 Jun 30, 2009 Dec 4, 2012 Cambridge Enterprise Limited High-speed optical transceiver, a bi-directional duplex optical fiber link, and a method for providing a bi-directional duplex optical fiber link US8432539 * Sep 5, 2012 Apr 30, 2013 Draka Comteq B.V. Graded-index multimode optical fiber US8477298 Sep 30, 2009 Jul 2, 2013 Corning Incorporated Angle-cleaved optical fibers and methods of making and using same US8639079 Mar 29, 2012 Jan 28, 2014 Draka Comteq, B.V. Multimode optical fiber US8644664 Jan 31, 2012 Feb 4, 2014 Draka Comteq, B.V. Broad-bandwidth optical fiber US8867880 Jun 4, 2010 Oct 21, 2014 Draka Comteq, B.V. Large bandwidth multimode optical fiber having a reduced cladding effect US8879878 Jun 27, 2012 Nov 4, 2014 Draka Comteq, B.V. Multimode optical fiber US8891074",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}