{
    "relation": [
        [
            "Citing Patent",
            "US6768588",
            "US6954308",
            "US7304779",
            "US7339737",
            "US7460305",
            "US7826141",
            "WO2003040669A2 *",
            "WO2004044641A1 *",
            "WO2005078511A1 *",
            "WO2011030033A2 *",
            "WO2013123430A1 *"
        ],
        [
            "Filing date",
            "Jul 26, 2002",
            "Jul 26, 2002",
            "Oct 28, 2003",
            "Jul 12, 2004",
            "Aug 4, 2006",
            "Apr 28, 2008",
            "Nov 1, 2002",
            "Oct 28, 2003",
            "Feb 4, 2005",
            "Aug 23, 2010",
            "Feb 15, 2013"
        ],
        [
            "Publication date",
            "Jul 27, 2004",
            "Oct 11, 2005",
            "Dec 4, 2007",
            "Mar 4, 2008",
            "Dec 2, 2008",
            "Nov 2, 2010",
            "May 15, 2003",
            "May 27, 2004",
            "Aug 25, 2005",
            "Mar 17, 2011",
            "Aug 22, 2013"
        ],
        [
            "Applicant",
            "Microvision, Inc.",
            "Microvision, Inc.",
            "Elinnova Hb",
            "Microvision, Inc.",
            "Microvision, Inc.",
            "Microvision, Inc.",
            "Microvision Inc",
            "Elinnova Hb",
            "Microvision Inc",
            "Sagem Defense Securite",
            "The Regents Of The University Of California"
        ],
        [
            "Title",
            "Apparatus and methods for generating multiple exit-pupil images in an expanded exit pupil",
            "Apparatus and methods for generating multiple exit-pupil images in an expanded exit pupil",
            "Device for converting light",
            "Beam multiplier that can be used as an exit-pupil expander and related system and method",
            "Scanned-beam heads-up display and related systems and methods",
            "Scanned-beam heads-up display and related systems and methods",
            "Display system with means for generating multiple exit-pupil images in an expanded exit pupil",
            "Device for converting light",
            "Scanned-beam heads-up display and related systems and methods",
            "Retina projection device",
            "Directional optical coherence tomography systems and methods"
        ]
    ],
    "pageTitle": "Patent US20010000124 - Scanning display with expanded exit pupil - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US20010000124?dq=5754119",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 5,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990123.20/warc/CC-MAIN-20150728002310-00178-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 473409835,
    "recordOffset": 473384028,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{42108=39. Additional detail on these and other light source 12 embodiments are found in U.S. patent application Ser. No., 08/437,818 for “Virtual Retinal Display with Fiber Optic Point Source” filed May 9, 1995, and incorporated herein by reference., 20613=1. This is a continuation of U.S. patent application Ser. No. 08/975,259 filed Nov. 20, 1997 for “Virtual Retinal Display with Expanded Exit Pupil,” which is a continuation of U.S. Pat. No. 5,701,132 issued Dec. 23, 1997 on application Ser. No. 08/624,950 filed Mar. 29, 1996 for “Virtual Retinal Display with Expanded Exit Pupil.” The content of such patent and patent application are incorporated herein by reference and made a part hereof.}",
    "textBeforeTable": "Referenced by 77. Although a preferred embodiment of the invention has been illustrated and described, various alternatives, modifications and equivalents may be used. Therefore, the foregoing description should not be taken as limiting the scope of the inventions which are defined by the appended claims. 76. One advantage of this invention is that the shorter light path allows for a more compact, lighter weight retinal display device. Another advantage is that a viewer has less difficulty aligning and maintaining alignment with an exit pupil formed at the eyepiece. In particular, the expanded exit pupil, the multiple exit pupils or the multiple, expanded exit pupils make it easier for a viewer to find an exit pupil. Another advantage with regard to the diffractive optical element embodiment is that image brightness is generally uniform among various groups of exit pupils which form at the viewer's eye. Meritorious and Advantageous Effects 75. For a display device providing stereoscopic viewing two retinal display devices 10 are used. If combining two monocular systems to define binocular viewing, however, there is a potential conflict between distance cues and focus. 74. The components of the retinal display 10 can be made small, compact and lightweight so as to embody a hand-held display or to be mounted on a viewer's head without requiring a helmet or an elaborate head mounting support. Also the",
    "textAfterTable": "* Cited by examiner Classifications U.S. Classification 345/8, 359/631 International Classification G02B27/01, G02B27/00 Cooperative Classification G02B27/0172, G02B27/017, G02B26/101, G02B27/0081 European Classification G02B27/00P, G02B27/01C, G02B27/01C1, G02B26/10B Legal Events Date Code Event Description Jun 30, 2007 FPAY Fee payment Year of fee payment: 4 Aug 3, 2011 FPAY Fee payment Year of fee payment: 8 Rotate Original Image",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}