{
    "relation": [
        [
            "",
            "2011-12",
            "2012-13",
            "2013-14",
            "2014-15",
            "Total"
        ],
        [
            "gp",
            "-",
            "29",
            "30",
            "28",
            "87"
        ],
        [
            "gs",
            "-",
            "28",
            "30",
            "28",
            "86"
        ],
        [
            "min/g",
            "-",
            "25.0",
            "25.7",
            "29.6",
            "26.7"
        ],
        [
            "fg/40",
            "0.0-0.0",
            "8.2-14.2",
            "8.7-16.1",
            "7.3-15.1",
            "8.0-15.2"
        ],
        [
            "pct",
            "-",
            "57.8",
            "53.9",
            "48.1",
            "52.9"
        ],
        [
            "3pt/40",
            "0.0-0.0",
            "0.3-0.5",
            "0.1-0.4",
            "0.1-0.4",
            "0.2-0.4"
        ],
        [
            "pct",
            "-",
            "66.7",
            "28.6",
            "22.2",
            "40.0"
        ],
        [
            "ft/40",
            "0.0-0.0",
            "3.0-4.4",
            "2.9-4.0",
            "4.8-6.2",
            "3.6-4.9"
        ],
        [
            "pct",
            "-",
            "68.4",
            "70.5",
            "77.3",
            "73.0"
        ],
        [
            "pts/40",
            "-",
            "19.7",
            "20.3",
            "19.4",
            "19.8"
        ]
    ],
    "pageTitle": "Temi Fagbenle - Harvard",
    "title": "",
    "url": "http://gocrimson.com/sports/wbkb/2013-14/bios/fagbenle_temi_y28o?view=profile",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 8,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989043.35/warc/CC-MAIN-20150728002309-00106-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 105321687,
    "recordOffset": 105299931,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{64231=Before Harvard Named a McDonald’s All American and to the Parade All-America team as a senior  … Ranked 13th overall and fifth at forward in the 2011 class by  ESPN HoopGurlz … Ranked fifth by Blue Star Basketball … Named New Jersey Gatorade Player of the Year and Eastern Propane MugsMedia Prep Player of the Year as a senior … Led Blair Academy to the MAPL and State titles as a senior … Earned Worcester Basketball Tournament MVP in  as a sophomore and junior …  Received All-MAPL honors … A three-time MAPL and state champion in the high jump … Won the javelin at the MAPL and states as a sophomore and the shot put as a senior  … Two-time discus MAPL and state champion … Holds high school high jump record ... Performed in her high school musical “The Drowsy Chaperon” … Member of the student council … Her brother, Dapo, played basketball at Campbell and Bellarmine., 63345=2011-12 (Freshman) Sat the year in residency and will assume sophomore eligibility for the 2012-13 season., 63494=International Averaged 4.8 ppg, 4.0 rpg and 1.2 bpg while playing 20.0 minutes for Great Britain at the 2012 London Olympics ... Appeared in all five games for Great Britain at the 2012 London Olympics, including three starts against Australia, Canada and Russia ... Became only the second women's basketball student-athlete in Ivy League history to compete in the Olympic Games ... Earned England U18 Player of the Year honors for 2010 … Led England to the U18 Women’s European championship in 2010, during which she led the tournament in five statistical categories including rebounds, double-doubles and two-point field goal percentage … Named MVP of the Blue Star Europe Tournament in 2011., 190802=© Copyright 2014 Harvard University All Rights Reserved, 59938=2012-13 (Sophomore) Earned All-Ivy League second team honors and was the unanimous pick for Ivy League Rookie of the Year ... Set an Ivy League record with 10 rookie of the week awards ... Named the Ivy League Rookie of the Week after averaging 12.5 ppg, 9.0 rpg, 3.0 apg and 2.5 bpg at North Dakota State and North Dakota ... Scored 12 points on 5-of-7 shooting with eight rebounds, five assists, three blocks and three steals in her collegiate debut at North Dakota State (Nov. 9) ... Recorded her first career double-double with 13 points and 10 boards at North Dakota (Nov. 11) ... Named to the Ivy League Honor Roll for her 13-point, four-rebound effort against BYU (Nov. 16) ... Scored a career-high 15 points on 6-of-6 shooting and grabbed six boards at Eastern Michigan (Nov. 24) ... Registered nine points and three steals against New Hampshire (Nov. 28) ... Named the Ivy League Rookie of the Week after notching 15 points on 7-of-9 shooting against Providence (Dec. 4) ... Earned both Ivy League Player and Rookie of the Week honors for her 14-point, 14-rebound performance at Boston University (Dec. 10) ... Named the Ivy League Player of the Week and Rookie of the Week and was named to the San Diego Surf 'N Slam Classic All-Tournament Team after averaging 17.0 ppg and 9.0 rpg ... Scored a career-high 18 points on 7-of-12 shooting with 10 rebounds against No. 14/13 Oklahoma State (Dec. 28) ... Notched 16 points, eight rebounds and a career-best four blocked shots against SMU (Dec. 30) ... Named the Ivy League Rookie of the Week Jan. 7 after averaging 10.5 ppg and 8.0 rpg while shooting 50.0 percent from the field in a pair of wins ... Scored 12 points on 4-of-5 shooting with six rebounds and two assists against UMass (Jan. 2) ... Tallied nine points and 10 rebounds at Rhode Island (Jan. 6) ... Named the Ivy League Rookie of the Week after turning in eight points and 10 rebounds at Dartmouth (Jan. 26) ... Named the Ivy League Rookie of the Week after averaging 17.0 ppg and 9.0 rpg against Yale (Feb. 1) and Brown (Feb. 2) while shooting 73.7 percent from the field ... Scored a career-high 20 points on 9-of-12 shooting to go with nine rebounds at Yale ... Named to the Ivy League Honor Roll after tallying 12 points and six rebounds against Cornell (Feb. 10) ... Named to the Ivy League Honor Roll after scoring a career-high 26 points on 11-of-14 shooting and pulled down 13 rebounds at Penn (Feb. 15) ... Named the Ivy League Rookie of the Week following her 17-point, 12-rebound double-double agianst Brown (Feb. 22) ... Earned Ivy League Rookie of the Week honors after turning in 11.5 ppg and 8.0 rpg against Princeton and Penn ... Chipped in nine points, nine rebounds and three blocks versus Princeton (March 1) ... Totaled 14 points, seven rebounds and three assists against Penn (March 2) ... Named the Ivy League Rookie of the Week after averaging 15.0 ppg, 11.5 rpg and shooting 63.2 percent from the field at Columbia and Cornell ... Totaled 14 points, 12 rebounds, two assists and two blocks at Columbia (March 8) ... Recorded 16 points on 7-of-10 shooting to go with 11 boards and two assists at Cornell (March 9) ... Scored 11 points on 5-of-7 shooting and added six rebounds, three assists and two steals at Hartford (March 21) ... Turned in 14 points on 6-of-9 shooting and grabbed seven rebounds at Drexel (March 23)., 58269=2013-14 All-Ivy Leageu first team 2012-13 All-Ivy League second team. 2012-13 All-Ivy League Rookie of the Year. Has earned 14 Ivy League weekly award (4 Player of the Week, 10 Rookie of the Week). Has recorded 18 double-doubles., 59180=2013-14 (Junior) All-Ivy League first team selection ... College Sports Madness Preseason All-Ivy League first team … Three-time Ivy League Player of the Week (Nov. 25, Jan. 13 and March 3) … College Sports Madness Ivy League Player of the Week Nov. 25 … ASU Classic all-tournament team … Fordham Holiday Classic all-tournament team … College Sports Madness Ivy League Player of the Week Jan. 13 ... Nearly averaged a double-double with 13.3 points and 9.3 rebounds per game in 29 games started … Led the league in rebounding, field goal percentage (.548) and defensive rebounds (6.5) … Ranked second in the Ancient Eight in blocked shots (1.4) ... Also sat ninth in scoring ... Posted 11 double-doubles this season.}",
    "textBeforeTable": "Temi Fagbenle 14 14 Related Bios Gisele Bailey Christine Clark Ali Curtis Kaitlyn Dinkins Jasmine Evans Taylor Finley Elise Gordon Maggie Hartman AnnMarie Healy Grace Keane Erin McDonnell Kit Metoyer Melissa Mullins Destiny Nunley Shilpa Tummala }); }); $(this).toggleClass('active').next('ul').toggleClass('active'); $('.secondary-nav > h1').click(function() { $(function() { })(jQuery); }); }); $('.has-submenu.active').removeClass('active'); $(document).on('click', function(e) { }); return false; $(this).parent().toggleClass('active'); $('.has-submenu > a', '#global-nav').on('click', function() { }); return false; $('#global-nav').removeClass('active'); $('#jump-to-global-nav').removeClass('active'); $('#global-nav .close').click(function(e) { }); $('#global-nav').toggleClass('active'); $(this).toggleClass('active'); e.preventDefault(); $('#jump-to-global-nav').click(function(e) { $(function() { (function($) {",
    "textAfterTable": "at Cornell W, 70-66 Mar 1 at Columbia W, 64-51 Mar 7 Yale W, 69-65 Mar 8 Brown W, 87-67 Mar 20 at Iona W, 90-89 Mar 24 at Rutgers L, 63-52 Statistics category Overall Conf Games 30 14 Games started 30 14 Minutes 771 355 Minutes per game 25.7 25.4 FG 167-310 74-137 FG Pct 53.9 54.0 3PT 2-7 1-2 3PT Pct 28.6 50.0 FT 55-78 24-34",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}