{
    "relation": [
        [
            "Last Name",
            "Miller",
            "-------",
            "-------",
            "-------",
            "-------",
            "-------",
            "",
            "Miller",
            "-------",
            "-------",
            "-------",
            "-------",
            "-------",
            "-------",
            "Douglas"
        ],
        [
            "First name",
            "Jacob",
            "Elizabeth",
            "Barbara",
            "Nancy",
            "David",
            "Joseph",
            "",
            "H. A.",
            "Harriet",
            "John H.",
            "Martha",
            "William",
            "Sarah",
            "Thos. A.",
            "David"
        ],
        [
            "Age",
            "70",
            "65",
            "22",
            "20",
            "17",
            "9",
            "",
            "38",
            "34",
            "10",
            "8",
            "6",
            "4",
            "1",
            "15"
        ],
        [
            "Sex",
            "M",
            "F",
            "F",
            "F",
            "M",
            "M",
            "",
            "M",
            "F",
            "M",
            "F",
            "M",
            "F",
            "M",
            "M"
        ],
        [
            "Race",
            "W",
            "W",
            "W",
            "W",
            "W",
            "W",
            "",
            "W",
            "W",
            "W",
            "W",
            "W",
            "W",
            "W",
            "W"
        ],
        [
            "Occupation",
            "Farmer",
            "Keeping House",
            "-------",
            "-------",
            "Works on Farm",
            "",
            "",
            "Works in Blacksmith",
            "Keeping House",
            "At Home",
            "",
            "",
            "",
            "",
            "Works on Farm"
        ],
        [
            "Real Estate",
            "$800",
            "",
            "",
            "",
            "",
            "",
            "",
            "$400",
            "",
            "",
            "",
            "",
            "",
            "",
            ""
        ],
        [
            "Personal Estate",
            "$300",
            "",
            "",
            "",
            "",
            "",
            "",
            "$400",
            "",
            "",
            "",
            "",
            "",
            "",
            ""
        ],
        [
            "Birth",
            "NC",
            "---",
            "---",
            "---",
            "---",
            "---",
            "",
            "---",
            "---",
            "---",
            "---",
            "---",
            "---",
            "---",
            "---"
        ],
        [
            "Male Age 21+",
            "X",
            "",
            "",
            "",
            "",
            "",
            "",
            "X",
            "",
            "",
            "",
            "",
            "",
            "",
            ""
        ]
    ],
    "pageTitle": "Jacob Miller",
    "title": "",
    "url": "http://history.loftinnc.com/Miller_Jacob_1798.htm",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 6,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989043.35/warc/CC-MAIN-20150728002309-00019-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 114439772,
    "recordOffset": 114428459,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{9600=The MILLER Family Tree Mahala Catherine Miller (1830 - 1901) Jacob Miller (1798 - 1885) John Miller (1774 - 1835) Michael Miller (1753 - 1813) Johannes Miller (1726 1780) George Miller (????) _______  }",
    "TableContextTimeStampAfterTable": "{49130=In 1880, Jacob and Elizabeth were still living on the family farm in Shiloh Township, Iredell County.  Jacob's age was listed as 85, but he was probably closer to 80 or 81.  There daughter Barbara Ann, age 33, was still living with them.  There were also three grandsons living on the farm - children of Barbara Ann who had never married.  Elizabeth, age 71, was listed as being disabled because of having Rheumatism., 20715=Jacob & Elizabeth, as well as their families, were members at Sharon Lutheran Church until an odd incident happened in late 1859.  The story is told that Jacob and Elizabeth were having domestic problems.  Elizabeth, in Iredell County Equity Court (in the Fall Term 1859), filed for divorce on the grounds that Jacob was a drunken and abusive husband who had left her and threatened to sell his farm and possessions and leave her destitute.  She accused Jacob of threatening her with a knife a year before that, and more recently taking her by the hair with one hand and beating her with the other., 1490=Jacob married Elizabeth Fulbright on 08 Aug 1826 in Lincoln County, NC.  The bondsman listed was George Yount and their witness was M. W. Abernethy, JP.  Jacob and Elizabeth had eleven children., 25396=Grandson David James Fulbright was living with Jacob and Elizabeth in 1860.  David was the illegitimate son of eldest daughter Mahala Catherine Miller.  He was born 12 Aug 1855.  Mahala had married widower J. Walter Douglas in 1859.  It is not certain who David James Fulbright’s father was.  Mahala said that it was David F. Fulbright, her first cousin., 8574=According to the 1850 Census, Jacob and Elizabeth were living on the family farm with eleven children., 8032=On 21 May 1841, Jacob purchased a tract of land in Lincoln County from George Harbinson, bounding on the Catawba River, containing 250 acres and formerly belonging to John Miller, Jacob's father., 21679=Jacob filed an answer to her petition in the Spring Term of 1860, denying that he was a drunkard, although he did partake of \"spirits\" occasionally, but had never spent more than $5 a year for liquor in his entire life.  He also denied any abuse, but maintained any force or violence by himself toward Elizabeth was to defend himself from \"brutal and unnatural attacks\" by her and \"those she would procure to assist her.\"  He stated that he had left home and was staying at the home of his son in Catawba County to allow her to become more reasonable and quiet.  He said that he returned home several days before being served by her process.  Jacob denied he ever intended to sell his property, but only threatened to do so, on his neighbor's advise, in order to cause Elizabeth to be less \"unkind\" to him., 19509=On 09 Nov 1850 Jacob purchased 400 acres of land in Iredell County from John Delp and moved his family soon after.  By this time, several of his 11 known children were grown and research shows that some lived, at least for periods in Catawba County, NC., 36648=1870 Iredell County Census, 22892=On 08 May 1860 Jacob, according to two deeds in Iredell County, gave his son Henry Adolphus Miller his 300 acre plantation and his personal property of wagon, mules, cows, hogs, sheep, bees, wheat, corn and bacon - a gift for his \"preferment of marriage\".  On 12 Oct 1861 Jacob is expelled from Sharon Church and his name never again is entered on a communion list, although nearly his entire family continues to appear there., 24471=According to the 1860 Census, Jacob and Elizabeth were living in Iredell County, North Carolina.  Jacob's Real Estate in Catawba County in 1850 was valued at $400.  His Real Estate in Iredell County in 1860 was valued at $2000.  His Personal Estate was valued at $600., 23680=The evidence appears to favor Elizabeth, except for a few oddities.  Henry Adolphus never takes possession of his father's farm.  The deed of 1860 is recorded again in 1882, but the land is later divided by Jacob's will in 1885 and several tracts are sold by Jacob and Elizabeth to Franklin Miller, Thomas Stewart and J. F. Stewart prior to Jacob's death.  To compound matters, Henry is sued by Jacob for unknown damages in 1884., 839=Born: 1798, Rowan County, NC Died:  16 Jan 1885, Iredell County, NC, 35195=According to the 1870 Census, Jacob and Elizabeth were living on the family farm in Iredell County, Shiloh Township - New Sterling Post Office.  Jacob's Real Estate value had decreased from $2000 to $800 - indicating that he has sold part of his land, quite possibly to some of his children.  Daughters Barbara and Nancy were still living on the family farm and grandson, David Fulbright, age 17, was still living with his grandparents - although the Census listed him as David Miller instead of David Fulbright.  There was also 9-year-old Joseph Miller living with Jacob & Elizabeth., 67938=It is unclear if Jacob and Elizabeth were ever divorced.  They continued to live together until Jacob's death on 16 Jan 1885.  Elizabeth is mentioned in Jacob's Will in 1883 and living along with their daughter, Barbara Ann Miller, in there home until her death., 1143=Jacob Miller was born about 1798 in Rowan County, NC to John Miller and Barbara Bobst. , 50566=1880 Iredell County Census, 28471=1860 Iredell County Census}",
    "lastModified": "Wed, 13 May 2015 20:36:45 GMT",
    "textBeforeTable": "  Jacob married Elizabeth Fulbright on 08 Aug 1826 in Lincoln County, NC.  The bondsman listed was George Yount and their witness was M. W. Abernethy, JP.  Jacob and Elizabeth had eleven children.   Jacob Miller was born about 1798 in Rowan County, NC to John Miller and Barbara Bobst.    Born: 1798, Rowan County, NC Died:  16 Jan 1885, Iredell County, NC     Jacob Miller     MILLER GENEALOGY LINE The MILLER Family Tree Mahala Catherine Miller (1830 - 1901) Jacob Miller (1798 - 1885)",
    "textAfterTable": "\" 20 F     \"     Dolphus \" 18 M Farmer   \" X   Isah (Isaiah) \" 16 M Farmer   \" X   Louize \" 14 F     \"     Peter \" 12 M     \"     Levan \" 10 M     \"     Joshua \" 6 M     \"     Wiley \" 4 M     \"     Barbary \" 3 F    ",
    "hasKeyColumn": true,
    "keyColumnIndex": 1,
    "headerRowIndex": 0
}