{
    "relation": [
        [
            "Size",
            "2",
            "3",
            "4",
            "5",
            "6",
            "7",
            "8",
            "9",
            "10",
            "11",
            "12",
            "13",
            "14"
        ],
        [
            "Bust",
            "53.5",
            "56",
            "58.5",
            "61",
            "63.5",
            "66",
            "68.5",
            "71",
            "73.5",
            "77.5",
            "81.5",
            "84",
            "86.5"
        ],
        [
            "Shoulder to waist",
            "24.5",
            "25.5",
            "26.5",
            "27.5",
            "28.5",
            "29.5",
            "30.5",
            "31.5",
            "32.5",
            "33.5",
            "34.5",
            "35.5",
            "36.5"
        ],
        [
            "Shoulder",
            "25",
            "26",
            "26.5",
            "27",
            "28",
            "28.5",
            "29",
            "30",
            "30.5",
            "31",
            "31.5",
            "33",
            "34"
        ],
        [
            "Armhole",
            "30.5",
            "32",
            "33",
            "34.5",
            "36",
            "37.5",
            "39",
            "40.5",
            "42",
            "44",
            "46",
            "48",
            "50"
        ],
        [
            "Sleeve Length",
            "30",
            "32",
            "34",
            "36",
            "38",
            "40",
            "42",
            "44",
            "46",
            "48",
            "50",
            "52",
            "54"
        ]
    ],
    "pageTitle": "Short Sleeves Organza Flower Girl Jacket/ Wedding Wrap - CHF ₣ 10.79",
    "title": "",
    "url": "http://www.lightinthebox.com/Short-Sleeves-Organza-Flower-Girl-Jacket--Wedding-Wrap--70272-_p170327.html?currency=CHF",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 3,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986423.95/warc/CC-MAIN-20150728002306-00110-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 559587723,
    "recordOffset": 559534629,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{107506=Wedding dresses online , evening dresses , Wedding Dresses 2013 , Bridesmaid dresses , cocktail dresses , women's dresses , Mother of the bride dresses , Wedding Dresses with Sleeves, 62426=You replied 'that soon will be availble' ... It is still unavailble.. and also are you going to have a new stock from Spring 2013 and when this will be available ..}",
    "textBeforeTable": "Centimeters Inches Size Charts How To Measure 0.6kg, Shipping Weight 0.5kg, Net Weight Trumpet/ Mermaid, Sheath/ Column, Princess, Ball Gown, A-line, Best Match Dresses Color & Style representation may vary by monitor, Tips White, Color Organza, Fabric Open Front, Front Details Crystal, Embellishment Short Sleeve, Sleeve Length Wedding, Occasion Coats/Jackets, Style Specifications Product Details Please Consult the Size Charts and Measuring Guide to determine which size you should purchase. FAQS QUALITY GUARANTEE",
    "textAfterTable": "FAQs Q: How far in advance should I order my wrap? A: A: Please allow 9-16 business days for your Made-to-Measure wrap to arrive. Each wrap must be tailored before it can be shipped to you, so delivery times are slightly longer for these special items. For full details, see our shipping information Q: Can I return or cancel the wrap if I change my mind? A:Once we've begun tailoring, our fabrics and materials cannot be reused, and so a special cancellation and return policy applies to these special items. There is still flexibility to return or cancel in certain situations, but it's important to order carefully. See our Return and Cancelation Policy for full details. Q: Can I order this wrap in a different style/fabric/length? A:Each wrap is carefully tailored to match exactly what you see in the photos, and unfortunately we are unable to modify the style, length or material in any way. We hope our wide variety of styles, fabrics and color choices will enable to find exactly what you're looking for with no modifications needed. Q: Will my wrap exactly match the color I see on your website? A: A: There might be a slight difference between the actual wrap’s color and what you see in",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}