{
    "relation": [
        [
            "",
            "1",
            "2",
            "3",
            "4",
            "",
            "5",
            "6",
            "7",
            "8",
            "9",
            "10",
            "11",
            "12",
            "13",
            "14",
            "15",
            "16",
            "17",
            "18",
            "19",
            "20",
            "21",
            "22",
            "23",
            "24",
            "25",
            "26",
            "27",
            "28",
            "29",
            "30",
            "31",
            "32",
            "33",
            "34",
            "35"
        ],
        [
            "A",
            "",
            "",
            "",
            "Item #",
            "",
            "16",
            "15",
            "17",
            "1",
            "2",
            "13",
            "5",
            "10",
            "25",
            "9",
            "14",
            "23",
            "3",
            "7",
            "20",
            "21",
            "6",
            "24",
            "30",
            "11",
            "31",
            "27",
            "18",
            "12",
            "19",
            "8",
            "26",
            "22",
            "28",
            "4",
            ""
        ],
        [
            "B",
            "",
            "",
            "",
            "Placement on Booklet Map",
            "",
            "1",
            "2",
            "3",
            "4",
            "5",
            "6",
            "7",
            "8",
            "9",
            "10",
            "11",
            "12",
            "13",
            "14",
            "15",
            "16",
            "17",
            "18",
            "19",
            "20",
            "21",
            "22",
            "23",
            "24",
            "25",
            "26",
            "27",
            "28",
            "29",
            "30",
            ""
        ],
        [
            "C",
            "5/29/2015 6:49:55",
            "",
            "",
            "Book/Film/Journal",
            "",
            "Minnesota's Outdoor Wonders: Exploring the Wonders of Minnesota Month by Month",
            "Little Wolves",
            "The Night Birds",
            "Because of Winn Dixie",
            "On Three Continents (Biography, Family History, and Genealogy) & Mimbo Ma Ki Kristo (Hymnal in Swahili Language)",
            "Les Miserables",
            "The Disappearing Spoon",
            "Hunger Games Trilogy (Hunger Games/Catching Fire/Mockingjay)",
            "Sophie's Choice",
            "The Hobbit",
            "The Lighthouse Road",
            "Planting a Rainbow",
            "Black and Bold: A History of African-American Students at Gustavus Adolphus College",
            "Elizabeth the Queen: The Life of a Modern Monarch",
            "On His Watch: John Kendall at Gustavus",
            "The Particular Sadness of Lemon Cake",
            "Downton Abbey",
            "The Round House",
            "Wicked",
            "Yes, Chef: A Memoir",
            "Team of Rivals: The Political Genius of Abraham Lincoln",
            "The Night Circus",
            "Olivia",
            "The Legacy of Conquest: The Unbroken Past of the American West",
            "Gardenias",
            "Philosophical Investigations",
            "Travels with Charley",
            "Boy in the Suitcase",
            "Supper with the Savior: Communion in the Bible and Today",
            "The True and Outstanding Adventures of the Hunt Sisters",
            ""
        ],
        [
            "D",
            "",
            "",
            "",
            "Author",
            "",
            "Jim Gilbert",
            "Thomas Maltman",
            "Thomas Maltman",
            "Kate DiCamillo",
            "Ruth Nelson Johnson",
            "Victor Hugo",
            "Sam Kean",
            "Suzanne Collins",
            "William Styron",
            "J.R.R. Tolkien",
            "Peter Geye",
            "Lois Ehlert",
            "Bruce Gray",
            "Sally Bedell Smith",
            "Dennis Johnson",
            "Aimee Bender",
            "(DVD)",
            "Louise Erdrich",
            "Gregory Maguire",
            "Marcus Samuelsson",
            "Doris Kearns Goodwin",
            "Erin Morgenstern",
            "Ian Falconer",
            "Patricia Nelson Limerick",
            "Faith Sullivan",
            "Ludwig Wittgenstein",
            "John Steinbeck",
            "Lene Kaaberbøl and Agnete Friis",
            "Barbara Sartorius-Bjelland",
            "Elisabeth Robinson",
            ""
        ],
        [
            "F",
            "Gustavus Library Associates",
            "Books in Bloom",
            "May 3-5, 2013",
            "Description",
            "",
            "Field biologist Jim Gilbert takes a month-by-month approach to the changing Minnesota seasons, emphasizing the beauties that surround us at every phase. Many seasonal highlights are together here to thrill and inspire children and adults alike.",
            "Set on the Minnesota prairie in the late 1980s during a drought season that’s pushing family farms to the brink, Little Wolves features the intertwining stories of a father searching for answers after his son commits a heinous murder, and a pastor’s wife who has returned to the town for mysterious reasons of her own.",
            "The intertwining story of three generations of German immigrants to the Midwest—their clashes with slaveholders, the Dakota uprising and its aftermath—is seen through the eyes of young Asa Senger. The unexpected appearance of Asa’s aunt Hazel, institutionalized shortly after the mass hangings of thirty-eight Dakota warriors in Mankato in 1862, reveals to Asa that the past is as close as his own heartbeat. An Alex Award winner.",
            "The summer Opal and her father move to Florida, Opal goes into the supermarket and comes out with a big, ugly dog with a sterling sense of humor. She dubs him Winn-Dixie and finds he is better at making friends than anyone she’s ever known. Together they meet new friends, and Opal spends all summer collecting stories and thinking about her mother. Opal learns that friendship and forgiveness can sneak up on you like a sudden summer storm. A Newberry Honor Book.",
            "Ruth Nelson graduated from Gustavus in 1920. From 1920-1924 she taught Math, Latin, and Bible Study and History at Gustavus Adolphus Academy, and physical education for all women at Gustavus. She married Dr. Hobart Johnson in 1926 and they spent 10 years as missionaries in Tanganyika (Tanzania). The Johnsons moved back to North Mankato and Mrs. Johnson volunteered her time and indexing expertise to the College and Lutheran Church Archives for many years. Materials from Lutheran Church Archives Collection [LCA Collection 15]",
            "Victor Hugo’s tale of injustice, heroism and love follows the fortunes of Jean Valjean, an escaped convict determined to put his criminal past behind him. His attempts to become a respected member of the community are constantly put under threat by his own conscience and by the relentless investigations of the dogged policeman Javert. It is not simply for himself that he must stay free, however, for he has sworn to protect the baby daughter of Fantine, driven to prostitution by poverty.",
            "The Periodic Table is one of man's crowning scientific achievements. But it's also a treasure trove of stories of passion, adventure, betrayal, and obsession. With infectious tales and astounding details, follow carbon, neon, silicon, and gold as they play out their parts in human history, finance, mythology, war, the arts, poison, and the lives of the (frequently) mad scientists who discovered them.",
            "Survival is second nature for sixteen-year-old Katniss Everdeen, who struggles to feed her mother and younger sister by secretly hunting and gathering beyond the fences of District 12. When Katniss steps in to take the place of her sister in the Hunger Games, she knows it may be her death sentence. Against all odds, Katniss survives the Hunger Games twice and has become the reluctant face of the revolution. The Capitol is angry and wants revenge…and no one is safe. A Golden Duck Award for Excellence in Children's Science Fiction winner and a New York Times Notable Children's Book.",
            "This complex and ambitious novel opens with Stingo, a young southerner, journeying north in 1947 to become a writer. It leads us into his intellectual and emotional entanglement with his neighbors in a Brooklyn rooming house: Nathan, a tortured, brilliant Jew, and his lover, Sophie, a beautiful Polish woman whose wrist bears the grim tattoo of a concentration camp...and whose past is strewn with death that she alone survived. A National Book Award winner.",
            "Bilbo Baggins is a hobbit who enjoys a comfortable, unambitious life, but his contentment is disturbed when the wizard Gandalf and a company of dwarves arrive one day to whisk him away on an adventure. They have launched a plot to raid the treasure hoard guarded by a large and dangerous dragon. Bilbo reluctantly joins their quest, where he will encounter both a magic ring and a frightening creature known as Gollum.",
            "A young immigrant woman settles into life outside Duluth in the 1890s, still shocked at finding herself alone in a new country; in the early 1920s, her orphan son falls in love with the one woman he shouldn’t and uses his best skills to build them their own small ark to escape. But their pasts travel with them, threatening to capsize even their fragile hope. A deeply moving tale of a misbegotten family shaped by the rough landscape in which they live and by the rough edges of their own breaking hearts.",
            "A dazzling celebration of the colorful variety in a flower garden and the cyclical excitement of gardening. A young child relates in ten simple sentences the yearly cycle and process of planning, planting, and picking flowers in a garden. Mother and child plant bulbs in fall, order seeds from catalogs in winter, eagerly anticipate the first shoots of spring, select seedlings in summer, ``and watch the rainbow grow,'' reveling in the opulence of color.",
            "Gray chronicles President Edgar M. Carlson’s vision and plan for making the recruitment of blacks a centerpiece of Gustavus’ contribution to the civil rights struggles of the ‘60s and ‘70s. Gray takes readers from the small towns and cities of the South to the urban centers of the North, where he and former Admission Director Owen Sammelson ’58 convinced students of color to make the bold decision to come to a small liberal arts college in St. Peter, Minnesota.",
            "A fascinating window into life at the center of the last great monarchy, Elizabeth the Queen is a close-up view of a woman we’ve known only from a distance, illuminating the lively personality, sense of humor, and canny intelligence with which she meets the most demanding work and family obligations.",
            "A study in leadership, On His Watch is about a man who came up through the academic ranks to lead one of America’s best colleges – Kendall’s preparation for that office and his hopes once he occupied it. It is how Kendall took on the challenges, met them with humor and persevered to advance the college he loved. It is what happened “on his watch,” as Kendall often described his time at the helm.",
            "On the eve of her ninth birthday, Rose bites into her mother's homemade lemon-chocolate cake and discovers she has a magical gift: she can taste her mother’s emotions in the slice. Soon, she’s privy to the secret knowledge that most families keep hidden: her father’s detachment, her mother’s transgression, her brother’s increasing retreat from the world. But there are some family secrets that even her cursed taste buds can’t discern. An Alex Award winner.",
            "Downton Abbey needs an heir. Lord Grantham is faced with the possibility that the house might one day belong to a distant cousin he's never met. He must deal with his scandalous daughter, Lady Mary, who many believe to be the rightful heir to Downton. Some staff are devoted to the family, but others scheme to disrupt the well-oiled workings of the estate. As World War I looms, what does fate have in store for Downton?",
            "A National Book Award winner, Round House transports readers to the Ojibwe reservation in North Dakota in an exquisitely told story of a boy on the cusp of manhood who seeks justice and understanding in the wake of a terrible crime that upends and forever transforms his family. A masterpiece of literary fiction - at once a powerful coming-of-age story, a mystery, and a tender, moving novel of family, history, and culture.",
            "Elphaba, better known as the Wicked Witch of the West, is not wicked; nor is she a formally schooled witch. Instead, she's an insecure, green Munchkinlander who's willing to take radical steps to unseat the tyrannical Wizard of Oz. Maguire relates her tumultuous childhood, spent with an alcoholic mother and a minister father, and eye-opening school years, when she befriends her roommate, Glinda.",
            "It begins with a simple ritual: every Saturday afternoon, a boy who loves to cook walks to his grandmother’s house and helps her prepare a roast chicken for dinner. The grandmother is Swedish, a retired domestic. The boy is Ethiopian and adopted, and he will grow up to become the world-renowned chef Marcus Samuelsson. This book is his love letter to food and family in all its manifestations. Named one of Vogue's Ten Best Books of the Year and a James Beard Award nominee.",
            "Doris Kearns Goodwin offers fresh insights into Lincoln's leadership style and his deep understanding of human behavior and motivation, examining his relationships with three men he selected for his cabinet: William H. Seward, Salmon P. Chase, and Edward Bates. All three men were shocked and humiliated at losing to this relatively obscure Illinois lawyer, but Lincoln ultimately gained their admiration and respect. Without them, Lincoln could not have led the nation through one of its darkest periods.",
            "Within the black-and-white striped canvas circus tents is an utterly unique experience full of breathtaking amazements called Le Cirque des Rêves. But behind the scenes, a fierce competition is underway. Celia and Marco have been trained since childhood by their mercurial instructors for a game in which only one can be left standing. Celia and Marco tumble headfirst into love, setting off a domino effect of dangerous consequences, and leaving the lives of everyone hanging in the balance. An Alex Award Book and a Guardian Book Award nominee.",
            "Olivia is good at lots of things: singing forty very loud songs, scaring the living daylights out of her little brother, reproducing Jackson Pollock's \"Autumn Rhythm #30\" on the walls at home, building sand castles and of course, wearing people out. Come one, come all for this extraordinary debut of Falconer’s unforgettable porcine heroine. A Caldecott Honor Book and Parent's Choice Gold Award Winner.",
            "The \"settling\" of the American West has been perceived throughout the world as a series of quaint, violent, and romantic adventures. But in fact, the West has a history grounded primarily in economic reality--in hardheaded questions of profit, loss, competition, and consolidation. The trappers, traders, Indians, farmers, oilmen, cowboys, and sheriffs of the Old West \"meant business\" in more ways than one, and their descendants mean business today.",
            "A month after the United States enters World War II, the country and the Erhardt family is in upheaval. Nine-year-old Lark, her mother Arlene, and Aunt Betty head to San Diego, away from Harvester, Minnesota and Arlene’s shiftless husband. In the booming wartime economy, Arlene and Betty are soon at work, leaving Lark to explore their new neighborhood, full of others with similarly uprooted lives. Away from small town expectations, the two women begin to forge new lives and new dreams, with which Lark isn’t always comfortable.",
            "Written by one of the century's truly great thinkers, Ludwig Wittgenstein's Philosophical Investigations is a remarkable--and surprisingly approachable--collection of insights, statements, and neatly displayed thinking habits of the philosopher's work on language, symbols, categories, and a host of other topics. Organized into nearly 700 short observations, this book is a treasure trove for anyone who needs to think carefully about objects, categories, and symbols, especially in relation to structured logic applications in computer programming.",
            "In 1960, at age fifty-eight, John Steinbeck and his poodle, Charley, embarked on a journey across America. Travels with Charley chronicles their journey from small towns to growing cities to glorious wilderness oases. Still awe-inspiring after fifty years, the book is a stunning evocation of America on the eve of a tumultuous decade, and an intimate look at one of America's most beloved writers.",
            "Nina Borg, a nurse, wife, and mother of two, is a compulsive do-gooder. After her estranged friend Karin leaves her a key to a public locker in the Copenhagen train station, Nina discovers a suitcase, inside of which is a three-year-old boy: naked and drugged, but alive. When Karin is discovered murdered, Nina makes a desperate trek across Denmark, trying to figure out who the boy is, where he belongs, and who exactly is trying to hunt him down. The New York Times Book Review Notable Crime Book of 2011 and the Harald Morgensen Award for Best Danish Thriller of the Year.",
            "Communion is a celebration. Do your children know what and why they celebrate? An intergenerational resource book which tells the story of Communion in the Old Testament, the New Testament, and today, including a picture book suitable for coloring, a First Communion certificate, prayer journal, creature find, discussion questions, prayers, Bible studies, and notes on leading a child to Christ. This rich teaching collection is designed for use by Christian schools, families and churches.",
            "Olivia Hunt is living alone and working on her suicide note when she gets a phone call that her younger sister, Maddie, the annoyingly happy one, is in trouble. Pulled home for the first time in years, Olivia gets a painful dose of real life as she tries to help her sister, keep her parents from running off the rails, and reconnect with the boyfriend who left without a word but might still be the love of her life.",
            ""
        ],
        [
            "G",
            "",
            "",
            "",
            "Sponsor",
            "",
            "Donna Beck, Karen Pagel, Sandy Williamson, & Marilyn Hoch",
            "Catherine Asta & Susan Wilcox",
            "Owen & Jan Sammelson; Gene & Carolyn Sandvig",
            "Deb & Corey Johnson/Sue Ripley & Roger Johnson",
            "Grandchildren of Hobart C. & Ruth G. Nelson Johnson",
            "Marisa Schloer & Chad Prachar",
            "Bob & Onie Isenberg/Stu & Marlys Johnson",
            "Jill Hagen",
            "Douglas & Victoria Huff",
            "Milt & Elaine Brostrom",
            "GLA Board in Memory of Marlys Johnson",
            "Jack and Kris Ohle",
            "Bruce & Sue Gray",
            "Janet Prehn & Janet Jensen",
            "Gustie Metro Bookies",
            "Lois Allen, Jeannie Lindstrom, & Barb Larson Taylor, Barb Krig",
            "Mim Kagol and Sponberg Family Foundation",
            "Susie Heim, Lisa Grant and Jennifer Bjorling, in memory of Janet Bjorling",
            "Jan and Russ Michaletz",
            "American Swedish Institute (ASI)",
            "Wayne Ripley",
            "Folke Bernadotte Memorial Library",
            "Dean & Jane Wahlund",
            "Robert & Kay Moline",
            "Marlys Nelson",
            "Gustavus Philosophy Department",
            "Anders Bjorling",
            "Marisa Schloer",
            "Chaplain's Office/Ann Gregory-Bruggemann",
            "Friends of GLA",
            ""
        ],
        [
            "H",
            "",
            "",
            "",
            "Designer",
            "",
            "Susan Stenson/Traverse des Sioux Garden Center",
            "Greg Njos, Richfield Flowers",
            "Greg Njos, Richfield Flowers",
            "Lorie Siebels",
            "Mary's Flowers - Mary Smith",
            "Carol Mollner",
            "Naomi Quimby",
            "St Peter Greenhouse, Danni Kuhl",
            "Linda Elvee/Victoria Huff",
            "Chuck Eggert",
            "Traverse des Sioux - Renee Bryant",
            "Kris Hanson - Drummer's Garden Center",
            "Marilyn Kluntz - Mary's Flowers",
            "Hayden Duncan",
            "Karri Anderson",
            "Totties Book Club of Minnetonka (Anne-Marie Gunderson)",
            "Leslie Nielsen - Meloy Florist Hastings",
            "Leslie Nielsen - Meloy Park Florist, Hastings",
            "Liesl Batz",
            "Sheryl Johnson",
            "Bert Ledder",
            "Margie Nelson",
            "Bert Ledder",
            "St. Peter Greenhouse, supported by the Molines",
            "Vicki Johnson/Marilyn Brown",
            "Tom Rosen",
            "Mary's Flowers",
            "Leah Witcomb - Mary's Flowers",
            "Mary's Flowers - Deb Johnson",
            "Kris Hanson - Drummer's Garden Center & Floral",
            ""
        ],
        [
            "I",
            "",
            "",
            "",
            "Bloom Donated to:",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            ""
        ],
        [
            "J",
            "",
            "",
            "",
            "GLA Contact - Sponsor",
            "",
            "",
            "",
            "",
            "",
            "Lynn McGinty/Sheryl Johnson",
            "Marisa Schloer",
            "Marlys Johnson",
            "",
            "Sonja Timmerman",
            "",
            "",
            "Sonja Timmerman",
            "Marlys Johnson",
            "",
            "",
            "",
            "",
            "Sheryl Johnson",
            "Sheryl Johnson",
            "",
            "",
            "Ruth Tillquist",
            "Dean",
            "Marlys Johnson",
            "send letter/contract",
            "Sonja Timmerman",
            "Dean Wahlund",
            "",
            "Ginny Bakke",
            "",
            ""
        ],
        [
            "K",
            "",
            "",
            "",
            "GLA Contact - Designer",
            "",
            "",
            "",
            "",
            "",
            "",
            "J",
            "Marlys Johnson",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "Marlys Johnson",
            "",
            "",
            "",
            "",
            "",
            "Marlys Johnson",
            "Bert",
            "Marlys Johnson",
            "Marilyn",
            "",
            "",
            "",
            "",
            "",
            ""
        ],
        [
            "L",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            ""
        ]
    ],
    "pageTitle": "Books in Bloom 2013 - Google Sheets",
    "title": "",
    "url": "https://docs.google.com/spreadsheets/d/1PBgw2IwhpDp9ok6zTEF56LbX-CmEpUpKYUa-vEd9nKE/edit?usp=sharing",
    "hasHeader": true,
    "headerPosition": "MIXED",
    "tableType": "RELATION",
    "tableNum": 1,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989043.35/warc/CC-MAIN-20150728002309-00228-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 880247131,
    "recordOffset": 880131616,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "} padding: 0px 3px 0px 3px; direction: ltr; overflow: hidden; white-space: normal; vertical-align: middle; font-size: 10pt; background-color: #ffffff; color: #000000; text-align: center; border-right: 1px SOLID #000000; border-bottom: 1px SOLID #000000; .ritz .waffle .s11 { } padding: 0px 3px 0px 3px; direction: ltr; overflow: hidden; white-space: normal; vertical-align: bottom; font-size: 10pt; background-color: #ffffff; color: #000000; text-align: left; border-right: 1px SOLID #000000; .ritz .waffle .s9 { } padding: 0px 3px 0px 3px; direction: ltr; overflow: hidden; white-space: normal; vertical-align: middle; font-size: 10pt; background-color: #ffffff; color: #000000; font-weight: bold; text-align: center; border-right: 1px SOLID #000000; border-bottom: 1px SOLID #000000; .ritz .waffle .s7 { } padding: 0px 3px 0px 3px; direction: ltr; overflow: hidden; white-space: normal; vertical-align: middle; font-size: 12pt; font-family: times new roman,serif,Arial; background-color: #ffffff; color: #000000; text-align: left; .ritz .waffle .s0 { } padding: 0px 3px 0px 3px; direction: ltr; overflow: hidden; white-space: normal; vertical-align: middle; font-size: 10pt; background-color: #ffffff; color: #000000; text-align: center; border-bottom: 1px SOLID #000000; .ritz .waffle .s5 { } padding: 0px 3px 0px 3px; direction: ltr; overflow: hidden; white-space: normal; vertical-align: middle; font-size: 12pt; font-family: times new roman,serif,Arial; background-color: #ffffff; color: #000000; text-align: right; border-bottom: 1px SOLID #000000; .ritz .waffle .s10 { } padding: 0px 3px 0px 3px; direction: ltr; overflow: hidden; white-space: normal; vertical-align: middle; font-size: 12pt; font-family: times new roman,serif,Arial; background-color: #ffffff; color: #000000; font-weight:",
    "textAfterTable": "Loading...",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}