{
    "relation": [
        [
            "Opponent",
            "Florida Panthers",
            "Montreal Canadiens",
            "New York Islanders",
            "Ottawa Senators",
            "Tampa Bay Lightning",
            "Washington Capitals"
        ],
        [
            "GP",
            "3",
            "3",
            "1",
            "3",
            "2",
            "1"
        ],
        [
            "W",
            "2",
            "1",
            "0",
            "1",
            "1",
            "1"
        ],
        [
            "L",
            "0",
            "2",
            "1",
            "2",
            "1",
            "0"
        ],
        [
            "T/O",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0"
        ],
        [
            "SV%",
            "0.953",
            "0.898",
            "0.800",
            "0.934",
            "0.880",
            "0.923"
        ],
        [
            "GAA",
            "1.68",
            "3.02",
            "6.73",
            "2.01",
            "3.24",
            "2.00"
        ]
    ],
    "pageTitle": "2 Weeks To Go | Maple Leafs Hotstove",
    "title": "",
    "url": "http://mapleleafshotstove.com/2013/04/15/2-weeks-to-go/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 1,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986423.95/warc/CC-MAIN-20150728002306-00327-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 154451123,
    "recordOffset": 154428663,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{1=The Leafs are presently sitting at 99.9% likelihood of making the playoffs, with a magic number of 5, and one point away from the number deemed by many to necessary to make the playoffs. Ultimately, we’re at the point where the Leafs can crash and burn and we can still count on hockey in May.}",
    "TableContextTimeStampAfterTable": "{80283=Hopefully, these next two weeks will give Frattin, Colborne, and Gardiner a chance to see more time in NHL games against opponents like the Capitals, Devils, and Islanders, who are all likely to be playing the Leafs pretty hard. I can’t help but feel like the rest of April will be like half a month worth of Christmas Eves while we constantly wait for that moment that seemed like it would never come. Playoffs!!!1, 83208=2013 NHL Mock Draft (NHL Numbers) Here’s the Mock Draft by Zona that shows which teams would get the players in their consensus rankings., 81702=The 2004 Playoff Guide (Vintage Leafs) The Leafs last playoff guide features the mask of goaltender has been retired long enough to be inducted into the Hall of Fame. It’s a good thing we don’t need to think like that anymore., 82880=2013 NHL Draft Consensus (NHL Numbers) I really enjoy these consensus rankings by Zona, and also encouraging is the quality of players who will be available late in the first round.}",
    "textBeforeTable": "With the Leafs looking to be locked in, here’s my plea for the some rest for the some of the Leafs. Lupul has already stated he won’t rush himself back because of Toronto’s recent success, Gunnarsson has been banged up and could use a game off or two, and that leaves the main guy who needs to be ready for the Playoffs, James Reimer. It’s now time to get Scrivens a couple (preferably at least 50%) of the starts for the rest of the season.   12 7 40 41 New Jersey 11 10 5 42 43 Buffalo 10 8 6 44 42 Winnipeg 9 6 7 46 41 NY Rangers 8 5 6 47 42 NY Islanders 7",
    "textAfterTable": "Looking at Scrivens record against the remain opposition, it seems like the Capitals, Senators, and Panthers would be the ideal games for Ben to start, although we’re dealing in small sample sizes given his short career. It seems like the Panthers and Capitals games will be easy decisions especially since they are part of back to back games. Hopefully, these next two weeks will give Frattin, Colborne, and Gardiner a chance to see more time in NHL games against opponents like the Capitals, Devils, and Islanders, who are all likely to be playing the Leafs pretty hard. I can’t help but feel like the rest of April will be like half a month worth of Christmas Eves while we constantly wait for that moment that seemed like it would never come. Playoffs!!!1 Monday Morning Links… Tough Call on the Leafs Inseparable Duo of Kessel and Bozak (Globe and Mail) Mirtle reminds us that we’re probably stuck with Bozak. James Reimer is Very Good Goalie (Blue Chip Prospects) I don’t see how you could argue otherwise. Reimer Continues Solid Response to Deadline Frenzy (TSN) Jonas Siegel seems to agree with Curt. The 2004 Playoff Guide (Vintage Leafs) The Leafs last playoff guide features the mask of goaltender has been retired long enough to be inducted into the Hall of Fame. It’s a good thing we don’t need to think like that anymore.",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}