{
    "relation": [
        [
            "Date",
            "May 27, 2011",
            "May 27, 2011",
            "May 27, 2011",
            "May 27, 2011",
            "May 27, 2011",
            "May 27, 2011",
            "May 27, 2011",
            "May 27, 2011",
            "May 27, 2011",
            "May 27, 2011",
            "May 27, 2011",
            "May 28, 2011",
            "May 28, 2011",
            "May 28, 2011",
            "May 28, 2011",
            "May 29, 2011",
            "May 29, 2011",
            "May 29, 2011",
            "May 30, 2011",
            "May 31, 2011",
            "May 31, 2011",
            "Jun 1, 2011",
            "Jun 4, 2011",
            "Jun 6, 2011",
            "Jun 8, 2011",
            "Aug 16, 2011",
            "Aug 21, 2011",
            "Sep 27, 2011",
            "Oct 29, 2011",
            "Feb 24, 2012",
            "Apr 16, 2012",
            "Apr 16, 2012",
            "Sep 2, 2012",
            "Apr 26, 2013",
            "Oct 25, 2013",
            "Dec 11, 2014"
        ],
        [
            "Comments",
            "Another disappointment, i hate this euro shit...please do more armory shoots with American models....more people more fun!....how come cherry torn never shot for you guys?",
            "^ ^^ |||||",
            "love the euro shoots,hope theres lots more with models out in public places with humiliation, this is public disgrace after all. Much prefer these shoots to the armory ones, if i want to see models in the armory i would be paying for one of kinks other sites.",
            "jacqueline again!!! for me is fantastic. this girl is hot, very happy with your job and full naked in the street!!! kisses pricess donna",
            "Afrooman, if its armory stuff you want, its Bound Gang Bangs you need to join up too.",
            "The Euro shoots are so boring!!! The people on the street don't care, there are no groups and even nudity and pain seem boring.",
            "I loved this shoot and it is what I signed up for. Jacqueline is a beautiful model & into it & Princess Donna seemed more into this shoot as well. It is obvious that you have two schools of thought here & you are trying to please both. If the people that prefer the Armory think about it, they are getting three of their preferred shoots to one of those in Europe. Therefore, stop whinning as you already have more then you deserve. After all it is called Public Disgrace and there is nothing public about the Armory as everyone in attendance is already into the scene.",
            "Another great shoot with Jacqueline, as beautiful as ever! Loved the settings, thank you princess donna!",
            "I like the outdoor shoots, however i'm not a fan of the European models that can barely speak English.",
            "Beautiful legs culminating into a superb ass.JACQEULIN , deserved a nice fresh hotdog at the end of the shoot,oh excuse me,she did get a nice Hot dog,stupid me.",
            "These are the worst type of scenes. Like some said the people don't care. I also don't find it very disgraceful when the girl only fucks the pornstar guys. She needs strange shoved in her ;)",
            "I agree, somewhat boring. Nice girl, needed some anal shoots.",
            "Glad it was a short one as it was boring as hell!!!!",
            "Yawn... didn't need Nodoze after this...",
            "Sorry... couldn't wake back up to comment... meant Sominex. Euro shoots may be great for Europeans - or an excuse to get on an airplane - but... they are so boring I seldom can watch very long before walking away.",
            "No lesbian/bi, no cmming from slave in German",
            "This is awesome. Love the beginning when she is toyed with the remote. Very sexy.",
            "Im not a big fan of the outdoor shoots but this one was very intriguing. Great bondage in the subway station. Jacuie was certainly into it. I liked it very much",
            "hallo in deutsch das ist sehr nett von kink freu mich. great adventure in berlin sorry about the first words but i come from germany love the action in one of europeans great citys enjoy very much the shoot thx",
            "Jaque ob du sprichst kein englisch, ich will zu sagen dass du hast so hubsch beinen und bist so schon und yummy dass wir kann dich essen. Donna ist richtig zu in Deutschland arbeiten, ich will mehr deutscher sklaven als Jacque",
            "One more thing: Deutscher sklaven uber alles! lol!",
            "i love the euro shoots, please more! this one is nice, but a new girl (we saw her once already) would have been better. And as far as i'm concerned, there are too few an*l scenes, though it's such a fine means to disgrace ;)",
            "Very nice.",
            "No complaints here! The only way this could be better is if this could some how be done in an abandoned town in the U.S. e.g. ghost town, run down inactive truck stops. I think more American models for this site would give some of the diversity kinksters are craving. More of the Kinkstar Mark Davis on this site would also rock!",
            "Seems nothing Jacqueline finds fun... looking forward to a next shoot with her.",
            "perfect, hot and funny slave all nude and barefeet!!!",
            "loved the nude and barefoot. And the euro shoots if anyone is keeping count.",
            "Great shoot, love the euro girls, I would love to see more black girls , like Skin Diamond or Coffee Brown .",
            "@502646 Ooooh, but I hope you're a multi-language-guy...so write down your silly comment in french, spanish, italian, german, polish, hungarian, swedish and the other european languages. And remember this simple rule, you fool: Don't like it, don't watch it !",
            "das war sehr schon der film, und inderessand das auch deutsche frauen darauf steht",
            "I love this euro shoots - and two questions: 1. how to buy those pads, electrifying the girl and 2. may be my girlfriend would expose as modell, if you like ... ?",
            "I love this euro shoots - and two questions: 1. how to buy those pads, electrifying the girl and 2. may be my girlfriend would expose as modell, if you like ... ?",
            "Ok shoot",
            "Loved the hawk mask and arms tied behind her back! Great girl!",
            "Nice work, she has fun which makes it a good shoot.",
            "Cool girl! More, please!"
        ],
        [
            "Name",
            "afrooman",
            "afrooman",
            "cyanthree",
            "dramatica_sexy",
            "menips",
            "cleslie1",
            "xatby",
            "P4sh4u",
            "502646",
            "chaz1637",
            "jasonbourne009",
            "Bear31746",
            "maleslut2use",
            "Thanatos",
            "Thanatos",
            "knightxv",
            "qwertpoi1",
            "assfix",
            "winfried666",
            "signorexv",
            "signorexv",
            "fluegelthier",
            "cologneman2008",
            "simonblaise",
            "NorbertB",
            "dramatica_sexy",
            "Rabidnid",
            "Paidinfull007",
            "ethiopia",
            "Pomms",
            "von_Stephan",
            "von_Stephan",
            "funcouple989",
            "pr0ndude",
            "OilBoyUK",
            "Kinkcoolcat"
        ],
        [
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            ""
        ],
        [
            "Vote",
            "Great! (5)",
            "Great! (5)",
            "Great! (5)",
            "Great! (5)",
            "Great! (5)",
            "Poor (1)",
            "Great! (5)",
            "Great! (5)",
            "Fair (3)",
            "Great! (5)",
            "Poor (1)",
            "Good (4)",
            "Poor (1)",
            "Poor (1)",
            "Poor (1)",
            "Below average (2)",
            "Great! (5)",
            "Great! (5)",
            "Great! (5)",
            "Great! (5)",
            "Great! (5)",
            "Good (4)",
            "Great! (5)",
            "Great! (5)",
            "Great! (5)",
            "Great! (5)",
            "Great! (5)",
            "Great! (5)",
            "Great! (5)",
            "Below average (2)",
            "Great! (5)",
            "Great! (5)",
            "Fair (3)",
            "Great! (5)",
            "Great! (5)",
            "Great! (5)"
        ]
    ],
    "pageTitle": "Exposed Fucked and Humilated all in Public",
    "title": "",
    "url": "http://www.publicdisgrace.com/site/shoot/10028-Exposed-Fucked-and-Humilated-all-in-Public.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 1,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986423.95/warc/CC-MAIN-20150728002306-00203-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 664079356,
    "recordOffset": 664063426,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{5769=May 27, 2011 - Performers: Princess Donna Dolore , Tommy Pistol and Jacqueline Black Lady}",
    "TableContextTimeStampAfterTable": "{15454=chaz1637, 32776=@502646 Ooooh, but I hope you're a multi-language-guy...so write down your silly comment in french, spanish, italian, german, polish, hungarian, swedish and the other european languages. And remember this simple rule, you fool: Don't like it, don't watch it !, 27388=cologneman2008, 48236=18 U.S.C. 2257 Record-Keeping Requirements Compliance Statement   All sexual activities and acts of public sex depicted on PublicDisgrace.com are fully legal and have been filmed in full compliance with the laws of the material's respective country of production. No minors were present during the filming of any sexual activity depicted on this website. All material shown on this website is consensual. No model was harmed during the filming of these movies.  Copyright ©2015 Kink.com, 17302=Bear31746, 14500=502646}",
    "textBeforeTable": "kink.ratings.ajaxRatingSubmitInit(); // INIT // } }); return false; }); } $('.knk-shoot-rating-error').fadeIn(); error: function (xhr, status, errorThrown) { }, $('.knk-shoot-rating-help').fadeIn(); success: function (data, status, xhr) { dataType: 'json', data: \"shootId=\" + 10028 + \"&rating=\" + $('select[name=rating]:first').val(), url: \"/site/rating_submit.jsp;jsessionid=55752D8738DC089C886654BDCC5A9370\", $.ajax({ e.preventDefault(); ratingSubmitBtn.on('click', function (e) { var ratingSubmitBtn = $(\".knk-rating-submit-btn:first\"); kink.ratings.ajaxRatingSubmitInit = function () { // Ratings // kink.ratings = kink.ratings || {}; var kink = kink || {};",
    "textAfterTable": "Stay Connected: Kink.com BDSM/Bondage Fetish Gay Femdom Kink On Demand Pay Per View Kink Live Live Shows and Cams Kink Archive Classic Kink Behind Kink Behind the Scenes ArmoryStudios.com Buy Tour and Workshop Tickets BDSM Resources Education",
    "hasKeyColumn": true,
    "keyColumnIndex": 2,
    "headerRowIndex": 0
}