{
    "relation": [
        [
            "Player",
            "Drew Brees",
            "Kris Dielman",
            "Antonio Gates",
            "Mike Scifres",
            "Igor Olshansky",
            "Nate Kaeding",
            "Nick Hardwick",
            "Shaun Phillips",
            "Michael Turner",
            "Shane Olivea",
            "Wes Welker",
            "Malcolm Floyd",
            "Vincent Jackson",
            "Darren Sproles",
            "Marcus McNeill",
            "Dan Carpenter"
        ],
        [
            "Draft",
            "2001",
            "2003",
            "2003",
            "2003",
            "2004",
            "2004",
            "2004",
            "2004",
            "2004",
            "2004",
            "2004",
            "2004",
            "2005",
            "2005",
            "2006",
            "2008"
        ],
        [
            "Round",
            "2nd",
            "Undrafted",
            "Undrafted",
            "5th",
            "2nd",
            "3rd",
            "3rd",
            "4th",
            "5th",
            "7th",
            "Undrafted",
            "Undrafted",
            "2nd",
            "4th",
            "2nd",
            "Undrafted"
        ],
        [
            "Pick",
            "32",
            "Undrafted",
            "Undrafted",
            "149",
            "35",
            "65",
            "66",
            "98",
            "154",
            "209",
            "Undrafted",
            "Undrafted",
            "61",
            "130",
            "50",
            "Undrafted"
        ],
        [
            "Accolades",
            "3x Pro-Bowler, Super Bowl XLIV MVP, 3x All-Pro Selection",
            "3x Pro-Bowler",
            "6x Pro-Bowler, 2000 All-Decade Team",
            "3x Pro-Bowl Alternate",
            "Signed a 4 year, $18 million contract w/Dallas in 09 after 4 successful seasons with San Diego.",
            "2x Pro-Bowl Selection",
            "1x Pro-Bowler",
            "45.5 sacks",
            "Signed a 6 year, $34.5 million contract w/Atlanta, 1x Pro-Bowler, 1,700 rusher",
            "Signed a 6-year, $20 million w/San Diego in 06. Signed by Super Bowl winning Giants in 08.",
            "2x Pro-Bowler, 2x Reception Leader",
            "Current #2 Receiver",
            "1x Pro-Bowler",
            "1st & 3rd round tender in 2009",
            "2x Pro-Bowler",
            "1x Pro-Bowler for Miami"
        ]
    ],
    "pageTitle": "Charlie Whitehurst: What it Means for Denver - BroncoTalk",
    "title": "",
    "url": "http://broncotalk.net/2010/03/14603/broncos-news/charlie-whitehurst-what-it-means-for-denver/comment-page-1/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 0,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986423.95/warc/CC-MAIN-20150728002306-00094-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 34981959,
    "recordOffset": 34965565,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{14778=Well thanks a lot Pete Carroll. Just when it was looking like the Chargers “Super Bowl window” was closing something like this had to happen. If you haven’t heard yet the Seattle Seahawks have traded their 2011 third round pick and switched second round spots (around 20 places apart) with the San Diego Chargers for their third string quarterback Charlie Whitehurst., 15291=Yes, I did say a third string quarterback. Whitehurst hasn’t thrown a single pass in the NFL, but he has rushed for a touchdown his rookie year… which was 2006. You may be thinking, well he’s young. To put Whitehurst’s youth into perspective, he’s year older than Derek Anderson. Say what you want about DA, but at least he’s started a good amount of games, and was given a Pro-Bowl nod. With the acquisition of Whitehurst Seattle is heavily invested in his future. They will either need to draft a left tackle at the 6th position (Russell Okung will most likely be gone by then, so Trent Williams or Bruce Campbell, both could be available at 14 too) or give him an elite wide receiver to work with (hell an actual running back would be nice). If Pete Carroll feels comfortable with going offensive line at 14th overall, he might just pull the trigger on Brandon Marshall. Don’t expect anything dramatic anytime soon though. Also, what does this all say about Carroll’s faith in Matt Hassellbeck? Is Whitehurst going to sit behind Hassellbeck for a season? Does make sense to acquire a soon to be 28 year old quarterback to bench him for a season?, 16555=As trade repercussions go, this is just what A.J. Smith needed… more ammunition to rebuild the ailing defensive line and add flexibility for drafting a running back. San Diego now holds the 28th and 40th picks in the 2010 draft, as well as three picks in the third round in 2011. The Chargers can turn any pick into a solid player. Hell, the Chargers have turned a couple of undrafted players into Pro-Bowlers. Here’s a list of some players the Chargers have drafted beyond the first round., 10889=Published on 03/18/2010 at Thu Mar 18 11:27. Tagged: 2010 Draft,A.J Smith,Brandon Marshall,Bruce Campbell,Charlie Whitehurst,Derek Anderson,Draft,Matt Hassellbeck,Pete Carroll,Russell Okung,Top Stories,Trent Williams., 20787=You may notice that there are no 2007 selections and only one 2008 player who didn’t even play as a Charger. Well, this is because it is just only now that one can tell who is booming and busting. I considered a few players from those drafts (such as Eric Weddle) but left them off the list because they still have another year or two to prove., 34195=As much as I hate to see SD get “reloaded” they need to change something in order to keep their window “open.” Since 2002 the super Chargers are 4-5 in the playoffs. Including 3 first round exits, and at least two of them they were in the sportscaster mix to go to the Superbowl. They are endemically flawed in the front office, and are lead on the field by a bunch of self-righteous, selfish and immature players., 20307=As you can see it is obvious why San Diego has been serious playoff contenders and AFC West champions ever since 2006. The draft class they had in 2004 is absolutely unreal. Could you imagine if San Diego would have kept Welker and Turner around? The table shows exactly how to build a franchise, by drafting that well at all levels of the draft. First round selections by San Diego aren’t even listed above either, and we know how successful they are in that field.}",
    "textBeforeTable": "As trade repercussions go, this is just what A.J. Smith needed… more ammunition to rebuild the ailing defensive line and add flexibility for drafting a running back. San Diego now holds the 28th and 40th picks in the 2010 draft, as well as three picks in the third round in 2011. The Chargers can turn any pick into a solid player. Hell, the Chargers have turned a couple of undrafted players into Pro-Bowlers. Here’s a list of some players the Chargers have drafted beyond the first round. Yes, I did say a third string quarterback. Whitehurst hasn’t thrown a single pass in the NFL, but he has rushed for a touchdown his rookie year… which was 2006. You may be thinking, well he’s young. To put Whitehurst’s youth into perspective, he’s year older than Derek Anderson. Say what you want about DA, but at least he’s started a good amount of games, and was given a Pro-Bowl nod. With the acquisition of Whitehurst Seattle is heavily invested in his future. They will either need to draft a left tackle at the 6th position (Russell Okung will most likely be gone by then, so Trent Williams or Bruce Campbell, both could be available at 14 too) or give him an elite wide receiver to work with (hell an actual running back would be nice). If Pete Carroll feels comfortable with going offensive line at 14th overall, he might just pull the trigger on Brandon Marshall. Don’t expect",
    "textAfterTable": "As you can see it is obvious why San Diego has been serious playoff contenders and AFC West champions ever since 2006. The draft class they had in 2004 is absolutely unreal. Could you imagine if San Diego would have kept Welker and Turner around? The table shows exactly how to build a franchise, by drafting that well at all levels of the draft. First round selections by San Diego aren’t even listed above either, and we know how successful they are in that field. You may notice that there are no 2007 selections and only one 2008 player who didn’t even play as a Charger. Well, this is because it is just only now that one can tell who is booming and busting. I considered a few players from those drafts (such as Eric Weddle) but left them off the list because they still have another year or two to prove. If A.J. Smith stays on his hot streak then Seattle just reignited his drafting fire, and Denver might have to deal with the same red hot late season surging Chargers for many more years.",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}