{
    "relation": [
        [
            "layer_no",
            "1",
            "2",
            "3",
            "4",
            "5",
            "1",
            "2",
            "3",
            "4",
            "5",
            "6"
        ],
        [
            "inv_layer_no",
            "1",
            "1",
            "2",
            "3",
            "4",
            "1",
            "1",
            "2",
            "3",
            "4",
            ""
        ],
        [
            "description",
            "7",
            "6",
            "5",
            "4",
            "3",
            "7",
            "6",
            "5",
            "4",
            "3",
            "1"
        ],
        [
            "layer_type",
            "SS",
            "GS",
            "GB",
            "AC",
            "AC",
            "SS",
            "GS",
            "GB",
            "AC",
            "AC",
            "AC"
        ],
        [
            "repr_thickness",
            "54.0",
            "24.9",
            "7.4",
            "5.9",
            "1.6",
            "54.0",
            "24.9",
            "7.4",
            "5.5",
            "0",
            "2.2"
        ],
        [
            "matl_code",
            "282",
            "308",
            "308",
            "1",
            "1",
            "282",
            "308",
            "308",
            "1",
            "1",
            "1"
        ],
        [
            "construction_no",
            "1",
            "1",
            "1",
            "1",
            "1",
            "2",
            "2",
            "2",
            "2",
            "2",
            "2"
        ]
    ],
    "pageTitle": "Appendix A. LTPP Operations Reference Documents - Introduction to The LTPP Information Management System (IMS), November 2003 - FHWA-RD-03-088",
    "title": "",
    "url": "http://www.fhwa.dot.gov/publications/research/infrastructure/pavements/ltpp/reports/03088/app.cfm",
    "hasHeader": true,
    "headerPosition": "MIXED",
    "tableType": "RELATION",
    "tableNum": 15,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986423.95/warc/CC-MAIN-20150728002306-00148-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 449438319,
    "recordOffset": 449397188,
    "tableOrientation": "VERTICAL",
    "TableContextTimeStampBeforeTable": "{145870=Southern Region SPS Tour, FHWA, Pavement Performance Division, October 1995., 141567=SPS-6 Project 4006, Rehabilitation of Jointed Portland Cement Concrete Pavements, IH-35 Southbound, Kay County, Oklahoma, Final Report, FHWA, Pavement Performance Division, June 1993., 164152=Materials Sampling and Testing Plan, New Mexico SPS-5 Project 350500, IH-10 EBL, Grant County, New Mexico, FHWA, Pavement Performance Division, September 1995., 123877=LTPP Seasonal Monitoring Program: Site Installation and Initial Data Collection, Section 481077, Estelline, Texas, FHWA, Pavement Performance Division, January 1995., 146823=SPS-9 Construction Report, I-43 Near Milwaukee, Wisconsin, Sections 55A901 to 55A909 and Sections 55B901 to 55B909, FHWA, Pavement Performance Division, June 1994., 160763=Materials Sampling and Testing Plan, New Mexico SPS-9 A Project 350900, Grant County, New Mexico, IH-10 Eastbound, FHWA, Pavement Performance Division, August 1995., 191305=Distress Identification Manual for the Long-Term Pavement Performance Studies, Operational Guide No. SHRP-LTPP-OG-001, SHRP, National Research Council, 1993., 148099=SPS-7 Construction Report, Interstate 94 Eastbound, Between Moorhead and Barnesville, Minnesota, Sections 270701 to 270709, FHWA, Pavement Performance Division, June 1996., 65561=The peak deflection values recorded by all sensors are stored within the MON_DEFL_DROP_DATA table. The sensor spacing figures can be extracted from MON_DEFL_DEV_SENSORS. A suitable SQL statement must be constructed to relate the tables so that the recorded deflection values can be matched to the appropriate sensor spacing. This can be done with the CONFIGURATION field from the MON_DEFL_LOC_INFO table. The first step is to extract the raw deflection data for the section and date in question, in this case, 341003 on March 11, 1999:, 166798=Materials Sampling and Testing Plan, SPS-9 A, Highway 16 (Yellowhead Highway), Saskatoon, Saskatchewan, FHWA, Pavement Performance Division, May 1996., 175524=LTPP Traffic QC Software, Technical Documentation, FHWA, Pavement Performance Division, 1997., 153592=Construction Report on LTPP 340500, SPS-5 Project, Imlaystown, New Jersey, FHWA, Pavement Performance Division, December 1994., 120043=LTPP Seasonal Monitoring Program: Site Installation and Initial Data Collection, Section 533813, Camas, Washington, Publication No. FHWA-53-3813, FHWA, Pavement Performance Division, May 1997. LTPP Seasonal Monitoring Program: Site Installation and Initial Data Collection, Section 561007, Cody, Wyoming, Publication No. FHWA-56-1007, FHWA, Pavement Performance Division, February 1994., 155896=Construction Report on SHRP 100100, SPS-1 Project, Ellendale, Delaware, Publication No. FHWA-TS-96-10-01, FHWA, Pavement Performance Division, June 1996., 139381=SPS-9 A Project 2809, Superpave Asphalt Binder Study, IH-55 Southbound, Panola County, Mississippi, Final Report, FHWA, Pavement Performance Division, November 1996., 182588=Specific Pavement Studies , Experimental Design and Research Plan for Experiment SPS-5 , Rehabilitation of Asphalt Concrete Pavements, SHRP, National Research Council, April 1989., 138704=Construction Report on Site 040200, Interstate Highway No. I-10, Maricopa County, Arizona, Final Report, FHWA, Pavement Performance Division, May 1994., 142978=SPS-5 Project 1305, Asphalt Rehabilitation Study, IH-75 Southbound, Bartow County, Georgia, Final Report, FHWA, Pavement Performance Division, January 1996., 176025=Load Equivalency Factors (LEF) Estimates for GPS-LTPP Rigid Pavements Based on SHRP-LTPP IMS Inventory Data, Tech Memo No. AU-168, November 1990., 186375=Specific Pavement Studies , Pavement Layering Methodology, FHWA, Pavement Performance Division, January 1994., 119433=Seasonal Instrumentation Pilot Study, Instrumentation Installation, Montana Section 308129, FHWA, Pavement Performance Division, December 1992., 127209=LTPP Seasonal Monitoring Program, Site Installation Report for GPS Section 313018 (31B), Kearney, Nebraska, FHWA, Pavement Performance Division, February 1996., 173838=LTPP-SPS Automated Weather Stations: AWSCheck Users Guide, Version 1.1, FHWA, Pavement Performance Division, November 1996., 189860=TPP Manual for Falling Weight Deflectometer Measurements, Operational Field Guidelines, Version 2.0, FHWA, Pavement Performance Division, LTPP Division, February 1993., 146416=SPS-9 A Construction Report, U.S. Highway 81 Southbound, 80 Miles Southwest of Lincoln, Nebraska, (4 Miles) North of the Kansas Border, Sections 310901 to 310903, FHWA, Pavement Performance Division, June 1996., 161165=Materials Sampling and Testing Plan, Florida SPS-9 A Project 120900, Columbia County, Florida, IH-10 Eastbound, FHWA, Pavement Performance Division, March 1996., 135434=Construction Report on Site 530200, SR 395, Adams County, Washington, Final Report, FHWA, Pavement Performance Division, March 1997., 142018=SPS-6 Project 0106, Rehabilitation of Jointed Portland Cement Concrete Pavements, I-59 Southbound, Etowah County, Alabama, Final Report, FHWA, Pavement Performance Division, May 1999., 192287=Strategic Highway Research Program, Research Plans, Final Report, TRB, National Research Council, National Cooperative Highway Research Program (NCHRP), May 1986., 178376=Specific Pavement Studies , Materials Sampling and Testing Requirements for Experiment SPS-8 , Study of Environmental Effects in the Absence of Heavy Loads, Operational Memorandum No. SHRP-LTPP-OM-030, SHRP, National Research Council, August 1992., 192734=An Investment Benefiting America's Highways, The Long-Term Pavement Performance Program, FHWA, Pavement Performance Division, 2001., 126218=LTPP Seasonal Monitoring Program, Site Installation Report for GPS Section 906405 (90A), Plunkett, Saskatchewan, FHWA, Pavement Performance Division, January 1996., 162145=Materials Sampling and Testing Plan, Mississippi SPS-8 Project 280800, SR-315 NBL, Panola County, Mississippi, FHWA, Pavement Performance Division, April 1996., 193221=America's Highways, Accelerating the Search for Innovation, Special Report 202, TRB, National Research Council, June 1984., 168459=Summary of Test Run at the Kansas SPS-2 Project in 1992, FHWA, Pavement Performance Division, April 1993., 129102=LTPP Seasonal Monitoring Program: Site Installation and Initial Data Collection, Section 893015, Trois-Rivieres, Quebec, Publication No. FHWA-TS-94-89-01, FHWA, Pavement Performance Division, June 1996., 138123=Construction Report on Site 040900/04A900, U.S. 93, Arizona Department of Transportation, Kingman, Arizona, Final Report, FHWA, Pavement Performance Division, December 1997., 147342=SPS-9 Construction Report, US-54 Near Greensburg, Kansas, Sections 200901 to 200903, FHWA, Pavement Performance Division, December 1993., 187513=LTPP Seasonal Monitoring Program: ONSFIELD Users Guide, Version 1.2, FHWA, Pavement Performance Division, June 1996., 134906=Construction Report on Site 810500, Highway 16, Alberta Transportation and Utilities Department, Edson, Alberta, Final Report, FHWA, Pavement Performance Division, July 1993., 130060=LTPP Seasonal Monitoring Program: Site Installation and Initial Data Collection, Section 501002, New Haven, Vermont, Publication No. FHWA-TS-94-50-01, FHWA, Pavement Performance Division, December 1994., 152469=Construction Report on LTPP 090900, SPS-9 A Project, Colchester, Connecticut, Publication No. FHWA-TS-98-09-02, FHWA, Pavement Performance Division, June 1998., 136560=Construction Report on Site 300100, Interstate Highway 15, Cascade County, Montana, Final Report, FHWA, Pavement Performance Division, November 2002., 178881=Specific Pavement Studies , Data Collection Guidelines for Experiment SPS-8 , Study of Environmental Effects in the Absence of Heavy Loads, Operational Memorandum No. SHRP-LTPP-OM-031, SHRP, National Research Council, September 1992., 153057=Construction Report on LTPP 360800, SPS-8 Project, Lake Ontario State Parkway, Brockport, New York, Publication No. FHWA-TS-95-36-01, FHWA, Pavement Performance Division, March 1995., 174546=Users Manual for Level 3 Through 1LTPP Traffic Quality Control Software, FHWA, Pavement Performance Division, July 1997., 150053=SPS-2 Construction Report, US 23 Northbound, Monroe County, Michigan, FHWA, Pavement Performance Division, December 1995., 167920=Sampling, Testing, and Monitoring Activities, SPS-5 , Plan for Test Sections Located on Highway 1 Westbound Near Brokenhead River, Manitoba, Canada, FHWA, Pavement Performance Division, June 1989., 171712=SPS-5 Materials Sampling and Testing Plans, Project 230500, I-95 NB, Argyle, Maine, FHWA, Pavement Performance Division, July 1994., 183088=Specific Pavement Studies , Construction Guidelines for Experiment SPS-5 , Rehabilitation of Asphalt Concrete Pavements, Operational Memorandum No. SHRP-LTPP-OM-012, SHRP, National Research Council, June 1990., 102946=This appendix contains two data extraction examples. They illustrate productive practices for dealing with data from the LTPP database using the SQL. These examples provide one method for organizing data from an RDBMS. Some software packages provide other methods of querying data, such as the query interface in Microsoft Access 2000., 139780=SPS-9 A Project 0509, Superpave Asphalt Binder Study, US-65 Southbound, Pulaski County, Arkansas, Final Report, FHWA, Pavement Performance Division, September 1997., 122369=LTPP Seasonal Monitoring Program: Site Installation and Initial Data Collection, Section 040215, Kingman, Arizona, Publication No. FHWA-04-0215, FHWA, Pavement Performance Division, May 1997., 173431=Development of an Instrumentation Plan for the Ohio SPS Test Pavement, Final Report, Publication No. DEL-23-17.48, Ohio DOT and FHWA, October 1994., 133855=SPS-3 Construction Report, SHRP Western Region, Final Report, SHRP, National Research Council, December 1990., 148640=SPS-6 Construction Report, US-10 Eastbound, Bay County, Michigan, FHWA, Pavement Performance Division, December 1995., 123266=LTPP Seasonal Monitoring Program: Site Installation and Initial Data Collection, Section 484142, Jasper, Texas, FHWA, Pavement Performance Division, February 1995., 142589=SPS-5 Project 3505, Asphalt Rehabilitation Study, IH-10 Eastbound, Grant County, New Mexico, Final Report, FHWA, Pavement Performance Division, May 1997., 145267=SPS-1 Project 1201, Strategic Study of Structural Factors for Flexible Pavements, US-27 Southbound, Palm Beach County, Florida, Final Report, FHWA, Pavement Performance Division, December 1996., 150582=SPS-1 Construction Report, STH 29 Westbound, Marathon County, Wisconsin, Sections 550113 to 550124, FHWA, Pavement Performance Division, March 2000., 186992=LTPP Seasonal Monitoring Program: SMPCheck Users Guide, Version 5.0, FHWA, Pavement Performance Division, January 2000., 124898=LTPP Seasonal Monitoring Program: Site Installation and Initial Data Collection, Section 281802, Laurel, Mississippi, FHWA, Pavement Performance Division, February 1996., 139178=SPS-9 A Project 3509, Superpave Asphalt Binder Study, IH-10 Eastbound, Grant County, New Mexico, Final Report, FHWA, Pavement Performance Division, May 1997., 167334=Draft Sampling and Testing Plan, SPS-8 Experimental Project, Apple Lane, Marathon County, Wisconsin, FHWA, Pavement Performance Division, updated July 1997., 179411=Specific Pavement Studies , Materials Sampling and Testing Requirements for Experiment SPS-7 , Bonded Portland Cement Concrete Overlays, Operational Memorandum No. SHRP-LTPP-OM-020, SHRP, National Research Council, January 1991., 166390=Materials Sampling and Testing Plan, Arkansas SPS-1 Project 050100, US-63 NBL, Craighead County, Arkansas, FHWA, Pavement Performance Division, January 1993., 184081=Specific Pavement Studies , Guidelines for Nomination and Evaluation of Candidate Projects for Experiment SPS-2 , Strategic Study of Structural Factors for Rigid Pavements, Operational Memorandum No. SHRP-LTPP-OM-009, SHRP, National Research Council, April 1990., 121909=LTPP Seasonal Monitoring Program: Site Installation and Initial Data Collection, Section 063042, Lodi, California, Publication No. FHWA-06-3042, FHWA, Pavement Performance Division, May 1997., 125737=LTPP Seasonal Monitoring Program: Site Installation and Initial Data Collection, Section 131005, Warner Robins, Georgia, FHWA, Pavement Performance Division, February 1996., 153941=Construction Report on LTPP 230500, SPS-5 Project, Argyle, Maine, Publication No. FHWA-TS-95-23-02, FHWA, Pavement Performance Division, December 1995., 174993=Revised Data Collection Plan for LTPP Sites, FHWA, Pavement Performance Division, April 1998., 158819=Materials Sampling, Field Testing, and Laboratory Testing Plan, Strategic Highway Research Program, SPS-2 Experiment Project, Federal Aid Project No. ACNH-P099(370)Y, SR 99 at and Near Delhi and Various Locations, Merced County, California, FHWA, Pavement Performance Division, February 1999., 151043=SPS-1 Construction Report, U.S. Highway 81 Southbound, 80 Miles Southwest of Lincoln, Nebraska, (4 Miles) North of the Kansas Border, Sections 310113 to 310124, FHWA, Pavement Performance Division, June 1996., 156921=Materials Sampling, Field Testing, and Laboratory Testing Plan, Strategic Highway Research Program, SPS-8 Experimental Project, Project Nos. PFH 176-1(1) and RS-A070(002), North Touchet Road, Columbia County, Washington, FHWA, Pavement Performance Division, June 1994., 185086=Specific Pavement Studies , Materials Sampling and Testing Requirements for Experiment SPS-1 , Strategic Study of Structural Factors for Flexible Pavements, FHWA, Pavement Performance Division, revised January 1994., 165641=Materials Sampling and Testing Plan, New Mexico SPS-1 Project 350100, IH-25 NBL, Dona Ana County, New Mexico, FHWA, Pavement Performance Division, June 1994., 136993=Construction Report on Site 080500, Interstate 70, Colorado Department of Transportation, Lincoln County, Colorado, Final Report, FHWA, Pavement Performance Division, October 1994., 140906=SPS-8 Project 0508, Environmental Effects in the Absence of Heavy Loads, US-65 East Terminal Interchange, Right Frontage Road, Jefferson County, Arkansas, Final Report, FHWA, Pavement Performance Division, December 1998., 180689=Specific Pavement Studies , Materials Sampling and Testing Requirements for Experiment SPS-6 , Rehabilitation of Jointed Portland Cement Concrete Pavements, Operational Memorandum No. SHRP-LTPP-OM-019, SHRP, National Research Council, January 1991., 168997=Sampling and Testing Plan, SPS-1 Experimental Project, US-27 Southbound, Clinton County, Michigan, FHWA, Pavement Performance Division, February 1994., 129582=LTPP Seasonal Monitoring Program: Site Installation and Initial Data Collection, Section 510114, Danville, Virginia, Publication No. FHWA-TS-96-51-02, FHWA, Pavement Performance Division, June 1996., 121448=LTPP Seasonal Monitoring Program: Site Installation and Initial Data Collection, Section 161010, Idaho Falls, Idaho, Publication No. FHWA-16-1010, FHWA, Pavement Performance Division, February 1994., 128214=LTPP Seasonal Monitoring Program, Site Installation Report for GPS Section 271018 (27A), Little Falls, Minnesota, FHWA, Pavement Performance Division, January 1996., 143676=SPS-3 Construction Report, SHRP Southern Region Coordination Office, FHWA, Pavement Performance Division, January 1991., 126809=LTPP Seasonal Monitoring Program, Site Installation Report for GPS Section 469187 (46B), Faith, South Dakota, FHWA, Pavement Performance Division, February 1996., 176165=Guide to LTPP Traffic Data Collection and Processing, FHWA, Pavement Performance Division, March 2001., 120501=LTPP Seasonal Monitoring Program: Site Installation and Initial Data Collection, Section 491001, Bluff, Utah, Publication No. FHWA-49-1001, FHWA, Pavement Performance Division, February 1994., 190749=Guidelines for Users of the SHRP FWD Calibration Centers, Publication No. FHWA-SA-95-038, FHWA, Pavement Performance Division, November 1994., 161733=Materials Sampling and Testing Plan, Texas SPS-8 Project 480800, FM-2223 EBL, Brazos County, Texas, FHWA, Pavement Performance Division, August 1995., 171180=SPS-6 Materials Sampling and Testing Plans, Project 420600, I-80 WB, Centre County, Pennsylvania, FHWA, Pavement Performance Division, July 1994., 164719=Materials Sampling and Testing Plan, Alabama SPS-5 Project 010500, US-84 EBL, Houston County, Alabama, FHWA, Pavement Performance Division, March 1996., 190440=LTPP Manual for Profile Measurements, Operational Field Guidelines, Version 3.1, FHWA, Pavement Performance Division, January 1999., 169488=SPS-9 A Materials Sampling and Testing Plans, Projects 890900, NR 170 WB, and 89A900, NR 170 EB, Jonquiere, Quebec, FHWA, Pavement Performance Division, revised February 1997., 191828=Analysis of Pavement Homogeneity, Non-Representative Test Pit and Section Data, and Structural Capacity, FWDCHECK, Version 2.0, Volume I: Technical Report, Volume 2: Users Guide, Publication Nos. SHRP-P-633 and SHRP-P-634, SHRP, National Research Council, January 1991., 70518=For sections within SMP, subsurface temperatures can be extracted from the SMP_MRCTEMP_* tables. However, temperature gradients in the pavement surface layer are also manually collected during FWD testing for both SMP and non-SMP test sections. These pavement temperature readings were taken at regular 30- to 60-minute intervals during deflection testing at each LTPP site and are stored within the MON_DEFL_TEMPS_DEPTHS and MON_DEFL_TEMPS_VALUES tables. We will have to extract the temperatures, depths, and times into a single table and the deflection values, deflection test locations, and times into another table. An interpolation process must then be used to estimate the temperature gradient present within the AC pavement layers at the time of the actual deflection test. Assuming that we want data from site 341003 for a test conducted on 3/11/99, the required SQL statement is:, 162586=Materials Sampling and Field Testing Plan, Louisiana SPS-7 Project 2207, IH-10 Eastbound, Ascension Parish, Louisiana, FHWA, Pavement Performance Division, May 1991., 154462=Construction Report on LTPP 51A300, SPS-3 Project, Petersburg, Virginia, FHWA, Pavement Performance Division, 1990., 136011=Construction Report on Site 320100, Interstate Highway No. I-80, Humboldt and Lander Counties, Nevada, Final Report, FHWA, Pavement Performance Division, March 1998., 34092=Because we did not specify a CONSTRUCTION_NO, we received two sets of layer information. The differences are attributable to a mill and AC overlay operation that occurred in 1994. (The type of operation can be determined by querying CN_CHANGE_REASON in the EXPERIMENT_SECTION table.) The thickness of layer 5 was reduced to 0, layer 4 was reduced in thickness, and layer 6 was added to the cross section of this site at that time. This example illustrates two important aspects of TST_L05B:, 177274=Specific Pavement Studies , Construction Guidelines for Experiment SPS-9 A, Superpave Asphalt Binder Study, FHWA, Pavement Performance Division, September 1995., 163189=Materials Sampling and Field Testing Plan, Arkansas SPS-6 Project 05A6, US-65 Southbound, Jefferson County, Arkansas, FHWA, Pavement Performance Division, June 1997., 179910=Specific Pavement Studies , Experimental Design and Research Plan for Experiment SPS-7 , Bonded Portland Cement Concrete Overlays, SHRP, National Research Council, February 1990., 188157=SHRP-LTPP Interim Guide for Laboratory Materials Handling and Testing, Operational Guide No. SHRP-LTPP-OG-004, SHRP, National Research Council, November 1989, revised July 1997., 177838=Specific Pavement Studies , Experimental Design and Research Plan for Experiment SPS-9 , Validation of SHRP Asphalt Specifications and Mix Design and Innovations in Asphalt Pavements, SHRP, National Research Council, February 1992., 175393=LTPP Traffic Software Technical Documentation, FHWA, Pavement Performance Division, July 1997., 125941=LTPP Seasonal Monitoring Program: Site Installation and Initial Data Collection, Section 010102, Opelika, Alabama, FHWA, Pavement Performance Division, February 1996., 176865=Specific Pavement Studies , Guidelines for Nomination and Evaluation of Candidate Projects for Experiment SPS-9 A, Superpave Asphalt Binder Study, FHWA, Pavement Performance Division, August 1994., 142398=SPS-5 Project 4005, Asphalt Rehabilitation Study, US-62 Westbound, Comanche County, Oklahoma, Final Report, FHWA, Pavement Performance Division, October 1998., 162788=Materials Sampling and Field Testing Plan, Tennessee SPS-6 Project 4706, IH-40 Westbound, Madison County, Tennessee, FHWA, Pavement Performance Division, June 1995., 185418=Specific Pavement Studies , Guidelines for Nomination and Evaluation of Candidate Projects for Experiment SPS-1 , Strategic Study of Structural Factors for Flexible Pavements, Operational Memorandum No. SHRP-LTPP-OM-008, SHRP, National Research Council, February 1990., 159390=Materials Sampling, Field Testing, and Laboratory Testing Plan, Strategic Highway Research Program, SPS-1 and SPS-9 Experimental Projects, I-15, Cascade County, Montana, FHWA, Pavement Performance Division, October 1997., 183781=Specific Pavement Studies , Materials Sampling and Testing Requirements for Experiment SPS-2 , Strategic Study of Structural Factors for Rigid Pavements, FHWA, Pavement Performance Division, revised June 1994., 204115=U.S. Department of Transportation Federal Highway Administration 1200 New Jersey Avenue, SE Washington, DC 20590 202-366-4000, 168625=Mix Designs and Summary of Concrete Test Results, SPS-2 I-70 Westbound, Kansas, FHWA, Pavement Performance Division, April 1993., 163764=Sampling, Testing, and Monitoring Activities, Specific Pavement Studies -Experiment 5, Rehabilitation of Asphaltic Concrete Pavements, Plan for Test Sections, SHRP, National Research Council, July 1989., 166195=Materials Sampling and Testing Plan, Florida SPS-1 Project 120100, US-27 SBL, Palm Beach County, Florida, FHWA, Pavement Performance Division, August 1996., 144352=SPS-1 Project 4801, Strategic Study of Structural Factors for Flexible Pavements, US-281 Southbound, Hidalgo County, Texas, Final Report, FHWA, Pavement Performance Division, December 1997., 145756=SPS-1 Project 0101, Strategic Study of Structural Factors for Flexible Pavements, US-280 Westbound, Lee County, Alabama, Final Report, FHWA, Pavement Performance Division, February 1996., 180995=Specific Pavement Studies , Guidelines for Nomination and Evaluation of Candidate Projects for Experiment SPS-6 , Rehabilitation of Jointed Portland Cement Concrete Pavements, Operational Memorandum No. SHRP-LTPP-OM-007, SHRP, National Research Council, November 1989., 139991=SPS-8 Project 48A8, Environmental Effects in the Absence of Heavy Loads, FM-2670 Eastbound, Bell County, Texas, Final Report, FHWA, Pavement Performance Division, July 2000., 169673=SPS-9 A Materials Sampling and Testing Plans, Project 870900, Hwy. 17 WB, Petawawa, Ontario, FHWA, Pavement Performance Division, revised May 1997., 169194=As-Sampled, Sampling and Testing Plan, SPS-1 Experimental Project, US-27 Southbound, Clinton County, Michigan, FHWA, Pavement Performance Division, March 1995., 153428=Construction Report on LTPP 420600, SPS-6 Project, Snowshoe, Pennsylvania, FHWA, Pavement Performance Division, May 1995., 140425=SPS-8 Project 3508, Environmental Effects in the Absence of Heavy Loads, IH-10 Frontage Road, Grant County, New Mexico, Final Report, FHWA, Pavement Performance Division, May 1997., 174004=LTPP-SPS Automated Weather Stations: Automated Weather Station (AWS) Installation, Arizona DOT Open House, Phoenix, AZ, July 20-21, 1994., 176366=Flexible Pavement Load Equivalency Factors (LEF) Based on Structural Number Estimates Using the SHRP-LTPP IMS Inventory Data, Tech Memo No. AU-167, November 1990., 127604=LTPP Seasonal Monitoring Program, Site Installation Report for GPS Section 276251 (27C), Bemidji, Minnesota, FHWA, Pavement Performance Division, January 1996., 122598=LTPP Seasonal Monitoring Program: Site Installation and Initial Data Collection, Section 040114, Kingman, Arizona, Publication No. FHWA-04-0114, FHWA, Pavement Performance Division, May 1997., 184833=Specific Pavement Studies , Construction Guidelines for Experiment SPS-2 , Strategic Study of Structural Factors for Rigid Pavements, Operational Memorandum No. SHRP-LTPP-OM-018, SHRP, National Research Council, 1991., 120975=LTPP Seasonal Monitoring Program: Site Installation and Initial Data Collection, Section 320101, Battle Mountain, Nevada, Publication No. FHWA-32-0101, FHWA, Pavement Performance Division, June 1997., 185932=Specific Pavement Studies , Data Collection Guidelines for Experiment SPS-1 , Strategic Study of Structural Factors for Flexible Pavements, Operational Memorandum No. SHRP-LTPP-OM-026, SHRP, National Research Council, December 1991., 190271=LTPP Manual for Falling Weight Deflectometer Measurements, Operational Field Guidelines, Version 2.0, FHWA, Pavement Performance Division, LTPP Division, February 1993., 135605=Construction Report on Site 300800, SR 273, Adams County, Washington, Final Report, FHWA, Pavement Performance Division, August 1996., 151864=Construction Report on LTPP 870900, SPS-9 A Project, Petawawa, Ontario, Publication No. FHWA-TS-98-87-02, FHWA, Pavement Performance Division, March 1998., 161546=Materials Sampling and Testing Plan, Texas SPS-8 Project 48A800, FM-2670, Bell County, Texas, FHWA, Pavement Performance Division, March 2000., 190928=Falling Weight Deflectometer, Relative Calibration Analysis, RELCAL, Version 3.00, Program Manual, SHRP, National Research Council, May 1994., 124690=LTPP Seasonal Monitoring Program: Site Installation and Initial Data Collection, Section 351112, Hobbs, New Mexico, FHWA, Pavement Performance Division, March 1995., 168121=Sampling and Testing Plan, SPS-2 Experimental Project, Westbound and Eastbound, Marathon County, Wisconsin, FHWA, Pavement Performance Division, updated July 1997., 47175=The table above represents a series of 16 drops at station 0+00 in the outer wheel path of LTPP site 341003 conducted at 8:52 a.m. on March 11, 1999. The drop load is in kilonewtons and the peak deflection is in micrometers. For this information to be of any use in backcalculation, we must also determine the offsets of the deflection sensors. To do this, we must first determine the CONFIGURATION_NO from the MON_DEFL_LOC_INFO table and then query the MON_DEFL_DEV_SENSORS table using this value as follows:, 144808=SPS-1 Project 3501, Strategic Study of Structural Factors for Flexible Pavements, IH-25 Northbound, Dona Ana County, New Mexico, Final Report, FHWA, Pavement Performance Division, April 1996., 184311=Specific Pavement Studies , Experimental Design and Research Plan for Experiment SPS-2 , Strategic Study of Structural Factors for Rigid Pavements, SHRP, National Research Council, April 1990., 192434=SHRP-LTPP Overview: Five-Year Report, Publication No. SHRP-P-416, SHRP, National Research Council, June 1994., 128012=LTPP Seasonal Monitoring Program, Site Installation Report for GPS Section 271028 (27B), Detroit Lakes, Minnesota, FHWA, Pavement Performance Division, January 1996., 157890=Materials Sampling, Field Testing, and Laboratory Testing Plan, Strategic Highway Research Program, SPS-8 Experimental Project (Flexible and Rigid), Federal Aid Project No. ACNH-P099(370)Y, Sycamore Street, Delhi, Merced County, California, FHWA, Pavement Performance Division, February 1999., 137534=Construction Report on Site 060600, Interstate Highway No. I-5, Mt. Shasta City, California, Final Report, FHWA, Pavement Performance Division, April 1996., 137167=Construction Report on Site 06A800, Sycamore Street, Delhi, California, Final Report, FHWA, Pavement Performance Division, August 2002., 174862=Running the Level 4 Traffic Quality Control Filter Program, FHWA, Pavement Performance Division, June 1997., 160561=Materials Sampling and Testing Plan, Texas SPS-9 A Project 480900, Bexar County, Texas, Loop 1604 Southbound, FHWA, Pavement Performance Division, August 1995., 167685=As-Sampled Sampling and Testing Plan, SPS-8 Experimental Project, Ramp A, Delaware County, Ohio, FHWA, Pavement Performance Division, May 1995., 164340=Materials Sampling and Testing Plan, Georgia SPS-5 Project 130500, IH-75 SBL, Bartow County, Georgia, FHWA, Pavement Performance Division, April 1993., 188735=SHRP/LTPP FWD Calibration Protocol, FHWA, Pavement Performance Division, March 1994., 132258=LTPP Seasonal Monitoring Program: Site Installation and Initial Data Collection, Section 231026, East Dixfield, Maine, Publication No. FHWA-TS-94-23-01, FHWA, Pavement Performance Division, June 1994., 132739=LTPP Seasonal Monitoring Program: Site Installation and Initial Data Collection, Section 091803, Groton, Connecticut, Publication No. FHWA-TS-95-09-01, FHWA, Pavement Performance Division, September 1995., 186582=Specific Pavement Studies , Experimental Design and Participation Requirements, Operational Memorandum No. SHRP-LTPP-OM-005R, SHRP, National Research Council, July 1990., 157255=Materials Sampling, Field Testing, and Laboratory Testing Plan, Strategic Highway Research Program, SPS-8 Experimental Project, Utah Forest Highway and Federal Lands Highway Project 5-2(3), State Highway 35 (Wolf Creek Road), Wasatch County, Utah, FHWA, Pavement Performance Division, April 1996., 170611=SPS-8 Materials Sampling and Testing Plans, Project 370800, SR 1245, Jacksonville, North Carolina, FHWA, Pavement Performance Division, revised August and October 1997., 131297=LTPP Seasonal Monitoring Program: Site Installation and Initial Data Collection, Section 360801 Hamlin, New York, Publication No. FHWA-TS-96-36-01, FHWA, Pavement Performance Division, June 1996., 193061=Data Collection Guide for Long-Term Pavement Performance Studies, FHWA, Pavement Performance Division, LTPP Division, revised October 1993., 131780=LTPP Seasonal Monitoring Program: Site Installation and Initial Data Collection, Section 251002, Chicopee, Massachusetts, Publication No. FHWA-TS-94-25-01, FHWA, Pavement Performance Division, June 1994., 141346=SPS-6 Project 4706, Rehabilitation of Jointed Portland Cement Concrete Pavements, IH-40 Westbound, Madison County, Tennessee, Final Report, FHWA, Pavement Performance Division, March 1997., 147568=SPS-8 South Dakota, Construction Report, State Highway 1804, Pollock, South Dakota, Sections 460803 and 460804, Supplemental Section 460859, FHWA, Pavement Performance Division, June 1996., 155031=Construction Report on LTPP 24A300, SPS-3 Project, Ocean City, Maryland, FHWA, Pavement Performance Division, October 1990., 125318=LTPP Seasonal Monitoring Program: Site Installation and Initial Data Collection, Section 133019, Gainesville, Georgia, FHWA, Pavement Performance Division, February 1996., 150220=SPS-2 Construction Report, I-70 Near Abilene, Kansas, Sections 200201 to 200212, FHWA, Pavement Performance Division, March 1993., 130300=LTPP Seasonal Monitoring Program: Site Installation and Initial Data Collection, Section 421606, Altoona, Pennsylvania, Publication No. FHWA-TS-96-42-01, FHWA, Pavement Performance Division, June 1996., 126413=LTPP Seasonal Monitoring Program, Site Installation Report for GPS Section 833802 (83B), Glenea, Manitoba, FHWA, Pavement Performance Division, January 1996., 152836=Construction Report on LTPP 370800, SPS-8 Project, Jacksonville, North Carolina, Publication No. FHWA-TS-98-37-02, FHWA, Pavement Performance Division, December 1998., 138515=Construction Report on Site 040500, Interstate Highway No. I-8, Casa Grande, Arizona, Final Report, Arizona Transportation Research Center, Arizona DOT, October 1990., 133708=SPS-8 Construction Report on Site 490800, State Route 35 (Wolf Creek Road), Utah, Draft Report, FHWA, Pavement Performance Division, September 1998., 155704=Construction Report on LTPP 510100, SPS-1 Project, Danville, Virginia, FHWA, Pavement Performance Division, June 1996., 127011=LTPP Seasonal Monitoring Program, Site Installation Report for SPS Section 460804 (46A), Pollock, South Dakota, FHWA, Pavement Performance Division, February 1996., 165823=Louisiana SPS-1 (220100), Revised Materials Sampling and Testing Plan, FHWA, Pavement Performance Division, January 1993, revised December 1993., 171543=SPS-5 Materials Sampling and Testing Plans, Project 240500, US-15 NB, Frederick, Maryland, FHWA, Pavement Performance Division, January 1992., 149033=SPS-5 Construction Report, PTH No. 1 Westbound, 35 Miles East of Winnipeg, Manitoba, Sections 830501 to 830509, FHWA, Pavement Performance Division, June 1996., 189246=Manual for Profile Measurement: Operational Field Guidelines, Publication No. SHRP-P-378, SHRP, National Research Council, February 1994., 181522=Specific Pavement Studies , Data Collection Guidelines for Experiment SPS-6 , Rehabilitation of Jointed Portland Cement Concrete Pavements, Operational Memorandum No. SHRP-LTPP-OM-023, SHRP, National Research Council, May 1991., 148485=SPS-6 Construction Report, US Highway 12 Westbound, Approximately 15 Miles East of Aberdeen, South Dakota, Test Sections 460601 to 460608, FHWA, Pavement Performance Division, June 1996., 123673=LTPP Seasonal Monitoring Program: Site Installation and Initial Data Collection, Section 481122, Floresville, Texas, FHWA, Pavement Performance Division, March 1995., 102598=For those unfamiliar with SQL, a reference book on SQL is highly recommended. The SQL statements that follow have been written for and tested with Microsoft Access 2000. Some of them, especially the ones that make use of aliasing and subqueries, will need to be modified for use with previous versions of Microsoft Access. In addition, those that use domain aggregate functions may need slight modifications for use with RDBMS's such as Oracle., 182055=Specific Pavement Studies , Materials Sampling and Testing Requirements for Experiment SPS-5 , Rehabilitation of Asphalt Concrete Pavements, Operational Memorandum No. SHRP-LTPP-OM-014, SHRP, National Research Council, October 1990., 149710=SPS-2 Construction Report, U.S. Highway 23 Northbound, Delaware County, Ohio, Sections 390201 to 390212 and 390259 to 390265, FHWA, Pavement Performance Division, September 1998., 128610=LTPP Seasonal Monitoring Program, Site Installation Report for GPS Section 183002 (18A), Lafayette, Indiana, FHWA, Pavement Performance Division, February 1996., 155547=Construction Report on LTPP 100200, SPS-2 Project, Ellendale, Delaware, Publication No. FHWA-TS-96-10-04, FHWA, Pavement Performance Division, October 1996., 134694=Construction Report on Site 81A900, Highway 2, Alberta Transportation and Utilities Department, Okotoks, Alberta, Draft Report, FHWA, Pavement Performance Division, March 1997., 154096=Construction Report on LTPP 89A300, SPS-3 Project, Trois-Rivieres, Quebec, FHWA, Pavement Performance Division, 1990., 192565=LTPP Product Plan, Publication No. FHWA-RD-01-086, FHWA, Pavement Performance Division, 2001., 165255=Materials Sampling and Testing Plan, Texas SPS-1 Project 480100, US-281 SBL, Hidalgo County, Texas, FHWA, Pavement Performance Division, December 1996., 170083=Revised SPS-9 A Materials Sampling and Testing Plans, Project 340900, I-195 EB, Allentown, New Jersey, FHWA, Pavement Performance Division, December 1997, revised May 1998., 151214=SPS-1 Construction Report, US-54 Near Greensburg, Kansas, Sections 200101 to 200164, FHWA, Pavement Performance Division, April 1994., 146168=SPS-9 A Construction Report, Yellow Head Highway Westbound, Radisson, Saskatchewan, Sections 900901 to 900903 and 900959 to 900962, FHWA, Pavement Performance Division, September 1998., 165446=Materials Sampling and Testing Plan, Oklahoma SPS-1 Project 400100, US-62 EBL, Comanche County, Oklahoma, FHWA, Pavement Performance Division, July 1996., 137912=Construction Report on Site 060200, SR 99, Delhi, California, Final Report, FHWA, Pavement Performance Division, December 2002., 141797=SPS-6 Project 05A6, Rehabilitation of Jointed Portland Cement Concrete Pavements, US-65 Southbound, Jefferson County, Arkansas, Final Report, FHWA, Pavement Performance Division, October 1997., 147890=Construction Report for SPS-7 , Route 67 Northbound, Jefferson County, Missouri, FHWA, Pavement Performance Division, December 1995., 166534=Sampling and Testing Plan for SPS-1 Test Site in Alabama, FHWA, Pavement Performance Division, April 1992., 180156=Specific Pavement Studies , Data Collection Guidelines for Experiment SPS-7 , Bonded Portland Cement Concrete Overlays, Operational Memorandum No. SHRP-LTPP-OM-024, SHRP, National Research Council, July 1991., 190569=Long-Term Pavement Performance PROQUAL User's Documentation, Version 2.08, FHWA, June 1998., 151385=SPS-1 Construction Report, US-54 Near Fort Madison, Iowa, Sections 190101 to 190112, FHWA, Pavement Performance Division, April 1994., 174306=Climate Data Collection Plan for SPS Test Sites, FHWA, Pavement Performance Division, January 1993, revised May 1993., 130822=LTPP Seasonal Monitoring Program: Site Installation and Initial Data Collection, Sections 370201, 370205, 370208, and 370212, Lexington, North Carolina, Publication No. FHWA-TS-97-37-01, FHWA, Pavement Performance Division, March 1997., 180403=Specific Pavement Studies , Construction Guidelines for Experiment SPS-7 , Bonded Portland Cement Concrete Overlays, Operational Memorandum No. SHRP-LTPP-OM-016, SHRP, National Research Council, December 1990., 138983=SPS-9 A Project 4809, Superpave Asphalt Binder Study, FM-1604 Southbound, Bexar County, Texas, Final Report, FHWA, Pavement Performance Division, January 1996., 156615=Materials Sampling, Field Testing, and Laboratory Testing Plan, Strategic Highway Research Program, SPS-8 Experimental Project (Rigid), Project No. CRP 93-13, Smith Springs Road, Walla Walla County, Washington, FHWA, Pavement Performance Division, September 1999., 167140=Work Plan, Materials Sampling and Testing, Missouri SPS-9 A, FHWA, Pavement Performance Division, updated July 1996., 182841=Specific Pavement Studies , Data Collection Guidelines for Experiment SPS-5 , Rehabilitation of Asphalt Concrete Pavements, Operational Memorandum No. SHRP-LTPP-OM-015, SHRP, National Research Council, October 1990., 133513=SPS-9 A I-10 Westbound Milepost 112-123, Construction Report on Site 04B900, Arizona, Draft Report, FHWA, Pavement Performance Division, August 1998., 149494=SPS-2 Construction Report, STH 29 Westbound, Marathon County, Wisconsin, Sections 550213 to 550224 and 550259 to 550266, FHWA, Pavement Performance Division, December 1999., 163353=Alabama SPS-6 Project (010600), Materials Sampling and Field Testing Plan, FHWA, Pavement Performance Division, February 1998., 187149=LTPP Seasonal Monitoring Program: SMPCheck Users Guide, Version 2.5, FHWA, Pavement Performance Division, October 1996., 175260=LTPP Traffic Software Users Guide, FHWA, Pavement Performance Division, June 1997., 188612=Study of LTPP Distress Data Variability, Volumes I and II, Report Nos. FHWA-RD-99-074 and FHWA-RD-99-075, FHWA, Pavement Performance Division, September 1999., 170405=SPS-9 Pilot, Materials Sampling and Testing Plans, Project 240900, I-70 WB, Frederick, Maryland, Memo, July and September 1992., 179145=Specific Pavement Studies , Construction Guidelines for Experiment SPS-8 , Study of Environmental Effects in the Absence of Heavy Loads, Operational Memorandum No. SHRP-LTPP-OM-029, SHRP, National Research Council, March 1992., 136775=Construction Report on Site 080800, Chestnut Street, Colorado Department of Transportation, Adams County, Colorado, Draft Report, FHWA, Pavement Performance Division, June 1998., 146622=SPS-9 A Construction Report, U.S. 65 Southbound, Sedalia, Missouri, Sections 290901 to 290903 and 290959 to 290964, FHWA, Pavement Performance Division, September 1998., 128412=LTPP Seasonal Monitoring Program, Site Installation Report for GPS Section 204054 (20A), Enterprise, Kansas, FHWA, Pavement Performance Division, February 1996., 124077=LTPP Seasonal Monitoring Program: Site Installation and Initial Data Collection, Section 481068, Paris, Texas, FHWA, Pavement Performance Division, February 1995., 191495=Calibration of Reference Load Cell, Software User's Guide and Instruction Manual, LDCELCAL, Version 1.7, FHWA, Pavement Performance Division, June 1993., 125526=LTPP Seasonal Monitoring Program: Site Installation and Initial Data Collection, Section 131031, Dawsonville, Georgia, FHWA, Pavement Performance Division, February 1996., 129345=LTPP Seasonal Monitoring Program: Site Installation and Initial Data Collection, Section 871622, Bracebridge, Ontario, Publication No. FHWA-TS-94-87-01, FHWA, Pavement Performance Division, December 1994., 162383=Materials Sampling and Testing Plan, Arkansas SPS-8 Project 050800, US-65 East Terminal Interchange, Right Frontage Road, Jefferson County, Arkansas, FHWA, Pavement Performance Division, October 1996., 120272=LTPP Seasonal Monitoring Program: Site Installation and Initial Data Collection, Section 493011, Nephi, Utah, Publication No. FHWA-49-3011, FHWA, Pavement Performance Division, February 1994., 102099=In the following example, we will extract the data necessary to track air temperature, precipitation, and subsurface temperature on an hourly basis for a single section for a period of one week. The section of choice is 360801, a test section in the SPS-8 experiment located in New York. The time period being selected is March 1-8, 1996., 159990=Materials Sampling, Field Testing, and Laboratory Testing Plan, Strategic Highway Research Program, SPS-1 and SPS-2 Experimental Projects, Interstate Highway No. I-80, Humboldt and Lander Counties, Nevada, FHWA, Pavement Performance Division, September 1994., 143361=SPS-5 Project 0105, Asphalt Rehabilitation Study, US-84 Eastbound, Houston County, Alabama, Final Report, FHWA, Pavement Performance Division, March 1996., 192087=Strategic Highway Research Program, Saving Lives, Reducing Congestion, Improving Quality of Life, Special Report 260, TRB, National Research Council, 2001., 129819=LTPP Seasonal Monitoring Program: Site Installation and Initial Data Collection, Section 510113, Danville, Virginia, Publication No. FHWA-TS-96-51-03, FHWA, Pavement Performance Division, June 1996., 155197=Construction Report on LTPP 370200, SPS-2 Project, Lexington, North Carolina, FHWA, Pavement Performance Division, August 1994., 121212=LTPP Seasonal Monitoring Program: Site Installation and Initial Data Collection, Section 300114, Great Falls, Montana, Publication No. FHWA-30-0114, FHWA, Pavement Performance Division, October 2001., 86745=Since 2/08/1996 is marginally closer to our target date, we will use that date. However, you should note that these tests are commonly conducted twice during a given day, as can be shown in the following query:  , 160967=Materials Sampling and Testing Plan, Mississippi SPS-9 A Project 280900, Panola County, Mississippi, IH-55 Southbound, FHWA, Pavement Performance Division, June 1995., 134080=SPS-2 Construction Report, SHRP 080200, Federal Aid Project No. I 076-1 (138), I-76 Eastbound, Milepost 18.43, Adams County, Colorado, FHWA, Pavement Performance Division, September 1998., 127406=LTPP Seasonal Monitoring Program, Site Installation Report for SPS Section 310114 (31A), Hebron, Nebraska, FHWA, Pavement Performance Division, February 1996., 172064=Revised Materials Sampling and Testing Plans SPS-2 , US 113, SBL, Delaware, FHWA, Pavement Performance Division, August 1994., 139578=SPS-9 A Project 1209, Superpave Asphalt Binder Study, IH-10 Eastbound, Columbia County, Florida, Final Report, FHWA, Pavement Performance Division, March 1997., 189071=PROQUAL, Version 1.4, User Documentation, FHWA, Pavement Performance Division, June 1992., 136197=Construction Report on Site 300900, Interstate Highway 15, Cascade County, Montana, Final Report, FHWA, Pavement Performance Division, August 2002., 121680=LTPP Seasonal Monitoring Program: Site Installation and Initial Data Collection, Section 081053, Delta, Colorado, Publication No. FHWA-08-1053, FHWA, Pavement Performance Division, January 1994., 164915=Materials Sampling and Testing Plan, Arkansas SPS-2 Project 050200, IH-30 WBL, Hot Spring County, Arkansas, FHWA, Pavement Performance Division, January 1997., 168809=Sampling and Testing Plan, SPS-1 Experimental Project, STH 29, Marathon County, Wisconsin, FHWA, Pavement Performance Division, updated July 1997., 147168=SPS-9 Construction Report, US-169, Near Belle Plaine, Minnesota, Sections 270901 to 270903, FHWA, Pavement Performance Division, April 1995., 153268=Construction Report on LTPP 340800, SPS-8 Project, NY/NJ, JFK Airport, Port Authority, Publication No. FHWA-TS-94-34-01, FHWA, Pavement Performance Division, December 1994., 170997=SPS-8 Materials Sampling and Testing Plans, Project 340800, Port Authority of NY/NJ, JFK Airport, FHWA, Pavement Performance Division, September 1994., 158489=Materials Sampling, Field Testing, and Laboratory Testing Plan, Strategic Highway Research Program, SPS-2 Experimental Project, Federal Aid Project No. ACDPS-0027(001), 395-Lind to Ritzvile, Washington, FHWA, Pavement Performance Division, March 1993., 141120=SPS-7 Project 2207, Bonded Concrete Overlay of a Concrete Pavement, IH-10 Eastbound, Ascension Parish, Louisiana, Final Report, FHWA, Pavement Performance Division, April 1993., 140647=SPS-8 Project 2808, Environmental Effects in the Absence of Heavy Loads, SR-315 Westbound, Panola County, Mississippi, Final Report, FHWA, Pavement Performance Division, February 1998., 163955=Materials Sampling and Testing Plan, Oklahoma SPS-5 Project 400500, US-62 WBL, Comanche County, Oklahoma, FHWA, Pavement Performance Division, July 1996., 179693=Specific Pavement Studies , Guidelines for Nomination and Evaluation of Candidate Projects for Experiment SPS-7 , Bonded Portland Cement Concrete Overlays, Operational Memorandum No. SHRP-LTPP-OM-011, SHRP, National Research Council, June 1990., 150797=SPS-1 Construction Report, U.S. Highway 23 Southbound, Delaware County, Ohio, Sections 390101 to 390112, 390159, and 390160, FHWA, Pavement Performance Division, September 1998., 168316=As-Sampled Sampling and Testing Plan, SPS-2 Experimental Project, US-23 Northbound, Monroe County, Michigan, FHWA, Pavement Performance Division, March 1995., 183317=Specific Pavement Studies , Data Collection Guidelines for Experiment SPS-4 , Maintenance Effectiveness for Portland Cement Concrete Pavements, SHRP, National Research Council, November 1991., 135264=Construction Report on Site 530800, North Touchet Road, Dayton, Washington, Final Report, FHWA, Pavement Performance Division, September 1997., 43667=The EXPERIMENT_SECTION table indicates that on 4/08/1994, this site was assigned a CONSTRUCTION_NO = 2. With this information, we can extract the relevant layer information., 142784=SPS-5 Project 2805, Asphalt Rehabilitation Study, IH-55 Northbound, Yazoo County, Mississippi, Final Report, FHWA, Pavement Performance Division, April 1993., 92108=Subsurface moisture data are only available in approximately monthly intervals. A quick query of SMP_TDR_MOISTURE_AUTO will reveal that there is no subsurface moisture data available between 3/01/1996 and 3/08/1996. The following query can be conducted to determine which dates are available:, 154678=Construction Report on LTPP 42A300 and 42B300, SPS-3 Projects, Lewisburg and Knoxville, Pennsylvania, FHWA, Pavement Performance Division, October 1990., 122140=LTPP Seasonal Monitoring Program: Site Installation and Initial Data Collection, Section 041024, Flagstaff, Arizona, Publication No. FHWA-04-1024, FHWA, Pavement Performance Division, May 1997., 120738=LTPP Seasonal Monitoring Program: Site Installation and Initial Data Collection, Section 320204, Battle Mountain, Nevada, Publication No. FHWA-32-0204, FHWA, Pavement Performance Division, June 1997., 135083=Construction Report on Site 53A800, Smith Springs Road, Clyde, Washington, Final Report, FHWA, Pavement Performance Division, August 2002., 123065=LTPP Seasonal Monitoring Program: Site Installation and Initial Data Collection, Section 484143, Beaumont, Texas, FHWA, Pavement Performance Division, March 1995., 173676=LTPP-SPS Automated Weather Stations: AWSScan Program Background and Users Guide, Version 1.11, FHWA, Pavement Performance Division, February 1996., 182345=Specific Pavement Studies , Guidelines for Nomination and Evaluation of Candidate Projects for Experiment SPS-5 , Rehabilitation of Asphalt Concrete Pavements, Operational Memorandum No. SHRP-LTPP-OM-006, SHRP, National Research Council, November 1989., 178610=Specific Pavement Studies , Experimental Design and Research Plan for Experiment SPS-8 , Study of Environmental Effects in the Absence of Heavy Loads, SHRP, National Research Council, August 1991., 187697=LTPP Seasonal Monitoring Program: MOBFIELD Users Guide, Version 3.0, FHWA, Pavement Performance Division, December 1999., 175841=Long-Term Pavement Performance Program Protocol for Calibrating Traffic Data Collection Equipment, FHWA, Pavement Performance Division, April 1998., 150396=SPS-2 Construction Report, US-65 Northbound, Polk County, Iowa, Sections 190213 to 190224, FHWA, Pavement Performance Division, June 1996., 143897=Report on the SPS-3 Experiment of the Long-Term Pavement Performance Project in the Southern Region, Publication No. FHWA-IF-00-026, FHWA, Pavement Performance Division, August 2000., 152272=Construction Report on LTPP 340900, SPS-9 A Project, Allentown, New Jersey, Publication No. FHWA-TS-00-34-01, FHWA, Pavement Performance Division, December 2000., 186228=Specific Pavement Studies , Construction Guidelines for Experiment SPS-1 , Strategic Study of Structural Factors for Flexible Pavements, Operational Memorandum No. SHRP-LTPP-OM-017, SHRP, National Research Council, December 1990, revised FHWA, December 1993., 167504=Sampling and Testing Plan, SPS-8 Experimental Project, Ramp A, Delaware County, Ohio, FHWA, Pavement Performance Division, May 1994., 153751=Construction Report on LTPP 240500, SPS-5 Project, Frederick, Maryland, FHWA, Pavement Performance Division, March 1993., 170240=SPS-9 A Materials Sampling and Testing Plan Revisions, Connecticut, FHWA, Pavement Performance Division, December 1997., 65921=Having established the temperature gradient for FWD tests conducted on March 11, 1999, on LTPP test site 341003, the next step is to extract deflection values for the purpose of establishing the deflection basins. Data resulting from a single FWD test are distributed among five tables. The relationships between these tables are illustrated below., 127808=LTPP Seasonal Monitoring Program, Site Installation Report for GPS Section 274040 (27D), Grand Rapids, Minnesota, FHWA, Pavement Performance Division, February 1996., 119579=Seasonal Instrumentation Pilot Study, Instrumentation Installation, Section 163023 in Idaho, SHRP, May 1992., 146990=SPS-9 Construction Report, I-94 Near Tomah, Wisconsin, Sections 550901 to 550909, FHWA, Pavement Performance Division, June 1994., 122827=LTPP Seasonal Monitoring Program: Site Installation and Initial Data Collection, Section 040113, Kingman, Arizona, Publication No. FHWA-04-0113, FHWA, Pavement Performance Division, May 1997., 173246=SPS-2 Seasonal and Load Response Instrumentation, North Carolina DOT Open House, Lexington, NC, FHWA, Pavement Performance Division, May 9-11, 1994., 144125=SPS-2 Project 0502, Strategic Study of Structural Factors for Rigid Pavements, I-30 Westbound, Hot Springs County, Arkansas, Final Report, FHWA, Pavement Performance Division, November 1997., 175140=Managing Purge Documents Using Purge Operations Software, FHWA, Pavement Performance Division, February 1998., 170809=SPS-8 Materials Sampling and Testing Plans, Project 360800, Lake Ontario State Parkway, Brockport, New York, FHWA, Pavement Performance Division, February 1994., 183534=Specific Pavement Studies , Data Collection Guidelines for Experiment SPS-3 , Maintenance Effectiveness for Asphalt Concrete Pavements, SHRP, National Research Council, June 1990., 178091=Specific Pavement Studies , Materials Sampling and Testing Requirements for Experiment SPS-8 , Study of Environmental Effects in the Absence of Heavy Loads, FHWA, Pavement Performance Division, revised October 1997., 138311=Construction Report on Site 040600, Interstate Highway No. I-40, Flagstaff, Arizona, Final Report, FHWA, Pavement Performance Division, November 1992., 148836=SPS-6 Construction Report, I-35 Southbound, Between Ames and Des Moines, Iowa, Test Sections 190601 to 190608, FHWA, Pavement Performance Division, June 1996., 158199=Materials Sampling, Field Testing, and Laboratory Testing Plan, Strategic Highway Research Program, SPS-2 and SPS-8 Experimental Projects, Federal Aid Project No. I 076-1(138), State Highway No. I-76, Adams County, Colorado, FHWA, Pavement Performance Division, May 1992., 171901=Revised Materials Sampling and Testing Plans, SPS-2 , US 52 SB, Lexington, By-Pass, North Carolina, FHWA, Pavement Performance Division, February 1995., 184578=Specific Pavement Studies , Data Collection Guidelines for Experiment SPS-2 , Strategic Study of Structural Factors for Rigid Pavements, Operational Memorandum No. SHRP-LTPP-OM-028, SHRP, National Research Council, February 1992., 187880=LTPP Seasonal Monitoring Program: MOBFIELD Users Guide, Version 2.4, FHWA, Pavement Performance Division, January 1997., 171364=SPS-5 Materials Sampling and Testing Plans, Project 340500, I-195 WB, Imlaystown, New Jersey, FHWA, Pavement Performance Division, September 1994., 176630=Specific Pavement Studies , Materials Sampling and Testing Requirements for Experiment SPS-9 A, Superpave Asphalt Binder Study, FHWA, Pavement Performance Division, February 1996., 165066=Arkansas SPS-2 (050200), Materials Sampling and Testing Plan, FHWA, Pavement Performance Division, February 1994., 137747=Construction Report on Site 060500, Interstate 40, California Department of Transportation, Barstow, California, Final Report, FHWA, Pavement Performance Division, April 1996., 174717=Traffic Analysis Software, Volume 1: User's Guide, FHWA, Office of Infrastructure Research, Development, and Technology, August 2002., 154870=Construction Report on LTPP 36A300 and 36B300, SPS-3 Projects, Glen Falls and Cranberry Lake, New York, FHWA, Pavement Performance Division, October 1990., 186785=Recruitment Guidelines for Additional GPS Candidate Projects, SHRP, National Research Council, October 1988., 145036=SPS-1 Project 2201, Strategic Study of Structural Factors for Flexible Pavements, US-171 Northbound, Calcasieu Parish, Louisiana, Final Report, FHWA, Pavement Performance Division, May 1998., 149894=SPS-2 Construction Report, I-94 Eastbound, West of Fargo, North Dakota, Sections 380213 to 380224, FHWA, Pavement Performance Division, June 1996., 152072=Construction Report on LTPP 370900, SPS-9 A Project, NB and SB, Sanford, North Carolina, Publication No. FHWA-TS-00-37-02, FHWA, Pavement Performance Division, June 2000., 192884=Fulfilling the Promise of Better Roads, A Report of the TRB Long-Term Pavement Performance Committee, TRB, 2001., 132019=LTPP Seasonal Monitoring Program: Site Installation and Initial Data Collection, Section 241634, Ocean City, Maryland, Publication No. FHWA-TS-96-24-01, FHWA, Pavement Performance Division, June 1996., 189450=LTPP Manual for Falling Weight Deflectometer Measurements, Operational Field Guidelines, Version 3.1, FHWA, Pavement Performance Division, LTPP Division, August 2000., 135808=Construction Report on Site 320200, Interstate Highway No. I-80, Humboldt and Lander Counties, Nevada, Final Report, FHWA, Pavement Performance Division, March 1998., 155352=Report of Site Investigation on Delaware SPS-2 Problem Test Sections, FHWA, Pavement Performance Division, July 1995., 123469=LTPP Seasonal Monitoring Program: Site Installation and Initial Data Collection, Section 483739, Kingsville, Texas, FHWA, Pavement Performance Division, March 1995., 145506=SPS-1 Project 0501, Strategic Study of Structural Factors for Flexible Pavements, US-63 Northbound, Craighead County, Arkansas, Final Report, FHWA, Pavement Performance Division, October 1996., 164530=Materials Sampling and Testing Plan, Florida SPS-5 Project 120500, US-1 SBL, Martin County, Florida, FHWA, Pavement Performance Division, November 1994., 148261=SPS-7 Construction Report, I-35 Near Ames, Iowa, Sections 190701 to 190710, FHWA, Pavement Performance Division, April 1994., 177568=Specific Pavement Studies , Guidelines for Nomination and Evaluation of Candidate Projects for Experiment SPS-9 , Validation of SHRP Asphalt Specifications and Mix Design and Innovations in Asphalt Pavements, SHRP, National Research Council, February 1992., 126610=LTPP Seasonal Monitoring Program, Site Installation Report for GPS Section 831801 (83A), Oak Lake, Manitoba, FHWA, Pavement Performance Division, January 1996., 159132=Materials Sampling, Field Testing, and Laboratory Testing Plan, Strategic Highway Research Program, SPS-2 Experimental Project, Federal Aid Project No. IR-10-2(146), Ehrenberg-Phoenix State Highway, Maricopa County, Arizona, FHWA, Pavement Performance Division, January 1993., 174150=LTPP Climatic Database Revision and Expansion, Draft Report, FHWA, Pavement Performance Division, July 1999., 142202=SPS-5 Project 4805, Asphalt Rehabilitation Study on US-175 in Kaufman County, Texas, Final Report, FHWA, Pavement Performance Division, July 1992., 162986=Materials Sampling and Field Testing Plan, Oklahoma SPS-6 Project 4006, IH-35 Southbound, Kay County, Oklahoma, FHWA, Pavement Performance Division, March 1992., 166986=Sampling and Testing Plan, SPS-9 A Experimental Project, US-23 Southbound, Delaware County, Ohio, FHWA, Pavement Performance Division, September 1995., 147720=Construction Report for SPS-8 , Ramp A, Delaware County, Ohio, FHWA, Pavement Performance Division, December 1995., 134480=FHWA LTPP Specific Pavement Studies , Arizona SPS-1 , Construction Report on SHRP 040100, Draft Report, FHWA, Pavement Performance Division, April 1995., 175656=LTPP Traffic Database Librarian Software, Version 4.0, FHWA, Pavement Performance Division, April 1997., 161948=Materials Sampling and Testing Plan, New Mexico SPS-8 Project 350800, Grant County, New Mexico, IH-10 Frontage Road Eastbound, FHWA, Pavement Performance Division, August 1995., 177076=Specific Pavement Studies , Experimental Design and Research Plan for Experiment SPS-9 A, Superpave Asphalt Binder Study, FHWA, Pavement Performance Division, January 1995., 160289=Materials Sampling, Field Testing, and Laboratory Testing Plan, Strategic Highway Research Program, SPS-1 Experimental Project, Federal Aid Project No. F-39-1-509, State Highway No. US-93, Mohave County, Arizona, FHWA, Pavement Performance Division, March 1993., 144579=SPS-1 Project 4001, Strategic Study of Structural Factors for Flexible Pavements, US-62 Eastbound, Comanche County, Oklahoma, Final Report, FHWA, Pavement Performance Division, August 1998., 159694=Addendum to Materials Sampling, Field Testing, and Laboratory Testing Plan, Strategic Highway Research Program, SPS-1 and SPS-2 Experimental Projects, Interstate Highway No. I-80, Humboldt and Lander Counties, Nevada, FHWA, Pavement Performance Division, April 1995., 143169=SPS-5 Project 1205, Asphalt Rehabilitation Study, US-1 Southbound, Martin County, Florida, Final Report, FHWA, Pavement Performance Division, April 1996., 166002=Laboratory Materials Testing for LTPP SPS-1 Project 2201, US-171, Calcasiu Parish, Louisiana, FHWA, Pavement Performance Division, July 1995., 130549=LTPP Seasonal Monitoring Program: Site Installation and Initial Data Collection, Section 371028, Elizabeth City, North Carolina, Publication No. FHWA-TS-96-37-01, FHWA, Pavement Performance Division, June 1996., 188351=SHRP-LTPP Guide for Field Materials Sampling, Handling, and Testing, Operational Guide No. SHRP-LTPP-OG-006, SHRP, National Research Council, February 1991., 191109=Falling Weight Deflectometer, Relative Calibration Analysis, FWDCAL, Version 2.00, Program Manual, SHRP, National Research Council, April 1992., 143519=SPS-4 Construction Report, SHRP Southern Region Coordination Office, FHWA, Pavement Performance Division, February 1991., 128861=Seasonal Testing Instrumentation Pilot, GPS 361011, 1H 481 SB, E. Syracuse, New York, SHRP, National Research Council, October 1991., 188944=Reference Calibration of Falling-Weight Deflectometers, Software User's Guide and Instruction Manual, FWDREFCAL, Version 3.72, SHRP, National Research Council, March 1994., 181785=Specific Pavement Studies , Construction Guidelines for Experiment SPS-6 , Rehabilitation of Jointed Portland Cement Concrete Pavements, Operational Memorandum No. SHRP-LTPP-OM-013, SHRP, National Research Council, July 1990., 172221=Report of Site Investigation on Delaware SPS-2 Problem Test Sections, FHWA, Pavement Performance Division, August 1995., 132496=LTPP Seasonal Monitoring Program: Site Installation and Initial Data Collection, Section 100102, Ellendale, Delaware, Publication No. FHWA-TS-96-10-02, FHWA, Pavement Performance Division, June 1996., 187333=LTPP Seasonal Monitoring Program: ONSFIELD Users Guide, Version 2.0, FHWA, Pavement Performance Division, December 1999., 157560=Materials Sampling, Field Testing, and Laboratory Testing Plan, Strategic Highway Research Program, SPS-8 Experimental Project, Federal Aid Project No. RS 273-1(2)0, State Highway No. RS 273, Deerlodge County, Montana, FHWA, Pavement Performance Division, April 1994., 185662=Specific Pavement Studies , Experimental Design and Research Plan for Experiment SPS-1 , Strategic Study of Structural Factors for Flexible Pavements, SHRP, National Research Council, revised February 1990., 137341=Construction Report on Site 060800, Sycamore Street, Delhi, California, Final Report, FHWA, Pavement Performance Division, August 2002., 131063=LTPP Seasonal Monitoring Program: Site Installation and Initial Data Collection, Section 364018, Oneonta, New York, Publication No. FHWA-TS-95-36-01, FHWA, Pavement Performance Division, September 1995., 169873=SPS-9 A Materials Sampling and Testing Plans, Project 370900, NB/SB, Sanford, North Carolina, FHWA, Pavement Performance Division, revised February and June 1997., 131538=LTPP Seasonal Monitoring Program: Site Installation and Initial Data Collection, Section 331001, Concord, New Hampshire, Publication No. FHWA-TS-94-33-01, FHWA, Pavement Performance Division, June 1994., 181257=Specific Pavement Studies , Experimental Design and Research Plan for Experiment SPS-6 , Rehabilitation of Jointed Portland Cement Concrete Pavements, SHRP, National Research Council, November 1989., 163524=Materials Sampling and Field Testing Plan for SPS Section 48A5 in Kaufman, Texas, FHWA, Pavement Performance Division, December 1990., 124487=LTPP Seasonal Monitoring Program: Site Installation and Initial Data Collection, Section 404165, Cleo Springs, Oklahoma, FHWA, Pavement Performance Division, March 1995. LTPP Seasonal Monitoring Program: Site Installation and Initial Data Collection, Section 481060, Victoria, Texas, FHWA, Pavement Performance Division, March 1995., 125109=LTPP Seasonal Monitoring Program: Site Installation and Initial Data Collection, Section 281016, Kosciusko, Mississippi, FHWA, Pavement Performance Division, February 1996., 140207=SPS-8 Project 4808, Environmental Effects in the Absence of Heavy Loads, FM-2223 Eastbound, Brazos County, Texas, Final Report, FHWA, Pavement Performance Division, October 1996., 136372=Construction Report on Site 300500, Interstate 90, Big Timber, Montana, Final Report, FHWA, Pavement Performance Division, January 1992., 190065=LTPP Manual for Falling Weight Deflectometer Measurements, Operational Field Guidelines, Version 3.0, FHWA, Pavement Performance Division, LTPP Division, January 2000., 151671=Construction Report on LTPP 890900 and 89A900, SPS-9 A Projects, Jonquiere, Quebec, Publication No. FHWA-TS-98-89-02, FHWA, Pavement Performance Division, April 1998., 161366=Materials Sampling and Testing Plan, Arkansas SPS-9 A Project 050900, US-65 Southbound, Jefferson County, Arkansas, FHWA, Pavement Performance Division, June 1997., 152631=Construction Report on LTPP 240900, SPS-9 Project, Frederick, Maryland, FHWA, Pavement Performance Division, December 1992., 154309=Construction Report on LTPP 87A300 and 87B300, SPS-3 Projects, Moonstone and Bracebridge, Ontario, FHWA, Pavement Performance Division, October 1990., 149284=SPS-5 Construction Report, Trunk Highway 2 Westbound, 14 Miles West of Bemidji, Minnesota, Core Sections 270501 to 270509 and Supplemental Sections 270559 to 270561, FHWA, Pavement Performance Division, June 1996.}",
    "textBeforeTable": "The first 10 rows of the 960 rows in the result set are as follows: AND smp_date BETWEEN #3/01/1996# AND #3/08/1996#; AND a.therm_no = b.therm_no AND a.shrp_id = b.shrp_id AND a.state_code = b.state_code AND a.shrp_id = '0801' WHERE a.state_code = 36 FROM smp_mrctemp_auto_hour a, smp_mrctemp_depths b SELECT smp_date, temperature_time, avg_hour_temperature, therm_depth Next, we need to get the subsurface temperatures. This will require a join, since the temperatures themselves and the depth at which they were taken are stored in separate tables. The necessary query is: C.1.2 Subsurface Temperatures The time is in a 24-hour military-style string format, the temperature is in degrees Celsius, and the precipitation is in millimeters. 0 -4.8 1000 3/01/1996 0 -6.2 0900 3/01/1996 0 -7.8 0800 3/01/1996 0 -7.8 0700 3/01/1996 0 -7.3 0600 3/01/1996 0 -7.3",
    "textAfterTable": "smp_date 2/08/1996 4/09/1996 Since 2/08/1996 is marginally closer to our target date, we will use that date. However, you should note that these tests are commonly conducted twice during a given day, as can be shown in the following query:   SELECT DISTINCT smp_date, COUNT(*) as num_repetitions FROM smp_eresist_man_contact GROUP BY smp_date, electrode_start; The result set is: smp_date num_repetitions 2/08/1996 2 4/09/1996 2 This query shows that the resistance was measured across all of the electrodes twice during each day. We will look at the data collected in the afternoon. Electrical resistivity measurements are taken between electrodes at different depths. We will treat the depth at which the measurement was taken as the mean depth between the two electrodes. The query is as follows:   SELECT g.avg_depth, contact_resistance, bulk_resistivity FROM (SELECT contact_resistance, (depth_1 + depth_2)/2 as avg_depth FROM (SELECT elct_depth as depth_1, electrode_start, resistance as contact_resistance FROM smp_eresist_man_contact a, smp_eresist_depths b WHERE a.electrode_start = b.electrode_no AND a.state_code = b.state_code AND a.shrp_id = b.shrp_id AND a.state_code = 36 AND a.shrp_id = '0801' AND smp_date = #2/08/1996# AND VAL(eresist_time) > 1200) c, (SELECT elct_depth",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}