{
    "relation": [
        [
            "Team",
            "Rochester Royals",
            "Minneapolis Lakers",
            "Chicago Stags",
            "St. Louis Bombers",
            "Fort Wayne Pistons",
            "Indianapolis Jets"
        ],
        [
            "W",
            "45",
            "44",
            "38",
            "29",
            "22",
            "18"
        ],
        [
            "L",
            "15",
            "16",
            "22",
            "31",
            "38",
            "42"
        ],
        [
            "Pct.",
            ".750",
            ".733",
            ".633",
            ".483",
            ".367",
            ".300"
        ],
        [
            "GB",
            "–",
            "1",
            "7",
            "16",
            "23",
            "27"
        ]
    ],
    "pageTitle": "Basketball Association of America - Wikipedia, the free encyclopedia",
    "title": "",
    "url": "https://en.wikipedia.org/wiki/Basketball_Association_of_America",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 9,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989042.37/warc/CC-MAIN-20150728002309-00275-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 863799155,
    "recordOffset": 863768571,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{8428=When the BAA was founded there were two established professional leagues in the United States: the American Basketball League in the East, founded 1925, and the National Basketball League in Midwestern industrial cities, founded 1937. However, most of the ABL and NBL teams played in small arenas, and in some cases even ballrooms or high school gymnasiums. Walter Brown, owner of the Boston Garden, believed that major ice hockey arenas, which sat empty on many nights, could be put to profitable use hosting basketball games when there were no ice hockey games to be played.[6] To put this theory into practice, the BAA was founded in New York City on June 6, 1946. Maurice Podoloff, who was already serving as president of the American Hockey League, was appointed president of the BAA, becoming the first person to simultaneously lead two professional leagues[7] (Joseph Carr had been president of the ABL from 1925 to 1928 while also overseeing the National Football League, although the NFL and ABL seasons did not overlap).[8], 2854=The Philadelphia Warriors won the inaugural BAA championship in 1947, followed by the Baltimore Bullets and the Minneapolis Lakers in 1948 and 1949. Six teams from the BAA remain in operation in the NBA as of the 2012–13 season, three who co-founded the league in 1946 and three who joined it from the NBL in 1948 (below). The inaugural BAA season began with 11 teams, of which four dropped before the second season. One ABL team joined to provide 8 teams for 1947–48 and four NBL teams joined to provide 12 for 1948–49. The records and statistics of the BAA and NBL prior to the merger in 1949 are considered in official NBA history only if a player, coach or team participated in the newly formed NBA after 1949 for one or more seasons.[2][3], 4302=The NBA generally considers BAA history its own. For example, at NBA History online its table of one-line \"NBA Season Recaps\" begins 1946–47 without comment.[4] It celebrated \"NBA at 50\" in 1996, with announcement of its 50 Greatest Players among other things.[5], 18964=Before the season started, the Cleveland Rebels, Detroit Falcons, Pittsburgh Ironmen and Toronto Huskies folded, leaving the BAA with only seven teams. The Baltimore Bullets joined the league from the ABL, and were assigned to the Western Division along with the Washington Capitols to even the divisions. Prior to the start of the season, the league held its inaugural college draft on July 1, 1947.[22] Each team played 48 regular season games. The Eastern Division was won by the Philadelphia Warriors, the West by the St. Louis Bombers.[12], 23392=The 1949 Playoffs were expanded to include eight teams. The four best teams from each division contested in divisional semifinals and divisional finals to find each division winners. The two division winners then advanced to the finals. The divisional semifinals and finals were played in a best-of-3 format while the final series were played in the best-of-7 format. The Lakers defeated the Royals to became the inaugural Western Division winner. In the other divisional final, the Capitols defeated the New York Knicks to became the inaugural Eastern Division winner. The Lakers then won the finals by defeating the Capitols 4–2.[13][25][26], 11387=Although there had been earlier attempts at professional basketball leagues, including the American Basketball League (ABL) and the NBL, the BAA was the first league that attempted to play primarily in large arenas in major cities, such as Madison Square Garden and Boston Garden.[11] At its inception, the quality of play in the BAA was not significantly better than in competing leagues, or among leading independent clubs such as the Harlem Globetrotters. For instance, both the 1948 and 1949 titles were won by teams that had played in other leagues during the previous year, the Baltimore Bullets in 1948 and the Minneapolis Lakers in 1949 respectively.[12][13], 2260=The Basketball Association of America (BAA) was a professional basketball league in North America, founded in 1946. Following its third, 1948–49 season the BAA and the National Basketball League (NBL) merged to create the National Basketball Association (NBA).[1], 25264=On August 3, 1949, the BAA agreed to merge with the NBL, creating the National Basketball Association (NBA). The six remaining NBL teams were absorbed into the BAA, which then had ten teams after the Indianapolis Jets and the Providence Steamrollers folded prior to the absorption. The Indianapolis Olympians, a planned expansion team for the NBL, also joined the newly formed league. In total, the new league had 17 teams located in a mix of large and small cities, as well as large arenas, smaller gymnasiums, and armories.[7][27] Prior to the merge, the league held the 1949 College Draft on March 21, which was the last event held under the name BAA.[22], 20411=The 1948 Playoffs followed the same format as the previous year. The Eastern Division winner, the Philadelphia Warriors defeated the Western Division winner, St. Louis Bombers. In the finals, the Warriors were defeated by the Bullets 4–2.[12][23][24], 14501=On November 1, 1946, at Maple Leaf Gardens in Toronto, the Toronto Huskies hosted the New York Knickerbockers, which the NBA now regards as the league's first official game.[14] In the opening game of the BAA, Ossie Schectman scored the opening basket for the Knickerbockers.[15] The Eastern Division winner, the Washington Capitols, who had the best record with 49 wins, were defeated in the best-of-7 semifinal by the Western Division winner, the Chicago Stags. The Stags advanced to the finals along with the Philadelphia Warriors who defeated the New York Knickerbockers in the other semifinal. The Warriors won the inaugural BAA championship by winning the series 4–1.[11][16][17]}",
    "lastModified": "Sat, 01 Aug 2015 14:19:47 GMT",
    "textBeforeTable": "[11] Eastern Division 1946–47[edit] Annual standings[edit] g Indianapolis moved from the NBL to the BAA in 1948, alonng with three other teams that remain in operation. f Not affiliated with National Hockey League Washington Capitals e Known as the Sacramento Kings since 1985, Rochester moved from the NBL to the BAA in 1948 (and relocated three times). d Known as the Golden State Warriors since 1971, Philadelphia relocated to San Francisco in 1962. c Known as the Los Angeles Lakers since 1960, Minneapolis moved from the NBL to the BAA in 1948. b Known as the Detroit Pistons since 1957, Fort Wayne moved from the NBL to the BAA in 1948. a Not affiliated with the present-day Washington Wizards, which were known as the Baltimore Bullets from 1963 to 1973, Baltimore moved from the ABL to the BAA in 1947. [44] 0 3 .685 7002115000000000000♠115–53 3 1946–49 Washington, D.C. Washington Capitols[f] [43] 0",
    "textAfterTable": "Western Division [11] Team W L Pct. GB Chicago Stags 39 22 .639 – St. Louis Bombers 38 23 .623 1 Cleveland Rebels 30 30 .500 8½ Detroit Falcons 20 40 .333 18½ Pittsburgh Ironmen 15 45 .250 23½ 1947–48[edit] Eastern Division [12] Team W L Pct. GB Philadelphia Warriors 27 21 .563 – New York Knicks 26 22 .542 1 Boston Celtics 20 28 .417 7 Providence Steamrollers 6 42 .125 21 Western Division [12] Team W L Pct. GB St. Louis Bombers 29 19 .604 – Baltimore Bullets 28 20 .583 1 Chicago Stags 28 20 .583 1 Washington Capitols 28 20 .583 1",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}