{
    "relation": [
        [
            "Season",
            "2010–11",
            "2011–12",
            "2012–13",
            "2013–14",
            "2014–15"
        ],
        [
            "GP",
            "82",
            "82",
            "48",
            "82",
            "82"
        ],
        [
            "W",
            "54",
            "51",
            "26",
            "36",
            "48"
        ],
        [
            "L",
            "19",
            "22",
            "15",
            "35",
            "29"
        ],
        [
            "OTL",
            "9",
            "9",
            "7",
            "11",
            "5"
        ],
        [
            "Pts",
            "117",
            "111",
            "59",
            "83",
            "101"
        ],
        [
            "GF",
            "262",
            "249",
            "127",
            "196",
            "242"
        ],
        [
            "GA",
            "185",
            "198",
            "121",
            "223",
            "222"
        ],
        [
            "Finish",
            "1st, Northwest",
            "1st, Northwest",
            "1st, Northwest",
            "5th, Pacific",
            "2nd, Pacific"
        ],
        [
            "Playoffs",
            "Lost in Stanley Cup Finals, 3–4 (Bruins)",
            "Lost in Conference Quarterfinals, 1–4 (Kings)",
            "Lost in Conference Quarterfinals, 0–4 (Sharks)",
            "Did not qualify",
            "Lost in Conference Quarterfinals, 2–4 (Flames)"
        ]
    ],
    "pageTitle": "Vancouver Canucks - Wikipedia, the free encyclopedia",
    "title": "",
    "url": "https://en.wikipedia.org/wiki/Vancouver_Canucks",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 3,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989042.37/warc/CC-MAIN-20150728002309-00231-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 876054375,
    "recordOffset": 875963495,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{116718=Not long after Tortorella was hired, Cory Schneider was traded to the New Jersey Devils in exchange the ninth pick in the 2013 NHL Entry Draft; the Canucks chose London Knights centre Bo Horvat with the selection. The Canucks participated in their first outdoor NHL game on March 2, 2014, a match against the Ottawa Senators at BC Place. The event was titled the 2014 Heritage Classic.[126] On March 4, 2014, a day before the NHL trade deadline, Roberto Luongo was traded back to the Florida Panthers, along with Steven Anthony, in exchange for Swedish goaltender Jacob Markstrom and forward Shawn Matthias, with Luongo stating that the coach's decision not to play him at the Heritage Classic resulted in his request to be traded.[127] The Canucks failed to make the playoffs in the 2013–14 season, the first time in six years.[128] Only one day after being eliminated from playoff contention, GM Mike Gillis was fired. Soon after, Trevor Linden was named president of hockey operations. Three weeks after Linden's hiring, John Tortorella and assistant coach Mike Sullivan were relieved of their coaching duties.[129], 147123=Two fans of the Canucks unofficially became mascots of their team at the end of 2009, donning zentai-style, skin-tight green bodysuits in slightly different shades of green as The Green Men, and have been known to accompany their team on road games, as they did in the 2011 Stanley Cup Finals to the TD Garden against the Boston Bruins. In November 2014, the Green Men announced that 2014-15 was to be their final season.[146], 126637=The Canucks play their home games at Rogers Arena. The stadium opened in 1995 as General Motors Place, and seats up to 18,890 for Canucks games. Rogers Arena was also the 2010 Winter Olympics' ice hockey venue. The arena is owned and operated by Canucks Sports & Entertainment. Before moving to Rogers Arena, the Canucks played their home games at Pacific Coliseum in Hastings Park for 25 years. The arena currently holds 16,281 for ice hockey, though capacity at its opening was 15,713. During the 2010 Olympics, it was the venue for figure skating and short track speed skating. The Pacific Coliseum is now the home of the Western Hockey League (WHL)'s Vancouver Giants., 108453=During the season-opening game against the Pittsburgh Penguins on October 6, 2011, a tribute video was staged by the fans in Rogers Arena congratulating the Canucks for their record setting season and for making the Stanley Cup Finals. The team also honoured the late Rick Rypien on October 18. For the rest of the season, the players wore decals on their helmets saying \"37 RYP.\" The Canucks were also involved in a couple of trades during the 2011–12 season, dealing Mikael Samuelsson and the recently acquired Marco Sturm to the Florida Panthers for David Booth, Steven Reinprecht and a 2013 draft pick. They would not trade again until February 27, when rookie Cody Hodgson and Alexander Sulzer were traded to the Buffalo Sabres in exchange for Zach Kassian and Marc-Andre Gragnani. The Canucks were strong contenders for much of the 2011–12 season, catching the St. Louis Blues to secure the top seed in the Western Conference, as well as beating out the New York Rangers for their second-consecutive Presidents' Trophy. The Canucks clinched both the Western Conference and Presidents' Trophy in their last game of the season, a 3–0 win over the Edmonton Oilers. Despite projections for another Stanley Cup run at the outset of the 2012 playoffs, Vancouver lost their first home games and failed to score in Game 3, as the eighth seed Los Angeles Kings took a commanding 3–0 series lead. Despite extending the series with a 3–1 win in Los Angeles, a game which saw the return of the previously-concussed Daniel Sedin, the Canucks were ultimately eliminated in five games. Vancouver's opening round loss also marked the third consecutive year that the Canucks lost to eventual Stanley Cup champions. (Chicago 2010, Boston 2011, and Los Angeles 2012), 142526=After a relationship with CKNW stretching since the Canucks joined the NHL in 1970, the Canucks entered into a new radio broadcast deal in 2006 with TSN Radio 1040 (previously known as Team 1040) - an AM sports/talk station. John Shorthouse continues to call the play-by-play, as he has since 1999, though with his role on the Canucks' television broadcasts becoming more prominent in recent years, he is replaced for approximately 50 games per season by Jon Abbott. He is joined with colour commentary by Dave Tomlinson, who has been with the broadcasts since 2010.[142] The games aired on 14 stations across British Columbia., 140597=On opening night October 9, 2010, the Canucks revealed jerseys they would wear for select games during their 40th Anniversary season. They look exactly like the jerseys the team wore in their early years, only with the addition of Reebok manufacturing the jerseys. The jerseys sport a 40th Anniversary patch on the upper-right chest commemorating their 40th season. Just like the early years, they also bear no names, only numbers, with permission from the NHL., 103526=Entering the 2011 Stanley Cup playoffs, the Canucks were paired with the eighth-seeded and defending Stanley Cup champion Chicago Blackhawks, who had eliminated Vancouver in the previous two years. While Vancouver initially took a 3–0 lead in the series, Chicago came back to also win three straight games and force the series into a Game 7. Luongo, who had a history of struggling against the Blackhawks, was pulled in Games 4 and 5; he also began Game 6 on the bench in favour of Cory Schneider before returning as the starter in Game 7. In the deciding game, Vancouver held a 1–0 lead with less than two minutes remaining in regulation when they gave up a shorthanded goal to Chicago captain Jonathan Toews. Forced into overtime, winger Alexandre Burrows scored his second goal of the game following a failed clearing attempt by Chicago defenceman Chris Campoli to win the series., 69063=The Canucks began the campaign overseas in a two-game series against the Mighty Ducks of Anaheim in Tokyo, Japan. It marked the first time in NHL history that a regular season game was held outside of North America – an effort from the league to attract attention to the sport in anticipation of the 1998 Winter Olympics, which were held in Nagano, Japan.[55] As the team's performance continued to worsen, starting the 1997–98 season with three wins in the first 16 games, Quinn was fired as general manager after ten years with the team.[52] Soon thereafter, Renney was fired and replaced as coach by Mike Keenan, reuniting him with Messier, another central figure from the Rangers' 1994 team. Keenan's hiring reportedly exacerbated tensions between groups of Canucks players and his negative relationship with Linden was given ample media attention.[56][57] Two months into his tenure with the team, his role was expanded and he was made de facto general manager. With control of player personnel, Keenan overhauled the roster, making ten trades within two months, most notably dealing Linden to the New York Islanders.[58] Although the trade was unpopular with fans, the Canucks received winger Todd Bertuzzi in return, who would later become an integral part of the team's return to success in the next decade. Defenceman Bryan McCabe was also part of the deal, who would eventually be involved in a key transaction in the 1999 NHL Entry Draft. After the Canucks finished the 1997–98 season last in the Western Conference,[59] former NHL Vice President Brian Burke was named general manager in the summer.[60], 227651=There have been 18 head coaches for the Canucks. The franchise's first head coach was Hal Laycoe, who coached the Canucks for two seasons. Marc Crawford coached the most games of any Canucks head coach with 529 games, and has the most points all-time with the Canucks, with 586. He is followed by Pat Quinn, who has 310 points all-time with the Canucks. Alain Vigneault has the most points in a season of any Canucks coach, with 117 in the 2010–11 season. Roger Neilson is the only Hockey Hall of Fame inductee to coach the Canucks. Quinn and Vigneault are the only two Canucks head coaches to win a Jack Adams Award with the team. Bill LaForge, who coached the start of the 1984 season, has the least points with the Canucks, with 10. Harry Neale served the most terms as head coach of the Canucks with three while Pat Quinn served two. Vigneault was the head coach of the Canucks from the 2006–07 season through to the end of the 2012–13 season. Vigneault was fired on May 22, 2013, after first round playoff exits in the previous two seasons, and was replaced by John Tortorella on June 25, 2013. Tortorella was fired at the end of the following season, on May 1, 2014.[159] On June 23, 2014, Willie Desjardins was named the team's 18th head coach.[160], 65675=In the 1996 off-season, Ley was replaced by Tom Renney, who lasted for less than two seasons.[49] Despite strong performances from Mogilny and team-leading point-scorer Martin Gelinas in Bure and Linden's absence (both of whom were injured for long periods of time during the season),[14] the Canucks missed the playoffs for the first of four consecutive seasons that year.[13] Making another high-profile acquisition on July 27, 1997, the Canucks signed free agent Mark Messier to a three-year deal.[50][51] They had come close to signing Wayne Gretzky the previous summer, but were reportedly spurned away when they refused to continue negotiations and gave Gretzky an ultimatum to sign.[52], 18708=Vancouver became home to a professional ice hockey team for the first time in 1911 when Patrick brothers Frank and Lester established the Vancouver Millionaires, one of three teams in the new Pacific Coast Hockey Association. To accommodate the Millionaires, the Patrick brothers directed the building of the Denman Arena, which was known at the time as the world's largest artificial ice rink (it burned down in 1936).[2] The Millionaires played for the Stanley Cup five times, winning over the Ottawa Senators in 1915 on home ice.[3] It marked the first time the Stanley Cup was won by a West Coast team in the trophy's history.[3], 68281=Heading into the 1997–98 season, Linden resigned his captaincy for Messier, who had developed a strong reputation as a leader, having captained the New York Rangers over the Canucks in 1994 (he also captained the Oilers to a Stanley Cup in 1990). Linden later recalled regretting the decision, feeling that Messier generated hostility and tension in the dressing room.[53] Messier later said if he could change one thing about his time in Vancouver, he would not have accepted the captaincy.[54], 157452=Updated July 28, 2015.[147], 81795=Amidst a run for the team's first Northwest Division title the following season, the Canucks received significant media attention for their involvement in a violent on-ice attack during a game against the Avalanche. On March 8, 2004, Bertuzzi grabbed Avalanche forward Steve Moore from behind and punched him in the head. As Moore fell to the ice, Bertuzzi landed on top of him; Moore suffered three fractured neck vertebrae, facial cuts and a concussion.[73] Bertuzzi's actions were in retaliation of a hit that Moore landed on Naslund during a previous game between the two teams.[74] For his actions, Bertuzzi was suspended by the NHL and International Ice Hockey Federation (IIHF) through to the start of the 2005–06 season. He also faced legal action in British Columbia court, while Moore filed lawsuits against him and the Canucks organization in Colorado and Ontario courts., 94122=With Naslund's departure, Gillis announced on September 30, 2008, that Luongo had been named team captain, marking the first time since Bill Durnan of the Montreal Canadiens in 1947 that a goaltender had been named the captain of an NHL team.[94] During the ensuing season, the Canucks retired their second jersey number in team history, hanging Linden's number 16 beside Smyl's number 12 in a pre-game ceremony on December 17, 2008.[95] Later that month, the Canucks acquired unrestricted free agent Mats Sundin.[96] The arrival of the former Toronto Maple Leafs captain and 500-goal scorer in the NHL came with high expectations. However, Sundin scored at a pace below his usual pace and retired in the subsequent off-season. The team finished the regular season with another Northwest Division title and the third seed in the Western Conference.[97] In the 2009 playoffs, the Canucks swept their first round series against the St. Louis Blues (the first four-game sweep in franchise history),[98] but were defeated in six games by the Chicago Blackhawks in the second round.[99], 129755=In 1978, aiming for a more aggressive image, the organization asked San Francisco-based design agency Beyl & Boyd to design new uniforms. These consisted of a huge yellow, red-orange and black striped \"V\" coming down from the shoulders (suggesting \"victory,\" according to its designers). It is generally considered to be one of the most unpopular uniforms in NHL history (hockey writer Stephen Cole referred to it looking like \"a punch in the eye\")., 211822=Though goaltenders are not permitted to act as captains during games, Roberto Luongo served as the captain from 2008 to 2010, but because of the NHL rule against goaltender captains, the league did not allow Luongo to serve as on-ice captain.[153][154] In his place, the three alternate captains were responsible for dealing with officials during games. They also handled ceremonial face-offs.[154] Luongo was not permitted to wear the \"C\" on his jersey. Instead, he incorporated it into the artwork on the front of one of his masks, which he occasionally wore for the early months of the 2008–09 season.[155], 26974=To fill the Canucks' roster for their inaugural season, the league held an Expansion Draft in the preceding summer. A draft lottery was held on June 9, 1970, determining who between the Canucks and Sabres would get the first selection in the Expansion Draft, as well as the 1970 NHL Amateur Draft; the Sabres won both spins. With his first selection in the Expansion Draft, Canucks General Manager Bud Poile chose defenceman Gary Doak.[8] Among the other players chosen by Vancouver were centre Orland Kurtenbach, who was named the Canucks' first captain,[9] as well as defenceman Pat Quinn, who later became the team's general manager and coach in the 1990s. Two days later, on June 11, 1970, the Canucks made defenceman Dale Tallon their first-ever Amateur Draft selection. Tallon played three seasons with the club before being traded away to the Chicago Black Hawks. By comparison, the Sabres chose centre Gilbert Perreault with the first overall selection they won from the lottery; Perreault went on to become a nine-time All-Star and member of the Hockey Hall of Fame.[10], 54476=In 1994, the Canucks made their second trip to the Stanley Cup Finals, entering the playoffs as the seventh seed in the renamed Western Conference. Despite underachieving in the regular season (their points total decreased by 16 from the previous year),[14] the Canucks played well in the playoffs and embarked on another unexpected run., 122601=On November 17, 2004, the Aquilini Investment Group, headed by Francesco Aquilini, purchased a 50% share in Orca Bay Sports and Entertainment (the owners of both the Canucks franchise and Rogers Arena) from John McCaw, Jr.. Prior to the sale, Aquilini and two business partners, Tom Gaglardi and Ryan Beedie, had negotiated with Orca Bay for several months without concluding an agreement. In January 2005, Gaglardi and Beedie filed a lawsuit against Aquilini and Orca Bay, alleging that Aquilini and Orca Bay had acted in bad faith in concluding a deal using information obtained from their joint offer., 118743=On May 21, 2014, Jim Benning was announced as general manager.[130] On June 23, 2014, Willie Desjardins was named the 18th head coach of the Canucks.[131] The team underwent a series of changes under the new management structure: veteran forward Ryan Kesler was traded to the Anaheim Ducks for Nick Bonino, Luca Sbisa and first- and third-round draft selections in 2014, and defenceman Jason Garrison was traded to the Tampa Bay Lightning for a second-round draft selection in 2014.[132][133] On July 1, 2014, Ryan Miller signed with the Canucks, thus becoming the starting goaltender, and on July 2, Radim Vrbata was signed to play on a line with the Sedin twins.[134][135] The Canucks finished second in the Pacific Division in the 2014-15 season, making the playoffs after one year missing the playoffs. The Canucks lost in six games to the Calgary Flames., 34377=The Canucks missed the playoffs in the two seasons thereafter.[13] Meanwhile, Kurtenbach had since retired and assumed a coaching position with Vancouver. His departure as a player marked the beginning of a seven-year period in which the Canucks had four different captains – Boudrias, Chris Oddleifson, Don Lever and Kevin McCarthy. Following their post-season loss to the Islanders in 1976, Vancouver did not have another winning season for 16 years, though they made the playoffs nine times in that span.[14] Following the 1976–77 season, Maloney was replaced as general manager by Jake Milford, who acquired such players as Stan Smyl, Thomas Gradin and Richard Brodeur, a core that would lead the team throughout the 1980s.[17], 75887=Under the leadership of General Manager Brian Burke and Head Coach Marc Crawford,[64] the Canucks once again became a playoff team. After qualifying for the post-season in 2001 and 2002 as the eighth and final seed in the Western Conference (losing to the eventual Stanley Cup winners Colorado Avalanche and Detroit Red Wings, respectively),[13] the Canucks became regular contenders for the Northwest Division title., 72234=Suffering their worst season since 1977–78 the subsequent year,[14] Keenan was fired midway through and replaced with Marc Crawford (who had won the Stanley Cup with the Colorado Avalanche in 1996).[58] Meanwhile, Pavel Bure, unhappy in Vancouver, had withheld himself from the team and requested a trade at the beginning of the campaign. By January 1999, he was dealt to the Florida Panthers in a seven-player trade, which saw eventual five-time NHL All-Star Ed Jovanovski heading west. The trade also involved two draft picks. Finishing last in the Western Conference for a second-straight year,[61] Vancouver possessed the fourth overall pick in the 1999 NHL Entry Draft. Set on drafting highly touted Swedish forwards Daniel and Henrik Sedin, Burke orchestrated several transactions to move up to the second and third overall picks, with which he chose both players.[62], 46077=Following Milford's tenure as general manager from 1977 to 1982, the position was held by Harry Neale for three years, then Jack Gordon for two. The latter was responsible for trading away power forward Cam Neely to the Boston Bruins in 1986.[24] In addition to Neely, the Canucks gave up their 1987 first round draft pick, with which the Bruins chose Glen Wesley, and in return acquired centre Barry Pederson. While Pederson collected back-to-back 70-point seasons with the Canucks in his first two seasons after the trade, he was traded away to the Pittsburgh Penguins in 1989 as his performance quickly declined.[25] Neely went on to have a Hall of Fame career with the Bruins, recording three 50-goal seasons,[26] and Wesley had a solid 20-year career.[27], 20288=After the Millionaires disbanded following the 1925–26 season, Vancouver was home to only minor league teams for many years. Most notably, the present-day Canucks' minor league predecessor (also known as the Vancouver Canucks), played from 1945 to 1970 in the Pacific Coast Hockey League and Western Hockey League., 29971=With the Canucks' roster set, the team played its inaugural game against the Los Angeles Kings on October 9, 1970. They lost the contest 3–1; defenceman Barry Wilkins scored the Canucks' lone goal in the game and first in franchise history, a backhander against goaltender Denis DeJordy.[11] Two days later, the squad recorded the first win in franchise history, a 5–3 victory over the Toronto Maple Leafs.[12], 63025=The Canucks made another significant move in the off-season by acquiring high-scoring Russian forward Alexander Mogilny from the Buffalo Sabres, reuniting Bure with his former CSKA Moscow and national team linemate.[43] While Mogilny became the second player in team history to record 50 goals and 100 points in a season,[32][44] chiefly playing with centre Cliff Ronning, the expected chemistry between Mogilny and Bure never materialized, with the latter suffering a season-ending knee injury early in the campaign.[45] Vancouver finished 1995–96 two games below .500 and were defeated in the first round of the playoffs by the Colorado Avalanche.[13][14] The season also marked the arrival of another future Canucks superstar, as Markus Naslund was acquired from the Pittsburgh Penguins in exchange for Alek Stojanov. The deal is regarded as one of the most lopsided trades in NHL history, as Stojanov soon became a minor-leaguer, while Naslund became the team's all-time leading goal- and point-scorer years later.[46][47][48], 121400=The initial owners were Tom Scallen's Medicor group. In 1972, hints of impropriety were circulating about Scallen. He was charged with stock fraud and spent the last two years of his Canuck ownership in prison.[136] In 1974 Scallen and Medicor sold out to Frank Griffiths. From 1988 to 1997, the Vancouver Canucks were owned by local businessman and philanthropist Arthur Griffiths, who had inherited ownership from his father, Frank. However, he was forced to sell his majority interest in the Canucks after overextending his resources trying to build a new arena, GM Place (currently known as Rogers Arena). As a result, he sold his majority share to American billionaire John McCaw, Jr.., 83649=The Canucks went on to win their first Northwest Division title that season, but lost in the first round of the 2004 playoffs to the Calgary Flames.[13] After their elimination, Burke's contract as general manager was not renewed and he was replaced by Assistant General Manager and Director of Hockey Operations Dave Nonis. At 37 years of age, he became the youngest general manager in team history.[75] Due to the NHL lockout, the 2004–05 season was not played. Several Canucks players went overseas to Europe to play professionally, including Naslund and the Sedin twins, who all returned to their former Swedish team, Modo Hockey.[76], 31753=Prior to the 1974–75 season, Scallen and his ownership group from Minnesota sold the team to local media mogul Frank Griffiths for $9 million.[15] Also in the summer of 1974, the Canucks were re-aligned within the league and placed in the new Smythe Division. They responded with their first winning record (38 wins, 32 losses and 10 ties), finishing first in the Division with 86 points.[14] Making their debut in the Stanley Cup playoffs, the Canucks lost the opening series of the 1975 post-season in five games to the Montreal Canadiens. Head Coach and General Manager Phil Maloney (the third GM in team history after Poile and Hal Laycoe) recalled the importance of a successful season for the Canucks in that year specifically, as the rival league World Hockey Association (WHA) had established another major professional team in the city, the Vancouver Blazers. Competing for the same hockey market, the Canucks emerged over the Blazers as the latter relocated to Calgary, Alberta, the following season.[16] The Canucks posted a second consecutive winning record and made the playoffs in 1975–76, but lost to the New York Islanders in a two-game preliminary series.[13], 216146=The Canucks selected Dale Tallon, a defenceman from the Toronto Marlboros with their first pick, second overall in the 1970 NHL Amateur Draft. In 1978, they drafted Stan Smyl from the New Westminster Bruins. Ten years later, the Canucks also drafted Trevor Linden from the Medicine Hat Tigers in 1988.[156] The Canucks have had 13 top-five draft picks in franchise history, but have never had the first overall pick. The Canucks are one of the two franchises in the NHL to have drafted two twin brothers in the same year. They drafted Daniel Sedin second overall and Henrik Sedin third overall in 1999.[157] Two players from British Columbia have been selected by the Canucks in the first round of an NHL Entry Draft: Cam Neely in 1983 and Jake Virtanen in 2014.[158], 101737=During the second half of the campaign, the Canucks pulled ahead in their battles for the Western Conference and Presidents' Trophy titles with the Detroit Red Wings and Philadelphia Flyers, respectively, widening the gap as the season closed.[107][108] On March 29, 2011, the Canucks clinched first place in the West for the first time in team history.[109] Two days later, they accomplished another first by securing the Presidents' Trophy.[110] Finishing with 54 wins and 117 points, the 2010–11 team broke the previous Canuck records in both categories by significant margins. Individually, numerous Canucks players had career years. Daniel Sedin won the Art Ross Trophy with a league-leading 104 points, marking the first time in NHL history that two brothers won the award in back-to-back years. Meanwhile, Ryan Kesler tied Daniel Sedin for the team goal-scoring lead, with 41 goals. In goal, Roberto Luongo and rookie backup Cory Schneider captured the William M. Jennings Trophy for recording the lowest team goals against average (GAA) in the NHL., 56936=Following their victory over the Flames, the Canucks then went on to defeat both the Dallas Stars and Toronto Maple Leafs (both in five games) en route to the franchise's second Stanley Cup Finals appearance.[13] Forward Greg Adams sent the Canucks into the Finals with a double-overtime goal against Maple Leafs goaltender Felix Potvin in Game 5.[35] Staging the second coast-to-coast Finals in league history, the Canucks were matched against the Presidents' Trophy-winning New York Rangers. Vancouver achieved victory in Game 1 by a score of 3–2 in overtime, largely due to a 52-save performance by goaltender McLean.[36] After losing Games 2, 3 and 4, the Canucks won the next two to force a seventh game at Madison Square Garden on June 14, 1994.[13] Despite a two-goal effort (one on a shorthanded breakaway) from Linden (who was playing with cracked ribs),[37] Vancouver lost the game by a 3–2 score. The Canucks' efforts to tie the game included a post hit by forward Nathan LaFayette with just over a minute remaining in regulation.[38] The loss was followed by a riot in Downtown Vancouver, which resulted in property damage, injuries and arrests.[39] Two days after the riots, the team held a rally at BC Place attended by 45,000 fans, who congratulated the team for their effort.[40], 92406=Suffering numerous injuries to players in the 2007–08 season, the Canucks struggled and finished three points out of a playoff spot.[89] The final game of the season, a 7–1 loss to the Calgary Flames, marked Trevor Linden's last NHL game, as the former Canucks' all-time leading scorer retired.[90] Having missed the playoffs for the second time in three years,[13] the team underwent numerous personnel changes in the off-season. After Nonis was fired and replaced with former player agent Mike Gillis in April 2008,[91] longtime Canucks captain Markus Naslund, as well as Brendan Morrison, were let go via free agency.[92] Also in the off-season, on May 29, 2008, the Canucks lost defensive prospect Luc Bourdon to a fatal motorcycle crash near his hometown of Shippagan, New Brunswick.[93], 133715=In 1997 the Canucks unveiled a new logo, in which a Haida-style orca breaking out of a patch of ice forms a stylized \"C.\" The logo has been much-maligned, accused of being a blatant reference to their parent company, Orca Bay (now Canucks Sports and Entertainment). At the time, General Manager Pat Quinn discussed wanting to have a West Coast colour scheme, and overall West Coast themes in the logo; the colour scheme included blue, red and silver. Beginning in 2001, an alternate jersey was utilized, with contrasting shoulder patches and a blue-to-maroon graduated colour in the body. In 2006, these gradient-coloured alternate jerseys were officially replaced with the popular, royal blue \"Stick-in-Rink\" uniforms from the 1970s., 40844=Entering the Finals against the New York Islanders, the Canucks were the first team from Western Canada to play for the Stanley Cup in 56 years, when the Victoria Cougars reached the 1926 Stanley Cup Finals. It also marked the first ever coast-to-coast Stanley Cup Finals.[22] Competing against the Islanders – the Stanley Cup champions of the previous two years, who had finished with 41 points more than Vancouver in the regular season standings – Vancouver took the first game to overtime. In the final minute of the extra period, Canucks defenceman and fan favourite Harold Snepsts gave the puck away with an errant pass from behind his net, leading to a Mike Bossy goal. Like the first game, the Canucks held a 3–2 lead after the first two periods in the second game, but were not able to keep their lead, and lost 6–4.[23] The Canucks were unable to complete their Cinderella run and were swept, losing their next two games by 3–0 and 3–1 scores. The 1982 playoffs proved to be the last year in which Vancouver won a playoff series until 1992.[13], 80523=In 2002–03, the Canucks lost the division title to the Colorado Avalanche on the last day of the regular season. Individually, Naslund was surpassed the same night by Avalanche forwards Peter Forsberg and Milan Hejduk for the Art Ross Trophy and Maurice \"Rocket\" Richard Trophy, respectively.[72] Entering the 2003 playoffs with the fourth seed in the West, the Canucks won their first playoff series in eight years, defeating the St. Louis Blues in seven games before losing to the Minnesota Wild in the second round.[13], 123454=On November 8, 2006, Aquilini, along with his brothers Roberto and Paolo, purchased the remaining 50% of the Vancouver Canucks and Rogers Arena from McCaw.[137][138], 88925=With widespread changes to team personnel in 2006–07, the Canucks won the Northwest Division title for the second time in three seasons.[14] In his first season with the Canucks, Luongo was nominated for the Hart Memorial and Vezina Trophies.[84] He also tied Bernie Parent for the second-most wins in a single-season by an NHL goaltender, with 47.[85] The Canucks opened the 2007 playoffs with a quadruple-overtime win against the Dallas Stars. Ending at the 138-minute mark, the game was the longest in club history and the sixth-longest in NHL history.[86] The Canucks also set a league record for shots against in one game, allowing 76.[87] Vancouver won the series in seven games despite a lack of goal-scoring; Stars goaltender Marty Turco recorded three shutouts in the series, becoming the only goalie to achieve the feat and still lose a series.[citation needed] Advancing to the second round, the team was defeated in five games by the Anaheim Ducks, who went on to win the Stanley Cup that year.[88] Following the playoffs, Head Coach Vigneault received the Jack Adams Award.[84], 73999=The Canucks began to show improvement in the 1999–2000 season, finishing four points out of a playoff spot.[63] During the campaign, Mogilny was traded to the New Jersey Devils for forwards Denis Pederson and Brendan Morrison. With Bure gone and Messier in the last year of his contract, several previously under-achieving players began developing into key contributors for the team, most notably Markus Naslund and Todd Bertuzzi. In the off-season, Messier left the team and returned to the Rangers; during the team's September 2000 training camp, held in Sweden, Naslund was selected to replace Messier as captain, a position he held for eight years, tying Smyl's record.[20] As part of the team's stay in Sweden, they played exhibition games against Swedish and Finnish teams as part of the NHL Challenge., 208591=During the 2012 NHL Entry Draft, draftees were given jerseys with an apostrophe before the 12 (i.e. ’12), to distinguish them from the 12 that was retired in honor of Smyl. (NHL draft custom states that draftees are given jerseys with the number indicating the year they were drafted.), 77820=Coinciding with the team's success in the early 2000s was the rise of captain Markus Naslund and power forward Todd Bertuzzi into high-scoring wingers and NHL All-Stars. Joined by centre Brendan Morrison during the 2001–02 season, the trio were nicknamed the \"West Coast Express\" (after the Vancouver rail service of the same name) among Canucks fans and media.[65] Over the next three years, Naslund ranked in the top five among league scorers and was a Lester B. Pearson Award winner and Hart Memorial Trophy finalist in 2003.[66][67][68][69] Bertuzzi was also a top-five scorer in the league in 2001–02 and 2002–03.[66][67] During this span, Burke made a trade with the Washington Capitals to facilitate the return of Trevor Linden.[70] The ex-captain returned to a markedly different Canucks team with a young core consisting of the aforementioned trio, defencemen Ed Jovanovski and Mattias Ohlund, as well as goaltender Dan Cloutier.[71], 131904=The yellow home jerseys were scrapped in 1989 in favour of more conventional white ones, and the triangular shoulder stripes which adorned the post-\"V\" jerseys were discarded as well. The new incarnation was worn from 1989–92, when a subtle change was made – and went largely unnoticed for the rest of the jersey's lifespan. The orange was changed to red, and the deep \"gold\" colour was changed to a much brighter yellow, reportedly because jersey-maker CCM no longer produced the required hues. In 1996, an alternate jersey was introduced, retaining the \"Flying Skate\" logo, but using a salmon colour graduating to black near the bottom., 210271=There have been 13 Canucks players who have served as the captain. The franchise's first captain was Orland Kurtenbach, who captained the team until his retirement in 1974.[149] The longest-tenured Canucks captain was Stan Smyl, who was appointed for eight seasons. Trevor Linden, who captained from 1990 to 1997, played 16 seasons with the Canucks, a franchise high.[150] Swedish winger Markus Naslund, who captained for seven seasons[a], was the only non-Canadian to have captained the Canucks until fellow Swede Henrik Sedin was named captain for the 2010–11 season. Smyl and Sedin are the only Canucks captains to have spent their entire NHL playing careers with the team.[151][152], 124376=On January 29, 2008, the company responsible for operating the Vancouver Canucks and Rogers Arena, changed its name from Orca Bay Sports and Entertainment to Canucks Sports & Entertainment., 47744=After the installation of former Canucks defenceman Pat Quinn as general manager in the summer of 1987,[28] the team underwent an immediate rebuilding process, trading away core veterans for younger prospects and players. Among the more key transactions was a deal with the New Jersey Devils, in which Sundstrom was traded away in exchange for winger Greg Adams and goaltender Kirk McLean. In addition to Quinn's trades, the team improved through the draft route with two selections, in particular. With the second overall selection in the 1988 NHL Entry Draft, the Canucks chose winger Trevor Linden from the Western Hockey League (WHL). The following year, the team made a controversial selection by choosing Russian winger Pavel Bure 113th overall. Bure was believed by most teams to be ineligible for selection that year. Consequently, his draft by the Canucks took a year to be verified by the league as team management went about procuring documents to prove his eligibility.[29], 8993=The Canucks joined the league in 1970 as an expansion team along with the Buffalo Sabres. In its NHL history, the team has advanced to the Stanley Cup Finals three times, losing to the New York Islanders in 1982, the New York Rangers in 1994 and the Boston Bruins in 2011. They have won the Presidents' Trophy in back-to-back seasons as the team with the league's best regular season record in the 2010–11 and 2011–12 seasons. They won three division titles as a member of the Smythe Division from 1974 to 1993, and seven titles as a member of the Northwest Division from 1998 to 2013., 99459=The 2010–11 season began on October 9, 2010, with a pre-game ceremony to commemorate the team's 40-year anniversary. Henrik Sedin was officially named in the ceremony as the team's new captain, replacing Roberto Luongo, who had relinquished his captaincy in the off-season.[106] The Canucks played the Los Angeles Kings, their first opponent in their inaugural season in 1970; both teams wore their original uniforms used in the Canucks' inaugural game. Throughout the season, the Canucks continued to celebrate their 40th anniversary with the creation of the \"Ring of Honour,\" a permanent in-arena display commemorating their most significant players from past years. Four players were inducted during the campaign – Orland Kurtenbach, Kirk McLean, Thomas Gradin and Harold Snepsts. In December 2010, the Canucks also honoured Markus Naslund by retiring his number 19 jersey. Naslund had retired two years after leaving the Canucks in 2008., 43151=After their improbable Stanley Cup run, the Canucks slipped back into mediocrity for the rest of the 1980s, making the playoffs only four times for the rest of the decade.[13] Notable players that joined the Canucks' core following the 1982 playoffs included offensively-skilled forwards Patrik Sundstrom and Tony Tanti. Beginning in 1983–84, the Canucks' scoring title was held by either Sundstrom or Tanti for four of the next five seasons. For most of the second half of the 1980s, the Canucks competed with the Los Angeles Kings for the final playoff spot in the Smythe Division. The years in which they qualified, the team was eliminated by the Edmonton Oilers (in 1985–86) or the Calgary Flames (in 1982–83, 1983–84 and Flames championship season of 1989, which was decided in Game 7), both division rivals.[13], 123836=In May 2007, Gaglardi and Beedie's civil lawsuit over Aquilini's purchase reached the Supreme Court of British Columbia. The court ruled for Aquilini, on January 10, 2008. The court held that there was no legal partnership between Aquilini, Beedie, and Gaglardi, and that McCaw was free to sell the team to anyone he wished.[139], 37700=The Canucks made their first significant playoff impact in the post-season of 1982. In their previous five playoff appearances, the team had failed to win a single series. Though the Canucks finished three games under a .500 win percentage in the 1981–82 regular season, they began gaining momentum by finishing the campaign on a nine-game unbeaten streak.[18] Meanwhile, Smyl emerged as the club's leader, replacing McCarthy as captain after the latter was sidelined with an injury late in the season (he would retain that position for a team-record eight years).[19][20] Continuing their success in the playoffs, the Canucks made the Stanley Cup Finals with a combined 11–2 record in series against the Calgary Flames, Los Angeles Kings, and Chicago Black Hawks.[13] Despite having a losing regular season record, Vancouver had home ice advantage in the first series, having finished second in the Smythe Division to the Edmonton Oilers. The Canucks also had home ice advantage during the second round series against the Kings, who upset the Oilers in the first round., 21637=With the intention of attracting an NHL franchise, Vancouver began the construction of a new modern arena, the Pacific Coliseum, in 1967.[4] The WHL's Canucks were playing in a small indoor arena at the time, the Vancouver Forum, situated on the same Pacific National Exhibition grounds as the Coliseum. Meanwhile, a Vancouver group led by WHL Canucks owner and former Vancouver mayor Fred Hume made a bid to be one of the six teams due to join the league in 1967, but the NHL rejected their application.[5] Bid leader Cyrus McLean called the denial a \"cooked-up deal,\" referring to several biases that factored against them. Speculation long abounded afterwards that the bid was hindered by Toronto Maple Leafs president Stafford Smythe; after a failed Vancouver-based business deal, he was quoted as saying that the city would not get a NHL franchise in his lifetime.[citation needed] Additionally, along with the Montreal Canadiens, Smythe purportedly did not wish to split Canadian Broadcasting Corporation (CBC) hockey revenues three ways rather than two.[6] There were reports at the time, however, that the group had made a very weak proposal in expectation that Vancouver was a lock for one of the new franchises.[citation needed], 49532=As the decade turned, a shift in the Canucks' leadership occurred as Stan Smyl resigned his captaincy prior to the 1990–91 season due to a reduced on-ice role with the team. In his place, the Canucks implemented a rotating captaincy of Linden, Dan Quinn and Doug Lidster; of the three, Linden retained the captaincy thereafter, becoming the youngest permanent captain in team history at 21 years of age. At the end of the season, Smyl retired as the team's all-time leader in games played, goals, assists and points.[30] Led by Linden and in large part to Quinn's dealings, the Canucks rose to prominence in the early 1990s. This increased success came roughly around the time the Oilers and Flames began to sink in the standings. As a result, Vancouver won their first division title in 17 years with 42 wins, 26 losses and 12 ties during the 1991–92 season. During the campaign, the Canucks honoured Smyl, who had remained on the team as an assistant coach, by making him the first player in team history to have his jersey (number 12) retired.[30] In the 1992 playoffs, the Canucks won their first series since 1982 before being eliminated by the Oilers in the second round.[13] Quinn and Bure became the first Canucks recipients of major NHL awards in the off-season, being awarded the Jack Adams Award as the best coach (Quinn assumed a dual coaching and general managerial role starting that year) and the top rookie in the league, respectively.[31] The following year, the Canucks repeated as regular season division champions, while Bure emerged as arguably the team's first superstar with his first of back-to-back 60-goal seasons, totals which remain the highest recorded in Canucks history.[32] As the team struggled to score in the second half of the 1993–94 season, Bure recorded 49 goals in the club's final 51 games and contributed to 46.45% of his team's goals in the final 47 games of the season to carry the Canucks into the 1994 post-season. Jim Matheson of the Edmonton Journal called Bure \"the NHL's best forward the last 40 games, scoring almost a goal a game.\"[33], 105478=Advancing to the Stanley Cup Finals for the first time since 1994, the Canucks opened the fourth round against the Boston Bruins with a 1–0 win in Game 1. Winger Raffi Torres scored the winning goal with 18.5 seconds remaining. The following game, the Canucks won 3–2 in overtime with Burrows scoring the winner 11 seconds into the extra frame, making it the second fastest overtime goal in Stanley Cup Finals history.[111] As the series shifted from Rogers Arena to TD Garden for Games 3 and 4, Boston tied the series with 8–1 and 4–0 victories. Game 3 marked the highest score by one team in a Finals game since the Colorado Avalanche defeated the Florida Panthers in 1996.[112] During the contest, the Bruins lost first-line forward Nathan Horton for the remainder of the series when he suffered a serious concussion from a controversial hit by Canucks defenceman Aaron Rome, who received a four-game suspension as a result.[113] Returning to Vancouver for Game 5, the Canucks won 1–0 with a goal from late-season acquisition Maxim Lapierre in the third period.[114] With an opportunity to win the Stanley Cup in Boston, Vancouver lost Game 6 by a 5–2 score. The Bruins' first four goals occurred in a span of four minutes and 14 seconds during the first period, setting a Finals record for the fastest four goals scored by a team (surpassing the previous mark of five minutes and 29 seconds set by the Montreal Canadiens in 1956).[115] Hosting Game 7, the Canucks were shut-out 4–0 as Boston won their first Stanley Cup in 39 years, setting off riots and looting in downtown Vancouver.[116], 131272=The \"Flying V\" theme was abandoned in 1985, to feature the team's emblem on the front rather than the \"V\" (the emblem had previously been worn only on the arms). The logo consisted of the word \"Canucks\" in a diagonal slant as part the blade of a skate. The logo, with its laser-like design, was sometimes referred to as the \"Star Wars\" logo, the \"waffle iron,\" the \"plate of spaghetti,\" and most commonly as the \"Flying Skate.\", 112489=Prior to the start of the 2012–13 season, the league's collective bargaining agreement (CBA) expired. Unable to agree on a new CBA, the NHL enacted a lockout on September 15, 2012. The lockout continued on for 119 days, which resulted in the need for a shortened season.[117][118] After the lockout ended, the Vancouver Canucks played their first game of the season on January 19, 2013, losing 7–3 to the Anaheim Ducks. Afterwards, however, they bounced back, and at one point won six games in a row before losing to the Dallas Stars at home on February 15. In the 4–3 loss, Henrik Sedin became the Canucks' all-time leading scorer, while Ryan Kesler returned to the lineup after a shoulder injury.[119] The Canucks wore Vancouver Millionaires replica jerseys on March 16, 2013, in a game against the Detroit Red Wings to celebrate the 100-year anniversary of the Millionaires, but lost 5–2., 139665=On November 14, 2008, prior to their Sport Celebrities Festival, the Canucks released their new RBK Edge Third Jersey. While staying with the colours of Vancouver, and combining the old with the new, the jersey looks very similar to their home jersey. The modernized \"Stick-in-Rink\" logo unveiled the previous year on the shoulder of the main jerseys is used as the main crest. On the shoulder, a \"V\" with the head of Johnny Canuck on top is used. This is the first time in team history since joining the NHL that Johnny Canuck has appeared on a Vancouver uniform. Sports Illustrated rated it 13th overall out of the 19 third jerseys released for the 2008 season.[141], 96096=In the 2009–10 season, the Canucks faced the longest road trip in NHL history, with 14 games over six weeks, from January 27 to March 13, 2010.[100] The scheduling was a result of Vancouver hosting the 2010 Winter Olympics, which shut down the NHL for two weeks, facilitating General Motors Place's use for ice hockey during the games.[101] It marked the first time that an NHL market hosted an Olympics since the league allowed its players to compete in the games, beginning with the 1998 Games in Nagano. Among the several Canucks players named to their respective national teams, centre Ryan Kesler of the United States and goaltender Roberto Luongo of Canada played against each other in the gold medal game; Luongo and Team Canada emerged with the win.[102], 136492=Little more than halfway through the 2006–07 season, the Canucks announced that they would be changing their jerseys once again. While a report in February 2007 suggested the new scheme would be revealed on August 1, 2007, the new team jersey was actually unveiled prior to training camp, on August 29, 2007. It featured the same orca design present on their previous jerseys, but the colour scheme was updated to their \"retro\" colours of royal blue and kelly green. Additionally, the word \"Vancouver\" was added to the chest area above the orca. This move was seen as a way to connect the NHL Canucks' uniform to that of the WHL team, whose members wore uniforms with the word \"Canucks\" along the top in a similar arched design. The actual jerseys themselves were changed to the Rbk Edge design, along with all other teams in the NHL. The introduction was largely greeted with disappointment from fans and sports commentators, who criticized the uniforms for looking like a \"copy and paste\" of those from the past. The Vancouver Sun described the new look as \"decidedly unpopular.\"[140], 24505=Less than a year later, the Oakland Seals were in financial difficulty and having trouble drawing fans. An apparent deal was in place to move the team to Vancouver, but the NHL did not want to see one of their franchises from the expansion of 1967 move so quickly and vetoed the deal. In exchange for avoiding a lawsuit, the NHL promised Vancouver would get a team in the next expansion. Another group, headed by Minnesota entrepreneur Tom Scallen,[citation needed] made a new presentation and was awarded an expansion franchise for the price of $6 million (three times the cost in 1967).[7] The new ownership group purchased the WHL Canucks, and brought the team into the league with the Buffalo Sabres as expansion teams for the 1970–71 season. Scallen retained a portion of the WHL Canucks roster such as John Arbour, George Gardner, Len Lunde, Marc Reaume, Ted Taylor and Murray Hall. The rest of the club would be built through an expansion draft., 60319=With a young core that included Linden, Bure and McLean still in their 20s after the 1994 playoffs, the Canucks appeared poised to remain contenders in the league.[38] However, the team failed to record a winning season in the six years following their Stanley Cup Finals appearance.[14] Prior to the lockout-shortened 1994–95 season, Quinn stepped down as head coach to focus on his managerial duties and was replaced by Rick Ley;[41] Vancouver finished with a .500 record that year.[14] Their elimination from the 1995 Stanley Cup playoffs in Game 4 of the second round marked the Canucks' last game played at the Pacific Coliseum,[13][42] as the team moved into the new General Motors Place (since renamed Rogers Arena), a new $160 million arena situated in Downtown Vancouver, the following season.}",
    "lastModified": "Sat, 01 Aug 2015 23:01:00 GMT",
    "textBeforeTable": "Note: GP = Games played, W = Wins, L = Losses, T = Ties, OTL = Overtime Losses, Pts = Points, GF = Goals for, GA = Goals against This is a partial list of the last five seasons completed by the Canucks. For the full season-by-season history, see List of Vancouver Canucks seasons. Season-by-season record[edit] Kalamazoo Wings (ECHL) *2011–12 to present Victoria Salmon Kings (ECHL) *2006–07 to 2010–11 Columbia Inferno (ECHL) *2002–03 to 2005–06 Columbus Chill (ECHL) *1991–92 Flint Spirits (IHL) *1987–88 Secondary affiliates[edit] Utica Comets (AHL) 2013–14 to present Chicago Wolves (AHL) *2011–12 to 2012–13 Manitoba Moose (AHL) *2001–02 to 2010–11 Kansas City Blades (IHL) *2000–01 Syracuse Crunch (AHL) *1994–95 to 1999–2000 Hamilton Canucks (AHL) *1992–93 to 1993–94 Milwaukee Admirals (IHL) *1988–89 to 1991–92 Fredericton Express (AHL) *1982–83 to 1987–88 Dallas",
    "textAfterTable": "Players[edit] Main article: List of Vancouver Canucks players Current roster[edit] view talk edit Updated July 28, 2015.[147] # Nat Player Pos S/G Age Acquired Birthplace 47 Switzerland ! Baertschi, SvenSven Baertschi 6.0 !LW L 22 2015 Langenthal, Switzerland – United States ! Bartkowski, MattMatt Bartkowski 2.0 !D",
    "hasKeyColumn": true,
    "keyColumnIndex": 9,
    "headerRowIndex": 0
}