{
    "relation": [
        [
            "Winner",
            "Astros",
            "Mets",
            "Mets",
            "Yankees",
            "White Sox",
            "Red Sox",
            "Red Sox",
            "Cardinals",
            "Orioles",
            "Yankees",
            "Mets",
            "Indians"
        ],
        [
            "Loser",
            "Braves",
            "Astros",
            "Braves",
            "Mariners",
            "Astros",
            "Yankees",
            "Robins",
            "Dodgers",
            "Yankees",
            "Angels",
            "Giants",
            "Red Sox"
        ],
        [
            "Date",
            "10/9/2005",
            "10/15/1986",
            "10/17/1999",
            "10/4/1995",
            "10/25/2005",
            "10/18/2004",
            "10/9/1916",
            "10/11/2013",
            "10/11/2012",
            "10/17/2009",
            "10/7/2000",
            "10/3/1995"
        ],
        [
            "Game",
            "NLDS 4",
            "NLCS 6",
            "NLCS 5",
            "ALDS 2",
            "WS 3",
            "ALCS 5",
            "WS 2",
            "NLCS 1",
            "ALDS 4",
            "ALCS 2",
            "NLDS 3",
            "ALDS 1"
        ],
        [
            "Inn.",
            "18",
            "16",
            "15",
            "15",
            "14",
            "14",
            "14",
            "13",
            "13",
            "13",
            "13",
            "13"
        ],
        [
            "Score",
            "7-6, Hou.",
            "7-6, NYM",
            "4-3, NYM",
            "7-5, NYY",
            "7-5, Chi.",
            "5-4, Bos.",
            "2-1, Bos.",
            "3-2, Stl.",
            "2-1, Bal.",
            "4-3, NYY",
            "3-2, NYM",
            "5-4, Cle."
        ]
    ],
    "pageTitle": "Strong run by Los Angeles Dodgers' bullpen ends at Kenley Jansen | dodgers.com",
    "title": "Longest games (by innings) in postseason history",
    "url": "http://m.dodgers.mlb.com/news/article/62859510",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 0,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988399.65/warc/CC-MAIN-20150728002308-00338-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 139276623,
    "recordOffset": 139252478,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Marathon affairs \"I tip my hat for Carlos Beltran -- he's a pro,\" Jansen said. \"Sometimes they might roll over that pitch. Sometimes they don't hit it. What can I do? I can't beat myself [up].\" What happened next is already a part of postseason lore. Jansen served up a walk-off single to Carlos Beltran in Game 1 of the National League Championship Series, giving the Cardinals a 3-2 victory and leaving the Dodgers with a sour taste in their mouths. \"But what could I do?\" Jansen said. \"I'm going to go out there. My job is to get the out.\" Four pitches later, after Chris Withrow walked Matt Carpenter, Jansen watched Mattingly walk to the mound and signal for him. He called it \"kind of weird,\" not expecting to enter the game so quickly. ST. LOUIS -- For 12 1/2 innings Friday evening, Kenley Jansen sat quietly on the bullpen bench. Dodgers manager Don Mattingly wanted to save his closer for a save situation, though Mattingly was also wary of wasting his best reliever entirely. So when Daniel Descalso singled with one out in the bottom of the 13th, the phone finally rang.",
    "textAfterTable": "More than anything, catcher A.J. Ellis bemoaned the fact that Jansen fell behind in the count, 3-1. When Dodgers pitchers were able to jump ahead of Beltran in Game 1, as they did in the first, sixth, ninth and 11th innings, they had little trouble retiring him. When they fell behind, as in the third and 13th, Beltran did damage. Jansen did not immediately fall behind in the count in the 13th, starting Beltran out with a called strike down the middle. But when his 0-1 pitch just missed low, Jansen responded with two more balls. That allowed Beltran to anticipate the 92-mph cutter that Jansen left out over the plate, driving it down the right-field line for the game-winner. \"Right down the middle,\" Beltran said. \"I don't blame him, because he's behind in the count and he's trying to make a pitch. But in that case, I was trying to hit the ball hard. \"I know Jansen is a good closer, and I know he's capable of making a lot of pitches for strikes. Once I put myself into a hitter's count, I was looking for a pitch to hit, because I knew he was going to throw a pitch that I was going to be able to hit.\" The walk-off spoiled four sharp innings from a quartet of Dodgers relievers, including Brian Wilson, Ronald Belisario, J.P. Howell and Withrow. By the time Jansen came",
    "hasKeyColumn": true,
    "keyColumnIndex": 3,
    "headerRowIndex": 0
}