{
    "relation": [
        [
            "Game Management Unit/Subunit",
            "",
            "01A",
            "01B",
            "01C",
            "01D",
            "02",
            "03",
            "04",
            "05A",
            "05B",
            "06A",
            "06B",
            "06C",
            "06D",
            "07",
            "08",
            "09A",
            "09B",
            "09C",
            "09D",
            "09E",
            "10",
            "11",
            "12",
            "13A",
            "13B",
            "13C",
            "13D",
            "13E",
            "14A",
            "14B",
            "14C",
            "15A",
            "15B",
            "15C",
            "16A",
            "16B",
            "17A",
            "17B",
            "17C",
            "18",
            "19A",
            "19B",
            "19C",
            "19D",
            "20A",
            "20B",
            "20C",
            "20D",
            "20E",
            "21A",
            "21B",
            "21E",
            "22B",
            "22D",
            "23",
            "24",
            "25A",
            "25C",
            "26A",
            "26B",
            "26C"
        ],
        [
            "Number of Registered Operators",
            "",
            "12",
            "10",
            "12",
            "10",
            "15",
            "14",
            "18",
            "3",
            "2",
            "6",
            "2",
            "3",
            "15",
            "8",
            "25",
            "14",
            "15",
            "12",
            "8",
            "17",
            "1",
            "4",
            "4",
            "10",
            "10",
            "5",
            "18",
            "19",
            "9",
            "12",
            "11",
            "6",
            "10",
            "9",
            "18",
            "28",
            "4",
            "15",
            "8",
            "8",
            "8",
            "10",
            "11",
            "2",
            "22",
            "4",
            "11",
            "6",
            "5",
            "5",
            "2",
            "2",
            "2",
            "1",
            "2",
            "3",
            "8",
            "4",
            "2",
            "4",
            "1"
        ],
        [
            "Visitor Days",
            "",
            "11998",
            "7304",
            "11030",
            "23862",
            "9653",
            "11100",
            "23970",
            "3735",
            "585",
            "849",
            "557",
            "1957",
            "7421",
            "4605",
            "8088",
            "4612",
            "5905",
            "6607",
            "1040",
            "6697",
            "90",
            "1997",
            "175",
            "1564",
            "852",
            "599",
            "7084",
            "15343",
            "1281",
            "2909",
            "2004",
            "3890",
            "5000",
            "4520",
            "11995",
            "11047",
            "1303",
            "4731",
            "2993",
            "3104",
            "3005",
            "1549",
            "1587",
            "86",
            "10968",
            "310",
            "30668",
            "363",
            "602",
            "1556",
            "420",
            "669",
            "114",
            "120",
            "520",
            "220",
            "860",
            "85",
            "540",
            "1004",
            "60"
        ],
        [
            "Activity Types",
            "",
            "Hunting, Off-road Vehicle Use, Motorized Boating, Scuba Diving, General Tour (sightseeing, wildlife, nature), Hiking Rock/Mountain Climbing, Drop-off Comm. Recreation Uses, Rafting, Kayaking, Canoeing, Fishing Other activity (if any):",
            "Hunting, Motorized Boating, Scuba Diving, General Tour (sightseeing, wildlife, nature), Hiking Rock/Mountain Climbing, Drop-off Comm. Recreation Uses, Rafting, Kayaking, Canoeing, Fishing Other activity (if any):",
            "Skiing, snowshoe, snowboard, Hunting, Off-road Vehicle Use, Motorized Boating, Scuba Diving, General Tour (sightseeing, wildlife, nature), Hiking Rock/Mountain Climbing, Drop-off Comm. Recreation Uses, Rafting, Kayaking, Canoeing, Fishing Other activity (if any):",
            "Skiing, snowshoe, snowboard, Hunting, Motorized Boating, Scuba Diving, General Tour (sightseeing, wildlife, nature), Hiking Rock/Mountain Climbing, Rafting, Kayaking, Canoeing, Fishing Other activity (if any): Big Game Guiding;",
            "Hunting, Off-road Vehicle Use, Motorized Boating, Scuba Diving, General Tour (sightseeing, wildlife, nature), Hiking Rock/Mountain Climbing, Drop-off Comm. Recreation Uses, Rafting, Kayaking, Canoeing, Fishing Other activity (if any):",
            "Hunting, Off-road Vehicle Use, Motorized Boating, Scuba Diving, General Tour (sightseeing, wildlife, nature), Hiking Rock/Mountain Climbing, Drop-off Comm. Recreation Uses, Rafting, Kayaking, Canoeing, Horseback Riding, Fishing Other activity (if any):",
            "Skiing, snowshoe, snowboard, Bicycling, Hunting, Off-road Vehicle Use, Motorized Boating, Scuba Diving, General Tour (sightseeing, wildlife, nature), Hiking Rock/Mountain Climbing, Drop-off Comm. Recreation Uses, Rafting, Kayaking, Canoeing, Fishing Other activity (if any):",
            "Hunting, Off-road Vehicle Use, Motorized Boating, General Tour (sightseeing, wildlife, nature), Drop-off Comm. Recreation Uses, Fishing Other activity (if any): fishing;",
            "Hunting, General Tour (sightseeing, wildlife, nature), Drop-off Comm. Recreation Uses Other activity (if any): fishing;",
            "Skiing, snowshoe, snowboard, Hunting, Off-road Vehicle Use, Motorized Boating, General Tour (sightseeing, wildlife, nature), Hiking Rock/Mountain Climbing, Drop-off Comm. Recreation Uses, Rafting, Kayaking, Canoeing, Fishing Other activity (if any): heli ski; fishing; gold panning; Trapping;",
            "Skiing, snowshoe, snowboard, Hiking Rock/Mountain Climbing, Drop-off Comm. Recreation Uses Other activity (if any): heli ski;",
            "Skiing, snowshoe, snowboard, Off-road Vehicle Use, General Tour (sightseeing, wildlife, nature), Hiking Rock/Mountain Climbing, Drop-off Comm. Recreation Uses, Fishing Other activity (if any): heli ski;",
            "Skiing, snowshoe, snowboard, Hunting, Off-road Vehicle Use, Motorized Boating, General Tour (sightseeing, wildlife, nature), Hiking Rock/Mountain Climbing, Drop-off Comm. Recreation Uses, Rafting, Kayaking, Canoeing, Fishing Other activity (if any): heli ski; snowshoeing; snowcat skiing, television, film, commercial production; Film Shoot;",
            "Skiing, snowshoe, snowboard, Bicycling, Hunting, Motorized Boating, General Tour (sightseeing, wildlife, nature), Hiking Rock/Mountain Climbing, Drop-off Comm. Recreation Uses, Rafting, Kayaking, Canoeing, Fishing Other activity (if any): heli ski;",
            "Bicycling, Hunting, Off-road Vehicle Use, Motorized Boating, General Tour (sightseeing, wildlife, nature), Hiking Rock/Mountain Climbing, Drop-off Comm. Recreation Uses, Rafting, Kayaking, Canoeing, Fishing Other activity (if any):",
            "Skiing, snowshoe, snowboard, Hunting, Motorized Boating, General Tour (sightseeing, wildlife, nature), Hiking Rock/Mountain Climbing, Drop-off Comm. Recreation Uses, Rafting, Kayaking, Canoeing, Fishing Other activity (if any): heli ski; filming an interview with a scientist ; Guided Fishing and or small bird hunting; Guided Hunting Trips;",
            "Skiing, snowshoe, snowboard, Hunting, General Tour (sightseeing, wildlife, nature), Hiking Rock/Mountain Climbing, Drop-off Comm. Recreation Uses, Rafting, Kayaking, Canoeing, Fishing Other activity (if any): heli ski; guided fishing and / or small bird hunting; film & Photograpghy; Guided Hunting Trips;",
            "Skiing, snowshoe, snowboard, Hunting, Motorized Boating, General Tour (sightseeing, wildlife, nature), Hiking Rock/Mountain Climbing, Drop-off Comm. Recreation Uses, Rafting, Kayaking, Canoeing, Fishing Other activity (if any): heli ski; guided fishing and /or small bird hunting;",
            "Hunting, Off-road Vehicle Use, Motorized Boating, General Tour (sightseeing, wildlife, nature), Rafting, Kayaking, Canoeing, Fishing Other activity (if any): guided fishing / and or small bird hunting;",
            "Hunting, Off-road Vehicle Use, Motorized Boating, General Tour (sightseeing, wildlife, nature), Hiking Rock/Mountain Climbing, Drop-off Comm. Recreation Uses, Rafting, Kayaking, Canoeing, Fishing Other activity (if any): Guided fishing / and or small bird hunting; guided commercial hunting; Guide/Outfitter hunting ;",
            "Hunting, Fishing Other activity (if any):",
            "Skiing, snowshoe, snowboard, Hunting, Off-road Vehicle Use, General Tour (sightseeing, wildlife, nature), Hiking Rock/Mountain Climbing, Drop-off Comm. Recreation Uses Other activity (if any): heli ski;",
            "Hunting Other activity (if any): Big game guiding;",
            "Skiing, snowshoe, snowboard, Hunting, Off-road Vehicle Use, Motorized Boating, General Tour (sightseeing, wildlife, nature), Hiking Rock/Mountain Climbing, Drop-off Comm. Recreation Uses, Rafting, Kayaking, Canoeing, Fishing Other activity (if any): heli ski;",
            "Skiing, snowshoe, snowboard, Bicycling, Hunting, Off-road Vehicle Use, Motorized Boating, General Tour (sightseeing, wildlife, nature), Hiking Rock/Mountain Climbing, Drop-off Comm. Recreation Uses, Rafting, Kayaking, Canoeing, Fishing Other activity (if any): heli ski; guided sport fishing; Big game guiding;",
            "Skiing, snowshoe, snowboard, Bicycling, Hunting, Off-road Vehicle Use, Motorized Boating, General Tour (sightseeing, wildlife, nature), Hiking Rock/Mountain Climbing, Drop-off Comm. Recreation Uses, Rafting, Kayaking, Canoeing, Fishing Other activity (if any): heli ski;",
            "Skiing, snowshoe, snowboard, Bicycling, Hunting, Off-road Vehicle Use, Motorized Boating, General Tour (sightseeing, wildlife, nature), Hiking Rock/Mountain Climbing, Drop-off Comm. Recreation Uses, Rafting, Kayaking, Canoeing, Fishing Other activity (if any): heli ski; snowshoeing; Filming; Guided sport fishing; snowcatskiing, tV, Film commercial production support; Film Shoot;",
            "Skiing, snowshoe, snowboard, Bicycling, Hunting, Off-road Vehicle Use, Motorized Boating, General Tour (sightseeing, wildlife, nature), Hiking Rock/Mountain Climbing, Drop-off Comm. Recreation Uses, Rafting, Kayaking, Canoeing, Fishing Other activity (if any): heli ski;",
            "Skiing, snowshoe, snowboard, Hunting, Off-road Vehicle Use, Hiking Rock/Mountain Climbing, Drop-off Comm. Recreation Uses, Fishing Other activity (if any): heli ski; On road filming for PBS;",
            "Skiing, snowshoe, snowboard, Hunting, Off-road Vehicle Use, Motorized Boating, General Tour (sightseeing, wildlife, nature), Hiking Rock/Mountain Climbing, Drop-off Comm. Recreation Uses, Rafting, Kayaking, Canoeing, Fishing Other activity (if any): heli ski;",
            "Skiing, snowshoe, snowboard, Bicycling, Hunting, General Tour (sightseeing, wildlife, nature), Hiking Rock/Mountain Climbing, Drop-off Comm. Recreation Uses, Fishing Other activity (if any): heli ski; Filming; Film Shoot;",
            "Motorized Boating, General Tour (sightseeing, wildlife, nature), Hiking Rock/Mountain Climbing, Fishing Other activity (if any):",
            "Motorized Boating, General Tour (sightseeing, wildlife, nature), Hiking Rock/Mountain Climbing, Rafting, Kayaking, Canoeing, Fishing Other activity (if any):",
            "Motorized Boating, General Tour (sightseeing, wildlife, nature), Hiking Rock/Mountain Climbing, Rafting, Kayaking, Canoeing, Fishing Other activity (if any):",
            "Skiing, snowshoe, snowboard, Dogsledding, Bicycling, Hunting, Off-road Vehicle Use, Motorized Boating, General Tour (sightseeing, wildlife, nature), Hiking Rock/Mountain Climbing, Drop-off Comm. Recreation Uses, Rafting, Kayaking, Canoeing, Fishing Other activity (if any): heli ski;",
            "Skiing, snowshoe, snowboard, Dogsledding, Hunting, Off-road Vehicle Use, Motorized Boating, General Tour (sightseeing, wildlife, nature), Hiking Rock/Mountain Climbing, Drop-off Comm. Recreation Uses, Rafting, Kayaking, Canoeing, Horseback Riding, Fishing Other activity (if any): heli ski; iditarod access; Commercial Photography & Film;",
            "Skiing, snowshoe, snowboard, Hunting, Motorized Boating, General Tour (sightseeing, wildlife, nature), Drop-off Comm. Recreation Uses, Rafting, Kayaking, Canoeing, Fishing Other activity (if any): heli ski; guided fishing / and or small bird hunting;",
            "Skiing, snowshoe, snowboard, Hunting, Motorized Boating, General Tour (sightseeing, wildlife, nature), Hiking Rock/Mountain Climbing, Drop-off Comm. Recreation Uses, Rafting, Kayaking, Canoeing, Fishing Other activity (if any): heli ski; gold panning; gold panning; gold panning; gold panning; Guided fishing / and or small bird hunting;",
            "Skiing, snowshoe, snowboard, Hunting, Motorized Boating, General Tour (sightseeing, wildlife, nature), Drop-off Comm. Recreation Uses, Rafting, Kayaking, Canoeing, Fishing Other activity (if any): heli ski; guided fishing / and or hunting small birds;",
            "Hunting, Off-road Vehicle Use, Motorized Boating, General Tour (sightseeing, wildlife, nature), Hiking Rock/Mountain Climbing, Drop-off Comm. Recreation Uses, Rafting, Kayaking, Canoeing, Fishing Other activity (if any): gold panning; gold panning; gold panning; gold panning; guided fishing / and or small bird hunting; Commercial Photography & Film;",
            "Skiing, snowshoe, snowboard, Hunting, Off-road Vehicle Use, Motorized Boating, General Tour (sightseeing, wildlife, nature), Hiking Rock/Mountain Climbing, Drop-off Comm. Recreation Uses, Rafting, Kayaking, Canoeing, Fishing Other activity (if any): heli ski; gold panning; gold panning; gold panning; Commercial Photography & Film;",
            "Skiing, snowshoe, snowboard, Hunting, Off-road Vehicle Use, Motorized Boating, General Tour (sightseeing, wildlife, nature), Hiking Rock/Mountain Climbing, Drop-off Comm. Recreation Uses, Rafting, Kayaking, Canoeing, Fishing Other activity (if any): heli ski; gold panning; gold panning; gold panning; gold panning; Commercial Photography & Film;",
            "Skiing, snowshoe, snowboard, Hunting, Off-road Vehicle Use, Motorized Boating, General Tour (sightseeing, wildlife, nature), Hiking Rock/Mountain Climbing, Drop-off Comm. Recreation Uses, Rafting, Kayaking, Canoeing, Horseback Riding, Fishing Other activity (if any): heli ski; gold panning; Commercial Photography & Film;",
            "Hunting, Rafting, Kayaking, Canoeing, Fishing Other activity (if any): Commercial Photography & Film;",
            "Hunting, Off-road Vehicle Use, Motorized Boating, General Tour (sightseeing, wildlife, nature), Hiking Rock/Mountain Climbing, Drop-off Comm. Recreation Uses, Rafting, Kayaking, Canoeing, Horseback Riding, Fishing Other activity (if any): Commercial Guided Hunting ; Commercial Guiding Operation; Commercial Guiding Operation; Big game guiding; Guiding - hunting;",
            "Bicycling, Hunting, Off-road Vehicle Use, Motorized Boating, General Tour (sightseeing, wildlife, nature), Hiking Rock/Mountain Climbing, Drop-off Comm. Recreation Uses, Rafting, Kayaking, Canoeing, Fishing Other activity (if any): Guided sport fishing - mostly ice fishing;",
            "Dogsledding, Hunting, Off-road Vehicle Use, Motorized Boating, General Tour (sightseeing, wildlife, nature), Hiking Rock/Mountain Climbing, Drop-off Comm. Recreation Uses, Rafting, Kayaking, Canoeing, Fishing Other activity (if any): Horse drawn covered wagon tour; Guided Hunting ; Trapline Adventures; Hunting Guide;",
            "Bicycling, Hunting, Off-road Vehicle Use, Motorized Boating, General Tour (sightseeing, wildlife, nature), Hiking Rock/Mountain Climbing, Drop-off Comm. Recreation Uses, Rafting, Kayaking, Canoeing, Fishing Other activity (if any): Guided hunting;",
            "Bicycling, Hunting, Off-road Vehicle Use, Motorized Boating, General Tour (sightseeing, wildlife, nature), Hiking Rock/Mountain Climbing, Drop-off Comm. Recreation Uses, Rafting, Kayaking, Canoeing, Fishing Other activity (if any): Recreational mining; Backpack guided hunting;",
            "Hunting, Off-road Vehicle Use, Motorized Boating, General Tour (sightseeing, wildlife, nature), Hiking Rock/Mountain Climbing, Drop-off Comm. Recreation Uses, Rafting, Kayaking, Canoeing, Fishing Other activity (if any): gold panning; gold panning; gold panning;",
            "Dogsledding, Hunting, General Tour (sightseeing, wildlife, nature), Drop-off Comm. Recreation Uses, Rafting, Kayaking, Canoeing, Fishing Other activity (if any):",
            "Hunting, Drop-off Comm. Recreation Uses, Rafting, Kayaking, Canoeing, Fishing Other activity (if any):",
            "Hunting Other activity (if any): Guided big game hunting; Guide/outfitter hunting;",
            "Hunting, Fishing Other activity (if any):",
            "Hunting, Fishing Other activity (if any):",
            "Dogsledding, Hunting, General Tour (sightseeing, wildlife, nature), Hiking Rock/Mountain Climbing, Fishing Other activity (if any): Big game guiding;",
            "Hunting Other activity (if any): Big game guiding; Guide/Outfitter hunting; Guide/outfitter hunting;",
            "Dogsledding, Hunting, General Tour (sightseeing, wildlife, nature), Hiking Rock/Mountain Climbing, Rafting, Kayaking, Canoeing, Fishing Other activity (if any): Guided sport fishing and river floating;",
            "Hunting Other activity (if any): already contracted work activities in the North Slope Tundra;",
            "Dogsledding, Hunting, General Tour (sightseeing, wildlife, nature), Hiking Rock/Mountain Climbing, Fishing Other activity (if any): FilmingDocumentary; already contracted work activities in the North Slope Tundra;",
            "Other activity (if any): already contracted work activities in the North Slope Tundra;"
        ],
        [
            "Types of Access",
            "",
            "Float Plane, Off-road Vehicle, Road Vehicle, Foot, Motorized Boat, Non-motorized Boat Other access types (if any):",
            "Float Plane, Foot, Motorized Boat, Non-motorized Boat Other access types (if any):",
            "Float Plane, Wheel Plane, Ski Plane, Off-road Vehicle, Road Vehicle, Foot, Motorized Boat, Non-motorized Boat Other access types (if any):",
            "Float Plane, Wheel Plane, Ski Plane, Helicopter, Road Vehicle, Foot, Motorized Boat, Non-motorized Boat Other access types (if any):",
            "Float Plane, Off-road Vehicle, Road Vehicle, Foot, Motorized Boat, Non-motorized Boat Other access types (if any):",
            "Float Plane, Wheel Plane, Off-road Vehicle, Road Vehicle, Foot, Motorized Boat, Non-motorized Boat Other access types (if any):",
            "Float Plane, Off-road Vehicle, Road Vehicle, Foot, Motorized Boat, Non-motorized Boat Other access types (if any):",
            "Wheel Plane, Off-road Vehicle, Foot, Motorized Boat Other access types (if any): 20' Hovercraft , motorized;",
            "Wheel Plane Other access types (if any): 20' Hovercraft , motorized;",
            "Float Plane, Wheel Plane, Ski Plane, Helicopter, Off-road Vehicle, Road Vehicle, Foot, Motorized Boat, Non-motorized Boat Other access types (if any):",
            "Helicopter, Foot Other access types (if any):",
            "Ski Plane, Helicopter, Off-road Vehicle, Foot Other access types (if any):",
            "Float Plane, Wheel Plane, Ski Plane, Helicopter, Off-road Vehicle, Road Vehicle, Foot, Motorized Boat, Non-motorized Boat Other access types (if any): snowmachine accessed skiing and snowboarding;",
            "Float Plane, Helicopter, Road Vehicle, Foot, Motorized Boat, Non-motorized Boat Other access types (if any):",
            "Float Plane, Wheel Plane, Off-road Vehicle, Road Vehicle, Foot, Horse/Beast of Burden, Motorized Boat, Non-motorized Boat Other access types (if any):",
            "Float Plane, Wheel Plane, Helicopter, Foot, Motorized Boat, Non-motorized Boat Other access types (if any): If we have boats in the area. If not, only by float plane;",
            "Float Plane, Wheel Plane, Ski Plane, Helicopter, Foot, Motorized Boat, Non-motorized Boat Other access types (if any): If we have boats in the area. If not by float plane;",
            "Float Plane, Wheel Plane, Ski Plane, Helicopter, Off-road Vehicle, Foot, Motorized Boat, Non-motorized Boat Other access types (if any): If we have boats in the area. If not, only by float plane;",
            "Float Plane, Wheel Plane, Ski Plane, Off-road Vehicle, Foot, Motorized Boat, Non-motorized Boat Other access types (if any): If we have boats in the area. If not only float plane.;",
            "Float Plane, Wheel Plane, Ski Plane, Off-road Vehicle, Road Vehicle, Foot, Motorized Boat, Non-motorized Boat Other access types (if any): If we have boats in the area. If not, only by float plane.;",
            "Road Vehicle, Motorized Boat Other access types (if any):",
            "Float Plane, Wheel Plane, Ski Plane, Helicopter, Off-road Vehicle, Foot Other access types (if any):",
            "Float Plane, Wheel Plane, Ski Plane, Off-road Vehicle, Road Vehicle, Foot, Horse/Beast of Burden, Motorized Boat Other access types (if any):",
            "Float Plane, Wheel Plane, Ski Plane, Helicopter, Off-road Vehicle, Road Vehicle, Foot, Motorized Boat, Non-motorized Boat Other access types (if any):",
            "Float Plane, Wheel Plane, Ski Plane, Helicopter, Off-road Vehicle, Road Vehicle, Foot, Motorized Boat, Non-motorized Boat Other access types (if any):",
            "Float Plane, Wheel Plane, Ski Plane, Helicopter, Off-road Vehicle, Road Vehicle, Foot, Motorized Boat, Non-motorized Boat Other access types (if any):",
            "Float Plane, Wheel Plane, Ski Plane, Helicopter, Off-road Vehicle, Road Vehicle, Foot, Motorized Boat, Non-motorized Boat Other access types (if any): snowmachine accesed skiing and snowboarding;",
            "Float Plane, Wheel Plane, Ski Plane, Helicopter, Off-road Vehicle, Road Vehicle, Foot, Horse/Beast of Burden, Motorized Boat, Non-motorized Boat Other access types (if any):",
            "Float Plane, Wheel Plane, Ski Plane, Helicopter, Off-road Vehicle, Road Vehicle, Foot, Motorized Boat Other access types (if any):",
            "Float Plane, Wheel Plane, Ski Plane, Helicopter, Off-road Vehicle, Foot, Motorized Boat, Non-motorized Boat Other access types (if any):",
            "Float Plane, Wheel Plane, Ski Plane, Helicopter, Road Vehicle, Foot, Horse/Beast of Burden, Motorized Boat Other access types (if any):",
            "Float Plane, Wheel Plane, Road Vehicle, Foot, Motorized Boat, Non-motorized Boat Other access types (if any):",
            "Float Plane, Wheel Plane, Road Vehicle, Foot, Motorized Boat, Non-motorized Boat Other access types (if any):",
            "Float Plane, Wheel Plane, Road Vehicle, Foot, Motorized Boat, Non-motorized Boat Other access types (if any):",
            "Float Plane, Wheel Plane, Ski Plane, Helicopter, Off-road Vehicle, Road Vehicle, Foot, Motorized Boat, Non-motorized Boat Other access types (if any): 6 wheeler & Boat;",
            "Float Plane, Wheel Plane, Ski Plane, Helicopter, Off-road Vehicle, Road Vehicle, Foot, Horse/Beast of Burden, Motorized Boat, Non-motorized Boat Other access types (if any): Boat;",
            "Float Plane, Ski Plane, Helicopter, Foot, Motorized Boat, Non-motorized Boat Other access types (if any): If we have boats in teh area. If not, only by float plane;",
            "Float Plane, Wheel Plane, Ski Plane, Helicopter, Foot, Motorized Boat, Non-motorized Boat Other access types (if any): snowmachine; If we have boats in the area. If not, only by float plane;",
            "Float Plane, Ski Plane, Helicopter, Foot, Motorized Boat, Non-motorized Boat Other access types (if any): snowmachine; If we have boats in the area. If not, only by float plane.;",
            "Float Plane, Wheel Plane, Off-road Vehicle, Foot, Motorized Boat, Non-motorized Boat Other access types (if any): If we have boats in the area. If not, only by float plane.;",
            "Float Plane, Wheel Plane, Helicopter, Off-road Vehicle, Foot, Motorized Boat, Non-motorized Boat Other access types (if any):",
            "Float Plane, Wheel Plane, Ski Plane, Helicopter, Off-road Vehicle, Foot, Motorized Boat, Non-motorized Boat Other access types (if any):",
            "Float Plane, Wheel Plane, Ski Plane, Helicopter, Off-road Vehicle, Foot, Horse/Beast of Burden, Motorized Boat, Non-motorized Boat Other access types (if any): iron dog access;",
            "Float Plane, Wheel Plane, Non-motorized Boat Other access types (if any):",
            "Wheel Plane, Ski Plane, Off-road Vehicle, Road Vehicle, Foot, Horse/Beast of Burden, Motorized Boat, Non-motorized Boat Other access types (if any): jet boat shuttle for fly fishing groups; Snowmachine; Snowmachine;",
            "Wheel Plane, Off-road Vehicle, Road Vehicle, Foot, Motorized Boat, Non-motorized Boat Other access types (if any):",
            "Float Plane, Wheel Plane, Ski Plane, Off-road Vehicle, Road Vehicle, Foot, Horse/Beast of Burden, Motorized Boat, Non-motorized Boat Other access types (if any): dogteams;",
            "Wheel Plane, Off-road Vehicle, Road Vehicle, Foot, Motorized Boat, Non-motorized Boat Other access types (if any):",
            "Float Plane, Wheel Plane, Off-road Vehicle, Road Vehicle, Foot, Motorized Boat, Non-motorized Boat Other access types (if any):",
            "Float Plane, Wheel Plane, Off-road Vehicle, Foot, Motorized Boat, Non-motorized Boat Other access types (if any):",
            "Float Plane, Wheel Plane, Ski Plane, Foot, Motorized Boat, Non-motorized Boat Other access types (if any): dogteams;",
            "Float Plane, Wheel Plane, Foot, Motorized Boat Other access types (if any):",
            "Wheel Plane Other access types (if any):",
            "Float Plane, Wheel Plane, Ski Plane, Off-road Vehicle, Foot, Motorized Boat, Non-motorized Boat Other access types (if any):",
            "Wheel Plane, Foot Other access types (if any):",
            "Float Plane, Wheel Plane, Ski Plane, Road Vehicle, Foot, Horse/Beast of Burden, Motorized Boat Other access types (if any):",
            "Float Plane, Wheel Plane, Foot, Horse/Beast of Burden Other access types (if any):",
            "Wheel Plane, Road Vehicle, Foot, Horse/Beast of Burden, Motorized Boat, Non-motorized Boat Other access types (if any):",
            "Wheel Plane, Off-road Vehicle Other access types (if any): Rolligons and other approved tundra-access vehicles;",
            "Off-road Vehicle, Road Vehicle, Foot, Horse/Beast of Burden, Motorized Boat Other access types (if any): rolligons and other approved tundra-access vehicles;",
            "Off-road Vehicle Other access types (if any): rolligons and other approved tundra-access vehicles;"
        ]
    ],
    "pageTitle": "Commercial Recreation Registration Activity in Game Management Units",
    "title": "",
    "url": "http://dnr.alaska.gov/mlw/commrec/dsp_gmu_activity.cfm?YEAR=2009",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 0,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989042.37/warc/CC-MAIN-20150728002309-00020-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 73327940,
    "recordOffset": 73319738,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Business Activities ARE ONLY included in this report after payment has been processed and confirmed by DNR. 2009 Registration Information as of: August 02, 2015 Commercial Day Use Registration Commercial Recreation Registration Activity in Game Management Units Game Management Units Mining, Land & Water > Natural Resources > Share | Contact Us Site Index Water Forms Land Forms Mining Forms Forms Fact Sheets R-W Fact Sheets E-P Fact Sheets A-D Fact Sheets",
    "textAfterTable": "  Return to the Commercial Recreation Registration Main Page Privacy Copyright System Status Webmaster Department of Natural Resources 550 W. 7th Ave, Suite 1260, Anchorage, AK 99501-3557 Phone: 907-269-8400 Fax: 907-269-8901 TTY: 907-269-8411 State of Alaska myAlaska My Government Resident Business in Alaska Visiting Alaska State Employees State of Alaska © 2013 Webmaster",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}