{
    "relation": [
        [
            "Date",
            "10/1/1960",
            "10/21/1972",
            "11/4/1989",
            "10/13/1990",
            "9/7/1991",
            "9/26/1992",
            "10/29/1994",
            "10/8/2005",
            "9/12/2009"
        ],
        [
            "Player",
            "Dennis Fitzgerald",
            "Gil Chapman",
            "Tony Boles",
            "Desmond Howard",
            "Desmond Howard",
            "Tyrone Wheatley, Sr.",
            "Seth Smith",
            "Steve Breaston",
            "Darryl Stonum"
        ],
        [
            "Yards",
            "99",
            "73",
            "85",
            "95",
            "93",
            "99",
            "100",
            "95",
            "94"
        ],
        [
            "Opponent",
            "at Michigan State",
            "at Illinois",
            "vs Purdue",
            "vs Michigan State",
            "at Boston College",
            "vs Houston",
            "vs Wisconsin",
            "vs Minnesota",
            "vs #18 Notre Dame"
        ],
        [
            "Result",
            "L 17-24",
            "W 31-7",
            "W 42-27",
            "L 27-28",
            "W 35-13",
            "W 61-7",
            "L 19-31",
            "L 20-23",
            "W 38-34"
        ]
    ],
    "pageTitle": "Diaries | mgoblog",
    "title": "",
    "url": "http://mgoblog.com/blog?page=6%2C1%2C12%2C0%2C0%2C2%2C1%2C0%2C0%2C0",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 3,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988399.65/warc/CC-MAIN-20150728002308-00069-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 160880835,
    "recordOffset": 160836273,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{92224=2001, 91281=1996, 107540=Ye Olde Guarde. Basically you should root against any snobby, east coast, team who has won a million championships before: the Virginias, the Hopkinses, the Dukes. And to a lesser extent Maryland- the Terps haven’t won in forever but they always seem to make the Final 4, and then play like shit. Syracuse is the only traditional power I can really stomach but I’m not going to shed a tear if they get knocked out by someone new. UNC gets a pass (for now) because they haven’t been to the Final 4 since 1993., 88586=1982, 134023=10/20/1990, 124998=9/26/1992, 93732=2009, 88009=1979, 113356=Kavanaugh shows the world that you don’t have to have Myles Jones’ size to be a force on the lacrosse field. Tiny, 5’8, 170, but quick as a cat, Kavanaugh led the Irish charge through the postseason last year and is now one of the best players in the country. He is an electrifying player to watch and is the motor for ND’s offense. In February, Kavanaugh lit up Michigan for 6 points (3 G,3 A) in front of a big crowd at Oosterbaan., 125564=10/8/2005, 89934=1989, 92789=2004, 90319=1991, 123617=10/1/1960, 139864=11/15/2008, 86660=1972, 174832=2010, 92035=2000, 84003=The invention of artificial turf as an alternative playing field surface to natural grass made its most notable debut when AstroTurf was installed at the Houston Astrodome in 1966. The Oilers moved into the Astrodome for the 1968 season and became the first pro football team to play on artificial turf., 89164=1985, 130869=11/1/1969, 139584=11/1/2008, 138467=10/18/2003, 87238=1975, 94675=2014, 138748=10/2/2004, 125280=10/29/1994, 91089=1995, 148391=Predictably, there’s a lot of statistical similarities of big men in the John Beilein era at Michigan, especially starting in the 2011 season with players he recruited:, 134344=11/3/1990, 140848=8/30/2014, 92978=2005, 135239=10/17/1992, 90511=1992, 83875=The game of college football changed in 1968. Or at least the way it looked in terms of what it is played on., 139306=11/11/2006, 98628=Interesting note on this: both times Michigan has played their final games on grass field surfaces, they have been on the same date (November 16) against Wisconsin and both were victories., 87430=1976, 131148=9/18/1971, 127676=11/25/1950, 138182=10/10/2003, 86468=1971, 91847=1999, 158512=A few comparisons here stand out: Cole, Nankivil, Dukan, Clark, Griffey, and Pitchford are all stretch bigs that either play the 4 or 5 – all of them have perimeter-oriented skill-sets. It’s interesting to see Marvin Clark there: MSU fans project him to have a breakout sophomore year, while it’s hard for UM fans to avoid feeling disappointed after Donnal’s freshman year. Interestingly, Matt Costello shows up again (7 for Donnal, 8 for Doyle); Michigan State’s center platoon was uninspiring last year, but blue-chip recruits are providing reinforcements. Walter Pitchford is the name that sticks out most to me though. He was pretty solid as a sophomore and dropped off entirely as a junior – being the Huskers’ only reliable three-point option didn’t work out well in 2014 and last year, his shooting fell off competely. Still, I think he’s perhaps the best stylistic comparison for Donnal on this list, at least., 136972=11/22/1997, 89356=1986, 149569=Contextualizing Michigan’s 2015 center troika within the statistical outputs of all of Beilein’s post players offers some interesting observations:, 84325=However, they weren't the first football team to call an artificial turf field their home. Indiana State installed AstroTurf at their home field in 1967 which later caused a rush of primarily Northern schools to change over to AstroTurf or another form artificial turf due to the much lower cost of maintaining the field in cold conditions as opposed to that of natural grass., 144745=Entering the year, Michigan’s most obvious area of concern was at the center position – Michigan fives play a singular role and that big man play was an underrated storyline amidst the Wolverines’ success in the 2013 and 2014 seasons. It’s easy to see why the position was unsettled, especially relative to the rest of the roster. Derrick Walton, Caris LeVert, and Zak Irvin were solid contributors in 2014 and each was projected to have some sort of breakout season. Kam Chatman, a big, skilled lefty – a five-star who chose Michigan over Arizona – looked to lock down the four spot., 174484=2013, 135520=10/16/1993, 88394=1981, 93543=2008, 133414=10/12/1985, 124174=11/4/1989, 93166=2006, 88971=1984, 124720=9/7/1991, 87624=1977, 123905=10/21/1972, 127349=11/18/1950, 129994=11/5/1966, 136694=10/21/1995, 85222=The following is Michigan's yearly record on Artificial and Grass surfaces beginning in 1968. Wisconsin was the first Big Ten school to install turf as they added it to Camp Randall Stadium for the 1968 season. , 88201=1980, 132291=10/13/1973, 86275=1970, 90704=1993, 174716=2011, 122599=I'll preface this beforehand: these are all since 1948, when the NCAA began considering statistics official. It's very likely that Michigan could have returned 3 kickoffs for a TD in one game at the turn of the century because old timey football and Fielding Yost Dominance., 132572=9/21/1974, 94298=2012, 124441=10/13/1990, 136086=10/22/1994, 94109=2011, 131747=10/7/1972, 132847=9/8/1979, 132017=10/6/1973, 93355=2007, 135809=1/1/1994, 91658=1998, 131469=9/30/1972, 92412=2002, 128001=10/27/1951, 133128=9/18/1982, 137258=10/14/2000, 128556=11/13/1954, 128281=11/6/1954, 89549=1987, 140519=8/31/2013, 87816=1978, 86853=1973, 140189=10/17/2009, 93920=2010, 88779=1983, 91470=1997, 137538=10/17/2001, 174368=2014, 130547=9/20/1969, 89741=1988, 128841=11/13/1954, 137855=11/17/2001, 174600=2012, 129441=11/2/1957, 134664=11/23/1991, 90126=1990, 162465=Entering the season, there was an ostensible comparison between Michigan’s situation at the five spot: in 2011, Michigan started the season with Jordan Morgan (rFr), Jon Horford (Fr), and an out-of-position Evan Smotrycz (Fr); in 2015, Michigan had Mark Donnal (rFr), Ricky Doyle (Fr), and an out-of-position (maybe) D.J. Wilson (Fr) – as well as Max Bielfeldt. Wilson was too raw to contribute and took a medical redshirt, but comparing Morgan and Horford to Donnal and Doyle is fair. Team success makes us remember the 2011 center corps more fondly (plus J-Mo’s eventual ascension to small-time cult hero late in his senior year), but – due to Morgan and Smotrycz – the 2011 big men had better individual performances than the ‘15 bigs:, 84720=The first game that Michigan ever played on an artificial turf surface was the same game as the head coaching debut of Bo Schembechler. September 20, 1969 at Michigan Stadium against Vanderbilt--42-14 Michigan win., 139021=11/13/2004, 92601=2003, 129167=10/8/1955, 134949=10/10/1992, 136365=9/2/1995, 90896=1994, 85890=1968, 129713=10/24/1959, 94487=2013, 86083=1969, 130269=11/11/1967, 87045=1974, 133740=11/16/1985, 125837=9/12/2009}",
    "lastModified": "Sat, 01 Aug 2015 02:55:01 GMT",
    "textBeforeTable": "Record when accomplished: 5-4(!) Kickoff Returns for a Touchdown I'll preface this beforehand: these are all since 1948, when the NCAA began considering statistics official. It's very likely that Michigan could have returned 3 kickoffs for a TD in one game at the turn of the century because old timey football and Fielding Yost Dominance. Same goes for a punt that isn't a blocked punt returned by one of the big men.   If you feel like it has been a long time since Michigan returned a kickoff for a touchdown, boy are you correct.  football Filed under: 19 comments May 8th, 2015 at 10:45 PM — Wolverine Devotee — By All the Way!!: Michigan Punt & Kickoff returns for a TD 20 comments L'Carpetron Dookmarriot's blog If you’re not a big fan but are interested in learning more I hope this did the trick and gave you something to watch",
    "textAfterTable": "        Punt Returns for a Touchdown  Record when accomplished: 41-5-1   Italics indicates punt return was a blocked punt return   Date Player Yards Opponent Result 11/18/1950 Harry Allis 23 vs Northwestern W 34-23 11/25/1950 Anton Momsen 0 at #8 Ohio State W 9-3 10/27/1951 Lowell Perry 75 vs Minnesota W 54-27 11/6/1954 Dave Raimey 54 vs Illinois W 14-7 11/13/1954 Tom Hendricks 67 vs Michigan State W 33-7 11/13/1954 Ron Kramer 26 vs Michigan State W 33-7 10/8/1955 Terry Barr 82 vs #6 Army W 26-2 11/2/1957 Jim Pace 65 vs #3 Iowa",
    "hasKeyColumn": true,
    "keyColumnIndex": 3,
    "headerRowIndex": 0
}