{
    "relation": [
        [
            "Pos.",
            "F",
            "F",
            "G",
            "G",
            "G",
            ""
        ],
        [
            "No.",
            "34",
            "10",
            "20",
            "21",
            "13",
            ""
        ],
        [
            "Players",
            "Phylesha Whaley",
            "Caton Hill",
            "LaNeishea Caufield",
            "Stacey Dales",
            "Sunny Hardeman",
            ""
        ],
        [
            "Ht.",
            "5-10",
            "6-1",
            "5-9",
            "6-0",
            "5-7",
            ""
        ],
        [
            "Yr.",
            "Sr.",
            "Fr.",
            "So.",
            "So.",
            "Jr.",
            ""
        ],
        [
            "GP-GS",
            "9-9",
            "9-9",
            "9-9",
            "9-9",
            "9-6",
            ""
        ],
        [
            "PPG",
            "19.1",
            "11.9",
            "13.0",
            "11.9",
            "6.4",
            ""
        ],
        [
            "RPG",
            "8.3",
            "6.9",
            "4.7",
            "5.4",
            "2.0",
            ""
        ],
        [
            "Others",
            "84% FT",
            "1st D-Reb. (41)",
            "3.1 spg",
            "6.6 apg",
            "4.0 apg",
            ""
        ]
    ],
    "pageTitle": "Women's Hoops Hits The Road - Oklahoma Sooners",
    "title": "",
    "url": "http://www.soonersports.com/ViewArticle.dbml?DB_OEM_ID=31000&ATCLID=208397220",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 3,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989042.37/warc/CC-MAIN-20150728002309-00134-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 727182971,
    "recordOffset": 727161997,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{29801=CAUFIELD CONTINUES SUCCESS After being named the 1999 Big 12 Conference Freshman of the Year and earning freshman All-America honors from two women's basketball publications, you might wonder if OU sophomore LaNeishea Caufield (Ada, Okla.) would be content with her early success. In a one word answer, no., 33322=Dales gained valuable experience by playing on the Canadian National team that won a silver medal at the 1999 Pan American Games in Winnipeg, Manitoba, Canada in August. The Brockville, Ontario, native averaged 4.6 points, 2.7 assists and 19.4 minutes per game, coming off the bench for the Canadians., 31258=This season, the 6-1 guard has scored in double figures four times, with her best being 16 points against Arkansas-Little Rock on Dec. 11. Seeley comes off the bench to average 8.2 points per game, ranking her fifth on the team in scoring., 28276=LEADING THE PACK For the first time in her young collegiate career, freshman Caton Hill (Ada, Okla.) paced the Sooners with 17 points against Stephen F. Austin on Dec. 5. Hill also grabbed nine boards and added three assists vs. the Ladyjacks., 17122=OU has not lost a game since dropping a 74-64 decision to Tennessee Tech in the Hawaiian Regent Tournament on Nov. 21. Oklahoma's most recent victories have been over Arkansas-Little Rock, 102-72, Stephen F. Austin, 61-47, and TCU, 94-74., 625=Dec. 16, 1999, 10785=1999-2000 DENVER ROSTER, 14432=Head Coach: Pam Tanner (Illinois State, 1989/Tennessee, 1992) Assistants: Tracy Tripp, Ellen Grosso, Dee Dee Dominguez, 29264=POTENTIAL WNBA Averaging the third most points in the Big 12 Conference, senior Phylesha Whaley (Slaton, Texas) continues to lead the Oklahoma women's basketball team with 19.8 points and 8.1 rebounds per game. As of Dec. 12, Whaley ranked among the league's best in four categories: first in offensive rebounds (4.44), third in points (19.11), and eighth in free throw percentage (.838) and rebounds (8.8)., 24607=MAKING THE MOVE Senior All-America candidate Phylesha Whaley moved up to the No. 2 spot on Oklahoma's all-time scoring chart against TCU on Dec. 7. The Slaton, Texas, native now has 1,673 career points and is working toward Molly McGuire's 2,149 mark for the all-time record., 27460=REUNITED ONCE AGAIN Appearing on Oklahoma's roster and among the Sooners' starting five are two natives of Ada, Okla., in sophomore LaNeishea Caufield and freshman Caton Hill. The duo renew their days as teammates as the pair played high school basketball together for one season at Ada High. Hill joined the Ada program following her sophomore year at Lansing High in Kansas. The two teamed up to produce a 27-1 record in 1997-98., 16353=NEXT UP Oklahoma returns home on Dec. 21 and Dec. 29 to host San Diego and top-ranked Connecticut. OU's game with UConn will be televised nationally on Fox Sports Network at 7 p.m., 28555=In addition, the 6-1 forward recorded her second double-double of the season as she had 18 points and 11 rebounds in the triumph over Tulsa, 93-70, on Nov. 29. Her first collegiate double-double came the night before against Oral Roberts when she scored 12 points and grabbed 11 boards. Both performances were in the Bertha Teague Classic at the Lloyd Noble Center in Norman., 1946=Saturday's game can be heard live on the University of Oklahoma website (www.soonersports.com) and it will be joined in progress on the Sooner Basketball Radio Network (KOMA 1520 AM) following the completion of the men's game which starts at 7 p.m. Ed Murray (play-by-play) and Jenny Bramer (analyst) will call the action. The men's basketball team host Georgia Southern Saturday at the Lloyd Noble Center., 16767=On a six-game winning streak, Head Coach Sherri Coale and the Sooners are excited about the opportunity to extend their perfect 3-0 road performance before returning home on Dec. 21 and 29 to host San Diego and top-ranked Connecticut at the Lloyd Noble Center, a place where OU is 4-0 this season and 12-3 in its last 15 home games., 18123=The Sooners opened their 1999-2000 home schedule by hosting the Bertha Teague Classic last week. Oklahoma picked up back-to-back wins over Oral Roberts and Tulsa to become the only team in the tournament to go undefeated. The Sooners also defeated Sam Houston State, 97-60, at the Lloyd Noble Center on Dec. 2., 1625=Denver returns home after posting a 2-1 record in three games on the road. DU picked up a win over Wright State Wednesday night after losing to Old Dominion, 71-49, on Dec. 12. The Pioneers defeated Radford, 61-49, on Dec. 9. Tonight's game is the fifth of seven games Denver will play in December., 832=Date: Saturday, Dec. 18, 1999 Arena: Magness Arena(7,200) Radio: KOMA (1520 AM) - will be joined in progress following the completion of the men's game at 7 p.m. Live on the Internet: www.soonersports.com TV: None, 9337=SCOUTING THE OPPONENT Denver enters its second season of NCAA Division I competition and its first year as a member of the Sun Belt Conference. This year, the Pioneers have an overall record of 4-3 and are 1-1 in the Magness Arena. Denver opened its 1999-2000 season at home with wins over Colorado, 71-69, and UNLV, 74-65. Michaela Pavlickova, a senior, and Melissa Garcia, a sophomore, top the returnees for the Pioneers. Pavlickova, a 6-3 center, averages 12.5 ppg and a team-high 8.8 rebounds per outing. Garcia is the team leader in scoring averaging 13.2 per contest. Pavlickova represented the Czech Republic at the World University Games this past summer. Joining the Pioneers' program this season and making an immediate impact on the team are Bethie Younger, a transfer from Auburn, and freshmen guards Ashley Atkinson and Lika Black. Atkinson is one of three DU players who average double figures in scoring with 11.0 ppg, ranking her third on the team. Younger is the team's fourth ranked scorer (7.8), while Black is fifth (5.2). Black, Garcia and Pavlickova have started each of DU's seven games. DU ended the 1998-99 season winning nine of its last 12 games and ranked 14th in scoring defense among NCAA Division I programs, restricting opponents to 58.9 points per game. Pavlickova ended last season ranked sixth in the nation in blocked shots with 2.8 per game (75 total)., 31603=Junior Desiree Taylor (Richardson, Texas) has responded well to coming OU's sixth man for the past six games. Taylor had started for the Sooners for 32 consecutive games until Nov. 28 when teammate and roommate Sunny Hardeman was inserted into the starting lineup. Taylor has now scored in five on the team's nine games after being held scoreless in the first three outings. Against Arkansas-Little Rock, the forward/center matched her career-high 20 points, hitting 7-of-12 shots. She also dished out a career-best five assists and grabbed a season-best seven rebounds., 33070=Whaley was one of only 12 players named to the Big 12 All-Stars team that toured Europe last August. The team competed in six games, accumulating a record of 5-1 behind Whaley's team-leading 13.8 points and 5.3 rebounds per game., 19221=SUNNY DAYS ARE AHEAD Since junior guard Sunny Hardeman (Norman, Okla.) earned her first start of the season and her seventh starts as a Sooner. Oklahoma has won six-consecutive games. Hardeman was among the starting five for the first time against ORU on Nov. 28. In that game, she dished out a career-high six assists and shot a season best 4-of-4 from the free throw line. The following night, the Norman native set season bests for most points (14), rebounds (5), defensive boards (3), field goals made (5), field goals attempted (9) and three-pointers made (4) and attempted (8). Hardeman had a perfect performance from three-point land (3-3) and the free throw line (2-2) against Arkansas-Little Rock on Dec. 11., 25059=Against Arkansas-Little Rock on Dec. 11, Whaley set the school record for most consecutive games started with 92. She tied the mark at TCU on Dec. 7., 32219=SOONERS FINISH 2-0 IN EXHIBITIONS Oklahoma completed a perfect 2-0 exhibition slate this year with a 91-52 win over Norrkoping Proderm of Sweden on Nov. 8 and a 83-69 victory over Club Gija Marijampole of Lithuania on Nov. 13., 25650=OU SET TO APPEAR IN 10 REGULAR SEASON TV GAMES Oklahoma women's basketball program will set a school record during the 1999-2000 season by appearing on local, state, regional and national television on 10 occasions during the regular season. OU will make its first ever appearance on ESPN2 on Feb. 19 at Texas Tech. The Sooners will also be seen on the Fox Sports Network five times and News Now 53, a local Norman/Oklahoma City station, four times. In OU's first televised game this season (Dec. 5), the Sooners won 61-47 over host Stephen F. Austin.}",
    "textBeforeTable": "Probable Starters Oklahoma Saturday's game can be heard live on the University of Oklahoma website (www.soonersports.com) and it will be joined in progress on the Sooner Basketball Radio Network (KOMA 1520 AM) following the completion of the men's game which starts at 7 p.m. Ed Murray (play-by-play) and Jenny Bramer (analyst) will call the action. The men's basketball team host Georgia Southern Saturday at the Lloyd Noble Center. Denver returns home after posting a 2-1 record in three games on the road. DU picked up a win over Wright State Wednesday night after losing to Old Dominion, 71-49, on Dec. 12. The Pioneers defeated Radford, 61-49, on Dec. 9. Tonight's game is the fifth of seven games Denver will play in December. The Sooners are coming off an impressive 102-72 win over Arkansas-Little Rock last Saturday. OU also picked up two road wins that week by defeating Stephen F. Austin, 61-47, and TCU, 94-74. TONIGHT'S GAME After taking the week off to focus on finals, the University of Oklahoma women's basketball team (7-2) returns to the court riding a six-game winning streak heading into tonight's game against Denver (3-3). Date: Saturday, Dec. 18, 1999 Arena: Magness Arena(7,200) Radio: KOMA (1520 AM) - will be joined in progress following the completion of the men's game at 7 p.m. Live on the Internet: www.soonersports.com TV: None PDF Formatted Release GAME #10",
    "textAfterTable": "Off the bench (listed numerically) Pos. No. Players Ht. Yr. GP-GS PPG RPG C 00 Desiree Taylor 6-1 Jr. 9-3 4.7 3.0 G 23 Jadrea Seeley 6-2 Fr. 9-0 8.6 1.4 F 40 Shannon Selmon 6-1 So. 9-0 1.8 1.4 Denver Pos. No. Players Ht. Yr. GP-GS PPG RPG F 20 Candy Benson 6-2 Sr. 7-7 5.6 4.6 F 43 Martha Dibella 6-0 So. 6-2 8.0 3.8 C 45 Michaela Pavlickova 6-3 Jr. 7-7 12.6 8.7 G 22 Melissa Garcia 5-6 So. 7-7 12.4 2.9 G 35 Ashley Atkinson 5-10 Fr. 7-7 10.1 3.7 Off the bench (listed numerically) Pos. No. Players Ht. Yr. GP-GS PPG RPG C 42 Bethie Younger 6-1 Jr. 4-2 4.5 2.5 G 11 Lika Black 5-7 Fr. 7-0 5.3 1.3 SCOUTING THE OPPONENT Denver enters its second season of NCAA Division I competition and its first year as a member of the Sun Belt Conference. This year, the Pioneers have an overall record of 4-3 and are 1-1 in the Magness Arena. Denver opened its 1999-2000 season at home with wins over Colorado, 71-69, and",
    "hasKeyColumn": true,
    "keyColumnIndex": 2,
    "headerRowIndex": 0
}