{
    "relation": [
        [
            "Municipality",
            "Akrotiri",
            "Anatoliko Selino",
            "Apokoronas-Vamos",
            "Armenoi",
            "Chania",
            "Eleftherios Venizelos",
            "Fres",
            "Georgioupoli",
            "Innachori",
            "Kandanos",
            "Keramia",
            "Kissamos",
            "Kolymvari",
            "Kryonerida",
            "Mousouroi",
            "Mythimna",
            "Nea Kydonia",
            "Pelekanos",
            "Platanias",
            "Sfakia",
            "Souda",
            "Theriso",
            "Voukolies",
            "Community",
            "Asi Gonia",
            "Gavdos"
        ],
        [
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            ""
        ],
        [
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            ""
        ],
        [
            "Postal code",
            "731 00",
            "730 09",
            "730 08",
            "730 08",
            "731 00",
            "733 00",
            "730 06",
            "730 07",
            "730 13",
            "730 04",
            "731 00",
            "734 00",
            "730 06",
            "730 07",
            "730 05",
            "730 04",
            "731 00",
            "730 01",
            "730 04",
            "730 11",
            "732 00",
            "731",
            "730 02",
            "Postal code",
            "740 55",
            "730 01"
        ],
        [
            "Area code",
            "28210-6",
            "28230-5",
            "28250-2",
            "28250-3",
            "28210-2 through 7",
            "28210-9",
            "28210-7",
            "28250-9",
            "28220-6",
            "28220-3",
            "28210",
            "28220-2",
            "28240-2",
            "28250-5",
            "28220-3",
            "28220-3",
            "28210-3",
            "28230-2",
            "28210-6",
            "28250-9",
            "28210-2",
            "28210-9",
            "28240-3",
            "Area code",
            "28310-4",
            "28230-4"
        ]
    ],
    "pageTitle": "Chania Property in Crete : Real estate and property in Chania, Greece - providing homes and property for sale in Chania Crete Greece : best offers for homes, houses, apartments, plot, land, developments, renovations, businesses, investments",
    "title": "",
    "url": "http://www.chaniaproperty.com/cp/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 56,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989042.37/warc/CC-MAIN-20150728002309-00100-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 362019851,
    "recordOffset": 362004948,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Chania Prefecture Municipalities Email us: info at chaniaproperty dot com All the above are offered at no charge to you. We have a developed an extensive system for seeking the appropriate property for you. If you cannot find what you are looking for in our website, you can easily submit a request form, and you can rest assured that you will find what you are looking for. Nevertheless, you will always be presented with a link to their official website to view all their listings. Every agency/developer is limited to the number of listings they can present on this website. They can only show a small amount of listings each time. What does this mean? Well, this way, we are positive that they will present you with their best listings, as they are competing with their colleagues. Or, they may want to offer you a special deal on a specific home or land.   All in all, we try our hardest to make sure that, who you buy your property from, is legit and a qualified property seller. Others with fewer years in operation still have a great track record in the Chania estate market. Most of the agencies within this website have been in practice, a minimum",
    "textAfterTable": "  Chania, Crete Prefecture Cities - Towns - Villages               A Achladies Aerinos Afrata Aghia Aghia Marina Aghia Roumeli Aghia Triada Aghii Theodori Agia Eirini Agioi Pantes Agios Georgios Agios Onoufrios Agios Pavlos Agios Vasileios Aligi Alikambos Alikianos Almirida Ammoudari Amygdalokefali Ano Kefala Ano Sfinari Anopoli Apokoronas Apothikes Aradena Archondiko Argastiri Argoules? Armeni Aroni Asi Gonia Asfenies Askida Askifou Aspra Nera Aspro Asprosykia Asprouliani Astratigos Astrikas Azogires Azogiros A Balarina Berbathiana C Chania Chasi Chliaro Chorafakia Chordaki Chrysopigi D Daratsos Deliana Deres Douliana Drakona Drapani Drapanos Dromonero Drys E Elliniko Elos Embrosneros Epanochori Episkopi Exopolis F Floria Fones Fournes Frangokastelo Fres     G Galatas Garitsas Gavalohori",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}