{
    "relation": [
        [
            "Element",
            "",
            "",
            "",
            "",
            ""
        ],
        [
            "Required/Optional",
            "Required",
            "Required",
            "Required",
            "Optional",
            "Optional"
        ],
        [
            "Description",
            "For packets which require confirmation, specifies the minimum amount of time in milliseconds to wait for a corresponding ACK packet, before resending a packet. Default value is 200.",
            "For packets which require confirmation, specifies the maximum amount of time, in milliseconds, that a packet will be resent. After this timeout expires Coherence will make a determination if the recipient is to be considered \"dead\". This determination takes additional data into account, such as if other nodes are still able to communicate with the recipient. Default value is 60000.Note: For production use, the recommended value is the greater of 60000 and two times the maximum expected full GC duration.",
            "Specifies the interval between heartbeats. Each member issues a unicast heartbeat, and the most senior member issues the cluster heartbeat, which is a broadcast message. The heartbeat is used by the tcp-ring-listener as part of fast death detection. Default value is 1000.",
            "Configures per-node packet throttling and remote GC detection.",
            "Configures how aggressively Coherence will attempt to maximize packet utilization."
        ]
    ],
    "pageTitle": "Operational Configuration Elements",
    "title": "",
    "url": "http://docs.oracle.com/cd/E13924_01/coh.340/e13818/appoperationelements.htm",
    "hasHeader": true,
    "headerPosition": "MIXED",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042991951.97/warc/CC-MAIN-20150728002311-00250-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 69859127,
    "recordOffset": 69828014,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{85563=Specifies the port that the Socket will listen or publish on. Legal values are from 1 to 65535. Default value depends on the release and build level and typically follows the convention of {version}+{{{build}. For example, for Coherence Release 2.2 build 255 it is 22255. Preconfigured value is tangosol.coherence.clusterport. See Appendix L, \"Command Line Overrides\" for more information., 125378=Note: Some network equipment cannot handle packets larger than 1472 bytes (IPv4) or 1468 bytes (IPv6), particularly under heavy load. If you encounter this situation on your network, this value should be set to 1472 or 1468 respectively. The recommended values is 32 bytes less then the network MTU setting. Default value is 1468., 115016=Specifies the interval between heartbeats. Each member issues a unicast heartbeat, and the most senior member issues the cluster heartbeat, which is a broadcast message. The heartbeat is used by the tcp-ring-listener as part of fast death detection. Default value is 1000., 125104=Specifies the maximum size, in bytes, of the UDP packets that will be sent and received on the unicast and multicast sockets. This value should be at least 512; recommended value is 1468 for 100Mb, and 1Gb Ethernet. This value must be identical on all cluster nodes., 126071=Specifies the preferred size, in bytes, of UDP packets that will be sent and received on the unicast and multicast sockets. This value should be at least 512 and cannot be greater than the maximum-length value; it is recommended to set the value to the same as the maximum-length value. Default value is 1468., 104877=For unicast-listener, multicast-listener and packet-publisher: Specifies the number of packets of packet-size that the datagram socket will be asked to size itself to buffer. See SO_SNDBUF and SO_RCVBUF. Actual buffer sizes may be smaller if the underlying socket implementation cannot support more than a certain size. Defaults are 32 for publishing, 64 for multicast listening, and 1428 for unicast listening., 111547=The maximum number of reusable packets to be used by the services responsible for publishing and receiving. The pools are initially small, and will grow on demand up to the specified limits. Defaults are 2048 for transmitting and receiving.}",
    "lastModified": "Wed, 13 May 2015 05:12:54 GMT",
    "textBeforeTable": "Table H-26 packet-delivery Subelements Table H-26 describes the elements you can define within the packet-delivery element. Elements The <timeout-milliseconds> and <heartbeat-milliseconds> subelements are used in detecting the death of other cluster nodes. Death Detection Specifies timing and transmission rate parameters related to packet delivery. Description Used in: packet-publisher. packet-delivery The maximum number of reusable packets to be used by the services responsible for publishing and receiving. The pools are initially small, and will grow on demand up to the specified limits. Defaults are 2048 for transmitting and receiving. Required <maximum-packets> Description Required/Optional Element Table H-25 packet-pool Subelements Table H-25 describes the subelements you can define within the packet-pool element. Elements The packet pools are used as a reusable buffer between Coherence network services. For packet transmission, this defines the maximum number of packets which can be queued on the packet-speaker before the packet-publisher must block. For packet reception, this defines the number of packets which can be queued on the incoming-message-handler before the unicast-listener, and multicast-listener must block. Performance",
    "textAfterTable": "packet-publisher Used in: cluster-config. Description Specifies configuration information for the Packet publisher, which manages network data transmission. Reliable packet delivery The Packet publisher is responsible for ensuring that transmitted packets reach the destination cluster node. The publisher maintains a set of packets which are waiting to be acknowledged, and if the ACK does not arrive by the packet-delivery resend timeout, the packet will be retransmitted (see <packet-delivery> subelement). The recipient node will delay the ACK, to batch a series of ACKs into a single response (see <notification-queuing> subelement). Throttling The rate at which the publisher will accept and transmit packet may be controlled by using the traffic-jam and flow-control settings. Throttling may be necessary when dealing with slow networks, or small packet-buffer. Elements Table H-27 describes the elements you can define within the packet-publisher element. Table H-27 packet-publisher Subelements Element Required/Optional Description <enabled> Required Specifies if TCMP clustering is enabled. For Coherence editions which support both Coherence Extend and Coherence TCMP based clustering, this feature allows TCMP to be disabled to ensure that a node only connects by using the Extend protocol. Default",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}