{
    "relation": [
        [
            "Date",
            "Apr 4, 1996",
            "Mar 1, 2000",
            "Feb 23, 2001",
            "Mar 15, 2005",
            "May 7, 2009",
            "Dec 28, 2010",
            "Jun 15, 2012"
        ],
        [
            "Code",
            "AS",
            "AS",
            "FPAY",
            "FPAY",
            "FPAY",
            "AS",
            "AS"
        ],
        [
            "Event",
            "Assignment",
            "Assignment",
            "Fee payment",
            "Fee payment",
            "Fee payment",
            "Assignment",
            "Assignment"
        ],
        [
            "Description",
            "Owner name: MOTOROLA, INC., ILLINOIS Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNOR:KONOPKA, JOHN G.;REEL/FRAME:007940/0862 Effective date: 19960401",
            "",
            "Year of fee payment: 4",
            "Year of fee payment: 8",
            "Year of fee payment: 12",
            "Owner name: OSRAM SYLVANIA INC., MASSACHUSETTS Free format text: MERGER;ASSIGNOR:OSRAM SYLVANIA INC.;REEL/FRAME:025546/0415 Effective date: 20100902",
            "Owner name: OSRAM AG, GERMANY Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNOR:OSRAM SYLVANIA INC.;REEL/FRAME:028380/0245 Effective date: 20110830"
        ]
    ],
    "pageTitle": "Patent US5694006 - Single switch ballast with integrated power factor correction - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US5694006?dq=U.S.+Patent+No.+4,528,643",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 8,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987155.85/warc/CC-MAIN-20150728002307-00152-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 466247982,
    "recordOffset": 466231588,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Patent Citations Although the present invention has been described with reference to a certain preferred embodiment, numerous modifications and variations can be made by those skilled in the art without departing from the novel spirit and scope of this invention. The primary advantage of the disclosed ballast circuit 200 is its use of a single power switch 58 in conjunction with an energy storage inductor 38 such that only a single magnetic component is required in order to achieve the functionality of both a power factor correction circuit and an inverter. This results in an electronic ballast 200 having, in comparison with existing approaches, a smaller physical size, lower component count, reduced material cost, and greater ease of manufacture. In a prototype ballast configured substantially as shown in FIG. 2, a power factor of 0.986, a total harmonic distortion of 12%, and a third harmonic distortion of 6.9% were measured. The lamp current crest factor, which is a measure of the amount of undesirable low frequency (120 Hertz) ripple that is present in the predominantly high frequency (e.g. in excess of 20,000 Hertz) current supplied to the lamp 104, was measured as 1.48, which satisfies accepted ballast performance standards for lamp current quality. The disclosed ballast 200 thus provides power factor correction and an appropriate quality of high frequency current to fluorescent lamps, yet requires less circuitry than prior art approaches. As can be gathered from the foregoing,",
    "textAfterTable": "High efficiency electronic ballast US5969481 * Sep 30, 1997 Oct 19, 1999 Motorola Inc. Power supply and electronic ballast with high efficiency voltage converter US6144173 * Nov 10, 1999 Nov 7, 2000 General Electric Company Single switch electronic ballast US6181082 * Oct 15, 1998 Jan 30, 2001 Electro-Mag International, Inc. Ballast power control circuit US6597128 Oct 3, 2001 Jul 22, 2003 Hubbell Incorporated Remote discharge lamp ignition circuitry US6784622 * Dec 5, 2001 Aug 31, 2004 Lutron Electronics Company, Inc. Single switch electronic dimming ballast US6791279 * Mar 19, 2003 Sep 14, 2004 Lutron Electronics Co., Inc. Single-switch electronic dimming ballast US7285919 Jun 22, 2001 Oct 23, 2007 Lutron Electronics Co., Inc. Electronic ballast having improved power factor and total harmonic distortion US8174201 Jul 10, 2009 May 8,",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}