{
    "relation": [
        [
            "Date",
            "Sep 29, 2000",
            "Aug 6, 2010",
            "Oct 3, 2014",
            "Feb 20, 2015",
            "Apr 14, 2015"
        ],
        [
            "Code",
            "AS",
            "FPAY",
            "REMI",
            "LAPS",
            "FP"
        ],
        [
            "Event",
            "Assignment",
            "Fee payment",
            "Maintenance fee reminder mailed",
            "Lapse for failure to pay maintenance fees",
            "Expired due to failure to pay maintenance fee"
        ],
        [
            "Description",
            "Owner name: ELECTRONICS AND TELECOMMUNICATIONS RESEARCH INSTIT Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNORS:KIM, JAE GON;CHANG, HYUN SUNG;KIM, MUNCHURL;AND OTHERS;REEL/FRAME:011166/0869 Effective date: 20000926",
            "Year of fee payment: 4",
            "",
            "",
            "Effective date: 20150220"
        ]
    ],
    "pageTitle": "Patent US7181757 - Video summary description scheme and method and system of video summary ... - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US7181757?dq=6,275,983",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 9,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989790.89/warc/CC-MAIN-20150728002309-00226-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 478780015,
    "recordOffset": 478752891,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{47755=The video summary description scheme was proposed by the MPEG-7 Description Scheme (V0.5) announced ISO/IEC JTC1/SC29/WG11 MPEG-7 Output Document No. N2844 on July 1999. Because the scheme describes the interval information of each video segment of dynamic video summary, in spite of providing basic functionalities describing dynamic summary, the scheme has problems in the following aspects.}",
    "textBeforeTable": "Patent Citations Although, the present invention was described on the basis of preferably executable examples, these executable examples do not limit the present invention but exemplify. Also, it will be appreciated by those skilled in the art that changes and variations in the embodiments herein can be made without departing from the spirit and scope of the present invention as defined by the following claims and the equivalents thereof. When applied to the server/client circumstance, the present invention can provide a system in which multiple clients can access one server and do video overview and browsing. The original video is inputted to the server and the video summary description data is produced on the basis of the hierarchical summary description scheme and the video summary description data generation system linking the original video and the video summary description data is equipped. The client accesses the server through the communication network, does overview of the video using the video summary description data, and does browsing and navigation of the video by accessing to the original video. The case 4 and case 5 are the cases that start at the playing of the video summary level 1 and the paths are similar to the above cases. The case 3 is the case that selects the most interested representative frame to obtain more detailed information in the case that the access from the video summary level 1",
    "textAfterTable": "US6961954 * Mar 2, 1998 Nov 1, 2005 The Mitre Corporation Automated segmentation, information extraction, summarization, and presentation of broadcast news EP0938054A2 Feb 23, 1999 Aug 25, 1999 Siemens Corporate Research, Inc. A system for interactive organization and browsing of video JPH1169281A Title not available JPH09219835A Title not available WO1999041684A1 Feb 11, 1999 Aug 19, 1999 Fast Tv Processing and delivery of audio-video information * Cited by examiner Non-Patent Citations Reference 1 ISO/IEC JTC1/SC29/WG11, \"MPEG-7 Description Schemes (V0.5),\" Description Scheme Group, pp. 1-58, Jul. 1999. 2 Kim, J-G., et al., \"Summary Description Schemes for Efficient Video Navigation and Browsing,\" Proceedings of SPIE vol. 4067:1397-1408, 2000. 3 Kim, M., et al., \"An Extended Summary DS for Navigation and Browsing,\" Electronics",
    "hasKeyColumn": true,
    "keyColumnIndex": 2,
    "headerRowIndex": 0
}