{
    "relation": [
        [
            "Date",
            "Aug 30, 1999",
            "Feb 11, 2002",
            "Mar 20, 2007",
            "Jun 27, 2011",
            "Sep 19, 2011",
            "Feb 3, 2014",
            "Feb 4, 2014",
            "Feb 7, 2014",
            "Mar 4, 2014"
        ],
        [
            "Code",
            "AS",
            "AS",
            "AS",
            "AS",
            "FPAY",
            "AS",
            "AS",
            "AS",
            "AS"
        ],
        [
            "Event",
            "Assignment",
            "Assignment",
            "Assignment",
            "Assignment",
            "Fee payment",
            "Assignment",
            "Assignment",
            "Assignment",
            "Assignment"
        ],
        [
            "Description",
            "Owner name: INTERSOFT CORPORATION, ILLINOIS Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNOR:TRATTNER, JOSEPH M.;REEL/FRAME:010211/0512 Effective date: 19990830 Owner name: NUWORLD MARKETING LIMITED, ILLINOIS Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNORS:SULLIVAN, THOMAS J.;WINDISH, RICHARD J.;LEWRIGHT, DORR H.;AND OTHERS;REEL/FRAME:010211/0539 Effective date: 19990830 Owner name: NUWORLD MARKETING LIMITED, ILLINOIS Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNOR:INTERSOFT CORPORATION;REEL/FRAME:010211/0531 Effective date: 19990830",
            "Owner name: NCH MARKETING SERVICES, INC., ILLINOIS Free format text: CHANGE OF NAME;ASSIGNOR:NUWORLD MARKETING LIMITED;REEL/FRAME:012598/0486 Effective date: 20011221",
            "Owner name: BEAR STEARNS CORPORATE LENDING INC., AS COLLATERAL Free format text: SECURITY AGREEMENT;ASSIGNORS:VALASSIS COMMUNICATIONS, INC.;NCH MARKETING SERVICES, INC.;REEL/FRAME:019047/0779 Effective date: 20070302",
            "Owner name: JPMORGAN CHASE BANK, N.A. AS ADMINISTRATIVE AGENT, Free format text: SECURITY AGREEMENT;ASSIGNORS:VALASSIS COMMUNICATIONS, INC.;NCH MARKETING SERVICES, INC.;VALASSIS DIRECT MAIL, INC.;AND OTHERS;REEL/FRAME:026509/0311 Effective date: 20110627",
            "Year of fee payment: 4",
            "Owner name: VALASSIS COMMUNICATIONS, INC., MICHIGAN Free format text: SECURITY AGREEMENT;ASSIGNOR:BEAR STEARNS CORPORATE LENDING INC.;REEL/FRAME:032152/0402 Effective date: 20070320",
            "Owner name: VALASSIS COMMUNCATIONS, INC., MICHIGAN Free format text: RELEASE BY SECURED PARTY;ASSIGNOR:JPMORGAN CHASE BANK, N.A.;REEL/FRAME:032133/0837 Effective date: 20140204 Owner name: BRAND.NET, INC., CALIFORNIA Free format text: RELEASE BY SECURED PARTY;ASSIGNOR:JPMORGAN CHASE BANK, N.A.;REEL/FRAME:032133/0837 Effective date: 20140204 Owner name: VALASSIS DIRECT MAIL, INC., CONNECTICUT Free format text: RELEASE BY SECURED PARTY;ASSIGNOR:JPMORGAN CHASE BANK, N.A.;REEL/FRAME:032133/0837 Effective date: 20140204 Owner name: VALASSIS IN-STORE SOLUTIONS, INC., MICHIGAN Free format text: RELEASE BY SECURED PARTY;ASSIGNOR:JPMORGAN CHASE BANK, N.A.;REEL/FRAME:032133/0837 Effective date: 20140204 Owner name: NCH MARKETING SERVICES, INC., ILLINOIS Free format text: RELEASE BY SECURED PARTY;ASSIGNOR:JPMORGAN CHASE BANK, N.A.;REEL/FRAME:032133/0837 Effective date: 20140204",
            "Owner name: CITIBANK, N.A., NEW YORK Free format text: INTELLECTUAL PROPERTY SECURITY AGREEMENT;ASSIGNOR:NCH MARKETING SERVICES, INC.;REEL/FRAME:032174/0261 Effective date: 20140204",
            "Owner name: CREDIT SUISSE (AG), CAYMAN ISLANDS BRANCH, AS ADMI Free format text: INTELLECTUAL PROPERTY SECURITY AGREEMENT;ASSIGNOR:NCH MARKETING SERVICES, INC.;REEL/FRAME:032385/0462 Effective date: 20140204 Owner name: WELLS FARGO BANK, NATIONAL ASSOCIATION, AS COLLATE Free format text: INTELLECTUAL PROPERTY SECURITY AGREEMENT;ASSIGNOR:NCH MARKETING SERVICES, INC.;REEL/FRAME:032385/0762 Effective date: 20140204"
        ]
    ],
    "pageTitle": "Patent US20010018665 - System and method for administering promotions - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US20010018665?dq=5,870,513",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 8,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990900.28/warc/CC-MAIN-20150728002310-00095-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 484838351,
    "recordOffset": 484802992,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Patent Citations [0112] It should be understood that modifications and variations may be effected without departing from the scope of the novel concepts of the present invention. It should also be understood that this application is only limited by the scope of the claims. [0111] It should also be appreciated that the system of the present invention could be adapted to communicate with the retailers and manufacturers through other suitable communication methods such as through extranet or paper communications. [0110] It should be appreciated that the system enables the manufacturer to determine if the retailer has changed the promotion (such as because of bad weather). The manufacturer could check the promotion terms on a regular basis, or preferably the independent system could send an electronic or paper notice to the manufacturer after the retailer changes a promotions. [0109] The manufacturer and the retailer may generate a hard-copy reports 200 of the promotion information for their promotions administered by on the system. They may also download this information or data to conduct their own further statistical analysis. The system of the present invention can also be employed to store and create a historical database of promotion information or data which could be used for subsequent analysis of promotions. [0108] The internet server 34 displays promotion information in a variety of formats (e.g., graphical, statistical, charts, tables, etc.). The system",
    "textAfterTable": "US7249055 * Jul 7, 2000 Jul 24, 2007 Citicorp Credit Services, Inc. Method and system for managing and conducting a network auction US7848940 * Nov 14, 2000 Dec 7, 2010 Priceline.Com Incorporated Method, system and apparatus to facilitate conditional purchase orders with bounce back functionality US8095401 Oct 26, 2010 Jan 10, 2012 Priceline.Com Incorporated Bounce back method, system and apparatus US8306834 Dec 1, 2011 Nov 6, 2012 Priceline.Com, Incorporated Bounce back method, system and apparatus US8452704 Jul 11, 2001 May 28, 2013 Citicorp Credit Services, Inc. Method and system for on-line payments US8521583 Dec 26, 2003 Aug 27, 2013 Valassis In-Store Solutions, Inc. Computerized management system for multi-chain promotions, and related audit system US8548849 * Aug 18, 2010 Oct 1, 2013 Amazon Technologies, Inc. Customer generated promotions US8738428 * Nov 23, 2004 May 27,",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}