{
    "relation": [
        [
            "Date",
            "Jun 22, 1992",
            "Jun 28, 1994",
            "May 23, 1997",
            "Mar 22, 1999",
            "Jun 11, 2001",
            "Jan 28, 2002",
            "Jun 29, 2005",
            "Dec 14, 2005",
            "Feb 7, 2006"
        ],
        [
            "Code",
            "AS",
            "CC",
            "FPAY",
            "AS",
            "FPAY",
            "AS",
            "REMI",
            "LAPS",
            "FP"
        ],
        [
            "Event",
            "Assignment",
            "Certificate of correction",
            "Fee payment",
            "Assignment",
            "Fee payment",
            "Assignment",
            "Maintenance fee reminder mailed",
            "Lapse for failure to pay maintenance fees",
            "Expired due to failure to pay maintenance fee"
        ],
        [
            "Description",
            "Owner name: STRYKER CORPORATION, MICHIGAN Free format text: ASSIGNMENT OF ASSIGNORS INTEREST.;ASSIGNORS:GRULKE, DAVID H.;ARNETT, JEFFERY D.;REEL/FRAME:006202/0693 Effective date: 19920616",
            "",
            "Year of fee payment: 4",
            "Owner name: BANK OF AMERICA NATIONAL TRUST AND SAVINGS ASSOCIA Free format text: SECURITY AGREEMENT;ASSIGNORS:STRYKER CORPORATION;STRYKER FAR EAST, INC.;REEL/FRAME:014137/0212 Effective date: 19981204 Owner name: BANK OF AMERICA NATIONAL TRUST AND SAVINGS ASSOCIA Free format text: SECURITY INTEREST;ASSIGNORS:STRYKER CORPORATION;STRYKER FAR EAST, INC.;STRYKER INTERNATIONAL INC.;AND OTHERS;REEL/FRAME:009817/0001 Effective date: 19981204",
            "Year of fee payment: 8",
            "",
            "",
            "",
            "Effective date: 20051214"
        ]
    ],
    "pageTitle": "Patent US5269750 - Tip unit for fluid transfer surgical handpiece - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US5269750?dq=4393663",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 8,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987155.85/warc/CC-MAIN-20150728002307-00342-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 474875431,
    "recordOffset": 474843311,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{54462=The lamp 152 is capable of a light output of at least 0.1125 M.S.C.P. (mean spherical candle power) and is available from Glolite, located at Pauls Valley, Okla., under Model No. 4-6-92-201-01.}",
    "textBeforeTable": "Patent Citations Although a particular preferred embodiment of the invention has been disclosed in detail for illustrative purposes, it will be recognized that variations or modifications of the disclosed apparatus, including the rearrangement of parts, lie within the scope of the present invention. Moreover, the location of the switch bar 131 on the tip unit 41 places it convenient to the hand of the user. Further, the physical location of the switch bar, protruding either rightwardly from the tip unit casing 81 (as seen by the user with handpiece 10 in the hand in its lamp ignited position or protruding leftwardly from the casing 81 in its lamp off position) as well as the differences in the size and shape of the two exposable ends of the switch bar, allow the user, by touch alone, to determine the status of the lamp 152 or to turn the lamp 152 on or off, without need to even look in the surgical site for a visual cue as to the on or off condition of the lamp. By including the switch 131 and battery pack in the exchangeable tip unit 41, the present invention eliminates any need to modify existing handpieces 10 of the kind shown in aforementioned U.S. Pat. No. 5,046,486 and any need for external electrical connections from the tip unit 41 either to the handpiece 10 or any external switch and/or electrical supply. Moreover, surgeons and surgical",
    "textAfterTable": "Den-Tal-Ez Mfg. Co. Dental syringe US4204328 * Nov 14, 1977 May 27, 1980 Kutner Barry S Variable diameter aspirating tip US4330274 * Mar 30, 1981 May 18, 1982 Joshua Friedman Lighting system for a dental handpiece US4398885 * Aug 25, 1981 Aug 16, 1983 Kaltenbach & Voigt Gmbh & Co. Dental handpiece US4400168 * May 7, 1981 Aug 23, 1983 Biomedical Engineering Corp. Adjustable surgical suction apparatus US4617013 * Jan 8, 1985 Oct 14, 1986 Timron Instruments, Incorporated Method and apparatus for surgical irrigation, aspiration and illumination US4670009 * Apr 16, 1985 Jun 2, 1987 American Hospital Supply Corp. Backform inserts for catheter US4759349 * Feb 24, 1986 Jul 26, 1988 Vitalmetrics, Inc. Surgical instrument having a heat sink for irrigation, aspiration, and illumination",
    "hasKeyColumn": true,
    "keyColumnIndex": 2,
    "headerRowIndex": 0
}