{
    "relation": [
        [
            "Citing Patent",
            "US6141273 *",
            "US6240033",
            "US6347381 *",
            "US6407953",
            "US6459634",
            "US6496027 *",
            "US6756805",
            "US6768685",
            "US6930503",
            "US7705600 *",
            "US20040201399 *"
        ],
        [
            "Filing date",
            "Dec 30, 1999",
            "Jan 10, 2000",
            "Oct 30, 1998",
            "Feb 2, 2001",
            "Jan 31, 2000",
            "Aug 21, 1997",
            "Nov 15, 2002",
            "Nov 16, 2001",
            "Apr 30, 2004",
            "Feb 12, 2007",
            "Apr 30, 2004"
        ],
        [
            "Publication date",
            "Oct 31, 2000",
            "May 29, 2001",
            "Feb 12, 2002",
            "Jun 18, 2002",
            "Oct 1, 2002",
            "Dec 17, 2002",
            "Jun 29, 2004",
            "Jul 27, 2004",
            "Aug 16, 2005",
            "Apr 27, 2010",
            "Oct 14, 2004"
        ],
        [
            "Applicant",
            "Hyundai Electronics Industries Co., Ltd.",
            "Hyundai Electronics Industries Co., Ltd.",
            "Stmicroelectronics, Inc.",
            "Matrix Semiconductor, Inc.",
            "Micron Technology, Inc.",
            "Micron Technology, Inc.",
            "Micron Technology, Inc.",
            "Mtrix Semiconductor, Inc.",
            "Micron Technology, Inc.",
            "Cypress Semiconductor Corporation",
            "Micron Technology, Inc."
        ],
        [
            "Title",
            "Circuit for setting width of input/output data in semiconductor memory device",
            "Antifuse circuitry for post-package DRAM repair",
            "Test mode circuitry for electronic storage devices and the like",
            "Memory array organization and related test method particularly well suited for integrated circuits having write-once memory arrays",
            "Circuits and methods for testing memory cells along a periphery of a memory array",
            "System for testing integrated circuit devices",
            "System for testing integrated circuit devices",
            "Integrated circuit memory array with fast test mode utilizing multiple word line selection and method therefor",
            "System for testing integrated circuit devices",
            "Voltage stress testing of core blocks and regulator transistors",
            "System for testing integrated circuit devices"
        ]
    ],
    "pageTitle": "Patent US5848010 - Circuit and method for antifuse stress test - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US5848010?dq=6246862",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 6,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990900.28/warc/CC-MAIN-20150728002310-00335-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 478995423,
    "recordOffset": 478978634,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Patent Citations It is to be understood that the above description is intended to be illustrative, and not restrictive. The above description is intended to include sufficient detail to enable those skilled in the art to practice the invention, but it is to be understood that other embodiments may be utilized and that logical and other changes may be made without departing from the scope of the present invention. For example, active high signals can be substituted for active low signals, and logic circuitry added or modified. P-channel and n-channel transistors may be interchanged, and different power supply and ground voltage references may be used. Many other embodiments will be apparent to those of skill in the art upon reviewing the above description. Thus, the scope of the invention is not limited to the particular embodiments shown and described herein. Thus, the present invention includes an antifuse stress test circuit. The test circuit provides an antifuse stress voltage that is independent of the power supply voltage VCC, allowing antifuse stress testing simultaneous with other pre-fuse tests. Moreover, the magnitude of the stress voltage can be adjusted to compensate for variations in device or process conditions. In one embodiment, the stress test control voltage is applied during probe testing using an external probe pad. In another embodiment, the test circuit controls the DVC2E voltage generating circuit to provide a test voltage that is independent of changes in the supply",
    "textAfterTable": "US6459634 Jan 31, 2000 Oct 1, 2002 Micron Technology, Inc. Circuits and methods for testing memory cells along a periphery of a memory array US6496027 * Aug 21, 1997 Dec 17, 2002 Micron Technology, Inc. System for testing integrated circuit devices US6756805 Nov 15, 2002 Jun 29, 2004 Micron Technology, Inc. System for testing integrated circuit devices US6768685 Nov 16, 2001 Jul 27, 2004 Mtrix Semiconductor, Inc. Integrated circuit memory array with fast test mode utilizing multiple word line selection and method therefor US6930503 Apr 30, 2004 Aug 16, 2005 Micron Technology, Inc. System for testing integrated circuit devices US7705600 * Feb 12, 2007 Apr 27, 2010 Cypress Semiconductor Corporation Voltage stress testing of core blocks and regulator transistors US20040201399 * Apr 30, 2004 Oct 14, 2004 Micron Technology, Inc. System for testing integrated circuit devices * Cited by examiner",
    "hasKeyColumn": true,
    "keyColumnIndex": 3,
    "headerRowIndex": 0
}