{
    "relation": [
        [
            "Date",
            "May 23, 2001",
            "Sep 14, 2007",
            "Jan 28, 2010",
            "Sep 23, 2011",
            "Aug 27, 2012",
            "Aug 29, 2012"
        ],
        [
            "Code",
            "AS",
            "FPAY",
            "AS",
            "FPAY",
            "AS",
            "AS"
        ],
        [
            "Event",
            "Assignment",
            "Fee payment",
            "Assignment",
            "Fee payment",
            "Assignment",
            "Assignment"
        ],
        [
            "Description",
            "Owner name: MERCK & CO., INC., NEW JERSEY Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNORS:CHERN, REY T.;ZINGERMAN, JOEL R.;REEL/FRAME:011833/0287;SIGNING DATES FROM 20010515 TO 20010518",
            "Year of fee payment: 4",
            "Owner name: MERCK SHARP & DOHME CORP., NEW JERSEY Free format text: CHANGE OF NAME;ASSIGNOR:MERCK & CO., INC.;REEL/FRAME:023861/0349 Effective date: 20091102",
            "Year of fee payment: 8",
            "Owner name: SCHERING CORPORATION, NEW JERSEY Free format text: MERGER;ASSIGNOR:MERCK SHARP & DOHME CORP.;REEL/FRAME:028850/0515 Effective date: 20120426",
            "Owner name: MERCK SHARP & DOHME CORP., NEW JERSEY Free format text: CHANGE OF NAME;ASSIGNOR:SCHERING CORPORATION;REEL/FRAME:028866/0511 Effective date: 20120502"
        ]
    ],
    "pageTitle": "Patent US6733767 - Liquid polymeric compositions for controlled release of bioactive substances - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US6733767?dq=5,941,947",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 12,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987155.85/warc/CC-MAIN-20150728002307-00116-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 481132355,
    "recordOffset": 481087759,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{40605=The present invention further provides a liquid polymeric composition comprising: (1) 1-30% w/v of at least one bioactive substance (e.g., hydrophobic bioactive substance); (2) 1-20% w/v of at least one biologically acceptable “polymer” (including “copolymer”, a polymer polymerized by at least two comonomers) (e.g., poly(lactide-co-glycolide) copolymer), for instance, wherein the weight ratio of the polymer to the bioactive substance can be 1:1 or less, e.g., 0.5:1 to 1:1; and (3) a mixture of at least one hydrophilic solvent and at least one lipophilic solvent, e.g., at least one biologically or physiologically or medically or veterinarily acceptable hydrophilic solvent and at least one biologically or physiologically or medically or veterinarily acceptable lipophilic solvent wherein the volume ratio of the hydrophilic and lipophilic (or hydrophobic) solvents is from about 80:20 to about 0:100, for instance about 80:20 to about 10:90 or 5:95, hydrophilic and lipophilic solvents, e.g., about 65:35 to about 35:65, and/or wherein the water immiscible or lipophilic solvent is present in an amount of at least about 16.5% by weight (e.g., including 16.465% by weight), such as at least about 16.5% to about 45% by weight, for instance at least about 16.5% to about 30% by weight (eg., at least about 29% by weight), or at least about 20% or about 25% by weight to about 30%, 35%, 40% or 45% by weight, or at least greater than 40% by weight (for instance and at least about 42-45% by weight); e.g., such compositions wherein there is less than 10% of the polymer and 1 to 10% of the bioactive active substance or about less than 7% (e.g., 6.7%) or 5% or less polymer, with the bioactive substance content at less than or equal to about 10% or 5%., 84002=In another preferred embodiment, the weight ratio of the polymer, e.g., poly(lactide-co-glycolide) copolymer, to the bioactive substance, e.g., at least one hydrophobic bioactive substance, is 1:1 or less; more preferably 0.5:1 to 1:1, 86317=“Hydrophilic solvent” means water miscible solvents, preferably those when mixed with water in a ratio from 1:9 to 9:1 form a single-phase solution. Examples of hydrophilic solvents suitable for the present invention include, but not limited to glycerol formal, glycofural, N-methyl pyrrolidone, 2-pyrrolidone, isopropylidene glycerol, di(propylene glycol) methyl ether, and mixtures thereof., 83434=(c) a mixture of hydrophilic and lipophilic solvents wherein the volume ratio of the hydrophilic and lipophilic solvents is from about 80:20 to about 5:95., 72146=Macrolides are a class of antibiotics which contain a many-membered lactone ring to which are attached one or more deoxy sugars. Macrolides are generally bacteriostatic, but have been shown to be bacteriocidal in high concentration against very susceptible organisms. Macrolides are most effective against gram-position cocci and bacilli, although they do possess some activity against some gram-negative organism. Macrolides exert their bacteriostatic activity by inhibiting bacterial protein synthesis by binding reversibly to the 50 S ribosomal subunit. (“Goodman & Gillman's the Pharmacological Basis of Therapeutics,” 9th ed., J. G. Hadman & L. E. Limbird, eds., ch. 47, pp. 1135-1140, McGraw-Hill, New York (1996))., 67535=Pyrazoles such as phenylpyrazoles and N-arylpyrazoles are another class of insecticides which possess excellent insecticidal activity against all insect pests including blood-sucking pests such as ticks, fleas etc., which are parasites on animals. This class of agents kills insects by acting on the gamma-butyric acid receptor of invertebrates. Such agents are described, for example, in U.S. Pat. No. 5,567,429, U.S. Pat. No. 5,122,530, EP 295,117, and EP 846686 A1 (or Banks GB 9625045, filed Nov. 30, 1996 also believed to be equivalent to U.S. Pat. Ser. No. 309,229, filed Nov. 17, 1997). It would be well within the skill level of the practitioner to decide which individual compounds can be used in the inventive formulations., 20708=The present invention further relates to a liquid polymeric composition comprising: (1) about 1-30% w/v bioactive substance (e.g., hydrophobic bioactive substance); (2) about 1-20% w/v of a biologically acceptable “polymer” (including “copolymer”, a polymer polymerized by at least two comonomers) (e.g., poly(lactide-co-glycolide) copolymer), for instance, wherein the weight ratio of the polymer to the bioactive substance can be 1:1 or less, e.g., 0.3:1 to 1:1; and (3) at least one lipophilic solvent or a mixture of hydrophilic and lipophilic solvents wherein the volume ratio of the hydrophilic and lipophilic solvents is from about about 80:20 to about 0:100, for instance about 80:20 to about 10:90 or 5:95, hydrophilic and lipophilic solvents, e.g., about 65:35 to about 35:65, and/or wherein the the water immiscible or lipophilic solvent is present in an amount of at least about 16.5% by weight (e.g., including about 16.465% by weight), such as at least about 16.5% to about 45% by weight, for instance at least about 16.5% to about 30% by weight (e.g., at least about 29% by weight) or at least greater than 40% by weight (for instance and at least about 42-45% by weight); e.g., such compositions wherein there is less than 10% of the polymer and 1 to 10% of the bioactive active substance or about less than 7% (e.g., 6.7%) or 5% or less polymer, with the bioactive substance content at less than or equal to about 10% or 5%., 81036=With respect to biologically active agents useful in the practice of this invention, reference is also made to the U.S. and PCT applications of Williams and Chern, “Long Acting Injectable Formulations Containing Hydrogenated Castor Oil,” filed Sep. 14, 1998, U.S. Ser. No. 09/15277 and PCT application No. US98/190, and claiming priority from U.S. application Serial No. 60/067,374, incorporated herein by reference., 64199=The avermectin and milbemycin series of compounds are potent anthelmintic and antiparasitic agents against a wide range of internal and external parasites. The compounds which belong to this series are either natural products or are semi-synthetic derivatives thereof. The structure of these two series of compounds are closely related and they both share a complex 16-membered macrocyclic lactone ring; however, the milbemycin do not contain the aglycone substitutent in the 13-position of the lactone ring. The natural product avermectins are disclosed in U.S. Pat. No. 4,310,519 to Albers-Schonberg, et al., and the 22, 23-dihydro avermectin compounds are disclosed in Chabala, et al., U.S. Pat. No. 4,199,569. For a general discussion of avermectins, which include a discussion of their uses in humans and animals, see “Ivermectin and Abamectin,” W. C. Campbell, ed., Springer-Verlag, New York (1989). Furthermore, bioactive agents such as avermectins or ivermectin can be used in combination with other bioactive agents; and, with respect to avermectins, ivermectin, and bioactive agent combinations, reference is made to Kitano, U.S. Pat. No. 4,468,390, Beuvry et al., U.S. Pat. No. 5,824,653, von Bittera et al., U.S. Pat. No. 4,283,400, European Patent Application 0 007 812 A1, published Jun. 2, 1980, U.K. Patent Specification 1 390 336, published Apr. 9, 1975, European Patent Application 0 002 916 A2, Ancare New Zealand Patent No. 237 086, Bayer New Zealand Patent 176193, published Nov. 19, 1975, inter alia., 19418=This application claims priority from and incorporates by reference Chern and Zingerman, U.S. provisional application Serial No. 60/079,574 filed, Mar. 19, 1998., 84256=In yet another preferred embodiment, the volume ratio of the hydrophilic and lipophilic solvents is from about 65:35 to about 35:65., 50638=In certain embodiments there can be less than 10% of the polymer and 1 to 10% of the active compound; for instance, the proportion of the PLGA polymer and the active compound is less than or equal to 1:1. (See, e.g., the Example, wherein for instance 0.25 75/25 PLGA was dissolved in glycerol formal to provide a 2.5 ml solution; in a separate flask 75/25 PLGA was dissolved in triacetin to provide a 2.5 ml solution; the two solutions were mixed and added to a flask containing 0.50 g active ingredient which was dissolved into the mixed PLGA solutions; the amount of triacetin present in the formulation to be about 42% by weight; other formulations contain as little as 6.7% and 5% PLGA content with the drug content at 10% or 5%.), 55105=The present invention further provides a liquid polymeric composition comprising: (1) about 1-30% w/v of at least one bioactive substance (e.g., hydrophobic bioactive substance); (2) about 1-20% w/v of at least one biologically acceptable “polymer” (including “copolymer”, a polymer polymerized by at least two comonomers) (e.g., poly(lactide-co-glycolide) copolymer), for instance, wherein the weight ratio of the polymer to the bioactive substance can be 1:1 or less, e.g., 0.5:1 to 1:1; and (3) at least one lipophilic solvent or a mixture of at least one hydrophilic solvent and at least one lipophilic solvent, e.g., at least one biologically or physiologically or medically or veterinarily acceptable hydrophilic solvent and at least one biologically or physiologically or medically or veterinarily acceptable lipophilic solvent wherein the volume ratio of the hydrophilic and lipophilic (or hydrophobic) solvents is from about about 80:20 to about 0:100, for instance about 80:20 to about 10:90 or about 80:20 to about 5:95, hydrophilic and lipophilic solvents, e.g., about 65:35 to about 35:65, and/or wherein the the water immiscible or lipophilic solvent is present in an amount of at least about 16.5% by weight (e.g., including 16.465% by weight), such as at least about 16.5% to about 45% by weight, for instance at least about 16.5% to about 30% by weight (e.g., at least about 29% by weight), or at least about 20% or about 25% by weight to about 30%, 35%, 40% or 45% by weight, or at least greater than 40% by weight (for instance and at least about 42-45% by weight); e.g., such compositions wherein there is less than 10% of the polymer and 1 to 10% of the bioactive active substance or about less than 7% (e.g., 6.7%) or 5% or less polymer, with the bioactive substance content at less than or equal to about 10% or 5%., 69763=The androgens and antiandrogens structurally related to the estrogens and progestins as they are also biosynthesized from cholesterol. These compounds are based on testosterone. Androgens are used for hypogonadism and promote muscle development. Antiandrogens are used, for example, in the management of hyperplasia and carcinoma of the prostate, acne, and male pattern baldness as well as in the inhibition of the sex drive in men who are sex offenders. Estrogen, progestins, and androgens are described, for example, in “Goodman & Gilman's The Pharmacological Basis of Therapeutics,” 9th ed., J. G. Handman and L. Elimbird, eds., Ch. 57 to 60, pp. 1411-1485, McGraw Hill, New York (1996) or in “Principles of Medicinal Chemistry,” 2nd ed., W. O. Foye, ed., Ch. 21, pp. 495-559, Lea & Febiger, Philadelphia (1981)., 88453=The presence of the lipophilic solvent in the liquid composition of the present invention reduces the initial delivery of bioactive compound, thus eliminating the bursting drug release typical of existing liquid injectable formulations where a large portion of hydrophilic vehicle is used. The presence of the hydrophilic solvent facilitates the formation of the polymer skin while preventing precipitation of the bioactive compound, thus allowing a much higher level of drug delivery than possible when only lipophilic vehicles are used. In the present invention, the prefered hydrophilic:lipophilic solvent ratio is between 80:20 to 20:80, most preferably between 65:35 to 35:65., 85994=“Poly(lactide-co-glycolide)” means a copolymer of lactic and glycolic acids having a lactide:glycolide ratio of from 95:05 to 50:50, preferably 75:25 to 65:35. The lactic acid can be d- or l- or dl-. The copolymer may be a single copolymer of a mixture of copolymers within the above-defined parameters., 37463=Mention is also made of: Shah et al (J. Controlled Release, 1993, 27:139-147), as relating to formulations for sustained release of bioactive compounds containing various concentrations of poly(lactic-co-glycolic) acid copolymer (PLGA) dissolved in vehicles such as triacetin; Lambert and Peck (J. Controlled Release, 1995, 33:189-195), as a study of the release of protein from a 20% PLGA solution in N-methylpyrrolidone exposed to aqueous fluid; and Shivley et al (J. Controlled Release, 1995, 33:237-243), as a study of the solubility parameter of poly(lactide-co-glycolide) copolymer in a variety of solvents, and the in vivo release of naltrexone from two injectable implants (5% naltrexone in either 57% PLGA and 38% N-methylpyrrolidone or 35% PLGA and 60% N-methylpyrrolidone).}",
    "textBeforeTable": "Patent Citations Having thus described in detail preferred embodiments of the present invention, it is to be understood that the invention defined by the appended claims is not to be limited to particular details set forth in the above description as many apparent variations thereof are possible without departing from the spirit or scope of the present invention. Plasma levels of eprinomectin were determined in swine treated with eprinomectin formulation 2 of Example 3. Three swine (inoculated with 2,000 infective ova of Trichuris suis on day -50, and orally with 15,000 infective larvae of Oesophagostomum sp. on day 0) were injected subcutaneously with formulation 2 of Example 3 at a dose of 1.5 mg/kg. Ten ml blood samples were collected from each animal on days 3, 7 and weekly thereafter. The plasma level profile is shown in FIG. 3 (with alternate formulation of drug/PLGA in 100 glycerol formal). Plasma Level Profiles of Long-Acting Eprinomectin Formulation in Swine Example 6 Plasma levels of ivermectin were determined in healthy cattles treated with ivermectin formulations 1, 2 and 3 of Example 2. Each formulation was given to a group of five cattles (generally weighing 125 to 250 kg) as a single subcutaneous injection dosed at 1 mg/kg. Ten ml haparinized blood samples were collected from each treated animal on Days 1-7 (daily), 10, 14, and weekly thereafter for 15 weeks. The plasma level profiles (average of the five animals",
    "textAfterTable": "The Regents Of The University Of California Bone morphogenetic protein process US4310519 Sep 8, 1978 Jan 12, 1982 Merck & Co., Inc. Novel substances and process for their production US4329332 Jul 16, 1979 May 11, 1982 Patrick Couvreur Biodegradable submicroscopic particles containing a biologically active substance and compositions containing them US4331652 Dec 24, 1980 May 25, 1982 Eli Lilly And Company Controlled release parasitic formulations and method US4333919 Dec 15, 1980 Jun 8, 1982 Eli Lilly And Company Growth promotant controlled release formulations and method of treatment US4389330 Oct 6, 1980 Jun 21, 1983 Stolle Research And Development Corporation Microencapsulation process US4427663 Mar 16, 1982 Jan 24, 1984 Merck & Co., Inc. 4\"-Keto-and 4\"-amino-4\"-deoxy avermectin compounds and substituted amino derivatives thereof US4455256 May 5, 1981 Jun 19, 1984 The Regents Of The University Of California Bone morphogenetic protein US4468390 Feb 22, 1982 Aug 28, 1984",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}