{
    "relation": [
        [
            "Citing Patent",
            "US7847965 *",
            "US7921232",
            "US7945700",
            "US7958236",
            "US8135817",
            "US8161153",
            "US8402149",
            "US8429271",
            "US8655886 *",
            "US8775644",
            "US8949417",
            "US9015261",
            "US20120284533 *"
        ],
        [
            "Filing date",
            "Jun 14, 2006",
            "Nov 24, 2008",
            "",
            "Mar 1, 2010",
            "Aug 12, 2008",
            "",
            "May 15, 2012",
            "Apr 13, 2012",
            "Mar 25, 2011",
            "Feb 6, 2013",
            "Nov 21, 2012",
            "Mar 18, 2013",
            "May 1, 2012"
        ],
        [
            "Publication date",
            "Dec 7, 2010",
            "Apr 5, 2011",
            "May 17, 2011",
            "Jun 7, 2011",
            "Mar 13, 2012",
            "Apr 17, 2012",
            "Mar 19, 2013",
            "Apr 23, 2013",
            "Feb 18, 2014",
            "Jul 8, 2014",
            "Feb 3, 2015",
            "Apr 21, 2015",
            "Nov 8, 2012"
        ],
        [
            "Applicant",
            "Sharp Kabushiki Kaisha",
            "Ricoh Company, Ltd.",
            "Ricoh Co., Ltd.",
            "Ricoh Co., Ltd.",
            "Ricoh Company, Ltd.",
            "Ricoh Co., Ltd.",
            "Ricoh Company, Ltd.",
            "Ricoh Co., Ltd.",
            "Google Inc.",
            "Ricoh Company, Ltd.",
            "Ricoh Co., Ltd.",
            "Ricoh Co., Ltd.",
            "Stmicroelectronics S.R.I."
        ],
        [
            "Title",
            "Image forming apparatus and confidential data transmitting method",
            "System using internet application for automatically monitoring image-forming device and sharing collected device information among departments within a company",
            "Method and system for remote diagnostic, control and information collection based on various communication modes for sending messages to a resource manager",
            "Method and system for remote diagnostic, control and information collection based on various communication modes for sending messages to users",
            "Method and system for communicating with a device attached to a computer using electronic mail messages",
            "Method and system for remote diagnostic, control and information collection based on various communication modes for sending messages to users",
            "Method and system of remote diagnostic, control and information collection using a dynamic linked library of multiple formats and multiple protocols with restriction on protocol",
            "Method and system for remote diagnostic, control and information collection based on various communication modes for sending messages to users",
            "Selective indexing of content portions",
            "Method and system of remote diagnostic, control and information collection using a dynamic linked library of multiple formats and multiple protocols with restriction on protocol",
            "Method and system for remote diagnostic, control, and information collection based upon a connection or connectionless communication method for sending messages to the resource manager",
            "Method and system for remote diagnostic, control and information collection based on various communication modes for sending messages to users",
            "Method and circuit for cryptographic operation"
        ]
    ],
    "pageTitle": "Patent US7421496 - Method and system for diagnosis and control of machines using connectionless ... - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US7421496?dq=6,332,126",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 13,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989234.2/warc/CC-MAIN-20150728002309-00190-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 487775111,
    "recordOffset": 487724289,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{6656=In FIG. 1, the Internet is generally designated by 10. The Internet 10 includes a plurality of interconnected computers and routers designated by 12A-12B. The manner of communicating over the Internet is known through RFC documents obtained by FTP at NIC.DDN.MIL or at FTP NISC.SRI.COM. TCP/IP related communication is described for example in the book “TCP/IP Illustrated,” Vol. 1, The Protocols, by Stevens, from Addison-Wesley Publishing Company, 1994. As the Internet is a network accessible by many people and organizations, it is not considered to be secure. Therefore, messages transmitted over the Internet should be encrypted to keep the messages confidential. Encryption mechanisms are known and commercially available which may be used with the present invention. For example, a C library function, crypt( ), is available from Sun Microcomputers for use with the Unix operating system, and other encryption and decryption routines are known and commercially available.}",
    "TableContextTimeStampAfterTable": "{33436=The present application is a Continuation of and claims the benefit of priority from U.S. Ser. No. 08/883,492, filed Jun. 26, 1997 and is related to U.S. patent application Ser. No. 08/820,633 filed Mar. 19, 1997 (now U.S. Pat. No. 5,887,216) entitled “Method and System to Diagnose a Business Office Device Based on Operating Parameters Set by a User, U.S. patent application Ser. No. 08/733,134 (now U.S. Pat. No. 5,909,493) filed Oct. 16, 1996 entitled “Method and System for Diagnosis and Control of Machines Using Connectionless Modes of Communication, U.S. patent application Ser. No. 08/624,228 (now U.S. Pat. No. 5,818,603) filed Mar. 29, 1996 entitled “Method and System for Controlling and Communicating with Machines Using Multiple Communication Formats”, U.S. patent application Ser. No. 08/463,002 (now U.S. Pat. No. 5,819,110) filed Jun. 5, 1995 entitled “Method and System for Diagnosis and Control of Machines Using Connection and Connectionless Modes of Communication”, U.S. patent application Ser. No. 08/698,068 (now U.S. Pat. No. 5,649,120) filed Aug. 15, 1996 entitled “Method and Apparatus for Controlling and Communicating With Business Office Devices”, which is a continuation of U.S. patent application Ser. No. 08/562,192 (now U.S. Pat. No. 5,568,618) filed Nov. 22, 1995, which is a continuation of U.S. patent application Ser. No. 08/473,780 filed Jun. 6, 1995, entitled “Method and Apparatus for Controlling and Communicating With Business Office Devices”, now U.S. Pat. No. 5,544,289, which is a continuation of U.S. patent application Ser. No. 08/426,679 filed Apr. 24, 1995, now U.S. Pat. No. 5,537,554, entitled “Method and Apparatus for Controlling and Communicating With Business Office Devices” which is a continuation of U.S. Patent Application Ser. No. 08/282,168 filed Jul. 28, 1994 and entitled “Method and Apparatus for Controlling and Communicating With Business Office Devices”, now U.S. Pat. No. 5,412,779, which is a continuation of U.S. Patent Application Ser. No. 07/902,462 filed Jun. 19, 1992, now abandoned, which is a continuation of U.S. Patent Application Ser. No. 07/549,278, filed Jul. 6, 1990, now abandoned, the disclosure of each is incorporated herein by reference., 55031=An important feature of the present invention is the use of a connectionless-mode of communication or transmission between a machine and a computer for diagnosing and controlling the machine. The IBM Dictionary of Computing by George McDaniel, 1994, defines a connectionless-mode transmission to be the transmission of a single unit of data from a source service access point to one or more destination service access points without establishing a connection. The IBM Dictionary also defines a connection-mode transmission to be the transmission of units of data from a source service access point to one or more destination service access points via a connection. The connection is established prior to data transfer and released following data transfer. Additional information about the connection-mode and the connectionless-mode of operation is described in the Handbook of Computer-Communications Standards, Vol. 1, 2nd Edition, by William Stallings, 1990, which is incorporated herein by reference. In order to transfer data from one DTE (data terminal equipment) to another DTE, there is a unique identifier or address for each DTE. This unique identifier or address is usable in both connectionless-modes and connectionless-modes of communication., 136588=The connectionless-mode messages utilized with the present invention are preferably Internet electronic mail messages, although any other type of connectionless messages may be utilized. A current accepted standard in Internet electronic mail communications is the Simple Mail Transport Protocol, referred to as SMTP. The Simple Mail Transport Protocol is defined in the Request for Comments (RFC) 821. The Request for Comments 822 specifies further information of the format of Internet electronic mail messages and has been updated by RFC 1327. Each of the above Request for Comments is available on the Internet and is incorporated herein by reference. SMTP uses TCP (Transmission Control Protocol) packets to transport data from the sending machine to the receiving machine. An SMTP conversation is carried on by two pieces of software running on machines connected to the Internet, called Mail Transport Agents (MTAs). The details of implementing Internet electronic mail communication are well known.}",
    "textBeforeTable": "Patent Citations Obviously, numerous modifications and variations of the present invention are possible in light of the above teachings. It is therefore to be understood that within the scope of the appended claims, the invention may be practiced otherwise than as specifically described herein. The above described system may used with conventional machines including conventional business office machines using add-on equipment constructed in accordance with the present teachings and installed in or outside of the machine. The present invention also includes a computer program product which is a storage medium including instructions which can be used to program a computer to perform a process of the invention. The storage medium can include, but is not limited to, any type of disk including floppy disks, optical disks, CD-ROMs, and magneto-optical disks, ROMs, RAMs, EPROMs, EEPROMs, magnetic or optical cards, or any type of media suitable for storing electronic instructions. This invention may be conventionally implemented using a conventional general purpose digital computer programmed according to the teachings of the present invention, as will be apparent to those skilled in the computer art. Appropriate software coding can readily be prepared by skilled programmers based on the teachings of the present disclosure, as will be apparent to those skilled in the software art. The invention may also be implemented by the preparation of application specific integrated circuits or by interconnecting an appropriate network of conventional component circuit,",
    "textAfterTable": "US5537554 Apr 24, 1995 Jul 16, 1996 Ricoh Company, Ltd. Method and apparatus for controlling and communicating with business office devices US5537626 Feb 13, 1995 Jul 16, 1996 Canon Kabushiki Kaisha Apparatus for coupling printer with LAN to control printer operation by transferring control parameters, printer status data and printer configuration data between printer and LAN US5544289 Jun 6, 1995 Aug 6, 1996 Ricoh Company, Ltd. Method and apparatus for controlling and communicating with business office devices US5568618 Nov 22, 1995 Oct 22, 1996 Ricoh Company, Ltd. Method and apparatus for controlling and communicating with business office devices US5572678 Jan 25, 1993 Nov 5, 1996 Hitachi, Ltd. System for sending frames from sender to receiver using connectionless protocol and receiving acknowledging frame and retransmission request frame from receiver using connection oriented protocol US5623605 Aug 29, 1994 Apr 22, 1997 Lucent Technologies Inc. Methods and systems for interprocess communication and inter-network data transfer US5649120 Aug 15, 1996 Jul 15, 1997 Ricoh Company, Ltd.",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}