{
    "relation": [
        [
            "Categories",
            "Bang for the buck",
            "Food and Dining",
            "Dorm Life",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "It is a lot cheaper than 4yr schools and you can transfer credits.",
            "It is crazy over priced and isn't open all of the time. The dinning hall is open very limited times and not at all in the summer. The food is alright but again it's overpriced.",
            "Don't live in the dorms but haven't heard wonderful stuff.",
            "Take classes with established professors don't take classes with adjuncts especially in sciences, you never know who you will end up with. And that can make a big difference in your grade.",
            "It's a good community college. It will get the job done if you want to transfer, it's a good starting option."
        ]
    ],
    "pageTitle": "Onondaga Community College Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Onondaga-Community-College/reviews?_escaped_fragment_=/show/26484",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042991076.30/warc/CC-MAIN-20150728002311-00023-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 885373479,
    "recordOffset": 885329307,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{197311=© 2015, Cappex.com, LLC, 76517=The food is pretty good but it's expensive and you can only get hot food from 10:30-2:30 when the main cafe is closed, before 10:30 and after 2:30 there is a separate section that sells cold food sushi drinks and bakery items. There is also a Starbucks in the morning. And various food stations including sushi, grill, salad, wraps/ sandwiches, pizza, soups ,and hot food}",
    "textBeforeTable": "07/19/2009 Reviewer is Accepted here and planning to attend soon. Reviewer has not been to campus. 6 out of 7 people found this review useful. 1 of 52 Rodney from Brooklyn, NY Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464",
    "textAfterTable": "Categories Comments Great for these types of students Undecided on 4 year major. Looking to save considerable amount of money. A great beginning to college-life experience in every aspect. Tips for prospective students Residing in a dorm for your first year is highly recommended; apply early for a single room which is more costly but well worth it. No need for a car. Campus is extremely secure. Bang for the buck Excellent professors who help you succeed while encouraging independent responsibility. My experience has been outstanding and I recommend all graduating seniors to consider attending OCC. Am enjoying being here Many activities to participate in: clubs, fraternities and sporting events. Access to Syracuse University and LeMoyne is easy and free by bus. Class size allows for much interaction between students and professors. Faculty knows you by name! I am a member of the lacrosse team and have had an exceptional experience. Coaches are great and extremely supportive of academic learning requirements. Am learning a lot Studying engineering science has been challenging and rewarding. A great place to start prior to transfering to a 4 year college.",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}