{
    "relation": [
        [
            "If You Are Adding A ...",
            "System Disk",
            "Secondary Disk"
        ],
        [
            "Then ...",
            "You need to restore the root (/) and /usr file systems on the disk. Go to Chapter 44, Restoring Files and File Systems (Tasks). After the root (/) and /usr file systems are restored, install the boot block. Go to \"SPARC: How to Install a Boot Block on a System Disk\".",
            "You might need to restore file systems on the new disk. Go to Chapter 44, Restoring Files and File Systems (Tasks). If you are not restoring file systems on the new disk, you are finished adding a secondary disk. See Chapter 36, Mounting and Unmounting File Systems (Tasks) for information on making the file systems available to users."
        ]
    ],
    "pageTitle": "SPARC: Adding a System or Secondary Disk Task Map (System Administration Guide, Volume 1)",
    "title": "",
    "url": "http://docs.oracle.com/cd/E19455-01/805-7228/6j6q7ueto/index.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042982502.13/warc/CC-MAIN-20150728002302-00315-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 74559855,
    "recordOffset": 74551736,
    "tableOrientation": "HORIZONTAL",
    "lastModified": "Thu, 03 Feb 2011 11:23:57 GMT",
    "textBeforeTable": "Follow the instructions in the table below depending on whether you are booting from a local or remote Solaris CD. Connect the replacement system disk to the system and check the physical connections. Refer to the disk's hardware installation guide for installation details. Make sure the disk you are adding has a different target number than the other devices on the system. You will often find a small switch located at the back of the disk for this purpose. Disconnect the damaged system disk from the system. This procedure assumes that the system is shut down. SPARC: How to Connect a System Disk and Boot \"SPARC: How to Install a Boot Block on a System Disk\" System Disk Only. Install the boot block on the root (/) file system, so the system can boot. 5. Install Boot Block  Chapter 44, Restoring Files and File Systems (Tasks) Restore the root (/) or /usr file system (or both) on the system disk. If necessary, restore file systems on the secondary disk. 4. Restore File Systems  \"SPARC:",
    "textAfterTable": "After a few minutes, the root prompt (#) is displayed. Where to Go From Here After you boot the system, you can create slices and a disk label on the disk. Go to \"SPARC: How to Create Disk Slices and Label a Disk\". SPARC: How to Connect a Secondary Disk and Boot Become superuser. If the disk type is unsupported by the Solaris software, add the device driver for the disk by following the instructions included with the hardware. If necessary, see \"How to Create a format.dat Entry\" for information on creating a format.dat entry for the disk. Create the /reconfigure file that will be read when the system is booted. # touch /reconfigure The /reconfigure file will cause the SunOS software to check for the presence of any newly installed peripheral devices when you power on or boot your system later. Shut down the system. # shutdown -i0 -g30 -y -i0 Brings the system down to init state 0 (zero),",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}