{
    "relation": [
        [
            "Categories",
            "Campus Safety",
            "Great for these types of students",
            "Share any unusual traditions or locations on campus",
            "What to do for fun",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "Sometimes they are overbearing.",
            "Catholic and non-Catholic both. Teachers. Nurses. Business and political science majors. German program is awesome.",
            "Spoon Lickers is a great ice cream shop with non-dairy options. Yesterdog has delicious food.",
            "There are students events, but not at night or during the weekends. ArtPrize in Grand Rapids is fun.",
            "It is not a strong Catholic school, and fairly free thinking for a religious school.",
            "The professors are amazing and care, but the student life is a little dead, the administration is too controlling, and there is nothing going on for the weekends. They need visitor parking and better housing opportunities."
        ]
    ],
    "pageTitle": "Aquinas College - Michigan Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Aquinas-College-Michigan/reviews?_escaped_fragment_=/show/8757",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042982502.13/warc/CC-MAIN-20150728002302-00024-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 886098115,
    "recordOffset": 886058686,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{72795=Aquinas is a Catholic College. We have mass. Everyone is welcome to attend. I live in St.Joseph's hall and we have a haunted house in October for Halloween. It's awesome! I love the gym! It's open and spacious. Mass on wednesdays, saturdays, and sundays. Adoration. Prayer at 3pm at touch down Mary., 170851=© 2015, Cappex.com, LLC}",
    "textBeforeTable": "07/21/2009 Reviewer is A past student here. 9 out of 10 people found this review useful. 1 of 38 Aaron from Grand Rapids, MI Check out reviews left by other students or leave your own review. You could win a free scholarship. Aquinas College - Michigan Reviews Aquinas College - Michigan › Michigan › By State › Colleges › } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.create', -->",
    "textAfterTable": "Tips for prospective students Get involved with any clubs you are interested in, this will really help you enjoy your experience. Bang for the buck The education here is great and you can really tell the teachers care for you. It is a little bit more expensive to attend here but the small classes are really worth it. The teachers learn your name really quickly and it creates an atmosphere that encourages participation in the class. Am enjoying being here There is always something to do at Aquinas; either going downtown or hanging our around the cafe. The clubs that are offered here are great and cover so many bases. I run cross country and track, and the teammates have become my family, and it was thanks to joining the club. It has a very relaxing atmosphere and I can't think of a better place to go to. Am learning a lot The teachers here are really focused on helping students learn and are always open to discuss any problems you have. Also, the classes are stimulating and very interesting. Classes are small and everyone knows each other in the class and this helps people be able to talk during class",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}