{
    "relation": [
        [
            "Condition:",
            "Circa:",
            "Country of Origin:"
        ],
        [
            "New",
            "2004",
            "Italy"
        ],
        [
            "Brand:",
            "Type:",
            ""
        ],
        [
            "Ricardo Pietro",
            "Acoustic",
            ""
        ]
    ],
    "pageTitle": "",
    "title": "",
    "url": "http://www.ebay.ca/itm/Fine-Italian-Violin-labeled-Ricardo-Pietro-c-2004-4-4-old-antique-model-violino-/251046944829?pt=LH_DefaultDomain_2&hash=item3a7390603d",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042982502.13/warc/CC-MAIN-20150728002302-00234-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 409215631,
    "recordOffset": 409174647,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Item specifics View all revisions Last updated on  Apr 23, 2012 23:51:12 EDT  Seller assumes all responsibility for this listing. 251046944829 eBay item number: Shipping and payments Description current Report item - opens in a new window or tab Covers your purchase price and original shipping. Get the item you ordered or get your money back. Money Back Guarantee  | See details - opens in a new window",
    "textAfterTable": "  Very nice Italian violin made in 2004 by Ricardo Pietro.   We just got this amazing master Italian violin from an estate. This violin is like brand new! No wears and scratch at all! This is a 4/4 size violin with body lenght of 358mm. No damage can be found on this masterpiece. Strings, bridge, pegs has been freshly made. This violin will be suitable for professional players or soloist. The sound is amazingly wide open, great projection, very precise on every strings. Can a a marvelous volume when you push it or can deliver a very tender sweet voice with you play it gently... A real master violin! Nice medium/dark brown varnish with gentle antique finish. The F holes are amazingly well made, same thing for the inlays. fully lined and 4 corner blocked. The violin seems to been made following Guarneri with his particular F holes and arch on top and back.",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}