{
    "relation": [
        [
            "Season",
            "2001",
            "2002",
            "2003",
            "2004",
            "2005",
            "2006",
            "2007",
            "2008"
        ],
        [
            "Team",
            "Maryland",
            "N.C. State",
            "Florida State",
            "Virginia Tech",
            "Virginia Tech",
            "Wake Forest",
            "Virginia Tech",
            "Virginia Tech"
        ],
        [
            "Rank",
            "11",
            "12",
            "11",
            "10",
            "7",
            "18",
            "9",
            "15"
        ]
    ],
    "pageTitle": "BulldogBlitz.com - Improved offense key to Hokies' title hopes",
    "title": "",
    "url": "https://mississippistate.rivals.com/content.asp?CID=969126",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042991076.30/warc/CC-MAIN-20150728002311-00328-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 872772791,
    "recordOffset": 872752413,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{1936=Rivals.com is your source for: College Football | Football Recruiting | College Basketball | Basketball Recruiting | College Baseball | High School | College Merchandise Site-specific editorial/photos © 2006 BulldogBlitz.com. All rights reserved. This website is an officially and independently operated source of news and information not affiliated with any school or team. About | Advertise with Us | Contact | Privacy Policy | About our Ads | Terms of Service | Copyright/IP policy | Yahoo! Sports - NBC Sports Network Statistical information ©2014 STATS LLC All Rights Reserved.}",
    "TableContextTimeStampAfterTable": "{40108=July 27, 2009, 42920=The reason is easy to explain. USC has claimed a national title, a 4-1 bowl record and five top-five finishes during that span. Texas has a national championship, a 5-0 bowl mark and three top-five finishes. Virginia Tech has gone 2-3 in bowls and hasn't finished higher than seventh in the Associated Press poll. In fact, no ACC team has ended a season in the top five since Florida State delivered the last of its 14 consecutive top-five finishes in 2000. (The Seminoles joined the conference in 1992.), 54119=Much of the responsibility for an upgraded offense falls on the shoulders of Tyrod Taylor, who has struggled as a passer since signing with the Hokies as the No. 1 dual-threat quarterback in the 2007 recruiting class. Taylor's running ability has given opposing defenses fits, but he threw seven interceptions and only two touchdown passes last season., 48075=South Carolina buried N.C. State 34-0 on the opening night of the 2008 season. Two nights later, Alabama embarrassed Clemson 34-10 at the Georgia Dome. Clemson never quite recovered from that nationally televised pratfall.}",
    "textBeforeTable": "Virginia Tech heads into the season with a chance to give the ACC its first legitimate national title contender since the end of Florida State's dynasty. Florida State finished in the top five of the season-ending Associated Press poll every year from 1987 to 2000, but no ACC team has finished in the top five since. Here's a look at the highest-ranked ACC team in the final AP poll each of the past eight years. SEEKING A CONTENDER \"A lot of people expect us to be better than we were last year,\" Virginia Tech tight end Greg Boone said. \"We also expect to be better.\" The Hokies have won two consecutive ACC championships and enter the season as an overwhelming favorite to do it again. In the preseason media poll released Monday, 69 of the 87 voters (79 percent) picked Virginia Tech to win the league title. Now that they have earned a reputation as the ACC's dominant program, the Hokies are ready to become more of a player in the national title chase. This could be the year it happens. \"[Beamer] hangs around so close,\" Florida State coach Bobby Bowden said. \"I equate it to putting. He's lipped out so many times. One of them is going to fall here before",
    "textAfterTable": "They'll have an early chance to prove it. Virginia Tech opens the season Sept. 5 against Alabama at the Georgia Dome. The nationally televised showcase against a Southeastern Conference heavyweight gives the Hokies a chance to make an immediate statement. If they win, they establish themselves as a legitimate national title contender. If they lose, they could get written off as one more ACC team that couldn't hack it on a national stage. Frankly, this game might mean as much to the ACC as it does to the Hokies. Even though the ACC split its 12 games with SEC opponents last year, the ACC has hurt its national stature by losing early season showdowns with the SEC. South Carolina buried N.C. State 34-0 on the opening night of the 2008 season. Two nights later, Alabama embarrassed Clemson 34-10 at the Georgia Dome. Clemson never quite recovered from that nationally televised pratfall. Virginia Tech knows the feeling well. Two years ago, the Hokies lost 48-7 at LSU in the second week of the season. The Hokies insist they have learned from that experience. \"We were comfortable where we were at two years ago,\" Boone said. \"I don't think in the game of football you can ever be comfortable. We went down there expecting to",
    "hasKeyColumn": true,
    "keyColumnIndex": 1,
    "headerRowIndex": 0
}