{
    "relation": [
        [
            "Product",
            "miRBase Profiler Plate 11 miScript miRNA PCR Array",
            "miRBase Profiler Plate 11 miScript miRNA PCR Array"
        ],
        [
            "Species",
            "Human",
            "Mouse"
        ],
        [
            "Technology",
            "miScript miRNA PCR Array",
            "miScript miRNA PCR Array"
        ],
        [
            "Cat. No.",
            "MIHS-411Z",
            "MIMM-461Z"
        ]
    ],
    "pageTitle": "Immune Disorders Arrays and Assays",
    "title": "",
    "url": "http://sabiosciences.com/ArrayList.php?disease=IMMUNE&sdisease=Asthma",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 325,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042991076.30/warc/CC-MAIN-20150728002311-00048-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 207769567,
    "recordOffset": 207730357,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "miRBase Profiler Plate 11 MIMM-460Z miScript miRNA PCR Array Mouse miRBase Profiler Plate 10 miScript miRNA PCR Array    MIHS-410Z miScript miRNA PCR Array Human miRBase Profiler Plate 10 miScript miRNA PCR Array    Cat. No. Technology Species Product miRBase Profiler Plate 10 MIBT-659Z miScript miRNA PCR Array Cow miRBase Profiler Plate 9 miScript miRNA PCR Array    MIMM-459Z miScript miRNA PCR Array Mouse miRBase Profiler Plate 9 miScript miRNA PCR Array    MIHS-409Z miScript miRNA PCR Array Human miRBase Profiler Plate 9 miScript miRNA PCR Array    Cat. No.",
    "textAfterTable": "miRBase Profiler Plate 12 Product Species Technology Cat. No. miRBase Profiler Plate 12 miScript miRNA PCR Array    Human miScript miRNA PCR Array MIHS-412Z miRBase Profiler Plate 12 miScript miRNA PCR Array    Mouse miScript miRNA PCR Array MIMM-462Z miRBase Profiler Plate 13 Product Species Technology Cat. No. miRBase Profiler Plate 13 miScript miRNA PCR Array    Human miScript miRNA PCR Array MIHS-413Z miRBase Profiler Plate 13 miScript miRNA PCR Array    Mouse miScript miRNA PCR Array MIMM-463Z miRBase Profiler Plate 14",
    "hasKeyColumn": true,
    "keyColumnIndex": 1,
    "headerRowIndex": 0
}