{
    "relation": [
        [
            "type",
            "FR Doc.",
            "RIN",
            "Docket No."
        ],
        [
            "regulations.gov",
            "2015-01952",
            "0648-BC09",
            "120328229-5064-03"
        ]
    ],
    "pageTitle": "50 CFR Part 635, Subpart E - International Port Inspection | LII / Legal Information Institute",
    "title": "",
    "url": "https://www.law.cornell.edu/cfr/text/50/part-635/subpart-E",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042991076.30/warc/CC-MAIN-20150728002311-00018-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 913216191,
    "recordOffset": 913190148,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{1016=Title 50 published on 2014-10-01}",
    "TableContextTimeStampAfterTable": "{32012=This final rule establishes opening dates and adjusts quotas for the 2015 fishing seasons for the Atlantic commercial shark fisheries. The quota adjustments are based on over- and/or underharvests experienced during 2014 and previous fishing seasons. In addition, NMFS establishes season opening dates based on adaptive management measures to provide, to the extent practicable, fishing opportunities for commercial shark fishermen in all regions and areas. These actions could affect fishing opportunities for commercial shark fishermen in the northwestern Atlantic Ocean, including the Gulf of Mexico and Caribbean Sea., 69990=This proposed rule would implement Draft Amendment 6 to the 2006 Consolidated Highly Migratory Species (HMS) Fishery Management Plan (FMP). Management measures in this proposed rulemaking are designed to respond to the problems facing Atlantic commercial shark fisheries, such as commercial landings that exceed the quotas, declining numbers of fishing permits since limited access was implemented, complex regulations, derby fishing conditions due to small quotas and short seasons, increasing numbers of regulatory discards, and declining market prices. The primary goal of Amendment 6 to the 2006 Consolidated HMS FMP (Amendment 6) is to implement management measures for the Atlantic shark fisheries that will achieve the objectives of increasing management flexibility to adapt to the changing needs of the Atlantic shark fisheries, and achieve optimum yield while rebuilding overfished shark stocks and ending overfishing. Specifically, this action proposes: Adjusting the large coastal sharks (LCS) retention limit for shark directed Limited Access Permit (LAP) holders; creating sub-regional quotas in the Atlantic and Gulf of Mexico regions for LCS and small coastal sharks (SCS); modifying the LCS and SCS quota linkages; establishing total allowable catches (TACs) and adjusting quotas for non-blacknose SCS in the Atlantic and Gulf of Mexico regions based on the results of the 2013 stock assessments for Atlantic sharpnose and bonnethead sharks; and modifying upgrading restrictions for shark permit holders. The proposed measures could affect commercial shark fishermen fishing in the Atlantic Ocean including the Gulf of Mexico and Caribbean Sea., 17472=NMFS is transferring 21 metric tons (mt) of Atlantic bluefin tuna (BFT) quota from the General category December 2015 subquota period to the January 2015 subquota period (from January 1 through March 31, 2015, or until the available subquota for this period is reached, whichever comes first). NMFS also is adjusting the Atlantic tunas General category BFT daily retention limit for the January 2015 subquota period to three large medium or giant BFT from the default retention limit of one. This action is based on consideration of the regulatory determination criteria regarding inseason adjustments and applies to Atlantic tunas General category (commercial) permitted vessels and Highly Migratory Species (HMS) Charter/Headboat category permitted vessels when fishing commercially for BFT., 43059=NMFS is closing the fisheries for commercial aggregated LCS and hammerhead sharks in the Atlantic region. This action is necessary because the commercial landings of Atlantic aggregated LCS for the 2014 fishing season have reached 80 percent of the available commercial quota as of November 14, 2014, and the fisheries are quota-linked under current regulations., 51004=§ 1802 - Definitions, 22981=NMFS is closing fishing for the commercial porbeagle shark quota until further notice. This action is necessary because, as of December 10, 2014, the commercial landings of porbeagle sharks during the 2014 fishing season exceeded the available 2014 adjusted commercial quota and to an extent that makes 2015 commercial quota unavailable., 55702=This proposed rule would adjust the 2015 fishing season quotas for North and South Atlantic swordfish based upon 2014 commercial quota underharvests and international quota transfers consistent with International Commission for the Conservation of Atlantic Tunas (ICCAT) Recommendations 13-02 and 13-03. This proposed rule would apply to commercial and recreational fishing for swordfish in the Atlantic Ocean, including the Caribbean Sea and Gulf of Mexico. This action would implement ICCAT recommendations, consistent with the Atlantic Tunas Convention Act (ATCA), and would further domestic management objectives under the Magnuson-Stevens Fishery Conservation and Management Act (Magnuson-Stevens Act)., 36494=This final rule implements Amendment 7 to the 2006 Consolidated Atlantic Highly Migratory Species Fishery Management Plan (2006 Consolidated HMS FMP) to ensure sustainable management of bluefin tuna consistent with the 2006 HMS FMP and address ongoing management challenges in the Atlantic bluefin tuna fisheries. This final rule also implements minor regulatory changes related to the management of Atlantic HMS. Amendment 7 management measures were developed by NMFS under the authority of the Magnuson-Stevens Fishery Conservation and Management Act (Magnuson-Stevens Act) and the Atlantic Tunas Convention Act (ATCA). This final rule: Allocates U.S. bluefin tuna quota among domestic fishing categories; implements measures applicable to the pelagic longline fishery, including Individual Bluefin Quotas (IBQs), two new Gear Restricted Areas, closure of the pelagic longline fishery when annual bluefin tuna quota is reached, elimination of target catch requirements associated with retention of incidental bluefin tuna in the pelagic longline fishery, mandatory retention of legal-sized bluefin tuna caught as bycatch, expanded monitoring requirements, including electronic monitoring via cameras and bluefin tuna catch reporting via Vessel Monitoring System (VMS), and transiting provisions for pelagic and bottom longline vessels; requires VMS use and reporting by the Purse Seine category; changes the start date of the Purse Seine category from July 15 to a date within a range of June 1 to August 15, to be established by an annual action; requires use of the Automated Catch Reporting System by the General and Harpoon categories; provides additional flexibility for inseason adjustment of the General category quota and Harpoon category retention limits; and changes the allocation of the Angling category Trophy South subquota for the Gulf of Mexico. Finally, this rule implements several measures not directly related to bluefin tuna management, including a U.S. North Atlantic albacore tuna quota; modified rules regarding permit category changes; and minor changes in the HMS regulations for administrative or clarification purposes., 11968=On December 2, 2014, NMFS published the final rule for Amendment 7 to the 2006 Consolidated HMS FMP (Amendment 7) to ensure sustainable management of bluefin tuna consistent with the 2006 HMS FMP and address ongoing challenges in the Atlantic bluefin tuna fisheries. The regulations implemented by the final rule require that an owner or operator of a commercial vessel permitted or required to be permitted in the Atlantic Tunas Longline category and that has pelagic longline gear on board that vessel, have installed, operate, and maintain an electronic monitoring (EM) system on the vessel. To enable vessels to comply with the EM requirements, NMFS is scheduling dates and locations for installation of, and training on the operation of, EM equipment on up to 135 vessels that were deemed eligible for initial bluefin tuna quota shares in Amendment 7. Although most Amendment 7 measures are effective as of January 1, 2015, the final rule specifies that EM installation must be completed by June 1, 2015, to fish with pelagic longline gear after that date. Therefore, in this notice NMFS is scheduling EM installations between January 1 and June 1, 2015. Pursuant to Amendment 7, NMFS is also providing information about the EM installation process., 50904=§ 1801 - Findings, purposes and policy, 51086=§ 1803 - Authorization of appropriations, 3176=NMFS is adjusting the Atlantic bluefin tuna (BFT) Purse Seine and Reserve category quotas for 2015, based on regulations implementing Amendment 7 to the 2006 Consolidated Highly Migratory Species Fishery Management Plan., 47510=NMFS is hereby making technical amendments to our regulations without altering the substance of the regulations. These changes will make our rules more internally consistent and easier to use. As a result of reorganizing 50 CFR part 622 in a previously published final rule (September 19, 2013), two cross-references in 50 CFR part 635 are no longer accurate. This final rule only corrects the outdated cross-references. The rule does not make any substantive change to the regulations governing Atlantic Highly Migratory Species (HMS) or to species managed by NMFS' Southeast Regional Office (SERO)., 27241=NMFS will host two public webinars to provide the opportunity to explain management measures and effective dates in the final rule for Amendment 7 to the 2006 Consolidated Highly Migratory Species (HMS) Fishery Management Plan (FMP) (Amendment 7), which published December 2, 2014. The measures in the final rule took action to reduce and account for bluefin dead discards in all categories; optimize fishing opportunities in all categories within the U.S. quota; enhance reporting and monitoring; and adjust other management measures as necessary, 7538=This action corrects a typographical error that appeared in the final rule implementing Amendment 7 to the 2006 Consolidated Atlantic Highly Migratory Species Fishery Management Plan (2006 Consolidated HMS FMP) that published in the Federal Register on December 2, 2014 (79 FR 71510). Specifically, this rule corrects one of the coordinates in the definition of the Cape Hatteras Gear Restricted Area (GRA) to make the geographic area in the definition match the geographic area analyzed and identified in all of the Amendment 7 documents.}",
    "lastModified": "Thu, 26 Feb 2015 12:26:10 GMT",
    "textBeforeTable": "Additional Documents GPO FDSys XML | Text 80 FR 7547 - Atlantic Highly Migratory Species; Atlantic Bluefin Tuna Fisheries 2015-02-11; vol. 80 # 28 - Wednesday, February 11, 2015 For a complete list of all Rules, Proposed Rules, and Notices view the Rulemaking tab. The following are only the Rules published in the Federal Register after the published date of Title 50. Title 50 published on 2014-10-01 § 635.53 — Reports. § 635.52 — Vessels subject to inspection. § 635.51 — Authorized officer. § 635.50 — Basis and purpose. next prev | Rulemaking Authorities (U.S. Code) Updates",
    "textAfterTable": "DEPARTMENT OF COMMERCE, National Oceanic and Atmospheric Administration Temporary rule; annual adjustment of Atlantic bluefin tuna Purse Seine and Reserve category quotas. Effective February 10, 2015 through December 31, 2015. 50 CFR Part 635 Summary NMFS is adjusting the Atlantic bluefin tuna (BFT) Purse Seine and Reserve category quotas for 2015, based on regulations implementing Amendment 7 to the 2006 Consolidated Highly Migratory Species Fishery Management Plan. 2015-02-04; vol. 80 # 23 - Wednesday, February 4, 2015 80 FR 5991 - Atlantic Highly Migratory Species; 2006 Consolidated Atlantic Highly Migratory Species (HMS) Fishery Management Plan; Amendment 7; Correction GPO FDSys XML | Text Additional Documents type regulations.gov FR Doc. 2015-01952 RIN 0648-BC09 Docket No. 120328229-5064-03",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}