{
    "relation": [
        [
            "Categories",
            "Food and Dining",
            "Academic Rigor",
            "In three sentences"
        ],
        [
            "Comments",
            "wynee's bistro is amazing!",
            "it is a baccalaureate program. classes are mostly hands-on. small class sizes.",
            "a very welcoming campus! staff and students are all outgoing and ready to help you! i can't wait to attend in the fall! :)"
        ]
    ],
    "pageTitle": "Florida Southern College Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Florida-Southern-College/reviews?_escaped_fragment_=/show/21409",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042991076.30/warc/CC-MAIN-20150728002311-00071-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 912713051,
    "recordOffset": 912646097,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{134320=The food and dining options were plentiful when I took a tour in Spring 2012. Clean areas and plenty of seating for students and staff. The main dining area has great sceneries outside the window as you dine with friends., 307529=© 2015, Cappex.com, LLC, 55575=There are over 70 more non-greek clubs to join. They have an American Sign Language club, foreign debate team, a non-denominational worship group, Young Democrats and Republican committees, as well as many other interest groups, volunteer groups that as a whole have donated over 32000 hours of service this year alone such as American Red Cross, Habitat for Humanity, To Write Love On Her Arms, TzeDek, Up Till Dawn and Best Buddies. There are also 23 honor societies not including professional societies and extracurricular clubs. There are also dance teams, horn clubs, international student organization the AMSA pre-professional society, student government, and ACE. It is virtually impossible not to find a club with an interest of yours.}",
    "textBeforeTable": "08/07/2009 Reviewer is A current student here. 27 out of 28 people found this review useful. 1 of 68 Jasmine from Lakeland, FL Check out reviews left by other students or leave your own review. You could win a free scholarship. Florida Southern College Reviews Florida Southern College › Florida › By State › Colleges › } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.create', -->",
    "textAfterTable": "Am learning a lot The staff of Florida Southern are so helpful and passionate about the students' endeavors, it's a breath of fresh air. Not only would you learn in the classroom, but there are so many other opportunities for students to grow and become active members of society. Login to rate or flag the reviews Cori from Mulberry, FL 01/07/2012 Reviewer is A current student here. 13 out of 13 people found this review useful. 2 of 68 Categories Comments Campus Safety The campus is completely safe and to make it extra safe we are given button that, when pressed on both sides, set off alarms and immediately alert the campus security to your live GPS location and shows your picture and basic info. So, if an emergency ever happens (and I'm nearly 100% sure it hasn't- if it did, everyone would know since it is a small campus) you will have security there in very little time. Besides emergencies and general safety, security has golf carts",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}