{
    "relation": [
        [
            "Count",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1"
        ],
        [
            "Component",
            "",
            "",
            "",
            "",
            "",
            "",
            ""
        ],
        [
            "DateTime",
            "2005-01-01T00:00:00",
            "2005-01-01T00:00:00",
            "2005-01-01T00:00:00",
            "2005-01-01T00:00:00",
            "2006-01-01T00:00:00",
            "2008-01-25T00:00:00",
            "2009-07-14T00:00:00"
        ],
        [
            "Description",
            "The ABGPS, inertial measurement unit (IMU), and raw scans are collected during the LiDAR aerial survey. The ABGPS monitors the xyz position of the sensor and the IMU monitors the orientation. During the aerial survey laser pulses reflected from features on the ground surface are detected by the receiver optics and collected by the data logger. GPS locations are based on data collected by receivers on the aircraft and base stations on the ground. The ground base stations are placed no more than 35 km radius from the flight survey area. Process date for Carter Creek is 2006.",
            "The ABGPS, IMU, and raw scans are integrated using proprietary software developed by the Leica Geosystems and delivered with the Leica ALS50 System. The resultant file is in a LAS binary file format. The LAS file version 1.0 format can be easily transferred from one file format to another. It is a binary file format that maintains information specific to the LiDAR data (return#, intensity value, xyz, etc.). The resultant points are produced in the State Plane Florida West coordinate system, with units in feet and referenced to the NAD83 horizontal datum and NAVD88 vertical datum. Process date for Carter Creek is 20060726.",
            "The unedited data are classified to facilitate the application of the appropriate feature extraction filters. A combination of proprietary filters is applied as appropriate for the production of bare earth digital terrain models (DTMs). Interactive editing methods are applied to those areas where it is inappropriate or impossible to use the feature extraction filters, based upon the design criteria and/or limitations of the relevant filters. These same feature extraction filters are used to produce elevation height surfaces. Process date for Carter Creek is 20060802.",
            "Filtered and edited data are subjected to rigorous QA/QC according to the 3001 Inc. Quality Control Plan and procedures. Very briefly, a series of quantitative and visual procedures are employed to validate the accuracy and consistency of the filtered and edited data. Ground control is established by 3001, Inc. and GPS-derived ground control points (GCPs) points in various areas of dominant and prescribed land cover. These points are coded according to land cover, surface material and ground control suitability. A suitable number of points are selected for calculation of a statistically significant accuracy assessment as per the requirements of the National Standard for Spatial Data Accuracy. A spatial proximity analysis is used to select edited lidar data points within a specified distance of the relevant GCPs. A search radius decision rule is applied with consideration of terrain complexity, cumulative error and adequate sample size. Accuracy validation and evaluation is accomplished using proprietary software to apply relevant statistical routines for calculation of Root Mean Square Error (RMSE) and the National Standard for Spatial Data Accuracy (NSSDA) according to Federal Geographic Data Committee (FGDC) specifications. Process date for Carter Creek is 20060807-20060914.",
            "The LiDAR mass points were delivered in American Society for Photogrammetry and Remote Sensing LAS 1.0 format. The header file for each dataset is complete as define by the LAS 1.0 specification. In addition the following fields are included: Flight Date Julian, Year, and Class. The LAS files do not include overlap. The data was classified as follows: Class 1 = Unclassified. This class includes vegetation, buildings, noise etc. Class 2 = Ground Class 3 = Water The datasets were delivered in the Districts standard 5000' by 5000' tiling scheme. The tiles are contiguous and do not overlap. The tiles are suitable for seamless topographic data mosaics that include no \"no data\" areas. The names of the tiles are left padded with zeros as required to achieve a five character length and all files utilize the LAS file extension. The South Peace LiDAR Survey was filtered and edited using LiDAR profiles, aerial imagery, and stereo pairs that were created from LiDAR intensity images. The South Peace LiDAR datasets have gone through extensive QC procedures by 3001 and the Southwest Florida Water Management District. During the QC, 3001 used the following principals to guide their filtering, editing, and QC decisions: All of the data sets were reviewed and the breaklines were created using stereo pairs that were generated from the GeoCue LiDARgrammetry software. In addition, imagery was used during the editing / and breakline creation processes and during the final review of the data sets. If the imagery and the LiDAR did not agree, 3001 used the LiDAR profiles as a guide in areas where the profiles were adequate. In areas where the point density was not sufficient enough to use as a guide, 3001 relied on the imagery and created obstruction polygons. If an area changed between the Imagery acquisition and the LiDAR acquisition, 3001 followed the LiDAR as a guide. 3001 used the LiDAR and the imagery to create breaklines. In some instances, the breaklines do not reflect the imagery due to a significant amount of rain during acquisition. The following paragraph is from the South Peace metadata. \"There was significant rain fall during the acquisition of the South Peace LiDAR survey. According to the gage at the USGS 02295637 Peace River at Zolfo Springs Florida, the gage height went from approximately 14.3 feet to 17.3 feet between February 28, 2005 and March 2, 2005. Between March 2, 2005 and March 4, 2005 the gage fell to about 15.1 feet. The changes in the channel are evident in the breaklines. In some areas there are sudden changes in the size of the channel as well as the elevation of the breaklines. Due to the inconsistencies in the channel we have created obscured polygons around the affected channels.\" In areas of dense vegetation the bare-earth surface may appear rough in nature. This is due to the scarcity of points in the area or the uneven nature of the ground. Quality Control Procedures were performed by different people and using different methods during the project. Due to this, there may be different interpretations of the bare-earth surface in areas of dense vegetation. The main difference in the surfaces is the amount of points that each editor removed from the profile to represent the ground. This does not mean that either editor was incorrect in their calculations; it means that some editors were able to describe the surface with less points. The process date for this step is 2005/2006. The process date for Carter Creek for this step is 20060921.",
            "The NOAA Coastal Services Center (CSC) received the files in LAS format. The files contained Lidar intensity and elevation measurements. The data was in Florida State Plane Projection and NAVD88 vertical datum. CSC performed the following processing to the data to make it available within the LDART Retrieval Tool (LDART): 1. The data were converted from Florida State Plane West coordinates to geographic coordinates. 2. The data were converted from NAVD88 (orthometric) heights to GRS80 (ellipsoid) heights using Geoid 99. 3. The LAS data were sorted by latitude and the headers were updated.",
            "The NOAA National Geophysical Data Center (NGDC) received lidar data files via ftp transfer from the NOAA Coastal Services Center. The data are currently being served via NOAA CSC Digital Coast at http://www.csc.noaa.gov/digitalcoast/. The data can be used to re-populate the system. The data are archived in LAS or LAZ format. The LAS format is an industry standard for LiDAR data developed by the American Society of Photogrammetry and Remote Sensing (ASPRS); LAZ is a loseless compressed version of LAS developed by Martin Isenburg (http://www.laszip.org/). The data are exclusively in geographic coordinates (either NAD83 or ITRF94). The data are referenced vertically to the ellipsoid (either GRS80 or ITRF94), allowing for the ability to apply the most up to date geoid model when transforming to orthometric heights."
        ]
    ],
    "pageTitle": "Docucomp ISO19115Components-HTMLTable",
    "title": "",
    "url": "http://www.ngdc.noaa.gov/docucomp/page?xml=NOAA/NESDIS/NGDC/MGG/Lidar/iso/xml/2006_FL_SWFWMD_Peace_River_South_m77.xml&view=ISO19115Components-HTMLTable&altview=none",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042991076.30/warc/CC-MAIN-20150728002311-00000-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 614342638,
    "recordOffset": 614326244,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "MD_DataIdentification Aggregation Info | Bands | Citations | Constraints | Coverage Descriptions | Dimensions | Extents | Formats | Geographic Bounding Box Georectified Information | Georeferenceable Information | Identifiers | Instruments | Mediums | OnlineResources | Operations Platforms | Process Steps | Range Elements | Reference Systems | Responsible Parties | Series | Sources | Spatial Grids | Temporal Extents Metadata Identifier: gov.noaa.csc.maps:2006_FL_SWFWMD_Peace_River_South_m77Get DataFAQHTML, 19139 XML Assess Metadata For: Completeness, DOI Readiness, CSW Readiness, Components ISO Table ViewBack to Collection NOAA/NESDIS/NGDC/MGG/Lidar View Metadata As: , , } background-color:#F0F0F0; th{ } empty-cells:show; table{",
    "textAfterTable": "2 None 1 North American Datum 1983 2007-01-19 Top CI_Series none found Top CI_ResponsibleParty Count Component Individual Organization Position Email Role Linkage 1 resourceProvider http://www.epsg-registry.org/export.htm?gml=urn:ogc:def:crs:EPSG::4269 2 Citation URL ftp://ftp.csc.noaa.gov/pub/crs/beachmap/qa_docs/fl/swfwmd/Carter_Creek_survey_report.pdf 5 3001 Inc. LiDAR Manager processor 1 NOAA CSC (originator) DOC/NOAA/NOS/OCM > Office for Coastal Management, National Ocean Service, National Oceanic and Atmospheric Administration, U.S. Department of Commerce coastal.info@noaa.gov originator http://coast.noaa.gov 1 NOAA CSC (publisher) DOC/NOAA/NOS/OCM > Office for Coastal Management, National Ocean",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}