{
    "relation": [
        [
            "Benefit",
            "Part A Deductible You may need this benefit if you have to stay in the hospital. The Part A deductible for 2014 is $1,216. This amount can change every year. You have to pay this deductible for each benefit period.",
            "Part B Deductible You may want to consider this benefit if you have Medicare Part B. Each year you must pay the Part B deductible (which is $147 in 2014) before Medicare starts to pay its share. If you have this benefit, the Medigap plan would pay this amount each year.",
            "Part B Coinsurance Without this benefit, you generally pay 20% of the Medicare-approved amount for Medicare Part B covered services and supplies (like doctor services and outpatient hospital care). This benefit will help you to reduce your out of pocket after Part B deductible.",
            "365 Extra Days of Hospital Stay After you use all Medicare hospital benefits, you can receive up to 365 more days for hospital stays during your lifetime.",
            "3 Pints of Blood The first 3 pints of blood or equal amounts of packed red blood cells per calendar year, unless this blood is replaced.",
            "Part B Excess Charges Under federal law, doctors who don’t accept “assignment ” (take Medicare’s approved amount as payment in full) may charge up to 15% more than the approved amount. You might want to think about this benefit if your doctors don’t accept assignment. You may also want this benefit if you have to stay in the hospital and can’t control whether the doctors you see accept assignment.",
            "Foreign Travel Emergency If you travel outside the United States, this benefit could save you money for emergency care.",
            "Skilled Nursing Coinsurance Medicare pays for the first 20 days of a skilled nursing facility. If you need to go to a Skilled Nursing Facility (SNF) after a hospital stay and stay in the SNF longer than 20 days, this benefit begins.",
            "Home Health Care Home Health Care is skilled nursing care and certain other health care services you get in your home for the treatment of an illness or injury."
        ],
        [
            "What Plan G Covers",
            "Plan G covers 100% of the $1,216 deductible.",
            "Plan G does NOT cover the $147 Part B deductible, you must pay out of pocket.",
            "Plan G covers 100% of the 20% remainder costs",
            "Plan G covers all of the costs for an additional 365 additional hospital days",
            "Plan G covers all of the costs of 3 pints of blood per calendar year",
            "Plan G covers 100% of the excess charges",
            "Plan G covers 80% (after a $250 deductible) to a lifetime maximum benefit of $50,000.",
            "Plan G covers up to $148 per day for days 21-100.",
            "Not covered."
        ]
    ],
    "pageTitle": "Blue Cross Blue Shield of Illinois - 2014 Medicare Supplement Plans",
    "title": "",
    "url": "http://www.ilhealthagents.com/bluecross-blueshield-illinois/medicare-supplement/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042991076.30/warc/CC-MAIN-20150728002311-00218-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 503046431,
    "recordOffset": 503014017,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{95649=The following are the BCBSIL 2014 rates for Illinois residents living in Cook, DuPage, Kane, Lake, McHenry, or Will Counties:, 205636=© 2007-2015, Illinois Health Agents, Inc.}",
    "textBeforeTable": "BCBSIL Medicare Supplement Plans – Quick Comparison Table If you are seeking the most basic benefit plan with the lowest cost, BCBSIL offers Medicare Supplement Plan A. For more detailed explanations on all the available BCBSIL Medicare Supplment plans and benefits, you can Compare BCBSIL Medicare Supplement Plans. Plans K and Plan L feature cost sharing for covered services under Medicare Part A and Part B. Once your annual out-of-pocket expenses reach the required limit, the plan pays 100% of covered expenses for the remainder of the calendar year. Plan N features an office visit and emergency room copayment applicable to each visit High Deductible Plan F features a $2,140 annual deductible before plan benefits begin High Deductible Plan F, Plan K, Plan L and Plan N include cost-sharing features that allow you to save on premiums while still receiving dependable coverage. Budget-Conscious Plans Plans F also covers the Medicare Part B deductible. Of all available standardized plans, Plans F and Plan G offer the most complete protection for uncovered Medicare Part B excess charges. These are the most popular plans because they also pay the Medicare Part A hospital deductible and copayments, skilled nursing facility copayment and foreign travel emergency care. Premier Plans *Plans K and L include benefits at different levels of cost sharing (see outline of coverage). Blood – First three pints of blood each year. Medical Expenses –",
    "textAfterTable": "– – – Part B Excess (100%) – X X – – – Foreign Travel Emergency – X X – – X At Home Recovery – – – – – – Annual Out-of-Pocket Cost – $0 $0 $4,660 $2,330 $0 *Plan F also has an option called high deductible Plan F (HD-F). This high deductible plan pays the same benefits as Plan F after one has paid a calendar year $2,140 deductible. Benefits from high deductible Plan F will not begin until out-of-pocket expenses exceed $2,140. Out-of-pocket expenses for this deductible are expenses that would ordinarily be paid by the policy. These expenses include the Medicare Part A and Medicare Part B deductibles, but do not include the plan’s separate foreign travel emergency deductible. **Plans K and L provide for different cost-sharing than plans A-F. Once you reach the annual limit, the plan pays 100% of the Medicare copayments, coinsurance and deductibles for the rest of the calendar year. The out-of-pocket annual limit does NOT include charges from your provider that exceed Medicare-approved amounts, called “excess charges.” You will be responsible for paying excess charges. Part B medical excess: Charges from your provider that exceed Medicare-approved amounts. Only Plan F, High Deductible Plan F, and Plan G cover these charges. For all other plans, you are responsible for paying excess charges. In no case can a provider charge more than 115% of the Medicare approved amount. Skilled nursing",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}