{
    "relation": [
        [
            "Days",
            "30",
            "50",
            "150",
            "200"
        ],
        [
            "BSE",
            "224.02",
            "228.94",
            "238.29",
            "235.17"
        ],
        [
            "NSE",
            "224.11",
            "228.72",
            "238.01",
            "234.98"
        ]
    ],
    "pageTitle": "Pearl Global Industries Stock Price, Share Price, Live BSE/NSE, Pearl Global Industries Bids Offers. Buy/Sell Pearl Global Industries news & tips, & F&O Quotes",
    "title": "",
    "url": "http://www.moneycontrol.com/india/stockpricequote/textiles-readymade-apparels/pearlglobalindustries/HPF01?sc_did=HPF01",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042982502.13/warc/CC-MAIN-20150728002302-00181-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 574713619,
    "recordOffset": 574665664,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{203453=Pearl Global In is in the Textiles - Readymade Apparels sector. The current market capitalisation stands at Rs 481.81 crore. The company management includes Deepak Seth - Chairman, Pulkit Seth - Vice Chairman & Mng.Director, Shefali Seth - Whole Time Director, Vinod Vaish - Whole Time Director, S B Mohapatra - Ind. Non-Executive Director, Chittranjan Dua - Ind. Non-Executive Director, Rajendra K Aneja - Ind. Non-Executive Director, Anil Nayar - Ind. Non-Executive Director. It is listed on the BSE with a BSE Code of 532808 and the NSE with an NSE Code of PGIL. Its Registered office is at \"Pearl House\" A-3, Community Centre,,Naraina Industrial Area, New Delhi,Delhi - 110028. Their Registrars are Link Intime India Pvt. Ltd., 132703=28 July 2015, 133921=JSWSteel Jul Fut, 133214=UnitedBrewerie Jul Fut, 202142=Astec LifeSciences Recommended on Mar 31st 2015}",
    "textBeforeTable": "Edit Watchlist Have you invested in these stocks? You can track them better in your Portfolio close[x] Add to Watchist Account Optional Optional Optional Optional Add to Portfolio OR Add to watchlist } $('#mcpcp_addprof_info').hide(); { function close_info()",
    "textAfterTable": "Keep me signed in Forgot Password? New to Moneycontrol - Sign up now Its easy and FREE! Username Username should be atleast 4 characters Password Password should be 6 to 10 characters Confirm Password Email OR connect with LIVE",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}