{
    "relation": [
        [
            "Play Type",
            "Substitution",
            "Walk",
            "Out",
            "Double",
            "Out",
            "Out"
        ],
        [
            "Play",
            "Blake Parker starts the inning for the Cubs.",
            "Justin Morneau walked. Runner on first with none out and Wilin Rosario due up.",
            "Wilin Rosario popped out to second. Runner on first with one out and Charlie Culberson due up.",
            "Charlie Culberson doubled to left. On the play, Justin Morneau advances to third. Runners on second and third with one out and DJ LeMahieu due up.",
            "Justin Morneau caught stealing home, catcher unassisted. Runner on second with two outs and DJ LeMahieu at the plate.",
            "DJ LeMahieu struck out swinging to end the inning."
        ]
    ],
    "pageTitle": "Tuesday, July 29, 2014 Colorado Rockies - Chicago Cubs Box Scores, Game Results & Summary - USATODAY.com",
    "title": "",
    "url": "http://content.usatoday.com/sportsdata/baseball/mlb/game/Rockies_Cubs/2014/7/29",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042991076.30/warc/CC-MAIN-20150728002311-00158-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 49533307,
    "recordOffset": 49517364,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{2341=View all MLB box scores for 7/29/2014}",
    "TableContextTimeStampAfterTable": "{62467=At 6 hours and 27 minutes, it was the longest game, time-wise, in the history of both clubs. The contest didn't finish until around 1:30 a.m. local time.}",
    "textBeforeTable": "Top of the 1st Greg Gibson  3B Gerry Davis  2B Will Little  1B Phil Cuzzi  H Umpires 0.00 6 11 0 1 0 0 0 1 John Baker (W, 1-0) 2.58 11 20 2 1 0 0 0 2 Pedro Strop  3.51 19 26 3 0 0 0 1 2 James Russell  5.59 16 27 2 1 0 0 1 2 Blake Parker  3.80 11 19 1 1 0 0 0 1 Brian Schlitter  4.76 11 18 2 0 0 0 0 1 Justin Grimm  2.35 6 11 0 1 0 0 1 0.1 Wesley Wright  5.49 23 37 4 0 0 0 0 2.2 Carlos Villanueva  5.79 64 105 4 3 3 3 6 4 Edwin Jackson  ERA Strikes Pitches SO BB ER R H IP Name 4.39 \" xmlns:fo=\"http://www.w3.org/1999/XSL/Format\" />Cubs pitching http://i.usatoday.net/_common/_images/_sports/logos/mlb/cubs_22t.png 9 16 0 1 1 1 1 0.2 Tyler Matzek (L, 2-5) 2.92 20 27 1 0 0 0 1 2 LaTroy Hawkins  4.76 19 36 3 2 0 0 0 2 Nick Masset  4.57 22 36 2 1 0 0 1 1.1 Rex Brothers ",
    "textAfterTable": "Out Charlie Culberson struck out swinging to end the inning. Bottom of the 1st Play Type Play Double Emilio Bonifacio doubled to left. Runner on second with none out and Arismendy Alcantara due up. Single Arismendy Alcantara singled to left. On the play, Emilio Bonifacio advances to third. Runners on first and third with none out and Anthony Rizzo due up. Single Anthony Rizzo single to scored Emilio Bonifacio with none out. On the play, Arismendy Alcantara advances to third. Runners on first and third and Starlin Castro due up. Out Starlin Castro fouled out to first. Runners on first and third with one out and Justin Ruggiano due up. Out,stolen-base Justin Ruggiano struck out swinging. On the play, Anthony Rizzo stole second. Runners on second and third with two outs and Welington Castillo due up. Out Welington Castillo lined out to center to end the inning. Top of the 2nd Play Type Play Out DJ LeMahieu flied out to right. None on with one out and Jorge De La Rosa due up. Out Jorge De La Rosa struck out swinging. None on with two outs and Charlie Blackmon due up.",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}