{
    "relation": [
        [
            "John Alden",
            "Mary (Norris) Allerton",
            "Elinor Billington",
            "William Bradford",
            "William Brewster",
            "Mrs. James Chilton",
            "John Cooke",
            "Samuel Eaton",
            "Edward Fuller",
            "Samuel Fuller (son of Edward)",
            "Giles Hopkins",
            "Richard More",
            "Degory Priest",
            "Henry Samson",
            "Elizabeth Tilley",
            "Richard Warren",
            "Susanna White"
        ],
        [
            "Bartholomew Allerton",
            "Mary Allerton",
            "Francis Billington",
            "Love Brewster",
            "Peter Browne",
            "Mary Chilton",
            "Edward Doty",
            "Sarah Eaton",
            "Mrs. Edward Fuller",
            "Constance Hopkins",
            "Stephen Hopkins",
            "Priscilla Mullins",
            "Joseph Rogers",
            "George Soule",
            "John Tilley",
            "Peregrine White",
            "William White"
        ],
        [
            "Isaac Allerton",
            "Remember Allerton",
            "John Billington",
            "Mary Brewster",
            "James Chilton",
            "Francis Cooke",
            "Francis Eaton",
            "Moses Fletcher",
            "Samuel Fuller",
            "Elizabeth (Fisher) Hopkins",
            "John Howland",
            "William Mullins",
            "Thomas Rogers",
            "Myles Standish",
            "Joan (Hurst) Tilley",
            "Resolved White",
            "Edward Winslow"
        ]
    ],
    "pageTitle": "Pilgrims Genealogy & Ancestry Articles | GenealogyBank Blog",
    "title": "",
    "url": "http://blog.genealogybank.com/tag/pilgrims",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042982502.13/warc/CC-MAIN-20150728002302-00010-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 29566131,
    "recordOffset": 29530534,
    "tableOrientation": "VERTICAL",
    "TableContextTimeStampAfterTable": "{70165=Painting: “Mayflower in Plymouth Harbor” by William Halsall, 1882. Source: Pilgrim Hall Museum; Wikimedia Commons., 46795=Boston Herald (Boston, Massachusetts), 16 June 1957, page 61, 107742=I traveled to Leiden, Holland, several years ago to conduct first-hand research on my Mayflower Pilgrim ancestry, and found this Dutch marriage record for future Mayflower ship passengers Isaac Allerton and Mary Norris from 1611., 118963=Daily National Intelligencer (Washington, D.C.), 12 April 1821, page 3, 99112=Here is a verse from an early poem about Plymouth Rock written by Thomas Paine (1737-1809), published in 1799., 47057=Eleven years before he left England headed for America in 1620 on board the Mayflower, Hopkins left 2 June 1609 on the ship Sea Venture headed for Jamestown with supplies and a new governor for the colony. The Sea Venture hit a storm on 24 July 1609 and was shipwrecked off of Bermuda. Hopkins and others on board survived and remained for over a year on Bermuda while building a new seaworthy boat that they could use to complete their trip to Jamestown. Soon after he arrived in Jamestown, the colony was evacuated back to England., 105583=Introduction: Mary Harrell-Sesniak is a genealogist, author and editor with a strong technology background. In this guest blog post—just in time for Thanksgiving—Mary searches old newspapers to trace ancestry all the way back to the Pilgrims, who crossed the Atlantic Ocean on board the Mayflower in 1620 for a fresh start in the New World., 100829=New England Palladium (Boston, Massachusetts), 25 December 1800, page 4, 17880=The Rev. Bailey Loring (1786-1860) was a descendant of John Alden, who was a crew member on the Mayflower and one of the original settlers of Plymouth Colony. Rev. Loring’s mother was Alethea (Alden) Loring (1744-1820), and her great-grandfather was John Alden, who married Priscilla Mullins., 58160=Joseph Atwood Ordway (1852-1904) is a descendant of Mayflower passenger Thomas Rogers—and he thought so much of that genealogical fact, it was included in his obituary., 105975=Although endlessly rewarding, it is true that tracing ancestry is a time-consuming process requiring much patience—especially if one wishes to connect to the Mayflower passengers, those 102 Pilgrims who sailed from Leiden, Holland, in September 1620 bound for the New World—anchoring off Cape Cod, Massachusetts, in November 1620., 117838=Being such a small colony of settlers, the Mayflower Pilgrim’s children intermarried. As reported in this 1821 newspaper article, John Alden was a descendant of his grandfather by the same name—and also of Peregrine White, via his grandmother. He is thought to have married twice, first to Lydia Lazell and later to Rebecca Weston, although neither of his wives are mentioned in this obituary. Note how many of John Alden’s descendants were living when he died at the ripe old age of 103., 97343=Plymouth Rock, a large boulder on the edge of Plymouth Harbor, Massachusetts, is traditionally identified as the place where the Pilgrims first stepped ashore from the Mayflower in 1620 to found Plymouth Colony., 115781=Although not my Mayflower ancestor, I’m fascinated by Peregrine White. He was the son of William and Susanna White, who crossed the ocean on the Mayflower with his older brother Resolved. Susanna was pregnant with Peregrine during the Atlantic crossing, and he became the first Plymouth Colony baby of English ancestry when he was born on 20 November 1620 on board the Mayflower in Provincetown Harbor. (See http://en.wikipedia.org/wiki/Peregrine_White.), 106840=Painting: Mayflower in Plymouth Harbor, William Halsall, 1882. Credit: Pilgrim Hall Museum & Wikipedia., 48981=So in 1620 he left along with 130 +/- other passengers and crew on the Mayflower to make the 66-day trip to America. It is estimated that today there are as many as 30 million Americans who are Mayflower descendants, although most are unaware of their ancestral tie to the founding of the country., 117070=George Young’s lineage was noted in this 1771 obituary., 59232=Springfield Republican (Springfield, Massachusetts), 6 May 1904, page 12, 108573=Marriage certificate for future Mayflower passengers Isaac Allerton and Mary Norris, 1611, from the collection of Mary Harrell-Sesniak, 47952=Stephen Hopkins picked up critical skills and experience on that ill-fated 1609 voyage. He was one of the few Mayflower Pilgrims with experience at sea. He had survived a shipwreck, and knew what it took to be resourceful in extreme conditions in order to build a seaworthy ship to continue the voyage to America., 48291=Perhaps the most critical skill he learned in 1609-1610 was to speak multiple Native American languages. He gained invaluable experience in getting to know and work with Native Americans. This experience would be pivotal 10 years later when the Pilgrims worked with Squanto and the local Native Americans in Plymouth Colony., 71743=Photo: USS Plymouth Rock underway, 8 April 1963. Source: Wikipedia., 119089=Elder James White, who founded the Seventh Day Adventist Church in Battle Creek, Michigan, was another direct descendant of the Mayflower Pilgrims. His religious affiliation and his Mayflower ancestry were reported in this 1881 newspaper obituary., 90241=Daily News Record (Harrisonburg, Virginia), 3 October 2012, 90406=According to this obituary, not only was Mary-Jane a descendant of Thomas Rogers—but “She published a book on Thomas Rogers, Mayflower Pilgrim, in 1980.”, 88204=Having studied this for the past 50 years, I’ve concluded that nearly all Americans with ancestral roots prior to 1820 that lived in upper New England (Massachusetts, Vermont, New Hampshire, Maine and probably Rhode Island) have at least one ancestor that came over on the Mayflower., 122403=We are in good company. By 1909, one writer’s conservative estimate calculated that by the 10th generation, any of the Mayflower ship passengers could have had at least 3,500,000 descendants! Since most Mayflower descendants are now of the 13th, 14th, 15th or 16th generation, that number has skyrocketed., 122743=The rising number of Mayflower Pilgrim descendants is reported in this 1909 newspaper article., 119966=Kalamazoo Gazette (Kalamazoo, Michigan), 9 August 1881, page 1, 99856=Federal Observer (Portsmouth, New Hampshire), 4 January 1799, page 4, 121113=Jackson Citizen Patriot (Jackson, Michigan), 17 July 1915, page 1, 77237=You can read Jack’s obituary in the Eagle Tribune (Lawrence, Massachusetts) 2 November 2011., 37343=I didn’t realize that the Mayflower had such a difficult time when the Pilgrims crossed the Atlantic in 1620., 46911=Well, it wasn’t exactly a vacation—but Pilgrim Stephen Hopkins lived on the island of Bermuda for over a year, from 1609 to 1610., 76755=…after their own house burned. John Howland died in 1674 and Elizabeth lived there until the house was sold in 1680 and Jabez Howland moved to Rhode Island. Elizabeth moved to the home of her daughter, Lydia (Howland) Browne, in Swansea, where she died in 1687., 123475=Duluth News-Tribune (Duluth, Minnesota), 18 December 1909, page 8, 117722=Boston Post-Boy (Boston, Massachusetts), 13 May 1771, page 3, 4230=Governor William Bradford’s (ca. 1590-1657) handwritten Of Plymouth Plantation is well known to genealogists as the earliest journal history of the Mayflower passengers, their voyage across the Atlantic, and the settlement in Plymouth Plantation., 71938=He took particular pleasure in recreating the journey of his ancestor, John Howland, back to Plymouth in 2003 aboard the shallop Elizabeth Tilley. In 2010 he was awarded the Lura Sellew Medal, the highest honor that the Pilgrim John Howland Society bestows for service to the organization and the memory of the pilgrim John Howland., 99980=GenealogyBank has many newspaper articles reporting on Plymouth Rock celebrations over the years, including the 1820 celebration of the 200th anniversary of the Pilgrims’ landing., 28890=Omaha World Herald (Omaha, Nebraska), 21 May 1897, page 10, 78373=Eagle Tribune (Lawrence, Massachusetts), 2 November 2011, 116912=One of your relatives is their grandson George Young (1689-1771), son of their daughter Sarah White (1663-1755) and Thomas Young (1663-1732)., 38033=Boston Herald (Boston, Massachusetts), 25 November 1970, page 26, 19140=Boston Recorder (Boston, Massachusetts), 10 May 1860, page 75, 120361=For example, Ellen Gould Harmon was the spouse of Elder James White—and her obituary from 1915 makes more notice of his roots than her own., 91713=Note: FamilySearch International (FamilySearch.org) and GenealogyBank yesterday announced an agreement to make over a billion records from historical obituaries searchable online. The tremendous undertaking will make a billion records from over 100 million U.S. newspaper obituaries readily searchable online. The newspapers are from all 50 states and cover the period 1730 to the present.  Find out more at: http://www.genealogybank.com/family-search/}",
    "lastModified": "Tue, 28 Jul 2015 19:51:33 GMT",
    "textBeforeTable": "Start at the top of your family tree by looking for surnames matching Mayflower passengers, shown on the accepted list of eligible ancestors compiled by Pilgrim lineage societies, most notably the General Society of Mayflower Descendants (www.themayflowersociety.com/). Approved List of Mayflower Ship Passengers Common genealogical advice suggests that you start your family history research with yourself and work backwards to prove ancestry. However, with Mayflower genealogy research, you might want to work “down the research ladder,” instead of up, as it could very well save you a few steps. However, as I say, you don’t need to travel to research your Mayflower Pilgrim ancestry—you can do it from the comfort of your own home, relying on your computer and the Internet, using several helpful websites and having access to online historical newspapers. Marriage certificate for future Mayflower passengers Isaac Allerton and Mary Norris, 1611, from the collection of Mary Harrell-Sesniak I traveled to Leiden, Holland, several years ago to conduct first-hand research on my Mayflower Pilgrim ancestry, and found this Dutch marriage record for future Mayflower ship passengers Isaac Allerton and Mary Norris from 1611. Tragically, only half the Plymouth Rock settlers survived their first winter in the New World—and if any are your progenitors, you could conceivably be required",
    "textAfterTable": "Publications by the General Society of Mayflower Descendants And if that surname research strategy fails, research Mayflower descendants to the fifth generation to try and find a match to your family. Many publications exist, including the famous pink or gray Pilgrim lineage books published by the General Society of Mayflower Descendants—many of which are available at libraries. As accepted references, these Society publications allow you to bypass submitting proofs for any Mayflower descendant they’ve already established. Credit: from the library of Mary Harrell-Sesniak The silver books trace the first five generations of Mayflower descendants. The smaller pink books are Mayflower Families in Progress (MFIP), and are produced as new information becomes available. Newspaper Evidence for Peregrine (or Peregrin) White and His Descendants An extraordinary amount of newspaper articles and obituaries mentioning Mayflower ancestry exist in GenealogyBank’s historical newspaper archives. Although not my Mayflower ancestor, I’m fascinated by Peregrine White. He was the son of William and Susanna White, who crossed the ocean on the Mayflower with his older brother Resolved. Susanna was pregnant with Peregrine during the Atlantic crossing, and he became the first Plymouth Colony baby of English ancestry when he was born on 20 November 1620 on board the Mayflower in Provincetown Harbor. (See http://en.wikipedia.org/wiki/Peregrine_White.) After William White died—as",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}