{
    "relation": [
        [
            "Categories",
            "Campus Safety",
            "Greek Life",
            "Clubs and Activities",
            "Great for these types of students",
            "Share any unusual traditions or locations on campus",
            "Bang for the buck",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "very safe.",
            "honestly was not a part of it but seems its the most happening part of the school.",
            "rugby as a club sport is really good.",
            "who likes to focus more on school with less distractions. agriculture and biology great place. nursing on of the best.",
            "u have the lake closer.",
            "tuition fee is rising and every semester they increase the price.",
            "hunting, that's it or join a college sports team.",
            "dining is bad. same food everyday.",
            "depends on where you stay.",
            "its pretty decent but i feel there is lot more to improve.",
            "school is good but there is nothing to do in the town. i will choose another university if the circumstances allow me.",
            "it's good school if you wants to keep the focus in in school without any distractions. very less exciting environment and boring small town."
        ]
    ],
    "pageTitle": "Arkansas State University-Main Campus Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Arkansas-State-University-Main-Campus/reviews?_escaped_fragment_=/show/19804",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042982502.13/warc/CC-MAIN-20150728002302-00020-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 865559132,
    "recordOffset": 865493916,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{71985=This is not a very expensive college, and provides many opportunities for scholarships. You will get the same learning experiences here as you will at any other college. Typically, you're looking at about a 30:1 student/teacher ratio, which is good - You're in a good classroom setting., 80891=The average cost for an ASU full-time (12 hrs) undergraduate is $2800/semester. For the courses/services offered towards the available degrees, the cost of attendance for ASU students is favorable among most., 306392=There is an arch that once marked the entrance to the college and is now the oldest structure on campus. It was donated by the Training School Class of 1927. It is said that if you walk under the Arch, you will never graduate!, 327681=© 2015, Cappex.com, LLC}",
    "textBeforeTable": "06/18/2009 Reviewer is A current student here. 37 out of 39 people found this review useful. 1 of 82 chelsea from Jonesboro, AR Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for",
    "textAfterTable": "The tuition is really cheap here at ASU compared to the two other major colleges in Arkansas (University of Arkansas and University of Central Arkansas), and the 'bang' you get for your buck greatly exceeds your buck! What you pay is small compared to what you get out of it. Am enjoying being here College life is great here. Fraternities/Sororities, Student clubs and groups, great athletic opprotunities, there really is something for everyone! Am learning a lot I am a Music Education Major at ASU-Jonesboro. I've been studying music for years, being in band in High School and Jr. High, as well as playing various instruments since elementary, but I am amazed by how much I learn every day from my music classes. Top notch teachers at ASU Login to rate or flag the reviews Brooke from Cave City, AR 12/02/2009 Reviewer is A current student here. 10 out of 10 people found this review useful. 4 of 82",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}