{
    "relation": [
        [
            "Categories",
            "Great for these types of students",
            "Share any unusual traditions or locations on campus",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "Students wanting to transfer to a 4-year university.",
            "It is neat that there is a pool hall on the main campus.",
            "Make sure you have all your ducks in order before you start school, the offices aren't very good at keeping you informed with that you need or have left to turn in.",
            "It is a decent community college. The financial aid office seems to be difficult to work with. However the education quality is satisfactory."
        ]
    ],
    "pageTitle": "Spokane Falls Community College Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Spokane-Falls-Community-College/reviews?_escaped_fragment_=/show/29396",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042991076.30/warc/CC-MAIN-20150728002311-00153-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 910244399,
    "recordOffset": 910195048,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{207964=© 2015, Cappex.com, LLC}",
    "textBeforeTable": "06/09/2009 Reviewer is Accepted here and planning to attend soon. Reviewer has been to campus. 2 out of 3 people found this review useful. 1 of 47 Bradley from Grand Coulee, WA Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID:",
    "textAfterTable": "Categories Comments Great for these types of students Any student who wants to save money and transfer to a four year College. Tips for prospective students Apply early, register for classes as soon as you can, and try to get good teachers. Bang for the buck Way cheaper then four year colleges by far and you find the exact same classes you would get at a four year school. Totally worth spending your first few years of college here. Am enjoying being here I am not too involved with extra stuff going on at the school. There is a wide array of people here though, so your bound to find people you will get along with which will make your experience here more enjoyable. Am learning a lot There are some really good teachers here if you get the right one. If you go onto ratemyprofessor.com and look up the teachers it is really helpful in choosing a good one. Also, try to talk to the people around campus about which one's they like. I've learned a lot from some of the teachers here and barely anything from others,",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}