{
    "relation": [
        [
            "Patent application number",
            "20110053941",
            "20130289083"
        ],
        [
            "Description",
            "IDO Inhibitors - Presently provided are methods for (a) modulating an activity of indoleamine 2,3-dioxygenase comprising contacting an indoleamine 2,3-dioxygenase with a modulation effective amount of a compound as described in one of the aspects described herein; (b) treating indoleamine 2,3-dioxygenase (IDO) mediated immunosuppression in a subject in need thereof, comprising administering an effective indoleamine 2,3-dioxygenase inhibiting amount of a compound as described in one of the aspects described herein; (c) treating a medical conditions that benefit from the inhibition of enzymatic activity of indoleamine-2,3-dioxygenase comprising administering an effective indoleamine 2,3-dioxygenase inhibiting amount of a compound as described in one of the aspects described herein; (d) enhancing the effectiveness of an anti-cancer treatment comprising administering an anti-cancer agent and a compound as described in one of the aspects described herein; (e) treating tumor-specific immunosuppression associated with cancer comprising administering an effective indoleamine 2,3-dioxygenase inhibiting amount of a compound as described in one of the aspects described herein; and (f) treating immunosuppression associated with an infectious disease, e.g., HIV-I infection, comprising administering an effective indoleamine 2,3-dioxygenase inhibiting amount a compound as described in one of the aspects described herein.",
            "IDO Inhibitors - Presently provided are methods for (a) modulating an activity of indoleamine 2,3-dioxygenase comprising contacting an indoleamine 2,3-dioxygenase with a modulation effective amount of a compound as described in one of the aspects described herein; (b) treating indoleamine 2,3-dioxygenase (IDO) mediated immunosuppression in a subject in need thereof, comprising administering an effective indoleamine 2,3-dioxygenase inhibiting amount of a compound as described in one of the aspects described herein; (c) treating a medical conditions that benefit from the inhibition of enzymatic activity of indoleamine-2,3-dioxygenase comprising administering an effective indoleamine 2,3-dioxygenase inhibiting amount of a compound as described in one of the aspects described herein; (d) enhancing the effectiveness of an anti-cancer treatment comprising administering an anti-cancer agent and a compound as described in one of the aspects described herein; (e) treating tumor-specific immunosuppression associated with cancer comprising administering an effective indoleamine 2,3-dioxygenase inhibiting amount of a compound as described in one of the aspects described herein; and (f) treating immunsupression associated with an infectious disease, e.g., HIV-1 infection, comprising administering an effective indoleamine 2,3-dioxygenase inhibiting amount a compound as described in one of the aspects described herein."
        ],
        [
            "Published",
            "03-03-2011",
            "10-31-2013"
        ]
    ],
    "pageTitle": "Agnieszka - Patent applications",
    "title": "",
    "url": "http://www.faqs.org/patents/inventor/agnieszka-7/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042991076.30/warc/CC-MAIN-20150728002311-00247-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 438075727,
    "recordOffset": 438049228,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Agnieszka Marcinowicz-Flick, Ames, IA US 11-27-2014 Leveling Valve for Discharging and Supplying Fluid - A leveling valve for discharging and supplying air from and to a plurality of utilization elements comprises a valve disc arrangement configured to direct air between a source of pressurized air, an exhaust port, and the utilization elements. The valve disc arrangement comprises a first and a second valve disc, which are rotatable with respect to each other such that the valve is switchable between multiple switching positions, and, in some switching positions, either the source of pressurized air or the exhaust port are in fluid communication with the utilization elements. The valve discs provide a stepped increase in flow cross-section in a respective flow path to or from the utilization elements. The stepped increase is dependent on the angle of rotation between the valve discs. 20140346748 Published Description Patent application number Agnieszka Leszczuk, Wroclaw PL 01-10-2013 METHODS AND KITS FOR DECREASING INTERFERENCES IN PLASMA OR SERUM CONTAINING ASSAY SAMPLES OF SPECIFIC BINDING ASSAYS - Methods and kits are provided for decreasing interferences and inaccuracies due to nonoptimal sample handling of blood samples in plasma or serum containing assay samples of specific binding assays by addition of a large polycation to the assay sample during the specific binding assay. 20130011827 06-09-2011 METHODS AND KITS FOR DECREASING INTERFERENCES IN PLASMA OR SERUM CONTAINING ASSAY SAMPLES OF SPECIFIC BINDING ASSAYS",
    "textAfterTable": "Agnieszka Morawska, Skala PL Patent application number Description Published 20150130099 FORMATION METHOD OF A MIDDLE EAR PROSTHESIS - The process of preparing a middle ear prosthesis of polymeric material by injection moulding technology according to the presented invention is characterized by drying the thermoplastic polymer granules, preferably high density polyethylene or polyamide or polysulphone, at a temperature in the range of 60 to 150° C. for a period of 2 to 8 hours. Subsequently granules are plasticized and then injected at a temperature between 180 and 400° C. into the mold heated to a temperature between 60 and 150° C. Then obtained moulder is cooled and in the final stage it is hermetically packed in a vacuum and sterilized. In addition, the granules of the thermoplastic polymer composite are used, obtained by addition of bactericidal additive introduced into the thermoplastic polymer granules, preferably a silver powder with a particle size from 15 to 100 nm, in an amount of 0.1-3 wt %. 05-14-2015 Agnieszka Opalinska, Zyrardow PL Patent application number Description Published 20090256083 Zirconium Dioxide Luminescence Oxygen Sensor - A method of measuring oxygen partial pressure in gases, such as hot engine exhaust gases, uses a calibrated luminescence sensor and comprises the steps of bringing nanocrystalline zirconinum dioxide ZrO 10-15-2009 Agnieszka Otrowicz, Wroclaw PL Patent application number Description Published 20130295647",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}