{
    "relation": [
        [
            "",
            "International Shipping Service",
            "First Class Mail International"
        ],
        [
            "",
            "Shipping Cost",
            "$12.99"
        ],
        [
            "",
            "Delivery Time",
            "12-16 Business Days"
        ],
        [
            "",
            "Additional Items",
            "$7.00"
        ]
    ],
    "pageTitle": "Hawaiian Shaved ICE Banner Sign Hawaian Signs SNO Snow Cone Cold Flavored | eBay",
    "title": "",
    "url": "http://www.ebay.ca/itm/HAWAIIAN-SHAVED-ICE-BANNER-SIGN-hawaian-signs-sno-snow-cone-cold-flavored-/180772930246?pt=LH_DefaultDomain_0&hash=item2a16e802c6",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988317.67/warc/CC-MAIN-20150728002308-00297-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 414057071,
    "recordOffset": 414008583,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "$3.00 7-10 Business Days $4.99 First Class Mail International Additional Items Delivery Time Shipping Cost Canada Shipping Service $4.00 1-2 Business Days $24.99 Express Mail $3.00 2-3 Business Days $7.99 Priority Mail FREE 4-7 Business Days FREE Standard Mail Additional Items Delivery Time Shipping Cost US Shipping Service Shipping Return Policy Shipping SignMission eBay Store Information: Increase your bottom line with this quality banner! This 18\"x48\" banner is perfect for outdoor use for 5+ years or will look great inside. Our banners are printed on heavy duty 13oz. outdoor vinyl banner material and comes standard with 4 grommets for easy hanging. Full color banners provide the cheapest",
    "textAfterTable": "Return Policy We strive to make sure that all of our customers are satisfied and this is why we offer a 7-day money back guarantee. Buyer is responsible for return shipping. Contact Us If you have any questions or concerns please feel free to e-mail us using the Ask a Question link at the bottom of the auction page. We try to respond to all e-mail inquiries within 1-2 business days. Questions and answers about this item No questions or answers have been posted about this item. Ask a question - opens in a new window or tab",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}