{
    "relation": [
        [
            "Categories",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor"
        ],
        [
            "Comments",
            "They have a small store where you can buy food. It isn't all that bad. You don't have to eat there though because there are places close to the campus that sell food as well. You are never short on choices.",
            "We don't have a dorm at Ivy Tech. However, there are plenty of apartments in the area that are close to the school. And if you live close to campus already, you don't need an apartment and just commute.",
            "It may feel like a high school atmosphere at times, but it is quite challenging. They expect your best while understanding that there are other things in life that must be done. Not many other colleges are like that."
        ]
    ],
    "pageTitle": "Ivy Tech Community College-Lafayette Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Ivy-Tech-Community-College-Lafayette/reviews?_escaped_fragment_=/show/103519",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042991076.30/warc/CC-MAIN-20150728002311-00144-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 890024119,
    "recordOffset": 889988589,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{126824=© 2015, Cappex.com, LLC}",
    "textBeforeTable": "11/23/2009 Reviewer is Accepted here and planning to attend soon. Reviewer has not been to campus. 2 out of 3 people found this review useful. 1 of 31 Sonia from Crawfordsville, IN Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID:",
    "textAfterTable": "They make it seem like even though you have low sat scores you have an apportunity to keep going in school, and maybe transfering to a 4 year college. Will learn a lot Learn about nursing, it the one thing Im very interested in, the school is very close to where I live! Login to rate or flag the reviews Ashley from Earl Park, IN 01/02/2012 Reviewer is A current student here. 1 out of 2 people found this review useful. 2 of 31 Categories Comments Great for these types of students Ivy Tech could be great for any person, any race, and any age and make that extremely clear from day one. In my classes I had students of all race and ages and never once was any singled out. Ivy Tech is great for any student, even if they want to transfer somewhere. Tips for prospective students Some tips i could give would be is to always",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}