{
    "relation": [
        [
            "VOTE:",
            "",
            "",
            "",
            ""
        ],
        [
            "Ida L. Castro",
            "Alan Dexter Bowman",
            "Josephine DiRienzo",
            "Margaret E. L. Howard",
            "Robert J. Long"
        ],
        [
            "(Yes)",
            "(Abstained)",
            "(Yes)",
            "(Yes)",
            "(Yes)"
        ]
    ],
    "pageTitle": "Civil Service Commission | Meeting Minutes of September 25, 2002",
    "title": "",
    "url": "http://www.state.nj.us/csc/about/meetings/minutes/020925m.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042982502.13/warc/CC-MAIN-20150728002302-00209-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 725113763,
    "recordOffset": 725088553,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{821=Notice of this meeting was filed with the Secretary of State and sent to the Trentonian, Trenton Times, Courier-Post and Star Ledger on March 7, 2002, and posted at the Department of Personnel, 3 Station Plaza, Trenton, New Jersey., 70714=B-53 JANICE SANFORD The appeal of Janice Sanford, a Cottage Training Technician with the New Lisbon Developmental Center, Department of Human Services, of her removal effective November 9, 1999, on the charge of chronic or excessive absenteeism from work, was before Administrative Law Judge Ana C. Viscomi (ALJ), who rendered her initial decision on May 8, 2002. At its meeting on June 12, 2002, the Merit System Board (Board) did not adopt the ALJ's recommendation to dismiss the appeal as moot. Rather, the Board ordered that the matter be remanded to the Office of Administrative Law (OAL). However, prior to its adoption of a written decision, the Board, at its meeting on July 3, 2002, on its own motion, granted reconsideration of its prior decision and again ordered that the matter be remanded to the OAL. Additionally, the Board granted the appellant a hearing on a separate charge of conduct unbecoming a public employee and transmitted that matter to the OAL. The proposed decision is now submitted for the Board's review., 1311=DATE: September 25, 2002, 11176=A-2 VERA BORISOVS Vera Borisovs, Practical Nurse, Vineland Developmental Center, Department of Human Services, resignation not in good standing effective December 7, 1999, on the charge of being absent from duty for five consecutive working days without approval. Recommendation of the Administrative Law Judge - Reverse the resignation not in good standing., 58353=B-44 MICHAEL MUSCARELLA Michael Muscarella, a Police Officer with the City of Newark, represented by Paul J. Hirsh, Esq., petitions the Merit System Board for back pay, interest and counsel fees. This matter held over from the September 10, 2002 meeting., 60804=B-47 HILARIO MARTINEZ The City of Newark (Newark), represented by Desha L. Jackson, Assistant Corporation Counsel, requests reconsideration of the Merit System Board (Board) decision, In the Matter of Hilario Martinez (MSB, decided July 17, 2002), which restored his name to the eligible list for Police Officer (S9999A), City of Newark., 56502=B-43 RUSSEL GRECO Russel Greco, a former Assistant Police Surgeon with the City of Newark Police Department, represented by Anthony J. Fusco, Jr., Esq., seeks enforcement of the Merit System Board decision rendered on May 22, 2001, granting him back pay, benefits, seniority and counsel fees., 41781=B-29 GUILLERMO A. NAVARRO Guillermo A. Navarro, represented by Charles M. Grossman, Esq., appeal the decision of Human Resource Information Services (HRIS), which found that the appointing authority had presented a sufficient basis to remove his name from the eligible list for Police Officer (S9999A), City of Newark on the basis of an unsatisfactory background report. . This matter was held over from the September 10, 2002 meeting., 12669=A-5 JILL MCGRANE Jill McGrane, Intermittent Technical Assistant 3, Department of the Treasury, release at the end of the working test period effective February 21, 2001., 19608=A-14 SYBIL THREATS Sybil Threats, Senior Correction Officer, Mid-State Correctional Facility, Department of Corrections, removal effective September 29, 2000, on charges of insubordination and violation of a rule, regulation, policy, procedure, order, or administrative decision., 97723=B-113 JAMES R. ALLEN AND JAN RABAJDA James R. Allen and Jan Rabajda, represented by Jesse J. Averhart, Executive Vice President, Communication Workers of America, Local 1033, request that they be permitted to amend their promotional applications retroactively to the closing date of the announcement for the promotional examination for Auditor 1, Taxation (PS3295U) to reflect all the counties containing Department of the Treasury (Treasury) audit field offices, and also be given retroactive appointments, where applicable, as if they had been given the opportunity to be certified to the locations with open positions., 60256=B-46 CAROL DAVIS Carol Davis, a former Senior Building Maintenance Worker with Ann Klein Forensic Center, Department of Human Services (DHS), petitions the Merit System Board (Board) for reconsideration of the final administrative decision rendered June 26, 2002, in which the Board dismissed Davis' appeal of her removal, effective May 23, 2001, without prejudice based on Davis' failure to appear at her scheduled settlement conference., 17858=A-11 DAVID L. WEISS David L. Weiss, Police Lieutenant, City of Perth Amboy, Police Department, 180-day suspension and demotion to the position of Police Sergeant effective November 23, 2000, on charges of insubordination, neglect of duty, knowingly and willfully making a false entry in any department report or record, failure to conduct proper, thorough, and complete investigations, insubordination, failure to submit properly written required reports within a reasonable or prescribed period of time as per regulations, and conduct subversive to the good order and discipline of the department., 13491=A-7 ROBERT L. SHIELDS Robert L. Shields, Senior Correction Officer, New Jersey State Prison, Department of Corrections, 30-day suspension on charges of insubordination and violation of rules regarding, inter alia, personal conduct, and removal effective March 28, 2001, on charges of incompetency, inefficiency, or failure to perform duties, neglect of duty, and violation of rules regarding performance., 100013=B-115 ANNA M. ACHUTHA, ET AL. Anna M. Achutha, Seth K. Ahiekpor, Kanaga Arunachalam, Steven A. Ciapanna, Jayant C. Dalal, Alexander E. Murawski, Ahmad S. Najem, Ali J. Najem, Prakash B. Patel, Wahab M. Roomi, Ramesh K. Suvagiya and Vijaykumar G. Thaker, appeal the content validity and the delegation of certain items prior to the scoring of the promotional examination for Project Engineer, Structural Transportation, (PS2291T), Department of Transportation., 20074=A-15 DEXTER S. WRIGHT Dexter S. Wright, Cottage Training Technician, New Lisbon Developmental Center, Department of Human Services, removal effective January 20. 2000, on charges of conduct unbecoming a public employee and reporting to work unfit for duty., 19119=A-13 NASEEN A. MUHAMMAD Naseen A. Muhammad, Police Officer, City of Passaic, Police Department, removal effective November 4, 1999, on charges of failure to perform duties, conduct unbecoming a public employee, neglect of duty, misuse of public property and other sufficient cause., 23044=A-18 JOSE MARTINEZ Jose Martinez, Police Officer, City of Newark, Police Department, four-month suspension, on charges of violation of Police Department rules regarding absence without leave, unauthorized absence, accessibility to department surgeons and superior officers, malingering, efficiency and cooperation, and neglect of duty. This matter was previously presented to the Merit System Board at its regular meeting of September 10, 2002, and was held over due to lack of quorum., 18706=A-12 CLARENCE BROCK Clarence Brock, Parking Attendant, City of Trenton, Department of Housing and Development, removal effective March 15, 2001, on the charge of conduct unbecoming a public employee. Recommendation of the Administrative Law Judge - Uphold the removal., 66905=B-51 ANN S. JOHNSON The appeal of Ann S. Johnson, a Library Assistant with the Willingboro Public Library, of her removal effective July 24, 2000 on charges, was heard by Administrative Law Judge Douglas H. Hurd (ALJ), who rendered his initial decision on May 1, 2002. At its meeting on June 12, 2002, the Merit System Board (Board) adopted the ALJ's recommendation to uphold the appellant's removal. The proposed final decision is now submitted for the Board's review., 13069=A-6 MICHAEL RAVENDA Michael Ravenda, Plumbing Subcode Official, Borough of Lodi, Building Inspections Department, appeals the good faith of his layoff, effective August 3, 2001, for reasons of economy and efficiency., 105837=There being no further business before the Merit System Board, the meeting was adjourned to convene on Wednesday, October 9, at 10:00 a.m., at 3 Station Plaza, Trenton, New Jersey. __________________________________ IDA L. CASTRO COMMISSIONER MERIT SYSTEM BOARD, 103055=B-120 MERIT SYSTEM BOARD MINUTES The Merit System Board Minutes for the meeting of September 10, 2002 are submitted for adoption., 63242=B-49 DAVID BOWENS The appeal of David Bowens, a County Correction Officer with Mercer County, of his resignation in good standing, effective May 28, 1999, was heard by Administrative Law Judge Joseph Lavery (ALJ), who rendered his initial decision on April 26, 2002, finding that the appellant did not resign in good standing. Instead the ALJ upheld the appellant's removal from employment. At its meeting on June 12, 2002, the Board adopted the ALJ's recommendation. The proposed final decision is now submitted for the Board's review., 56818=ACTION: The merit System Board denied the appellant's request for back pay and reimbursement for health insurance coverage but granted him vacation time and sick time until his retirement on January 1, 2001. The Board granted him seniority from June 12, 2000 to January 1, 2001, and granted him $1,881.25 in counsel fees., 34097=B-19 ELVIS COLLADO Elvis Collado appeals the removal of his name from the eligible list for Police Officer (S9999A), City of Newark on the basis of an unsatisfactory background report. This matter was held over from the September 10, 2002 meeting., 20546=A-16 CYNTHIA BAKER Cynthia Baker, Police Officer, City of Newark, Police Department, ten-day suspension on charges of violation of Police Department rules regarding insubordination, neglect of duty, misuse of public property and obedience to orders. This matter was previously presented to the Merit System Board at its regular meeting of September 10, 2002, and was held over due to lack of quorum., 100581=B-116 BRANDON SMITH The Acting Assistant Commissioner for State and Local Operations, Department of Personnel, on behalf of Brandon Smith, petitions the Merit System Board for reconsideration of the decision rendered on September 18, 2001, which found that he was not employed in the announced unit scope for the promotional examination for Construction and Management Specialist 1 (PM0320C), Newark School District., 101751=ACTION: The Merit System Board adopted the minutes of its meeting of July 31, 2002., 103208=ACTION: The Merit System Board adopted the minutes of its meeting of September 10, 2002., 53867=B-39 CLAUDETTE GALIBER Claudette Galiber, a Senior Correction Officer (SCO) with the Central Reception and Assignment Facility (CRAF), Department of Corrections (DOC), represented by Ann M. Madden, Esq., appeals the determination of the Director of the Equal Employment Division with the DOC, stating that the appellant failed to present sufficient evidence to support a finding that she had been subjected to a violation of the New Jersey State Policy Prohibiting Discrimination, Harassment or Hostile Environments in the Workplace. This matter was held over from the July 17, 2002 meeting., 705=In accordance with L.1975, c.231, Chairwoman Ida L. Castro opened the meeting with the following statement:, 22389=A-17 WILLIAM KLUSARITZ, JR. William C. Klusaritz, Jr., Principal Accountant, County of Cape May, Treasurer's Office, removal effective November 18, 1997, on charges of incompetency, inefficiency, or failure to perform duties, insubordination, and inability to perform duties. This matter was previously presented to the Merit System Board at its regular meeting of September 10, 2002, for consideration by the full Board., 65081=B-50 TYRONE MAJOR The appeals of Tyrone Major, a Police Officer with the City of Newark, of his four removals effective July 25, 2000, on charges, were heard by Administrative Law Judge Ken R. Springer (ALJ), who rendered his initial decision on May 3, 2002. At its meeting on June 12, 2002, the Merit System Board (Board) adopted the ALJ's recommendation to reverse three of the four removals and to modify the remaining removal to a 90-day suspension. The proposed final decision is now submitted for the Board's review., 32136=B-13 GARY MARGULIS Gary Margulis, a Head Nurse at Trenton Psychiatric Hospital, Department of Human Services, represented by Benjamin Spivack, CWA Local 1040, appeals the denial of sick leave injury (SLI) benefits., 101603=B-119 MERIT SYSTEM BOARD MINUTES The Merit System Board Minutes for the meeting of July 31, 2002 are submitted for adoption., 62457=B-48 CARLA YOUNG The Gloucester County Prosecutor's Office (Prosecutor's Office), represented by Samuel J. Ragonese, Esq., petitions the Merit System Board (Board) for reconsideration of the Boar decision rendered June 26, 2002, which reversed the removal of Carla young, a Senior Clerk Typist with the Prosecutor's Office and ordered her to be reinstated to her position along with a grant of back pay, benefits, and seniority from the date of her separation to the date of her reinstatement. Additionally, the appointing authority seeks a stay of that decision pending the Board's reconsideration of the matter., 53146=B-38 LARRY LOIGMAN The Superior Court, Law Division, has transmitted, by order dated May 6, 2002, the case of Loigman v. Township of Middletown, et al., to the Merit System Board to address the merits of Mr. Loigman's complaint and to fashion an appropriate remedy. During the pendency of the matter on remand from the Superior Court, Mr. Loigman also filed a petition for interim relief with the Merit System Board, requesting that the Board enjoin the Township from appointing additional Police Officer prior to final disposition of that matter., 51519=B-37 JOHN E. ALLISON John E. Allison appeals the decision of Human Resource Information Services, which found that the appointing authority properly disposed of the February 14, 2001 certification of the Police Officer (S9999A), City of Newark, eligible list. This matter was held over from the September 10, 2002 meeting., 15762=A-9 JAMES L. SMITH James L. Smith, Motor Vehicle Operator 1, Department of Personnel, resignation not in good standing effective December 18, 2000, on the charge of unauthorized absences., 68670=B-52 JESSE JAMES BALDWIN Jesse James Baldwin, a Social Worker 2 with the Department of Human Services, appeals the good faith of his layoffs from Marlboro Psychiatric Hospital, effective October 11, 1996, and Woodbridge Developmental Center, effective May 22, 1998, for reasons of economy and efficiency, as well as his resignation not in good standing from Green Brook Regional Center, effective January 8, 1999, on charges. These matters were heard by Administrative Law Judge Kathryn A. Clark (ALJ), who rendered her initial decision on May 14, 2002 upholding all three actions. At its meeting on July 31, 2002, the Merit System Board adopted the ALJ's recommendations. The proposed final decision is now submitted for the Board's review., 25955=A-21 JACQUETTA SPINKS Jacquettta Spinks, County Correction Officer, County of Union, Department of Public Safety, removal effective May 24, 2000, on the charge of conduct unbecoming a public employee. Recommendation of the Administrative Law Judge - Uphold the removal., 54482=ACTION: The Merit System Board dismissed the discrimination appeal, since no further action is required. The Merit System Board directed that the appellant be granted SLI benefits from August 28 through October 18, 2001., 303=A regular meeting of the Merit System Board was held on Wednesday, September 25, 2002, in Trenton, New Jersey.}",
    "lastModified": "Wed, 07 May 2014 18:26:09 GMT",
    "textBeforeTable": "WITHDRAWAL OF APPEALS The following appeals were withdrawn and removed from the hearing calendar: Mary Davis, Social Worker 2, Woodbine Developmental Center, Department of Human Services, suspension. Arthur Erickson, Data Processing Programmer 2, Office of Information Technology, release at the end of the working test period. Cordelia Fairley, Principal Clerk Transcriber, North Jersey Developmental Center, Department of Human Services, removal. Antoinette Fiorentini, Public Safety Telecommunicator, City of Hoboken, removal. William Gorcica, Police Officer, Police Department, Township of Jefferson, removal. Lizsandra Marrero, Senior Clerk, Camden County Board of Social Services, resignation not in good standing. Dawn Riley, Probation Officer, Department of Judiciary, suspension. Rosalina M. Zoleta, Auditor 2, Taxation, Department of the Treasury, demotion. DISMISSAL OF APPEALS - FAILURE TO APPEAR The Merit System Board dismissed the following cases without prejudice for failure to appear at the scheduled hearing before the Office of Administrative Law. Francis Dougherty, Administrative Analyst 1, Data Processing, Office of Information Technology, suspension. Tia Taylor, Clerk Typist, Department of Human Services, County of Union, release at the end of the working test period. Jeffrey Williams, Hospital Attendant, Runnells Hospital, County of Burlington, suspension. SECTION A - HEARING MATTERS A-1 SETTLEMENTS In the Matter of Phyllis Allen Camden Vicinage Suspension In the Matter of Curtis Chiumento County of Camden Sheriff's Office Suspension In",
    "textAfterTable": "A-9 JAMES L. SMITH James L. Smith, Motor Vehicle Operator 1, Department of Personnel, resignation not in good standing effective December 18, 2000, on the charge of unauthorized absences. Recommendation of the Administrative Law Judge - Modify the resignation not in good standing to a six-month suspension. ACTION: The Merit System Board affirmed the recommendation of the Administrative Law Judge. VOTE: Ida L. Castro (Abstained)   Alan Dexter Bowman (Yes)   Josephine DiRienzo (Yes)   Margaret E. L. Howard (Yes)   Robert J. Long (Yes) A-10 MICHAEL WALKER Michael Walker, Police Officer, Township of Irvington, Police Department, 12-day suspension on the charge of violation of Police Department rules regarding sick leave policy and truthfulness. Recommendation of the Administrative Law Judge - Modify the 12-day suspension to a four-day suspension. ACTION: The Merit System Board affirmed the recommendation of the Administrative Law Judge. A-11 DAVID L. WEISS David L. Weiss, Police Lieutenant, City of Perth Amboy, Police Department, 180-day suspension and demotion to the position of Police Sergeant effective November 23, 2000, on charges of insubordination, neglect of duty, knowingly and willfully making a false entry in any department report or record, failure to conduct proper, thorough, and complete investigations, insubordination, failure to submit properly written required reports within a reasonable or prescribed period",
    "hasKeyColumn": true,
    "keyColumnIndex": 1,
    "headerRowIndex": 0
}