{
    "relation": [
        [
            "Categories",
            "Campus Safety",
            "Clubs and Activities",
            "Great for these types of students",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "University Police are always on duty",
            "There is a large range of activites to choose from",
            "People who like to focus and are not looking to hang out all the time",
            "you have to make your own fun , just get involved and the fun will come to you",
            "you get tired of eating the same things , but the food is really good",
            "The rooms are really large",
            "The teachers care about all there students so it is good to build a relationship",
            "Stay Motivated and Focused",
            "An Amazing School"
        ]
    ],
    "pageTitle": "Alfred State College (SUNY) Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Alfred-State-College-SUNY/reviews?_escaped_fragment_=/show/11766",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042982502.13/warc/CC-MAIN-20150728002302-00249-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 868973595,
    "recordOffset": 868939616,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{81240=I was a part of Rainbow Union (SUNY Alfred's Gay-Straight Alliance) and Tap Dance Underground. Rainbow Union were very involved in campus life and community service. Several of the members were also members of Greek Life. We played games, talked about current LGBT issues, and had many community service/civic engagement events. Tap Dance Underground is a tap dancing club and you don't need to know how to tap dance to join. I had never tap danced (or done any dance) before, and I went to some of their meetings because my friend was in it. I helped them run their December show that they did, I was in control of music. Then I joined in January, worked as hard as I could to learn their routine, and we went to NYC in March to perform. I had a lot of fun during the trip and with the club in general. The president during this time was a Greek Life student, and he balanced school-work, a job, Greek Life, and this club well., 3624=ITS COLD BRING WARM THINGS ! Don't think winter is over until the sun is out and its 80 degrees... its almost April and its still snowing and very cold... its going to be like this for a while., 4695=I love Alfred. i have met so many Amazing people that it blows my mind. its one of those weird places you just meet so many amazing people. there are many activities and clubs to attend, and Alfred state students activities are always trying to make their students have a great time , for instances april 13th 2011 we are having Sick puppies CONCERT WOOT :D. and last year this time Kevin hart came and technically beta tested his jokes on us LOL., 115176=I fell at least 3 times when coming back here from January Break., 82868=Locations-There is one spot behind Shultz Hall called Heaven, it's the parking lot for the buildings in that area. From this spot, you can see all of campus and a lot of the town and surrounding area. I only was at this spot once, during the day, and it was beautiful. Traditions-Wednesdays, Fridays, and Saturdays are party/drinking days. Wednesday is Wasted Wednesday. In April, there is Hot Dog Weekend, which is a weekend devoted to drinking. There are some drugs done on campus and a lot of drinking done in residential halls., 122136=© 2015, Cappex.com, LLC}",
    "textBeforeTable": "12/23/2009 Reviewer is Researching this school. Reviewer has not been to campus. 4 out of 10 people found this review useful. 2 people found this inaccurate. 1 of 31 Emmanuel from Capitol Heights, MD Check out reviews left by other students or leave your own review. You could win a free scholarship. Alfred State College (SUNY) Reviews Alfred State College (SUNY) › New York › By State › Colleges › } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp;",
    "textAfterTable": "Tips for prospective students ITS COLD BRING WARM THINGS ! Don't think winter is over until the sun is out and its 80 degrees... its almost April and its still snowing and very cold... its going to be like this for a while. Bang for the buck Dont get me wrong i love alfred, but to be honest i wish i was in a college with almost more funding so they could better support their students. Res life here is awesome and all but the dorms are not that great. its a bang for you buck if you put yourself in the position to enjoy it all. Am enjoying being here I love Alfred. i have met so many Amazing people that it blows my mind. its one of those weird places you just meet so many amazing people. there are many activities and clubs to attend, and Alfred state students activities are always trying to make their students have a great time , for instances april 13th 2011 we are having Sick puppies CONCERT WOOT :D. and last year this time Kevin hart came and technically beta tested his jokes on us LOL. Am learning a lot If you put yourself",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}