{
    "relation": [
        [
            "Date",
            "Mar 31",
            "Apr 14",
            "Apr 21",
            "Apr 28",
            "May 5",
            "May 12",
            "May 19",
            "May 26",
            "Jun 2",
            "Jun 9"
        ],
        [
            "Moderator",
            "Jenny Finkel",
            "Adam Vogel",
            "Nate Chambers",
            "--",
            "Jenny Finkel",
            "David Vickrey",
            "Ramesh Nallapati",
            "Steven Bethard",
            "Mihai Surdeanu",
            "Jenny Finkel"
        ],
        [
            "Topic / Paper",
            "Organizational Meeting",
            "Wei Lu, Hwee Tou Ng, Wee Sun Lee, Luke S. Zettlemoyer. A Generative Model for Parsing Natural Language to Meaning Representations EMNLP 2008. [pdf]",
            "Finding and Linking Incidents in the News [pdf]",
            "No Meeting - Good Luck with EMNLP Submissions!",
            "The Unreasonable Effectiveness of Data [pdf]",
            "S. Cohen and N. Smith. Shared Logistic Normal Distributions for Soft Parameter Tying in Unsupervised Grammar Induction NAACL 2009 [pdf]",
            "David Mimno, Hanna Wallach and Andrew McCallum. Gibbs Sampling for Logistic Normal Topic Models with Graph-Based Priors. NIPS Workshop on Analyzing Graphs, 2008, Whistler, BC. [pdf]",
            "Amarnag Subramanya, Jeff Bilmes. Soft-Supervised Learning for Text Classification EMNLP 2008 [pdf]",
            "Yi Zhang, Jeff Schneider, Artur Dubrawski. Learning the Semantic Correlation: An Alternative Way to Gain from Unlabeled Text NIPS 2008 [pdf]",
            "Syntactic Topic Models NIPS 2008 [pdf]"
        ]
    ],
    "pageTitle": "The Stanford NLP (Natural Language Processing) Group",
    "title": "",
    "url": "http://nlp.stanford.edu/read/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042991076.30/warc/CC-MAIN-20150728002311-00324-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 172603739,
    "recordOffset": 172578241,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "NLP Reading Group Schedule — Spring 2015 Wednesday 11:30-1:00pm, Gates 120 (usually) home · people · teaching · research · publications · software · events · local The Stanford Natural Language Processing Group  ",
    "textAfterTable": "Date Moderator Topic / Paper Jan 14th Oriol Vinyal Invited Talk. Recurrent Neural Nets as Language Decoders. Venue: Gates 219. Jan 21st Thang Luong Sebastien Jean, Kyunghyun Cho, Roland Memisevic, Yoshua Bengio. On Using Very Large Target Vocabulary for Neural Machine Translation.. arXiv2014. [pdf] Jan 28th Panupong Pasupat Antoine Bordes, Sumit Chopra, Jason Weston. Question Answering with Subgraph Embeddings. EMNLP2014. [pdf] Feb 4th Sebastian Schuster Lingpeng Kong, Nathan Schneider, Swabha Swayamdipta, Archna Bhatia, Chris Dyer, Noah A. Smith. A Dependency Parser for Tweets. EMNLP2014. [pdf] Feb 11th Russell Stewart Jason Weston, Sumit Chopra, Antoine Bordes. Memory Networks. arXiv2014 [pdf] Feb 18th Arun Chaganty R. Tsarfaty, E. Pogrebezky, G. Weiss, Y. Natan, S. Szekely, D. Harel. Semantic Parsing Using Content and Context: A Case Study from Requirements Elicitation. EMNLP2014. [pdf] Feb 25th Break. Mar 4th Fei-Fei Li TED Talk Practice. Mar 11th Chris Callison-Burch Invited Talk. Crowdsourcing Translation. Venue: Gates 104 (12pm-1pm). NLP Reading Group Schedule — Fall 2014 Wednesday 12:30-2:00pm, Gates 120 (usually) Date Moderator Topic / Paper Oct 1st Thang Luong",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}