{
    "relation": [
        [
            "Name and Description",
            "response-format",
            "callback"
        ],
        [
            "Value and Notes",
            "See Common Parameters.",
            "See Common Parameters."
        ]
    ],
    "pageTitle": "Times Developer Network - The Campaign Finance API",
    "title": "",
    "url": "http://developer.nytimes.com/docs/campaign_finance_api",
    "hasHeader": true,
    "headerPosition": "MIXED",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042982502.13/warc/CC-MAIN-20150728002302-00342-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 64966267,
    "recordOffset": 64946492,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{58390=Electronic filings are available back to 2001. Paper filings by Senate candidate committees and senatorial party committees go back to 1999. For more details about paper filings, see the blog post., 54504=Deprecated as of December 2012., 55119=The query parameter accepts either a committee name or its FEC committee ID. Electronic filings are available back to 2001. Paper filings by Senate candidate committees and senatorial party committees go back to 1999. For more details about paper filings, see the blog post., 41027=Electronic filings are available back to 2001. Paper filings by Senate candidate committees and senatorial party committees go back to 1999. For more details about paper filings, see the blog post.  }",
    "textBeforeTable": "Optional Parameters See Common Parameters. api-key The candidate last name or partial last name Examples: Greene Robin (retrieves both Robin and Robinson) lname See Common Parameters. campaign-cycle See Common Parameters. version Value and Notes Name and Description With the exception of api-key, these parameters are specified in the URI path. Add your api-key as a name-value pair in a query string. Required Parameters http://api.nytimes.com/svc/elections/us/{version}/finances/{campaign-cycle}/candidates/search[.response-format]?query={lname}&api-key={your-API-key}[&callback={callback-function}] To search for Congressional and presidential candidates by last name, use the following URI structure: Candidate Search Candidates Callback function name (in query string) As of February 2011, the Campaign Finance API supports JSONP requests. Simply add your callback function to the query string. No callback JSONP callback function .json | .xml (extension) To return JSON, add the .json extension to your request URI. XML is the default format; you do not need to add the .xml extension to get an XML response. No response-format Sets the representation data format Alphanumeric (in query string) For more information, see Requesting a Key. Yes api-key Your registered API key YYYY (in URI path) An even-numbered year Presidential data: 2008–present Congressional data: 2000–present Yes campaign-cycle v3 (in URI path) The current version is v3. Support for version 2 ended",
    "textAfterTable": "Next Steps: Responses | Data Returned | Examples | Top of this section | Full list of requests Candidate Details To retrieve campaign finance details for a particular candidate (presidential or Congressional), use the following URI structure: http://api.nytimes.com/svc/elections/us/{version}/finances/{campaign-cycle}/candidates/{fec-id}[.response-format]?api-key={your-API-key}[&callback={callback-function}] See also the Presidential Candidate Details request. Required Parameters With the exception of api-key, these parameters are specified in the URI path. Add your api-key as a name-value pair in a query string. Name and Description Value and Notes version See Common Parameters. campaign-cycle See Common Parameters. fec-id String: P | H | S + 9 digits (P = President; H = House; S = Senate) The FEC assigns a unique ID to each candidate. Note that this request type uses the candidate ID, not the committee ID used in the Presidential Candidate Details request type. To find a candidate's official FEC ID, use a candidate search request or the FEC web site. api-key See Common Parameters. Optional Parameters Name and Description Value and Notes response-format See Common Parameters. callback See Common Parameters. Next Steps: Responses | Data Returned | Examples |",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}