{
    "relation": [
        [
            "Plant Name",
            "Bon Tempe Treatment Plant",
            "San Geronimo Water Treatment Plant"
        ],
        [
            "Plant ID",
            "181",
            "180"
        ],
        [
            "Water Type",
            "Surface Water",
            "Surface Water"
        ],
        [
            "Quarter",
            "JAN 1998 - MAR 1998",
            "JAN 1998 - MAR 1998"
        ],
        [
            "Total Trihalomethanes Concentration (ppb)",
            "26.5",
            "30"
        ]
    ],
    "pageTitle": "EPA | Envirofacts | ICR",
    "title": "",
    "url": "http://www.epa.gov/enviro/html/icr/state/report/tthm/CA_3.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988317.67/warc/CC-MAIN-20150728002308-00030-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 421029570,
    "recordOffset": 421021368,
    "tableOrientation": "HORIZONTAL",
    "lastModified": "Fri, 28 Oct 2011 15:35:29 GMT",
    "textBeforeTable": "Water Type - GROUND WATER (Trea ted Water) Alameda County Water District REMINDER: Data Purpose: The ICR data were collected as part of a national research project to support development of national drinking water standards. They should NOT be used to determine local water systems compliance with drinking water standards, nor should they be used to make personal judgements about individual health risks. Units: Sample measurements are taken in micrograms per Liter (ug/L) and are regulated in milligrams per Liter (mg/L). A microgram per Liter is equivalent to one contaminant part per billion (ppb). A ppb can be thought of as one grain of salt in a swimming pool. Data for Total Trihalomethanes, haloacetic acids 5, and bromate are presented in ppb. 1 mg/L = 1000 ug/L, or 0.080 mg/L = 80 ug/L = 80 ppb, which happens to be the TTHM standard in the Stage 1 DBP Rule. Calculation in Regulations is Different: Comparisons with compliance calculations based on the existing Total Trihalomethanes standard in CFR Part 141.30 may not be warranted since the standard i s based on an annual average of public water system quarterly averages and not on treatment plant results as shown here. Also the results here are based on different types of samples. Results of Zero: A result of zero may indicate that a sample",
    "textAfterTable": "Water Type Quarter Total Trihalomethanes Concentration (ppb) Mission San Jose WTP 137 Surface Water JAN 1998 - MAR 1998 52.5 WTP2 136 Surface Water JAN 1998 - MAR 1998 14.8 CITY OF LOS ANGELES Water Type - SURFACE WATER (Treated Water) Plant Name Plant ID Water Type Quarter Total Trihalomethanes Concentration (ppb) Los Angeles Aqueduct Filtration Plant 163 Surface Water JAN 1998 - MAR 1998 26.1 Lower Stone Canyon Reservoir 166 Surface Water JAN 1998 - MAR 1998 24.9 River Supply Condui t 738 Surface Water JAN 1998 - MAR 1998 15.3 Upper Hollywood Reservoir 739 Surface Water JAN 1998 - MAR 1998",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}