{
    "relation": [
        [
            "Days",
            "30",
            "50",
            "150",
            "200"
        ],
        [
            "BSE",
            "38.00",
            "38.90",
            "46.09",
            "49.19"
        ],
        [
            "NSE",
            "38.02",
            "38.90",
            "46.09",
            "49.18"
        ]
    ],
    "pageTitle": "Indian Overseas Bank Stock Price, Share Price, Live BSE/NSE, Indian Overseas Bank Bids Offers. Buy/Sell Indian Overseas Bank news & tips, & F&O Quotes",
    "title": "",
    "url": "http://www.moneycontrol.com/india/stockpricequote/banks-public-sector/indianoverseasbank/IOB",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042982502.13/warc/CC-MAIN-20150728002302-00202-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 567919995,
    "recordOffset": 567867553,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{131772=UnitedBrewerie Jul Fut, 132479=JSWSteel Jul Fut, 209462=Astec LifeSciences Recommended on Mar 31st 2015, 210761=IOB is in the Banks - Public Sector sector. The current market capitalisation stands at Rs 4,404.02 crore. The bank management includes R Koteeswaran - Managing Director & CEO, Atul Agarwal - Executive Director, Pawan Kumar Bajaj - Executive Director, Alok Pande - Nominee Director, Nirmal Chand - Nominee Director, R Sompath Kumar - Workmen Employee Director, J D Sharma - Employee Director, Chinnaiah - Part Time Non Official Director, S Sujatha - Part Time Non Official Director, A B D Badushas - Part Time Non Official Director, Sanjay Rungta - Shareholder Director, Niranjan Kumar Agarwal - Shareholder Director. It is listed on the BSE with a BSE Code of 532388 and the NSE with an NSE Code of IOB. Its Registered office is at 763, Anna Salai , Chennai (Madras),Tamil Nadu - 600002. Their Registrars are Cameo Corporate Services Ltd., 131261=28 July 2015}",
    "textBeforeTable": "Edit Watchlist Have you invested in these stocks? You can track them better in your Portfolio close[x] Add to Watchist Account Optional Optional Optional Optional Add to Portfolio OR Add to watchlist } $('#mcpcp_addprof_info').hide(); { function close_info()",
    "textAfterTable": "Keep me signed in Forgot Password? New to Moneycontrol - Sign up now Its easy and FREE! Username Username should be atleast 4 characters Password Password should be 6 to 10 characters Confirm Password Email OR connect with LIVE",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}