{
    "relation": [
        [
            "Level",
            "FATAL",
            "ERROR",
            "WARNING",
            "INFO",
            "DEBUG"
        ],
        [
            "Description",
            "This priority level records minimum logging details in the log file. A log record is added to the log file whenever a severe problem or critical condition occurs. If a FATAL problem occurs, the application might stop functioning.",
            "A log record is added to the log file whenever a recoverable software error condition occurs or a network failure is detected. For example, when the server fails to connect to a client or to another server.",
            "A log record is added to the log file whenever a user error is detected. For example, when the server cannot understand the communication sent by the client.",
            "A log record is added to the log file whenever a significant action takes place. For example, when an end user successfully logs in or logs out.",
            "The tasks are recorded in the log file. This information is useful for debugging purposes only. Each event with individual steps within each process or task are written to the log file, to help the end user identify the problems while debugging the application."
        ]
    ],
    "pageTitle": "Part II Administering Instant Messaging (Sun Java System Instant Messaging 7.2 Administration Guide)",
    "title": "",
    "url": "http://docs.oracle.com/cd/E19893-01/819-4412/fvbxp/index.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 125,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042982502.13/warc/CC-MAIN-20150728002302-00296-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 74772931,
    "recordOffset": 74680278,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{516126=Archive:Chat:2002:12, 515750=Create separate categories for each type of data. For example, in the Archive category where all the archived Instant Messaging data are stored, create a subcategory called “Chat” for storing chat messages. You can also create subcategories for archiving data based on time. For example, to archive chat data for the month of December 2002 the subcategory will be:, 512750=To delete all resource descriptors (RD) from a category Archive:Chat:January, type the following command. Enter the command as a single line:}",
    "lastModified": "Thu, 27 Jan 2011 07:12:47 GMT",
    "textBeforeTable": "Table 3–1 Instant Messaging server directories Instant Messaging Server Directory Structure shows the platform-specific directory structure for the Instant Messaging server. Instant Messaging Server Directory Structure Instant Messaging Data Instant Messaging Server Configuration File Instant Messaging Server Directory Structure This chapter describes the Instant Messaging server directory structure and the properties files used to store Instant Messaging operational data and configuration information in the following sections: This chapter provides information about the configuration files you use to administer Instant Messaging. Familiarize yourself with the locations of these files before making changes to your deployment’s configuration. Chapter 3 Instant Messaging Configuration File and Directory Structure Overview Chapter 19, Troubleshooting and Monitoring Instant Messaging lists the common problems that might occur during installation and deployment of Instant Messaging and provides instructions for using the monitoring agent. Chapter 18, Managing Archiving for Instant Messaging explains how to manage and configure the Instant Messaging archive. Chapter 17, Managing Instant Messaging and Presence Policies describes how to manage administrator and end user privileges, especially with policies set in Sun JavaTM System Access Manager. Chapter 16, Using Calendar Pop-up Reminders describes how to configure the Instant Messaging server, Calendar agent, Calendar Server, and Instant Messenger to enable",
    "textAfterTable": "Instant Messenger resources.  These files contain HTML documents and jar files used by Instant Messenger. The topmost directory contains the locale-independent resources, and the locale-specific directories contain the localized resources. Instant Messaging Resource directory (im-svr-base/html) The default value for the Resource Directory is:  /opt/SUNWiim/html Instant Messaging Resource directory (im-svr-base/html) The default value for the Resource Directory is:  /opt/sun/im/html Instant Messaging Server Configuration File Instant Messaging stores all configuration options in the iim.conf file. For more information on the parameters and their values stored in this file, see Appendix A, Instant Messaging Configuration Parameters in iim.conf Instant Messaging Data Instant Messaging server stores the following data used by Instant Messenger in the database directory (im-db-base), and is indicated by the iim.instancevardir parameter in iim.conf: End user properties, such as contact lists, messenger settings, subscribed news channels and access control (alternatively, these properties can be stored in LDAP). News channel messages and access rules. Alert Messages that are to be delivered. These messages are delivered and removed when the recipient logs in. Public conferences. This does not involve instant messages which are not persistent, but only properties of the conference objects themselves, such as access rules. Chapter 4 Configuring Instant Messaging for High",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}