{
    "relation": [
        [
            "Years",
            "1995",
            "1996",
            "1997–1999",
            "2000",
            "2001–2002",
            "2002–2004",
            "2005–2009",
            "2010–present"
        ],
        [
            "Captain And Vice Captain",
            "Dean Bell",
            "Greg Alexander",
            "Matthew Ridge",
            "John Simon",
            "Kevin Campion/Stacey Jones",
            "Monty Betham",
            "Steve Price",
            "Simon Mannering"
        ]
    ],
    "pageTitle": "New Zealand Warriors - Wikipedia, the free encyclopedia",
    "title": "",
    "url": "https://en.wikipedia.org/wiki/Auckland_Warriors",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042991076.30/warc/CC-MAIN-20150728002311-00075-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 862460539,
    "recordOffset": 862416140,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{20713=The Auckland representative side was consistently providing top opposition to touring teams. An Auckland team was admitted into the mid-week ARL Amco Cup competition in 1978. In their first year they made the semi-finals, and were defeated by the overall competition winners, Eastern Suburbs. They remained into the competition until the early 1980s. In 1987, an Auckland side toured Great Britain and claimed wins over powerhouse clubs Leeds and Wigan., 131169=1997–1999, 86373=Following a lengthy search for a new coach former Penrith and Canberra boss Matthew Elliot was appointed as head coach in October 2012., 43458=In a season where the rebranded New Zealand Warriors were tipped to finish in second-last place behind the North Queensland Cowboys, the team surprised all, qualifying for their first ever finals appearance in the National Rugby League season 2001., 64018=The Warriors finished the 2007 season in fourth place. The season began with a 34–18 victory over Parramatta at Mt Smart Stadium. The following week the side created history by winning their first two games of the season with a 24–14 victory over premiers, the Brisbane Broncos – the first time they have ever won their opening two games of the season., 34968=The Warriors spent 1997 in the breakaway Super League Telstra Cup competition. Despite the reduced number of teams, they failed to make an impression on the competition. Monie was replaced by Frank Endacott as coach midway through the 1997 season. The only positive was the team's performance in the World Club Challenge. The Warriors hammered United Kingdom powerhouses Wigan and St Helens, and comfortably handled Warrington. The Warriors were knocked out in the Semi Finals by eventual winners Brisbane, going down 16–22., 133783=2003–2005, 25129=The Warriors' first year in the Australian Rugby League was 1995. Their debut match was against the Brisbane Broncos on 10 March 1995 in front of 30,000 people at a newly refurbished Mt Smart Stadium. The Warriors led 22–10 at one point in the second half of the match, however the Broncos finished far stronger and defeated the new club 25–22., 53755=Before the National Rugby League season 2004 started, there were predictions of the Warriors having a highly successful season. These were proved wrong, as the Warriors managed to only win six games to finish equal last, only escaping the wooden spoon by having a superior points differential to South Sydney. Coach Daniel Anderson resigned mid-season after an embarrassing 52-point loss to the Sydney Roosters. His assistant Tony Kemp was given the head coach position, and in his first game in charge the Warriors recorded an emotional 20–14 win over Canberra. A week later, the Warriors' first match in Christchurch since 1996 was a flop, as the Warriors were destroyed by the Wests Tigers 4–50. The season finished with an embarrassing six-game losing streak., 130296=1995–1996, 70208=In week two of the playoffs, the Warriors came from behind to defeat the Sydney Roosters 30–13 at Mt. Smart Stadium. The Roosters led 13–6 at halftime before a second-half comeback saw the Warriors pile on twenty-four unanswered points to earn the Warriors a place in the preliminary finals. This was the first time since 2003 that the Warriors have reached the grand final qualifier, and third overall in 14 seasons. They however went down heavily to an inspired Manly Sea Eagles 32–6., 25750=A home crowd attendance record of 32,174 was set at Ericsson Stadium in Round 6 of the 1995 ARL season, a record that was not topped until Round 1 of the 2011 NRL season.[1], 132042=2000, 50145=2003 was another quite successful year for the Warriors., 38726=Former Kiwi Mark Graham took over as coach in 1999. The club was sold off to a consortuim that included ex-Kiwi coach Graham Lowe and the Tainui tribe. The club again disappointed on field, but a mid season ultimatum saw a strong finish to the season, with the side winning five of their last six games. The signs appeared promising for the new millennium., 68144=The 2008 season did not start as brightly for the club, losing Wade McKinnon for much of the year during a pre-season loss to Newcastle, and losing captain Steve Price (rugby league) for ten weeks, as well as injuries to other key players Manu Vatuvei, Jerome Ropati and Michael Witt. The team remained in contention for much of the season, however often performed very poorly away from Mt Smart Stadium, and suffered their first loss to South Sydney (28–35) since 1999, and went on to lose to the Rabbitohs again later in the season (16–18). Despite poor results away, strong home form and a now common revival in the second half of the season saw the Warriors make the top eight for the second season running, incredibly despite spending only three weeks in the top eight all season. A top-eight berth was secured in the last game of the season, when the Warriors defeated the Parramatta Eels 28–6 at Parramatta Stadium, marking the first time since 1995 that the Warriors had won away to Parramatta., 60702=The Warriors finished the season on a positive note leaving room for optimism for 2007 and beyond. They caused arguably the upset of the season, defeating the Minor Premiers Melbourne 24–20 at Olympic Park Stadium in Melbourne, preventing the Storm from going the full regular season unbeaten at home., 80237=The Warriors would again start the match as heavy underdogs and with a side boasting only three players who had previously played in a Grand Final (Manly on the other hand could boast their coach and eight players who had won the 2008 NRL premiership with the club, plus another who had won a premiership in 2003 with Penrith). Heavy defense from both sides was the feature until the Warriors opened the scoring with a penalty goal to James Maloney in the 28th minute, but a little more than a minute after the restart, a bad read in defense saw prolific try scorer Brett Stewart in for the 1st try. Just before the break, the Warriors were then unlucky not to receive a penalty for obstruction in the lead up to Manly's second try which saw them go into the sheds down 12-2. A further try to Clive Churchill Medal winner Glenn Stewart in the 57th minute saw Manly's lead out to 18-2. The Warriors refused to die however, and clawed their way back with tries to Manu Vatuvei and Elijah Taylor in the 63rd and 68th minutes. Unfortunately Maloney missed both conversions which could have taken the score to 18-14 and a grandstand finish, but a try to Manly captain Jamie Lyon with only a minute remaining put the result beyond doubt as the Warriors were beaten by a clinical Manly outfit 24–10 – yet their effort in reaching just their second ever Grand Final (and their first in nine years) was a triumph for the club and departing coach Ivan Cleary and won praise from those in the NRL., 65549=On 30 May the Warriors signed Australian Kangaroos' centre, Brent Tate from 2008 to 2010 in what was described as a \"major coup\" for the New Zealand club., 32399=The Australian Rugby League season 1996 could have been regarded as a better one for the Warriors. The Warriors found themselves siding with the Super League during the Super League War when the New Zealand Rugby League signed up to the rebel competition. They claimed their first 'victory' over the Broncos in round one of the competition that year, after all Super League clubs agreed to boycott the first round of the competition in protest. The Warriors won the two points when they travelled to Brisbane with a squad of players that were unsigned to Super League, forcing the Broncos to forfeit the match., 134656=2006–2008, 60238=On 25 June the Warriors recorded their largest ever win, defeating South Sydney 66–0 at Telstra Stadium, as part of a four-match winning streak that claimed the scalps of the Sydney Roosters, Newcastle Knights, and also the Penrith Panthers. This streak was ended in an 18–22 golden-point loss to the Bulldogs, in a game where the Warriors surrendered an early 16–0 lead., 37063=The first season of the reformed competition was a year that saw few highlights for the club. It was readily apparent that the club needed a new approach and attitude. Fortunately for them, they were in a better position than the other two clubs that joined the competition in 1995., 40805=In National Rugby League season 2000 the Warriors could only finish second last. This season included the Warriors' largest ever loss, 54–0 to the Dragons in Wollongong. Alarmingly, the problems off-field overshadowed the on-field problems. The majority shareholders were under intense financial pressure, and the club's future was looking bleak at best. The key assets of the club were purchased by business tycoon Eric Watson. This did not include player contracts, and many players were released and had to fight to get the money they had been promised. Ultimately only 10 players from the 2000 season were retained., 78085=The Warriors began the 2011 season with an historic match Auckland's Eden Park, the first regular season home game the club had played away from Mt Smart Stadium. The match drew a record home game crowd for the Warriors of 38,405 however unfortunately the Warriors could not repay the large crowd with a victory as they were beaten 24–18 by the Parramatta Eels. The Warriors went on to lose their following two matches and it appeared that Warriors fans were in for another season of disappointment. To their credit the Warriors bounced back and were in the running for a top four position late in the season but finished in 6th spot. Midway through the season coach Ivan Cleary was approached by the Penrith Panthers and was appointed as their coach for the 2012 season. Cleary remained coach for the remainder of the 2011 season with Brian McClennan appointed his successor for 2012. One of the highlights of the season was the unearthing of young halfback Shaun Johnson who played a key role as the Warriors approached the 2011 finals series., 22393=Although three NSWRL premiership games were played at the historic Carlaw Park ground in Auckland in 1992 and 1993, the old ground only had a spectator capacity of 17,000 and was starting to fall into disrepair. Ultimately the new club chose to play their home games at the Mount Smart Stadium, which had been the preferred Auckland venue for the New Zealand national team since 1989 as well as the host venue of the 1990 Commonwealth Games. Mt Smart also had a spectator capacity of 30,000 - almost double that of Carlaw Park., 126054=1995–2014, 7436=For the 1995 season the newly formed Auckland Warriors became the first off-shore club to be admitted to the Australian Rugby League's premiership when it expanded from 16 to 20 teams. As a result of the mid-1990s' Super League war, Auckland left the ARL to compete in the Super League competition of 1997, before joining the re-unified NRL the following year. They re-branded themselves the New Zealand Warriors in 2001. Over seventeen seasons the Warriors have claimed one minor premiership (in 2002), reached two grand finals (2002 and 2011), reached the play-offs 7 times, and provided the majority of the New Zealand national team's players., 56531=2005 was an improvement over the horror scenes of 2004. The team remained competitive for all of their matches, and their largest loss was only 18 points. The team had a good chance to make the finals, however a four match losing streak late in the season removed those chances. The season was tinged with sadness, as it was announced it would be star halfback Stacey Jones last season with the club before he would join French Super League club, Catalans Dragons. His last match for the team against Manly at Brookvale Oval was a fine way for him to sign off with the club as he scored the match-winning try with three minutes to go in a 22–20 victory., 116772=Updated: 10 April 2015 Source(s): Vodafone Warriors Squad 2014, 82282=2011 was a successful season all-round for the New Zealand Warriors, with all three grades reaching the Grand Final. The clubs NYC team defeated the North Queensland Cowboys 31-30 in golden point extra time in the NYC Grand Final to win their second premiership, while NSW Cup affiliate the Auckland Vulcans went down 30-28 after conceding a last minute try to Canterbury-Bankstown in the NSW Cup Grand Final., 46544=The Warriors reached their zenith to date in the National Rugby League season 2002. They won the Minor Premiership, finishing in first place at the conclusion of the regular season after the Bulldogs lost 37 competition points late in the season due to severe salary cap breaches. The club played what stands as the first finals match to have been held outside Australia at Mt Smart Stadium in the first week of the Finals Series. The Warriors would defeat their bogey side Canberra 36–20 after surviving an early scare., 20364=Rugby league was largely centred around Auckland ever since the New Zealand Rugby League was founded in 1909. Auckland produced the bulk of the international squad for many years, and most of these players headed to either Australia or Great Britain to play., 132910=2001–2002, 41683=The club was re-branded as the New Zealand Warriors, with new colours of black and grey – resembling the national sporting colours. New coach Daniel Anderson and CEO Mick Watson focused on signing unknown New Zealand talent. There were only six Australians in the 2001 squad, and only three foundation players – Monty Betham, Stacey Jones and Logan Swann., 135592=2009–2011, 59274=National Rugby League season 2006 got off to a bad start for the club. In February, the Warriors were found to have committed major breaches of the salary cap in 2005. This followed the high profile signings of Steve Price and Ruben Wiki. On 27 February the NRL announced the club would be deducted four competition points and the club would also be fined A$430,000., 21285=In 1988, serious investigation into an Auckland team entering the New South Wales Rugby League premiership commenced, encouraged mainly by the Mt Albert club. On 17 May 1992, the announcement stating an Auckland-based team's entry into the Australian Rugby League competition, the Winfield Cup in 1995, was made. This followed very good turnouts to a number of NSWRL club games played in Auckland. The new team was to be called the Auckland Warriors and run by the Auckland Rugby League organisation. The original colours selected were blue, white, red and green. Blue and white are recognised as the colours of Auckland, while red and green were the colours of the Warriors' original sponsor, DB Bitter. The original logo was designed by Francis Allan, of Colenso., 75460=Expectations were not high for the Warriors in 2010 after a disappointing 2009 season. The Warriors bolstered their playing stocks in the pivotal play-making positions by signing badboy Brett Seymour after he was cut by Cronulla and James Maloney from Melbourne. In arguably one of their best ever performances they humbled the Brisbane Broncos 48–16 at Suncorp Stadium in Round 3, with Maloney tying a club-record with 28 points (3 tries and 8 goals). Kevin Locke scored a hat-trick in the Warriors miraculous 20–18 win over the Sydney Roosters at AMI Stadium in Christchurch, narrowly escaping a serious hip injury after a high-speed collision with the goal-post (in the process of scoring the game-winning try). The Warriors won five matches in a row for the first time since late in the 2003 season and finished in 5th position in the regular season. They were knocked out of the finals series in the first week, losing to Gold Coast Titans., 72131=2009 started with the loss of young up-and-comer Sonny Fai, who tragically drowned at Bethels Beach, near Auckland. He had gone into dangerous surf to rescue some relatives but was probably sucked under by a rip. Almost as if using the occurrence as an inhibitor, the Warriors had a very disappointing year, despite winning the opening two rounds against eventual grand finalists Parramatta Eels 26–18 and reigning premiers Manly Sea Eagles. After those great wins they proceeded to win a poor 1 of 8 games including a draw. They did however manage to beat West Tigers 14–0 and the Knights 13–0 keeping both opponents scoreless, but it was the poor attacking that had every league fan questioning. and ultimately saw them lose their next 3 matches by heavy scores. They did beat the Roosters 30–24 at SFS and Raiders 34–20 at Mt Smart Stadium. But in the end the Warriors lost their final two games against the Bulldogs in Hazem El Masri's last home game [before finals] and ultimately ended their poor season in a bad way losing 0–30 to the eventual premiers Melbourne Storm., 84454=2012 was meant to promise so much for the Warriors following their grand final appearance of 2011. A new coach with a successful track record in Brian 'Bluey' McClennan, a stable squad and strong public support indicated that 2012 could have been the year they finally broke their premiership duck. The season again kicked off with a home game at Eden Park, with a strong crowd of 37,502 witnessing the Warriors go down 20-26 to Manly in a grand final rematch. The match was perhaps an indication of things to come, with the Warriors performing strongly on attack but being let down by weak defence at crucial stages which ultimately cost them the match.}",
    "lastModified": "Sat, 01 Aug 2015 18:58:30 GMT",
    "textBeforeTable": "Captains[edit] Dane Nielsen to St George Illawarra Dragons Carlos Tuimavave to Newcastle Knights[5] Jayson Bukuya to Cronulla Sharks Feleti Mateo to Manly Sea Eagles Jerome Ropati to Retirement Wayne Scurrah (Chief Executive Officer (from October 31, 2014)) Losses Jonathan Wright from Cronulla-Sutherland Sharks Api Pewhairangi from Parramatta Eels Bodene Thompson from West Tigers Matthew Allwood from Canberra Raiders Ryan Hoffman from Melbourne Storm Jim Doyle (Chief Executive Officer (from November 3, 2014)) Gains 2015 Signings/Transfers[edit] Kevin Locke to Salford Red Devils (Mid-Season release) Pita Godinet to Wakefield Wildcats Bill Tupou to Canberra Raiders Sio Siua Taukeiaho to Sydney Roosters Todd Lowrie to Brisbane Broncos Russell Packer to",
    "textAfterTable": "Coaches[edit] 1995–2014 Coach Tenure Matches Won Drawn Lost Winning Percentage John Monie 1995–1997 (sacked mid-season) 52 26 0 26 50.00% Frank Endacott 1997–1998 33 13 0 20 39.39% Mark Graham 1999–2000 50 18 2 30 36.00% Daniel Anderson 2001–2004 (resigned mid-season) 92 51 2 39 55.43% Tony Kemp 2004–2005 37 13 0 24 35.14% Ivan Cleary 2006–2011 137 68 3 66 49.63% Brian McClennan 2012–Round 24 2012 (Sacked 21 August) 22 8 0 14 36.36% Tony Iro Round 25 2012-Round 26 2012 (Caretaker Coach) 2 0 0 2 0% Matthew Elliott 2013-Round 5 2014 (Sacked 7 April) 29 13 0 16 44.8% Andrew McFadden Round 6 2014 – Present 19 10 0 9 52.63% Jerseys[edit] Home jerseys of the Warriors 1995–1996",
    "hasKeyColumn": true,
    "keyColumnIndex": 1,
    "headerRowIndex": 0
}