{
    "relation": [
        [
            "",
            "1",
            "2",
            "3",
            "4",
            "5",
            "6"
        ],
        [
            "RxCUI",
            "312241",
            "312241",
            "312241",
            "314199",
            "314199",
            "314199"
        ],
        [
            "RxNorm NAME",
            "PARoxetine 10 MG Oral Tablet",
            "Paroxetine 10 MG Oral Tablet",
            "paroxetine 10 MG (as paroxetine hydrochloride 11.38 MG) Oral Tablet",
            "PARoxetine 20 MG Oral Tablet",
            "Paroxetine 20 MG Oral Tablet",
            "paroxetine 20 MG (as paroxetine hydrochloride 22.76 MG ) Oral Tablet"
        ],
        [
            "RxTTY",
            "PSN",
            "SCD",
            "SY",
            "PSN",
            "SCD",
            "SY"
        ]
    ],
    "pageTitle": "DailyMed - PAROXETINE- paroxetine hydrochloride anhydrous tablet, film coated",
    "title": "",
    "url": "http://dailymed.nlm.nih.gov/dailymed/drugInfo.cfm?setid=605c1d23-c97c-4ea4-92d0-fed351de9d2e",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988317.67/warc/CC-MAIN-20150728002308-00113-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 57446983,
    "recordOffset": 57382309,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{1457=Revision Date: 04/04/2011, 1271=Anaheim, CA 92807}",
    "textBeforeTable": "Number of versions: 2 PAROXETINE- paroxetine hydrochloride anhydrous tablet, film coated View Label Archives for this drug View Label Archives, RxNorm, Get Label RSS Feed More Info on this Drug Medline Plus, Clinical Trials, PubMed, Biochemical Data Summary Related Resources Boxed Warnings, Report Adverse Events, FDA Safety Recalls, Presence in Breast Milk Safety (also available in the left menu) Find additional resources Close All Sections View All Sections Close REPACK(68788-0797, 68788-9074) 791119022 Preferred Pharmaceuticals, Inc Business Operations ID/FEI Address Name Establishment Labeler - Preferred Pharmaceuticals, Inc (791119022) 04/13/2007 ANDA077584 ANDA Marketing End Date Marketing Start Date Application Number or Monograph Citation Marketing",
    "textAfterTable": "2 312241 Paroxetine 10 MG Oral Tablet SCD 3 312241 paroxetine 10 MG (as paroxetine hydrochloride 11.38 MG) Oral Tablet SY 4 314199 PARoxetine 20 MG Oral Tablet PSN 5 314199 Paroxetine 20 MG Oral Tablet SCD 6 314199 paroxetine 20 MG (as paroxetine hydrochloride 22.76 MG ) Oral Tablet SY Get Label RSS Feed for this Drug PAROXETINE- paroxetine hydrochloride anhydrous tablet, film coated To receive this label RSS feed Copy the URL below and paste it into your RSS Reader application. https://dailymed.nlm.nih.gov/dailymed/labelrss.cfm?setid=605c1d23-c97c-4ea4-92d0-fed351de9d2e To receive all DailyMed Updates for the last seven days Copy the URL below and paste it into your RSS Reader application. https://dailymed.nlm.nih.gov/dailymed/rss.cfm What will I get with the DailyMed RSS feed? DailyMed will deliver notification of updates and additions to Drug Label information currently shown on this site through its RSS feed. DailyMed will deliver this notification to your desktop, Web browser, or e-mail depending on the RSS Reader you select to use. To view updated drug label links, paste the RSS feed address (URL) shown below into a RSS reader, or use a browser which supports RSS feeds, such as Safari for Mac OS X. How to discontinue the RSS feed If you no longer wish to have",
    "hasKeyColumn": true,
    "keyColumnIndex": 2,
    "headerRowIndex": 0
}