{
    "relation": [
        [
            "Company",
            "Shapeshifters Theatre",
            "Estuary Players",
            "Gaelic Park Players",
            "The Irish American Theatre Company",
            "Liffey Players Drama Society",
            "Heads on Stage (formally part of Holding Court Theatre)",
            "Irish Theatre of Florida",
            "Irish Players of Rochester (Rochester Community Players)",
            "Toronto Irish Players"
        ],
        [
            "City",
            "Chicago, IL",
            "Dublin, Ireland",
            "Chicago, IL",
            "Cincinnati, OH",
            "Calgary, AB",
            "Dublin, Ireland",
            "South Florida",
            "Rochester, NY",
            "Toronto, ON"
        ],
        [
            "Production",
            "And Neither Have I Wings to Fly",
            "There Came a Gypsy Riding",
            "The Patrick Pearse Motel",
            "Moll",
            "Portia Coughlan",
            "The Passion of Jerome",
            "Close to Home",
            "The Cripple of Inishmaan",
            "The Factory Girls"
        ],
        [
            "Author",
            "Ann Noble",
            "Frank McGuinness",
            "Hugh Leonard",
            "John B. Keane",
            "Marina Carr",
            "Dermot Bolger",
            "Pat Clark",
            "Martin McDonagh",
            "Frank McGuinness"
        ]
    ],
    "pageTitle": "Acting Irish International Theatre Festival - Wikipedia, the free encyclopedia",
    "title": "",
    "url": "https://en.wikipedia.org/wiki/Acting_Irish_International_Theatre_Festival",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042991076.30/warc/CC-MAIN-20150728002311-00130-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 857130587,
    "recordOffset": 857099396,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{12099=The Acting Irish International Theatre Festival (AIITF) is an annual festival of full-length Irish plays performed by Irish community theater companies from Canada, US and Ireland. The festival was started in 1994 and is performed in a different city each year. The host city for the AIITF in 2013 is Chicago, Illinois., 1673=The concept of the Acting Irish International Theater Festival (AIITF) was originated by three Irish community theater groups: the Tara Players of Winnipeg, Milwaukee Irish Arts, and Na Fianna Theatre of Minneapolis-St. Paul. These three groups held several invitational performances in each other's city between 1990–93,[1][2] and all three groups participated in the 1991 Milwaukee Irish Fest.[3] The Tara Players of Winnipeg participated in the Milwaukee Irish Fest in 1992 and 1993 as well, but because that festival was dedicated primarily to Irish music, the three groups co-founded the theater-only AIITF in 1994.[4] The first festival was held in Winnipeg, Manitoba, Canada March 10–13, 1994 and presented at the Tara Players' theater at the Irish Association of Manitoba.[5] One of the founders of the festival was Geoff White of the Tara Player of Ottawa.[6]}",
    "TableContextTimeStampAfterTable": "{77028=The Axis-Ballymun Theatre in Dublin, Ireland, hosted the 2012 Festival from May 14–19, 2012., 14661=The Gaelic Park Players hosted the AIITF in Chicago, Illinois May 25–30, 1999.[11], 67217=The 2010 AIITF was held May 17 to 22, 2010 at the Irish-American Heritage Center, 4626 North Knox Avenue, Chicago.[33], 51413=Milwaukee Irish Arts hosted the 2007 AIITF at the University of Wisconsin in Milwaukee, May 15 to 20., 72152=The Liffey Players Drama Society of Calgary, Alberta, Canada, hosted[35] the 2011 Festival at the Vertigo Theatre at the base of the Calgary Tower, from May 16–21, 2011., 6256=In 1997, the AIITF was held in Milwaukee, Wisconsin, USA at the Scottish Rite Cathedral, 790 N. Van Buren St. May 14–17. Adjudicators for this festival were Milwaukee actress Laura Gordon; Christopher Foreman, former artistic director of the Northern Arts and Cultural Center in Yellowknife, Northwest Territories, Canada; and Ray Yeates, who was the youngest director in the history of Dublin's Abbey Theatre.[8], 41030=The AIITF returned to Chicago in 2005,hosted by Gaelic Park Players at the Beverly Arts Center, 2407 W. 111th St., May 18–21, 2005.[24], 81405=The Festival was hosted by Chicago's Gaelic Park Players from May 21–25, 2013. The festival took place at Chicago's Gaelic Park, 6119 West 147th Street; Oak Forest, Illinois. The adjudicator for the festival was Brad Armacost. Attending the Awards Ceremony on May 26 was Aidan Cronin, Counsel General of Ireland, Chicago, Illinois.[38], 28781=The AIITF was held in the Capital of Canada, Ottawa, in 2002., 9828=The AIITF in 1998 returned to Winnipeg, Manitoba, and was held at the Gas Station Theatre May 13–16, 1998.[9] Groups from Toronto, Ottawa and Chicago joined the festival., 24773=In 2001, the AIITF was held in Denver, Colorado, USA, at the Courtyard Theatre, Auraria Campus, the University of Colorado Denver, on May 15–19, 2001.[14][15] The festival was hosted by Tir Na nOg, whose name mean in Irish (Gaelic) \"everlasting youth\".[16] A special performance by PHAMALy (Physically Handicapped Actors and Musical Artists League), as guests artists, was also presented at this festival., 9220=Note: The 2004 AIITF program lists the New York participant at the 1997 AIITF as the John Fitzgerald Theatre; the Milwaukee Journal Sentinel article of May 14, 1997, lists the group as the Thomas Davis Players., 8901=The Best Production award in 1997 was presented to Tara Players of Winnipeg, for their production of The Field. Tadhg McMahon of the Tara Players was also presented with the Best Supporting Male award for his performance as Tadhg McCabe., 1394=The 1995 AIITF was held March 9–11 at the Weyerhaeuser Auditorium in Landmark Center, 75 W. 5th St., St. Paul, Minnesota, USA. Five organizations participated, hosted by Na Fianna of Minneapolis-St. Paul.[7] The adjudicators were Mona Poehling, Dan Sullivan and Ethna McKiernan., 45779=The 2006 AIITF was hosted by the Toronto Irish Players at the Young Centre for the Performing Arts May 30 to June 3. The festival was hosted by the thirty-year-old Toronto Irish Players, which performed The Plough and the Stars by Sean O'Casey, featuring nine transplanted Dubliners in the cast.[26], 19682=The Toronto Irish Players, of [{Toronto]}, {[Ontario]}, Canada, hosted the AIITF in 2000. The festival included the North American debt of The Wheeping of Angles by Joseph O'Connor, brother of Sinéad O'Connor.[12], 56971=The Irish Players of Rochester, a program of the Rochester Community Players, hosted the 2008 AIITF at the Geva Theatre Center's NextStage Theatre May 13 to 17.[29] The festival included two long one-act plays by the young Dublin playwright, Conor McPherson, 31973=Innishfree Irish Theatre hosted the 2003 AIITF at The Crest Theatre, Del Ray Beach, Florida, May 11–17, 2003. The 2003 Festival also featured, for the first time, three groups invited from Ireland.[20] This festival featured the first North American production of Paddy Irishman, Paddy Englishman, and Paddy. . .? by Declan Croghan.[21], 88320=The Festival in was hosted by the Irish Theatre of Florida from May 20–25, 2014. The festival took place at the Artns Garage, 180 NE 1st Street, Delray Beach.[40] The adjudicator for the festival was John Countryman, Director of Theatre at Berry College in Georgia., 36517=The 2004 AIITF returned to Winnipeg for the third time, hosted by the Tara Players at the Manitoba Theatre for Young People) May 20–22, 2004.[23], 62415=For the fourth time, the Tara Players of Winnipeg hosted the AIITF, in May 2009.[30][31], 3618=In 1996, the AIITF was held in Calgary, Alberta, Canada May 15 to 19, 1996 at the Irish Cultural Center. The festival adjudicators were Christopher Foreman, Pat Benedict, and Dr. Richard Wall. Six groups participated:, 56040=In addition to the seven adjudicated productions, the 2007 Festival included two special presentations: Townlands, by Dermot Bolger; a reading presented by the students of the Theater Department of the University of Wisconsin at Milwaukee. Sneak preview of Walking the Road, also by Dermot Bolger. This play about Francis Ledwidge, a young Irish poet who lost his life in Flanders fields in 1917, while serving with the British army in World War I, had its world premiere at Axis Arts Center in Dublin June 9, 2007., 28020=The Best Production award in 2001 was presented to Innisfree Irish Theatre for their production of The Cripple of Innishmaan, by Martin McDonagh. Sean Mac Donnchadha, of Innisfree Irish Theatre, received the acting award for Best Lead Male Actor as JohnnyPateenMike in The Cripple of Innishmaan}",
    "lastModified": "Sat, 25 Jul 2015 10:24:18 GMT",
    "textBeforeTable": "The concept of the Acting Irish International Theater Festival (AIITF) was originated by three Irish community theater groups: the Tara Players of Winnipeg, Milwaukee Irish Arts, and Na Fianna Theatre of Minneapolis-St. Paul. These three groups held several invitational performances in each other's city between 1990–93,[1][2] and all three groups participated in the 1991 Milwaukee Irish Fest.[3] The Tara Players of Winnipeg participated in the Milwaukee Irish Fest in 1992 and 1993 as well, but because that festival was dedicated primarily to Irish music, the three groups co-founded the theater-only AIITF in 1994.[4] The first festival was held in Winnipeg, Manitoba, Canada March 10–13, 1994 and presented at the Tara Players' theater at the Irish Association of Manitoba.[5] One of the founders of the festival was Geoff White of the Tara Player of Ottawa.[6] 1994 Festival; Winnipeg[edit] 23 External links 22 References 21.2 2014 Awards[42] 21.1 2014 Productions (in order of presentation)[41] 21 2014 Festival; Delray Beach, Florida 20.2 2013 Awards[39] 20.1 2013 Productions (in order of presentation)[38]",
    "textAfterTable": "Na Fianna Minneapolis-St. Paul, MN Famine Tom Murphy Lartigue Theatre Listowel, Ireland The Estuary and The Tentmaker Paddy Fitzgibbon 1996 Festival; Calgary[edit] In 1996, the AIITF was held in Calgary, Alberta, Canada May 15 to 19, 1996 at the Irish Cultural Center. The festival adjudicators were Christopher Foreman, Pat Benedict, and Dr. Richard Wall. Six groups participated: Company City Production Author Milwaukee Irish Arts Milwaukee, WI Moll John B. Keane Ashling Productions Calgary, AB The Death of Humpty Dumpty Graham Reid Tara Players Winnipeg, MB The Sea Horse Edward J. Moore Stage Éireann Dramatic Society Vancouver, BC The Love of Cass McGuire Brian Friel St. Albert Irish Society St. Albert, Alberta Time Was Hugh Leonard Prince George Theatre Workshop Prince George, BC Someone to Watch Over Me Frank McGuiness In addition to these formal festival productions, two \"showcase\" (non-adjudicated) productions were presented: Winners (from Lovers: Winners and Losers) by Brian Friel, presented by the Liffey Players of Calgary, and Bag Lady, by Frank McGuiness, presented by Patabesin Productions, Calgary. 1997 Festival; Milwaukee[edit] In 1997, the",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}