{
    "relation": [
        [
            "Categories",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "The best things to do for fun, would be to take a walk around campus, there are tons of little spots and little things that students can do for fun.",
            "The food is good, there is a school cafeteria as well as several other places on campus to eat.",
            "The Resident Assistants are always available to help, and have many ideas and activties for fun.",
            "the teachers and classes will challenge you but no to the point that you can not succed.",
            "Join clubs and organizations to get to know more people around you.",
            "The University has a wonderful environment, that gives students the greatest opportunities for learning, growing and devolping into well rounded people. My University also gives every opportunity for success with multiple programs for students succed. Finally my university has a multitude of clubs, orgianizations and activites for students to feel comfortable in their surroundings."
        ]
    ],
    "pageTitle": "University of Southern Indiana (USI) Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/University-of-Southern-Indiana/reviews?_escaped_fragment_=/show/113067",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042991076.30/warc/CC-MAIN-20150728002311-00011-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 896519791,
    "recordOffset": 896457998,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{196115=The food there is really good, but there is a ridiculous line from 11-12:45 everyday. If you can make it there before or after though, you'll be fine., 274609=GET INVOLVED. May that be greek life, or your major. Most of my grief from my freshman year was that I was lonely and didn't have much too do. I'm not very social, but once I got involved with my major and got an on campus job, this school is really really growing on me!, 284414=© 2015, Cappex.com, LLC}",
    "textBeforeTable": "01/05/2011 Reviewer is A current student here. 8 out of 8 people found this review useful. 1 of 64 Shannon from Bloomington, IN Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for",
    "textAfterTable": "Stacie from Lebanon, IN 07/31/2011 Reviewer is A current student here. 3 out of 3 people found this review useful. 2 of 64 Categories Comments Great for these types of students USI is great for any student who wants a big university education with a small, friendly campus. The university is small enough to stand out and make a name for yourself if you want, but also big enough to let yourself blend in if you so choose. Tips for prospective students Visit campus during one of USI's Southern Hospitality Days. They give you a tour of campus including the dorms and let you meet some of the faculty. They also break you up into groups depending on what field of study you might be interested in and let those groups meet with professors and faculty who are in that area. Going to a Southern Hospitality Day really lets you get the feel of the campus and decide if it is right for you. Bang for the buck The education and overall academic setting",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}