{
    "relation": [
        [
            "Command",
            "ipv4 access-group",
            "ipv4 access-list",
            "permit (IPv4)",
            "remark (IPv4)",
            "resequence access-list ipv4",
            "show access-lists ipv4"
        ],
        [
            "Description",
            "Filters incoming or outgoing IPv4 traffic on an interface.",
            "Defines an IPv4 access list and enters IPv4 access list configuration mode.",
            "Sets the permit conditions for an IPv4 access list",
            "Inserts a helpful remark about an IPv4 access list entry.",
            "Changes the starting entry number of the first statement in an existing IPv4 access list, and the number by which subsequent statements are incremented.",
            "Displays the contents of all current IPv4 access lists."
        ]
    ],
    "pageTitle": "Cisco IOS XR IP Addresses and Services Command Reference for the Cisco CRS Router, Release 4.1 - Access List Commands [Cisco IOS XR Software (End-of-Sale)] - Cisco",
    "title": "",
    "url": "http://www.cisco.com/c/en/us/td/docs/routers/crs/software/crs_r4-1/addr_serv/command/reference/b_ipaddr_cr41crs/b_ipaddr_cr41crs_chapter_01.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988317.67/warc/CC-MAIN-20150728002308-00278-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 375194235,
    "recordOffset": 375132599,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{161566=Rate at which IPv4 access hit logs are generated per second on the router. Range is 1 to 1000., 116039=This argument must be in the form documented in RFC 2373 where the address is specified in hexadecimal using 16-bit values between colons., 295038=This source-ipv6-address argument must be in the form documented in RFC 2373 where the address is specified in hexadecimal using 16-bit values between colons., 118912=This destination-ipv6-address argument must be in the form documented in RFC 2373 where the address is specified in hexadecimal using 16-bit values between colons., 163400=The rate-number argument applies to all the IPv4 access-lists configured on the interfaces. That is, at any given time there can be between 1 and 1000 log entries for the system., 220123=Maximum range was changed from 2000 to 16000., 218673=1000 IPv6 ACLs can be configured., 200760=The rate-number argument applies to all the IPv6 access-lists configured on the interfaces. That is, at any given time there can be between 1 and 1000 log entries for the system., 218316=Maximum number of configurable ACLs allowed. Range is 1000 to 16000., 198926=Rate at which IPv6 access hit logs are generated per second on the router. Range is 1 to 1000.}",
    "textBeforeTable": "Syntax Description clear access-list ipv4 access-list name [ sequence-number | hardware { ingress | egress}] [interface type interface-path-id] [ location node-id | sequence number ] To clear IPv4 access list counters, use the clear access-list ipv4 command in EXEC mode. clear access-list ipv4 show access-lists ipv6 standby show access-lists ipv6 show access-lists ipv4 standby show access-lists ipv4 show access-lists afi-all resequence access-list ipv6 resequence access-list ipv4 remark (IPv6) remark (IPv4) permit (IPv6) permit (IPv4) ipv6 access-list maximum acl threshold ipv6 access-list maximum ace threshold ipv6 access-list log-update threshold ipv6 access-list log-update rate ipv6 access-list ipv6 access-group ipv4 access-list log-update threshold ipv4 access-list log-update rate ipv4 access-list ipv4 access-group deny (IPv6) deny (IPv4) copy access-list ipv6 copy access-list ipv4 clear access-list ipv6 clear access-list ipv4 For detailed information about ACL concepts, configuration tasks, and examples, refer to the Cisco IOS XR",
    "textAfterTable": "Note    Use the show interfaces command to see a list of all interfaces currently configured on the router. For more information about the syntax for the router, use the question mark (?) online help function. location node-id (Optional) Clears hardware resource counters from the designated node. The node-id argument is entered in the rack/slot/module notation. sequence number (Optional) Clears counters for an access list with a specific sequence number. Range is 1 to 2147483646. Command Default The default clears the specified IPv4 access list. Command Modes EXEC Command History Release Modification Release 2.0 This command was introduced. Release 3.2 The range for the sequence-number",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}