{
    "relation": [
        [
            "Chemical Formula",
            "H2SO3(aq)",
            "Cr(HCO3)2",
            "BF3",
            "HCl(aq)",
            "CH3CH2CH2CHFCH2CH3",
            "",
            "",
            "",
            ""
        ],
        [
            "Chemical Name",
            "",
            "",
            "",
            "",
            "",
            "iron(II) hydroxide",
            "calcium nitrite",
            "lithium oxalate trihydrate",
            "2?octanol"
        ],
        [
            "Oxidation state of the indicated atom",
            "S= I want this",
            "C= I want this",
            "B=I want this",
            "H=I want this",
            "Not required",
            "O=I want this",
            "N=I want this",
            "C=I want this",
            "Not required"
        ]
    ],
    "pageTitle": "Chemistry Archive | September 26, 2013 | Chegg.com",
    "title": "",
    "url": "http://www.chegg.com/homework-help/questions-and-answers/chemistry-archive-2013-september-26",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042991076.30/warc/CC-MAIN-20150728002311-00175-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 355372699,
    "recordOffset": 355208438,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{39330=kp(atm^-1/2)=Pso3/(Pso2*Po2^(1/2))=1.53X10^-5*exp(11750/T), 38174=It is desired to maintain the cold box of a refrigerator at 0 C by removing 1000 kJ/h of heat.}",
    "TableContextTimeStampAfterTable": "{241997=results in 1.1518 g carbon dioxide and 0.2694 g water. Its molecular mass is 216.2 g/mol. Determine the empirical formula and molecular formula of the compound., 31816=You are asked to calibrate a 25.00 mL volumetric pipet. You determine that the temperature of your distilled water is 24.5°C. You carefully determined the mass of a clean dry beaker and found that it was 58.1884 g. You pulled water up to the mark and transferred this to the beaker and found that the new mass was 82.9658 g. What is the actual volume delivered by the pipet?, 526562=The half life for the radioactive decay of C-14 is 5730 years and is independent of the initial concentration. How long does it take for 25% of the c-14 atoms in a sample of C-14 to decay? If a sample of C-14 initially contains 1.5 milimoles of C-14, how many milimoles are left after 2255 years?, 124710=3.) Preparation of a  standard solution containing 10 mg/L (ppm) caffeine and 10 mg/L benzoic acid in a 100-mL volumetric flask using the primary stock solutions of 1000 ppm caffeine and 1000 ppm benzoic acid., 269764=A brand of lunchmeat contains 0.11% by mass of a preservative, sodium benzoate, C6H5COONa. Health Canada recommends a an upper level intake of Na to be 2300 mg. How many ounces (oz) of the meat must be ingested for a person to meet this level?, 75442=A student's calculator spits out the average as 0.1043234 and the standard deviation as 0.0005810 for 5 measurements. What is the 95% CL? 0.1043 ± ______, 157576=Compound A has a parent peak of M+ = 95 m/z in its mass spectrum and shows a medium intensity sharp infrared absorption band at 2280 cm. The HNMR of compound A shows 3 signals in a 4:4:1 ratio. Treatment of compound A with hot aqueous acid generates compound B (M+= 113 m/z) can be transformed back to A by using SoCl2. Finally compound B can be transformed with lithium aluminum hydride (ether) then aqueous acid to compound C (M+ = 99 m/z). What are A, B, and C, 313597=A 0.5200 g sample containing ammonium oxalate, (NH4)2C2O4 , and inert compounds was dissolved in water and made alkaline with KOH. The liberated NH3 was distilled into 50.00 mL of 0.1007 M H2SO4 . The excess H2SO4 was back titrated with 17.40 mL of 0.1700 M NaOH. a. Calculate the mmoles of (NH4)2C2O4 in the sample. ammonium oxalate mmole b. Calculate the %(w/w) (NH4)2C2O4 in the sample. %, 231897=A mixture of Ne and Cl2 in a flask at 33.0C exerts a pressure of 1957 torr. All of the Cl2 is removed and the pressure is now 1203 torr ( T remains constant). The Cl2 removed occupies a 10.0 L container at .500 atm at 25C. How many g of Ne are present in the original container?, 693016=© 2003-2015 Chegg Inc. All rights reserved., 29427=It is desired to maintain the cold box of a refrigerator at 0 C by removing 1000 kJ/h of heat. The refrigerator rejects heat to the atmosphere at 24 C. The work to run the refrigerator is supplied by a heat engine that has a high temperature heat source at 282 C and rejects heat to the environment at 27C. Determine the rate of heat transfer to theheat engine if both devices are reversible and all of the power output from the heat engine is used to supply the refrigerator, 382133=What is the molar mass of 1-butene if 5.38 × 1016 molecules of 1-butene weigh 5.00 ?g?}",
    "textBeforeTable": "Complete the following table. Show more O... RedTiger2012 asked 0 answers Show less • I do not quite understand how to solve these problems. Thanks! 4) 0.010M in La(NO3)3 and 0.0070M in Fe(NO3)2 3) 0.10M in FeCl3 and 0.80M in FeCl2 2) 0.10M (NH4)2CrO4 1) 0.010M FeSO4    Calculate the ionic strength of a solution that is: Show more 3) 0.10... Pirsius asked 0 answers Please I need the answer for question 14.13 ameeno asked",
    "textAfterTable": "2 answers RedTiger2012 asked A brand of lunchmeat contains 0.11% by mass of a preservative, sodium benzoate, C6H5COONa. Health... Show more A brand of lunchmeat contains 0.11% by mass of a preservative, sodium benzoate, C6H5COONa. Health Canada recommends a an upper level intake of Na to be 2300 mg. How many ounces (oz) of the meat must be ingested for a person to meet this level? • Show less 1 answer JuveinsJinn asked Complete the Newman projection below to draw the most stable conformation of 3-methylpentane, looki... Show more Complete the Newman projection below to draw the most stable conformation of 3-methylpentane, looking down the C?C bond. Identify each substituent using \"H\"",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}