{
    "relation": [
        [
            "SunOS release 4 Command",
            "vacation (1)",
            "val (1)",
            "vax (1)",
            "vedit (1)",
            "vfontinfo (1)",
            "vgrind (1)",
            "vi (1)",
            "view (1)",
            "vipw (8)",
            "vmstat (8)",
            "vplot (1)",
            "vswap (1)",
            "vtroff (1)",
            "vwidth (1)"
        ],
        [
            "SunOS release 5.7 Status",
            "S",
            "S",
            "S",
            "S",
            "N",
            "S",
            "S",
            "S",
            "N",
            "C",
            "N",
            "N",
            "N",
            "N"
        ],
        [
            "Alternative Available and Notes",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "The -f option is no longer available.",
            "",
            "",
            "",
            ""
        ],
        [
            "BSD",
            "N",
            "N",
            "N",
            "N",
            "N",
            "N",
            "N",
            "N",
            "S",
            "N",
            "S",
            "N",
            "N",
            "N"
        ]
    ],
    "pageTitle": "Appendix A Commands Reference Table (Solaris Transition Guide)",
    "title": "",
    "url": "http://docs.oracle.com/cd/E19455-01/805-6331/6j5vgg6ag/index.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042991076.30/warc/CC-MAIN-20150728002311-00156-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 70862375,
    "recordOffset": 70834119,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{60618=In the SunOS release 4 command, the size used for the size suffix w (words) is in units of 4 bytes, while in SunOS release 5.7 system software, w is in units of 2 bytes. k, b, or w may be used as a suffix to specify multiplication by 1024, 512, or 2, respectively. The unblock and block conversion options are new., 116431=The port range differs between the SunOS release 4 and SunOS release 5.7 commands. In SunOS release 4 system software, the range is 512-1023; in SunOS release 5.7 system software, it is 0-1023. , 242363=The following SunOS release 4 options are not supported by SunOS release 5.7 stty command: decctlq, tandem, cbreak, ctlecho, prterase, crtkill, cols, tab3, crt, dec, term.}",
    "lastModified": "Thu, 03 Feb 2011 11:15:37 GMT",
    "textBeforeTable": "Table A-1 Table Entry Example 1 Table A-1 through Table A-4 show sample table entries and are followed by an interpretation Examples For complete information on all Solaris 7 interfaces, see man Pages(1): User Commands. Commands that exist in both /usr/bin and /usr/5bin have two table entries, the first documents the /usr/bin command, and the second entry documents the /usr/5bin command. The SunOS release 5.7 directory structure is different than the SunOS release 4 structure; some commands behave the same, but have a different path name. For example, the SunOS release 4 /usr/etc/newfs command now resides in /usr/sbin/newfs, but the interface has not changed. This command, and others like it, are considered the same (S) according to this table's guidelines. Note - If an interface is listed as not available (N), check the Notes section for information about its replacement. Replacement commands, when available, are also shown in the SunOS release 5.7 column. If an interface has an alternative (A), check the Notes section for its replacement. If an interface is listed as the same (S), the Solaris 7 interface supports all features of the SunOS release 4 interface. In some cases the interface has been enhanced, but can be considered a complete superset of the SunOS release 4 interface. If an interface is listed as changed (C), a brief description of differences between SunOS release 4 command and the Solaris",
    "textAfterTable": "The SunOS 4.2 rev command is not available in the SunOS release 5.7 software or the BSD release. There is no replacement command available. Commands Reference Table The following tables list all SunOS release 4 command interfaces, and shows their status in the Solaris 7 environment and in the SunOS/BSD Source Compatibility Package. Table A-5 Commands Reference Table: ac through awk SunOS release 4 Command  SunOS release 5.7 Status  Alternative Available and Notes  BSD  ac (8) A  The System Accounting Resource package (SAR) provides most of the accounting capabilities available in ac. N  acctcms (8) S    N  acctcom (8) S    N  acctcon1 (8) S    N  acctcon2 (8)",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}