{
    "relation": [
        [
            "Play Type",
            "Substitution",
            "Walk",
            "Out",
            "Walk",
            "Walk",
            "Single",
            "Substitution",
            "Out"
        ],
        [
            "Play",
            "Jeremy Jeffress starts the inning for the Royals.",
            "Endy Chavez walked. Runner on first with none out and Elvis Andrus due up.",
            "Elvis Andrus sacrifice bunt to pitcher. On the play, Endy Chavez advances to second. Runner on second with one out and Ian Kinsler due up.",
            "Ian Kinsler walked. Runners on first and second with one out and Chris Davis due up.",
            "Chris Davis walked. Bases loaded with one out and Adrian Beltre due up.",
            "Adrian Beltre single to center scored Endy Chavez and Ian Kinsler with one out. On the play, Chris Davis advances to second. Runners on first and second and Mitch Moreland due up.",
            "Everett Teaford enters the game for the Royals with runners on first and second with one out.",
            "Mitch Moreland grounded into a double play, second to short to first On the play, Adrian Beltre out at second to end the inning."
        ]
    ],
    "pageTitle": "Wednesday, May 18, 2011 Texas Rangers - Kansas City Royals Box Scores, Game Results & Summary - USATODAY.com",
    "title": "",
    "url": "http://content.usatoday.com/sportsdata/baseball/mlb/game/rangers_royals/2011/05/18",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042991076.30/warc/CC-MAIN-20150728002311-00058-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 55742759,
    "recordOffset": 55726818,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{2349=View all MLB box scores for 5/18/2011}",
    "TableContextTimeStampAfterTable": "{43549=Royals starter Danny Duffy, making his major league debut, walked six batters and fanned four in four-plus frames. Duffy, a third round pick in the 2007 draft, had his contract selected from Triple-A Omaha. The move was made when the Royals placed pitcher Kyle Davies on the 15-day disabled list with right rotator cuff inflammation.}",
    "textBeforeTable": "Top of the 1st Chris Guccione  3B Mark Wegner  2B Mike Muchlinski  1B Mike Winters  H Umpires 4.50 1 2 0 0 0 0 0 0.2 Everett Teaford  4.70 10 23 0 3 2 2 1 0.1 Jeremy Jeffress (L, 1-1) 3.12 10 22 1 1 0 0 1 1 Blake Wood  4.32 12 19 0 1 1 1 1 1 Joakim Soria  0.84 9 17 1 0 0 0 1 1 Aaron Crow  2.96 19 30 2 0 0 0 0 2 Tim Collins  1.50 7 16 0 2 0 0 0 1 Louis Coleman  4.50 54 94 4 6 2 2 4 4 Danny Duffy  ERA Strikes Pitches SO BB ER R H IP Name 5.87 \" xmlns:fo=\"http://www.w3.org/1999/XSL/Format\" />Royals pitching http://i.usatoday.net/_common/_images/_sports/logos/mlb/royals_22t.png 13 22 2 1 1 1 1 1 Mark Lowe (S, 1) 3.97 4 9 0 1 0 0 0 0.2 Arthur Rhodes (W, 2-2) 1.32 14 26 1 2 1 1 3 1.1 Neftali Feliz (BS, 1) 2.50 7 10 1 0 0 0 1 1 Darren Oliver  2.13 73 116 5 1 2 2 4 7 Alexi Ogando ",
    "textAfterTable": "Out Melky Cabrera grounded out second to first. None on with two outs and Eric Hosmer due up. Out Eric Hosmer struck out swinging to end the inning. Top of the 2nd Play Type Play Out Mitch Moreland struck out swinging. None on with one out and Mike Napoli due up. Walk Mike Napoli walked. Runner on first with one out and David Murphy due up. Stolen-base Mike Napoli stole second. Runner on second with one out and David Murphy at the plate. Out David Murphy struck out looking. Runner on second with two outs and Craig Gentry due up. Out Craig Gentry struck out swinging to end the inning. Bottom of the 2nd Play Type Play Out Jeff Francoeur struck out swinging. None on with one out and Billy Butler due up. Out Billy Butler grounded out short to first. None on with two outs and Wilson Betemit due up. Single Wilson Betemit singled to left. Runner on first with two outs and Matt Treanor due up. Walk Matt Treanor walked. Runners on first and second with two outs and Chris",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}