{
    "relation": [
        [
            "Step",
            "1",
            "2"
        ],
        [
            "Tools",
            "Hands",
            "3mm hex key"
        ],
        [
            "Actions",
            "Slide the shifters onto either side of the handlebars",
            "Place the screws into each hole on the ring of each handle and tighten with hex key"
        ],
        [
            "Difficulty",
            "1",
            "2"
        ],
        [
            "Was the assembly the same as the disassembly?",
            "Yes",
            "Yes, but again the angle at which they are fastened is relevant due to rider preference."
        ],
        [
            "Notes (if applicable)",
            "The right hand shifter is the one with more gears.",
            "N/A"
        ],
        [
            "Picture",
            "",
            ""
        ]
    ],
    "pageTitle": "Difference between revisions of \"Group 29 - Kona Shred Mountain Bike\" - GICL Wiki",
    "title": "",
    "url": "http://gicl.cs.drexel.edu/index.php?title=Group_29_-_Kona_Shred_Mountain_Bike&diff=prev&oldid=177981",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042982502.13/warc/CC-MAIN-20150728002302-00258-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 109957407,
    "recordOffset": 109907148,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{43676=Quite simply the products intended use is to be ridden. Whether it is ridden as a alternate cost effective mode of transportation, competition, or just for recreational use is up to the owner. It can be used on multiple terrains and it works well in inclement weather. The 2005 Kona Shred is best suited for a budding enthusiast. Professionals may own one but they would most likely not use it at any events because they would compete with more customized high performance bikes that are better equipped to help them win; whereas the Kona Shred is built more for beginners. In essence the job of the 2005 Kona Shred is to not only provide transportation but also an enjoyable riding experience to its owner., 30715=This section explains the initial plan for the reverse engineering of the 2005 Kona Shred we have selected as our product. First, we will list the tooling we have determined to be required. Consequently, we will discuss our plan for disassembly., 165605=Using engineering analysis, we can determine the maximum force that can be applies to the brake lever that will cause braking, but will not cause the tire to skid. We can also use it to determine the distance needed to come to a complete stop when travelling at a certain speed. First, we must make assumptions to determine the parameters of our circumstance. Assume: -Ratio of Lever to Caliper is 16:1 -660mm wheel -63.5mm tire -90%mass on front wheel -140mm rotors -Coefficient of Friction of brake pads is .4 -Coefficient of Friction of the tire to the ground is .6 -No inputs other than braking -Riding on flat ground -No rolling resistance -Total mass is 70kg We then must determine the equations needed to complete the analysis sum(M)=0=(M1-M2) F(f)=C(f)*F(N) KE=.5(m)(V)^2 If we solve the equations with our given assumptions, we can figure out the maximum braking force, and the stopping distance required with our given parameters., 31563=As of Oct 9 this is our best estimation of the tools we will require in order to properly disassemble the bike. Metric Hex Keys: 2-10mm Adjustable wrench Metric Wrenches: 6-15mm Screwdrivers: 0, 2 Philips .25\" Straight Shimano Free Hub Locking tool Shimano Bottom Bracket tool, 26510=For our project we disassembled, analyzed, and re-assembled a 2005 Kona Shred bicycle. This included the free wheel assembly, the brake calipers, shifters, the drivetrain, and the derailleurs. We initially intended on analyzing the inner working of the suspension, but we were unable to acquire the proper tools necessary for the dissection., 42726=The Kona Shred bike we are working on was developed in 2005. At the time of its development there were rapidly growing global concerns over the excess production of green house gases that was occurring all over the world. In the United States there were many economic concerns over the rising fuel prices and the early signs that the economy was beginning to decline. Due to these economic and global concerns the developers of the Shred series focus became offering both experienced riders and newcomers a thoughtful, reliable, and well balanced mountain bike at an affordable price to riders all over the world. Kona is based out of Vancouver, BC and Ferndale, Washington and their bikes are sold in stores internationally. Currently they have partnerships with bike parks in countries such as Italy, the United Kingdom, the Czech Republic, and Austria.}",
    "textBeforeTable": "Sub-System Removal Dissection Documentation 3 or more Not able to complete Any specialized tools ex) Air compressor 5 2 More than 6 minutes 3 or more 4 2 5-6 minutes 2 or more 3 1 2-4 minutes 2 or more 2 1 Less than 2 minutes 1 or less 1 People Required Time Required Tools Required Difficulty During our dis-assembly process there was clearly a difference in difficulty for removing different parts of the bicycle. However, we needed a way to quantify these differences. So, to show these differences, our group decided to create a Likert scale from one to five, with five being the most difficult. In our particular scale, we used three different categories to quantify the difficulty of each step, number of tools required, time required, and people required. The difficulty can be determined by the highest corresponding difficulty of either of the three categories in the following table. Difficulty Scale Product Archaeology: Product Dissection Our Work Proposal also had a few conflicts arise during the dissection. To begin, we ran into a minor challenge when disconnecting the cables. We thought that we would simply have to loosen the nuts with an Allen wrench. However, when it came to removing them, we were forced to cut the end of the",
    "textAfterTable": "Remove Rear Derailleur 5mm hex Remove screw 1 5 Remove Front Derailleur 5mm hex Loosen screw clamp 1 6 Remove Pedals 14mm crescent Remove right pedal by turning counter-clockwise, left pedal by turning clockwise 3 7 Remove Crank Arms 10mm hex, special crank arm puller Remove cap screws, use puller to lift out cranks 5 8 Remove Hand Grips Compressed air blower Insert nozzle between grip and handlebar, blow air while pulling grip 5 9 Remove Brake and Shifter Levers 5mm hex Loosen clamp screws, slide off 2 10 Remove Handle Bars 5mm hex Remove screws on stem. Loosen screws clamping stem to fork. 1 11 Remove Stem 15mm crescent Remove fork cap. Lift stem and spacer out 1",
    "hasKeyColumn": true,
    "keyColumnIndex": 1,
    "headerRowIndex": 0
}