{
    "relation": [
        [
            "",
            "Home",
            "Total"
        ],
        [
            "I",
            "1",
            "1"
        ],
        [
            "O",
            "4.0",
            "4.0"
        ],
        [
            "M",
            "0",
            "0"
        ],
        [
            "R",
            "31",
            "31"
        ],
        [
            "W",
            "0",
            "0"
        ],
        [
            "Best",
            "0/31 v DEL",
            "0/31 v DEL"
        ],
        [
            "3w/5w",
            "0 / 0",
            "0/0"
        ],
        [
            "Avg",
            "-",
            "-"
        ],
        [
            "E/R",
            "7.75",
            "7.75"
        ],
        [
            "S/R",
            "-",
            "-"
        ]
    ],
    "pageTitle": "Bhuvneshwar Kumar | India Cricket | About Bhuvneshwar Kumar Stats, Records | NDTVSports.com",
    "title": "",
    "url": "http://sports.ndtv.com/india-vs-australia-2013/players/1250-bhuvneshwar-kumar-playerprofile",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042991076.30/warc/CC-MAIN-20150728002311-00198-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 222377583,
    "recordOffset": 222345299,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{143359=Bhuvneshwar Kumar got his name etched in the history books when he dismissed Sachin Tendulkar for his first first-class duck in Indian domestic cricket. The right-arm medium pacer was playing just his 11th first-class game.}",
    "TableContextTimeStampAfterTable": "{27692=Mar 22 2013,, 30384=Feb 22 2013,, 15217=Bhuvneshwar was picked by the Bangalore franchise in the Indian T20 League and represented the team for the first three seasons. In 2011, he was signed by Pune where he played more games than he did for Bangalore. Owing to some impressive performances in the domestic circuit, Bhuvneshwar was handed a national call-up when he was included in India's T20I squad against Pakistan. It was a fruitful debut, as he picked 3 wickets in his maiden international outing. His career graph took a snake-head climb from there on, turning into a consistent wicket-taker in ODIs. In his first Test series, against Australia, Kumar's new ball exploits helped India to their first clean sweep in a four-match Test series., 29478=Mar 02 2013,, 63785=© Copyright NDTV Convergence Limited 2015. All rights reserved., 14635=Another one of Indian crickets extracts from the state of Uttar Pradesh, his predecessors being Praveen Kumar and RP Singh, Bhuvneshwar Kumar is primarily known for his sharp in-swing and his ability to move the ball slightly away. Bhuvneshwar has been a consistent performer at the state level and also did well for his state's U19 side for two seasons, where he was preferred with the new ball ahead of either RP Singh or Praveen Kumar. Soon, he became a part of the UP senior side. He also came in handy with the bat, shedding himself off the \"tail-ender\" tag., 28585=Mar 14 2013,}",
    "textBeforeTable": "Bhuvneshwar Kumar",
    "textAfterTable": "Man of the Match Test - 0, ODI - 2, World Cup - 0, T20I - 0, IPL - 2, CL - 0, Career Span 2013 - 2015, 2012 - 2015, 2015, 2012 - 2015, 2011 - 2015, 2009, Bhuvneshwar Kumar got his name etched in the history books when he dismissed Sachin Tendulkar for his first first-class duck in Indian domestic cricket. The right-arm medium pacer was playing just his 11th first-class game. VIEW BHUVNESHWAR KUMAR FULL PROFILE Bhuvneshwar Kumar OVERLALL STATS Batting & Fielding Performance   M I N/O R HS 100s 50s 4s 6s Avg S/R Ct St Test 12 18 3 393 63* v ENG 0 3 59 0 26.20 46.61",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}