{
    "relation": [
        [
            "Categories",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "There's always campus activities going on like football, basketball, hockey games. River Falls also has a nice little downtown with a bunch of cute shops and cafes. The community really is a nice place, and it's not far from the Twin Cities if you want to visit a bigger city.",
            "The food is terrible. The meal plan themselves are way too expensive for what they serve. There are many times where I go there and end up eating cereal because the rest of the food sucks so bad. The drink selection is great, and so are the desserts though.",
            "Dorm life is fun, but can also be challenging. Make as many new friends as possible when you first get there, that's when it's easiest. The dorms themselves aren't bad either, some are more updated than others but they're still nice. The bathrooms are decent and the showering situations is too awkward. Sometimes they're a little loud, but that's what the library is for.",
            "The classes keep you busy, but the work isn't always that difficult. You still learn a lot of valuable stuff, especially once you get going with your major classes and not just general education courses.",
            "Expect to bring some easy to make food with you- the dining is terrible. They get worse throughout the semester too. Make sure you bring winter boots, the walk to class can take up to 5-10 minutes. Get to know your roommate before you move in.",
            "It's a small campus community where the class sizes aren't huge. A lot of the professors and advisers are great, friendly and helpful, but you'll always have the one who will make school too difficult. The campus layout makes walking to class a drag, especially in the winter, but the school work itself isn't too much, or too little."
        ]
    ],
    "pageTitle": "University of Wisconsin-River Falls (UW-River Falls) Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/University-of-Wisconsin-River-Falls/reviews?_escaped_fragment_=/show/128777",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988317.67/warc/CC-MAIN-20150728002308-00336-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 926452335,
    "recordOffset": 926410299,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{184815=© 2015, Cappex.com, LLC, 73319=Riverside Commons is the main dining area on campus. It's buffet-style and good, but it can get repetitive. Luckily, you can get a transfer meal (if you're on a meal plan, which freshmen are required to have) at the retail dining areas on campus and at the UC Convenience store. Retail dining includes an Erberts & Gerberts ( a sandwich shop), St. Croix Grill (beef and burgers), Noodles and Greens (a pasta/noodle/salad place), and Petes Creek Market (a variety of foods like chicken tenders and macaroni and cheese). There is also a coffee shop, Peregrine Park, which brews and sells Caribou Coffee items. The UC convience store offers a transfer meal of a sandwich, chips, and milk after 7:00 pm.}",
    "textBeforeTable": "06/08/2009 Reviewer is A current student here. 16 out of 16 people found this review useful. 1 of 39 Sydney from Minnetonka, MN Check out reviews left by other students or leave your own review. You could win a free scholarship. University of Wisconsin-River Falls Reviews University of Wisconsin-River Falls › Wisconsin › By State › Colleges › } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.create', -->",
    "textAfterTable": "Kelly from Brooklyn Park, MN 01/05/2011 Reviewer is A current student here. 7 out of 7 people found this review useful. 2 of 39 Categories Comments Great for these types of students People who appreciate having access to their friends and professors First generation college students Minority populations Diverse backgrounds People who like small towns with easy access to the big city Tips for prospective students Don't let college scare ya - you can do this! Find an older student (maybe your welcome leader!) who can help you through the ropes of your first semester Pay attention to announcements of events and other important things GO TO CLASS!! The professors at UWRF want you in class and make sure to use your time as valuable - you sometimes even get a higher grade just for showing up every period! Bang for the buck Definitely worth every penny of my tuition!! I also love that textbooks are rented to students as a part of tuition - it saves SO much time and money! I would",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}