{
    "relation": [
        [
            "Categories",
            "Bang for the buck",
            "What to do for fun",
            "Dorm Life",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "I had a financial aid and it helped a lot. However, I am not eligible to receive any anymore so it is going to be very challenging since the program requires full time schedule.",
            "I don't actually know. I go to the class and leave right after it's over",
            "I do not live in a dorm",
            "Don't miss classes, work hard and give it 100% to succeed.",
            "Muncie campus is one of the best Ivy Tech has. Instructors are great, always willing to help and be there for students."
        ]
    ],
    "pageTitle": "Ivy Tech Community College-East Central Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Ivy-Tech-Community-College-East-Central/reviews?_escaped_fragment_=/show/108688",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042991076.30/warc/CC-MAIN-20150728002311-00003-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 898521711,
    "recordOffset": 898489340,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{103459=© 2015, Cappex.com, LLC, 4566=i believe it is totally worth the money to come here. seeing how classes here range from $300 - $400 i'd say it is more than worth it. at a bigger college you'd probably be paying over $1000 for one class. on top of that there are computer labs, free tutoring, and it is very easy to get ahold of your teachers. so to me yes, this was worth every penny.}",
    "textBeforeTable": "08/26/2011 Reviewer is A current student here. 2 out of 3 people found this review useful. 1 person found this inaccurate. 1 of 25 Ashley from Portland, IN Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp",
    "textAfterTable": "Login to rate or flag the reviews Natalie from Muncie, IN 02/14/2012 Reviewer is A current student here. 2 out of 2 people found this review useful. 2 of 25 Categories Comments Campus Safety we do have security guards on campus and they are very friendly. there are also lockers you can rent out in the buildings. i feel more than safe here, over all it is a very great learning environment! Great for these types of students students that prefer smaller class settings should look into ivy tech. that's one reason i came here because i do believe it is easier to learn in a class where more than likely everyone wants to be there. it is also better if you like more one on one time with your teacher, since the classes are smaller it is easy to get that time. Bang for the buck i believe it is totally worth the money to come here. seeing",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}