{
    "relation": [
        [
            "Categories",
            "Greek Life",
            "Clubs and Activities",
            "Great for these types of students",
            "Share any unusual traditions or locations on campus",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "No Greek life, but Phi Theta Kappa is the honor society on campus. Looks awesome on transfer applications and opens up a lot of scholarship opportunities.",
            "Many options!",
            "Open minded!",
            "It's a small campus on the edge of Downtown. Loring park is right next to the campus.",
            "There are many different campus activities and student organizations to join. That keeps a lot of people busy. And Minneapolis has everything to offer a person! Great nightlife, music scene, fair housing, nice parks and trails, and a greenway connecting the whole metro area!",
            "No the worst, but not healthy and not worth the money.",
            "No dorms! Everyone has to find housing for themselves.",
            "Some of the classes are very difficult and I've learned a lot. I've had some amazing teachers too, with highest degrees in their field. Go to class and pay attention and you're grades will be good.",
            "Don't rely on counselors to help you much with... well anything. Keep track of your requirements and take advantage of all the workshops available. Check for scholarships every now and then because there are quite a few that go under the radar.",
            "The school is strict on attendance for a good reason, so that they aren't giving financial aid to students who aren't serious about school. It's an awesomely diverse school where you can make great friends if you keep an open mind. For a community college it's great and the location is awesome."
        ]
    ],
    "pageTitle": "Minneapolis Community and Technical College Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Minneapolis-Community-and-Technical-College/reviews?_escaped_fragment_=/show/30381",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988317.67/warc/CC-MAIN-20150728002308-00071-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 902272975,
    "recordOffset": 902224709,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{196507=© 2015, Cappex.com, LLC, 107729=-Get your financial aid done and processing by mid June at THE latest! -Get your books before the first of August and skim through them. -Take the leadership role as often as you can in any group project. -Set your standards high for yourself BEFORE classes start! You'll end up setting yourself up for huge success! -Get involved! Student Life is a huge part of MCTC, but there are many many clubs that are involved. Look for posters and flyers and attend events when you have the time!}",
    "textBeforeTable": "12/13/2009 Reviewer is A current student here. 2 out of 2 people found this review useful. 1 of 43 Samantha from Minneapolis, MN Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {//",
    "textAfterTable": "Currently there is no dorm in this institution, but housing is affordable and the college is nested on the edge of downtown Minneapolis, making it extremely accessible. Academic Rigor While the myth exists that community colleges are far easier than an institution like a state university, Minneapolis Community and Technical College has provided me with an education that pushes to my limit and makes me interested in the topics I learn about. The instructors care about teaching students, not about solely seeking grants or for school rankings. Tips for prospective students Fill out your FAFSA early and seek counseling when registering for courses. The advisors offer many options for people that include 2-year, 4-year and certificate diplomas. The advisors have your future in their interest and work to find the most pragmatic and encompassing route for you to follow. In three sentences This institution values an in-depth opportunity to provide students of all income classes with a well-rounded education. The student population is one of the most diverse that I have seen, which only enriches my education. The instructors and administration work to bring out the fullest of a student's potential and to put them onto a path for success.",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}