{
    "relation": [
        [
            "Categories",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "Biking around Davis is so beautiful and relaxing and a great way to get some exercise too!",
            "The food is actually really good. Tercero has the worst dining and Cuarto has the best dining.",
            "Living in the dorms is the best!",
            "I have learned so much from my time here at UC Davis. Professors expect a lot from you and you have to work but Professors expectations are relatively reasonable.",
            "Do not let the stereotypes of Davis fool you. There are hardly any cows around here except right by the tercero dorms.",
            "UC Davis is a hidden gem! I absolutely love it here. It has just the right balance between academics and social life."
        ]
    ],
    "pageTitle": "University of California-Davis (UC Davis) Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/University-of-California-Davis/reviews?_escaped_fragment_=/show/121057",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 225,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042991076.30/warc/CC-MAIN-20150728002311-00023-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 885634599,
    "recordOffset": 885416180,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{535489=Never give up! You have the power to do all things through Christ who strengthens you. Philippians 4:13. Everything happens for a reason and never ever lose hope. If there's a will there's a way., 746350=There are over 500 active organizations at UC Davis, so there is already a huge variety of clubs that are based on interests, academics, politics, sexual identity, race, religion, and more. But, you can also start your own club. You could participate in community service, which is facilitated through the Internship and Career Center and student organizations at Davis. If you come to Davis, your residence hall will put on socials, like the residence hall winter formal (Dormal), and the Dining Commons will put on special events as well. And then, thereâ??s the glorious madness of Picnic Day every April (see my â??What to do for funâ??). The annual Activities Fair in the fall showcases over 180 clubs for students to learn a great deal more about all the organizations and activities at this college. Itâ??s fairly easy to get involved with clubs and activities on campus, since you can hardly throw a rock without hitting a flyer, banner, booth, sign, or another student who could inform you about one of myriad student activities and organizations that UC Davis, if not the city of Davis itself, has to offer. With all that variety, you can be sure to find clubs and activities that you want to experience or become involved with at UCD., 43033=I live in Tercero Wall Hall which is right next to a farm of very handsome cows. There are 9 new buildings this fall (2011) and they're still constructing new ones opening in the next year or two. These residence halls are fantastic. They come more furnished than other schools AND my favorite part, the three person rooms are overly roomy! They are also about $2000 less a year than a typical 2 person room which means $2000 extra to save. Davis is known for their Dining Commons. On top of the great healthy food in the DC, there is also a farmer's market twice a week. There aren't many fast food places close by except for Carl's Jr. but there are tons of small business restaurants. THEY TAKE CARE OF YOU HERE. There's a tipsy taxi and and an escort service (I know, it's a bad name) to walk you if you're scared of going home alone in the dark. They spend 6 hrs taking about safety and sexual harassment and health during freshman orientation. It's difficult sitting that long but for a school to do something like that and to give you so many resources in case you're ever in trouble, it shows that they REALLY REALLY care. Last but not least, BEST GYM EVERRRR and its free!!, 866686=UC Davis is best known for its Picnic Day celebration, so for any prospective students trying to get a feel for the town and campus's environment, I suggest you check that day out! It's held in April on the Arboratem, which is basically the prettiest place you'll ever see. Also, the campus gets all four seasons (which is a huge plus for me, having grown up in So-Cal)., 69398=The college town of Davis has places where students can go for fun. There are local movie theaters in Downtown Davis--all within walking or biking distance. There are many local boutiques and major fashion chains like Forever 21 for shoppers. There is an arcade at the center of UC Davis's campus for students and the public to bowl, dance, and play pool. UC Davis also hosts various concerts at affordable prices. In early 2012, Drake visited the campus and performed. Past performers include K$sha, Snoop Dogg, and much more. UC Davis hosts an annual Picnic Day where various organizations provide fun games and offer food for a day full of fun for all ages. The annual Chemistry Magic Show is one that people should not miss!, 615788=UC Davis is a wonderful college located in the heart of Davis, California. It's an excellent school with many opportunities. The ratio of cows to bicycles here seems to be 1:1., 131694=The campus host the Whole Earth Festival, usually in May, where there is live music and cool crafts being sold all week. It is truly a unique UCD experience. Even more popular than that is Picnic Day, the university's open house, with fun things to do in all the departments, a big parade in the morning, and the Band-uh! battling it out at the Arboretum all afternoon against other college bands. It's a town-wide event and always endless amounts of fun., 236860=I will not attend UC Davis until September, but their reputation is phenomenal. I am a pre-vet animal science major, and UC Davis has the best veterinarian program in all of California and most parts of the world. During my visits everyone has been very nice and accommodating, as well as genuinely interested in prospective students., 41713=I was able to get a lot of financial aid, almost a full scholarship for the 2011-2012 year. Especially if your family's income is low-middle class to low, Davis does it's best to keep you from spending $10,000 out of pocket which means no emptying savings or taking private bank loans. They have the Blue and Gold Opportunity Plan which provided me with and extra $5,000. Look it up. It's amazing. The other private school I wanted to attend asked me to take $10,000 out of various federal loans and and an additional $25,000. Davis offers the same great opportunities plus some since it's bigger at a cheaper school. I definitely feel grateful I had the option of picking this one instead. The financial package is slightly overestimated so if you have all your aid completely covered, usually at the end there's still $2000-5000 left for spending on sweatshirts, athletics, summer courses, etc. Usually students will save this up to pay back their loans or they'll live extravagantly and spend it all throughout the year., 453558=picnic day every year in april, which is an event that involves the whole town with many activities and a parade, as well as other things. there is a pub on campus which is interesting, but pricey. there is also a club established on campus whose sole purpose is to climb every building on campus., 394511=As we all know, UC system has been going through tuition hikes throughout the past 3 years. When i was admitted in Fall of 2007, my tuition per quarter was about $2800; now it has skyrocketed to $4600 per quarter., 542848=First make friends with your roommates. Buy a bike with fenders or get fenders for your tires, they come in great use all of Oct. through February. Make the most from eating at the dining commons, it will be only time you won't be thinking what your next meal will be., 321820=Because it's a UC, it's a bit on the pricey side. Out of pocket, I paid about $3500 my freshman year with the help of all the grants I got. The university itself gave me about $1500 last year. I refused to get loans., 424078=picnic day is held in april and is the largest event that every student (or non-student) looks forward to! :), 891985=Get a bike! Don't get 7:30 classes. Go easy the first quarter, 533254=Jeremiah 29:11 For He knows the plans he has for you, to give you a hope & a future., 503477=For the third time, Picnic Day! Also, the football games are fun to attend if you get in the Aggie Pack. The Whole Earth Festival is fun to check out too. Ask around about the Death Star. Did you know there's a pub on campus? Go to the Silo, and right next door is a convenient little pub. At least it was back in 2006.}",
    "textBeforeTable": "07/07/2009 Reviewer is A current student here. 57 out of 59 people found this review useful. 1 of 325 Vianey from rancho cucamonga, CA Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6,",
    "textAfterTable": "Kevin from Livermore, CA 07/24/2009 Reviewer is A current student here. 41 out of 42 people found this review useful. 2 of 325 Categories Comments Great for these types of students People who are friendly and like meeting others, people who are open to diversity, people who like a small-town feeling, people who enjoy bicycle riding, people who have yet to decide a career path, and people who are interested in joining a fraternity or sorority. Tips for prospective students I would recommend visiting any college that you are considering and base your decision on the feel of the community (big city or small town, warm or cold weather, relaxed or competitive, etc.) as well as whether or not they have your major. If you're not sure what major you want, it would be wise to pick a college that has lots of majors to choose from. Probably the most important factor in your college-selection process should be based on the feel of the campus when you visit it. Some campuses are very focused on academics; others are more relaxed and social. I visited campuses where everyone I",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}