{
    "relation": [
        [
            "Categories",
            "Campus Safety",
            "Food and Dining",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "Has an active presence with security riding about the grounds both day and night.",
            "Lots of options on campus as well as around the area.",
            "This college is a valid junior college. It's not high school or an extention of high school. So be ready to really work.",
            "Spend your time wisely. The semesters winter and summer are the shortest and should be used to either catch up or pull ahead. Fall and Spring fill up fast make your list of classes with a backup list of classes you want and need.",
            "Wonderful campus with and excellent Media Arts department. And Professors that are able to teach students coming from a variety of backgrounds. Offers classes day, night, weekends and online."
        ]
    ],
    "pageTitle": "Los Angeles Valley College Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Los-Angeles-Valley-College/reviews?_escaped_fragment_=/show/45821",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042982502.13/warc/CC-MAIN-20150728002302-00317-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 873471599,
    "recordOffset": 873433806,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{144986=© 2015, Cappex.com, LLC}",
    "textBeforeTable": "01/09/2012 Reviewer is A current student here. 4 out of 6 people found this review useful. 1 person found this inaccurate. 1 of 38 David from Valley Village, CA Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp =",
    "textAfterTable": "Bang for the buck Most supplies, buy them off campus. Try to find good deals, coupons, codes, etc. Renting books may be a good option for you. Campus does have that option. There are Third Party options for renting books. However, price per unit for a California resident is worth it. (Professors are great, too) What to do for fun Join a club, for example, art or dance club. This will expose you to much more resources. Try to keep up with the things that you always like to do, go to concerts, hit the mountains for a ski, snowboard or hike. Call family, they miss you. Food and Dining LAVC has a Dining Hall. There are lots of choices for people. Eating together with people is a very intimate event. We may not realize it in our day because of the multitude of restaurants, picnic areas, etc. Keep yourself healthy. Your mind, body and spirit thrive best when eating and drinking what you NEED. Again, this is an area where others have their sensitivities and we need to try to respect that. A quick story. A housemate, who eats only vegetarian, once found her frying pan in the sink, dirty from another housemate. He had made a steak in the frying pan. Her sensitivity was such",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}