{
    "relation": [
        [
            "Release",
            "Release 2.0",
            "Release 3.4.0",
            "Release 3.5.0"
        ],
        [
            "Modification",
            "This command was introduced.",
            "The ipv4 and ipv6 keywords were added.",
            "The vrf vrf-name keyword and argument were added."
        ]
    ],
    "pageTitle": "Multicast PIM Commands on the Cisco IOS XR Software - Cisco",
    "title": "",
    "url": "http://www.cisco.com/c/en/us/td/docs/routers/crs/software/crs_r4-3/command/reference/b_mcast_cr43xcrs_chapter_0100.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 225,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042982502.13/warc/CC-MAIN-20150728002302-00138-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 365651935,
    "recordOffset": 365573262,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{548368=Number of join and prune states aggregated into received messages in the last 1000/10000/50000 received join and prune messages., 325185=The following example shows how to set the PIM rendezvous point address to 172.16.6.21 for groups 225.2.2.0 - 225.2.2.255:, 547943=Number of join and prune states aggregated into transmitted messages in the last 1000/10000/50000 transmitted join and prune messages., 708676=Up: 00:00:13, 542774=The show pim join-prune statistics command displays the average PIM join and prune groups for the most recent packets (in increments of 1000/10000/50000) that either were sent out or received from each PIM interface. If fewer than 1000/10000/50000 join and prune group messages are received since PIM was started or the statistics were cleared, the join-prune aggregation shown in the command display is zero (0)., 63361=To prevent a Protocol Independent Multicast (PIM) process from learning about IP multicast traffic for the auto-rendezvous point (Auto-RP) group 224.0.1.40 that is flooded across interfaces, use the auto-rp listen disable command in PIM configuration mode. To return to the default behavior, use the no form of this command., 718491=03:54:23, 609986=Up: 03:47:09}",
    "textBeforeTable": "Syntax Description accept-register no access-list-name accept-register To configure a rendezvous point (RP) router to filter Protocol Independent Multicast (PIM) register messages, use the accept-register command in PIM configuration mode. To return to the default behavior, use the no form of this command. accept-register ssm spt-threshold infinity show pim tunnel info show pim traffic show pim topology summary show pim topology interface-flag show pim topology entry-flag show pim topology detail show pim topology show pim table-context show pim summary show pim rpf summary show pim rpf route-policy test show pim rpf route-policy statistics show pim rpf hash show pim rpf show pim range-list show pim nsf show pim neighbor show pim mstatic show pim mdt show pim join-prune statistic show pim interface show pim group-map show pim df winner show pim df election-state show pim context table show pim context detail show pim context show pim bsr rp-cache",
    "textAfterTable": "Command History Release Modification Release 2.0 This command was introduced. Usage Guidelines To use this command, you must be in a user group associated with a task group that includes appropriate task IDs. If the user group assignment is preventing you from using a command, contact your AAA administrator for assistance. The accept-register command prevents unauthorized sources from registering with the rendezvous point. If an unauthorized source sends a register message to the rendezvous point, the rendezvous point immediately sends back a register-stop message. Task ID Task ID Operations multicast read, write Examples The following example shows how to restrict the rendezvous point. Sources in the Source Specific Multicast (SSM) range of addresses are not allowed to register with",
    "hasKeyColumn": true,
    "keyColumnIndex": 1,
    "headerRowIndex": 0
}