{
    "relation": [
        [
            "Number of business days after contractual settlement date",
            "From 5 to 15",
            "From 16 to 306",
            "From 31 to 45",
            "46 or more"
        ],
        [
            "Risk weight to be applied to positive current exposure (in percent)",
            "100",
            "25",
            "937.5",
            "1,250"
        ]
    ],
    "pageTitle": "FDIC Law, Regulations, Related Acts - Rules and Regulations",
    "title": "",
    "url": "https://www.fdic.gov/regulations/laws/rules/2000-4350.html",
    "hasHeader": true,
    "headerPosition": "MIXED",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042991076.30/warc/CC-MAIN-20150728002311-00305-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 900789487,
    "recordOffset": 900577536,
    "tableOrientation": "VERTICAL",
    "TableContextTimeStampBeforeTable": "{73229=Pre-sold construction loan means any one-to-four family residential construction loan to a builder that meets the requirements of section 618(a)(1) or (2) of the Resolution Trust Corporation Refinancing, Restructuring, and Improvement Act of 1991 (Public Law 102--233, 105 Stat. 1761) and the following criteria:, 99239=ERISA means the Employee Retirement Income and Security Act of 1974 (29 U.S.C. 1001 et seq.)., 134567=(i)  Beginning on January 1, 2015, calculate standardized total risk-weighted assets in accordance with subpart D, and if applicable, subpart F of this part; and, 134385=(ii)  Beginning on January 1, 2015, calculate and maintain minimum capital ratios in accordance with subparts A, B and C of this part, provided, however, that from January 1, 2015, to December 31, 2017, a savings and loan holding company that is an advanced approaches FDIC-supervised institution:, 128834=Bank Holding Company Act means the Bank Holding Company Act of 1956, as amended (12 U.S.C. 1841 et seq.)., 135785=(iii)  Beginning on January 1, 2014, calculate and maintain minimum capital ratios in accordance with subparts A, B, and C of this part, provided, however, that such FDIC-supervised institution must:, 80456=Investment Company Act means the Investment Company Act of 1940 (15 U.S.C. 80 a-1 et seq.), 133300=[Section 324.1 amended at 79 Fed. Reg. 57748, September 26, 2014, effective January 1, 2015], 123580=Commodity Exchange Act means the Commodity Exchange Act of 1936 (7 U.S.C. 1 et seq.), 145203=Authority:  12 U.S.C. 1815(a), 1815(b), 1816, 1818(a), 1818(b), 1818(c), 1818(t), 1819(Tenth), 1828(c), 1828(d), 1828(i), 1828(n), 1828(o), 1831o, 1835, 3907, 3909, 4808; 5371; 5412; Pub. L. 102--233, 105 Stat. 1761, 1789, 1790 (12 U.S.C. 1831n note); Pub. L. 102--242, 105 Stat. 2236, 2355, as amended by Pub. L. 103--325, 108 Stat. 2160, 2233 (12 U.S.C. 1828 note); Pub. L. 102--242, 105 Stat. 2236, 2386, as amended by Pub. L. 102--550, 106 Stat. 3672, 4089 (12 U.S.C. 1828 note); Pub. L. 111--203, 124 Stat. 1376, 1887 (15 U.S.C. 78o-7 note)., 60067=Securities Exchange Act means the Securities Exchange Act of 1934 (15 U.S.C. 78a et seq.)., 46991=[Section 324.2 amended at 79 Fed. Reg. 20758, April 14, 2014, effective April 14, 2014, mandatory compliance date: January 1, 2014 for advanced approaches FDIC-supervised institutions; January 1, 2015 for all other FDIC-supervised institutions; 79 Fed. Reg. 57748, September 26, 2014, effective January 1, 2015. Any company subject to this rule may elect to adopt it before this date; 79 Fed. Reg. 57748, September 26, 2014, effective January 1, 2015], 89334=(ii)  Small business investment companies, as defined in section 102 of the Small Business Investment Act of 1958 (15 U.S.C. 661 et seq.);, 120384=(3)(i)  A top-tier savings and loan holding company that, as of June 30 of the previous calendar year, held 25 percent or more of its total consolidated assets in subsidiaries that are insurance underwriting companies (other than assets associated with insurance for credit risk); and, 94179=Federal Deposit Insurance Corporation Improvement Act means the Federal Deposit Insurance Corporation Improvement Act of 1991 ((Pub. L. 102--242, 105 Stat. 2236)., 135565=(A)  From January 1, 2014 to December 31, 2014, maintain a minimum common equity tier 1 capital ratio of 4 percent, a minimum tier 1 capital ratio of 5.5 percent, a minimum total capital ratio of 8 percent, and a minimum leverage ratio of 4 percent; and, 28051=(5)  State savings association tangible capital ratio. (i) Until January 1, 2015, a state savings association shall determine its tangible capital ratio in accordance with 12 CFR 390.468., 53845=Statutory multifamily mortgage means a loan secured by a multifamily residential property that meets the requirements under section 618(b)(1) of the Resolution Trust Corporation Refinancing, Restructuring, and Improvement Act of 1991, and that meets the following criteria:5, 100917=Employee stock ownership plan has the same meaning as in 29 CFR 2550.407d-6., 116662=Credit union means an insured credit union as defined under the Federal Credit Union Act (12 U.S.C. 1751 et seq.)., 9117=(5)  State savings association tangible capital ratio. (i) Until January 1, 2014, a state savings association shall determine its tangible capital ratio in accordance with 12 CFR 390.468., 120842=(ii)  As of June 30 of the previous calendar year, derived 50 percent or more of its total consolidated assets or 50 percent of its total revenues on an enterprise-wide basis (as calculated under GAAP) from activities that are not financial in nature under section 4(k) of the Bank Holding Company Act (12 U.S.C. 1842(k));, 57081=Small Business Investment Act means the Small Business Investment Act of 1958 (15 U.S.C. 681 et seq.)., 94303=Federal Deposit Insurance Act means the Federal Deposit Insurance Act (12 U.S.C. 1811 et seq.)., 27834=(ii)  As of January 1, 2015, a state savings association's tangible capital ratio is the ratio of the state savings association's core capital (tier 1 capital) to total assets. For purposes of this paragraph, the term total assets shall have the meaning provided in § 324.401(g)., 81036=International Lending Supervision Act means the International Lending Supervision Act of 1983 (12 U.S.C. 3901 et seq.)., 8900=(ii)  As of January 1, 2014, a state savings association's tangible capital ratio is the ratio of the state savings association's core capital (tier 1 capital) to total assets. For purposes of this paragraph, the term total assets shall have the meaning provided in 12 CFR 324.401(g)., 5572=[Section 324.10 amended at 79 Fed. Reg. 20758, April 14, 2014, effective April 14, 2014, mandatory compliance date: January 1, 2014 for advanced approaches FDIC-supervised institutions; January 1, 2015 for all other FDIC-supervised institutions; 79 Fed. Reg. 57748, September 26, 2014, effective January 1, 2015], 137251=(ii)   From January 1, 2014 to December 31, 2014:, 37133=[Section 324.3 amended at 79 Fed. Reg. 20758, April 14, 2014, effective April 14, 2014, mandatory compliance date: January 1, 2014 for advanced approaches FDIC-supervised institutions: January 1, 2015 for all other FDIC-supervised institutions], 112353=Dodd-Frank Act means the Dodd-Frank Wall Street Reform and Consumer Protection Act of 2010 (Pub. L. 111--203, 124 Stat. 1376)., 121531=Country risk classification (CRC) with respect to a sovereign, means the most recent consensus CRC published by the Organization for Economic Cooperation and Development (OECD) as of December 31st of the prior calendar year that provides a view of the likelihood that the sovereign will service its external debt., 133740=(3)  Beginning on January 1, 2016, and subject to the transition provisions in subpart G of this part, an FDIC-supervised institution is subject to limitations on distributions and discretionary bonus payments with respect to its capital conservation buffer and any applicable countercyclical capital buffer amount, in accordance with subpart B of this part., 137655=(i)   Except as described in paragraph (f)(1)(ii) of this section, beginning on January 1, 2014, calculate advanced approaches total risk-weighted assets in accordance with subpart E and, if applicable, subpart F of this part and, beginning on January 1, 2015, calculate standardized total risk-weighted assets in accordance with subpart D and, if applicable, subpart F of this part;, 135291=(B)  From January 1, 2015 to December 31, 2017, an advanced approaches FDIC-supervised institution:}",
    "TableContextTimeStampAfterTable": "{200657=[Section 324.43 amended at 79 Fed. Reg. 20760, April 14, 2014, Effective April 14, 2014, mandatory compliance date: January 1, 2014, for advanced approaches FDIC-supervised institutions, January 1, 2015 for all other FDIC-supervised institutions], 765243=(6)  Beginning January 1, 2018, the supplementary leverage ratio calculated in accordance with § 324.11 for advanced approaches FDIC-supervised institutions that are subject to subpart E of this part., 754575=(2)  Non-qualifying minority interest. Beginning January 1, 2014, for an advanced approaches FDIC-supervised institution, and beginning January 1, 2015, for an FDIC-supervised institution that is not an advanced approaches FDIC-supervised institution, and in each case through December 31, 2017, an FDIC-supervised institution may include in tier 1 capital or total capital the percentage of the tier 1 minority interest and total capital minority interest outstanding as of January 1, 2014 that does not meet the criteria for additional tier 1 or tier 2 capital instruments in § 324.20 (non-qualifying minority interest), as set forth in Table 9 to § 324.300., 227938=(a)  Except as provided in § 324.62, an FDIC-supervised institution described in § 324.61 must make the disclosures described in Tables 1 through 10 of this section. The FDIC-supervised institution must make these disclosures publicly available for each of the last three years (that is, twelve quarters) or such shorter period beginning on January 1, 2015., 793416=16Pub. L. 111--240; 124 Stat. 2504 (2010) Go back to Text, 93177=[Section 324.32 amended at 79 Fed. Reg. 20760, April 14, 2014, Effective April 14, 2014, mandatory compliance date: January 1, 2014, for advanced approaches FDIC-supervised institutions, January 1, 2015 for all other FDIC-supervised institutions], 734051=(1)  Transition deductions from common equity tier 1 capital. Beginning January 1, 2014, for an advanced approaches FDIC-supervised institution, and beginning January 1, 2015, for an FDIC-supervised institution that is not an advanced approaches FDIC-supervised institution, and in each case through December 31, 2017, an FDIC-supervised institution, must make the deductions required under § 324.22(a)(1)--(7) from common equity tier 1 or tier 1 capital elements in accordance with the percentages set forth in Tables 2 and 3 to § 324.300., 788701=2In addition, for purposes of § 324.201(c)(3), from January 1, 2014 to December 31, 2014, for any circumstance in which the FDIC may require anFDIC-supervised institution to calculate risk-based capital requirements for specific positions or portfolios under subpart D of this part, the FDIC will instead require the FDIC-supervised institution to make such calculations according to 12 CFR part 325, appendix A, and, if applicable, appendix C (state nonmember banks), or 12 CFR part 390, subpart Z and, if applicable, 12 CFR part 325, appendix C (state savings associations). Go back to Text, 773846=[Section 324.403 amended at 79 Fed. Reg. 24541, May 1, 2014, effective January 1, 2018], 750596=(iv)  Beginning January 1, 2018, an FDIC-supervised institution must calculate the 15 percent common equity tier 1 capital deduction threshold in accordance with § 324.22(d)., 27368=(4)  Any instrument that qualified as tier 2 capital under the FDIC's general risk-based capital rules under 12 CFR part 325, appendix A (state nonmember banks) and 12 CFR part 390, appendix Z (state saving associations) as then in effect, that were issued under the Small Business Jobs Act of 2010,16 or prior to October 4, 2010, under the Emergency Economic Stabilization Act of 2008.17, 28207=(6)  Notwithstanding the criteria for tier 2 capital instruments referenced above, an instrument with terms that provide that the instrument may be called earlier than five years upon the occurrence of a rating agency event does not violate the criterion in paragraph (d)(1)(v) of this section provided that the instrument was issued and included in an FDIC-supervised institution's tier 1 or tier 2 capital prior to January 1, 2014, and that such instrument satisfies all other criteria under this paragraph (d)., 753704=(d)  Minority interest. (1)  Surplus minority interest. Beginning January 1, 2014, for an advanced approaches FDIC-supervised institution, and beginning January 1, 2015, for an FDIC-supervised institution that is not an advanced approaches FDIC-supervised institution, and in each case through December 31, 2017, an FDIC-supervised institution may include in common equity tier 1 capital, tier 1 capital, or total capital the percentage of the common equity tier 1 minority interest, tier 1 minority interest and total capital minority interest outstanding as of January 1, 2014 that exceeds any common equity tier 1 minority interest, tier 1 minority interest or total capital minority interest includable under § 324.21 (surplus minority interest), respectively, as set forth in Table 9 to § 324.300., 266601=[Section 324.63 amended at 78 Fed. Reg. 62417, October 22, 2013; Section 324.63 amended at 79 Fed. Reg. 20760, April 14, 2014, Effective April 14, 2014, mandatory compliance date: January 1, 2014, for advanced approaches FDIC-supervised institutions, January 1, 2015 for all other FDIC-supervised institutions], 21376=(ii)  An instrument with terms that provide that the instrument may be called earlier than five years upon the occurrence of a rating agency event does not violate the criterion in paragraph (c)(1)(v) of this section provided that the instrument was issued and included in an FDIC-supervised institution's tier 1 capital prior to the January 1, 2014, and that such instrument satisfies all other criteria under this paragraph (c)., 733384=(b)  Regulatory capital adjustments and deductions. Beginning January 1, 2014, for an advanced approaches FDIC-supervised institution, and beginning January 1, 2015, for an FDIC-supervised institution that is not an advanced approaches FDIC-supervised institution, and in each case through December 31, 2017, an FDIC-supervised institution must make the capital adjustments and deductions in § 324.22 in accordance with the transition requirements in this paragraph (b). Beginning January 1, 2018, an FDIC-supervised institution must make all regulatory capital adjustments and deductions in accordance with § 324.22., 29038=(i)  Was included in an FDIC-supervised institution's tier 1 capital or tier 2 capital prior to May 19, 2010, in accordance with the FDIC's risk-based capital rules that were effective as of that date and the underlying instrument may continue to be included under the criteria set forth in this section; or, 8403=[Section 324.11 amended at 79 Fed. Reg. 20759, effective April 14, 2014, mandatory compliance date: January 1, 2014 for advanced approaches FDIC-supervised institutions: January 1, 2015 for all other FDIC-supervised institutions], 727976=(2)  Beginning January 1, 2016, through December 31, 2018, an FDIC-supervised institution's maximum payout ratio shall be determined as set forth in Table 1 to § 324.300., 649670=(b)  Backtesting. An FDIC-supervised institution must compare each of its most recent 250 business days' trading losses (excluding fees, commissions, reserves, net interest income, and intraday trading) with the corresponding daily VaR-based measures calibrated to a one-day holding period and at a one-tail, 99.0 percent confidence level. An FDIC-supervised institution must begin backtesting as required by this paragraph (b) no later than one year after the later of January 1, 2014, and the date on which the FDIC-supervised institution becomes subject to this subpart. In the interim, consistent with safety and soundness principles, an FDIC-supervised institution subject to this subpart as of January 1, 2014 should continue to follow backtesting procedures in accordance with the FDIC's supervisory expectations., 568738=(c)  Except as provided in § 324.172(b), an FDIC-supervised institution described in § 324.172(d) must make the disclosures described in Table 13 to § 324.173; provided, however, the disclosures required under this paragraph are required without regard to whether the FDIC-supervised institution has completed the parallel run process and has received notification from the FDIC pursuant to § 324.121(d). The FDIC-supervised institution must make these disclosures publicly available beginning on January 1, 2015., 741795=(3)  Transition adjustments to AOCI for an advanced approaches FDIC-supervised institution and an FDIC-supervised institution that has not made an AOCI opt-out election under § 324.22(b)(2). Beginning January 1, 2014, for an advanced approaches FDIC-supervised institution, and beginning January 1, 2015, for an FDIC-supervised institution that is not an advanced approaches FDIC-supervised institution and that has not made an AOCI opt-out election under § 324.22(b)(2), and in each case through December 31, 2017, an FDIC-supervised institution must adjust common equity tier 1 capital with respect to the transition AOCI adjustment amount (transition AOCI adjustment amount):, 605863=[Section 324.173 amended at 79 Fed. Reg. 57750, September 26, 2014, effective January 1, 2015], 766674=Editor's Note: Text of subsection (b)(1)(v) effective January 1, 2018., 792230=11Pub.L. 111--240; 124 Stat. 2504 (2010). Go back to Text, 766193=(v)  Is not subject to any written agreement, order, capital directive, or prompt corrective action directive issued by the FDIC pursuant to section 8 of the FDI Act (12 U.S.C. 1818), the International Lending Supervision Act of 1983 (12 U.S.C. 3907), or the Home Owners' Loan Act (12 U.S.C. 1464(t)(6)(A)(ii)), or section 38 of the FDI Act (12 U.S.C. 1831o), or any regulation thereunder, to meet and maintain a specific capital level for any capital measure., 786532=(H)  Making any principal or interest payment on subordinated debt beginning 60 days after becoming critically undercapitalized except that this restriction shall not apply, until July 15, 1996, with respect to any subordinated debt outstanding on July 15, 1991, and not extended or otherwise renegotiated after July 15, 1991., 443002=[Section 324.133 amended at 79 Fed. Reg. 20760, April 14, 2014, Effective April 14, 2014, mandatory compliance date: January 1, 2014, for advanced approaches FDIC-supervised institutions, January 1, 2015 for all other FDIC-supervised institutions], 42036=(2)  Acquired its principal assets from an association that was chartered prior to October 15, 1982, as a savings bank or a cooperative bank under state law., 760472=(f)  Transition procedures. (1)  Definitions applicable before January 1, 2015, for certain FDIC-supervised institutions. Before January 1, 2015, notwithstanding any other requirement in this subpart H and with respect to any FDIC-supervised institution that is not an advanced approaches FDIC-supervised institution:, 424856=[Section 324.132 amended at 79 Fed. Reg. 20761, April 14, 2014, Effective April 14, 2014, mandatory compliance date: January 1, 2014, for advanced approaches FDIC-supervised institutions, January 1, 2015 for all other FDIC-supervised institutions], 330692=[Section 324.124 amended at 79 Fed. Reg. 20761, April 14, 2014, Effective April 14, 2014, mandatory compliance date: January 1, 2014, for advanced approaches FDIC-supervised institutions, January 1, 2015 for all other FDIC-supervised institutions], 727571=(a)  Capital conservation and countercyclical capital buffer. (1)  From January 1, 2014, through December 31, 2015, an FDIC-supervised institution is not subject to limits on distributions and discretionary bonus payments under § 324.11 notwithstanding the amount of its capital conservation buffer or any applicable countercyclical capital buffer amount., 761782=(g)  For purposes of subpart H, as of January 1, 2015, total assets means quarterly average total assets as reported in an FDIC-supervised institution's Call Report, minus amounts deducted from tier 1 capital under § 324.22(a), (c), and (d). At its discretion, the FDIC may calculate total assets using an FDIC-supervised institution's period-end assets rather than quarterly average assets., 790967=6For purposes of this paragraph (c), until January 1, 2015, the term total assets shall have the same meaning as provided in 12 CFR 325.2(x). As of January 1, 2015, the term total assets shall have the same meaning as provided in 12 CFR 324.401(g). Go back to Text, 788067=1For the purpose of calculating its general risk-based capital ratios from January 1, 2014 to December 31, 2014, an advanced approaches FDIC-supervised institution shall adjust, as appropriate, its risk-weighted asset measure (as that amount is calculated under 12 CFR part 325, appendix A, (state nonmember banks), and 12 CFR part 390, subpart Z (state savings associations) in the general risk-based capital rules) by excluding those assets that are deducted from its regulatory capital under § 324.22. Go back to Text, 766097=Editor's Note: Text of subsection (b)(1)(v) effective until January 1, 2018., 750801=(c)  Non-qualifying capital instruments. Depository institutions. (1)  Beginning on January 1, 2014, a depository institution that is an advanced approaches FDIC-supervised institution, and beginning on January 1, 2015, all other depository institutions may include in regulatory capital debt or equity instruments issued prior to September 12, 2010, that do not meet the criteria for additional tier 1 or tier 2 capital instruments in § 324.20 but that were included in tier 1 or tier 2 capital respectively as of September 12, 2010 (non-qualifying capital instruments issued prior to September 12, 2010) up to the percentage of the outstanding principal amount of such non-qualifying capital instruments as of January 1, 2014 in accordance with Table 8 to § 324.300., 768009=(vi)  Beginning January 1, 2018, an advanced approaches FDIC-supervised institution will be deemed to be \"adequately capitalized\" if it satisfies paragraphs (b)(2)(i) through (v) of this section and has a supplementary leverage ratio of 3.0 percent or greater, as calculated in accordance with § 324.11 of subpart B of this part., 766764=(v)  Beginning on January 1, 2018 and thereafter, an FDIC-supervised institution that is a subsidiary of a covered BHC will be deemed to be well capitalized if the FDIC-supervised institution satisfies paragraphs (b)(1)(i) through (iv) of this section and has a supplementary leverage ratio of 6.0 percent or greater. For purposes of this paragraph, a covered BHC means a U.S. top-tier bank holding company with more than $700 billion in total assets as reported on the company's most recent Consolidated Financial Statement for Bank Holding Companies (FR Y--9C) or more than $10 trillion in assets under custody as reported on the company's most recent Banking Organization Systemic Risk Report (FR Y--15); and, 197816=e = 2.71828, the base of the natural logarithms., 711653=[Section 324.210 amended at 79 Fed. Reg. 20761, April 14, 2014, Effective April 14, 2014, mandatory compliance date: January 1, 2014, for advanced approaches FDIC-supervised institutions, January 1, 2015 for all other FDIC-supervised institutions], 739083=(2)  Transition adjustments to common equity tier 1 capital. Beginning January 1, 2014, for an advanced approaches FDIC-supervised institution, and beginning January 1, 2015, for an FDIC-supervised institution that is not an advanced approaches FDIC-supervised institution, and in each case through December 31, 2017, an FDIC-supervised institution, must allocate the regulatory adjustments related to changes in the fair value of liabilities due to changes in the FDIC-supervised institution's own credit risk (§ 324.22(b)(1)(iii)) between common equity tier 1 capital and tier 1 capital in accordance with the percentages set forth in Table 4 to § 324.300., 746743=(4)  Additional transition deductions from regulatory capital. (i)  Beginning January 1, 2014, for an advanced approaches FDIC-supervised institution, and beginning January 1, 2015, for an FDIC-supervised institution that is not an advanced approaches FDIC-supervised institution, and in each case through December 31, 2017, an FDIC-supervised institution must use Table 7 to § 324.300 to determine the amount of investments in capital instruments and the items subject to the 10 and 15 percent common equity tier 1 capital deduction thresholds (§ 324.22(d)) (that is, MSAs, DTAs arising from temporary differences that the FDIC-supervised institution could not realize through net operating loss carrybacks, and significant investments in the capital of unconsolidated financial institutions in the form of common stock) that must be deducted from common equity tier 1 capital., 719540=[Section 324.211 amended at 79 Fed. Reg. 20761, April 14, 2014, Effective April 14, 2014, mandatory compliance date: January 1, 2014, for advanced approaches FDIC-supervised institutions, January 1, 2015 for all other FDIC-supervised institutions], 41775=(E) A subsidiary of any state savings association existing as a state savings association on August 9, 1989 that --, 208899=[Section 324.51 amended at 79 Fed. Reg. 20760, April 14, 2014, Effective April 14, 2014, mandatory compliance date: January 1, 2014, for advanced approaches FDIC-supervised institutions, January 1, 2015 for all other FDIC-supervised institutions], 69310=[Section 324.22 amended at 79 Fed. Reg. 20760, April 14, 2014, effective April 14, 2014, mandatory compliance date; January 1, 2014 for advanced approaches FDIC-supervised institutions, January 1, 2015 for all other FDIC-supervised institutions], 41901=(1)  Was chartered prior to October 15, 1982, as a savings bank or a cooperative bank under state law, or, 747709=(ii)  Beginning January 1, 2014, for an advanced approaches FDIC-supervised institution, and beginning January 1, 2015, for an FDIC-supervised institution that is not an advanced approaches FDIC-supervised institution, and in each case through December 31, 2017, an FDIC-supervised institution must apply a 100 percent risk-weight to the aggregate amount of the items subject to the 10 and 15 percent common equity tier 1 capital deduction thresholds that are not deducted under this section. As set forth in § 324.22(d)(2), beginning January 1, 2018, an FDIC-supervised institution must apply a 250 percent risk-weight to the aggregate amount of the items subject to the 10 and 15 percent common equity tier 1 capital deduction thresholds that are not deducted from common equity tier 1 capital., 41663=(2)  Was acquired by the parent state savings association prior to May 1, 1989; or, 768814=(v)  Beginning January 1, 2018, an advanced approaches FDIC-supervised institution will be deemed to be \"undercapitalized\" if it has a supplementary leverage ratio of less than 3.0 percent, as calculated in accordance with § 324.11., 718826=KA = (1 \u0096 W) |b1 KG + (0.5 |b1 W) 1 a = \u0096 _______ p |b1 KA u = D \u0096 KA l = max(A \u0096 KA, 0) e = 2.71828, the base of the natural logarithms., 20112=(3)  Any and all instruments that qualified as tier 1 capital under the FDIC's general risk-based capital rules under 12 CFR part 325, appendix A (state nonmember banks) and 12 CFR part 390, subpart Z (state savings associations) as then in effect, that were issued under the Small Business Jobs Act of 201011 or prior to October 4, 2010, under the Emergency Economic Stabilization Act of 2008.12, 757141=(a)  Authority. This subpart H is issued by the FDIC pursuant to section 38 of the Federal Deposit Insurance Act (FDI Act), as added by section 131 of the Federal Deposit Insurance Corporation Improvement Act of 1991 (Pub.L. 102--242, 105 Stat. 2236 (1991)) (12 U.S.C. 1831o)., 557636=[Section 324.172 amended at 79 Fed. Reg. 57750, September 26, 2014, Effective January 1, 2015], 172306=[Section 324.41 amended at 79 Fed. Reg. 20760, April 14, 2014, Effective April 14, 2014, mandatory compliance date: January 1, 2014, for advanced approaches FDIC-supervised institutions, January 1, 2015 for all other FDIC-supervised institutions], 35785=[Section 324.21 amended at 79 Fed. Reg. 20759, effective April 14, 2014, mandatory compliance date: January 1, 2014 for advanced approaches FDIC-supervised institutions: January 1, 2015 for all other FDIC-supervised institutions], 52036=(A)  An additional tier 1 capital instrument if such instrument was included in the issuer's tier 1 capital prior to May 19, 2010; or, 485158=(2) May apply the simplified supervisory formula approach in § 324.144 to the exposure, if the securitization exposure does not require deduction or a 1,250 percent risk weight under paragraph (g)(1) of this section;, 557917=(a)  Except as provided in §  324.172(b), an FDIC-supervised institution described in § 324.172(b) must make the disclosures described in Tables 1 through 13 to § 324.173. The FDIC-supervised institution must make the disclosures required under Tables 1 through 12 publicly available for each of the last three years (that is, twelve quarters) or such shorter period beginning on January 1, 2014. The FDIC-supervised institution must make the disclosures required under Table 13 publicly available beginning on January 1, 2015., 749614=(iii)  For purposes of calculating the transition deductions in this paragraph (b)(4), beginning January 1, 2014, for an advanced approaches FDIC-supervised institution, and beginning January 1, 2015, for an FDIC-supervised institution that is not an advanced approaches FDIC-supervised institution, and in each case through December 31, 2017, an FDIC-supervised institution's 15 percent common equity tier 1 capital deduction threshold for MSAs, DTAs arising from temporary differences that the FDIC-supervised institution could not realize through net operating loss carrybacks, and significant investments in the capital of unconsolidated financial institutions in the form of common stock is equal to 15 percent of the sum of the FDIC-supervised institution's common equity tier 1 elements, after regulatory adjustments and deductions required under § 324.22(a) through (c) (transition 15 percent common equity tier 1 capital deduction threshold)., 128065=[Section 324.35 amended at 79 Fed. Reg. 20760, April 14, 2014, Effective April 14, 2014, mandatory compliance date: January 1, 2014, for advanced approaches FDIC-supervised institutions, January 1, 2015 for all other FDIC-supervised institutions], 513127=1 a = \u0096 _______ p |b1 KA u = D \u0096 KA l = max (A \u0096 KA, 0) e = 2.71828, the base of the natural logarithms., 52190=(B)  A tier 2 capital instrument if such instrument was included in the issuer's tier 2 capital (but not includable in tier 1 capital) prior to May 19, 2010., 319846=(D)  May use internal estimates of dependence among operational losses across and within units of measure if the FDIC-supervised institution can demonstrate to the satisfaction of the FDIC that its process for estimating dependence is sound, robust to a variety of scenarios, and implemented with integrity, and allows for uncertainty surrounding the estimates. If the FDIC-supervised institution has not made such a demonstration, it must sum operational risk exposure estimates across units of measure to calculate its total operational risk exposure; and, 497501=[Section 324.142 amended at 79 Fed. Reg. 20761, April 14, 2014, Effective April 14, 2014, mandatory compliance date: January 1, 2014, for advanced approaches FDIC-supervised institutions, January 1, 2015 for all other FDIC-supervised institutions], 349248=[Section 324.131 amended at 79 Fed. Reg. 20761, April 14, 2014, Effective April 14, 2014, mandatory compliance date: January 1, 2014, for advanced approaches FDIC-supervised institutions, January 1, 2015 for all other FDIC-supervised institutions], 110051=[Section 324.134 amended at 79 Fed. Reg. 20761, April 14, 2014, Effective April 14, 2014, mandatory compliance date: January 1, 2014, for advanced approaches FDIC-supervised institutions, January 1, 2015 for all other FDIC-supervised institutions], 158524=[Section 324.37 amended at 79 Fed. Reg. 20760, April 14, 2014, Effective April 14, 2014, mandatory compliance date: January 1, 2014, for advanced approaches FDIC-supervised institutions, January 1, 2015 for all other FDIC-supervised institutions], 758136=(c)  Scope. Until January 1, 2015, subpart B of part 325 of this chapter will continue to apply to banks and insured branches of foreign banks for which the FDIC is the appropriate Federal banking agency. Until January 1, 2015, subpart Y of part 390 of this chapter will continue to apply to state savings associations. Beginning on, and thereafter, January 1, 2015, this subpart H implements the provisions of section 38 of the FDI Act as they apply to FDIC-supervised institutions and insured branches of foreign banks for which the FDIC is the appropriate Federal banking agency. Certain of these provisions also apply to officers, directors and employees of those insured institutions. In addition, certain provisions of this subpart apply to all insured depository institutions that are deemed critically undercapitalized., 190603=[Section 324.42 amended at 79 Fed. Reg. 20760, April 14, 2014, Effective April 14, 2014, mandatory compliance date: January 1, 2014, for advanced approaches FDIC-supervised institutions, January 1, 2015 for all other FDIC-supervised institutions], 513733=[Section 324.144 amended at 79 Fed. Reg. 20761, April 14, 2014, Effective April 14, 2014, mandatory compliance date: January 1, 2014, for advanced approaches FDIC-supervised institutions, January 1, 2015 for all other FDIC-supervised institutions]}",
    "textBeforeTable": "TABLE 1 to § 324.11\u0097CALCULATION OF MAXIMUM PAYOUT AMOUNT (iv)  Prior approval. Notwithstanding the limitations in paragraphs (a)(4)(i) through (iii) of this section, the FDIC may permit an FDIC-supervised institution to make a distribution or discretionary bonus payment upon a request of the FDIC-supervised institution, if the FDIC determines that the distribution or discretionary bonus payment would not be contrary to the purposes of this section, or to the safety and soundness of the FDIC-supervised institution. In making such a determination, the FDIC will consider the nature and extent of the request and the particular circumstances giving rise to the request. (B)  Capital conservation buffer was less than 2.5 percent as of the end of the previous calendar quarter. (A)  Eligible retained income is negative; and (iii)  Negative eligible retained income. Except as provided in paragraph (a)(4)(iv) of this section, an FDIC-supervised institution may not make distributions or discretionary bonus payments during the current calendar quarter if the FDIC-supervised institution's: (ii)  An FDIC-supervised institution with a capital conservation buffer that is greater than 2.5 percent plus 100 percent of its applicable countercyclical capital buffer, in accordance with paragraph (b) of this section, is not subject to a maximum payout amount under this section. (4)  Limits on distributions and discretionary bonus payments. (i) An FDIC-supervised institution shall not make distributions or discretionary bonus payments or create an obligation to make such distributions or payments during the current calendar quarter that, in the aggregate, exceed the maximum payout amount. (ii)  Notwithstanding",
    "textAfterTable": "Less than or equal to 0.625 percent plus 25 percent of the FDIC-supervised institution's applicable countercyclical capital buffer amount 0 percent (v)  Other limitations on distributions. Additional limitations on distributions may apply to an FDIC-supervised institution under 12 CFR 303.241 and subpart H of this part. (b)  Countercyclical capital buffer amount. (1) General. An advanced approaches FDIC-supervised institution must calculate a countercyclical capital buffer amount in accordance with the following paragraphs for purposes of determining its maximum payout ratio under Table 1 to § 324.11. (i)  Extension of capital conservation buffer. The countercyclical capital buffer amount is an extension of the capital conservation buffer as described in paragraph (a) of this section. (ii)  Amount. An advanced approaches FDIC-supervised institution has a countercyclical capital buffer amount determined by calculating the weighted average of the countercyclical capital buffer amounts established for the national jurisdictions where the FDIC-supervised institution's private sector credit exposures are located, as specified in paragraphs (b)(2) and (3) of this section. (iii)  Weighting. The weight assigned to a jurisdiction's countercyclical capital buffer amount is calculated by dividing the total risk-weighted assets for the FDIC-supervised institution's private sector credit exposures located in the jurisdiction by the total risk-weighted assets for all of the FDIC-supervised institution's private sector credit exposures. The methodology an FDIC-supervised institution uses for determining risk-weighted assets for purposes of this paragraph (b) must be the methodology that determines its risk-based capital ratios under § 324.10.",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}