{
    "relation": [
        [
            "Release",
            "12.2(28)ZV2",
            "Cisco IOS XE Release 2.4"
        ],
        [
            "Modification",
            "This command was introduced and implemented on the Cisco 10000 series router.",
            "This command was integrated into Cisco IOS XE Release 2.4."
        ]
    ],
    "pageTitle": "Cisco IOS Access Node Control Protocol Command Reference - Cisco IOS Access Node Control Protocol Commands [Support] - Cisco",
    "title": "",
    "url": "http://www.cisco.com/c/en/us/td/docs/ios-xml/ios/ancp/command/ancp-cr-book/ancp-a1.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042991076.30/warc/CC-MAIN-20150728002311-00055-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 362863951,
    "recordOffset": 362802376,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{424020=This command was implemented on the Cisco ASR 1000 Series Aggregation Services Router., 358206=The following example shows sample output from the showatmpvcinterfaceatminterface-numbervpi/vcivaccess command. In the output, the vpi/vcivaccess option causes the name of all of the virtual access interfaces (VAIs) to appear. These VAIs are associated with PVC 100/1000 on ATM subinterface ATM 3/0/0.6., 433716=(Optional) Port number for accounting requests; the host is not used for accounting if set to 0. If unspecified, the port number defaults to 1646., 344919=This command was implemented on Cisco ASR 1000 series routers., 408628=Enables the generation of interim service accounting records at periodic intervals for subscribers. The minutes argument indicates the number of periodic intervals to send accounting update records from 1 to 71582 minutes., 434623=(Optional) Number of requests per second that are to be sent to the server. Range: 1 to 1000. Default: 10., 433010=(Optional) Port number for authentication requests; the host is not used for authentication if set to 0. If unspecified, the port number defaults to 1646.}",
    "textBeforeTable": "Command History Global configuration (config) Command Modes ANCP cell tax accounting is disabled. Command Default Percentage by which the selected downstream shaping rate is multiplied. Valid values are from 1 to 100. The resulting shaping rate is applied to the terminating interface for subscriber links. factor Adjusts the selected downstream shaping rate by multiplying it by the specified factor. percent-factor Syntax Description percent-factor shaper ethernet ancp no factor percent-factor shaper ethernet vdsl ancp factor To enable Access Node Control Protocol (ANCP) cell tax accounting for Ethernet U-interface connections, use the ancp vdsl ethernet shaper command in global configuration mode. To disable ANCP cell tax accounting, use the no form of",
    "textAfterTable": "Usage Guidelines You must define the Access-Loop-Circuit-ID in the dot1q command for the router to adjust the downstream shaping rate. The syntax of the Access-Loop-Circuit-ID is: Aynchronous Transfer Mode/Digital Subscriber Line  \" Access-Node-Identifier atm slot / port : vpi . vci \" Ethernet/Digital Subscriber Line  \" Access-Node-Identifier ethernet slot / port [: vlan-id ]\" If the DSL type is 4 or 5, the router applies the ancp vdsl ethernet shaper command. Otherwise, the router does not apply the shaping factor. Note The ancp vdsl ethernet shaper command supports only VDSL1 (Very-high-bit-rate Digital Subscriber Line) and VDSL2 implementations. Examples The following example shows how to enable ANCP cell tax accounting for Ethernet links using a shaping factor of 95 percent.  ancp neighbor id dslam client-ID \"10.2.3.4 ethernet1/0/0.1\" ancp vdsl ethernet shaper percent-factor 95 ! policy-map speed:eth:10600:5000:80/0 description parent shaper for premium class class-default shape 10600 service-policy premium ! interface GigabitEthernet8/0/0.3128 encapsulation dot1q 3 second-dot1q 128 pppoe enable group global service-policy output speed:eth:10600:5000:80/0 Related Commands",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}