{
    "relation": [
        [
            "Patent application number",
            "20080200038",
            "20080311760"
        ],
        [
            "Description",
            "Heat processing method and apparatus for semiconductor process - A heat processing method for a semiconductor process includes placing a plurality of target substrates stacked at intervals in a vertical direction within a process field of a process container. Each of the target substrates includes a process object layer on its surface. Then, the method includes supplying an oxidizing gas and a deoxidizing gas to the process field while heating the process field, thereby causing the oxidizing gas and the deoxidizing gas to react with each other to generate oxygen radicals and hydroxyl group radicals, and performing oxidation on the process object layer of the target substrates by use of the oxygen radicals and the hydroxyl group radicals. Then, the method includes heating the process object layer processed by the oxidation, within an atmosphere of an annealing gas containing ozone or oxidizing radicals, thereby performing annealing on the process object layer.",
            "Film formation method and apparatus for semiconductor process - A silicon nitride film is formed on a target substrate by performing a plurality of cycles in a process field configured to be selectively supplied with a first process gas containing a silane family gas and a second process gas containing a nitriding gas. Each of the cycles includes a first supply step of performing supply of the first process gas while maintaining a shut-off state of supply of the second process gas, and a second supply step of performing supply of the second process gas, while maintaining a shut-off state of supply of the first process gas. The method is arranged to repeat a first cycle set with the second supply step including an excitation period of exciting the second process gas and a second cycle set with the second supply step including no period of exciting the second process gas."
        ],
        [
            "Published",
            "08-21-2008",
            "12-18-2008"
        ]
    ],
    "pageTitle": "Umezawa, JP - Patent applications",
    "title": "",
    "url": "http://www.faqs.org/patents/inventor/umezawa-jp-5/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988317.67/warc/CC-MAIN-20150728002308-00034-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 442388079,
    "recordOffset": 442355194,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Kota Umezawa, Nirasaki-Shi JP //]]> BarDraw('3600255',['Patent applications by Kota Umezawa, Tokyo-To JP'],[[2,3,1]],['2005','2006','2008'],0); // <script type=\"text/javascript\"> </div> <div id=\"legend3600255\" align=\"center\"></div> </div> <canvas id=\"bg3600255\" style=\"max-width: 500px; width: 100%;\"></canvas> <div> <p align=\"center\">Patent applications by Kota Umezawa, Tokyo-To JP</p> <div class=\"bar3600255\" style=\"max-width: 500px; width: 100%; float:left; \"> <div align=\"left\" style=\"padding-top:20px;\"> </table> </tbody> </tr> <td>10-30-2008</td> <td><a href=\"/patents/app/20080268654\">Oxidizing method and oxidizing unit for object to be processed</a> - An oxidizing method for an object to be processed according to the present invention includes: an arranging step of arranging a plurality of objects to be processed in a processing container whose inside can be vacuumed, the processing container having a predetermined length, a supplying unit of an oxidative gas being provided at one end of the processing container, a plurality of supplying units of a reducing gas being provided at a plurality of positions in a longitudinal direction of the processing container; an atmosphere forming step of supplying the oxidative gas and the reducing gas into the processing container in order to form an atmosphere having active oxygen species and active hydroxyl species in the processing container; and an oxidizing step of oxidizing surfaces of the plurality of objects to be processed in the atmosphere. The atmosphere forming step has: a selecting step of selecting a predetermined supplying unit of a reducing gas among the plurality of supplying units of a reducing gas, based on an arrangement number and respective arrangement positions of the plurality of objects to be processed in the",
    "textAfterTable": "Kota Umezawa, Yamanashi JP Patent application number Description Published 20120164848 METHOD FOR FORMING NITRIDE FILM - A plasma-assisted ALD method using a vertical furnace and being performed by repeating a cycle until a desired film thickness is obtained is disclosed. The cycle comprises introducing a source gas containing a source to be nitrided, adsorbing, purging, introducing a nitriding gas and nitriding the source, and then, purging. A flow rate of a second carrier gas during introduction of the nitriding gas is reduced relative to that of a first carrier gas during introduction of the source gas. Particularly, a flow ratio of NH 06-28-2012 Kota Umezawa, Nirasaki City JP Patent application number Description Published 20110281443 FILM FORMATION METHOD AND FILM FORMATION APPARATUS - The film formation method includes transferring an object to be processed into a process chamber; controlling a temperature of the object to be processed to be equal to or lower than 350° C.; and supplying an aminosilane gas as a Si source gas and an oxidizing gas into the process chamber, wherein the oxidizing gas consists of a first oxidizing gas comprising at least one selected from the group consisting of an O 11-17-2011 20140318457 METHOD OF CLEANING FILM FORMING APPARATUS AND FILM FORMING APPARATUS - A film forming apparatus includes: a processing chamber configured to accommodate a substrate to be processed, the processing chamber",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}