{
    "relation": [
        [
            "Categories",
            "Tips for prospective students",
            "Bang for the buck",
            "Am enjoying being here",
            "Am learning a lot"
        ],
        [
            "Comments",
            "It may not be a Big Ten school, but there's something for everyone. Get involved early to meet new people and be willing to meet them. Living in the dorms is a great way to meet different types of people, so be willing and keep your door open!",
            "Hard to say as a sophomore, but so far so good.",
            "The campus is beautiful! And the area is great. Everyone is friendly and willing to help. Like I said before, I love the class sizes and the professors are always willing to help.",
            "I love the class sizes. They are all small enough for the students to feel that they are getting the attention they need from their professors."
        ]
    ],
    "pageTitle": "University of St Thomas Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/University-of-St-Thomas-Saint-Paul/reviews?_escaped_fragment_=/show/16962",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042991076.30/warc/CC-MAIN-20150728002311-00005-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 886626855,
    "recordOffset": 886562234,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{104136=There is no denying it, the University of St. Thomas is a very expensive school. However, it is very rare that any student would pay full price. St. Thomas offers very generous 4-year academic scholarships to incoming freshman. They also have a great financial aid staff, a donation call center, lots of student jobs, and numerous other scholarship opportunities that can make the school a lot more affordable. If you really break it down, St. Thomas has a fairly high bang for the buck. The campus is growing with new buildings such as the beautiful Anderson Athletic & Recreation Center, which opened last year, and the massive new Anderson Student Center, which is expected to open January 2012. The professors are excellent, and the many different opportunities and programs that are included in the price of tuition are practically endless. St. Thomas is also viewed with very high prestige, and having a degree from here will definitely be an advantage in your future job search. That is why I give the school a 4 out of 5 stars in its bang for the buck., 264347=You are not a true Tommie until you kiss someone under the arches at midnight. All freshmen march through the arches before their first day of classes. One day during the week after move-in day, a bus full of St. Thomas students goes on a Target run after normal store hours for anything that was forgotten at home. Every year Ireland Hall hosts a teeter totter marathon that lasts 48 hours. More at the following website: http://www.stthomas.edu/news/category/community/tommie-traditions/, 219270=Within the first week of campus, first-year students march through a pair of arches on the south edge of the north campus. It is super awkward to walk between rows of cheering strangers, but there is a lunch afterwards :)., 131599=the anderson student center was just built and opened this january. there was a lot of money put into and it sure shows. there is a game room, bookstore, gas station like store, restaurant, bowling alley (2 lanes), dance area, and many other attractions that will catch one's eye., 328694=© 2015, Cappex.com, LLC}",
    "textBeforeTable": "07/31/2009 Reviewer is A current student here. 14 out of 14 people found this review useful. 1 of 73 Mirella from Burnsville, MN Check out reviews left by other students or leave your own review. You could win a free scholarship. University of St Thomas Reviews University of St Thomas › Minnesota › By State › Colleges › } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.create', -->",
    "textAfterTable": "Login to rate or flag the reviews Anonymous 02/25/2010 Reviewer is A current student here. 6 out of 6 people found this review useful. 2 of 73 Categories Comments Tips for prospective students When applying or coming to St. Thomas remember it's required you take 3 courses of Theology and 2 courses of Philosophy. Also, when choosing your classes make sure you are choosing classes that will fit with your major or minor, do not take classes that you do not need to or have to (you are paying about 3,000 each for these courses). Be sure to participate and be active in high school, a lot of colleges and university look to see you are involved! Bang for the buck Although they have great admissions counselors and financial aid officers to assist you from beginning to end, you can still wind up paying a lot of money out of pocket or through student loans. I think it's priced a little high, but if you come in with scholarships, grants, and a good package, this",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}