{
    "relation": [
        [
            "Name",
            "SUPARLINK CHARMS",
            "CERAMIC CHARMS",
            "DANGLE CHARMS",
            "ENAMEL CHARMS",
            "PHOTO CHARMS",
            "PUFFY CHARMS",
            "EMBOSSED CHARMS",
            "RED HEART LASER CHARMS",
            "LASER CHARMS"
        ],
        [
            "Product",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            ""
        ],
        [
            "Description",
            "The latest addition to our range of Italian Charms is our Superlink charms. Our Superlink Charms are sophisticated, of a high quality, are not bulky and provide legible writing on a 'white' enamel background.A Superlink's measurements are: the same height as a 9mm charm our superlink will connect to all Italian Charms and Italian Charm Bracelets and; it's double the width at 18mm of a standard 9mm Italian Charm We have designed an extensive range of Medical Alert Superlink charms with comfort & quality in mind.These charms are all Enamel 'thin' chips with gold tone trim.",
            "Crushed ceramic particles are baked and then poured into the Design 'chip' to create a natural reflective base. These are truly beautiful charms and are truly the 'top of the range'. Chips are manufactured as either 'thin' chip, 'thick' chip, with either gold tone or silver tone trim.",
            "Dangle Charms are made in either a similar manner to the Enamel Charm chips, with the addition of a dangle attachment to the link or a dangle attachment only. The dangle charm link itself is either attached to the front or at the base of the link. Finishes such as 'glitter' backgrounds, Rhinestones and a clear enamel coating are added during the production process and are noted in our listing.",
            "The Design for the enamel charm is created on a 'chip’. The chips are then either soldered or glued (using a jewellers glue) onto an Italian Charm link. Chips are manufactured as either 'thin' chip, ‘thick’ chip, with either gold tone or silver tone trim. Finishes such as 'glitter' backgrounds, Rhinestones and a clear enamel coating are added during the production process and are noted in our listing.",
            "Photo charms are made using High Quality Photo paper. Images or designs are printed and then glued onto a Blank Photo Charm dish link. A two part clear enamel resin is then applied over the top of the photo or image to protect the image. For those wanting to know even more ...GUIDELINE for Creating your Own Photo Charms (The information below is provided as a guideline only to assist you in creating your own Custom Made Photo Charms. The cutting tools, photo paper, adhesive and liquid gloss are not included, but are available at most Craft stores. Warning: Adult Supervision is Required) Using your digital camera software, resize your image to fit the 'Blank' photo charm recessed dish. Test print on normal paper in black & white until the desired result is achieved. Print the image on quality photo paper. Using a sharp cutting tool, trim the photo to size. Attach the photo to the 'Blank' photo charm recessed dish using a Craft Metal + Paper adhesive. Allow the photo to dry in accordance with the manufacturer's Craft Metal + Paper adhesive instructions. Using a Craft Liquid Gloss apply a two part mixture of Part (a) Hardener + Part (b) Resin to cover the photo. A bubble-free mixture of hardener and resin is required. Using a fine pointed object, gently guide the gloss to the edge of the photo charm link ensuring that the photo is completely covered. Check for bubbles. Before the resin starts to set, locate any bubbles and remove them using a fine pointed object. Gently guide any bubbles to the surface of the gloss.Allow a minimum of five (5) days for the Clear Enamel Gloss Resin to dry.",
            "Puffy charms & Links are charms that have had their designed impressed into the link from the inside out, to provide a 'raised' puffy look and feel. Some Puffy charms also have enamel added, which is sealed with a clear lacquer. Generally gold tone enamel applied to Puffy Charms will rub off over time leaving the Puffy link in silver tone. You can extend the life of your Puffy Charm enamel by giving it a coating of clear enamel resin from time to time.Starter Bracelets are also available in Puffy Links.",
            "Embossed charms and links are the opposite to Puffy Charms, whereby the design has been stamped / impressed into the link from the outside inwards, to provide an 'indented' embossed look and feel. Embossed charms then have enamel added, which is sealed with a clear lacquer resin. To prolong and maintain the life of your Embossed Enamel charm you can apply a clear coating of enamel resin from time to time.",
            "A Red Heart [RH] Laser Charm is a Laser engraved Charm with enamel added in the shapeof a heart to create a 'Red Heart' RH Laser Charm.",
            "Laser (engraved) charms are Matte (Matte / Brushed Stainless Steel) starter links which have been commercially laser engraved with writing or images."
        ]
    ],
    "pageTitle": "Stylysh Italian Charms items - Get great deals on Types of Charms items on eBay Stores!",
    "title": "",
    "url": "http://stores.ebay.com.au/stylyshitaliancharms/pages/types-of-charms",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042991076.30/warc/CC-MAIN-20150728002311-00335-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 232384707,
    "recordOffset": 232360636,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "    We buy our products in large quantities and pass those savings ... on to Our Customers Buy With Confidence from Stylysh Charms All Licensed charm details &/or the permission to use a trademark or logo, acknowledging the copyright/trademark owner, will appear in our Listings. We will not sell Unlicensed charms and for a Seller to do so is a Copyright &/or Trademark infringement. They pride themselves on their quality and vigorously protect their reputation ... as do we. We stock over 2,000 Italian Charms purchased from well known, major and highly respected Italian Charm manufacturers from around the World. … But first, let's clear up a few myths about the Prices of Italian Charms and exactly what are \"Licensed\" Charms …     We've designed this guide to help explain and provide a few examples of the various types of 9mm and Superlink Italian Individual Charms we stock … Types of Charms      ",
    "textAfterTable": "  An eBay Store maintained by: Member id stylysh_italian_charms ( Feedback Score Of 11835) Seller, manage Store Tools:My eBay  Learn more about feeds",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}