{
    "relation": [
        [
            "Entry:",
            "Allow Autoplay",
            "Always load favicon",
            "Interpolate Images",
            "Play Background Sound",
            "Show Animation"
        ],
        [
            "Description:",
            "Allow media to autoplay",
            "0 = Never 1 = Always 2 = Embedded only",
            "Smooth zooming of images",
            "If page has sound, play it. Note: Disabling makes voice features unavailable.",
            "Allow animation of images"
        ]
    ],
    "pageTitle": "Opera's Settings File Explained",
    "title": "[Multimedia]",
    "url": "http://help.opera.com/operaconfig/versions/Win32/11.10/en/index.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042982502.13/warc/CC-MAIN-20150728002302-00184-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 115431375,
    "recordOffset": 115394963,
    "tableOrientation": "HORIZONTAL",
    "lastModified": "Mon, 02 May 2011 11:26:24 GMT",
    "textBeforeTable": "This section of operaprefs.ini details the quick find history available in drop-down lists. [Matches] Full path to notes save file NotesFile Setting not operable MusicFile Full path to contact list file AddressFile Description: Entry: [MailBox] 0 Webmail Service URL to Web mail service Webmail Address Style for runtime generated mail pages Mail Style File Root directory for your email storage and settings Mail Root Directory UNIX time of the last consistency check of the mail database Mail Database Consistency Check Time 3 = Use system default 2 = Use external client 1 = Use Opera Set which email client to use. Handler Full path to external mail application External Application Replace undefined parameter with space when launching external application ExtAppParamSpaceSubst 1 = all messages 0 = current view Search for mail in: Default Mail Search Type Description: Entry: [Mail] Underline links Underline Strikethrough on links StrikeThrough Use border on all links Frame Link visited expiry time, hours Expiry (Hours) Link",
    "textAfterTable": "[Network] Entry: Description: Allow Cross Network Navigation 0 Allow Pre Authentication Allows faster HTTP authentication when password has been sent for parent directory. Check Local HostName Look for local hosts before trying autocomplete Disable HTTP OPTIONS requests Avoid sending \"options\" header to proxies Enable Content Blocker 1 Enable Cookies DNS Check Enable support for checking for the cookie monster bug with a DNS/HEAD request Enable Cookies V2 Enable support for Cookies version 2, RFC 2965 Enable HostName Expansion Enable autocompletion of server names Enable HostName Web Lookup Use Web service to search if server name lookup fails Enable NTLM Enable NTLM and Negotiate authentication methods (Windows only) HTTP Accept Empty string = use default. The entire HTTP \"Accept\" header must be typed in for alternative setting HTTP Accept Charset Data for HTTP header \"Accept-Charset\" HTTP Accept Language Comma-separated list of preferred languages for webpages, the data for HTTP header \"Accept-Language\" HTTP Idle Timeout Timeout for idle HTTP connection in seconds. 0 = no timeout HTTP Loading Delayed Timeout Timeout for HTTP Loading Delayed messages in seconds. 0 = no timeout Hold On Filling Pipelines Hold On Filling",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}