{
    "relation": [
        [
            "Categories",
            "What to do for fun",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "Go to events that are held on campus like a comedy show, go to the on campus rec centers, attend the college sporting events.",
            "Be prepared for the transition from high school to college. Ask questions to your professors, they love that about students. Have frequent meetings with advisers. Also get involved, the more you're involved the easier, and more fun the college experience will be.",
            "The University of Northern Colorado is a perfect school for those who want to be on a campus that big, but not extremely huge. The students here are extremely nice and open which makes the college environment more acceptable to live in. Not to mention the teachers are phenomenal, they are there to help you succeed not watch you struggle."
        ]
    ],
    "pageTitle": "University of Northern Colorado Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/University-of-Northern-Colorado/reviews?_escaped_fragment_=/show/35985",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042982502.13/warc/CC-MAIN-20150728002302-00222-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 876848983,
    "recordOffset": 876753978,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{196004=this year which is 2011 was my first year and from my experience it turn out to be a amazing school., 95401=As a college freshman I would advise prospective UNC students to keep your grades up in High School. Grades as well as extracurricular activities will get you into UNC. Stay out of trouble as well, enjoy your senior year of high school, but do not get into trouble because you do not want to miss out on a great college experience especially at UNC. The last thing to let you know is apply for financial aid. Get as much as you possibly can even if they are loans. Do not let money keep you from attending UNC. If you have financial aid questions the UNC Financial Aid office will help you. UNC Also gives out grants and scholarships to incoming freshmen. They have a Universal scholarship application that you can fill out in January once you create an Ursa account. Again to get those scholarships and grants you need the grades and extracurricular activities. YOU REALLY NEED TO FILL OUT A FASFA FORM AS WELL!!!, 484780=© 2015, Cappex.com, LLC}",
    "textBeforeTable": "07/22/2009 Reviewer is A current student here. 25 out of 25 people found this review useful. 1 of 119 Brittany from Greeley, CO Check out reviews left by other students or leave your own review. You could win a free scholarship. University of Northern Colorado Reviews University of Northern Colorado › Colorado › By State › Colleges › } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.create', -->",
    "textAfterTable": "Am enjoying being here The campus is beautiful. Being on summer break, I miss walking along the sidewalks under the gorgeous trees. I also miss gazing at the detailed architecture of the dorms and lecture halls. I love the small class size and the professors seemed so determined to have every student succeed, no matter how big the class is. UNC also offers great tutoring services which includes one on one or supplemental instruction (group). Am learning a lot I had no idea I could cram so much information into my head. I find myself doing everyday activities and understanding so much more about them that I did before. Every time I clean my fish tank, I wonder how many different molecules are in the water and how I can eliminate them or produce more using my knowledge of chemistry. I watch the Discovery channel and find myself naming the phylum or class of the species I see. Login to rate or flag the reviews David from Parker, CO 01/26/2010 Reviewer is A current student here. 11 out of 11 people found this review useful. 2 of",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}