{
    "relation": [
        [
            "Categories",
            "Share any unusual traditions or locations on campus",
            "Bang for the buck",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "The main campus is located in the beautiful city of Grants Pass, and is surrounded by woods.",
            "RCC keeps the fees and costs as low as possible.",
            "The student government sponsors different activities throughout the year. The last activity was Zombiefest.",
            "The cafeteria has good food, though the prices are a bit high for sandwiches and wraps.",
            "There are no dorms at RCC.",
            "Varies from instructor to instructor. All push for you to do your best and instructors are mostly willing to go the extra mile to help.",
            "RCC offers a program called Moving On. It is designed to give you a hand up in starting your college career and sets you on the right track. Students who are or have been in the program know more about the campus and the opportunities available for students than the average student off the street. The staff and instructors make school come alive.",
            "Rogue Community College is a school with caring instructors and programs to assist all levels of students. With three campuses spread out around the Rogue Valley, RCC has made education available to many more students than if it had been limited to just the main campus. I would highly recommend attending RCC before moving on to a four year school."
        ]
    ],
    "pageTitle": "Rogue Community College Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Rogue-Community-College/reviews?_escaped_fragment_=/show/69797",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988317.67/warc/CC-MAIN-20150728002308-00278-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 910515835,
    "recordOffset": 910465903,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{96970=Rogue Community College offers fun things to do occasionally. For example at the end of May they have a block party that has free food and games., 248005=© 2015, Cappex.com, LLC, 154875=This really just depends on the classes you're taking! I would say in general the classes are time-consuming and require effort and studying. The most difficult class I've taken at RCC was Biology 211 (General Biology), but, again, this mostly just took a lot of time for studying. I have had some psychology classes here that have been very simple, as well as a human development course and a grammar course., 62762=Most the classes here at RCC are tranferable credits that can work toward most degrees in large universities in Oregon. the usual rate is $200.-$500(March 2012) per class, about 4 credits. Definately worth the buck., 148404=RCC has a great sports program that just started in the Fall of 2012}",
    "textBeforeTable": "06/26/2010 Reviewer is A current student here. 6 out of 6 people found this review useful. 1 of 63 Mary from Medford, OR Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5",
    "textAfterTable": "Great for these types of students -Low income individuals -People who have complex schedules i.e. Family matters, work, and the like. -Students who love stable environments/small class groups. -People who enjoy flexibility -Students who still may not know what major they want. Rogue Community College is a great place to start before you decide what career you want for the rest of your life! Tips for prospective students -Know the area well, it is easy to get lost. -Take the time to get to know Rogue Central and the Counseling Department. Make sure they are giving you the correct information. -Take the time to talk to teachers. A lot of them are helpful more so than the counselors at times! -Go in with the mindset that even though it is a community college, it will push you mentally to do your best! Bang for the buck Trust me when I say this, Rogue Community College is affordable for anyone who takes the time to look into their financial aid programs. Sure, the tuition right now has gone up a bit but compared to the prices of many high universities, Rogue Community College is a safe haven for students who come from low income families, and who already struggle in the economy while trying to make ends meet. The only drawback to",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}