{
    "relation": [
        [
            "Date",
            "October 14",
            "October 18",
            "October 18",
            "October 18"
        ],
        [
            "Time",
            "7:00 PM",
            "2:00 PM",
            "4:00 PM",
            "TBA"
        ],
        [
            "Visiting team",
            "Louisiana-Lafayette",
            "Appalachian State",
            "New Mexico State",
            "Georgia State"
        ],
        [
            "Home team",
            "Texas State",
            "Troy",
            "Idaho",
            "South Alabama"
        ],
        [
            "Site",
            "Bobcat Stadium • San Marcos, TX",
            "Veterans Memorial Stadium • Troy, AL",
            "Kibbie Dome • Moscow, ID",
            "Ladd Peebles Stadium • Mobile, AL"
        ],
        [
            "TV",
            "ESPN2",
            "ESPN3",
            "ESPN3",
            "ESPN3"
        ],
        [
            "Result",
            "ULL 34-10",
            "APPST 53-14",
            "Idaho 29-17",
            "USA 30-27"
        ],
        [
            "Attendance",
            "18,509",
            "15,664",
            "15,207",
            "13,186"
        ]
    ],
    "pageTitle": "2014 Sun Belt Conference football season - Wikipedia, the free encyclopedia",
    "title": "",
    "url": "https://en.wikipedia.org/wiki/2014_Sun_Belt_Conference_football_season",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988317.67/warc/CC-MAIN-20150728002308-00146-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 859788911,
    "recordOffset": 859757529,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{29085=Sun Belt Conference Media Day was held on July 22, 2014 in the Mercedes-Benz Superdome in New Orleans, Louisiana., 11305=The 2014 Sun Belt Conference football season was the 14th college football season for the Sun Belt Conference. During the 2014 season, eleven schools competed in Sun Belt football: Appalachian State, Arkansas State, Georgia Southern, Georgia State, Idaho, Louisiana–Lafayette, Louisiana–Monroe, New Mexico State, South Alabama, Texas State, and Troy.[1], 113866=In 2014, the SBC placed three teams in bowl games through their tie-ins: Louisiana–Lafayette, Arkansas State, and South Alabama. Texas State was also bowl-eligible but did not receive a bowl invitation.[29] Georgia Southern and Appalachian State, despite having bowl-eligible records (9-3 and 7-5, respectively) and the former winning the conference championship, were not bowl-eligible due to FCS-to-FBS transition rules, since 81 full FBS members became bowl-eligible for the 76 bowl slots available., 13164=The conference title was won by Georgia Southern, in its first year as both a Sun Belt member and an FBS program. The Eagles became only the third team to win a conference championship in their first FBS season. The other two schools to accomplish this feat were Nevada, Big West Conference champions in 1992, and Marshall, which won the Mid-American Conference crown in 1997. Georgia Southern also became the first team ever to go unbeaten in conference play in its first FBS season (both the 1992 Nevada and 1997 Marshall teams lost once in conference play).[2]}",
    "lastModified": "Sat, 25 Jul 2015 10:24:18 GMT",
    "textBeforeTable": "Week 1[edit] Rankings reflect that of the USA Today Coaches poll for that week until week eight when the BCS poll will be used. Start times for non-conference games are local for the Sun Belt team; for conference games, starting times are local for the home team. The following list are the teams in there respective time zones: Arkansas State, Louisiana–Monroe, Louisiana–Lafayette, South Alabama, Texas State and Troy are located in the Central Time Zone; Appalachian State, Georgia State, Georgia Southern is in the Eastern Time Zone; New Mexico State is in the Mountain Time Zone and Idaho is in the Pacific Time Zone. All dates, times, and TV are tentative and subject to change. Sun Belt teams in bold Sun Belt member lost Sun Belt member won Index to colors and formatting Regular season[edit] L 12-37 SEC South Carolina South Alabama November 22 L 0-28 ACC Clemson Georgia State November 22 L 16-21 SEC",
    "textAfterTable": "August 30 11:00 AM Troy UAB Legion Field • Birmingham, AL FCS L 10-48 27,133 August 30 12:30 PM Georgia Southern NC State Carter-Finley Stadium • Raleigh, NC ACCN/ESPN3 L 23-24 54,273 August 30 4:00 PM Idaho Florida Ben Hill Griffin Stadium • Gainesville, FL ESPNU Canceled due to weather - August 30 6:00 PM #18 (FCS) Montana State Arkansas State Centennial Bank Stadium • Jonesboro, AR ESPN3 W 37-10 26,143 August 30 6:00 PM Southern Louisiana-Lafayette Cajun Field • Lafayette, LA ESPN3 W 45-6 36,170 August 30 6:00 PM Arkansas-Pine Bluff Texas State Bobcat Stadium • San Marcos, TX ESPN3 W 65-0 17,813 Open Week: South Alabama Players of the Week[17] Offensive Defensive Special teams Player Team Player Team Player",
    "hasKeyColumn": true,
    "keyColumnIndex": 2,
    "headerRowIndex": 0
}