{
    "relation": [
        [
            "Categories",
            "Greek Life",
            "Clubs and Activities",
            "Share any unusual traditions or locations on campus",
            "Bang for the buck",
            "What to do for fun",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "none.",
            "check out the Neumann Media club, home to the newspaper, radio station, and television studios. www.media.neumann.edu",
            "Mass held daily.",
            "NU is a private University, so tuition is more on the expensive side.",
            "Join a club. Go to the gym. Attend sports events.",
            "Stay on top of assignments and due dates. Make sure to get out of your dorm room and join some extra circular activities.",
            "Neumann is a small, close knit school for those who aren't attending college to party, but are interested in getting a good degree, meeting new friends, and participating in extra circular activities. Since NU is small compared to other universities, students will have the advantage of getting to know their professors on a first name basis. Teachers also are highly interested in student's benefits and growing intellect."
        ]
    ],
    "pageTitle": "Neumann University Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Neumann-University/reviews?_escaped_fragment_=/show/9338",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042991076.30/warc/CC-MAIN-20150728002311-00270-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 891532239,
    "recordOffset": 891492104,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{154012=© 2015, Cappex.com, LLC, 53133=it is very welcoming to outsiders and new comers. as a freshman this current year (2011-12) i have met some great friends which made college an easier experience. the classes are small are extra help is greatly expressed through our arc program filled with tutors and extra needed time for assignments. they really work with you.}",
    "textBeforeTable": "02/11/2011 Reviewer is A current student here. 7 out of 7 people found this review useful. 1 of 37 Tim from Barto, PA Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp",
    "textAfterTable": "Categories Comments Tips for prospective students Work hard and make sure you mange your time. Will enjoy being here I enjoy looking over the different information about Neumann College. Will learn a lot I learn alot from doing research online Login to rate or flag the reviews Eric from Willingboro, NJ 01/25/2012 Reviewer is A current student here. 1 out of 1 people found this review useful. 3 of 37 Categories Comments Campus Safety you will see campus security all over campus and there are very helpful Greek Life no greek life at this time Clubs and Activities i play basketball Great for these types of students all students",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}