{
    "relation": [
        [
            "Task ID",
            "tunnel",
            "interface"
        ],
        [
            "Operations",
            "read, write",
            "read, write"
        ]
    ],
    "pageTitle": "Cisco IOS XR System Security Command Reference for the Cisco CRS Router, Release 4.1 - IPSec Commands [Cisco IOS XR Software (End-of-Sale)] - Cisco",
    "title": "",
    "url": "http://www.cisco.com/c/en/us/td/docs/routers/crs/software/crs_r4-1/security/command/reference/b_syssec_cr41crs/b_syssec_cr41crs_chapter_010.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042991076.30/warc/CC-MAIN-20150728002311-00147-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 371979447,
    "recordOffset": 371963053,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Syntax Description { sa-id | all | counters | { sa-id | all } | interface tunnel-ipsec } sa ipsec crypto clear To delete specific security associations (SAs), or all SAs in the IP Security (IPSec) security associations database (SADB), use the clear crypto ipsec sa command. clear crypto ipsec sa tunnel dfbit disable (IP) tunnel ttl (IP) tunnel tos (IP) tunnel mode (IP) show crypto ipsec transform-set show crypto ipsec summary show crypto ipsec sa interface tunnel-ip (GRE) description (IPSec profile) clear crypto ipsec sa The following IPSec commands are available only if the <platform>-k9sec.pie is installed. Note This module describes the IPSec commands. IPSec Commands tunnel dfbit disable (IP) tunnel ttl (IP) tunnel tos (IP) tunnel mode (IP) show crypto ipsec transform-set show crypto ipsec summary",
    "textAfterTable": "tunnel-ipsec The range of tunnel-ipsec is <0-4294967295>. Command Default No default behavior or values Command Modes EXEC Command History Release Modification Release 2.0 This command was introduced. Release 3.4.0 The range for the sa-id argument increased to 16500 sessions. Release 3.6.0 The upper limit for the sa-id argument range was increased to 64,500 sessions. Usage Guidelines SAs are established to secure data flows in IPSec. Use the clear crypto ipsec sa command to delete active IPSec sessions or force IPSec to reestablish new SAs. Usually, the establishment of SAs is negotiated between peers through Internet Key Exchange (IKE) on behalf of IPSec.",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}