{
    "relation": [
        [
            ": name",
            ";",
            "buffer: name",
            "constant name",
            "create name",
            "defer name",
            "value name",
            "variable name"
        ],
        [
            "( -- ) Usage: ( ??? -- ? )",
            "( -- )",
            "( size -- ) Usage: ( -- adr )",
            "( n -- ) Usage: ( -- n )",
            "( -- ) Usage: ( -- adr )",
            "( -- ) Usage: ( ??? -- ? )",
            "( n -- ) Usage: ( -- n )",
            "( -- ) Usage: ( -- adr )"
        ],
        [
            "Start creating a new colon definition.",
            "Finish creating a new colon definition.",
            "Create a named array in temporary storage.",
            "Define a constant (for example, 3 constant bar).",
            "Generic defining word.",
            "Define forward reference or execution vector.",
            "Create a changeable, named quantity.",
            "Define a variable."
        ]
    ],
    "pageTitle": "",
    "title": "",
    "url": "http://docs.oracle.com/cd/E19620-01/805-4437/6j4727sq2/index.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042982502.13/warc/CC-MAIN-20150728002302-00102-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 71841743,
    "recordOffset": 71823297,
    "tableOrientation": "HORIZONTAL",
    "lastModified": "Thu, 30 Dec 2010 14:34:21 GMT",
    "textBeforeTable": "Table 1-1 Numeric Usage and Stack Comments A stack comment such as (n1 n2 -- n3) or (adr len --) or (--) listed after each command name shows the effect on the stack of executing that command. Items before the -- are used by the command and removed from the stack. These items must be present on the stack before the command can properly execute. Items after the -- are left on the stack after the command completes execution, and are available for use by subsequent commands. The command .s non-destructively shows the entire stack contents. The command \".\" removes and displays the top stack value. A numeric stack is used for all numeric parameters. Typing any integer puts that value on top of the stack. (Previous values are pushed down.) The right-hand item in a set always indicates the topmost stack item. Use 10 .d to see which base is currently active. Switch to decimal with decimal, switch to hexadecimal with hex. Numeric I/O defaults to hexadecimal. Numeric Usage and Stack Comments Enter commands at the ok prompt. They are executed left-to-right after a carriage-return. Separate all commands by one or more spaces. Syntax Chapter 1 OpenBoot 3.x Quick Reference Previous: Book Information",
    "textAfterTable": "flag xxx? 0 = false; any other value = true (usually -1).  long lxxx 32-bit value.  n n1 n2 n3 Normal signed values.  +n u Unsigned, positive values.  phys Physical address (actual hardware address).  pstr Packed string (adr len means unpacked string). virt Virtual address (address used by software).  word wxxx 16-bit value.  xt Execution token.  Help Commands Table 1-2 Help Commands help List main help categories.  help category Show help for all commands in the category. Use only the first word of the category description. help command",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}