{
    "relation": [
        [
            "Mission No.",
            "261",
            "262",
            "263",
            "264",
            "265",
            "266",
            "267",
            "268",
            "269",
            "270"
        ],
        [
            "Mission",
            "Space Hog",
            "He Who Devours",
            "And Thoroughly Enjoys It",
            "Contract Killer",
            "Bastich",
            "Double Barrel",
            "Space Dolphins",
            "Death Warrent",
            "Self Centered",
            "Phantom Zone"
        ],
        [
            "Description",
            "Head to the Watchtower to find info on Superman. Dodge rocks with LS and shoot incoming rocks with the Space Hog's blaster.",
            "Upon arriving at the Watchtower, Lobo is confronted by Nightwing. Execute each move at the top of the Screen.",
            "Defeating Nightwing has alarmed the Watchtower's enforcers. Stop Cyborg while the trail is still hot and avoid attacks from the Martian Manhunter.",
            "Deathstroke has been sent to stop Lobo. Shoot the Incoming Grenades.",
            "Superman is no longer here. Instead, defeat Batman and track the Kryptonian. Batman has equipped a gas cloud device that will damage Lobo when close.",
            "Superman realizes that Lobo is hot on his trail and is using the Lantern Corps. Lobo does more damage while wearing the Red Lantern ring.",
            "A blast from the Watchtower has thrown Lobo from his Space Hog. While falling to Earth, rescue Space Dolphins to fill Lobo's Dolphin meter.",
            "Upon crashing to Earth, Lobo's remains have formed into weaker clones of himself. Use the Lobo clones to defeat Wonder Woman.",
            "There can only be one Lobo. Defear your last clone no matter how pretty he is.",
            "Your battles have led you to the enterance of the Phantom Zone. Defeat an enraged Doomsday and learn how to gain access to the Kryptonian void."
        ],
        [
            "3 Star Req.",
            "Reach the Watchtower Win without using the Blaster Blast 50 boulders",
            "Complete the mission Execute a 20 Hit Combo Land a 4 Hit Juggle Combo",
            "Defeat Cyborg Win after getting First Hit Don't get hit by the explosions",
            "Defeat Deathstroke Don't get hit Shoot 100 Times",
            "Defeat Batman Connect with a Super Move Execute 5 Meter Burn Special Moves",
            "Defeat the Corps. Win with a Throw Win With a Super Move",
            "Fall to the Fortress of Solitude Save 20 Dolphins Avoid all meteors",
            "Use Lobo clones to stop Wonder Woman Win with 10 or more clones remaining Win with the last clone",
            "Defeat the final clone Win after getting First Hit Throw twice",
            "Gain enterance to the Phantom Zone Connect 10 Special Moves Disable Stone Skin 3 Times"
        ]
    ],
    "pageTitle": "S.T.A.R. Labs Missions - Injustice:Gods Among Us Wiki",
    "title": "",
    "url": "http://injusticegodsamongus.wikia.com/wiki/S.T.A.R._Labs_Missions",
    "hasHeader": true,
    "headerPosition": "MIXED",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042991076.30/warc/CC-MAIN-20150728002311-00102-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 124048335,
    "recordOffset": 124004122,
    "tableOrientation": "HORIZONTAL",
    "lastModified": "Mon, 05 Jan 2015 22:13:43 GMT",
    "textBeforeTable": "Superman In order to train heroes from across the globe, S.T.A.R. Labs has created a wealth of character-specific missions that replicate a series of challenging circumstances to overcome. Try to achieve three stars in every mission for the ultimate prize. An additional 180 stars can be earned by completing all of the challenges for the Red Son & DLC Characters S.T.A.R. Labs missions (thus making the maximum total of 900 stars). S.T.A.R. Labs Missions consist of special scenarios that the player can take part in. These missions range from battles with  NPC'S, or minigames that rely on platforming, button rhythm, or stealth. Each Mission contains three Stars that are earned by meeting certain requirements in the mission. Each character has a ten mission storyline. There are 240 Missions in total, along with an additional 20 Missions included with the Red Son DLC pack thus increasing it to 260. The other objective of this mode is to collect all 720 stars to complete it.  Missions [show] Contents S.T.A.R Labs Missions is a Single-Player mode in Injustice: Gods Among Us. } document.write('",
    "textAfterTable": "Batman Mission No. Mission Description 3 Star Req. 011 Sparring Practice Batman must hone his skills before going after Arkham's deadliest villains. Execute the moves listed on top of the screen to spar. Show Nightwing how rusty you are Land a 10 Hit Combo Hit Nightwing 15 times in the head 012 Baffled Bats Scarecrow's fear-inducing poison fills the air. Capture Raven before Scarecrow's madness overcomes Batman's reality. Apprehend Raven Use an Interactive Object Win a Clash 013 Grenades And Grundy Grundy, a zombie, is tough to damage with hand-to-hand combat. Use the undead grenades located around The Batcave to do significant damage. Apprehend Grundy Win without missing a grenade Win without using grenades 014 Pie In The Face Stop Joker and Harley from trying to escape Arkham. Avoid their attacks of incoming pies and chattering teeth to reach the evil duo. Reach Joker and",
    "hasKeyColumn": true,
    "keyColumnIndex": 1,
    "headerRowIndex": 0
}