{
    "relation": [
        [
            "Version",
            "7.x-2.x-dev",
            "6.x-2.x-dev"
        ],
        [
            "Download",
            "tar.gz (20.13 KB) | zip (23.52 KB)",
            "tar.gz (18.87 KB) | zip (21.62 KB)"
        ],
        [
            "Date",
            "2015-Feb-21",
            "2015-Feb-21"
        ]
    ],
    "pageTitle": "Module project | Drupal.org",
    "title": "",
    "url": "https://www.drupal.org/project/project_module?page=40",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042991076.30/warc/CC-MAIN-20150728002311-00021-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 895247207,
    "recordOffset": 895225367,
    "tableOrientation": "HORIZONTAL",
    "lastModified": "Tue, 04 Aug 2015 18:12:15 GMT",
    "textBeforeTable": "Recommended releases Downloads By default, on taxonomy term pages, Drupal will display a list of nodes (teaser build mode) that are tagged with that term. Disable Term Node Listing allows you to selectively disable node listings on taxonomy term pages by vocabulary. Once the listing is disabled, view blocks or views embedded using EVA: Entity Views Attachment can be used instead. Introduction February 20, 2012 at 7:04pm akeemw on Posted by Disable Term Node Listings Extend and customize Drupal functionality with contributed modules. If a module doesn't quite do what you want it to do, if you find a bug or have a suggestion, then join forces and help the module maintainer. Or, share your own by starting a new module. RelevancyTitleAuthorCreated dateLast releaseLast buildMost installed Sort by Search Modules",
    "textAfterTable": "Development releases Version Download Date 7.x-1.x-dev tar.gz (10.43 KB) | zip (12.18 KB) 2015-Mar-11 View all releases Read more about Disable Term Node Listings ⋅ Categories: Minimally maintained, Under active development, Content Display, Taxonomy, Utility Open Atrium Contextual Tabs Posted by beeradb on July 16, 2013 at 4:01pm This module contains contextual tabs customizations for Open Atrium 2. Submit an Issue or See issue queue Downloads Recommended releases Version Download Date",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}