{
    "relation": [
        [
            "Religion",
            "Catholic",
            "Evangelical Protestant",
            "Black Protestant",
            "Mainline Protestant",
            "Other",
            "Orthodox",
            "None"
        ],
        [
            "Adherents",
            "24,812",
            "24,572",
            "15,670",
            "8,426",
            "3,532",
            "237",
            "80,256"
        ],
        [
            "Congregations",
            "11",
            "152",
            "51",
            "54",
            "13",
            "4",
            "-"
        ]
    ],
    "pageTitle": "Kansas City, Kansas (KS) profile: population, maps, real estate, averages, homes, statistics, relocation, travel, jobs, hospitals, schools, crime, moving, houses, news, sex offenders",
    "title": "",
    "url": "http://www.city-data.com/city/Kansas-City-Kansas.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042982502.13/warc/CC-MAIN-20150728002302-00086-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 359385071,
    "recordOffset": 359254795,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{20177=Incorporated on 10/1872, 4921=According to our research of Kansas and other state lists there were 454 registered sex offenders living in Kansas City, Kansas as of July 28, 2015. The ratio of number of residents in Kansas City to the number of sex offenders is 324 to 1.}",
    "TableContextTimeStampAfterTable": "{66162=Sulfur Dioxide (SO2) [ppb] level in 2012 was 6.42. This is significantly worse than average. Closest monitor was 2.1 miles away from the city center., 83580=School Enrollment by Level of School (%) in 2013, 65418=Nitrogen Dioxide (NO2) [ppb] level in 2012 was 14.2. This is significantly worse than average. Closest monitor was 2.1 miles away from the city center., 220902=Recent home sales and price trends information powered by Onboard Informatics © 2015 Onboard Informatics. Information is deemed reliable but not guaranteed.   City-data.com does not guarantee the accuracy or timeliness of any information on this site.  Use at your own risk. Website © 2015 Advameg, Inc., 87581=2012 Presidential Elections Results, 115351=8.11% of this county's 2010 resident taxpayers moved to other counties in 2011 ($30,597 average adjusted gross income), 86437=1996 Presidential Elections Results, 52915=Tourist attractions: Children's Museum of Kansas City (4601 State Avenue) (1), Grinter Place Museum (1400 South 78th Street) (2), Strawberry Hill Museum & Cultural Center Inc (Cultural Attractions- Events- & Facilities; 720 North 4th Street) (3), Libraries Public - Kansas City Kansas- FL Schlagel (Cultural Attractions- Events- & Facilities; 4051 West Drive) (4), Larry's Sunflower Market (Amusement & Theme Parks; 7560 State Avenue) (5), Denron Amusement CO (Amusement & Theme Parks; 941 North 74th Drive) (6), Convention & Visitors Bureau of Kansas City Kansas (727 Minnesota Avenue) (7), Kansas State - Tourist Information (350 Speedway Boulevard) (8), Kincaid Coach Lines Inc (Tours & Charters; 9207 Woodend Rd) (9). Display/hide their approximate locations on the map, 16703=On 5/22/1952, a category F4 (max. wind speeds 207-260 mph) tornado 3.5 miles away from the city center injured 3 people and caused between $50,000 and $500,000 in damages., 219573=Total of 144 patent applications in 2008-2015., 87009=2004 Presidential Elections Results, 64022=Air Quality Index (AQI) level in 2012 was 112. This is significantly worse than average., 54068=Hotels: Comfort Inn Kansas City (234 North 78th Street) (1), Microtel Inn & Suites (7721 Elizabeth Avenue) (2), Days Inn Inc (3930 Rainbow Boulevard) (3), Gladstone Gene & Associates (2710 West 43rd Avenue) (4), Gables Motel (6831 State Avenue) (5), Best Western Flamingo Motel (4725 State Avenue) (6), Best Western Inn (501 Southwest Boulevard) (7), Best Western Inn & Conference (501 Southwest Boulevard) (8), Hampton Inn Kansas City at Village West (1400 Village West Parkway) (9). Display/hide their approximate locations on the map, 87295=2008 Presidential Elections Results, 87865=Graphs represent county-level data. Detailed 2008 Election Results, 68358=Particulate Matter (PM2.5) [µg/m3] level in 2012 was 9.88. This is about average. Closest monitor was 2.3 miles away from the city center., 67604=Particulate Matter (PM10) [µg/m3] level in 2012 was 25.4. This is worse than average. Closest monitor was 2.3 miles away from the city center., 64683=Carbon Monoxide (CO) [ppm] level in 2012 was 0.518. This is significantly worse than average. Closest monitor was 2.3 miles away from the city center., 66905=Ozone [ppb] level in 2012 was 31.8. This is about average. Closest monitor was 2.3 miles away from the city center., 20043=Birthplace of: Charlie Parker - (1920-1955), jazz musician, Theresa Sparks - Businessman, James W. Holsinger - Surgeon General nominee, Janelle Monáe - Female singer, Phill Kline - Politician, Bob Orton, Jr. - Professional wrestler, Charles Townsend (BMX rider) - Bicycle motocross rider, Bruce Lietzke - Professional golfer, Richard Rhodes - Journalist and author, Maurice Greene (athlete) - America athlete., 113132=7.48% of this county's 2011 resident taxpayers lived in other counties in 2010 ($28,127 average adjusted gross income), 83182=Educational Attainment (%) in 2013, 16382=On 5/20/1957, a category F5 (max. wind speeds 261-318 mph) tornado 17.2 miles away from the Kansas City city center killed 44 people and injured 207 people and caused between $500,000 and $5,000,000 in damages., 86723=2000 Presidential Elections Results}",
    "textBeforeTable": "Religion statistics for Kansas City city (based on Wyandotte County data) Wolcott neighborhood Victory Hills neighborhood Turner neighborhood Shawnee Heights neighborhood Santa Fe neighborhood Rosedale neighborhood Riverview neighborhood Quindaro Bluffs neighborhood Prairie Piper neighborhood Northwest neighborhood Northeast neighborhood Nearman Hills neighborhood Nearman neighborhood Muncie Stony Point neighborhood Morris neighborhood Kensington neighborhood I-435 (I435) neighborhood Fairfax neighborhood Edwardsville neighborhood Coronado neighborhood Central Industrial District neighborhood Bethel Welborn neighborhood Armourdale neighborhood Argentine neighborhood Kansas City, Kansas Neighborhood Map) Neighborhoods in Kansas City:( Graphs represent county-level data. Detailed 2008 Election Results 2012 Presidential Elections Results 2008 Presidential Elections Results 2004 Presidential Elections Results 2000 Presidential Elections Results",
    "textAfterTable": "Source: Clifford Grammich, Kirk Hadaway, Richard Houseal, Dale E.Jones, Alexei Krindatch, Richie Stanley and Richard H.Taylor. 2012. 2010 U.S.Religion Census: Religious Congregations & Membership Study. Association of Statisticians of American Religious Bodies. Jones, Dale E., et al. 2002. Congregations and Membership in the United States 2000. Nashville, TN: Glenmary Research Center. Graphs represent county-level data Food Environment Statistics: Number of grocery stores: 23 Wyandotte County: 1.50 / 10,000 pop. Kansas: 1.96 / 10,000 pop. Number of supercenters and club stores: 1 This county: 0.07 / 10,000 pop. State: 0.20 / 10,000 pop. Number of convenience stores (no gas): 12 Wyandotte County: 0.78 / 10,000 pop. Kansas: 0.51 / 10,000 pop. Number of convenience stores (with gas): 50 Wyandotte County: 3.26 / 10,000 pop. State: 3.84 / 10,000 pop. Number of full-service restaurants: 83 Here: 5.40 / 10,000 pop. State: 7.33 / 10,000 pop. Adult diabetes rate: This county:",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}