{
    "relation": [
        [
            "Categories",
            "Campus Safety",
            "Greek Life",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "Campus is safe, but around campus is not. Campus police (an actual OKC police department) are GREAT, however!",
            "GREEK LIFE IS HUGE. Almost everyone belongs to a sorority or fraternity. But don't worry, these Greek kids are a little more down to earth than your typical Greek kids.",
            "The Oklahoma City Memorial is beautiful. There are a lot of fun coffee shops, the state fair, Bricktown, Pops, and many more great places. Sundays are slow, though, as Oklahoma is in the Bible belt. Good luck finding things open on Sundays!",
            "Having dietary restrictions stinks here. They do have a vegan bar during the week at lunch time. As a vegetarian, though, I was often disappointed by the food choices. They would also not cook my food on a separate grill from meat, so until I lived off campus and started cooking my own food, I had terrible digestion problems.",
            "Room checks are AWFUL. I hated being told to make my bed. Also, the housing department is terribly run. I moved off campus as soon as I could. The best place to live on campus is Cokesbury Court. They will try to sell United Methodist to you, but it is not worth it. The pipes have burst multiple times, flooding student's rooms, it is very loud, and poorly built. The honor dorms also stink. You would think the honors students would get the best housing, but they are the worst on campus.",
            "Depending on the class, the classes are challenging, fun, and multifaceted.",
            "If you are a student interested in the performing arts (dance, music, theatre), religion, or nursing, this is a FANTASTIC place to be. You are required to live on campus until you are twenty-one years old. Also, there are weekly room checks, which are basically alcohol checks. They can (and will) fine you for not making your bed.",
            "Oklahoma City University is full of friendly and accepting people. Campus is beautiful, and the area around campus is starting to clean up. There is a lot to do in Oklahoma City, and you'll have a lot of friends to do things with!"
        ]
    ],
    "pageTitle": "Oklahoma City University (OCU) Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Oklahoma-City-University/reviews?_escaped_fragment_=/show/38990",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042991076.30/warc/CC-MAIN-20150728002311-00003-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 898556527,
    "recordOffset": 898527744,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{106124=© 2015, Cappex.com, LLC}",
    "textBeforeTable": "09/08/2009 Reviewer is A current student here. 5 out of 7 people found this review useful. 1 of 27 Julie from Northville, MI Check out reviews left by other students or leave your own review. You could win a free scholarship. Oklahoma City University Reviews Oklahoma City University › Oklahoma › By State › Colleges › } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.create', -->",
    "textAfterTable": "Bang for the buck They help me find scholarships and are a lot cheeper than other schools. *Plus you get one-on-one and don't have to be in a class of over 100 students. Am enjoying being here I love the small classes and the one-on-one with the professors. Am learning a lot The teachers here are really interested in helping me succeed. Most of the things I am re-learning, but who ever said that was a horrible thing? Login to rate or flag the reviews Hillary from Arcadia, OK 01/18/2011 Reviewer is A current student here. 3 out of 3 people found this review useful. 3 of 27 Categories Comments Great for these types of students I would recommend this university to students who want to pursue a liberal arts education or to those who seek to be a professional in the performance and entertainment",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}