{
    "relation": [
        [
            "Categories",
            "Campus Safety",
            "Greek Life",
            "Clubs and Activities",
            "Great for these types of students",
            "Share any unusual traditions or locations on campus",
            "Bang for the buck",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "I've never felt scared to walk on campus alone a night. The pathways are pretty well lit. I've gotten emails alerting me that there was an attack, but nothing too serious.",
            "It seems like campus is full of greeks. If you come from the north you might be shocked at how seriously UK takes the greek system.",
            "There is a great variety of clubs on campus to fit anyone's interests. Some clubs are more successful than others. It's also really easy to start a new club.",
            "UK is great for any type of student. No matter if you're outgoing or shy it's easy to fit in at UK.",
            "I've always heard that you're supposed to rub the foot of Patterson in from of the Patterson Office Tower for good luck on exams. However, I've never actually seen anyone do it.",
            "The price of tuition isn't bad, but the price for housing is ridiculous. It's easy to find an apartment with a 9 or 12 month lease cheaper than two semesters on campus. Not only is it expensive, but UK doesn't offer a lot of scholarship money unless you really stand out.",
            "Campus has a lot to offer from ping pong tournaments to free movies. Almost any night of the week there is a UK sponsored event (which is typically free) where you and a group of friends can go and have a good time. Whether it's free pancakes on Friday nights at CSF or Comedy Caravan on Wednesdays at the Cats Den, there is always something for you to do. Not only is there a lot to do on campus, but there is a lot to do in Lexington. There are plenty of shopping centers, restaurants, parks, etc. to keep you busy all year.",
            "The food at UK is actually pretty decent. My favorite dining hall is Ovid's. There is a great variety and it's cooked on the spot for you. The student center has a nice variety of food for lunch. The only thing I'd do differently is I'd have more places where students can use their meal swipes.",
            "My view on dorm life might be a little biased because I lived in a suite since moving to campus. The suites are really nice and friendly. However, I've also been older dorms where I would probably hate to live. The locations of the dorms aren't in the greatest locations either. Most of campus housing is a 10-15 minute walk from classes. That doesn't seem too bad unless your classes are spread out or you want to meet a friend who lives on the opposite side of campus. You end up spending a lot of time walking to whatever it is you have to do.",
            "Many of the core classes can be seen as easy. Just like any university, UK offers a challenge once reaching upper division courses. Once reaching upper division courses it is expected that you know the material more so than in core classes. Obviously, not everyone is interested in core classes. However, the classes help you become a well-rounded person with knowledge in several different areas.",
            "Live on campus for at least one year. It's the easiest way to meet people and get involved. Plus, you don't have to cook.",
            "The university is full of opportunity no matter which field you go into. There are a lot of knowledgeable professors who really want to see you succeed. Within the first week of coming to UK you'll know you made the right decision."
        ]
    ],
    "pageTitle": "University of Kentucky (UK) Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/University-of-Kentucky/reviews?_escaped_fragment_=/show/81611",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988317.67/warc/CC-MAIN-20150728002308-00315-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 910441699,
    "recordOffset": 910292358,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{792235=I have a great abundance of academic rigor. As of the Fall 2013 semester I have been enrolled with a new beginning. I went from getting kicked out to returning three years later and accomplished a 3.25 GPA for the semester., 356203=This campus is gorgeous, there are safety measures everywhere, and everyone is incredibly helpful. I have yet to see someone who wouldn't point me in the right direction (or give me a completely random high-five when she realized we had the same major). I wish it was August already, and move-in day., 786307=Tour the campus in October - you'll see how big and beautiful the campus truly is before it's a little too chilly. Don't count UK out if you are from Lexington or a surrounding area: it can easily be your new home [somewhat] away from home!, 465115=Apply for scholarships and housing as soon as you can. The sooner you get this done the better chance you have of getting a good dorm or more scholarship money. Also apply for financial aid on Jan. 1., 513366=K Week introductory activities are awesome and a good way to get to know the campus, but don't get used to having fun and partying all the time. By September, you'll have to crack down on studying!, 355569=-Talk to everyone. That's why they're there. Financial aid counselor, admissions counselor, or just call. -Apply early. I had my application in as soon as I could (October) and got the decision letter in November. -GPA is important, so don't slack off, but practice your testing skills for the ACT or SAT. My GPA was 2.98, but I got accepted with an ACT score of 32. -Visit the campus anytime you get the chance. It's beautiful. And bring an umbrella!, 299375=The greek life is great they help with community service events the NPHC holds a Martin Luther King march every year which is fun. Also some of the Greeks in the NPHC have Yard shows, Step shows during homecoming and other fun events., 854033=© 2015, Cappex.com, LLC, 2528=When President Todd accepted the role as University President, he brought with him the Top 20 business plan meaning, thus, that the university will be a in the top 20 by the year 2020. Therefore, the University of Kentucky is making progress to become on of the top 20 schools in the nation. The William T. Young Library, a 58 million dollar complex, has the nation's second largest book endowment second only to Harvard University and is the largest among Public Universities. Also, on a side note the fifth floor was voted the best place on campus to get a date., 348057=Willy T which is the library is always filled during exam week and its almost a social event as well as a study event. Also during March Madness the city of lexington gets out of control and thats something that everyone should experience.}",
    "textBeforeTable": "06/02/2009 Reviewer is Researching this school. Reviewer has been to campus. 49 out of 50 people found this review useful. 2 people found this inaccurate. 1 of 196 Kristin from Clarksville, TN Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({",
    "textAfterTable": "Am learning a lot Even though UK is a pretty big school, they make it more like a small school by keeping many classes with a low student to teacher ratio, so you receive more one on one time with your instructor, which makes it easier to grasp the bigger concepts and master the small ones. Login to rate or flag the reviews Kelsey from Georgetown, KY 12/06/2009 Reviewer is A current student here. 18 out of 18 people found this review useful. 3 of 196 Categories Comments Great for these types of students Anybody! UK is VERY diverse and offers opportunity for any kind of student. Tips for prospective students Definitely live on campus for at LEAST one year. It's awesome! Apply early for housing though... or you wont get your assignment until late summer and you definitely wont get the dorm you want. GET INVOLVED! There are so many opportunities to do this, don't worry. Take advantage of resources like The Study",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}