{
    "relation": [
        [
            "Patent application number",
            "20080226205",
            "20100276559"
        ],
        [
            "Description",
            "Self-Standing Bag - A bag including a resilient support that can stand upright independently and is encased in flexible sheet material. The support is elastically deformed and tensions the sheet material as the support attempts to return to an undeformed condition. The bag can be provided with a cover and handles as well as an arrangement for inhibiting tipping or displacement of the bag.",
            "Support Hanger for Insulation and Other Materials - An article for supporting a material that includes a hanger of rigid material, with the hanger including a first planar portion connected to an offset but parallel second planar portion by a planar shoulder disposed perpendicularly to both the first and second planar portions and further including at least one spike disposed upon a front surface of the first planar portion and at least one notch disposed upon a side surface of the second planer portion. A pair of hangers may be used to form a shelf-like support through connecting the pair of hangers with a wire or filament engaged within a notch, a barb, or both."
        ],
        [
            "Published",
            "09-18-2008",
            "11-04-2010"
        ]
    ],
    "pageTitle": "Francisco J. - Patent applications",
    "title": "",
    "url": "http://www.faqs.org/patents/inventor/francisco-j-7/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042982502.13/warc/CC-MAIN-20150728002302-00136-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 422712667,
    "recordOffset": 422692572,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Francisco J. Sillik, Tucson, AZ US 03-20-2014 APPARATUS FOR GENERATING HYDROXL RADICALS - The invention provides a consumable cartridge for use in a hydroxyl radical generating apparatus, the consumable cartridge comprising: a reactant supply comprising a supply of a substance that reacts with ozone to form hydroxyl radicals; and an ozone supply comprising an ozone generator; wherein the ozone supply is fixed to the reactant supply. By supplying both a reactant supply and an ozone generator in the same consumable cartridge, maintenance operations on an associated base unit in a hydroxyl radical generating system can be minimized. 20140079597 Published Description Patent application number Francisco J. Segura Rius, London GB //]]> BarDraw('4151367',['Patent applications by Francisco J. Roncero Izquierdo, Leganes ES'],[[4,1,2]],['2012','2013','2014'],0); // <script type=\"text/javascript\"> </div> <div id=\"legend4151367\" align=\"center\"></div> </div> <canvas id=\"bg4151367\" style=\"max-width: 500px; width: 100%;\"></canvas> <div> <p align=\"center\">Patent applications by Francisco J. Roncero Izquierdo, Leganes ES</p> <div class=\"bar4151367\" style=\"max-width: 500px; width: 100%; float:left; \"> <div align=\"left\" style=\"padding-top:20px;\"> </table> </tbody> </tr> <td>12-25-2014</td> <td><a href=\"/patents/app/20140376640\">Low Latency Rate Control System and Method</a> - An encoder within a video transmission system controls the bit allocation at a sub-frame level. A frame is divided into smaller blocks, known as rate control blocks. Rate control blocks are used as the basic unit for bit allocation. This bit allocation achieves the target bit rate desired by the system as well as meet latency constraints. The encoder uses the slice partitioning capabilities to generate",
    "textAfterTable": "Patent applications by Francisco J. Sillik, Tucson, AZ US Francisco J. Sosa, Guadalupe MX Patent application number Description Published 20100080881 METHOD FOR THE PRODUCTION OF WHOLE NIXTAMALIZED CORN FLOUR, USING A VACUUM CLASSIFIER COOLER - A process and apparatus for the continuous production of whole nixtamalized corn flour, includes a whole clean corn precooking with a lime solution to effect a partial hydrolysis of pericarp and bran with reduced soluble corn loss in Nejayote wastewater. Moisture content is then stabilized, followed by milling and drying preconditioned corn for further endosperm gelatinization in the whole ground kernel, venting and separating the dry-milled fractions. Adiabatic cooling under a partial vacuum of the vented dry-grind fractions and classifying with an upwardly airstream to strip the fine-grind from the coarse grind while the latter is separated downwardly as a moving bed. Venting and separating the classified fine grind fraction; sifting and recovering the cooled and classified fine grind so segregated from the coarse grind, remilling and further screening the coarse grind produces a whole nixtamalized corn flour for tortilla and whole grain corn-based foods. 04-01-2010 Francisco J. Sotillo, Mulberry, FL US Patent application number Description",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}