{
    "relation": [
        [
            "Japanese",
            "スモモ Sumomo* コモモ Komomo*",
            "サツキ Satsuki",
            "コウメ Koume",
            "サクラ Sakura",
            "タマオ Tamao"
        ],
        [
            "English",
            "Kuni* Sumomo*",
            "Miki* Satsuki*",
            "Naoko* Koume*",
            "Sayo* Sakura*",
            "Zuki* Tamao*"
        ],
        [
            "French",
            "Michiyo* Komomo* Sumomo*",
            "Sayaka* Satsuki*",
            "Eri* Umeko* Koume*",
            "Yumiko* Sakura*",
            "Keiko* Tamao*"
        ],
        [
            "German",
            "Wilma* Komomo* Andrea*",
            "Lore* Satsuki* Christine*",
            "Edith* Umeko* Nicole*",
            "Keiko* Sakura*",
            "Linda* Tamao* Carina*"
        ],
        [
            "Italian",
            "Maki* Sumomo*",
            "Keko* Satsuki*",
            "Yuki* Koume*",
            "Sayo* Sakura*",
            "Kana* Tamao*"
        ],
        [
            "Spanish",
            "Zoe* Komomo* Sumomo*",
            "Kim* Satsuki*",
            "Isa* Umeko* Koume*",
            "Bea* Sakura*",
            "Ico* Tamao*"
        ],
        [
            "Korean",
            "태희 Taehui",
            "난주 Nanju",
            "수정 Sujeong",
            "예솔 Yesol",
            "옥희 Okhui"
        ],
        [
            "Chinese (Mandarin)",
            "桃桃 Táotáo",
            "五月 Wǔyuè",
            "小梅 Xiǎo Méi",
            "櫻花 Yīnghuā",
            "玉緒 Yùxù"
        ]
    ],
    "pageTitle": "Difference between revisions of \"Kimono Girl\" - Bulbapedia, the community-driven Pokémon encyclopedia",
    "title": "",
    "url": "http://bulbapedia.bulbagarden.net/w/index.php?title=Kimono_Girl&diff=prev&oldid=1970126",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 225,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042991076.30/warc/CC-MAIN-20150728002311-00177-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 36936903,
    "recordOffset": 36897651,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Names In the anime, all of the Kimono Sisters except for Sakura have their Eeveelutions in an Apricorn Ball; in the games, these, along with the Safari Ball and the Sport Ball, are the only Poké Balls that an Eeveelution cannot be legitimately caught in. In the anime episode Espeon, Not Included, the four elder sisters' fans match the elemental themes of their Pokémon. Both of the anime episodes which featured all of the Kimono Sisters had Masaaki Iwane as animation director. Bill's mother was once a Kimono Girl, according to Poké Maniac Brent, who reveals trivia about Bill via Pokégear. In HeartGold and SoulSilver versions, when the Kimono Girls are summoning the legendary Pokémon, they dance clockwise for Ho-Oh and counter-clockwise for Lugia. In the French and German localizations of Gold, Silver, and Crystal, the name Keiko was used for different Kimono Girls. For some reason, the Kimono girls were given different but still Japanese names in the English versions. The French localization also followed suit, but were renamed to their original Japanese names in Generation IV with the exception of Koume, who was referred to as Umeko instead. Trivia The Kimono Girls make a small cameo",
    "textAfterTable": "In other languages Language Title Mandarin Chinese 藝妓 Yìjì European French Kimono German Kimono-Girl Italian Kimono Girl Korean 전통무용수 Jeontong Muyongsu European Spanish Chica Kimono",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}