{
    "relation": [
        [
            "Categories",
            "Share any unusual traditions or locations on campus",
            "Bang for the buck",
            "What to do for fun",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "The tend to have a lot of informational drives around campus for different things that are offered to students, such as programs, classes, tutoring. Its to inform students that practically don't know too much about what CSU has to offer.",
            "I am trying to earn and/or receive grants/loans/scholarships to pay for my nursing school. Due to me graduating with an Associates in Business Management and Administration years ago, my financial aid will exhaust prior to me entering a nursing program.",
            "I take care of my 5 beautiful girls (dogs) and try to live life to its fullest when feasible and possible. Trying to enjoy friends and family's company as much as possible.",
            "I am hoping to learn and engage in particular subjects and topics that interest me. Medical and nursing courses are great preps for students entering into the program.",
            "The scenic campus is breathtaking. Most of the professors or structured, organized, and helpful to students needs. The main campus is in proximity to the interstate.",
            "I absolutely love and thoroughly enjoy going to school at CSU. The campus, professors, and proximity are incredible and beneficial. I am hoping to graduate from the Nursing Program from CSU in the future."
        ]
    ],
    "pageTitle": "Clayton State University Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Clayton--State-University/reviews?_escaped_fragment_=/show/36606",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042982502.13/warc/CC-MAIN-20150728002302-00156-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 878576519,
    "recordOffset": 878508544,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{110731=Just starting but my wife already attend and she loves it!!! She say stated that her professor is great. I can't wait to be challenged! I start in the fall of 2012, 359120=© 2015, Cappex.com, LLC, 72805=The dining hall is disgusting, however Pizza Hut, SubConnection, Sandella's, and Jazzman's Cafe is pretty good. The dining hall is under Sodexo, but the food is just not worth the money at all. Especially since the grade dropped to an A to a C in 2011., 1436=Clayton State is a cheaper community college, so it seems cheaper than other schools. For someone trying to save their money though, even between 1000 and 2000 dollars for 2 or 3 classes can be expensive. I am learning a lot though and do not have to travel far to go to school.}",
    "textBeforeTable": "08/29/2009 Reviewer is A current student here. 15 out of 16 people found this review useful. 1 person found this inaccurate. 1 of 87 Kat Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for",
    "textAfterTable": "Alexa from Stockbridge, GA 10/10/2010 Reviewer is A current student here. 10 out of 10 people found this review useful. 2 of 87 Categories Comments Tips for prospective students Time management!! The freedom of college is WONDERFUL! But it can get in the way. Nobody is there to tell you what to do and when to do it. You're completely grown by college. Just stay focus. Don't party too much! But enjoy your college life! Bang for the buck Clayton State is extremely cheap. Aim for the Hope Scholarship as an extra assistance. But you are able to pay for the tuition with or without small scholarships. Am enjoying being here Clayton State was not my first choice, but I do not regret attending the University. It is a very nice, warm, and inviting environment. Everyone is nice and it is always something to do on campus. I absolutely enjoy it here Am learning a lot",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}