{
    "relation": [
        [
            "Part #",
            "BOD000W",
            "BOD0011"
        ],
        [
            "Distributor",
            "Allied Electronics, Inc.",
            "Allied Electronics, Inc."
        ],
        [
            "Manufacturer",
            "BALLUFF INC.",
            "BALLUFF INC."
        ],
        [
            "Product Category",
            "Not Provided",
            "Not Provided"
        ],
        [
            "Description",
            "Sensor, Photoelectric, Distance, Block, Laser, 2m, (2)PNP, 0-10VDC, alarm output",
            "Sensor, Photoelectric, Distance, Block, Laser, 6m, (2)PNP, 4-20mA, alarm output"
        ]
    ],
    "pageTitle": "Laser Sensor Alarm | Products & Suppliers | IHS Engineering360",
    "title": "",
    "url": "http://www.globalspec.com/industrial-directory/laser_sensor_alarm",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042982502.13/warc/CC-MAIN-20150728002302-00136-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 453534043,
    "recordOffset": 453500357,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{108859=Description: FilterTrak Laser Nephelometer offers the best resolution in the market, detects changes in turbidity as low as 0.0005 NTU Meets all USEPA filtering monitoring requirements Compatible with Hach Multi-Sensor, Multi-Parameter Digital Controllers, sensor can be used with Hach's new sc100 or sc1000, 112602=Description: The optoNCDT 1710 laser sensors are unrivalled in measurement performance worldwide. The 1710-50 sensor can measure over a working range of 50 mm. The controller is integrated into the housing of the sensor which means that external electronic processing is not required., 20566=Description: , and alarm on/off control. The Extech 42515 infrared thermometer comes complete with a 9V battery, a Type K thermocouple sensor (-4 to 482°F, -20 to 250°C), and a carrying case. The 42515 is also available packaged with the Extech TP200 Type K Pipe Clamp Temperature Probe. The TP200 has, 98048=Description: Innovative precision infrared temperature sensor marking the actual spot size on your measurement target at any distance. Details Measuring range (°C): -50 to 975 Optical resolution 75:1 Spectral range 8 to 14µm Innovative IR sensor with double laser aiming Smallest spots from 0.9, 121544=Description: The optoNCDT 1700 is laser displacement sensor with multi-functional features. The unique Real-Time Surface Compensation (RTSC) feature enables measurement against a wide range of material surfaces. Its unique compact design makes the optoNCDT 1700 ideal for all industrial applications}",
    "textBeforeTable": "Parts by Number Top",
    "textAfterTable": "Conduct Research Top Photoelectric Smoke Detectors hits the sensor. The sensor then sets off the alarm in the smoke detector. Photoelectric smoke detectors are better at sensing smoky fires, such as from a smoldering mattress. Technologies used include light emitting diodes (LEDs) and lasers ( laser diodes). Spot laser technology is more sensitive than Medical Device Link . for compensating and calibrating a piezoresistive pressure sensor: hardware compensation and software compensation. Hardware compensation physically changes the bridge characteristics of a transducer by means of external laser-trimmed resistors and thermistors. The compensation technique used More Information Top Indicates content that may require registration and/or purchase. Transportation Security, Volume 12: Making Transportation Tunnels Safe and Secure Beam; laser ; sensor ; alarm . New approach to laser image processing for dynamic scenes The false alarms of the laser sensor (clutter) generates",
    "hasKeyColumn": true,
    "keyColumnIndex": 1,
    "headerRowIndex": 0
}