{
    "relation": [
        [
            "Who",
            "Ron West",
            "Ron West",
            "Ron West",
            "Ron West",
            "Ron West",
            "Ron West",
            "Ron West",
            "Ron West",
            "Ron West",
            "Ron West",
            "Ron West",
            "Ron West"
        ],
        [
            "Part",
            "Parts list",
            "Piston list * it is important to note: in most clubs you are limited to 52cc for a watercooled bike. The .5 piston will put you at something like 52.003cc",
            "Carb",
            "Carb Boot",
            "Pipe",
            "Reeds",
            "Clip ons",
            "Race Setup",
            "",
            "Electrical Setup",
            "Front Forks",
            "Rear Shock"
        ],
        [
            "Supplier",
            "Any Honda shop.",
            "Any honda shop",
            "Mikuni 24mm Flatslide",
            "",
            "Tommy Crawford",
            "Carbon Tech",
            "Pro-Flo",
            "",
            "",
            "",
            "",
            "Works"
        ],
        [
            "Comments",
            "This is the most common parts that any NS will need. All of these parts are available at your local honda dealer. Most of these parts are not kept in stock and will take a couple of days to get.",
            "As you can see there are 5 pistons available for the NS. The only problem is that your dealer won't see the .25 or .5 oversized pistons on the microfiche, it's only on the computer. The ring is the same for A,B,C pistons",
            "The same carb that is the standard on the YSR superbikes works well on the NS",
            "There are 2 that fit without any complication: 1. The stock boot for the 24mm can be drilled to fit or a CR80 boot will fit bolt up perfectly. If you use the CR80 boot and the 24mm carb, ensure you are not getting an air leak where the carb meets the boot.",
            "This is a great pipe for the NS. It fits well and makes good power. There are plenty of pipes that can be imported from Japan, but they are quite expensive.",
            "Ask for the reeds from the NSR50 (they are the same)",
            "I thought the stock bars were too high so I ordered a set of 30mm clip ons from pro-flo to put the bars below the top clamp. Keep in mind that the forks are 29mm and there are no bars created this size. We shimmed the clamps 1mm and the bars worked out great.",
            "1. Remove the kickstarter gear and oil pump. btw: the oil pump is a PIA to remove, the bolt holding it in will strip. I went to my local autoparts store and found freeze plugs to fill the holes. Then I used JB Weld around the plugs to ensure they never leak and never come out.",
            "2. Remove the lighting coil (the huge spun coil on the bottom of the stator)",
            "Most important thing to remember: all the green wires need to be grounded. There is a single green wire hidden in the wire harness that comes from the stator that will keep the bike from running if it isn't grounded.",
            "The front forks need the stock fluid transfer ports welded closed, then new smaller ports drilled. This will greatly improve the damping on the front end.",
            "Works makes a shock for this bike, it's just listed as the wrong year. Don't let them tell you they don't have a spring for this shock, they do. You just have to find the one guy there knows about it. Also, the rubber cone bumper that comes installed on the shock is between 1/4\" and 1/2\" too long. Trim the fat side of it for more travel on the shock without bottoming out."
        ]
    ],
    "pageTitle": "Tech Questions asked 1000 times",
    "title": "",
    "url": "http://webpages.charter.net/jpcycles/ysrracing/faq.htm",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042991076.30/warc/CC-MAIN-20150728002311-00054-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 262913727,
    "recordOffset": 262884603,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{95503=I want to point out that Calamari has done a great job describing how they setup their NS on their web site. This link will take you right there. My information is based on a conversion of a NS50F (1990 US model) into a race bike. , 90083=All purchased from Taffspeed in the UK. Contact information for them is: Terry Frankland,Taffspeed Racing Email: sales@taffspeed.co.uk Link: Prices - Aprilia RS50 Motorcycle Tel: 01633 840450  (Int. 0044 1633 840450) Fax: 01633 246175  (Int. 0044 1633 246175), 163=Last Updated: 4/16/2001, 89227=A special thanks goes to Sandra Whitney for this information. She is currently racing a Yellow 2000 model RS50 in the Golden State Mini Road Racing Association.}",
    "lastModified": "Sun, 08 Jan 2006 02:00:27 GMT",
    "textBeforeTable": "Fork Braces: What are they and why do you care? Rumor: There is another bike out there in the ether that has the same fork tube dimensions as a YSR, but has adjustments for damping and rebound.  I am not sure of what bike this is, but if you find it, please let me know. Ron West Fox Shock: Out of the box, better than a stock YSR shock, however its still just a spring, damping is nearly nonexistent. Notice if you turn the clicker for compression damping it makes virtually no difference? If you can order a shock straight from Fox Factory, be sure to tell them you want about 10 times more damping than their regular run of shocks! Otherwise send it off to a Race-Tech or other good suspension guru.  The Fox Shock also has about 1/2\" more overall length than the stock shock. This means more rear ride height which quickens the steering and helps the front wheel feel more \"planted\".. Works Shock: Used one only once, but have friends who used them a lot. It's even worse than the Fox, and has no adjustment for damping OR preload. They want your old shock when you order a Works, because they want to use the spring off of it! (This is why they are so much cheaper than Fox). Maybe someone needs to tell them that there is a",
    "textAfterTable": "Ron West Any almost any track, anywhere start with 12x46.  The ratio is the 2nd number divided by the 1st.  So a 12x46 is a 3.8 ratio. check out the chart below for a quick guide to the ratios. Rose at calamari recommends staying away from the 11 front. The reason being is that this sprocket tends to damage the chain quickly due to the number of revolutions. Notice that an 11x44 is the same ratio as a 12x48.  Gearing by Track: Who Track  Rider Level Bike Type Front Rear Ron West Pat's Acres (Canby, OR) Novice YSR/ Stock 50 12 48 Ron West Pat's Acres Novice YSR/ Mod 50 12 46 or 47 Ron West Pat's Acres Expert YSR/ Mod 50 12 46 Ron West Pat's Acres Expert NS 50",
    "hasKeyColumn": true,
    "keyColumnIndex": 1,
    "headerRowIndex": 0
}