{
    "relation": [
        [
            "Payment method",
            "",
            "Cash on pickup"
        ],
        [
            "Preferred/Accepted",
            "Accepted",
            "Accepted"
        ],
        [
            "",
            "",
            ""
        ]
    ],
    "pageTitle": "Food Network Atlantic City Festival Recipe Cards More | eBay",
    "title": "",
    "url": "http://www.ebay.com.au/itm/Food-Network-Atlantic-City-Festival-Recipe-Cards-More-/360362758440?pt=LH_DefaultDomain_0&hash=item53e74b5128",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042991076.30/warc/CC-MAIN-20150728002311-00101-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 412984059,
    "recordOffset": 412939323,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{58529=This package was distributed to attendees of the above mentioned festival which was in Atlantic City July 29 - August 1. Package is a nice flip top box containing 5 heavy cardboard coaster featuring Paula Dean, Pat & Gina Neely, Guy Fieri, Sandra Lee, & Ted Allen. It also contains 10 recipe cards featuring Paula Dean, Pat & Gina Neely, Guy Fieri, Sandra Lee, Melissa D'Arabian, Anne Burrell, Alex Guarnaschelli, Claire Robinson, Sunny Anderson & Ted Allen. This package is in brand new, never used condition and a great one of a kind addition to your collection. Box measures 4 1/2\" X 6\" X 1 1/2\".}",
    "textBeforeTable": "Payment details returns - opens in a new window or tab. Refunds by law: In Australia, consumers have a legal right to obtain a refund from a business for goods purchased if the goods are faulty, not fit for purpose or don't match description. More information at The buyer is responsible for return postage costs. Money Back 14 days after the buyer receives it Refund will be given as Item must be returned within Return policy cleared payment- opens in a new window or tabEstimated delivery dates- opens in a new window or tab . Delivery times may vary, especially during peak periods. include",
    "textAfterTable": "Current bid amount + + import charges (shown at checkout) time left ##2## left | Bid Count Current Max Bid:",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}