{
    "relation": [
        [
            "Payment method",
            "",
            "Bank Deposit"
        ],
        [
            "Preferred/Accepted",
            "Accepted",
            "Accepted"
        ],
        [
            "",
            "",
            ""
        ]
    ],
    "pageTitle": "SET OF 50 Rack Screws Washers Cage Nuts Pack Suit 19\" Mounting Road Case | eBay",
    "title": "",
    "url": "http://www.ebay.com.au/itm/SET-50-Rack-Screws-Washers-Cage-Nuts-Pack-suit-19-Mounting-Road-Case-/390365830261?pt=AU_Pro_Audio&hash=item5ae39ddc75",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042982502.13/warc/CC-MAIN-20150728002302-00258-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 420324639,
    "recordOffset": 420279846,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Payment details returns - opens in a new window or tab. Refunds by law: In Australia, consumers have a legal right to obtain a refund from a business for goods purchased if the goods are faulty, not fit for purpose or don't match description. More information at A 25% restocking fee will apply for all returns. Purchased products must be returned in original condition, with original packaging and not used Return policy details The buyer is responsible for return postage costs. Exchange 3 days after the buyer receives it Refund will be given as Item must be returned within Return policy",
    "textAfterTable": "Seller's payment instructions Hi, thanks for choosing Alternative Imports as your supplier. Please find our shipping calculator at the bottom of the auction description. If you have purchased multiple items, please wait for us to reply combined shipping total before making payment. All items are tested before being dispatched, but we do recommend you accept the option of travel insurance just in case your it gets damaged, lost or arrives dead on arrival. Thanks again and we hope you enjoy your purchase. Current bid amount + + import charges (shown at checkout) time left ##2## left | Bid Count",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}