{
    "relation": [
        [
            "CP Notice/Letter",
            "CP 01, Identity Theft Claim Acknowledgement",
            "CP 01A, We Have Assigned You an Identity Protection Personal Identification Number",
            "CP 01H, Identity Theft Lock",
            "CP 01S, CP 701 (Spanish), We received your Form 14039 or similar statement for your identity theft claim",
            "Letter 4281C, IM Breach Notification",
            "Letter 4310C, IRS Identified ID Theft Post Adjustment Letter",
            "Letter 4401C, Phishing E-mail Victim Notification",
            "Letter 4445C, ID Theft Acknowledgement Notification",
            "Letter 4455C, UPC 147 – Taxpayer Inquiry Letter",
            "Letter 4456C, UPC 147 – Temporary Number Assignment Letter",
            "Letter 4457C, UPC 147 – ID theft Attempt",
            "Letter 4674C, Identity theft Post Adjustment Victim Notification",
            "Letter 4675C, Identity Theft, Temporary Number Assignment",
            "Letter 4869C, Identity Protection Personal Identification Number",
            "Letter 5073C, Acknowledgment Letter for Identity Theft Documentation (Form 14039 or Police Report and Federal or State Identification)"
        ],
        [
            "Description",
            "Used to acknowledge receipt of documentation substantiating a claim of identity theft and to notify taxpayers of the action taken by the Service with regard to their tax records. This notice is issued systemically after the TC 971 AC 501 is input on the taxpayer’s account. If the taxpayer calls stating they never received this notice, research CC ENMOD to confirm the notice was issued. If the notice was issued a Letter 4445C, ID Theft Acknowledgement Notification can be sent.",
            "Systemically issued and cannot be re-issued if not received by the taxpayer.",
            "Used to notify the filer the tax return filed was not processed. A TC 971 AC 524 will be placed on deceased taxpayers' accounts. This indicator will lock an account and not allow a tax return to post. If a paper tax return attempts to post to a locked account, the CP 01H will be issued if the return is not the return preceding the DOD. If an electronically filed tax return attempts to post, an Indicator (IND) 901 for a primary TIN or IND 941 for a secondary TIN will be issued to the submitter/preparer if the return is not the return preceding the DOD. The identity theft toll-free number will be included on these notices. Note: No action should be taken by an IPSU CSR to revise/correct the DOD on these accounts.",
            "Issued by SP to acknowledge receipt of identity theft documentation",
            "Issued by the Incident Management (IM) office. The letter notifies individuals potentially impacted by an IRS data loss if the evaluation of an IDRS data loss incident results in high risk of harm to these individuals.",
            "Issued by the Integrity & Verification Operation (IVO) and Compliance. A TC 971 AC 506 input by IVO or Compliance will be associated with these cases. The letters contain the ID theft toll free number. The IPSU CSRs respond to phone inquiries only. Written responses to the 4310C letters are routed to IVO for response.",
            "Use to notify taxpayers of potential identity theft as a result of having visited and entered personal information on an internet website or through an e-mail address that fraudulently claimed to be authorized by the IRS. Potential victims are identified by the Online Fraud Detection and Prevention (OFDP) Office.",
            "Issued manually when a TC 971 AC 501 was previously input on a taxpayer’s account and the taxpayer has contacted the service claiming they did not receive the systemically issued CP 01. See row above for CP 01.",
            "Issued by SP Specialized Identity Theft (SPIDT) unit Team when a determination on unpostable cases cannot be made.",
            "Issued by SPIDT unit to unauthorized filers as closing notifications.",
            "Issued by SPIDT unit to authorized filers notifying them they may be a victim of identify theft. Identity theft guidance is provided in the content of the letter; however, taxpayers may call with additional questions and/or for guidance.",
            "Issued by AM to authorized filers notifying them they may be a victim of identity theft. Identity theft guidance is provided in the content of the letter, however, taxpayers may call with additional questions and/or for guidance.",
            "Issued by AM to notify a non-owner of an SSN of an IRSN assigned to them and stop using the SSN they used originally.",
            "Manually issued by PGLD when an IP PIN is issued.",
            "Issued by AM and SP to acknowledge receipt of identity theft documentation."
        ],
        [
            "IRM Citation(s)",
            "IRM 10.5.3.2.9, Closing Taxpayer Initiated Identity Theft Affecting Tax Administration - TC 971 AC 501, Documentation Provided",
            "IRM 10.5.3.2.15,Identity Protection Personal Identification Number (IP PIN) IRM 10.5.3.2.15.1,Lost, Misplaced or Non-Receipt of IP PIN Exhibit 21.1.7-16, Computer Paragraph (CP) Notices - Routing Guide Exhibit 3.10.72-3, Computer Paragraph (CP) Notices – Routing Guide",
            "IRM 10.5.3.2.13,Locking SSNs Decedent Accounts - TC 971 AC 524 IRM 10.5.3.2.14, Manually Reversing TC 971 AC 524",
            "IRM 10.5.3.2.6,Overview - Identity Theft Supporting Documentation",
            "IRM 10.5.4.4.5.1,Handling Taxpayer inquiries Regarding Data Loss Letters IRM 21.9.2.7, Data Loss Notifications – Personally Identifiable information (PII)",
            "Various sections throughout IRM 25.25, Revenue Protection IRM 4.19.24.1.4.1, Notification to ID Theft Victim When Post Function Adjustments Have Been Completed Exhibit 3.10.72-2, Correspondex \"C\" Letters - Routing Guide Exhibit 21.1.7-15, Correspondex \"C\" Letters - Routing Guide",
            "See IRM 21.9.2.4.1 Self Identified - Tax-Related Identity Theft - IDT2",
            "IRM 10.5.3.2.9,Closing Taxpayer Initiated Identity Theft Affecting Tax Administration - TC 971 AC 501, Documentation Provided",
            "IRM 3.28.4.5.6, 4455C letter for Additional Information",
            "IRM 3.28.4.5.8, Correspondence after Issuing an IRSN",
            "IRM 3.28.4.5.8, Correspondence after Issuing an IRSN For ID theft guidance: IRM 21.9.2.3, Identity Theft – Telephone Overview",
            "Various sections throughout IRM 21.6.2, Adjusting TIN Related Problems",
            "Various sections throughout IRM 21.6.2, Adjusting TIN Related Problems",
            "IRM 10.5.3.2.15,Identity Protection Personal Identification Number (IP PIN)",
            "IRM 10.5.3.2.6,Overview - Identity Theft Supporting Documentation Various locations throughout IRM 21.9.2, Individual Master File (IMF) Accounts Management Identity Theft"
        ]
    ],
    "pageTitle": "Internal Revenue Manual - 21.9.2 Individual Master File (IMF)Accounts Management Identity Theft",
    "title": "",
    "url": "http://www.irs.gov/irm/part21/irm_21-009-002r.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042982502.13/warc/CC-MAIN-20150728002302-00107-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 512200671,
    "recordOffset": 512140326,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{167164=IRM 10.5.3.2.13,Locking SSNs Decedent Accounts - TC 971 AC 524, 8802=(40) IPU 14U0812 issued 05-06-2014 IRM 21.9.2.4.3(7) - Clarified paragraph with specific steps for converting a form to an adobe file and attaching to a secure e-mail., 288214=Sites not specialized in Identity Theft receiving a Form 14103 will perform the IRM required preliminary research per IRM 21.6.2.4.2.3, Preliminary Research, Paragraphs 1 - 16; when appropriate, reassign to the Andover IDRS# 0830141335 using Category Code IDT9/IDS9., 44427=A TC 971 AC 522 with one of the following Tax Administration Source Codes will be present when the taxpayer provides complete and legible documentation supporting identity theft for a specific tax year. See IRM 10.5.3.2.6, Overview - Identity Theft Supporting Documentation., 4133=(6) IPU 14U0107 issued 01-13-2014 IRM 21.9.2.1(10) Clarified the definition for TC 971 AC 504 and what function uses this code., 10455=(53) IPU 14U0257 issued 02-03-2014 IRM 21.9.2.6.2(2) Inserted Exception when creating an IDT1/IDS1., 231243=The Modernized Employer Identification Number (MOD EIN) system was activated on the IRS website on July 23, 2007. It is an automated system that allows taxpayers to sign up on-line to receive an EIN in a short amount of time. After discovering problems with the system, the IRS immediately disabled the application and carefully reviewed the system. The IRS was not able to tell exactly who was affected by this incident, so the IRS notified all the individuals who logged in on July 23, 2007 of the potential risk. Letter 4281C, IM Breach Notification Letter, was sent to all individuals possibly impacted under the MOD EIN incident. Any questions relating specifically to the issue of the status of the EIN will be referred to the unit in the IRS responsible for the issuance of the EIN., 211413=The Privacy and Information Protection (PIP) toll-free number 866–225–2009 is included in the Letter 4281C, IM Breach Notification Letter. Individuals who call the PIP toll-free number are auto directed to the Identity Theft product line., 6585=(23) IPU 14U0107 issued 01-13-2014 IRM 21.9.2.4(2) Inserted a bullet list of recommended IRM citations to use for additional guidance., 55005=Taxpayer Advocate Service (TAS) Guidelines, IRM 21.1.3.18, 7875=(33) IPU 14U0107 issued 01-13-2014 IRM 21.9.2.4.2, Revised the title and guidance in this section. Self Identified - Non-Tax-Related Identity Theft – IDT4, 10026=(50) IPU 14U0812 issued 05-06-2014 IRM 21.9.2.5(5) - Inserted a new row in the If/Then chart for cases with \"previous action.\", 167416=IRM 10.5.3.2.14, Manually Reversing TC 971 AC 524, 9487=(45) IPU 14U0107 issued 01-13-2014 IRM 21.9.2.5(2) Revised explanation for CP01F and inserted a row for CP01S., 35221=In FY 2014, the TC 971 AC 504 was expanded for use on both tax and non-tax-related identity theft allegations., 4368=(8) IPU 14U0812 issued 05-06-2014 IRM 21.9.2.3(3) - Clarified paragraph., 40396=A toll-free number 800–908–4490, established specifically to receive identity theft related calls, provides taxpayer access to automated messages and assistors. The hours of operation are 7:00 a.m. to 7:00 p.m. (taxpayer's local time). Taxpayers calling from Alaska and Hawaii need to follow the Pacific time. Guidance will be provided to individuals identifying themselves as potential victims of identity theft, including actions to take when there is currently no tax-related impact or tax-related ID theft. See IRM 21.9.2.2.1, Identity Theft Time Frame, IRM 21.9.2.3.1, Self Identified - Non-Tax-Related Identity Theft, and IRM 21.9.2.3.2, Tax-Related Identity Theft., 12353=(69) IPU 14U0454 issued 03-07-2014 IRM 21.9.2.9.1(3) Updated IRM citation in 3rd bullet; editorial change., 8575=(38) IPU 14U0454 issued 03-07-2014 IRM 21.9.2.4.3(5) Revised guidance in bullet list in If/Then chart; editorial change., 9735=(47) IPU 14U0454 issued 03-07-2014 IRM 21.9.2.5(2) Updated IRM citation for 4401C letter; editorial change., 28865=Effective July 1, 2009 a CP 01, Identity Theft Claim Acknowledgement, are acknowledgement notifications of ID theft will be systemically generated in 2 to 12 cycles after input of the Transaction Code (TC) 971 Action Code (AC) 501., 5184=(13) IPU 14U0257 issued 02-03-2014 IRM 21.9.2.3.2(1)(c) Clarified paragraph and inserted a caution referencing IRM 21.1.3.19, Informant Referral., 98828=If at any time there is an open ATAO or ITAR, then update activity on IDRS to \"CLTOTAS,\" leave a case note on AMS/CIS listing the TAS office and address and close the IDT2 CIS case. If identity theft documentation was received with the IDT2 case and there is no TC 971 AC 522 or other identity theft indicators, input the TC 971 AC 522 with the appropriate identity theft tracking indicator prior to closing IDRS and CIS case., 8182=(35) IPU 14U0454 issued 03-07-2014 IRM 21.9.2.4.2(3) Revised bullet list in If/Then chart; editorial change., 170639=Exhibit 21.1.7-15, Correspondex \"C\" Letters - Routing Guide, 165383=IRM 10.5.3.2.15.1,Lost, Misplaced or Non-Receipt of IP PIN, 7346=(28) IPU 14U0257 issued 02-03-2014 IRM 21.9.2.4.1(5) Clarified the If/Then chart., 190152=If multiple TC 971 AC 501s or TC 971 AC 506s are identified, go to the earliest tax period identified on the SCNDRY-DT field and begin the Global Review., 11486=(62) IPU 13U1570 issued 10-25-2013 IRM 21.9.2.9(1) Example for Criteria 7 was clarified., 8078=(34) IPU 13U1526 issued 10-18-2013 IRM 21.9.2.4.2(2) Removed Exception from If/Then chart., 6389=(22) IPU 14U0107 issued 01-13-2014 IRM 21.9.2.4 Revised the title of this section to Identity Theft Paper Overview (Andover and Fresno IPSU only)., 277447=Reassign the IDT9/IDS9 to the CDS# 0803141335., 125738=If there is a multiple control (IDTX) on IDRS with an ITAR, then update activity on IDRS to \"CLTOITAR\" . Communicate with the other IPSU CSR using CIS; ensure the appropriate TC 971 AC 522 is on the monitored account prior to closing the IDTX control., 4454=(9) IPU 14U0812 issued 05-06-2014 IRM 21.9.2.3(5) - Inserted new paragraph providing IRM references for additional guidance as it relates to Non-Tax-Related Identity Theft, IRM 21.9.2.3.1 and Tax-Related Identity Theft, IRM 21.9.2.3.2., 4934=(11) IPU 14U0107 issued 01-13-2014 IRM 21.9.2.3.1(1) Inserted an example to further clarify the guidance. Inserted a sub-paragraph., 209995=Accounts related to data loss Incidents will be marked with a TC 971 AC 505. This TC will be input on the entity section of accounts when Letter 4281C, IM Breach Notification Letter, has been issued by the Incident Management (IM) Office., 196477=If TC 922 with process code (PC) 23, 39, 69 or 89 and the presence of a TC 971 AC 501-AUR-INCOME, then a global review referral for this module will not be necessary. (These codes indicate full or partial AUR case resolution due to ID theft)., 3757=(3) IPU 14U0379 issued 02-26-2014 IRM 21.9.2.1(1) Inserted IRM citations., 11189=(59) IPU 14U0107 issued 01-13-2014 IRM 21.9.2.8.1(1) Inserted Caution related to a TC 971 AC 504 SPCL1., 290572=Sites not specialized in Identity Theft will return the Form 14103 to IPSU after completing the preliminary research in IRM 21.6.2.4.2.3, Preliminary Research, and reassigning the IDT9/IDS9 case to the Andover IDRS# 0830141335., 8709=(39) IPU 14U0812 issued 05-06-2014 IRM 21.9.2.4.3(5) - Clarified If/Then chart., 200817=Reassign the IDT1/IDS1 Spanish case to the CDS# 0830141335., 63481=Individuals not required to file a return may also be negatively impacted by non-tax related identity theft. For example, a caller may state the Social Security Administration (SSA) has reduced or stopped his/her Social Security benefits based on income being reported as earned under the owner's TIN. After contacting SSA to correct his/her earnings record, the caller contacts the IRS about his/her tax account. The caller indicates that he/she has not filed a tax return or is not required to file a tax return. After further research, it is determined there have been no tax returns filed under the TIN, and there is no indication the IRS is looking for a tax return (no Taxpayer Delinquency Investigation (TDI) or Substitute for Return (SFR) indicators). This is considered a non-tax related issue. If the taxpayer states they are experiencing an economic hardship because of this event; refer to IRM 21.1.3.18, Taxpayer Advocate Service Guidelines., 78625=Taxpayer called the identity theft toll-free number inquiring about identity theft and raised suspicions of being a victim based on an Audit notice for 201012. The IPSU CSR identified a duplicate filing condition (DUPF) in 201112 in AM and an open TC 420 in 201012. Because of the open duplicate control and the open audit, this identity theft case has met the MFC and requires resolution of the issue with more than one function. (Accounts Management and Exam/Compliance). IPSU would monitor this case., 188556=Functions will be receiving a Form 14027–B related to this global review. IRM 10.5.3.2.10.1.2, The Identity Protection Specialized Unit (IPSU) and Referrals to Other Functions on Form 14027-B, provides guidance and procedures on the function's responsibility when a referral from IPSU is received., 7138=(27) IPU 13U1526 issued 10-18-2013 IRM 21.9.2.4.1(4) Inserted a caution regarding the importance of sending an unprocessed tax return scanned into CIS to processing as soon as it is identified., 8984=(41) IPU 14U0812 issued 05-06-2014 IRM 21.9.2.4.3(8) - Corrected required Activity Code for Compliance., 234528=The IAT Disclosure tool will confirm the presence of an identity theft indicator in the alert box (to the right of the Entity Section). The account will be marked if the authentication failed. See IRM 21.2.1.40.2, Taxpayer Fails High Risk Disclosure during AGI Request., 116636=Input TC 971 AC 504 on the taxpayer's account., 5379=(14) IPU 14U0379 issued 02-26-2014 IRM 21.9.2.3.2(1)(c) deleted. Subsequent sub-paragraphs re-numbered., 85285=If the new issue is also identity theft, then input a TC 971 AC 522 if applicable per 10.5.3.2.5, Initial Allegation or Suspicion of Tax-Related Identity Theft - Identity Theft Indicators., 95154=When research results in a determination of non-tax related identity theft (as with the example of issues below), update the Category Code to IDT4 and see IRM 21.9.2.4.2 to mark the taxpayer's account with a TC 971 AC 504, as applicable., 3996=(5) IPU 14U0107 issued 01-13-2014 IRM 21.9.2.1(8) Inserted a new row in the Category Code chart listing category code IDT2., 236961=If a TC 971 AC 504 EAFAIL is identified during research, see IRM 21.2.1.40.2, Taxpayer Fails High Risk Disclosure during AGI Request., 77289=Input a TC 971 AC 522 if applicable per IRM 10.5.3.2.5, Initial Allegation or Suspicion of Tax-Related identity Theft - Identity Theft Indicators., 233619=High risk will not be needed IF it was completed prior to the transfer per IRM 21.2.1.40, E-file 1040 Series Online Filing. IF High Risk was NOT completed, you are REQUIRED to complete it., 131247=If the taxpayer’s inquiry requires a response from the IRS, but does not involve a tax related identify theft issue, convert the IDTX to an IDT4 on the specific tax period (ex: 2012, 201112, etc.). See IRM 21.9.2.4.1, Self Identified - Tax-Related Identity Theft - IDT2., 119555=If at any time there is an open ATAO or ITAR, then update activity on IDRS to \"CLTOTAS,\" leave a case note on AMS/CIS listing the TAS office and address (when applicable) and close the IDT4 CIS case. If identity theft documentation was received with the IDT4 case and there is no TC 971 AC 522 or other identity theft indicators, input the TC 971 AC 522 with the appropriate identity theft tracking indicator prior to closing IDRS and CIS case., 101455=Review the account for a TC 971 AC 522, Identity theft Tracking Indicator. Input when applicable. Refer to IRM 10.5.3.2.5, Initial Allegation or Suspicion of Tax Related Identity theft - Identity theft Indicators, and Exhibit 10.5.3–12, TC 971 AC 522 Tax-related Identity theft, Case Status (Initial Claim/Suspicion and Supporting Documents), for requirements and input procedures., 65410=If the taxpayer used the 800–829–1040 line versus the Identity Theft toll free number, 800–908–4490, to report non-tax-related identity theft, advise the caller to use the identity theft toll free number for subsequent calls regarding non-tax-related identity theft., 10568=(54) IPU 14U0562 issued 03-26-2014 IRM 21.9.2.7.2(4) Clarified paragraph. If the Incident date and number are available, request it as part of authentication process., 5626=(16) IPU 14U0812 issued 05-06-2014 IRM 21.9.2.3.2(2)(a) - Corrected IRM citation to IRM 21.9.2.1, Identity Theft - General Information., 165118=IRM 10.5.3.2.15,Identity Protection Personal Identification Number (IP PIN), 125143=If there is a multiple control (IDTX) on IDRS with TAS (ATAO) then update activity on IDRS to \"CLTOTAS,\" leave a case note on AMS/CIS listing the TAS office and address and close the IDTX CIS case. If identity theft documentation was received with the IDTX case and there is no TC 971 AC 522 or other identity theft indicators, input the TC 971 AC 522 with the appropriate identity theft tracking indicator prior to closing IDRS and CIS case., 73549=Input a TC 971 AC 522 per IRM 10.5.3.2.5, Initial Allegation or Suspicion of Tax-Related identity Theft - Identity Theft Indicators, and Exhibit 10.5.3-12, IMF Only TC 971 AC 522 Tax-Related Identity Theft, Case Status (Initial Claim/Suspicion and Supporting Documents)., 63002=Individuals experiencing non-tax-related impact may call and request that IRS take action to protect their tax account information. Callers should be advised to take the following actions. For a clear definition of taxpayer identity theft not affecting tax administration (Non-Tax-Related Identity Theft), refer to IRM 10.5.3.2.18, IMF TC 971 AC 504., 4275=(7) IPU 14U0257 issued 02-03-2014 IRM 21.9.2.1(10) Deleted reference to AC 525., 9611=(46) IPU 14U0257 issued 02-03-2014 IRM 21.9.2.5(2) Deleted reference for CP01F due to postponement of program., 6940=(26) IPU 14U0107 issued 01-13-2014 IRM 21.9.2.4.1 Revised the title and guidance in this section. Self Identified - Tax-Related Identity Theft - IDT2, 5850=(17) IPU 14U0812 issued 05-06-2014 IRM 21.9.2.3.2(4) - Clarified guidance related to input of a TC 971 AC 522., 259081=If the taxpayer is experiencing an economic hardship, forward to TAS on an e-911 immediately. See IRM 21.1.3.18, 189718=Access Command Code (CC) ENMOD(IMFOLE) and locate the TC 971 AC 501/AC 506. Use the \"SCNDRY-DT\" to determine the earliest year of impact. If the SCNDRY-DT shows 12312005, you would review TXPD 200512 and subsequent modules within the definition of the global review., 11075=(58) IPU 14U0107 issued 01-13-2014 IRM 21.9.2.8(2)(b) Updated Note related to failed authentication., 102547=Provide a narrative on the Form 14027–B explaining the taxpayer responded directly to AM IPSU and provide IRM 10.5.3.2.10, IMF Identity Theft Worked by Certain Functions, as a reference., 94288=Enter CIS Case Note, \"No ID Theft.\" Input TC 972 AC 522 with Tax Administration Source Code \"NOIDT\", and the tax year associated with the alleged identity theft incident, if appropriate. Refer to IRM 10.5.3.2.7, Reversing Pending Identity Theft Claims - TC 972 AC 522 NORPLY or NOIDT, for additional information., 40016=In compliance with the IRS Commissioner’s testimony before Congress on April 10, 2008, Accounts Management (AM) adopted a proactive stance against identity theft. As a result, AM established Identity Protection Specialized Units (IPSU) to assist taxpayers that are, or may become, victims of identity theft. IPSU is comprised of paper and phone teams., 135342=Review the account for a TC 971 AC 522. Input a TC 971 AC 522 as applicable per IRM 10.5.3.2.5, Initial Allegation or Suspicion of Tax-Related Identity Theft - Identity Theft Indicators., 2816=August 28, 2014, 9856=(48) IRM 21.9.2.5(2) Corrected explanation for TC 971 AC 524., 10819=(56) IPU 14U0562 issued 03-26-2014 IRM 21.9.2.7.5(5) Clarified paragraph. If the incident date and number are available, request it and include on the Form 4442., 11306=(60) IPU 14U0454 issued 03-07-2014 IRM 21.9.2.8.1(1) Updated the IRM citation in this paragraph; editorial change., 187020=Definition: A global review is a review of an identity theft marked tax account (TC 971 AC 501/506) from the date of the impact and subsequent for modules potentially impacted by identity theft. This includes:, 184608=If identity theft documentation was received with the IDT5 case and there is no TC 971 AC 522 or other identity theft indicators, input the TC 971 AC 522 with the appropriate Identity Theft Tracking Indicator prior to closing IDRS and CIS case. See IRM 10.5.3.2.5, Initial Allegation or Suspicion of Tax-Related identity Theft - Identity Theft Indicators., 133237=Review the account for a TC 971 AC 522. Input a TC 971 AC 522 when applicable per IRM 10.5.3.2.5, Initial Allegation or Suspicion of Tax-Related identity Theft - Identity Theft Indicators., 165512=Exhibit 21.1.7-16, Computer Paragraph (CP) Notices - Routing Guide, 42724=Integrated Automation Technologies (IAT) Tools are mandatory when applicable. See IRM 21.2.2.4.4.14, Integrated Automation Technologies, and Exhibit 21.2.2-2, ACCOUNTS MANAGEMENT MANDATED IAT TOOLS, for a list of the mandated tools., 186589=As a follow-up to IRM 21.1.1.1, Overview, and in a manner to make the taxpayer \"whole\" , a global review of taxpayer's accounts in relation to identity theft is required to ensure subsequent tax periods are not affected by the identity theft incident. This review will be on tax account where TC 971 AC 501 was input and on some accounts with TC 971 AC 506., 12473=(70) IPU 13U1526 issued 10-18-2013 IRM 21.9.2.9.1(4) Inserted a new bullet instructing AM IPSU management to convert the relevant open control to IDT9/IDS9. See IPU 13U1489 dated 9/20/2013., 112602=Reassign to IDRS# 0830141335 for the Centralized Distribution Site (CDS)., 35846=AM per IRM 21.2.1.40.2, Taxpayer Fails High Risk Disclosure during AGI Request., 243731=If the taxpayer requests TAS assistance or is facing economic burden (TAS criteria 1-4), or meets one of the exceptions listed below, then refer the case to TAS using IRM 21.1.3.18, Taxpayer Advocate Service (TAS) Guidelines., 97155=Interest - IRM 21.5.2.4.10,Interest Explanation, 170327=IRM 4.19.24.1.4.1, Notification to ID Theft Victim When Post Function Adjustments Have Been Completed, 137131=Review the account for a TC 971 AC 522. Input a TC 971 AC 522 as applicable per IRM 10.5.3.2.5, Initial Allegation or Suspicion of Tax-Related identity Theft - Identity Theft Indicators., 83766=If yes, prepare a Request for Specific Employee Form 4442 per IRM 21.1.3.15, Request for Specific Employee; a brief narrative of the taxpayer's questions and concerns MUST be completed in Section B. Refer to IRM 21.3.5.4, Referral Procedures, for referral time frames to provide to the taxpayer. Enter AMS narrative., 6734=(24) IPU 14U0379 issued 02-26-2014 IRM 21.9.2.4(3) Corrected IRM citation in 3rd exception., 138300=Reassign the IDT1/IDS1 to IDRS# 0830141335 for the Centralized Distribution Site (CDS)., 73919=Record history of the taxpayer contact on AMS. Enter AMS narrative, \"IDT Tax Related - TC 971 AC 522 input with XXXX\" . XXXX = MISC code as it relates to TC 971 AC 522 tracking indicator when applicable., 99517=For all tax related identity theft cases, if a tax refund was issued through an electronic deposit (per IDRS TC 846) and the taxpayer is claiming to be a victim of identity theft, claiming they did not receive the tax refund and a subsequent tax return has posted to the account (per IDRS TC 976), then input a TC 971 AC 850 per IRM 21.4.1.4.7, Direct Deposits - General Information., 11868=(65) IPU 14U0107 issued 01-13-2014 IRM 21.9.2.9(5) Updated IDRS#., 133753=If there is no open control, Enter Case Note: \"IDTX converted - IDT documentation acknowledged\" on the IDTX case and in the secure e-mail when applicable and reassign the IDT1/IDS1 to IDRS # 0830141335 for the Centralized Distribution Site (CDS) and then convert the IDTX to an IDT1/IDS1., 9931=(49) IPU 14U0107 issued 01-13-2014 IRM 21.9.2.5(4) and (5) Revised IRM citations., 3844=(4) IPU 14U0107 issued 01-13-2014 IRM 21.9.2.1(4) Inserted a new paragraph with a table listing priority order for IPSU related controls., 113461=Manually open a new IDRS control using CC ACTON to a generic control using IDRS# 1487711111., 12103=(68) IRM 21.9.2.9.1 Re-wrote section resulting in new title; Overview of ITAR for IPSU CSRs only. IPU 14U0107 issued 01-13-2014 IRM 21.9.2.9.1(3) deleted note in bullet list and revised IRM citations., 160890=Only SP has guidance to input a TC 971 AC 506 on an IRSN as part of the UPC 147 process, 72970=If the taxpayer states they are experiencing an economic hardship because of this event; refer to IRM 21.1.3.18, Taxpayer Advocate Service Guidelines, 105083=If the tax related issue can be resolved in AM using the IRM 21, reassign to IDRS #0830141335 for the Centralized Distribution Site (CDS)., 121041=Taxpayer called the identity theft toll-free number inquiring about identity theft and raised suspicions of being a victim based on an Audit notice for 201012. The IPSU CSR identified a duplicate filing condition (DUPF) in 201112 and an open TC 420 in 201012. Because of the open duplicate (DUPF) AM control and the open audit (Compliance), this identity theft case has met MFC. IPSU would monitor this case., 10278=(52) IPU 14U0107 issued 01-13-2014 IRM 21.9.2.6.2(2) Revised If/Then chart when a tax related issue is identified and that issue can be resolved using the IRM 21., 3591=(2) IPU 14U0257 issued 02-03-2014 IRM citations and titles have been corrected and revised throughout this IRM as a result of other IRMs being updated., 7441=(29) IPU 14U0812 issued 05-06-2014 IRM 21.9.2.4.1(5) - Clarified paragraph throughout including the If/Then chart., 120090=If the taxpayer requests the Self Identified Non Tax Related indicator be reversed/removed, refer to Exhibit 10.5.3–7, IMF Only TC 972 AC 504 — Reversal of TC 971 AC 504.}",
    "textBeforeTable": "The IRS currently classifies Identity Theft (IDT) cases into two categories. They are cases where a taxpayer's personally identifiable information (PII) has been compromised and one of the following situations exists: 21.9.2.1  (10-01-2014) Identity Theft - General Information James P. Clifford Director, Accounts Management Wage and Investment Division Effective Date (10-01-2014) Audience All employees performing Individual Master File (IMF) account/tax law work related to identity theft Effect on Other Documents IRM 21.9.2 dated August 30, 2013 (effective date October 1, 2013) is superseded. This IRM also incorporates the following IRM Procedures Updates (IPUs) 13U1526 (dated 10/18/2013), 13U1570 (dated 10/25/2013), 14U0107 (dated 1/13/2014), 14U0257 (dated 2/3/2014), 14U0379 (dated 2/26/2014), 14U0454 (dated 3/7/2014), 14U0563 (dated 3/26/2014), 14U0812 (dated 5/6/2014). (74) IRM 21.9.2.9.5, Identity Theft Assistance Request - Procedures for Receipt of Form 14103 Referral (AM Sites ONLY) was re-numbered from IRM 21.9.2.9.2. (73) IRM 21.9.2.9.4 Inserted new section. New title is: Closing the ITAR (72) IRM 21.9.2.9.3 Inserted new section. New title is: Monitor and Suspend of an ITAR (71) IRM 21.9.2.9.2 Re-wrote section resulting in new title; Communicating with the Taxpayer (acknowledgement/status update) and Functional Employees (status updates) (70) IPU 13U1526 issued 10-18-2013 IRM 21.9.2.9.1(4) Inserted a new bullet instructing AM IPSU management to convert the relevant open control to IDT9/IDS9. See IPU 13U1489 dated 9/20/2013. (69) IPU 14U0454 issued",
    "textAfterTable": "IDT8/IDS8 CP 05A, (cases with prior Integrity & Verification Operation (IVO) (formerly known as AMTAP) involvement) and Deceased Taxpayer cases only. IMF AM CSRs working a tax related issue involving identify theft. See IRM 21.6.2.4.2.5.3, TIN Related Problem Cases with Deceased Taxpayer Indicators. IDT9/IDS9 ID Theft cases that are linked to an ITAR (Identity Theft Assistance Request). These cases are equivalent to an Operations Assistance Request (OAR). CSRs will receive Form 14103 referral from Andover or Fresno ITAR. IMF AM CSRs working a tax related issue involving identity theft AFTER receiving a Form 14103 referral. See IRM 21.9.2.9.5,Identity Theft Assistance Request - Procedures for Receipt of Form 14103 Referral (AM Sites ONLY). GRVW Global Review. See IRM 21.9.2.6, Global Review. AM IPSU only. IDTX See IRM 21.9.2.4.3, Multiple Function Criteria (MFC) – IDTX.",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}