{
    "relation": [
        [
            "Patent application number",
            "20110146109",
            "20120282012",
            "20130082059"
        ],
        [
            "Description",
            "SANDAL WITH MODULAR LIGHT UNIT - An article of footwear comprising a sole and at least one strap connected to the sole, a mounting base permanently affixed to the strap and a modular light unit removably mounted to the base. The modular light unit contains a light, a power source and a switch between the power source and light operable to energize and denergize the light.",
            "Vacuum container with a body and a base which are conveniently disassembled and assembled - A vacuum container with a body and a base which are conveniently disassembled and assembled comprises a body (",
            "Cup disposed with a push button switch using connecting rod mechanism for lateral pulling of a water sealing T-rod - A cup disposed with a push button switch using connecting rod mechanism for lateral pulling of a water sealing T-rod, wherein a push button switch ("
        ],
        [
            "Published",
            "06-23-2011",
            "11-08-2012",
            "04-04-2013"
        ]
    ],
    "pageTitle": "Wei Huang - Patent applications",
    "title": "",
    "url": "http://www.faqs.org/patents/inventor/wei-huang-2/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042982502.13/warc/CC-MAIN-20150728002302-00172-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 419590475,
    "recordOffset": 419554453,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Wei Huang, Guangdong CN 01-01-2009 Pointing Device with Optical Positioning on Low-Diffusive Surfaces - A computer input device includes a light source assembly forming an incident light beam that strikes an area on a surface beneath the input device with large incident angle. A light sensing assembly in the input device is positioned to receive scattered light and includes a band-pass filter. A barrier is located directly above the area where the light beam is incident on the top surface to prevent light from traveling directly from the light source assembly to the light sensing assembly. 20090002347 Published Description Patent application number Wei Huang, Hefei CN 05-07-2015 MICROFLUIDIC DEVICES, AND METHODS OF MAKING AND USING THE SAME - The present disclosure provides methods and systems for assaying a sample. A microfluidic device to perform an assay of a sample (e.g., biological sample) is described having a sample application site, a porous component and a flow channel. The porous component provides for uniform dissolution of a reagent and mixing of the sample and reagent without filtering the sample. 20150125882 07-17-2014 LOW-COST POINT-OF-CARE ASSAY DEVICE - The present disclosure provides methods and systems for analyzing a liquid sample. A micro-fluidic device to perform an assay of a liquid sample is described that includes a sample application site and a vent outlet in fluid communication with the capillary channel. A cap is provided that is",
    "textAfterTable": "Patent applications by Wei Huang, Guangdong CN Wei Huang, Lake Oswego, OR US Patent application number Description Published 20110201917 METHOD AND APPARATUS USING MAGNETIC RESONANCE IMAGING FOR CANCER IDENTIFICATION - Embodiments provide a Magnetic Resonance Imaging (MRI) technique and optionally software—collectively referred to as the “shutter-speed” model—to analyze image data of cancer patients. Embodiments provide a minimally invasive, yet precisely accurate, approach to determining whether tumors are malignant or benign by distinguishing the characteristics of contrast reagent activity in benign and malignant tumors. Exemplary embodiments provide MRI measured biomarkers for tumor malignancy determination, effectively eliminating or limiting the false positives suffered by existing MRI techniques. 08-18-2011 20140058249 METHOD AND APPARATUS USING MAGNETIC RESONANCE IMAGING FOR CANCER IDENTIFICATION - Embodiments provide a Magnetic Resonance Imaging (MRI) technique and optionally software—collectively referred to as the “shutter-speed” model—to analyze image data of cancer patients. Embodiments provide a minimally invasive, yet precisely accurate, approach to determining whether tumors are malignant or benign by distinguishing the characteristics of contrast reagent activity in benign and malignant tumors. Exemplary embodiments provide MRI measured biomarkers for tumor malignancy determination, effectively eliminating or limiting the false positives suffered by existing MRI techniques. 02-27-2014 20150087967",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}