{
    "relation": [
        [
            "Categories",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "Don't be afraid to ask for help in any of the application process, financial aid, etc. The staff is understanding that this is scary and willing to help.",
            "I have had the opportunity to visit at LVC three times. It's a wonderful campus and the people are very friendly, I am very impressed."
        ]
    ],
    "pageTitle": "Lebanon Valley College Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Lebanon-Valley-College/reviews?_escaped_fragment_=/show/9082",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042991076.30/warc/CC-MAIN-20150728002311-00033-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 893951611,
    "recordOffset": 893907867,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{138949=© 2015, Cappex.com, LLC, 66747=There are great traditions on campus that set LVC apart-- the annual Dutchmen Day excitement when students are surprised with a day off of classes while the campus is turned into a carnival, more or less; the intense football team's rivalry with Albright College--if we win, there's a march organized to the President's house to ask for a day off before Thanksgiving break., 37612=I am going to be going to this school in the fall of 2011 and so far all I have heard are great things about most of the professors!, 448=If you live in a small-town, Annville will feel like home to you. It's also nice for people who like to sleep a lot, since, unlike large campuses, LVC is about a 3 minute walk to any class. So in case you like to sleep in until 7:55 on a morning when you have an 8:00 class, you can still make it! Also, LVC has a variety of great food choices, so if you like to eat, this is the school for you!}",
    "textBeforeTable": "12/19/2009 Reviewer is A current student here. 14 out of 14 people found this review useful. 1 of 28 Jennifer from Taneytown, MD Check out reviews left by other students or leave your own review. You could win a free scholarship. Lebanon Valley College Reviews Lebanon Valley College › Pennsylvania › By State › Colleges › } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.create', -->",
    "textAfterTable": "Bang for the buck The college is a bit pricey compared to many in-state schools, but compared to most private colleges, LVC gives great scholarships. If you are in the top 10% of your class, you receive half off of your tuition! Even then, those who graduate in the top 20% receive one-third off of tuition, and those in the top 30% receive one-fourth off of tuition! The education, again, is just awesome. I have learned so much in just one semester that most of my friends going to public universities have not in the same courses! Am enjoying being here I was truly nervous before I came to this school, but now I never want to leave! I was definitely unsure if I'd like my roommate, but she is so awesome! It's great because they actually give thought to the students they put to live together at this college, unlike large universities where it is random. All the people on my floor are my best friends now, we have bonded greatly! There is always something to do on campus too, whether it be a comedian on Fridays, a band playing at MJ's, fun fitness classes, or something else the college has planned, everybody always has a blast! At LVC, they have a Redbook where you can sign up for weekend events such as Hershey",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}