{
    "relation": [
        [
            "Name",
            "Mr. Wright",
            "School's Out"
        ],
        [
            "Objectives",
            "Teach the students about weapon safety.",
            "Kill the bandits in the school."
        ],
        [
            "Significance",
            "Advanced weapon techniques tutorial.",
            "Bandits have broken into the school and have caused havoc in the hallways and classrooms. Izzy is among the students trapped."
        ],
        [
            "Unlocks",
            "School's Out",
            "Make Peace Through War (with Arrested Development (Kris) and Gettin' Tanked (Jake))"
        ]
    ],
    "pageTitle": "Difference between revisions of \"User:Scarabola\" - Grand Theft Wiki, the GTA wiki",
    "title": "",
    "url": "http://www.grandtheftwiki.com/index.php?title=User:Scarabola&curid=62022&diff=394260&oldid=394038",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042982502.13/warc/CC-MAIN-20150728002302-00113-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 471825239,
    "recordOffset": 471767995,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{161114=http://indiancountrytodaymedianetwork.com/sites/default/files/uploads/2012/03/crazy-horse-monument-AP9804150754-copy.jpg, 164800=My name is Jesse. I'm an age 19 male from the United States of America, and the sole creator of Tool. I am currently not enrolled into any higher education program, although I was for the 2012-2013 fall/spring semesters, and let me just say that it felt like a huge waste of time. I plan on attending a university as soon as possible, and will pursue a major in computer animation (as well as a film studies minor)., 137884=Rodger-Hellis (Harley-Davidson) (Biker gangs) Bully (chopper) (unaffiliated bikers and misc.) Nitrojan (futuristic motorbike) (New Gaspard citizens) Hydra (futuristic motorbike, multiple exhaust) (New Gaspard citizens) Nimbus (generic motorbike) (misc. and Gavin's beginning vehicle) Energy (sports motorbike) (New Gaspard citizens) Compton (dirt bike) (misc.) XTM (sports bicycle) (misc.) (Rufus' shop) Todd (bicycle) (misc.) (Rufus' shop) Vertica (New Gaspard hoverbike) Wasp (NGPF flying bike) (not accessible only until the final mission) Scout (wasteland hoverbike), 148398=Released this past June., 162118=http://crazyhorsememorial.org/info/wp-content/uploads/2009/08/index-bike.jpg, 154510=Pop station: First of all, Rockstar claims they've never had a pop station before. Oh yeah, cause Lips from GTA3, CSR from SA, The Vibe and Vice City FM and to some extent The Beat from IV, and um what else... oh yeah the entirety of Vice City weren't pop stations at all. Alright, onto the selections... \"Adult Education\"... meh, for some reason Hall and Oates feels so out of place in here. I would've liked \"Maneater\", however it was already used in BOGT. \"The New Anthem\"... nothing special. \"Don't Wanna Fall in Love\"... nothing special. \"Everything She Wants\"... nothing special. \"Gimme More\"... to me, it's an alright song. To this station, it's a perfect addition. \"Glamorous\"... the most perfectly-used song in the game, in other words the best song that was chosen for this game, I shit you not. \"Lady (Hear Me Tonight)\"... I forgot how this song goes, which is probably an indicator that it shouldn't have been used. \"Music Sounds Better with You\"... same as the last one. \"1 Thing\"... if I remember how it goes, then it's an alright song. \"Only Girl in the World\"... I do not like Rihanna's post-2009 works, however this is one of the exceptions. I'm glad they used this one instead of any of her other modern crap. \"Pure Shores\"... I keep mentally blocking out this song when listening to it. \"The Rhythm of the Night\"... nothing special. \"Scandalous\"... good. \"West End Girls\"... the second greatest song put in the game. This honestly wouldn't be out of place on the rock station, though, which shows how pop-oriented Los Santos Rock Radio really is. \"With Every Heartbeat\"... forgot how it goes. \"Work\"... I love Kelly Rowland. Good choice, or is this just bias?, 25543=Tool takes place in the year 2091, around 50 years after a world-wide war renders the world in an anarchistic state. The state of South Yankton is based mostly on western South Dakota, with a bit of north Nebraska and east Wyoming making up the southern and western borderlands, respectively. Other influences include bits of California, Australia and the Middle-East., 37686=Dana is the female employee of Borland Motors. Aged 28 in the year 2091, she currently works for Charlie Borland, inventor and owner of Borland Motors, as an assistant/errand girl. Dana lives in Rosterburg (I hate this name, I'm going to change it), a town situated at the edge of the frozen lake, which receives lower-than-normal temperatures., 161435=http://lemmod.files.wordpress.com/2010/04/loc6_450.jpg, 162351=http://bloximages.chicago2.vip.townnews.com/rapidcityjournal.com/content/tncms/assets/v3/editorial/8/d1/8d15033d-cb16-597e-89cf-73b99a4d8d18/4fc58a7ca2137.preview-620.jpg, 161817=http://www.blackhillsbadlands.com/resources/files/page_photos/2013/crazy-horse/crazy-horse-memorial-aerial.jpg, 165468=The idea for Tool came about in the winter (January) of 2011, stemming from an idea about making a game similar to Banjo-Kazooie: Nuts and Bolts, only having it set in a post-apocalyptic setting, and having the vehicle-building be very realistic and organic, as opposed to the gridlocked vehicle-building of BK. The original idea for the game focused on a young man named Gavin Miller, who would go to a large post-apocalyptic-yet-civilized city far from home and compete in the glamourous races held there. The game was essentially a vehicle-building sim and racer. The idea was soon modified to include an open-world element to gameplay, which took inspiration from Red Dead Redemption's \"open world wasteland on horseback\" gameplay, and motorcycles were introduced as the player's main mode of transportation, as a contrast to the horses of RDR. Another motivator for this addition was the fact that despite the plethora of post-apocalyptic games, I had never seen one that let the player ride a motorcycle in an open-world setting. Gavin's surname was changed to Wright, and Miller was retconned as his mother's maiden name. The setting of South Dakota was chosen solely on the idea of having an open-world game that let you visit and drive around Mt. Rushmore. I had no prior knowledge of South Dakota, and did not even know what state Mt. Rushmore was in. Over years of research, I eventually realized that South Dakota (or at least a world based on the state) was a perfect location for this type of game. Originally intended to be a scaled-down rendition of South Dakota, the game world was modified to be based mostly on South Dakota, in order to wipe out any sense of boredom that may come from playing in a game world that tried to accurately mimic the real world (yes I'm looking at you, LA Noire). The game world would see areas based on central South Dakota, the Badlands and the Black Hills, as well as areas taking inspiration from California, the Middle-East, and Australia. Having never played a Grand Theft Auto game at the time of conception (my first exposure was of GTA IV in August, 2011), the style and tone of Tool was very different from its modern iteration, most of the details having been forgotten. Around December 2011, the style and tone of Tool was changed to match that of a Rockstar game, complete with guns, killing and drama, and my vision of Tool was also modified to include the Euphoria physics engine present in RDR and GTAIV-V. Grand Theft Auto's tradition of using alternate names for the cities and states the games are set in also saw its way to being used in Tool, one example being the state of South Dakota was renamed as South Yankton, in order to give reason as to why it is not a scaled rendition mentioned earlier. The idea of having Tool be a biker gang drama/epic didn't come around until the summer of 2012, when a sudden spike of interest in the biker genre flowed into me. In order to keep a sense of diversity in the locations, characters, and the story, I had kept the original idea of having Gavin be a \"country-boy moving to the big city\" type of character, as well as the large city where the races were held. Gavin's character development would then see him changing from a naive and non-violent young man from a small town in the east coast, to the bloody-clothed biker gang member of the wasteland. The city of New Gaspard (as well as Gaspard) was originally named New Pierre, as an offshoot of the desolate ruins of Pierre, South Dakota. The name was chosen in order to stick with the city's French origin. Originally the city was a brown and rust-pipe-infested crapsack city, however was changed to match the cyberpunk look of the cities seen in films such as Blade Runner and The 5th Element, in order to break away from generic post-apocalyptica, as well as to make it seem as if racing in the city truly was glamourous and elite. Poorer sections of the city took cultural inspiration from hood gangs of the 80s and 90s, as well as 50s and 60s mafia stories. Visual inspiration for the poor sections stood true to the crowded streets of the cyberpunk cities. I am a man of many musical tastes, and every song chosen for the game's soundtrack was/is chosen by me, personally. In the early years of development, I had absolutely no musical knowledge past what is commonly known, and originally the track list had some pretty shit and generic songs all bundled into one station. Eventually I became more musically aware, and heavily modified the tracks and the format. The only two songs that were never removed and have been here since the beginning are \"Dr. Feelgood\" by Motley Crue and \"Born to Be Wild\" by Steppenwolf. Regarding the song \"Highway to Hell\", I'm still not very sure if putting that song would be in the best interest of the game.}",
    "textBeforeTable": "Gavin's father Dalton has called a friend of his (Clay) living in South Yankton and asks him to help his boy out by getting him settled in the state. Introductory Kubrick County is the eastern section of the great plains. There are 32 missions in the main thread in Kubrick County. Protagonist Gavin Wright arrives in the midwestern state of South Yankton, and tries to gain access to the city of New Gaspard to compete in professional races. Missions in this county involve Gavin's attempt to assimilate in this foreign region and gain allies that can help him become better and more knowledgeable in vehicle racing and maintenance, along with several obstacles that threaten him and his chances of competing. Many of these missions have Gavin as the driver with additional help as required. Kubrick County is the eastern-most territory of the explorable game, and makes up the eastern portion of the great plains. It is a region with yellow wheat fields and numerous hills and cliffs. Kubrick County missions The game also takes influence and imagery from 50s car culture, as well as the cyberpunk, hacker and rivethead cultures. The game is an homage to the biker culture, which grew in popularity in America in the 1960s and continued to the present. The setting is inspired by western South Dakota, a popular location for bike riders, largely due to the Sturgis Motorcycle Rally in the Black Hills.",
    "textAfterTable": "Locomotive Breath Fix Clay's pickup, and drive around the surrounding wasteland. Escape from the bandits. Car repair tutorial. Get a feel of driving around Kubrick County. First bandit encounter. Gavin, Get Your Gun Gavin, Get Your Gun Take Lawrence to the gun dealer, and test out the weapons. Gun tutorial. The character Kurtis is introduced. Kurtis' gun store is accessible. Yard Junkie (Clay) Tanker Rigging (Lawrence) Curtis' gun store Clay (C) Clay is the owner of the Stillwater Auto vehicle repair shop. He speaks in a gruff southern-drawl. Name Objective Significance Unlocks Yard Junkie Drive with Clay to a junkyard nearby, and kill all the bandits. Take some spare parts and drive back to the garage. First gunfight. One-Day Clearance One-Day Clearance Modify Clay's pickup. Drive to the abandoned convenience store for parts, defend Kevin's gang from bandits. Car modding tutorial. Introduces the characters Kevin, Oz, Audrey, Cisco, Clyde, Donna, and Nicole. Introduces the convenience store that Kevin and co. live in. Circle Jerks Medicine Men (Kevin) Circle Jerks Defend the garage from a motorcycle gang. First encounter with a motorcycle gang. Scrapper's Delight Scrapper's Delight Take a vehicle to",
    "hasKeyColumn": true,
    "keyColumnIndex": 1,
    "headerRowIndex": 0
}