{
    "relation": [
        [
            "Product",
            "Sunsilk Co-Creation",
            "Telkomsel BlackBerry",
            "Sharp Papillon"
        ],
        [
            "Industry",
            "Personal Care (Shampoo)",
            "Telecommunication (Mobile Internet Package)",
            "Electronics (Refrigerator)"
        ],
        [
            "Status",
            "Brand Ambassador",
            "Model in TV Spot",
            "Model in TV Spot"
        ]
    ],
    "pageTitle": "ICE TRACK",
    "title": "",
    "url": "http://icetrack.blogspot.com/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042991076.30/warc/CC-MAIN-20150728002311-00176-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 107984543,
    "recordOffset": 107941638,
    "tableOrientation": "VERTICAL",
    "lastModified": "Wed, 29 Jul 2015 09:46:24 GMT",
    "textBeforeTable": " Ads spending by industry was dominated by Personal Care. The top four were: ANTV: \"Kejayaan Mahabharata\" (TV Series) MNC TV: \"Kontes Final KDI\" (Reality Show) SCTV: \"Ganteng-Ganteng Serigala\" (TV Series) RCTI: \"Tujuh Manusia Harimau\" (TV Series), X Factor Indonesia (Reality Show) Some famous program in those TV Stations (Prime Time) are: An Indonesian-based research firm, AdsTensity (PT Sigi Kaca Pariwara) shared their study about Free To Air TV Advertising. In Q1 2015, RCTI and SCTV were estimated to get the biggest chunk of gross revenue out of thirteen TV stations. Popular Faces in Indonesia Advertising (2015) Tuesday, May 19, 2015 JAKFEST | CONTACT | Kejut.com | MYSELF | ABOUT | HOME |",
    "textAfterTable": "Product Industry Status Fair and Lovely Personal Care (Face Cream) Brand Ambassador Marina Personal Care (Body Cream) Brand Ambassador (with Irish Bella) Fable Personal Care (Body Mist) Brand Ambassador (with Al Ghazali) Oppo Electronics (Mobile Phone) Ads (with Kevin Julio) Campina Food and Beverages (Ice Cream) Ads BerryBenka Retail Store (Online Store) Ads Matahari Retail Store (Department Store) Ads Profile Female, 23 years old, Single, 167 cm Likes to dance Recent News: Selected as most attractive girl to date with Graduated (very satisfactory) with a degree in Management from Bina Nusantara University (BINUS) Starring in TV Series \"Ganteng-Ganteng Serigala\" (SCTV) Starring in television movie: \"Lukisan Merah\", \"Bangsal 7\", \"Bapakku Jago Karate\",\"Gadis Taman Kota\" 2. Eriska Rein Product Industry Status Fair and Lovely Personal Care (Face Cream) Brand Ambassador Lactacyd Food and Beverages (Supplement) Brand Ambassador Indosat IM3 Telecommunication Ads Tacqueen Fashion Ads Profile",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}