{
    "relation": [
        [
            "Year",
            "1970-79",
            "1980-89",
            "1992-93",
            "1994-95",
            "1996-97",
            "1998-99",
            "2000-01",
            "2002-03",
            "2004-05",
            "2006-07",
            "2008-09",
            "2010-11",
            "2012-13"
        ],
        [
            "Total",
            "4",
            "2",
            "1",
            "3",
            "7",
            "9",
            "19",
            "16",
            "26",
            "37",
            "64",
            "99",
            "58"
        ],
        [
            "Free%",
            "100%",
            "100%",
            "100%",
            "100%",
            "86%",
            "100%",
            "89%",
            "81%",
            "92%",
            "92%",
            "70%",
            "51%",
            "50%"
        ]
    ],
    "pageTitle": "Walt at Random",
    "title": "",
    "url": "http://walt.lishost.org/page/3/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042991076.30/warc/CC-MAIN-20150728002311-00140-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 250539139,
    "recordOffset": 250430928,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{580848=Cites & Insights 15:6 (June 2015) is now available for downloading at http://citesandinsights.info/civ15i6.pdf, 614228=Table 11.5 shows education OA journals by starting date, including the percentage of journals started in a given date range that don’t currently charge APCs. (It omits one free journal that started in 2014 and was in DOAJ early enough to be in the study universe.), 640332=Table 11.3 shows the number of journals in each size category, 2013 articles for journals in that group, and what percentage is or is in no-fee journals. Not only are there no prolific OA education journals, there are almost no large ones and very few medium-sized (60 to 199 articles); in fact, nearly half of the journals are sparse, publishing fewer than 20 articles per year. As usual, the percentage of free journals goes down as the article volume goes up., 492357=Table 10.6 shows journals that published articles in 2013, when they started, and the average 2013 articles per journal. Note that there were no new economics OA journals in 1990-91 and that those started in 1992-93 didn’t publish any articles in 2013. The most interesting item in this table may be that the two journals started in the 1980s publish more articles per journal than for any period since then, but with only two journals, that may not be very meaningful., 579273=Comments Off on Cites & Insights 15:6 (June 2015) available, 542435=The numbers here are unusual—showing a large decline in OA publishing from 2012 to 2013 and a small decline in 2014, albeit one that brings 2014 numbers below 2011 numbers. These numbers don’t include journals that entered DOAJ after May 7, 2014 and some journals that post articles online very late. It appears to be a real decline, but one that largely involves a few journals. For example, one journal dropped from 1,220 articles in 2012 to 480 in 2013 and a mere 100 in 2014: that alone accounts for 85% of the 2013-2014 decline and more than half of the decline from 2012 to 2014., 745578=Table 12.1 shows the number of journals and 2013 articles for each grade; free, pay and unknown numbers; and average articles per journal. The boldface percentages (grades) are percentages of all engineering journals and articles; others (free, pay, unk) are percentages of the grade above. All A$ journals charge APCs, so the Pay line is omitted., 737445=The eleven “unknown” journals (with 1,103 articles in 2013) are omitted. The journal numbers still don’t add up to 245 because there are some journals that didn’t publish articles in any given year—for example, four journals didn’t publish articles in 2013., 649019=While there are certainly some annuals and other journals that have yet to post 2014 articles, it does appear that there’s been some decline in publishing activity. On the other hand, 214 of the 341-article drop is accounted for by three journals (two with APCs, one free) that either haven’t published any articles in 2014 or, in one case, is now flagged as hosting malware and so wasn’t reached or counted., 648597=Looked at on a journal-by-journal basis, 133 journals published more articles in 2014 than in 2013; 29 published the same number; 157 published fewer articles. In terms of significant change, 115 (36%) published at least 10% more articles; 65 (20%) were relatively unchanged; 139 (44%) published significantly fewer articles, including 23 that have yet to post any 2014 articles. It’s curious but probably not meaningful that, if you omit the 23 journals with no 2014 articles, the number of journals with significantly more articles is almost precisely the same as the number with significantly fewer., 684480=Figure 12.1 shows essentially the same information as Table 12.5 but in graphic form—and I think it makes the gold rush clearer. Table 12.6 shows the number of journals beginning in each time period that actually published one or more articles in 2013, the number of articles, and average articles per journal. Other than two earlier cases involving just two journals in each period, the most interesting periods may be 2004-05, 2008-09 and 2011-2012, in each case with relatively high average articles per journal., 577587=Economics includes most business topics. It’s the second largest group of journals (and by far the largest group in the humanities and social sciences)—but not the second largest collection of articles. This topic includes 345 journals, which published a total of 10,663 articles in 2013 and 10,217 in 2014., 843802=Looked at on a journal-by-journal basis, 73 journals published more articles in 2014 than in 2013; 12 published the same number of articles (including five that stopped publishing in 2012 or before); 51 published fewer. In terms of significant change, 65 (48%) published at least 10% more articles in 2014; 25 (18%) published about the same number of articles; 46 (34%) published at least 10% fewer, including 13 journals that, so far, haven’t published any articles in 2014. Most of those 13 are annuals and may publish 2014 articles later in 2015; one is now flagged as malware, which means I won’t look at it., 593231=Heather Morrison recently posted “Which subjects are most likely to charge article processing charges?” at Sustaining the Knowledge Commons.  It’s an interesting post, and since my own (non-sampled, all journals in DOAJ  as of May 2014 that I was able to evaluate as a English-speaker, 6,490 of them that actually have articles available) in-depth study won’t be out (as an issue of Library Technology Reports; the anonymized data is available here) until this summer, I thought I’d add my own figures., 592026=So here are two quick tables, the first covering the set of 29 topic groups (two of which aren’t really topics) and 2013 articles, the second covering 23 of the 29 and 2014 articles (I haven’t quite finished revisiting 2014 article counts). Both tables are in descending order by percentage of articles that appeared in journals that clearly charge APCs. (There are some journals where it’s just not clear, but those journals only represent 2%-3% of articles.) (The two non-topics are “mega”–four multidisciplinary journals publishing more than 1,000 articles per year–and “miscellany,” journals that didn’t fit into one of the other slots.), 852692=Table 13.1 shows the number of journals and 2013 articles for each grade; free and pay numbers; and average articles per journal. History OA journals are unusual in several ways, among them—on the good side—the lack of any C or Unknown journals and the nearly complete absence of pay journals. As usual, bolded percentages (grades) are percentages of all history journals and articles, while others (free and pay) are percentages of the grade above, and the redundant “Pay” line for A$ is omitted., 520184=There’s no correlation (-0.02) between APC size and number of 2013 articles. That’s hardly surprising., 727201=Larger journals dominate engineering, and as the journal size goes up, the percentage of free journals goes down, radically for the two largest categories (which account for considerably more than half of all 2013 articles)., 507390=Figure 10.1 shows essentially the same information as Table 10.5, but in a graph with lines for free and APC-charging journals. Note the wide gap until 2010., 781869=On May 6, 2015, I posted “Percentage of OA articles involving APCs” showing on a subject-by-subject basis the percentage of OA articles in a given subject area that involved APCs (that is, appeared in journals charging APCs, although some articles have waivers)., 701956=Table 12.5 shows engineering OA journals by starting date, including the percentage for each date range that currently don’t charge APCs. The overall sense of a gold rush from 2006 through 2011 is certainly apparent here—except that it continues into 2012-2013, with most new journals (except 2006-2007) APC-charging and many more journals than in previous periods. (No journals began in 1960-69 or 1990-1.), 737174=These are fairly striking numbers. While the percentage of free journals isn’t a lot lower than average for all of OA, it’s declined somewhat since 2011. What’s really changed is the number of articles in what’s clearly a growing field of OA publishing: just under half were in no-fee journals in 2011, while only one-quarter are in such journals in 2014. That’s during a period in which the number of articles more than doubled, while the number of journals publishing in any given year only increased by one-quarter., 834884=Table 13.3 shows the number of journals in each size category, 2013 articles for journals in that group, and what percentage are in no-fee journals. Not surprisingly, there are no prolific history journals; perhaps surprisingly, the handful of APC-charging journals are small or sparse, and most articles appear in small and sparse journals., 844203=One of the three APC-charging journals didn’t start publishing until 2013, which may explain the tiny decline in free-article percentage. As usual, there are some journals that don’t publish articles in any given year—ten in 2013, for example. In any case, virtually all OA history journals are free, and the field is growing, although it’s still small (and will probably stay that way)., 788231=The PDF will have hotlinks for the table of contents and table of figures and tables. Current working title is The OA Landscape 2011-2014: An Interim Subject View, 773214=Engineering journals were distinguished from Technology journals based on narrower subjects and journal titles. This group includes 245 journals, which published 19,336 articles in 2013—and 21,495 in 2014., 588806=And here’s the partial table, for all of 2014 (note: this is newer data than in the published report):, 541818=Looked at on a journal-by-journal basis, 140 journals published more articles in 2014 than in 2013; 46 published exactly the same number; and 159 published fewer articles. In terms of significant change, 121 (35%) published at least 10% more articles in 2014 than in 2013; 91 (26%) published roughly the same number; and 133 (39%) published at least 10% fewer articles in 2014—including 30 that, to date, haven’t published any 2014 articles. (That last number includes six journals that were unreachable.), 871960=Overall: I’m still assuming I’ll operate at a slower pace for another few days, but that’s at least partly because I want to be as useful as possible in hauling bark and rocks around. The next Cites & Insights may be a little late (and will be a peculiar and short issue), but probably not very late (unless there are SSH issues), and I’m starting to look at detailed plans for extending the 2014 project., 789955=The full set of 29 subject discussions that extend this summer’s Library Technology Report issue “ The State of Open Access Journals: Idealism and Opportunism” has been posted, and will appear on Fridays from now through September 11, 2015. (Oops: The actual title is Open Access Journals: Idealism and Opportunism.)Later this week, or possibly next week, I’ll be creating a PDF ebook that combines all of the posts with the following refinements:, 810231=Table 13.5 shows history OA journals by starting date, including the percentage of journals starting in each date range that currently don’t charge APCs. The sense of a gold rush from 2006-2011 that I find in DOAJ in general isn’t there for history: although the rate of journal creation increased significantly in 2008-2011, only one APC-charging journal was created between 2006 and 2011., 580166=The June 2015 issue includes:, 784640=Oh, and by the way, this offer is retroactive to mid-April 2015, which only affects one person long active in OA and scholarly publishing–they’ll get both books., 781070=I’ve finished that pass now, and can provide a full table for 2014. (Later this week, I think, there will be an announcement on availability of a combined report on that work–one that goes beyond the weekly postings.), 521077=Table 10.4 shows the number of journals in each fee range and the number of 2013 articles for those journals. The %Fee percentages are of all fee-charging journals. “Unknown” journals are omitted., 870271=History includes most aspects of cultural research focused on the past and a number of regional, national and state studies journals. The group includes 136 journals, which published a total of 2,739 articles in 2013 and 3,090 in 2014., 792608=Table 13.5 includes only those journals that published at least one article in 2013 and shows, for journals started in each date range, the average articles per journal. There are two obvious points of interest in this table: some of the large and medium journals began more than 20 years ago., 781505=That post included a full set of 28 topics or non-topics for 2013, sorted from the topic most likely to involve APCs to the one least likely, and a partial list for 2014–because I hadn’t yet finished the project of adding full-2014 numbers to my set of 6,490 journals (in DOAJ  as of May 7, 2014, capable of being analyzed by an English-reading person, actually OA and not ruled out for other reasons)., 780839=That table appears below. I should also note, in passing, that the total number of articles in the 6,490 journals went from around 366 thousand in 2013 to nearly 408 thousand in 2014–a growth rate of more than 10%, although some fields show less OA activity in 2014. Note that these numbers still ignore some 2,000 journals that didn’t appear to have any English interface, so they’re probably still 10%-18% too low., 628641=Table 11.4 shows the number of journals in each fee range and the number of 2013 articles for those journals., 788045=Later–once I’ve finished migrating to a new computer and put together the draft text for the July Cites & Insights–I’ll start working on a much more ambitious book that complements the Library Technology Report rather than extending it. That effort will involve rethinking some of the grades, moving much of the analysis so that it’s based on 2014 rather than 2013, attempting to integrate at least 200 or so 2014 titles and possibly some portion of the “non-English” titles, revisiting grades for some items, backfilling some numbers…and maybe even using a May 2015 DOAJ download as the foundation, rather than sticking with the May 2014 one. Best guess is that this effort will take most of the summer; my target is to have it ready by September 14, 2015 or before. (While I’m still a young man, before I turn a decrepit 70…) [Then, I’ll start working on ways to fund and/or justify an entirely new in-depth 2016 study of the OA landscape 2011-2015.], 551680=Table 10.1 shows the number of journals and 2013 articles for each grade; the free, pay and unknown numbers; and average articles per journal. Boldface percentages (grades) are percentages of all economics journals; others (free, pay, unknown) are percentages of the grade above. Since A$ requires an APC of $1,000 or more, the “pay” line is redundant and omitted., 657871=Table 11.1 shows the number of journals and 2013 articles for each grade; the free, pay and unknown numbers; and average articles per journal. Boldface percentages (grades) are percentages of all the journals; others (free, pay, unk.) are percentages of the grade above. Since A$ implies a fee, the redundant Pay line is omitted., 736633=Clearly, OA activity is increasing in engineering fields, even without considering journals founded in 2014. In all, 122 journals published more articles in 2014 than in 2013; 19 published the same number of articles; 104 published fewer. Looking at significant change, 96 (39%) published at least 10% more articles; 62 (39%) published at least 10% more articles; 62 (25%) stayed about the same; and 87 (36%) published at least 10% fewer articles, including 16 that have not yet published any articles in 2014. (The counts in this paragraph do include “unknown” journals.), 508060=Table 10.5 shows economics OA journals by starting date, including the percentage of journals started in a given date range that currently don’t charge APCs. For DOAJ journals as a whole, there’s a sense of a gold rush for APC-charging journals starting in 2006 and possibly declining in 2012. Economics is different: startups were slow until 2008, and that’s also the point at which significant numbers of APC-charging journals appeared. The rate of new journals slowed significantly in 2013, but half of the new ones were still APC-charging. Note that there are no OA economics journals dating back prior to 1970, and that none began in 1990-91., 682270=Education is the second-largest set of journals in the humanities and social sciences, and could have been larger—some STEM journals could have gone here. Although the group includes 319 journals (fifth largest overall), the journals only published 7,332 articles in 2013 (and slightly fewer, 7,038, in 2014), fewer than 14 other groups., 649269=Open access education journals are predominantly free—92% in 2011, declining only slightly by 2014. More than four out of five articles appear in no-fee journals, and after a sharp drop in 2012 that percentage has stayed constant since., 727522=Table 12.3 shows the number of journals in each size category; 2013 articles for journals in that group; and what percentage is no-fee or in no-fee journals. Note that the peak is based on 2011 through the first half of 2014; there would be six journals in the Prolific category if all of 2014 was included., 532781=Table 10.3 shows the number of journals in each size category (based on the largest number of articles in 2011, 2012, or 2013); 2013 articles for that group; and what percentage is (or is in) no-fee journals. The single prolific journal was only prolific in 2011 and 2012: it’s now down to the Small category for 2014., 613941=For DOAJ journals as a whole, there’s a sense of a gold rush for APC-charging journals starting in 2006. There really aren’t enough APC-charging education journals to constitute a gold rush, and the field in general only started to grow rapidly in 2004—but it is noteworthy that only five APC-charging journals started before 2008, and 24 of the 35 APC-charging journals started in 2010-2013., 649753=Table 11.2 shows the number of free and APC-charging journals that actually published articles each year (including all of 2014), how many articles they published, and what percentage were free. The two “unknown” journals (with 52 articles in 2013) are omitted. Additionally, there are always some journals that don’t publish articles in a given year, especially with as many small journals as in education—e.g., 15 journals didn’t publish any articles in 2013., 715304=Table 12.4 shows the number of journals in each fee range and the number of 2013 articles in those journals. To the extent that the first %Fee figures diverge from 25%, they represent deviations from the norm for all of OA—in this case, a much lower percentage of high-priced (more than $1,450) journals and somewhat higher percentages of low- and nominal-fee journals. It’s interesting that the nominal-fee journals ($8 to $200) publish most of the articles that appear in APC-charging journals., 613526=Figure 11.1 shows essentially the same information as Table 11.5, but as a graph with lines for free and APC-charging journals. I’ve included markers for pay journals so that the data points (one journal each) in 1980-89 and 1996-97 show up., 823320=Table 2.4 shows the number of journals in each fee range and the number of 2013 articles for those journals. Given the tiny number of fee-charging history journals, the table is essentially meaningless, but is included for consistency., 585554=The full table for 2014 is now available here, along with the overall total showing more than 10% growth in OA articles from 2013 to 2014–to just under 408,000 in 2014 (which may still be 10%-18% low)., 591371=Table 1: Percentage of 2013 articles appearing in APC-charging journals, all topics, 595348=Table 11.6 shows the number of journals started in each date range that actually published articles in 2013, the number of articles, and average articles per journal. It’s mildly interesting that older journals tend to have more articles than younger journals.}",
    "textBeforeTable": "Grades History includes most aspects of cultural research focused on the past and a number of regional, national and state studies journals. The group includes 136 journals, which published a total of 2,739 articles in 2013 and 3,090 in 2014. Posted in open access on May 22nd, 2015 The Open Access Landscape: 13. History 2 Comments » Sure would be nice to get more OA supporters/C&I contributors, though… Overall: I’m still assuming I’ll operate at a slower pace for another few days, but that’s at least partly because I want to be as useful as possible in hauling bark and rocks around. The next Cites & Insights may be a little late (and will be a peculiar and short issue), but probably not very late (unless there are SSH issues), and I’m starting to look at detailed plans for extending the 2014 project. I think my typing speed (adjusting for errors) is back up to, say, 80% of normal–and my wrists and shoulder are considerably better. Still to do: restore SSH FTP (waiting for instructions from Blake), probably a couple of small programs to reload, probably more tweaks, and",
    "textAfterTable": "176 6% 4 Free 42 100% 176 100% 4 Table 13.1. Journals and articles by grade Table 13.1 shows the number of journals and 2013 articles for each grade; free",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}