{
    "relation": [
        [
            "Release",
            "12.0(3)T",
            "12.2(33)SRA",
            "12.2SX",
            "Cisco IOS XE Release 3.2SE",
            "Cisco IOS XE Release 3.3SE"
        ],
        [
            "Modification",
            "This command was introduced.",
            "This command was integrated into Cisco IOS Release 12.2(33)SRA.",
            "This command is supported in the Cisco IOS Release 12.2SX train. Support in a specific 12.2SX release of this train depends on your feature set, platform, and platform hardware.",
            "This command was implemented in Cisco IOS XE Release 3.2SE.",
            "This command was implemented in Cisco IOS XE Release 3.3SE."
        ]
    ],
    "pageTitle": "Cisco IOS SNMP Support Command Reference - sample (event trigger) through snmp mib event sample [Support] - Cisco",
    "title": "",
    "url": "http://www.cisco.com/c/en/us/td/docs/ios-xml/ios/snmp/command/nm-snmp-cr-book/nm-snmp-cr-s1.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042982502.13/warc/CC-MAIN-20150728002302-00038-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 364957659,
    "recordOffset": 364900087,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{410=The definitions for the OIDs displayed by this command can be found in the relevant RFCs and MIB modules. For example, RFC 1907 defines the system.x, sysOREntry.x, snmp.x, and snmpTrap.x OIDs, and this information is supplemented by the extensions defined in the CISCO-SYSTEM-MIB., 98911=The Event MIB allows you to configure your own traps, informs, or set operations through the use of an external network management application. The show management event command is used to display the values for the Events configured on your system. For information on Event MIB functionality, see RFC 2981, available at http://www.ietf.org ., 37670=The following example specifies 00000009020000000C025808 as the local engineID and 123456789ABCDEF000000000 as the remote engine ID, 172.16.37.61 as the IP address of the remote engine (copy of SNMP) and 162 as the port from which the remote device is connected to the local device:}",
    "TableContextTimeStampAfterTable": "{126170=When configuring SNMP, you may see the logging message “Configuring snmpv3 USM user.” USM stands for the User-based Security Model for version 3 of the Simple Network Management Protocol (SNMPv3). For further information on the USM, see RFC 2574., 200775=(Optional) Specifies the interval of time between each attempt at sending an inform request, in seconds. The valid range is from 1 to 1000., 167561=(Optional) Specifies the interval of time between each attempt at a getBulk operation, in seconds. The valid range is from 1 to 1000., 10140=In the following example, the initial transfer attempt and the first retry for the file IfMIB_objects_Router_030307_102519739 to the primary and secondary URL have failed, and four additional retry attempts will be made. The time stamp for this file indicates the file was created on March 7, 2003, at 10:25:19 a.m., 156168=(Optional) Specifies the interval of time between each attempt at a get operation, in seconds. The valid range is from 1 to 1000., 180874=(Optional) Specifies the interval of time between each attempt at a getNext operation, in seconds. The valid range is from 1 to 1000., 156810=The object identifier value. For example, sysName.0 or 1.3.6.1.4.1.9.9.10.1.3.0.5.}",
    "textBeforeTable": "Syntax Description { absolute | delta | changed } sample no { absolute | delta | changed } sample To specify the type of object sampling to use for an event, use the samplecommand in event trigger configuration mode. To disable teh configured settings, use the no form of this command. sample (event trigger) snmp mib event sample snmp mib event owner snmp mib event object list snmp mib community-map snmp mib bulkstat transfer snmp mib bulkstat schema snmp mib bulkstat object-list snmp inform snmp ifmib ifalias long snmp get-next snmp get-bulk snmp get snmp context (VRF) show snmp view show snmp user show snmp sysobjectid show snmp stats oid show snmp sessions show snmp pending show snmp mib notification-log show snmp mib ifmib ifindex show snmp mib ifmib traps show snmp mib context show snmp mib bulkstat transfer show snmp mib show snmp location show snmp",
    "textAfterTable": "Command History Release Modification 12.4(20)T This command was introduced. 12.2(33)SRE This command was integrated into Cisco IOS Release 12.2(33)SRE. Usage Guidelines The sample command enables the specified sampling method for the object. You can specify the following sampling methods. Absolute Delta Changed Absolute sampling uses the value of the MIB object during sampling. The default sampling method is absolute. Delta sampling uses the last sampling value maintained in the application. This method requires applications to do continuous sampling. The changed sampling method uses the changed value of the object since the last sample. Examples The following example shows how to specify the sampling method as absolute:  Router(config)# snmp mib event trigger owner owner1 name triggerA Router(config-event-trigger)# sample absolute",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}