{
    "relation": [
        [
            "Designation",
            "FJ80R/L",
            "FZJ80R/L",
            "HDJ80R",
            "HZJ80R"
        ],
        [
            "Engine",
            "3F-E 4.0 L petrol I6",
            "1FZ-FE 4.5 L petrol I6",
            "1HD-T 4.2 L turbodiesel I6",
            "1HZ 4.2 L diesel I6"
        ],
        [
            "Power",
            "112 kW (152 PS; 150 hp) at 4,000 rpm",
            "158 kW (215 PS; 212 hp) at 4,600 rpm",
            "115 kW (156 PS; 154 hp) at 3,600 rpm",
            "96 kW (131 PS; 129 hp) at 4,000 rpm"
        ],
        [
            "Torque",
            "290 N·m (214 lb·ft) at 3,000 rpm",
            "373 N·m (275 lb·ft) at 3,200 rpm",
            "357 N·m (263 lb·ft) at 1,800 rpm",
            "271 N·m (200 lb·ft) at 2,000 rpm"
        ],
        [
            "Availability",
            "Australia, North America",
            "Australia, Gulf Cooperation Council states, North Africa, North America",
            "Australia",
            "Australia"
        ]
    ],
    "pageTitle": "Toyota Land Cruiser - Wikipedia, the free encyclopedia",
    "title": "",
    "url": "http://en.wikipedia.org/wiki/Toyota_Land_Cruiser",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042982502.13/warc/CC-MAIN-20150728002302-00260-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 79290579,
    "recordOffset": 79239877,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{113650=The 100 series remained in production until late 2007, with several minor facelifts such as headlights, taillights, front grille, rear spoiler and specification changes introduced over the years., 112180=The introduction of a V8 engine was also a first for a Land Cruiser, and was specifically intended to improve sales in the North-American market, where it was the only engine available. In Australia, the 100 V8 was initially only available in the range-topping GXV model, while entry and mid-range models were the 105 powered by the 1FZ-FE I6 petrol, or 1HZ diesel engines. The new 1HD-FTE turbo-diesel 100 was added to the Australian range in October 2000 after being available in Europe and the UK since launch in 1998. The 4WD media in Australia were critical of Toyota’s decision to offer the acclaimed 1HD-FTE engine only in combination with IFS. Australian 4WD Monthly magazine said \"We will never forgive Toyota for going independent at the front with the mighty 4.2 turbo-diesel\"., 132376=The vehicle entered production in September 2007 and was available for sale from September or November, depending on country. It became available in Venezuela for sale early in November under the local nickname of \"Roraima\" (taken from Mount Roraima). Early reliability has proven to be excellent., 113345=The 100 series was called the Toyota Land Cruiser Amazon in the UK and Ireland from 1998 to 2007., 108249=In 1998 it introduced World First Suspension system combining Active Height Control (AHC) and Skyhook TEMS Toyota Electronic Modulated Suspension on the Landcruiser 100[21] In 2002 Toyota introduced Night View, the first worldwide series production active automotive night vision system, on the Toyota Landcruiser Cygnus or Lexus LX470. This system uses the headlight projectors emitting near infrared light aimed like the car's highbeam headlights and a CCD camera then captures that reflected radiation, this signal is then processed by computer which produces a black-and-white image which is projected on the lower section of the windshield.[22] It was also the first Toyota with roll-over sensor and control logic[23] The 100 models were fitted with a slightly wider chassis, independent front suspension (IFS) and two new engines. The change to IFS was a first for a Land Cruiser, and was made (in combination with rack-and-pinion steering) to improve on-road handling. However it also limited the vehicle’s off-road capability and durability, hence the decision to offer the solid axle 105 models alongside the IFS 100 models in some markets. The table below identifies the range of 100 and 105 models and their worldwide availability., 127911=In 2002, a 5-year development plan on a successor to the 100-series platform commenced under Sadayoshi Koyari and Tetsuya Tada. By 2004, 10 years after the design selection of its predecessor in 1994, a final production design was settled on for the 2008 J200. Prototype related tests were conducted for over 2 years between 2004 and early 2007. The redesigned Toyota Land Cruiser was introduced in late 2007. Known as the 200 Series, it shares the Lexus LX 570's platform and overall design. The frame was new, derived from the second-generation Tundra[citation needed] but shortened and strengthened by 20 percent. Bigger brake rotors and calipers were added and the front suspension was made heavier duty than the Land Cruiser's first effort at IFS in the 100-series and this underbelly is also protected by skid plates. Also, the roof pillars were redesigned to better protect occupants in a rollover., 63820=The Land Cruiser 55 was produced from 1967 to 1980. Toyota refers to the FJ55G and FJ55V as the first \"real\" station wagon in the Land Cruiser series, thus marking the beginning of the station wagon branch. It was the first Land Cruiser to have fully enclosed box frame members. Of all the Land Cruiser wagons sold in the U.S., including the FJ45, it is the only one to not have hatch and tailgate in the rear, but rather a tailgate only with an electrically operated window that can be retracted into the tailgate.[18], 70686=The Land Cruiser 60 series was produced from 1980 through 1990 for most markets but the Cumana Plant in Venezuela continued until 1992 for their local market. It is a front engine, four door wagon which can seat five to eight[citation needed] people. Like all Land Cruiser generations, it is well known in the off-road world for its off-road abilities but was somewhat limited by its awkward departure angles.[citation needed] The 60 series was available in the following solid exterior colors: Alpine White, Brown, Desert Beige, Freeborn Red, Royal Blue; and in the following metallic exterior colors: Charcoal Gray, Cognac, Gray-Blue, Rootbeer, Sky Blue, Stardust Silver., 9053=Later in 1941 the Japanese government told Toyota to produce a light truck for Japan's military. In 1942 Toyota developed the AK10 prototype by reverse-engineering a Bantam GP Jeep. The half-ton truck features an upright front grille, flat front wheel arches that angled down and back like the FJ40, headlights mounted above the wheel arches on either side of the radiator, and a folding windshield. The AK10 is powered by the 2259 cc, 4-cylinder Type C engine from the Toyota Model AE sedan coupled to a three-speed manual transmission and two-speed transfer gearbox. Unlike the U.S. Jeep, few AK10's were ever used and photographs of them in the battlefield are rare., 113455=In 2000, Toyota celebrated the 50th anniversary of the Land Cruiser with commemorative models offered in several countries. Total global production to date was 3.72 million vehicles., 134853=In Japan, the Land Cruiser had a minor change in 2009 when it received the 4.6 L V8 1UR-FE engine and the gearbox was replaced with a 6-speed automatic.[30] Although the new 4608 cc 1UR-FE is smaller than the old 4663 cc 2UZ-FE engine, the power has been increased from 212 to 234 kW (288 to 318 PS; 284 to 314 hp), torque increased from 448 to 460 N·m (330 to 339 lb·ft) and fuel consumption improved from 6.6 to 7.1 km/L (19 to 20 mpg-imp; 16 to 17 mpg-US) (Japan 10·15 mode measurement)., 137220=For the 2013 model year, Toyota added all previously optional safety and luxury options as standard. The Land Cruiser now gets pushbutton start, HID headlights with beam level adjustment, a power moonroof, heated front and rear seats, a rear-seat DVD entertainment system, bluetooth, rearview camera with parking sensors, navigation system, HD radio and Entune. Another new feature is the Multi-terrain Select system which helps control wheelspin and brake lockup giving the selectable choices of: Rock, Rock & Dirt, Mogul, Loose Rock, and Mud & Sand., 4792=As of 2014, the Toyota Land Cruiser J200 is available in every market except Canada, North Korea, and South Korea., 8287=When the Imperial Japanese Army occupied the Philippines in 1941 they found an old Bantam Mk II Jeep and promptly sent it to Japan. The Japanese military authorities ordered Toyota to make a similar vehicle but to change the appearance. The resulting Model AK prototype led to the Yon-Shiki Kogata Kamotsu-Sha (四式小型貨物車 type 4 compact cargo-truck)., 116234=*This engine not released in Australia until 2000., 2689=Production of the first generation Land Cruiser began in 1951 (90 units) as Toyota's version of a Jeep-like vehicle.[2][3] The Land Cruiser has been produced in convertible, hardtop, station wagon, and utility truck versions. The Land Cruiser's reliability and longevity has led to huge popularity, especially in Australia where it is the best-selling body-on-frame, four-wheel drive vehicle.[4] Toyota also extensively tests the Land Cruiser in the Australian outback — considered to be one of the toughest operating environments in both temperature and terrain.[5][6][7] Main rivals include the Range Rover, Land Rover Discovery, Jeep Wrangler, Mitsubishi Pajero and Nissan Patrol. In Japan, the Land Cruiser is exclusive to Toyota Japanese dealerships called Toyota Store., 84750=The Land Cruiser 80 series was unveiled in October 1989 at the Tokyo Motor Show and launched in early 1990. It had swing-out back doors, which were replaced by a winch door in 1994. The Land Cruiser was nicknamed the Burbuja (Bubble) in Colombia and Venezuela due to its roundness, but it was officially released as Land Cruiser Autana in both countries. The name is a reference to the Tepui mesa Autana, a spectacular plateau and cave system along the Guiana Shield craton. Land Cruiser sales reached 2 million vehicles., 135591=In the Middle East, the Land Cruiser 200 series was introduced in late 2007 as a 2008 model, for 2008 to 2010 there was three engine choices, 179 kW (240 hp) 4.0L 1GR-FE petrol, 202 kW (271 hp) 2UZ-FE petrol and 162–173 kW (217–232 hp) 1VD-FTV 4.5 L turbo diesel.[31] Starting in 2011, the 270 kW (362 hp) 3UR-FE was offered along with the previous engines.[32] For 2012, the 1GR-FE gained dual VVT-i increased power to 202 kW (271 hp), the 4.7 L 2UZ-FE was dropped in favour of the new 227 kW (304 hp) 4.6 L 1UR-FE, and the 5.7 L and 4.5 L diesel were unchanged, although the latter was dropped in some markets.[33], 105593=In January 1998, the 100 series Land Cruiser was introduced to replace the 8-year-old 80 series. The 100 series was previewed in October 1997 as the \"Grand Cruiser\" at the 32nd Tokyo Motor Show. Development began in 1992, with final design being frozen in mid-1994.[20]}",
    "lastModified": "Sat, 25 Jul 2015 10:24:18 GMT",
    "textBeforeTable": "Land Cruiser with swing-out back-doors (HZJ81V), Japan  Facelift Toyota Land Cruiser (HZJ80R) GXL, Australia  Facelift Toyota Land Cruiser, US  Facelift Toyota Land Cruiser (FZJ80R) GXL, Australia  Pre-facelift Toyota Land Cruiser (FJ80R)",
    "textAfterTable": "R means Right hand drive version, excluding Japanese domestic market. J100 (1998–2007)[edit] J100 Pre-facelift Toyota Land Cruiser (US) Overview Also called Lexus LX 470 Production January 1998–2007 Assembly Japan: Toyota City (ARACO) Body and chassis Body style 4-door wagon Powertrain Engine 4.5 L 1FZ-FE I6 4.7 L 2UZ-FE V8 4.2 L 1HZ I6 diesel 4.2 L 1HD-T I6 turbo diesel 4.2 L 1HD-FTE I6 turbo diesel Transmission 4-speed automatic 5-speed automatic 5-speed manual Dimensions Wheelbase 2,850 mm (112.2 in)",
    "hasKeyColumn": true,
    "keyColumnIndex": 4,
    "headerRowIndex": 0
}