{
    "relation": [
        [
            "Patent application number",
            "20100165177",
            "20100310162"
        ],
        [
            "Description",
            "AUTOMATIC FOCUSING METHOD IN HIGH-NOISE ENVIRONMENT AND DIGITAL IMAGING DEVICE USING THE SAME - An automatic focusing method in a high-noise environment and a digital imaging device using the same are used for determining an object distance. The method includes taking two digital images at a farthest object distance and taking two digital images at a nearest object distance, under a first exposure condition and a second exposure condition; capturing digital images under the first exposure condition at a plurality of different object distances other than the farthest and nearest object distances; selecting at least two images captured at adjacent object distances to create a composite image; calculating an object distance of the composite image; calculating high-frequency signals of the second farthest object distance image, the second nearest object distance image, and the composite image in the focusing frame; determining from the images an object distance corresponding to the maximum high-frequency signal; and moving an automatic focusing lens to the object distance.",
            "COLOR INTERPOLATION METHOD FOR DIGITAL IMAGE - A color interpolation method for a digital image is described, includes the following steps. Edge information is generated according to the Bayer pattern. A Bayer pattern image is processed by a horizontal band-pass filter and a vertical band-pass filter to generate a horizontal edge signal and a vertical edge signal. A weight process implements a weight adjustment on the horizontal edge signal and the vertical edge signal to generate a luminance signal and outputs the luminance signal to a subtraction unit. The subtraction unit carries out an operation according to the Bayer pattern image and an output result of the weight process to generate a chrominance pattern. The chrominance pattern is compensated through a chrominance interpolation process, so as to generate image signal patterns of different colors. The image signal patterns of different colors are output to an adder for an add operation, thereby outputting a complete color image."
        ],
        [
            "Published",
            "07-01-2010",
            "12-09-2010"
        ]
    ],
    "pageTitle": "Liaw, TW - Patent applications",
    "title": "",
    "url": "http://www.faqs.org/patents/inventor/liaw-tw-5/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042991076.30/warc/CC-MAIN-20150728002311-00063-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 442320707,
    "recordOffset": 442283238,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Ming Jiun Liaw, Mialoi County TW 06-21-2012 HAND TOOL HAVING A RECIPROCALLY DRIVING MECHANISM - A hand tool having a reciprocally driving mechanism includes a driver, a body and a blade assembly. The driver has a driving shaft and a trigger. The driving shaft is controlled by the trigger and has a gear portion. The body has a driving gear having a teeth portion disposed on a top of the driving gear for engaging the gear portion. The driving gear has a stub eccentrically disposed on a bottom of the driving gear for driving a driving unit to move and to relatively drive a driven rod. The driven rod is connected with the blade assembly. The driving shaft is able to drive the blade assembly to reciprocally move for providing a higher torsion, a higher driving force, and a higher cutting speed, such that the hand tool is suitable for cutting a thicker workpiece. 20120151782 Published Description Patent application number Jian-Shiou Liaw, Taichung City TW 03-13-2014 PEPTIDE NANOTUBE DEVICE AND MANUFACTURING METHOD THEREOF - A peptide nanotube (PNT) device and method of manufacturing thereof are disclosed herein. The PNT device comprises PNTs composed of cyclo-(D-Trp-Tyr) peptide and a matrix, including biomolecules, complexed with the PNTs. The PNT device is biodegradable and biocompatible, as well as capable of being uptake by mammalian cells. Wherein, the biomolecules comprise peptides, proteins, nucleic acids including DNA, shRNA and siRNA,",
    "textAfterTable": "Ming Jiun Liaw, Miaoli TW Patent application number Description Published 20100165174 AUTOMATIC FOCUSING METHOD AND DEVICE IN HIGH-NOISE ENVIRONMENT - An automatic focusing method and device in a high-noise environment are used for determining a focusing distance between a digital imaging device and an object to be photographed. The automatic focusing method includes the steps of capturing M pre-photographed images at different object distances respectively; loading the pre-photographed images; superposing every N (N 07-01-2010 Ming-Jiun Liaw, Miaoli County TW Patent application number Description Published 20090316019 TONE ADJUSTMENT METHOD FOR DIGITAL IMAGE AND ELECTRONIC APPARATUS USING THE SAME - A tone adjustment method for a digital image and an electronic apparatus using the same are presented. The method includes steps. A digital image is loaded. A detail image layer and a primary image layer are generated according to the digital image. A tone mapping procedure is performed on the primary image layer, for generate a tone mapping layer. A detail gain lookup table is loaded and then a corresponding gain is looked up according to each pixel value in the primary image layer, for generate a detail gain adjustment layer. A detail gain control procedure",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}