{
    "relation": [
        [
            "ENGLISH",
            "Psychology",
            "Logic"
        ],
        [
            "ASSYRIAN",
            "Yolpan/naph/sha",
            "Yolpan/mlee/loo/ta"
        ],
        [
            "GENDER",
            "Masculine",
            "Masculine"
        ],
        [
            "EXAMPLE",
            "I'm learning Psychology in college: Ana bilyapa-win yolpan-naphsha gow bet-sobeh.",
            "Assyrians taught logic in the School of Edessa.: Atourayeh k'malpee-wa yolpan-mleelota gow madrashta d'Urhai."
        ]
    ],
    "pageTitle": "July 23, 2001",
    "title": "",
    "url": "http://www.zindamagazine.com/html/archives/2001/7.23.01/index.php",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042982502.13/warc/CC-MAIN-20150728002302-00109-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 831235527,
    "recordOffset": 831191855,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{48065=The 2001 Assyrian National Convention (August 31-September 3 in San Jose, CA) marks the first opportunity for corporate sponsorship of this year's impressive cultural and educational programs. If you are a business or an organization that wants to extend its marketing communications and its support for the preservation of Assyrian heritage, you are invited to consider promoting your company by sponsoring a session at this year's convention. Your sponsorship package will deliver high profile visibility on-site and integrate your brand in the convention-marketing program., 40530=As for the Assyrian Dance Party, I am ironing my handkerchief for Sargon Gabriel party in August. I'm just wondering if he has been influenced by this \"Away Away Owa\" wave or not?\", 14825=The only thing certain is that the nightmare is not going to be over anytime soon. In 1975 Mar Ishai Shimun was assassinated in his house in San Jose, California. The ill effects of that incident have since overwhelmed every successor to his chancellery in California. With the decision of the bishops at the recent synod, we can expect further finger-pointing and perhaps unique answers to the questions addressed earlier. As one parishioner in Phoenix told Zinda Magazine last week: \"Somebody's lying here and before we ALL get angry someone should break this silence and say something to the people.\", 13829=Rev. DeBaz knew of yet another Assyrian Universal Alliance representative and friend of Zaia Ismail. In fact, Sam Andrews is still an active member of the AUA and the leader of a group opposed to the re-election of John Nimrod to the position of Secretary General at the Marbella Congress in May 2001., 38954=Khega got together and the dance started. I waited for the 2nd song to join the Khegha; it never came. After the first song, Walter switched to Arabic and it took him a good half an hour to remember he is not in an Arab party and moved to another language, Persian. My Assyrian friends who could not speak Persian were wondering what was Walter saying by \"Dast Dast\" (clap clap). It took another 20 minutes for Walter to feel tired and go on a break and leave the show to the DJ. Light got dimmed and suddenly I found myself in an American Nightclub. I still had the handkerchief in my hand for the Assyrian dance, which by now was wrinkled, and non-recognizable. Around 12:30 after not seeing any sign of change at the \"Assyrian Nightclub\", my friends and I gave up and left the party., 13492=One month after the correspondence between Rev. DeBaz and the Patriarch who was then living in San Jose, Rev. DeBaz meets with an Assyrian Universal Alliance representative and the brother of the Patriarch's assassin, Zaia Ismail at the San Francisco Airport. A few months later, David Malik Ismail assassinates Mar Ishai Shimun., 30600=On July 10, the ADM leadership released a Declaration (see above) explaining that they \"were extremely patient in not declaring a position or passing a resolution on these elections until the last second in order to give ample time to have the situation rectified.\" Without any direct references to the BNDP election results the Declaration states that the ADM leadership reaffirms its \"position to reject the current situation that deals with the aspiration of our people and their nationalistic rights on a secondary level.\", 12775=On 15 September 1973 at the synod of the Bishops in Beirut the late Mar Ishai Shimun, patriarch of the Church of the East, was defrocked from all church ranks. While the late-Patriarch disagreed with that decision, the bishops of the church sent their representative, our very own Bishop Mar Aprim Khamis, to the U.S. as the administrator of the Church of the East in the United States and Canada., 56821=After the February revolution, there was an important move-ment among the Kurds toward a covenant between the free Kurds and free Russia. There were all kinds of meetings and they sent men to us for negotiations., 54399=Several years previously, before starting to serve the Russians, he was summoned before the Persian governor of Urmia on some charge. He handled this matter by arresting the governor himself and forcing the khans to recognize him, the Aga, as governor. The shah summoned Petros to come before him, but he didn't go, wisely believing that home is best; instead, he summoned the shah. Finally, the shah persuaded him to resign by sending him a medal. That's the kind of man this unofficial dragoman was. And I've forgotten something else: he wasn't a malik-the chieftain of ancient times-but one of the maliks, a man named Hamu, worked for him. Mar Shimun's faction looked down on Petros, considering him an upstart., 33413=The cuneiform inscriptions on the base date them to the 884-860 B.C. reign of King Assurnasirpal. Hussein said the king ordered the winged lions to be erected at the entrance to palaces and temples \"because he believed the sculptures prevented evil spirits from entering\"., 32675=\"Two identical statues were discovered by a British archaeological mission in 1850,\" said Ibrahim. \"One is currently on display in Mosul museum and the other in Britain.\", 14138=Rev. DeBaz also admitted that he had seen Mr. Ismail and Mar Khamis in July 1975, four months before the assassination of Mar Ishai Shimun. Currently Rev. DeBaz is an Archdeacon in the Diocesan Chancellery of the Eastern United States diocese., 89707=July 23, 1873, 9172=In December 1996, Mar Bawai Soro informed the readers of Zinda Magazine that Mar Aprim Khamis, had released Reverend Barkho Daoud from his pastoral duties in the North Hollywood Parish. Rev. Barkho was replaced with Rev. Rasho days after Mar Bawai's letter was published in Zinda Magazine. Rev. Barkho's followers never gave up supporting the renegade father and the division among the church's faithful in Southern California has never fully been appreciated by the Patriarchate. Today the outcome of such dissection can be felt even in the elections of the Assyrian American Association of Southern California., 25435=As it was mentioned in the declaration of 22 May 2001, in addition to our diligence and responsible efforts, we had exercised equal share of responsibility towards helping advance the democratic process in the area and strengthening the relationship, partnership and the feel for shared destiny for all the people of the area. We supported the success of municipal elections believing it is a step in the right direction for building the infrastructure of a civil society. We were extremely patient in not declaring a position or passing a resolution on these elections until the last second in order to give ample time to have the situation rectified., 13181=In early February 1975 Aprim DeBaz, Pastor of Mar Sargis Parish in Chicago, sent a telegram to Mar Ishai Shimun speaking against the Patriarch. The Patriarch had transferred Rev DeBaz from Chicago to Michigan in 1970 because he had allegedly embezzled money from his church in Chicago. Sounds familiar?, 34857=(ZNDA: Chicago) Nick Yohanna, 78, husband of the late Vera; father of Kenneth (Jeanine) and Nicholas Jr.; grandfather of Joseph and Alison; brother of Joseph, the late Alex, the late Lillian and the late Alice passed away in Chicago last week. Mr. Yohanna was a veteran of World War II and member of the Assyrian American AMVETS Post #5. His funeral service was held last Thursday at 10 a.m. at the Entombment Elmwood Cemetery. In lieu of flowers, his family requests donations to The Heart Fund. Info 773- 463-1510., 10611=In 1998 Mar Aprim was transferred from California to the diocese in Arizona. In October a certain Pakistani woman, Yasmin Khan, invites Mar Aprim Khamis to her apartment in Chicago's North Side for dinner. She then declares her love for the Assyrian bishop and tells him that she wants to marry him. According to court papers, Mar Aprim kisses her several times, but refuses Yasmin's offer., 8050=Bishop Mar Aprim Khamis lives in Phoenix and oversees the affairs of the Church of the East's Western U.S. Diocese. These include Modesto, Ceres, Turlock, Southern California, and Arizona. One might expect that all California parishes would be combined into one diocese. However, San Jose, San Francisco, and Sacramento parishes are organized under a different diocese called Western California. Seattle-Washington is also quietly tucked into this last group. The bishop presiding over the Western California diocese is Mar Bawai Soro., 98952=Sat-Tue November 17-20, 95475=For Tickets & Infor contact: Nora     408-927-7376 Yousif   408-261-9908 Fred      408-885-1500 Ninev    408-655-0245 Ghanim 408-243-6033, 23363=Press Release of the Expanded Meeting of the ADM Central Committee Arbil, North Iraq July 10, 2001, 14389=What does Mar Aprim know about the events leading to the assassination of Mar Ishai Shimun, including the meetings between the Church representatives and the Assyrian Universal Alliance only months before His Holiness' assassination in California? Who is Yasmin Khan and what were her true intentions in producing the videotapes of her sexual encounter with Mar Aprim? Were others involved in the production of those videotapes?, 34069=Courtesy of the Evening Post (July 18) (ZNDA: Welington) A new self-run refugee and migrant center opened in Wellington, New Zealand last week. The Alay Community Centre on Victoria Street aims to act as a drop-in center to connect new refugees and migrants with their own and other ethnic communities. Alay - which means \"to offer\" in Filipino - comprises the Refugee Council, Somali People's Trust, and the Cambodian, Assyrian and Latin American communities. Wellington City Council is paying the center's rent for the first year., 31871=Courtesy of Agence France-Presse (July 20), 8593=In February 1995, Zinda Magazine reported that Mar Aprim Khamis was assigned to the Diocese of the Western U.S., replacing Mar Bawai Soro. At the time Mar Aprim was the Bishop of the Diocese of the Eastern U.S. and Canada. Mar Bawai Soro was then appointed the Secretary General of the Inter-Church Relations and sent off to Vatican to complete his theological studies. Shortly after, it was revealed that Mar Aprim was brought in to handle his predecessor's mismanagement of funds in California. In no time, Mar Aprim gained and wielded influence throughout California., 37369=The show was supposed to start at 7:30 PM. We got there at 8:45 and to no surprise there were only close to 50 people present. After picking the best strategically located table, I started taking notes of the hall and the stage., 95000=7:00 PM Assyrian Church of the East Hall (Awana) 680 Minnesota Avenue, San Jose, 79833=Another evening I went to the home of Aga Petros for a dinner party, to celebrate Mar Shimun's being awarded the Order of St. Vladimir., 99735=Dr. Arian Ishaya - Urmia to Baquba: From the Cradle of Water to Wilderness  Dr. Eden Naby -: Zahrira d Bahra - The First Newspaper in Iran  Dr. K. Shakeri - Living in Purgatory: The Assyrians of Iran in the Twentieth Century  Mr. Ronald Thomaszadeh - Iranian Assyrians in the Azarbaijan Crisis of 1945-46  Discussant:   Prof. Houshang Chahabi - political science - Boston University , 53443=Aga Petros and his guerrilla band had rendered us great serv-ices in the campaign against Oramar. I accidentally saved his life a few days after my arrival in Urmia. Drunken soldiers of the Third Frontier Regiment had arrested him in the street and were threat-ening to bayonet him. I got him away from them by saying that I was arresting him; then I took him to my apartment. He spoke good French and English and bad Russian., 78385=\"You'll see. Our revolution will save the world.\" I'm now writing at midnight on August 9., 101214=Contact Dept of Ancient Near East 020 7323 8315 or email:  TheBSAI@aol.com, tel 01440 785244., 11010=Mar Aprim meets Yasmin once again on November 10 and engages in \"consensual kissing and touching.\" The next day, he receives a hand-delivered copy of a videotape as well as a threatening voice-mail message from Yasmin. The day after the delivery, Mar Aprim withdrew $17,000 in cash from his personal bank account, hands his Pakistani lover the money at her home and in exchange receives a videotape and numerous audio tapes. According to Chicago Police, over the next several months, the bishop gave Yasmin an additional $41,500. Yasmin Khan had secretly videotaped her sexual encounters with Mar Aprim Khamis., 28611=(ZNDA: California) During the 26 May Municipal Elections held in two northern KDP-controlled provinces of Iraq, Bet-Nahrain Democratic Party candidates were elected in Dohuk, Sarsang, Arbil, Ainkawa, Shaqlawa, and Diana. BNDP is an Assyrian political party affiliated with the Assyrian National Congress who recently ended its Seventh Annual General Assembly in Stockholm, Sweden., 11758=Adultery by a bishop leader, according to the canon's of the Church, constitutes a grievous violation of the law of chastity. The council of bishops may either excommunicate or disfellowship an adulterer. It was expected that at the recent synod of the Church in June 2001, Mar Aprim Khamis would be defrocked from all his bishopric duties. He was neither defrocked nor banished from the Church. His bishopric duties were only \"suspended\" for a period of less than two years. He will also remain on the Church's payroll during the suspension period. Zinda sources indicate that all attendees agreed to this resolution except one - Mar Bawai Soro., 28485=Courtesy of Bet-Nahrain Magazine, May 2001., 12423=Why did the bishops refrain from defrocking Mar Aprim Khamis at the last synod? Did the bishops and Mar Dinkha know something about Mar Aprim that prevented them from declaring a moral decision based on the Canons of the Church? The answer to this question is quite complex and rooted in a lurid nightmare that began 26 years ago in California., 104785=Zinda Magazine\u0099 Copyright © Zinda Inc., 2001 - All Rights Reserved - http://www.zindamagazine.com, 37613=The newly renovated Church of the East Hall in San Jose looked great and could offer plenty of space for Sheykhaneh, Tolama, Janima, etc. The lights around the stage and the equipment were giving the impression of quality and effort of the organizers. Finally around 9:30 the Band showed up. Wow, there were four of them and there was a Spanish Guitar Player. I am so used to the two-men bands at the Assyrian parties that it took a minute for me to believe my eyes. Around 10:00 pm, when the Hall was ¾ filled, finally the show started., 103289=Jackie Bejan (California), 7727=Last week His Holiness Mar Dinkha IV arrived in San Jose, California. Among other things on his itinerary, he will be meeting with local civic leaders, the divided Church of the East parishes in California, and perhaps discuss the future of his church's latest embarrassing situation, the fate of Mar Aprim Khamis., 16371=Dr. Efrem Yildiz was the second person to address the Conference, outside the three members of the human rights panel. Dr. Yildiz is a professor in the Department of Hebrew & Aramaic Studies, at Salamanca University, Spain. He is an Assyrian from Harbol, in southeast Turkey. He obtained his secondary education in Germany. For the next ten years, he studied Philosophy and Biblical Theology at the Pontifical University, Rome, culminating in a doctorate degree in 1997 (Ph.D. dissertation: \"La 'Teoria' Biblica battesimale secondo Mar Teodoro l'Interprete\"). According to a Georgian who was my Marbella roommate, for several of his years in Rome Dr. Yildiz was a classmate of Father 'Benny', who currently ministers to the Assyrian community in Tblisi. Not yet 35 years of age, Dr. Yildiz's phenomenal repertoire of languages includes Biblical Aramaic, Syriac, German, French, Spanish, Italian, Turkish, Hebrew, Greek and Latin., 93539=7:00 PM Assyrian Church of the East Hall (Awana) 680 Minnesota Avenue, San Jose, 11639=In May 2000, Zinda Magazine reported that Yasmin Khan was charged in a 10-count federal indictment in Chicago., 23556=The Central Committee of our ADM held an expanded meeting to study the general political situation on all aspects in order to establish plans for the upcoming period and the strategies to advance our just cause on both the internal and external avenues. The meeting discussed details the events associated with the recent municipal elections that took place in Arbil and Dohok on 26 May 2001 for which we clarified our position as outlined in our declaration of 22 May 2001. That declaration explained our diligent and responsible efforts that we had put forward for the sake of obtaining the affirmation for the legitimate national rights of our people in municipal offices in districts, counties, provinces and towns where our Syriac Chaldean Assyrian people historically have lived in., 10053=Last year Zinda Magazine published Mar Aprim's letter to the Census in which he stated \"We are convinced that to corrupt the norms of history would be an insulting act: a violation of history...We are Assyrians; therefore, we request that you keep the 'Assyrian' category separate.\" The Patriarchate of the Church later commented that it was unaware of the contents of Mar Aprim's letter. It neither accepted nor condoned Mar Aprim's actions toward the Census Bureau's decision to alter the category of Assyrian to Assyrian/Chaldean/Syraic., 40883=\"Quid novi? -- In a letter appearing in your June 12 edition, Jeff Atto (Michigan) expressed his unhappiness with Jean-Paul Sliva and Kelley Ross, and then some. In a June 19 response also in Zinda, Mr. Sliva's response concluded by citing my name (misspelled).}",
    "textBeforeTable": "Pump Up the Volume Babylonian Mythology [ http://library.thinkquest.org/25535/Babylonian.htm] Assyrian Surfing Posts   A SENTIMENTAL JOURNEY Part II Aissors = Assyrians Dzelamerok = Now Colemerik Solozh-bulak = Now Mahabad The exiled Aissors lived, starved, plundered, aroused the burn-ing hatred of the Persians. They visited the bazaars dressed in small felt caps, multicolored vests and wide pants made from scraps of calico and tied above the ankles with ropes. The Chris-tian religion, which bound the Aissors together, had long since grown slack and subsisted only as another means of differentiating them from the Moslems. There were religious missions in Urmia-Russian, German, French, American; they all pursued the souls of the poor Nestori-ans and, of course, played politics. The missions meddled in gov-ernment matters and they too constituted a sort of separate state. Each mission extended protection to its new converts. Because of this, there were some who changed their faith two or three times. In one family practically all the",
    "textAfterTable": "Bravo KATIE TOMA Who says Assyrian girls don't wear the pants? We know one Melburnian Assyrian girl in particular who definitely wears the pants - and she holds them up with a black belt. She is Katie Toina, master of the Goju-Rvu style of karate. Goju-Rvu is Japanese for 'soft-hard', a name which aptly describes not only this karate school's philosophy, but also Katie herself. On the outside, she is softly spoken, gentle and petite-that's her 'soft' side. Deep down, she is tough, independent and above all unexpectedly confident - and all this at only seventeen years of age. Katie first became interested in martial arts at the age of ten - when most girls that age are following the latest teeny-hopper fashions, Katie was studying Bruce Lee's life-story, his movies and his message: rise above your difficulties through determination and succeed in life .... in reality though, being beaten up by two girls at Brunswick High School was all the excuse she needed to take up karate. (Incidentally, this was all over a young man. Having three girls after him apparently drove him",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}