{
    "relation": [
        [
            "Year",
            "1998",
            "1999",
            "2000",
            "2001",
            "2002",
            "2003",
            "2004",
            "2005",
            "2006",
            "2007",
            "",
            "10 Year change",
            "Proportions in 1998",
            "Proportions in 2007"
        ],
        [
            "Academic",
            "6,417",
            "6,473",
            "6,528",
            "6,643",
            "6,557",
            "6,373",
            "6,026",
            "6,019",
            "5,996",
            "5,859",
            "",
            "-9%",
            "76%",
            "72%"
        ],
        [
            "Practitioner",
            "1,068",
            "965",
            "975",
            "972",
            "897",
            "810",
            "734",
            "676",
            "636",
            "605",
            "",
            "-43%",
            "13%",
            "7%"
        ],
        [
            "Emeritus",
            "219",
            "207",
            "207",
            "217",
            "239",
            "238",
            "245",
            "209",
            "198",
            "213",
            "",
            "-3%",
            "3%",
            "3%"
        ],
        [
            "Life",
            "102",
            "94",
            "117",
            "130",
            "138",
            "146",
            "151",
            "235",
            "264",
            "277",
            "",
            "172%",
            "1%",
            "3%"
        ],
        [
            "Associate",
            "636",
            "610",
            "621",
            "594",
            "688",
            "750",
            "847",
            "918",
            "1,001",
            "1,155",
            "",
            "82%",
            "8%",
            "14%"
        ],
        [
            "Total",
            "8,442",
            "8,349",
            "8,448",
            "8,556",
            "8,519",
            "8,317",
            "8,003",
            "8,057",
            "8,095",
            "8,109",
            "",
            "-4%",
            "100%",
            "100%"
        ]
    ],
    "pageTitle": "Bob Jensen's Additions to Bookmarks Oct 1 - Dec 31, 2007",
    "title": "",
    "url": "http://www.trinity.edu/rjensen/book08q3.htm",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042982502.13/warc/CC-MAIN-20150728002302-00189-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 751687371,
    "recordOffset": 751437389,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{15417=Jack Ciesielski, an accountant and publisher of the Analyst's Accounting Observer, says accounting under IFRS tends to lead to higher earnings. He examined filings from 137 foreign companies whose shares traded in the U.S. in 2006. That was the final year that U.S. regulators required these companies to translate their books into GAAP from IFRS. Mr. Ciesielski says 63% of the companies reported higher earnings under the international standard, and the median increase was 11.1%., 17131=Mr. Cox will likely step down following the November presidential election and the next administration could have different priorities. But several observers say it's likely the shift to IFRS will still occur., 45916=Humor Between March 1 and March 31, 2008 --- http://www.trinity.edu/rjensen/book08q1.htm#Humor033108, 41366=2. Property tax deduction The bill will temporarily allow property owners who do not itemize their deductions to claim a standard property deduction of up to $500 for individuals and $1,000 for joint filers. The deduction is available only in taxable years beginning in 2008. Earlier versions of this provision has barred the deduction for taxpayers in local jurisdictions that raised property tax rates in 2008, but no such limitation was included in the final bill., 91470=I made brief responses directly onto the summary you sent to me. My main point is for you to look into the Accounting Court idea. Especially note http://www.nysscpa.org/cpajournal/2004/304/perspectives/nv6.htm, 9355=\"The Rush to International Accounting,\" by Floyd Norris, The New York Times, September 11, 2008 --- http://norris.blogs.nytimes.com/2008/09/11/the-rush-to-international-accounting/, 93932=A NYT reporter asked me to comment on the Treasury Department’s final report on the accounting/auditing profession --- http://www.ustreas.gov/press/releases/hp1159.htm, 10874=Related party disclosures are just one more example of where IFRS tends to be diverging from the quality of financial reporting that results in the relatively low cost of capital we currently enjoy in the United States. China is a highly distinct economy and any attempt to craft disclosure rules that respond to the peculiar needs of its economy and society are likely to clash with what is best for U.S. investors. (So much for the idea that one single set of accounting standards can work well the world over!) As the second-largest economy in the world, China is already demonstrating its willingness to use its economic clout to shape IFRS to his own needs, which as I have stated, would not just deprive investors of relevant and reliable information, but could further increase the risk of loss due to fraud. \"IAS 24: Related Party Disclosures Are Too Transparent to Suit China,\" by Tom Selling, The Accounting Onion, September 10, 2008 --- http://accountingonion.typepad.com/theaccountingonion/2008/09/ias-24-related.html, 30897=I encourage members of the American Accounting Association to submit comments on Blan's short \"Red Light\" commentary to the AAA Commons --- http://commons.aaahq.org/pages/home Click on the menu item \"Roles\" and then click on \"Teaching.\" Scroll down to the \"Journal of Backroom Accounting,\" Volume 1, 2008., 46670=Humor Between May 1 and May 31, 2008 --- http://www.trinity.edu/rjensen/book08q2.htm#Humor053108, 11723=The SEC intends in 2011 to check progress on its conditions, such as independent funding for the international standards board. If it is satisfied, it would recommend starting the shift to the international standards for all U.S.-listed companies in 2014. SEC Commissioner Elisse Walter, a Democrat, called the plan momentous, but said the U.S. should vote for the switch in 2011 \"if and only if\" the conditions are met., 90656=One of my best friends and former professor and former Deputy Chief Accountant at the SEC submitted a long input letter. He allowed me to serve it up at my Website --- http://www.trinity.edu/rjensen/Bailey2008.htm Although I don’t agree with him on some issues, you perhaps should seek Andy Bailey’s input on this as well --- jabaile@uiuc.edu Andy’s input is much more complete than my few comments in this email message., 33945= The Inca empire stretched 2500 miles down the coast of South America and into the Andes mountains in the interior.  Francisco Pizzaro landed in 1532 with fewer than 70 men and within fewer than 6 months had conquered the empire and begun shipping gold home. , 393=From IASPlus on September 19, 2008 --- http://www.iasplus.com/index.htm, 44033=Peter, Paul, and Barney: An Essay on 2008 U.S. Government Bailouts of Private Companies --- http://www.trinity.edu/rjensen/2008Bailout.htm, 39348=W. Blan McBride earned a PhD in accounting years ago from the University of Illinois and was inspired earlier to study accounting history by Professor Flowers at the University of Alabama even though Blan's academic background is in engineering. Blan was on the accounting faculty at Florida State University and was instrumental in luring me (Bob Jensen) down to Tallahassee in 1978. However, shortly thereafter Blan left FSU and made millions via consulting, including such things as re-designing a flawed bullet proof vests for the U.S. Army. He made additional millions executing successful turnarounds of failing businesses., 101283=New Bookmarks Year 2008 Quarter 3:  July 1 - September 30 Additions to Bob Jensen's Bookmarks Bob Jensen at Trinity University, 39824=The election is available for the taxpayer's first taxable year that ends after March 31, 2008. Taxpayers making the election must use the straight line method with respect to property that would otherwise be eligible for bonus depreciation., 43349=Grant Thornton provides an update on the housing bill that was signed recently by President Bush with over $15 billion in tax incentives and several important revenue offsets. The bill's tax provisions are aimed at both businesses and individuals and will have a significant impact on a large number of taxpayers. The changes will affect real estate investment trusts (REITs), provide incentives for first-time homebuyers, change tax rules for housing bonds and credits, allow some taxpayers to accelerate AMT and R&D credits, and, beginning in 2010, impose new payment card reporting requirements. A detailed description of the bill's tax provisions follows., 98252=Bob Jensen's New Bookmarks on September 30, 2008 Bob Jensen at Trinity University , 101293=This is a blistering indictment of the unregulated OTC market for derivative financial instruments and the million and billion dollar deals conceived in investment banking.  Among other things, Partnoy describes Morgan Stanley’s annual drunken skeet-shooting competition organized by a “gun-toting strip-joint connoisseur” former combat officer (fanatic) who loved the motto:  “When derivatives are outlawed only outlaws will have derivatives.”  At that event, derivatives salesmen were forced to shoot entrapped bunnies between the eyes on the pretense that the bunnies were just like “defenseless animals” that were Morgan Stanley’s customers to be shot down even if they might eventually “lose a billion dollars on derivatives.”   This book has one of the best accounts of the “fiasco” caused almost entirely by the duping of Orange County ’s Treasurer (Robert Citron) by the unscrupulous Merrill Lynch derivatives salesman named Michael Stamenson. Orange County eventually lost over a billion dollars and was forced into bankruptcy.  Much of this was later recovered in court from Merrill Lynch.  Partnoy calls Citron and Stamenson “The Odd Couple,” which is also the title of Chapter 8 in the book.Frank Partnoy, Infectious Greed: How Deceit and Risk Corrupted the Financial Markets (Henry Holt & Company, Incorporated, 2003, ISBN: 080507510-0, 477 pages)Frank Partnoy, Infectious Greed: How Deceit and Risk Corrupted the Financial Markets (Henry Holt & Company, Incorporated, 2003, ISBN: 080507510-0, 477 pages), 22574=QUESTIONS:  1. (Introductory) Summarize the proposed change in financial reporting standards discussed in an SEC roundtable on Wednesday, August 27. 2. (Introductory) Who is criticizing the proposed process for change to IFRS by U.S. companies? What are the concerns? 3. (Advanced) \"The U.S. accounting system is based on detailed rules, while the international system expects companies to follow broad principles.\" Give one example of a bright-line rule in U.S. accounting standards that is set out in terms of broad principles under IFRS. 4. (Advanced) Refer to your answer to question 3 above. As a professional accountant, do you think that you would tend to provide more flexibility under the U.S. or international accounting standards to clients wanting to consider alternative treatments in their financial statements? Support your answer. 5. (Advanced) The SEC is considering the funding source for standards setter IASB, as part of its requirements for moving to IFRS as the basis of accounting for U.S. companies. What was the recent change in the source of funding for U.S. standards setter FASB? Why does this issue impact acceptability of the accounting standards themselves?  , 47141=Humor Between July 1 and August 31, 2008 --- http://www.trinity.edu/rjensen/book08q3.htm#Humor083108 , 45411=Humor Between February 1 and February 29, 2008 --- http://www.trinity.edu/rjensen/book08q1.htm#Humor022908   , 19816=The SEC's proposal would allow some large multinational companies to report earnings according to international accounting beginning in 2010. The SEC estimates at least 110 U.S. companies would qualify based on their market capitalization, among other factors. The agency also laid out a road map by which all U.S. companies would switch to International Financial Reporting Standards, or IFRS, beginning in 2014, at the expense of U.S. Generally Accepted Accounting Principles, the guiding light of accountants for decades., 20954=\"SEC Moves to Pull Plug On U.S. Accounting Standards,\" by Kara Scannell and Joanna Slater, The Wall Street Journal, August 28, 2008; Page A1 --- http://online.wsj.com/article/SB121985665095476825.html?mod=djem_jiewr_AC, 46421=Humor Between April 1 and April 30, 2008 --- http://www.trinity.edu/rjensen/book08q2.htm#Humor043008, 47798=Peter, Paul, and Barney: An Essay on 2008 U.S. Government Bailouts of Private Companies --- http://www.trinity.edu/rjensen/2008Bailout.htm, 2955=September 11, 2008 message from Kathryn Hansen [kathryn.hansen@VERIZON.NET], 8562=His term ends in October. He can serve until a new member is named by the S.E.C., but you can bet that will be soon., 94671=Peter, Paul, and Barney: An Essay on 2008 U.S. Government Bailouts of Private Companies --- http://www.trinity.edu/rjensen/2008Bailout.htm, 92331=From: Jensen, Robert Sent: Friday, September 26, 2008 4:07 PM To: ' Cc: Jensen, Robert Subject: RE: treasury report on auditing, 98843=September 30, 2008, 88259=September 26, 2008 HP-1158, 5046=What does this mean? Cox clearly has the power here, possessing the full weight of presidential backing. He is using the S.E.C. to pitch U.S. GAAP in the garbage can. I doubt that anything can be done at this time to derail him and his efforts. Niemeier has been ousted from his position of influence. Yesterday’s remarks will change nothing. I think this to be unfortunate. Only a tidal wave of public opinion can stop the lemming march toward the precipice of I.F.R.S. adoption. There will no such tidal wave. The technicality of accounting rules is simply too arcane for the American public to care about., 71422=Closing Comment What’s really needed is an Accounting Court much like operates in The Netherlands, although it will be much more difficult to operate in the U.S. because of the much greater size of the U.S. I still like Spacek’s basic idea of an Accounting Court. Especially note --- http://www.nysscpa.org/cpajournal/2004/304/perspectives/nv6.htm, 23522=SUMMARY: On Wednesday, the Securities and Exchange Commission (SEC) held a roundtable, which began a process that could ultimately lead all publicly listed American companies to follow IFRS instead of U.S. GAAP as promulgated by the Financial Accounting Standards Board (FASB). The process is planned in two steps: \"The SEC's proposal would allow some large multinational companies to report earnings according to international accounting beginning in 2010. The agency also laid out a road map by which all U.S. companies would switch to IFRS beginning in 2014.\", 46905=Humor Between June 1 and June 30, 2008 --- http://www.trinity.edu/rjensen/book08q2.htm#Humor063008, 43653=\"Housing bill summary includes many tax provisions,\" AccountingWeb, August 2008 --- http://www.accountingweb.com/cgi-bin/item.cgi?id=105782, 99167=September 30, 2008, 25070=From The Wall Street Journal Accounting Review on August 29, 2008, 99097=August 31, 2008, 44886=Humor Between January 1 and January 31, 2008 --- http://www.trinity.edu/rjensen/book08q1.htm#Humor013108  , 42282=Any taxpayer who has not had ownership in a principal residence within three years of a home purchase will qualify for the credit, but the property cannot be purchased from a related person. The credit is available for property bought on or after April 9, 2008, and before July 1, 2009. If the home is purchased in 2009 before July 1, the credit can still be applied to 2008 taxes at the election of the taxpayer., 13330=The International Accounting Standards Board, the London-based body that sets the international standards, is currently funded by companies and auditing firms, while its U.S. counterpart, the Financial Accounting Standards Board, is essentially funded with a tax on companies. The SEC says finding a stable and independent source of funding for the IASB, founded in 2001, is one of the conditions it has set for going ahead with the switch. The SEC and other regulators have agreed to create a monitoring body to fund and oversee IASB., 47379=Humor Between September 1 and September 30, 2008 --- http://www.trinity.edu/rjensen/book08q3.htm#Humor093008, 4360=September 11, 2008 reply from Tom Selling [tom.selling@GROVESITE.COM], 94218=The Accounting Profession Needs an Accounting Court More Than Ever My reactions to the Treasury Department’s 2008 Report on the Accounting Profession, 3579=http://www.sec.gov/news/speech/2008/spch082708ebw.htm }",
    "TableContextTimeStampAfterTable": "{727870=In this instance, while the SEC complaint implied that Heinen believed the proper grant date was Aug. 29, but when Jobs complained about the vesting schedule, and had wanted some of the options in the grant to be “pre-vested” meaning he would have been able to exercise them right away. As a November 2001 deadline for properly reporting the expense neared, Heinen became concerned about the delay, the SEC complaint said, and looked for a data where Apple’s share price was close to the $17.83 price of Aug. 29. She chose Oct. 19, when the stock was at $18.30, but less than $21.01, its price on the actual grant date of Dec. 18, thus creating for Jobs, an instant paper profit., 374949=Most Frequent Appearing Institutions in The Accounting Review: 1926-2005, 722651=\"Keep Private Equity Away From Our Banks,\" by Andy Stern, The Wall Street Journal, July 7, 2008; Page A13 --- http://online.wsj.com/article/SB121538911268431155.html?mod=djemEditorialPage, 801071=4.) Click on \"Read the full text\" of UnitedHealth's Nov. 8 filing with the SEC on the right-hand side of the on-line article. What Form number did UnitedHealth file? Summarize the implications of the depth of the options backdating problem found at this company., 592967=1998, 288784=Humor Between May 1 and May 31, 2008 --- http://www.trinity.edu/rjensen/book08q2.htm#Humor053108, 167882=Humor Between February 1 and February 29, 2008 --- http://www.trinity.edu/rjensen/book08q1.htm#Humor022908   , 840751=From Jim Mahar's blog on July 1, 2008 --- http://financeprofessorblog.blogspot.com/, 698723=RELATED ARTICLES:  FASB Signals Stricter Rules for Banks' Loan Vehicles by David Reilly May 02, 2008 Page: C1  , 372190=August 10, 2008 message from David Albrecht [albrecht@PROFALBRECHT.COM], 621050=2007, 611688=2004, 540679=Among them is David Down, managing director of the San Diego office of KPMG, one of the nation's largest accounting firms. He's a 1976 accounting graduate of San Diego State. He likes the enthusiasm of graduates of his alma mater., 347683=Under current law, the federal estate-tax exemption this year is $2 million, and the top rate is 45%. (Transfers from one spouse to the other typically are tax-free.) Next year, that exclusion is set to rise to $3.5 million, with the rate remaining at 45%. In 2010, the federal estate tax is scheduled to disappear completely, only to return again in 2011 with an exclusion of $1 million., 796387=Because of your interest in standard setting, Tom, you should especially read the following timeless piece: Accounting history lecture worth noting --- http://newman.baruch.cuny.edu/digital/saxe/saxe_1978/baxter_79.htm His last line mentions the most important thing about “principles.”, 168509=Humor Between January 1 and January 31, 2008 --- http://www.trinity.edu/rjensen/book08q1.htm#Humor013108  , 55816=Disclosures about Credit Derivatives and Certain Guarantees: An Amendment of FASB Statement No. 133 and FASB Interpretation No. 45; and Clarification of the Effective Date of FASB Statement No. 161 FASB, September 12, 2008 --- http://www.fasb.org/pdf/fsp_fas133-1&fin45-4.pdf, 682694=The fraud-ridden Bank of Credit and Commerce International (BCCI) was closed down in July 1991. Nearly 1.4 million depositors lost some part of their $8bn savings, though some UK savers were bailed out by the taxpayer funded depositor protection scheme. The UK government failed to appoint an independent inquiry to investigate the role of auditors, but a US Senate report published in 1992, raised numerous questions about the conduct of auditors. Eventually, in 2006, without commenting on any of the findings of the US Senate, a disciplinary panel of the UK accountancy profession found some faults with the audits conducted by the UK arm of Price Waterhouse (now part of PricewaterhouseCoopers). The firm was fined £150,000 and ordered to pay hearing costs of £825,000. At that time the firm had UK income of around £2bn., 703500=VMware, the leading provider of software designed to help companies cut back on technology costs, said it expects 2008 revenue to be \"modestly below the previous guidance of 50% growth over 2007.\", 114331=I wrote the following on December 1, 2004 at http://www.trinity.edu/rjensen//theory/00overview/theory01.htm#AcademicsVersusProfession, 32059=Absurd claims are being made that the 2008 U.S. economic meltdown might have been avoided without fair value accounting But then maybe it's not so clear cut for fair value accounting in the real world:  Fair Value Theory vs. Fair Value Fraud, 332638=July 18, 2008 reply from Barbara W. Scofield, University of Dallas [scofield@GSM.UDALLAS.EDU], 166333=Humor Between May 1 and May 31, 2008 --- http://www.trinity.edu/rjensen/book08q2.htm#Humor053108, 742753=\"The Potential Crisis at Fannie Mae,\" Comstock Funds, August 11, 2005 --- http://snipurl.com/Fannie133 , 48825=IN THE weeks before Bear Stearns, a Wall Street bank, collapsed in March, nervous investors scanned not just its share price for a measure of its health, but the price of its credit-default swaps (CDSs), too. These once-obscure instruments, now widely enough followed that they have even earned a mention on an American TV crime series, clearly indicated that the firm’s days were numbered. The five-year CDS spread had more than doubled to 740 basis points (bps), meaning it cost $740,000 to insure $10m of its debt. The higher the spread, the greater the expectation of default., 813241=The IRS examined the results from this tax cutting experiment and found that the money came back in a flood. More than 800 U.S. corporations repatriated $362 billion from foreign operations. Congress's Joint Committee on Taxation had predicted closer to $200 billion. These dollars are now being invested in the U.S., rather than remaining in Europe or China. This capital infusion may be one reason that U.S. business investment rose 9.6% in 2005 – the highest rate in more than a decade., 78699=The study was extensive, examining more than 15,000 ratings of 6,827 separate firms from late 2005 to early 2007. (Many of the corporations are rated by more than one of the governance companies.) It looked for correlations among the ratings and five basic performance metrics: restatements of financial results, shareholder lawsuits, return on assets, a measure of stock valuation known as the Q Ratio, and Alpha—a measure of an investment’s stock price performance on a risk-adjusted basis., 321015=JOURNAL OF INFORMATION SYSTEMS Vol. 18, No. 2 Fall 2004 pp. 127-131, 113794=The (Random House) dictionary defines \"academic\" as \"pertaining to areas of study that are not primarily vocational or applied , as the humanities or pure mathematics.\" Clearly, the short answer to the question is no, accounting is not an academic discipline. Joel Demski, \"Is Accounting an Academic Discipline?\" Accounting Horizons, June 2007, pp. 153-157, 105664=I write in response to your editorial, \"FASB's Lawyer Bonanza\" (Review & Outlook, Aug. 7). The Financial Accounting Standards Board is not proposing that companies change their current accounting for the cost of ongoing litigation. Rather, our proposal would require additional disclosure in the footnotes to the financial statements. It is a proposal, not a \"demand,\" and is subject to our normal extensive public due process., 733673=You can read an old transcript of one of Jim’s 1998 speeches at http://www.trinity.edu/rjensen/acct5341/speakers/Tape31.htm, 794414=Probably most discouraging is that our younger accounting faculty have virtually no scholarship in accounting history. They were too busy studying math and econometrics in doctoral programs and are too busy applying it trying to get something published after they were awarded their PhDs. They could care less about MacNeal, Hatfield, George O. May, DR Scott, Sprague, Kohler, Trueblood, Chambers, Sterling, Zeff, Edwards and Bell, Canning, Paton, Littleton, Baxter, David Solomons, Hopwood, Previts, Marino, Tinker, Paul Williams (we now appreciate his historical scholarship on the AECM), and classical accounting historians in Europe, especially in the U.K. and Holland. Interestingly, however, their accountics mentors like Joel Demski and Bill Beaver are well grounded in history. Joel is especially up on managerial accounting history much more so than me, because I don’t recall much about the cost accounting and governmental accounting greats like Andy Barr., 846245=\"There Is No 'The Economy',\" by Zachary Karabell, The Wall Street Journal, June 30, 2008; Page A13 --- http://online.wsj.com/article/SB121478256977914431.html?mod=djemEditorialPage, 599208=2000, 44478=During 2007, Ernst & Young collected fees (see page 43) of $31,307,000 from Lehman Brothers, compared to $29,451,000 for 2006. The fees for 2005 and 2004 were $25,324,000 and $24,748,000 respectively. Over the last four years, Ernst & Young collected over $110m in fees, of which nearly $14m is for advice on tax and other consultancy services., 378778=                    Period: 1986-2005, 829747=That's Enron-tainment:  Positive review on the new Enron movie Alex Gibney's freewheeling -- and terrifically entertaining -- documentary, newly entered into national release, puts faces and voices to the men and women who've become household names since the scandal broke four years ago. Some of these former executives have already enjoyed (or endured) extensive face time on TV. But now they're characters in the context of a film that's been adapted from the book of the same name by Bethany McLean and Peter Elkind, and the big screen lends new immediacy to their appearance. That's not to say Mr. Gibney's documentary turns its characters into real people. Given the scale of the human and economic damage, of the deception and very possibly the pathological self-deception, there may not be any real people behind those scrupulously straight faces. Still, \"The Smartest Guys in the Room\" gives us the same sort of perverse pleasure that's been a staple of \"60 Minutes\" over the years -- watching world-class crooks tell world-class lies. \"That's Enron-tainment: Company's Chief Cheats Give 'Smartest Guys' Energy:  Documentary Tracing Firm's Fall Is Provocative, Proudly Partisan; 'Machuca': Classy Class Drama,\" The Wall Street Journal, April 29, 2005; Page W1 --- http://online.wsj.com/article/0,,SB111473473039520299,00.html?mod=todays_us_weekend_journal, 112162=Bob Kaplan's 1986 presentation lamented the fact that researchers using the case method could no longer get their research published in TAR or other leading accounting research journals. He also lamented that innovations generally had their seminal roots in discoveries of practitioners rather than researchers publishing in the leading academic accounting research journals. Whereas practitioners once took a keen interest in academic accounting research, this interest waned to almost nothing., 605448=2002, 344290=Even though investment advisers say most clients aren't doing anything different, some should be thinking about making changes. \"For an investor with a low-basis, large concentration in a publicly traded company, a family business or some other illiquid asset, taking steps to diversify in 2008, before a potential capital-gains rate increase, could result in significant tax savings,\" says Dan Schrauth, wealth adviser with JPMorgan Private Bank in San Francisco. Many clients are taking \"a serious look\" at the potential for higher capital-gains rates as a relevant factor in determining when to diversify out of a concentrated position, he says., 165743=Humor Between June 1 and June 30, 2008 --- http://www.trinity.edu/rjensen/book08q3.htm#Humor083108, 774186=When Republicans captured the House of Representatives in November 1994--for the first time since the Eisenhower era--securities-litigation reform was assured.  In a January 1995 speech, Levitt outlined the limits on securities regulation that Congress later would support: limiting the statute-of-limitations period for filing lawsuits, restricting legal fees paid to lead plaintiffs, eliminating punitive-damages provisions from securities lawsuits, requiring plaintiffs to allege more clearly that a defendant acted with reckless intent, and exempting \"forward looking statements\"--essentially, projections about a company's future--from legal liability., 670508=By the way, when most of us want to locate Jim's online directory, we most likely go to Google and type in \"Hasselback Directory.\" Unfortunately, the first thing that pops up is a 1999 version. I wish the above link would pop up first., 576492=Updates:  Deloitte's Initiative for advancement and retention of female professionals From Smart Stops on the Web, Journal of Accountancy, July 2008, 329869=July 16, 2008 message from Brady, Joseph [bradyj@LERNER.UDEL.EDU], 763361=The process of transferring receivables to a new company and issuing new bonds became known as securitization, which became a major part of the structured finance industry . . . One of the most significant innovations in structured finance was a deal called the Collateralized Bond Obligation, or CBO. CBOs are one of the threads that run through the past fifteen years of financial markets, ranging from Michael Milken to First Boston to Enron and WorldCom. CBOs would mutate into various types of credit derivatives --- financial instruments tied to the creditworthiness of companies --- which would play and important role in the aftermath of the collapse of numerous companies in 2001and 2002., 802082=\"HealthSouth Agrees to $445 Million Settlement,\" AccountingWeb, October 2, 2006 --- http://www.accountingweb.com/cgi-bin/item.cgi?id=102629, 756081=In February 1985, the United States Financial Accounting Standards Board (FASB) --- the private group that established most accounting standards (in the U.S.) --- asked whether banks should begin including swaps on their balance sheets, the financial statements that recorded their assets and liabilities . . .since the early 1980s banks had not included swaps as assets or liabilities . . . the banks' argument was deeply flawed. The right to receive money on a swap was a valuable asset, and the obligation to pay money on a swap was a costly liability., 354918=Earlier this week, the California State Automobile Association, an affiliate of the national AAA, announced it is closing all three of its call centers in the state at a loss of 900 jobs. Spokeswoman Cynthia Harris was quite blunt about the reason: \"It costs more to do business in California than other states.\" Her group will now will be answering calls from California motorists from new centers in lower-cost Arizona and Oklahoma. . . . The state's Democrats not only insist on higher taxes, but are blocking a proposal from Gov. Schwarzenegger to limit future spending increases to the growth of the state's population and inflation in an attempt to cushion the impact of future economic downturns. \"I think that we have to be very, very careful about tying the hands of future governors and future legislatures,\" says Democratic Assemblyman Dave Jones. Apparently, he and his colleagues prefer tying the hands of California businesses so they feel compelled to flee the state. John Fund, The Wall Street Journal, July 20, 2008 --- http://online.wsj.com/article/SB121647516449767887.html?mod=djemEditorialPage, 811076=Mr. Bachus's office issued the letter Friday. It calls for the FASB to delay any decisions on accounting for asset-backed securities until January 2010, saying that would be a \"more measured and realistic deadline\" than the FASB timetable., 159318=August 21, 2008 reply from Neal Hannon [nhannon@GMAIL.COM], 36963=KPMG has also just come out with a briefing sheet on a proposal from the IASB: This IFRS Briefing Sheet summarises the Draft Document Measuring and disclosing the fair value of financial instruments in markets that are no longer active, which was posted on the International Accounting Standards Board’s Website on 6 September 2008. The Draft Document represents a summary of discussions of the IASB’s Expert Advisory Panel., 751464=2003 The improper use of hedge accounting (contrary to FAS 133 rules) to amortize gains -- and thus smooth ragged ups and downs in quarterly earnings -- was Freddie's downfall. As a June 25 press release deadpanned: \"Certain capital market transactions and accounting policies had been implemented with a view to their effect on earnings in the context of Freddie Mac's goal of achieving steady earnings growth.\" Translation: Steady earnings help Freddie convince investors and lenders that management has its eye on the ball. They also help ward off politicians who might point to volatility as a reason to tighten regulation or even break Freddie up. The company's quest for smooth earnings, plus its admitted lack of accounting expertise and weak management controls, proved to be a fateful combination. That became clear to PricewaterhouseCoopers auditors soon after they replaced longtime Freddie auditor Andersen LLC in 2002. The new audit team soon discovered suspicious hedge accounting involving Treasury securities. \"Freddie Mac Attack Critics are calling for greater oversight -- or even a breakup,\" Business Week, July 7, 2003 --- http://www.businessweek.com/magazine/content/03_27/b3840057.htm, 77550=Institutional Shareholder Services, or ISS, the best known of the advisory companies, was sold for a reported $45 million in 2001. Five years later, ISS was sold again; this time for $553 million to the RiskMetrics Group. The enormous appreciation in value underscores the importance placed by the investing public on ratings and advisories issued by ISS and its major competitors, including Audit Integrity, Governance Metrics International (GMI), and The Corporate Library (TCL)., 316042=Texas Society of CPAs (TSCPA) was awarded a 2008 Gold Circle Award from the American Society of Association Executives (ASAE) & The Center for Association Leadership. The award recognizes innovative ideas and achievement in association communication campaigns. TSCPA was given the Gold Circle Award in the micro-web site category, for its interactive student site Destination CPA., 84047=\"Deloitte Launches Corporate Governance Web Site,\" SmartPros, June 12, 2007 --- http://accounting.smartpros.com/x57989.xml , 110028=\"Case Study Research in Accounting,\" by David Cooper and Wane Morgan, Accounting Horizons, Volume 22, No. 2, June 2008, pp. 159-178 --- http://www.atypon-link.com/AAA/doi/abs/10.2308/acch.2008.22.2.159, 633639=Proportions in 2007, 726428=Apple was required to report the $18.9 million difference as a stock-based compensation charge in regulatory filings, but didn’t. The commission had accused Heinen of backdating the options to Jan. 17 when the price of Apple’s stock was lower, and, was also accused of having directed underlings to prepare documents showing that the grant had been properly approved by Apple’s board of directors when it had not., 724510=\"Nancy Heinen, Former Apple General Counsel, Settles Backdating Charges,\"  by Arik Hesseldahl, Business Week, August 14, 2008 --- Click Here, 579814=Jensen Comment Nearly 20 years ago, Deloitte embarked on a \"Women's Initiative\" to help female employees break the glass ceiling --- http://www.deloitte.com/dtt/section_node/0,1042,sid=2261,00.htm, 42314=Ever since the 1998 collapse of Long Term Capital Management (LTCM) and its rescue by the US Federal Reserve, it has been acknowledged that derivatives are very difficult to value. In this case Nobel prize winners in economics could not work out the value of such financial instruments. Derivatives are central to the demise of Lehman. Its annual accounts mention derivatives contracts with a face value of $738bn and fair value of $36.8bn., 24341=Skills and knowledge should be required as part of the pre-certification education of CPAs Prompted by New York’s forthcoming adoption of the 150-hour requirement to sit for the CPA exam, the NYSSCPA’s Quality Enhancement Policy Committee drafted a white paper to encourage discussion on what skills and knowledge should be required as part of the pre-certification education of CPAs. This white paper, which was approved by the Society’s Board of Directors, is presented here, along with additional commentary from the NYSSCPA’s Higher Education Committee. Quality Enhancement Policy Committee Sharon Sabba Fierstein, Chair, August 2008 --- http://www.nysscpa.org/cpajournal/2008/808/infocus/p26.htm, 858092=Humor Between May 1 and May 31, 2008 --- http://www.trinity.edu/rjensen/book08q2.htm#Humor053108, 311731=One visit to the altar was enough for the Millers when they joined hands July 1, 1938, at the Little Brown Church in the Vail in Nashua, Iowa. They met as senior accounting students at the University of Iowa., 765276=The first CBO was TriCapital Ltc., a $420 million deal sold in July 1988. There were about $900 million CBOs in 1988, and almost $ $3 billion in 1989. Notwithstanding the bad press junk bonds had been getting, analysts from all three of the credit-rating agencies began pushing CBOs. Ther were very profitable for the rating agencies, which received fees for rating the various pieces., 719516=Other lenders have been considering the use of similar \"bad-bank\" structures as a way to cleanse their balance sheets of shaky loans. In April, Peter Raskind, chairman and CEO of National City Corp., said the Cleveland bank \"could imagine...several different variations of good-bank/bad-bank kinds of structures\" to help shed problem assets., 674006=SUMMARY: In a recent report filed in response to a request by two senators, Carl Levin of Michigan and Byron Dorgan of North Dakota, the Government Accountability Office (GAO) found that \"...at least 23% of large U.S. corporations don't pay federal income taxes in any given year.\" Large corporations are defined as companies generating at least $50 million in sales or with $250 million in total assets. But smaller firms also frequently report no income tax liability: \"in a given year at least 60% of all U.S. corporations studied ... reported no federal income-tax liability during the period...1998 to 2005. In the study, the GAO analyzed samples of Internal Revenue Service data covering both publicly traded and closely held corporations, including U.S.-based and foreign corporations operating in the U.S.\", 699170=\"What's Good for Banks... Fannie, Freddie Should Have to Meet New Capital Rules,\" by David Reilly, The Wall Street Journal, July 9, 2008; Page C18 --- http://online.wsj.com/article/SB121555820908737335.html?mod=djem_jiewr_AC, 563832=\"Accounting Plan Would Allow Use of Foreign Rules,\" by Stephen Labaton, The New York Times, July 5, 2008 --- http://www.nytimes.com/2008/07/05/business/05sec.html?_r=1&oref=slogin, 803334=A judge must approve the settlement, which is nearly the same as a preliminary settlement that was reached in February., 25223=Mary-Jo Kranacher, Editorial, CPA Journal, August 2008 --- http://www.nysscpa.org/cpajournal/2008/808/essentials/p80.htm, 4990=Board Member Niemeier and Enforcement Director Modesti Speak at NYSSCPA/FAE Conference --- http://www.pcaobus.org/News_and_Events/Events/2008/09-10.aspx, 709206=It is hard to tell just how much impact Fannie's and Freddie's problems have had on mortgage rates. But if the two companies had more capital and were able to buy more mortgages for their own portfolios, mortgage rates could be as much as 0.25 percentage points lower, says Mahesh Swaminathan, a mortgage strategist at Credit Suisse . . .  Kenneth Rosen, chairman of the Fisher Center for Real Estate and Urban Economics at the University of California, Berkeley, says mortgage rates could rise by 0.25 to 0.50 percentage points if Fannie Mae and Freddie Mac could no longer continue operating as they do today. But \"the U.S. government has no choice but to support to [the] fullest extent necessary, Fannie or Freddie,\" he adds. \"There is no alternative.\" Ruth Simon, \"Questions and Answers About Fannie, Freddie,\" The Wall Street Journal, July 11, 2008; Page A12 --- http://online.wsj.com/article/SB121573420539844247.html?mod=todays_us_page_one, 679965=\"The UK's economic elites cannot effectively regulate themselves: The disciplining of major accounting firms is still little more than a cynical public relations exercise,\" by Prim Sikka, The Guardian, July 4, 2008 --- http://www.guardian.co.uk/commentisfree/2008/jul/04/economy, 696719=QUESTIONS:  1. (Introductory) Define the terms \"off-balance-sheet vehicles,\" \"special purpose entities\", and \"variable interest entities\". 2. (Advanced) What U.S. reporting standards address the accounting and reporting requirements for these entities? What are the major accounting issues in this area? 3. (Advanced) What accounting change was recently announced by the Financial Accounting Standards Board (FASB)? (Hint: You may access information about FASB project activities through its Project Activities link on its web page. In particular, information on the Transfers of Financial Assets project is available at http://www.fasb.org/project/transfers_of_financial_assets.shtml#objective 4. (Advanced) How can banking entities, impacted by FASB decision-making, highlight their concerns to the FASB? Hint: see comment letters related to the FASB's project on the web page cited under question 3 above. Also, an unsolicited letter from Citigroup, Inc., addresses many of the banking entities' issues and is available at http://www.fasb.org/ocl/1082-VIU/52150.pdf 5. (Advanced) How can changes in accounting for special purpose entities result in the need to increase a banking entity's capital? In your answer, describe the need for banks to maintain certain levels of capital. 6. (Advanced) In the article, the author concludes that \"...a failure to properly account for off-balance-sheet vehicles helped cause the financial crisis. Watering down prudent rule changes isn't going to relieve it.\" Explain these statements. Do you agree or disagree with them? Support your answer.  , 730314=TrackBack URL for this entry: http://blogs.businessweek.com/mt/mt-tb.cgi/11392.1234112593 , 826447=That’s what makes the flurry of European green-eyeshade films so exciting. When Mr. Veber made “The Dinner Game” in 1998, he cast Jacques Villeret as a bumbling Finance Ministry drone who assembles matchstick models of the Eiffel Tower and the Arc de Triomphe in his spare time. Though the civil servant ultimately prevails over those whose weekly “dinner games” are no more than a cruel ruse to humiliate goofballs like him, the movie basically adheres to the tired theme of the Accountant as Punch Line., 704841=\"Mortgage Giants Face Pressure Over Capital,\" by James R. Hagerty, Gregory Zuckerman, and Craig Karmin, the Wall Street Journal, July 11, 2008; Page A1, 663705=July 14, 2008 reply from glen.gray@CSUN.EDU, 801655=--- RELATED ARTICLES --- TITLE: Guidelines Set for How to Audit Stock Options REPORTER: Siobhan Hughes PAGE: A10 ISSUE: Oct 18, 2006 LINK: http://online.wsj.com/article/SB116114078518696161.html?mod=djem_jiewr_ac, 860877=Humor Between July 1 and August 31, 2008, 348561=Jensen Comment Both candidates are in favor of greatly extending health care to over 40 million uninsured. Whether this is funded by direct taxes or by mandates to employers, this will be an added form of tax in the broad sense. For example, local schools that must provide additional  insurance benefits to part-time workers will burden local taxpayers. Similarly a restaurant must greatly increase menu prices to pay for part-time worker medical coverage.. An even bigger problem is the unemployed that have no employer to pick up the tab. Another is the partly employed. A person working 25 hours per week on each of two jobs is still considered a part-time worker and probably receives no health care benefits at the present time. A an added problem arises with the fully employed workers for very small businesses and small town government agencies that will likely fold if forced to pay health care benefits. An enormous arises with job applicants with serious preconditions in health that are terribly expensive to a health care insurance plan such as job applicants with AIDS, seriously ill children, drug dependencies, need of organ transplants, etc. Still another compounding problem arises with the explosion in demand for health care workers at all levels who will be needed to provide for over 40 million previously uninsured. Taxpayers one way or another will have to pick up the tab for educating and training these workers. Still another problem is that taxpayers will have to build many new hospitals and medical clinics. In other words the costs keep piling up for any type of universal health care, and these costs will likely be unmentioned burdens in the political campaigns of 2008. And then we begin to think about the costs of fighting global warming and environmental protection all of the candidates are pushing without serious programs for funding these expenditures., 737103=How the Gatekeepers Failed in Their Responsibilities to Protect the Public from Corporate and Banking Fraud Brooksley Born, chair of the Commodity Futures Trading Commission --- suggested that government should at least study whether some regulation might make sense, a stampede of lobbyists, members of Congress, and other regulators --- including Alan Greenspan and Robert Rubin --- ran her over, admonishing her to keep quiet.  Derivatives tightened the connections among various markets, creating enormous financial benefits and making global transacting less costly --- no one denied that.  But they also raised the prospect of a system-wide breakdown.  With each crisis, a few more dominos fell, and regulators and market participants increasingly expressed concerns about systematic risk --- a term that described a financial-market epidemic.  After Long-Term Capital collapsed, even Alan Greenspan admitted that the financial markets had been close to the brink.   Frank Partnoy, Infectious Greed (Henry Holt and Company, 2004, Page 229), 813774=Many Democrats, liberal groups and even some economists in the Bush Treasury opposed the measure four years ago, predicting it would lose revenue and merely be a tax holiday for profitable corporations. The Joint Tax Committee estimators also blundered again by predicting a mere $2.8 billion in revenue gains in the first year and then big losses after 2005. As always, they underestimated how tax reductions change behavior. The tax incentive raised $18 billion in 2005, and revenues have continued to exceed estimates. Instead of getting 35% of nothing, as U.S. companies kept their cash abroad, the Treasury took in 5.25% of the hundreds of billions the companies brought home., 16631=The report says a $32 billion special dividend by Microsoft Corp. in 2004 spurred many of the big banks to sell products that would allow their hedge-fund clients to avoid paying the associated taxes., 839710=The SEC and the New York Attorney General announced on August 15 that investors, small businesses, and charities who purchased auction rate securities (ARS) through and Wachovia Capital Markets, LLC (collectively Wachovia) could receive over $8.5 billion to fully restore their losses and liquidity through a preliminary settlement that has been reached with Wachovia., 657584=July 17, 2008 reply from tracey@aaahq.org, 799037=TITLE: UnitedHealth Expects Probe to Result in 'Greater' Charges REPORTER: Steve Stecklow and Vanessa Fuhrmans DATE: Nov 09, 2006 PAGE: B1 LINK: http://online.wsj.com/article/SB116299996219517252.html?mod=djem_jiewr_ac  TOPICS: Accounting, Accounting Changes and Error Corrections, Sarbanes-Oxley Act, Securities and Exchange Commission, Stock Options, 166670=Humor Between April 1 and April 30, 2008 --- http://www.trinity.edu/rjensen/book08q2.htm#Humor043008, 140934=But then the IASB let us down in 2008 on IFRS 3(R) --- http://accountingonion.typepad.com/theaccountingonion/2008/06/ifrs-3-fall-short-of-convergence-again.html, 816016=Senator John Ensign of Nevada, the author of the 2005 holiday bill, is proposing to do the same again for one year to stimulate the economy. As a rule, we don't like temporary tax cuts because they don't provide permanent incentives. But the 2005 holiday was an exception that proved the folly of current policy., 726886=Heinen’s lawyer, Cris Areguedas had argued that Heinen hadn’t backdated the options to the Jan. 17 date as the SEC alleged, but had been laboring under the impression that the grant had been properly approved by Apple’s board in late 2000, and was only pushing back the grant date, which was legal under rules in force at the time. Her intent, Arguedas said, had been not to defraud Apple investors but to help the company avoid the appearance of having “spring-loaded” the options in advance of a an important Steve Jobs keynote address at the 2001 MacWorld Expo in San Francisco., 27385=FBI Corporate Fraud Chart in August 2008 --- http://www.aicpa.org/pubs/jofa/aug2008/ataglance.htm#Chart1.htm, 803983=The settlement does not include Ernst & Young, UBS, Scrushy or any former HealthSouth officer who entered a guilty plea or was convicted of a crime in connection with the company's financial reporting activities ending in March 2003., 771563=Cheryl Dunn requested that I do a review of my favorites among the “books that have influenced [my] work.”   Immediately the succession of FIASCO books by Frank Partnoy came to mind.  These particular books are not the best among related books by Wall Street whistle blowers such as Liar's Poker: Playing the Money Markets by Michael Lewis in 1999 and Monkey Business: Swinging Through the Wall Street Jungle by John Rolfe and Peter Troob in 2002.  But in1997.  Frank Partnoy was the first writer to open my eyes to the enormous gap between our assumed efficient and fair capital markets versus the “infectious greed” (Alan Greenspan’s term) that had overtaken these markets., 52136=\"Hedge Funds in Swaps Face Peril With Rising Junk Bond Defaults,\" by David Evans, Bloomberg, May 20, 2008 --- http://www.bloomberg.com/apps/news?pid=20601109&sid=aCFGw7GYxY14&refer=home  , 853561=\"Accounting rule-makers putting markets at risk,\" by Michael Starkie, Financial Times,.June 12 2008 --- Click Here, 167276=Humor Between March 1 and March 31, 2008 --- http://www.trinity.edu/rjensen/book08q1.htm#Humor033108, 788698=\"The Siskel and Ebert of Financial Matters: Two Thumbs Down for the Credit Reporting Agencies\" by Frank Partnoy, Washington University Law Quarterly, Volume 77, No. 3, 1999 --- http://ls.wustl.edu/WULQ/   , 100625=SUMMARY: The FASB has proposed a change to disclosures associated with contingent liabilities, including litigation liabilities, with a document entitled \"Disclosure of Certain Loss Contingencies-an amendment of FASB Statements No. 5 and 141\" and a comment period that ended August 8, 2008. This proposed Statement would replace and enhance the disclosure requirements in FASB Statement No. 5, Accounting for Contingencies, for all outstanding contingencies, both those recognized on the balance sheet and those contingencies that would be recognized as liabilities if the criteria for recognition in paragraph 8 of Statement 5 were met; it as well applies to contingent liabilities from business combinations. The proposal would \"...(a) expand the population of loss contingencies that are required to be disclosed, (b) require disclosure of specific quantitative and qualitative information about those loss contingencies, (c) require a tabular reconciliation of recognized loss contingencies to enhance financial statement transparency, and (d) provide an exemption from disclosing certain required information if disclosing that information would be prejudicial to an entity's position in a dispute.\" In the proposal, the FASB states that the project was taken on because \"investors and other users of financial information have expressed concerns that disclosures about loss contingencies under the existing guidance ... do not provide adequate information to assist users of financial statements in assessing the likelihood, timing, and amount of future cash flows associated with loss contingencies.\" Clearly, the WSJ Opinion page editors disagree with this assessment (see the related article) and FASB Chairman Bob Herz responds to their Op-Ed piece., 169701=Humor Between September 1 and September 30, 2008, 765831=With the various types of structured-finance deals, a trend began of companies using Special Purpose Entities (SPEs) to hide risks. From an accounting perspective, the key question was whether a company that owned particular financial assets needed to disclose those assets in its financial statements even after it transferred them to an SPE. Just as derivatives dealers had argued that swaps should not be included in their balance sheets, financial companies began arguing that their interest in SPEs did not need to be disclosed . . . In 1991. the acting chief accountant of the SEC, concerned that companies might abuse this accounting standard, wrote a letter saying the outside investment had to be at least three percent (a requirement that helped implode Enron and its auditor Andersen because the three percent investments were phony):, 326894=The Enron story is likely to appear in accounting classrooms for years, much as Equity Funding's scandal did throughout the 1970s and beyond. Enron's downfall contains many useful lessons and this book may be the best at detailing them for accounting and auditing students. It is also a great morality play with important ethical lapses and lessons. Interestingly, the book begins with a Statement of Values reprinted from Enron's 1998 annual report. It also describes the Code of Ethics at Enron and how Lay often touted the integrity of the company's leaders. Amazing., 671129=The elusiveness of a meaning for 'true and fair' in an accounting context stems from a lack of meaning for that quintessentially British phrase in a capital markets context. Financial reporting is about producing information: is it possible that truth telling could not result in fair reporting? Answer: no way. Therefore, 'and fair' adds nothing whatsoever; and besides, everyone learns in Accounting 101 that accrual accounting and 'truth' don't mix anyway. The point is that cunning Tweedie, like Soc Gen and its auditors, can construe 'true and fair' to mean anything and at any time. Just like the emperor in the cautionary fairy tale, IFRS wears no clothes; his royal highness and subjects are deceived by the Tweedie tailor (pun intended) to disbelieve their eyes, and to behave as if IFRS is adorned with some noble British bromide. Tom Selling, \"The Fairy Tale of 'True and Fair View' and a Modest Proposal for Real 'Core Principles',\" The Accounting Onion, July 10, 2008 --- http://accountingonion.typepad.com/theaccountingonion/2008/07/the-core-prin-1.html, 661350=July 12, 2008 reply from Dennis Beresford [dberesfo@TERRY.UGA.EDU], 548215=August 19, 2008 message from MERLOT Webmaster [barb@merlot.org], 75870=Peter, Paul, and Barney: An Essay on 2008 U.S. Government Bailouts of Private Companies --- http://www.trinity.edu/rjensen/2008Bailout.htm, 158891=Jagdish Gangolly ( gangolly@csc.albany.edu ) Department of Accounting & Law, School of Business Department of Informatics, College of Computing & Information State University of New York at Albany 1400 Washington Avenue, Albany NY 12222 Phone: 518-442-4949, 789224=Michael Lewis, Liar's Poker: Playing the Money Markets (Coronet, 1999, ISBN 0340767006), 112754=Joel Demski's presentation defended mathematical model building and analysis as the cornerstone of accounting as a a pure \"academic discipline.\" I would not describe Joel as an evangelist of positivism relative to the extremes of Watts and Zimmerman. Joel typically has had less to say about positivism than he has about mathematical model building and economic information theory applied to accountancy. In this regard I would describe Joel as an ardent defender of accountics. Joel admitted in 1986 that it was very difficult to pinpoint discoveries in academe that were noteworthy in the practicing profession. However, he claimed that this was not a leading purpose of academic accounting research., 757810=1988 Infectious Greed:  How Deceit and Risk Corrupted the Financial Markets  (Henry Holt and Company, 2003, Page 219, ISBN 0-8050-7510-0), 664581=Glen L. Gray, PhD, CPA Accounting & Information Systems, COBAE California State University, Northridge 18111 Nordhoff ST Northridge, CA 91330-8372 818.677.3948 818.677.2461 (messages) http://www.csun.edu/~vcact00f , 575453=Paul Pacter's IASB Update Presentation in Anaheim on August 4, 2008, 46759=Time and time again it has been shown that the basic audit model is faulty. Private sector auditors cannot be independent of the companies that they audit. This fundamental faultline has not been addressed by the post Enron reforms. In addition, the ex-post financial audits are too late and cannot alert financial regulators of problems. The financial regulators have a wider remit and are also concerned with the financial health of the whole system. These shortcomings were recognised after the 1929 stock market crash. The draft legislation that created the SEC in the 1930s contained a provision making the SEC the auditor for public companies, but under pressure from corporate interests, legislation was diluted., 309811=From: Dennis Beresford [mailto:dberesfo@terry.uga.edu] Sent: Tuesday, July 08, 2008 12:24 PM To: Jensen, Robert Subject: Re: [Fwd: Re: FYI], 837529=GHL (later renamed NXGen Holdings, Inc.) is an installer of GPS-based navigation equipment. According to the Commission's complaint, in early 2006, President and CEO Hew-Len and stock promoter Abellan arranged for GHL to issue millions of shares of GHL stock to offshore entities designated by Abellan. In April 2006, the SEC alleges, Abellan caused the dissemination of \"The Street Stock Report,\" a full-color glossy mailer sent to millions of U.S. addresses urging investors to purchase GHL stock quickly to see huge trading profits. Around the same time, Hew-Len issued nine press releases over a nine-week period hyping the company. Among other things, according to the SEC, the press releases made false claims about contracts with large customers, fraudulently touting millions of dollars in potential revenues. Following this concerted promotion campaign, GHL's stock price doubled and trading volume spiked nearly 1500%. Abellan and his entities sold their GHL stock holdings for profits in excess of $13 million. The stock, which reached a high of nearly $9 per share at the height of the scheme, now trades at under a penny., 133691=\"Book Excerpt: The Numerati by Stephen Baker By building mathematical models of its own employees, IBM aims to improve productivity and automate management,\" by Stephen Baker, Business Week, August 28, 2008 --- http://www.businessweek.com/magazine/content/08_36/b4098032904806.htm?link_position=link2, 683581=The above is a small sample of what passes for self-regulation in the UK accountancy profession. The sinking ship of self-regulation has now been refloated, albeit with a few deckchairs rearranged. The government has delegated the investigation of major audit failures to the Financial Reporting council (FRC), a statutory regulator dominated by corporate and accounting elites. In August 2005, it announced an investigation into the audits of MG Rover conducted by Deloitte & Touche. So far no report has materialised., 131746=TACKLING SMALL BUSINESS TECH ISSUES www.technology.inc.com From Smart Stops on the Web, Journal of Accountancy, July 2008 This new site from Inc. magazine offers information on technological devices and trends of all stripes. Read articles on hardware, software, e-business, managing technology, networking, security, and telecom and wireless. “Expert Corner” features posts by guests in areas such as content management, and “Technology Blog” provides news and views on topics ranging from America’s broadband efforts to notebook Blu-ray DVD players to cell phones. Plus, business leaders share firsthand experiences in Q&A format in the “Tech Talk” section., 310884=In 1988, Clemmons and her husband, Charlie, gifted her parents a special display of 50 Liberty Gold pieces minted in 1938. In 1998, she and Charlie met the couple in Seattle so they could eat dinner in the revolving restaurant at the Space Needle and look down on Fourth of July fireworks., 237138=Humor Between June 1 and June 30, 2008 --- http://www.trinity.edu/rjensen/book08q3.htm#Humor083108, 153422=August 19, 2008 reply from Patricia Doherty [pdoherty@BU.EDU], 49448=Once again, CDS spreads on Wall Street banks are pushing higher, having fallen in March after the Federal Reserve extended emergency lending facilities to them. Reportedly one firm, Morgan Stanley, is monitoring its own CDS spreads to assess the market’s perception of its corporate health; if they rise too high, it intends to cut back its lending. Whether the CDS market is accurately assessing the creditworthiness of Lehman Brothers, trading on August 20th at 376 bps, double the level in early May, will be the next test of its worth., 319791=For a much more challenging assignment, you might consider for future semesters, \"The Snowball: Warren Buffett and the Business of Life,\" by Alice Schroeder, a former E&Y senior manager, former FASB project manager, and leading financial analyst on Wall Street. It will be published on September 29 and will be the definitive work on America's leading investor of the past fifty years or so., 555898=July 22, 2008 message from Dan Stone, Univ. of Kentucky [dstone@UKY.EDU], 784978=Frank Partnoy, FIASCO: Guns, Booze and Bloodlust: the Truth About High Finance (Profile Books, 1998, 305 Pages), 779258=The book Infectious Greed has chapters on other capital markets and corporate scandals.  It is the best account that I’ve ever read about Bankers Trust the Bankers Trust scandals, including how one trader named Andy Krieger almost destroyed the entire money supply of New Zealand.  Chapter 10 is devoted to Enron and follows up on Frank Partnoy’s invited testimony before the United States Senate Committee on Governmental Affairs, January 24, 2002 --- http://www.senate.gov/~gov_affairs/012402partnoy.htm, 797935=\"UnitedHealth Agrees To Pay $912 Million To Settle Suits,\" by Vanessa Fuhrmans, The Wall Street Journal,  July 3, 2008; Page B1 --- http://online.wsj.com/article/SB121499485991822623.html?mod=todays_us_marketplace, 181577=The flamboyant Sen. John Randolph (1773-1833) was an early master. His famed sallies, like good poetry, present unforgettable images: \"He is a man of splendid abilities but utterly corrupt,\" he said of Secretary of State Edward Livingston. \"Like a rotten mackerel by moonlight, he shines and stinks.\" \"Never was ability so much below mediocrity so well rewarded,\" he said of one political appointee. \"No, not even when Caligula's horse was made consul.\" Randolph had a flamboyant 20th-century counterpart in Norman Mailer, who is supposed to have said, \"Gerald Ford was unknown throughout America. Now he's unknown throughout the world.\", 789667=John Rolfe and Peter Troob, Monkey Business: Swinging Through the Wall Street Jungle (Warner Books, Incorporated, 2002, ISBN: 0446676950, 288 Pages), 659174=Tracey Tracey Sutherland AAA Executive Director 2007 AAA Key Indicators - http://aaahq.org/about/financials/KeyIndicators8_31_07.pdf, 36218=First, it is not very credible for financial institutions to argue that marking to market is inappropriate only during downturns. Why were these views not aired during the bull market in asset prices from 2004 to 2007?, 352302=Despite the rhetoric, that's not just on \"rich\" individuals. It's also on a lot of small businesses and two-earner middle-aged middle-class couples in their peak earnings years in high cost-of-living areas. (Obama's large increase in energy taxes, not documented here, would disproportionately harm low-income Americans. And, while he says he will not raise taxes on the middle class, he'll need many more tax hikes to pay for his big increase in spending.) . . . Now trade. In the primaries, Sen. Obama was famously protectionist, claiming he would rip up and renegotiate the North American Free Trade Agreement (Nafta). Since its passage (for which former President Bill Clinton ran a brave anchor leg, given opposition to trade liberalization in his party), Nafta has risen to almost mythological proportions as a metaphor for the alleged harm done by trade, globalization and the pace of technological change. Yet since Nafta was passed (relative to the comparable period before passage), U.S. manufacturing output grew more rapidly and reached an all-time high last year; the average unemployment rate declined as employment grew 24%; real hourly compensation in the business sector grew twice as fast as before; agricultural exports destined for Canada and Mexico have grown substantially and trade among the three nations has tripled; Mexican wages have risen each year since the peso crisis of 1994; and the two binational Nafta environmental institutions have provided nearly $1 billion for 135 environmental infrastructure projects along the U.S.-Mexico border. History teaches us that high taxes and protectionism are not conducive to a thriving economy, the extreme case being the higher taxes and tariffs that deepened the Great Depression. While such a policy mix would be a real change, as philosophers remind us, change is not always progress. Michael J. Boskin (Stanford University Economics Professor),\" Obamanomics Is a Recipe for Recession,\" The Wall Street Journal, July 29, 2008 --- http://online.wsj.com/article/SB121728762442091427.html?mod=djemEdito, 644753=Numbers of Doctoral Degrees from 2000-2004, 35150=September 23, 2008 message from Patricia Walters [patricia@DISCLOSUREANALYTICS.COM], 692835=But, as the companies’ stock prices decline, wary investors have begun charging higher premiums for those loans. Since January, that premium, measured by the difference between what the companies pay for debt and what the United States government pays, has more than doubled, to nearly nine-tenths of a percentage point for Fannie Mae. Spread over billions of dollars in borrowing, that increase will cost the companies dearly., 191981=MINT CONDITION: Male, 1932, high mileage, good condition, some hair, many new parts including hip, knee, cornea, valves. Isn't in running condition, but walks well., 812713=For those who still claim that tax rates don't matter to economic decisions or U.S. competitiveness, we present Exhibit A: the 2004 American Jobs Creation Act., 714705=In January, Astoria Financial Corp. told investors that its pile of nonperforming loans had grown to about $106 million as of the end of last year. Three months later, the thrift holding company said the number was just $68 million., 342389=For example, the Illinois senator wants to raise the top ordinary income-tax rate, now 35%, to 39.6%. For 2008, the top federal rate of 35% in most cases applies to taxable income of more than $357,700. (The 2009 income threshold won't be announced until later this year.), 178741=But insults, unlike imperfect man, are not created equal. In March, Samantha Power, a scholar-activist then on the Barack Obama campaign, called Hillary Clinton a \"monster.\" \"You just look at her and think, 'Ergh,'\" she elaborated. It is encouraging that she was thrown from the campaign, but her insult was only a disgrace because of its insipidity., 768132=Europeans had learned about the dangers of derivatives in 1993 when Metallgesellschaft, a German conglomerate, lost $1.4 billion on oil derivatives. The losses at Metalgesellschaft illustrated the difficulty of distinguishing between hedging (reducing risk) and speculating (increasing risk with the hope of higher returns), and also foreshadowed future problems in the energy markets, including the electricity crisis in California and the related collapse of Enron. Unfortunately, few people saw the parallels., 630410=Proportions in 1998, 805424=This incoming open-sharing tide really puts pressure on universities that sponsor expensive research journals! And what will SSRN do if the research is open shared by the authors' own universities? Will SSRN develop a two-tier pricing system where open access research papers are free but not those from universities that have not yet signed on to open access? Open-access advocates predicted that the move last February by Harvard University’s Faculty of Arts and Sciences and, later, by its Law School to require free online access to all faculty members’ scholarly articles would prompt other universities to adopt similar policies. The movement has not exactly snowballed, but another institution did just join in.Last week Stanford University’s School of Education revealed that it would require faculty members to allow the university to place their published articles in a free online database.The school’s faculty passed a motion unanimously — just as Harvard’s two faculties had — on June 10. A faculty member and open-access advocate, John Willinsky, made the policy public last week at the International Conference on Electronic Publishing, in Toronto. A video of his presentation is available. Lila Guterman, Chronicle of Higher Education, June 30, 2008 --- http://snipurl.com/stanfordopenshare  [chronicle_com] , 50030=There are some who doubt whether the CDS market is a reliable barometer of financial health. Though its gross value has ballooned in size from $4 trillion in 2003 to over $62 trillion, many of the contracts written on individual companies are thinly traded, lack transparency, and are prone to wild swings., 99314=From The Wall Street Journal Accounting Weekly Review on August 22, 2008, 344070=One New Jersey investor says she recently purchased her first muni bond -- $5,000 of hospital bonds. She says part of the reason was her expectation of higher tax rates in 2009., 587473=http://aaahq.org/AM2008/concurrent08.htm, 571566=From WebCPA, July 31, 2008 --- http://www.webcpa.com/article.cfm?articleid=28636, 241480=And that's the way it was on September 30, 2008 with a little help from my friends., 155038=August 20, 2008 reply from Jagdish Gangolly [gangolly@CSC.ALBANY.EDU], 118695=Apparently Cooper and Morgan in 2008 are trying to infect us with the pesky vocational virus as well as lending value to research with sample sizes of one that Zimmerman and other positivists would not accept as legitimate accounting research from Kaplan or anybody else., 578286=Women Partners in the Big 4 Accounting Firms For the tenth consecutive year, Deloitte & Touche USA LLP tops the Big Four accounting firms in percentage of women partners, principals and directors, according to Public Accounting Report's 2006 Survey of Women in Public Accounting. The survey revealed that Deloitte's percentage of women partners, principals and directors is currently 19.3 percent, surpassing that of KPMG (16.8 percent), Pricewaterhouse Coopers (15.8 percent) and Ernst & Young (13.5 percent). Deloitte has held this lead every year since the inception of the survey in 1997, according to Jonathan Hamilton, editor, Public Accounting Report. SmartPros, December 26, 2006 --- http://accounting.smartpros.com/x55948.xml, 316487=Selected from a record 373 entries representing 248 organizations, 19 associations were recently honored with a 2008 Gold Circle Award. Recipients were chosen for demonstrating excellence in communications in the categories of print publishing, writing, electronic publishing, media relations and emerging communication vehicles., 560076=Personal Finance Helpers (more than ever, the public is worried about personal investment and savings) From Smart Stops on the Web, Journal of Accountancy, July 2008, 187578=\"He uses statistics as a drunken man uses lamp-posts... for support rather than illumination.\" - Andrew Lang (1844-1912), 161623=From The Wall Street Journal Accounting Weekly Review on September 19, 2008, 567712=The oversight board was created by the Sarbanes-Oxley law of 2002 in response to the accounting scandals at Enron and other large companies. The law requires the board to inspect regularly all accounting firms that certify the financial results of companies whose shares are sold in the United States., 579246=Women now make up more than 60 percent of all accountants and auditors in the United States, according to the Clarion-Ledger. That is an estimated 843,000 women in the accounting and auditing work force. AccountingWeb, \"Number of Female Accountants Increasing,\" June 2, 2006 --- http://www.accountingweb.com/cgi-bin/item.cgi?id=102218, 320330=July 16, 2008 reply from Bob Jensen, 745607=The range of financial malfeasance and manipulation was fast. Energy companies, such as Dynegy, El Paso, and Williams, did the same complex financial deals (particularly using SPEs) Andy Fastow engineered at Enron. Telecommunication s firms, such as Global Crossing and WorldCom, fell into bankruptcy after it became clear they, too, had been cooking their books. Financial firms were victims as well as aiders-and-abettors. PNC Financial, a major bank, settled SEC charges that it abused off-balance-sheet deals and recklessly overstated its 2001 earnings by more than half. A rogue trader at Allfirst Financial, a large Irish bank, lost $750 million in a flurry of derivatives trading that put Nick Leeson of Barings to shame. And so on, and so on., 321287=Many books describe the Enron scandal. This book's special niche is twofold. First, it focuses on the cast of characters responsible--these are the smartest guys, or perhaps the greediest guys, on the planet. Second, the authors provide a detailed explanation of the finance and accounting issues behind the company's downfall. They can do so because McLean, in addition to her reporting skill, was also a Goldman Sachs analyst who was among the first to question Enron's business model and practices (see McLean's [March 5, 2001, pages 122-125] Fortune article: \"Is Enron Overpriced?\")., 585560=In some ways this makes sense if they'd carefully read \"The Lotus Eater\" short story written by Somerset Maugham in 1945 --- http://en.wikipedia.org/wiki/The_Lotus_Eater It's a very well-written piece about an accountant who retires on the equivalent of a finite-term annuity and then outlives his retirement income and savings. There are now lifetime retirement annuities but inflation can grind them to peanuts each month., 263414=Bob Jensen's New Bookmarks on August 31, 2008 Bob Jensen at Trinity University , 300255=\"The Milberg Double Cross,\" The Wall Street Journal, July 14, 2008; Page A16 --- http://online.wsj.com/article/SB121599290265249457.html?mod=djemEditorialPage, 307965=I’ve already mentioned in the June 30 edition of New Bookmarks that in early life Herb played the clarinet in a traveling dance band and in later life was sometimes in the racing pit of AJ Foyt. It’s still hard to picture him in either of these roles since Herb really was more an accounting stereotype. He was a pillar of the American Accounting Association for many years and was President of the AAA during the AAA’s Golden Anniversary., 676815=\"KPMG Ordered to Stand Trial in Fraud Law,\" SmartPros, July 28, 2008 --- http://accounting.smartpros.com/x62665.xml, 734584=June 29, 2008 message from Bob Jensen, 59209=The link to the Financial Times article --- http://news.ft.com/cms/s/e22d70f2-9674-11da-a5ba-0000779e2340.html, 721935=\"The Credit Crisis and Failed Risk Analysis:  We're Nowhere Near the End Here,\" The Wharton School at the University of Pennsylvania, June 2008 --- http://knowledge.wharton.upenn.edu/article.cfm;jsessionid=a8306bc6c52433251104?articleid=1998, 809236=\"Lawmaker Seeks Delay In Accounting Changes:  Proposed Rules Aim For Banks to Place Assets Back on Books,\" by Judith Burns, The Wall Street Journal, July 26, 2008 --- http://online.wsj.com/article/SB121703518961486771.html?mod=todays_us_money_and_investing, 662495=July 13, 2008 reply from Bob Jensen, 361084=There is already a reverse gold rush going on in California and the evidence points powerfully toward high tax rates as a culprit. Census Bureau data show that, from 1996-2005, 1.3 million more Americans left than came to California. And the people who are leaving are disproportionately those with higher incomes: the very targets the Democrats want to tax more., 50379=Recent spikes in CDS spreads on the three largest Icelandic banks are a case in point. In July spreads on Kaupthing and Glitnir rose to levels 35% higher than those observed for Bear Stearns in the days before it was bought out, according to Fitch Solutions, part of the Fitch rating and risk group. But the panic subsided after they released second-quarter earnings. Insiders say CDSs are increasingly used for speculation as well as hedging, which creates distracting “noise” particularly when the markets are as fearful as they have been recently., 200180=I have two brothers: one is currently serving a life sentence at Huntsville for the murder of a teenage girl in 1994. My other brother is currently in jail awaiting charges of sexual misconduct with his three children. I have recently become engaged to marry a former full-time prostitute who lives in Austin. She is currently a part time 'working girl'., 127462=The Timeline of the Recent History of Fannie Mae Scandals 2002-2008 --- http://www.trinity.edu/rjensen/caseans/000index.htm#FannieMae \"Fannie Mayhem: A History,\" The Wall Street Journal, July 14, 2008, 812916=This law gave American companies a one-year window in 2005 to repatriate earnings from foreign subsidiaries to the United States at a 5.25% tax rate. Normally companies must pay the 35% U.S. corporate tax rate, minus a credit for whatever foreign taxes they paid on those earnings., 289032=Humor Between May 1 and May 31, 2008 --- http://www.trinity.edu/rjensen/book08q2.htm#Humor053108, 839359=\"Wachovia Agrees to Buy Back over $8.5 Billion in ARSs,\" Blog of the Corporate Law Center, University of Cincinnati College of Law, August 16, 2008 --- http://lawprofessors.typepad.com/securities/, 717145=Until recently, the San Francisco bank had written off home-equity loans -- essentially taking a charge to earnings in anticipation of borrowers' defaulting -- once borrowers fell 120 days behind on payments. But on April 1, the bank started waiting for up to 180 days., 655259=July 13, 2005 reply from Bob Jensen, 65800=RELATED ARTICLES:  No Longer Preferred: A Lesson From Paulson by David Reilly and Peter Eavis Sep 08, 2008 Page: C10 Mounting Woes Left Officials with Little Room to Maneuver by Deborah Solomon, Sudeep Reddy and Susanne Craig Sep 08, 2008 Page: A1 U.S. Seizes Mortgage Giants by James R. Hagerty, Ruth Simon and Damina Palette Sep 08, 2008 Page: A1  , 292073=The IFRS system is generally considered more flexible, and giving companies the choice could spell the end of GAAP, experts believe. Marcy Gordon, Yahoo News, August 25, 2008 --- http://news.yahoo.com/story//ap/20080827/ap_on_bi_ge/sec_international_accounting, 154174=August 20, 2008 reply from Neal Hannon [nhannon@GMAIL.COM], 576171=Answer The Accounting Onion, August 18, 2008 --- http://accountingonion.typepad.com/theaccountingonion/2008/08/no-escaping-the.html, 144959=September 8, 2008 answer from Bob Jensen, 836208=\"SEC Obtains Asset Freeze Against Alleged International Fraud,\" Blog of the Corporate Law Center, University of Cincinnati College of Law, August 16, 2008 --- http://lawprofessors.typepad.com/securities/, 297155=July 9, 2008 message from Victor Ricciardi [victor.ricciardi@YAHOO.COM], 812353=\"Corporate Tax Cut Windfall,\" The Wall Street Journal,  July 1, 2008; Page A16 --- http://online.wsj.com/article/SB121486763043717547.html?mod=djemEditorialPage, 648202=July 12, 2008 reply from Bill McCarthy [mccarthy@BUS.MSU.EDU], 725127=The settlement calls for Heinen, who had served as Apple’s general counsel from 1997 until her departure in mid-2006, to pay $2.2 million in disgorgement, interest and penalties, and to be barred from serving as an office of a public company for five years. Under terms of the settlement, she has neither admitted nor denied any wrongdoing., 639527=July 18, 2008 reply from Bob Jensen, 76234=\"How Good Are Commercial Corporate Governance Ratings?\" by Bill Snyder, Stanford Graduate School of Business News,  June 2008 --- http://www.gsb.stanford.edu/news/research/larker_corpgov.html, 533482=August 11, 2008 reply from Glen L Gray [glen.gray@CSUN.EDU], 182307=We can cheer the fact that these days, newspapers, TV networks, politicians and parties that traffic in scurrility imperil only their own reputations. The spirit of benevolence is upon us: Sens. John McCain and Barack Obama, speaking by phone on June 4, agreed nobly to uphold \"civil discussion.\", 743018=We have no proprietary information about Fannie Mae, but what is publicly known is scary enough. As you may recall, last December the SEC required Fannie to restate prior financial statements while the Office of Federal Oversight (OFHEO) accused the company of widespread accounting regularities that resulted in false and misleading statements. Significantly, the questionable practices included the way Fannie accounted for their huge amount of derivatives. On Tuesday, a company press release gave some alarming hints on how extensive the problem may be., 843685=From Jim Mahar's blog on June 30, 2008 --- http://financeprofessorblog.blogspot.com/, 292577=We sincerely apologize for these roundabout descriptions of accounting for securitizations under IAS 39, but we are convinced that it is not susceptible to any form of straightforward translation. Marty Rosenblatt, Jim Johnson & Jim Mountain, \"Securitization Accounting The Ins and Outs (And Some Do’s and Don’ts) of FASB 140, FIN 46R, IAS 39 and More . . .,\" Deloitte, Seventh Edition, July 2005 --- http://www.deloitte.com/dtt/cda/doc/content/US_FSI_Securitization_Accounting_7th_Addtion_2005%282%29.pdf Jensen Comment Note that the authors are not referring to \"translation\" from a foreign language, or are they? Also note that aside from the international IAS 39 module, the above document was written after QSPEs were giveth in FAS 140 and before QSPEs were  taketh away in FAS 140(R). In other words this Deloitte document was written before revision of FAS 140, but then who cares since IAS 39 will soon take over in a \"roundabout way.\" See http://www.trinity.edu/rjensen/theory/00overview/speOverview.htm Also see http://www.trinity.edu/rjensen/theory01.htm#CDO, 759268=1988 Infectious Greed:  How Deceit and Risk Corrupted the Financial Markets  (Henry Holt and Company, 2003, Page 67, ISBN 0-8050-7510-0), 89162=You can read the comment letters at http://www.fasb.org/ocl/fasb-getletters.php?project=1590-100, 542069=August 11, 2008 reply from David Albrecht [albrecht@PROFALBRECHT.COM], 373548=August 11, 2008 reply from Bob Jensen, 4654=\"Top Ten Reasons Why U.S. Adoption of IFRS is a Terrible Idea,\" by Tom Selling, The Accounting Onion, September 10, 2008 --- http://accountingonion.typepad.com/, 334565=From The Wall Street Journal Accounting Weekly Review on June 27, 2008, 536779=The boom in accounting at San Diego State is part of a national trend. Enrollment in accounting classes is up 19% since 2004, according to a survey by the American Institute of Certified Public Accountants. The increase in interest has left some campuses unable to accommodate all comers. In fact, the survey found that 13% of campuses had to turn away students who wanted to study accounting because of a lack of adequate classroom space or teachers., 72904=¶ The need for an explicit bailout underlines the economic vulnerabilities of the United States. In July, Congress gave Treasury Secretary Henry Paulson unlimited authority to pay the debts of Fannie and Freddie and to shore up their capital, if need be. Yet investors the world over continued to doubt the companies’ viability, shunning their securities or demanding unusually high interest rates on loans. In effect, investors deemed the government’s commitment to Fannie and Freddie as either insufficient or not credible — an extraordinary vote of no confidence that, in the end, led to the bailout., 602328=2001, 299339=July 9, 2008 reply from Bob Jensen, 809697=U.S. accounting-rule makers should defer until January 2010 proposed rules that would potentially require banks to bring billions of dollars in off-the-books assets back onto their balance sheets to avoid \"serious unintended consequences\" in financial markets, a senior member of the House Financial Services Committee wrote., 104832=RELATED ARTICLES:  FASB's Lawyer Bonanza by Aug 07, 2008 Page: A12  , 302070=July 14, 2008 reply from Glen Gray [glen.gray@CSUN.EDU], 166016=Humor Between May 1 and May 31, 2008 --- http://www.trinity.edu/rjensen/book08q2.htm#Humor053108, 637249=This table (with the three summary rows I added) shows the 2007 report of AAA KPIs at aaahq.org/about/financials/KeyIndicators8_31_07.pdf .. there are some interesting patterns here. The number of practitioners has gone down by more than 40%. This has been a matter of concern for me for many years. The AAA should be the natural place a well trained, thoughtful accountant should go to for a professional experience that is different than that provided by the AICPA, IIA, ISACA etc. Yet we seem to be able to attract only 600 professional members – a statistical blip. I have spoken to several professionals who are involved with the AAA and  even they seem to think that attracting professionals is a lost cause. I don’t agree and I don’t think we should accept this number. Other similar organizations such as the AEA and ACM have a much higher proportion than we do., 361989=The Democratic tax plan will give rich people a further incentive to flee at the very time the real-estate market is in collapse. New housing data reveals that the average California home price fell by 28% from June 2007 to June 2008, almost double the decline of any other state. The politicians in Nevada, the state with the third worst real-estate market, are hoping California raises taxes, because this could be a fast way to revive the Reno and Las Vegas housing markets., 734857=I disagree almost entirely on the “points you were trying to make.” .at http://accountingonion.typepad.com/theaccountingonion/2008/06/compromising-ac.html It’s analogous to saying that we should do away with environmental protection legislation because the laws imposed a lot of costs to polluters, drove some out of business, and has not stopped all environmental pollution. What do you expect with so many kinds of misdeeds that are exceedingly complex and interactive?, 108034=August 22, 2008 reply from Dennis Beresford [dberesfo@TERRY.UGA.EDU], 342704=The Obama plan also includes imposing higher Social Security taxes on workers making over $250,000. However, the senator hasn't given precise details, such as how much more those people would pay. Under current law, the maximum amount of earnings subject to the Social Security tax for 2008 is $102,000., 262990=August 31, 2008, 19226=\"(Tax) Abusive Insurance and Retirement Plans : Single–employer section 419 welfare benefit plans are the latest incarnation in insurance deductions the IRS deems abusive,\" by Lance Wallach, Journal of Accountancy, October 2006 --- http://www.aicpa.org/pubs/jofa/sep2008/abusive_insurance.htm, 346953=Bob Willens, president of a tax-advisory firm in New York bearing his name, agrees the capital-gains rate is going up next year. \"It's something you need to resign yourself to,\" he warns. But he says there's no reason to rush to sell today, since lawmakers aren't likely to make tax-rate increases retroactive to the start of next year. He sees the effective date more likely as sometime around mid-2009., 40946=\"Accounting for the auditors: As huge corporations tumble, what of the auditing firms paid millions to provide them with clean,\" by Prem Sikka, The Guardian, September 18, 2008 http://www.guardian.co.uk/commentisfree/2008/sep/18/marketturmoil.economics?commentpage=1&commentposted=1, 776016=The regulatory changes of 1994-95 sent three messages to corporate CEOs.  First, you are not likely to be punished for \"massaging\" your firm's accounting numbers.  Prosecutors rarely go after financial fraud and, even when they do, the typical punishment is a small fine; almost no one goes to prison.  Moreover, even a fraudulent scheme could be recast as mere earnings management--the practice of smoothing a company's earnings--which most executives did, and regarded as perfectly legal., 313443=The Millers moved to Athens in 1975, where he made his mark at the University of Georgia. Herbert Miller became the first director of the J.M. Tull School of Accounting at the University of Georgia's Terry College of Business. The Miller Chair of Financial Accounting was established in his honor., 769316=In late 1993, oil prices dropped and Metallgesellschaft began losing money on its futures positions. Theoretically, the firm could make up for these losses by selling oil-related products in the future at prices it had locked in on its long-term contracts, which were now higher than prices available in the market. But as the losses on the short-term oil hedges increase, the firm had to pay hundreds of millions of dollars right away, years berfore the future gains from its long-term contracts. On December 17, 1993, directors of the firm's German parent took control of the hedging operation and began selling off the short-term contracts, at huge losses. By January 1994, the firm had lost more than a billion dollars., 48535=\"Pressure gauge,\" The Economist, August 21, 2008 --- http://www.economist.com/finance/displaystory.cfm?story_id=11985964, 714313=\"Banks Find New Ways To Ease Pain of Bad Loans,\" by David Enrich, The Wall Street Journal,  June 19, 2008; Page C1 --- http://online.wsj.com/article/SB121383327218786693.html?mod=djem_jiewr_AC, 345001=But Michael Holland, who heads a New York-based investment firm bearing his name, says: \"I don't hear anyone talking about doing anything\" right now in anticipation of higher capital-gains taxes. \"If we had a huge run-up [in stock prices] between now and December, I think you'd then begin to hear\" talk about selling this year, he says. \"I don't hear any of that right now.\", 320654=\"Interestingly, the book begins with a Statement of Values reprinted from Enron's 1998 annual report. It also describes the Code of Ethics at Enron and how Lay often touted the integrity of the company's leaders. Amazing.\", 205092=The patrolman says, “May I see your license?” The woman turns to her husband and asks, “What did he say?” The old many again yells, “HE WANTS TO SEE YOUR LICENSE!” The woman gives the patrolman her license., 128483=From Jim Mahar's blog on September 5, 2008 --- http://financeprofessorblog.blogspot.com/, 731075=Tom Selling apologizes to Jim Leisingring --- http://accountingonion.typepad.com/theaccountingonion/2008/06/compromising-ac.html, 319311=July 15, 2008 --- Dennis Beresford [dberesfo@TERRY.UGA.EDU], 832465=Footnote:  Rich Kinder left Enron, formed his own energy company, and became a billionaire --- http://www.mcdep.com/MR11231.PDF, 729993=Anderson’s version of events would seem to contradict Apple’s version of events, which it announced in October of 2006, after an investigation by a special committee of its outside directors concluded that Jobs didn’t fully appreciate the accounting implications of the matter., 645623=But the saddest statistic is the longer run decline in the number of accounting doctoral program graduates in the United States. In 1988 there were over 200 graduates from U.S. doctoral programs in accounting. In two decades this is down by over 50%., 534516=Glen L. Gray, PhD, CPA Accounting & Information Systems, COBAE California State University, Northridge 18111 Nordhoff ST Northridge, CA 91330-8372 818.677.3948 818.677.2461 (messages) http://www.csun.edu/~vcact00f, 617928=2006, 298734=Electronic copies of my papers are available from my author page at the SSRN Electronic Library at: http://papers.ssrn.com/sol3/cf_dev/AbsByAuth.cfm?per_id=262799, 689331=\"Loan-Agency Woes Swell From a Trickle to a Torrent,\" by Charles Duhigg, The New York Times, July 11, 2008 --- http://www.nytimes.com/2008/07/11/business/11ripple.html?_r=1&hp&oref=slogin, 922840=August 19, 2008 reply from Bob Jensen, 677429=Cast Art sued KPMG in 2003 for professional malpractice and negligence for allegedly failing to detect a pervasive financial fraud at Papel Giftware, Inc. prior to Cast Art acquiring Papel in December 2000 for nearly $50 million., 810701=Rep. Spencer Bachus (R., Ala.) wrote in a July 22 letter to Securities and Exchange Commission Chairman Christopher Cox and Financial Accounting Standards Board Chairman Robert Herz that, \"Changes to securitization accounting could have a dramatic impact on the economy, the capital markets and consumers seeking credit.\", 32330=In the current environment, I am an ardent supporter of those who would resist calls to suspend fair value accounting rules. But, when I was at the SEC, I had a front-row seat on what was perhaps one of the most brazen abuses of fair value accounting in history. I was reminded of it by Joseph Stiglitz's recent commentary on CNN.com, in which he characterized the mortgage securitization craze as just another pyramid scheme. Keep that in mind as I tell you the story of Stephen Hoffenberg's $400 million fraud. Tom Selling, \"The Anti-Fair Value Lobby Has a Point (Even if They Don't Know It)\" The Accounting Onion, September 22, 2008 --- http://accountingonion.typepad.com/, 799930=QUESTIONS: 1.) Describe the options backdating scandal that has developed since March, 2006. If you are unfamiliar with the issue, you may click on the link for \"Perfect Payday: Complete coverage\" on the left hand side of the on-line article., 31237=\"Fair Value Adoption --- An Update,\" Deloitte White Paper, August 2008 --- http://www.iasplus.com/usa/0808fairvalueupdate.pdf, 596089=1999, 294405=Second, there's a big agency problem inherent with the report. E&Y did this report for the PE industry. Since they get a significant amount of fees from doing transactions advisory work (due diligence, forensic accounting, etc...), they have a vested interest in keeping their client companies (i.e. the PE firms) happy. So, there are some biases that could be present in the report (What, the accounting firm could be biased, I'm shocked. Shocked, I say!). \"Do PE Firms Manage Portfolio Firms, or Just Manipulate Balance Sheets?\" Financial Rounds Blog --- July 14, 2008 --- http://financialrounds.blogspot.com/, 833418=Construction will begin in 2009 and the center is expected to open in 2011., 59939=From The Wall Street Journal Accounting Weekly Review on September 12, 2008 --- http://online.wsj.com/article/SB122083722708908863.html?mod=djem_jiewr_AC, 776645=Second, you should use new financial instruments--including options, swaps, and other derivatives--to increase your own pay and to avoid costly regulation.  If complex derivatives are too much for you to handle--as they were for many CEOs during the years immediately following the 1994 losses--you should at least pay yourself in stock options, which don't need to be disclosed as an expense and have a greater upside than cash bonuses or stock., 729535=The settlement also means that Heinen’s version of events will likely not be aired in public. When Apple’s former CFO Fred Anderson settled charges related to the matter in 2007, he issued a public broadside at Apple and Jobs in particular. At the time Anderson, through his lawyer, said that he had warned Jobs that the company would need to record a charge for the options granted Apple executives in early 2001., 145543=\"Technology Implications of IFRS adoption for U.S. Companies: More than a technical accounting change,\" Deloitte White Paper, August 2008 --- http://www.deloitte.com/dtt/article/0%2C1002%2Ccid%25253D219180%2C00.html   , 665911=July 14, 2008 reply from Richard C. Sansing [Richard.C.Sansing@TUCK.DARTMOUTH.EDU], 557768=To be honest, the free CPA review site is all that I would've needed because all I did was devote five hours religiously each week for about five months of my senior year in college to studying old CPA exam questions and answers. Back in 1960 in Colorado we could take the exam before we graduated in the undergraduate program., 740342=Second, Enron's core business of derivatives trading was actually highly profitable, so profitable, in fact, that Enron almost certainly would have survived if key parties had understood the details of its business. Instead, in late 2001, Enron was hoist with its own petard, collapsing --- not because it wasn't making money --- but because institutional investors and credit-rating agencies abandoned the company when they learned that Enron's executives had been using derivatives to hide the risky nature of their business., 154685=August 20, 2008 reply from Bob Jensen, 303695=\"We must break the prism of corporate interests,\" by Prem Sikka, The Guardian, July 24, 2008 --- http://www.guardian.co.uk/commentisfree/2008/jul/24/comment, 686259=From the Financial Rounds Blog on July 5, 2008 --- http://financialrounds.blogspot.com/, 5672=Answer The Accounting Onion, August 18, 2008 --- http://accountingonion.typepad.com/theaccountingonion/2008/08/no-escaping-the.htm, 588707=July 18, 2008 reply from Roger Debreceny [roger@DEBRECENY.COM], 798926=From The Wall Street Journal Accounting Weekly Review on November 10, 2006, 666402=July 14, 2008 reply from Bob Jensen, 96278=PwC questions (and I agree) the \"reasonably effective\" ambiguity for hedge ineffectiveness testing --- http://www.fasb.org/ocl/1590-100/52567.pdf, 370177=Europe Has an Economics Lesson for Obama (apparently nobody is listening in California) But the Europe Mr. Obama will visit is quite different from the one Americans often hear about. Over the last decade, much of Europe has very quietly embraced market-based reforms that either draw inspiration from American successes or -- on issues like retirement security -- are even more market-oriented than many U.S. Republicans support. What's more, these changes have been adopted and implemented by parties left and right. This Europe is a shining example of exactly the sort of postpartisan government action that the Obama campaign says it is about. The cutting of corporate income- tax rates is an excellent example of European market-friendly bipartisanship. Germany's right-left coalition of Christian and Social Democrats implemented a large rate cut earlier this year, reducing the top marginal corporate rate to about 30% from 39%. Spain's Socialist and Britain's Labor governments have followed suit, reducing their countries' top corporate rates. These traditionally left-of-center parties understand that in a globalized economy, wealth and investment are mobile, flowing to those countries that provide hospitable investment climates. As part of a European Union where center-right governments in Greece, Denmark, Ireland and Eastern Europe have dramatically reduced corporate tax rates, they understand that they cannot help workers if they drive away the capital that employs and pays them. Henry Olsen, The Wall Street Journal, July 19, 2008 --- http://online.wsj.com/article/SB121642093483266551.html?mod=djemEditorialPage, 710410=From The Wall Street Journal Accounting Weekly Review on June 27, 2008, 832903=\"Deloitte to Build $300 Million Campus,\" SmartPros, July 1, 2008 --- http://accounting.smartpros.com/x62352.xml, 57521=From Jim Mahar's Blog on February 6, 2005 --- http://financeprofessorblog.blogspot.com/, 811369=The FASB is aiming for the rule changes to take effect starting next year for new securitization vehicles. However, the proposals, which still must be finalized, wouldn't affect many existing vehicles until 2010., 728593=The settlement would appear to bring final closure to the matter of Apple’s relatively minor backdating issue. During parts of 2006 and 2007, the matter had caused Apple investors some anxiety that Jobs might be targeted by the SEC either for civil charges or by the U.S. Department of Justice for criminal charges. The amount of money involved – less than $40 million – was in fact minimal to Apple, who during the its fiscal years 2006 and 2007 had reported sales of $20 billion and $24 billion respectively, and whose cash horde had exceeded $15 billion by the close of its 2007 fiscal year., 657755=Hello Bob and AECM Colleagues, I must share a different perspective than Bob on the issue of AAA member numbers - if you check the Key Indicators report referenced below (updated for 2007) you'll see that while the AAA experienced a decline in membership for a number of years, since 2004 we are experiencing a small but steady increase, which appears to be continuing as we currently have about 150 more registrations for the Annual Meeting than at this point last year (which was our 3rd record-breaking attendance in a row). Having said, your comments including Bill's are well taken as important issues -- and interesting data on related topics can be found in our report on faculty trends from this spring at http://aaahq.org/temp/phd/index.cfm . We have a follow up research project in the works on non-tenure-track faculty in accounting to gather more data about the role they are playing (along with faculty who aren't retiring) in what's happening in accounting programs. Our researcher David Leslie will make a presentation at the Annual Meeting on both projects (Monday at 2:00 pm)., 177994=The great American political insult is older than the nation itself. Ben Franklin, writing in 1771 before the States were even United, lamented \"Libeling and Personal Abuse, which is of late Years become so disgraceful to our Country.\" Not even George Washington was spared: Tom Paine raged about his \"treachery\" and \"pusillanimity.\", 108728=From the AccountingWeb on July 15, 2008, 66865=\"No End Yet to the Capital Punishment,\" by Peter Eavis and David Reilly, The Wall Street Journal, September 8, 2008; Page C10             http://online.wsj.com/article/SB122083722708908863.html?mod=djem_jiewr_AC , 377480=                    Period: 1966-1985, 681832=The seven-year delay is not unusual. The professional structures took eight years to levy a fine on Coopers & Lybrand (now part of PricewaterhouseCoopers) for audit shortcomings that might have prevented the late Robert Maxwell from looting his companies and employee's pension funds. The frauds came to light after his suicide in 1991. A UK government investigation did not report until 2001. In 1999, a professional disciplinary hearing placed most of the blame for audit failures on an audit partner who died in the intervening years. The firm was fined £1.2m for its audit failures and ordered to pay costs of £2.2m. Taken together this amounted to £6,000 per partner. Coopers had collected over £25m in fees from Maxwell. In 1999, PricewaterhouseCoopers had UK income of £1.8bn., 537275=Among other factors leading to the rise, the institute notes, is the Sarbanes-Oxley legislation, which requires businesses to make more stringent financial disclosures. Last year, 64,221 students graduated with bachelor's or master's degrees in accounting, the most since the institute began its annual survey in 1970., 568057=Officials say the proposed changes reflect the decades-long push toward global markets. They say the changes are necessary to attract capital from abroad and will protect Americans as they increasingly look to invest overseas. In the decade ending last November, American holdings of foreign stock increased to $4.3 trillion from $1.2 trillion., 27631=From Smart Stops of the Web, Journal of accountancy, October 2008 ---, 672658=From The Wall Street Journal Weekly Accounting Review on August 15, 2008, 556560=July 22, 2008 reply from Bob Jensen, 43096=Lehman Brothers, incorporated in the tax haven of Delaware, was audited by the New York office of Ernst & Young. On January 28 2008, the firm gave a clean bill of health to Lehman accounts for the year to November 30 2007. The auditor's report (page 75 of the accounts) says, \"Our audit included obtaining an understanding of internal control over financial reporting, assessing the risk that a material weakness exists, testing and evaluating the design and operating effectiveness of internal control based on the assessed risk, and performing such other procedures as we considered necessary in the circumstances\". Lehman Brothers filed quarterly accounts with the SEC for the period of May 31 2008 and on July 10 2008 and these (see page 52) too received a clean bill of health. Despite the deepening financial crisis, auditors did not express any reservations about the value of the derivatives or any scenarios under which company may be unable to honour its obligations. Just two months later, Lehman collapsed., 376180=                    Period: 1926-2005, 9203=From The Wall Street Journal Weekly Accounting Review on September 19, 2008, 148848=\"IMA Looks to Redefine 'Management Accounting',\" SmartPros, August 13, 2008 --- http://accounting.smartpros.com/x62882.xml, 688651=The paper was published in the Journal of Psychology and Financial Markets in 2000, but you can get an ungated version at  http://www.biz.uiowa.edu/faculty/thouge/CF_Paper_JPFM.pdf, 857144=Humor Between September 1 and September 30 --- http://www.trinity.edu/rjensen/book08q3.htm#Humor093008, 22705=Early History of Mathematics and Accounting in China The best general source for ancient Chinese mathematics is Joseph Needham's Science and Civilisation in China, vol. 3. In this volume you will learn, for example, that the Chinese proved the Pythagorean Theorem at the very latest by the Later Han dynasty (25-221 CE). The proof comes from an ancient text called The Arithmetical Classic of the Gnomon and the Circular Paths of Heaven. The book has been translated by Christopher Cullen in his Astronomy and Mathematics in Ancient China: The Zhou Bi Suan Jing. Needham also discusses the abacus, or suanpan (\"calculating plate\"). Steve Field, Professor of Chinese, Trinity University, September 24, 2008 Jensen Comment Later Han Dynasty --- http://en.wikipedia.org/wiki/Later_Han_Dynasty_(Five_Dynasties) Pythagorean Theorem Theorem --- http://en.wikipedia.org/wiki/Pythagorean_Theorem Pythagorean Theorem (Gougu Theorem in China) History --- http://en.wikipedia.org/wiki/Pythagorean_Theorem#History Suanpan --- http://en.wikipedia.org/wiki/Suanpan This makes me respect Wikipedia even more!, 295657=Notable Quotations About the SEC's New Proposals for Oil & Gas Accounting I think I can always tell when the fix is in. First, big lies are woven into a large dose of truth, so they won't look to be as big as they are. There are certainly many things in the SEC's proposal to recommend it, especially along the lines of expanding the types of reserves that would be disclosed, and updating important definitions. Second, when the justification for a proposal makes no sense, there can be no debate; you can't tell the emperor he's naked. The lesson of the Cox's SEC is to never forget about the big special interests that write big checks to the big politicians that made him emperor for a day. Tom Selling, \"SEC on Oil and Gas Disclosures: Current Prices Aren't 'Meaningful'?\" The Accounting Onion, July 25, 2008 --- http://accountingonion.typepad.com/theaccountingonion/2008/07/oil-and-gas-dis.html, 775077=The Private Securities Litigation Reform Act of 1995 passed easily, and Congress even overrode the veto of President Clinton, who either had a fleeting change of heart about financial markets or decided that trial lawyers were an even more important constituency than Wall Street.  In any event, Clinton and Levitt disagreed about the issue, although it wasn't fatal to Levitt, who would remain SEC chair for another five years., 346574=Capital-gains rates are likely to \"go up by more -- and possibly earlier\" if Sen. Obama wins, says Thomas D. Gallagher of International Strategy and Investment Group. But rates \"still probably go up under McCain,\" he says, noting that the 15% rate is set to rise automatically after 2010 if Congress takes no action., 37767=Earnings Management Via Hidden Reserves in Banks The upgrading of valuation methods, in particular with respect to the valuation of illiquid assets. Work is being led by the Basle Committee and the International Accounting Standards Board (IASB), who have established a panel on fair valuation. Advice is expected by the end of the third quarter of 2008. The IASB is also working on off-balance sheet items with the key question being: when should an entity be brought onto another entity's balance sheet? The input received in these meetings will help the IASB in shaping its forthcoming proposals on reviewing consolidation rules under IFRS. Deliverables are expected in 2009. Proper due process must be carried out. I believe we need to look hard at issues such as dynamic provisioning – and how to account for prudential reserves built up by banks to buffer for bad times. It should not have escaped people's attention that banks in Spain were better placed to withstand the turmoil because they had not yet adopted the relevant IFRS Standard. There is a lesson there that needs to be drawn .... On accounting, SEC Chairman Cox has unveiled a roadmap where US companies would switch from US GAAP to IFRS by 2014. Unthinkable only two years ago! A dramatic signal indeed. Following the EU's lead, the US is indicating it also wants to choose global standards. One set, in sight, at last. And of course we need to strengthen the governance of the IASB. That is why we are working hard with some of our major counterparts to install new, strengthened oversight mechanisms. Charlie McCreevy, European Commissioner for Internal Market, Speech, September 10, 2008 --- http://www.iasplus.com/europe/0809mccreevy.pdf, 785676=Frank Partnoy, FIASCO: The Inside Story of a Wall Street Trader (Penguin, 1999, ISBN 0140278796, 283 pages). , 680896=Last week, seven years after the collapse of Independent Insurance Group, the UK accountancy profession frightened KPMG with a fine of £495,000 over its audit failures. The partner in charge of the audits was fined £5,000 and the firm had to pay disciplinary hearings costs of £1.15m. The audit failures played a part in helping the company to report a loss of £105m into a profit of £22m. In October 2007, two Independent directors were jailed for seven years., 754788=Frank Partnoy, Page 283 of a Postscript entitled \"The Return\" F.I.A.S.C.O. : The Inside Story of a Wall Street Trader by Frank Partnoy - 283 pages (February 1999) Penguin USA (Paper); ISBN: 0140278796 , 816372=The best response going forward would be for Congress and the next Administration to reduce sharply the corporate tax rate so it is competitive with falling rates around the world. John McCain is proposing to cut it to 25%. If Barack Obama really wanted to \"run to the center,\" he'd see that and cut it even further. As the 2005 results show, he'd then have more tax revenue to spend on his many social programs., 857614=Humor Between June 1 and June 30, 2008 --- http://www.trinity.edu/rjensen/book08q3.htm#Humor083108, 755850=1985 Infectious Greed:  How Deceit and Risk Corrupted the Financial Markets  (Henry Holt and Company, 2003, Page 17, ISBN 0-8050-7510-0), 690878=“There is a real panic about these companies on Wall Street right now, and sometimes a blaze like that grows almost without reason,” said Tom Lawler, an economist who worked at Fannie Mae for over two decades before leaving in 2006 to become a consultant. “There wasn’t really any new news to set off this crisis. The stocks just started falling, and didn’t stop.”, 331550=July 16, 2008 reply from David Albrecht [albrecht@PROFALBRECHT.COM], 608568=2003, 135023=\"Proposed Statement on Disclosure of Certain Loss Contingencies, an amendment of FASB Statements No. 5 and 141(R),\" by Linda Cavanaugh, AccountingWeb, July 1, 2008 --- http://www.accountingweb.com/blogs/linda_cavanaugh_blog.html, 543501=August 14, 2008 reply from Bob Jensen, 838717=The SEC's complaint charges GHL, Hew-Len and Abellan with numerous securities violations and seeks preliminary and permanent injunctions, disgorgement, penalties, and other permanent and emergency relief. Pursuant to the court's order, a hearing will be held on August 27, 2008 to determine whether the asset freeze will remain in place during the remainder of the litigation., 56231=Debt Versus Equity: Dense Fog on the Mezzanine Level Deloitte has submitted a Letter of Comment (PDF 277k) on the IASB's Discussion Paper: Financial Instruments with Characteristics of Equity. We strongly support development of a standard addressing how to distinguish between liabilities and equity. We do not support any of the three approaches outlined in the Discussion Paper, but we believe that the basic ownership approach is a suitable starting point. Below is an excerpt from our letter. Past comment letters are Here. IASPlus, September 5, 2008 --- http://www.iasplus.com/index.htm, 659490=July 17, 2008 reply from Bob Jensen, 817163=\"The Discreet Charms of Accountancy,\" by Joe Queenan, The New York Times, July 13, 2008 --- http://www.nytimes.com/2008/07/13/movies/13quee.html?_r=1&oref=slogin, 772658=My favorite among the capital market fraud books is Frank Partnoy’s latest book Infectious Greed: How Deceit and Risk Corrupted the Financial Markets (Henry Holt & Company, Incorporated, 2003, ISBN: 080507510-0- 477 pages).  This is the most scholarly of the books available on business and gatekeeper degeneracy.  Rather than relying mostly upon his own experiences, this book drawn from Partnoy’s interviews of over 150 capital markets insiders of one type or another.  It is more scholarly because it demonstrates Partnoy’s evolution of learning about extremely complex structured financing packages that were the instruments of crime by banks, investment banks, brokers, and securities dealers in the most venerable firms in the U.S. and other parts of the world.  The book is brilliant and has a detailed and helpful index., 39743=New data based on analysis of the Internal Revenue Service's (IRS) National Research Program Individual Reporting Compliance Study of 2001, on which the agency's estimate of the \"Tax Gap\" is based, show that only one-half of Schedule C income and only 88 percent of capital gains are reported, David Cay Johnston, writing for Tax Notes says. Johnston obtained the data ahead of IRS publication. The new data compares \"Reported\" adjusted gross income (AGI), with \"True\" AGI levels. The researchers arrived at \"true\" AGI, according to Johnston, by auditing \"specific items (as opposed to the old TCMP or audit from hell audits which made you prove every line. They then applied these findings on differences between reported and true income using standard statistical methodologies.\" \"New IRS analysis shows only half of Schedule C income is reported,\" AccountingWeb, August 2008 --- http://www.accountingweb.com/cgi-bin/item.cgi?id=105784, 119064=The case study approach does not prescribe what theories should inform the study or which methods should be used for gathering and analyzing data. Based on the problem and research questions being addressed, a variety of methods may be used, including analysis of archival materials, observation, interviews, and quantitative techniques. Case studies focus on bounded and particular organizations, events, or phenomena, and scrutinize the activities and experiences of those involved, as well as the context in which these activities and experiences occur \u0001Stake 2000., 356357=Bush's Laffer Matter:  Tax Cuts Increase Tax Revenues Washington is teeing up \"the rich\" for a big tax hike next year, as a way to make them \"pay their fair share.\" Well, the latest IRS data have arrived on who paid what share of income taxes in 2006, and it's going to be hard for the rich to pay any more than they already do. The data show that the 2003 Bush tax cuts caused what may be the biggest increase in tax payments by the rich in American history. The nearby chart shows that the top 1% of taxpayers, those who earn above $388,806, paid 40% of all income taxes in 2006, the highest share in at least 40 years. The top 10% in income, those earning more than $108,904, paid 71%. Barack Obama says he's going to cut taxes for those at the bottom, but that's also going to be a challenge because Americans with an income below the median paid a record low 2.9% of all income taxes, while the top 50% paid 97.1%. Perhaps he thinks half the country should pay all the taxes to support the other half. Aha, we are told: The rich paid more taxes because they made a greater share of the money. That is true. The top 1% earned 22% of all reported income. But they also paid a share of taxes not far from double their share of income. In other words, the tax code is already steeply progressive. We also know from income mobility data that a very large percentage in the top 1% are \"new rich,\" not inheritors of fortunes. There is rapid turnover in the ranks of the highest income earners, so much so that people who started in the top 1% of income in the 1980s and 1990s suffered the largest declines in earnings of any income group over the subsequent decade, according to Treasury Department studies of actual tax returns. It's hard to stay king of the hill in America for long. \"Their Fair Share,\" The Wall Street Journal, July 21, 2008; Page A12 --- http://online.wsj.com/article/SB121659695380368965.html?mod=opinion_main_review_and_outlooks, 725511=Heinen had been accused by the SEC of being responsible for the backdating of two big blocks of stock options grants to Apple executives, a matter that had cast a pall over the company it first disclosed the matter in June of 2006, about a month after Heinen’s departure. The SEC said that company records pertaining to a grant of 4.8 million options to Apple’s senior executive team in February of 2001, and a grant of 7.5 million shares made to CEO Steve Jobs in December of 2001 had been altered to conceal what it called a fraud. The result was that Apple underreported its stock-related expenses by nearly $40 million., 538829=Snyder is a USC accounting graduate and was on the faculty there from 1992 to 1994. He's been at San Diego State since 1989 and this year was named \"Best of State\" in a student-run poll for the second year in a row., 236909=Humor Between July 1 and August 31, 2008 --- http://www.trinity.edu/rjensen/book08q3.htm#Humor093008, 151549=August 20, 2008 reply from Jagdish Gangolly [gangolly@CSC.ALBANY.EDU], 187895=Jagdish Gangolly recommends Honourable Insults, by Greg Knight, Robson Books, 1990 --- http://en.wikipedia.org/wiki/Greg_Knight , 88758=Exposure Draft No. 1590-100 is at http://www.fasb.org/draft/ed_hedging_amendment_st133.pdf The bottom line is that the proposed amendments simplify implementation of such things as hedging ineffectiveness tests and benchmark hedging of interest rate risk., 5337=\"Technology Implications of IFRS adoption for U.S. Companies:  More than a technical accounting change,\" Deloitte White Paper, August 2008 ---, 587694=Recent demographic studies of the accounting professorate show that nearly half of AAA members are within five years of retirement; and junior faculty, busy establishing new careers, often spend little time thinking about retirement. Responding to members' interests, this year retirement specialists from TIAA-CREF will offer members of both groups opportunities to learn more about retirement planning. Family members/partners are welcome to attend these sessions as well. Both session are on Wednesday (August 6) at 2:00, one entitled \"Retirement Planning for Faculty 55 and Over\",  and a session for early career faculty designated as \"Retirement Planning for Those Under 55.\" These sessions will both be held in large rooms to accommodate the expected overflow crowds.  While hosted by representatives from TIAA-CREF, you don't have to be a participant in TIAA-CREF to benefit from the sessions.\", 71711=Say What? Editorial in the ... no ... can't be ... well maybe ... yes ... YES! ... The New York Times, September 8, 2008 --- http://www.nytimes.com/2008/09/09/opinion/09tue1.html?_r=1&oref=slogin, 758085=In 1988, Morgan Stanley created a security called PERCS, based on the more conservative piece of the Americus Trust dels. PERCS stood for \"Preferred Equity-Redemption Cumulative Stock,\" and resembled a preferred stock, with cumulative dividends that were higher than the dividends paid on common stock . . . The key twist was that, in three years, PERCS automatically converted into common stock, according to a specified stock if the common stock was at $50, so as to limit the upside of PERCS. Essentially, an investor buying PERCS committed to buy a company's stock in three years, and also sold some of the upside potential of that stock by selling a three-year call option (similar to those Andy Krieger was trading at Bankers Trust). The company bought the three-year call option from the investor, and paid the investor a \"premium\" in the form of a cumulative dividend for three years., 98519=Housing bill summary includes many tax provisions The provisions of the recent housing bill are aimed at both businesses and individuals and will have a significant impact on a large number of taxpayers. The changes will affect real estate investment trusts (REITs), provide incentives for first-time homebuyers, change tax rules for housing bonds and credits, allow some taxpayers to accelerate AMT and R&D credits, and, beginning in 2010, impose new payment card reporting requirements. AccountingWeb, August 2008 --- http://www.accountingweb.com/cgi-bin/item.cgi?id=105782, 133014=\"Sloppier Spreadsheets: How Bad Can They Get?\" CFO.com, August 20, 2008 --- http://www.cfo.com/article.cfm/11950766?f=EditorsLetter082808 Thanks to Glen Gray for forwarding this link., 237364=Humor Between June 1 and June 30, 2008 --- http://www.trinity.edu/rjensen/book08q2.htm#Humor063008, 177628=\"In Praise of Political Insults,\" by Joseph Tartakovsky, The Wall Street Journal, July 2, 2008; Page A13 --- http://online.wsj.com/article/SB121495554953121291.html?mod=djemEditorialPage, 165514=Humor Between July 1 and August 31, 2008 --- http://www.trinity.edu/rjensen/book08q3.htm#Humor090831, 704487=The bulls will respond that with the Nasdaq down nearly 14% this year, tech stocks already reflect this. For example, Oracle Corp. trades at 14 times earnings for the fiscal year ending in May 2009, apparently cheap given that analysts expect earnings growth of 16% for the company in that period., 367379=QUESTIONS:  1. (Introductory) In the article, the author notes that \"earlier this decade, in a bid to boost its U.S. profits and market share, Toyota launched a big push into full-size pickup trucks and sports-utility vehicles. Now, with soaring gasoline prices hurting sales of those vehicles, Toyota is stuck with more production capacity in the U.S. than it needs.\" Describe how the capital budgeting decisions that lead to this production capacity problem were made. What factors went into the decision? What analytical tools were used? 2. (Advanced) How is a required rate of return used in the decision-making process described above? Is it possible that Toyota met that required rate of return but still faces the issues now described in the article? How do income taxes influence these capital budgeting decisions and techniques? 3. (Advanced) What are the relevant costs for Toyota's decision-making to close certain plants and shift production processes to different locations? List all that you can think of and state your reasoning from information given in the article. 4. (Advanced) What costs that are described in the article are irrelevant to Toyota's decision-making regarding future production strategies in U.S. plants? 5. (Advanced) Consider the impact of Toyota's temporarily idle production facilities on quarterly reporting, under U.S. or international financial reporting standards, or semi-annual reporting for the second-half of the year ended March 31, 2009, under Japanese reporting. What will be the impact on these interim reports? Do you think that disclosures of the impact of these production decisions will be required? Support your answer.  , 86139=August 21, 2008 message from Rob Nance [rnance@accountingweb.com], 304263=In Spite of the Economic Downturn, There's a Shortage of Accounting and Finance Employees A shortage of experienced accounting and finance professionals continues to affect employers around the world, according to a report by Robert Half. For the second consecutive year, more than half (56 percent) of the finance and human resources managers surveyed worldwide reported difficulty finding skilled job candidates. The report also found that retention concerns have risen significantly in the last year. SmartPros, July 14, 2008 --- http://lyris.smartpros.com/t/1297430/7034337/5391/0/, 328071=July 16, 2008 message from Ruth Bender [r.bender@CRANFIELD.AC.UK], 105296=\"FASB Seeks to Inform Investors, Not Whack Companies,\" by Robert Herz, The Wall Street Journal, August 18, 2008; Page A14 --- http://online.wsj.com/article/SB121902212239348497.html?mod=djem_jiewr_AC, 724882=Posted by: Arik Hesseldahl on August 14 Nancy Heinen, Apple’s former general counsel has settled civil charges brought by the Securities and Exchange Commission in 2007, the commission announced today., 315702=\"Texas CPA Society wins national award for student Web site,\" AccountingWeb, August 2008 --- http://www.accountingweb.com/cgi-bin/item.cgi?id=105766, 679457=Cast Art plans to seek close to $50 million at trial. Opening statements are expected to begin in the trial on Sept. 15, 2008., 647310=Jensen Question If Bob Jensen were doing a highly technical session on FAS 133/157 in Anaheim at 2:00 p.m. on August 6, would he draw a bigger crowd than the Retirement Planning session?, 664935=July 14, 2008 reply from Roger Debreceny [roger@DEBRECENY.COM], 12951=\"Street Firms Accused of Tax Scheme,\" by Jesse Drucker, The Wall Street Journal, September 11, 2008 --- http://online.wsj.com/article/SB122109613823821913.html?mod=djem_jiewr_AC, 150485=IMA said that the field of management accounting has evolved considerably since the first and current definition was published in 1981., 779983=The controversial writings of Frank Partnoy have had an enormous impact on my teaching and my research.  Although subsequent writers wrote somewhat more entertaining exposes, he was the one who first opened my eyes to what goes on behind the scenes in capital markets and investment banking.  Through his early writings, I discovered that there is an enormous gap between the efficient financial world that we assume in agency theory worshipped in academe versus the dark side of modern reality where you find the cleverest crooks out to steal money from widows and orphans in sophisticated ways where it is virtually impossible to get caught.  Because I read his 1997  book early on, the ensuing succession of enormous scandals in finance, accounting, and corporate governance weren’t really much of a surprise to me., 614808=2005, 20607=As long ago as 1984, with the addition of IRC §§ 419 and 419A, Congress and the IRS took aim at unduly accelerated deductions and other perceived abuses. More recently, with guidance and a ruling issued in fall 2007, the Service declared as abusive certain trust arrangements involving cash-value life insurance and providing post-retirement medical and life insurance benefits., 783242=Frank Partnoy, FIASCO: Blood in the Water on Wall Street (W. W. Norton & Company, 1997, ISBN 0393046222, 252 pages). , 155285=What ever I say here should be taken with a ton of salt, since I have not published in the management accounting area since 1985 or so, and even then the publications, other than one in JAR (1981), were mostly in Operations Research journals. However, I have worked in the industry doing management accounting type work., 358597=No Laffer Matter:  Leftists to Test Obama's Tax Plan in California Will raising taxes to new highs bring in more or less revenue? We hope Nancy Pelosi is watching! \"California as No. 1,\" The Wall Street Journal, July 17, 2008; Page A14 --- http://online.wsj.com/article/SB121625150189660215.html?mod=todays_us_opinion, 580456=\"A Moral Obligation to Retire?\" Inside Higher Ed, July 21, 2008 --- http://www.insidehighered.com/views/2008/07/21/leiter, 141309=Here are a few of things to learn about IFRS 3(R) Quotations taken from IASPlus --- http://www.iasplus.com/pastnews/2008jan.htm#ifrs3, 309174=Herb was born August 11, 1914 which means he will soon be 94 years old. Lenore is 39. She really was a trophy wife even though, in truth, she is nearly as old as Herb. It’s hard to be 39 and celebrate your 70th wedding anniversary., 144002=\"Technology Implications of IFRS adoption for U.S. Companies:  More than a technical accounting change,\" Deloitte White Paper, August 2008 --- http://www.deloitte.com/dtt/article/0%2C1002%2Ccid%25253D219180%2C00.html , 338759=\"Your Tax Bill: How McCain, Obama Differ Capital-Gains Rates Are Likely To Rise, No Matter Who Wins; Far Apart on Estate Taxes.\" by Tom Herman, The Wall Street Journal, June 18, 2008; Page D1 --- http://online.wsj.com/article/SB121374794468982701.html?mod=djem_jiewr_AC, 144639=September 7, 2008 question from Brenda Mallouk [brendamallouk@YAHOO.CA], 867479=A: Invented in 1825, limelight was used in lighthouses and stage lighting by burning a cylinder of lime which produced a brilliant light. In the theatre, performers on stage 'in the limelight' were seen by the audience to be the center of attention.  , 580882=\"The Graying of College Faculties,\" The Becker-Posner Blog, July 6, 2008 --- http://www.becker-posner-blog.com/, 139652=\"IASB and FASB Publish First Major Exposure Draft Standard,\" AccountingWeb, July 11, 2005 --- http://www.accountingweb.com/cgi-bin/item.cgi?id=101084}",
    "lastModified": "Sat, 27 Sep 2008 20:01:04 GMT",
    "textBeforeTable": " American Accounting Association Membership Trends:   July 18, 2008 reply from Roger Debreceny [roger@DEBRECENY.COM] Recent demographic studies of the accounting professorate show that nearly half of AAA members are within five years of retirement; and junior faculty, busy establishing new careers, often spend little time thinking about retirement. Responding to members' interests, this year retirement specialists from TIAA-CREF will offer members of both groups opportunities to learn more about retirement planning. Family members/partners are welcome to attend these sessions as well. Both session are on Wednesday (August 6) at 2:00, one entitled \"Retirement Planning for Faculty 55 and Over\",  and a session for early career faculty designated as \"Retirement Planning for Those Under 55.\" These sessions will both be held in large rooms to accommodate the expected overflow crowds.  While hosted by representatives from TIAA-CREF, you don't have to be a participant in TIAA-CREF to benefit from the sessions.\" http://aaahq.org/AM2008/concurrent08.htm \" 2. RETIREMENT PLANNING SESSIONS FOR BOTH JUNIOR AND SENIOR FACULTY Tracey writes: When I ask some of my retired professor friends why they retired, a common thread has been that the work ethic of many students has declined relative to their grade expectations (demands) and bickering for higher grades --- http://www.trinity.edu/rjensen/HigherEdControversies.htm#GradeInflation But the bottom line reason for some of the",
    "textAfterTable": "                    This table (with the three summary rows I added) shows the 2007 report of AAA KPIs at aaahq.org/about/financials/KeyIndicators8_31_07.pdf .. there are some interesting patterns here. The number of practitioners has gone down by more than 40%. This has been a matter of concern for me for many years. The AAA should be the natural place a well trained, thoughtful accountant should go to for a professional experience that is different than that provided by the AICPA, IIA, ISACA etc. Yet we seem to be able to attract only 600 professional members – a statistical blip. I have spoken to several professionals who are involved with the AAA and  even they seem to think that attracting professionals is a lost cause. I don’t agree and I don’t think we should accept this number. Other similar organizations such as the AEA and ACM have a much higher proportion than we do. New journals such as the Auditing sections new journal (which is already providing much fodder for my classes and my own professional improvement) is the way forward as is a much more targeted approach to marketing to professionals. I think that the AAA Annual Meeting is without parallel in terms of receiving an update on current events .. especially  if one went only to the",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}