{
    "relation": [
        [
            "xsd:double",
            "xsd:float",
            "xsd:decimal",
            "xsd:integer"
        ],
        [
            "xsd:nonNegativeInteger",
            "xsd:nonPositiveInteger",
            "xsd:positiveInteger",
            "xsd:negativeInteger"
        ],
        [
            "xsd:long",
            "xsd:int",
            "xsd:short",
            "xsd:byte"
        ],
        [
            "xsd:unsignedLong",
            "xsd:unsignedInt",
            "xsd:unsignedShort",
            "xsd:unsignedByte"
        ]
    ],
    "pageTitle": "OWL 2 Web Ontology Language Quick Reference Guide",
    "title": "",
    "url": "http://www.w3.org/TR/2009/WD-owl2-quick-reference-20090421/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042991076.30/warc/CC-MAIN-20150728002311-00115-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 812477419,
    "recordOffset": 812461462,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{2268=This Working Draft has numerous editorial changes since the previous version of 02 December 2008. In particular, the presentation has been significantly improved, and the content has been updated to reflect changes in the language specification., 885=This document was produced by a group operating under the 5 February 2004 W3C Patent Policy. This document is informative only. W3C maintains a public list of any patent disclosures made in connection with the deliverables of the group; that page also includes instructions for disclosing a patent. An individual who has actual knowledge of a patent which the individual believes contains Essential Claim(s) must disclose the information in accordance with section 6 of the W3C Patent Policy., 5650=Copyright © 2009 W3C® (MIT, ERCIM, Keio), All Rights Reserved. W3C liability, trademark and document use rules apply.}",
    "TableContextTimeStampAfterTable": "{78236=This document has been produced by the OWL Working Group (see below), and its contents reflect extensive discussions within the Working Group as a whole. The editors extend special thanks to Bernardo Cuenca Grau (Oxford University), Christine Golbreich (Université de Versailles St-Quentin and LIRMM), Ivan Herman (W3C/ERCIM), Bijan Parsia (University of Manchester) and Peter F. Patel-Schneider (Bell Labs Research, Alcatel-Lucent) for their thorough reviews., 78713=The regular attendees at meetings of the OWL Working Group at the time of publication of this document were: Jie Bao (RPI), Diego Calvanese (Free University of Bozen-Bolzano), Bernardo Cuenca Grau (Oxford University), Martin Dzbor (Open University), Achille Fokoue (IBM Corporation), Christine Golbreich (Université de Versailles St-Quentin and LIRMM), Sandro Hawke (W3C/MIT), Ivan Herman (W3C/ERCIM), Rinke Hoekstra (University of Amsterdam), Ian Horrocks (Oxford University), Elisa Kendall (Sandpiper Software), Markus Krötzsch (FZI), Carsten Lutz (Universität Bremen), Deborah L. McGuinness (RPI), Boris Motik (Oxford University), Jeff Pan (University of Aberdeen), Bijan Parsia (University of Manchester), Peter F. Patel-Schneider (Bell Labs Research, Alcatel-Lucent), Alan Ruttenberg (Science Commons), Uli Sattler (University of Manchester), Michael Schneider (FZI), Mike Smith (Clark & Parsia), Evan Wallace (NIST), and Zhe Wu (Oracle Corporation). We would also like to thank past members of the working group: Jeremy Carroll, Jim Hendler, Vipul Kashyap.}",
    "lastModified": "Mon, 20 Apr 2009 20:06:29 GMT",
    "textBeforeTable": "The standard namespaces and prefixes in OWL 2 are 1 Namespaces whether we could find a trick so that we can switch on/off highlight the OWL 1/2 differences and the '?' links that refer to the NF&R. the gray background shading is a little bit disturbing, maybe try other typographic trick, e.g., some lighter colour. Editor's Note: Markup suggestions from Ivan Herman Make a new pdf print version when the guide is finalized. (Media:Quick Reference Guide.pdf) Complete inline hyperlinks to Mapping to RDF Graphs Editor's Note: To do list: 4 Acknowledgments 3.2 Facets 3.1 Built-in Datatypes 3 Built-in Datatypes and Facets 2.9 Deprecated Vocabulary in OWL 2 2.8 OWL Ontologies 2.7 Annotations 2.6 Declarations 2.5 Assertions 2.4 Keys 2.3 Data Ranges 2.2.2 Property Axioms 2.2.1 Property Expressions",
    "textAfterTable": "1st: Feature's name and link to Primer and New Features and Rationale (if applicable)(as \"(N)\") 2nd: functional syntax and link to Syntax 3rd: RDF syntax with link to Mapping to RDF Graphs We use the following notation conventions: unless stated otherwise, \"C\" is an OWL class, \"D\" is a data range, \"P\" and \"Q\" are object properties, \"R\" and \"S\" are data properties, \"a\" is an OWL individual, \"u\" and \"v\" are literals, \"n\" is a non-negative integer, \"_:x\" is anonymous individual. All names may have subscripts. \"(a1 … an)\" in the 3rd column stands for a rdf list. Editor's Note: Christine suggested to use same naming convention as in Syntax, e.g., CE, DR, OPE, DPE, a and lt For an OWL 2 DL ontology, there are some global restrictions on axioms. 2.1 Classes Predefined Classes all OWL individuals owl:Thing owl:Thing empty class owl:Nothing owl:Nothing Boolean Connectives and Enumeration of Individuals intersection ObjectIntersectionOf(C1",
    "hasKeyColumn": true,
    "keyColumnIndex": 1,
    "headerRowIndex": 0
}