{
    "relation": [
        [
            "Patent application number",
            "20090094727",
            "20110197331"
        ],
        [
            "Description",
            "Body Form-Fitting Rainwear - A body form-fitting rainwear is provided. In the rainwear a first waterproof layer comprises a polymer material treated with an oleophobic composition to form an air permeable polymer material. The first waterproof layer couples to a first fabric layer. The first fabric layer faces the body and couples to a first side of the first waterproof layer. A second fabric layer couples to a second side of the first waterproof layer. A stretch knit couples to the second fabric layer, the stretch knit being constructed to pull the rainwear to the body. The first waterproof layer, first fabric layer, second fabric layer and stretch knit are formable about a human body and are constructed to accommodate one or more human appendages. The rainwear may for example form a shirt, pant, underwear, long underwear, hat hood or one piece body suit.",
            "Body Form-Fitting Rainwear - Body form-fitting rainwear, comprising: a fabric layer and a stretch knit layer, and at least one air permeable, polymer treated waterproof layer between, the three layers formed into the rainwear."
        ],
        [
            "Published",
            "04-16-2009",
            "08-18-2011"
        ]
    ],
    "pageTitle": "Reynolds, US - Patent applications",
    "title": "",
    "url": "http://www.faqs.org/patents/inventor/reynolds-us-5/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042982502.13/warc/CC-MAIN-20150728002302-00224-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 431827815,
    "recordOffset": 431795482,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Eric M. Reynolds, Boulder, CO US 12-04-2008 Seat System With Shock- And Vibration-Reducing Bladders - A seat system has separate air bladders in the seat bottom and seat back. The seat bottom bladder is in fluid communication with the seat back bladder through a plurality of rigid interconnecting tubes, and valves in the tubes or orifice size can control flow rate of air exchange between the seat bottom bladder and the seat back bladder. A panel of resilient, compressible open cell foam extends in each of the seat bottom bladder and the seat back bladder. Through-holes in the foam panel permit accelerated air evacuation to the other bladder when the seat withstands a significant shock event. The vibration and shock attenuation characteristics of the seat are jointly provided by the panel spring force and the bladder air pressure. 20080296946 Published Description Patent application number Douglas D. Reynolds, Las Vegas, NV US 07-16-2009 Reception Boosting Accessory - A carrying case for a portable electronic device includes a coupling element that couples to an antenna of the device without establishing a direct electrical connection. The coupling element increases the reception of the device by increasing the effective size of the antenna. The coupling element is designed to correspond to the reception capabilities of the device for which the case is designed. Preferably, the coupling element is a copper foil that is positioned in the case such that",
    "textAfterTable": "Patent applications by Eric M. Reynolds, Boulder, CO US Gillian Althea Maria Reynolds, Wilmington, DE US Patent application number Description Published 20100119435 Processes for growing carbon nanotubes in the absence of catalysts - Processes for increasing the production rate of single-wall carbon nanotubes using a disordered carbon target are disclosed. The processes use a disordered carbon target and include vaporization of the target in the presence of a non-oxidizing gas. The single-wall nanotubes produced can be incorporated into electronic devices such as diodes and transistors. 05-13-2010 20100219738 Process for Improving the Oxidation Resistance of Carbon Nanotubes - The disclosure relates to processes for the electrochemical modification of electron emitting materials such as carbon nanotubes. The processes improve the oxidation resistance of the electron emitting materials when they are fired in an oxygen-containing atmosphere such as air. The disclosure also relates to the preparation of cathodes or cathode assemblies, for use in a field emission device, wherein are contained an electron field emitter made from such electron emitting material. 09-02-2010 20100239490 Processes for growing carbon nanotubes using disordered carbon target - Processes for producing single-wall carbon nanotubes without catalysts are provided. The nanotubes are",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}