{
    "relation": [
        [
            "Categories",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "For fun one can go bowling, swimming, arcade, ping pong bat mitten,basketball court, dance studio, soccer and everything else you can think of.",
            "The food is good. there is a high diversity in food and it is different everyday.",
            "I LOVE dorm life. My floor is a family. We all connected the very first day. We are comfortable enough to walk into each others room if we need help with something or if we just want to chill. I recommend it for everyone.",
            "This is my first year and I enjoy the class sizes and the teachers. I was able to get all the classes I needed and the councilors were very helpful with answering my questions.",
            "If your wondering if this is he school for you, i can guarantee it is. this school has clubs and classes for everyone.",
            "SJSU is a school for students who like diversity, school spirit, and teachers willing to go out of their way to help you. I am currently dorming at the school and I love it! My floor mates and I are a family and it's an experience everyone should have during their college carrier."
        ]
    ],
    "pageTitle": "San Jose State University (SJSU) Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/San-Jose-State-University/reviews?_escaped_fragment_=/show/86690",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 125,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042991076.30/warc/CC-MAIN-20150728002311-00238-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 896445535,
    "recordOffset": 896285363,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{810005=I am actually a part of the Pilipino-American Organization, Akbayan of SJSU as Secretary for the 2013-2014 school year and I love it. There are other clubs and activities at school and they all provide great opportunities and you will meet people that are so open and welcoming. I love the organization I am in because it is like a giant support system. I was in internship and I have a big like in Greek Life, but its not Greek Life and the only thing you pay for is a one time general membership fee every school year., 652281=Established in 1857. Rank no. 16 in California. Rank no. 243 nationwide., 652022=Rank as no. 16 in California and founded in 1857 is something to be impress., 900067=© 2015, Cappex.com, LLC}",
    "textBeforeTable": "06/05/2009 Reviewer is Researching this school. Reviewer has been to campus. 39 out of 41 people found this review useful. 1 of 206 John from Los Gatos, CA Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp",
    "textAfterTable": "Tips for prospective students - If your a local - be sure you check out other schools. Not saying this isn't a good school (especially journalism, in the top 10 in the state), BUT just dont' regret not going away, like myself. - Hang out on campus - Join a club - Get involved - Enjoy the concerts and such in the Spartan Complex - Get ready for a bunch of marijuanna clubs handing out their business cards/deals around campus! =P - 30 in from the beach/Santa Cruz Boardwalk - GO OFTEN! - 45 min from San Francisco - see the Golden Gate Bridge and other historical sights. Great shopping/food there. SEE ALCATRAZ Bang for the buck I think tuition is ridiculous at any school. I've never opened a book for ANY of my classes (so if you want - go ahead and save a few bucks there). That being said.... teachers/classes are decent. YES there are a few shitty teachers - you will probably have one each semester. BUT a majority are pretty decent - as long as you remember they are human too, they are there to teach you, and you RESPECT them. Am enjoying being here Awesome place for commuter students who work. I happen to work downtown, so it's got a pretty central",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}