{
    "relation": [
        [
            "Religion",
            "Catholic",
            "Mainline Protestant",
            "Evangelical Protestant",
            "Other",
            "None"
        ],
        [
            "Adherents",
            "5,866",
            "4,580",
            "1,717",
            "111",
            "8,506"
        ],
        [
            "Congregations",
            "13",
            "20",
            "12",
            "3",
            "-"
        ]
    ],
    "pageTitle": "Yutan, Nebraska (NE 68073) profile: population, maps, real estate, averages, homes, statistics, relocation, travel, jobs, hospitals, schools, crime, moving, houses, news, sex offenders",
    "title": "",
    "url": "http://www.city-data.com/city/Yutan-Nebraska.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042982502.13/warc/CC-MAIN-20150728002302-00227-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 359349443,
    "recordOffset": 359227517,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{15109=Air Quality Index (AQI) level in 2012 was 92.1. This is worse than average., 41817=According to our research of Nebraska and other state lists there were 6 registered sex offenders living in Yutan, Nebraska as of July 28, 2015. The ratio of number of residents in Yutan to the number of sex offenders is 198 to 1., 12290=Particulate Matter (PM10) [µg/m3] level in 2012 was 25.2. This is worse than average. Closest monitor was 14.6 miles away from the city center., 608=Graphs represent county-level data. Detailed 2008 Election Results, 5281=Educational Attainment (%) in 2013, 2036=1996 Presidential Elections Results, 4883=School Enrollment by Level of School (%) in 2013, 11535=Particulate Matter (PM2.5) [µg/m3] level in 2012 was 9.47. This is about average. Closest monitor was 17.6 miles away from the city center., 163169=We are giving away $1200 in prizes - enter simply by sending us your own city pictures!, 1464=2004 Presidential Elections Results, 60596=Incorporated on 04/25/1884, 13721=Sulfur Dioxide (SO2) [ppb] level in 2012 was 2.36. This is worse than average. Closest monitor was 14.0 miles away from the city center., 892=2012 Presidential Elections Results, 14459=Carbon Monoxide (CO) [ppm] level in 2012 was 0.207. This is significantly better than average. Closest monitor was 22.1 miles away from the city center., 12990=Ozone [ppb] level in 2012 was 27.3. This is about average. Closest monitor was 21.0 miles away from the city center., 28116=On 5/6/1975, a category F4 tornado 17.8 miles away from the city center killed 3 people and injured 133 people and caused between $50,000 and $500,000 in damages., 10784=Lead (Pb) [µg/m3] level in 2002 was 0.0298. This is significantly worse than average. Closest monitor was 20.9 miles away from the city center., 1750=2000 Presidential Elections Results, 60490=Elevation: 1174 feet, 1178=2008 Presidential Elections Results, 28392=On 8/13/1952, a category F4 (max. wind speeds 207-260 mph) tornado 9.6 miles away from the Yutan city center injured 20 people and caused between $50,000 and $500,000 in damages.}",
    "TableContextTimeStampAfterTable": "{14274=7.51% of this county's 2010 resident taxpayers moved to other counties in 2011 ($33,763 average adjusted gross income), 43202=Recent home sales, price trends, and home value evaluator powered by Onboard Informatics © 2015 Onboard Informatics. Information is deemed reliable but not guaranteed.   City-data.com does not guarantee the accuracy or timeliness of any information on this site.  Use at your own risk. Website © 2015 Advameg, Inc., 12451=6.68% of this county's 2011 resident taxpayers lived in other counties in 2010 ($42,453 average adjusted gross income)}",
    "textBeforeTable": "Religion statistics for Yutan city (based on Saunders County data) Graphs represent county-level data. Detailed 2008 Election Results 2012 Presidential Elections Results 2008 Presidential Elections Results 2004 Presidential Elections Results 2000 Presidential Elections Results 1996 Presidential Elections Results 2012 2008 2004 2000 1996 Presidential Elections Results Wood (1%) Bottled, tank, or LP gas (2%) Electricity (47%) Utility gas (50%) Most commonly used house heating fuel:",
    "textAfterTable": "Source: Clifford Grammich, Kirk Hadaway, Richard Houseal, Dale E.Jones, Alexei Krindatch, Richie Stanley and Richard H.Taylor. 2012. 2010 U.S.Religion Census: Religious Congregations & Membership Study. Association of Statisticians of American Religious Bodies. Jones, Dale E., et al. 2002. Congregations and Membership in the United States 2000. Nashville, TN: Glenmary Research Center. Graphs represent county-level data Food Environment Statistics: Number of grocery stores: 7 Saunders County: 3.48 / 10,000 pop. Nebraska: 2.60 / 10,000 pop. Number of convenience stores (no gas): 1 Saunders County: 0.50 / 10,000 pop. Nebraska: 0.44 / 10,000 pop. Number of convenience stores (with gas): 13 Saunders County: 6.46 / 10,000 pop. State: 4.83 / 10,000 pop. Number of full-service restaurants: 16 Here: 7.95 / 10,000 pop. State: 7.76 / 10,000 pop. Adult diabetes rate: This county: 8.4% Nebraska: 7.9% Adult obesity rate: Saunders County: 28.3% Nebraska: 28.0%",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}