{
    "relation": [
        [
            "Part #",
            "RS485",
            "RS485",
            "RS485",
            "RS485",
            "RS485"
        ],
        [
            "Distributor",
            "Radwell",
            "Radwell",
            "Radwell",
            "National Microchip",
            "Radwell"
        ],
        [
            "Manufacturer",
            "B&b Electronics",
            "Wizardry Inc",
            "Cutler Hammer",
            "Not Provided",
            "Eurotherm Controls"
        ],
        [
            "Product Category",
            "Panel Accessories, Panel Accessory",
            "Controls & Indicators, Control/Interface Board",
            "Not Provided",
            "Not Provided",
            "Not Provided"
        ],
        [
            "Description",
            "CONVERTER RS-485/RS-232 TO FIBER",
            "PC BOARD SERIAL INTERFACE",
            "CONTROL",
            "Not Provided",
            "CABLE"
        ]
    ],
    "pageTitle": "RS485 | Products & Suppliers | IHS Engineering360",
    "title": "",
    "url": "http://www.globalspec.com/industrial-directory/rs485",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042982502.13/warc/CC-MAIN-20150728002302-00262-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 461138259,
    "recordOffset": 461107058,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{97224=Description: ASCII command support for all 1-Wire devices. RS232 and RS485 interface options. Parasitically (RS232) or externally powered. Automatically adjusts for variable 1-Wire bus conditions. Automatically provides smart strong-pull-up for wired sensors. 1000 feet, 100 devices per CAT-5 twisted pair}",
    "textBeforeTable": "Parts by Number Top",
    "textAfterTable": "More >> Conduct Research Top RS485 RS485 is almost identical to RS232 except that transmissions are three-way rather than two-way. RS485 is often used in applications where a single controller needs to control multiple devices. Up to 64 devices may be connected with RS485. An enhanced version of RS422, RS485 is compatible Designing RS-485 Circuits When a network needs to transfer small blocks of information over long distances, RS-485 is often the interface of choice. The network nodes can be PCs, microcontrollers, or any devices capable of asynchronous serial communications. Compared to Ethernet and other network interfaces, RS-485's Serial Interface (RS232, RS422, RS485) Serial interfaces transmit data one bit at a time. Common standards include RS232, RS422, and RS485. The RS232 standard is approved by the Electronic Industries Association (EIA) for connecting serial devices. The device that connects to the interface is called data communication equipment (DCE RS-485 Masterclass - What is it and Why use it? In February 2015 MD of Brainboxes, Eamonn Walsh, presented a series of lectures with the Institute of Measurement and Control relating to the benefits and common issues of RS-485 in industry. Part 1 of his lecture looked",
    "hasKeyColumn": true,
    "keyColumnIndex": 2,
    "headerRowIndex": 0
}