{
    "relation": [
        [
            "Patent application number",
            "20090214378",
            "20110067527"
        ],
        [
            "Description",
            "METHOD FOR THE PRODUCTION OF VALVE METAL POWDERS - The present invention relates to a process for the deoxidation of valve metal primary powders by means of reducing metals and/or metal hydrides, and a process for the production of tantalum powders that are suitable as anode material for electrolytic capacitors.",
            "METHOD FOR PRODUCTION OF NIOBIUM AND TANTALUM POWDER - Process for the production of valve metal powders, in particular niobium and tantalum powder, by reduction of corresponding valve metal oxide powders by means of vaporous reducing metals and/or hydrides thereof, preferably in the presence of an inert carrier gas, wherein the reduction is performed at a vapour partial pressure of the reducing metal/metal hydride of 5 to 110 hPa and an overall pressure of less than 1000 hPa, and tantalum powder obtainable in this way having a high stability of the powder agglomerate particles."
        ],
        [
            "Published",
            "08-27-2009",
            "03-24-2011"
        ]
    ],
    "pageTitle": "Haas, DE - Patent applications",
    "title": "",
    "url": "http://www.faqs.org/patents/inventor/haas-de-5/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042991076.30/warc/CC-MAIN-20150728002311-00205-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 442022875,
    "recordOffset": 441984683,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Helmut Haas, Schladen-Beuchte DE 01-22-2009 HIGH-VOLTAGE FUSE - The invention relates to a high-voltage fuse comprising a tubular ceramic insulating member that is provided with at least one fusible element, an inner auxiliary cap which is placed on the insulating member and at least partly covers the outer surface of the insulating member in the front area of the insulating member, and an outer top cap that is placed on the auxiliary cap and at least partly covers the outer surface of the auxiliary cap. The insulating member is provided with at least one depression. The auxiliary cap is molded against the insulating member such that a positive connection to the insulating member is created in the depression. The auxiliary cap and the top cap are molded in the area of said depression in such a way that a positive connection is created. In order to create a high-voltage fuse which ensures that the insulating member is covered so as to be tight towards the outside even at elevated temperatures, a sealing means is provided in the depression while the top cap and/or the auxiliary cap are molded against the sealing means in said depression. 20090021339 Published Description Patent application number Heinz-Ulrich Haas, Olfen DE //]]> BarDraw('3214476',['Patent applications by Heinz Haas, Regensburg DE'],[[1,1,1]],['2007','2009','2011'],0); // <script type=\"text/javascript\"> </div> <div id=\"legend3214476\" align=\"center\"></div> </div> <canvas id=\"bg3214476\" style=\"max-width: 500px; width: 100%;\"></canvas> <div> <p align=\"center\">Patent applications by Heinz Haas,",
    "textAfterTable": "Patent applications by Helmut Haas, Schladen-Beuchte DE Helmut Haas, Achim DE Patent application number Description Published 20100068510 SEMIFINISHED PRODUCTS WITH A STRUCTURED SINTER-ACTIVE SURFACE AND A PROCESS FOR THEIR PRODUCTION - The invention comprises semifinished products with a structured surface, the semifinished product comprising an oxidized and subsequently re-reduced surface containing at least one refractory metal, and also a process for their production and their use for producing high-capacitance components. 03-18-2010 20110123822 NANOSIZE STRUCTURES COMPOSED OF VALVE METALS AND VALVE METAL SUBOXIDES AND PROCESS FOR PRODUCING THEM - A strip-like or sheet-like valve metal or valve metal suboxide structure which has a transverse dimension of from 5 to 100 nm. 05-26-2011 20140185190 METHOD FOR PRODUCING ELECTROLYTIC CAPACITORS FROM VALVE METAL POWDERS - A process for producing an anode for an electrolytic capacitor includes pressing a tantalum powder around a tantalum wire, a tantalum ribbon, or a tantalum sheet to form a pressed body. The pressed body is sintered to form a porous sintered body. The porous sintered body is cooled to form a cooled porous sintered body. The cooled porous sintered body is treated with at least one oxidant comprising at least one of a",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}