{
    "relation": [
        [
            "Categories",
            "Campus Safety",
            "Great for these types of students",
            "Bang for the buck",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "never heard of any major accident (or minor, for that matter) on this campus. plus, if there is, the fire department is super close.",
            "fresh out of high school and want to save up for a 4-year university when they pick a degree. go here if you just wanna look around and see what you're interested in. anyone who wants to take classes just for the fun of it. people who can break out of their shell and get others to break out of theirs.",
            "cheap school and a good education, i'd only recommend going for a general's degree, though. anything else you'll probably want a university on your records. food is way overpriced for the quality and quantity.",
            "have super awesome sleepovers at friend's houses when their parents are away or when they have to house-sit for a relative. play at the lds institute - free games, free food, the occasional dance. slcc itself doesn't offer any formal dances, though, which is a shame. but they do occasionally have activities, but i don't personally find them of much interest. road trips with friends! the taylorsville rec center isn't too far, and that's always a blast. infinity center (formally studio 600) is somewhat popular among slcc students, it's a great place to go learn country swing (not recommended if you're a big band fan)! weekend camp-outs. study parties (more fun than it sounds, really!).",
            "eh, bring your own lunch and snacks. they're stuff isn't bad, but it's way too over-priced. go to the lds institute for free food!",
            "non-existent. they don't have dorms.",
            "generally i've had great teachers who have taught at other high-end universities such as university of utah and columbia university.",
            "try to have a good time - party it up! taylorsville (the city slcc is located in) isn't a college town so you have to try to make friends and have a good time, it won't just come to you. i've made some of my best friends here, but you have to be willing to break out of your shell. warning: can sometimes feel like a grown-up high school. wouldn't recommend if you're coming from a 4-year university, but for those fresh out of high school, it's a good transition from a high school feel to a semi-college feel.",
            "a typical community college. fun if you try to make friends, anti-social if you don't. teachers are generally very good at teaching."
        ]
    ],
    "pageTitle": "Salt Lake Community College Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Salt-Lake-Community-College/reviews?_escaped_fragment_=/show/21921",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042982502.13/warc/CC-MAIN-20150728002302-00339-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 872801351,
    "recordOffset": 872679911,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{53228=Great! The monthly tuition for a full time student (12-18 credits) is only $1466. At Utah Valley University it was $2380. Almost all the professors are Adjunct Professors meaning they get no benefits and less pay. So the professors are all there because they love to teach and work with students., 4913=My tips would be to develop good study habits (classes such as LE 1020 are good to take for college freshmen and everyone else), learn of the various resources on campus, start school with a good attitude, and set goals and achieve them., 784701=Salt Lake Community College had a food court in every campus. There's a grill, cafe, pizzeria, deli, and a coffee shop provided to students. I personally have not tried most of the food within the food court in SLCC but I have tried the cajun fries at the Champions Grill and it was absolutely amazing. It seems to always be filled with students so i'm guessing the food at the Bruin food court is absolutely amazing., 541628=If you are going to apply for financial aide, do it fast! Sign up for classes at 12:01 am of the day you can sign up. Work hard and do your best!, 13590=The best part of SLCC is the low cost of tuition. Currently tuition for 12-18 credits is about $1,400. Compared to the University of Utah for example, that's about $1000-$1900 difference! Students can get a great 2-year education relatively cheap and either transfer to a 4-year college or stop at graduation. Either way they save money!, 685858=SLCC is definitely worth your time & money. A full time student will pay about 1700 dollars, pre books, for a semester. It's a great deal compared to other colleges!, 540156=It's Utah! You can ski, snowboard, water-ski, hike, swim, snow-shoe, rock climb, bike, run, see a REAL game, the Jazz, tour the 2002 Olympic sites..., 756582=The tuition for a semester was about $1300 depending on how many classes you take. This price was for 12 semester hours., 216329=Classes are usually pretty cheap. To take 12 credit hours worth of classes is only about 1500 dollars. Books are a bit expensive, but you can buy them used, and then sell them online. Also, students at SLCC have an option to purchase a discounted pass to ride the trax train which goes across the valley, making for an easy method of transportation., 790741=© 2015, Cappex.com, LLC, 31840=During high school I took Math 2210/Multivariate Calculus and Math 2250/Differential Equations and Linear Algebra from SLCC during release time. The classes were excellent. They were at least as rigorous as the equivalent courses at other Utah schools and probably more so, since they met 5 hours a week even though they were only articulated as 3 and 4 credit classes. Dr. Ronald McKay isn't the best math teacher, but he's extremely friendly and very good at explaining things in simple, understandable terms. You can go to Dr. McKay for anything, and he knows you personally and inquires after you as a friend. Dr. Costello isn't as friendly and is prone to long, irrelevant tangents, but he's a math teacher par excellence. Dr. Costello proves and derives EVERYTHING, so you learn the fundamentals from him and thus understand the material more than you would otherwise., 765151=Very cheap college a full time semester (12 credits) cost me $1700, 311486=Average cost for 12 credits is 1500 dollars. They give you a reasonable price for the credits you receive., 454099=Intro classes are not bad. As you move up though into the 2000 level classes, difficulty level does rise., 464954=Depending on your major, you may have to take courses that are a bit rigorous. For example English 2010 was pretty intense, as well as any college level physics course. Other than that if you study hard enough you'll do just fine at Salt Lake Community College.}",
    "textBeforeTable": "08/07/2009 Reviewer is A current student here. 5 out of 5 people found this review useful. 1 of 199 Mikenzie from Taylorsville, UT Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for",
    "textAfterTable": "Bang for the buck Colleges are expensive, and Salt Lake Community College is no exception. Tuition is getting higher every year. And with the textbook and student fees, it would almost seem like students would have to pay a million dollars every semester. However, there are many scholarships out there about which few students know. Fastweb is a search engine that collects scholarship information specifically for a student and gives him/her the link to apply for the scholarship. Salt Lake Community College gives scholarships specifically for its students. The financial aid office, located on the second floor of the student center, is a good place to inquire about scholarship information, including FAFSA. Am enjoying being here There are so many resources, especially in the Taylorsville Redwood campus, for students just starting out. Each building has something that can somehow help students. The student center is the main building, and it has everything for every student. There are volunteer opportunities that students can take advantage of with the Thayne Learning Center, free health check-ups with the health and wellness center, a financial aid office that helps students with financial aid such as FAFSA or general scholarships, and so much more. There are various computer labs in various areas that students can use for free. In the administration building, there is an office that aids students",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}