{
    "relation": [
        [
            "Categories",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "There are many tourist attractions and historical landmarks in Philadelphia, and there are many bars and restaurants near campus. New York and Washington DC are both 2 hours away.",
            "The dining plans are expensive and provide low-quality food for how much you pay. Many people avoid full dining plans after their freshman year.",
            "The dorms are nothing special, but they are nice enough for one year.",
            "The classes are very comprehensive and difficult, but the professors are very intelligent and creative. They provide a great learning experience.",
            "I would recommend that prospective students fill out their applications in such a way that they stand out. There are many high-level students applying to Penn, and you need to make yourself stand out.",
            "University of Pennsylvania is an excellent place to go to school. The academics are second to none, there is some sort of social activity for everyone, and the campus is beautiful. Nestled in University City, Penn offers all the resources of Philadelphia with a secluded, college campus feel."
        ]
    ],
    "pageTitle": "University of Pennsylvania Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/University-of-Pennsylvania/reviews?_escaped_fragment_=/show/102533",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042982502.13/warc/CC-MAIN-20150728002302-00225-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 871396015,
    "recordOffset": 871325789,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{144513=Awesome social experience, whether or not you're on a hall with people that become your best friends. I was on a particularly quiet hall. Though I was disappointed at first, I soon came to appreciate the peacefulness of my living environment. Every time I wanted to get rowdy, I'd walk down the hall or across the quad to my friends' halls. My room was the size of a closet and we had co-ed, less than desirable bathrooms, but the experience of living with over 1000 other freshman in a 1800s castle was well worth it. Being able to walk outside and sit on the grass on a sunny day to listen to music or do your homework while your best friends surround you playing frisbee or walking to class is an unmatchable freedom., 285296=There are three dining areas at each end and the middle of campus. 1920 Commons was hit or miss but Hill was pretty good., 317513=© 2015, Cappex.com, LLC, 114313=Meal plans for those who don't have the patience to cook for themselves, and an excellent selection of restaurants which cater to the college crowd. There are even a few places which are open until 4:30 AM!, 57146=If you can, AVOID 1920 COMMONS. The food is terrible. Youre better off going to Hill or Houston., 131867=SAT scores are not everything to this school. I admit I did not have the best score for applying to this school (1900 and 30 ACT) it didn't stop me from applying. Keep your hopes up, be active in your home, school and community and it will give you that fighting chance.}",
    "textBeforeTable": "07/12/2009 Reviewer is A current student here. 76 out of 81 people found this review useful. 1 of 75 Katherine from Murrieta, CA Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5",
    "textAfterTable": "Categories Comments Great for these types of students This school is great for outgoing students who know when to party and when to buckle down and study. You need to like living in a city and being around a diverse group of people. Penn really loves students who are passionate so show that on your application and in whatever you get involved in at Penn. Tips for prospective students Penn and college in general is an adjustment. I had to get used to pacing out my coursework and figuring out how to study for classes where a midterm and a final are your grades! (Yeah it is scary). My tips would be to not over schedule yourself your first semester. You are going to want to get involved in a lot on campus and in your dorm, so try and take a lighter load. Also don't be afraid to talk to your professors. They are great about offering extra help and resources or just chatting about their research. Use the office hours they provide. Lastly, make sure to remember that college is a time to try new things. Don't be afraid to join a dance group or volunteer at a homeless shelter. Explore the world around you. Bang for the buck I know that many students feel like",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}