{
    "relation": [
        [
            "Date",
            "Jan 23, 2006",
            "Jul 25, 2014",
            "Dec 9, 2014"
        ],
        [
            "Code",
            "AS",
            "FPAY",
            "AS"
        ],
        [
            "Event",
            "Assignment",
            "Fee payment",
            "Assignment"
        ],
        [
            "Description",
            "Owner name: MICROSOFT CORPORATION, WASHINGTON Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNORS:BELALI, MOHAMED;STINNETT, CORT WHITNEY;NICHOLSON, CLARK D.;REEL/FRAME:017050/0685;SIGNING DATES FROM 20060110 TO 20060111",
            "Year of fee payment: 4",
            "Owner name: MICROSOFT TECHNOLOGY LICENSING, LLC, WASHINGTON Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNOR:MICROSOFT CORPORATION;REEL/FRAME:034543/0001 Effective date: 20141014"
        ]
    ],
    "pageTitle": "Patent US7895309 - Network event notification and delivery - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US7895309?dq=645576",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042991076.30/warc/CC-MAIN-20150728002311-00012-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 470667887,
    "recordOffset": 470622532,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{6289=If in wake mode at step 1106, the system is awakened at step 1109. Once the system is awakened, a filter policy may be run on the packet, as represented by step 1110 of FIG. 11B. Although the filter policy may have many possible outcomes, e.g., ignore or delete junk mail, FIG. 11B represents two possible outcomes, namely one that downloads the full email (step 1111) or one that downloads only the headers (step 1120). A notification policy may then be run to determine if the user should be notified of one or more of the downloaded emails in steps 1112 and 1121. If the user should be notified, a user notification is represented (step 1113 or step 1122), as well as the writing of data, typically the header data, to an available auxiliary display (step 1114 or step 1124). The system is restored to its sleep state via step 1116 or step 1126, either of which returns to step 1102 of FIG. 11A.}",
    "TableContextTimeStampAfterTable": "{100199=Further, in this example, estimates are based on a power average (Pavg) of 0.865 watts for an event notification subsystem system with Direct Push enabled while in S3-like sleep state, e.g., normal S3 plus USB wake plus WWAN wake, but not sending/receiving. In this example, the power average of an event notification subsystem system using the poll mode while in S3 is 0.5 watts, while the power average of an enabled system while in S0 is 6.0 watts, assuming the lid is closed and the main display is off. Other estimates for this example include a wake (S0) time for each notification of 120 seconds. With such a wake time, the average time between notifications Tavg based on ten hours per day for a light user is 1500 seconds (25 minutes), for a medium user is 600 seconds (10 minutes), and for a heavy user is 360 seconds (6 minutes). An estimate for the size of the battery in an event notification subsystem system comprises 6 cells of 8.4 watt-hours/cell for a total of 50.4 watt-hours., 109038=“Blackout period wake events” comprises a setting that in one implementation is not enabled or configured by default, but rather requires advanced interaction to enable, and possibly define. A blackout period defines a time period during which event notification subsystem feature is not needed. During a blackout period, the event notification subsystem is disabled, e.g., from 9:00 PM to 6:00 AM if another period is not chosen. The blackout time may be passed to the network subsystem as global time, to help with travel situations. If mail and/or calendar notifications have been queued up during a blackout period, the network subsystem will trigger a wake notification at the end of a blackout period; queued up notifications may be delivered to Auxiliary display in a single batch. If enabled, the blackout period enhances the system battery life and avoids notifying the user at inopportune times. Blackout or an equivalent setting may be used to turn off the system and/or radio in other environments, e.g., so the computer can be prevented from communicating yet still be used in other ways during an airplane flight.}",
    "textBeforeTable": "Patent Citations While the invention is susceptible to various modifications and alternative constructions, certain illustrated embodiments thereof are shown in the drawings and have been described above in detail. It should be understood, however, that there is no intention to limit the invention to the specific forms disclosed, but on the contrary, the intention is to cover all modifications, alternative constructions, and equivalents falling within the spirit and scope of the invention. Operation is not allowed. 53 LR_ERROR_OPERATION_NOT_ALLOWED Incorrect activation code. 52 LR_ERROR_INVALID_ACTIVATION_CODE Incorrect lock code. 51 LR_ERROR_INVALID_LOCK_CODE unlocked. WWAN device has already been 50 LR_ERROR_DEVICE_ALREADY_UNLOCKED locked. WWAN device has already been 49 LR_ERROR_DEVICE_ALREADY_LOCKED promptly. WWAN device is not activated 29 LR_ERROR_ACTIVATION_FAILED Internal file access error. 28 LR_ERROR_FS_ERROR WWAN device is not present. 27 LR_ERROR_DEVICE_NOT_AVAILABLE access error. Internal none volatile memory 26",
    "textAfterTable": "US20010003828 * Oct 28, 1997 Jun 14, 2001 Joe Peterson Client-side system for scheduling delivery of web content and locally managing the web content US20020104095 Jun 27, 2001 Aug 1, 2002 Loc Nguyen On-remote-control email and other service indicator methods, systems, and devices US20020162024 * Jan 24, 2001 Oct 31, 2002 Francois Cunchon Secure multiapplication proxy US20020174184 Apr 25, 2001 Nov 21, 2002 Avaya, Inc. Mailbox access mechanism over low-bandwidth, high-latency wireless networks US20030126216 Sep 6, 2002 Jul 3, 2003 Avila J. Albert Method and system for remote delivery of email US20030225782 * Jun 4, 2003 Dec 4, 2003 Mucfaden Michael R. Managing configuration state within a network node US20040128310 * Dec 30, 2002 Jul 1, 2004 Zmudzinski Krystof C. Method and apparatus for distributing notification among cooperating devices and device channels US20040133651 Dec 5, 2003",
    "hasKeyColumn": true,
    "keyColumnIndex": 2,
    "headerRowIndex": 0
}