{
    "relation": [
        [
            "Pos",
            "1",
            "2",
            "3",
            "4",
            "5",
            "6",
            "7",
            "8"
        ],
        [
            "Car Number",
            "9",
            "50",
            "5",
            "59",
            "18",
            "x70",
            "1",
            "77"
        ],
        [
            "Name",
            "Jim Miller",
            "Jay Woolworth",
            "Michael Walther",
            "Russell Dice",
            "Harold Patrick Jr.",
            "Matthew Salogar",
            "Pat Dent",
            "Ronald Heeney"
        ],
        [
            "Behind Leader",
            "",
            "0.472",
            "0.751",
            "1.139",
            "1.503",
            "1.780",
            "2.956",
            "--1 Lap--"
        ],
        [
            "Gap",
            "",
            "0.472",
            "0.279",
            "0.388",
            "0.364",
            "0.277",
            "1.176",
            "--1 Lap--"
        ]
    ],
    "pageTitle": "Spartan Speedway 2005 Archive Race Recap",
    "title": "",
    "url": "http://spartanspeedway.com/numbers/2005recap.php?id=571",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988317.67/warc/CC-MAIN-20150728002308-00266-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 227536804,
    "recordOffset": 227520847,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{1320=Anyone who wasn’t at Spartan Speedway on Sunday night missed 155 laps of combined feature racing in the Superpro, Super Late Model, Street Stock Slugfest, and the crazy Figure 8 division. The pit was jammed packed with cars, ready to duke it out on the ¼ asphalt oval in Mason, MI. Twenty-three Andrews Chevrolet Super Late Models lined up for their 40-lap feature, with pole-sitter, Jimmy Gallagher, leading them down for the start. The entire field was nose to tail by lap five with Gallagher still showing the way. Bob Bauer was keeping pace, with Stan Perry, Jeff Hackworth, and Chris Place hot on his heels. The top five broke away from the field, with Gallagher putting a little daylight between second place and himself by lap 10. Lap 25 had the leaders catching the rear of the field and Bauer had reeled in Gallagher by lap 27. Caution on lap 29 closed up the field with Bauer trying everything to get around Gallagher, but Gallagher fought him off to finish ahead of Bauer, Perry, Hackworth, and Place. Heat winners were George Rangel, Tim Ryan, and Jeff Hackworth. The last chance race was won by Bryan Clay, while Dale Lewis, Doc Dutton, and George Rangel won transfer spots into the feature. Twenty-one template-bodied Superpros came down to take the green flag with Tommy Cook jumping out to lead lap one. Jake Louden, Jim Davis, and Rob Buckley began their bid for the top spot with Louden issuing a challenge for the lead on lap 10. Buckley wasn’t content sitting in third, and began his move to the front. He made his way around Louden for 2nd on lap 16 and poked his nose under Cook, trying to grab that top spot. Lap 21 saw the leaders moving through traffic, with Cook able to use slower cars to stop the advances of Buckley. The top three had opened up a bit of an advantage over the rest of the field, with Justin Kazmar and Logan Beckwith rounding out the top five as laps began to wind down. Cook slipped high on the track on lap 40, allowing Buckley to pull alongside. Cook once again used a lapped car as a pick and maintained his lead. Lap 42 saw Buckley move inside of Cook and they ran side by side for the next three laps. Caution came out as Buckley was trying to complete the pass. Buckley outran Cook on the restart, Cook once again slid up the track a bit, Louden slipped under him, lost an engine two laps later, giving the third position to Kazmar. At the checker, it was Buckley, Cook, Kazmar, Beckwith, and Shaun Whitney as the top five. Thirty-four Performance Automotive Northwest Street Stocks gave it their best shot to make the twenty car field for the 40-lap Slugfest. The wily veteran, Jay Woolworth, grabbed the early lead as Matt Salogar, Pat Dent, and Mike Walther tried to make it three-wide through turns one and two on lap two. They continued on until caution came out for Dent and Walther on lap five, moving Salogar into second. Kyle Hayden made his charge to the front to sit in second by lap eight. Robbie Johnston had begun his march through the field, and found himself in fourth by lap 10, while setting his sights on Scott Sigman for third. Sigman ran up the track on lap 13, as Johnston hugged the bottom and slipped around him into third. Johnston made his way around Hayden and Woolworth on the restart. Dane Long got around Mike Ammerman, who had been running solidly in fifth and zeroed in on Sigman for fourth on lap 25. Johnston opened up a two second lead over Hayden, Woolworth, Long, and Sigman by lap 30. As laps ticked off toward the finish, Long grabbed third from Woolworth, who fought back, as Long looked under Hayden with Woolworth running the outside. At the stripe, it was Johnston, Woolworth, Hayden, Long, and Dave Christensen. Heat wins went to Dale Wagner, Nate Moon, Jim Miller, and Kyle Hayden. Last chance races were won by Ron Heeney, and Miller. Ken Ford and Joe Shaw earned the two remaining transfer spots for the feature. The Capitol City Crazies, or the Figure 8’ers, ran their 25-lap feature, with some of our street stock regulars trying their hand with the Figure 8 specialists. Ray Derminer grabbed the early lead and then “met” Frank Erlenbeck in the X. Jeff Cummings took the lead on lap two and led for the remainder of the race, with “Stick Boy” Hintsman, Jim Gokee, Jerry Atwell, and Lonny Hill rounding out the top five. Erlenbeck experienced some body modification as the whole driver’s side sheet metal was torn off following another incident. A spin in the intersection by Dave Thorburn gave the crowd a thrill on lap 12. At the conclusion, it was Cummings, Hintsman, Gokee, Atwell, and Derminer.}",
    "textBeforeTable": "Andrews Chevrolet Superlate Models Qualifying Results By: Michelle Sprague Anyone who wasn’t at Spartan Speedway on Sunday night missed 155 laps of combined feature racing in the Superpro, Super Late Model, Street Stock Slugfest, and the crazy Figure 8 division. The pit was jammed packed with cars, ready to duke it out on the ¼ asphalt oval in Mason, MI. Twenty-three Andrews Chevrolet Super Late Models lined up for their 40-lap feature, with pole-sitter, Jimmy Gallagher, leading them down for the start. The entire field was nose to tail by lap five with Gallagher still showing the way. Bob Bauer was keeping pace, with Stan Perry, Jeff Hackworth, and Chris Place hot on his heels. The top five broke away from the field, with Gallagher putting a little daylight between second place and himself by lap 10. Lap 25 had the leaders catching the rear of the field and Bauer had reeled in Gallagher by lap 27. Caution on lap 29 closed up the field with Bauer trying everything to get around Gallagher, but Gallagher fought him off to finish ahead of Bauer, Perry, Hackworth, and Place. Heat winners were George Rangel, Tim Ryan, and Jeff Hackworth. The last chance race was won by Bryan Clay, while Dale Lewis, Doc Dutton, and George Rangel won transfer spots into the feature.",
    "textAfterTable": "8 1 Chris Place 13.349 0.148 13.375 9 10 Stan Perry 13.376 0.175 13.392 10 47 Bob Bauer 13.382 0.181 13.389 11 25 Jim Gallagher 13.396 0.195 13.402 12 5 Brian Heeney 13.407 0.206 13.460 13 22 Lee Taylor 13.437 0.236 13.477 14 75 Craig Willett 13.509 0.308 13.515 15 24 Tim Ryan 13.519 0.318 13.536 16 0 Leonard Roberts 13.624 0.423 13.666 17 30 Bryan Clay 13.630 0.429 13.637 18 007 Dale Lewis 13.635 0.434 13.664 19 T2",
    "hasKeyColumn": true,
    "keyColumnIndex": 2,
    "headerRowIndex": 0
}