{
    "relation": [
        [
            "Activity",
            "Learn all about the history of Georgia during Soviet times, and the struggle for independence, at the Museum of Soviet Occupation",
            "Enjoy an evening of local dancing and music at a Georgian restaurant in Tbilisi",
            "Explore the ancient Narikala Fortress and take in the fantastic views of Tbilisi below",
            "Relax with a dip or a massage at a traditional Georgian sulphur bath house",
            "Visit the beautiful Orthodox Sioni Cathdral in Tbilisi's Old Town",
            "Discover the folk architecture, craftwork and culture of the various regions of Georgia at the Giorgi Chitaia Open Air Museum of Ethnography",
            "See the incredible collection of historical artefacts at the Simon Janashia Museum of Georgia",
            "See the grandiose modern Holy Trinity Cathedral of Tbilisi, the seat of the Georgian Orthodox Church",
            "Discover the highlights of Tbilisi on a guided tour of the Old Town",
            "Visit the incredible Svetitskhoveli (The Life Giving Pillar) Cathedral in Mtskheta, near Tbilisi, en route (if time allows)"
        ],
        [
            "Approximate Cost",
            "GEL 3",
            "GEL 25",
            "GEL",
            "GEL 2",
            "GEL",
            "GEL 1.5",
            "GEL 3",
            "GEL",
            "GEL 5",
            "GEL"
        ]
    ],
    "pageTitle": "Trip Notes for Silk Route between Istanbul and Bishkek",
    "title": "",
    "url": "http://www.dragoman.com/holidays/trip-notes/overland-between-istanbul-and-bishkek?format=dossier&vid=4479&did=59652",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042991076.30/warc/CC-MAIN-20150728002311-00303-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 407219643,
    "recordOffset": 407157843,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{46735=During these days we plan to wild camp en route. Please note that trips running in low season (May to mid-June and October to November), we may not be able to camp if temperatures are too low, in which case we will stay in local guesthouses along the route instead., 117630=Kutaisi is one of the cradles of Georgian civilisation and the people here are renowned for their hospitality. Kutasi is home to the Bagrati Cathedral which sits high on a hill overlooking the town. This immense building was started by Bagrat III in 1003.  It is in a state of ruin, but is still an impressive Christian monument. , 93344=Today we plan to disembark the Caspian ferry and enter Azerbaijan., 93225=Border information: exit Turkmenistan at Turkmenbashi, enter Azerbaijan at Baku., 156468=The easiest way to get a visa is to apply for an e-visa as part of your online visa support documents application with The Visa Machine. When filling out this online form, you will be asked to opt in to allow The Visa Machine to apply for your Azerbaijan e-visa – please tick the ‘Yes’ box, and the e-visa will be arranged for you, completely free of charge. If you tick ‘No’, you will have to arrange your own visa, which will mean you must pay embassy fees and apply directly to an Azerbaijan embassy – this embassy may request hotel reservations and other documentation that we do not have and cannot provide, so please opt in to the free service from The Visa Machine., 210980=For mobile phones, please note that most countries in the Americas operate at 850MHz and 1900 MHz which is not the same frequencies used in Europe, Africa, Asia and Australia. Most modern tri-band and quad-band mobile phones will be able to operate on these frequencies but please check your mobile phone specifications before travelling to ensure that you'll be able to use your phone in the Americas., 32141=This spectacular valley is famed for it's natural beauty, abundant wildlife and rich, varied flora. This is the reason why Chong Kemin Natrional Park was founded in 1977., 216676=These trip notes were printed on 04/08/2015, 176468=United States. http://travel.state.gov/travel/travel_1744.html, 73150=The small historic town of Khiva in Uzbekistan was once the capital of Khwarezmia and the Khanate of Khiva, a central asian state that existed from the 1500's right through until 1924, when it was fully incorporated into the Soviet Union. The city's long history is fascinating and fortunately much of the magnificent architecture has been incredibly well preserved. The ancient walls that used to provide sanctuary for the travellers on the Silk Route are intact, as is the old town that the walls were built to protect. Many of the buildings are beautifully decorated in classic turquoise tiles. As well as exploring the streets of the old city, you should make sure you visit the Kukhna Ark & Juma Mosque, Pakhlovan Mahmus Mausoleum and Islam Hodja Madrassa., 138639=Please note that this trip spends time above 2800 metres/9200 feet where it is possible for travellers to experience some adverse effects on your health due to the altitude, potentially including Acute Mountain Sickness (AMS), High Altitude Cerebral Edema (HACE) and High Altitude Pulmonary Edema (HAPE)., 99281=Border information: exit Azerbaijan at Balakan, enter Georgia at Ladodekhi. , 139965=Please note that as of 2014 all medications containing tramadol, codeine, temazepam, morphine, opiates or any containing similar constituent components have been made illegal in Georgia, Azerbaijan, Turkmenistan and Uzbekistan. This includes many over-the-counter medicines that are commonly available elsewhere, such as Nurofen!, 79593=Ashgabat is a unique modern city that has been extensively rebuilt over the last ten years since the country gained independence. Little is left of the original Russian Imperial city as most of it was destroyed in a massive earthquake in 1948, today the centre is a unique mix of futuristic and outrageous public buildings that are an extraordinary sight. The earthquake affected every family in Ashgabat and is ingrained in the psyche of the local people. The Earthquake monument and museum are well worth a visit, as are the Carpet and the National Museums. If you are into carpets, Turkmenistan is the country to visit, and if you are in Turkmenistan, Ashgabat's Sunday Market is the place to buy them. This wonderful market stretches for hundreds of acres into the desert. Carpets, camels, clothes, pigs, jewellery, goats, cars, chickens, hats and ex soviet military paraphernalia are readily available., 132032=Istanbul is the only city in the world to straddle two continents, so it will come as no surpise that this vast metropolis has is home to a beguiling mix of different cultures and traditions, blending the influences of both east and west. The city has a rich and intriguing history, originally founded by Greek settlers over 2000 years ago, Istanbul originally went by the name of Byzantium, later renamed Constantinople by the Romans who made it the captial of their eastern empire. Today the city is the largest in Turkey, a bustling mega-city with a population of over 12 million people in total., 2159=Azerbaijan has an incredibly rich history as the country has suffered a multitude of invasions from north, south, east and west. It was a melting pot of different peoples and religions but became dominated by successive waves of Turkish (who came form Central Asia, not Turkey), Arabic and Persian invaders. The Islamic heritage is obvious and today it has a strong Muslim culture., 156286=Citizens of the UK, Ireland, Australia, New Zealand, USA, Canada and all EU countries will need a visa to enter Azerbaijan as a tourist for up to 90 days., 93576=Please note that we have built in significant time in the above itinerary to allow for delays with the Caspian ferry. If the ferry comes in earlier than this, we may choose to move on from Baku earlier than listed to allow more time exploring the rest of Azerbaijan and Georgia., 35152=Issyk-Kul Lake is one of the biggest natural water reservoirs in the world at 170kms long and 70km wide. Issyk-Kul means \"warm lake\" in the local language; a combination of extreme depth, thermal activity and mild salinity means the lake never freezes. On the shores of the lake is the small town of Cholpon Ata, a favourite holiday spot with the locals. The area has a number of health resorts and spas and there are also some interesting rock inscriptions dating back to 500BC close nearby - however most people come here for the beaches. These may not be the virgin, palm fringed beaches of other destinations, but they are unique in their own right and a great place for a spot of rest and relaxation in this land-locked mountain kingdom.}",
    "lastModified": "Tue, 04 Aug 2015 17:51:12 GMT",
    "textBeforeTable": "Tel: +996 312 690 235 or +996 312 690 234 Kyrgyzstan Bishkek 720021 1a Lineinaja St (Улица Линейная 1А, (на пересечении с улицой Гоголя)) Hotel Asia Mountains (Отель Горы Азии) Hotel for the night: Hotel Asia Mountains *Another important note - please be aware that all itineraries in Kyrgyzstan are highly weather-dependent. The itinerary described in these notes are a statement of best intention, but we must approach each trip in Kyrgyzstan with a large degree of flexibility, as our leaders and local guides will have to 'play things by ear' according to the local conditions and weather. In low season certain routes become impossible and it may become far too cold to camp - in all cases there are fantastic and well-tried alternatives in place which means we can always run an excellent and comprehensive trip here, but please do not treat the exact details of the itinerary listed here as gospel - thanks for your understanding!* *Important note - do not bring any medicines containing tramadol, codeine, temazepam, morphine or opiates to Central Asia. These are illegal in all circumstances in most of Central Asia and you will risk arrest. If in doubt about a particular medicine, please do not bring it. See the notes at the bottom for more details.* In Bishkek we will stay in a comfortable",
    "textAfterTable": "Activity Approximate Cost Get off the beaten track with 3 nights wild camping and a leisurely overland journey through the stunning mountains and National Parks of Kyrgyzstan Included in Kitty Explore the beautiful Chong Kemin valley on horseback (if helmets available) KGS 300 Head out on a white-water rafting adventure through the stunning Chong Kemin valley KGS 1800 Walk around the incredible scenery of the Chong Kemin valley KGS Enjoy a stunning day of wild camping and hiking in the beauty of the Ala Archa Gorge USD About Chong Kemin Valley: Chong Kemin lies within the Tian Shan mountain range seperating Kyrgyzstan and Kazakstan. Their peaks reach above the legendary threshold of 7000 m elevation in its ruggerd run towards China. This spectacular valley is famed for it's natural beauty, abundant wildlife and rich, varied flora. This is the reason why Chong Kemin Natrional Park was founded in 1977. The valley offers several trekking possibilities from easy short walks along the Chong Kemin River to adventurous and tough hikes over 4000m passes, ceratinly not for the faint hearted. Recently white water rafting has become a popular activity for visitors in the area, However if it's a more relaxing experience you are after, exploring this stunning valley on horseback is a great alternative.",
    "hasKeyColumn": true,
    "keyColumnIndex": 1,
    "headerRowIndex": 0
}