{
    "relation": [
        [
            "Section No.",
            "313310-GM",
            "313310-Q1",
            "313310-Q2"
        ],
        [
            "Dates",
            "08/04/15- 08/04/15",
            "07/21/15- 07/21/15",
            "08/05/15- 08/05/15"
        ],
        [
            "Days",
            "Tu",
            "Tu",
            "W"
        ],
        [
            "Times",
            "12:00P- 4:00P",
            "9:00A- 1:00P",
            "9:00A- 1:00P"
        ],
        [
            "Location",
            "FitRec",
            "FitRec",
            "FitRec"
        ],
        [
            "Fees",
            "$0",
            "$0",
            "$0"
        ],
        [
            "Ages",
            "Birth +",
            "Birth +",
            "Birth +"
        ],
        [
            "Single Icon",
            "Item Details",
            "Item Details",
            "Item Details"
        ],
        [
            "Cart Icon",
            "Read Notice",
            "Read Notice",
            "Add to Cart"
        ]
    ],
    "pageTitle": "WebTrac Activity Search",
    "title": "",
    "url": "https://myfitrec.bu.edu/wbwsc/webtrac.wsc/wbsearch.html?wbsi=f963ecb9-9e65-828c-e311-cdec440e9149",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 225,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042982502.13/warc/CC-MAIN-20150728002302-00066-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 861573407,
    "recordOffset": 861496620,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{451343=Registration will become available on Tuesday, September 1 at 9:00am! Intramural Ice Hockey is played in Walter Brown Arena. Due to low availability of ice, the league is mixed meaning that no matter the makeup of your team (all men, all women, co-ed, etc.) all teams will play against each other. After submitting payment for your team, don't forget to download your roster from the Ice Hockey page on the FitRec Website, complete it, and submit it to us via email at IMRoster@bu.edu before the deadline!, 225962=Prerequisite: Intermediate ballet skills, regular attendance at intermediate or advanced ballet technique classes, and consent of instructor (contact mtaypin@bu.edu). Students learn a modern ballet and then work to refine their execution of the material. In addition to class sessions, there are two required showings, a technical rehearsal, a dress rehearsal, and three public performances of the ballet. Regular attendance is required at all classes, showings, rehearsals, and performances. For Fall 2015 there are showings during the semester (usually a Thursday night), a one hour tech rehearsal is to be determined; dress is Thursday night, Nov. 19; performances are Friday, Nov. 20, 8pm and Sat, Nov. 21, 4 and 8pm with a call two hours prior to the show. Please email mtaypin@bu.edu with any questions about the schedule or class level., 455750=Registration will become available on Tuesday, September 1 at 9:00am! The Intramural 5 on 5 Pre-Holiday Basketball tournament is played in the FitRec Center 4-court gym Sunday through Thursday evenings. Men's, Women's, and Co-Rec divisions are offered in Average (A) or Above Average (AA) competitive levels.Each team will play 2 pool pl;ay games and the top teams will advance to a single elimination bracket with the winners being crowned prior to the Thanksgiving break. After submitting payment for your team, don't forget to download your roster from the Pre-Holiday Basketball page on the FitRec Website, complete it, and submit it to us via email at IMRoster@bu.edu before the deadline!, 202161=For intermediate level aerialists only. An opportunity to create your own work on the apparatus of your choice. Choose from bungee, silks, trapeze, and ropes. This class will have an open gym structure, but students will be taught choreographic tools and coached by the instructor. Informal performance opportunity at the end of the session December 6th and 7th., 449184=Registration will become available on Tuesday, September 1 at 9:00am! Intramural Volleyball is played in the FitRec Center 4-court gym Sunday through Thursday evenings. Men's, Women's and Co-Rec leagues are offered in Average (A) or Above Average (AA) divisions. After submitting payement for your team, don't forget to download your roster from the Volleyball page on the FitRec Website, complete it, and submit it to us via email at IMRoster@bu.edu before the deadline!, 442346=Registration will become available on Tuesday, September 1 at 9:00am! BU Intramural Soccer is played acrosst the width of both Nickerson and New Balance Field Sunday through Thursday evenings. Soccer is one of the most popular intramural sports and because of this the league registration generally fills within a day of opening. Teams who fail to register prior to us reaching our limit should submit a completed roster form and submit it to IMRoster@bu.edu in order to be placed on the wait list. Waitlist teams will be contacted if they make it into the league. After submitting payment for your team, don't forget to download your roster form from the Outdoor Soccer page on the FitRec Website, complete it, and submit it to us via email at IMRoster@bu.edu before the deadline!, 458140=Registration will become available on Tuesday, September 1 at 9:00am! The Intramural Dodgeball tournament will be played in the FitRec Center 3-court gym on TBA. Men's, Women's, and Co-Rec divisions are offered. The men's tournament will start first at 12 Noon, followed by the Co-Rec Tournament, and the Women's Tournament. Each team will play pool play games (number TBD depending on number of teams) and the top teams will advance to a single elimination bracket where a champion will be crowned. After submitting payment for your team, don't forget to download your roster from the Dodgeball page on the FitRec Website, complete it, and submit it to us via email at IMRoster@bu.edu before the deadline!, 794290=For children 18 months-4 years. One parent or guardian must work in the water with the child under the direction of the instructor. This class is not designed to teach children to survive in the water on their own. Following the American Red Cross Parent and Child Aquatic Program, children are encouraged to feel comfortable in the water in a fun and safe environment . Parent Tot C includes more advanced skills for infants/toddlers including floating, blowing bubbles, kicking and arm strokes. Information on safety and swimming techniques are also reviewed in class. Ratio of instructor to children is 1:6., 563998=Equipment rental for our Snowboard/Skiiing program includes skis/snowboard, boots, poles and helmet. There is an equipment fitting meeting at FitRec from 4:00-6:00pm on January 29, 2015 which you should plan to attend., 447031=Registration will become available on Tuesday, September 1 at 9:00am! Intramural 3 on 3 Basketball is played in the FitRec Center 4-court gym Monday through Thursday evenings. Men's and Women's leagues are offered in Average (A) or Above Average (AA) divisions. After submitting payment for your team, don't forget to download your roster from the 3 on 3 page on the FitRec Website, complete it, and submit it to us via email at IMRoster@bu.edu before the deadline!, 49802=Prereq: Ability to swim 500 yards continuously in less than 13 minutes (about a 2:30 interval per 100 yards) and competence in freestyle, backstroke and breaststroke. Designed for swimmers who want to gain endurance, learn training techniques, and improve strokes. This program will help prepare swimmers for either a Masters Swim Program or for the use of lap swimming as a form of aerobic exercise., 453547=Registration will become available on Tuesday, September 1 at 9:00am! Intramural Floor Hockey is played in the FitRec Center 3-court gym on Sunday, Tuesday, and Thursday evenings. Men's, Women's and Co-Rec leagues are offered in Average (A) or Above Average (AA) divisions. After submitting payment for your team, don't forget to download your roster from the Floor Hockey page on the FitRec Website, complete it, and submit it to us via email at IMRoster@bu.edu before the deadline!, 444830=Registration will become available on Tuesday, September 1 at 9:00am! Intramural Flag Football is played on New Balance Field Sunday through Thursday evenings. We play by NIRSA (National Intramural and Recreational Sports Association) standardized rules provide flags and game balls. After submitting payment for your team, don't forget to download your roster from the Flag Football page on the FitRec Website, complete it, and submit it to us via email at IMRoster@bu.edu before the deadline!, 807473=For 2.5-5 year olds who have completed Parent-Tot B or C and are ready to transition to group lessons but need a little more experience working with an instructor and following directions in a class setting. The first two classes will involve the parent or guardian working with the child in the water with an emphasis on the child working with the instructor on floating, kicking, and putting their face in the water. During the third and fourth lesson, the parent or guardian will remain on the pool deck. For the final two lessons, the parent or guardian will remain in the waiting area, similar to a preschool class. Ratio of instructor to children is 2:5.}",
    "textBeforeTable": "For those who have had little or no swimming experience. Instruction in basic swimming skills for beginners to advanced beginners. Learn and improve the crawl stroke, elementary backstroke, backstroke, sidestroke, and breaststroke. Work at your own pace with individualized guidance from the instructor. 110050 - Beginning Swim Showing: 1 to 610 Total Results: 610 Activity Search Results Instructor Instructor Allen Ann Astwood Ryan Connor Aydogan Melissa Azuma Jason Babiec Thaddeus Baechtold Molly Balkin Jamie Baronofsky Dani Batkis-O'Donnell Monica Beaton Margaret Ben-Avie Yedidya Bender Jennifer Bernardo Chris Black Taylor Boutwell Lauren Bouzane Carolyn Brenner Felice Bresee Kate Callahan Cara Camelio Chris Cardamone Sharon Casey Ryan Chan Jack Chan Jackson Chang Helena Chang Mariah Chen Briana Coleman Jossie Collins Christin Cone Russell Craft Madison Creary Stephanie DeVincentis Kelly Diamond Marci DISCIPIO RICARDO DORSEY TARA Erfani Sherwin Evans-Brown Ellis Faller Mike Gallotto Cristina Gioulekas Constantinos Glessner Kady Goodfriend Laura Granberg Alethea Green Connor Guerrios Daniel HANIG MATTHEW Hibbard Jill Hindman Dana",
    "textAfterTable": "110050-04 09/15/15- 12/03/15 Tu, Th 6:00P- 7:00P FitRec $230 17 years + Item Details Add to Cart 110050-05 09/15/15- 12/03/15 Tu, Th 7:00P- 8:00P FitRec $230 17 years + Item Details Add to Cart 110050-B1 09/02/15- 12/09/15 See Details See Details See Details $260 17 years + Item Details Add to Cart 110050-C1 09/03/15- 12/10/15 Tu, Th 2:00P- 3:00P FitRec $260 17 years + Item Details Add to Cart 110100 - Beginning Swim for Women A learn to swim class designated specifically for women, instructed by a woman, during a time when the pool is closed to other",
    "hasKeyColumn": true,
    "keyColumnIndex": 8,
    "headerRowIndex": 0
}