{
    "relation": [
        [
            "Patent application number",
            "20080316936",
            "20090213747"
        ],
        [
            "Description",
            "DATA TRANSFER RATE VARIANCE MEASUREMENT METHOD, APPARATUS, SYSTEM, AND STORAGE MEDIUM FOR STORING PROGRAM - A data transfer rate variance indicator having a small amount of calculation for each one packet and a small necessary amount of buffer (memory size), and representing a value suitable for traffic quality evaluation is to be used.",
            "METHOD, APPARATUS AND COMMUNICATION SYSTEM FOR ESTIMATING ON-OFF TRAFFIC CHARACTERISTIC AND RECORDING MEDIUM RECORDING PROGRAM FOR ESTIMATING ON-OFF TRAFFIC CHARACTERISTIC - An ON-OFF traffic characteristic can be analyzed in real time from a measurement value without requiring detailed data analysis which is performed using measurement values accumulated for a predetermined time period through a high-performance measurement apparatus. A packet length and a packet transfer time interval of a communication traffic are first measured, and a data transfer rate variance indicator is computed based on a relative entropy value between the measured packet transfer time interval and a packet transfer time interval in case of transferring at a constant transfer rate. A predetermined traffic characteristic value is at least approximately computed using the computed data transfer rate variance indicator."
        ],
        [
            "Published",
            "12-25-2008",
            "08-27-2009"
        ]
    ],
    "pageTitle": "Enomoto, Tokyo - Patent applications",
    "title": "",
    "url": "http://www.faqs.org/patents/inventor/enomoto-tokyo-4/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988317.67/warc/CC-MAIN-20150728002308-00025-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 458716795,
    "recordOffset": 458690048,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Tadashi Enomoto, Tokyo JP //]]> BarDraw('3011597',['Patent applications by Shigeo Enomoto, Tokyo JP'],[[3,2,5,1,1]],['2005','2006','2007','2008','2010'],0); // <script type=\"text/javascript\"> </div> <div id=\"legend3011597\" align=\"center\"></div> </div> <canvas id=\"bg3011597\" style=\"max-width: 500px; width: 100%;\"></canvas> <div> <p align=\"center\">Patent applications by Shigeo Enomoto, Tokyo JP</p> <div class=\"bar3011597\" style=\"max-width: 500px; width: 100%; float:left; \"> <div align=\"left\" style=\"padding-top:20px;\"> </table> </tbody> </tr> <td>06-03-2010</td> <td><a href=\"/patents/app/20100135648\">STAGE APPARATUS AND IMAGE MOVEMENT CORRECTION APPARATUS FOR CAMERA USING STAGE APPARATUS</a> - A stage apparatus includes a stationary support plate; a stage member provided on the stationary support plate so as to move on a reference plane parallel with the stationary support plate; Y-direction magnetic flux generating devices secured to one of the stationary support plate and the stage member; and Y-direction moving coils secured to the other of the stationary support plate and the stage member, the Y-direction moving coils receiving magnetic flux from the Y-direction magnetic flux generating devices so as to generate a driving force in a specific Y-direction between the Y-direction magnetic flux generating devices and the Y-direction moving coils. The Y-direction moving coils are secured to the stage member so that the Y-direction moving coils at least partly overlap each other in an X-direction, which is parallel with the reference plane and perpendicular to the Y-direction, and do not overlap in the Y-direction.</td> <td>20100135648</td> <tr> </tr> <th>Published</th> <th>Description</th> <th>Patent application number</th> <tr> <tbody> <table class=\"preltab\" id=\"inv_tab_3011597\"> <h2>Shigeo Enomoto, Tokyo JP</h2> </table> </tbody> </tr> <td>05-30-2013</td> <td><a href=\"/patents/app/20130135570\">COMPOSITION FOR FORMING LIQUID CRYSTAL LAYER, LIQUID CRYSTAL DISPLAY DEVICE, AND METHOD FOR",
    "textAfterTable": "Patent applications by Tadashi Enomoto, Tokyo JP Takaaki Enomoto, Tokyo JP Patent application number Description Published 20110030027 TELEVISION TRANSMITTER, TELEVISION TRANSMITTING METHOD, TELEVISION RECEIVER AND TELEVISION RECEIVING METHOD - A TV transmitter, a TV transmitting method, a TV receiver and a TV receiving method allowing users to find and choose desired programs through the use of a program guide displayed by graphical user interface (GUI). The TV transmitter comprises a signal generation unit for generating text data signals associated with TV broadcast programs and hyper text data signals corresponding to the text data signals, a multiplexer for multiplexing the text data signals and the hyper text data signals onto video signals of the TV broadcast programs to provide a multiplexed TV broadcast signal, and an output unit for outputting the multiplexed TV broadcast signal provided by the multiplexer. The TV receiver comprises a display unit for receiving and displaying text data signals extracted from a multiplexed TV broadcast signal interleaving the text data signals associated with TV broadcast programs and hyper text data signals corresponding to the text data signals a designation unit for designating any one of the text data signals displayed by the display unit a detection unit for",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}