{
    "relation": [
        [
            "Job Title",
            "Client Services Intern",
            "Client Services Intern (Full-Time: August - December 2015)",
            "Design Co-op",
            "Receptionist/Administrative Assistant",
            "Visual Designer"
        ],
        [
            "Location",
            "New York, NY",
            "Chicago, IL",
            "New York, NY",
            "San Francisco, CA",
            "New York, NY"
        ]
    ],
    "pageTitle": "Accounting - Entry Level Jobs, Internships, and Career Overview",
    "title": "",
    "url": "http://www.onedayonejob.com/jobs-internships/accounting/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042991076.30/warc/CC-MAIN-20150728002311-00300-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 624545391,
    "recordOffset": 624412031,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{304850=Copyright © 2007-2015 One Day, One Job. All rights reserved.}",
    "textBeforeTable": "sales risk management Ohio finance banking analyst all employers administrative accounting account management See the complete The Business Backer profile The Business Backer - The Business Backer is based in Cincinnati based and “is helping small business owners flourish and grow by re-inventing relationship-based lending for the 21st century.” Companies with Entry Level Jobs and Internships in Accounting Business Development Math Careers Related to Accounting Finance Industry Professionals Worldwide Finance Club Finance and Accounting Networking and Jobs Networking Opportunities Golden Practices Real Life Accounting Going Concern Blogs and Websites Accounting Workbook for Dummies by John A. Tracy Accounting for Non-Accountants by Wayne Label",
    "textAfterTable": "See all 59 job postings Kiwi Partners - Kiwi Partners is a New York, NY based accounting firm that “gives the nonprofit leader the ability to focus on their mission.\" See the complete Kiwi Partners profile accounting all employers finance human resources New York Job Title Location Technical Lead Architect in LINUX(2014467) Provo, UT Sr. Business Process Specialist - Norcross, GA Norcross, GA Accounting Analyst New York, NY Production Supervisor, Germantown, WI Wisconsin Manager, Public Affairs - Global Brands (K/L) Racine, WI See all 15 job postings BioLite - BioLite is",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}