{
    "relation": [
        [
            "Date",
            "Mar 7, 2007",
            "Dec 21, 2009",
            "Jan 26, 2011",
            "Nov 20, 2013"
        ],
        [
            "Code",
            "AS",
            "FPAY",
            "AS",
            "FPAY"
        ],
        [
            "Event",
            "Assignment",
            "Fee payment",
            "Assignment",
            "Fee payment"
        ],
        [
            "Description",
            "Owner name: ACCENTURE GLOBAL SERVICES GMBH,SWITZERLAND Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNOR:INDELIQ, INC.;REEL/FRAME:018972/0137 Effective date: 20031218",
            "Year of fee payment: 4",
            "Owner name: ACCENTURE GLOBAL SERVICES LIMITED, IRELAND Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNOR:ACCENTURE GLOBAL SERVICES GMBH;REEL/FRAME:025700/0287 Effective date: 20100901",
            "Year of fee payment: 8"
        ]
    ],
    "pageTitle": "Patent US7065513 - Simulation enabled feedback system - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US7065513?dq=5,222,134",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988317.67/warc/CC-MAIN-20150728002308-00287-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 483540591,
    "recordOffset": 483462266,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{6041=Use of a list is demonstrated by continuing our math test. The math question in this example invites the user to select multiple elements to construct the answer. These are the steps required to configure that section of the simulation. FIG. 26 illustrates the steps for configuring a simulation in accordance with a preferred embodiment. Define a name for cell C23 in Excel. Here we have defined “The_List”. Let's use the same TaskID as before since Question 3 is part of the same simulation as Question 1 and 2. Ex: TaskID is 123. In the ICA, define a Target for the list. Ex: a TargetID of 4006 is generated by the ICA. In the ICA, define a SourceItem for every item that could be placed in the list. Ex: the following SourceItemIDs 1209, 1210, 1211, 1212, 1213, 1214 are generated by the ICA. Associate the list to a path (refer to Path object discussion). Add the information in the List table of the simulation engine database.}",
    "TableContextTimeStampAfterTable": "{226582=All this information is stored for every output in the Output table of the simulation database (ICASim.mdb). When designers construct their simulation model, they must be aware of the fact that there is only 1 type of Outputs: the Distinct Output. A Distinct Output consists of one and only one spreadsheet cell that contains a formula or a result of calculations. The existence of Output cells is the main reason to have a simulation model. If the cell is TutorAware, the ICA will be notified of any changes to the cell when all outputs are processed otherwise the ICA will be unaware of any changes. When the ICA is notified of a change two messages are in fact sent to the ICA: An ICANotifyDestroy message with the output information i.e., SourceItemID, TargetID and null as Attribute. This message is to advise the ICA to remove this information from its memory. An ICANotifyCreate message with the output information i.e., SourceItemID, TargetID, Attribute (cell numeric value). This message is to advise the ICA to add this information to its memory. As opposed to Distinct Inputs and Drag & Drop Inputs which notify the ICA on every change, Distinct Outputs are processed in batch just before asking the ICA for feedback. To notify the ICA of the total dollar amount of the items in the list. We definitely need a Distinct Output for that. The output will contain a sum formula. Define a name for cell C24 in Excel. Here we have defined “Distinct_Output”.Let's use the same TaskID as before since Question 3 is part of the same simulation as Question 1 and 2. Ex: TaskID is 123. In the ICA, define a Target for the output. Ex: a TargetID of 4005 is generated by the ICA. In the ICA, define a SourceItem for the output. Ex: a SourceItemID of 1215 is generated by the ICA. Associate the output to a path (refer to Path object discussion). Add the information in the Output table of the simulation engine database., 197360=These are the steps required to configure that simulation: Define a name for cell C2 in Excel. Here we have defined “Distinct_Input”. In the ICA, define a task that will be assigned to the simulation. Ex: a TaskID of 123 is generated by the ICA. In the ICA, define a Target for the input. Ex: a TargetID of 4001 is generated by the ICA. In the ICA, define a SourceItem for the input. Ex: a SourceItemID of 1201 is generated by the ICA. Associate the input to a path (refer to Path object discussion). Add the information in the Input table of the simulation engine database. A record in an Input table is presented below., 203670=These are the steps required to configure that section of the simulation: Define a name for cell C11 in Excel. Here we have defined “DragDrop_Input”; Let's use the same TaskID as before since Question 2 is part of the same simulation as Question 1. Ex: TaskID is 123; In the ICA, define a Target for the input. Ex: a TargetID of 4002 is generated by the ICA; In the ICA, define a SourceItem for every possible answer to the question. Ex: SourceItemIDs 1202 to 1205 are generated by the ICA; Associate the input to a path (refer to Path object discussion); and Add the information in the Input table of the simulation engine database. A record in the Input table in accordance with a preferred embodiment is presented below.}",
    "textBeforeTable": "Patent Citations illustrates an ICA utility in accordance with a preferred embodiment. The ICA Utilities consist of six utilities that work with the Intelligent Coaching Agent Tool (ICAT) to incorporate business simulation with the multimedia application. FIG. 30 , each online question has one Target Group for ease of maintenance. Each TargetGroup must have at least one related Target (4). These are the SourceItemTarget mappings that were made at the end of Step 3. Next, Rules (2) are created to fire when the SourceItemTarget is mapped (a question is clicked). Coach items (3) are associated to a rule and represent the feedback which will be shown if the rule is fired. The ICA Utilities incorporate business simulation into a multimedia application. What this means is that there is now a middle layer between the application and the ICAT. These utilities, along with the simulation engine (described later), allow the architecture to be a front end to the simulation. Now, any changes to a simulation model do not need to be incorporated into code. The ICA Utilities and simulation engine work with simulation models created in Microsoft Excel. After the model is created, the designer uses the Defined Name function in Excel to flag specific cells that are to be used by the application and the ICA Utilities in accordance with a preferred embodiment. FIG. 29 is a display of video information in",
    "textAfterTable": "US5189402 May 24, 1989 Feb 23, 1993 Advanced Interaction, Inc. Content addressable video system for image display US5208745 Jun 4, 1990 May 4, 1993 Electric Power Research Institute Multimedia interface and method for computer system US5208898 May 30, 1989 May 4, 1993 Hitachi, Ltd. Adaptive knowledge inference method and system US5239617 Jan 5, 1990 Aug 24, 1993 International Business Machines Corporation Method and apparatus providing an intelligent help explanation paradigm paralleling computer user activity US5259766 Dec 13, 1991 Nov 9, 1993 Educational Testing Service Method and system for interactive computer science testing, anaylsis and feedback US5267865 Feb 11, 1992 Dec 7, 1993 John R. Lee Interactive computer aided natural learning method and apparatus US5310349 Apr 30, 1992 May 10, 1994 Jostens Learning Corporation Instructional management system US5311422 Jun 28, 1990 May 10, 1994 The United States Of America As Represented By The Administrator Of The National Aeronautics And Space",
    "hasKeyColumn": true,
    "keyColumnIndex": 2,
    "headerRowIndex": 0
}