{
    "relation": [
        [
            "Categories",
            "Campus Safety",
            "Greek Life",
            "Clubs and Activities",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students"
        ],
        [
            "Comments",
            "I have never felt unsafe on campus, and TUPD takes campus safety very seriously.",
            "It's as present as you want it to be. You can make greek life your whole world, attend the occasional party but not really get involved, or ignore it and almost forget entirely that it is there.",
            "If you are interested in it, there is almost always a club for it. If there isn't, starting one is ridiculously easy. Acapella is wildly popular- we have 9 groups as of Fall 2013. There are a whole host of sports teams, from the more traditional football and volleyball to Quidditch, with all levels of commitment from varsity to intramural. There is an extremely active theatre community, as well as tons of groups aimed at social justice issues, women's and LGBT activism, and political and environmental issues. There are also dozens of newspapers and magazines published on campus every semester.",
            "Tufts dining is fantastic, they have such a wide variety of options that I never get tired of the same old food. There are always sandwiches, soups, and salads available, in addition to the two or three entrees offered per meal. There is also a wide selection of vegetarian foods at every meal.",
            "Most of the dorms available to Freshman leave a little something to be desired, in my opinion. Most of the rooms in most of the buildings are of decent size, save for where I live (Metcalf West), where my room is the size of an oversized walk-in closet. If you live in a building with a communal kitchen, don't expect to be able to use it for anything other than simple baking projects- it will no doubt be small and the appliances will probably be old. That being said, some of the dorms, especially the recently renovated ones- Lewis, South, and Haskell to name a few- are nice enough. Suite and apartment-style living is available to sophomores and upperclassmen. Sophia-Gordon, an all-senior dorm, is absolutely gorgeous, apartment-style living. Living on-campus is required freshman and sophomore years, but most upperclassmen tend to live off-campus.",
            "I finally feel as if the work I am doing in my classes is worthwhile, rather than the pointless busywork of high school. By coincidence, I took many courses with low workloads my first semester, so I had plenty of time to complete my assignments and pursue outside interests. All of my classes were engaging and interesting, and I never felt like my time was being wasted.",
            "Play up what makes you different. Scores and grades are obviously important, but everyone applying here is smart, so it's really your essays that are going to show the admissions officers what makes you stand out from the 18,000 other smart kids in the application pile."
        ]
    ],
    "pageTitle": "Tufts University Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Tufts-University/reviews?_escaped_fragment_=/show/39778",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042982502.13/warc/CC-MAIN-20150728002302-00269-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 868893187,
    "recordOffset": 868854443,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{13489=Tufts is definitely a school that comes at a high price and isn't exactly known for having the greatest financial aid package. But so far, coming here and making the financial sacrifice has been worth every penny and every inch of the 2600-mile move across the country. The dorms are nice, the campus is clean, the food is amazing, and the education is top-notch., 5128=Make sure to stay over on campus if possible. I suggest attending April Open House: it allows many students an intimate look into the university and often helps wondrously in making the dreaded decision. Also, pay attention to those supplementary essays. I know they're annoying and there are so many, but honestly try your best. Show the admissions officers that you are quirky and they will adore you., 81149=Definitely try to sign up for one of the overnight visits for April Open House- I didn't do that and even though I'm very lucky I'm in love with the school, it would have been much more practical and saved a lot of stress over making my decision., 114980=If you are interested in it, there is almost always a club for it. If there isn't, starting one is ridiculously easy. Acapella is wildly popular- we have 9 groups as of Fall 2013. There are a whole host of sports teams, from the more traditional football and volleyball to Quidditch, with all levels of commitment from varsity to intramural. There is an extremely active theatre community, as well as tons of groups aimed at social justice issues, women's and LGBT activism, and political and environmental issues. There are also dozens of newspapers and magazines published on campus every semester., 125869=© 2015, Cappex.com, LLC}",
    "textBeforeTable": "07/09/2009 Reviewer is A current student here. 45 out of 45 people found this review useful. 1 of 26 An extremely enthusiastic Jumbo Check out reviews left by other students or leave your own review. You could win a free scholarship. Tufts University Reviews Tufts University › Massachusetts › By State › Colleges › } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.create', -->",
    "textAfterTable": "Comments Great for these types of students Quirky and intelligent. Tufts is a very, very diverse place. There are students that lock themselves in their rooms weeks before an important exam and others that don't start term papers more than eight hours before the due date. There are party animals and theater patrons, city-dwellers and country boys, athletes and musicians, mathematicians and poets. Talk to anyone. They'll have a story. Tips for prospective students Make sure to stay over on campus if possible. I suggest attending April Open House: it allows many students an intimate look into the university and often helps wondrously in making the dreaded decision. Also, pay attention to those supplementary essays. I know they're annoying and there are so many, but honestly try your best. Show the admissions officers that you are quirky and they will adore you. Bang for the buck Tufts is expensive. Very expensive. However, it is manageable. The school does its best in giving out money to students who need it in such an economic situation, and the education that students receive is unbeatable. Am enjoying being here Tufts is bustling with activity 24-7. Students that attend here have diverse interests and that is definitely reflected through",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}