{
    "relation": [
        [
            "",
            "1",
            "2",
            "3",
            "4"
        ],
        [
            "Mana",
            "20",
            "20",
            "20",
            "20"
        ],
        [
            "Cooldown",
            "1",
            "1",
            "1",
            "1"
        ],
        [
            "Range",
            "-",
            "-",
            "-",
            "-"
        ],
        [
            "AoE",
            "-",
            "-",
            "-",
            "-"
        ],
        [
            "Duration",
            "-",
            "-",
            "-",
            "-"
        ],
        [
            "Effects",
            "heal 20 HP",
            "heal 30 HP",
            "heal 40 HP",
            "heal 50 HP"
        ]
    ],
    "pageTitle": "[STR][Sent]Eyna The Ultimate Warrior[REMAKE] - DotA Forums",
    "title": "",
    "url": "http://www.playdota.com/forums/showthread.php?t=298748",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042982502.13/warc/CC-MAIN-20150728002302-00029-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 654457263,
    "recordOffset": 654416043,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Background Story: Eyna is a special trained Watcher in combat. She is fearless in combat and can face any enemies with defensive and offensive tactics. She learn how to survive long in any battle. She is the force to be reckon with.Her goal is to become an ultimate warrior for the Sentinel. Because of Sentinel don't have female melee hero, i made one. Her role is a tank and anti-hero (arguable). She is a total damage dealing hero (also arguable). Surely she is not a support hero because have no disable and any supportive spells (kinda selfish ), but she have 3 defensive skills and 3 offensive. She is a Hybrid. The defensive skill is for survival and stay longer while her only offensive is damage dealing from the ultimate that is the player must activate simultaneously to give higher damage. So before reaching level 6, the player must play defensive.Description: Eyna Ultimate Warrior [STR][Sent]Eyna The Ultimate Warrior[REMAKE]",
    "textAfterTable": "Starting HP/MP: 568/260 Attack Range: melee Back Fire – Autocast Type: autocast Targeting: self Hotkey: e With training, she learn to back fire hex, stun and slow attacks to her to the one who cast it although not perfectly   Mana Cooldown Range AoE Duration Effects 1 50 11 - - - back fire hex, slow and stun cast on her to the caster with random duration",
    "hasKeyColumn": true,
    "keyColumnIndex": 6,
    "headerRowIndex": 0
}