{
    "relation": [
        [
            "Parameter",
            "Last-Modified",
            "Content-Length",
            "Content-Length",
            "Content-Type",
            "X-Timestamp",
            "ETag",
            "Content-Encoding (Optional)",
            "Content-Disposition (Optional)",
            "X-Delete-At (Optional)",
            "X-Object-Manifest (Optional)",
            "X-Object-Meta-name",
            "X-Static-Large-Object",
            "X-Trans-Id",
            "Date"
        ],
        [
            "Style",
            "header",
            "header",
            "header",
            "header",
            "header",
            "header",
            "header",
            "header",
            "header",
            "header",
            "header",
            "header",
            "header",
            "header"
        ],
        [
            "Type",
            "xsd:string",
            "xsd:string",
            "xsd:string",
            "xsd:string",
            "xsd:string",
            "xsd:string",
            "xsd:string",
            "xsd:string",
            "xsd:string",
            "xsd:string",
            "xsd:string",
            "xsd:bool",
            "csapi:uuid",
            "xsd:datetime"
        ],
        [
            "Description",
            "The date and time that the object was created or the last time that the metadata was changed.",
            "The length of the object content in the response body, in bytes.",
            "HEAD operations do not return content. However, in this operation the value in the Content-Length header is not the size of the response body. Instead it contains the size of the object, in bytes.",
            "The MIME type of the object.",
            "The date and time, in UNIX Epoch timestamp format, when the object was initially created as a current version.",
            "For objects smaller than 5 GB, this value is the MD5 checksum of the object content. The value is not quoted. For manifest objects, this value is the MD5 checksum of the concatenated string of MD5 checksums and ETags for each of the segments in the manifest, and not the MD5 checksum of the content that was downloaded. Also the value is enclosed in double-quote characters. You are strongly recommended to compute the MD5 checksum of the response body as it is received and compare this value with the one in the ETag header. If they differ, the content was corrupted, so retry the operation.",
            "If set, the value of the Content-Encoding metadata. If not set, this header is not returned by this operation.",
            "If set, specifies the override behavior for the browser. For example, this header might specify that the browser use a download program to save this file rather than show the file, which is the default. If not set, this header is not returned by this operation.",
            "If set, the time, in UNIX Epoch timestamp format, when the object will be deleted by the system. If not set, this header is not returned by this operation.",
            "If set, to this is a dynamic large object manifest object. The value is the container and object name prefix of the segment objects in the form container/prefix.",
            "The custom object metadata item, where {name} is the name of the metadata item. One X-Object-Meta-{name} response header appears for each metadata item (for each {name}).",
            "Set to True if this object is a static large object manifest object.",
            "A unique transaction identifier for this request. Your service provider might need this value if you report a problem.",
            "The transaction date and time."
        ]
    ],
    "pageTitle": "OpenStack API Documentation",
    "title": "",
    "url": "http://developer.openstack.org/api-ref-objectstorage-v1.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042991076.30/warc/CC-MAIN-20150728002311-00307-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 61264067,
    "recordOffset": 61226559,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{13822=Used with temporary URLs to specify the expiry time of the signature as a UNIX Epoch timestamp, which is an integer value. For example, 1390852007 represents Mon, 27 Jan 2014 19:46:47 GMT. For more information about temporary URLs, see OpenStack Object Storage API v1 Reference .}",
    "TableContextTimeStampAfterTable": "{94186=See http://www.ietf.org/rfc/rfc2616.txt.}",
    "lastModified": "Tue, 04 Aug 2015 12:39:53 GMT",
    "textBeforeTable": "Request parameters 204 , 200 Normal response codes . Success. The response body shows no containers. Either the account has no containers or you are paging through a long list of names by using the marker, limit, or end_marker query parameters, and you have reached the end of the list. 204 . Success. The response body lists the containers. 200 If the request succeeds, the operation returns one of these status codes: with content indicating an empty array. 200 , because there is no content. However, for a JSON or XML response, you get a 204 When asking for a list of containers and there are none, the response behavior changes depending on whether the request format is text, JSON, or XML. For a text response, you get a If you use query parameters to page through a long list of containers, you have reached the end of the list if the number of items in the returned list is less than the request limit value. The list contains more items if the number of items in the returned list equals the limit value. The response body returns a list of containers. The default response (text/plain) returns one container per line. List containers and ask for an XML",
    "textAfterTable": "Style Type Description Content-Length header xsd:string The length of the response body that contains the list of names. If the operation fails, this value is the length of the error text in the response body. Content-Type header xsd:string The MIME type of the list of names. If the operation fails, this value is the MIME type of the error text in the response body. X-Account-Object-Count header xsd:int The number of objects in the account. X-Account-Bytes-Used header xsd:int The total number of bytes that are stored in Object Storage for the account. X-Account-Container-Count header xsd:int The number of containers. X-Account-Meta-name (Optional) header xsd:string The custom account metadata item, where {name} is the name of the metadata item. One X-Account-Meta-{name} response header appears for each metadata item (for each {name}). X-Timestamp header xsd:int The time and date, in UNIX Epoch timestamp format, when the account was initially created as a current version. X-Account-Meta-Temp-URL-Key (Optional) header xsd:string The secret key value for temporary URLs. If not set, this header is not returned by this operation. X-Account-Meta-Temp-URL-Key-2 (Optional) header xsd:string A second secret key value for temporary URLs. If not set, this header is not returned by this operation. X-Trans-Id header csapi:uuid A unique",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}