{
    "relation": [
        [
            "Categories",
            "Campus Safety",
            "Greek Life",
            "Clubs and Activities",
            "Great for these types of students",
            "Share any unusual traditions or locations on campus",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "campus safety is good on campus. even though slu is not located in the best part of town, the security on campus makes me feel safe. the department of public safety patrols at night in their cars and on bike. there are also emergency poles with phones on them located around campus. they also provide escorts late at night if a person needs one.",
            "greek life at slu is great and different than other universities that i have heard of. i am involved in greek life here, and i am very glad that i am. the emphasis of being greek here is not only about having fun and making new friendships, but it is really about expressing and living out the values of the sorority or fraternity. the entire greek community is supportive of each other, rather than competitive. everyone holds each other up to a high standard of conduct, as well.",
            "there is a very wide variety of activities and clubs to choose from at slu. a lot of clubs involve service or social justice themes. in addition, there are a lot of clubs for people interested in different sports (ultimate frisbee, outdoors club, extreme kayak club, etc.). there are also a lot of clubs associated with academics or majors.",
            "slu is great for students who care about their education and who care about broadening their worldview. every student who comes here experiences growth in some way due to the education here.",
            "the biggest joke about our campus is the unending and increasingly bizarre plethora of statues scattered about campus. they are everywhere, and many of them are extremely weird and creepy. many of them are of naked people or angels. one is a mixture of a male and female parts, with a gaping hole in the chest. others are children reading or sitting on benches. no one understands why they are there or why they are so strange, but they definitely make the campus unique.",
            "since slu is located right in midtown saint louis, there are interesting things to do throughout the city. forest park is a popular attraction which includes the free zoo, science center, art museum, and history museum. i personally enjoy going downtown to watch the cardinals at busch stadium. another fun area nearby is the central west end, which is filled with restaurants and shops. on campus, most people just hang out in apartments or dorms and go to the sporting events. the student activities board also offers fun things to do on the weekend like spa nights or have small bands come in to perform or movie nights.",
            "overall, the food is good for college cuisine. the best place to eat on campus in my opinion is abp in the student center, which offers soup, sandwiches, and salads. there is also a subway on campus, which is wonderful. terra ve offers vegetarian and healthier options for food, which is also one of my favorites. the only complaint i have about the campus food is the inconvenient weekend hours.",
            "dorm life is very fun here! i lived in a learning community my first year at slu, and that was a great experience. i was able to meet other students with the same interests as me, and we became one big family. however, i will say it was difficult to meet people besides those who were on my floor last year. it would have been fun to live in the main freshmen dorm instead.",
            "academically, slu is an excellent university. i am constantly being challenged and my mind and worldview are expanding all the time. so far, one of the things i have come to value most about slu has been the holistic view to an education that we have here; the liberal arts education allows students to connect many aspects of life into one comprehensive education.",
            "do not be afraid to get involved right away. if you do not make an effort to meet people, it will be difficult to meet them. also, be aware of campus safety by always traveling in groups, especially at night.",
            "saint louis university is a campus bustling with diversity, excitement, and opportunities. the education is top-of-the-line, and there are many ways to get involved. this university has a place for everyone, no matter what your background or interests are."
        ]
    ],
    "pageTitle": "Saint Louis University (SLU) Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Saint-Louis-University-Main-Campus/reviews?_escaped_fragment_=/show/21426",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042982502.13/warc/CC-MAIN-20150728002302-00150-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 872315583,
    "recordOffset": 872232822,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{355212=Make a Difference Day is a huge campus-wide day of service that happens each October. A large portion of the student body volunteers with their floors or student organizations and spends the day doing service somewhere in the community., 39968=When I first started school in August, I thought SLU would be boring...all about the academics. Although almost everyone is very academically focused, this school is so much fun too! I'm a commuter student as well which can be tough, but they really make an effort to reach out and get everyone involved. From soccer games to community breakfasts and Greek rush week, everything is soooo enjoyable!, 94907=I could not praise the programs here more. I had no idea what my majors entailed before coming to SLU and the extent that each would reach. The classes have a great 13:1 student-teacher ratio so I get one on one time with teachers, making the learning environment even better. I'm in my sophomore year and feel like I've already learned more here than I did in 4 years of high school., 383049=© 2015, Cappex.com, LLC, 3567=Saint Louis University it is my favorite place to be in the world! All the people I have met here are caring and wonderful people. I can't imagine attending any other college because I believe that not only the academics wouldn't compare, but the environment in which you are in on and off campus is second to none. My new friends I've made I know will be life long friends that I will stay in touch with no matter where life takes me. We all have helped each other out and continue to do so, not because we have to, but because our floor has become a community. We look out for each other where ever we go and because of this, Saint Louis University is so enjoyable. I've heard similar stories from all of my other friends in different residence halls so it is not a isolated case. I believe it is because of SLU's learning communities. Learning Communities are people who live on the same floor who have similar majors and goals in life. This means that most of the people in learning communities are taking the same classes and experiencing the same hardships which makes it very easy to understand what people are going through and to help each other out. Everyone on campus is really friendly, including the professors! I stopped by my chemistry teacher's office one day because a problem on my test was not graded correctlyand we ended up talking for over and hour about family, gravity, and zero degrees Kelvin! I know it sounds nerdy but it was one of the most interesting conversations I've had. The thing that got me though was he has a lecture hall full of students and he still has time to talk to me for an hour and the only reason the conversation ended was because I had to head to work! The off campus experience is just as amazing. There are plenty of things to do in the city of Saint Louis and SLU students get discounts on many of the nearby performing arts centers such as Powell Symphony Hall and the Fabulous Fox Theatre. At Powell Hall SLU students can get $90 tickets for $10! The metrolink is also nearby which takes you to pretty much anywhere in Saint Louis that is worth visiting. This includes Forest Park (which is the largest park in the world). Forest Park houses the Muny which is the biggest outdoor theatre in the world! I've been to shows there and they have all been so amazing and there are also free seats! So you can go have a night out without spending any money at all! There are art museums and the St. Louis Zoo in forest park also and they are free too. The only thing you have to pay for is the Metro ticket which is $2.25 each way. Can you imagine only spending $5.50 but getting to go to the Zoo, see a profession theatre show, and get to appreciate some great art? No where else can you find a deal like that. The metrolink also stops by the Delmar Loop, which houses tons of restaurants and concert venues. Pi is the best pizza place you will ever go to and I'm not the only one that thinks that, even the President has it at the White House because it is so delicious! Froyo is a frozen yogurt/ice cream restaurant that will tickle your taste buds into delight because no other ice cream shop matches Froyo. Also there is the Pageant, which is a concert venue and I saw my favorite band there! The tickets only cost $18 and I got to get as close as I wanted! There are limitless possibilities at Saint Louis University and there is always something to do on and off campus. If you come here, you're in the prime spot to make tons of great memories with new friends but also to be challenged academically., 359871=Especially good school for students going into pre-med or for students wanting to be nurses. If you want to be in the pre-med program, pay close attention to the deadline. It's in December and easy to overlook if you don't keep an eye out for it.}",
    "textBeforeTable": "12/24/2009 Reviewer is A current student here. 13 out of 13 people found this review useful. 1 of 83 Evan from Brighton, IL Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5",
    "textAfterTable": "Am enjoying being here I am a commuter, so getting involved on campus is very important for me. Saint Louis University really makes it easy! There are so many groups and organizations on campus: CEO Club (for aspiring execs), art clubs, musical groups and much more. As a Jesuit institution, there are many religious and community service groups on campus as well. Also, despite a lack of diversity on campus, there are many organizations for minorities, such as the Black Student Alliance, the Muslim Student Association, as well as groups for Asians and Hispanic students. Am learning a lot The classes here are great (although I am speaking from a more science-based perspective as a premed student). I took a heavy science load during my first semester, and I liked how detailed the instruction was. Most of the freshman science classes are quite large, so the teachers use things like projectors, microphones, PowerPoint, and RSF clickers to help students stay engaged. The grading curve makes things even better! The lectures can become a little boring, though, and it can be a challenge to stay engaged during classes; however, they are only fifty minutes long, and they only meet three times a week, so it isn’t that bad. The labs, which run almost three hours, are quite different. Although they are quite long, they",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}