{
    "relation": [
        [
            "Year",
            "2007",
            "2005",
            "2005",
            "2004",
            "2004",
            "2003",
            "2002",
            "2002",
            "2002",
            "2002"
        ],
        [
            "Opponent",
            "Tennessee",
            "South Carolina",
            "Florida",
            "Ole Miss",
            "Kentucky",
            "Miss. State",
            "Ole Miss",
            "Tennessee",
            "Vanderbilt",
            "LSU"
        ],
        [
            "Score",
            "41-17",
            "37-14",
            "31-3",
            "28-7",
            "45-17",
            "38-0",
            "42-7",
            "34-14",
            "30-8",
            "31-0"
        ],
        [
            "Highlight",
            "DJ Hall breaks school record with 13 catches (185 yards, 2 TD)",
            "Kenneth Darby carries 20 times for 145 yards and a TD",
            "Tyrone Prothro catches 5 passes for 134 yards and two TDs",
            "Ray Hudson runs for 116 yards on 14 carries with two TDs",
            "99 yards each for Hudson, Darby; Prothro breaks 100-yard KO return",
            "Brodie Croyle connects on 9 of 14 passes for 183 yards and three TDs",
            "Santonio Beard rushes 13 times for 138 yards and five TDs",
            "Gerald Dixon returns fumble 66 yards to open a 7-0 Alabama lead",
            "Tyler Watts throws 15 of 21 for 176 yards, adds 55 yards on ground",
            "Shaud Williams runs 16 for 131; Sam Collins adds 115 rec. yards"
        ]
    ],
    "pageTitle": "UGASports.com - The Sunday Rewind: Tide 41, Volunteers 17",
    "title": "",
    "url": "https://uga.rivals.com/content.asp?CID=729365",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042991076.30/warc/CC-MAIN-20150728002311-00085-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 877162459,
    "recordOffset": 877140493,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{1923=Rivals.com is your source for: College Football | Football Recruiting | College Basketball | Basketball Recruiting | College Baseball | High School | College Merchandise Site-specific editorial/photos © 2006 UGASports.com. All rights reserved. This website is an officially and independently operated source of news and information not affiliated with any school or team. About | Advertise with Us | Contact | Privacy Policy | About our Ads | Terms of Service | Copyright/IP policy | Yahoo! Sports - NBC Sports Network Statistical information ©2014 STATS LLC All Rights Reserved.}",
    "TableContextTimeStampAfterTable": "{41738=October 21, 2007}",
    "textBeforeTable": "The Sunday Rewind, we'll define a blowout as a margin of 20 points or more. So without further delay, below is a look at Alabama's last 10 wins by 20 points or more against SEC teams. The Alabama football team forged a rout in conference play Saturday against rival Tennessee, 41-17, and for a team that has made a habit of close final scores, it was indeed a rarity. The Crimson Tide briefly trailed 14-10 early in the game, but then responded with a 31-3 run to turn a game that is normally a nail-biter into a laugher. So where are the real hammers in Alabama's recent history? For purposes of Rammer Jammer Hammers Alabama 41, Tennessee 17: D.J. Hall - 13 catches, 185 yards, 2 TDs \u0085 John Parker Wilson - 32 of 46, 365 yards, 3 TDs, 0 INTs. \u0085 Terry Grant - 26 carries, 104 yards, TD rush, TD catch. \u0085 Kareem Jackson - 2 INTs. \u0085 Leigh Tiffin - 4 of 5 on FGs. The Sunday Rewind is a weekly collection of notes and quotes from the Alabama football game of the weekend. October 21, 2007 The",
    "textAfterTable": "By the numbers A look at a few numbers from Alabama's 41-17 win over Tennessee. 30:51 Over the last three quarters (45 minutes of game-clock time), the Crimson Tide held the ball for 30:51. 1.000 Alabama batted 1.000 on red-zone scoring chances, cashing in on each of five trips inside the Tennessee 20. 185 DJ Hall's 185 receiving yards was a career high. 286 A whopping 286 of Alabama's 510 total yards came on first down. 2 How strong has Alabama's offense been of late? Punter P.J. Fitzgerald has punted only two times in each of UA's last two games. Shutterbug",
    "hasKeyColumn": true,
    "keyColumnIndex": 1,
    "headerRowIndex": 0
}