{
    "relation": [
        [
            "First Name",
            "Peter",
            "Terri"
        ],
        [
            "Last Name",
            "Muller",
            "Kokinda"
        ],
        [
            "Suffix",
            "",
            ""
        ],
        [
            "Covered Official Position (if applicable)",
            "",
            ""
        ],
        [
            "New",
            "",
            ""
        ]
    ],
    "pageTitle": "LD-2 Disclosure Form",
    "title": "",
    "url": "http://soprweb.senate.gov/index.cfm?event=getFilingDetails&filingID=9FDDEEC4-458C-4761-9007-691AB8283A5F&filingTypeID=69",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042982502.13/warc/CC-MAIN-20150728002302-00051-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 222899727,
    "recordOffset": 222891525,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{1019=Lobbying Disclosure Act of 1995 (Section 5) - All Filers Are Required to Complete This Page, 32174=1.Met with ONC, Meaningful Use Stage 3 and Continua Health Alliance on standards and Million Hearts Campaign. 2. Implementation of Affordable Care Act 2 cont'd: -Center for Medicare and Medicaid Innovation calling for more technology oriented pilots/programs -Section 2715 employer requirements for employee communication of coverage choices - requested that new rules reduce duplication of employee benefits information -Independence at Home Act advocated for expanding the cap on number of patients served 3.Implementation of ARRA stimulus requirements for standards for interoperability including congressional briefing 4.Mhealth to develop streamline FDA regulations 5.The Food and Drug Administration Safety and Innovation Act (Public Law 112- 144) specifically - Medical Device User Fee Amendments - streamlining FDA regulations for mhealth 6.Medicare Data Access S756 for Transparency and Accountability Act. 7. Reauthorization of Older Americans Act development of pilot design for integrating technology solution for RPM, 15013=HR 2161; HR 3012; S.1857; S.1983; S. 3185; S. 3192; S. 3217, H.R. 6429; H.R. 6412 Lobbied in support of Rep. Chaffetz/Sen. Lee Fairness for High Skilled Immigrants bill to eliminate per-country caps. Met with House and Senate staff regarding other immigration legislation that is being drafted. Focused on issues of green cards and H1-B visas. Lobbied on behalf of Senator Cornyns START Act, Senators Alexander-Coons SMART Act, and Senators Moran-Warner START UP 2.0 Act. Lobbied in support of the STEM Jobs Act of 2012, which was voted on in the House, and Rep. Lofgrens Attracting the Best and Brightest Act. Uniting American Families Act H.R. 1537/S. 821 Lobbied House and Senate staff and members in support of legislation to permit gay and lesbian citizens to sponsor their foreign-born partners for immigration., 21929=S.1747 Computer Professionals Update Act; We lobbyied for additional Senate and House member support to revise the FLSA by modernizing the Computer Professional exemption so that it aligns with the expanded roles being performed by computer professionals today and has room to continue to grow along with the industry.}",
    "textBeforeTable": "",
    "textAfterTable": "City WASHINGTON State DC Zip Code 20004 Country USA 3. Principal place of business (if different than line 2) City   State   Zip Code   Country   4a. Contact Name b. Telephone Number c. E-mail  Ms.  ZAKIYA Y JOHNSON  2026264392  zakiya.y.johnson@intel.com 5. Senate ID#  19536-12",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}