{
    "relation": [
        [
            "",
            "Step 1",
            "Step 2",
            "Step 3",
            "Step 4",
            "Step 5",
            "Step 6",
            "Step 7",
            "Step 8",
            "Step 9",
            "Step 10",
            "Step 11",
            "Step 12"
        ],
        [
            "Command or Action",
            "enable Example: Router> enable",
            "configure terminal Example: Router# configure terminal",
            "ip multicast-routing [distributed] Example: Router(config)# ip multicast-routing",
            "ip pim ssm {default | range access-list} Example: Router(config)# ip pim ssm default",
            "interface type number Example: Router(config)# interface gigabitethernet 1/0/0",
            "ip pim sparse-mode Example: Router(config-if)# ip pim sparse-mode",
            "Repeat Steps 1 through 6 on every interface that uses IP multicast.",
            "ip igmp version 3 Example: Router(config-if)# ip igmp version 3",
            "Repeat Step 8 on all host-facing interfaces.",
            "end Example: Router(config-if)# end",
            "show ip igmp groups [group-name | group-address| interface-type interface-number] [detail] Example: Router# show ip igmp groups",
            "show ip mroute Example: Router# show ip mroute"
        ],
        [
            "Purpose",
            "Enables privileged EXEC mode. Enter your password if prompted.",
            "Enters global configuration mode.",
            "Enables IP multicast routing. Use the distributed keyword to enable Multicast Distributed Switching.",
            "Configures SSM service. The default keyword defines the SSM range access list as 232/8. The range keyword specifies the standard IP access list number or name that defines the SSM range.",
            "Selects an interface that is connected to hosts on which IGMPv3 can be enabled.",
            "Enables PIM on an interface. You must use sparse mode.",
            "--",
            "Enables IGMPv3 on this interface. The default version of IGMP is set to Version 2. Version 3 is required by SSM.",
            "--",
            "Ends the current configuration session and returns to privileged EXEC mode.",
            "(Optional) Displays the multicast groups having receivers that are directly connected to the router and that were learned through IGMP. A receiver must be active on the network at the time that this command is issued in order for receiver information to be present on the resulting display.",
            "(Optional) Displays the contents of the IP mroute table. This command displays whether a multicast group is configured for SSM service or a source-specific host report has been received."
        ]
    ],
    "pageTitle": "IP Multicast: PIM Configuration Guide, Cisco IOS Release 12.4T - Configuring Basic IP Multicast [Support] - Cisco",
    "title": "",
    "url": "http://www.cisco.com/c/en/us/td/docs/ios-xml/ios/ipmulti_pim/configuration/12-4t/imc-pim-12-4t-book/imc_basic_cfg.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042991076.30/warc/CC-MAIN-20150728002311-00232-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 358396739,
    "recordOffset": 358348591,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{1475=Thus, all routers automatically discover which RP to use for the groups they support. The Internet Assigned Numbers Authority (IANA) has assigned two group addresses, 224.0.1.39 and 224.0.1.40, for Auto-RP.}",
    "TableContextTimeStampAfterTable": "{241352=RFC 2362 specifies that the BSR RP be selected as follows (RFC 2362, 3.7):, 24641=Allocating a unique IP multicast group address for an application is still a problem. Most short-lived applications use mechanisms like Session Description Protocol (SDP) and Session Announcement Protocol (SAP) to get a random address, a solution that does not work well with a rising number of applications in the Internet. The best current solution for long-lived applications is described in RFC 2770, but this solution suffers from the restriction that each autonomous system is limited to only 255 usable IP multicast addresses., 260078=RFC 2770, 241085=When Cisco and non-Cisco routers are being operated in a single PIM domain with PIM Version 2 BSR, care must be taken when configuring candidate RPs because the Cisco implementation of the BSR RP selection is not fully compatible with RFC 2362., 243250=In this example, a candidate RP on GigabitEthernet interface 1/0/0 announces a longer group prefix of 224.0.0.0/5 with a lower priority of 20. The candidate RP on GigabitEthernet interface 2/0/0 announces a shorter group prefix of 224.0.0.0/4 with a higher priority of 10. For all groups that match both ranges a Cisco router will always select the candidate RP on Ethernet interface 1 because it has the longer announced group prefix. A non-Cisco fully RFC 2362-compliant router will always select the candidate RP on GigabitEthernet interface 2/0/0 because it is configured with a higher priority., 259373=RFC 1112, 17181=ISM service is described in RFC 1112. This service consists of the delivery of IP datagrams from any source to a group of receivers called the multicast host group. The datagram traffic for the multicast host group consists of datagrams with an arbitrary IP unicast source address S and the multicast group address G as the IP destination address. Systems will receive this traffic by becoming members of the host group. Membership in a host group simply requires signaling the host group through IGMP Version 1, 2, or 3., 237010=The anycast RP example above uses IP addresses taken from RFC 1918. These IP addresses are normally blocked at interdomain borders and therefore are not accessible to other ISPs. You must use valid IP addresses if you want the RPs to be reachable from other domains., 242283=Inconsistent candidate RP selection between Cisco and non-Cisco RFC 2362-compliant routers in the same domain if multiple candidate RPs with partially overlapping group address ranges are configured can occur. Inconsistent candidate RP selection can prevent connectivity between sources and receivers in the PIM domain. A source may register with one candidate RP and a receiver may connect to a different candidate RP even though it is in the same group., 259723=RFC 1918, 8080=Following the election of the BSR, candidate RPs use unicast to announce to the BSR their willingness to be the RP. The BSR advertises the entire group-to-RP mapping set to the router link local address 224.0.0.13. Unlike the RP mapping agent in Auto-RP, which is used by Auto-RP to select the RP, every router in the BSR network is responsible for selecting the RP., 244713=In this configuration the candidate RP on Ethernet interface 2 announces group address 224.0.0.0/5 and 232.0.0.0/5 which equal 224.0.0.0/4, but gives the interface the same group prefix length (5) as the candidate RP on Ethernet 1. As a result, both a Cisco router and an RFC 2362-compliant router will select the RP Ethernet interface 2., 69478=Causes IP multicast traffic for the two Auto-RP groups 224.0.1.39 and 224.0.1.40 to be PIM dense mode flooded across interfaces operating in PIM sparse mode.}",
    "textBeforeTable": "DETAILED STEPS 12.    show ip mroute 11.    show ip igmp groups [group-name | group-address| interface-type interface-number] [detail] 10.    end 9.    Repeat Step 8 on all host-facing interfaces. 8.    ip igmp version 3 7.    Repeat Steps 1 through 6 on every interface that uses IP multicast. 6.    ip pim sparse-mode 5.    interface type number 4.    ip pim ssm {default | range access-list} 3.    ip multicast-routing [distributed]",
    "textAfterTable": "What to Do Next What to Do Next Proceed to the \" Verifying IP Multicast Operation \" module. Configuring Bidirectional PIM This section describes how to configure bidirectional PIM (bidir-PIM). Before You Begin All access lists needed when configuring bidirectional PIM must be configured prior to beginning the configuration task. SUMMARY STEPS 1.    enable 2.    configure terminal 3.    ip multicast-routing [distributed] 4.    interface type number 5.    ip pim sparse-mode 6.    exit 7.    ip pim bidir-enable 8.    ip pim rp-address rp-address [access-list] [override] bidir 9.    end 10.    Repeat Steps 2 through 9 on every multicast-enabled interface",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}