{
    "relation": [
        [
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            ""
        ],
        [
            "Forum",
            "GTA V PC, Gameplay, Guides & Strategies, Help & Support This forum is dedicated to discussion about the latest installment in the series, Grand Theft Auto V.",
            "GTA IV PC, Gameplay, Episodes from Liberty City, Multiplayer, Guides & Strategies, Help & Support This section is dedicated to Grand Theft Auto IV - the ninth title in the series, released in 2008.",
            "GTA Chinatown Wars This forum is dedicated to GTA: Chinatown Wars - the tenth game in the series, and the first to be developed for Nintendo DS.",
            "GTA Vice City Stories This forum is dedicated to GTA: Vice City Stories - a prequel to GTA: Vice City, released in 2006.",
            "GTA Liberty City Stories This forum is dedicated to GTA: Liberty City Stories - the first 3D portable Grand Theft Auto title, released in 2005.",
            "GTA San Andreas Gameplay, Mission Help, Guides & Strategies, Help & Support, PC Modding This forum is dedicated to GTA: San Andreas - the fifth title in the series, released in 2004.",
            "GTA Vice City Gameplay, Guides & Strategies, Help & Support, PC Modding This forum is dedicated to GTA: Vice City - the fourth title in the series, released in 2002.",
            "GTA III Gameplay, Guides & Strategies, Help & Support, PC Modding This section is dedicated to Grand Theft Auto III - the first 3D title in the series, released in 2001.",
            "Top Down Games GTA Advance, GTA 2, GTA This section is dedicated to the 2D Grand Theft Auto titles, including the original, GTA 2, and GTA Advance.",
            "GTA Series GTA Concepts General chat related to the series. This section can also be used to post concept threads for new GTAs."
        ],
        [
            "Stats",
            "85,099 topics 2,123,792 replies",
            "85,550 topics 1,153,595 replies",
            "1,071 topics 11,069 replies",
            "4,218 topics 64,757 replies",
            "5,996 topics 75,810 replies",
            "50,538 topics 466,152 replies",
            "22,766 topics 196,284 replies",
            "4,270 topics 60,436 replies",
            "1,128 topics 8,214 replies",
            "3,598 topics 115,166 replies"
        ],
        [
            "Last Post Info",
            "Analysis of two easily fixe... By Heists A minute ago",
            "Reasons why GTA IV is bette... By MrDeSanta 9 minutes ago",
            "The Ultimate 100% Save File... By Militia A day ago",
            "The Ultimate 100% Save File... By Militia 8 hours ago",
            "Whats your favorite/hated r... By Kristian. 3 hours ago",
            "New Model Army By mikey_1982 2 hours ago",
            "Something that has always b... By spaceeinstein An hour ago",
            "Grand Theft Auto III Chain... By Kristian. 3 hours ago",
            "Anybody has a 100 % savegame? By Cerium 23 hours ago",
            "Create your own radio stati... By Sayuri 45 minutes ago"
        ]
    ],
    "pageTitle": "GTAForums",
    "title": "",
    "url": "http://gtaforums.com/index.php?act=Post&CODE=06&f=263&t=548522&p=1062327821",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 1,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986625.58/warc/CC-MAIN-20150728002306-00118-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 105323379,
    "recordOffset": 105297677,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{133943=© 2001-2015 GTANet.com | Cookies and Privacy Policy | Copyright Statement, 12798=This forum is dedicated to GTA: Vice City Stories - a prequel to GTA: Vice City, released in 2006., 47644=Bing, Google, monkb4skunk, ringo336, Yahoo, Jinx., Saint Chewy, Hotbunsyip, Lucid2020, Indiana24, Hell No.., Ledorus, DumbForum, Awayfromkeyboard, lolznc, theGTAking101, Cornphlake, DJThanos, Slam_Jones, Lord Helton, Heists, GunsNroses61, fiebru787, Gtaman_92, Neopolitan, NikoJohnsonToreno, MrSaucyZ, Verstappen, AboveAndBeyoncé, Warablo, Untitled Player, RideEmOut2, JRC99, souldisposal, SonofUgly, Antigenetic, Colbydogs, SNES, D3ADSH0T, DaltonWilliams123, LambentBunny, Abzinth, grunsker, icecoldkilla1467, SSJEavan747, Sunblessed, DoctahWong, Saso70, Chloroform, statistic, TexasRocks, Str33tJustus, savenplayftw, blacknambala, Tanboom, santtuu74., DJS, ultimategame92, coolmaster958, JuanG12, xTOMMYTROJANx, deadx23, -Velox, SNL, GTAKid667, craigdyid, Lowi, Sparky McWonderpants, DISTRICT7642, dewtech_2008, xXTwisted DevilXx, ChickenAndBeer, KingxGregory, Pavle, Mottershead, alfscooby98, Jon3s, KlIIUMlNATl, Fozzie_420, Summertime, alexnicnac, Mr Walker, BeckermannDewitt, CMGreger, CjLosSantos, Andreas, Rippir1600, Marwin, hornedturtle, HelloMyNameIs..., Reid505, Twin Turbo, ChrisPerry2, the nameless, Neuling2000, Huraldo, phatcats, ClaudX, m3tal z_DKI, Epic., SuperGTFan, Electrogypsy, 1Skrillz, Jacek_K, StoneCold-Y2J, _MK_, sivispacem, gta4_player, ghilliesuit101, GTA4LIFE9000, Captain Sensib1e, OrionSR, Rusty Balls, Icantthinkofonew, Hombre_Loco, DonSpeedy, jp9865, elhazard1790000, YngDady, Kal74, Kixa, Pegassi Autobot, GamingBunny84, thebrianmo, Retired Mafia, Phoenix_Poop, Randy93, The Mysterious One, gelou307, psymin, zz latios, davidp027, Cripto136, Aquilus, 458Speciale, __TheGovernor__, RamiV2, GTA Master, thalilmythos, Mastah, silverharbinger, Claude Liberty, bronysplatter, xrCore, lexustt, Lester-The-Molester, adit999, TheTechPoTaToCHIP, Ezekeil2Ofive17, Bombshock, Draclonis, Dass Hobo, Anachronistic, wapster, Th3MaN1, LewisVee, Officer Ronson, FlexPiTo, CBH, shobhitlion, Johan2599, a1dopeman, ethandavo, MapRef41N93W, Fox2Quick, VikDarkbomb, x_FRoe__, //XP//, Wesser, Big_Boy_Bmw760Li, No_Flex_zone, Miss Blossom, Demetri_FTO_1., catmandoza, Cyron43, SSKYZX, Nacho raccoon, Pat, nightcheese, Majesticnug420, johnny0331, ssalil, PoeticWhisper, Edmachine, Rucke, misak, hoopz71, gtamoder1234, Eqaulo, pockings, roboticsuperman, Google Mobile, aleex96, _CP_, Lion, Thalyn, Doomscream, Jwolf0531, wootwoots, fenzy09, J Cobra, ashbashbluesfan, Imnotthefiveo, xInfamousRYANx, frodzet, RemyLacroix, BRITLAND, Pentalarc, Hjaere, Rytherik, Superfrogger, SaL_Leone, silentkiller44, gmwahiid, Bolatsi, zapotist, transambill, harvecito, fullxthrottle94, bobo_lave, emptyplayer, Officer Garza, MKYR, MVX11V, ATP2555, rad19dym, Ottae, Black_MiD, feckyerlife, joe grizzly, ReRo, XJpostman, MythAlex, Eneveon, fabisgeffm, Street Mix, GoneGuru666, RYUKEN, Jack_Coen88, Tony_Florence, furaii, Biira99, Drunkmoons, Quakex64, ratchetru1388, emcitement, CaptainMarvel, Tylomon, citizenzombie., BaconBits153, Free Aim Jesus, jeter2, xink, brad476, Choco Taco, X Reaper X, Fujiski ramero, chasez, vlad polkiujhyt, shadowkill98, GeneralSteve93, _F_, ACHILL3S DUNKZ, GrandTheftRobbo, zignat, epoxi, jBhIpS, SonofLosSantos, Progeekzy, darthYENIK, TheN00ster, javiEmma, CrazyTigerGamimg, nLytin, Brayzie, CarnageRacing00, Gustavob, NotTodayyJunior, PsYcHoZiZm, Itzreality, customkingpimp, Zetta Slow, jdude1969, Souris, StepNaza, zoso80, TheNameless, ChrissyBoi87, mkjah222, RustyShackleford, NoxKira, Kyle17, Fetti Debartolo, Friskey x, vnctmrn, SchoolOfHardKnocks, Quejki, NotAHipster, Viper5900, TheUnbalanced, McH2Oz2, TheSniperCat13, silenthunterdgm, PNutterSammich, RedRyder2142, Axe_Gaijin, Mak, Silent, Daz, GTAV112, foresaken1mc, camo_boy67, Hunter241, Above Omnipotence, DrRockso26, stcro1, mathewisonfire, DANIEL3GS, Kahkenbols, arewenotmen, bt flash, Neddo, CaptianBackwoods, sleepwalk1980, em1b16a2, MaxPayne47, M.K.N., Dr WGA Labriskagni, YaDoesntHaveToCallMeRay, Acetaminophen, 69_black_69, xoutlaww, knightsgarage, Jacob_Rivera_11232, CptAngel, oreank582894, TheDarkestElite, HilArius999, Luucky, 22Laxer22, 16824=This forum is dedicated to GTA: San Andreas - the fifth title in the series, released in 2004., 9516=This section is dedicated to Grand Theft Auto IV - the ninth title in the series, released in 2008., 18981=This forum is dedicated to GTA: Vice City - the fourth title in the series, released in 2002., 21123=This section is dedicated to Grand Theft Auto III - the first 3D title in the series, released in 2001., 14516=This forum is dedicated to GTA: Liberty City Stories - the first 3D portable Grand Theft Auto title, released in 2005.}",
    "textBeforeTable": "Toggle Grand Theft Auto Grand Theft Auto (adsbygoogle = window.adsbygoogle || []).push({}); 2 minutes ago By dewtech_2008 GTAF All-Stars - characters... 613,538 replies 15,190 topics Social lounge for multiplayer crews & forum gangs. Recruitment Crews & Gangs A minute ago By RideEmOut2 [PS4] Criminal Mastermind C... 2,279,460 replies 113,232 topics This is a general discussion forum for Grand Theft Auto Online. Help & Support",
    "textAfterTable": "Toggle GTA Mods GTA Mods   Forum Stats Last Post Info GTA Modding GTA V, GTA IV, GTA III, VC & SA, Tutorials, Art Support General discussion and support. 48,445 topics 416,565 replies beginner to mods - where ca... By Phoenix_Poop 5 minutes ago Mod Showroom Scripts & Plugins, Maps, Total Conversions,",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}