{
    "relation": [
        [
            "Forum",
            "Woodworking Skill Share Your woodworking skills are displayed for several lifetimes in each project. Have you had to compromise your project...",
            "Woodturning On the lathe, by the lathe: do you have questions? frustrations? tips? This forum is for all the woodturners out there.",
            "Woodcarving Relief, 3D, chip-carving, whittling; carving knives, chisels, pocket-knives, power tools. If you are a carver or want...",
            "Scrollsawing Intarsia, fretwork, intricate design cutting and more! This forum is for scrollsawers: share your tips, ask questions...",
            "Joinery Have a question? a tip/strategy to share? a challenge, perhaps? Share your \"joinery\" discussion here.",
            "Finishing The finish, whether paint, wax, stain, or something else, can make or break a project. What are your tips and questio...",
            "Designing Woodworking Projects Looking for information on designing your projects? Having difficulties reading project plans? Looking for help with ...",
            "Power Tools, Hardware and Accessories Are you unsure of which tools, or hardware, you need, or which brands to buy? Investing in tools and hardware can be ...",
            "CNC Woodworking Questions and answers about CNC machines, tooling, best practices, and projects.",
            "Hand Tools Wood, your hand tools, you and a little know-how. Share your questions, tips and strategies for the use and maintenan...",
            "Jigs & Fixtures Using a jig is like having a couple extra hands helping out. Show us your jigs, share your tips, strategies and, of c...",
            "Wood & Lumber Different wood requires different woodworking strategies - from cutting to finishing. Share your tips and challenges ...",
            "Safety in the Woodworking Shop Before you pick up those woodworking tools, take the time to ensure your safety in the shop! Eyes, ears, fingers, and...",
            "Focus on the Workspace Are you looking for or do you have tips to share regarding the workshop? Storage, equipment placement, efficiency, an...",
            "Sweating for Bucks Through Woodworking If you are selling your work, then you have entered a woodworking dimension with added complexity and stress. If you...",
            "Woodworking Trade & Swap All of us are holding onto treasure in our shops, that we either don't need, don't want, or could part with if presen...",
            "LumberJocks.com Site Feedback Connect with the Website Gurus and tell us what you are thinking, suggestions, problems, functionality issues, and so...",
            "Coffee Lounge Need a break from all the standing and wood dust? Chat with your Forum Friends about their projects, their life, thei..."
        ],
        [
            "Topics",
            "10479",
            "1084",
            "221",
            "204",
            "690",
            "3218",
            "5098",
            "21935",
            "71",
            "3848",
            "996",
            "4644",
            "1118",
            "1563",
            "1035",
            "3788",
            "1951",
            "7759"
        ]
    ],
    "pageTitle": "claro walnut logs for sale in california - by stumpy @ LumberJocks.com ~ woodworking community",
    "title": "",
    "url": "http://lumberjocks.com/topics/3314",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 5,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986357.49/warc/CC-MAIN-20150728002306-00233-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 153918758,
    "recordOffset": 153902782,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{16235=#8 posted 05-13-2008 12:14 AM, 22514=#11 posted 09-13-2008 04:41 PM, 25833=#13 posted 09-16-2008 08:03 PM, 27471=#14 posted 10-05-2008 06:46 PM, 10662=I am curious about the way this is marketed, by the pound. Please correct me if I make any mathematical errors here. According to my experience (charts to back it up of course), for example, a 22’ X10’ log would weigh right at 1500 lbs. Using Doyle scale for milling that same log would yield 200 bft…or starting at $3.75 bft in log form at $.50 a pound ? I can only assume that includes bark too at $.50 a pound as a bonus., 1944=05-11-2008 10:17 PM, 12695=Of course that was supposed to be a 22 inch x 10 foot log in the above example, mistype, sorry for not proofreading and any confusion. I will try to simplify the math a 1500 lbs log is $750, it should yield 200 bft = $3.75 bft., 24048=#12 posted 09-16-2008 05:22 PM, 14124=#7 posted 05-12-2008 06:18 PM, 10343=#5 posted 05-12-2008 02:48 AM, 3966=#1 posted 05-11-2008 10:38 PM, 5446=#2 posted 05-12-2008 01:14 AM, 21018=#10 posted 05-13-2008 02:45 AM, 47680=©2015 Verticalscope Inc. All Rights Reserved. | Terms of Service | Privacy Policy, 8674=#4 posted 05-12-2008 01:36 AM, 19076=#9 posted 05-13-2008 02:06 AM, 12376=#6 posted 05-12-2008 01:09 PM, 7090=#3 posted 05-12-2008 01:19 AM}",
    "textBeforeTable": "Show all forums View all topics Start new topic signed in to reply. You must be Have your say... -- Harold Seward 707-331-0234 for all of those wondering i do still have tons of claro walnut for sale give me a call at 707-331-0234 i obviously dont check my e-mail often enough let me know what your looking for and i’ll let you how much i can sell it to you for of course big slabs sell, for more by the board foot because they are not only harder to Handel but mostly they re harder to find #14 posted 10-05-2008 06:46 PM 10 posts in 2634 days home | projects | blog stumpy -- Kirk H. -- http://www.kjwoodworking.com Cool wood! I’m still can’t believe the",
    "textAfterTable": "All Posts RSS Projects RSS Blog Entries RSS Reviews RSS Forum Topics RSS Site Blog Entries RSS Go to Pulse page » LumberJocks Pulse   Author Latest activity New comments or replies",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}