{
    "relation": [
        [
            "Citing Patent",
            "US7778221 *",
            "US7856501",
            "US7908393 *",
            "US8005957",
            "US8089914 *",
            "US8787873"
        ],
        [
            "Filing date",
            "Jun 18, 2008",
            "Nov 7, 2008",
            "Nov 7, 2008",
            "Dec 21, 2010",
            "Oct 9, 2007",
            "Nov 5, 2012"
        ],
        [
            "Publication date",
            "Aug 17, 2010",
            "Dec 21, 2010",
            "Mar 15, 2011",
            "Aug 23, 2011",
            "Jan 3, 2012",
            "Jul 22, 2014"
        ],
        [
            "Applicant",
            "Samsung Electronics Co., Ltd.",
            "Sony Computer Entertainment Inc.",
            "Sony Computer Entertainment Inc.",
            "Sony Computer Entertainment Inc.",
            "Electronics And Telecommunications Research Institute",
            "Plusn Llc"
        ],
        [
            "Title",
            "Apparatus and method for requesting bandwidth allocation and allocating bandwidth in a communication system",
            "Network traffic prioritization",
            "Network bandwidth detection, distribution and traffic prioritization",
            "Network traffic prioritization",
            "Relay and method of allocating bandwidth in communication system",
            "System and method for communicating using bandwidth on demand"
        ]
    ],
    "pageTitle": "Patent US7529193 - Method and apparatus for bandwidth request/grant protocols in a wireless ... - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US7529193?dq=6,977,809",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 8,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989018.48/warc/CC-MAIN-20150728002309-00290-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 474684547,
    "recordOffset": 474636959,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{6502=FIG. 15 a is a flow diagram showing one embodiment of the self-correcting bandwidth request/grant protocol 1500. As shown in FIG. 15 a, the method begins at a STEP 1510 whereat the CPE waits for the arrival of data for which bandwidth has not yet been requested. When data arrives, the method proceeds to a decision STEP 1520 to determine whether a timer (referred to in FIG. 15 a as the “MT10 timer”) has expired. The MT10 timer is preferably a dynamic bandwidth request timer as described above. The MT10 timer is associated with the connection/QoS. The value of the MT10 timer is used to determine the number of frames that the method waits between the transmission of aggregate bandwidth requests (in other words, the MT10 timer determines the duration of the timer period between the periodic transmission of aggregate bandwidth requests). The MT10 timer can have different values for each QoS used by the system. The MT10 timer can be dynamically updated to different values depending upon current data flow and connection priority. Any bandwidth requests that are sent before the expiration of the MT10 timer are, by definition, incremental bandwidth requests. In one embodiment, the number of frames between transmission of aggregate bandwidth requests is dependent upon the QoS. In one exemplary embodiment, the MT10 timer duration equals 30 frames (for “real-time VBR” connections, or “rt-VBR”). In another exemplary embodiment, the MT10 timer duration equals 100 frames (for “non-real-time VBR” connections, or “nrt-VBR”).}",
    "TableContextTimeStampAfterTable": "{151442=In one embodiment, the exemplary communication system 1400 utilizes “padding packets” and the well-known TDMA multiplexing scheme. In the well-known TDMA multiplexing scheme, the BS 1450 designates a portion of its uplink sub-frame (i.e., bandwidth) to an associated CPE. In accordance with the exemplary communication system 1400, the associated CPE transmits data to the BS 1450 on the uplink. When a CPE does not have enough uplink data to utilize its entire portion of bandwidth, it transmits padding packets to “pad” or fill the unused portion of bandwidth., 152065=The BS modem 1452 and the BS CPU 1454 transmit uplink and downlink data via the CPU/Modem interface 1456. Examples of uplink and downlink data include control messages, bandwidth request messages, bandwidth allocation messages, CG data, DAMA data, padding packets and flag packets. Embodiments of the bandwidth request protocols will now be described., 162163=In one embodiment, the period counted by the MT5 timer is less than the period counted by the MT10 timer for the same QoS. If the MT5 timer is determined not to have expired at the decision STEP 1532, the method returns to the STEP 1520 to determine whether the MT10 timer has expired. However, if the MT5 timer is determined to have expired at the decision STEP 1532, the method proceeds to a STEP 1522 whereat the method builds an incremental bandwidth request. The format used in building incremental and aggregate bandwidth requests is described in more detail below with reference to Table 1., 57039=Some bandwidth request/grant protocols known as “incremental bandwidth request/grant protocols” attempt to solve the above-described problems relating to data transmission efficiency by utilizing incremental bandwidth requests instead of aggregate bandwidth requests. Incremental bandwidth requests identify the additional bandwidth needs of a CPE connection. For example, in accordance with incremental bandwidth request methods, a base station may allocate 1000 units of bandwidth to an associated CPE connection. At a later time, the CPE connection may require 1,500 units of aggregate bandwidth (i.e., it may require an additional 500 units of bandwidth). In accordance with the incremental bandwidth request/grant protocol, the CPE will transmit an incremental bandwidth request to its associated base station indicating that it requires an additional 500 units of bandwidth. Upon receiving the incremental bandwidth request, the base station calculates the CPE connection's current aggregate bandwidth needs as 1500 units (1000 previously granted units+500 requested units)., 50863=Some prior art systems have attempted to solve bandwidth allocation requirements in a system having a shared system resource by maintaining logical queues associated with the various data sources requiring access to the shared system resource. Such a prior art system is taught by Karol et al., in U.S. Pat. No. 5,675,573, that issued on Oct. 7, 1997. More specifically, Karol et al. teach a bandwidth allocation system that allows packets or cells within traffic flows from different sources that are contending for access to a shared processing fabric to get access to that fabric in an order that is determined primarily on individual guaranteed bandwidth requirements associated with each traffic flow. In addition, the system taught by Karol et al. allow the different sources to gain access to the shared processing fabric in an order determined secondarily on overall system criteria, such as a time of arrival, or due date of packets or cells within the traffic flows. Packets or cells of data from each data source (such as a bandwidth requesting device) are queued in separate logical buffers while they await access to the processing fabric., 43732=This application claims priority to and is a continuation of U. S. application Ser. No. 09/783,671 filed Feb. 14, 2001 now abandoned titled “Method and Apparatus for Abridged Bandwidth Request/Grant Protocol in a Wireless Communication System” which is a continuation-in-part of U.S. application Ser. No. 09/316,518, filed May 21, 1999 now U.S. Pat. No. 6,925,068 titled “Method and Apparatus for Allocating Bandwidth in a Wireless Communication System” both of which are hereby incorporated by reference. This Application is also related to and hereby incorporates by reference U.S. Pat. No. 6,016,311 issued Jan. 18, 2000 and U.S. application Ser. No. 09/613,434, filed Jul. 11, 2000., 167679=In one embodiment, the method waits for duration of 10 frames (for rt-VBR). Alternatively, the method waits for duration of 20 frames (for nrt-VBR). In one embodiment, the period counted by the MT5 timer is less than the period counted by the MT10 timer for the same QoS. If the MT5 timer is determined to have expired at the decision STEP 1532′, the method returns to the decision STEP 1520′ to determine whether the MT10 timer has expired. Else, the method returns to the STEP 1528 to await receipt of an uplink Map. If the bandwidth grant was determined to be appropriate at the decision STEP 1530, the method proceeds to the STEP 1534., 180043=In accordance with the STEP 1630 of the present method, a BS modem identifies a CPE that has transmitted a padding packet from the transmission portion of the uplink sub-frame. One skilled in the communication art shall recognize other methods of identifying CPE's without departing from the scope or spirit of the present invention. The BS modem can identify CPEs at every uplink sub-frame or uplink scheduling interval. After the STEP 1630 the method proceeds to a STEP 1640., 178147=FIG. 16 shows a flowchart for the abridged bandwidth request/grant protocol system. The abridged bandwidth request/grant protocol method 1600 comprises a BS modem portion and a BS CPU portion. The BS modem portion comprises STEPs 1610-1630 and the BS CPU portion comprises STEP 1640. In accordance with one embodiment, steps within the BS modem portion (e.g., STEP 1610) are performed by the BS modem 1452. Similarly, steps within the BS CPU portion are performed by the BS CPU 1454. One skilled in the communication art shall recognize that the steps of the present inventive method may be performed in other configurations without departing from the scope or spirit of the present invention. For example, the present inventive method may perform STEP 1610 in the BS modem and STEPs 1620-1640 in the BS CPU., 44858=As described in the commonly assigned U.S. Pat. No. 6,016,311, issued Jan. 18, 2000, titled “An Adaptive Time Division Duplexing Method and Apparatus for Dynamic Bandwidth Allocation within a Wireless Communication System,” which is hereby incorporated by reference, a wireless communication system facilitates two-way communication between a plurality of subscriber radio stations or subscriber units (fixed and portable) and a fixed network infrastructure. Exemplary communication systems include mobile cellular telephone systems, personal communication systems (PCS), and cordless telephones. The key objective of these wireless communication systems is to provide communication channels on demand between the plurality of subscriber units and their respective base stations in order to connect a subscriber unit user with the fixed network infrastructure (usually a wire-line system). In the wireless systems having multiple access schemes a time “frame” is used as the basic information transmission unit. Each frame is sub-divided into a plurality of time slots. Some time slots are used for control purposes and some for information transfer. Subscriber units typically communicate with the base station using a “duplexing” scheme thus allowing the exchange of information in both directions of connection., 52048=The bandwidth allocation techniques described in the commonly assigned and incorporated U.S. patent application Ser. No.: 09/316,518, filed May 21, 2000, utilizes mechanisms referred to as “bandwidth request/grant protocols” to provide on-demand bandwidth needs of individual CPE connections. Typically, bandwidth request/grant protocols operate in accordance with the following description. A CPE typically transmits a bandwidth request to an associated base station. The request identifies the aggregate (i.e., the total) bandwidth needs of the connection. The base station receives the bandwidth request and determines whether sufficient bandwidth is available to grant the bandwidth request. If sufficient bandwidth is available, the requested bandwidth is granted to the connection, else the base station waits for sufficient bandwidth to become available before granting the requested bandwidth. As described in the parent patent application, bandwidth request/grant protocols improve bandwidth allocation efficiencies in wireless communication systems under ideal conditions.}",
    "textBeforeTable": "Patent Citations Although embodiments of the self-correcting bandwidth request/grant protocol described above uses a four-one incremental bandwidth request-aggregate bandwidth request pattern (i.e., four incremental bandwidth requests are transmitted, followed by one aggregate bandwidth request), alternative incremental/aggregate bandwidth request patterns can be used without departing from the scope or spirit of the present invention. For example, in one alternative embodiment, three incremental bandwidth requests are transmitted followed by one aggregate bandwidth request. Another alternative uses a 3-to-2 incremental-to-aggregate bandwidth request transmission pattern. Accordingly, it is to be understood that the invention is not to be limited by the specific illustrated embodiment, but only by the scope of the appended claims. A number of embodiments have been described. Nevertheless, it will be understood that various modifications may be made without departing from the spirit and scope of the invention. For example, the method and apparatus can be used in any type of communication system. Its use is not limited to a wireless communication system. One such example is use of the invention in a satellite communication system. In such a communication system, satellites replace the base stations described above. In addition, the CPEs are no longer at fixed distances from the satellites. Therefore, it will be more difficult to schedule DAMA services for the CPEs. Alternatively, the present invention can be used in a wired communication system. The only difference between the wired system and the wireless system",
    "textAfterTable": "US5638374 Mar 15, 1995 Jun 10, 1997 Hughes Electronics Enhanced transaction reservation US5675573 Mar 22, 1995 Oct 7, 1997 Lucent Technologies Inc. Delay-minimizing system with guaranteed bandwidth delivery for real-time traffic US6016311 Nov 19, 1997 Jan 18, 2000 Ensemble Communications, Inc. Adaptive time division duplexing method and apparatus for dynamic bandwidth allocation within a wireless communication system US6094421 Jan 21, 1997 Jul 25, 2000 Omnipoint Corporation Timing adjustment control for efficient time division duplex, frequency division duplex or hybrid time division duplex/frequency division duplex communication US6151312 Feb 12, 1996 Nov 21, 2000 Stanford Telecommunications, Inc. Network protocol for wireless broadband-ISDN using ATM US6222832 Jun 1, 1998 Apr 24, 2001 Tantivy Communications, Inc. Fast Acquisition of traffic channels for a highly variable data rate reverse link of a CDMA wireless communication system US6314110 Mar 6, 1998 Nov 6, 2001 Cisco Technology, Inc. Method and apparatus for distributed bandwidth allocation for a bi-directional ring media with spatial and local reuse",
    "hasKeyColumn": true,
    "keyColumnIndex": 3,
    "headerRowIndex": 0
}