{
    "relation": [
        [
            "Date",
            "Sep 28, 2009",
            "Feb 17, 2010",
            "Feb 17, 2010",
            "Feb 17, 2010",
            "Aug 21, 2013"
        ],
        [
            "Code",
            "REMI",
            "AS",
            "FPAY",
            "SULP",
            "FPAY"
        ],
        [
            "Event",
            "Maintenance fee reminder mailed",
            "Assignment",
            "Fee payment",
            "Surcharge for late payment",
            "Fee payment"
        ],
        [
            "Description",
            "",
            "Owner name: AKADEMA INC.,NEW JERSEY Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNORS:GILLIGAN, LAWRENCE J.;GILLIGAN, JOSEPH, IV;REEL/FRAME:023937/0612 Effective date: 20100115",
            "Year of fee payment: 4",
            "",
            "Year of fee payment: 8"
        ]
    ],
    "pageTitle": "Patent US7002104 - Heated baseball glove/mitt and method of heating a baseball bat handle - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US7002104?dq=6861155",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 8,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989018.48/warc/CC-MAIN-20150728002309-00123-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 474897791,
    "recordOffset": 474878579,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{51964=Unless otherwise expressly indicated, when used throughout this document the term “substantially” shall have the meaning of “approximation”, not “magnitude”; i.e., it shall have the meaning, “being largely but not wholly that which is specified.” See, Webster's Ninth New Collegiate Dictionary, Merriam-Webster Inc., 1989. Hence, applicant is not using the term “substantially” to denote “considerable quantity” or “significantly large,” but is instead using the term as a qualifier/minimizer of a term. For example, in the fictitious phrase “the head portion is substantially above the body portion,” “substantially above” is meant to indicate that while most of the head portion can be located above the body portion, there is certainly at least some of the head portion located in planes with the body portion, or even below parts of the body portion. As a further example, as used in the fictitious phrase “substantially hollow,” “substantially” is meant to indicate that there are areas where the item is not hollow, without regard to a quantity of hollow verses non-hollow areas. These examples are meant to be illustrative of the meaning to be attributed to the term “substantially” as used throughout this document, even if these particular phrases are not found herein.}",
    "textBeforeTable": "Patent Citations It is also to be understood that the following claims are intended to cover all of the generic and specific features of the invention herein described and all statements of the scope of the invention, which, as a matter of language, might be said to fall therebetween. It will thus be seen that the objects set forth above, among those made apparent from the preceding description, are efficiently attained, and since certain changes maybe made in the above constructions without departing from the spirit and scope of the invention, it is intended that all matter contained in the above description and shown in the accompanying drawings shall be interpreted as illustrative and not in a limiting sense. Unless otherwise expressly indicated, when used throughout this document the term “substantially” shall have the meaning of “approximation”, not “magnitude”; i.e., it shall have the meaning, “being largely but not wholly that which is specified.” See, Webster's Ninth New Collegiate Dictionary, Merriam-Webster Inc., 1989. Hence, applicant is not using the term “substantially” to denote “considerable quantity” or “significantly large,” but is instead using the term as a qualifier/minimizer of a term. For example, in the fictitious phrase “the head portion is substantially above the body portion,” “substantially above” is meant to indicate that while most of the head portion can be located above the body portion, there is certainly at least some of the head portion",
    "textAfterTable": "US4513450 * Jan 13, 1984 Apr 30, 1985 Trion Corporation Baseball catching means US4535482 Jan 24, 1983 Aug 20, 1985 George Spector Heated glove US4543671 May 31, 1984 Oct 1, 1985 Monk Peter H Heated mitten US4651350 Sep 19, 1985 Mar 24, 1987 Zwicker Knitting Mills Work glove US4742579 Feb 25, 1987 May 10, 1988 Skiears, Inc. Ski glove US4759084 Apr 18, 1986 Jul 26, 1988 Multi-Tech Corporation Cold-weather hand covering having selectively shaped chemical heating element receiving chamber US4764665 * Mar 9, 1987 Aug 16, 1988 Material Concepts, Inc. Electrically heated gloves US4825039 Sep 15, 1987 Apr 25, 1989 Yoo Jhin P Glove assembly for use at low temperature US4948951 Jan 3, 1989 Aug 14, 1990 Alfiero Balzano Heater employing flexible circuitry",
    "hasKeyColumn": true,
    "keyColumnIndex": 1,
    "headerRowIndex": 0
}