{
    "relation": [
        [
            "Date",
            "Nov 8, 1991",
            "Aug 22, 1995",
            "Oct 26, 1999",
            "Apr 2, 2000",
            "Jun 13, 2000"
        ],
        [
            "Code",
            "AS",
            "FPAY",
            "REMI",
            "LAPS",
            "FP"
        ],
        [
            "Event",
            "Assignment",
            "Fee payment",
            "Maintenance fee reminder mailed",
            "Lapse for failure to pay maintenance fees",
            "Expired due to failure to pay maintenance fee"
        ],
        [
            "Description",
            "Owner name: MEDICAL INNOVATIVE TECHNOLOGIES R&D LIMITED PARTNE Free format text: ASSIGNMENT OF ASSIGNORS INTEREST.;ASSIGNORS:FISCHELL, ROBERT E.;FISCHELL, TIM A.;REEL/FRAME:005900/0920 Effective date: 19911104",
            "Year of fee payment: 4",
            "",
            "",
            "Effective date: 20000331"
        ]
    ],
    "pageTitle": "Patent US5100425 - Expandable transluminal atherectomy catheter system and method for the ... - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US5100425?dq=6985872",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 8,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989018.48/warc/CC-MAIN-20150728002309-00123-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 474836351,
    "recordOffset": 474800735,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{19884=Arterial stenoses are becoming increasingly common as life expectancy increases. There are numerous treatments to open stenotic lesions including surgical interventions such as endarterectomy and by-pass surgery using veins or artificial graft materials. Ballon angioplasty is becoming increasingly popular for the dilation of arterial stenoses. More recently atherectomy, the excision from the body of atheromatous plaque, has been successfully used to open arterial stenoses. U.S. patent application Ser. No. 874140 filed by R. E. Fischell and T. A. Fischell on June 13, 1986 entitled \"A Guide Wire Following Tunneling Catheter System for Transluminal Arterial Atherectomy\" first described a forward motion (anterograde) cutting, single lumen atherectomy catheter that is advanced over a guide wire. A disadvantage of that and other anterograde cutting atherectomy devices is that they can only cut a hole in the stenosis as large as their own fixed diameter. This is a distinct disadvantage in that it is generally preferable to percutaneously enter the femoral artery at the groin with a catheter no larger than 3.0 mm in diameter, and then to excise plaque close to the arterial wall for arteries that are larger in diameter than 3.0 mm. For example it would be desirable to remove plaque to the diameter of the unoccluded arterial lumen for a 4 mm diameter coronary artery, a 5 mm diameter femoral or renal artery and a 5 to 7 mm diameter internal or common carotid artery. Although U.S. Pat. No. 4,765,332, issued Aug. 23, 1988 to R. E. Fischell and T. A. Fischell entitled \"Pullback Atherectomy Catheter System\" describes an effective retrograde atherectomy catheter system, it also does not teach a method for entering the artery with a 3 mm diameter catheter and removing plaque to larger diameters. U.S. patent application Ser. No. 153,912 filed Feb. 9, 1988 by R. E. Fischell and T. A. fischell entitled \"Expandable Pullback Atherectomy Catheter\" did however show a method for excising plaque by a cutting means that could expand at its distal end to a larger diameter than the basic diameter of the catheter body after insertion into the artery. However, the retrograde cutting device must first pass through the stenosis before expanding which could be disadvantage, particularly for treating a severely narrowed artery.}",
    "textBeforeTable": "Patent Citations Various other modifications, adaptations, and alternative designs are of course possible in light of the above teachings. Therefore, it should be understood at this time that within the scope of the appended claims, the invention may be practiced otherwise than as specifically described herein. (5) The occlusive balloon 34 and other novel concepts described herein could also be used with the Expandable Pullback Atherectomy Catheter as described in the previously cited patent application, U.S. Ser. No. 153,912 which is included herein by reference. (4) The spokes 24 could have either a cutting edge or a grinding surface but not necessarily both; (3) A separate guiding catheter could be used instead of using the sheathing catheter 40 for that function; (2) The balloon 34 could instead be an expandable mesh that allows small particulate matter to go through up to the size, for example, of white blood cells; (1) Having two separate lumens in the guide wire cylinder 32; one to fill the balloon 34 and the other to inject fluid into the passageway 28; Although a specific embodiment of the ETAC system 10 is described herein, these teachings suggest other alternative designs as well such as: (7) Doing all of item 6 above with what is essentially a guide wire, eliminates the need for a separate guide wire. (6) Using the same fluid passageway for both occlusive balloon filling and for flushing eliminates the need for",
    "textAfterTable": "US4784636 * Apr 30, 1987 Nov 15, 1988 Schneider-Shiley (U.S.A.) Inc. Balloon atheroectomy catheter US4842579 * Jul 29, 1988 Jun 27, 1989 Surgical Systems & Instruments, Inc. Atherectomy device US4857045 * Oct 23, 1987 Aug 15, 1989 Schneider (Usa) Inc., A Pfizer Company Atherectomy catheter US4895560 * Mar 31, 1988 Jan 23, 1990 Papantonakos Apostolos C Angioplasty apparatus US4917085 * Sep 7, 1989 Apr 17, 1990 Cordis Corporation Drive cutting catheter having new and improved drive motor US4921484 * Jul 25, 1988 May 1, 1990 Cordis Corporation Mesh balloon catheter device US4926858 * Aug 7, 1989 May 22, 1990 Devices For Vascular Intervention, Inc. Atherectomy device for severe occlusions US4966604 * Jan 23, 1989 Oct 30, 1990 Interventional",
    "hasKeyColumn": true,
    "keyColumnIndex": 2,
    "headerRowIndex": 0
}