{
    "relation": [
        [
            "Date",
            "May 17, 2001",
            "Aug 12, 2003",
            "Jun 30, 2006",
            "Sep 27, 2010",
            "Feb 18, 2011",
            "Apr 12, 2011"
        ],
        [
            "Code",
            "AS",
            "CC",
            "FPAY",
            "REMI",
            "LAPS",
            "FP"
        ],
        [
            "Event",
            "Assignment",
            "Certificate of correction",
            "Fee payment",
            "Maintenance fee reminder mailed",
            "Lapse for failure to pay maintenance fees",
            "Expired due to failure to pay maintenance fee"
        ],
        [
            "Description",
            "",
            "",
            "Year of fee payment: 4",
            "",
            "",
            "Effective date: 20110218"
        ]
    ],
    "pageTitle": "Patent US6523151 - Method for verifying the design of a microprocessor - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US6523151?ie=ISO-8859-1&dq=5,778,372",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 10,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989018.48/warc/CC-MAIN-20150728002309-00092-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 483728623,
    "recordOffset": 483692841,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{25472=This application is a continuation-in-part of U.S. patent application Ser. No. 09/578,743 filed May 25, 2000 entitled Coverage-Based Test Generation for Microprocessor Verification., 48310=In addition, the project specification 208 may indicate value ranges and types that a specific integrated circuit treats as a floating point number such that the optimized test specification provided to test generator 206 incorporates this additional information. If, for example, a particular integrated circuit treats numbers that are greater than 1010 as very large numbers, the optimized test specification may indicate that the user wants to verify the functionality of register 0 through 31 with numbers greater than 1010.}",
    "textBeforeTable": "Patent Citations It will be apparent to those skilled in the art having the benefit of this disclosure that the present invention contemplates a pseudo random directed test generation system suitable for analyzing test cases from a coverage perspective after simulation in an effort to improve the efficiency of the test generation and verification process. It is understood that the form of the invention shown and described in the detailed description and the drawings are to be taken merely as presently preferred examples. It is intended that the following claims be interpreted broadly to embrace all the variations of the preferred embodiments disclosed. The verification directives that are generated may then be provided to the appropriate verification processes, resources, tools, and components. The test generation, test simulation, coverage analysis and verification directive generation steps may be repeated until either all of the functional coverage goals are achieved or until no further improvement is detected. Database 529 is generated (populated) from a variety of sources including test generator user guides and technical documents, verification engineers expertise and know-how of a tool or specific test program language, automatic analysis of test cases generated by test generators, and by using knowledge acquisition tools and techniques to extract information from tool vendors, tool support personnel, verification engineers, coverage engineers, and verification support personnel familiar with verification and simulation environment. Test generator and verification environment database 529 includes commands, variables, and their value",
    "textAfterTable": "US7127692 * Jun 27, 2002 Oct 24, 2006 Lsi Logic Corporation Timing abstraction and partitioning strategy US7143073 * Apr 4, 2002 Nov 28, 2006 Broadcom Corporation Method of generating a test suite US7181708 * Aug 10, 2004 Feb 20, 2007 Cadence Design Systems, Inc. Coverage metric and coverage computation for verification based on design partitions US7263478 * Sep 25, 2001 Aug 28, 2007 Kabushiki Kaisha Toshiba System and method for design verification US7305332 Jan 14, 2004 Dec 4, 2007 Adaptec, Inc. System and method for automatic extraction of testing information from a functional specification US7376876 Dec 23, 2004 May 20, 2008 Honeywell International Inc. Test program set generation tool US7434184 Jun 9, 2006 Oct 7, 2008 Zhe Li Method for detecting flaws in a functional verification plan US7454726 * Feb 13, 2006",
    "hasKeyColumn": true,
    "keyColumnIndex": 2,
    "headerRowIndex": 0
}