{
    "relation": [
        [
            "Date",
            "Oct 3, 2001",
            "Sep 14, 2005",
            "Oct 21, 2009",
            "Jul 29, 2013",
            "Oct 31, 2013"
        ],
        [
            "Code",
            "FPAY",
            "FPAY",
            "FPAY",
            "AS",
            "AS"
        ],
        [
            "Event",
            "Fee payment",
            "Fee payment",
            "Fee payment",
            "Assignment",
            "Assignment"
        ],
        [
            "Description",
            "Year of fee payment: 4",
            "Year of fee payment: 8",
            "Year of fee payment: 12",
            "Owner name: TD BANK, N.A., AS ADMINISTRATIVE AGENT, FLORIDA Free format text: SECURITY AGREEMENT;ASSIGNOR:PIONEER SURGICAL TECHNOLOGY, INC.;REEL/FRAME:030892/0193 Effective date: 20130716",
            "Owner name: PIONEER LABORATORIES, INC., MICHIGAN Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNORS:SONGER, MATTHEW N.;KORHONEN, FRANCIS J.;REEL/FRAME:031517/0713 Effective date: 19940223 Owner name: PIONEER SURGICAL TECHNOLOGY, INC., MICHIGAN Free format text: CHANGE OF NAME;ASSIGNOR:PIONEER LABORATORIES, INC.;REEL/FRAME:031517/0725 Effective date: 20061211"
        ]
    ],
    "pageTitle": "Patent US5741260 - Cable system for bone securance - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US5741260?dq=6,910,205",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 9,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989018.48/warc/CC-MAIN-20150728002309-00239-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 476072923,
    "recordOffset": 476053229,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{14176=This is a division of application Ser. No. 08/569,707, filed Dec. 8, 1995, pending which is a division of application Ser. No. 08/201,614, filed Feb. 24, 1994, now U.S. Pat. No 5,536,270.}",
    "textBeforeTable": "Patent Citations The above has been offered for illustrative purposes only, and is not intended to limit the scope of the invention of this application, which is as defined in the claims below. Additionally, a cable in accordance with this invention, being stronger, can have less diameter than the wire of corresponding strength, which decreases the irritation which is common with wires. Likewise, there are no sharp ends in the implanted cable. Even if a break or failure occurs, the soft cable end is much safer than a broken wire end in terms of the risk of puncturing a blood vessel. Also, the cable of this invention is very flexible, which makes its insertion much easier as it is wound around the sternum or other bones. This also facilitates the ease of removal of the cable if that becomes necessary. Likewise, fewer cables may be required for securing the sternum in view of the increased strength of the cables over monofilament wires, to speed up closure of the sternum. Also, the cable system of this invention can be tightened to a known tension through the use of a torque wrench, for example. This tension is thus reproducible, and can be adjusted to any desired clinical situation. Since the sternum can be more rigidly fixed, this contributes to less failure and less postoperative pain. Through the use of the multistrand cable of this invention, such a cable has very",
    "textAfterTable": "US5536270 * Feb 24, 1994 Jul 16, 1996 Pioneer Laboratories, Inc. Cable system for bone securance * Cited by examiner Non-Patent Citations Reference 1 * Brochure Codman Sof wire Cable System 6 pages, Jun., 1992 (Author Unknown). 2 Brochure -Codman -Sof'wire Cable System -6 pages, Jun., 1992 (Author Unknown). 3 * Document by Acumed, Inc., entitled: Osteo Clage, Cerclage Cable System, 4 pages, Jul., 1992 (Author Unknown). 4 Document by Acumed, Inc., entitled: Osteo-Clage, Cerclage Cable System, 4 pages, Jul., 1992 (Author Unknown). 5 * Document by Howmedica (UK) Limited, entitled: The Trochanter Cable Grip System, 6 pages, Jan., 1983 by Desmond M. Dall et al. 6 * Document by Howmedica entitled: Dall Miles Cable Grip System, 2 pages, Jun., 1993, (Author Unknown). 7 Document by Howmedica entitled: Dall-Miles Cable",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}