{
    "relation": [
        [
            "Date",
            "Nov 27, 1998",
            "Nov 9, 2003",
            "Mar 31, 2005",
            "Nov 1, 2007",
            "Jan 9, 2012",
            "May 29, 2012",
            "May 29, 2012"
        ],
        [
            "Code",
            "AS",
            "FPAY",
            "AS",
            "FPAY",
            "REMI",
            "FPAY",
            "SULP"
        ],
        [
            "Event",
            "Assignment",
            "Fee payment",
            "Assignment",
            "Fee payment",
            "Maintenance fee reminder mailed",
            "Fee payment",
            "Surcharge for late payment"
        ],
        [
            "Description",
            "Owner name: ACTIVEPOINT LTD., ISRAEL Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNORS:TAVOR, ONN;AVRAHAM, GILA BEN;SHEVCHENKO, VADIM;REEL/FRAME:009625/0484 Effective date: 19981123",
            "Year of fee payment: 4",
            "",
            "Year of fee payment: 8",
            "",
            "Year of fee payment: 12",
            "Year of fee payment: 11"
        ]
    ],
    "pageTitle": "Patent US6070154 - Internet credit card security - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US6070154?dq=7800613",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 8,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989018.48/warc/CC-MAIN-20150728002309-00142-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 485155367,
    "recordOffset": 485127581,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Patent Citations It will be appreciated that the above descriptions are intended only to serve as examples, and that many other embodiments are possible within the spirit and the scope of the present invention. It should be noted that the method of the present invention is not limited to the implementations described above. For example, the method of the present invention is optionally and preferably implemented with the SSL (secure socket layer) security protocol, in order to provide additional security for the transmission of the credit card number. The method of the present invention is able to increase the security of the encryption protocol of SSL by sending portions of the credit card number in different transmissions. Of course, the method of the present invention could be implemented with other types of security methods or protocols. Thus, the method of the present invention can be a valuable adjunct to increase the security of other methods or protocols for secure transmission of credit card number. After repeating step 5 to perform the operation with all parts of the string in order to form decoded parts of the string, the decoder program concatenates these decoded parts of the string to create the decoded number in step 6. In step 3, the decoder program converts the parts into integers. In step 4, the decoder program converts the associated parts of the key into integers. In step 5, the decoder program uses",
    "textAfterTable": "Referenced by Citing Patent Filing date Publication date Applicant Title US6789189 Feb 1, 2003 Sep 7, 2004 First Data Corporation Managing account database in ABDS system US6820199 Mar 4, 2002 Nov 16, 2004 First Data Corporation Sending electronic transaction message, digital signature derived therefrom, and sender identity information in AADS system US6820202 Nov 9, 1998 Nov 16, 2004 First Data Corporation Account authority digital signature (AADS) system US6851054 Jan 31, 2003 Feb 1, 2005 First Data Corporation Account-Based digital signature (ABDS) system for authenticating entity access to controlled resource US6879965 Jun 14, 2001 Apr 12, 2005 Passgate Corporation Method, system and computer readable medium for web site account and e-commerce management from a central location US6892302 Feb 1, 2003 May 10, 2005 First Data Corporation Incorporating security certificate during manufacture of device generating digital signatures US6915430 Feb 1, 2003 Jul 5, 2005",
    "hasKeyColumn": true,
    "keyColumnIndex": 2,
    "headerRowIndex": 0
}