{
    "relation": [
        [
            "Date",
            "Apr 18, 1994",
            "Jun 10, 1998",
            "Feb 16, 1999",
            "Feb 11, 2003",
            "Jan 25, 2007",
            "Jul 24, 2008"
        ],
        [
            "Code",
            "AS",
            "AS",
            "FPAY",
            "FPAY",
            "FPAY",
            "AS"
        ],
        [
            "Event",
            "Assignment",
            "Assignment",
            "Fee payment",
            "Fee payment",
            "Fee payment",
            "Assignment"
        ],
        [
            "Description",
            "Owner name: FESTO KG, GERMANY Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNOR:HOHNER, HEINZ;REEL/FRAME:007055/0594 Effective date: 19940207",
            "Owner name: FESTO AG & CO, GERMANY Free format text: CHANGE OF NAME;ASSIGNOR:FESTO KG;REEL/FRAME:009245/0463 Effective date: 19970729",
            "Year of fee payment: 4",
            "Year of fee payment: 8",
            "Year of fee payment: 12",
            "Owner name: FESTO AG & CO. KG,GERMANY Free format text: CHANGE OF NAME;ASSIGNOR:FESTO AG & CO;REEL/FRAME:021281/0460 Effective date: 20080508"
        ]
    ],
    "pageTitle": "Patent US5458048 - Electro-pneumatic control device - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US5458048?dq=7181427",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 8,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986357.49/warc/CC-MAIN-20150728002306-00165-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 478597071,
    "recordOffset": 478575636,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Patent Citations It is to be understood that the actuating signals of the control blocks can also be transmitted optically. Notwithstanding of their differences with respect to the control block and the field bus-communication unit, the valve stations 2', 2\" of FIGS. 2 and 3 may correspond in their structure to the valve station 2 of FIG. 1. The number of valve stations being dependent from a master-valve station 41 can vary depending on the demand, whereby a number of one to four pieces has been shown to be optimal. In all cases there is a modular structure of a device consisting of valve stations. With respect to the so-called slaves, these may be other operating stations in addition to the valve stations, for example, devices with decentral inlets and outlets through which electrically actuable operating devices 15 can be actuated, for example, relays. It is to be understood that one can simultaneously provide valve stations with (2') or without (2\") control block for slaves which are dependent from a master-valve station 41. A further variant is the control device 1\" in accordance with FIG. 3. Again a valve station 2' of the type illustrated in FIG. 2 is provided, whose control block 19' is designed as master-control block 40, so that the valve station 2' itself forms a main or master-valve station 41. A field bus 38 is connected to the field bus connecting means 39 of",
    "textAfterTable": "Citing Patent Filing date Publication date Applicant Title US5519636 * Mar 28, 1994 May 21, 1996 Festo Kg Electronic control device for a valve range of modular design US5603350 * Jul 2, 1994 Feb 18, 1997 Festo Kg Valve station US5699830 * Oct 25, 1995 Dec 23, 1997 Smc Corporation Solenoid valve controller US5937898 * Apr 25, 1996 Aug 17, 1999 Eaton Corporation Overmolded frame bus with integral pressure switch US6164335 * Mar 10, 2000 Dec 26, 2000 Smc Corporation Manifold solenoid valve driven by serial signals US6170527 * Mar 13, 2000 Jan 9, 2001 Smc Corporation Manifold solenoid valve driven by serial signals US6173745 * Mar 9, 2000 Jan 16, 2001 Smc Corporation Manifold solenoid valve driven by serial signals",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}