{
    "relation": [
        [
            "Date",
            "Dec 19, 2002",
            "Feb 17, 2004",
            "Jul 13, 2004",
            "Oct 26, 2007",
            "Sep 20, 2011"
        ],
        [
            "Code",
            "AS",
            "AS",
            "CC",
            "FPAY",
            "FPAY"
        ],
        [
            "Event",
            "Assignment",
            "Assignment",
            "Certificate of correction",
            "Fee payment",
            "Fee payment"
        ],
        [
            "Description",
            "",
            "",
            "",
            "Year of fee payment: 4",
            "Year of fee payment: 8"
        ]
    ],
    "pageTitle": "Patent US6736149 - Method and apparatus for supercritical processing of multiple workpieces - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US6736149?dq=6004266",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 9,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988924.75/warc/CC-MAIN-20150728002308-00325-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 492767411,
    "recordOffset": 492728622,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{47433=Alternative supercritical removal processes of the present invention are taught in the following patent applications, all of which are incorporated in their entirety by reference: U.S. patent application (Attorney Docket No. SSI-00103), filed on Oct. 25, 2000; U.S. patent application Ser. No. 09/389,788, filed on Sep. 3, 1999; U.S. patent application Ser. No. 09/085,391, filed on May 27, 1998; and U.S. Provisional Patent Application No. 60/047,739, filed May 27, 1997., 17820=This patent application is a divisional application of the co-pending U.S. pat. application Ser. No. 09/704,642, filed Nov. 1, 2000, and titled “METHOD AND APPARATUS FOR SUPERCRITICAL PROCESSING OF MULTIPLE WORKPIECES,” which claims priority from U.S. Provisional Pat. application Ser. No. 60/163,121, filed Nov. 2, 1999, and titled “A HIGH THROUGHPUT CLUSTER TOOL FOR CLEANING SEMICONDUCTOR DEVICES USING SUPERCRITICAL CO2.” The U.S. Pat. application Ser. No. 09/704,642, filed Nov. 1, 2000, and titled “METHOD AND APPARATUS FOR SUPERCRITICAL PROCESSING OF A WORKPIECE,” is hereby incorporated by reference., 22103=Nishikawa et al. in U.S. Pat. No. 4,944,837, issued on Jul. 31, 1990, recite a prior art method of removing a resist using liquidized or supercritical gas. A substrate with the resist is placed into a pressure vessel, which also contains the liquidized or supercritical gas. After a predetermined time lapse, the liquidized or supercritical gas is rapidly expanded, which removes the resist., 24101=Smith, Jr. et al. in U.S. Pat. No. 5,377,705, issued on Jan. 3, 1995, teach a system for cleaning contaminants from a workpiece. The contaminants include organic, particulate, and ionic contaminants. The system includes a pressurizable cleaning vessel, a liquid CO2 storage container, a pump, a solvent delivery system, a separator, a condenser, and various valves. The pump transfers CO2 gas and solvent to the cleaning vessel and pressurizes the CO2 gas to supercritical CO2. The supercritical CO2 and the solvent remove the contaminants from the workpiece. A valve allows some of the supercritical CO2 and the solvent to bleed from the cleaning vessel while the pump replenishes the supercritical CO2 and the solvent. The separator separates the solvent from the supercritical CO2. The condenser condenses the CO2 to liquid CO2 so that the liquid CO2 storage container can be replenished.}",
    "textBeforeTable": "Patent Citations It will be readily apparent to one skilled in the art that other various modifications may be made to the preferred embodiment without departing from the spirit and scope of the invention as defined by the appended claims. A second alternative supercritical processing module of the present invention places alternative inlets for the circulation line 152 to enter the wafer cavity 112 at a circumference of the wafer cavity 112 and places an alternative outlet at a top center of the wafer cavity 112. The alternative inlets are preferably configured to inject the supercritical carbon dioxide in a plane defined by the wafer cavity 112. Preferably, the alternative inlets are angled with respect to a radius of the wafer cavity 112 so that in operation the alternative inlets and the alternative outlet create a vortex within the wafer cavity 112. A first alternative supercritical processing module of the present invention replaces the pressure chamber 136 and gate valve 106 with an alternative pressure chamber. The alternative pressure chamber comprises a chamber housing and a hydraulicly driven wafer platen. The chamber housing comprises a cylindrical cavity which is open at its bottom. The hydraulicly driven wafer platen is configured to seal against the chamber housing outside of the cylindrical cavity. In operation, the wafer is placed on the hydraulicly driven wafer platen. Then, the hydraulicly driven wafer platen moves upward and seals with the chamber housing. Once",
    "textAfterTable": "Jul 13, 1976 International Business Machines Corporation Method and apparatus for handling workpieces US4029517 Mar 1, 1976 Jun 14, 1977 Autosonics Inc. Vapor degreasing system having a divider wall between upper and lower vapor zone portions US4091643 Feb 17, 1977 May 30, 1978 Ama Universal S.P.A. Circuit for the recovery of solvent vapor evolved in the course of a cleaning cycle in dry-cleaning machines or plants, and for the de-pressurizing of such machines US4219333 Jul 3, 1978 Aug 26, 1980 Harris Robert D Carbonated cleaning solution US4245154 Jun 28, 1978 Jan 13, 1981 Tokyo Ohka Kogyo Kabushiki Kaisha Apparatus for treatment with gas plasma US4341592 Aug 4, 1975 Jul 27, 1982 Texas Instruments Incorporated Method for removing photoresist layer from substrate by ozone treatment US4355937 Dec 24, 1980 Oct 26, 1982 International Business Machines Corporation Low shock transmissive antechamber seal mechanisms for vacuum chamber type semi-conductor wafer electron beam writing apparatus US4367140 Oct 30, 1980 Jan 4,",
    "hasKeyColumn": true,
    "keyColumnIndex": 2,
    "headerRowIndex": 0
}