{
    "relation": [
        [
            "Date",
            "Oct 5, 1998",
            "Mar 20, 2001",
            "Aug 8, 2003",
            "Jun 20, 2007",
            "Sep 23, 2011"
        ],
        [
            "Code",
            "AS",
            "CC",
            "FPAY",
            "FPAY",
            "FPAY"
        ],
        [
            "Event",
            "Assignment",
            "Certificate of correction",
            "Fee payment",
            "Fee payment",
            "Fee payment"
        ],
        [
            "Description",
            "Owner name: AGTRACKS, INC., INDIANA Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNOR:WITT, DOUG;REEL/FRAME:009498/0368 Effective date: 19980922",
            "",
            "Year of fee payment: 4",
            "Year of fee payment: 8",
            "Year of fee payment: 12"
        ]
    ],
    "pageTitle": "Patent US6062662 - Mounting device for track apparatus - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US6062662?dq=7,328,163",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 8,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988924.75/warc/CC-MAIN-20150728002308-00175-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 486761639,
    "recordOffset": 486738606,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Patent Citations Various modes of carrying out the invention are contemplated as being within the scope of the following claims particularly pointing out and distinctly claiming the subject matter as regarded as the invention. It is contemplated as being the scope of the present invention to rotate drive wheel 12 in a second, opposite direction such that trailing idler assembly 360 may function as a leading idler assembly, and such that leading idler assembly 276 may function as a trailing idler assembly as heretofore described. As flexible track 15 approaches trailing idler assembly 360, lugs 341 on the inner surface 343 of flexible track 15 are captured between first and second guide walls 328 and 330, respectively, of trailing guide wheel 320a. The outer edges 336 and 338 of guide walls 328 and 330, respectively, of trailing guide wheel 320a form a mating relationship with junctions 338 and 340, respectively, of each lug 341 extending from the inner surface 343 of flexible track 15 so as to prevent lateral movement of flexible track 15. In addition, the radially outer surfaces 312 of idler wheels 306 of trailing idler assembly 360 engage the inner surface 343 of flexible track 15 and guide flexible track 15 onto drive wheel 12 to form a continuous loop. As flexible track 15 is driven about drive wheel 12, the lugs 341 pass between leading and trailing bogie wheels 388 and 390, respectively, of",
    "textAfterTable": "Track-idler recoil suspension mechanism US4029423 * Nov 24, 1975 Jun 14, 1977 Sager Fred A Free-wheeling spindle adaptor US4097093 * Oct 26, 1976 Jun 27, 1978 Caterpillar Tractor Co. Track guiding means for a track-type vehicle US4339156 * Aug 29, 1980 Jul 13, 1982 Caterpillar Tractor Co. Roller-idler assembly for crawler undercarriage US4373758 * Aug 10, 1981 Feb 15, 1983 Caterpillar Tractor Co. Multiple roller bogey assembly US4406501 * Jan 29, 1982 Sep 27, 1983 Caterpillar Tractor Co. Recoil system with guided slide assembly for track-type vehicles US4834478 * Jun 30, 1988 May 30, 1989 Caterpillar Inc. Track roller frame assembly US4953919 * Feb 15, 1989 Sep 4, 1990 Phoenix Engineering, Inc. Track suspension system US5273126 * Dec",
    "hasKeyColumn": true,
    "keyColumnIndex": 3,
    "headerRowIndex": 0
}