{
    "relation": [
        [
            "Citing Patent",
            "US8234289",
            "US8249244 *",
            "US8370145 *",
            "US8606576 *",
            "US20090150155 *",
            "US20100226482 *"
        ],
        [
            "Filing date",
            "Dec 17, 2007",
            "Mar 9, 2009",
            "Mar 14, 2008",
            "Nov 2, 2012",
            "Mar 14, 2008",
            ""
        ],
        [
            "Publication date",
            "Jul 31, 2012",
            "Aug 21, 2012",
            "Feb 5, 2013",
            "Dec 10, 2013",
            "Jun 11, 2009",
            "Sep 9, 2010"
        ],
        [
            "Applicant",
            "International Business Machines Corporation",
            "Nice Systems Ltd.",
            "Panasonic Corporation",
            "Google Inc.",
            "Panasonic Corporation",
            "Jacob Naparstek"
        ],
        [
            "Title",
            "Restoration of conversation stub for recognized experts",
            "System and method for recording and distributing customer interactions",
            "Device for extracting keywords in a conversation",
            "Communication log with extracted keywords from speech-to-text processing",
            "Keyword extracting device",
            "System and method for recording and distributing customer interactions"
        ]
    ],
    "pageTitle": "Patent US7991128 - Mirroring of conversation stubs - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US7991128?dq=7,003,515",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 6,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986357.49/warc/CC-MAIN-20150728002306-00226-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 480807547,
    "recordOffset": 480781609,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Patent Citations The description of the present invention has been presented for purposes of illustration and description, and is not intended to be exhaustive or limited to the invention in the form disclosed. Many modifications and variations will be apparent to those of ordinary skill in the art. The embodiment was chosen and described in order to best explain the principles of the invention, the practical application, and to enable others of ordinary skill in the art to understand the invention for various embodiments with various modifications as are suited to the particular use contemplated. Input/output or I/O devices (including but not limited to keyboards, displays, pointing devices, etc.) can be coupled to the system either directly or through intervening I/O controllers. A data processing system suitable for storing and/or executing program code will include at least one processor coupled directly or indirectly to memory elements through a system bus. The memory elements can include local memory employed during actual execution of the program code, bulk storage, and cache memories which provide temporary storage of at least some program code in order to reduce the number of times code must be retrieved from bulk storage during execution. The medium can be an electronic, magnetic, optical, electromagnetic, infrared, or semiconductor system (or apparatus or device) or a propagation medium. Examples of a computer-readable medium include a semiconductor or solid state memory, magnetic tape, a removable",
    "textAfterTable": "US20040132432 * Oct 2, 2003 Jul 8, 2004 Timeslice Communications Limited Voice recordal methods and systems US20040203621 * Oct 23, 2002 Oct 14, 2004 International Business Machines Corporation System and method for queuing and bookmarking tekephony conversations US20050108239 Nov 29, 2004 May 19, 2005 Microsoft Corporation Changing user identities without closing applications US20050176410 Apr 13, 2005 Aug 11, 2005 Brooking Michael A. Method and system for providing message services in a communication system US20060036692 Aug 10, 2004 Feb 16, 2006 Microsoft Corporation Method and system of integrating instant messaging with other computer programs US20060045243 Aug 31, 2004 Mar 2, 2006 Visweswararao Durga Flexible caller ID and calling name information presentation US20060056599 * Sep 15, 2004 Mar 16, 2006 International Business Machines Corporation Telephony annotation services US20070133437 * Dec 13, 2005 Jun 14, 2007 Wengrovitz",
    "hasKeyColumn": true,
    "keyColumnIndex": 3,
    "headerRowIndex": 0
}