{
    "relation": [
        [
            "Date",
            "Mar 12, 1996",
            "Mar 13, 2000",
            "Apr 7, 2004",
            "Sep 22, 2004",
            "Nov 16, 2004"
        ],
        [
            "Code",
            "FPAY",
            "FPAY",
            "REMI",
            "LAPS",
            "FP"
        ],
        [
            "Event",
            "Fee payment",
            "Fee payment",
            "Maintenance fee reminder mailed",
            "Lapse for failure to pay maintenance fees",
            "Expired due to failure to pay maintenance fee"
        ],
        [
            "Description",
            "Year of fee payment: 4",
            "Year of fee payment: 8",
            "",
            "",
            "Effective date: 20040922"
        ]
    ],
    "pageTitle": "Patent US5149982 - Foreign particle inspection apparatus - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US5149982?ie=ISO-8859-1",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 8,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989018.48/warc/CC-MAIN-20150728002309-00261-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 484026397,
    "recordOffset": 484010438,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{17918=This is a continuation of application Ser. No. 694,083, filed May 1, 1991, now abandoned.}",
    "textBeforeTable": "Patent Citations In the above-described embodiments, the light receiving devices are disposed in the space above the upper surface of the reticle 8, but the stray light can be effectively prevented by the aforedescribed light intercepting means even if the light receiving devices are disposed in the space below the underside of the reticle 8 (the surface which is adjacent to the stage 9). In the first embodiment, the light intercepting frame 10 is provided as light intercepting means for preventing the stray light, whereas in the present embodiment, light intercepting film 200 endowed with a characteristic capable of sufficiently absorbing the wavelength of the light beam 2 is provided on that end surface of the reticle 8 which is opposed to the light receiving devices. Thereby, the creation of stray light entering the light receiving devices can be prevented as shown in FIG. 4. The light intercepting film 200 may be applied to the end surface of the reticle 8, or may be stuck to or deposited by evaporation on the end surface of the reticle 8. A second embodiment of the present invention will now be described with reference to FIGS. 3 and 4. FIG. 3 schematically shows the construction of a foreign particle inspection apparatus according to the present embodiment, and FIG. 4 is a cross-sectional view of the apparatus of FIG. 3. In these figures, members similar to those in FIG. 1 are given",
    "textAfterTable": "* Cited by examiner Referenced by Citing Patent Filing date Publication date Applicant Title US7075637 Apr 10, 2003 Jul 11, 2006 Kla-Tencor Corporation Optical scanning system for surface inspection US7084967 Sep 22, 2004 Aug 1, 2006 KLA —Tencor Corporation Scanning system for inspecting anomalies on surfaces US7477372 Apr 23, 2007 Jan 13, 2009 Kla-Tencor Technologies Corporation Optical scanning system for surface inspection US7830502 * Aug 13, 2009 Nov 9, 2010 Hitachi High-Technologies Corporation Substrate inspection device and substrate inspection method US20050036137 * Sep 22, 2004 Feb 17, 2005 Mehrdad Nikoonahad Scanning system for inspecting anamolies on surfaces US20050110986 * Dec 21, 2004 May 26, 2005 Mehrdad Nikoonahad Scanning system for inspecting anamolies on surfaces DE19526249A1 * Jul 18, 1995",
    "hasKeyColumn": true,
    "keyColumnIndex": 1,
    "headerRowIndex": 0
}