{
    "relation": [
        [
            "Date",
            "Aug 17, 1994",
            "Apr 30, 1996",
            "Feb 22, 1999",
            "Feb 6, 2003",
            "Mar 14, 2007",
            "Aug 29, 2007",
            "Oct 16, 2007"
        ],
        [
            "Code",
            "AS",
            "CC",
            "FPAY",
            "FPAY",
            "REMI",
            "LAPS",
            "FP"
        ],
        [
            "Event",
            "Assignment",
            "Certificate of correction",
            "Fee payment",
            "Fee payment",
            "Maintenance fee reminder mailed",
            "Lapse for failure to pay maintenance fees",
            "Expired due to failure to pay maintenance fee"
        ],
        [
            "Description",
            "Owner name: MITSUBISHI DENKI KABUSHIKI KAISHA, JAPAN Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNORS:IKEDA, KATSUMI;YAMAMOTO, YUSHIN;REEL/FRAME:007121/0642 Effective date: 19940607",
            "",
            "Year of fee payment: 4",
            "Year of fee payment: 8",
            "",
            "",
            "Effective date: 20070829"
        ]
    ],
    "pageTitle": "Patent US5446647 - Control apparatus for power converter - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US5446647?dq=5708422",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 9,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989018.48/warc/CC-MAIN-20150728002309-00007-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 470726179,
    "recordOffset": 470705741,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{37864=For example, FIG. 9 shows the block connection diagram of a conventional converter control circuit illustrated in High Performance and Long Life Uninterruptable Power Source Using Flywheel Energy Storage Unit, pp. 1049-1055 in a bulletin of IEEE Industry Applications Society Annual Meeting (Oct. 7-12, 1990, Seattle).}",
    "textBeforeTable": "Patent Citations According to the seventh embodiment, by controlling the input current, it is possible to build up the circuit in addition to the effects of the third and sixth embodiments. According to the sixth embodiment, the input current is zeroed before the apparatus is stopped. Thus, even if the apparatus is not separated from the system, the capacitor is not charged from the system. When the apparatus is stopped, the capacitor is not loaded with excess voltage. According to the fifth embodiment, the apparatus is separated from the system before the apparatus is stopped, thereby controlling voltage applied to the capacitor. Thus, the capacitor is prevented from being loaded with excess voltage. According to the fourth embodiment, by zeroing the converter current before the apparatus is stopped, the converter absorbs energy stored in the reactance component of the system and energy stored in the reactor of the filter before the apparatus is stopped. Thus, the capacitor is prevented from being loaded with excess voltage. According to the third embodiment, the converter current is changed by the reactor voltage according to the resonance component. Thus, in addition to the effect of the first embodiment, it is possible to easily build up a control circuit. According to the second embodiment, the converter current instruction is changed according to the resonance component of the capacitor current. Thus, the second embodiment has an effect of reducing operating cost as well as",
    "textAfterTable": "Applicant Title US5615099 * Aug 23, 1995 Mar 25, 1997 Kabushiki Kaisha Toshiba Control system for single-phase PWM converter US5680040 * Feb 7, 1996 Oct 21, 1997 Mitsubishi Denki Kabushiki Kaisha System for detecting incorrect phase rotation US6178101 * Aug 15, 1997 Jan 23, 2001 Unitron, Inc. Power supply regulation US6195274 Dec 18, 1998 Feb 27, 2001 Abb Industry Oy Method for defining instantaneous value of current of pulse-controlled inductive load US6414865 * Oct 1, 2001 Jul 2, 2002 Samsung Electronics Co., Ltd. AC to DC converting apparatus US6979970 * Jun 29, 2004 Dec 27, 2005 Matsushita Electric Industrial Co., Ltd. Sensorless motor driving device and its driving method US7119607 Dec 31, 2002 Oct 10, 2006 Intel Corporation Apparatus and method for resonance reduction US7143381 *",
    "hasKeyColumn": true,
    "keyColumnIndex": 2,
    "headerRowIndex": 0
}