{
    "relation": [
        [
            "Date",
            "Sep 11, 2000",
            "Jun 23, 2006",
            "Jun 28, 2010",
            "Apr 8, 2011",
            "Sep 13, 2011",
            "Oct 26, 2011",
            "Dec 16, 2011",
            "Jun 25, 2014"
        ],
        [
            "Code",
            "AS",
            "FPAY",
            "FPAY",
            "AS",
            "AS",
            "AS",
            "AS",
            "FPAY"
        ],
        [
            "Event",
            "Assignment",
            "Fee payment",
            "Fee payment",
            "Assignment",
            "Assignment",
            "Assignment",
            "Assignment",
            "Fee payment"
        ],
        [
            "Description",
            "",
            "Year of fee payment: 4",
            "Year of fee payment: 8",
            "Owner name: NOKIA CORPORATION, FINLAND Free format text: MERGER;ASSIGNOR:NOKIA MOBILE PHONES LTD.;REEL/FRAME:026101/0560 Effective date: 20080612",
            "Owner name: MICROSOFT CORPORATION, WASHINGTON Free format text: SHORT FORM PATENT SECURITY AGREEMENT;ASSIGNOR:CORE WIRELESS LICENSING S.A.R.L.;REEL/FRAME:026894/0665 Effective date: 20110901 Owner name: NOKIA CORPORATION, FINLAND Free format text: SHORT FORM PATENT SECURITY AGREEMENT;ASSIGNOR:CORE WIRELESS LICENSING S.A.R.L.;REEL/FRAME:026894/0665 Effective date: 20110901",
            "Owner name: NOKIA 2011 PATENT TRUST, DELAWARE Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNOR:NOKIA CORPORATION;REEL/FRAME:027120/0608 Effective date: 20110531 Owner name: 2011 INTELLECTUAL PROPERTY ASSET TRUST, DELAWARE Free format text: CHANGE OF NAME;ASSIGNOR:NOKIA 2011 PATENT TRUST;REEL/FRAME:027121/0353 Effective date: 20110901",
            "Owner name: CORE WIRELESS LICENSING S.A.R.L., LUXEMBOURG Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNOR:2011 INTELLECTUAL PROPERTY ASSET TRUST;REEL/FRAME:027414/0867 Effective date: 20110831",
            "Year of fee payment: 12"
        ]
    ],
    "pageTitle": "Patent US6509888 - Method for pointing out information and a pointing device - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US6509888?dq=5572193",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 9,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989018.48/warc/CC-MAIN-20150728002309-00336-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 476364111,
    "recordOffset": 476335132,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Patent Citations The invention is not limited to the embodiments described above but many modifications are possible without departing from the inventional idea defined by the claims attached hereto. In the pointing device of FIG. 16 it is advantageous to have in connection with the positions O, P, Q, R, S and T of the pointing elements 42; 42 a, 42 b, 42 c a magnetic element 51; 51 a, 51 b, 51 c, 51 d, 51 e, 51 f such as a permanent or electromagnet in the mounting recess 45, installed in the same manner as in the embodiments of FIGS. 12A (or 12B) and 14B. An advantage of the magnetic elements 51; 51 a, 51 b, 51 c. 51 d, 51 e, 51 f is that they keep the pointing elements in the selected positions O, P, Q, R, S and T. The magnetic elements 51 are attached to the mounting recess 45 in the housing 46 or corresponding body. A twelfth pointing device according to the invention is shown in FIG. 16. This pointing device comprises a plurality of pointing elements 42; 42 a, 42 b, 42 c and detectors 43; 43 a, 43 b, 43 c, 43 d, 43 e and 43 f. The pointing elements 42 are fitted to a spindle 44 an the rotation axis N—N in such a manner that the pointing elements on the spindle 44 are separately movable in",
    "textAfterTable": "Patent Abstracts of Japan, Publication No. 57163587. 2 Patent Abstracts of Japan, Publication No. 59088604. Referenced by Citing Patent Filing date Publication date Applicant Title US6731268 * Aug 1, 2002 May 4, 2004 Innalabs, Inc. Computer input device US6788290 * Jul 17, 2002 Sep 7, 2004 Primax Electronics Ltd. Pointing device by sensing geomagnetic field US6985134 May 3, 2004 Jan 10, 2006 Innalabs Technologies, Inc. Computer input device US7061469 May 21, 2003 Jun 13, 2006 Innalabs Technologies, Inc. Method of data input into a computer US7178399 Dec 14, 2004 Feb 20, 2007 Innalabs Technologies, Inc. Housing for magnetofluidic accelerometer US7191652 Jan 12, 2005 Mar 20, 2007 Innalabs Technologies, Inc. Magnetofluidic accelerometer with partial filling of cavity with magnetic fluid",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}