{
    "relation": [
        [
            "Date",
            "Oct 20, 1997",
            "Dec 17, 2002",
            "Jan 17, 2007",
            "May 15, 2007",
            "May 15, 2007",
            "Dec 29, 2010"
        ],
        [
            "Code",
            "AS",
            "FPAY",
            "REMI",
            "FPAY",
            "SULP",
            "FPAY"
        ],
        [
            "Event",
            "Assignment",
            "Fee payment",
            "Maintenance fee reminder mailed",
            "Fee payment",
            "Surcharge for late payment",
            "Fee payment"
        ],
        [
            "Description",
            "Owner name: INTELLIGENT CONTROLS, INC., MAINE Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNORS:LUKAS, PAUL;GAGNON, DANIEL;JOHNSON, DANIEL;AND OTHERS;REEL/FRAME:009003/0312;SIGNING DATES FROM 19970826 TO 19970919",
            "Year of fee payment: 4",
            "",
            "Year of fee payment: 8",
            "Year of fee payment: 7",
            "Year of fee payment: 12"
        ]
    ],
    "pageTitle": "Patent US5918268 - Line leak detection - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US5918268?dq=5726663",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 9,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989018.48/warc/CC-MAIN-20150728002309-00149-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 472130159,
    "recordOffset": 472099637,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{40460=This application is a continuation of application Ser. No. 08/499,179, filed Jul. 7, 1995, now abandoned.}",
    "textBeforeTable": "Patent Citations Other embodiments are within the claims. During normal liquid dispensing, the force from the flow of the liquid through housing 137 pivots deflector plate 160 into a horizontal flow position (FIG. 9b) to allow maximum liquid flow. The presence of notch 142 in the upper half 170 of deflector plate 160 produces a differential pressure between the upper half 170 and lower half 172 of the deflector plate during liquid flow causing the pivoting action. Deflector plate 160 will return to the closed leak-test position (FIG. 9) via torsion spring 166 during the \"off-time\" of the dispensing system. In this position, the flow of the liquid is deflected through notch 162 to thermal element 132. The line-leak testing is performed as described above. Referring to FIGS. 9-9b, in an additional alternative embodiment, a line-leak detector 130 is configured to be installed in pipeline 18. Housing 137 is threaded in regions 134, 135 for installation in pipeline 18. Housing 137 defines a bore 138 for liquid flow. A deflector plate 160 is placed in the center of housing 137 and pivots on a center pin 162. Deflector plate 160 is biased toward a closed testing position (FIGS. 9 and 9a) by a torsion spring 166. A stop 168 is located on the bottom of housing 137 to correctly position deflector plate 160 in its closed position. A thermal element 132 is located within a notch 142 in",
    "textAfterTable": "Mooney J Apparatus for detecting and indicating leaks in a fluid system US3817097 * Jun 5, 1972 Jun 18, 1974 T Heroux Method and apparatus for testing hydraulic pumps US3940020 * Aug 23, 1973 Feb 24, 1976 Gilbert & Baker Manufacturing Company Leak detection system and method US3969923 * Aug 29, 1975 Jul 20, 1976 Valcor Engineering Corporation Leak detector US3978709 * Jul 18, 1974 Sep 7, 1976 Chisso Corporation Detection of leakage from liquid-transporting pipeline US4043355 * Jun 22, 1976 Aug 23, 1977 Air Products And Chemicals, Inc. Combined flow measuring and valve leakage indicator US4051716 * Aug 10, 1976 Oct 4, 1977 Mooney Joseph R Leak detector US4131216 * Apr 28, 1977 Dec 26, 1978 Dresser Industries, Inc. Leak detection system and method for fluid",
    "hasKeyColumn": true,
    "keyColumnIndex": 1,
    "headerRowIndex": 0
}