{
    "relation": [
        [
            "Citing Patent",
            "US6498851 *",
            "US6624773",
            "US6636607 *",
            "US6813643",
            "US6976265 *",
            "US7046805",
            "US7051111",
            "US7093277",
            "US7200859",
            "US7292690",
            "US7310422",
            "US7319753",
            "US7386129",
            "US7463737",
            "US7688803",
            "US8085804",
            "US8117638",
            "US8675675",
            "US20020136406 *",
            "US20040088558 *",
            "US20040129721 *",
            "US20040181666 *",
            "WO2002098133A1 *"
        ],
        [
            "Filing date",
            "25 Nov 1998",
            "4 Oct 2002",
            "13 Aug 1999",
            "5 Jan 2001",
            "8 Oct 1998",
            "8 Jun 2001",
            "25 Apr 2000",
            "30 May 2001",
            "22 Nov 2000",
            "18 Oct 2002",
            "18 Nov 2005",
            "18 Nov 2005",
            "30 May 2001",
            "15 Aug 2001",
            "30 Sep 2002",
            "7 Mar 2007",
            "15 Aug 2006",
            "27 Dec 2011",
            "8 Jun 2001",
            "21 Oct 2003",
            "6 Mar 2002",
            "31 Mar 2004",
            "17 May 2002"
        ],
        [
            "Publication date",
            "24 Dec 2002",
            "23 Sep 2003",
            "21 Oct 2003",
            "2 Nov 2004",
            "13 Dec 2005",
            "16 May 2006",
            "23 May 2006",
            "15 Aug 2006",
            "3 Apr 2007",
            "6 Nov 2007",
            "18 Dec 2007",
            "15 Jan 2008",
            "10 Jun 2008",
            "9 Dec 2008",
            "30 Mar 2010",
            "27 Dec 2011",
            "14 Feb 2012",
            "18 Mar 2014",
            "26 Sep 2002",
            "6 May 2004",
            "8 Jul 2004",
            "16 Sep 2004",
            "5 Dec 2002"
        ],
        [
            "Applicant",
            "Sandisk Corporation",
            "Sandisk Corporation",
            "Ati International Srl",
            "Digeo, Inc.",
            "Ati International Srl",
            "Digeo, Inc.",
            "Digeo, Inc.",
            "Digeo, Inc.",
            "Digeo, Inc.",
            "Sony Corporation",
            "Sony Corporation",
            "Sony Corporation",
            "Digeo, Inc.",
            "Digeo, Inc.",
            "Young Steven J",
            "Arris Group, Inc.",
            "Arris Group, Inc.",
            "Arris Enterprises, Inc.",
            "Jeremy Fitzhardinge",
            "Candelore Brant L.",
            "Alessandro Bianchini",
            "Candelore Brant L.",
            "Moxi Digital Inc"
        ],
        [
            "Title",
            "Data encryption and signal scrambling using programmable data conversion arrays",
            "Data encryption and signal scrambling using programmable data conversion arrays",
            "Method and apparatus for controlling display of content signals",
            "Multimedia system with selectable protocol module including MPEG logic and docsis logic sharing a single tuner",
            "Method and apparatus for controlling display of content signals",
            "System and method for efficiently storing and processing multimedia content",
            "Multiple source proxy management system",
            "System and method for improved multi-stream multimedia transmission and processing",
            "Apparatus and method for intelligent multimedia compression and distribution",
            "Video scene change detection",
            "Partial encryption and PID mapping",
            "Partial encryption and PID mapping",
            "System and method for multimedia content simulcast",
            "System and method for conditional access key encryption",
            "System and method for coordinating between multiple telephony channels",
            "System and method for processing multiple broadcast multimedia streams",
            "System and method for improved multi-stream multimedia transmission and processing",
            "System and method for processing multiple broadcast multimedia streams",
            "System and method for efficiently storing and processing multimedia content",
            "Descrambler",
            "Apparatus and method for working plastic material and container for fluid product",
            "IP delivery of secure digital content",
            "A system and method for multimedia content simulcast"
        ]
    ],
    "pageTitle": "Patent US6072872 - Determination of scrambling mode of a television signal - Google Patents",
    "title": "",
    "url": "http://www.google.com.au/patents/US6072872?ie=ISO-8859-1",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 7,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988924.75/warc/CC-MAIN-20150728002308-00312-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 478370427,
    "recordOffset": 478345599,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{72614=The scrambling mode data may be provided in the vertical blanking interval (VBI) or on an audio subcarrier of the television signal using known techniques. Various standards exist for inserting data into the VBI of a television signal. One possible standard is the Electronic Industries Association (EIA) Standard \"Recommended Practice for Line 21 Data Service,\" ANSI/EIA-608-1994, September 1994, Arlington, Va.; and \"SP-3688-1 Changes to EIA-608,\" Apr. 19, 1996. The EIA standard defines Extended Data Service packets which carry digital data for closed captioning and other data, such as a Vertical Interval Test Signal (VITS), auxiliary real time video, and Automated Measurement of Line-up (AMOL) data. Other standards may be used.}",
    "textBeforeTable": "Patent Citations Although the invention has been described in connection with various specific embodiments, those skilled in the art will appreciate that numerous adaptations and modifications may be made thereto without departing from the spirit and scope of the invention as set forth in the claims. The system is compatible with dynamic scrambling mode changes. The television signal is stored and delayed by an amount of time which is necessary to accurately determine the scrambling mode so that the second scrambling mode data stream can be updated, thereby allowing the corresponding decoder population to descramble the scrambled signal. The delay may be a fraction of a second, for example, using available circuitry. The scrambled signal is digitized, stored in memory, and reconstructed after the necessary time period has elapsed. Accordingly, it can be seen that the present invention provides a method and apparatus for determining the scrambling mode of a data signal such as a television signal in a cable television network, and providing corresponding scrambling mode data in a specific decoder-compatible format. For existing systems which employ analog scrambling with first scrambling-specific data for a first decoder population, a second data stream of scrambling mode data is inserted into the scrambled signal to provide compatibility with a corresponding second decoder population. There is no need to recover and decode the original scrambling mode data to determine the descrambling mode to be applied by the decoders in the",
    "textAfterTable": "US7463737 15 Aug 2001 9 Dec 2008 Digeo, Inc. System and method for conditional access key encryption US7688803 30 Sep 2002 30 Mar 2010 Young Steven J System and method for coordinating between multiple telephony channels US8085804 7 Mar 2007 27 Dec 2011 Arris Group, Inc. System and method for processing multiple broadcast multimedia streams US8117638 15 Aug 2006 14 Feb 2012 Arris Group, Inc. System and method for improved multi-stream multimedia transmission and processing US8675675 27 Dec 2011 18 Mar 2014 Arris Enterprises, Inc. System and method for processing multiple broadcast multimedia streams US20020136406 * 8 Jun 2001 26 Sep 2002 Jeremy Fitzhardinge System and method for efficiently storing and processing multimedia content US20040088558 * 21 Oct 2003 6 May 2004 Candelore Brant L. Descrambler US20040129721 * 6 Mar 2002 8 Jul 2004 Alessandro Bianchini",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}