{
    "relation": [
        [
            "Citing Patent",
            "US7519615 *",
            "US7546299 *",
            "US7693863 *",
            "US7813484 *",
            "US7930211 *",
            "US7996270",
            "US8015064",
            "US8027877",
            "US8239886 *",
            "US8243890",
            "US8392594",
            "US8613009",
            "US8645941",
            "US8682289",
            "US8706560",
            "US8788319 *",
            "US8818330",
            "US9053458",
            "US20020143591 *",
            "US20060075430 *",
            "US20090193457 *",
            "US20120222097 *",
            "US20130094403 *",
            "US20140337466 *",
            "US20140379481 *",
            "WO2007038761A2 *",
            "WO2008094498A1 *"
        ],
        [
            "Filing date",
            "Aug 7, 2002",
            "May 12, 2004",
            "Sep 14, 2005",
            "Mar 5, 2003",
            "Apr 20, 2005",
            "Mar 30, 2006",
            "Apr 20, 2005",
            "Sep 7, 2006",
            "Jul 13, 2006",
            "Aug 16, 2010",
            "Jan 30, 2007",
            "Jul 9, 2012",
            "Mar 6, 2006",
            "Feb 14, 2012",
            "Jul 27, 2011",
            "Dec 30, 2005",
            "Sep 5, 2013",
            "Aug 7, 2012",
            "Mar 30, 2001",
            "Sep 20, 2005",
            "Jan 30, 2009",
            "",
            "Oct 17, 2012",
            "Dec 28, 2011",
            "Jun 19, 2013",
            "Sep 28, 2006",
            "Jan 28, 2008"
        ],
        [
            "Publication date",
            "Apr 14, 2009",
            "Jun 9, 2009",
            "Apr 6, 2010",
            "Oct 12, 2010",
            "Apr 19, 2011",
            "Aug 9, 2011",
            "Sep 6, 2011",
            "Sep 27, 2011",
            "Aug 7, 2012",
            "Aug 14, 2012",
            "Mar 5, 2013",
            "Dec 17, 2013",
            "Feb 4, 2014",
            "Mar 25, 2014",
            "Apr 22, 2014",
            "Jul 22, 2014",
            "Aug 26, 2014",
            "Jun 9, 2015",
            "Oct 3, 2002",
            "Apr 6, 2006",
            "Jul 30, 2009",
            "Aug 30, 2012",
            "Apr 18, 2013",
            "Nov 13, 2014",
            "Dec 25, 2014",
            "Apr 5, 2007",
            "Aug 7, 2008"
        ],
        [
            "Applicant",
            "Intel Corporation",
            "Alcatel-Lucent Usa Inc.",
            "Claria Corporation",
            "Telecommunication Systems, Inc.",
            "At&T Intellectual Property I, L.P.",
            "Ebay Inc.",
            "At&T Intellectual Property I, Lp",
            "At&T Intellectual Property I, L.P.",
            "At&T Intellectual Property I, L.P.",
            "Telecommunication Systems, Inc.",
            "Sony Corporation",
            "At&T Intellectual Property I, Lp",
            "Carhamm Ltd., Llc",
            "Telecommunication Systems, Inc.",
            "Ebay Inc.",
            "Microsoft Corporation",
            "Telecommunication Systems, Inc.",
            "Hewlett-Packard Development Company, L.P.",
            "Connelly Jay H.",
            "Lg Electronics Inc.",
            "Eric Conn",
            "Wilson Jobin",
            "Electronics And Telecommunications Research Institute",
            "Intel Corporation",
            "Adobe Systems Incorporated",
            "Jasminer Singh Banga",
            "Sony Corp"
        ],
        [
            "Title",
            "Characterization of content based on the associated serialized data",
            "Network supported network file sharing among mobile subscribers",
            "Method and device for publishing cross-network user behavioral data",
            "All-HTTP multimedia messaging",
            "System and method of providing advertisements to portable communication devices",
            "Community based network shopping",
            "System and method of providing advertisements to cellular devices",
            "System and method of providing advertisements to mobile devices",
            "System and method for a video content service monitoring and provisioning architecture",
            "All-HTTP multimedia messaging",
            "System and method for effectively providing content to client devices in an electronic network",
            "System and method for a video content service monitoring and provisioning architecture",
            "Method for attributing and allocating revenue related to embedded software",
            "Prepaid short message services revenue capture",
            "Community based network shopping",
            "Social context monitor",
            "Prepaid short message services revenue capture",
            "System and method for profiling clients within a system for harvesting community knowledge",
            "Method and apparatus for a hybrid content on demand broadcast system",
            "System and method for providing advertisement music",
            "Systems and methods for providing run-time enhancement of internet video files",
            "System and method for user classification and statistics in telecommunication network",
            "Method and apparatus for providing sensor network information",
            "Persona manager for network communications",
            "Method and apparatus for targeting messages in desktop and mobile applications",
            "Systems and methods of network operation and information processing, including data acquisition, processing and provision and/or interoperability features",
            "System and method for effectively providing content to client devices in an electronic network"
        ]
    ],
    "pageTitle": "Patent US20040002896 - Collection of behavior data on a broadcast data network - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US20040002896?dq=6462713",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 6,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990112.50/warc/CC-MAIN-20150728002310-00299-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 470507303,
    "recordOffset": 470483412,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{75804=[0027] Content data that cache manager 221 receives via delivery network 101 using a protocol such as UHTTP or DVB data/object carousels may not be available via interaction network 102. Content data that is not available via interaction network 102 typically is not associated with an HTTP or FTP URL. Instead, cache manager 221 uniquely identifies a resource by employing a broadcast URL scheme such as the local identifier URL scheme (LID) (see Advanced Television Enhancement Forum (ATVEF) Enhanced Content Specification, 2000, http://www.atvef.com/library/ATVEF%20spec1—1a_Final.pdf) or DVB (see Digital Video Broadcasting Multimedia Home Platform, version 1.0.2, DVB BlueBook A057 Rev. 2, Feb. 26, 2002, http://www.mhp.org/technical_essen/pdf_and_other_files/a057r2.pdf). However, standard client software web browsers such as Netscape and Internet Explorer do not support these URL types. The system described herein includes the translation of the broadcast URL for a received resource into a unique HTTP URL on client computer 110.}",
    "textBeforeTable": "Patent Citations [0050] Although the embodiments disclosed herein describe a filly functioning system, method, and computer program product for collecting usage data to assist an advertiser with a targeted marketing activity, the reader should understand that other equivalent embodiments exist. Since numerous modifications and variations will occur to those who review this disclosure, the system, method, and computer program product for collecting usage data to assist an advertiser with a targeted marketing activity is not limited to the exact construction and operation illustrated and disclosed herein. Accordingly, this disclosure intends all suitable modifications and equivalents to fall within the scope of the claims. [0049] Scheduling 267 periodically retrieves usage data from usage database 272 to help determine the schedule stored in broadcast schedule 275. [0048] Reporting 266 also sends similar reports upon request to advertiser 105 via Internet 104. If advertiser 105 and an operator of UBA server 260 cooperate, advertiser 105 may add a content category type to an advertisement. However, UBA server 260 will classify any advertisement not classified by advertiser 105. Advertiser 105 sends the resources to UBA server 260 via a secure connection and, alternatively, may have a contract with UBA server 260 to upload advertisements to the server. Advertiser 105 may request information related to the user group profiles however, the statistical information provided in response must not compromise the privacy of user 100. Advertiser",
    "textAfterTable": "US20060075430 * Sep 20, 2005 Apr 6, 2006 Lg Electronics Inc. System and method for providing advertisement music US20090193457 * Jan 30, 2009 Jul 30, 2009 Eric Conn Systems and methods for providing run-time enhancement of internet video files US20120222097 * Aug 30, 2012 Wilson Jobin System and method for user classification and statistics in telecommunication network US20130094403 * Oct 17, 2012 Apr 18, 2013 Electronics And Telecommunications Research Institute Method and apparatus for providing sensor network information US20140337466 * Dec 28, 2011 Nov 13, 2014 Intel Corporation Persona manager for network communications US20140379481 * Jun 19, 2013 Dec 25, 2014 Adobe Systems Incorporated Method and apparatus for targeting messages in desktop and mobile applications WO2007038761A2 * Sep 28, 2006 Apr 5, 2007 Jasminer Singh Banga Systems and methods of network",
    "hasKeyColumn": true,
    "keyColumnIndex": 3,
    "headerRowIndex": 0
}