{
    "relation": [
        [
            "Date",
            "Jun 14, 2002",
            "Feb 25, 2009",
            "Jun 7, 2010",
            "Jul 20, 2011",
            "Apr 16, 2013",
            "May 28, 2013",
            "Jun 26, 2014"
        ],
        [
            "Code",
            "AS",
            "AS",
            "FPAY",
            "AS",
            "AS",
            "AS",
            "FPAY"
        ],
        [
            "Event",
            "Assignment",
            "Assignment",
            "Fee payment",
            "Assignment",
            "Assignment",
            "Assignment",
            "Fee payment"
        ],
        [
            "Description",
            "Owner name: DIGEO, INC., WASHINGTON Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNORS:BILLMAIER, JAMES A.;KELLUM, JOHN M.;REID, DEWEY;AND OTHERS;REEL/FRAME:013010/0478;SIGNING DATES FROM 20020603 TO 20020604",
            "Owner name: VULCAN VENTURES, INC.,WASHINGTON Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNOR:DIGEO, INC.;REEL/FRAME:022309/0016 Effective date: 20090220",
            "Year of fee payment: 4",
            "Owner name: ARRIS GROUP, INC., GEORGIA Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNOR:DIGEO, INC AND VULCAN VENTURES, INC.;REEL/FRAME:026621/0258 Effective date: 20090922",
            "Owner name: ARRIS ENTERPRISES, INC., GEORGIA Free format text: MERGER;ASSIGNOR:ARRIS GROUP, INC.;REEL/FRAME:030228/0330 Effective date: 20130416",
            "Owner name: BANK OF AMERICA, N.A., AS ADMINISTRATIVE AGENT, IL Free format text: SECURITY AGREEMENT;ASSIGNORS:ARRIS GROUP, INC.;ARRIS ENTERPRISES, INC.;ARRIS SOLUTIONS, INC.;AND OTHERS;REEL/FRAME:030498/0023 Effective date: 20130417",
            "Year of fee payment: 8"
        ]
    ],
    "pageTitle": "Patent US7155675 - System and method for focused navigation within a user interface - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US7155675?dq=6335678",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 9,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987127.36/warc/CC-MAIN-20150728002307-00064-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 475012047,
    "recordOffset": 474986059,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{46636=The present application is related to and claims priority from U.S. Provisional Application No. 60/315,731, filed Aug. 29, 2001, entitled “System and Method for Visual Channel Surfing”, which is hereby incorporated by reference in its entirety. The present application is also related to and claims priority from U.S. Provisional Application No. 60/317,612, filed Sep. 6, 2001, entitled “System and Method for Visual Channel Surfing”, which is hereby incorporated by reference in its entirety. The present application is further related to and claims priority from U.S. Provisional Application No. 60/324,997, filed Sep. 26, 2001, entitled “System and Method for Visual Channel Surfing Using Center-Focused Navigation”, which is hereby incorporated by reference in its entirety., 75059=The STB 16 also include a codec (encoder/decoder) 146, which serves to decode a data stream received from the broadcast center over the transmission medium. The codec 146 may be implemented in hardware and/or software.}",
    "textBeforeTable": "Patent Citations While specific embodiments and applications of the present invention have been illustrated and described, it is to be understood that the invention is not limited to the precise configuration and components disclosed herein. Various modifications, changes, and variations apparent to those skilled in the art may be made in the arrangement, operation, and details of the methods and systems of the present invention disclosed herein without departing from the spirit and scope of the invention. Likewise, because the graphical representations are all displayed within a single area of the user interface (the focus area), the user need not scan through an arrangement of icons on a desktop, as is typically the case in many conventional PC interfaces. The graphical representations may be displayed at a relatively high rate of speed, while still being within the user's image recognition threshold. Typically, the focused navigation technique of the claimed invention allows a user to more quickly and efficiently locate and select a desired option than conventional approaches. Because navigation is initiated by a single user action, the user need not repeatedly press a button to display each option, as is often the case with conventional television or ITV interfaces. This greatly increases navigation speed, reduces wear on the remote control, and reduces the likelihood of repetitive stress injury of the user's hand. In view of the foregoing, the present invention offers a number of",
    "textAfterTable": "US6028600 Jun 2, 1997 Feb 22, 2000 Sony Corporation Rotary menu wheel interface US6151059 * Aug 5, 1997 Nov 21, 2000 Starsight Telecast, Inc. Electronic program guide with interactive areas US6163345 Jan 4, 1995 Dec 19, 2000 Sony Corportion Method and apparatus for providing station and programming information in a multiple station broadcast system US6188406 Aug 12, 1998 Feb 13, 2001 Sony Corporation Single-item text window for scrolling lists US6266059 Aug 27, 1997 Jul 24, 2001 Microsoft Corporation User interface for switching between application modes US6266098 Oct 22, 1997 Jul 24, 2001 Matsushita Electric Corporation Of America Function presentation and selection using a rotatable function menu US6281940 * Mar 31, 1999 Aug 28, 2001 Sony Corporation Display of previewed channels with rotation of multiple previewed channels along an arc US6313851 Aug 27, 1997 Nov 6, 2001 Microsoft Corporation User friendly",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}