{
    "relation": [
        [
            "Cited Patent",
            "US3554902 *",
            "US3660309 *",
            "US3702293 *",
            "US3718578 *",
            "US3790473 *"
        ],
        [
            "Filing date",
            "Aug 16, 1968",
            "May 4, 1970",
            "Dec 30, 1971",
            "Feb 20, 1970",
            "Nov 6, 1972"
        ],
        [
            "Publication date",
            "Jan 12, 1971",
            "May 2, 1972",
            "Nov 7, 1972",
            "Feb 27, 1973",
            "Feb 5, 1974"
        ],
        [
            "Applicant",
            "Chevron Res",
            "Universal Oil Prod Co",
            "Universal Oil Prod Co",
            "Chevron Res",
            "Universal Oil Prod Co"
        ],
        [
            "Title",
            "Platinum iridium",
            "Catalytic composite of a platinum group component and a group iv-a metallic component with a carrier material containing alumina and crystalline aluminosilicate and uses thereof",
            "Hydrocarbon conversion process with a bimetallic catalyst",
            "Reforming with a platinum-tin-iridium catalyst",
            "Tetrametallic hydrocarbon conversion catalyst and uses thereof"
        ]
    ],
    "pageTitle": "Patent US3878125 - Multimetallic catalyst composite - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US3878125?ie=ISO-8859-1",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 5,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990112.50/warc/CC-MAIN-20150728002310-00037-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 467943035,
    "recordOffset": 467915716,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{12631=22 Filed: Nov. 29, 1973 211 Appl. No.: 420,336, 12833=[56] References Cited UNITED STATES PATENTS 1/1971 Buss 252/466 PT 5/1972 Hayes et al 252/455 Z 3,702,293 1 1/1972 Hayes et al 252/455 Z 3,718,578 2/1973 Buss et al........ 252/466 PT 3,790,473 2/1974 Rausch 252/466 PT Primary ExaminerC. Dees Attorney, Agent, or Firm-James R. Hoatson, Jr.; Thomas K. McBride; William H. Page, II, 46695=Regarding the preferred amounts of the metallic components of the instant catalyst, we have ascertained that it is a good practice to specify the amount of the Group IVA metallic component and of the iridium component as a function of the amount of the platinum or palladium component. The amount of iridium component is ordinarily selected so that the atomic ratio of iridium to platinum or palladium metal is about O.l:l to 2:1. Broadly, the amount of Group lVA metallic component should be sufficient to result in an atomic ratio of Group IVA metal to platinum or palladium metal falling within the range of about 0.05:1 to about 10:1. More specifically, it is a preferred practice to select this ratio from the following ranges for the individual Group lVA species: (1) germanium, about 0.3:1 to 10:1, with best results at about 0.6:1 to 6:1; (2) tin, about 0.1:] to 3:1, with best results at about 0.511 to 15:1; and, (3) lead, about 0.05:1 to 0.9:] with best results at about O.l:l to 0.75:1., 27774=A particularly preferred crystalline zeolitic aluminosilicate is acid-extracted mordenite having an SiO /Al- O ratio substantially above 10:1. One method of forming this material involves subjecting the ordinary form of mordenite having a SiO- ,/Al O ratio of about 9:1 to 10:1 to the action ofa strong acid such as hydrochloric acid, sulfuric acid, hydrofluoric acid, etc., at, 22291=A fourth embodiment includes the catalyst composite described in the first embodiment wherein the zeolitic crystalline aluminosilicate is acid-extracted mordenite having a SiO /A1 O ratio substantially greater than 10:1., 44332=Regardless of which Group lVA compound is used in the preferred impregnation step, it is important that the Group IVA metallic component be uniformly distributed throughout the carrier material. In order to achieve this objective it is necessary to maintain the pH of the impregnation solution in a range material about 1 to about 7 and to dilute the impregnation solution to a volume which is substantially in excess of the volume of the carrier mmaterial which is impregnated. It is preferred to use a volume ratio of impregnation solution to carrier material of at least 1.5:1 and preferably about 2:1 to about 10:1 or more. Similarly, it is preferred to use a relatively long contact time during the impregnation step ranging from about one-fourth hour up to about one-half hour or more before drying to remove excess solvent in order to insure a high dispersion of the Group lVA metallic component on the carrier material. The carrier material is, likewise, preferably constantly agitated during this preferred impregnation step., 55860=hydrogen to hydrocarbon mole ration of about 0.5:l toabout 20:], and an LHSV (calculated on the basis of equivalent liquid volume of the charge stock contacted with the catalyst per hour divided by the volume of conversion zone containing catalyst) of about 0.2 hr. to 10 hr.'. Reforming conditions are: a pressure of 0 to 1,000 psig. and preferably about 50 to 500 psig.; a temperature of about 800 to l,l00 F., a hydrogen to hydrocarbon mole ratio of about l:l to 20:1 and preferably about 5:l to 10:1, and a LHSV of about 0.1 to 10 hr.\"'. Likewise, hydrocracking conditions include: a pressure of about 500 psig. to about 3,000 psig.; a temperature of about 400 F. to about 900 F.; a LHSV of about 0.] hr. to about 10 hrf; and hydrogen circulation rates of about 1,000 to [0,000 SCF per barrel of charge., 27345=The preferred zeolitic crystalline aluminosilicates for use in the present invention are the hydrogen and/or polyvalent forms of synthetically prepared faujasite and mordenite. In fact, we have found best results with sythetic mordenite having an effective diameter of about 6 Angstroms units and a mole ratio of silica to alumina of about 9:1 to 10:1, and more particularly, the hydrogen form of mordenite., 56693=Conditions utilized in the embodiment of the present invention when substantial quantities of LPG and a high octane reformate are to be produced include: a pressure of about 400 to about 800 psig.. a temperature of about 800 to about 1.050 F.. a LHSV of about 0.5 to hr. and a hydrogen to hydrocarbon mole ratio of about 1:1 to :1., 28173=conditions effecting the removal or extraction of at least a portion of the aluminum from the mordenite. Typically, this procedure can be used to obtain mordenite having a SiO /Al O ratio of about 1 1:1 to about :1 or more., 14042=15 Claims, No Drawings 1 MULTIMETALLIC CATALYST COMPOSITE CROSS-REFERENCES TO RELATED APPLICATIONS This application is a division of our prior. copending application Ser. No. 287,322 filed Sept. 8, 1972 and now US. Pat. No. 3,821,105 which in turn is a continuation-in-part of our prior application Ser. No. 214,396 filed Dec. 30, 1971 and now US. Pat. No. 3,702,293, which in turn is a division of our prior application Ser. No. 34,539 filed May 4, 1970 and now US. Pat. No. 3,660,309 all of the teachings of these prior application being specifically incorporated herein by reference., 47715=Regardless of the details of how the components of the catalyst are combined with the carrier material, the final catalyst generally will be dried at a temperature of from about 200 F. to about 600 F. for a period of from about 2 to 24 hours or more and finally oxidized at a temperature of about 700 F. to about l,l00 F. for a period of about 0.5 to 10 hours. and preferably about 1 to about 5 hours. This oxidation step is preferably performed in the presence of air having a minor amount of chloride and water present therein typically, a mole ratio of H 0 to HCl of about 20:1 to about 100:1., 24725=It is an essential feature of the present invention that the carrier material contains a finely divided zeolitic crystalline aluminosilicate. As is well known to those skilled in the art, crystalline aluminosilicates (also known as zeolites\" and molecular sieves) are composed of a three-dimensional interconnecting network structure of silica and alumina tetrahedra. The tetrahedra are formed by four oxygen atoms surrounding a silicon or aluminum atom, and the basic linkage between the tetrahedra are through the oxygen atoms. These tetrahedra are arranged in an ordered structure to form interconnecting cavities or channels of uniform size inter-connected by uniform openings or pores. The ionexchange property of these materials follows from the trivalent nature of aluminum which causes the alumina tetrahedra to be negatively charged and allows the association with them of cations in order to maintain electrical balance in the structure. The molecular sieve property of these materials flows from the uniform size of the pores thereof which can be correlated to the size of the molecules that are present in a mixture of molecules and used to separate molecules having a critical diameter less than or equal to the pore mouths of these crystalline aluminosilicates. For the purposes of the present invention, it is preferred to use crystalline aluminosilicates having pore mouths of at least 5 Angstroms in cross-sectional diameter, and more preferably about 5 to about 15 Angstrom units. Ordinarily, the aluminosilicates are synthetically prepared in the alkali metal from with one alkali metal cation associated with each aluminum centered tetrahedra. This alkali metal cation may be thereafter ion-exchanged with polyvalent cations such as calcium, magnesium-beryllium, rare earth cations, etc. Another treatment of these a]- kali metal aluminosilicates involves ion-exchange with ammonium ions followed by thermal treatment, preferably about 300 F. to convert to the hydrogen form. When the crystalline aluminosilicates contain a high mole ratio of silica to alumina (for example, above 5:1 the material may be directly converted to an acid form in a suitable acid medium., 49269=Although it is not essential, the resulting reduced catalytic composite may, in many cases, be beneficially subjected to a presulfiding operation designed to incorporate in the catalytic composite from about 0.05 to about 0.5 wt. 7! sulfur calculated on an elemental basis. Preferably, this presulfiding treatment takes place in the presence of hydrogen and a suitable sulfurcontaining compound such as hydrogen sulfide, lower molecular weight mercaptans. organic sulfides, etc. Typically, this procedure comprises treating the reduced catalyst with a sulfiding gas such as amixture of hydrogen and hydrogen sulfide in a mole ratio of about 1011 moles of H per mole of H 8, at conditions sufficient to effect the desired incorporation of sulfur, generally including a temperature ranging from about 50 F. up to about 1 100 F. or more. It is generally a good practice to perform this optional presulfiding step under substantially water-free conditions., 12497=[ Apr. 15, 1975 MULTIMETALLIC CATALYST COMPOSITE [73] Assignee: Universal Oil Products Company, Des Plaines, ll].}",
    "textBeforeTable": "Patent Citations 15. A catalytic composite as defined in claim 1 wherein the alumina carrier material is prepared by uniformly distributing finely divided zeolitic crystalline aluminosilicate throughout an aluminum hydroxyl chloride sol. gelling the resulting mixture to produce a hydrogel and calcining the resulting hydrogel. 14. A catalytic composite comprising a combination of the catalytic composite defined in claim 1 with a sulfur component in an amount sufficient to incorporate about 0.05 to about 0.5 wt. 7: sulfur, calculated on an elemental basis. 13. A catalytic composite as defined in claim I wherein the alumina is gamma-alumina. 12. A catalytic composite as defined in claim 10 wherein the mordenite is acid-extracted mordenite having a SiO /AI O ratio substantially above 10: l. 11. A catalytic comopsite as defined in claim 10 wherein the mordenite is in the hydrogen form. 10. A catalytic composite as defined in claim 1 wherein the zeolitie crystalline aluminosilicate is mordenite. 9. A catalytic composite as defined in claim 1 wherein the composite contains, on an elemental basis, about 0.01 to about 2 wt. 71 platinum or palladium. about 0.01 to about 5 wt. 7: of Group IVA metal and about 0.01 to about 2 wt. 7: iridium. 8. A catalytic composite as defined in claim 7 wherein the halogen component is chlorine or a compound of chlorine.",
    "textAfterTable": "* Cited by examiner Referenced by Citing Patent Filing date Publication date Applicant Title US4882040 * Jun 24, 1988 Nov 21, 1989 Mobil Oil Corporation Reforming process US4931416 * Apr 28, 1989 Jun 5, 1990 Mobil Oil Corporation Thallium or lead-containing microporous crystalline materials and their use as dehydrogenation dehydrocyclization and reforming catalysts US4935566 * Jan 11, 1989 Jun 19, 1990 Mobil Oil Corporation Dehydrocyclization and reforming process US5518976 * Jul 11, 1994 May 21, 1996 N. E. Chemcat Corporation Catalyst for purifying exhaust gas and method for purifying exhaust gas * Cited by examiner Classifications U.S. Classification 502/73 International Classification B01J29/00, C10G35/095, B01J29/22,",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}