{
    "relation": [
        [
            "Citing Patent",
            "US6213119 *",
            "US6240920 *",
            "US6439229 *",
            "US6463930",
            "US6561187 *",
            "US6564798 *",
            "US6584973",
            "US6668829 *",
            "US6920875 *",
            "US6920878",
            "US7011091 *",
            "US7017574",
            "US7021310 *",
            "US7156095 *",
            "US7331343",
            "US7334578",
            "US7487778",
            "US7533670",
            "US7588033",
            "US7661427",
            "US8453644 *",
            "US8794234",
            "US20040159323 *",
            "US20050051167 *",
            "US20090205663 *",
            "US20110000489 *",
            "US20110214672 *",
            "US20120167884 *",
            "US20120318268 *",
            "US20140190485 *",
            "WO2001015761A1 *",
            "WO2012033596A2 *"
        ],
        [
            "Filing date",
            "Oct 17, 1996",
            "Apr 7, 1999",
            "Aug 8, 2000",
            "Jan 22, 2001",
            "Feb 14, 2002",
            "Jul 14, 2000",
            "Sep 13, 2000",
            "Sep 30, 2002",
            "Jun 2, 2000",
            "Apr 2, 2003",
            "Sep 13, 2002",
            "Nov 17, 2003",
            "Jun 4, 1999",
            "May 9, 2002",
            "Feb 20, 2003",
            "Mar 27, 2006",
            "Feb 4, 2004",
            "Sep 20, 2006",
            "Jun 17, 2004",
            "Apr 2, 2003",
            "Mar 3, 2011",
            "Sep 24, 2009",
            "Oct 28, 2003",
            "Nov 17, 2003",
            "Feb 6, 2009",
            "Dec 20, 2007",
            "",
            "Mar 27, 2009",
            "Feb 18, 2011",
            "Jan 10, 2013",
            "Aug 31, 2000",
            "Aug 10, 2011"
        ],
        [
            "Publication date",
            "Apr 10, 2001",
            "Jun 5, 2001",
            "Aug 27, 2002",
            "Oct 15, 2002",
            "May 13, 2003",
            "May 20, 2003",
            "Jul 1, 2003",
            "Dec 30, 2003",
            "Jul 26, 2005",
            "Jul 26, 2005",
            "Mar 14, 2006",
            "Mar 28, 2006",
            "Apr 4, 2006",
            "Jan 2, 2007",
            "Feb 19, 2008",
            "Feb 26, 2008",
            "Feb 10, 2009",
            "May 19, 2009",
            "Sep 15, 2009",
            "Feb 16, 2010",
            "Jun 4, 2013",
            "Aug 5, 2014",
            "Aug 19, 2004",
            "Mar 10, 2005",
            "Aug 20, 2009",
            "Jan 6, 2011",
            "Sep 8, 2011",
            "Jul 5, 2012",
            "Dec 20, 2012",
            "Jul 10, 2014",
            "Mar 8, 2001",
            "Mar 15, 2012"
        ],
        [
            "Applicant",
            "Resmed Limited",
            "Siemens Elema Ab",
            "Newport Medical Instruments, Inc.",
            "James W. Biondi",
            "Minnesota Innovative Technologies & Instruments Corporation",
            "Siemens Elema Ab",
            "Cardiopulmonary Corporation",
            "Cardiopulmonary Corporation",
            "Respironics, Inc.",
            "Universite De Montreal",
            "Ric Investments, Llc.",
            "Cardiopulmonary Corporation",
            "Universite De Montreal",
            "University Of Florida Research Foundation, Inc.",
            "Minnesota Innovative Technologies & Instruments Corporation (Miti)",
            "Cardiopulmonary Corporation",
            "Breathe Technologies, Inc.",
            "Breathe Technologies, Inc.",
            "Breathe Technologies, Inc.",
            "Universite De Montreal",
            "Carefusion 207, Inc.",
            "Covidien Lp",
            "Minnesota Innovative Technologies And Instruments",
            "Biondi James W.",
            "Nellcor Puritan Bennett Llc",
            "Maquet Critical Care Ab",
            "Soliman Ihab S",
            "Erik Cardelius",
            "Rueller Stephan",
            "Covidien Lp",
            "Frank Loevstad",
            "Carefusion 207, Inc."
        ],
        [
            "Title",
            "Inspiratory duration in CPAP or assisted respiration treatment",
            "Method for determining a parameter related to spontaneous breathing efforts by a subject, and breathing-assist apparatus operating in accordance with the method",
            "Pressure support ventilation control system and method",
            "System for automatically weaning a patient from a ventilator, and method thereof",
            "Control of supplemental respiratory oxygen",
            "Method and computer software product for controlling an expiratory valve in a ventilator",
            "Ventilator control system and method",
            "System for automatically weaning a patient from a ventilator, and method thereof",
            "Average volume ventilation",
            "Proportional pressure assist ventilation controlled by a diaphragm electromyographic signal",
            "Average volume ventilation",
            "System for automatically weaning a patient from a ventilator, and method thereof",
            "Proportional pressure assist ventilation controlled by a diaphragm electromyographic signal",
            "Hybrid microprocessor controlled ventilator unit",
            "Control of supplemental respiratory oxygen",
            "System for automatically weaning a patient from a ventilator, and method thereof",
            "Tracheal catheter and prosthesis and method of respiratory support of a patient",
            "Systems, methods and apparatus for respiratory support of a patient",
            "Methods, systems and devices for improving ventilation in a lung area",
            "Proportional pressure assist ventilation controlled by a diaphragm electromyographic signal",
            "System and method for circuit compliance compensated pressure-regulated volume control in a patient respiratory ventilator",
            "Inversion-based feed-forward compensation of inspiratory trigger dynamics in medical ventilators",
            "Control of respiratory oxygen delivery",
            "System for automatically weaning a patient from a ventilator, and method thereof",
            "Configuring the operation of an alternating pressure ventilation mode",
            "Control unit, method and computer-readable medium for operating a ventilator",
            "System and method for circuit compliance compensated pressure-regulated volume control in a patient respiratory ventilator",
            "Peep regulation for a breathing apparatus",
            "Ventilation method and ventilation device",
            "System and method for detecting minimal ventilation support with volume ventilation plus software and remote monitoring",
            "An accessory device for a resuscitation unit",
            "Nasal intermittent mandatory ventilation (nimv) control system in a ventilator"
        ]
    ],
    "pageTitle": "Patent US5931162 - Ventilator which allows spontaneous inhalation and expiration within a ... - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US5931162?dq=5537618",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 7,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990112.50/warc/CC-MAIN-20150728002310-00042-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 484515671,
    "recordOffset": 484498308,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{20116=A ventilator of the above type is commercially available, known as the Servo Ventilator 300, described in an Operating Manual, Siemens-Elema AB, AG 0593 3.5, May 1993. The Servo Ventilator 300 can be set to operate in a number of different ventilation modes, such as pressure control, volume control, volume support, pressure regulated volume control, etc. One feature, selectable in all ventilation modes, is the trigger function, i.e., automatically triggering an inspiration phase dependent on the patient's breathing efforts. The ventilator detects attempts of the patient to breathe spontaneously and delivers, upon such detection, a controlled or supported inspiration (depending on the set ventilation mode). When the patient triggers in a controlled ventilation mode, the patient will be provided with a controlled breath according to the set parameters for the control mode. If such triggering occurs in a support ventilation mode, the patient may exercise some control of the respiration cycle. Some control and support modes also include a control feature for insuring that the patient receives a sufficient tidal volume or minute volume of respiratory gas.}",
    "textBeforeTable": "Patent Citations Although modifications and changes may be suggested by those skilled in the art, it is the intention of the inventor to embody within the patent warranted hereon all changes and modifications as reasonably and properly come within the scope of his contribution to the art. Instead of tidal volume, minute volume can be utilized as a control parameter for the operation of the specific feature. Other limits, within which the minute volume over a specific number of respiration cycles or a prescribed time may vary, can be used. The basic principles are, however, the same. This specific feature of allowing the patient 4 to exhale during an inspiration phase can be used in any ventilation mode, where controlled respirations are provided to the patient 4. This time the patient 4 spontaneously inhales a tidal volume 52 which is sufficient to exceed the set tidal volume minus the tidal volume 54 supplied during the controlled part of the inspiration phase 36C. The control unit 26 in the ventilator in this case the resets inspiration phase 36C and prolongs the following expiration phase 38C by the same amount of time (i.e. the time remaining of the reset inspiration phase 36C). The required level for resetting the inspiration phase 36C in this way, can be set at tidal volumes of 1.5 to 2 times the set tidal volume. If this limit is reached, it may also be preferable to",
    "textAfterTable": "US6668829 * Sep 30, 2002 Dec 30, 2003 Cardiopulmonary Corporation System for automatically weaning a patient from a ventilator, and method thereof US6920875 * Jun 2, 2000 Jul 26, 2005 Respironics, Inc. Average volume ventilation US6920878 Apr 2, 2003 Jul 26, 2005 Universite De Montreal Proportional pressure assist ventilation controlled by a diaphragm electromyographic signal US7011091 * Sep 13, 2002 Mar 14, 2006 Ric Investments, Llc. Average volume ventilation US7017574 Nov 17, 2003 Mar 28, 2006 Cardiopulmonary Corporation System for automatically weaning a patient from a ventilator, and method thereof US7021310 * Jun 4, 1999 Apr 4, 2006 Universite De Montreal Proportional pressure assist ventilation controlled by a diaphragm electromyographic signal US7156095 * May 9, 2002 Jan 2, 2007 University Of Florida Research Foundation, Inc. Hybrid microprocessor controlled ventilator unit US7331343 Feb 20,",
    "hasKeyColumn": true,
    "keyColumnIndex": 3,
    "headerRowIndex": 0
}