{
    "relation": [
        [
            "Citing Patent",
            "US8288992 *",
            "US8288999 *",
            "US8768419 *",
            "US9037426 *",
            "US9041341 *",
            "US20100244781 *",
            "US20120019209 *",
            "US20120290234 *",
            "US20120306451 *",
            "US20140062388 *"
        ],
        [
            "Filing date",
            "14 Jan 2010",
            "26 May 2009",
            "26 Jan 2012",
            "13 May 2011",
            "14 Dec 2009",
            "14 Jan 2010",
            "14 Dec 2009",
            "13 May 2011",
            "15 Feb 2011",
            "4 Feb 2013"
        ],
        [
            "Publication date",
            "16 Oct 2012",
            "16 Oct 2012",
            "1 Jul 2014",
            "19 May 2015",
            "26 May 2015",
            "30 Sep 2010",
            "26 Jan 2012",
            "15 Nov 2012",
            "6 Dec 2012",
            "6 Mar 2014"
        ],
        [
            "Applicant",
            "Indy Power Systems, Llc",
            "Aeneas Energy Technology Co., Ltd.",
            "Verizon Patent And Licensing Inc.",
            "GM Global Technology Operations LLC",
            "Robert Bosch Gmbh",
            "Quentin Wayne Kramer",
            "Holger Fink",
            "Gm Global Technology Operations, Llc.",
            "Ricoh Company, Ltd.",
            "Samsung Sdl Co., Ltd."
        ],
        [
            "Title",
            "Cell management system",
            "Charging circuit for balance charging serially connected batteries",
            "Mobile battery partitioning system and method",
            "Systems and methods for determining cell capacity values in a multi-cell battery",
            "More readily available traction battery",
            "Cell management system",
            "More readily available traction battery",
            "Systems and methods for determining cell capacity values in a multi-cell battery",
            "Secondary cell protection circuit and battery",
            "Cell balancing circuit and cell balancing method using the same"
        ]
    ],
    "pageTitle": "Patent US7928691 - Method and system for cell equalization with isolated charging sources - Google Patents",
    "title": "",
    "url": "http://www.google.com.au/patents/US7928691",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 7,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987127.36/warc/CC-MAIN-20150728002307-00021-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 480061467,
    "recordOffset": 480034517,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{27061=This application claims priority to U.S. Provisional Application No. 60/522,815 filed Nov. 11, 2004, which provisional application, in its entirety, is hereby incorporated by reference.}",
    "textBeforeTable": "Patent Citations Benefits, advantages and solutions to problems have been described herein with regard to specific embodiments. However, the benefits, advantages, solutions to problems, and any element(s) that may cause any benefit, advantage, or solution to occur or become more pronounced are not to be construed as critical, required, or essential features or elements of the invention. All structural and functional equivalents to the elements of the above-described exemplary embodiments that are known to those of ordinary skill in the art are expressly incorporated herein by reference. As used herein, the terms “comprises,” “comprising,” or any other variation thereof, are intended to cover a non-exclusive inclusion, such that a process, method, article, or apparatus that comprises a list of elements does not include only those elements but may include other elements not expressly listed or inherent to such process, method, article, or apparatus. Further, no element described herein is required for the practice of the invention unless expressly described as “essential” or “critical.” In one exemplary embodiment, method 600 also includes monitoring the voltage level of battery cell in the series string (step 650). In another embodiment, method 600 includes operating each charging source independently in an ON state or in an OFF state based on the voltage level of a battery cell connected to the charging source (step 660). is a flow diagram of another exemplary embodiment of a method 600 for equalizing the",
    "textAfterTable": "US5821733 16 Dec 1996 13 Oct 1998 Packard Bell Nec Multiple cell and serially connected rechargeable batteries and charging system US5850136 * 14 May 1997 15 Dec 1998 Integran, Inc. Battery charger US5867007 3 Sep 1997 2 Feb 1999 Samsung Electronics Co., Ltd. Selection circuit for dual batteries in a battery powered electronic device US5920179 5 May 1997 6 Jul 1999 Aer Energy Resources, Inc. System and method for balancing charge cycles for batteries or multiple-cell battery packs US5945804 28 Aug 1997 31 Aug 1999 Telefonaktiebolaget Lm Ericsson Method and device for controlling the voltage across individual cells in a battery US5952815 25 Jul 1997 14 Sep 1999 Minnesota Mining & Manufacturing Co. Equalizer system and method for series connected energy storing devices US5965996 * 11 Dec 1997 12 Oct 1999 Vectrix Corporation Electrical scooter having an equalization circuit for charging multiple batteries US6064178 7 May",
    "hasKeyColumn": true,
    "keyColumnIndex": 3,
    "headerRowIndex": 0
}