{
    "relation": [
        [
            "Citing Patent",
            "US7639170 *",
            "US7889095",
            "US7936253 *",
            "US8447841",
            "US8909739 *",
            "US20090289829 *",
            "US20130125195 *",
            "DE102011056870A1"
        ],
        [
            "Filing date",
            "Aug 25, 2006",
            "Oct 3, 2008",
            "May 23, 2007",
            "Sep 15, 2010",
            "Apr 19, 2006",
            "",
            "May 3, 2012",
            "Dec 22, 2011"
        ],
        [
            "Publication date",
            "Dec 29, 2009",
            "Feb 15, 2011",
            "May 3, 2011",
            "May 21, 2013",
            "Dec 9, 2014",
            "Nov 26, 2009",
            "May 16, 2013",
            "Jul 5, 2012"
        ],
        [
            "Applicant",
            "Hangzhou Silan Microelectronics Co., Ltd.",
            "Logitech Europe S.A.",
            "Funai Electric Co., Ltd.",
            "Universal Electronics Inc.",
            "Universal Electronics Inc.",
            "Fm Marketing Gmbh",
            "Uei Cayman Inc.",
            "Logitech Europe S.A."
        ],
        [
            "Title",
            "System and method for providing operation of internet powered universal remote controller",
            "Method and apparatus for uploading and downloading remote control codes",
            "Remote control system",
            "System and method for upgrading the remote control functionality of a device",
            "System and method for upgrading the remote control functionality of a device",
            "Programmable remote control and method for programming a remote control",
            "Interactive web-based codeset selection and development tool",
            "Blaster/digital receiver type remote control device i.e. smartphone, for controlling set of e.g. TVs, has computer system analyzing use information and producing set of references including information, which identify set of contents"
        ]
    ],
    "pageTitle": "Patent US7436319 - Method and apparatus for uploading and downloading remote control codes - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US7436319?dq=oakley+5,387,949&ei=4yI4T8nkLYa80QG0xqnWAg",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 7,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990112.50/warc/CC-MAIN-20150728002310-00339-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 468183739,
    "recordOffset": 468156099,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{6320=FIG. 17 shows a schematic block diagram of a configuration of modules used to carry out the method of the present invention. A processor module 1701 is connected to the interface communication module 1702, the device communication module 1703, the environment input module 1704, the user input module 1705, the user output module 1706, the code storage module 1707 and the data storage module 1708. The power module 1709 in sonnected (not shown) to every module that requires power. The device communication module 1703 is able to communicate with some or all of the devices 1714.1-1714.n (where n is an integer to indicate a range from zero to many). The Internet Enabled User Interaction Device (IEUID) 1750 contains some or all of the modules 1701 to 1709. The interface communication module 1702 is able to communicate with the Interface System 1710, which is connected to the Network 1711. Also connected to the Network 1711 is the Configuration Information System 1720, the Data Collection System 1721 and the Content Information System 1722.}",
    "TableContextTimeStampAfterTable": "{23989=This application is a continuation and claims priority from U.S. application Ser. No. 10/839,970, filed May 5, 2004, which is a continuation of U.S. application Ser. No. 09/804,623, filed Mar. 12, 2001, now abandoned, which claims the benefit of U.S. Provisional Application No. 60/189,487, filed Mar. 15, 2000, all of which are incorporated herein by reference in their entirety for all purposes., 63128=Configuration of the IEUID is controlled by the Programming System, which is a conceptual computing system that may be distributed between any or all of the IEUID, the Interface System 1710, the Programming Information System 1720, the data Collection System 1721 and the Content Information System 1722. In the following example, the Programming System is composed of the Configuration Information System 1720 (which is an Internet website) and the Interface System 1710 (which is a personal computer that is running both a web browser application and an IEUID communication application)., 65380=It is noted that the configuration information stored by the IEUID in the data module 1708 is not restricted in any way, and includes (but is not limited to) categories of information such as:, 65166=It is noted that the Configuration Information System 1720 is any network interface device that stores programming information and techniques used when programming the IEUID., 63792=Example The user wishes to specify which devices are to be controlled by the IEUID. The Programming System obtains information from the user such as the make and model of each device in his home stereo system, and uploads the appropriate configuration to the IEUID via the Interface System 1710., 62949=Any information stored by the IEUID (for example, preference and interaction information) may be communicated to the Interface System 1710.}",
    "textBeforeTable": "Patent Citations Therefore, the foregoing is considered as illustrative only of the principles of the invention. Further, since numerous modifications and changes will readily occur to those skilled in the art, it is not desired to limit the invention to the exact construction and operation shown and described, and accordingly, all suitable modifications and equivalents may be resorted to, falling within the scope of the invention. The fact that the user wishes to control a device network that consists of a Sony CDP-CX255 compact disc player which is connected to a Sony STR-DE905 receiver, and the infrared control and sequencing information required to activate their combined functionality. The fact that the user wishes to control a device network that just consists of a Sony CDP-CX255 compact disc player, and the infrared control information required to activate its functionality. Device. This information records which devices are to be controlled and their associated control mechanisms. Examples of this type of information include: It is noted that the configuration information stored by the IEUID in the data module 1708 is not restricted in any way, and includes (but is not limited to) categories of information such as: It is noted that the Configuration Information System 1720 is any network interface device that stores programming information and techniques used when programming the IEUID. Information obtained from the IEUID (for example, infrared codes emitted by the",
    "textAfterTable": "US4959810 Dec 2, 1987 Sep 25, 1990 Universal Electronics, Inc. Universal remote control device US5109222 Mar 27, 1989 Apr 28, 1992 John Welty Remote control system for control of electrically operable equipment in people occupiable structures US5140326 Jan 29, 1991 Aug 18, 1992 Harris Corporation Converter comparator cell with improved resolution US5161023 Sep 24, 1990 Nov 3, 1992 Thomson Consumer Electronics, Inc. Previous channel feature in a television receiver having multiple rf inputs US5228077 Sep 24, 1990 Jul 13, 1993 Universal Electronics Inc. Remotely upgradable universal remote control US5255313 Apr 8, 1993 Oct 19, 1993 Universal Electronics Inc. Universal remote control system US5374999 Dec 22, 1992 Dec 20, 1994 Silitek Corporation Scan control system US5410326 Dec 4, 1992 Apr 25, 1995 Goldstein; Steven W. Programmable remote control device for interacting with a plurality of remotely controlled devices US5414426 Dec 11, 1992",
    "hasKeyColumn": true,
    "keyColumnIndex": 3,
    "headerRowIndex": 0
}