{
    "relation": [
        [
            "Citing Patent",
            "US6794074",
            "US7189473",
            "US7332238",
            "US7816027",
            "US8088506",
            "US8617753",
            "US8652665",
            "US20020061427 *",
            "US20040247996 *",
            "WO2005031901A3 *"
        ],
        [
            "Filing date",
            "Oct 12, 2001",
            "Jun 3, 2003",
            "Sep 6, 2002",
            "May 20, 2008",
            "Sep 17, 2004",
            "Jul 16, 2008",
            "May 20, 2008",
            "Oct 12, 2001",
            "Jun 3, 2003",
            "Aug 11, 2004"
        ],
        [
            "Publication date",
            "Sep 21, 2004",
            "Mar 13, 2007",
            "Feb 19, 2008",
            "Oct 19, 2010",
            "Jan 3, 2012",
            "Dec 31, 2013",
            "Feb 18, 2014",
            "May 23, 2002",
            "Dec 9, 2004",
            "Jun 15, 2006"
        ],
        [
            "Applicant",
            "Rayovac Corporation",
            "Eastway Fair Company Limited",
            "The Gillette Company",
            "Eveready Battery Company, Inc.",
            "Eveready Battery Company, Inc.",
            "Nissan Motor Co., Ltd.",
            "Eveready Battery Co. Inc.",
            "Vu Viet H.",
            "One World Tehnologies, Ltd.",
            "Nissan Motor"
        ],
        [
            "Title",
            "Air manager for metal-air cells",
            "Battery venting system",
            "Electrochemical cells and systems",
            "System and method of controlling fluid to a fluid consuming battery",
            "Fluid consuming battery with fluid regulating system",
            "Fuel cell system with voltage sensor",
            "System and method of controlling fluid to a fluid consuming battery",
            "Air manager for metal-air cells",
            "Battery venting system",
            "Fuel cell system"
        ]
    ],
    "pageTitle": "Patent US6106962 - Air manager control using cell voltage as auto-reference - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US6106962?dq=6078894",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 7,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987127.36/warc/CC-MAIN-20150728002307-00100-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 477987911,
    "recordOffset": 477957272,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{35701=The assignee of the present invention is also the owner of application Ser. No. 08/544,707, entitled \"Diffusion Controlled Air Door,\" filed Oct. 18, 1995, now U.S. Pat. No. 5,691,074 and application Ser. No. 08/556,613, entitled \"Diffusion Controlled Air Vent and Recirculation Air Manager for a Metal-Air Battery,\" filed Nov. 13, 1995. These references disclose several preferred metal-air battery packs for use with the present invention and are incorporated herein by reference. The air inlet and outlet openings in the housing are sized with a length in the direction through the thickness of the housing being greater than a width in the direction perpendicular to the thickness of the housing. The openings are unobstructed and are sized to eliminate substantially the air flow into the air inlet opening and out of the air outlet opening when the fan is turned off.}",
    "textBeforeTable": "Patent Citations It should be understood that the foregoing relates only to preferred embodiments of the present invention, and that numerous changes may be made therein without departing from the spirit and scope of the invention as defined by the following claims. The present invention therefore can provide a battery 10 with a relatively long shelf life without the need for a mechanical air door or a fan switch. The present invention can function as, for example, a power source of an emergency device than can be automatically activated because there is no need for a separate activation step. More importantly, the present invention provides for an efficient air manager system that minimizes the running of the fan 40 and the energy drain associated with the fan 40. 3. Because the fan 40 runs in a duty cycle, the battery 10 as a whole is quieter than a battery 10 with a continuously running fan 40. 2. Power consumption of the fan 40 is minimized as a percentage of the power consumed by the battery 10 as a whole. For example, a fifty percent (50%) duty cycle may be all that is required at low drain rates. This decreases the overhead energy consumed by the battery 10 as a whole. 1. The life of the battery 10 is maximized from the standpoint of environmental exposure. In other words, only enough oxygen is admitted into the housing 20 as",
    "textAfterTable": "US3072284 * Jun 9, 1960 Jan 8, 1963 Dairy Equipment Company Vent US3160528 * Nov 30, 1961 Dec 8, 1964 Exxon Research Engineering Co Portable power plant US3288644 * Jun 18, 1962 Nov 29, 1966 Leesona Corp Fuel cell moudule with palladium-silver alloy anode US3372060 * Dec 26, 1962 Mar 5, 1968 Allis Chalmers Mfg Co Fluid distribution means in a fuel cell US3382238 * Apr 27, 1967 May 7, 1968 Squibb & Sons Inc Penicillin and cephalosporin derivatives US3395047 * Aug 30, 1965 Jul 30, 1968 Monsanto Res Corp Gasketed electrode fuel cell US3411951 * Oct 15, 1965 Nov 19, 1968 United Aircraft Corp Power supply comprising in combination a fuel cell stack and a humidity exchange scrubber unit US3436270 *",
    "hasKeyColumn": true,
    "keyColumnIndex": 3,
    "headerRowIndex": 0
}