{
    "relation": [
        [
            "Date",
            "Nov 3, 1987",
            "Jun 5, 1990",
            "Sep 21, 1992",
            "Nov 12, 1996",
            "Apr 6, 1997",
            "Jun 17, 1997"
        ],
        [
            "Code",
            "AS",
            "CC",
            "FPAY",
            "REMI",
            "LAPS",
            "FP"
        ],
        [
            "Event",
            "Assignment",
            "Certificate of correction",
            "Fee payment",
            "Maintenance fee reminder mailed",
            "Lapse for failure to pay maintenance fees",
            "Expired due to failure to pay maintenance fee"
        ],
        [
            "Description",
            "Owner name: KABUSHIKI KAISHA TOSHIBA, 72 HORIKAWA-CHO, SAIWAI- Free format text: ASSIGNMENT OF ASSIGNORS INTEREST.;ASSIGNOR:SATO, HIDEKI;REEL/FRAME:004778/0099 Effective date: 19871028 Owner name: KABUSHIKI KAISHA TOSHIBA, A CORP OF JAPAN,JAPAN Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNOR:SATO, HIDEKI;REEL/FRAME:004778/0099 Effective date: 19871028",
            "",
            "Year of fee payment: 4",
            "",
            "",
            "Effective date: 19970409"
        ]
    ],
    "pageTitle": "Patent US4819255 - Stereo X-ray fluorography apparatus - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US4819255?dq=6188988",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 8,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438044271733.81/warc/CC-MAIN-20150728004431-00031-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 470833813,
    "recordOffset": 470817854,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Patent Citations This invention is not restricted to the aforementioned embodiment and can be changed or modified in a variety of ways without departing from the spirit and scope of this invention. As the TV monitor use may be made of other types of TV monitors than the double-rate monitor, if the field frequency is high enough such that the flickering can not be recognized. It is only necessary that X-ray exposure be performed for each plurality of fields, a minimum requisite for stereo vision, and the flickering can not be recognized. Furthermore, by increasing the read-out rate over the write-in rate of the frame memory to obtain a high field frequency, the flickering of an image during an alternate switching of left and right images can be prevented on the double-rate monitor. According to this invention, as set out above, the X-ray exposure is carried out for each plurality of TV fields and the field images thus obtained, once written into the corresponding frame memories, are repetitively read a plurality of times out of the aforementioned corresponding frame memories to compensate for the image signals of the fields in which an X-ray is not emitted. By so doing, in spite of the image persistent characteristic of the image pickup tube in the TV camera, an image of an X-ray emitted from one focal point of the stereo X-ray tube is never overlappingly displayed on an image of",
    "textAfterTable": "Kabushiki Kaisha Toshiba Stereoscopic x-ray apparatus US5107528 * Nov 9, 1990 Apr 21, 1992 Kabushiki Kaisha Toshiba X-ray diagnosis apparatus US5233639 * Nov 29, 1990 Aug 3, 1993 Marks Lloyd A Stereoscopic fluoroscopy apparatus and method of producing stereoscopic X-ray images US5510832 * Dec 1, 1993 Apr 23, 1996 Medi-Vision Technologies, Inc. Synthesized stereoscopic imaging system and method US6115449 * Oct 10, 1998 Sep 5, 2000 Nanotek Instruments, Inc. Apparatus for quantitative stereoscopic radiography US6118843 * Oct 10, 1998 Sep 12, 2000 Nanotek Instruments, Inc. Quantitative stereoscopic radiography method US6151060 * Dec 5, 1996 Nov 21, 2000 Olympus Optical Co., Ltd. Stereoscopic video display apparatus which fuses real space image at finite distance US6181768 Jun 4, 1999 Jan 30, 2001 Leonard F. Berliner Radiological image acquisition and manipulation system for multiple",
    "hasKeyColumn": true,
    "keyColumnIndex": 2,
    "headerRowIndex": 0
}