{
    "relation": [
        [
            "Citing Patent",
            "US7556650",
            "US7662133 *",
            "US7740660",
            "US7789912",
            "US7789913",
            "US7837733",
            "US7959607 *",
            "US7993269 *",
            "US8197544",
            "US8246630",
            "US8317802",
            "US8337557",
            "US8357168",
            "US8672886",
            "US8974502 *",
            "US20020001401 *",
            "US20040193045 *",
            "US20100210941 *",
            "EP2296527A1 *",
            "WO2008016897A2 *",
            "WO2013063696A1 *"
        ],
        [
            "Filing date",
            "Jun 29, 2005",
            "Feb 23, 2004",
            "Jun 29, 2005",
            "Jan 7, 2005",
            "Jun 29, 2005",
            "Jun 29, 2005",
            "May 26, 2006",
            "Feb 17, 2006",
            "Feb 27, 2012",
            "Aug 18, 2010",
            "Aug 16, 2012",
            "Jun 29, 2005",
            "Sep 5, 2007",
            "Jun 13, 2011",
            "Oct 30, 2008",
            "Jun 20, 2001",
            "Feb 23, 2004",
            "",
            "May 15, 2009",
            "Jul 31, 2007",
            "Sep 28, 2012"
        ],
        [
            "Publication date",
            "Jul 7, 2009",
            "Feb 16, 2010",
            "Jun 22, 2010",
            "Sep 7, 2010",
            "Sep 7, 2010",
            "Nov 23, 2010",
            "Jun 14, 2011",
            "Aug 9, 2011",
            "Jun 12, 2012",
            "Aug 21, 2012",
            "Nov 27, 2012",
            "Dec 25, 2012",
            "Jan 22, 2013",
            "Mar 18, 2014",
            "Mar 10, 2015",
            "Jan 3, 2002",
            "Sep 30, 2004",
            "Aug 19, 2010",
            "Mar 23, 2011",
            "Feb 7, 2008",
            "May 10, 2013"
        ],
        [
            "Applicant",
            "Spine Wave, Inc.",
            "Smith & Nephew, Inc.",
            "Spine Wave, Inc.",
            "Spine Wave, Inc.",
            "Spine Wave, Inc.",
            "Spine Wave, Inc.",
            "Stryker Corporation",
            "Medtronic, Inc.",
            "Spine Wave, Inc.",
            "Spine Wave, Inc.",
            "Spine Wave, Inc.",
            "Spine Wave, Inc.",
            "Spine Wave, Inc.",
            "Stryker Corporation",
            "Warsaw Orthopedic, Inc.",
            "Siemens Aktiengesellschaft",
            "Nelson Scarborough",
            "Hyoung-Ihl Kim",
            "Samba Sensors AB",
            "Kyphon Inc",
            "Kimberly-Clark, Inc."
        ],
        [
            "Title",
            "Methods for injecting a curable biomaterial into an intervertebral space",
            "Spinal fluid introduction",
            "Methods for treating defects and injuries of an intervertebral disc",
            "Apparatus and method for injecting fluent material at a distracted tissue site",
            "Methods for injecting a curable biomaterial into an intervertebral space",
            "Percutaneous methods for injecting a curable biomaterial into an intervertebral space",
            "Hand-held fluid delivery device with sensors to determine fluid pressure and volume of fluid delivered to intervertebral discs during discography",
            "Sensor and method for spinal monitoring",
            "Method for distracting opposing vertebral bodies of a spine",
            "Apparatus and method for injecting fluent material at a distracted tissue site",
            "System for distracting opposing vertebral bodies of a spine",
            "Apparatus and kit for injecting a curable biomaterial into an intervertebral space",
            "Modular injection needle and seal assembly",
            "System for use during discography to wirelessly transmit data from hand-held fluid delivery device inside sterile field to device outside sterile field",
            "Methods, systems, and devices for treating intervertebral discs including intradiscal fluid evacuation",
            "Medical system architecture with an apparatus for the acquisition and playback of current photographic images or image sequences",
            "Spinal fluid introduction",
            "Auto examination system for intervertebral discs",
            "A method and a device for examination of physical magnitude in humans or animals in an object filled with liguid or gas",
            "Kit and methods of treatment of an intervertebral disc",
            "Manometer for use in testing spinal region and related method"
        ]
    ],
    "pageTitle": "Patent US6370420 - System and method for objectively verifying an internal disc disruption - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US6370420?dq=6,373,753",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 6,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989443.69/warc/CC-MAIN-20150728002309-00180-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 472381703,
    "recordOffset": 472361865,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Patent Citations While the invention has been particularly shown and described with reference to a preferred embodiment thereof, it should be understood by those skilled in the art that changes in form and detail may be made therein without departing from the spirit and scope of the claims. An advantage of the present invention is that the device provides objective indicia, such as pressure measurements 22 and real time x-ray images 54, to indicate the existence and severity of fissuring. Also, objective indicia of the existence of pain, such as photographic images 44 and the patient's vocalizations 64, assist the medical professional in determining whether the patient's back pain has been reproduced. By combining all these indicia on a single display 70, the present invention has the advantage of giving the medical professional the necessary information to diagnose the intervertebral disc 24 disruption without having to scroll through screens, view several different screens, or change input channels while performing the diagnosis. Another advantage of the present invention is that the images and sounds are presented simultaneously and in real time so that the medical professional may properly account for the interdependency of each of the various measurements, images, and sounds to determine if, as a whole, the measurements, images, and sounds indicate an internally disrupted intervertebral disc 24. Yet another advantage of the present invention is that the present invention may be used to accurately record the condition",
    "textAfterTable": "US8246630 Aug 18, 2010 Aug 21, 2012 Spine Wave, Inc. Apparatus and method for injecting fluent material at a distracted tissue site US8317802 Aug 16, 2012 Nov 27, 2012 Spine Wave, Inc. System for distracting opposing vertebral bodies of a spine US8337557 Jun 29, 2005 Dec 25, 2012 Spine Wave, Inc. Apparatus and kit for injecting a curable biomaterial into an intervertebral space US8357168 Sep 5, 2007 Jan 22, 2013 Spine Wave, Inc. Modular injection needle and seal assembly US8672886 Jun 13, 2011 Mar 18, 2014 Stryker Corporation System for use during discography to wirelessly transmit data from hand-held fluid delivery device inside sterile field to device outside sterile field US8974502 * Oct 30, 2008 Mar 10, 2015 Warsaw Orthopedic, Inc. Methods, systems, and devices for treating intervertebral discs including intradiscal fluid evacuation US20020001401 * Jun 20, 2001 Jan 3, 2002 Siemens Aktiengesellschaft Medical system architecture with an apparatus for the acquisition",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}