{
    "relation": [
        [
            "Citing Patent",
            "US5739972 *",
            "US5774293 *",
            "US5880901 *",
            "US5999360 *",
            "US6084754 *",
            "US6384994",
            "US6570731",
            "US6771456",
            "US7554338 *",
            "WO1998041981A1 *"
        ],
        [
            "Filing date",
            "Jan 2, 1996",
            "Jun 3, 1996",
            "Jul 7, 1997",
            "Mar 14, 1997",
            "Jul 7, 1997",
            "Feb 1, 2000",
            "May 14, 2001",
            "May 31, 2001",
            "May 26, 2006",
            "Mar 14, 1997"
        ],
        [
            "Publication date",
            "Apr 14, 1998",
            "Jun 30, 1998",
            "Mar 9, 1999",
            "Dec 7, 1999",
            "Jul 4, 2000",
            "May 7, 2002",
            "May 27, 2003",
            "Aug 3, 2004",
            "Jun 30, 2009",
            "Sep 24, 1998"
        ],
        [
            "Applicant",
            "Ibm",
            "U.S. Philips Corporation",
            "International Business Machines Corporation",
            "Seagate Technology, Inc.",
            "International Business Machines Corporation",
            "International Business Machines Corporation",
            "Quantum Corporation",
            "International Business Machines Corporation",
            "Tektronix, Inc.",
            "Dallas W Meyer"
        ],
        [
            "Title",
            "Method and apparatus for positioning a magnetoresistive head using thermal response to servo information on the record medium",
            "Magnetic recording and/or reproducing apparatus with automatic control of separation between the magnetic head and the record carrier surface",
            "Method and apparatus for positioning a magnetoresistive head",
            "Disc drive servo system employing thermal signals",
            "Method and apparatus for positioning a magnetoresistive head using thermal response to servo information on the record medium",
            "Method for positioning a magnetoresistive head using a thermal response to servo information on the record medium",
            "System for detecting an edge of a moving data storage medium",
            "System and method for miniaturization of read/write heads",
            "Display for measuring phase noise characteristics",
            "Disc drive servo system employing thermal signals"
        ]
    ],
    "pageTitle": "Patent US5457585 - Tape edge detector using off tape and on tape MR noise - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US5457585?dq=oakley+5,387,949",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 6,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990217.27/warc/CC-MAIN-20150728002310-00164-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 479903359,
    "recordOffset": 479883511,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Patent Citations Clearly, other embodiments and modifications of this invention will occur readily to those of ordinary skill in the art in view of these teachings. Therefore, this invention is to be limited only by the following claims, which include all such embodiments and modifications when viewed in conjunction with the above specification and accompanying drawing. The present invention can be employed for a head having a single MR element or a head having multi-MR elements. After the reference position is detected a single MR element can be indexed to one or more desired tracks on a magnetic tape as explained hereinabove. After the reference position is detected there are several modes for a multi-MR element. One mode is for one of the MR elements to be dedicated to a reference position at the edge of the tape which places the other MR elements in position to read tracks, and another mode is for the multi-MR element head to be indexed to one or more positions on the magnetic tape. Other arrangements for employing the thermal noise generated by friction within an MR element are illustrated in FIGS. 14, 15, and 16. In FIG. 14, the MR element can be gradually moved toward the edge of the tape until the noise power starts to increase at location 80, after which it can be reversed in direction from some location 82 in small increments by a stepping motor back",
    "textAfterTable": "Filing date Publication date Applicant Title US5739972 * Jan 2, 1996 Apr 14, 1998 Ibm Method and apparatus for positioning a magnetoresistive head using thermal response to servo information on the record medium US5774293 * Jun 3, 1996 Jun 30, 1998 U.S. Philips Corporation Magnetic recording and/or reproducing apparatus with automatic control of separation between the magnetic head and the record carrier surface US5880901 * Jul 7, 1997 Mar 9, 1999 International Business Machines Corporation Method and apparatus for positioning a magnetoresistive head US5999360 * Mar 14, 1997 Dec 7, 1999 Seagate Technology, Inc. Disc drive servo system employing thermal signals US6084754 * Jul 7, 1997 Jul 4, 2000 International Business Machines Corporation Method and apparatus for positioning a magnetoresistive head using thermal response to servo information on the record medium US6384994 Feb 1, 2000 May 7, 2002 International Business Machines Corporation Method for positioning a",
    "hasKeyColumn": true,
    "keyColumnIndex": 3,
    "headerRowIndex": 0
}