{
    "relation": [
        [
            "Citing Patent",
            "US7097763 *",
            "US7947171 *",
            "US8246817 *",
            "US8288048",
            "US20050106433 *",
            "US20050115883 *",
            "US20110159392 *",
            "US20130224617 *",
            "WO2010126460A1 *",
            "WO2014167907A1 *",
            "WO2014167908A1 *"
        ],
        [
            "Filing date",
            "Nov 22, 2004",
            "Nov 4, 2004",
            "Jun 10, 2004",
            "Apr 20, 2010",
            "Nov 4, 2004",
            "Nov 22, 2004",
            "",
            "Nov 4, 2011",
            "Apr 27, 2009",
            "Feb 20, 2014",
            "Feb 20, 2014"
        ],
        [
            "Publication date",
            "Aug 29, 2006",
            "May 24, 2011",
            "Aug 21, 2012",
            "Oct 16, 2012",
            "May 19, 2005",
            "Jun 2, 2005",
            "Jun 30, 2011",
            "Aug 29, 2013",
            "Nov 4, 2010",
            "Oct 16, 2014",
            "Oct 16, 2014"
        ],
        [
            "Applicant",
            "Nissan Motor Co., Ltd.",
            "Nissan Motor Co., Ltd.",
            "Ford Motor Company",
            "Parker-Hannifin Corporation",
            "Nissan Motor Co., Ltd.",
            "Nissan Motor Co., Ltd.",
            "Honeywell International Inc.",
            "Daimler Ag",
            "Utc Power Corporation",
            "Honda Motor Co., Ltd.",
            "Honda Motor Co., Ltd."
        ],
        [
            "Title",
            "Ion exchange filter apparatus",
            "Cooling device for fuel cell",
            "Deionization filter for fuel cell vehicle coolant",
            "Fuel cell/battery thermal management system",
            "Cooling device for fuel cell",
            "Ion exchange filter apparatus",
            "Colorant treated ion exchange resins, method of making, heat transfer systems and assemblies containing the same, and method of use",
            "Coolant Circuit for a Fuel Cell System and Method for Changing out Ion Exchanger Material",
            "A fluidized bed contaminant separator and water-control loop for a fuel reactant stream of a fuel cell",
            "Fuel cell system and method of controlling the fuel cell system",
            "Fuel cell system ion exchanger"
        ]
    ],
    "pageTitle": "Patent US20050058868 - Cooling system for fuel cell and method for detecting deterioration of ... - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US20050058868?dq=6246862",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 6,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990217.27/warc/CC-MAIN-20150728002310-00009-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 476773023,
    "recordOffset": 476751336,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{25324=The disclosure of Japanese Patent Application No. 2003-322642 filed on Sep. 16, 2003, including the specification, drawings and abstract is incorporated herein by reference in its entirety., 29210=Japanese Patent Laid-Open Publication No. 2001-35519 (JP-A-2001-35519) discloses an impurity removing device which is provided in a coolant system of a fuel cell and which suppresses occurrence of separation, crushing, and partial demineralization of an ion exchange resin. The impurity removing device disclosed in the publication is a cartridge type, and includes a spring for pressing the ion exchange resin in an axial direction of a container (i.e., a direction in which a coolant flows)., 29748=However, the impurity removing device disclosed in Japanese Patent Laid-Open Publication No. 2001-35519 does not include a detecting device which detects deterioration of the ion exchange resin. Therefore, it is difficult to determine whether the ion exchange resin has reached the end of its life (i.e., whether the ion exchange resin needs replacing).}",
    "textBeforeTable": "Patent Citations includes the electrical conductivity sensor which detects the electrical conductivity of the cooling medium. Therefore, the degree of deterioration of the impurity removing member can be determined by measuring the electrical conductivity of the cooling medium for the fuel cell. FIGS. 5A and 5B The detecting device in includes the sensor which detects at least one of the change in size of the impurity removing member and the change in color of the impurity removing member due to deterioration thereof. Therefore, the degree of deterioration of the impurity removing member can be determined by detecting the changes in size and color of the impurity removing member due to deterioration thereof. FIG. 4 The detecting device in , the detecting device includes the display member which is movable with respect to the container in accordance with deterioration of the impurity removing device. Therefore, the amount of shrinkage of the impurity removing member housed in the container can be detected according to the amount of movement of the display member. Therefore, the degree of deterioration of the impurity removing member can be easily determined only by checking the display member. FIG. 3 In the cooling system for a fuel cell in , the detecting device includes the transparent or translucent wall. Therefore, the changes in the amount of",
    "textAfterTable": "US7097763 * Nov 22, 2004 Aug 29, 2006 Nissan Motor Co., Ltd. Ion exchange filter apparatus US7947171 * Nov 4, 2004 May 24, 2011 Nissan Motor Co., Ltd. Cooling device for fuel cell US8246817 * Jun 10, 2004 Aug 21, 2012 Ford Motor Company Deionization filter for fuel cell vehicle coolant US8288048 Apr 20, 2010 Oct 16, 2012 Parker-Hannifin Corporation Fuel cell/battery thermal management system US20050106433 * Nov 4, 2004 May 19, 2005 Nissan Motor Co., Ltd. Cooling device for fuel cell US20050115883 * Nov 22, 2004 Jun 2, 2005 Nissan Motor Co., Ltd. Ion exchange filter apparatus US20110159392 * Jun 30, 2011 Honeywell International Inc. Colorant treated ion exchange resins, method of making, heat transfer systems and assemblies containing the same, and method of use US20130224617",
    "hasKeyColumn": true,
    "keyColumnIndex": 3,
    "headerRowIndex": 0
}