{
    "relation": [
        [
            "Date",
            "Oct 7, 1998",
            "Sep 22, 2004",
            "Dec 8, 2008",
            "May 29, 2009",
            "Jul 21, 2009"
        ],
        [
            "Code",
            "AS",
            "FPAY",
            "REMI",
            "LAPS",
            "FP"
        ],
        [
            "Event",
            "Assignment",
            "Fee payment",
            "Maintenance fee reminder mailed",
            "Lapse for failure to pay maintenance fees",
            "Expired due to failure to pay maintenance fee"
        ],
        [
            "Description",
            "Owner name: INTERNATIONAL BUSINESS MACHINES CORPORATION, NEW Y Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNORS:BEARDSLEY, BRENT CAMERON;ELLIOTT, JOSEPH CHARLES;ISKIYAN, JAMES LINCOLN;REEL/FRAME:009510/0676;SIGNING DATES FROM 19980825 TO 19980831",
            "Year of fee payment: 4",
            "",
            "",
            "Effective date: 20090529"
        ]
    ],
    "pageTitle": "Patent US6240467 - Input/output operation request handling in a multi-host system - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US6240467?ie=ISO-8859-1&dq=5,381,459",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 11,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990217.27/warc/CC-MAIN-20150728002310-00075-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 476713091,
    "recordOffset": 476680340,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{40227=The channel subsystem 2 may receive numerous I/O operations from CPUs 6 a, b directed toward the I/O devices 10 a, b, c. The channel subsystem 2 initiates a channel program which comprises a series of channel commands to access and perform the I/O operation requested by the host system 4. An I/O operation toward a volume operates through the execution of a series of linked channel command words (CCW). The CCW designates the storage area associated with the operation, the action to be taken whenever transfer to or from the area is completed, and other options. A CCW command includes different fields, including: a command code that specifies the operation to be performed, e.g., write, read, read backward, control, sense, sense ID, and transfer in channel; and an address field designating a location in absolute storage, otherwise referred to as a data storage address of where the I/O operations and commands are maintained in main memory 12, and chain command information specifying whether commands are chained together. With each chain of commands, a define extent command may be provided indicating the permissible I/O operations that may be performed and a locate record command indicating the actual I/O operation to be performed. The chain of CCW commands may operate within the defined extent range. A description of these commands is provided in the IBM publication, “IBM 399019390 Storage Control Reference,” IBM Document no. GA32-0274-04 (Copyright IBM, 1994, 1996), which publication is incorporated herein by reference in its entirety., 53033=The storage controller 18 maintains a different view of the system. The storage controller 18 is provided a base unit address for each I/O device 26 a, b, c (volume) and one or more alias unit addresses for each base unit address. As discussed, for each logical subsystem (LSS) within the storage controller 18, the 256 addresses for a LSS may be allocated in any manner between base and alias addresses. After assigning a base address to each I/O device, the remaining addresses can be allocated as alias addresses to the base addresses in any arrangement. The storage controller 18 uses the unit addresses to physically access the I/O devices 26 a, b, c (volumes). In preferred embodiments, the structure of the storage controller 18 and interface between the storage controller 18 and host system 16 may be the storage controller 18 structure described in the following U.S. patent applications assigned to IBM: “Failover System for a Multiprocessor Storage Controller,” to Brent C. Beardsley, Matt Kalos, Ronald R. Knowlden, Ser. No. 09/026,622, now U.S. Pat. No. 6,061,750, filed on Feb. 20, 1998; and “Failover and Failback System for a Direct Access Storage Device,” to Brent C. Beardsley and Michael T. Benhase, Ser. No. 08/988,887, now U.S. Pat. No. 6,006,342, filed on Dec. 11, 1997, both of which applications are incorporated herein by reference in their entirety., 70877=The main memory 30 includes a configuration data table (CDT) which is comprised of the CDRs for each subchannel 32 a, b, c. The host 16 may access this table to access CDR records. Table 1 below shows a preferred embodiment of the fields included in the CDR data structure for an alias UCB in accordance with preferred embodiments of the present invention. The Node Element Qualifier (NEQ) describes the paths and addressees for a particular device, controller, volume, etc. A further description of the NED and NEQ fields are described in IBM document “Storage Subsystem Library: IBM 3990 Storage Control Reference (Models 1, 2, nd 3)”, IBM document no. GA32-0099-06, (IBM Copyright 1988, 1994) and U.S. Pat. No 5,191,069, assigned to IBM, which publication and patent are incorporated wherein by reference in their entirety., 44302=In prior art systems, the host channel subsystem 2 establishes allegiance between the subchannels 12 a, b and channel paths to the control units 8 a, b, c. In prior art host systems, only one I/O request at a time can have allegiance to a particular I/O device 26 a, b. Another I/O request in the host can only gain allegiance after the previous I/O request executing commands in the subchannel 12 a, b has released its allegiance. Prior art systems are described in the IBM publications “ESA/390 Principles of Operation,” IBM document no. SA22-7201-04 (IBM Copyright 1990, 1991, 1993, 1994, 1996, 1997), and U.S. Pat. Nos. 5,197,069 and 5,530,897, assigned to IBM, which publications and patents are incorporated herein by reference in their entirety.}",
    "textBeforeTable": "Patent Citations The foregoing description of the preferred embodiments of the invention has been presented for the purposes of illustration and description. It is not intended to be exhaustive or to limit the invention to the precise form disclosed. Many modifications and variations are possible in light of the above teaching. It is intended that the scope of the invention be limited not by this detailed description, but rather by the claims appended hereto. The above specification, examples and data provide a complete description of the manufacture and use of the composition of the invention. Since many embodiments of the invention can be made without departing from the spirit and scope of the invention, the invention resides in the claims hereinafter appended. In summary, preferred embodiments in accordance with the present invention provide a system for handling an input/output (I/O) operation. A controller receives an I/O operation against an address for an I/O device. The controller determines whether there is at least one active I/O operation executing against the I/O device. After determining that there is at least one active I/O operation, the controller determines whether the received I/O operation conflicts with active I/O operations executing against the I/O device. The controller then executes the received I/O operation against the I/O device concurrently with the active I/O operations after determining that the received I/O operation does not conflict with active I/O operations. Preferred embodiments were described with respect",
    "textAfterTable": "International Business Machines Corporation Method and system for maintaining concurrent data access during device upgrade US5787463 * Apr 15, 1997 Jul 28, 1998 Mti Technology Corporation Disk array system including a dual-ported staging memory and concurrent redundancy calculation capability US5894560 * Aug 26, 1996 Apr 13, 1999 Lsi Logic Corporation Method and apparatus for controlling I/O channels responsive to an availability of a plurality of I/O devices to transfer data US5987535 * Sep 15, 1997 Nov 16, 1999 Xerox Corporation User interface providing immediate status and capability indicators of an imaging system on a network by displaying channel connections, features in use, availability, and current operations * Cited by examiner Referenced by Citing Patent Filing date Publication date Applicant Title US6574755 * Dec 23, 1999 Jun 3, 2003 Lg Information & Communications, Ltd. Method and processing fault on SCSI bus US6633925",
    "hasKeyColumn": true,
    "keyColumnIndex": 2,
    "headerRowIndex": 0
}