{
    "relation": [
        [
            "Date",
            "Oct 22, 1996",
            "Dec 30, 2002",
            "Dec 18, 2006",
            "Dec 13, 2010",
            "Dec 28, 2010",
            "Sep 18, 2012",
            "Nov 27, 2014"
        ],
        [
            "Code",
            "AS",
            "FPAY",
            "FPAY",
            "AS",
            "FPAY",
            "AS",
            "AS"
        ],
        [
            "Event",
            "Assignment",
            "Fee payment",
            "Fee payment",
            "Assignment",
            "Fee payment",
            "Assignment",
            "Assignment"
        ],
        [
            "Description",
            "Owner name: MOTOROLA, INC., ILLINOIS Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNORS:NEWLIN, DOUGLAS J.;BURKE, TIMOTHY M.;REEL/FRAME:008291/0212 Effective date: 19961022",
            "Year of fee payment: 4",
            "Year of fee payment: 8",
            "Owner name: MOTOROLA MOBILITY, INC, ILLINOIS Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNOR:MOTOROLA, INC;REEL/FRAME:025673/0558 Effective date: 20100731",
            "Year of fee payment: 12",
            "Owner name: MOTOROLA MOBILITY LLC, ILLINOIS Free format text: CHANGE OF NAME;ASSIGNOR:MOTOROLA MOBILITY, INC.;REEL/FRAME:029016/0704 Effective date: 20120622",
            "Owner name: GOOGLE TECHNOLOGY HOLDINGS LLC, CALIFORNIA Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNOR:MOTOROLA MOBILITY LLC;REEL/FRAME:034485/0449 Effective date: 20141028"
        ]
    ],
    "pageTitle": "Patent US5922047 - Apparatus, method and system for multimedia control and communication - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US5922047?ie=ISO-8859-1&dq=6,260,087",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 9,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989443.69/warc/CC-MAIN-20150728002309-00156-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 482391663,
    "recordOffset": 482359069,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{30075=Burke et al., U.S. patent application Ser. No. 08/715,887, filed Sep. 18, 1996, entitled \"Videophone Apparatus, Method And System For Audio And Video Conferencing And Telephony\", Motorola Docket No. PD05689AM (the \"third related application\");, 59359=As disclosed in the related applications, the user audio interface 255 preferably includes a SLIC circuit (Subscriber Loop Interface Circuit) which provides \"BORSHT\" functions for telephone service within the user premises; ring generation; an audio codec for the audio portion of a video call or telephony call, providing analog-to-digital conversions for voice digitizing of the input (voice) audio signal originating from the microphone portion of one or more of the telephones 1501 through 150n, and digital-to-analog conversion for voice recovery from an output digital voice data stream or signal (to create the output audio signal to the speaker portion of the telephones 1501 through 150n); and a programmable digital signal processor (DSP) and associated memory (referred to as the voice processing DSP in the related applications, to distinguish another DSP referred to as a video processing DSP). The DSP of the user audio interface 255 contains program memory and data memory to perform signal processing functions such as DTMF/dial pulse detection and generation, analog modem functions, call progress tone (dial tone, busy tone) generation, PCM-to-linear and linear-to-PCM (pulse code modulation) conversion, and speech prompt playback. The memory associated with the DSP, in the preferred embodiment, includes high density read only memory (referred to as speech ROM) containing PCM encoded (or compressed) speech segments used for interaction with the user, such as in prompting the user for keypad DTMF or dial pulse entry when in the video calling or other multimedia modes. In addition, optional speech random access memory may be used for user voice storage functions, and electrically alterable, programmable non-volatile (flash) memory for storage of programs (and updates) or algorithms., 29802=Burke et al., U.S. patent application Ser. No. 08/706,100, filed Aug. 30, 1996, entitled \"Apparatus, Method And System For Audio And Video Conferencing And Telephony\", Motorola Docket No. PD05686AM (the \"second related application\");, 74492=FIG. 3 is a flow diagram illustrating a multimedia control method in accordance with the present invention. FIG. 3 also illustrates the multiple roles or modes of a telephone, such as telephones 1501 through 150n, in the system of the present invention, including providing telephony (POTS), providing multimedia control, and providing the audio portion of a video conference call. Referring to FIG. 3, beginning with start step 300, a request for service is detected, step 305, such as going off hook or receiving an incoming alert signal. Next, in step 310, a user indication or alert is provided, such as a dial tone or an incoming ring signal, and signaling information is collected, such as DTMF digits of a phone number or \"**\". When a non-telephony mode has been requested in step 315, such as through entry of \"**\" or receipt of an incoming message from the network 104, then the method proceeds to step 335. When a non-telephony mode has not been requested in step 315, the method proceeds to request or set up a telephony call, such as generating DTMF tones and connecting an audio path between the user's telephone and the network 104, step 320, followed by entering the transparent telephony mode and transmitting audio (typically PCM) data to the network 104, step 325. The audio data will have been PCM encoded by the user audio interface 255, and will have been transformed into an appropriate digital or analog format (e.g., ISDN, POTS, etc.) by the network interface 110 for transmission to the network 104. When the telephony call is terminated, step 330, the method may end, return step 350., 57127=As disclosed in detail in the related applications, the user audio interface 255 is designed to interface with standard household telephone sets, including wireless devices and speaker phones, such as telephones 1501 through 150n. The user audio interface 255 is intended to support both audio POTS calls and video calls and, in conjunction with the network interface 110, also supports analog modem functions. In addition, in conjunction with one of the physical interfaces 155, such as a telephone 150, keyboard 160, mouse 170, or computer 165, the user audio interface provides for entry of the various control signals utilized, for example, to select media applications or place telephony or video calls. In the preferred embodiment, any of the telephones 150 are utilized for entry of the various control signals, and POTS calls are processed in a \"transparent\" mode, such that placing and receiving telephone calls occur as if no video conferencing or other multimedia functions were present. Also in the preferred embodiment, video calls and multimedia functions are processed as exceptions, requiring a designated or predetermined dialing sequence entered by the user to invoke a video call or another media function., 44147=For example, medium 1451 may be a television, with a corresponding first media communication channel 1421 being, for example, a typical television cable, such as a 75 Ohm coaxial cable. As discussed in greater detail below, the various media 1451 through 145n are operated and controlled through corresponding media application modules 1401 through 140n (collectively media application modules 140). In addition, the correspondence between the various media 145, the corresponding media communication channel 142, and the media application modules 140, may be, but in most instances will not be, a one-to-one correspondence. For example, one or more televisions, as media 145, may be coupled through one or more branches or terminations of a coaxial cable, as a first media communication channel 1421, to the multimedia control apparatus, and operated and controlled by a plurality of media application modules 140, such as a video conferencing module, a digital video module, and an analog broadband video module. Other media 145, such as home or premise automation and control, e.g., lighting, HVAC, premise entertainment and premise security, may be coupled via a premise AC power line, as a second media communication channel 1422, to the multimedia control apparatus, and operated and controlled by a single media application module 140, such as an AC power line signaling interface., 29553=Newlin et al., U.S. patent application Ser. No. 08/658,792, filed Jun. 5, 1996, entitled \"Audio/Visual Communication System and Method Thereof\", Motorola Docket No. PD05634AM (the \"first related application\");, 30934=Newlin et al., U.S. patent application Ser. No. 08/672,819, filed Jun. 28, 1996, entitled \"ISDN Communication System and Method Thereof\", Motorola Docket No. PD05677AM (the \"sixth related application\")., 38176=FIG. 1 is a block diagram illustrating an embodiment of a multimedia control apparatus 101 and multimedia control system 100 in accordance with the present invention. As illustrated in FIG. 1, the multimedia control system 100 includes the multimedia control apparatus 101 and one or more media 145 (such as medium 1451 through medium 145n (collectively media 145)) or telephony media 147 (such as telephony medium 1471 through telephony medium 147n (collectively telephony media 147)). The various media 145 include, for example, video conferencing, video programming and video access control, home or premise automation and control, and voice mail and other messaging systems, with telephony media 147 being a special case or specific subset of media 145. When the media 145 are limited to video conferencing and to telephony, the multimedia control apparatus 101 is substantially and effectively identical to the various video access apparatuses disclosed in the related applications., 47781=Continuing to refer to FIG. 1, through the user interface 120, the multimedia control apparatus 101 is coupled to one or more physical interfaces 155 (for a user to physically access the multimedia control apparatus for the input of one or more control signals), such as a plurality of telephony media 1471 through 147n (collectively referred to as telephony media 147), to a keyboard 160, to a computer mouse 170, and to a computer medium 175. The user interface 120 is implemented preferably as the user audio interface 255 illustrated in FIG. 2 and in the related applications. The telephony media 147 are implemented preferably as telephones or as videophones, with physical input of the plurality of control signals provided through a telephone keypad as DTMF (dual tone multifrequency) or pulse dialing signals, and with audio input and output provided through a microphone and speaker of the various telephones (or videophones). In addition to or in lieu of the telephony media 147, the keyboard 160, the mouse 170, and/or the computer medium 175, may also be utilized to input the plurality of control signals., 30358=Burke et al., U.S. patent application Ser. No. 08/725,602, filed Oct. 3, 1996, entitled \"Apparatus, Method And System For Wireline Audio And Video Conferencing And Telephony\", Motorola Docket No. PD05703AM (the \"fourth related application\");, 61243=The multimedia control apparatus 201 and, more specifically, the microprocessor subsystem 260 and the user audio interface 255 in the preferred embodiment, operate in a plurality of modes, which may vary according to the types of media applications supported. In the preferred embodiment, the plurality of operating modes may be divided into two groups, first, for POTS or other ordinary telephony, and second, for all other multimedia applications (such as video conferencing), which for ease of reference are referred to herein as non-telephony modes (with the understanding that such non-telephony modes include all non- ordinary POTS functionalities, such as videoconferencing (video telephony) or the audio portions of video conferencing). The telephony (POTS) mode is user transparent, as a default mode which is entered whenever the user goes off hook, for example, utilizing a telephone 150. As discussed in greater detail below, the video conferencing and other media application modes are entered as an exception, through the user entering (dialing) a specific, predetermined sequence which, in the preferred embodiment, is not recognized as a telephony sequence. The various modes may be entered by or through the user entering a control signal locally, such as through a telephone 150, or remotely, through control signals entered via a connection from the network 104 through the network interface 110. In the telephony (POTS) mode, the DSP of the user audio interface 255 generates the customary \"dial\" tone when the user telephone (of the telephones 1501 through 150n) goes off hook. The user then enters the dialing sequence via the keypad of a telephone 150, just as in known or customary telephone dialing. The DSP decodes the dialing digits and stores them in a calling memory buffer. Upon decoding the first two digits entered (which are not the first two digits of a specific predetermined non-telephony mode sequence), the DSP recognizes that the requested call is not for a non-telephony media application and, as a consequence, signals the microprocessor subsystem 260 to initiate a POTS call through the network interface 110. When the call is granted (by the network 104) and the audio link is established, the DSP forwards the stored digits to the local digital or analog switch and connects the audio paths between the user's telephone(s) 150 and the network 104. From this point on, the DSP will not decode any dialed digits and will simply pass through the input and output PCM digital voice data stream, until the user's telephone goes on hook and the call is terminated., 43798=Continuing to refer to FIG. 1, the multimedia control apparatus 101 is coupleable to a plurality of media 1451 through 145n, via a corresponding media communication channel 142 (such as a first media communication channel 1421 through a nth media communication channel 142n., 30639=Burke et al., U.S. patent application Ser. No. 08/726,320, filed Oct. 3, 1996, entitled \"Videophone Apparatus, Method And System For Wireline Audio And Video Conferencing And Telephony\", Motorola Docket No. PD05725AM (the \"fifth related application\"); and}",
    "textBeforeTable": "Patent Citations From the foregoing, it will be observed that numerous variations and modifications may be effected without departing from the spirit and scope of the novel concept of the invention. It is to be understood that no limitation with respect to the specific methods and apparatus illustrated herein is intended or should be inferred. It is, of course, intended to cover by the appended claims all such modifications as fall within the scope of the claims. Yet another significant feature of the preferred embodiment of the present invention is the transparency of telephony operation, such that a user need not be aware of the multimedia capability to place or receive a telephone call. In addition, in accordance with the preferred embodiment, the multimedia control system utilizes equipment typically found in consumers' homes or premises, such as existing telephones, and for video applications, existing televisions and video cameras or camcorders. The preferred embodiment also avoids device redundancy, eliminating multiple user interfaces, displays, and control systems and panels. As a consequence, the system may be implemented at relatively low cost, especially compared to the currently available PC-based or stand alone multimedia systems. Moreover, the system of the present invention is user friendly, easy to install and use, avoids device or equipment redundancy, and should be relatively less expensive for in-home purchase and use by consumers. Another particularly innovative feature of the various apparatus and system embodiments of the present",
    "textAfterTable": "Oct 27, 1999 Nov 27, 2001 Tidenet, Inc. Portable conference center US6349329 Sep 29, 1998 Feb 19, 2002 Radiowave.Com, Inc. Coordinating delivery of supplemental materials with radio broadcast material US6370141 * Apr 29, 1998 Apr 9, 2002 Cisco Technology, Inc. Method and apparatus for configuring an internet appliance US6396531 * Dec 31, 1998 May 28, 2002 At+T Corp. Set top integrated visionphone user interface having multiple menu hierarchies US6430174 * Dec 26, 1997 Aug 6, 2002 Nortel Networks Ltd. Communication system supporting simultaneous voice and multimedia communications and method of operation therefore US6449514 * Sep 14, 1999 Sep 10, 2002 Kabushiki Kaisha Toshiba Apparatus and method for network integrated management US6526288 * Apr 20, 1999 Feb 25, 2003 Koninklijke Philips Electronics, N.V. System for connecting a data communication device over wireless terminals to a communication network US6526580",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}