{
    "relation": [
        [
            "Citing Patent",
            "US6575464 *",
            "US7017908",
            "US7575239",
            "US7621534 *",
            "US7762887",
            "US8002281",
            "US8029356 *",
            "US8323097",
            "US20140339769 *"
        ],
        [
            "Filing date",
            "Nov 13, 2001",
            "Apr 18, 2003",
            "Jul 10, 2007",
            "Jan 3, 2007",
            "Dec 4, 2006",
            "Jun 20, 2007",
            "Aug 13, 2004",
            "Sep 30, 2011",
            "Jan 16, 2014"
        ],
        [
            "Publication date",
            "Jun 10, 2003",
            "Mar 28, 2006",
            "Aug 18, 2009",
            "Nov 24, 2009",
            "Jul 27, 2010",
            "Aug 23, 2011",
            "Oct 4, 2011",
            "Dec 4, 2012",
            "Nov 20, 2014"
        ],
        [
            "Applicant",
            "Dominick Fertitta",
            "Eugene Mark Tan",
            "Cohen Jeffrey S",
            "Masterwork Group Limited",
            "G&G Technologies LLC",
            "Np Ip Holdings Llc",
            "Stanley Klein",
            "Stanley Klein",
            "Spencer Thomas"
        ],
        [
            "Title",
            "Playing card poker game with opportunity to bet with “the house”",
            "Matching card game and method of playing the same",
            "Players choice blackjack",
            "Method of conducting a card game",
            "Systems and methods for electronically managing games",
            "Methods and devices for playing a modified baccarat game",
            "Non-transitive wagering game",
            "Non-transitive gaming elements and gaming methods",
            "Cobe (constructive objecttive basic entertainment game of cards and die)"
        ]
    ],
    "pageTitle": "Patent US6488284 - Method and apparatus for playing a game with numerical result - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US6488284?dq=7,603,356",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 6,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989826.86/warc/CC-MAIN-20150728002309-00342-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 481673779,
    "recordOffset": 481651152,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{29662=This application is a continuation-in-part (CIP) of U.S. patent application Ser. No. 09/389,480, filed Sep. 3, 1999 now U.S. Pat No. 6,241,250 which is a CIP of U.S. patent application Ser. No. 09/351,330, filed Jul. 12, 1999, now U.S. Pat. No. 6,164,651, the entire contents of which are hereby incorporated by reference in this application.}",
    "textBeforeTable": "Patent Citations While the invention has been described in connection with what is presently considered to be the most practical and preferred embodiments, it is to be understood that the invention is not to be limited to the disclosed embodiments, but on the contrary, is intended to cover various modifications and equivalent arrangements included within the spirit and scope of the appended claims. With the methodology according to the present invention, drawbacks associated with conventional Baccarat and the like can be eliminated, resulting in a more enjoyable and playable game that is suited for players of all levels. The elimination of card drawing rules increases the speed of play, eliminates player confusion, and avoids an inherent deterioration bias, while the casino operator can adjust a house advantage by determining rules for resolving ties. In this context, referring to FIG. 2, a block diagram is illustrated showing the components of an apparatus configured for playing the game according to the invention. The apparatus includes a display 30, a player interface 32, and circuitry 34, 36 for effecting game play and including structure for establishing first side and second side ranking value results, such as dealing hands of cards, a summing circuit 36 that determines a ranking value of the results, and a processing circuit 34 effecting game play according to the rules of the game. The processing circuit then resolves wagers according to the ranking value results. As would",
    "textAfterTable": "Referenced by Citing Patent Filing date Publication date Applicant Title US6575464 * Nov 13, 2001 Jun 10, 2003 Dominick Fertitta Playing card poker game with opportunity to bet with “the house” US7017908 Apr 18, 2003 Mar 28, 2006 Eugene Mark Tan Matching card game and method of playing the same US7575239 Jul 10, 2007 Aug 18, 2009 Cohen Jeffrey S Players choice blackjack US7621534 * Jan 3, 2007 Nov 24, 2009 Masterwork Group Limited Method of conducting a card game US7762887 Dec 4, 2006 Jul 27, 2010 G&G Technologies LLC Systems and methods for electronically managing games US8002281 Jun 20, 2007 Aug 23, 2011 Np Ip Holdings Llc Methods and devices for playing a modified baccarat game US8029356 * Aug 13, 2004 Oct 4, 2011 Stanley Klein Non-transitive wagering game",
    "hasKeyColumn": true,
    "keyColumnIndex": 4,
    "headerRowIndex": 0
}