{
    "relation": [
        [
            "Citing Patent",
            "US7200571",
            "US7398225",
            "US7424617",
            "US7461022 *",
            "US7467096",
            "US7606730",
            "US7680688",
            "US7686218",
            "US7698185",
            "US7828206",
            "US7835941 *",
            "US7837099 *",
            "US7856377",
            "US7904386",
            "US8126773",
            "US8180671",
            "US8315903",
            "US8321270",
            "US8412623",
            "US8417635",
            "US8423401",
            "US8423402 *",
            "US8447650 *",
            "US8478639",
            "US8478640 *",
            "US8533083",
            "US8650077",
            "US8700523",
            "US8725564 *",
            "US8725568",
            "US8732073",
            "US8768830",
            "US8965810",
            "US9031859",
            "US20020015389 *",
            "US20020019778 *",
            "US20040210448 *",
            "US20040243468 *",
            "US20050033616 *",
            "US20070130054 *",
            "US20110015955 *",
            "US20110078008 *",
            "US20120143667 *",
            "US20130036001 *",
            "US20140222542 *",
            "WO2005088508A1 *",
            "WO2009048806A1 *"
        ],
        [
            "Filing date",
            "Aug 11, 2000",
            "Apr 17, 2001",
            "Dec 31, 2003",
            "Oct 20, 1999",
            "Mar 3, 2003",
            "Jun 25, 2002",
            "Sep 30, 2002",
            "Sep 27, 2007",
            "Apr 28, 2005",
            "Sep 27, 2007",
            "Jan 21, 2005",
            "Aug 10, 2006",
            "Mar 11, 2004",
            "Jul 27, 2006",
            "Aug 10, 2006",
            "Mar 11, 2004",
            "Nov 15, 2010",
            "Sep 21, 2009",
            "Apr 11, 2003",
            "Jan 31, 2011",
            "Jul 8, 2010",
            "Jul 19, 2012",
            "Jun 7, 2011",
            "Oct 23, 2012",
            "Oct 7, 2010",
            "Mar 23, 2010",
            "Apr 23, 2013",
            "Oct 11, 2005",
            "Apr 2, 2013",
            "May 13, 2013",
            "Aug 6, 2010",
            "Sep 8, 2011",
            "Apr 14, 2014",
            "May 20, 2010",
            "Jun 18, 2001",
            "Apr 4, 2001",
            "Jun 10, 2004",
            "Mar 11, 2004",
            "Aug 3, 2004",
            "Feb 2, 2007",
            "",
            "Oct 7, 2010",
            "Jun 7, 2011",
            "Aug 6, 2012",
            "Oct 31, 2013",
            "Mar 3, 2005",
            "Oct 3, 2008"
        ],
        [
            "Publication date",
            "Apr 3, 2007",
            "Jul 8, 2008",
            "Sep 9, 2008",
            "Dec 2, 2008",
            "Dec 16, 2008",
            "Oct 20, 2009",
            "Mar 16, 2010",
            "Mar 30, 2010",
            "Apr 13, 2010",
            "Nov 9, 2010",
            "Nov 16, 2010",
            "Nov 23, 2010",
            "Dec 21, 2010",
            "Mar 8, 2011",
            "Feb 28, 2012",
            "May 15, 2012",
            "Nov 20, 2012",
            "Nov 27, 2012",
            "Apr 2, 2013",
            "Apr 9, 2013",
            "Apr 16, 2013",
            "Apr 16, 2013",
            "May 21, 2013",
            "Jul 2, 2013",
            "Jul 2, 2013",
            "Sep 10, 2013",
            "Feb 11, 2014",
            "Apr 15, 2014",
            "May 13, 2014",
            "May 13, 2014",
            "May 20, 2014",
            "Jul 1, 2014",
            "Feb 24, 2015",
            "May 12, 2015",
            "Feb 7, 2002",
            "Feb 14, 2002",
            "Oct 21, 2004",
            "Dec 2, 2004",
            "Feb 10, 2005",
            "Jun 7, 2007",
            "Jan 20, 2011",
            "Mar 31, 2011",
            "Jun 7, 2012",
            "Feb 7, 2013",
            "Aug 7, 2014",
            "Sep 22, 2005",
            "Apr 16, 2009"
        ],
        [
            "Applicant",
            "Schoeneckers, Inc.",
            "American Express Travel Related Services Company, Inc.",
            "Yahoo! Inc.",
            "Yahoo! Inc.",
            "American Express Travel Related Services Company, Inc.",
            "American Express Travel Relate Services Company, Inc.",
            "American Express Travel Related Services Company, Inc.",
            "American Express Travel Related Services Company, Inc.",
            "Loylogic, Inc.",
            "American Express Travel Related Services Company, Inc.",
            "J2 Global Communications",
            "Oracle International Corporation",
            "American Express Travel Related Services Company, Inc.",
            "American Express Travel Related Services Company, Inc.",
            "Oracle International Corporation",
            "Propulsion Remote Holdings, Llc",
            "J2 Global Communications",
            "American Express Travel Related Services Company, Inc.",
            "Citicorp Credit Services, Inc.",
            "American Express Travel Related Services Company, Inc.",
            "American Express Travel Related Services Company, Inc.",
            "Signature Systems Llc",
            "Signature Systems Llc",
            "American Express Travel Related Services Company, Inc.",
            "Signature Systems Llc",
            "Loylogic Licensing Inc.",
            "American Express Travel Related Services Company, Inc.",
            "American Express Travel Related Services Company, Inc.",
            "Signature Systems Llc",
            "Visa U.S.A. Inc.",
            "Propulsion Remote Holdings, Llc",
            "Citibank, N.A.",
            "Visa U.S.A. Inc.",
            "Visa U.S.A. Inc.",
            "Robert Wastlhuber",
            "Larry Isaacson",
            "American Express Travel Related Services Company, Inc.",
            "American Express Travel Related Services Company, Inc.",
            "Ezrez Software, Inc.",
            "Jenniges Joseph C",
            "American Express Travel Related Services Company, Inc.",
            "Signature Systems Llc",
            "Signature Systems Llc",
            "Triliant, LLC",
            "Signature Systems Llc",
            "American Express Travel Relate",
            "First Data Corp"
        ],
        [
            "Title",
            "Computerized auction system for use with multiple purchasing media",
            "System and method for networked loyalty program",
            "Offline-online incentive points system and method",
            "Auction redemption system and method",
            "System and method for the real-time transfer of loyalty points between accounts",
            "System and method for a multiple merchant stored value card",
            "System and method for exchanging loyalty points for acquisitions",
            "System and method for exchanging loyalty points for acquisitions",
            "Methods and systems for generating dynamic reward currency values",
            "System and method for exchanging loyalty points for acquisitions",
            "Method for cross-promoting communications services",
            "Partner account debit process",
            "Geographic loyalty system and method",
            "System, method, and computer program product for saving and investing through use of transaction cards",
            "Configurable enrollment data capture framework",
            "Point pooling loyalty system and method",
            "Method for cross-promoting communications services",
            "System and method for a multiple merchant stored value card",
            "Method and system for a multi-purpose transactional platform",
            "System, method, and computer program product for saving and investing through use of transaction cards",
            "System and method for redeeming vouchers",
            "Method and system for electronic exchange of reward points",
            "System and method for designating accounts from which to trade rewards",
            "System and method for a multiple merchant stored value card",
            "System and method for using a card linked to a reward point exchange account for purchase transactions",
            "Method and systems for generating dynamic rewards currency values",
            "System and method for a multiple merchant stored value card",
            "System and method for delegating management of a financial transaction account to a designated assistant",
            "Method and system for electronic exchange of reward points",
            "Coupon bearing sponsor account transaction authorization",
            "Pay yourself first with revenue generation",
            "Method and system for a multi-purpose transactional platform",
            "Coupon bearing sponsor account transaction authorization",
            "Rebate automation",
            "Method and device for serial data transmission between a position measuring system and a processing unit",
            "System and method for placing on-line orders",
            "System for facilitating a transaction",
            "Geographic loyalty system and method",
            "Travel management system providing customized travel plan",
            "Computerized Auction System For Use With Multiple Purchasing Media",
            "System and method for exchanging loyalty points for acquisitions",
            "System for electronic barter, trading and redeeming points accumulated in frequent use reward programs",
            "System and method for designating accounts from which to trade rewards",
            "System for an integrated multi-vendor customer loyalty and targeted marketing program and method for its use",
            "Method and system for electronic exchange of reward points",
            "Credit card reward program",
            "Systems and methods for stored-value exchange within social networking environments"
        ]
    ],
    "pageTitle": "Patent US6829586 - Method and system for aggregation of reward points for payment of auctioned ... - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US6829586?dq=6272333",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 7,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988051.33/warc/CC-MAIN-20150728002308-00337-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 474810991,
    "recordOffset": 474780497,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{60480=The prior art does not provide for a consumer to utilize relatively small amounts of reward points in any manner. In addition, a consumer often can only redeem points in an airline-related manner (i.e. to obtain a free ticket or upgrade from coach to first class). This prior art does not recognize the need for a consumer to exchange reward points for non-travel related goods, and in particular renders relatively small numbers of points useless. For example, a consumer that does not travel often may have 500 points in United Airlines, 700 points in USAir, and 1000 points in TWA, each of which is relatively useless in the prior art., 52103=This application is a continuation application of co-pending application Ser. No. 10/608,736, filed Jun. 27, 2003, which is a continuation of Ser. No. 09/602,222, filed Jun. 23, 2000, now U.S. Pat. No. 6,594,640, which is based on and claims filing priority of U.S. provisional patent application Ser. No. 60/140,603, filed on Jun. 23, 1999., 56349=U.S. Pat. No. 5,794,210, ATTENTION BROKERAGE, issued on Aug. 11, 1998 to CyberGold, Inc. The '210 patent describes a system that makes immediate payment to a user for paying attention to an advertisement or other “negatively priced” information distributed over the Internet. A special icon or other symbol displayed on a computer screen may represent compensation and allow users to choose whether they will view an ad or other negatively priced information and receive associated compensation. The points accumulated can then be used to purchase “positively priced information” or products., 80947=The trading server may also be contacted in response to a button or hyperlink located on a web page accessible by the user from the airline reward server (FIG. 10, steps 1000 and 1002). The process may continue to that described with respect to FIG. 6 for trading points into a reward exchange account (step 1004). In a similar manner, hyperlinks or calling routines may allow a user to access a reservations system or merchant from the trading server. The link would direct the user to partner or associated air carriers where the points in a user exchange account on the trading server 20 may be used to acquire reduced fare flights., 54467=U.S. Pat. No. 5,774,870, FULLY INTEGRATED, ON-LINE INTERACTIVE FREQUENCY AND AWARD REDEMPTION PROGRAM, issued to Netcentives, Inc. on Jun. 30, 1998. The '870 patent provides a system whereby the user can make purchase of products over the Internet and receive award points, which are stored in an associated database. The user can subsequently view an award catalog to determine which awards he may be able to redeem based on the number of points in his account. This patent does not teach, however, the ability of a user to trade-in his points accumulated in a pre-existing frequent flyer account in order to make purchases of products from the award catalog or allow the points to be pooled with other programs in order to gain further purchasing power., 57501=U.S. Pat. No. 5,025,372, SYSTEM AND METHOD FOR ADMINISTRATION OF INCENTIVE AWARD PROGRAM THROUGH USE OF CREDIT, issued on Jun. 18, 1991 to Meridian Enterprises, Inc. The '372 patent describes an incentive award program in which credit is awarded to participants based on the participant meeting a designated level of performance under the system. This patent does not teach the ability to increase the reward points in a user's account by redeeming points from a pre-existing account such as a frequent flyer mileage program.}",
    "textBeforeTable": "Patent Citations In addition, the value of the reward points may fluctuate as a function of the company's performance, which may be measured by reference to the price of its stock, revenue, earnings, or some other parameter that is agreed to that reflects the relative performance of the company. In this manner, companies that perform well would provide an additional incentive to a user for using their frequent use program rather than a competitor's program. For example, all other parameters being the same, a user would likely choose the Acme credit card company over the Beta credit card company when the user determines that the Acme company performance results in a 10% increase in the number of points otherwise earned by using its credit card. The value may also fluctuate as a function of the number of points outstanding or the desirability of the issuer to reduce its liability or make it more robust. In another aspect of the invention, an electronic bartering system is implemented, wherein product manufacturers, producers, distributors, etc. can provide surplus or overstocked goods for liquidation into the chain of supply of the system and exchange then for points as described herein. This provides an inventory management and liquidation system for these manufacturers and sellers. The interface would allow a user to login using the frequent flyer account information or preferably, the trading server account login id and password, where the user may use",
    "textAfterTable": "US8533083 Mar 23, 2010 Sep 10, 2013 Loylogic Licensing Inc. Method and systems for generating dynamic rewards currency values US8650077 Apr 23, 2013 Feb 11, 2014 American Express Travel Related Services Company, Inc. System and method for a multiple merchant stored value card US8700523 Oct 11, 2005 Apr 15, 2014 American Express Travel Related Services Company, Inc. System and method for delegating management of a financial transaction account to a designated assistant US8725564 * Apr 2, 2013 May 13, 2014 Signature Systems Llc Method and system for electronic exchange of reward points US8725568 May 13, 2013 May 13, 2014 Visa U.S.A. Inc. Coupon bearing sponsor account transaction authorization US8732073 Aug 6, 2010 May 20, 2014 Propulsion Remote Holdings, Llc Pay yourself first with revenue generation US8768830 Sep 8, 2011 Jul 1, 2014 Citibank, N.A. Method and system for a multi-purpose transactional platform US8965810 Apr 14, 2014 Feb 24,",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}