{
    "relation": [
        [
            "Cited Patent",
            "US1630048 *",
            "US1777554 *",
            "US1795037 *",
            "US1834818 *",
            "US1857565 *",
            "US2206685 *",
            "US3049874 *",
            "US3065595 *",
            "US3255123 *",
            "AU106448A *",
            "FR659684A *"
        ],
        [
            "Filing date",
            "Jul 1, 1924",
            "May 3, 1927",
            "Jun 15, 1927",
            "Jul 30, 1929",
            "Jun 24, 1929",
            "Mar 19, 1935",
            "Oct 30, 1958",
            "May 9, 1960",
            "Jun 18, 1963",
            "",
            ""
        ],
        [
            "Publication date",
            "May 24, 1927",
            "Oct 7, 1930",
            "Mar 3, 1931",
            "Dec 1, 1931",
            "May 10, 1932",
            "Jul 2, 1940",
            "Aug 21, 1962",
            "Nov 27, 1962",
            "Jun 7, 1966",
            "",
            ""
        ],
        [
            "Applicant",
            "Balachowsky Dmitry",
            "Ducloux Albert",
            "Le Carbone Sa",
            "Brevets Catalex Soc D",
            "August Pahl",
            "Balachowsky Dmitri",
            "Exxon Research Engineering Co",
            "Wright W Gary",
            "Universal Oil Prod Co",
            "",
            ""
        ],
        [
            "Title",
            "Process for utilizing hydrocarbons in internal-combustion engines and apparatus therefor",
            "Process and apparatus for improving explosive mixtures for internal-combustion engines and other purposes",
            "Carbureting process and apparatus",
            "Catalytic mixer",
            "Surface carburetor",
            "Catalyzer",
            "Radioactive ionizer for a combination changer",
            "Catalytic converter system for internal combustion engines",
            "Formed catalyst shapes and method of preparation",
            "Title not available",
            "Title not available"
        ]
    ],
    "pageTitle": "Patent US3828736 - Method and apparatus for operating combustion engines - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US3828736?dq=%235,519,867",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 5,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988051.33/warc/CC-MAIN-20150728002308-00313-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 489943039,
    "recordOffset": 489923617,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{26004=20101124 8C0a+8HaO+48Na 2.502+10N;| W W M... fuel exhaust gas fresh air ZIOHi-l-QCO-l-IOCOr-HiSNn approximately 16 keel/M01 of fuel., 8674=11 I: 111a States .1 atent 1 1 1 1 3,828,736 Koch 1 1 Aug. 13, 1974 [54] METHOD AND APPARATUS FOR 1,857,565 5/1932 Pahl et a1. 123/119 E QPERATING COMBUSTHON ENGINES 2,206,685 7/1940 Ba1achowsky.. 123/119 E 3,049,874 8/1962 Morrow et a1...... 123/191 A X [75] Inventor: Ch stia o Erlangen, Germany 3,055,595 11/1962 Gary 60/299 Assignee: Siemens Akfiengeseuschafi, Berlin, 3,255,123 6/1966 Haersel 60/299 Germany FOREIGN PATENTS OR APPLICATIONS 22 Filed; Jan. 1 1972 106,448 2/1939 Australia 123/119 E 659,684 2/1929 France 123/119 E [21] Appl. No.: 218,696, 9253=1 Primary ExaminerWende11E. Burns [30] Foreign Application Priority Data A1130! g Firm-Herbeft Lerner Jan. 22, 1971 Germany 2103008 1 [57] ABSTRACT Cl 123/3 123/1 123/119 Method and apparatus for the combustion of a fuel, Int Cl 123/ g i g/ 332 free of detrimental substances, in a combustion en- Q n i a [58] meld of 123/119 191 119 passed over a cata1yst for conversion into a gas mix- 60/299 ture of methane and carbon monoxide. Passing the gas mixture together with additional oxygen containing [56] References C'ted gas to the combustion engine whereat the gas mixture UNITED STAT S PATENTS is burned producing an exhaust gas. Feeding part of 1,630,048 4/1927 Balachowsky et a1 123/119 E the exhaust gas to the fuel, prior to the conversion of 1,777,554 10/1930 Ducloux 123/119 E the fuel. 1,795,037 3/1931 Portail 123/119 E 12/1931 Balachowsky et a1 123/119 E 14 Clams, l Drawmg Figure AIR METHOD AND APPARATUS FOR OPERATING COMBUSTIUN ENGINES additives such as lead compounds. While these substances assure a high quality of the fuels and improve their combustion properties, their use also entails disadvantages and not inconsiderable danger. These substances constitute a source of air and environment polution and, in particular, cause the appearance of substances injurious to health, in the exhaust gases of the combustion engines., 26556=201011.14 490,+196Na 32CO2-I-34HnO-I-196N:, 20507=One can also see from the reaction equation above that exhaust gas and fresh air are advantageously admixed with the evaporated fuel in a ratio of 1:1 prior to entering the catalyst chamber. About 1.8 liter of exhaust gas and fresh air are used here, for instance, to l g of fuel. The ratio between exhaust gas and fresh air can also be chosen differently. To the gas mixture, leaving the catalyst chamber there is admixed, prior to entering the combustion engine, fresh air, preferably in such a quantity that a combustion as complete as possible is ensured in the combustion engine.}",
    "textBeforeTable": "Patent Citations 14. Device according to claim 10 comprising an ignition device located at said entrance to said catalytic chamber, and a burner plate disposed adjacent to and upstream of the sintered body closest to said entrance in flow direction of the fuel and gas mixture. 13. Device according to claim 10 wherein said plurality of sintered bodies comprises a first sintered body located closest to said entrance to said catalytic chamber and containing platinum as catalyst, and three succeeding sintered bodies in flow direction of the fuel and gas mixture containing a platinum-nickel mixed catalyst. 12. Device according to claim 10 wherein at least the closest sintered body to said entrance to said catalytic chamber contains a catalyst differing from that contained in the next succeeding sintered bodies in direction of flow of the fuel and gas mixture. 11. Device according to claim 10 including heat exchanger means located adjacent said catalytic chamber and said evaporator, said heat exchanger means being connectible to the exhaust discharge of the combustion engine for passing hot exhaust gases therethrough to heat said catalytic chamber and said evaporator. 10. A device for the operation of combustion engines which comprises a catalytic chamber, a catalystcontaining porous catalyst carrier disposed in said catalytic chamber, said catalyst carrier comprising a plurality of highly porous sintered bodies spaced one from the other in flow direction of",
    "textAfterTable": "* Cited by examiner Referenced by Citing Patent Filing date Publication date Applicant Title US3901197 * May 1, 1974 Aug 26, 1975 Toyota Motor Co Ltd Method and device for reforming the quality of fuel oil in an internal combustion engine US3908606 * Jan 4, 1974 Sep 30, 1975 Toyota Motor Co Ltd Internal combustion engine US3915125 * Feb 6, 1974 Oct 28, 1975 Siemens Ag Method for the operation of internal-combustion engines and gas reformer for implementing the method US3918412 * Sep 14, 1973 Nov 11, 1975 Lindstroem Ab Olle Fuel treatment for combustion engines US3930476 * Mar 22, 1973 Jan 6, 1976 Siemens Aktiengesellschaft Internal combustion engine system US3954423 * Feb 6, 1974 May 4, 1976 Siemens Ag Quick",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}