{
    "relation": [
        [
            "Citing Patent",
            "US5739676 *",
            "US6314918",
            "US6369549",
            "US7019495",
            "US7245111 *",
            "US7291933 *",
            "US7365519 *",
            "US7414326"
        ],
        [
            "Filing date",
            "Nov 4, 1996",
            "Jun 10, 1999",
            "Oct 5, 1998",
            "Aug 28, 2003",
            "Nov 17, 2004",
            "Apr 11, 2007",
            "Apr 6, 2005",
            "Jun 18, 2007"
        ],
        [
            "Publication date",
            "Apr 14, 1998",
            "Nov 13, 2001",
            "Apr 9, 2002",
            "Mar 28, 2006",
            "Jul 17, 2007",
            "Nov 6, 2007",
            "Apr 29, 2008",
            "Aug 19, 2008"
        ],
        [
            "Applicant",
            "Ford Motor Company",
            "Mcfarland Steve",
            "Ford Global Tech., Inc.",
            "C.E. Neihoff & Co.",
            "Ballard Commercial Industries Inc.",
            "Ron Heidebrink",
            "Basler Electric Company",
            "Ballard Commercial Industries, Inc."
        ],
        [
            "Title",
            "Multiple-alternator electrical system",
            "Renewable fuel generating system",
            "Motor vehicle electrical system with multiple generators",
            "Inter-regulator control of multiple electric power sources",
            "Regulator system for alternator",
            "Double alternator and electrical system for a vehicle",
            "Excitation system having inner loop voltage regulator with by-pass capability",
            "Regulator system for alternator"
        ]
    ],
    "pageTitle": "Patent US5600232 - Alternator system for a vehicle - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US5600232?ie=ISO-8859-1",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 6,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988051.33/warc/CC-MAIN-20150728002308-00045-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 494634103,
    "recordOffset": 494618547,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Patent Citations Having described the preferred embodiment, it will become apparent that various modifications can be made without departing from the scope of the invention as defined in the accompanying claims. In operation, assuming initially that the vehicle is equipped only with the original engine alternator 12, the circuit 50 is absent and the connector section 22a is plugged directly into the connector section 22b for conventional charging operation. If for any reason it is desirable to increase the charging capacity of the system, the auxiliary alternator 52 is connected by a conventional mounting (not shown) to the engine 10. The additional regulator 72 is connected to the vehicle and the wiring harness 60 is installed by plugging in the connectors 68 and 70. The connector sections 22a and 22b are separated, the connector section 92a is plugged into the connector section 22b, and the connector section 22a is plugged into the connector section 92b. The leads 106 and 108 are connected to the positive and negative terminals of the battery 14. The system permits the original alternator circuit including the original wiring harness 20a, 20b to be utilized, with the auxiliary alternator circuit providing additional capacity when necessary. The above-described connecting arrangement provides easy installation, redundancy in case one of the alternator systems fails, and easy isolation of the systems if necessary for trouble-shooting or to maintain the vehicle operational when one of the systems does fail.",
    "textAfterTable": "US5245267 * Apr 8, 1992 Sep 14, 1993 Valeo Equipements Electriques Moteur Indicating means in a double voltage motor vehicle electrical circuit US5254936 * Sep 14, 1992 Oct 19, 1993 General Motors Corporation Dual generator electrical system * Cited by examiner Referenced by Citing Patent Filing date Publication date Applicant Title US5739676 * Nov 4, 1996 Apr 14, 1998 Ford Motor Company Multiple-alternator electrical system US6314918 Jun 10, 1999 Nov 13, 2001 Mcfarland Steve Renewable fuel generating system US6369549 Oct 5, 1998 Apr 9, 2002 Ford Global Tech., Inc. Motor vehicle electrical system with multiple generators US7019495 Aug 28, 2003 Mar 28, 2006 C.E. Neihoff & Co. Inter-regulator control of multiple electric power sources US7245111 * Nov 17, 2004 Jul",
    "hasKeyColumn": true,
    "keyColumnIndex": 3,
    "headerRowIndex": 0
}