{
    "relation": [
        [
            "Citing Patent",
            "US7483296 *",
            "US7499352",
            "US7602645 *",
            "US7652910 *",
            "US7724578",
            "US7919800",
            "US8203866",
            "US8227301",
            "US8451650",
            "US8498140",
            "US8518774 *",
            "US8547738",
            "US8582350",
            "US8710566",
            "US8724372",
            "US8767458 *",
            "US8787072",
            "US8812824",
            "US8816417",
            "US9019759",
            "US9064730",
            "US9076543",
            "US9093311",
            "CN101689550B",
            "WO2009046114A2 *"
        ],
        [
            "Filing date",
            "Sep 22, 2005",
            "May 17, 2007",
            "Sep 26, 2008",
            "Jun 30, 2007",
            "Dec 15, 2006",
            "Feb 26, 2007",
            "Mar 28, 2011",
            "Dec 9, 2009",
            "Jun 15, 2012",
            "Oct 1, 2008",
            "Mar 21, 2008",
            "Mar 14, 2011",
            "May 24, 2013",
            "Mar 4, 2010",
            "Oct 10, 2013",
            "Oct 6, 2013",
            "Dec 29, 2009",
            "Jun 13, 2007",
            "Feb 25, 2010",
            "Oct 1, 2013",
            "Apr 28, 2014",
            "Feb 1, 2010",
            "Jun 9, 2014",
            "Jun 25, 2008",
            "Oct 1, 2008"
        ],
        [
            "Publication date",
            "Jan 27, 2009",
            "Mar 3, 2009",
            "Oct 13, 2009",
            "Jan 26, 2010",
            "May 25, 2010",
            "Apr 5, 2011",
            "Jun 19, 2012",
            "Jul 24, 2012",
            "May 28, 2013",
            "Jul 30, 2013",
            "Aug 27, 2013",
            "Oct 1, 2013",
            "Nov 12, 2013",
            "Apr 29, 2014",
            "May 13, 2014",
            "Jul 1, 2014",
            "Jul 22, 2014",
            "Aug 19, 2014",
            "Aug 26, 2014",
            "Apr 28, 2015",
            "Jun 23, 2015",
            "Jul 7, 2015",
            "Jul 28, 2015",
            "Oct 30, 2013",
            "Apr 9, 2009"
        ],
        [
            "Applicant",
            "Ferdinando Bedeschi",
            "Innovative Silicon Isi Sa",
            "Innovative Silicon Isi Sa",
            "Intel Corporation",
            "Globalfoundries Inc.",
            "Micron Technology, Inc.",
            "Micron Technology, Inc.",
            "International Business Machines Corporation",
            "Micron Technology, Inc.",
            "University Of Florida Research Foundation, Inc.",
            "Micron Technology, Inc.",
            "Micron Technology, Inc.",
            "Micron Technology, Inc.",
            "Micron Technology, Inc.",
            "Micron Technology, Inc.",
            "Zeno Semiconductor, Inc.",
            "University Of Florida Research Foundation, Inc.",
            "International Business Machines Corporation",
            "Samsung Electronics Co., Ltd.",
            "Micron Technology, Inc.",
            "Micron Technology, Inc.",
            "Micron Technology, Inc.",
            "Micron Technology, Inc.",
            "英特尔公司",
            "Jerry G Fossum"
        ],
        [
            "Title",
            "Memory device with unipolar and bipolar selectors",
            "Integrated circuit having memory array including row redundancy, and method of programming, controlling and/or operating same",
            "Method and apparatus for varying the programming duration and/or voltage of an electrically floating body transistor, and memory cell array implementing same",
            "Floating body memory array",
            "Sensing device for floating body cell memory and method thereof",
            "Capacitor-less memory cells and cell arrays",
            "Capacitor-less memory cell, device, system and method of making same",
            "Semiconductor device structures with floating body charge storage and methods for forming such semiconductor device structures",
            "Capacitor-less memory cell, device, system and method of making same",
            "Two-transistor floating-body dynamic memory cell",
            "Manufacturing process for zero-capacitor random access memory circuits",
            "Techniques for providing a semiconductor memory device",
            "Capacitor-less memory cell, device, system and method of making same",
            "Techniques for forming a contact to a buried diffusion layer in a semiconductor memory device",
            "Capacitor-less memory cell, device, system and method of making same",
            "Dual-port semiconductor memory and first in first out (FIFO) memory having electrically floating body transistor",
            "Floating-body/gate DRAM cell",
            "Method and apparatus for employing multi-bit register file cells and SMT thread groups",
            "Semiconductor devices and methods of forming semiconductor devices",
            "Techniques for providing a semiconductor memory device",
            "Techniques for forming a contact to a buried diffusion layer in a semiconductor memory device",
            "Techniques for providing a direct injection semiconductor memory device",
            "Techniques for providing a semiconductor memory device",
            "浮体存储器阵列",
            "Two-transistor floating-body dynamic memory cell"
        ]
    ],
    "pageTitle": "Patent US7085153 - Semiconductor memory cell, array, architecture and device, and method of ... - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US7085153?dq=6985872",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 7,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989826.86/warc/CC-MAIN-20150728002309-00301-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 476810435,
    "recordOffset": 476768513,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{6447=Another type of dynamic random access memory cell is described and illustrated in non-provisional patent application entitled “Semiconductor Memory Device”, which was filed on Jun. 10, 2003 and assigned Ser. No. 10/450,238 (hereinafter “Semiconductor Memory Device Patent Application”). With reference to FIGS. 1A and 1B, the Semiconductor Memory Device Patent Application discloses, among other things, semiconductor DRAM device 10 in which each memory cell 12 consists of transistor 14 having gate 16, body region 18, which is electrically floating, source region 20 and drain region 22. The body region 18 is disposed between and adjacent to source region 20 and drain region 22. Data is written into or read from a selected memory cell by applying suitable control signals to a selected word line(s) 24, a selected source line(s) 26 and/or a selected bit line(s) 28. In response, charge carriers are accumulated in or emitted and/or ejected from electrically floating body region 18 wherein the data states are defined by the amount of carriers within electrically floating body region 18. Notably, the entire contents of the Semiconductor Memory Device Patent Application, including, for example, the features, attributes, architectures, configurations, materials, techniques and advantages described and illustrated therein, are incorporated by reference herein.}",
    "TableContextTimeStampAfterTable": "{59739=This application claims priority to: U.S. Provisional Application Ser. No. 60/470,385, entitled “Two Transistor Gain Cell”, filed May 13, 2003 (hereinafter “the Provisional Application”). The contents of the Provisional Application are incorporated by reference herein in their entirety., 114865=Further, memory cell(s) 102 (as well as memory array and matrices 40 a–n) may also employ the structure, features, attributes, architectures, configurations, materials, techniques and advantages described and illustrated in non-provisional patent application entitled “Semiconductor Device”, which was filed on Feb. 18, 2004, by Fazan and Okhonin, and assigned Ser. No. 10/487,157 (hereinafter “Semiconductor Device Patent Application”). The entire contents of the Semiconductor Device Patent Application, including, for example, the inventions, features, attributes, architectures, configurations, materials, techniques and advantages described and illustrated therein, are hereby incorporated by reference herein.}",
    "textBeforeTable": "Patent Citations Further, memory cell(s) 102 (as well as memory array and matrices 40 a–n) may also employ the structure, features, attributes, architectures, configurations, materials, techniques and advantages described and illustrated in non-provisional patent application entitled “Semiconductor Device”, which was filed on Feb. 18, 2004, by Fazan and Okhonin, and assigned Ser. No. 10/487,157 (hereinafter “Semiconductor Device Patent Application”). The entire contents of the Semiconductor Device Patent Application, including, for example, the inventions, features, attributes, architectures, configurations, materials, techniques and advantages described and illustrated therein, are hereby incorporated by reference herein. Notably, where P-channel type transistors are employed as memory cells 12 in the memory array(s), suitable clear, write, read and inhibit voltages are well known to those skilled in the art in light of this disclosure. Accordingly, for sake of brevity, these discussions will not be repeated. While a significant portion of this description includes details (for example, clear, write, read and inhibit voltages) directed to N-channel transistors, the inventions (and embodiments thereof described herein are entirely applicable to P-channel transistors. In such embodiments, majority carriers in body region 18 are electrons and minority carriers are holes. Indeed, the memory arrays may be comprised of N-channel, P-channel and/or both types of transistors. Moreover, the circuitry that is peripheral to the memory array (for example, row and column address decoders, not illustrated herein) may include P-channel and/or N-channel type transistors, including transistors like transistor 14.",
    "textAfterTable": "US5627092 Sep 26, 1994 May 6, 1997 Siemens Aktiengesellschaft Deep trench dram process on SOI for low leakage DRAM cell US5631186 Dec 28, 1995 May 20, 1997 Samsung Electronics Co., Ltd. Method for making a dynamic random access memory using silicon-on-insulator techniques US5696718 Nov 6, 1995 Dec 9, 1997 Commissariat A L'energie Atomique Device having an electrically erasable non-volatile memory and process for producing such a device US5740099 Feb 5, 1996 Apr 14, 1998 Nec Corporation Semiconductor memory device having peripheral circuit and interface circuit fabricated on bulk region out of silicon-on-insulator region for memory cells US5778243 Jul 3, 1996 Jul 7, 1998 International Business Machines Corporation Multi-threaded cell for a memory US5780906 Feb 10, 1997 Jul 14, 1998 Micron Technology, Inc. Static memory cell and method of manufacturing a static memory cell US5784311 Jun 13, 1997 Jul 21, 1998 International Business Machines Corporation Two-device memory cell on SOI for merged logic and memory applications US5811283",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}