{
    "relation": [
        [
            "Citing Patent",
            "US8262700",
            "US8475500 *",
            "US8632591",
            "US8685100",
            "US8974497",
            "US8992579 *",
            "US9060815",
            "US20080119858 *",
            "US20090069849 *",
            "US20140074169 *"
        ],
        [
            "Filing date",
            "Jul 11, 2008",
            "Jun 14, 2007",
            "Oct 17, 2007",
            "Feb 15, 2008",
            "Dec 17, 2007",
            "Mar 8, 2012",
            "Mar 15, 2013",
            "Jun 14, 2007",
            "Sep 10, 2007",
            "Sep 13, 2012"
        ],
        [
            "Publication date",
            "Sep 11, 2012",
            "Jul 2, 2013",
            "Jan 21, 2014",
            "Apr 1, 2014",
            "Mar 10, 2015",
            "Mar 31, 2015",
            "Jun 23, 2015",
            "May 22, 2008",
            "Mar 12, 2009",
            "Mar 13, 2014"
        ],
        [
            "Applicant",
            "Ldr Medical",
            "Spine Wave, Inc.",
            "Ldr Medical",
            "Ldr Medical",
            "Ldr Medical",
            "Nuvasive, Inc.",
            "Nuvasive, Inc.",
            "Spine Wave, Inc.",
            "Oh Younghoon",
            "Warsaw Orthopedic, Inc."
        ],
        [
            "Title",
            "Transverse spinal linking device and system",
            "Multi-axial spinal fixation system",
            "Nucleus prostheses",
            "Interveterbral disc prosthesis insertion assemblies",
            "Vertebral support device",
            "Lateral fixation constructs and related methods",
            "Systems and methods for performing spine surgery",
            "Multi-Axial Spinal Fixation System",
            "Dynamic screw system",
            "Spinal correction system and method"
        ]
    ],
    "pageTitle": "Patent US8162988 - Plate for osteosynthesis device and method of preassembling such device - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US8162988?dq=6,408,309",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 7,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988051.33/warc/CC-MAIN-20150728002308-00240-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 473905331,
    "recordOffset": 473873010,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Patent Citations It must be clear to those skilled in the art that the present invention enables other embodiments in numerous other specific forms without leaving the scope of the invention as claimed. As a result, the present embodiments must be considered as illustrations, but may be modified in the field defined by the scope of the fixed claims, and the invention must not be restricted to the details given above. ) their nut 4 on the plate 2 itself resting on the plate support 3 which rests on the shoulder or on the screw head 102 of the implant. Naturally, said clamping may be carried out using other parts not mentioned, such as washers or locking devices of known types. FIG. 4 Once the implants have been completely screwed on, the plate is locked in the attachment structure of the implants, by clamping ( , rotating the implant by means of a rotation of the clamping support 12. Since the plate 2 is already in position and held in place by the attachment structure of the implants, this additional screwing of the implants drives the plate to its desired final position close to the spine. Therefore, this driving obtained by screwing the implants makes it possible to reduce the size determined by said plate, by tightening or inlaying said plate firmly and easily on the surface of the spine.",
    "textAfterTable": "US4773402 Aug 19, 1987 Sep 27, 1988 Isola Implants, Inc. Dorsal transacral surgical implant US4946458 Feb 28, 1989 Aug 7, 1990 Harms Juergen Pedicle screw US5007880 May 9, 1990 Apr 16, 1991 Walker Stanley L Bevel splined articulated joint US5024213 Feb 8, 1989 Jun 18, 1991 Acromed Corporation Connector for a corrective device US5067955 Apr 13, 1990 Nov 26, 1991 Societe De Fabrication De Material Orthopedique Vertebral implant for osteosynthesis device US5092893 Sep 4, 1990 Mar 3, 1992 Smith Thomas E Human orthopedic vertebra implant US5129899 Mar 27, 1991 Jul 14, 1992 Smith & Nephew Richards Inc. Bone fixation apparatus US5176680 Feb 8, 1991 Jan 5, 1993 Vignaud Jean Louis Device for the adjustable fixing of spinal osteosynthesis rods US5197986 Oct 18, 1990 Mar 30, 1993 Mikhail Michael W E Recessed patellar prosthesis",
    "hasKeyColumn": true,
    "keyColumnIndex": 4,
    "headerRowIndex": 0
}