{
    "relation": [
        [
            "Date",
            "Sep 4, 2001",
            "May 11, 2004",
            "Oct 22, 2007",
            "Dec 5, 2007",
            "Dec 2, 2011",
            "Sep 12, 2012",
            "Sep 16, 2013",
            "Jan 9, 2014",
            "May 23, 2014",
            "Jun 4, 2014"
        ],
        [
            "Code",
            "AS",
            "AS",
            "AS",
            "FPAY",
            "FPAY",
            "AS",
            "AS",
            "AS",
            "AS",
            "AS"
        ],
        [
            "Event",
            "Assignment",
            "Assignment",
            "Assignment",
            "Fee payment",
            "Fee payment",
            "Assignment",
            "Assignment",
            "Assignment",
            "Assignment",
            "Assignment"
        ],
        [
            "Description",
            "Owner name: BRONCUS TECHNOLOGIES, INC., CALIFORNIA Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNORS:KEAST, THOMAS;THOMPSON, DAVID;TANAKA, DON;REEL/FRAME:012162/0968;SIGNING DATES FROM 20010802 TO 20010814",
            "",
            "Owner name: VENTURE LENDING & LEASING III, LLC, SUCCESSOR IN I Free format text: RELEASE BY SECURED PARTY;ASSIGNOR:BRONCUS TECHNOLOGIES, INC.;REEL/FRAME:020016/0847 Effective date: 20071015",
            "Year of fee payment: 4",
            "Year of fee payment: 8",
            "Owner name: BRONCUS MEDICAL INC., CALIFORNIA Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNOR:BRONCUS TECHNOLOGIES, INC.;REEL/FRAME:028942/0821 Effective date: 20120608",
            "Owner name: LIFETECH SCIENTIFIC (HONG KONG) CO., LTD., CHINA Free format text: SECURITY AGREEMENT;ASSIGNOR:BRONCUS MEDICAL INC.;REEL/FRAME:031218/0227 Effective date: 20130916 Owner name: TIP-BRONCUS LIMITED, HONG KONG Free format text: SECURITY AGREEMENT;ASSIGNOR:BRONCUS MEDICAL INC.;REEL/FRAME:031218/0227 Effective date: 20130916 Owner name: DINOVA VENTURE PARTNERS LP II, L.P., CHINA Free format text: SECURITY AGREEMENT;ASSIGNOR:BRONCUS MEDICAL INC.;REEL/FRAME:031218/0227 Effective date: 20130916",
            "Owner name: LIFETECH SCIENTIFIC (HONG KONG) CO., LTD., CHINA Free format text: SECURITY AGREEMENT;ASSIGNOR:BRONCUS MEDICAL INC.;REEL/FRAME:031960/0567 Effective date: 20140109 Owner name: TIP-BRONCUS LIMITED, HONG KONG Free format text: SECURITY AGREEMENT;ASSIGNOR:BRONCUS MEDICAL INC.;REEL/FRAME:031960/0567 Effective date: 20140109 Owner name: DINOVA VENTURE PARTNERS LP II, L.P., CHINA Free format text: SECURITY AGREEMENT;ASSIGNOR:BRONCUS MEDICAL INC.;REEL/FRAME:031960/0567 Effective date: 20140109 Owner name: AETHER CORPORATE LIMITED, CHINA Free format text: SECURITY AGREEMENT;ASSIGNOR:BRONCUS MEDICAL INC.;REEL/FRAME:031960/0567 Effective date: 20140109",
            "Owner name: BRONCUS MEDICAL INC., CALIFORNIA Free format text: RELEASE OF SECURITY INTEREST;ASSIGNORS:LIFETECH SCIENTIFIC (HONG KONG) CO., LTD.;DINOVA VENTURE PARTNERS LP II, L.P.;TIP-BRONCUS LIMITED;AND OTHERS;REEL/FRAME:033012/0784 Effective date: 20140523",
            "Owner name: SRONCUB TECHNOLOGIES, INC., CALIFORNIA Free format text: SECURITY INTEREST;ASSIGNORS:BRONCUS MEDICAL, INC.;BRONCUS HOLDING CORPORATION;REEL/FRAME:033085/0827 Effective date: 20140523"
        ]
    ],
    "pageTitle": "Patent US6749606 - Devices for creating collateral channels - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US6749606?dq=6,411,947",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 9,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989826.86/warc/CC-MAIN-20150728002309-00305-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 488759415,
    "recordOffset": 488702934,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{34753=This application claims the benefit of U.S. Provisional Patent Application Serial No. 60/269,130, filed on Feb. 14, 2001, which is incorporated herein by reference in its entirety., 36479=In 1995, the American Lung Association (ALA) estimated that between 15-16 million Americans suffered from COPD. The ALA estimated that COPD was the fourth-ranking cause of death in the U.S. The ALA estimates that the rates of emphysema is 7.6 per thousand population, and the rate for chronic bronchitis is 55.7 per thousand population., 119864=Although not illustrated, the invention includes conduits having a length to diameter ratio approximately 1:1. However, this ratio may be varied as required. The cross-section of an implant may be circular, oval, rectangular, elliptical, or any other multi-faceted or curved shape as required. The cross-sectional area of an implant 500 may be between 0.196 mm2 to 254 mm2.}",
    "textBeforeTable": "Patent Citations The invention herein is described by examples and a desired way of practicing the invention is described. However, the invention as claimed herein is not limited to that specific description in any manner. Equivalence to the description as hereinafter claimed is considered to be within the scope of protection of this patent. The invention further includes a medical kit for improving gaseous flow within a diseased lung. The components of the kit may include a conduit, a hole-making device, and/or a detection device all of which are of the present invention and as described herein. The kit may further contain a power supply, such as an RF generator, or a Doppler controller which generates and analyzes the signals used in the detection devices. The kit may include these components either singly or in combination. The kit of the present invention may also contain instructions teaching the use of any device of the present invention, or teaching any of the methods of the present invention described herein. The instructions may actually be physically provided in the kit, or it maybe on the covering, e.g., lidstock, of the kit. Furthermore, the kit may also comprise a bronchoscope, or guide-member (such as a guide-wire), or other such device facilitating performance of any of the inventive procedures described herein. This variation of the invention includes obtaining clinical information regarding the quality of life of the individual before and after any",
    "textAfterTable": "Ultrasonically enhanced RF ablation catheter US4957508 Oct 30, 1987 Sep 18, 1990 Ube Industries, Ltd. Medical tubes US4967753 Jan 13, 1989 Nov 6, 1990 Cardiometrics, Inc. Apparatus, system and method for measuring spatial average velocity and/or volumetric flow of blood in a vessel US4977898 May 30, 1989 Dec 18, 1990 Hoffrel Instruments, Inc. Miniaturized encapsulated ultrasonic transducer US5002058 Apr 18, 1989 Mar 26, 1991 Intra-Sonix, Inc. Ultrasonic transducer US5030201 Nov 24, 1989 Jul 9, 1991 Aubrey Palestrant Expandable atherectomy catheter device US5042981 May 3, 1989 Aug 27, 1991 Fuchelman Sociedad Anonima Assembly comprising a surgical drape and a contour-type electrosurgical dispersive electrode, and method for its use US5054483 May 22, 1990 Oct 8, 1991 Hood Laboratories Tracheal cannulas and stents US5061275 Dec 29, 1989 Oct 29, 1991 Medinvent S.A. Self-expanding prosthesis US5064435 Jun 28, 1990",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}