{
    "relation": [
        [
            "Date",
            "Mar 22, 1999",
            "Aug 20, 2007",
            "Nov 14, 2011",
            "Mar 30, 2012",
            "May 22, 2012"
        ],
        [
            "Code",
            "AS",
            "FPAY",
            "REMI",
            "LAPS",
            "FP"
        ],
        [
            "Event",
            "Assignment",
            "Fee payment",
            "Maintenance fee reminder mailed",
            "Lapse for failure to pay maintenance fees",
            "Expired due to failure to pay maintenance fee"
        ],
        [
            "Description",
            "Owner name: AT&T CORP., NEW YORK Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNORS:GERSZBERG, IRWIN;MARTIN, JEFFREY S.;OPLINGER, THOMAS;ANDOTHERS;REEL/FRAME:009841/0685 Effective date: 19990219",
            "Year of fee payment: 4",
            "",
            "",
            "Effective date: 20120330"
        ]
    ],
    "pageTitle": "Patent US6714534 - Lifeline service for HFCLA network using wireless ISD - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US6714534?dq=US+6,313,853",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 9,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988051.33/warc/CC-MAIN-20150728002308-00209-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 472803891,
    "recordOffset": 472746190,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{166064=41. Multi-Channel Parallel/Serial Concatenated Convolutional Codes And Trellis Coded Modulation Encode/Decoder, U.S. Pat. No. 6,088,387, issued on Jul. 11, 2000;, 163627=23. A Network Server Platform (ASP) For a Hybrid Fiber Twisted-pair (HFTP) Local Loop Network Service Architecture, U.S. Pat. No. 6,229,810, issued on May 8, 2001;, 161719=9. VideoPhone Inter-com For Extension Phones, U.S. application Ser. No. 09/001,358, filed Dec. 31, 1997;, 165950=40. Ticket Ordering Via VideoPhone, U.S. application Ser. No. 09/218,171, filed Dec. 31, 1997;, 154529=As further described in “ISD Wireless Network”, U.S. application Ser. No. 09/001,363, filed Dec. 31, 1997, and hereby expressly incorporated by reference, an ISD is disclosed that allows communication with cordless telephones. An embodiment of the present invention uses the wireless communication system and techniques disclosed in the “ISD Wireless Network” application for lifeline services., 162784=17. VideoPhone Advertisement When Calling Video Non-enabled VideoPhone Users, U.S. application Ser. No. 09/001,361, filed Dec. 31, 1997;, 165725=38. VideoPhone Mail Machine, U.S. application Ser. No. 60/070,104, filed Dec. 31, 1997;, 157823=In another embodiment of a wireless lifeline service, ISD 221/IRG 22-1 does not have transceiver 2502. Rather, the transceiver used by the residential ISD's/IRG's is the transceiver 2503 at tap 60. As discussed above, tap 60 may be connected to 1, 2, 4, 8, etc. ISD's/IRG's. With only a few ISD's/IRG's per tap, if a failure occurs between tap 60 and node 61, the transceiver 2503 will provide lifeline service to the ISD's/IRG's downstream of the tap through connection pathway 2504. Alternatively, taps 60 can be function as their own network and provide a further lifeline service between them. For example, if a disconnected tap with transceiver 2503 is located a long distance from transceiver 2501 or cannot establish a connection with transceiver 2501, the disconnected tap may establish a wireless connection with a tap that is still connected via cable or twisted pair to the rest of the network. Here, the lifeline service from the disconnected tap can be relayed to connect with a connected tap. This connection scheme may include relays through multiple disconnected taps. In this regard, if a series of taps are disconnected through a node (for example, node 61) being disconnected from the network, the taps may establish a wireless link through themselves to route lifeline services to a connected tap or node (via a connected C-FMP)., 103307=Further, various implementations of the ISD/IRG may be utilized in different implementations. For example, settop 513 may be coupled to any suitable interface such as the IEEE 1394, RF audio/video interface 120, ethernet interface 119, etc. A TV may be coupled to the settop. Additionally, a DAT, DVD and/or other audio device 515 may be coupled to the ISD/IRG using a suitable interface., 165594=37. Integrated Remote Control and Phone Form Factor, U.S. application Ser. No. 09/001,910, filed Dec. 31, 1997;, 164258=27. NSP WAN Interconnectivity Services for Corporate Telecommuters Telecommuting, U.S. application Ser. No. 09/001,540, filed Dec. 31, 1997;, 165832=39. Restaurant Ordering Via VideoPhone, U.S. application Ser. No. 60/070,121, filed Dec. 31, 1997;, 165460=36. Integrated Remote Control and Phone User Interface, U.S. application Ser. No. 09/001,420, filed Dec. 31, 1997;, 164989=32. ISD/VideoPhone (Customer Premises) Local House Network, U.S. application Ser. No. 09/001,418, filed Dec. 31, 1997;, 165231=34. ISD Controlled Set-Top Box, U.S. application Ser. No. 09/001,424, filed Dec. 31, 1997;, 161329=6. VideoPhone Centrally Controlled User Interface With User Selectable Options, U.S. application Ser. No. 09/001,576, filed Dec. 31, 1997;, 165341=35. Integrated Remote Control and Phone, U.S. application Ser. No. 09/001,423, filed Dec. 31, 1997;, 87678=The processor 102 may also include one or more signal processors 102A and/or voice processor to perform various MPEG-II coding/decoding functions, codec functions, voice recognition functions, encryption/decryption, etc. The processor 102 may also be configured to perform various protocol conversion functions such that data having protocols used on a device connected to the premise distribution network may be efficiently transmitted to and from the FMP/C-FMP using an appropriate transmission protocol. Additionally, the processor 102 monitors the devices connected to the premise distribution network and stores information concerning which devices are currently in use. In this manner, where there is an incoming call, the ISD/IRG has the intelligence to know which CPE is in use and which CPE is not in use. As a result, if there is an incoming call, the ISD/IRG will not send a ringing tone to any CPE that is already in use, but will route the call to another device that is available. Further, where there is a choice of a plurality of phones and/or other devices to route the call, the ISD/IRG may review activity detected on the motion sensors on any attached motion sensing devices such as those which may be present in a video phone 130 and ring a phone which is most convenient to the user. As an alternative, all available phones will be rung, with the user given the option to switch between incoming lines., 163475=22. Life Line Support for Multiple Service Access on Single Twisted-pair, U.S. application Ser. No. 09/001,343, filed Dec. 31, 1997;, 164124=26. NSP Internet, JAVA Server and VideoPhone Application Server, U.S. Pat. No. 6,044,403, issued on Mar. 28, 2000;, 147728=For multi-dwelling units, it is also possible to use similar concepts. In a multi-dwelling unit, a line is run either from a node or from a tap with a splitter into a multi-dwelling unit then within the multi-dwelling unit there are a plurality of taps located in a patch board in the basement for supplying each of the individual dwelling units. For example, a particular apartment may have an apartment amplifier which brings the signal in off of one tap or a node and amplifies that signal and then redistributes the signal to each of the individual apartments. In this manner, the amplifier may also include a high performance ISD/IRG for supplying PBX and other user services to each of the multi-dwelling units. The high performance ISD/IRG and integrated apartment amplifier, provides the following functionality; cable television service, high speed Internet access, telephony, data services, alarm and monitoring and all of the other services with have in the 49 previous applications. The ISD/IRG in the multi-dwelling unit also provides lifeline support and may include a battery backup. The apartment house can also be wired with the hybrid coax/twisted pair cable such that each of the individual dwelling units gets not only cable television but also its telephony services directly from the high performance integrated ISD/IRG apartment complex amplifier. The ISD/IRG in either the tap or in the home environment, the ISD/IRG will be substantially the same as the prior ISD in the applications filed Dec. 31, 1997 with the exception that the ADSL modem/lifeline will be replaced by a new cable modem/lifeline configuration. Accordingly, the cable modem will need a bypass mechanism whereby a lifeline support can bypass the cable modem and power the critical phone devices within the home. This can be configured substantially the same way as the lifeline bypassing the ADSL modem in the prior applications., 166830=1. U.S. Pat. No. 6,061,326 issued on May 9, 2000, entitled Wideband Communication System for the Home, to Robert R. Miller, II and Jesse E. Russell, and, 167002=2. U.S. Pat. No. 6,111,895 issued on Aug. 29, 2000, entitled Wide Band Transmission Through Wire, to Robert R. Miller, II, Jesse E. Russell and Richard R. Shively., 56524=As shown in FIG. 2, in some embodiments the IRG 22 may include a controller 100 which may have any of a variety of elements such as a central processing unit 102, a DRAM 103, an SRAM 104, a ROM 105 and/or an Internet protocol (IP) bridge router 106 connecting the controller 100 to a system bus 111. The system bus 111 may be connected with a variety of network interface devices 110. The network interface devices 110 may be variously configured to include an integrated services digital network (ISDN) interface 113, an Ethernet interface 119 (e.g., for 10 Base T, 100 Base T, etc.), an IEEE 1394 “fire wire” interface 112 (e.g., for a digital videodisc device (DVD)), a TVRC/cable modem interface 114 (e.g., for a digital subscriber line (DSL) and/or cable modem), a residential interface 115, (e.g., standard POTS phone systems such as tip ring), a business interface 116 (e.g., a T1 line or slower data speed and/or PABX interface), a radio frequency (RF) audio/video interface 120 (e.g., a coaxial cable television connection to a set-top box/television or to a personal computer), and a cordless phone interface 123 (e.g., a 900 MHz or other unlicensed frequency transceiver). Connected to one of the network interfaces and/or the system bus 111 may be any number of devices such as an audio interface 122 (e.g., for digital audio, digital telephones, digital audio tape (DAT) recorders/players, music for restaurants, MIDI interface, DVD, etc.), a digital phone 121, a videophone/user interface 130, a television set-top device 131 and/or other devices. Where the network interface is utilized, it may be desirable to use, for example, the IEEE 1394 interface 112 and/or the Ethernet interface 119., 162370=14. VideoPhone Multimedia Video Message Reception, U.S. application Ser. No. 09/001,362, filed Dec. 31, 1997;, 160825=2. Dynamic Bandwidth Allocation for use in the Hybrid Fiber Twisted-pair Local Loop Network Service Architecture, U.S. application Ser. No. 09/001,425, filed Dec. 31, 1997;, 164543=29. NSP Integrated Billing System For NSP services and Telephone services, U.S. application Ser. No. 09/001,359, filed Dec. 31, 1997;, 162651=16. VideoPhone Multimedia Interactive On-Hold Information Menus, U.S. Pat. No. 6,020,916, issued on Feb. 1, 2000;, 30639=Another opportunity is for the interexchange carrier to employ wireless means of reaching the local telecommunications service subscriber. In co-pending U.S. patent application Ser. No. 09/001,363, filed Dec. 31, 1997, entitled “ISD Wireless Network”, it was suggested to provide a wireless integrated service director for communicating with wireless subscriber apparatus. Also, from other U.S. patent applications, for example, in “Circuit-Switched Switching System” U.S. Pat. No. 5,978,370, issued Nov. 2, 1999, it is known to provide satellite or other wireless connections directly to the local subscriber, thus bypassing the local network and the local telephone company., 162499=15. VideoPhone Multimedia Interactive Corporate Menu Answering Machine U.S. Pat. No. 6,226,362, issued on May 1, 2001; Announcement,, 161114=4. VideoPhone Privacy Activator, U.S. application Ser. No. 09/001,909, filed Dec. 31, 1997;, 164696=30. Network Server Platform/Facility Management Platform Caching Server, U.S. application Ser. No. 09/001,419, filed Dec. 31, 1997;, 135511=One telephony/cable television problem being addressed by the present application is the provision of lifeline support for telephoning over a cable distribution system. Referring again to FIG. 1D, the lifeline support may be divided into several sections including a head end section, a distribution network section and the home/customer premises section. Where a lifeline support is provided to a cable system, the power necessary to drive the lifeline devices needs to be provided through the coaxial cable to the home. One option for providing this power and lifeline support is to connect the telephony into a hub 62 of the cable network and only provide lifeline support from the hub 62 downstream through the nodes 61 to the house network. The average power requirement for a two line telephone is 3.1 watts, accordingly, the lifeline power distribution network will require at least 3 watts per household distributed throughout the network. In a typical network there are 20 nodes or less per hub 62 and 500-1000 houses per node 61. In the current system there can be many as 500-1000 houses per node 61 or 3,000 watts per node 61 which may be excessive. Accordingly, it may desirable to drop the number of houses per node 61 to 200 or less making 600 watts per node. The cable system currently uses as a standard component a two-drawer file cabinet size box which is positioned at the base of a pole and has batteries in the bottom of the box and a power supply for converting either 110 or 220 V AC into 90 volts AC for supply out onto the cable network. One solution for lifeline is to use the existing distributed battery backup systems as described above distributed throughout the cable network to provide lifeline power into the home from the batteries in the file cabinet size batteries backup supplies. In this manner, by placing the battery backup supplies downstream from the node and the hub, the node and the hub no longer need to be powered from the head end. Additionally, in this way lifeline support can be provided into the node or the hub with a fixed number of twisted pair of lines which go directly to the local exchange and provide lifeline support on a selected statistical basis., 26778=This application is a continuation-in-part of U.S. application Ser. No. 09/001,360, filed Dec. 31, 1997, entitled “Hybrid Fiber Twisted Pair Local Loop Network Service Architecture” of Gerszberg et al., 163150=20. Video communication device providing in-home Catalogue Services, U.S. Pat. No. 5,970,473, issued on Oct. 19, 1999;, 163810=24. A Communication Server Apparatus For Interactive Commercial Service, U.S. application Ser. No. 09/001,344, filed Dec. 31, 1997;, 166369=43. Digital Channelizer With Arbitrary Output Frequency, U.S. application Ser. No. 09/001,581, filed Dec. 31, 1997;, 164418=28. NSP Telephone Directory White-Yellow Page Services, U.S. Pat. No. 6,052,439, issued on Apr. 18, 2000;, 161941=11. VideoPhone FlexiView Advertising Information Display for Visual Communication Device, U.S. Pat. No. 6,222,520, issued on Apr. 24, 2001;, 129944=Video broadcast signals are directed via IEEE 1394 link from the ISD to tuner 408 which is controlled by controller 402 and generates a VIDEO OUT signal usable by the video appliance. In accordance with the invention, the VIDEO OUT signal may include an audio signal overlay which corresponds to a caller's voice. The ISD Ethernet link also communicates with controller 402 in order to provide various interactive services described in the applications incorporated herein by reference herein. These services may include the processing of incoming voice and data communications. Incoming voice signals are sent to set-top controller 402 via the ISD Ethernet link. Controller 402 generates a signal to RF transmitter 422 which sends the incoming voice call signal via RF link to the handset. RF receiver 410 and RF transmitter 422 may be appropriately duplexed to prevent the reception by RF receiver 410 of the signals transmitted by RF transmitter 422., 166245=42. Spread Spectrum Bit Allocation Algorithm, U.S. application Ser. No. 09/001,842, filed Dec. 31, 1997;, 112100=FIGS. 16-20 depict an integrated remote control and phone according to an embodiment of the present invention. Referring to FIG. 16, the ISD/IRG 22 interfaces with a set-top device 131, which typically is a controller for a television set 360 on which it sits. The ISD/IRG 22 may be powered at 90 V AC fed via the coaxial cable television drop or via 48 V DC power from the twisted pair. The coaxial cable drop and/twisted pairs are shown entering ISD/IRG 22 at the left. The ISD/IRG 22 may be coupled to the set top devices 131 using any suitable interface such as Ethernet interface 119 (FIG. 2), IEEE 1394 interface 112, ISDN interface 113, Business Interface 116, and/or RF audio/video coaxial Interface 120. The ISD/IRG 22 may or may not include an MPEG decoder. In exemplary embodiments, the MPEG decoder may be disposed in set-top 131 to minimize the bandwidth of the ISD/IRG interfaces. Where the MPEG decoder is disposed in the set-top device 131, MPEG packets may be downloaded from the NSP 36, via the network 42, through the FMP/C-FMP 32, through the ISD/IRG 22 and into the settop 131. In exemplary embodiments, video programming is being continuously multicast across network 42 and selectively directed to one or more ISD/IRG devices 22 responsive to a profile input by a viewer and/or responsive to commands by a viewer., 163961=25. NSP Multicast, PPV Server NSP Based Multicast Digital Program Delivery Services, U.S. application Ser. No. 09/001,580, filed Dec. 31, 1997;, 159304=In placing transceiver 2503 at tap 60, additional steps need to be taken to ensure the transceiver's functionality in a harsh environment. For example, the transceiver 2503 may be hermetically sealed to withstand environmental stress. Also, the transceiver 2503 may be combined with tap 60 in a single package for greater convenience and installation efficiency. For example, picocellular transceivers, as well known in the art, may be combined with the taps. Further, as discussed above, these picocellular transceivers may be sealed as well and placed at each separate ISD/IRG., 157268=Further, tap 60 may have a battery backup and sense when it too has been removed from the network. In this case, if communication pathway 2506 from the ISD/IRG to the C-FMP cannot be established, then communication pathway pairs 2505 from transceiver 2502 to transceiver 2503 may be established and 2504 from transceiver 2503 to transceiver 2501 may be established to handle lifeline services when a cabled connection from ISD 221/IRG 22-1 to node 61., 163288=21. A Facilities Management Platform For Hybrid Fiber Twisted-pair Local Loop Network, Service Architecture, U.S. application Ser. No. 09/001,422, filed Dec. 31, 1997;, 160675=1. A Hybrid Fiber Twisted-pair Local Loop Network Service Architecture, U.S. application Ser. No. 09/001,360, filed Dec. 31, 1997;, 161225=5. VideoPhone Form Factor, U.S. application Ser. No. 09/001,583 filed Dec. 31, 1997;, 156601=Also, transceivers 2503 may be placed at tap 60 so as to communicate with transceiver 2502 (and other replicated transceivers at the other houses connected to tap 60). In this scenario, transceiver 2501 may have less workload based on tap 60 handling a majority of lifeline connections from ISD's/IRG's who have been cut off from the cable network. Transceiver 2503 would intelligently convert the transmitted and received information from transceiver 2502 over wireless pathway 2505 to the appropriate signaling over the standard network pathway from tap 60 to node 61., 109671=Further, because the ISD/IRG has high bandwidth access to external networks, the ISD/IRG may serve as an Internet gateway. For example, by configuring the ISD/IRG as an Internet gateway server, the ISD/IRG allows every computer in the home high-speed access and E-mail capabilities with the Internet. The LAN may also include inexpensive network computers without expensive disk drives and peripherals allowing the average home owner to purchase many inexpensive network computers, e.g., one for each member of the family. Similarly, WEB TV boxes could use the same LAN network LAN A to obtain high speed access to the Internet. The ISD/IRG may be variously configured as a proxy server, such that each of the devices connected to the IP proxy server may utilize TCP/IP protocol and hence access a single IP connection from the IP server located in the ISD/IRG across the connection to the central office. Where the ISD/IRG is configured as an IP proxy server, the ISD may accommodate any number of additional devices that are not TCP/IP devices or Internet literate. In this manner, the ISD/IRG may have a proprietary interface out to the device, such as the set top box, the personal computer, the digital telephones, the VisionPhone, or other end user devices and yet access the power of the Internet through the ISD/IRG services. So the protocol between the ISD/IRG and the end user devices may be conventional protocols, such as CEBus for meter reading, ISDN for digital telephones and VisionPhones, fire wire, IEEE 1394 for consumer electronic devices such as video DVD players and/or other similar devices., 161628=8. VideoPhone Blocker, U.S. Pat. No. 5,949,474, issued on Sep. 7, 1999;, 161843=10. Advertising Screen Saver, U.S. Pat. No. 6,084,583, issued on Jul. 4, 2000;, 162940=18. Motion Detection Advertising, U.S. application Ser. No. 09/001,355, filed Dec. 31, 1997;, 166647=45. Method And Apparatus For Reducing Near-End Cross Talk In Discrete Multi-Tone Modulators/Demodulators, U.S. application Ser. No. 08/997,176, filed Dec. 23 1997;, 161487=7. VideoPhone User Interface Having Multiple Menu Hierarchies, U.S. application Ser. No. 09/001,908, filed Dec. 31, 1997;, 155398=In one embodiment of the wireless lifeline service, a wireless transceiver 2502 is placed at every ISD 221/IRG 22-1. Alternatively, the wireless transceiver 2502 is integrated within every ISD 221/IRG 22-1. A similar transceiver may be placed at C-FMP 32-1 (as well as may be placed at C-FMP's 32-2 and 32-3). Here, each house is separately enabled to communicate with the remaining network. The transceiver 2502 includes a battery backup and automatically determines when power or communication is lost from tap 60. In this instance, transceiver 2502 may become active to alert C-FMP 32-1 to the status ISD 221/IRG 22-1's connection to tap 60. In this regard, if any incoming telephone calls are to be routed to ISD 221/IRG 22-1, C-FMP 32-1 would route them wirelessly to transceiver 2502 over wireless pathway 2506. In the case of outgoing calls, wireless transceiver 2502 connects to C-FMP 32-1 and establishes the communication pathway 2506., 162100=12. VideoPhone Multimedia Announcement Answering Machine, U.S. application Ser. No. 09/001,911, filed Dec. 31, 1997;, 166504=44. Method And Apparatus For Allocating Data Via Discrete Multiple Tones, U.S. Pat. No. 6,134,274, issued on Oct. 17, 2000;, 162236=13. VideoPhone Multimedia Announcement Message Toolkit, U.S. application Ser. No. 09/001,345, filed Dec. 31, 1997;, 154943=FIG. 25 shows a lifeline service structure using wireless interconnects. Incorporating the structure of FIG. 1D, common elements are appropriately labeled. In FIG. 25, wireless communication stations 2501, 2502, and 2503 are disclosed. Similar communication stations (for example, network interface units) are disclosed in further detail in the “ISD Wireless Network” application and are incorporated by reference., 165127=33. ISD Wireless Network, U.S. application Ser. No. 09/001,363, filed Dec. 31, 1997;, 43933=In one embodiment, a single mode, dual frequency fiber operating at 1330 nm and at 1550 nm optical wavelength provides dual one gigahertz spectrums for transmission of audio, data and video. Typically, one of these is reserved for video and the other for audio and data. A problem is that there is no provision for switched or packetized telecommunications services that may require more or less than allocated bandwidth. There is no provision for true lifeline telecommunications services in a packetized environment. Thus, it is anticipated according to the present invention to utilize a band of frequencies in the above 50 MHz spectrum of either 1330 or 1550 nm wavelength for bi-directional switched telecommunications carrying voice and digital data lifeline services. For example, if there exist 3000 subscribers served by each fiber of a hybrid fiber coaxial cable system, then, 3000 times 64 kbps equates to approximately 200 megabps of uncompressed voice data which can be compressed without significant loss of quality to a fraction of the bit rate, for example, the equivalent of one or two cable television (6 megahertz) channels., 161017=3. The VideoPhone, U.S. application Ser. No. 09/001,905, filed Dec. 31, 1997;, 164847=31. An Integrated Services Director (ISD) Overall Architecture, U.S. application Ser. No. 09/001,417, filed Dec. 31, 1997;, 38976=Referring to FIG. 1A, a first exemplary communication network architecture employing a hybrid fiber, twisted-pair (HFTP) local loop 1 architecture is shown. This network and an intelligent service director controlled set-top box are already discussed by U.S. patent application Ser. No.'s 09/001,360, entitled “A Hybrid Fiber Twisted-pair Local Loop Network Service Architecture” and U.S. Ser. No. 09/001,424, entitled “ISD Controlled Set-Top Box” filed Dec. 31, 1997, incorporated as to their entire contents by reference. Those descriptions are summarized here by way of introduction to a related and potentially overlapping or integrated architecture, which will be described with reference to FIGS. 1B-1E. Similar reference numerals are used throughout to denote similar elements., 163052=19. Interactive Commercials, U.S. Pat. No. 6,178,446, issued on Jan. 23, 2001;, 54418=Referring to FIG. 2, there is shown an integrated residence gateway 22 which is very similar to an intelligent service director 22 discussed in earlier U.S. application Ser. No. 09/001,424, filed Dec. 31, 1997. The IRG 22 may connect with a variety of devices including analog and digital voice telephones 15, 18; digital videophones 130, devices for monitoring home security, meter reading devices (not shown), utilities devices/energy management facilities (not shown), facsimile devices 16, digital audio devices via audio interface 122, personal computers 14, cable television set top devices 131 and/or other digital or analog devices. Some or all of these devices may be connected with the IRG 22 via any suitable mechanism such as a single and/or multiple twisted-pair wires, in-premises coaxial cable and/or a wireless connection. For example, a number of digital devices may be multidropped on a single twisted-pair (to FMP) or coaxial cable (to C-FMP) connection. Similarly, analog telephones and other analog devices may be multi-dropped using conventional techniques. Settop cable television terminals 131 or personal computers utilizing cable modem bandwidth Internet services are typically coupled to IRG 22 to coaxial cable lines run within the home. Alternatively, services are provided via an Ethernet interface 119 or other high bandwidth interface.}",
    "textBeforeTable": "Patent Citations While exemplary systems and methods embodying the present invention are shown by way of example, it will be understood, of course, that the invention is not limited to these embodiments. Modifications may be made by those skilled in the art, particularly in light of the foregoing teachings. For example, each of the elements of the aforementioned embodiments may be utilized alone or in combination with elements of the other embodiments. 11. U.S. application Ser. No. 09/224,283, entitled “Coaxial Cable/Twisted Pair Cable Telecommunications Network Architecture” of Gerszberg et al. 10. U.S. application Ser. No. 09/224,289, entitled “Method and Apparatus for Providing Uninterrupted Service in a Hybrid Fiber Coaxial System” by Gerszberg et al. 9. U.S. application Ser. No. 09/224,282, entitled “A Network Server Platform for Providing Integrated Billing for CATV, Internet, Telephony and Enhanced Bandwidth Services” of Gerszberg et al. 8. U.S. application Ser. No. 09/224,284, entitled “Cable Connected NSP for Telephone White-Yellow Page Services and Emergency 911 Location Identification” of Gerszberg et al. 7. U.S. application Ser. No. 09/224,288, entitled “Video Phone Multimedia Video Message Reception” of Gerszberg et al. 6. U.S. application Ser. No. 09/224,290, entitled “Intercom for Extension Phones Using an ISD in a Cable Environment” of Gerszberg et al. 5. U.S. application Ser. No. 09/224,287, entitled “A Facilities Management Platform for a Hybrid Coaxial/Twisted Pair Local Loop Network Service Architecture” of Gerszberg et al. 4. U.S. application Ser. No. 09/224,285, entitled “A Network",
    "textAfterTable": "US5793028 Jun 24, 1996 Aug 11, 1998 Fred N. Gratzon Electronic transaction security system US5880446 Jan 29, 1997 Mar 9, 1999 Hitachi, Ltd. Electronic transaction method and system US5978780 Nov 21, 1997 Nov 2, 1999 Craig Michael Watson Integrated bill consolidation, payment aggregation, and settlement system US5991292 * Mar 6, 1997 Nov 23, 1999 Nortel Networks Corporation Network access in multi-service environment US5999207 May 16, 1997 Dec 7, 1999 Scientific-Atlanta, Inc. Method and apparatus for implementing a user interface for a videophone in a cable television network US6026158 Apr 7, 1998 Feb 15, 2000 Davox Corporation Computer telephone system US6131136 * Dec 12, 1997 Oct 10, 2000 Gateway 2000, Inc. Dual mode modem for automatically selecting between wireless and wire-based communication modes * Cited by examiner Non-Patent Citations Reference",
    "hasKeyColumn": true,
    "keyColumnIndex": 2,
    "headerRowIndex": 0
}