{
    "relation": [
        [
            "Citing Patent",
            "US5450543 *",
            "US5561752 *",
            "US5765022 *",
            "US5923339 *",
            "US5969726 *",
            "US7755627 *",
            "US7969433",
            "US8279204 *",
            "US8402317",
            "US8493387",
            "US8762784",
            "US8780098",
            "US9024949 *",
            "US9078299"
        ],
        [
            "Filing date",
            "Oct 11, 1994",
            "Feb 3, 1995",
            "Sep 29, 1995",
            "Nov 26, 1997",
            "May 30, 1997",
            "Nov 22, 2006",
            "Nov 22, 2006",
            "Dec 22, 2005",
            "May 21, 2008",
            "Nov 22, 2006",
            "Mar 19, 2013",
            "Sep 13, 2012",
            "Mar 17, 2005",
            "Apr 13, 2012"
        ],
        [
            "Publication date",
            "Sep 12, 1995",
            "Oct 1, 1996",
            "Jun 9, 1998",
            "Jul 13, 1999",
            "Oct 19, 1999",
            "Jul 13, 2010",
            "Jun 28, 2011",
            "Oct 2, 2012",
            "Mar 19, 2013",
            "Jul 23, 2013",
            "Jun 24, 2014",
            "Jul 15, 2014",
            "May 5, 2015",
            "Jul 7, 2015"
        ],
        [
            "Applicant",
            "Ati Technologies Inc.",
            "Apple Computer, Inc.",
            "International Business Machines Corporation",
            "Canon Kabushiki Kaisha",
            "Hewlett-Packard Co.",
            "Pixar",
            "Pixar",
            "The Mathworks, Inc.",
            "The Math Works, Inc.",
            "Pixar",
            "The Mathworks, Inc.",
            "The Mathworks, Inc.",
            "Sony Corporation",
            "Suntracker Technologies Ltd"
        ],
        [
            "Title",
            "Flag-based high-speed I/O data transfer",
            "Multipass graphics rendering method and apparatus with re-traverse flag",
            "System for transferring data from a source device to a target device in which the address of data movement engine is determined",
            "Higher-speed parallel processing",
            "Caching and coherency control of multiple geometry accelerators in a computer graphics system",
            "Global illumination filtering methods and apparatus",
            "Methods and apparatus for determining high quality sampling data from low quality sampling data",
            "Viewer for multi-dimensional data from a test environment",
            "Viewing multi-dimensional metric data from multiple test cases",
            "Accelerated statistical rendering methods and apparatus",
            "Viewing multi-dimensional metric data from multiple test cases",
            "Viewer for multi-dimensional data from a test environment",
            "Object representation using distance functions",
            "Predictive daylight harvesting system"
        ]
    ],
    "pageTitle": "Patent US5369738 - Distributed processing apparatus and method for use in global rendering - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US5369738?dq=U.S.+Patent+No.+4,528,643)",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 7,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989826.86/warc/CC-MAIN-20150728002309-00026-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 481037863,
    "recordOffset": 481008389,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{31299=This is a continuation of copending application Ser. No. 08/037,489 filed on Mar. 26, 1993, now abandoned, which is a continuation of application Ser. No. 07/468,677, filed Jan. 23, 1990, also abandoned., 32036=A number of global illumination techniques for generating three dimensional computer graphics are known, the most common of which are ray tracing and radiosity. Both ray tracing and radiosity compute the global illumination of a scene by testing for intersections between (i) surface elements (\"polygons\") and/or boxes (\"bounding volumes\") derived from objects to be rendered in the scene, and (ii) rays cast from either viewpoints of the scene (ray tracing) or light sources in the scene (radiosity). These steps are sometimes referred to as polygon testing, box testing and/or shadow testing. The following publications which are incorporated herein by reference are descriptive of ray tracing and radiosity techniques for solving global illumination of a scene: An Introduction to Ray Tracing, Ed. by Andrew S. Glassnet, Academic Press, 1989 (chapter 2, pp. 33-77); Kay, T. L. et al., \"Ray Tracing Complex Scenes,\" SIGGRAPH Proceedings, vol. 20, no. 4, pp. 269-277 (August, 1986); Greenberg, D. P. et al., \"Radiosity: A Method For Computing Global Illumination,\" The Visual Computer, vol. 2, pp. 291-297 (1986); Cohen, M. F. et al., \"The Hemi-Cube: A Radiosity Solution For Complex Environments,\" SIGGRAPH Proceedings, vol. 19, no. 3, pp. 31-40 (1985). One presently preferred method of solving the global illumination of the scene, and in which the present invention has particular application, is described in co-pending U.S. application Ser. No. 332,777 filed Apr. 3, 1989, now U.S. Pat. No. 5,313,568, and entitled, \"Three Dimensional Computer Graphics Employing Ray Tracing to Compute Form Factors in Radiosity.\" See also, Wallace, J. R. et al., \"A Ray Tracing Algorithm for Progressive Radiosity,\" SIGGRAPH Proceedings, Computer Graphics, vol. 23, no. 3, pp. 315-324 (July, 1989)., 40827=The details of the graphics renderer 10 are more fully described in co-pending patent application Ser. No. 387,510, now U.S. Pat. No. 5,224,210, entitled, \"Methods and Apparatus For Accelerating Windows in Graphics Systems.\" See also, Rhoden, D. et al., \"Hardware Acceleration For Window Systems,\" SIGGRAPH Proceedings, Computer Graphics, vol. 23, no. 3, pp. 61-67 (July, 1989). Except as set forth in the appended claims, the details of the graphics renderer 10 do not form a part of the present invention, and thus will not be described in detail herein. Rather, reference should be made to the aforementioned documents. Suffice it to say that the graphics renderer 10 of FIG. 1 comprises a host computer 12 communicating with a transform engine 14 via an interface 16. The transform engine 14 communicates graphics data to a rendering VLSI (very large scale integrated circuit) 18, which in turn communicates with window circuitry 20. Window circuitry 20 provides data to a frame buffer 22 which in turn communicates with a video generator 24. The video generator 24 controls the display of images on a raster display 26. Data is also communicated from the host computer 12 to window circuitry 20, frame buffer 22 and video generator 24 via interface circuit 16 and a pipeline bypass 28. If a graphics renderer of the type of FIG. 1 is employed, the apparatus and method of the present invention is preferably incorporated into the host computer 12, interface 16 and transform engine 14 as described in detail herein., 33915=Typically, data defining the scene to be rendered, including a description of objects and light sources in the scene, are provided in a database upon which the global renderer operates (e.g., by ray tracing or radiosity) to compute global illumination, and generally all of the computations, including the ray intersection calculation, are carried out in a host computer. One of the problems with prior art global renderers, however, is that the ray intersecting calculations are extremely time consuming; most of the time spent solving global illumination is performed on the ray intersection calculations. The following publications generally discuss hardware and software systems for accelerating the global illumination solution: Potmesil, M. et al., \"The Pixel Machine: A Parallel Image Computer,\" SIGGRAPH Proceedings, vol. 23, no. 3, pp. 69-78 (July, 1989); Akeley K. et al., \"High-Performance Polygon Rendering,\" SIGGRAPH Proceedings, vol. 22, no. 4, pp. 239-246 (August, 1988). These systems, however, do not adequately address the need for accelerating ray intersection calculation in global rendering.}",
    "textBeforeTable": "Patent Citations The present invention vastly accelerates the ray intersection process in three dimensional computer graphics renderers. The present invention may be embodied in any specific forms without departing from the spirit or essential attributes thereof and, accordingly reference should be made to the appended claims rather than to the foregoing specification, as indicating the scope of the invention. FIGS. 8A and 8B illustrate the types of data that are stored in shared memory 36 as the result of a ray intersection calculation. FIG. 8A illustrates an intersection of a ray R0 with a bounding volume 120. The intersection of the ray R0 with the bounding volume 120 results in two indices, tnear and tfar, representing the parametric distance along the ray R0 where it entered and exited, respectively, the bounding volume 120. FIG. 8B illustrates the intersection of a ray R0 with a polygon 130. Since polygons are planar, only one value needs to be returned, i.e., the value of tdist representing the parametric distance along the ray R0 at which it intersected the polygon 130. At step 108, an inquiry is made as to whether all transform processors have stored their intersection results in the shared memory 36. If they haven't, control passes directly to step 112 where the shared memory is released so that the next transform processor can transfer its intersection results. On the other hand, if this is the last transform processor, as",
    "textAfterTable": "\"High-Performance Polygon Rendering\", Akeley, K. and Jermoluk, T., Computer Graphics, vol. 22, No. 4, Aug., 1988, pp. 2391∝246. 5 \"Radiosity: A Method For Computing Global Illumination\", Greenberg, Donald P., Cohen, Michael F., and Torrance, K., The Visual Computer, vol. 2, pp. 291-297 (1986). 6 \"Ray Tracing Complex Scenes\", Kay, Timothy L., and Kajiya, James T., SIGGRAPH '86, California Institute of Technology, vol. 20, Nov. 4, 1986, pp. 269-277. 7 \"The Hemi-Cube: A Radiosity Solution For Complex Environments\", Cohen, Michael F., Greenberg, Donald F., SIGGRAPH '85 Cornell University, vol. 4, Nov. 4, 1985, pp. 31-40. 8 \"The Pixel Machine: A Parallel Image Computer\", Potmesil, M. and Hoffert, E. M., Computer Graphics, vol. 23, No. 3, Jul., 1989, pp. 69-78. 9 * A Ray Tracing Algorithm For Progressive Radiosity , Wallace, John R., Elmquist, Kells A. and Haines, Eric A., Computer Graphics , vol. 23, No. 3, Jul., 1989, pp.315 324. 10 Deguchi, H., Omura, K., and Shirakawa, I., \"A Parallel Processing Scheme for Tree-Structured Image Generation System\" 1988 IEEE International Symposium on Circuits and Systems, pp. 569-572, (Jun. 7-9, 1988). 11",
    "hasKeyColumn": true,
    "keyColumnIndex": 3,
    "headerRowIndex": 0
}