{
    "relation": [
        [
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            ""
        ],
        [
            "Forum",
            "GTA V PC, Gameplay, Guides & Strategies, Help & Support This forum is dedicated to discussion about the latest installment in the series, Grand Theft Auto V.",
            "GTA IV PC, Gameplay, Episodes from Liberty City, Multiplayer, Guides & Strategies, Help & Support This section is dedicated to Grand Theft Auto IV - the ninth title in the series, released in 2008.",
            "GTA Chinatown Wars This forum is dedicated to GTA: Chinatown Wars - the tenth game in the series, and the first to be developed for Nintendo DS.",
            "GTA Vice City Stories This forum is dedicated to GTA: Vice City Stories - a prequel to GTA: Vice City, released in 2006.",
            "GTA Liberty City Stories This forum is dedicated to GTA: Liberty City Stories - the first 3D portable Grand Theft Auto title, released in 2005.",
            "GTA San Andreas Gameplay, Mission Help, Guides & Strategies, Help & Support, PC Modding This forum is dedicated to GTA: San Andreas - the fifth title in the series, released in 2004.",
            "GTA Vice City Gameplay, Guides & Strategies, Help & Support, PC Modding This forum is dedicated to GTA: Vice City - the fourth title in the series, released in 2002.",
            "GTA III Gameplay, Guides & Strategies, Help & Support, PC Modding This section is dedicated to Grand Theft Auto III - the first 3D title in the series, released in 2001.",
            "Top Down Games GTA Advance, GTA 2, GTA This section is dedicated to the 2D Grand Theft Auto titles, including the original, GTA 2, and GTA Advance.",
            "GTA Series GTA Concepts General chat related to the series. This section can also be used to post concept threads for new GTAs."
        ],
        [
            "Stats",
            "85,082 topics 2,123,516 replies",
            "85,547 topics 1,153,568 replies",
            "1,071 topics 11,069 replies",
            "4,218 topics 64,757 replies",
            "5,996 topics 75,808 replies",
            "50,535 topics 466,146 replies",
            "22,766 topics 196,282 replies",
            "4,270 topics 60,433 replies",
            "1,128 topics 8,214 replies",
            "3,598 topics 115,147 replies"
        ],
        [
            "Last Post Info",
            "How big LS really is next t... By Saintdestroyer A minute ago",
            "Did anyone had problem with... By Militia 9 minutes ago",
            "The Ultimate 100% Save File... By Militia A day ago",
            "The Ultimate 100% Save File... By Militia An hour ago",
            "Is Rosco Stow a real band? By PhillBellic 3 hours ago",
            "how to pass mission farewel... By Militia 21 minutes ago",
            "Which Vehicle Do You Prefer? By PhillBellic An hour ago",
            "Which Vehicle Do You Prefer? By PhillBellic An hour ago",
            "Anybody has a 100 % savegame? By Cerium 16 hours ago",
            "Create your own radio stati... By Phnx. 4 minutes ago"
        ]
    ],
    "pageTitle": "GTAForums",
    "title": "",
    "url": "http://gtaforums.com/index.php?act=Post&CODE=06&f=98&t=267418&p=1057187748",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 1,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986423.95/warc/CC-MAIN-20150728002306-00079-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 106079351,
    "recordOffset": 106051271,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{21231=This section is dedicated to Grand Theft Auto III - the first 3D title in the series, released in 2001., 47931=Bing, Google, dice, r0eladn, Yahoo, Failure, GR Choke, Mr. Fahrenheit, Ajvallejo12, Epic., dkluin, Qwats, FlacidJack, Braulioaej, The Yokel, Money Over Bullshit, Tegan, TheTechPoTaToCHIP, Willplanb_, nexja, XenoxX, HulioG, Roadkill01, Street Mix, reditec, 11john11, Skip_Chizzlenuts, Owl Man, grunsker, Pavle, CatsAhoy, D418, TANNER-MAN87, 44MA9NUM357, Ukeman5, HipsterHillbilly, Gonad McDangle, Lester-The-Molester, HellCattX, lolznc, Superfrogger, p-s-3x, Ämpäri, Receptor, DJROWIENZ, AdusPL, Retired Mafia, michiel1705, bigjpc777, Marticus, helresa, BisP, T.V. Eye, toxluv, Major Seven, Josivers, TheUnholy, Mach1bud, GTAKid667, shadowoperative, joel15cat, RayB_ThrowaStack, EarlyLifeFailure, Verstappen, SatournFan, //XP//, Saintdestroyer, s2n vaniish, Fuzzknuckles, Azazel, Google Mobile, BurnettVice, Turbocharger, Fonshway, SchoolOfHardKnocks, Zoolock, SkynetOnlineID, Karlitoz-E, jp9865, SkylineGTRFreak, Krystofer, Alvarez, RideEmOut2, GTA_Matt24, JuniorDosPepsi, Russell_Brand, Maresz55, Bms842, SmellyFishBarrel, StepNaza, Facebook, ClaudeSpeed1911, Bob_Dole, FacingGaming, CaptianBackwoods, LibertyViceSantos555, gtuned, Dondara, ChrissyBoi87, Los Santos citizen, A-Wax8, thekittyhawk, UshaB, steve_blue5, Rippir1600, McManus84, rafaelfiorindo, timason, Ezza., DiscoPanda, ice_phoenix_66, EF2000, m3tal z_DKI, RandomStunt, LukeyDukey1988, Zulxer, gunziness, ownedbyronin, Phyxsius-, Cringlebert Fishtybuns, Majestic81, Furry_Monkey, alexthingy, Rebel, UAL, XB36Hazard, Mennosson, D-WAVE_DDK, Johnny Playert, slayso, gizmonomono, Cjs3315, Toğrul, Marwin, XCalinX, xxWilsoNxx, Osho, Crimson Flam3s, ODD_ZoeWowiee, PANiC ATTACK3R, truthy, TreFacTor, IChewOnWater, Mottershead, Reid505, _CP_, silentkiller44, Jeansowaty, Awayfromkeyboard, Deceptix, C06alt, OvaKillerCams_Si, Indignation, Mastah, Potatoman99, Gregers08, triplem, jollythecat, Darrel, teagle, Sentinel Driver, Mona Sax, scalliano, Smooth Longsack, AcidRunner, Abzinth, cswood, feedthefishy, whywontyoulisten, TwisterVictor1, Laguezmer, MF Modding, Beastly40, Linchpin636, DeltaEliteKing9, mkjah222, Nathaaan8, Bone34, GTA_stu, Fenton, Jinx., icecoldkilla1467, willywill, HaythamKenway, SRTTURBO4, Corndog93, MatadoR_AD, adrilp, frodzet, Phnx., billyliver, asilcenk, Touge Spirit Leader, JimmyFantastic, GTA SIX, Craank_AG, KornbreadMaf1a, xSyGnUs, wah007, BK90s, King Rossey, S4NT0_D10, Cico555, PhillBellic, quadro09, K-ROSE, -Quantum-, Vingt, TheGame1083, kalle55, AminB, Gummy , Kai650, alexnicnac, Dns2K, AztecaEh, Soki93, jukebox, slendifiedman, shadowkill98, xink, In Bed With Jed, Reno33, Cool Username, amar33494, meta187, AntBirch90, GTA4LIFE9000, WhitTe_MamBa, sanjvwin13, aurules16, Stephan90, Niobium, Renlou, A8ul99, Stormingz, Fox2Quick, aprenner88, Lubas, Rendy Specter(Riandy), menny, potato123, Default_Man, Jon3s, BendingB, Whoop woop, Zolika1351, GreenOnions, Bombshock, Rashkovskys Shiv, customkingpimp, 113985=© 2001-2015 GTANet.com | Cookies and Privacy Policy | Copyright Statement, 19117=This forum is dedicated to GTA: Vice City - the fourth title in the series, released in 2002., 16839=This forum is dedicated to GTA: San Andreas - the fifth title in the series, released in 2004., 14561=This forum is dedicated to GTA: Liberty City Stories - the first 3D portable Grand Theft Auto title, released in 2005., 12843=This forum is dedicated to GTA: Vice City Stories - a prequel to GTA: Vice City, released in 2006., 9416=This section is dedicated to Grand Theft Auto IV - the ninth title in the series, released in 2008.}",
    "textBeforeTable": "Toggle Grand Theft Auto Grand Theft Auto (adsbygoogle = window.adsbygoogle || []).push({}); 3 minutes ago By HipsterHillbilly The Paleto Bay Mayors Offic... 613,453 replies 15,185 topics Social lounge for multiplayer crews & forum gangs. Recruitment Crews & Gangs A minute ago By Obviously Does anyone else have Full... 2,278,610 replies 113,179 topics This is a general discussion forum for Grand Theft Auto Online.",
    "textAfterTable": "Toggle GTA Mods GTA Mods   Forum Stats Last Post Info GTA Modding GTA V, GTA IV, GTA III, VC & SA, Tutorials, Art Support General discussion and support. 48,442 topics 416,554 replies Better TV-Channel Switching... By truthy 7 minutes ago Mod Showroom Scripts & Plugins, Maps, Total Conversions, Vehicles, Textures,",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}