{
    "relation": [
        [
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            ""
        ],
        [
            "Forum",
            "GTA V PC, Gameplay, Guides & Strategies, Help & Support This forum is dedicated to discussion about the latest installment in the series, Grand Theft Auto V.",
            "GTA IV PC, Gameplay, Episodes from Liberty City, Multiplayer, Guides & Strategies, Help & Support This section is dedicated to Grand Theft Auto IV - the ninth title in the series, released in 2008.",
            "GTA Chinatown Wars This forum is dedicated to GTA: Chinatown Wars - the tenth game in the series, and the first to be developed for Nintendo DS.",
            "GTA Vice City Stories This forum is dedicated to GTA: Vice City Stories - a prequel to GTA: Vice City, released in 2006.",
            "GTA Liberty City Stories This forum is dedicated to GTA: Liberty City Stories - the first 3D portable Grand Theft Auto title, released in 2005.",
            "GTA San Andreas Gameplay, Mission Help, Guides & Strategies, Help & Support, PC Modding This forum is dedicated to GTA: San Andreas - the fifth title in the series, released in 2004.",
            "GTA Vice City Gameplay, Guides & Strategies, Help & Support, PC Modding This forum is dedicated to GTA: Vice City - the fourth title in the series, released in 2002.",
            "GTA III Gameplay, Guides & Strategies, Help & Support, PC Modding This section is dedicated to Grand Theft Auto III - the first 3D title in the series, released in 2001.",
            "Top Down Games GTA Advance, GTA 2, GTA This section is dedicated to the 2D Grand Theft Auto titles, including the original, GTA 2, and GTA Advance.",
            "GTA Series GTA Concepts General chat related to the series. This section can also be used to post concept threads for new GTAs."
        ],
        [
            "Stats",
            "85,142 topics 2,125,812 replies",
            "85,560 topics 1,154,066 replies",
            "1,071 topics 11,072 replies",
            "4,218 topics 64,767 replies",
            "5,996 topics 75,824 replies",
            "50,548 topics 466,276 replies",
            "22,767 topics 196,326 replies",
            "4,274 topics 60,510 replies",
            "1,127 topics 8,220 replies",
            "3,608 topics 115,681 replies"
        ],
        [
            "Last Post Info",
            "Windows10 - wow, performance! By DavidTheThird 2 minutes ago",
            "You know when you've pl... By PhillBellic An hour ago",
            "6 Star Wanted Level Survival? By Militia 17 hours ago",
            "Is Victor Vance the most hu... By crashrock2 15 minutes ago",
            "Unique Vehicles By Militia 31 minutes ago",
            "GTA San Andreas Remastered... By Megazocker 21 minutes ago",
            "In what order did you do th... By Spadge007 An hour ago",
            "Cool Things You Didn't... By Canadian Badass An hour ago",
            "What are the cops actually... By Jeansowaty 21 hours ago",
            "Grand Theft Auto - Memes By Mr. Fahrenheit 7 minutes ago"
        ]
    ],
    "pageTitle": "GTAForums",
    "title": "",
    "url": "http://gtaforums.com/index.php?act=Post&CODE=06&f=265&t=200363&p=1057758522",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 1,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989043.35/warc/CC-MAIN-20150728002309-00135-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 104718943,
    "recordOffset": 104696589,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{12560=This forum is dedicated to GTA: Vice City Stories - a prequel to GTA: Vice City, released in 2006., 18759=This forum is dedicated to GTA: Vice City - the fourth title in the series, released in 2002., 14159=This forum is dedicated to GTA: Liberty City Stories - the first 3D portable Grand Theft Auto title, released in 2005., 16471=This forum is dedicated to GTA: San Andreas - the fifth title in the series, released in 2004., 20889=This section is dedicated to Grand Theft Auto III - the first 3D title in the series, released in 2001., 47581=Google, A8ul99, Gummy , Yahoo, JakeR96, Stidge uk, EvilKin, Bing, March 10th, Andreaz1, MeatSafeMurderer, SilentSeasons, Y_Draig_Bryste, SchoolOfHardKnocks, Viper5900, DavidTheThird, Xing of Virtue, lolznc, Parikshit Singh, WinkingSkeever6, Xoonia, thewhitehammer99, REXX93, lulzmodder, RJSanModder, PondNewt, DJQuaie, Wombater, GeneralSteve93, j0ffline, HulioG, NightSpectre, Royal22, epoxi, Progen, Smesi, ire1987, SlingShot753, NinjaBeezy, dewtech_2008, PSMP666, zmudziak32, miclin, VODKAH, Non Fiction, Phyxsius-, The Lone Wanderer, EF2000, Silent, xink, -Z31N-, ThirteenAG, Citron_XY, wtf is a madrazo, PhillBellic, Riprock, Ayr utd 1910, chet87, CyberGhost101, Xenome13, BeckermannDewitt, JT-x, m3tal z_DKI, Cancerslug, wannaslide, SKARFACE, Dirtbag, mirthless, FlexPiTo, TomVDC, Hylskriksen, U.N.K.N.O.W.N, 351papapa, ZANTHERA, OBeef619, Mr. Fahrenheit, SharkySoulja, josephene123, Quebahombre, Sea Bear, Captain Sensib1e, stephcurryMVP, Cars247, alexthingy, PSgtaplayer1, torresno9, SILENCOM, topkek, ps3carmeets, gta forum user, Jeansowaty, ZODIAC 4 v2, Alec Skorpio, Ak47clower, ollymonger, erkwang, frodzet, Elite_Task_Force, D9fred95, XenoxX, Eqaulo, AllNighter1, ScarySKRILLEX, MarshallRawR, Shy, STEEZYR, SM64Guy, Gmanawesomeness, Meegoo, Johnny Alpha, kittitch, ashbashbluesfan, Saint_Jackie, COYBIG88, Hjaere, bulldog385, GTA3Rockstar, Corndog93, dr.krap, Johnny Playert, Mithridates158, Tycek, Halal Cyborg, dice, Total Failure, ISOFX, lazlow555, Google Mobile, CoreyHUN, NikoB08, SkynetOnlineID, da_illest101, jiggaman1, Schachmatt777, Joeysa, Sky_Light12, Sonsalt, CML99, Scottish71, svanderman, SkittyM, gizz01, EM_JAY_86, VRZD, DOCTOR USS875, Conici, A Siente, Richardbrown30, LordRaijin, Eggobites90, xXepicjasaXx, DumbForum, shadowoperative, TalkingPear, Pete4000uk, Joe9411, Zook, KlIIUMlNATl, DoctahWong, Xorthian, Ukeman5, thomasrwx, GTAVNoob, Owl Man, Ray, Ben_GTAV, Jinx., Claude Liberty, MisterMagnifico1, Verlotsky, RockstarsPlayer, ~TKP~, Pikas_PK, Trishan99, Fonshway, Tylomon, MakG, paperbagdude, Andreas, SuperHolySheep, ReaperCrew, r0eladn, TCMike, Shotty Pop, jvaccaro, KadeTheCaptain, kBlaise, gtaforums2, r.lorenzo13, Carbonox, ZyDevs, UshaB, Misunderstood, missanthropy, Days Are Gone, Kixa, arewenotmen, HipsterHillbilly, Frauenarzt, BlackMilk, HumanRacehorse, Mr.MT23, zSaintX, #####, CosmoMau5, Barrett_killz, TheDeathRises, Marpmarp, Epic., hitman774, Mottershead, hoopz71, FredZ, Svip, 104618=© 2001-2015 GTANet.com | Cookies and Privacy Policy | Copyright Statement, 9334=This section is dedicated to Grand Theft Auto IV - the ninth title in the series, released in 2008.}",
    "textBeforeTable": "Toggle Grand Theft Auto Grand Theft Auto (adsbygoogle = window.adsbygoogle || []).push({}); A minute ago By EvilKin The Cherry Popper Ice Cream... 613,874 replies 15,208 topics Social lounge for multiplayer crews & forum gangs. Recruitment Crews & Gangs A minute ago By Y_Draig_Bryste Heists invites - can't... 2,286,843 replies 113,534 topics This is a general discussion forum for Grand Theft Auto Online.",
    "textAfterTable": "Toggle GTA Mods GTA Mods   Forum Stats Last Post Info GTA Modding GTA V, GTA IV, GTA III, VC & SA, Tutorials, Art Support General discussion and support. 48,480 topics 416,701 replies [C#] Get Closest Ped By LetsPlayOrDy 2 minutes ago Mod Showroom Scripts & Plugins, Maps, Total Conversions, Vehicles, Textures,",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}