{
    "relation": [
        [
            "Forum",
            "Dell",
            "Dell",
            "Dell",
            "Dell",
            "Dell"
        ],
        [
            "Title",
            "Inspiron 6400 , HDD",
            "DELL INSPIRON 6400 Drivers for WINDOWS 2003 SERVER",
            "microphone in inspiron 6400?",
            "Can Inspiron 6400 be set to low power download while off?",
            "\"repaired\" Inspiron 6400 reformat problems"
        ],
        [
            "Date",
            "Aug 26, 2008",
            "Jul 7, 2008",
            "Jun 6, 2008",
            "May 25, 2008",
            "May 8, 2008"
        ]
    ],
    "pageTitle": "Inspiron 6400 won't power up | NotebookReview",
    "title": "",
    "url": "http://forum.notebookreview.com/threads/inspiron-6400-wont-power-up.138710/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 0,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986423.95/warc/CC-MAIN-20150728002306-00284-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 97316007,
    "recordOffset": 97299613,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{10500=Discussion in 'Dell' started by steve987, Jul 7, 2007.}",
    "textBeforeTable": "Similar Threads: Inspiron 6400 Show Ignored Content (You must log in or sign up to reply here.) #2 kowell, Aug 16, 2007   This Combinaison of flashing (3 oranges and 1 green) means your battery is busted. (not to be confused with a regular flashing wich means your battery is too hot). I had to change my 9 cell battery after just 1 year and it's easy to find similar cases on a lot of forums. You can also check your battery health's meter. Turn your battery and use the charge meter button's secondary fonction. Keep it pressed down for 5 to 10 seconds and check the lights. In this mode, each lit up light represents a 10-15&#37; degradation. If all 5 lights are lit up, less than half of your battery's \"health\" remains and the laptop will refuse to boot if the battery is inserted. You can however continue to use the laptop with the battery out and the cord plugged in. Dell sells",
    "textAfterTable": "Thread Status: Not open for further replies. Share This Page Tweet Your name or email address: Do you already have an account? No, create an account now. Yes, my password is: Forgot your password? Stay logged in Sign up now!",
    "hasKeyColumn": true,
    "keyColumnIndex": 1,
    "headerRowIndex": 0
}