{
    "relation": [
        [
            "Categories",
            "Campus Safety",
            "Greek Life",
            "Clubs and Activities",
            "Great for these types of students",
            "Share any unusual traditions or locations on campus",
            "Bang for the buck",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "I heard they put more than 70,000 Cameras around the campus for safety.",
            "Lots of tutors do free lecture and you just have to find your ads on Mybama.ua.edu.",
            "Rec Center is the greatest club activities that I can recommend.",
            "Computer Science major students should often go to Help session that are in SERC 1016. It's very helpful and useful for their test or quiz.",
            "On Halloween night, they always throw a Halloween party in Gragos Hall.",
            "Lots of great opportunity to earn your money.",
            "There is Rec Center, and you can go to gym, swim, soccer, or play football. We also have great student bars around the stadium.",
            "Buffet! Great foods on Friday.",
            "Great dorm. Pretty clean and nice.",
            "It's extremely different depends on the instructors so I would make sure you pick right choice.",
            "Parking Pass is extremely expensive so I would recommend buy a bike or skateboard for the trip to class.",
            "It has amazing campus that are beautiful and enjoyable for students. The school work is bit tough but you can get through with it with lots of co-students. UA has the most great stadium in nation and great football team."
        ]
    ],
    "pageTitle": "The University of Alabama (UA) Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/The-University-of-Alabama/reviews?_escaped_fragment_=/show/79107",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 125,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987662.63/warc/CC-MAIN-20150728002307-00342-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 169713191,
    "recordOffset": 169535715,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{42426=There are hundreds of student organizations for people to join and if you like playing pickup games of football or ultimate frisbee, there are games pretty much daily and all day on non football weekends. I am defiantly a Crimson Tide football fan but not to the level seen by most of the students here. After three years, Saturdays in fall have lost their edge a little and I do not look forward to the massive overcrowding and crazy traffic that football weekends bring. The Rec Center is great (though very crowed in August, September, January, and February) and I love playing intramural sports there. I guess my biggest hang up here is again, the culture., 599575=I've had an unlimited meal plan for two years now. That's all day every day, anything in the dining hall you want, as long as it's open. There are four dining halls on campus and they all have their pros and cons, but overall there is nothing to complain about and there is something open from 7:15 am to 1am on weekdays and from 10:30am to 8:30pm on weekends., 512296=There are so many clubs and activities here! During Get on Board Day in September, hundreds of organizations have tables set up around the student center for you to look around for something that catches your eye! There truly is an organization on campus for everyone!, 622072=Why is an elephant the mascot of the University of Alabama? Alabama became associated with the elephant during the 1930 season when Coach Wallace Wade put together one heck of a Crimson Tide football team. On October 8, 1930, Everett Strupper, a sports writer for the Atlanta Journal wrote a story about the Alabama-Mississippi game. Strupper wrote, That Alabama team of 1930 is a typical Wade machine, powerful, big, tough, fast, aggressive, well-schooled in fundamentals, and the best blocking team for this early in the season that I have ever seen. When those big brutes hit you I mean you go down and stay down, often for an additional two minutes. Coach Wade started his second team that was plenty big and they went right to their knitting scoring a touchdown in the first quarter against one of the best fighting small lines that I have seen. For Ole Miss was truly battling the big boys for every inch of ground. At the end of the quarter, the earth started to tremble, there was a distant rumble that continued to grow. Some excited fan in the stands bellowed, 'Hold your horses, the elephants are coming,' and out stamped this Alabama varsity. And, voila... the Alabama elephant was born., 978407=© 2015, Cappex.com, LLC, 96864=The dorms at school here are excellent. Alabama is constantly renovating and building new dorms on campus. In fact, a new one is set to be finished in 2014. The new dorm will be a clone of the one opened for the 2012 year. I would like to sound humble, but it is quite impressive., 502347=Our freshman class of 2012 is represented by 49 states and a few different countries. Make friends and get to know everyone. The rec center is a great place to hang out and make friends, 18054=I love The University of Alabama environment. It is my home away from home. During the week the campus environment is very relaxing and displays an easy-going vibe. People are friendly and helpful as well. Along with relaxing environment the campus is full of traditions. On game days there is not a dull moment. The University of Alabama football team won the 2009 National Championship and a member of the team won the Heisman Award in 2009 as well. Those two victories excites the students as well as fans. Game days are a blast at The University of Alabama., 39481=An expansion on what I see as the campus culture: Ive already touched on the somewhat dysfunctional academic culture that is present here and the fact that this is foremost a party school, but despite what the school shows in its advertising campaigns or student tours, the culture here is generally not one of diversity, tolerance, and inclusion. It seems every year we have a huge race issue or greek vs. independent issue, among the more frequent minor events, that pours salt into old wounds and deepens the divides of the student body. There are certainly pocket-environments where minorities of all types will find acceptance and there are student groups that work very hard to mend divides and make the culture more inclusive, but on the aggregate this is not the most welcoming place for people who are not white, male, and cis-gendered (disclaimer on perspective- I am all three of these) A word on the administration: President Witt was hired in 2003 with a ambitious plan to raise school enrollment among other things. He succeeded in hitting his 28,000 goal four years early, and new goals have been set to continue to grow the campus enrollment in the future. In this lies one of the fundamental problems with this school; money has become more important than the quality of the student experience here (though this is probably also the case for any large state-school). This is a point where the campus badly needs a moratorium on enrollment increase to address transportation issues, update dorms, deal with the rampant overcrowding seen in some areas/buildings on campus, and address other important issues. From my perspective and the perspective of many other students, the administration is ignoring the what is best for the student body because of a drive to increase their numbers and their prestige too quickly., 246965=Apply early, as most of the scholarships are given by December., 578866=Computer Science major students should often go to Help session that are in SERC 1016. It's very helpful and useful for their test or quiz., 111649=Apply early, because you can get your notice of admission very fast with no strings attached. Your SAT score matters a lot; if your composite score is greater than 1400, you will receive free tuition. If your composite score is greater than 1350, you will receive 2/3 off of the current tuition. It goes on down like this so Alabama is actually very affordable if you have good test scores. If you have any interest at all, apply to the Honors College. Admissions are not extremely competitive, but allow you a smaller community rooted in intellectualism. Honors classes are really interesting, fun, and typically not more difficult than other classes, just different and usually more discussion-based. Honors students also receive great benefits like early registration, etc. If you visit (which you should) go to an event that you're interested in. Campus tours are informative but don't really tell you about campus culture., 779339=The Greek Life at this campus is the largest in the nation. They are very active on campus. They have large houses that both surround the stadium and another location on campus. The sorority rush process occurs the week before school starts in August. It is a very welcoming community that offers many opportunities on and off campus., 785188=The University of Alabama is filled with traditions that have been around since its founding in 1831. A student will get the full college experience at this University. This University will allow you to make as much or as little of your experience as possible; you just have to be willing to do a little work to make the connections you desire., 722259=Academics are extremely competitive at UA. Honors takes up 30% of the school. Having a minimum of a 3.5 and 1600 on SAT is recommended. If you're out of state, it's easier to get into the school. There's more competition for in-state student prospects., 851462=The pre game rally and march to the stadium on game days is a spectacular sight to see, 128643=The University of Alabama has a great engineering college. If you want to become an engineer then U of A could be the place for you. There are loads of opportunities for mentoring and research in the different fields. I have expanded my knowledge of engineering a lot since classes began in August., 184004=apply for scholarships early! i think the priority deadline that you should aim for is december 1. look into the blount undergraduate initiative and the honors college., 400657=The dorm life is great at UA. They match you up with someone that has similar likes and dislikes of your characteristics. The dorms are nice. They are building a brand new dorm,which will be up fall of 2013. This dorm should have a cafe in it and a small gym in it as well., 758704=Make sure you get your scholarship application in!!! Go to camp 1831 and get on board day!}",
    "textBeforeTable": "07/09/2009 Reviewer is A current student here. 57 out of 59 people found this review useful. 1 of 209 Brittney from Birmingham, AL Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for",
    "textAfterTable": "Am learning a lot Coming from the International Baccalaureate school The University of Alabama has not been a very challenging school. If you were a well-versed academic student during your time in high school do not expect any of the core classes to give you much trouble. It is only when you begin to move in your area of expertise that you will find the difficulty increasing. I feel I was thoroughly prepared for the University of Alabama so academically wise I do not believe it has granted me much. I will admit socially Alabama has vigorously heightened my understanding towards dealing with other people. At Alabama you learn interactions with a plethora of varying students, especially if you are in a Living Learning Community or The Honors College, will be inevitable. Login to rate or flag the reviews Chelsey from Jamestown, NC 10/14/2010 Reviewer is A current student here. 9 out of 10 people found this review useful. 3 of 209 Categories Comments Great for these types of students Every type",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}