{
    "relation": [
        [
            "Condition:",
            "Length:",
            "Country of Manufacture:"
        ],
        [
            "Used: An item that has been used previously. The item may have some signs of cosmetic wear, but is fully operational and functions as intended. This item may be a floor model or store return that has been used. See the seller’s listing for full details and description of any imperfections. See all condition definitions- opens in a new window or tab ... Read moreabout the condition",
            "11 ft. 2 in.",
            "United States"
        ],
        [
            "Board Type:",
            "Bundled Items:",
            ""
        ],
        [
            "All-Around, Children, Surf",
            "Board Carry Straps/Sling, Deck Pad, Fins, Paddle",
            ""
        ]
    ],
    "pageTitle": "",
    "title": "",
    "url": "http://www.ebay.ca/itm/SUPCO-Paddle-Board-FREE-Carbon-Adjustable-Paddle-/161264004425?pt=LH_DefaultDomain_0&hash=item258c156d49",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988310.3/warc/CC-MAIN-20150728002308-00242-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 413441631,
    "recordOffset": 413396035,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Item specifics View all revisions Last updated on  Apr 09, 2014 05:59:17 EDT  Seller assumes all responsibility for this listing. 161264004425 eBay item number: Shipping and payments Description current Report item - opens in a new window or tab Covers your purchase price and original shipping. Get the item you ordered or get your money back. Money Back Guarantee  | See details - opens in a new window",
    "textAfterTable": "(1) Limited Edition SUP Company TD49 Signature Black Stand Up Paddle board 11'2\" with fin, deck pad and 2 extra fins for surfing. This Signature board Series model reflects the paddling and SUP surfing style of SUPCO owner and founder, Tommy Donnelly. The PVC foam layer gives the board a lighter weight making it easy to maneuver while paddling or surfing. With a round pin tail and tri-fin set up, this board will give you a lot of drive and turning on a wave. Extra length also supplies more stability for the bigger paddler. Features: Tri-fin set up, fingure contour grip. Construction: EPS foam core, reinforced sealed rails, nose and tail, dual layers of 4 oz. fiberglass cloth with epoxy resin and a PVC foam layer.  Great condition.  Normal wear for a few times used. Questions and answers about this item No questions or answers have been posted",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}