{
    "relation": [
        [
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            ""
        ],
        [
            "Forum",
            "GTA V PC, Gameplay, Guides & Strategies, Help & Support This forum is dedicated to discussion about the latest installment in the series, Grand Theft Auto V.",
            "GTA IV PC, Gameplay, Episodes from Liberty City, Multiplayer, Guides & Strategies, Help & Support This section is dedicated to Grand Theft Auto IV - the ninth title in the series, released in 2008.",
            "GTA Chinatown Wars This forum is dedicated to GTA: Chinatown Wars - the tenth game in the series, and the first to be developed for Nintendo DS.",
            "GTA Vice City Stories This forum is dedicated to GTA: Vice City Stories - a prequel to GTA: Vice City, released in 2006.",
            "GTA Liberty City Stories This forum is dedicated to GTA: Liberty City Stories - the first 3D portable Grand Theft Auto title, released in 2005.",
            "GTA San Andreas Gameplay, Mission Help, Guides & Strategies, Help & Support, PC Modding This forum is dedicated to GTA: San Andreas - the fifth title in the series, released in 2004.",
            "GTA Vice City Gameplay, Guides & Strategies, Help & Support, PC Modding This forum is dedicated to GTA: Vice City - the fourth title in the series, released in 2002.",
            "GTA III Gameplay, Guides & Strategies, Help & Support, PC Modding This section is dedicated to Grand Theft Auto III - the first 3D title in the series, released in 2001.",
            "Top Down Games GTA Advance, GTA 2, GTA This section is dedicated to the 2D Grand Theft Auto titles, including the original, GTA 2, and GTA Advance.",
            "GTA Series GTA Concepts General chat related to the series. This section can also be used to post concept threads for new GTAs."
        ],
        [
            "Stats",
            "85,098 topics 2,123,769 replies",
            "85,550 topics 1,153,592 replies",
            "1,071 topics 11,069 replies",
            "4,218 topics 64,757 replies",
            "5,996 topics 75,810 replies",
            "50,538 topics 466,152 replies",
            "22,766 topics 196,284 replies",
            "4,270 topics 60,436 replies",
            "1,128 topics 8,214 replies",
            "3,598 topics 115,166 replies"
        ],
        [
            "Last Post Info",
            "Throttle control. By CarnageRacing00 A minute ago",
            "Reasons why GTA IV is bette... By CarnageRacing00 5 minutes ago",
            "The Ultimate 100% Save File... By Militia A day ago",
            "The Ultimate 100% Save File... By Militia 7 hours ago",
            "Whats your favorite/hated r... By Kristian. 3 hours ago",
            "New Model Army By mikey_1982 2 hours ago",
            "Something that has always b... By spaceeinstein 44 minutes ago",
            "Grand Theft Auto III Chain... By Kristian. 3 hours ago",
            "Anybody has a 100 % savegame? By Cerium 22 hours ago",
            "Create your own radio stati... By Sayuri 3 minutes ago"
        ]
    ],
    "pageTitle": "GTAForums",
    "title": "",
    "url": "http://gtaforums.com/index.php?act=Post&CODE=06&f=58&t=484568&p=1060671695",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 1,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986615.83/warc/CC-MAIN-20150728002306-00026-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 103889519,
    "recordOffset": 103862564,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{20909=This section is dedicated to Grand Theft Auto III - the first 3D title in the series, released in 2001., 134511=© 2001-2015 GTANet.com | Cookies and Privacy Policy | Copyright Statement, 12581=This forum is dedicated to GTA: Vice City Stories - a prequel to GTA: Vice City, released in 2006., 16607=This forum is dedicated to GTA: San Andreas - the fifth title in the series, released in 2004., 9287=This section is dedicated to Grand Theft Auto IV - the ninth title in the series, released in 2008., 47393=Boooster, jaskdavis, Yahoo, Google, Bing, Lay, SuperGTFan, SilentSeasons, ViciousSpirit, Lion, Feurian42, BeckermannDewitt, CarnageRacing00, theGTAking101, Der_Don, Edmachine, roboticsuperman, s2n vaniish, Rangerlump, Jinx., BlackMilk, p-s-3x, Max Payne, SirBurka_, GTAKid667, Shenmue18, craigdyid, Beto2O, BRITLAND, deadx23, Pavle, Wolf., Google Mobile, Lowi, zzACE91zz, H52VERGR52VER, Judicious 7, Lebowski_RS, Lilscotton, ClaudeSpeed1911, Tossin Salad, RiozoR, The Hero, SumSkittles, misak, fish61324, gangrel669, FlightOfIcarus, Officer Vic, CrazyTigerGamimg, _CP_, Stephan90, JesusFR33K, ErMerGerd, IIOctaneII, Daz, FiS!!HeR, jiggaman1, Miss Blossom, thatmobster, ZeroSafe5615, HulioG, TheMcSame, 22Laxer22, XJpostman, SagaciousKJB, Ninja Budgie, DaltonWilliams123, tweepey, gizz01, Twin Turbo, Midnight Hitman, Daemian, silverharbinger, Ivan1997GTA, NikkoCharger, diegomart123, Laguezmer, Andreas_XTC, Vassago1988, Girish, TalkToMyAgent, Jehannum, Retired Mafia, unikatil, Itzreality, CalebJKimbell, Guad, sebejszczyn, lecroc69, Breitsmeister, Craank_AG, GamesBoy316, Pegassi Autobot, The_Gardener, Skullkicker227, missanthropy, Tylomon, JakeHorgrove, killstreakmx, nmk111, Lord_Smasherton, StepNaza, scaldy78, Icantthinkofonew, Superfrogger, Mastah, Doc302, Jack_Coen88, Carface80, NotAHipster, marshallbslayer, Th3MaN1, unknown modder, Semaj 2JZ♢, Stoney0503, GipsyDanger MK2, SchoolOfHardKnocks, -Z31N-, sheepy111, Drunkmoons, SeBBy., A-Lonely-Dragon, HipsterHillbilly, yakprince, bronysplatter, rapidwiz, epoxi, DANIEL3GS, Kiyone_Alien_Cop, monkb4skunk, 313izzle, sivispacem, friendly luggage, Heisenberg_GR, psymin, jake-dk, MarQs, MrSaucyZ, arewenotmen, Arms Dealer, NikoBellicGTAIV, davidp027, ZANTHERA, XxKing69XavierxX, Spade115, DumbForum, floyd65, Cool Username, JohnnyCallisto, potato123, Halal Cyborg, Spectacus, Slam_Jones, Zkape, MePlayingGTA, Valanga, undertaker fan, GTA4LIFE9000, Jon3s, Progeekzy, thegough, Warliss, x_FRoe__, OysterBarron, J-B, Heists, -Velox, emiliumium, kk9fan97, AcidRunner, afrocan, USMCxMyth., Setzaroth, GVJLIMA, JuanG12, Miro, Majestic81, CeltHD, KingLouieThaXIII, foresaken1mc, Mike324467, m3tal z_DKI, flitcroft101, Andreas, RedDagger, Sparramadux, KornbreadMaf1a, We Are Ninja, Facebook, AeroAviation, fofofofofofofofo, blusunone, Synophrys, vnctmrn, maus05, feckyerlife, Claude Liberty, XB36Hazard, _Celldweller, ethandavo, Nima_1i, Sminky, GunsNroses61, ClareXoBearrx3, IgorX, o_Marvelous, Red Lynx 23, santtuu74., evGTA, MASTER GABE 202, FRArom, silenthunterdgm, starblind94, incognito32, shobhitlion, kensaundm31, Maresz55, cswood, CoCkPuNcH, J Cobra, paulmgrath, M4k3, SuperHolySheep, Kal74, size_m, Z i X, lester622, Sigurd, denis1379, Egonga, Fenton, xrk, Juicyfer, BlackNoise, Gytis-JDM, blacknambala, No_Flex_zone, Reywas1, nyvenom30, _Douglas_, PhilipTrevors, shadowkill98, vortexHD, GTAFanClub, MyName'sJeff, Rytherik, Stidge uk, Hunter241, harvecito, GAMIR_GTA, del__cielo, Gamerjman19, Fattypack, MilosNg, szczypior, Reno33, alexindex57, superkj210, citizenzombie., imakuni1995, hornedturtle, AnthMUFC-Champs, Officer Garza, Rippir1600, Mithridates158, __TheGovernor__, Fozzie_420, lord tammerlain, ClaudX, the nameless, Blade Kratos, TarHeelJohn, Vadim M., 12thmanfirefighter, Modojo, Black Terminator, Mokrie Dela, Imposssible, McH2Oz2, RustyShackleford, WhyDoINeedAName, ledzep71, TrickyTrifecta, Marwin, Ballistic Jello, greenghost2212, XIantonioIX, MR.V8, Verstappen, Imnotthefiveo, GypsyBastard, Krystofer, Jphunter0, YngDady, SkimpyTree, 458Speciale, Ed_Rich, JimmyFantastic, maxjulian49, RageJenB, Faultierspy79, Bangha, Ak47clower, Zook, BLOOD-MOND, Pigglesman, Tilley, LeoV, Cripto136, Masiku, kaasje, Chekoloco, lol232, icecoldkilla1467, SSKYZX, slackman98, m2roadwarrior, 65536, toxluv, GunTotinHippie, tizerist, Thompson98, frodzet, CptAngel, Markuza97, CartmanKusanagi, gfen, Biggie Deaf, Teezo, qiangqiang101, dyons, kKatie, blancosdos, Gtaultimatefanboy, 14299=This forum is dedicated to GTA: Liberty City Stories - the first 3D portable Grand Theft Auto title, released in 2005., 18764=This forum is dedicated to GTA: Vice City - the fourth title in the series, released in 2002.}",
    "textBeforeTable": "Toggle Grand Theft Auto Grand Theft Auto (adsbygoogle = window.adsbygoogle || []).push({}); A minute ago By Android Roman Bellic Enterprises 613,528 replies 15,193 topics Social lounge for multiplayer crews & forum gangs. Recruitment Crews & Gangs A minute ago By roboticsuperman Carbon RS or PCJ-600? 2,279,372 replies 113,228 topics This is a general discussion forum for Grand Theft Auto Online. Help & Support Guides",
    "textAfterTable": "Toggle GTA Mods GTA Mods   Forum Stats Last Post Info GTA Modding GTA V, GTA IV, GTA III, VC & SA, Tutorials, Art Support General discussion and support. 48,444 topics 416,564 replies GTA Modding - HELP By CalebJKimbell 9 minutes ago Mod Showroom Scripts & Plugins, Maps, Total Conversions, Vehicles, Textures,",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}