{
    "relation": [
        [
            "",
            "1998 1st quarter 10-Q Revenue Pre-tax earnings",
            "1998 2nd quarter 10-Q Revenue Pre-tax earnings",
            "1998 3rd quarter 10-Q Revenue Pre-tax earnings",
            "1998 10-K Revenue Pre-tax earnings",
            "1999 2nd quarter 10-Q Revenue Pre-tax earnings",
            "1999 3rd quarter 10-Q Revenue Pre-tax earnings"
        ],
        [
            "As Originally Reported",
            "27,699 411",
            "35,072 3,883",
            "41,261 7,166",
            "153,932 22,192",
            "42,202 4,188",
            "54,706 12,564"
        ],
        [
            "As Adjusted for Transactions",
            "25,963 (325)",
            "32,322 2,394",
            "38,303 5,721",
            "139,456 14,163",
            "40,849 3,252",
            "50,886 10,291"
        ],
        [
            "Amount of Overstatement",
            "1,736 736",
            "2,750 1,489",
            "2,958 1,445",
            "14,476 8,029",
            "1,353 936",
            "3,820 2,273"
        ],
        [
            "Percentage of Overstatement",
            "7% N/A",
            "9% 62%",
            "8% 25%",
            "10% 57%",
            "3% 29%",
            "8% 22%"
        ]
    ],
    "pageTitle": "FLIR Systems, Inc.: Admin. Proc. Rel. No. 33-8135 / September 30, 2002",
    "title": "",
    "url": "http://www.sec.gov/litigation/admin/33-8135.htm",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 4,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990611.52/warc/CC-MAIN-20150728002310-00275-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 697653837,
    "recordOffset": 697637443,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{21822=23. FLIR also improperly recognized revenue in 1998 totaling $1,700,000 on two transactions that were rentals. These sales were not sales in substance, as the earnings process had not been completed and the risks of ownership never transferred. Rather, as the lessor, FLIR should have recognized only the rental revenue earned from these two transactions.5, 28710=31. In each of these transactions, FLIR recognized revenue based upon an inadequate purchase commitment. For example, in the third quarter of 1999, FLIR recognized $2,650,000 as revenue in one transaction based upon a purported \"sale\" to a customer acting on behalf of a Middle Eastern government. For this transaction, FLIR obtained a letter of intent from the customer. FLIR relied upon the letter of intent even though it characterized the customer's commitment to purchase solely as an \"intent to purchase.\" The letter of intent also allowed the customer to change the configuration of the units and to set a delivery schedule in the future \"per Purchase Order requirement when issued.\" Because this letter of intent was not a binding commitment to purchase from either FLIR's customer or the end-user, FLIR should not have recognized revenue., 30775=34. In 1999, however, FLIR began to use the account as a place to hold accounting entries that were not reconciled to the general ledger. By the end of 1999, FLIR's finance department had made entries to project inventory causing FLIR to overstate its assets, specifically inventory, by $17.4 million and understate its expenses, largely cost of goods sold, by $15.4 million. These overstatements were spread among the quarters of 1999; FLIR overstated inventory by nearly $3.4 million in the first quarter, by $2.7 million in the second quarter, by $2.4 million in the third quarter, and by $8.9 million in the fourth quarter., 25318=27. During the last day of FLIR's first quarter in 1998, one of FLIR's customers submitted a contingent purchase order. The purchase order stated that the order could be revoked without penalty should the customer fail to obtain a contract with its end-user. Despite the outstanding contingency, FLIR shipped the units to its bonded warehouse, invoiced the customer, and improperly recognized $600,000 in revenue. Similarly, in a year-end 1998 transaction, FLIR management directed sales personnel to obtain a letter of intent from a customer ordering on behalf of a South American government. This letter of intent was contingent upon FLIR's customer securing a contract with the aircraft provider. Again, despite the outstanding contingency in the letter of intent, FLIR shipped two units for this order to the bonded warehouse on December 30, 1998, and improperly recognized $934,000 in revenue. FLIR's customer never obtained a contract with the aircraft provider nor did FLIR's customer ever pay FLIR. For both of these transactions, FLIR's finance department files contained documents that had been redacted to remove the language demonstrating that the sales were contingent., 3634=The Securities and Exchange Commission (\"Commission\") deems it appropriate that cease-and-desist proceedings be, and hereby are, instituted against FLIR Systems, Inc. (\"Respondent\" or \"FLIR\") pursuant to Section 8A of the Securities Act of 1933 (\"Securities Act\") and Section 21C of the Securities Exchange Act of 1934 (\"Exchange Act\")., 34806=41. As a result of the conduct described above, FLIR also violated Section 13(b)(2)(B) of the Exchange Act, which requires reporting companies to devise and maintain a system of internal accounting controls sufficient to reasonably assure that transactions are recorded and financial statements are prepared in conformity with generally accepted accounting principles. FLIR had insufficient internal controls to assure that it accounted for its revenue, expenses, and assets correctly throughout 1998 and 1999., 37589=7 A bill and hold transaction is generally a practice whereby a customer agrees to purchase goods but the seller retains physical possession until the customer requests shipment to designated locations. In 1986, the Commission articulated the following conditions for revenue recognition on bill and hold sales: (1) the risks of ownership must have passed to the buyer;, 19043=18. In another placeholder transaction, FLIR management directed sales staff to change product specifications on a sales order from the units ordered by the customer to other units that FLIR had in inventory and could ship by the end of 1998. A FLIR manager then directed his staff to provide the customer with FLIR's shipping account number and a return authorization number for the return of the improperly built units. The manager gave these instructions before the units were shipped to the customer because he knew that the units did not conform to the specifications in the purchase order. The improper units were shipped to the customer before year-end 1998 and were later returned to FLIR as pre-arranged., 29940=33. In 1999, FLIR used the \"project inventory\" account as a suspense account to hold returns, traded-in units, underabsorbed overhead, shutdown expenses for foreign operations, and other arbitrary entries. None of these entries were appropriate under GAAP, nor were they appropriate uses for the project inventory account. The project inventory account was intended to account for units removed from finished goods inventory by FLIR's engineers for use in research and development. Because FLIR still had an asset (the unit), the amounts in project inventory were accounted for as assets in inventory on FLIR's balance sheet. When the engineers were done using the unit, if it was undamaged, it was transferred back into finished goods inventory. If it was damaged, it was expensed to research and development costs., 32856=38. As a result of the conduct described above, FLIR also violated Section 10(b) of the Exchange Act and Rule 10b-5 thereunder, which prohibit misstatements or omissions of material fact in connection with the purchase or sale of securities. As discussed above, FLIR committed fraud when it filed periodic reports with the Commission for three quarters of 1998, three quarters of 1999 and year-end 1998 that misstated and misrepresented its financial condition and results of operations. FLIR overstated pre-tax earnings for each reporting period by a material amount in each of these reports. Moreover, FLIR falsely represented in these reports that it had complied with its stated revenue recognition policy., 20839=21. At the end of 1998, FLIR management directed sales staff to \"incentivize\" one of its customers to place an order. The customer had not yet finalized its own contract with its customer. FLIR management approved a side letter providing its customer with an unconditional right of return within 60 days and extended payment terms to induce the customer to place the order before December 31, 1998 - even though the customer did not want the unit until June 1, 1999. The customer's purchase order did not reflect these terms but it did reference the side agreement., 13793=11. Moreover, at year-end 1998, FLIR used a duplicate purchase order to recognize $1,055,154 in revenue. In December 1998, FLIR received a purchase order from a customer acting on behalf of a U.S. government agency. This purchase order had two duplicate pages attached to it. These carbon copy pages were separated and used to create two orders - instead of the one order actually placed by the customer - and FLIR recognized revenue on both of these orders at year-end 1998., 11335=7. In 1998 and 1999, FLIR engaged in six improper revenue recognition practices: (1) booking false sales; (2) shipping placeholders; (3) entering into side agreements with customers providing rights of return or contingencies; (4) booking rental agreements as sales even though title to the product did not transfer to the renter; (5) recognizing revenue on sales with consignment or contingency language in the purchase orders; and (6) recognizing revenue for improper bill and hold transactions., 33575=39. Further, as a result of the conduct described above, FLIR violated Section 13(a) of the Exchange Act and Rules 12b-20, 13a-1, and 13a-13 thereunder, which require issuers of securities registered pursuant to Section 12 of the Exchange Act to file accurate periodic reports on Forms 10-K and 10-Q. These reports must contain any material information necessary to make the required statements made in the reports not misleading. As previously discussed, FLIR filed periodic reports with the Commission that misrepresented its financial results. FLIR's Form 10-K for 1998 and all three Forms 10-Q for 1999 were restated; FLIR's Form 10-K was restated twice., 34241=40. In addition, as a result of the conduct described above, FLIR violated Section 13(b)(2)(A) of the Exchange Act, which requires reporting companies registered under Section 12 of the Exchange Act to make and keep books, records, and accounts which, in reasonable detail, accurately and fairly reflect the transactions of the issuer. In 1998 and 1999, FLIR's books and records were not merely inaccurate, they were intentionally falsified. FLIR's multiple restatements demonstrate that FLIR's books and records were not accurate throughout 1998 and 1999., 8360=6. FLIR fraudulently recognized revenue for numerous transactions in 1998 and 1999. The table below sets forth the revenue and pre-tax earnings as reported by FLIR and as adjusted for the transactions involving improper revenue recognition., 22242=24. In the larger of these transactions, FLIR entered into a joint venture with one of its customers, in which the customer rented FLIR units to its customers and shared the rental proceeds with FLIR. Pursuant to this joint venture agreement, FLIR's customer did not take title to the units. It never intended nor desired to own the units - a fact communicated to FLIR. Nevertheless, FLIR required the customer to submit a purchase order to FLIR for five units valued at $1,200,000. The customer's purchase order stated that the order was subject to attached terms. FLIR management relied on this purchase order to approve the entry of a sales order, even though the purchase order referenced additional terms. The terms referenced in the purchase order consisted of a draft lease agreement. This agreement specified that title to the units remained with FLIR throughout the duration of the agreement. The customer and FLIR executed a lease agreement containing that provision in 1999 - after FLIR had recognized revenue for the transaction., 27355=29. FLIR also improperly recognized $6,228,000 as revenue in 1998 and 1999 based upon non-binding letters of intent or other non-binding documents, in violation of bill and hold requirements articulated by the Commission., 32377=37. As a result of the conduct described above, FLIR violated Section 17(a) of the Securities Act, which prohibits making untrue statements of material fact or omitting to state material facts in the offer or sale of securities. As discussed above, FLIR committed fraud when it filed two registration statements in June 1998 and December 1999 that misstated and misrepresented its financial condition and results of operations by overstating revenue and pre-tax earnings., 36368=3 FLIR recognized revenue on two transactions at year-end 1998 as sales to the sales representative. Because both of these sales were based upon letters of intent, and the facts surrounding both transactions are similar, they are discussed as one transaction., 7931=5. FLIR restated its 1998 and 1999 financial statements three times in 2000 and 2001 to correct these misstatements. Since May 2000, FLIR has undertaken remedial measures and obtained new independent auditors, a new Chief Executive Officer, new Chief Financial Officer, new treasurer, and new controller and new Vice President of Sales and Marketing., 26524=28. FLIR also improperly recognized revenue on consignment sales. In the second quarter of 1998, FLIR recognized $225,000 in revenue for a \"sale\" to a customer. The purchase order submitted by the customer stated specifically: \"Payment for each system to be made when a system is sold by [the customer] to an outside customer, or upon dedicated usage of a system by [the customer].\" Despite this language, FLIR recognized revenue on the sale. Similarly, in the third quarter of 1998, FLIR recognized $150,000 in revenue from a customer on a purchase order with similar contingent language. In the consignment sales, no end-user had even been identified at the time FLIR recognized the revenue., 6534=3. FLIR materially overstated its earnings before income taxes for each of the quarters of 1998 and 1999 as well as for fiscal year 1998. FLIR's fraudulent revenue recognition practices resulted in material misstatements and omissions in FLIR's financial statements contained in periodic reports filed with the Commission on Form 10-K as originally filed for the period ended December 31, 1998, and on Form 10-Q as originally filed for the periods ending March 31, 1998, June 30, 1998, September 30, 1998, March 31, 1999, June 30, 1999, and September 30, 1999., 31897=36. Further in 1998, FLIR overstated pre-tax earnings in its Form 10-K by $5.6 million through booking two receivables at FLIR's facilities in Portland and the United Kingdom. These receivables were double-counted in FLIR's accounts receivable balances at December 31, 1998. As a result, in the 1998 Form 10-K as originally filed, FLIR overstated accounts receivable by $6.7 million and earnings before income taxes by $5.6 million., 38023=(2) the customer must have made a fixed commitment to purchase the goods, preferably reflected in written documentation; (3) the buyer, not the seller, must request that the transaction be on a bill and hold basis and must have a substantial business purpose for ordering the goods on a bill and hold basis; (4) there must be a fixed schedule for delivery of the goods that is reasonable and consistent with the buyer's business purpose; (5) the seller must not retain any specific performance obligations such that the earnings process is not complete; (6) the ordered goods must have been segregated from the seller's inventory and not be subject to being used to fill other orders; and (7) the equipment must be complete and ready for shipment. See In the Matter of Stewart Parness, Exchange Act Release No. 23507, AAER No. 108 (August 5, 1986)., 5592=2. Throughout 1998 and 1999, FLIR's senior management established budgets and expected results for FLIR's growth, maintained sales and revenue data, and used that data to compare FLIR's actual results against both budgeted results and several analysts' estimates. FLIR's senior management met to discuss FLIR's performance. During these meetings, FLIR's management faced pressure to meet internal earnings projections. In periods preceding major events at FLIR, such as public offerings, bank loan approvals, or mergers, this pressure for results was exacerbated. To achieve expected results, FLIR engaged in improper revenue recognition practices. Additionally, FLIR used suspense accounts to overstate assets and understate expenses, and double-booked two accounts receivables, causing earnings to be overstated in 1998. FLIR's actual earnings per share generally met or exceeded analysts' estimates, although its revenues did not., 19773=19. In some placeholder transactions, FLIR management authorized the shipment of \"loaner\" units to customers when the units actually ordered by the customer could not be manufactured by FLIR. In the second and third quarter 1999 transactions, customers sought units of a technology still under development at FLIR. With management's knowledge, FLIR personnel shipped these customers \"loaner\" units while the desired units were being developed and manufactured. FLIR recognized revenue for the loaner units knowing they would be returned to FLIR once the customers received the newer technology units., 36691=4 Sales made contingent upon the resale of the product to an end-user cannot be recognized as revenue under GAAP. Statement of Accounting Concepts No. 5, ¶ 83. Sales with rights of return may be treated as revenue transactions if there is a history of such sales to provide a basis for estimating the amount of future returns and if income is reduced to reflect the estimated future returns through establishing a reserve for returned merchandise. See Statement of Financial Accounting Standards (SFAS) No. 48. FLIR met neither of these conditions for sales with rights of return in 1998., 13231=10. Similarly, FLIR recognized revenue totaling $1,115,000 in the third quarter of 1998 based on two non-existent orders. As with the false sale in the second quarter, in one transaction for $900,000, FLIR management made verbal representations to FLIR's finance personnel that a purchase order would be submitted the day after the quarter closed. Based upon these representations, FLIR recognized the revenue and reported the sale. FLIR's finance department files did not contain any purchase documentation from a customer for the $215,000 transaction., 7103=4. In 1998, FLIR reported pre-tax earnings of $411,000 in its Form 10-Q for the first quarter when FLIR actually had a loss of $325,000 for that quarter. FLIR reported pre-tax earnings in its Forms 10-Q for the second and third quarters of 1998 that were overstated by 62% and 25%, respectively. For the fiscal year 1998, FLIR overstated pre-tax earnings in its Form 10-K by 161%. In 1999, FLIR also understated losses before income taxes by 11% in its Form 10-Q for the first quarter; overstated pre-tax earnings by 578% in its Form 10-Q for the second quarter; and overstated pre-tax earnings by 60% in its Form 10-Q for the third quarter. Additionally, FLIR filed two registration statements, one in June 1998 and the other in December 1999, that incorporated and re-reported these overstatements of pre-tax earnings., 18068=16. Once FLIR's representative sent the letters of intent to FLIR, FLIR management instructed the sales staff to create sales orders in FLIR's accounting system. Because the sales orders were based on non-binding letters of intent, FLIR management had to approve the entry of the orders into the system. Further, FLIR did not have sufficient items in stock to fulfill the \"order.\" In order to recognize revenue in 1998, FLIR management chose substitute units to ship to the bonded warehouse different from those specified in the letters of intent., 12745=9. In a transaction in the second quarter of 1998, the purported customer never submitted a purchase order, and had no intention of purchasing systems from FLIR during that quarter. Nevertheless, FLIR recognized $630,000 in revenue based solely on management's unverified representations that a purchase order was forthcoming. FLIR failed to reverse the sale until the commencement of the 1998 year-end audit even though the purported customer never submitted a purchase order., 21422=22. FLIR, however, took no steps to ensure that revenue was not recognized on the transaction. As a result, FLIR recognized revenue in 1998 for this transaction in violation of GAAP.4 Ultimately, the customer never obtained a contract from its end-user and never paid FLIR for this unit., 17040=15. At year-end 1998, FLIR recognized $4.1 million in revenue by shipping placeholder units to the bonded warehouse based on two letters of intent provided by one of FLIR's independent sales representatives in South America.3 In October 1998, FLIR learned that Congress was considering legislation to use funds to purchase helicopters for drug interdiction efforts in South America. From October 1998 through December 16, 1998, FLIR management pressured its sales staff to obtain a contract from the helicopter manufacturer for the purchase of FLIR units to use in the drug interdiction effort. When the helicopter manufacturer declined to issue a contract before year-end 1998, FLIR management instructed the sales staff to obtain letters of intent from FLIR's own representative instead. These letters of intent were not binding obligations to purchase. In fact, FLIR management knew that FLIR's representative had no obligation to purchase or pay for the units., 4056=In anticipation of the institution of these proceedings, Respondent has submitted an Offer of Settlement (the \"Offer\") which the Commission has determined to accept. Solely for the purpose of these proceedings and any other proceedings brought by or on behalf of the Commission, or to which the Commission is a party, and without admitting or denying the findings herein, except as to the Commission's jurisdiction over it and the subject matter of these proceedings, Respondent consents to the entry of this Order Instituting Proceedings Pursuant to Section 8A of the Securities Act of 1933 and Section 21C of the Securities Exchange Act of 1934, Making Findings and Imposing Cease-and-Desist Order (\"Order\"), as set forth below., 20441=20. At year-end 1998, FLIR engaged in at least three transactions in which it offered additional terms to its customers in side agreements containing rights of return, special discounts, contingencies, consignment sales, or rental terms. FLIR management approved these side agreements. When FLIR recognized revenue on sales containing these side agreements, it did so in violation of GAAP.}",
    "textBeforeTable": "I. The Securities and Exchange Commission (\"Commission\") deems it appropriate that cease-and-desist proceedings be, and hereby are, instituted against FLIR Systems, Inc. (\"Respondent\" or \"FLIR\") pursuant to Section 8A of the Securities Act of 1933 (\"Securities Act\") and Section 21C of the Securities Exchange Act of 1934 (\"Exchange Act\"). II. In anticipation of the institution of these proceedings, Respondent has submitted an Offer of Settlement (the \"Offer\") which the Commission has determined to accept. Solely for the purpose of these proceedings and any other proceedings brought by or on behalf of the Commission, or to which the Commission is a party, and without admitting or denying the findings herein, except as to the Commission's jurisdiction over it and the subject matter of these proceedings, Respondent consents to the entry of this Order Instituting Proceedings Pursuant to Section 8A of the Securities Act of 1933 and Section 21C of the Securities Exchange Act of 1934, Making Findings and Imposing Cease-and-Desist Order (\"Order\"), as set forth below. III. On the basis of this Order and Respondent's Offer, the Commission finds1 that: Respondent 1. FLIR is an Oregon corporation headquartered in Portland, Oregon. Its common stock is registered with the Commission pursuant to Section 12(g) of the Exchange Act and trades on the Nasdaq National Market System. FLIR designs and manufactures thermal imaging and broadcast camera systems that detect infrared radiation. Its customers include commercial and government users, and its products are used for environmental",
    "textAfterTable": "7. In 1998 and 1999, FLIR engaged in six improper revenue recognition practices: (1) booking false sales; (2) shipping placeholders; (3) entering into side agreements with customers providing rights of return or contingencies; (4) booking rental agreements as sales even though title to the product did not transfer to the renter; (5) recognizing revenue on sales with consignment or contingency language in the purchase orders; and (6) recognizing revenue for improper bill and hold transactions. False Sales 8. FLIR recognized $2,800,154 in revenue on four false sales as follows: Initial Reporting Period Amount of Transaction Improperly Recognized 2nd Qtr. 1998 Form 10-Q $630,000 3rd Qtr. 1998 Form 10-Q $900,000 3rd Qtr. 1998 Form 10-Q $215,000 1998 Form 10-K $1,055,154 9. In a transaction in the second quarter of 1998, the purported customer never submitted a purchase order, and had no intention of purchasing systems from FLIR during that quarter. Nevertheless, FLIR recognized $630,000 in revenue based solely on management's unverified representations that a purchase order was forthcoming. FLIR failed to reverse the sale until the commencement of the 1998 year-end audit even though the purported customer never submitted a purchase order. 10. Similarly, FLIR recognized revenue totaling $1,115,000 in the third quarter of 1998 based on two non-existent orders. As with the false sale in the second",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}