{
    "relation": [
        [
            "State",
            "Illinois",
            "Indiana",
            "Iowa",
            "Michigan",
            "Minnesota",
            "North Dakota",
            "South Dakota",
            "Wisconsin",
            "",
            "Nation"
        ],
        [
            "Number of Schools",
            "244",
            "115",
            "87",
            "138",
            "107",
            "24",
            "23",
            "91",
            "",
            "5,564"
        ],
        [
            "Number of Borrowers in Default",
            "28,657",
            "20,987",
            "19,633",
            "25,082",
            "17,544",
            "887",
            "2,132",
            "8,441",
            "",
            "639,662"
        ],
        [
            "Number of Borrowers Entered Repayment",
            "218,078",
            "134,576",
            "112,933",
            "173,447",
            "146,031",
            "14,319",
            "17,935",
            "84,427",
            "",
            "4,647,698"
        ],
        [
            "Borrower Default Rate",
            "13.1%",
            "15.5%",
            "17.3%",
            "14.4%",
            "12.0%",
            "6.1%",
            "11.8%",
            "9.9%",
            "",
            "13.7%"
        ]
    ],
    "pageTitle": "Federal Loan Default Rates",
    "title": "",
    "url": "http://www.ohe.state.mn.us/mPg.cfm?pageID=826&1534-D83A_1933715A=06c9602cae3d935c33bf2f189c909a0373e78147",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 0,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990611.52/warc/CC-MAIN-20150728002310-00251-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 624527630,
    "recordOffset": 624519428,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{957=Even though Minnesota undergraduates default less than the national average, the 3-year default rate increased from 9 percent in Fiscal Year 2009 to 12 percent in Fiscal Year 2011. The number of students defaulting also increased from 9,457 to 17,888., 2135=The Minnesota Office of Higher Education monitors debt trends and evaluates state financial aid policies. In Fiscal Year 2013, Minnesota undergraduates received $1.5 billion from federal student loan programs. Search Financial Aid Awarded survey data to find amounts and types of federal loans and all other types of financial aid received by undergraduates attending Minnesota postsecondary institutions., 678=Fiscal Year 2011 default rates varied among Minnesota institutions from 28 to 1 percent.}",
    "TableContextTimeStampAfterTable": "{2854=A 3-year cohort default rate is the percentage of a school's borrowers who enter repayment on certain Federal Family Education Loan (FFEL) Program or William D. Ford Federal Direct Loan (Direct Loan) Program loans during a particular federal fiscal year (FY), October 1 to September 30, and default or meet other specified conditions prior to the end of the second following fiscal year., 2360=The Higher Education Opportunity Act of 2009 enacted by the U.S. Department of Education published regulations governing the calculation of cohort default rates. An institution's cohort default rate is calculated as the percentage of borrowers in the cohort who default before the end of the second fiscal year following the fiscal year in which the borrowers entered repayment. This extends the length of time in which a student can default from two to three years., 1997=Calculated July 26, 2014}",
    "textBeforeTable": "3-Year Official Cohort Default Rates, Minnesota and Surrounding States, FY 2011 Source: U.S. Department of Education Minnesota Students Default on Loans Less than Nation, 3-Year Default Rates, FY 2011 Fiscal Year 2011 default rates varied among Minnesota institutions from 28 to 1 percent. Even though Minnesota undergraduates default less than the national average, the 3-year default rate increased from 9 percent in Fiscal Year 2009 to 12 percent in Fiscal Year 2011. The number of students defaulting also increased from 9,457 to 17,888. At 12 percent, Minnesota's 3-year default rate ranked 32 compared to other states. New Mexico (21 percent) had the highest rate and North Dakota (6 percent) had the lowest rate. Nationally, the default rate was 14 percent. Undergraduate students attending Minnesota's colleges were less likely to default on federal student loans than their peers nationally, according to information published by the U.S. Department of Education. But Minnesota undergraduates were more likely to borrow than students in other states. Trends in Education Debt The Minnesota Office of Higher Education monitors debt trends and evaluates state financial aid policies. In Fiscal Year 2013, Minnesota undergraduates received $1.5 billion from federal student loan programs. Search Financial Aid Awarded survey data to find amounts and types",
    "textAfterTable": "Calculated July 26, 2014 Source: U.S. Department of Education, Office of Student Financial Aid Programs About Default Rates The U.S. Department of Education releases official cohort default rates once per year. The Higher Education Opportunity Act of 2009 enacted by the U.S. Department of Education published regulations governing the calculation of cohort default rates. An institution's cohort default rate is calculated as the percentage of borrowers in the cohort who default before the end of the second fiscal year following the fiscal year in which the borrowers entered repayment. This extends the length of time in which a student can default from two to three years. A 3-year cohort default rate is the percentage of a school's borrowers who enter repayment on certain Federal Family Education Loan (FFEL) Program or William D. Ford Federal Direct Loan (Direct Loan) Program loans during a particular federal fiscal year (FY), October 1 to September 30, and default or meet other specified conditions prior to the end of the second following fiscal year. Colleges and universities with consistently high student loan default rates over a period of three years may be denied participation in federal and state financial aid programs for their students. No institutions in Minnesota have been denied participation in recent years. More Information 3-Year Cohort Default Rates at Minnesota Institutions Trends (published October 2014)",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}