{
    "relation": [
        [
            "Citing Patent",
            "US7548752",
            "US7583745 *",
            "US8032145",
            "US8059589",
            "US8483691",
            "US8526963",
            "US8675509",
            "US20050096061 *",
            "US20050096062 *"
        ],
        [
            "Filing date",
            "22 Dec 2004",
            "3 Dec 2003",
            "12 Aug 2005",
            "8 Jun 2005",
            "18 Jun 2008",
            "18 Jun 2004",
            "3 Jun 2009",
            "1 Jun 2004",
            "18 Jun 2004"
        ],
        [
            "Publication date",
            "16 Jun 2009",
            "1 Sep 2009",
            "4 Oct 2011",
            "15 Nov 2011",
            "9 Jul 2013",
            "3 Sep 2013",
            "18 Mar 2014",
            "5 May 2005",
            "5 May 2005"
        ],
        [
            "Applicant",
            "Qualcomm Incorporated",
            "Nokia Corporation",
            "Qualcomm Incorporated",
            "Qualcomm Incorporated",
            "Qualcomm Incorporated",
            "Qualcomm Incorporated",
            "Qualcomm Incorporated",
            "Qualcomm Incorporated",
            "Ji Tingfang"
        ],
        [
            "Title",
            "Feedback to support restrictive reuse",
            "Exploiting selection diversity in communications systems with non-orthonormal matrix and vector modulation",
            "Restrictive reuse set management algorithm for equal grade of service on FL transmission",
            "Dynamic restrictive reuse scheduler",
            "Restrictive reuse for a wireless communication system",
            "Restrictive reuse for a wireless communication system",
            "Feedback to support restrictive reuse",
            "Layered reuse for a wireless communication system",
            "Restrictive reuse for a wireless communication system"
        ]
    ],
    "pageTitle": "Patent US7260077 - Adaptive scheduling for multi-carrier systems - Google Patents",
    "title": "",
    "url": "http://www.google.cl/patents/US7260077?ie=ISO-8859-1",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 7,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990611.52/warc/CC-MAIN-20150728002310-00061-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 489547375,
    "recordOffset": 489526729,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{31128=This application claims the benefit of provisional application Ser. No. 60/299,062, filed Jun. 18, 2001, the disclosure of which is hereby incorporated by reference in its entirety.}",
    "textBeforeTable": "Patent Citations These aspects of the invention can be implemented using alternative equations and relationships than those described in detail above. Those skilled in the art will recognize improvements and modifications to the preferred embodiments of the present invention. All such improvements and modifications are considered within the scope of the concepts disclosed herein and the claims that follow. Those skilled in the art will recognize various scheduling criteria to maximize throughput in addition to maximum CIR and proportional fairness scheduling. Further, different mobile terminals 12 may have different threshold throughput rates to allow varying QoS levels for the different mobile terminals 12. The number of mobile terminals 12 placed in the first and second groups may vary depending on application and the number of carriers. For example, for a ten-carrier system, the first group may have any number of mobile terminals 12 assigned to it, from two to nine. With the present invention, the mobile terminals 12 associated with the lowest throughput are given access to the carriers providing them with the best channel conditions, while one or more carriers are reserved to maximize throughput for the remaining mobile terminal or terminals 12 capable of maximizing overall throughput. Thus, the mobile terminals 12 with the most favorable channel conditions are capable of transmitting a lot of data in a short period of time, as they will most likely have higher coding and modulation rates",
    "textAfterTable": "US5896448 17 Dec 1996 20 Apr 1999 Bellsouth Corporation Method and apparatus for routing calls based on call success history US5898928 * 29 Feb 1996 27 Apr 1999 Telefonaktiebolaget Lm Ericsson Adaptive frequency allocation in a telecommunication system US5905789 26 Feb 1997 18 May 1999 Northern Telecom Limited Call-forwarding system using adaptive model of user behavior US5946386 11 Mar 1996 31 Aug 1999 Xantel Corporation Call management system with call control from user workstation computers US5978673 13 Dec 1996 2 Nov 1999 Ericsson Inc. Providing location-based call forwarding within a mobile telecommunications network US6011843 10 Jul 1996 4 Jan 2000 Harris Corporation Method and apparatus for initiating parallel connections to identified plural sites US6052596 * 7 Jun 1999 18 Apr 2000 At&T Corp System and method for dynamic channel assignment US6094478 19 Aug 1997 25 Jul 2000 Nortel Networks Corporation",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}