{
    "relation": [
        [
            "to 30/06/2015",
            "2015",
            "2014",
            "2013",
            "2012",
            "2011",
            "2010"
        ],
        [
            "Annual",
            "",
            "9.3%",
            "21.4%",
            "24.4%",
            "-22.9%",
            ""
        ],
        [
            "Q1",
            "5.0%",
            "-1.8%",
            "12.8%",
            "15.9%",
            "2.3%",
            ""
        ],
        [
            "Q2",
            "-2.2%",
            "0.3%",
            "1.5%",
            "-9.4%",
            "-3.8%",
            ""
        ],
        [
            "Q3",
            "",
            "4.2%",
            "0.6%",
            "8.8%",
            "-25.0%",
            "3.7%"
        ],
        [
            "Q4",
            "",
            "6.5%",
            "5.4%",
            "8.8%",
            "4.4%",
            "6.5%"
        ]
    ],
    "pageTitle": "Peter Kirkman | Fund Manager Fact Sheet | JP Morgan Asset Management | Citywire",
    "title": "",
    "url": "http://citywire.co.uk/wealth-manager/manager/peter-kirkman/d3924",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 1,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990611.52/warc/CC-MAIN-20150728002310-00155-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 50416771,
    "recordOffset": 50394652,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{5504=2015, 4006=February 2003 - Starts managing first fund, 9860=2013, 12042=2012, 17673=Peter Kirkman was born in Nottingham in 1969 and graduated from the University of East Anglia with a BSc in accountancy, also has an M.Phil in management studies from Cambridge University. He joined JP Morgan Asset Management in 2001 where he is a portfolio manager in the global equities team based in New York. Prior to this he was a senior portfolio manager of Japanese equities at Trust Company of the West in London and a portfolio manager at Prudential. Peter has been managing funds for over 18 years and holds a Cerificate in Investment Management from the London Business School. He is an associate member of the UK Society of Investment Professionals (ASIP) and a member of the CFA Institute., 14298=2011, 7682=2014}",
    "TableContextTimeStampAfterTable": "{29236=Quotes are delayed 15 minutes except where indicated otherwise Market Data Notice. Fund performance statistics: Lipper Limited Copyright View limitations & usage restriction. Investment trust statistics: © Morningstar 2015. All rights reserved. Property of Morningstar, 29124=© 2015 Citywire.co.uk. All Rights Reserved.}",
    "textBeforeTable": "Quarterly Performance Month by Month Performance Total Return View full league table 12.5% Will Riley 8 12.5% Tim Guinness 8 14.0% Peter Kirkman 6 14.0%",
    "textAfterTable": "Related News JPM Global Consumer Trends 04 September 2014, 00:01 BlackRock hires ex-JPM thematic boss as global equity co-head 14 August 2014, 14:08 Gary Clarke will co-head the $20 billion team with James Bristow.    JP Morgan global thematic manager Clarke exits 09 October 2013, 07:55 Gary Clarke (pictured), JP Morgan's co-head of global thematic and retail portfolios within global equities, has left the firm. Fund of the Week: JPM Global Consumer Trends 12 July 2012, 11:08 We explore a pick that looks to benefit from changing demographics taking place with consumers across the world. Citywire Selection: our top ten global equity funds 07 March 2012, 11:35 With deleveraging set to",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}