{
    "relation": [
        [
            "CSU",
            "Douglas",
            "Long",
            "Mason",
            "Lee",
            "Kamczyc",
            "Ivory",
            "Forbes",
            "Veira",
            "Scales",
            "Totals"
        ],
        [
            "MP",
            "36",
            "33",
            "18",
            "38",
            "32",
            "15",
            "19",
            "1",
            "8",
            "200"
        ],
        [
            "FG-A",
            "3-7",
            "6-9",
            "4-6",
            "5-14",
            "4-8",
            "1-3",
            "2-10",
            "0-0",
            "0-0",
            "25-57"
        ],
        [
            "FT-A",
            "1-2",
            "0-0",
            "0-0",
            "3-4",
            "0-0",
            "0-0",
            "1-2",
            "0-0",
            "1-2",
            "6-10"
        ],
        [
            "O-R",
            "2-4",
            "6-9",
            "2-6",
            "2-2",
            "0-1",
            "0-1",
            "1-3",
            "0-0",
            "0-1",
            "14-31"
        ],
        [
            "A",
            "2",
            "0",
            "2",
            "3",
            "0",
            "1",
            "1",
            "0",
            "0",
            "9"
        ],
        [
            "F",
            "2",
            "3",
            "4",
            "2",
            "4",
            "0",
            "1",
            "0",
            "3",
            "19"
        ],
        [
            "PT",
            "7",
            "12",
            "9",
            "15",
            "10",
            "3",
            "6",
            "0",
            "1",
            "63"
        ],
        [
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            ""
        ]
    ],
    "pageTitle": "No. 25 Wolfpack opens long homestand with win over Cleveland State | The Herald-Sun",
    "title": "",
    "url": "http://www.heraldsun.com/sports/ncstate/x1081732831/No-25-Wolfpack-opens-long-homestand-with-win-over-Cleveland-State",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 1,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990611.52/warc/CC-MAIN-20150728002310-00017-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 496431739,
    "recordOffset": 496415009,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{37078=1530 N. Gregson St. Suite 2A, 13400=N.C. State spent the first month of the season adjusting the pressure that came with being the preseason Atlantic Coast Conference favorite. Now Mark Gottfried’s team is ready for a long homestand that could help the No. 25 Wolfpack build momentum before starting league play. Richard Howell had 17 points and 10 rebounds to help State beat Cleveland State 80-63 on Saturday in the Wolfpack’s annual return to its historic Reynolds Coliseum on-campus home. Since starting 3-0 with a No. 6 national ranking, N.C. State (6-2) absorbed a 20-point loss to Oklahoma State in the Puerto Rico Tipoff championship and lost at third-ranked Michigan in the ACC/Big Ten Challenge. There was also an 82-80 squeaker at home against UNC Asheville in which the Wolfpack didn’t go ahead for good until the final 4 minutes. Those performances seemed to show N.C. State needed time to adjust as they blended in three McDonald’s All-Americans with four returning starters. The Wolfpack beat Connecticut at Madison Square Garden in the Jimmy V Classic Tuesday, then shot 55 percent and led comfortably most of the afternoon to start a six-game homestand that will keep the team in Raleigh until 2013. “We have learned that we have to play hard every night, every possession, every practice,” Gottfried said. “Sometimes guys have to learn that. ... We’re also learning that for the most part when you do have some attention around your program, you better bring it every night because teams are going to play better against you. We haven’t been in that role before so we’re learning that. “I hope for these guys they just keep understanding if we keep paying a price every day and really commit to it, we’ve got a chance to be good. But we’ve still got a long way to go in my opinion.” The message seems to have sunk in for Howell, a 6-foot-8 senior who earned his third double-double in four games. He had 13 points and 10 rebounds in the win against UConn despite missing most of the first half with an injury. “Just me being a senior, I thought I needed to step up and fulfill that (leadership) role with this being my last year,” Howell said. “I feel like we can go far but leadership is something we lacked.” C.J. Leslie added a team-high 19 points for the Wolfpack, and freshman T.J. Warren, a Durham native who attended Riverside High School briefly before transferring to an out-of-state prep school, scored 16. The Wolfpack won 589 games at Reynolds from 1949-99 until moving off campus to the larger RBC Center — now PNC Arena — for the 1999-2000 season. But the school has typically played at least one game a year at Reynolds for the past decade as a nod to the program’s tradition. N.C. State improved to 14-0 in the cozy building since its move, including a win against Marist in the 2007 NIT. “I think it’s special to play here,” Gottfried said. “I think it’s important for our fans, too. I think it brings them back in here and it means a lot to people. And it’s fun, too, the crowd and how close they are to the floor. Our fans are loud and you could feel it in there today.” N.C. State pushed ahead to a double-digit lead about 11 minutes in and took a 47-32 lead after the first half. Charlie Lee (15 points) brought the Vikings (6-3) as close as 57-47 on a 3-pointer with 13:55 left, but Lorenzo Brown answered with two straight driving scores. Lee finished with eight of Cleveland State’s 18 turnovers, which led to 16 points for the Wolfpack. “If we hadn’t turned the ball over unnecessarily, we could have been right in this game,” Vikings coach Gary Waters said. “That’s one of the things that I’m trying to correct with these young kids. When you’ve got nine freshmen and sophomores, it’s become a teaching game instead of a coaching game. Eventually, if they don’t stop turning the ball over, then I’m not doing a very good job as a teacher.” Cleveland State, a Horizon League program, played its third straight game without preseason all-conference pick Anton Grady. The 6-8 sophomore is expected to miss at least four weeks because of a knee injury sustained against Robert Morris on Nov. 20. No. 25 N.C. STATE 80, CLEVELAND ST. 63  , 37029=© 2015 The Herald-Sun}",
    "textBeforeTable": "N.C. State spent the first month of the season adjusting the pressure that came with being the preseason Atlantic Coast Conference favorite. Now Mark Gottfried’s team is ready for a long homestand that could help the No. 25 Wolfpack build momentum before starting league play. Richard Howell had 17 points and 10 rebounds to help State beat Cleveland State 80-63 on Saturday in the Wolfpack’s annual return to its historic Reynolds Coliseum on-campus home. Since starting 3-0 with a No. 6 national ranking, N.C. State (6-2) absorbed a 20-point loss to Oklahoma State in the Puerto Rico Tipoff championship and lost at third-ranked Michigan in the ACC/Big Ten Challenge. There was also an 82-80 squeaker at home against UNC Asheville in which the Wolfpack didn’t go ahead for good until the final 4 minutes. Those performances seemed to show N.C. State needed time to adjust as they blended in three McDonald’s All-Americans with four returning starters. The Wolfpack beat Connecticut at Madison Square Garden in the Jimmy V Classic Tuesday, then shot 55 percent and led comfortably most of the afternoon to start a six-game homestand that will keep the team in Raleigh until 2013. “We have learned that we have to play hard every night, every possession, every practice,” Gottfried said. “Sometimes guys have to learn that. ... We’re also learning that for the most part when you do have some attention around your program, you better bring it every night because",
    "textAfterTable": "Percentages: FG .439, FT .600. 3-Point Goals: 7-21, .333 (Kamczyc 2-4, Lee 2-7, Mason 1-1, Ivory 1-2, Forbes 1-6, Douglas 0-1). Team Rebounds: 4. Blocked Shots: 0. Turnovers: 18 (Lee 8, Douglas 3, Mason 3, Long 2, Kamczyc, Forbes). Steals: 3 (Kamczyc, Lee, Long). Technical Fouls: None. NCSU MP FG-A FT-A O-R A F PT   Purvis 27 3-8 5-6 2-4 1 1 11   Howell 32 7-11 3-4 2-10 3 1 17   Brown 33 4-9 2-2 0-3 6 2 10   Leslie 34 7-8 4-5 5-8 0 1 19   Wood 32 0-5 2-4 0-1 1 3 2   Cannon 2 1-1 0-0 0-0 0 0 3   T Lewis 9 0-0 0-0 0-1 2 0 0   Vandenberg 5 1-1 0-0 0-0 0 0 2   J Lewis 1 0-1 0-0 0-0 1",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}