{
    "relation": [
        [
            "Year",
            "2014",
            "2013",
            "2012",
            "2011",
            "TOTALS"
        ],
        [
            "G/S",
            "8/7",
            "11/0",
            "10/7",
            "5/0",
            "34/14"
        ],
        [
            "Rec.",
            "3",
            "8",
            "23",
            "2",
            "36"
        ],
        [
            "Yards",
            "38",
            "63",
            "232",
            "16",
            "349"
        ],
        [
            "Avg.",
            "12.7",
            "7.9",
            "10.1",
            "8",
            "9.7"
        ],
        [
            "TD",
            "0",
            "0",
            "0",
            "0",
            "0"
        ],
        [
            "Long Rec.",
            "18",
            "17",
            "25",
            "10",
            "25"
        ]
    ],
    "pageTitle": "Stephen Clark Bio - BlueHens.com - UD Athletics",
    "title": "",
    "url": "http://www.bluehens.com/ViewArticle.dbml?SPID=110418&ATCLID=209063360&DB_OEM_ID=29100",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 4,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990611.52/warc/CC-MAIN-20150728002310-00084-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 331212411,
    "recordOffset": 331194255,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{5228=2014 SEASON Key member of the Delaware receiving corps • played in eight games with seven starts • missed final three games after suffering a knee injury while carrying the ball in the win over Rhode Island • caught three passes for 38 yards (12.7 avg.) for the season • carried once for 14 yards against Rhode Island • started games vs. Pitt, Delaware State, Colgate, James Madison, Elon, and Rhode Island • had two receptions for 34 yards vs. Towson and one catch for four yards against Delaware State • caught two passes for 48 yards and hauled in a 39-yard touchdown pass from Justin Burns in the Blue-White Spring Game., 6945=2012 SEASON Enjoyed his finest - and first injury-free - season at Delaware and was a key part of the Blue Hen passing game • ranked fourth among all Delaware pass catchers with 23 receptions for 232 yards (10.1 average) • also carried twice out of the backfield for eight yards • saw action in 10 games and started seven contests at wide receiver • started first five games of the season • played consistently all season, catching three or more passes five times during the season • had career-high five receptions for 24 yards vs. New Hampshire and also had three catches each vs. West Chester, Rhode Island, Old Dominion, and Towson., 7734=2011 SEASON Appeared in five games in a reserve role, seeing action vs. West Chester, Delaware State, William & Mary, Massachusetts, and Rhode Island • hauled in two catches for 16 yards • recorded one catch for 10 yards vs. West Chester and one catch for six yards vs. Massachusetts., 9507=PERSONAL Stephen Darnell Clark • born July 14, 1992 • wildlife conservation and agriculture and natural resources major at Delaware • would like to work at an endangered species reserve after graduation • son of Terry and Cynthia Clark • brother, Terry, played wide receiver at NCAA III Randolph-Macon (Va.) College • also has a younger brother • worked at National 5 & 10 and as a front desk associate on campus during the summers • worked as a restaurant associate at Winterthur Museum in Wilmington during the summer • team representative to the UD Student Athlete Advisory Council (SAAC)., 8153=2010 SEASON Considered one of team’s top practice players but did not see game action and retained freshman eligibility • team went 12-3 and advanced to the FCS national title game., 4700=AT DELAWARE Five-year team member who was a part-time starter at wide receiver during his career • played in 34 games with 14 starts and hauled in 36 passes for 349 yards (9.7 avg.) • four-year letterwinner • also returned punts • was among Hens' top route runners • tremendous work ethic on and off field • earned his degrees in May, 2014., 8460=HIGH SCHOOL Played wide receiver and safety for head coach Jeff Nelson at Bethel High School • two-way standout who led squads to a three-year record of 23-12 and three playoff appearances • team went 10-2 his sophomore year and advanced to the second round of the playoffs • team went 7-5 his junior year and advanced to the second round • earned second team all-district honors as a wide receiver as a senior in 2009 • three-year starter who caught 47 passes for 706 yards and nine touchdowns • caught eight passes for 68 yards and a touchdown in 2007, 18 for 117 yards and two touchdowns in 2008, and 21 for 521 yards and six touchdowns this past fall • also a standout tennis player at Bethel High School • advanced to the district match qualifier for both singles and doubles during his career • National Honor Society student., 6233=2013 SEASON Put in another solid season as a backup in Delaware' receiver corps • played in 11 of the team's 12 games, missing the Maine game with an injury • ranked No. 7 on the team in receiving with eight receptions for 63 yards (7.9 avg.) with a long play of 17 yards vs. Delaware State • caught a season-high three passes for 19 yards vs. Navy and also hauled in two for 24 yards against Delaware State • returned a punt three yards against Richmond and kickoffs for 32 yards against Wagner and 26 yards vs. Navy • recorded tackles vs. Richmond and Villanova. , 29455=CAREER HIGHS Receptions: 5 vs. New Hampshire, 2012 Receiving Yards: 34 yards vs. Towson, 2014}",
    "textBeforeTable": "AT DELAWARE Five-year team member who was a part-time starter at wide receiver during his career • played in 34 games with 14 starts and hauled in 36 passes for 349 yards (9.7 avg.) • four-year letterwinner • also returned punts • was among Hens' top route runners • tremendous work ethic on and off field • earned his degrees in May, 2014. 2014 SEASON Key member of the Delaware receiving corps • played in eight games with seven starts • missed final three games after suffering a knee injury while carrying the ball in the win over Rhode Island • caught three passes for 38 yards (12.7 avg.) for the season • carried once for 14 yards against Rhode Island • started games vs. Pitt, Delaware State, Colgate, James Madison, Elon, and Rhode Island • had two receptions for 34 yards vs. Towson and one catch for four yards against Delaware State • caught two passes for 48 yards and hauled in a 39-yard touchdown pass from Justin Burns in the Blue-White Spring Game. 2013 SEASON Put in another solid season as a backup in Delaware' receiver corps • played in 11 of the team's 12 games, missing the Maine game with an injury • ranked No. 7 on the team in receiving with eight receptions for 63 yards",
    "textAfterTable": "  Year G/S Punt Ret.-Yards Avg. TD/Long KOR-Yards Avg. TD Long 2013 11/0 1-3 3.0 0 / 3 2-58 29.5 0 32 TOTALS 11/0 1-3 3.0",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}