{
    "relation": [
        [
            "Year",
            "2006",
            "2007",
            "2008",
            "2009",
            "Totals"
        ],
        [
            "G-GS",
            "9-1",
            "14-0",
            "13-0",
            "11-2",
            "47-3"
        ],
        [
            "Rush",
            "76",
            "70",
            "83",
            "70",
            "299"
        ],
        [
            "Yds.",
            "436",
            "478",
            "417",
            "368",
            "1,699"
        ],
        [
            "TD",
            "5",
            "6",
            "2",
            "4",
            "17"
        ],
        [
            "LG",
            "38",
            "67",
            "25",
            "25",
            "67"
        ]
    ],
    "pageTitle": "Keiland Williams Bio - LSUsports.net - The Official Web Site of LSU Tigers Athletics",
    "title": "",
    "url": "http://www.lsusports.net/ViewArticle.dbml?SPID=2164&DB_OEM_ID=5200&ATCLID=233525&Q_SEASON=2006",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 4,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990611.52/warc/CC-MAIN-20150728002310-00168-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 564683907,
    "recordOffset": 564657757,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{10987=CAREER RECEIVING HIGHS           Receptions: 4 vs. South Carolina, 2008 Yards: 82 vs. Georgia, 2008 Touchdowns: 1, twice Long: 66 vs. Georgia, 2008, 9533=HIGH SCHOOL One of the top running back prospects in the country ... Arguably, the top prep school prospect for the Class of 2006 ... Completed his eligibility at Hargrave Military Academy in Chatham, Va. ... Became the first running back in school history to rush for more than 1,000 yards ... Finished the season with 160 carries for 1,325 yards and 12 touchdowns ... Rushed for more than 2,500 yards and 30 touchdowns in his junior season at Northside High School in Lafayette ... Named the offensive MVP of Class 4A in Louisiana in 2004 .. Ranked as the nation's No. 3 running back prospect by Scout.com ... Coached at Hargrave by Robert Prunty., 7775=SOPHOMORE SEASON (2007) Ranked as the Tigers' second-leading rusher on the year with 478 yards and six touchdowns on 70 carries ... Averaged 6.8 yards per touch ... Also a threat through the air with nine catches for 113 yards and a score ... Had a career night in the Tigers' win over Virginia Tech, carrying the ball seven times for a career-best 126 yards and a career high-tying two touchdowns ... Performance was the second 100-yard rushing game of his career ... Scored on an incredible 67-yard TD run against the Hokies where he leaped over a defender and crossed the field ... Rushed for two TDs in the Tigers' season-opening win over Mississippi State ... Also had a rushing touchdown versus Ole Miss ... Caught the first TD pass of his career on a 46-yard grab versus Auburn ... Had two carries for 20 yards in the 2008 BCS National Championship Game versus Ohio State., 10212=PERSONAL Full name is Keiland Terrell Williams ... Born Aug. 14, 1986, in Lafayette, La. ... Mom is Clarissa Tolliver ... Has one brother - Keedrick, and two sisters - Keedra and Kaysha ... Majoring in communication studies., 13876=2009, 10642=CAREER RUSHING HIGHS Attempts: 17 vs. Tennessee, 2006 Yards: 126 vs. Virginia Tech, 2007 Touchdowns: 2, five times Long: 67 vs. Virginia Tech, 2007, 5700=JUNIOR SEASON (2008) LSU's second leading rusher who played in all 13 games off the bench ... Finished the year with 417 yards on the ground on 83 carries (5.0 avg.) with two touchdowns ... Led all LSU running backs with 11 receptions for 124 yards and one score through the air ... One of the Tigers' primary kick returners who ranked second on the squad in kick return yardage with 13 returns for 290 yards (22.3 avg.) ... Fired his first career touchdown pass on a designated halfback pass at Auburn ... The 22-yard throw to Demetrius Byrd erased a deficit and gave LSU a 17-14 lead in the third quarter ... It marked the first time an LSU running back had thrown a touchdown pass since Kevin Faulk did so in 1996 against Mississippi State ... Enjoyed his best game on the ground with a 13-carry, 88-yard performance versus Alabama ... Had a season-long run of 25 yards against the Crimson Tide ... Tallied 42 yards rushing on five carries with a score in the Chick-fil-A Bowl victory over Georgia Tech ... His 17-yard TD scamper closed out a 38-3 first-half scoring barrage for LSU ... Finished with 46 yards on seven carries against Arkansas ... Finished with 51 yards on 13 carries and a touchdown against Tulane ... Racked up 141 all-purpose yards against Georgia highlighted by a career-best 88 receiving yards on two receptions ... Caught a career-long 66-yard pass -- LSU's longest pass play of the year -- from Jarrett Lee in the fourth quarter against the Bulldogs ... Added six carries for 30 yards and a long of 22 against Georgia ... Rushed the ball a season-high 15 times for 72 yards versus South Carolina and recorded a career-high four receptions for 23 yards against the Gamecocks ... Carried it six times for 24 yards against Appalachian State, four times for 17 yards versus North Texas and twice for eight yards against Auburn ... Returned two kicks for 55 yards against North Texas, including a season-long 38 yarder ... Against Alabama, returned two kickoffs for 54 yards and had two kick returns for 46 yards at Auburn., 4440=CAREER Played in 47 games, starting three times ... Rushed for 1,699 yards and 17 touchdowns ... Added another 273 yards receiving and two TDs on 28 catches ...Missed final two games of 2009 after suffering an ankle injury in the fourth quarter against Ole Miss., 4733=SENIOR SEASON (2009) Had senior season cut short after breaking his ankle in the fourth quarter against Ole Miss on Nov. 14 ... Had surgery the following week ... Played in 11 games, starting twice ... Ranked second on team in rushing with 368 yards and four scores ... Made his second career start in place of injured Charles Scott and ran 15 times for a season-high 116 yards and two touchdowns against Louisiana Tech ... His 116 rushing yards against Tech marked the third time he has eclipsed 100 yards in a game in his career ... Led the team in rushing against Vanderbilt with 72 yards on 10 carries and two touchdowns ... Scored two rushing TDs against Vanderbilt, marking the fourth time in his career he has rushed for two TDs in a game ... Other start came against Ole Miss (40 yards on 10 carries) ... Opened season with 51 yards on seven attempts against Washington ... Had 41 yards on 10 rushes against Louisiana-Lafayette.}",
    "textBeforeTable": "CAREER Played in 47 games, starting three times ... Rushed for 1,699 yards and 17 touchdowns ... Added another 273 yards receiving and two TDs on 28 catches ...Missed final two games of 2009 after suffering an ankle injury in the fourth quarter against Ole Miss. SENIOR SEASON (2009) Had senior season cut short after breaking his ankle in the fourth quarter against Ole Miss on Nov. 14 ... Had surgery the following week ... Played in 11 games, starting twice ... Ranked second on team in rushing with 368 yards and four scores ... Made his second career start in place of injured Charles Scott and ran 15 times for a season-high 116 yards and two touchdowns against Louisiana Tech ... His 116 rushing yards against Tech marked the third time he has eclipsed 100 yards in a game in his career ... Led the team in rushing against Vanderbilt with 72 yards on 10 carries and two touchdowns ... Scored two rushing TDs against Vanderbilt, marking the fourth time in his career he has rushed for two TDs in a game ... Other start came against Ole Miss (40 yards on 10 carries) ... Opened season with 51 yards on seven attempts against Washington ... Had 41 yards on 10 rushes against Louisiana-Lafayette. JUNIOR SEASON (2008) LSU's second leading rusher who played in all 13 games off the bench ... Finished the year with 417 yards on the ground on 83",
    "textAfterTable": "WILLIAMS' CAREER RECEIVING STATISTICS         Year G-GS Att. Yds. TD LG 2006 9-1 4 14 0 12 2007 14-0 9 113 1 46 2008 13-0 11 124 1 66 2009 11-2 4 22 0 20 Totals 47-3 28 273 2 66 WILLIAMS' CAREER KICKOFF RETURN STATS                  ",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}