{
    "relation": [
        [
            "Name",
            "Magic",
            "Data Type",
            "Major Version",
            "Minor Version",
            "Level",
            "Magnitude Minimum",
            "Magnitude Range",
            "Magnitude Steps"
        ],
        [
            "Offset",
            "0",
            "4",
            "8",
            "12",
            "16",
            "20",
            "24",
            "28"
        ],
        [
            "Type",
            "int",
            "int",
            "int",
            "int",
            "int",
            "int",
            "int",
            "int"
        ],
        [
            "Size",
            "4",
            "4",
            "4",
            "4",
            "4",
            "4",
            "4",
            "4"
        ],
        [
            "Description",
            "The magic number which identifies the file as a star catalogue. 0xde0955a3",
            "This describes the type of the file, which defines the size and structure of the Star Data record for the file.",
            "The file format major version number",
            "The file format minor version number",
            "Sets the level of sub-division of the geodesic sphere used to create the zones. 0 means an icosahedron (20 sizes), subsequent levels of sub-division lead to numbers of zones as described in section Zones",
            "The low bound of the magnitude scale for values in this file. Note that this is still an integer in Stellarium's own internal representation",
            "The range of magnitudes expressed in this file",
            "The number of steps used to describes values in the range"
        ]
    ],
    "pageTitle": "Star Catalogue Format - Stellarium Wiki",
    "title": "Header Record",
    "url": "http://www.stellarium.org/wiki/index.php?title=Star_Catalogue_Format&diff=next&oldid=11554",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 4,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988511.77/warc/CC-MAIN-20150728002308-00245-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 728001147,
    "recordOffset": 727988683,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "A given catalogue file models stars for one and only one level (i.e. for a fixed number of zones), which is recorded in the header of the file. Individual star records do not contain full positional coordinates, instead they contain coordinates relative to the central position of the zone they occupy. Thus, when parsing star catalogues, it is necessary to know about the zone model to be able to extract positional data. The stars_hip_cids_0v0_0.cat and stars_hip_sp_0v0_0.cat files contain reference data for the main catalogue files. When Stellarium starts, it reads the stars.ini file, from which it determines the names of the other files, which it then loads. name.fab stars.ini gvs_hip_part.dat stars_hip_sp_0v0_0.cat stars_hip_cids_0v0_0.cat There also exist some control and reference files: stars_8_2v0_0.cat stars_7_2v0_0.cat stars_6_2v0_0.cat stars_5_1v0_0.cat stars_4_1v0_0.cat stars_3_0v0_2.cat stars_2_0v0_3.cat stars_1_0v0_3.cat stars_0_0v0_3.cat The main catalogue data is split into several files: Stellarium's star catalogue data is kept in the stars/default sub-directory of the Installation Directory and/or User Directory (see section Files and Directories). General Description Star Catalogue File Format This position for a star is expressed as a 3-dimensional vector which points from the observer (at the centre of the geodesic sphere) to the position of the star as observed on the celestial sphere. Stellarium",
    "textAfterTable": "stars_7_2v0_0.cat 2 8 bytes 7 57,826,266 NOMAD stars_8_2v0_0.cat 2 8 bytes 7 116,923,084 NOMAD For a given catalogue file, there may be one of three formats for the actual star data. The variation comes from the source of the data - the larger catalogues of fainter stars providing less data per star than the brighter star catalogues. See tables Stellarium's star catalogue and for details. File Sections The catalogue files are split into three main sections as described in table File sections. File sections Section Offset Description File Header Record 0 Contains magic number, geodesic subdivision level, and magnitude range Zone Records 32 A list of how many records there are for each zone. The length of the zones section depends on the level value from the header Star Data Records 32+4n This section of the file contains fixed-size star records, as described below. Records do not contain zone information, which must be inferred by counting how many records have been read so far and switching zones when enough have been read to fill the number of stars for the zone, as specified in the zones",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}