{
    "relation": [
        [
            "",
            "Jan",
            "Feb",
            "Mar",
            "Apr",
            "May",
            "Jun",
            "Jul",
            "Aug",
            "Sep",
            "Oct",
            "Nov",
            "Dec",
            "year"
        ],
        [
            "absolute max",
            "8 °C",
            "9 °C",
            "12 °C",
            "19 °C",
            "27 °C",
            "30 °C",
            "31 °C",
            "31 °C",
            "26 °C",
            "17 °C",
            "11 °C",
            "9 °C",
            "31 °C"
        ],
        [
            "absolute min",
            "-34 °C",
            "-31 °C",
            "-24 °C",
            "-16 °C",
            "-4 °C",
            "0 °C",
            "6 °C",
            "2 °C",
            "-4 °C",
            "-10 °C",
            "-18 °C",
            "-29 °C",
            "-34 °C"
        ],
        [
            "Ø absolute min",
            "-3 °C",
            "-3 °C",
            "0 °C",
            "6 °C",
            "13 °C",
            "18 °C",
            "20 °C",
            "19 °C",
            "14 °C",
            "8 °C",
            "3 °C",
            "0 °C",
            "8 °C"
        ],
        [
            "Ø absolute min",
            "-8 °C",
            "-8 °C",
            "-5 °C",
            "0 °C",
            "6 °C",
            "11 °C",
            "13 °C",
            "12 °C",
            "8 °C",
            "4 °C",
            "0 °C",
            "-5 °C",
            "2 °C"
        ],
        [
            "relative humidity",
            "85 %",
            "84 %",
            "82 %",
            "75 %",
            "67 %",
            "68 %",
            "73 %",
            "78 %",
            "82 %",
            "83 %",
            "86 %",
            "86 %",
            "79 %"
        ],
        [
            "Ø deposit",
            "41 mm",
            "32 mm",
            "35 mm",
            "37 mm",
            "31 mm",
            "41 mm",
            "60 mm",
            "74 mm",
            "73 mm",
            "71 mm",
            "67 mm",
            "59 mm",
            "621 mm"
        ],
        [
            "days with deposit > 1mm",
            "9",
            "7",
            "8",
            "7",
            "6",
            "7",
            "9",
            "11",
            "11",
            "10",
            "12",
            "11",
            "108"
        ],
        [
            "sunshine duration",
            "1.3 h",
            "2.6 h",
            "4.3 h",
            "6.0 h",
            "8.9 h",
            "9.9 h",
            "8.9 h",
            "7.2 h",
            "4.5 h",
            "2.9 h",
            "1.2 h",
            "0.9 h",
            "4.9 h"
        ]
    ],
    "pageTitle": "City Guide Helsinki | Lufthansa ® Travel Guide",
    "title": "",
    "url": "http://travelguide.lufthansa.com/nl/en/helsinki/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 5,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990611.52/warc/CC-MAIN-20150728002310-00066-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 255091251,
    "recordOffset": 255048478,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{1583=Finland has a reputation as a land of ice and snow, but summers are warm and sunny, with daytime temperatures reaching 25-30ºC (77-86Ë\u009aF), and even spring and autumn can be surprisingly mild. The sun never truly sets in midsummer and locals take full advantage of the midnight sun for late-night sports, barbecues and parties. Finland only really deserves its frosty reputation in winter, from November to mid March, when temperatures plummet to -20ºC/-4ºF or lower. Winter days are short and in Lapland, the sun may not clear the horizon at all. In the far north, the snow cover can last from as early as October till as late as May. Rainfall is distributed fairly evenly throughout the rest of the year. During June and July, forested areas are plagued by gnats and mosquitoes, particularly in the north of the country. Bring plenty of insect repellent., 26342=Each summer, Helsinki’s lesbian, gay, bisexual and transgender (LGBT) community party and get political at Finland’s biggest Pride festival. The annual event promotes equality and openness through discussions, cultural events, parties and a big parade. Thousands march through the streets in an eye-popping and colourful display, and over 10,000 revellers take part in the wider events. Performers and activists rub up alongside spectators and organisers, but the event is not only popular with the LGBT community. It’s also a great excuse for the rest of the city to enjoy themselves whilst showing solidarity for a good cause., 71074=Below are listed Public Holidays for the January 2015-December 2015 period., 71713=Mon-Fri 0800-1615, though some places stay open till 1700., 84984=Opening times: Tue and Sun 1000-1700 Wed-Fri 1000-2030 Sat 1000-1800, 86849=Opening times: Daily 1000-1600 (Oct-Mar) 1000-1800 (Apr and Sep) 1000-2000 (May-Aug), 3829=08.08.2015, 26951=22 – 28 June 2015 Website, 4958=05.08.2015, 70599=May Day: 01. May 2015 Ascension Day: 14. May 2015 Whit Sunday: 24. May 2015 Midsummer: 20. June 2015 All Saints’ Day: 01. November 2015 Independence Day: 06. December 2015 Christmas Day: 25. December 2015 St Stephen’s Day (Tapaninpäivä): 26. December 2015, 3082=10.08.2015, 86186=One of the oldest zoos on the planet, Helsinki Zoo opened in 1889 and is home to more than 1,000 different species of plant and 200 different types of animal., 4209=07.08.2015, 4578=06.08.2015, 28424=30 – 31 May 2015 Website, 119595=Freezing in winter and balmy in summer, Helsinki’s many museums make it a year-round destination, although if you want to take advantage of its many alfresco beauties, June and July are best., 88032=Unveiled in 1967, the vast Silbelius Monument commemorates composer Jean Sibelius and was designed to resemble a set of organ pipes by architect Eila Hiltunen., 83122=Opening times: Mon-Fri 0800-2000 Sat-Sun 0900-1800, 70978=New Year’s Day: 01. January 2015 Epiphany: 06. January 2015 Good Friday: 03. April 2015 Easter Sunday: 05. April 2015 Easter Monday: 06. April 2015, 91806=Opening times: Tue-Sun 1100-1800, 95517=Opening times: Daily 0900-0000 (Jun-Aug) 0900-1800 (Sep-May), 93666=Opening times: Late April to late October (times vary; check website for details), 82503=Completed in 1938 and used as the centrepiece for the 1952 Olympic Games, Helsinki’s Olympic Stadium remains one of the Finnish capital’s main sport and music venues. It also boasts a museum and a 72m (236ft) tower, complete with a viewing platform at the top., 2703=11.08.2015, 89300=Hewn out of solid bedrock, the Temppeliaukio (rock church) opened in 1969 and has been wowing tourists and locals alike ever since. Designed by architects Timo and Tuomo Suomalainen, it doubles as a concert venue., 81225=Opening times: Mon-Fri 0900-1615 (guided tours), 3451=09.08.2015, 90025=Opening times: Mon-Sat 1000-1745 Sun 1145-1745 (Jun-Aug) Mon-Sat 1000-1700 Sun 1145-1700 (Sep-May)}",
    "TableContextTimeStampAfterTable": "{41029=Roaming agreements exist with most international mobile phone companies and GSM 900/1800 coverage is excellent – as you might expect from the home of Nokia. You may find it cheaper to buy a Finnish SIM card, available for about â\u0082¬15, which includes â\u0082¬10 of calling credit.}",
    "textBeforeTable": "37.4 °F 3 °C 42.8 °F 6 °C 48.2 °F 9 °C 55.4 °F 13 °C 60.8 °F 16 °C 59 °F 15 °C 51.8 °F 11 °C 41 °F 5 °C 35.6 °F 2 °C",
    "textAfterTable": "Flight and accommodation Find flight Recommend to your friends Good to know Phone calls & Internet Telephone/Mobile Telephone Dialing Code: +358 Telephone Local and international calls can be made from street-side telephone booths and, in larger cities, telecentres. Most public telephones operate using a pre-paid card purchased from R-kiosks, shops and post offices. Shops also sell cards that can be used to make discounted international calls. Mobile Telephone Roaming agreements exist with most international mobile phone companies and GSM 900/1800 coverage is excellent – as you might expect from the home of Nokia. You may find it cheaper to buy a Finnish SIM card, available for about â\u0082¬15, which includes â\u0082¬10 of calling credit. Internet Free",
    "hasKeyColumn": true,
    "keyColumnIndex": 6,
    "headerRowIndex": 0
}