{
    "relation": [
        [
            "MK",
            "B8V",
            "A0V",
            "A5V",
            "F0V",
            "F5V",
            "G2V",
            "K0V",
            "K5V",
            "M0V",
            "G0III",
            "K0III",
            "K3III",
            "M0III",
            "M4III"
        ],
        [
            "V-I",
            "-0.15",
            "0.00",
            "0.27",
            "0.33",
            "0.53",
            "0.68",
            "0.88",
            "1.22",
            "1.80",
            "0.81",
            "1.00",
            "1.36",
            "1.78",
            "2.55"
        ],
        [
            "V-K",
            "-0.35",
            "0.00",
            "0.38",
            "0.70",
            "1.10",
            "1.46",
            "1.96",
            "2.85",
            "3.65",
            "1.75",
            "2.31",
            "3.00",
            "3.85",
            "5.96"
        ],
        [
            "J-H",
            "-0.05",
            "0.00",
            "0.06",
            "0.13",
            "0.23",
            "0.32",
            "0.45",
            "0.61",
            "0.70",
            "0.37",
            "0.54",
            "0.68",
            "0.83",
            "0.93"
        ],
        [
            "H-K",
            "-0.04",
            "0.00",
            "0.02",
            "0.03",
            "0.04",
            "0.05",
            "0.08",
            "0.11",
            "0.17",
            "0.07",
            "0.10",
            "0.14",
            "0.19",
            "0.25"
        ],
        [
            "J-K",
            "-0.09",
            "0.00",
            "0.08",
            "0.16",
            "0.27",
            "0.37",
            "0.53",
            "0.72",
            "0.86",
            "0.45",
            "0.63",
            "0.82",
            "1.01",
            "1.17"
        ],
        [
            "K-L",
            "-0.03",
            "0.00",
            "0.02",
            "0.03",
            "0.04",
            "0.05",
            "0.06",
            "0.10",
            "0.14",
            "0.04",
            "0.07",
            "0.10",
            "0.12",
            "0.18"
        ],
        [
            "K-L'",
            "-0.04",
            "0.00",
            "0.02",
            "0.03",
            "0.04",
            "0.05",
            "0.06",
            "0.11",
            "0.17",
            "0.05",
            "0.08",
            "0.12",
            "0.17",
            "0.21"
        ],
        [
            "K-M",
            "-0.05",
            "0.00",
            "0.03",
            "0.03",
            "0.02",
            "0.01",
            "-0.01",
            "-",
            "-",
            "0.0",
            "-0.03",
            "-0.06",
            "-0.09",
            "-0.15"
        ]
    ],
    "pageTitle": "ESO - Spectroscopic Standards",
    "title": "",
    "url": "https://www.eso.org/sci/facilities/paranal/decommissioned/isaac/tools/spectroscopic_standards.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 2,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042992201.62/warc/CC-MAIN-20150728002312-00235-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 897044994,
    "recordOffset": 897029408,
    "tableOrientation": "VERTICAL",
    "TableContextTimeStampAfterTable": "{26464=The magnitudes in this table are IR magnitudes, not visual. To convert between the two, use the values listed in the following table (See Bessell and Brett, PASP, 100, 1134 and Koorneef, A & A, 128, 84).}",
    "textBeforeTable": "Table 1. Magnitude range for standard stars ISAAC has four spectroscopic modes; medium and low resolution spectroscopy in the short wavelength arm and medium and low resolution spectroscopy in the long wavelength arm. The range of magnitudes that is appropriate for each mode differs. Appropriate magnitude ranges forstandards UKIRT very bright standards A composite list of standards. These stars have spectral types, some have JHK magnitudes and some of these also have L band magnitudes. MSSSO Standards. These stars have JHKL magnitudes and spectral types. Van der Bliek IR Standards. These stars have JHK magnitudes and spectral types. Some have L and M band magnitudes. For LW spectroscopy, where the Hipparcos stars are in general too faint, we also take telluric standards from: Stars of the required magnitude can also be found in the list of Van der Bliek IR Standards. These stars have JHK magnitudes and spectral types. Some have L and M bandmagnitudes. O stars G dwarfs from G0 to G4 B stars In the near future, we will provide a WEB based interface which browses the Hipparcos catalog for suitable stars. In the meantime, you can use SIMBAD to search for suitable stars or you can search the lists provided below. For SW spectroscopy the preferred source of telluric standards is the Hipparcos catalogue. These stars have V band magnitudes, V-I colours and spectral types. However only a",
    "textAfterTable": "1.36 3.00 0.68 0.14 0.82 0.10 0.12 -0.06 M0III 1.78 3.85 0.83 0.19 1.01 0.12 0.17 -0.09 M4III 2.55 5.96 0.93 0.25 1.17 0.18 0.21 -0.15 The solar spectrum A high resolution (R=40,000) spectum of the sun is provided as six indivdual spectra that cover the SZ (1.05 microns), J, H, K, L and M atmospheric windows. SOL_SZ.fits from 9780 to 11110 Angstroms SOL_J.fits from 11110 to 13500 Angstroms SOL_H.fits from 14050 to 18000 Angstroms SOL_K.fits from 19320 to 25000 Angstroms SOL_L.fits from 29850 to 41700 Angstroms SOL_M.fits from 45550 to 50050 Angstroms These spectra were created from data that was kindly made available by the NSO/Kitt Peak Observatory. If you use this data, we would ask you to add the following acknowledgement. NSO/Kitt Peak FTS data used here were produced by NSF/NOAO. The original data comes in many individual segments that typically cover a few hundred Angstroms. To make the use of the data, we have combined them into 6 spectra that cover the SZ, J, H, K, L and M atmospheric windows. This required the removal of the continuum with a 2nd or 3rd order polynomial and this has proved to be problematic near the Hydrogen lines, which usually cover several segments. Telluric Features Below 2.3 microns, telluric features appear as absorption lines in the spectra of astronomical objects. Above 2.3 microns, telluric features",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}