{
    "relation": [
        [
            "Pitcher",
            "Catfish Hunter",
            "Jim Palmer",
            "Ron Guidry",
            "Mike Boddicker",
            "Roger Clemens",
            "Bret Saberhagen",
            "Greg Maddux",
            "Greg Maddux",
            "Cliff Lee",
            "David Price"
        ],
        [
            "Year",
            "1974",
            "1975",
            "1978",
            "1984",
            "1986",
            "1989",
            "1994",
            "1995",
            "2008",
            "2012"
        ],
        [
            "Wins/ERA",
            "25/2.49",
            "23/2.09",
            "25/1.74",
            "20/2.79",
            "24/2.48",
            "23/2.16",
            "16/1.56",
            "19/1.63",
            "22/2.54",
            "20/2.56"
        ],
        [
            "K's (Rank)",
            "143 (17th)",
            "193 (4th)",
            "248 (2nd)",
            "128 (22nd)",
            "238 (2nd)",
            "193 (3rd)",
            "156 (3rd)",
            "181 (3rd)",
            "170 (9th)",
            "205 (6th)"
        ],
        [
            "Other Leading Categories",
            "WHIP",
            "WAR, Shutouts, ERA+",
            "WAR, W-L%, WHIP, H/9, Shutouts, ERA+",
            "None",
            "W-L%, WHIP, H/9, ERA+",
            "WAR, W-L%, WHIP, IP, CG's, K:BB, ERA+",
            "WAR, WHIP, H/9, IP, CG's, Shutouts, HR/9, ERA+",
            "WAR, W-L%,WHIP, BB/9, IP, CG's, Shutouts, K:BB, HR/9, ERA+",
            "WAR, W-L%, BB/9, Shutouts, HR/9, ERA+",
            "W-L%"
        ],
        [
            "Cy Young Finish",
            "1st (12 of 24 first place votes)",
            "1st (15 of 24 first place votes)",
            "1st (28 of 28 first place votes)",
            "4th (3 of 28 first place votes)",
            "1st (28 of 28 first place votes)",
            "1st (27 of 28 first place votes)",
            "1st (28 of 28 first place votes)",
            "1st (28 of 28 first place votes",
            "1st (24 of 28 first place votes)",
            "1st (14 of 28 first place votes)"
        ]
    ],
    "pageTitle": "MLB Notebook: Price joins elite company with Cy win | raysbaseball.com",
    "title": "",
    "url": "http://m.rays.mlb.com/news/article/41276780",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 0,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988511.77/warc/CC-MAIN-20150728002308-00169-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 154086351,
    "recordOffset": 154062050,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{3148=The eventual announcement that Price had indeed won the Cy Young Award in the AL carried with it all sorts of interesting aspects. As mentioned, he became the first pitcher in his franchise's 15-year history to win it, he became one of nine southpaws to be in their age-26 or younger season and claim the award, and he also came out on top by just four points, with that differential being, according to the Baseball Writers' Associate of America, \"The closest of any election since ballots permitted voting for more than one pitcher in 1970.\" And because of the feeling that his crowns in wins and ERA certainly were the driving points of his candidacy, it also allowed for a second look at Mike Boddicker's plight in 1984., 2391=In '84, Boddicker's 20-11, 2.79 ERA, 128-strikeout season ended up being only good enough for a fourth-place finish in the voting, as he placed behind Tigers relief ace Willie Hernandez, Royals relief whiz Dan Quisenberry, and Indians starter Bert Blyleven. In addition to being the only pitcher since 1967 to claim both the wins title and the lowest ERA in the league and not win the award, Boddicker's fourth-place finish was also the second worst since 1970 for any 20-game winner who posted the lowest ERA in his league: only John Candelaria's fifth place finish in the NL in 1977 offered less appreciation (the four others who fit this bill -– Tom Seaver in 1971, Randy Jones in 1975, Roger Clemens in 1990 and Pedro Martinez in 2002 –- all finished second). It was a tough conclusion for Boddicker, who was contending against strong narratives from Hernandez (in his first year with the Tigers, Hernandez did not blow a save opportunity until his last chance of the season and helped the team to 104 wins with 140.1 innings of a 1.92 ERA), and Quisenberry (who saved 44 games -- one off his Major League record –- and helped the Royals claim the AL West). Still, Boddicker was the only 20-game winner in the AL, he finished in the top-four in pitcher WAR, hits per nine, innings, complete games, shutouts and ERA+, and in '83 he had finished third in Rookie of the Year voting. But all of that wasn't close to being enough., 3962=On the other hand, Justin Verlander, who ended up receiving 13 of the possible 28 first place votes, led the AL in WAR, innings, strikeouts, complete games, and ERA+, and finished in the top-four in ERA (2nd), wins (4th), WHIP (2nd), hits/9 (2nd), K/9 (3rd) and strikeout to walk ratio (2nd). Again, using the past as a predictor, Verlander's chances -- even while leading the field in K's and ERA+ -- looked a little a little less optimistic Between 1982 and 2011, pitchers who claimed the top spot in K's and ERA+ but not in wins or ERA were only 2-for-4 in capturing the Cy Young Award. The most recent pitcher with this assortment -- Tim Lincecum in 2008 -- had won the award, the previous two -– Johan Santana in 2005 and Randy Johnson in 2004 -- had not, and Randy Johnson in 2002 did., 5287=Between 1967 (the first year that Cy Young awards were given in each league) and 2011, 19 different pitchers claimed BOTH the wins title and owned the lowest ERA among their league's qualifying pitchers. What makes this specifically interesting to Price's Cy Young chances (as they stood after the close of play on October 3), is that of those 19, 18 went on to win the award. Ten of the 19 also led in strikeouts, making them Triple Crown winners. So removing those 10 (and making the past even more relevant to Price's case), baseball history between 1967 and 2011 had produced nine pitchers who led in wins and ERA while failing to hold the top spot in strikeouts, with eight of those nine eventually being named the Cy Young Award winner., 6201=On that final day of October 3, Verlander and Price, who ended the year sixth in the AL in strikeouts, were resting, but Weaver (who was also third in ERA, at 2.73) was making a start for the Angels. Even a shutout wouldn't move Weaver past Price for the ERA title, but a victory for the Angels right-hander would, obviously, give him the outright lead in victories., 90394=Whereas that '84 season marked the only time Boddicker ever received any Cy Young votes, Price already has a first-place and a second-place finish. And as one of six lefties since 1901 to be in their age-26 or younger season and win both the ERA and wins titles, one can optimistically imagine that future pursuits will yield similar results and that Price might just have some of each left in his left arm. But then again, history can be a fickle barometer.}",
    "textBeforeTable": "Cy Young Award winners to lead the league in wins and ERA but not strikeouts from 1967 to 2012 \"> Whereas that '84 season marked the only time Boddicker ever received any Cy Young votes, Price already has a first-place and a second-place finish. And as one of six lefties since 1901 to be in their age-26 or younger season and win both the ERA and wins titles, one can optimistically imagine that future pursuits will yield similar results and that Price might just have some of each left in his left arm. But then again, history can be a fickle barometer. In '84, Boddicker's 20-11, 2.79 ERA, 128-strikeout season ended up being only good enough for a fourth-place finish in the voting, as he placed behind Tigers relief ace Willie Hernandez, Royals relief whiz Dan Quisenberry, and Indians starter Bert Blyleven. In addition to being the only pitcher since 1967 to claim both the wins title and the lowest ERA in the league and not win the award, Boddicker's fourth-place finish was also the second worst since 1970 for any 20-game winner who posted the lowest ERA in his league: only John Candelaria's fifth place finish in the NL in 1977 offered less appreciation (the four others who fit this bill -– Tom Seaver in 1971, Randy Jones in 1975, Roger Clemens in 1990 and Pedro Martinez in 2002 –- all finished",
    "textAfterTable": "Roger Schlueter is senior researcher for MLB Productions. This story was not subject to the approval of Major League Baseball or its clubs. Share This Email Print + Hide Comments 0 COMMENTS MLB Notebook: Price joins elite company with Cy win",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}