{
    "relation": [
        [
            "Sunday",
            "26",
            "2",
            "9",
            "16",
            "23",
            "30"
        ],
        [
            "Monday",
            "27",
            "3",
            "10",
            "17",
            "24",
            "31"
        ],
        [
            "Tuesday",
            "28",
            "4",
            "11",
            "18",
            "25",
            "1"
        ],
        [
            "Wednesday",
            "29",
            "5",
            "12",
            "19",
            "26",
            "2"
        ],
        [
            "Thursday",
            "30",
            "6",
            "13",
            "20",
            "27",
            "3"
        ],
        [
            "Friday",
            "31",
            "7",
            "14",
            "21",
            "28",
            "4"
        ],
        [
            "Saturday",
            "1",
            "8",
            "15",
            "22",
            "29",
            "5"
        ]
    ],
    "pageTitle": "Morgan Finlay",
    "title": "",
    "url": "http://www.morganfinlay.com/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 1,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990611.52/warc/CC-MAIN-20150728002310-00319-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 595315343,
    "recordOffset": 595275044,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{9659=Wednesday, July 15 in the West End Here's wishing you a BEAUTIFUL day my friend! I'm back and walking it off in the big city, pacing out the moments one after the other in these last 12 little days of Van time. How on earth to fit all my favourite hometown things into this tiny stretch?!  Well, time IS elastic isn't it-- one minute you can hear the tick of the clock in the still and quiet, and the next minute it wants to explode out from under your skin.  SO IT IS-- with the dawn of this exciting Newfoundland adventure so close at hand!! At the same time as I've been personally reaching out to contributors to give thanks, writing songs, being present in final visits with friends, packing my suitcase and my moving bins (and going to my last dental appointment this afternoon-- Youch!), my wonderful homegrown Newfoundlander friends Andrea, Adrian and Geraldine have been stirring up great options on The Rock for accommodations, musician connections, designers and photographers and more. Meanwhile, I've spoken with salt-of-the-earth people at the Long & McQuade music store in St. John's, and at the t-shirt/hoodie print shop; it feels GREAT to include as much Newfoundland talent and skill as possible into our album!  So there is a burst of activity going on as we rush forward towards the flight on the 27th... watch this page for pictures and stories as we roll!! So many exciting things to come, and it's all because YOU are making it happen.   Yours truly, Morgan  }",
    "textBeforeTable": "August 2015 0:00 / 0:00 13 Buy [Info] When This Long Road Ends 02:36 0:00 / 0:00 12 Buy [Info]",
    "textAfterTable": "hitting the links finlaytv on youtube instagram",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}