{
    "relation": [
        [
            "Citing Patent",
            "US6594672 *",
            "US6728750 *",
            "US6853997 *",
            "US6898790 *",
            "US6976000 *",
            "US7028046 *",
            "US7072900",
            "US7073164 *",
            "US7146351 *",
            "US7299194 *",
            "US7526521",
            "US7716172",
            "US7716253",
            "US7844570 *",
            "US7937401",
            "US7953695 *",
            "US8566358 *",
            "US8862852",
            "US9026412",
            "US20020010700 *",
            "US20020133368 *",
            "US20040064456 *",
            "US20040181518 *",
            "US20040199517 *",
            "US20050010572 *",
            "US20110153292 *"
        ],
        [
            "Filing date",
            "Jun 1, 2000",
            "Jun 27, 2000",
            "Jun 28, 2001",
            "May 11, 2000",
            "Feb 22, 2000",
            "Mar 19, 2002",
            "Nov 28, 2001",
            "Jun 6, 2002",
            "Nov 28, 2001",
            "Feb 22, 2000",
            "Jul 11, 2003",
            "Jan 30, 2006",
            "Feb 3, 2005",
            "Mar 8, 2005",
            "Apr 28, 2005",
            "",
            "Dec 17, 2009",
            "Feb 3, 2005",
            "Dec 17, 2009",
            "Jun 28, 2001",
            "Nov 16, 2001",
            "Sep 27, 2002",
            "Mar 14, 2003",
            "Apr 2, 2003",
            "Jul 11, 2003",
            ""
        ],
        [
            "Publication date",
            "Jul 15, 2003",
            "Apr 27, 2004",
            "Feb 8, 2005",
            "May 24, 2005",
            "Dec 13, 2005",
            "Apr 11, 2006",
            "Jul 4, 2006",
            "Jul 4, 2006",
            "Dec 5, 2006",
            "Nov 20, 2007",
            "Apr 28, 2009",
            "May 11, 2010",
            "May 11, 2010",
            "Nov 30, 2010",
            "May 3, 2011",
            "May 31, 2011",
            "Oct 22, 2013",
            "Oct 14, 2014",
            "May 5, 2015",
            "Jan 24, 2002",
            "Sep 19, 2002",
            "Apr 1, 2004",
            "Sep 16, 2004",
            "Oct 7, 2004",
            "Jan 13, 2005",
            "Jun 23, 2011"
        ],
        [
            "Applicant",
            "Hyperion Solutions Corporation",
            "International Business Machines Corporation",
            "Infoglide Corporation",
            "International Business Machines Corporation",
            "International Business Machines Corporation",
            "Hyperion Solutions Corporation",
            "International Business Machines Corporation",
            "I2 Technologies Us, Inc.",
            "International Business Machines Corporation",
            "International Business Machines Corporation",
            "At&T Intellectual Property I, L.P.",
            "Hyperion Solutions Corporation",
            "Microsoft Corporation",
            "Microsoft Corporation",
            "Microsoft Corporation",
            "Fair Isaac Corporation",
            "International Business Machines Corporation",
            "International Business Machines Corporation",
            "International Business Machines Corporation",
            "Wotring Steven C.",
            "David Strutt",
            "Fong Joseph Shi Piu",
            "Mayo Bryan Edward",
            "Fabio Casati",
            "Sbc Knowledge Ventures, L.P.",
            "International Business Machines Corporation"
        ],
        [
            "Title",
            "Generating multidimensional output using meta-models and meta-outlines",
            "Distributed application assembly",
            "System and method for sharing, mapping, transforming data between relational and hierarchical databases",
            "Mapping actions to tasks within customer service processing systems",
            "Method and system for researching product dynamics in market baskets in conjunction with aggregate market basket properties",
            "Method of splitting a multi-dimensional cube between a multi-dimensional and a relational database",
            "System and method for developing topography based management systems",
            "Software deployment system and method",
            "System and method for analyzing software components using calibration factors",
            "Method and system for researching sales effects of advertising using association analysis",
            "Multi-user database system and method for resource usage tracking",
            "Method of splitting a multi-dimensional cube between a multi-dimensional and a relational database",
            "Centralized KPI framework systems and methods",
            "Database generation systems and methods",
            "Multidimensional database query extension systems and methods",
            "System and method for integrated data mart defining start schema model processing business contact data from multiple contact channels",
            "Framework to populate and maintain a service oriented architecture industry model repository",
            "Apparatus and method to selectively provide information to one or more computing devices",
            "Managing and maintaining scope in a service oriented architecture industry model repository",
            "System and method for sharing data between relational and hierarchical databases",
            "Data warehouse model and methodology",
            "Methods for data warehousing based on heterogenous databases",
            "System and method for an OLAP engine having dynamic disaggregation",
            "Method and system for operating a data warehouse for event management",
            "Multi-user database system and method for resource usage tracking",
            "Framework to populate and maintain a service oriented architecture industry model repository"
        ]
    ],
    "pageTitle": "Patent US6377934 - Method for providing a reverse star schema data model - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US6377934?dq=5,884,271",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 7,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988930.94/warc/CC-MAIN-20150728002308-00055-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 491756739,
    "recordOffset": 491721686,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{22633=U.S. Provisional patent application Ser. No. 60/116,086 Li-Wen Chen entitled, “METHOD AND APPARATUS FOR PERFORMING CUSTOMER DATA ANALYSIS OF A COMPUTER DATABASE USING REVERSE STAR SCHEMA DATA MODEL,” filed Jan. 15, 1999.}",
    "textBeforeTable": "Patent Citations Although the above has generally described the present invention according to specific systems, the present invention has a much broader range of applicability. In particular, the present invention is not limited to a particular kind of data schema, but can be applied to any data model where an improved or optimized analysis is desired for use with customer centered data warehousing systems and applications. Thus, in some embodiments, the techniques of the present invention could provide access to many different legacy business, governmental and educational databases of all kinds. Of course, one of ordinary skill in the art would recognize other variations, modifications, and alternatives. Conclusion In many embodiments, the multi-dimensional model is mapped to a particular relational data model, called the schema, which can be a star schema, or others. A schema is a database organization corresponding to a data model. Records in dimension tables of a relational database can be mapped to a plurality of indices of the dimensions in multi-dimensional model, and the records in a database fact table can be mapped to the measures or data points in the multi-dimensional model. In many embodiments, the data model provides operational performance analysis used in a plurality of corporate-wide decision support applications. Various applications, tools, systems, frameworks, database managers and the like can be embodied as re-usable products based on the meta model, i.e., the multi-dimensional model, and the data model, i.e., the schema",
    "textAfterTable": "* Cited by examiner Referenced by Citing Patent Filing date Publication date Applicant Title US6594672 * Jun 1, 2000 Jul 15, 2003 Hyperion Solutions Corporation Generating multidimensional output using meta-models and meta-outlines US6728750 * Jun 27, 2000 Apr 27, 2004 International Business Machines Corporation Distributed application assembly US6853997 * Jun 28, 2001 Feb 8, 2005 Infoglide Corporation System and method for sharing, mapping, transforming data between relational and hierarchical databases US6898790 * May 11, 2000 May 24, 2005 International Business Machines Corporation Mapping actions to tasks within customer service processing systems US6976000 * Feb 22, 2000 Dec 13, 2005 International Business Machines Corporation Method and system for researching product dynamics in market baskets in conjunction with aggregate market basket properties US7028046 * Mar 19, 2002 Apr",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}