{
    "relation": [
        [
            "Citing Patent",
            "US8356247",
            "US8370489",
            "US8514907",
            "US8607295",
            "US8631473",
            "US8635674",
            "US8650587",
            "US8667520",
            "US8713168",
            "US8843626",
            "US8930701",
            "US8954536",
            "US8955001",
            "US8978086",
            "US9015255"
        ],
        [
            "Filing date",
            "Oct 21, 2009",
            "Sep 21, 2011",
            "Oct 23, 2007",
            "Dec 30, 2011",
            "Dec 30, 2011",
            "Dec 30, 2011",
            "Dec 30, 2011",
            "Dec 30, 2011",
            "Sep 21, 2011",
            "Nov 30, 2012",
            "Aug 28, 2013",
            "Dec 19, 2011",
            "Dec 30, 2011",
            "Dec 30, 2011",
            "Feb 14, 2012"
        ],
        [
            "Publication date",
            "Jan 15, 2013",
            "Feb 5, 2013",
            "Aug 20, 2013",
            "Dec 10, 2013",
            "Jan 14, 2014",
            "Jan 21, 2014",
            "Feb 11, 2014",
            "Mar 4, 2014",
            "Apr 29, 2014",
            "Sep 23, 2014",
            "Jan 6, 2015",
            "Feb 10, 2015",
            "Feb 10, 2015",
            "Mar 10, 2015",
            "Apr 21, 2015"
        ],
        [
            "Applicant",
            "Rich Media Worldwide, Llc",
            "The Nielsen Company (Us), Llc",
            "The Nielsen Company (Us), Llc",
            "Symphony Advanced Media",
            "Symphony Advanced Media",
            "Symphony Advanced Media",
            "Symphony Advanced Media",
            "Symphony Advanced Media",
            "The Nielsen Company (Us), Llc",
            "The Nielsen Company (Us), Llc",
            "The Nielsen Company (Us), Llc",
            "The Nielsen Company (Us), Llc",
            "Symphony Advanced Media",
            "Symphony Advanced Media",
            "The Nielsen Company (Us), Llc"
        ],
        [
            "Title",
            "Content rendering control system and method",
            "Methods and apparatus to determine impressions using distributed demographic information",
            "Methods and systems to meter media content presented on a wireless communication device",
            "Media content synchronized advertising platform methods",
            "Social content monitoring platform apparatuses and systems",
            "Social content monitoring platform methods",
            "Mobile content tracking platform apparatuses and systems",
            "Mobile content tracking platform methods",
            "Methods and apparatus to determine impressions using distributed demographic information",
            "Methods and apparatus to determine impressions using distributed demographic information",
            "Methods and apparatus to collect distributed user information for media impressions and search terms",
            "Methods and apparatus to determine media impressions using distributed demographic information",
            "Mobile remote media control platform apparatuses and methods",
            "Media content based advertising survey platform apparatuses and systems",
            "Methods and apparatus to identify session users with cookie information"
        ]
    ],
    "pageTitle": "Patent US7716326 - Content display monitor - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US7716326?dq=6,308,317",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 10,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988930.94/warc/CC-MAIN-20150728002308-00302-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 476612207,
    "recordOffset": 476526598,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{26374=This patent arises from a divisional of U.S. patent application Ser. No. 09/490,495, which was filed on Jan. 25, 2000, and which is a continuation of U.S. patent application Ser. No. 08/707,279, now U.S. Pat. No. 6,108,637, which was filed on Sep. 3, 1996. Both U.S. patent application Ser. No. 09/490,495 and U.S. Pat. No. 6,108,637 are hereby incorporated herein by reference in their entirety., 37276=Additionally, log files are subject to manipulation, either directly or indirectly. For example, an unscrupulous content provider could directly manipulate the log file by retrieving and editing the log file to add phony transactions, thus artificially increasing the number of Web page hits and making the Web page appear to be more popular than it really is. This problem can be ameliorated by causing the log files to be transferred periodically at predetermined times (e.g., each night at 12:00 midnight) from the server computer at the content provider site to a neutral network site; however, the log file can still be manipulated during the time between transfers.}",
    "textBeforeTable": "Patent Citations Various embodiments of the invention have been described. The descriptions are intended to be illustrative, not limitative. Thus, it will be apparent to one skilled in the art that certain modifications may be made to the invention as described above without departing from the scope of the claims set out below. For example, though the invention has been described above as it particularly applies to monitoring the display of content disseminated over the World Wide Web, the invention can generally be used to monitor the display of content disseminated over any computer network. Additionally, though an implementation of the invention has been described in which aspects of the Java programming language are used, it is to be understood that invention is not limited to such implementation; other programming languages could be used having other features and characteristics (e.g., the language need not be an object-oriented language as is Java). , 6B, 6C and 6D, the use of such an applet can advantageously dovetail with an implementation of those systems in which the applet is transferred to the content display site from the application manager site. This is because an applet must return the monitoring information to the network site from which the applet was transferred: thus, the monitoring information is transferred directly to the neutral application manager site. Too, when the monitoring instructions and content are transferred from the application manager site to the content",
    "textAfterTable": "US4516216 May 10, 1982 May 7, 1985 Paradyne Corporation In-service monitoring system for data communications network US4546382 * Dec 8, 1983 Oct 8, 1985 Ctba Associates Television and market research data collection system and method US4566030 Jun 9, 1983 Jan 21, 1986 Ctba Associates Television viewer data collection system US4603232 Sep 24, 1984 Jul 29, 1986 Npd Research, Inc. Rapid market survey collection and dissemination method US4658290 Oct 5, 1984 Apr 14, 1987 Ctba Associates Television and market research data collection system and method US4677552 Oct 5, 1984 Jun 30, 1987 Sibley Jr H C International commodity trade exchange US4695880 Jul 30, 1985 Sep 22, 1987 Postron Corp. Electronic information dissemination system US4700378 Aug 8, 1985 Oct 13, 1987 Brown Daniel G Data base accessing system US4706121 May 6, 1986 Nov 10, 1987",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}