{
    "relation": [
        [
            "Citing Patent",
            "US7583379",
            "US7738096",
            "US8158595",
            "US8329882",
            "US8367815",
            "US8603996",
            "US8647889",
            "US8772464",
            "US8865667",
            "US8875039 *",
            "US9029524",
            "US9040495",
            "US20050107998 *",
            "WO2006084130A2 *",
            "WO2008048345A2 *",
            "WO2012145270A2 *",
            "WO2012145270A3 *"
        ],
        [
            "Filing date",
            "Jul 28, 2006",
            "Mar 15, 2006",
            "Nov 9, 2007",
            "Feb 18, 2010",
            "Sep 18, 2008",
            "Mar 13, 2012",
            "Nov 14, 2012",
            "Feb 9, 2006",
            "Sep 12, 2008",
            "Nov 18, 2003",
            "Dec 10, 2008",
            "Aug 15, 2012",
            "Nov 18, 2003",
            "Feb 1, 2006",
            "Feb 14, 2007",
            "Apr 16, 2012",
            "Apr 16, 2012"
        ],
        [
            "Publication date",
            "Sep 1, 2009",
            "Jun 15, 2010",
            "Apr 17, 2012",
            "Dec 11, 2012",
            "Feb 5, 2013",
            "Dec 10, 2013",
            "Feb 11, 2014",
            "Jul 8, 2014",
            "Oct 21, 2014",
            "Oct 28, 2014",
            "May 12, 2015",
            "May 26, 2015",
            "May 19, 2005",
            "Aug 10, 2006",
            "Apr 24, 2008",
            "Oct 26, 2012",
            "Dec 20, 2012"
        ],
        [
            "Applicant",
            "University Of Georgia Research Foundation",
            "University Of Georgia Research Foundation, Inc.",
            "California Institute Of Technology",
            "California Institute Of Technology",
            "California Institute Of Technology",
            "California Institute Of Technology",
            "Access Medical Systems, Ltd.",
            "California Institute Of Technology",
            "California Institute Of Technology",
            "The Mathworks, Inc.",
            "California Institute Of Technology",
            "California Institute Of Technology",
            "The Mathworks, Inc.",
            "Agilix Corp",
            "Guerra Cesar E",
            "Access Medical Systems, Ltd.",
            "Access Medical Systems, Ltd."
        ],
        [
            "Title",
            "Surface enhanced raman spectroscopy (SERS) systems and methods of use thereof",
            "Surface enhanced Raman spectroscopy (SERS) systems, substrates, fabrication thereof, and methods of use thereof",
            "Modular aptamer-regulated ribozymes",
            "Genetic control of mammalian cells with synthetic RNA regulatory systems",
            "Modular polynucleotides for ligand-controlled regulatory systems",
            "Modular aptamer-regulated ribozymes",
            "Luminescent polymer cyclic amplification",
            "Aptamer regulated nucleic acids and uses thereof",
            "Higher-order cellular information processing devices",
            "Propagation of characteristics in a graphical model environment",
            "Signal activated RNA interference",
            "General composition framework for ligand-controlled RNA regulatory systems",
            "Propagation of characteristics in a graphical model environment",
            "Ultra-sensitive detection systems using multidimension signals",
            "Detection systems for mass labels",
            "Luminescent polymer cyclic amplification",
            "Luminescent polymer cyclic amplification"
        ]
    ],
    "pageTitle": "Patent US20030124595 - Sensitive coded detection systems - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US20030124595?dq=3984803",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 6,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988930.94/warc/CC-MAIN-20150728002308-00285-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 483136039,
    "recordOffset": 483081377,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{100939=[0038] The amount composition of blocks in a specific-number block group set can be the same or different. That is, there can be substantially the same amount of each of the different blocks in a block group or there can be different amounts of one or more of the different blocks in a block group. Thus, a specific-number block group set can be either a level amount composition block group set or an unbalanced amount composition block group set. To illustrate, using the specific-number block group set described above, an unbalanced amount composition specific-number block group set could include block groups such as A2BC, A2BD, A2BE, A2BF, A2BG, A2BH, A2BI, A2BJ, ACD, ACE, . . . AGJ, AHI, AHJ, AIJ, 2BCD, 2BCE, 2BCF, 2BCG, 2BCH, 2BCI, 2BCJ, 2BDE, 2BDF, . . . EIJ, FGH, FGI, FGJ, FHI, FHJ, FIJ, GHI, GHJ, GIJ, and HIJ, where the number in front of a block refers to the relative amount of that block. In this illustration, block B is present in twice the amount of the other blocks., 108948=[0048] 2A2BC, . . . 2C2DE, 2A3BC, . . . 2C3DE, 2A4BC, . . . 2C4DE, 3A2BC, . . . 3C2DE, 3A3BC, . . . 3C3DE, 3A4BC, . . . 3C4DE, 4A2BC, . . . 4C2DE, 4A3BC, . . . 4C3DE, 4A4BC, . . . 4C4DE, 2AB2C, . . . 2CD2E, 2AB3C, . . . 2CD3E, 2AB4C, . . . 2CD4E, 3AB2C, . . . 3CD2E, 3AB3C, . . . 3CD3E, 3AB4C, . . . 3CD4E, 4AB2C, . . . 4CD2E, 4AB3C, . . . 4CD3E, 4AB4C, . . . 4CD4E,, 133472=[0079] Selenium substitution can be used to alter the mass of reporter signals. Selenium can substitute for sulfur in methionine, resulting in the modified amino acid selenomethionine. Selenium is approximately forty seven mass units larger than sulfur. Mass spectrometry may be used to identify peptides or proteins incorporating selenomethionine and methionine at a particular ratio. Small proteins and peptides with known selenium/sulfur ratio are preferably produced by chemical synthesis incorporating selenomethionine and methionine at the desired ratio. Larger proteins or peptides may be by produced from an E. coli expression system, or any other expression system that inserts selenomethionine and methionine at the desired ratio (Hendrickson et al., Selenomethionyl proteins procluded for analysis by multiwavelength anomalous diffraction (MAD): a vehicle for direct determination of three-dimensional structure. Embo J, 9(5):1665-72 (1990), Cowie and Cohen, Biosynthesis by Escherichia coli of active altered proteins containing selenium instead of sulfur. Biochimica et Biophysica Acta, 26:252 -261 (1957), and Oikawa et al., Metalloselenonein, the selenium analogue of metallothionein. synthesis and characterization of its complex with copper ions. Proc Natl Acad Sci USA, 88(8):3057-9 (1991)., 146172=[0094] This useful effect can also be obtained with oligonucleotide specific binding molecules by making use of the triple helix chemical bonding technology described by Gasparro et al., Nucleic Acids Res., 22(14):2845-2852 (1994). Briefly, the oligonucleotide specific binding molecule is designed to form a triple helix when hybridized to a target sequence. This is accomplished generally as known, preferably by selecting either a primarily homopurine or primarily homopyrimidine target sequence. The matching oligonucleotide sequence which constitutes the specific binding molecule will be complementary to the selected target sequence and thus be primarily homopyrimidine or primarily homopurine, respectively. The specific binding molecule (corresponding to the triple helix probe described by Gasparro et al.) contains a chemically linked psoralen derivative. Upon hybridization of the specific binding molecule to a target sequence, a triple helix forms. By exposing the triple helix to low wavelength ultraviolet radiation, the psoralen derivative mediates cross-linking of the probe to the target sequence., 109606=[0050] 2A2B3C, . . . 2C2D3E, 2A3B3C, . . . 2C3D3E, 2A4B3C, . . . 2C4D3E, 3A2B3C, . . . 3C2D3E, 3A3B3C, . . . 3C3D3E, 3A4B3C, . . . 3C4D3E, 4A2B3C, . . . 4C2D3E, 4A3B3C, . . . 4C3D3E, 4A4B3C, . . . 4C4D3E,, 181532=[0146] The principle components of a mass spectrometer include: (a) one or more sources, (b) one or more analyzers and/or cells, and (c) one or more detectors. Types of sources include Electrospray Ionization (ESI) and Matrix Assisted Laser Desorption Ionization (MALDI). Types of analyzers and cells include quadrupole mass filter, hexapole collision cell, ion cyclotron trap, and Time-of-Flight (TOF). Types of detectors include Multichannel Plates (MCP) and ion multipliers. A useful mass spectrometer for use with the disclosed method is described by Krutchinsky et al., Rapid Automatic Identification of Proteins Utilizing a Novel MALDI-Ion Trap Mass Spectrometer, Abstract of the 49th ASMS Conference on Mass Spectrometry and Allied Topics (May 27-31, 2001), The Rockefeller University, New York, N.Y., 91111=[0024] Liposomes are artificial structures primarily composed of phospholipid bilayers. Cholesterol and fatty acids may also be included in the bilayer construction. Liposomes may be loaded with fluorescent tags, and coated on the outer surface with specific recognition molecules (Truneh, A., Machy, P. and Horan, P. K., 1987, Antibody-bearing liposomes as multicolor immunofluorescent markers for flow cytometry and imaging. J. Immunol. Methods 100:59-71). However, the use of fluorescent liposomes in bioassays has been limited by the constraints of detection methods for fluorescent tags. Fluorescence-activated cell sorters typically have two or three different excitation-emission wavelengths, and microscopes typically have three or four excitation-emission filters. In the disclosed liposome detectors, liposomes serve as carriers for arbitrary block groups. By combining liposome detectors, loaded with arbitrary block groups, with methods capable of separating a multiplicity of blocks, it becomes possible to perfonn highly multiplexed assays., 108544=[0047] ABC, ABD, ABE, BCD, BCE, CDE, 2ABC, 2ABD, 2ABE, 2BCD, 2BCE, 2CDE, 3ABC, 3ABD, 3ABE, 3BCD, 3BCE, 3CDE, 4ABC, 4ABD, 4ABE, 4BCD, 4BCE, 4CDE, A2BC, A2BD, A2BE, B2CD, B2CE, C2DE, A3BC, A3BD, A3BE, B3CD, B3CE, C3DE, A4BC, A4BD, A4BE, B4CD, B4CE, C4DE, AB2C, AB2D, AB2E, BC2D, BC2E, CD2E, AB3C, AB3D, AB3E, BC3D, BC3E, CD3E, AB4C, AB4D, AB4E, BC4D, BC4E, CD4E,, 173678=[0134] The branched DNA for use as a carrier is generally known (Urdea, Biotechnology 12:926-928 (1994), and Horn et al., Nucleic Acids Res 23:4835-4841 (1997)). As used herein, the tail of a branched DNA molecule refers to the portion of a branched DNA molecule that is designed to interact with the analyte. The tail is a specific binding molecule. In general, each branched DNA molecule should have only one tail. The branches of the branched DNA (also referred to herein as the arms of the branched DNA) can contain coding tag sequences. Oligonucleotide dendrimers (or dendrimeric DNA) are also generally known (Shchepinov et al., Nucleic Acids Res. 25:4447-4454 (1997), and Orentas et al., J. Virol. Methods 77:153-163 (1999)). As used herein, the tail of an oligonucleotide dendrimer refers to the portion of a dendrimer that is designed to interact with the analyte. In general, each dendrimer should have only one tail. The dendrimeric strands of the dendrimer are referred to herein as the arms of the oligonucleotide dendrimer and can contain coding tag sequences., 159286=[0111] Oligonucleotide capture tags in arrays can also be designed to have similar hybrid stability. This would make hybridization of fragments to such capture tags more efficient and reduce the incidence of mismatch hybridization. The hybrid stability of oligonucleotide capture tags can be calculated using known formulas and principles of thermodynamics (see, for example, Santa Lucia et al., Biochemistry 35:3555-3562 (1996); Freier et al., Proc. Natl Acad. Sci. USA 83:9373-9377 (1986); Breslauer et al., Proc. Natl. Acad. Sci. USA 83:3746-3750 (1986)). The hybrid stability of the oligonucleotide capture tags can be made more similar (a process that can be referred to as smoothing the hybrid stabilities) by, for example, chemically modifying the capture tags (Nguyen et al., Nucleic Acids Res. 25(1 5):3059-3065 (1997); Hohsisel, Nucleic Acids Res. 24(3):430-432 (1996)). Hybrid stability can also be smoothed by carrying out the hybridization under specialized conditions (Nguyen et al., Nucleic Acids Res. 27(6):1492-1498 (1999); Wood et al., Proc. Natl. Acad. Sci. USA 82(6):1585-1588 (1985))., 109854=[0051] 2A2B4C, . . . 2C2D4E, 2A3B4C, . . . 2C3D4E, 2A4B4C, . . . 2C4D4E, 3A2B4C, . . . 3C2D4E, 3A3B4C, . . . 3C3D4E, 3A4B4C, . . . 3C4D4E, 4A2B4C, . . . 4C2D4E, 4A3B4C, . . . 4C3D4E, 4A4B4C, 4A4B4D, 4A4B4E, 4B4C4D, 4B4C4E, 4C4D4E., 157115=[0110] Planar array technology has been utilized for many years (Shalon, D., S. J. Smith, and P. O. Brown, A DNA microarray system for analyzing complex DNA samples using two-color fluorescent probe hybridization. Genome Res, 1996. 6(7): p. 639-45, Singh-Gasson, S., et al., Maskless fabrication of light-directed oligonucleotide microarrays using a digital micromirror array. Nat Biotechnol, 1999. 17(10): p. 974-8, Southern, E. M., U. Maskos, and J. K. Elder, Analyzing and comparing nucleic acid sequences by hybridization to arrays of oligonucleotides: evaluation using experimental models. Genomics, 1992. 13(4): p. 1008-17, Nizetic, D., et al., Construction, arraying, and high-density screening of large insert libraries of human chromosomes X and 21: their potential use as reference libraries. Proc Natl Acad Sci USA, 1991. 88(8): p. 3233-7, Van Oss, C. J., R. J. Good, and M. K. Chaudhury, Mechanism of DNA (Southern) and protein (Western) blotting on cellulose nitrate and other membranes. J Chromatogr, 1987.391(1): p.53-65, Ramsay, G., DNA chips: state-of-the art. Nat Biotechnol, 1998. 16(1): p. 40-4, Schena, M., et al., Parallel human genome analysis: microarray-based expression monitoring of 1000 genes. Proc Natl Acad Sci USA, 1996. 93(20): p. 10614-9, Lipshutz, R. J., et al., High density synthetic oligonucleotide arrays. Nat Genet, 1999. 21(1 Suppl): p. 20-4, Pease, A. C., et al., Light-generated oligonucleotide arrays for rapid DNA sequence analysis. Proc Natl Acad Sci USA, 1994. 91(11): p. 5022-6, Maier, E., et al., Application of robotic technology to automated sequence fingerprint analysis by oligonucleotide hybridisation. J Biotechnol, 1994. 35(2-3): p. 191-203, Vasiliskov, A. V., et al., Fabrication of microarray of gel-immobilized compounds on a chip by copolymerization. Biotechniques, 1999. 27(3): p. 592-4, 596-8, 600 passim, and Yershov, G., et al., DNA analysis and diagnostics on oligonucleotide microchips. Proc Natl Acad Sci USA, 1996. 93(10): p. 4913-8)., 165637=[0120] This useful effect can also be obtained with oligonucleotide capture tags by making use of the triple helix chemical bonding technology described by Gasparro et al., Nucleic Acids Res., 22(14):2845-2852 (1994). Briefly, the oligonucleotide capture tag is designed to form a triple helix when hybridized to a target sequence. This is accomplished generally as known, preferably by selecting either a primarily homopurine or primarily homopyrimidine target sequence. The matching oligonucleotide sequence which constitutes the capture tag will be complementary to the selected target sequence and thus be primarily homopyrimidine or primarily homopurine, respectively. The capture tag (corresponding to the triple helix probe described by Gasparro et al.) contains a chemically linked psoralen derivative. Upon hybridization of the capture tag to a target sequence, a triple helix forms. By exposing the triple helix to low wavelength ultraviolet radiation, the psoralen derivative mediates cross-linking of the probe to the target sequence., 109358=[0049] 2A2B2C, . . . 2C2D2E, 2A3B2C, . . . 2C3D2E, 2A4B2C, . . . 2C4D2E, 3A2B2C, . . . 3C2D2E, 3A3B2C, . . . 3C3D2E, 3A4B2C, . . . 3C4D2E, 4A2B2C, . . . 4C2D2E, 4A3B2C, . . . 4C3D2E, 4A4B2C, . . . 4C4D2E,, 193118=[0156] The disclosed method is particularly well suited to the use of a MALDI-QqTOF mass spectrometer. The method enables highly multiplexed analyte detection, and very high sensitivity. Useful tandem mass spectrometers are described by Loboda et al., Design and Performance of a MALDI-QqTOF Mass Spectrometer, in 47th ASMS Conference, Dallas, Tex. (1999), Loboda et al., Rapid Comm. Mass Spectrom. 14(12):1047-1057 (2000), Shevchenko et al., Anal. Chem., 72: 2132-2142 (2000), and Krutchinsky et al., J. Am. Soc. Mass Spectrom., 11(6):493-504 (2000). In such an instrument the sample is ionized in the source (MALDI, for example) to produce charged ions; it is useful for the ionization conditions to be such that primarily a singly charged parent ion is produced. First and third quadrupoles, Q0 and Q2, will be operated in RF only mode and will act as ion guides for all charged particles, second quadrupole Q1 will be operated in RF+DC mode to pass only a particular mass-to-charge (or, in practice, a narrow mass-to-charge range). This quadrupole selects the mass-to-charge ratio, (m/z), of interest. The collision cell surrounding Q2 can be filled to appropriate pressure with a gas to fracture the input ions by collisionally induced dissociation (normally the collision gas is chemically inert, but reactive gases are contemplated). Useful molecular systems utilize reporter signals that contain scissile bonds, labile bonds, or combinations, and these bonds will be preferentially fractured in the Q2 collision cell., 194722=[0157] A MALDI source is useful for the disclosed method because it facilitates the multiplexed analysis of samples from heterogeneous environments such as arrays, beads, microfabricated devices, tissue samples, and the like. An example of such an instrument is described by Qin et al., A practical ion trap mass spectrometerfor the analysis of peptides by matrix-assisted laser desorption/ionization., Anal. Chem., 68:1784 -1791 (1996). For homogeneous assays electrospray ionization (ESI) sources will work very well. Electrospray ionization source instruments interfaced to LC systems are commercially available (for example, QSTAR from PE-SCIEX, Q-TOF from Micromass). It is of note that the ESI sources are operated such that they tend to produce multiply charged ions, doubly charged ions would be most common for ions in the disclosed method. Such doubly charged ions are well known in the art and present no limitation to the disclosed method. TOF analyzers and quadrupole analyzers are preferred detectors over sector analyzers. Tandem in time ion trap systems such as Fourier Transform Ion Cyclotron Resonance (FT-ICR) mass spectrometers also may be used with the disclosed method., 69507=[0001] This application claims benefit of U.S. Provisional Application No. 60/332,982, filed Nov. 6, 2001. Application Ser. No. 60/332,982, filed Nov. 6, 2001, application Ser. No. 09/850,539, filed May 7, 2001, and application Ser. No. 09/929,266, filed Aug. 13, 2001, are hereby incorporated herein by reference in their entirety., 134852=[0080] Some forms of reporter signals can include one or more affinity tags. Such affinity tags can allow the detection, separation, sorting, or other manipulation of the labeled proteins, reporter signals, or reporter signal fragments based on the affinity tag. Such affinity tags are separate from and in addition to (not the basis of) the common properties of a set of reporter signals that allows separation of reporter signals from other molecules. Rather, such affinity tags serve the different purpose of allowing manipulation of a sample prior to or as a part of the disclosed method, not the means to separate reporter signals based on the common property. Reporter signals can have none, one, or more than one affinity tag. Where a reporter signal has multiple affinity tags, the tags on a given reporter signal can all be the same or can be a combination of different affinity tags. Affinity tags also can be used to distribute mass and/or charge differentially on reporter signals following the principles described above and elsewhere herein. Affinity tags can be used with reporter signals in a manner similar to the use of affinity labels as described in PCT Application WO 00/11208., 93298=[0027] The synthesis of dendrimers that may be used as polylabeled DNA probes has been described (Schchepinov, M. S., Udalova, I. A., Bridgman, A. J., Southern, E. M., 1997, Nucleic Acids Res. 25:4447-4454). Dendrimers may be associated with block groups to form dendrimer detectors., 195964=[0158] A number of elements contribute to the sensitivity of the disclosed method. The filter quadrupole, Q1, selects a narrow mass-to-charge ratio and discriminates against other mass-to-charge ions, significantly decreasing background from non germane ions. For example, for a sample containing a distribution of mass-to-charges of width 3000 Da, a mass-to-charge transmission window of 2 Da applied to this distribution can improve the signal to noise by at least a factor of 3000/2=1500. Once the parent ion is selected by quadrupole Q1, fragmentation of the parent ion, preferably into a single charged daughter ion, has the advantage over systems which fragment the parent into a number of daughter ions. For example, a parent fragmented into 20 daughter ions will yield signals that are on average {fraction (1/20)}th the intensity of the parent ions. For a parent to single daughter system there will not be this signal dilution., 113966=[0058] Blocks can be capable of being released by matrix-assisted laser desorption-ionization (MALDI) in order to be separated and identified (decoded) by time-of-flight (TOF) mass spectroscopy. For MALDI-TOF detection, the blocks can be peptide nucleic acids, where each block has a different mass to allow separation and separate detection in mass spectroscopy. For this purpose, it is useful to use combination of base composition and number of mass tags (e.g. the number of 8-amino-3,6-dioxaoctanoic monomers attached to the PNA (Griffin, T. J., W. Tang, and L. M. Smith, Genetic analysis by peptide nucleic acid affinity MALDI-TOF mass spectrometry. Nat Biotechnol, 1997. 15(12): p. 1368-72.)) to optimize the mass spectra for the set of blocks in a multiplex analysis., 105079=[0043] The amount composition of blocks in a variable-number block group set can be the same or different. That is, there can be substantially the same amount of each of the different blocks in a block group or there can be different amounts of one or more of the different blocks in a block group. Thus, a variable-number block group set can be either a level amount composition block group set or an unbalanced amount composition block group set. To illustrate, using the variable-number block group set described above, an unbalanced amount composition variable-number block group set could include block groups such as A2B, AC, AD, AE, AF, AG, AH, Al, AJ, 2BC, 2BD, 2BE, . . . GH, GI, GJ, HI, HJ, IJ, A2BC, A2BD, A2BE, A2BF, A2BG, A2BH, A2BI, A2BJ, ACD, ACE, . . . AGJ, AHI, AHJ, AIJ, 2BCD, 2BCE, 2BCF, 2BCG, 2BCH, 2BCI, 2BCJ, 2BDE, 2BDF, . . . EIJ, FGH, FGI, FGJ, FHI, FHJ, FIJ, GHI, GHJ, GIJ, and HIJ, where the number in front of a block refers to the relative amount of that block. In this illustration, block B is present in twice the amount of the other blocks.}",
    "textBeforeTable": "Patent Citations 8 Pro Ala Asp Pro Gly Ser Leu Ala Gly Ser Leu Arg 1 5 10 Artificial Sequence Note = Synthetic Construct Artificial Sequence PRT 12 8 7 Pro Ala Gly Ser Asp Pro Leu Ala Gly Ser Leu Arg 1 5 10 Artificial Sequence Note = Synthetic Construct Artificial Sequence PRT 12 7 6 Pro Ala Leu Ser Leu Gly Asp Pro Ala Ser Gly Arg 1 5 10 Artificial Sequence Note = Synthetic Construct Artificial Sequence PRT 12 6 5 Pro Ala Leu Ser Leu Ala Asp Pro Gly Ser Gly Arg 1 5 10 Artificial Sequence Note = Synthetic Construct Artificial Sequence PRT 12 5 4 Pro Ala Gly Ser Leu Ala Asp Pro Gly Ser Leu Arg 1 5 10 Artificial Sequence Note = Synthetic Construct Artificial Sequence PRT 12 4 3 Pro Ala Gly Ser Met Leu Asp Pro Ala Gly Ser Met Leu Arg 1 5",
    "textAfterTable": "US8875039 * Nov 18, 2003 Oct 28, 2014 The Mathworks, Inc. Propagation of characteristics in a graphical model environment US9029524 Dec 10, 2008 May 12, 2015 California Institute Of Technology Signal activated RNA interference US9040495 Aug 15, 2012 May 26, 2015 California Institute Of Technology General composition framework for ligand-controlled RNA regulatory systems US20050107998 * Nov 18, 2003 May 19, 2005 The Mathworks, Inc. Propagation of characteristics in a graphical model environment WO2006084130A2 * Feb 1, 2006 Aug 10, 2006 Agilix Corp Ultra-sensitive detection systems using multidimension signals WO2008048345A2 * Feb 14, 2007 Apr 24, 2008 Guerra Cesar E Detection systems for mass labels WO2012145270A2 * Apr 16, 2012 Oct 26, 2012 Access Medical Systems, Ltd. Luminescent polymer cyclic amplification WO2012145270A3 * Apr 16, 2012 Dec 20,",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}