{
    "relation": [
        [
            "",
            "Box",
            "027",
            "027",
            "028",
            "028",
            "028",
            "028",
            "028",
            ""
        ],
        [
            "",
            "Folder ID",
            "0020CL-001",
            "0020CL-002",
            "0020CL-003",
            "0020CL-004",
            "0020CL-005",
            "0020CL-006",
            "0020CL-007",
            ""
        ],
        [
            "",
            "Folder Title",
            "Census",
            "Census",
            "Census--Connecticut Counts brochure",
            "Census--Connecticut Counts, coordinators",
            "Census--Governor's letter to agencies",
            "Census--Networking, logo and marketing",
            "Census--Post-census",
            ""
        ],
        [
            "",
            "Folder Dates",
            "1989",
            "1990",
            "1989-1990",
            "1989",
            "1989",
            "1989-1990",
            "1990",
            ""
        ],
        [
            "",
            "Folder Contents",
            "Information about kick-off conference for 1990 census; information concerning need for an awareness campaign using state agencies and community volunteers; agendas for Marketing Group meetings.",
            "Information concerning need for an awareness campaign using state agencies and community volunteers; federal recruitment needs; elementary school students want to help with census.",
            "Minutes from meetings and information about the Connecticut Counts marketing group; a communications plan; lists of state agency census coordinators and the census steering committee; drafts of brochu",
            "Draft of Governor's letter to state agency heads to name a 1990 census coordinator; lists and meeting agendas of the Connecticut Counts Steering Committee; Governor's invitations to community members",
            "Governor's letter to agency heads asking for census coordinator, and the agency responses; lists of agency coordinators; notices of meetings",
            "Memos to Marketing Group about distribution of census information; details on 1990 Census promotion materials; census redistricting data; agenda of Marketing Group meeting; Linda Poltorak's notes from",
            "List of Post census Local Review challenges and summary of the program.",
            ""
        ]
    ],
    "pageTitle": "William A. O'Neill Archives",
    "title": "",
    "url": "http://eprints.ccsu.edu/help/spcoll/oneill/browse.php?subseries=001CL-0020&fold=census",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 0,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042991076.30/warc/CC-MAIN-20150728002311-00221-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 79337833,
    "recordOffset": 79329631,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Return to the Previous Page Subseries ID: 001CL-0020 Subseries Title: census An Inventory of His Gubernatorial Records at the Connecticut State Archives. William A. O'Neill:",
    "textAfterTable": "",
    "hasKeyColumn": true,
    "keyColumnIndex": 2,
    "headerRowIndex": 0
}