{
    "relation": [
        [
            "PART NUMBER",
            "M-6051-A302** (1)",
            "M-6051-C51** (1)",
            "M-6051-S331* (1)",
            "M-6051-CP331* (1)",
            "M-6051-B341* (1)",
            "M-6051-R351* (1)",
            "M-6051-A427*",
            "M-6051-A441*",
            "M-6051-B460*"
        ],
        [
            "CYLINDER BORE APPLICATION",
            "289/302/351W Production-Type Cast Iron and Aluminum Heads",
            "302/351",
            "302/351",
            "302/351",
            "Big Bore 351 Ford Racing Blocks",
            "302/351 Ford Racing",
            "All \"FE\" V-8",
            "429/460 Wedge",
            "429/460 Wedge"
        ],
        [
            "BORE DIAMETER",
            "4.00\"",
            "4.00\"",
            "4.00\"",
            "4.00\"",
            "4.125\"",
            "Up to 4.125\"",
            "Up to 4.230\"",
            "4.360\" Std.",
            "Up to 4.625\""
        ],
        [
            "GASKET DIAMETER",
            "4.100\"",
            "4.100\"",
            "4.100\"",
            "4.100\"",
            "4.160\"",
            "4.160\"",
            "4.400\"",
            "4.500\"",
            "4.670\""
        ],
        [
            "COMPRESSED THICKNESS",
            "0.042\"",
            "0.040\"",
            "0.040\"",
            "0.040\"",
            "0.040\"",
            "0.040\"",
            "0.040\"",
            "0.0425\"",
            "0.038\""
        ],
        [
            "COMPRESSED VOLUME",
            "9.1cc",
            "8.8cc",
            "8.8cc",
            "8.8cc",
            "9.1cc",
            "9.0cc",
            "9.7cc",
            "11.2cc",
            "10.7cc"
        ],
        [
            "NOTES",
            "4.00\" standard bore \"competition\" gasket for cast iron or aluminum cylinder heads on 302 and 351W production blocks. Features solid metallic core with wire encased combustion chamber seal for applications. Surfaces are Teflon coated.",
            "4.00\" standard bore expanded graphite gasket for high performance applications. Part of M-6051-A50 5.0L gasket kit described on page 62. Requires torque-to-yield cylinder head bolts.",
            "Pre-flattened steel wire combustion ring. Exhaust side is straight to accommodate FRPP block water passages.",
            "Pre-flattened copper wire combustion ring. Exhaust side is straight to accommodate FRPP block water passages.",
            "4.125\" overbore \"competition\" gasket. Same as gasket (M-6051-D331) except designed for Ford Racing blocks with larger 4.125\" overbore. Bore flange valve pockets have been added to unshroud intake and exhaust valves. Set includes unique right- and left-hand gaskets!",
            "For use on M-6010-R351/ R352/ R451/ R452/ BOSS302/ B302BB/ BOSS35195/ BOSS35192/ BOSS351BB.",
            "Race-quality gasket with steel wire combustion ring and stainless steel armor.",
            "Race-quality \"competition\" gasket. Features solid metal core and wire-encased combustion chamber seal.",
            "Competition gasket with round water openings to match M-6010-A460 engine blocks."
        ]
    ],
    "pageTitle": "CYLINDER HEAD GASKET | Part Details for M-6051-A441** | Ford Performance Racing Parts",
    "title": "",
    "url": "http://fordperformanceracingparts.com/parts/part_details.asp?PartKeyField=303",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 0,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042982502.13/warc/CC-MAIN-20150728002302-00038-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 90164828,
    "recordOffset": 90148434,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "CYLINDER HEAD GASKETS (SOLD IN PAIRS) tech notes Set Sold in Units of: $89.95 Suggested Retail Price M-6051-A441** CYLINDER HEAD GASKET click to enlarge Hover over image to zoom Part Details Privacy Policy. We will not share your personal information with third parties for their independent use. For information on how we protect your privacy, please read our Click Here to see the latest Fast News article submit Postal Code:",
    "textAfterTable": "NOTES: (1)Several different water hole patterns have been used on 302 and 351W Ford Racing cylinder blocks and heads since their introduction. Engine assemblers should lay the head gasket on the block and the cylinder head (with front of gasket toward the front of the engine) to make sure there is a path for coolant flow from the block into the head. In some cases, holes may have to be drilled in the block or head, or punched in the gasket. specs Package Dimensions: 0.25 x 8.25 x 22 Package Weight: 1 lbs Part Type: Engine: Gaskets Instruction Sheet: Not Available Warranty Availability: Not Available UPC Code: 756122605080 Country of Origin: United States California Executive Order: No",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}