{
    "relation": [
        [
            "Exercise",
            "Surfer",
            "Round Kick Crunch (Left)",
            "Round Kick Crunch (Right)",
            "1-2-3 Pushup",
            "NINJA!"
        ],
        [
            "Round 1",
            "10",
            "14",
            "14",
            "12",
            "5"
        ],
        [
            "Round 2",
            "7",
            "14",
            "14",
            "12",
            "5"
        ],
        [
            "Round 3",
            "8",
            "14",
            "14",
            "12",
            "5"
        ],
        [
            "Round 4",
            "7",
            "14",
            "14",
            "10",
            "5"
        ]
    ],
    "pageTitle": "bodyrock | Say Yes to Salad",
    "title": "",
    "url": "http://www.thesaladgirl.com/tag/bodyrock/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 0,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042991076.30/warc/CC-MAIN-20150728002311-00030-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 760478763,
    "recordOffset": 760451659,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{51637=© Copyright Say Yes to Salad 2015. Powered by WordPress. Designed by BluChic}",
    "lastModified": "Tue, 04 Aug 2015 17:50:45 GMT",
    "textBeforeTable": "Another Tuesday. Another day of BodyRocking. Today’s BodyRock Fat Burning Poker Face Workout was a 20-minute max reps challenge. Here are my scores. I think I could have pushed myself more in the beginning because you can see my reps did not decrease much as I went through. I was still beat at the end: Uncategorized categories: Makeshift Dip Station and Free Timers 2011 Jun 21 12 Comments Do you think we should have mandatory messages on food ads and packaging? What would the messages say? It means, “For your health, avoid eating food that is too fatty, too sweet, too salty.” Manger-bouger means, “eat, move.” I certainly didn’t see many overweight people in France – though I am not sure it’s because of this campaign. I did see a lot of smokers and wine and coffee drinkers. So while they may have a good thing going in terms of food and portion control, I think they are a little bit behind the times when it comes to other areas of health. (No, coffee and wine are not bad, in moderation. There is never an excuse for smoking.) Pour votre santé,",
    "textAfterTable": "These workouts are short and effective and, as my husband will tell you, efficiency and optimization are always, always, on my mind. Whether it’s minimizing the amount of time we have to wait at stop lights while walking or maximizing utils, I am an optimization machine. (I was an econ and math major in college.) Ah, yes, today’s title: Makeshift Dip Station It’s 2 chairs (just dining chairs) with folded linens over the tops (I started without but it hurt my hands). It is a little bit short for me but I made sure that I didn’t hunch and instead just bent my knees when going to grab the backs of the chairs for the air crunch. I don’t know what the pair of scissors is doing there. Bobby must have used them last night for something. Free Timers I use this one, but I also found two other options while Googling this morning: Online timer 1 – lots of options Tabata Workout Timer (Tabata is a type of interval training, I did it in CA a few times) Last summer at my wedding (bride + maid of honor). Handmade and handpicked bouquets from the organic farm she",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}