{
    "relation": [
        [
            "SNP ID",
            "rs13501",
            "rs17034",
            "rs117821",
            "rs183585",
            "rs241424"
        ],
        [
            "Clin",
            "--",
            "--",
            "--",
            "--",
            "--"
        ],
        [
            "Chr 06 pos",
            "32,825,746(+)",
            "32,828,744(-)",
            "32,830,934(-)",
            "32,831,896(-)",
            "32,837,157(-)"
        ],
        [
            "Sequence Context",
            "GTGGA(A/G)TCAGG",
            "TTGCA(A/G)GCACG",
            "TTAAA(A/G)GTGGA",
            "ttcca(C/T)ttgtg",
            "CACTC(C/T)CTCAG"
        ],
        [
            "AA Info",
            "",
            "",
            "",
            "",
            ""
        ],
        [
            "Type",
            "utr-variant-3-prime, intron-variant",
            "utr-variant-3-prime, intron-variant",
            "intron-variant",
            "intron-variant",
            "intron-variant"
        ],
        [
            "MAF",
            "",
            "",
            "",
            "",
            ""
        ]
    ],
    "pageTitle": "TAP2 Gene - GeneCards | TAP2 Protein | TAP2 Antibody",
    "title": "",
    "url": "http://www.genecards.org/cgi-bin/carddisp.pl?gene=TAP2&reactome_pathways=6&rf=/home/genecards/current/website/carddisp.pl",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 9,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042982502.13/warc/CC-MAIN-20150728002302-00001-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 457052827,
    "recordOffset": 456974843,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{279547=The membrane-associated protein encoded by this gene is a member of the superfamily of ATP-binding cassette (ABC) transporters. ABC proteins transport various molecules across extra- and intra-cellular membranes. ABC genes are divided into seven distinct subfamilies (ABC1, MDR/TAP, MRP, ALD, OABP, GCN20, White). This protein is a member of the MDR/TAP subfamily. Members of the MDR/TAP subfamily are involved in multidrug resistance. This gene is located 7 kb telomeric to gene family member ABCB2. The protein encoded by this gene is involved in antigen presentation. This protein forms a heterodimer with ABCB2 in order to transport peptides from the cytoplasm to the endoplasmic reticulum. Mutations in this gene may be associated with ankylosing spondylitis, insulin-dependent diabetes mellitus, and celiac disease. Alternative splicing of this gene produces products which differ in peptide selectivity and level of restoration of surface expression of MHC class I molecules. [provided by RefSeq, Feb 2014]}",
    "textBeforeTable": "Sequence variations from dbSNP and Humsavar for TAP2 Gene 4 common alleles are officially recognized: TAP2*01:01 (TAP2A or PSF2A or RING11A), TAP2*01:02 (TAP2E), TAP2*01:03 (TAP2F), and TAP2*02:01 (TAP2B or PSF2B or RING11B). Other relatively common alleles have been identified: TAP2*01D, TAP2*01E, TAP2*01F, TAP2*01G, TAP2*01H, TAP2*02B, TAP2*02C (TAP2*02:02), TAP2*02D, TAP2*02E, TAP2*02F, TAP2*03A and TAP2*04A. The sequence shown is that of TAP2*01:01 Q03519-TAP2_HUMAN Polymorphic Variants from UniProtKB/Swiss-Prot for TAP2 Gene Variants for TAP2 Gene",
    "textAfterTable": "Structural Variations from Database of Genomic Variants (DGV) for TAP2 Gene Variant ID Type Subtype PubMed ID nsv511120 CNV Complex 20534489 nsv885712 CNV Loss 21882294 esv2731872 CNV Deletion 23290073 esv2660966 CNV Deletion 23128226 esv1707688 CNV Deletion 17803354 esv2731874 CNV Deletion 23290073 esv33465 CNV Loss 17666407 esv32583 CNV Loss 17666407 nsv522573 CNV Loss 19592680 nsv830633 CNV Loss 17160897 nsv462891 CNV Loss 19166990 Relevant External Links for TAP2 Gene HapMap Linkage Disequilibrium report TAP2 Human Gene Mutation Database (HGMD)",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}