{
    "relation": [
        [
            "Person charged with sedition",
            "Manoj Shinde",
            "Kahturam Sunani",
            "Binayak Sen",
            "Bharat Desai and Gautam Mehta",
            "Kirori Singh Bainsla",
            "Lenin Kumar",
            "Laxman Choudhury",
            "V Gopalaswamy (Vaiko)",
            "Piyush Sethia",
            "E Rati Rao",
            "Niranjan Mahapatra, Avinash Kulkarni, Bharat Pawar, and others",
            "Arundhati Roy, S A R Geelani, Varavara Rao, Shuddabrata Sengupta and others",
            "Noor Muhammed Bhat",
            "Sudhir Dhawale"
        ],
        [
            "Occupation",
            "Editor, Surat, Saamna",
            "Journalist, OTV",
            "Doctor and human rights activist",
            "Resident Editor, Times of India, Ahmedabad; photographer,Gujarat Samachar (Mehta)",
            "Gujjar community leader",
            "Editor, Nishan",
            "Journalist, Sambadh",
            "Politician, MDMK",
            "Environmentalist and organic farmer",
            "Resident Editor, Varthapatra",
            "Trade union leaders and social activists",
            "Writers, political activists, and media theorists",
            "Lecturer, Gandhi Memorial College, Srinagar",
            "Dalit rights activist and freelance journalist"
        ],
        [
            "When",
            "August 2006",
            "May 2007",
            "May 2007",
            "June 2008",
            "June 2008",
            "Decem- ber 2008",
            "Septem- ber 2009",
            "Decem ber 2009",
            "January 2010",
            "February 2010",
            "March 2010- June 2010",
            "November 2010",
            "December 2010",
            "January 2011"
        ],
        [
            "Where",
            "Surat, Gujarat",
            "Sinapali, Orissa",
            "Raipur, Chhattisgarh",
            "Ahmedabad, Gujarat",
            "Bayana, Rajasthan",
            "Bhubaneshwar, Orissa",
            "Gajapati district, Orissa",
            "Chennai, Tamil Nadu",
            "Salem, Tamil Nadu",
            "Mysore, Karnataka",
            "Gujarat",
            "Delhi",
            "Srinagar",
            "Wardha, Maharashtra"
        ],
        [
            "Nature of charges",
            "For using “abusive words” against Chief Minister Narendra Modi in an editorial while alleging administrative failure in tackling the flood situation in Surat",
            "For filing a report that Pahariya tribals were consuming ‘soft’ dolomite stones in Nuapada district due to acute hunger",
            "For allegedly helping courier messages to Maoist leadership. Sen had criticised the Chhattisgarh government’s support to the vigilante Salwa Judum",
            "For articles and photographs that alleged links between the Ahmedabad police commissioner and the underworld",
            "For leading an agitation demanding ST status for Gujjars",
            "For publishing a special booklet on the Kandhamal riots entitled ‘Dharmanare Kandhamalre Raktonadhi’ (Kandhamal’s rivers of blood)",
            "For allegedly possessing Maoist literature. Chaudhury had been writing about the involvement of local police in illegal drug trafficking",
            "Remarks allegedly against India’s sovereignty at a book launch function",
            "Pamphlet distributed during protest against Chhattisgarh government’s support for Salwa Judum",
            "Article in Varthapatra alleging encounter deaths in Karnataka",
            "Police allege links with CPI (Maoist)",
            "Private complaint alleging that they made anti-India speeches at a seminar on Kashmir titled ‘Azadi: The Only Way’",
            "For setting a question paper for English literature students on whether ‘stone-pelters were the real heroes’",
            "Police allege links with CPI (Maoist) party"
        ]
    ],
    "pageTitle": "Sedition and the death of free speech | Freedom of expression | Agenda",
    "title": "",
    "url": "http://infochangeindia.org/agenda/freedom-of-expression/sedition-and-the-death-of-free-speech.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 23,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042991076.30/warc/CC-MAIN-20150728002311-00277-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 119103871,
    "recordOffset": 119079388,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{73206=The most famous sedition trial after Tilak’s was the trial of Mohandas Gandhi in 1922. Gandhi was charged, along with Shankerlal Banker, the proprietor of Young India, for three articles published in the magazine. The trial, attended by the most prominent political figures of that time, was followed closely by the entire nation. It was presided over by Judge Strangman. Gandhi explained to the judge why from being a staunch royalist he had become an uncompromising disaffectionist and non-cooperator, and why it was his moral duty to disobey the law. In a stunning statement, Gandhi commented on the law that was used to try him, and demanded that the judge give him the maximum punishment possible., 62303=Recent media attention and public debate around India’s sedition laws have sparked renewed interest in the manner in which these laws have been used to curb free speech in the country. A quick look at some of those facing sedition charges over the last few years is enough to tell us that there is pressing need for a debate on whether we require these archaic provisions at all. The sedition charges against medical practitioner and human rights worker Dr Binayak Sen have provoked outrage amongst a large section of Indian citizens as well as human rights activists globally. Sen’s work, especially in the area of public health, has gained worldwide recognition, which explains why his trial is being followed closely across the world. Unfortunately, his credentials seem to have had little impact on the Raipur trial court, which convicted him with a maximum sentence of life imprisonment in December 2010. Sen’s application to be released on bail was rejected by the Bilaspur High Court. He subsequently filed an appeal in the Supreme Court which granted him bail on April 15, 2011., 76146=The sedition laws were successfully challenged in two high court cases in the 1950s, when the courts held that they violated the right to freedom of speech and expression guaranteed by the Constitution (1). However these judicial developments received a jolt when, stung by two court decisions in 1949 that upheld freedom of speech with regard to opinions from the far left and the far right, Nehru asked his Cabinet to amend Article 19 (1) a. The two cases that prompted Nehru to do this were the Romesh Thapar case, in which the Madras government, after declaring the Communist Party illegal, banned the left-leaning magazine Crossroads for being overly critical of the Nehru government. The court held that banning a publication because it would endanger public safety or public order was not supported by the constitutional scheme since the exceptions to 19 (1) a were specific and had to entail a danger to the security of the state. The second case related to an order passed by the chief commissioner, Delhi, asking the RSS mouthpiece Organiser to submit all communal matter and material related to Pakistan to scrutiny., 78296=Despite the First Amendment, in 1958 the Allahabad High Court did follow the previous two cases and held Section 124 A of the IPC to be unconstitutional (2). However, the defining moment came in 1962 when in the landmark Kedar Nath Singh judgment the Supreme Court upheld the constitutionality of Section 124 A, at the same time circumscribing its meaning. In its decision, the Supreme Court distinguished clearly between disloyalty to the government and commenting upon the measures of the government without inciting public disorder by acts of violence. The court upheld the constitutionality of the sedition law, whilst also curtailing its meaning and limiting its application to acts involving intention or tendency to create disorder, or disturbance of law and order, or incitement to violence. The judges observed that if the sedition law were to be given a wider interpretation, it would not survive the test of constitutionality., 71854=Given the widespread nature of its use, there is an urgent need to re-examine the history of this legislation. Sedition laws are found in the following laws in India: the Indian Penal Code, 1860 (Section 124 (A)); the Code of Criminal Procedure, 1973 (Section 95); the Seditious Meetings Act, 1911; and the Unlawful Activities (Prevention) Act (Section 2 (o) (iii)). Common to these laws is the idea of ‘disaffection’ that we have inherited from the British. ‘Disaffection’ has been defined as a feeling that can exist only between ‘the ruler’ and ‘the ruled’. The ruler must be accepted as a ruler. Disaffection is the opposite of that feeling, and manifests a lack of, or repudiation of acceptance of a particular government as ruler., 99843=© 2012 InfoChange India News & Features development news India Developed By Tekdi Web Solutions., 79255=While the Supreme Court has limited the scope of the sedition law (at the same time upholding its constitutionality), successive central and state governments in the country continue to file charges of sedition against journalists, media practitioners, human rights activists and anyone who dares express dissent. For many, it is the process of being dragged to court that is the punishment. So even if someone charged with sedition is acquitted along the way, he faces punishment by being put through a torturous legal process. Trial courts have been increasingly guilty of entertaining sedition charges (and sometimes even convicting) at the initial stages. Some of this can be attributed to the local pressures that judges in the trial court face and the larger atmosphere of the so-called ‘war against terror’. The problem is aptly described in the Supreme Court’s observation in a case concerning a Kashmiri youth acquitted of charges of sedition in 1997 (3):, 87149=Infochange News & Features, July 2011, 64460=In another high-profile case, sedition charges were filed in November 2010 against Arundhati Roy, S A R Geelani, Varavara Rao and others for their speeches at a seminar on Kashmir titled ‘Azadi: The Only Way’. The charges were pursued based on a private complaint filed in a trial court in Delhi., 72612=Ironically, some of the most famous sedition trials of the late-19th and early-20th century were those of Indian nationalist leaders including Tilak, Gandhi, and Annie Besant. In 1898, the law was amended by the British. Disaffection was now stated to include ‘disloyalty and all feelings of enmity’. The new amendment added the words ‘hatred or contempt’ to the word ‘disaffection’. These amendments also brought in Section 153-A  and Section 505 of the IPC., 57015=Tue 4Aug2015, 81734=Endnotes 1 Tara Singh Gopi Chand v The State 1951 CriLJ 449 and Sabir Raza v The State, Cri App No 1434 of 1955, D/-11-2-1958 (All) cited in Ram Nandan v State, AIR 1959 All 101 2 Ram Nandan v State, AIR 1959 All 101 3 Bilal Ahmed Kaloo v State of Andhra Pradesh, AIR 1997 SC 3483}",
    "textBeforeTable": "Recent cases at a glance The charges demonstrate how sedition laws are used to harass people even if the government is wary of using them. Facts listed in the following table indicate the manner in which these laws are used to muzzle dissent and target the media. These cases have been reported in the newspapers; there are probably many unreported ones.   In another high-profile case, sedition charges were filed in November 2010 against Arundhati Roy, S A R Geelani, Varavara Rao and others for their speeches at a seminar on Kashmir titled ‘Azadi: The Only Way’. The charges were pursued based on a private complaint filed in a trial court in Delhi. While the Chhattisgarh government claims that Sen acted as a courier between an alleged Naxalite leader in Raipur jail and the party leadership in hiding, many believe that he is the target of a systematic campaign to silence dissenting voices in a state which has seen violent conflict between the state-supported vigilante force Salwa Judum and the Naxalites. Sen represented the shrinking group of civil society voices opposed to a military solution to the problem of Naxalism. These groups include Sen’s organisation, the People’s Union for Civil Liberties (PUCL), Chhattisgarh, which has been critical of the state government’s policies of encouraging large-scale investments in mines and minerals and other industries in this resource-rich state without regard to the consequences for the already pauperised tribal population in these areas. ",
    "textAfterTable": "Given the widespread nature of its use, there is an urgent need to re-examine the history of this legislation. Sedition laws are found in the following laws in India: the Indian Penal Code, 1860 (Section 124 (A)); the Code of Criminal Procedure, 1973 (Section 95); the Seditious Meetings Act, 1911; and the Unlawful Activities (Prevention) Act (Section 2 (o) (iii)). Common to these laws is the idea of ‘disaffection’ that we have inherited from the British. ‘Disaffection’ has been defined as a feeling that can exist only between ‘the ruler’ and ‘the ruled’. The ruler must be accepted as a ruler. Disaffection is the opposite of that feeling, and manifests a lack of, or repudiation of acceptance of a particular government as ruler. Ironically, some of the most famous sedition trials of the late-19th and early-20th century were those of Indian nationalist leaders including Tilak, Gandhi, and Annie Besant. In 1898, the law was amended by the British. Disaffection was now stated to include ‘disloyalty and all feelings of enmity’. The new amendment added the words ‘hatred or contempt’ to the word ‘disaffection’. These amendments also brought in Section 153-A  and Section 505 of the IPC. The most famous sedition trial after Tilak’s was the trial of Mohandas Gandhi in 1922. Gandhi was charged, along with Shankerlal Banker, the proprietor of Young India, for three articles published in the magazine. The trial, attended by the most prominent political figures of that time, was",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}