{
    "relation": [
        [
            "Date",
            "Sep 19",
            "Sep 27",
            "Oct 4",
            "Oct 11",
            "Oct 18",
            "Oct 25",
            "Nov 1",
            "Nov 8",
            "Nov 15",
            "Nov 22"
        ],
        [
            "Opponent",
            "Holy Cross",
            "at Brown",
            "at Georgetown",
            "Cornell",
            "Lafayette",
            "at Princeton",
            "at Dartmouth",
            "Columbia",
            "at Penn",
            "Yale"
        ],
        [
            "Score",
            "W, 41-18",
            "W, 22-14",
            "W, 34-3",
            "W, 24-7",
            "W, 24-14",
            "W, 49-7",
            "W, 23-12",
            "W, 45-0",
            "W, 34-24",
            "W, 31-24"
        ],
        [
            "comp",
            "-",
            "-",
            "-",
            "-",
            "-",
            "-",
            "-",
            "-",
            "-",
            "-"
        ],
        [
            "att",
            "-",
            "-",
            "-",
            "-",
            "-",
            "-",
            "-",
            "-",
            "-",
            "-"
        ],
        [
            "pct",
            "-",
            "-",
            "-",
            "-",
            "-",
            "-",
            "-",
            "-",
            "-",
            "-"
        ],
        [
            "yds",
            "-",
            "-",
            "-",
            "-",
            "-",
            "-",
            "-",
            "-",
            "-",
            "-"
        ],
        [
            "y/a",
            "-",
            "-",
            "-",
            "-",
            "-",
            "-",
            "-",
            "-",
            "-",
            "-"
        ],
        [
            "td",
            "-",
            "-",
            "-",
            "-",
            "-",
            "-",
            "-",
            "-",
            "-",
            "-"
        ],
        [
            "int",
            "-",
            "-",
            "-",
            "-",
            "-",
            "-",
            "-",
            "-",
            "-",
            "-"
        ],
        [
            "sac",
            "-",
            "-",
            "-",
            "-",
            "-",
            "-",
            "-",
            "-",
            "-",
            "-"
        ],
        [
            "yds",
            "-",
            "-",
            "-",
            "-",
            "-",
            "-",
            "-",
            "-",
            "-",
            "-"
        ]
    ],
    "pageTitle": "Andrew Fischer - Harvard",
    "title": "",
    "url": "http://www.gocrimson.com/sports/fball/2014-15/bios/fischer_andrew_42f1",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 3,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988317.67/warc/CC-MAIN-20150728002308-00219-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 483485879,
    "recordOffset": 483464038,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{224917=© Copyright 2014 Harvard University All Rights Reserved, 68668=at Harvard: 2014: Ranks 13th in school history with 87 career catches for 1,026 yards ... Named to the All-Ivy League second team ... Honored on CollegeSportsMadness All-Ivy second team ... Earned All-New England team honors ... Had 55 catches for 677 yards and 4 TDs on the season; his 55 receptions were sixth most in a season in school history ... Was second in the Ivy League with 129.8 all-purpose yards per game ... Ranks third in team history with 22.9 kickof return average ... Returned 15 kickoffs for 356 yards on the year ... Caught six passes for 57 yards and returned one kickoff for 28 yards against Holy Cross ... Had a career-high 12 receptions for 115 yards and a TD at Brown; also had three kick returns for a total of 49 yards ... Named COOP Athlete of the Week Sept. 30 ... Had four catches for 16 yards, two kickoff returns for 63 yards and two rushes for 28 yards at Georgetown ... Made four grabs for 14 yards vs. Cornell ... Amassed 237 all-purpose yards (107 receiving, 86 kickoff return, 32 punt return, 12 rushing) vs. Lafayette; Had a 78-yard TD catch ... Had 159 all-purpose yards, incuding four catches for 84 yards and five punt returns for 75 yards, at Princeton ... Made two catches for 13 yards at Dartmouth ... Caught four passes for 59 yards vs. Columbia ... Had five receptions for 63 yards and rushed two times for 14 yards, while adding 52 kick return yards for a total of 133 all-purpose yards, at Penn ... Amassed 264 all-purpose yards, including 149 receiving and 79 rushing, vs. Yale; Had two TDs, including game-winner with 55 seconds left ... Named Ivy League Co-Offensive Player of the Week Nov. 24 ... Earned recipient of NEFWA Gold Helmet Nov. 24. 2013: Was tied for third on the team with 24 receptions and finished with 285 yards and three touchdowns ... Had 13 kickoff returns for 299 yards ... Made two touchdown grabs and finished with six catches for 71 yards at San Diego ... Caught three passes for 34 yards against Brown ... Made five receptions for 36 yards anf finished with 97 all-purpose yards at Holy Cross ... Pulled in four catches for 64 yards and had 86 kick return yards for 150 all-purpose yards at Cornell ... Had a TD grab and finished with three catches for 51 yards against Lafayette ... Made three catches for 29 yards against Princeton. 2012: Had two catches for 24 yards against Holy Cross ... Had a six-yard carry and a nine-yard reception against Cornell ... Had a 58-yard TD run against Bucknell.  }",
    "textBeforeTable": "Andrew Fischer 1 1 Related Bios Kyle Adams Sean Ahern Larry Allen Jr. Ryan Antonellis Jake Barann Sam Batiste Jordan Becerra David Bicknell Colby Blaze Blade Brady Ruairi Brady Ben Braunecker Kolbi Brown Matt Brown Nick Burrello Darien Carr Andrew Casten John Cifrino Alec Coyle-Nicolas Dayne Davis Ryan Delisle Dominick DeLucia James Duberg Nick Easton Chris Evans Scott Evans Tobe Ezeokoli Anthony Fabiano Ben Falloon Anthony Firkser Andrew Flesher Jake Forte Joseph Foster Justin Fox David Gawlas Asante Gibson Mark Goldman Chase Guillory Tim Haehl Ryan Halvorson Tyler Hamblin Stone Hart Norman Hayes Conner Hempel Jimmie Hill Zack Hodges Jason Holdway Scott Hosch Luke Hutton Caleb Johnson Stuart Johnson Van Johnson III Ryan Jones Paul Kaczor Chris Keegan Matt Koran Daniel Laden Adam Ledford Christian Lee Tanner Lee Jacob Lindsey Michael Mancinelli James Martter Jacob Mayes Miles McCollum Raishaun McGhee Jameson McShea Eric Medes Dan Melow Nick Merletti Jimmy",
    "textAfterTable": "Date Opponent Score comp att pct yds y/a td int sac yds Sep 19 Holy Cross W, 41-18 - - - - - - - - - Sep 27 at Brown W, 22-14 - - - - - - - - - Oct 4 at Georgetown W, 34-3 - - - - - - - - - Oct 11 Cornell W, 24-7 - - - - - - - - - Oct 18 Lafayette W, 24-14 - - - - - - - - - Oct 25 at Princeton W, 49-7 - - - - - - - - - Nov 1 at Dartmouth W, 23-12 - - - - - - - - - Nov 8 Columbia W, 45-0 - - - - - - - - - Nov 15 at Penn W, 34-24 - -",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}