{
    "relation": [
        [
            "date",
            "2014/09/14",
            "2014/09/17",
            "2014/09/27",
            "2014/10/12",
            "2014/10/18"
        ],
        [
            "opponent",
            "Yeshiva",
            "New Jersey City University; SUNY-Purchase",
            "NCCGA Regional Tournament 1",
            "USCAA National Championship",
            "NCCGA Regional Tournament 2"
        ],
        [
            "location",
            "Pelham Split Rock Course Bronx, NJ",
            "TBD",
            "Beaver Brook Country Club Annandale, NJ",
            "Penn State Golf Course",
            "High Point Golf Club Montague, NJ"
        ],
        [
            "time",
            "",
            "",
            "",
            "",
            ""
        ],
        [
            "result",
            "",
            "",
            "",
            "",
            ""
        ]
    ],
    "pageTitle": "Golf | The King's College",
    "title": "",
    "url": "https://www.tkc.edu/athletics-sport/golf",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 0,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042991076.30/warc/CC-MAIN-20150728002311-00126-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 928837986,
    "recordOffset": 928822017,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{1305=750 colleges and universities nationwide take part in this competition all hoping to make it to the National Championships in Las Vegas in June 2014. Reese Evans and Sean Spurlock shot a 67 to take first in the event and earn a spot out in Las Vegas. For the Fall of 2014, The King's College Lions, will join our varsity-level teams as members of the United States Collegiate Athletic Association(USCAA) and National Christian Collegiate Athletic Association (NCCAA)., 1613=The King's College men’s and women's golf team, started as a club team in 2010, is now in its third year as a program competing in a variety of events. Seven members of The King's College Golf Team traveled Springfield, MA in October for the College Golf Alliance Regional Championships.}",
    "lastModified": "Tue, 04 Aug 2015 17:53:36 GMT",
    "textBeforeTable": "--> next 2 1 0 prev Golf Golf -->",
    "textAfterTable": "roster Jordan McGinnis position: year: Freshman height: 6'6\" from: Hickory, NC Gabe Medina position: year: Junior height: 5'11\" from: Henderson, CO Victoria Li position: year: Sophomore height: 5'2\" from: Grosse Pointe, MI Contact Sean Horan, Athletic Director, with questions. contact athletics coaching staff Thomas Palmgren, Head Coach Thomas Palmgren Head Coach, Golf Coach Palmgren has most recently coached at NYU-Polytechnical here in New York City, and he is also the founder and president of the non-profit Harlem Golf Alliance. \"I believe that young people need to understand that in all of sports golf is the sport that will give you great opportunity. You enter the work force and the BOSS is not going to ask when are we going to shoot hoops or kick and throw the ball around, he or she wants to know do you play",
    "hasKeyColumn": true,
    "keyColumnIndex": 1,
    "headerRowIndex": 0
}