{
    "relation": [
        [
            "Pitcher",
            "CC Sabathia",
            "Hiroki Kuroda",
            "Ivan Nova",
            "Michael Pineda",
            "David Phelps",
            "Total"
        ],
        [
            "GS",
            "30",
            "31",
            "32",
            "7",
            "32",
            "132"
        ],
        [
            "IP",
            "192",
            "192",
            "189",
            "38",
            "182",
            "793"
        ],
        [
            "W-L",
            "12-11",
            "12-11",
            "12-12",
            "3-2",
            "11-12",
            "50-48"
        ],
        [
            "ERA",
            "3.84",
            "3.92",
            "3.99",
            "4.32",
            "4.35",
            "4.08"
        ],
        [
            "WAR",
            "3.6",
            "3.4",
            "3.1",
            "0.6",
            "2.1",
            "12.8"
        ]
    ],
    "pageTitle": "How the Yankees Can Build Championship Rotation Without Masahiro Tanaka | Bleacher Report",
    "title": "",
    "url": "http://bleacherreport.com/articles/1897596-how-the-yankees-can-build-championship-rotation-without-masahiro-tanaka",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 2,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988317.67/warc/CC-MAIN-20150728002308-00294-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 26250863,
    "recordOffset": 26200231,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{122302=But even a four-time All-Star and two-time Cy Young Award winner doesn't deserve more than a one-year minor league deal with so much in question. At 35 years of age for the 2014 season, would you risk more than a non-roster invite on him without knowing whether his career will even continue?, 117201=Garza was solid in 11 starts for Chicago in 2013 (3.17 ERA, 7.9 K/9), but then he was just average in 13 starts for Texas when he returned to the American League, compiling a 4.38 ERA.  , 121474=Santana is a flashier left-handed idea than Maholm, but high-risk is a robust understatement. Johan missed both 2011 and 2013 because of injury (that's two out of the last three seasons) and if the Yanks want to gamble on that twice-torn shoulder capsule, well, they can likely do it for cheap., 125329=For another comparison, here is the output from the four most productive pitchers for the 2013 champion Red Sox, who also used multiple arms as the No. 5:, 114640=Jimenez famously shone (peaked?) in Colorado in 2010 (6.5 WAR, 2.88 ERA, 8.69 K/9) and was very good in 2008 and 2009 as well (respective 3.9 and 5.6 WAR and 3.99 and 3.47 ERA). He was pretty bad in 2011 and 2012, and then was solid again in 2013 with Cleveland—especially down the stretch. He finished last year with 3.2 WAR, 3.30 ERA and, best of all, missed a ton of bats (9.56 K/9)., 127271=Finally, using Steamer Projections, let's look at a three realistic 2014 Yankees rotations related to the best options and see how they might theoretically stack up., 110456=There is some uncertainty—or better yet, doubt—surrounding the soon-to-be 25-year-old since he has yet to throw a pitch for the Yankees after coming over in the trade that sent Jesus Montero to Seattle. The young Dominican missed the entirety of 2012 because of shoulder surgery for a torn labrum. After beginning 2013 on the disabled list, he pitched 10 games between High-A, Double-A and Triple-A, and there remains two big \"if's\": his health and his identity., 115512=Steamer projects a 2.9 WAR and 3.90 ERA in 192 innings for 2014. Would you really pass on a 30-year-old former All-Star at the back end of your rotation as at least some insurance with the potential for 200 innings, sub-4.00 ERA and maybe 3.0 WAR?, 107522=First, here's a profile of the best options from each of the available talent pools for keeping their championship rotation aspirations afloat in 2014., 103935=Since October, per Mark Feinsand of the Daily News, Masahiro Tanaka has been their first choice—a No. 2-type arm they ultimately expect to not only fill the gaps left by Andy Pettitte and Phil Hughes, but also to catapult them right back into the contender discussion alongside the other three known starters. , 120255=He absolutely does not overpower hitters (career 5.8 K/9, 6.18 in 2013), though he has shown above-average control (career 2.9 BB/9, 2.76 in 2013) and only surrendered 17 homers in 2013. His best seasons came over a two-year segment in Pittsburgh between 2008 and 2009, in which he had 2.4 and 2.9 WAR and 3.71 and 4.44 ERA., 115160=He unfortunately also missed a lot of the strike zone last year (3.96 BB/9) and over the course of his career (4.04 BB/9). And you may not be expecting the term \"upside\" for a previously proven pitcher, but Jimenez will be just 30 years old in 2014 and probably has a lot of life left in him (and may not be too expensive)., 118094=In 2011, 38-year-old (!) Bartolo Colon pitched 164.1 innings and posted a .400 ERA and 2.8 WAR (!), and 34-year-old Freddy Garcia pitched 146.2 innings, with a 3.62 ERA and 2.2 WAR. , 119970=The longtime Pirate, and most recently Brave, will turn 32 in June 2014. Over nine seasons, eight of which were full-length, he has a 4.28 ERA and has fluctuated between league-average and slightly above-average FIP and between solid and role-player-level WAR. , 112531=Bottom line, you don't like Warren to beat out the two names above him, but he was strong in 34 appearances in 2013. Over 77 innings, he compiled a 3.39 ERA, 4.32 FIP (though, 3.98 xFIP) and 64 strikeouts (7.48 K/9). He only started two games, but one of them was in Houston at the end of the season where he picked up the win and went five scoreless innings., 138782=Remember, CC Sabathia could prove 2013 was his down year, Hiroki Kuroda could make us forget his age and shaky end to last season and Ivan Nova could have a breakout season. Then it's just a matter of finding that reliable, extra one-two punch, 123063=Here is what the Yankees got out of their Nos. 1-4 in the 2009 regular season, after which they went on to win their 27th title:, 163781=Copyright © 2015 Bleacher Report, Inc. Turner Broadcasting System, Inc. All Rights Reserved. BleacherReport.com is part of Bleacher Report - Turner Sports Network, part of the Turner Sports and Entertainment Network. Certain photos copyright © 2015 by Getty Images. Any commercial use or distribution without the express written consent of Getty Images is strictly prohibited., 111468=Yes, he may prove to be an unhealthy bust, but if he is healthy, you can't ignore his ability and how optimistically the Yanks once invested in him. He is, after all, a former All-Star, and his only internal competition entering spring training are Phelps and Adam Warren. Many have projected that 2014 has to be Nova's year, but it could be just as important should it turn into Pineda's year too., 121787=He has a career 3.20 ERA, well above-average 8.8 strikeouts per nine (1,988 career strikeouts), solid 2.5 walks per nine and .641 win percentage, and he threw the first no-hitter in Mets history in 2012. With Minnesota, Santana was a 20-game winner in 2004 (7.5 WAR)and a 19-game winner in 2006 (7.2 WAR), and more recently he was a 16-game winner with the Mets in 2008 (4.8 WAR). , 122727=No matter which way you slice it, the Yankees primarily need to establish their fourth starter. They can survive the regular season by patching together their No. 5 role if they have to—much like they did in 2009 behind Sabathia, A.J. Burnett, Pettitte and Joba Chamberlain.  , 116860=Giving him the benefit of the doubt (or at least acknowledgement for his career-high stats), Garza finished with a 4.9 WAR, 3.32 ERA, 2.95 FIP, 8.95 strikeouts per nine and 2.86 walks per nine in 2011 with Chicago. But the following season, he only pitched 103.2 innings, his FIP ballooned to 4.17 and his WAR sunk to 1.1., 109997=The big right-handed Pineda (6'7\", 260 lbs) may ultimately represent the best internal option for a No. 4 or 5 because of his age and upside. In his only full season in the bigs in 2011, he made 28 starts and went 171 innings for Seattle. He compiled a 3.74 ERA and 3.42 FIP. He excelled at missing bats (9.11 K/9) and he had a 3.2 WAR. , 108442=The 6'2\", 200-pound righty was solid in 22 appearances in 2013, posting a 4.98 ERA, 3.81 FIP, 8.20 strikeouts per nine innings and 0.83 home runs per nine. The 27-year-old picked up a good deal of experience in middle-to-long relief in 2012 (33 appearances, 99.2 innings, 11 starts)., 118539=You also shouldn't feel safe about bringing the righty's high-80s fastball into Yankee Stadium when you consider he led the entire National League in home runs allowed (32), has a career 1.2 homer per nine and had a 2013 of 1.4 homers per nine., 113035=The Record writer Bob Klapisch recently reported that the Yankees were not interested in signing top free agents Matt Garza and Ubaldo Jiminez and would instead turn to internal options. That was prior to the recent news that Tanaka may not be wearing pinstripes in 2014, however., 117465=Save for 2011, his numbers have consistently declined since his three-year stint in the AL East (with a no-no to show for it in 2010). His Steamer Projections are 3.1 WAR, 3.73 ERA and 8.01 strikeouts per nine. The question is are the Yankees buying it, and are you buying it? Better yet, would you feel safe giving Garza a three- or four-year deal?, 137927=A foreseeable back end could have the Yankees fill the No. 4 hole with a solid, improving David Phelps and complement him with a buy-low, high-reward type such as Paul Maholm. Such a plan isn't flashy, nor is it particularly exciting; but it's also inexpensive, and it could bring tremendous upside to the Bronx in 2014., 103013=In the offseason thus far, the New York Yankees have certainly proven their intention to contend for a championship in the 2014 MLB season—at least on the offensive side of the ball. Big-money acquisitions like Brian McCann, Jacoby Ellsbury and Carlos Beltran imply a win-now mentality that strips any rebuilding talk of its validity and rationality.}",
    "textBeforeTable": "If they fill entirely from within with the two best in-house options: Finally, using Steamer Projections, let's look at a three realistic 2014 Yankees rotations related to the best options and see how they might theoretically stack up. The Blueprints: Projected Rotations   11.6 4.04 44-36 735.4 118 Total 2.8 4.32 11-6 162.1 27 Felix Doubront 1.3 4.57 8-9 171.1 29 Ryan Dempster 3.2 3.52 10-13 189.1 29 John Lackey 4.3 3.75 15-8 213.1 33 Jon Lester WAR ERA W-L IP GS Pitcher For another comparison, here is the output from the four most productive pitchers for the 2013 champion Red Sox, who also used multiple arms as the No. 5: But we can also consider that the Yankees truly need just one quality arm to contend and produce, and they can get creative for the final role as the season progresses. Once they make the postseason, moreover, nothing is more important than the first three of the rotation. We can lament not having Tanaka as one of the first three arms, and we can worry about the two gaping holes currently remaining at the back end. 14.5 4.08 55-31 788.3 130 Total 1.7 4.75 9-6 157.1 31 Joba Chamberlain 3.6 4.16 14-8 194.2 32 Andy Pettitte 3.1 4.04 13-9 207 33 A.J. Burnett 6.1 3.37",
    "textAfterTable": "If they fill one spot with a top free-agent target and the other with the best in-house option: Pitcher GS IP W-L ERA WAR CC Sabathia 30 192 12-11 3.84 3.6 Hiroki Kuroda 31 192 12-11 3.92 3.4 Ivan Nova 32 189 12-12 3.99 3.1 Ubaldo Jimenez 31 192 12-11 3.90 2.9 David Phelps 32 182 11-12 4.35 2.1 Total 156 957 59-57 4.00 15.1 If they fill with a top free agent and one of the best-fitting non-roster invitees: Pitcher GS IP W-L ERA WAR CC Sabathia 30 192 12-11 3.84 3.6 Hiroki Kuroda 31 192 12-11 3.92 3.4 Ivan Nova 32 189 12-12 3.99 3.1 Ubaldo Jimenez 31 192 12-11 3.90 2.9 Paul Maholm 17 96 6-6 4.13 1.2 Total 141 861 54-51 3.96 14.2   Final Verdict: 1 In-House and 1 Non-Roster Invitee What's the best combo without Tanaka? Phelps and Pineda Phelps and Jimenez Phelps and Maholm Jimenez and Santana",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}