{
    "relation": [
        [
            "Small bamboos",
            "Fargesia nitida 'Black Pearl' Dense foliage and purple-tinged nearly black canes. Clumping Bamboos",
            "Fargesia rufa Rose coloured sheath, slightly weeping comportment. non-spreading variety",
            "Indocalamus latifolius Broad leaves, tight bush like shape. Slightly spreading root system",
            "Pleioblastus chino Elegantissimus Small green leaves dashed with creamy white, slender and dangling. Slightly spreading root system",
            "Pleioblastus shibuyanus Tsuboii Foliage dashed with white, upright shape. Runner root system",
            "Pseudosasa japonica Tsutsumiana Green canes between swollen knots, green foliage. Runner root system",
            "Sasa kurilensis Pale green canes, broad shiny green leaves, open shape which is slightly weeping. Young edible shoots. Runner root system",
            "Sasa palmata nebulosa Green canes stained with black, very light broad green leaves. Runner root system",
            "Sasa tsuboiana Dark green smooth leaves Runner root system",
            "Sasa veitchii Slim slightly purple canes, sheath covered in dense long hairs, dark green leaves edged with creamy white in winter. Runner root system",
            "Shibatea kumasaca Slim close together canes, green foliage, dense compact shape. Runner root system"
        ],
        [
            "Height (m)",
            "2-3",
            "2-3",
            "2-4",
            "1-2,5",
            "1-2",
            "2-3,5",
            "1,5-3,5",
            "1-4",
            "1,5-2",
            "0,8-1,5",
            "1-1,5"
        ],
        [
            "Ø cane (cm)",
            "",
            "0,3-1,5",
            "1-2",
            "",
            "",
            "",
            "0,2-2,5",
            "0,4-1",
            "0,3-0,5",
            "0,4-0,8",
            "0,1-0,5"
        ],
        [
            "Hardiness (°C)",
            "-20",
            "-28",
            "-18",
            "-20",
            "-20",
            "-25",
            "-26",
            "-26",
            "-22",
            "-23",
            "-25"
        ],
        [
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            ""
        ]
    ],
    "pageTitle": "Small bamboos - from 1 to 3 meters",
    "title": "",
    "url": "http://www.planfor.co.uk/garden-plants,small-bamboos-from-1-to-3-meters.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 0,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042991076.30/warc/CC-MAIN-20150728002311-00083-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 641746839,
    "recordOffset": 641697833,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{84144=May Berry, Edible Honeysuckle}",
    "lastModified": "Tue, 04 Aug 2015 17:52:43 GMT",
    "textBeforeTable": "Other Bamboos Small bamboos Home > Plants > Small bamboos - from 1 to 3 meters Votre navigateur ne supporte pas les scripts : certaines fonctionnalités ne seront plus utilisables ! Read more reviews • Write your own review • Read this review • I received my Wollemi Pine last week from Planfor. It was delivered to the UK in super-fas... On 02/06/2015 by Redwood Read this review • Received the package today after 1 week. Hurrah. Excellent service and a very good specime...",
    "textAfterTable": "Small bamboos (from 1 to 3 meters in height) These small bamboos are perfect for borders or hedges. They allow you to make dense screens and are ideal for breaking up a small garden. When grown in tubs they provide lovely green foliage for both the inside or outside of the home. www.planfor.co.uk Top of page Pépinières PLANFOR RD 651 40090 UCHACQ - FRANCE Tel : (020).7660.0178 Fax : 0033 558 064 854 • Contact us • Legal mentions • Conditions of sale",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}