{
    "relation": [
        [
            "",
            "Date / Time",
            "5th",
            "6th",
            "12th",
            "13th",
            "19th",
            "20th",
            "21st",
            "22nd",
            "23rd",
            "24th"
        ],
        [
            "from",
            "10.40",
            "■",
            "■",
            "■",
            "■",
            "■",
            "■",
            "■",
            "■",
            "■",
            "■"
        ],
        [
            "Alresford",
            "12.15",
            "■",
            "■",
            "■",
            "■",
            "■",
            "■",
            "■",
            "■",
            "■",
            "■"
        ],
        [
            "station",
            "1.50",
            "■",
            "■",
            "■",
            "■",
            "■",
            "■",
            "■",
            "■",
            "■",
            "■"
        ],
        [
            "",
            "3.25",
            "",
            "",
            "■",
            "■",
            "■",
            "■",
            "■",
            "■",
            "■",
            "■"
        ],
        [
            "from",
            "10.00",
            "",
            "",
            "■",
            "■",
            "■",
            "■",
            "",
            "",
            "",
            "■"
        ],
        [
            "Alton",
            "11.35",
            "",
            "",
            "■",
            "■",
            "■",
            "■",
            "",
            "",
            "■",
            "■"
        ],
        [
            "station",
            "1.10",
            "",
            "",
            "■",
            "■",
            "■",
            "■",
            "",
            "",
            "■",
            "■"
        ],
        [
            "",
            "2.45",
            "",
            "",
            "■",
            "■",
            "■",
            "■",
            "",
            "",
            "■",
            "■"
        ]
    ],
    "pageTitle": "Santa Special « Mid Hants Railway Ltd 'Watercress Line'",
    "title": "",
    "url": "http://www.watercressline.co.uk/product.php/40/santa-special",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 0,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988317.67/warc/CC-MAIN-20150728002308-00280-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 817521558,
    "recordOffset": 817513356,
    "tableOrientation": "VERTICAL",
    "TableContextTimeStampAfterTable": "{7770=24th December Adult £19 Child age 1 - 16yrs £19 Baby under 1 year £11, 45407=Telephone: 01962 733810, 7514=Fares 5th, 6th, 12th, 13th, 19th, 20th, 21st, 22nd, 23rd December Adult £18 Child age 1 - 16yrs £18 Baby under 1 year £10, 8223=Wheelchair passengers can be accommodated in a special carriage departing from Alresford ONLY. Please call reservations on 01962 733810 to book tickets in this carriage., 6595=5th, 6th, 12th, 13th, 19th - 24th December 2015, 15791=You will be asked for the ages of the child(ren) in December so that we can give the correct age appropriate gift. It does not matter if this is a little inaccurate, as each child will be asked on the day by Santa and his helpers. If you feel a child over 3 years is mature for their age you may select the next age bracket. However, legal safety restrictions apply to toys for children under 3 years.}",
    "lastModified": "Fri, 31 Jul 2015 23:25:21 GMT",
    "textBeforeTable": "Departure Times:  Promotional offers and TESCO vouchers are NOT valid for Santa Specials.  Wheelchair passengers can be accommodated in a special carriage departing from Alresford ONLY. Please call reservations on 01962 733810 to book tickets in this carriage. Fares include all booking fees. This event uses electronic tickets that you print at home. If you would like printed and posted tickets in a ticket wallet please select this option when booking. All seats on the Santa Specials are numbered and allocated (like theatre tickets). 24th December Adult £19 Child age 1 - 16yrs £19 Baby under 1 year £11 Fares 5th, 6th, 12th, 13th, 19th, 20th, 21st, 22nd, 23rd December Adult £18 Child age 1 - 16yrs £18 Baby under 1 year £10 Santa Specials are advance booking only. Read the review by Lets Go With The Children No queuing to see Santa! He will visit you in your seat! Depart from Alresford on a round trip to Medstead and back... or depart from Alton on a round trip to Ropley and back See Santa on a steam train as you take a one hour round trip through the scenic Hampshire countryside. Santa visits every child at their seat with a special gift. Includes white wine and mince pie for the grown-ups and soft drinks for the children.   The perfect way to start your",
    "textAfterTable": "Booking Information We recommend that you book early as dates fill fast. When booking you will be asked for your date, departure station and time of train. Please ensure you include all members of your party as it may not be possible to add extra people at a later date. If you wish to sit with another family it will all need to be on one booking. Seats are in blocks of four around a table - if your party is larger seats will be split across the aisle so that you can all see each other. Please be aware however, in this situation, you may be sharing that table with another party. You will be asked for the ages of the child(ren) in December so that we can give the correct age appropriate gift. It does not matter if this is a little inaccurate, as each child will be asked on the day by Santa and his helpers. If you feel a child over 3 years is mature for their age you may select the next age bracket. However, legal safety restrictions apply to toys for children under 3 years. Babies under 1 year are not allocated a seat but are given a gift for 0-12 months to ensure Santa treats every child equally. As Santa visits your family as a whole it is very difficult to exclude Baby from the experience, and it can cause great upset",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}