{
    "relation": [
        [
            "Company",
            "Aviva (LSE: AV )",
            "ICAP (LSE: IAP )",
            "Resolution (LSE: RSL )",
            "RSA (LSE: RSA )",
            "Vodafone (LSE: VOD )"
        ],
        [
            "Price (pence)",
            "369",
            "309",
            "250",
            "125",
            "158"
        ],
        [
            "P/E (forecast)",
            "8.1",
            "9.2",
            "10.9",
            "10.9",
            "10.3"
        ],
        [
            "Yield (forecast, %)",
            "6.8",
            "7.2",
            "8.4",
            "7.5",
            "7.0"
        ],
        [
            "Market Cap (millions of pounds)",
            "10,800",
            "1,960",
            "3,530",
            "4,430",
            "79,160"
        ]
    ],
    "pageTitle": "How to Build a Portfolio With a 7.4% Yield (AV, IAP, RSA, RSL, VOD)",
    "title": "",
    "url": "http://www.fool.com/investing/general/2012/12/18/how-to-build-a-portfolio-with-a-74-yield.aspx",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 0,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042991076.30/warc/CC-MAIN-20150728002311-00105-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 445450207,
    "recordOffset": 445426377,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{26512=As activity in ICAP's markets has declined, so have analyst expectations on what the business could achieve. Today, the consensus opinion is that ICAP will deliver earnings per share (EPS) of 33 pence for 2012. This time last year, expectations were for 41.1 pence in earnings., 25765=Vodafone has already committed to spending 550 million pounds buying back shares between 10 December and 20 February. I had been expecting the entire buyback to push Vodafone's share price higher. After all, 1.5 billion pounds is good for almost 2% of the company at today's prices., 28522=The dividend payout at RSA has been increasing year over year since 2006., 29569=Resolution is forecast to pay 20.9 pence of dividends for 2012. At today's price, that puts the shares on an 8.4% yield. Normally, cautious investors wince when they see a yield like that. They assume that the payout is a one-off or that it cannot be sustained in the long term., 28432=Shares in RSA have risen 13.4% in the last month. This has had the effect of pushing the dividend yield lower. Current forecasts are for earnings of 11.5 pence in 2012 and a dividend of 9.34 pence. In 2013, those figures are expected to hit 13.4 pence and 9.55 pence respectively., 8886=DocumentId: 2159841, ~/Articles/ArticleHandler.aspx, 8/4/2015 2:03:49 PM, 59760=By David O’Hara | More Articles December 18, 2012 | Comments (0), 29274=This will not be the first time that Resolution has ponied up a big dividend. In fact, the payout has been increasing at the company since 2009. Analysts are forecasting that it could even rise further for 2013.}",
    "textBeforeTable": "I've trawled the market to find a collection of high-yielding shares. The drawback is that my portfolio below contains just a few shares and is heavily biased toward insurance. Don't get me wrong, I think diversification is very important. But massive gains can be made by getting just a few picks dead-right. Buffett knows this. LONDON -- Super-investor Warren Buffett once said: \"Put all your eggs in one basket and then watch that basket very carefully.\" Buffett knows the value of diversification and the benefits of concentration. | More Articles December 18, 2012 | Comments (0) By David O’Hara How to Build a Portfolio With a 7.4% Yield 0 Recs Print Email } console.log(\"Something went wrong!\"); // Do something if web service not working { function errorResponse() } }.bind(this), 2000); $(this).update('View My Articles') console.log(this); { timer = setTimeout(function()",
    "textAfterTable": "1. Resolution Resolution is the big beast of the dividend world. The 800-pound gorilla. Resolution owns Friends Life, a provider of insurance, investments, and pensions. Resolution is forecast to pay 20.9 pence of dividends for 2012. At today's price, that puts the shares on an 8.4% yield. Normally, cautious investors wince when they see a yield like that. They assume that the payout is a one-off or that it cannot be sustained in the long term. This will not be the first time that Resolution has ponied up a big dividend. In fact, the payout has been increasing at the company since 2009. Analysts are forecasting that it could even rise further for 2013. The yield is covered by earnings. That 20.9p would be paid out of 23.7 pence of expected profits per share. Markets have recently been cheered by the company's reorganisation of some of its debts. This will save Resolution money, increasing the probability that the large payout can be maintained. 2. RSA RSA is the company behind the MORE TH>N insurance brand. For a number of years now, RSA has been one of the biggest yields in the FTSE 100 (UKX). The dividend payout at RSA has been increasing year over year since 2006. Shares in RSA have risen 13.4% in the last month. This has had the effect of pushing the dividend yield lower. Current forecasts are for earnings of 11.5 pence in 2012 and a dividend of 9.34 pence. In 2013, those figures are",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}