{
    "relation": [
        [
            "Citing Patent",
            "US2964109 *",
            "US3032101 *",
            "US3075918 *",
            "US3084743 *",
            "US3120262 *",
            "US3262498 *",
            "US3269460 *",
            "US3295601 *",
            "US3360044 *",
            "US3841406 *",
            "US3995693 *",
            "US4187910 *",
            "US4299286 *",
            "US4320802 *",
            "US4529037 *",
            "US4548267 *",
            "US4589486 *",
            "US4617996 *",
            "US4635721 *",
            "US4678036 *",
            "US5019279 *",
            "US5074357 *",
            "US6880610",
            "DE1204162B *",
            "DE2335896A1 *",
            "DE2336016A1 *"
        ],
        [
            "Filing date",
            "May 1, 1958",
            "Apr 10, 1958",
            "Dec 8, 1958",
            "Sep 16, 1958",
            "Nov 13, 1962",
            "Jun 24, 1963",
            "Aug 12, 1963",
            "Mar 20, 1964",
            "Mar 5, 1964",
            "May 17, 1972",
            "Jan 20, 1976",
            "Apr 4, 1978",
            "May 21, 1980",
            "Feb 11, 1980",
            "Apr 16, 1984",
            "Nov 29, 1983",
            "May 1, 1984",
            "Apr 22, 1985",
            "Oct 21, 1985",
            "Feb 22, 1985",
            "Dec 21, 1989",
            "Dec 27, 1989",
            "Jan 7, 2003",
            "Dec 5, 1961",
            "Jul 14, 1973",
            "Jul 14, 1973"
        ],
        [
            "Publication date",
            "Dec 13, 1960",
            "May 1, 1962",
            "Jan 29, 1963",
            "Apr 9, 1963",
            "Feb 4, 1964",
            "Jul 26, 1966",
            "Aug 30, 1966",
            "Jan 3, 1967",
            "Dec 26, 1967",
            "Oct 15, 1974",
            "Dec 7, 1976",
            "Feb 12, 1980",
            "Nov 10, 1981",
            "Mar 23, 1982",
            "Jul 16, 1985",
            "Oct 22, 1985",
            "May 20, 1986",
            "Oct 21, 1986",
            "Jan 13, 1987",
            "Jul 7, 1987",
            "May 28, 1991",
            "Dec 24, 1991",
            "Apr 19, 2005",
            "Nov 4, 1965",
            "Feb 7, 1974",
            "Feb 14, 1974"
        ],
        [
            "Applicant",
            "Oil Recovery Corp",
            "Pure Oil Co",
            "Pure Oil Co",
            "Jersey Prod Res Co",
            "Pan American Petroleum Corp",
            "Mobil Oil Corp",
            "Sun Oil Co",
            "Phillips Petroleum Co",
            "Deutsche Erdoel Ag",
            "Texaco Inc",
            "Phillips Petroleum Company",
            "Phillips Petroleum Company",
            "Texaco Inc.",
            "Garbo Paul W",
            "Amoco Corporation",
            "Standard Oil Company",
            "Texaco Inc.",
            "Mobil Oil Corporation",
            "Amoco Corporation",
            "Mobil Oil Corporation",
            "Marathon Oil Company",
            "Marathon Oil Company",
            "Harold D. Bush",
            "Deutsche Erdoel Ag",
            "Texaco Development Corp",
            "Texaco Development Corp"
        ],
        [
            "Title",
            "Method of eliminating water resistant coating from bore of injection wells",
            "Improved waterflooding process",
            "Secondary recovery of petroleum",
            "Secondary recovery of petroleum",
            "Waterflood method",
            "Secondary recovery of oil from a subterranean formation",
            "Secondary recovery of petroleum",
            "Transition zone formation in oil production",
            "Process and apparatus for the recovery of liquid bitumen from underground deposits",
            "Single well oil recovery method using carbon dioxide",
            "Reservoir treatment by injecting mixture of CO2 and hydrocarbon gas",
            "CO2 removal from hydrocarbon gas in water bearing underground reservoir",
            "Enhanced oil recovery employing blend of carbon dioxide, inert gas _and intermediate hydrocarbons",
            "Use of land-fill gas to stimulate crude oil production and to recover methane-rich gas",
            "Method of forming carbon dioxide mixtures miscible with formation crude oils",
            "Method of displacing fluids within a gas-condensate reservoir",
            "Carbon dioxide flooding with a premixed transition zone of carbon dioxide and crude oil components",
            "Immiscible oil recovery process",
            "Method of displacing fluids within a gas-condensate reservoir",
            "Miscible oil recovery process",
            "Process for enriching a gas",
            "Process for in-situ enrichment of gas used in miscible flooding",
            "Drive for multiple suspended doors",
            "Verfahren zur Sekundaergewinnung von bituminoesen Stoffen aus untertaegigen Lagerstaetten",
            "Verfahren zur oelgewinnung aus einer mit mindestens einer injektionsbohrung und einer foerderbohrung durchteuften lagerstaette",
            "Verfahren zur oelgewinnung aus einer mit mindestens einer injektionsbohrung und einer foerderbohrung durchteuften lagerstaette"
        ]
    ],
    "pageTitle": "Patent US2875832 - Gaseous hydrocarbon and carbon dioxide solutions in hydrocarbons - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US2875832?dq=5,371,548",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 6,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042982745.46/warc/CC-MAIN-20150728002302-00030-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 473775067,
    "recordOffset": 473753481,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{22685=With ethane, pressures may be from about to 500- p. s. i. partial pressure of ethane and ratios of partial pressures of carbon dioxide to ethane of from about 1.5:1 to 0.l:1; preferred pressures being from about 150 to 400 p. s. i. and partial pressure ratios of from about 1.5:! to 1:1. For mixtures of the gaseous hydrocarbons, the pressure values will usually lie between those for the individual gases and depend on the predominant component; but here again there are critical values where the relation departs materially from a straight line function. r, 10632=March 3, 1959 Filed Oct. 23, 1952 FIG. 2, 37953=2. In a method of recovering liquid hydrocarbons from a subterranean oil formation, the steps oi injecting into such formation carbon dioxide at a total pressure of at least about 300 p. s. i. to form an efiuent containing carbon dioxide and hydrocarbons which are gases and liquids at standard conditions of temperature and pressure, condensing liquid hydrocarbons from said etiluent, recycling the residual efiluent including carbon dioxide and hydrocarbons containing predominantly 2 to 4 carbon atom hydrocarbons in substantial amount into an oil formation, contacting liquid hydrocarbons therein at a temperature of the order of 27 degrees C. with said recycled residual ethuent, the partial pressure of the 2 to 4 carbon atom hydrocarbons in the recycled gas being within the range from about 300 to 500 p. s. i. and the ratio of partial pressure of carbon dioxide to 2 to 4 carbon atom hydrocarbons being from 2:1 to 0.1:1, and withdrawing from this formatron an efiiuent, comprising liquid hydrocarbons and said gases., 39001=nsrciaanmsuetua msz UNITED STATES PATENTS 1,249,232 Squires Dec. 4, 1917 -1,826,371 Spindler Oct. 6, 1931 2,166,160 King July 18, 1939 2,188,013 Pilat et al. Jan. 23, 1940 2,623,596 Whorton et a1. Dec. 30, 1952 GI'HER REFERENCES I Petroleum Development 8: Technology in 1925, P:- troleum Diva, A. I. M. E. pp. 51-63., 11801=SEPARATOR INVENTO'RS JAMES W. MART 1N w'uQa ATTORNEY FREDERICK A.HESSELL IRVlNG P. HAMMER JGHN B. RUST PUMP March 3, 1959 Filed Oct. 23. 1952 WATER,ETC., 28487=it was noted that solubility of methane in crude oil in the presence of carbon dioxide is related to the equiratio of the partial pressures of the two gases. in general, the greater the CO :Cl-L partial pressure ratio, the greater the increase in the methane solubility at a given pressure. Thus, in the data given in Table II the CO=:CH partial pressure ratios at the equilibrium final pressure was maintained between the limits of l.54:0.08.- However, for comparison purposes there is also included in Figure 2 the curve obtained when the CO :CH partial pressure ratios were kept within the limits of 1.30:0.08. It can be seen'that the presence oi larger amounts of CO in the equilibrium gas mixture consistently increases the solubility of the methane at a given pressure. It is to be noted that at the Cfl zCl-L ratios of either 1.54 or 1.30 the methane solubility curve shown a pronounced change of slope at a partial pressure of about 400 p. s. i. and 450 p. s. i. respectively in contrast to the solubility curve for methane along which no distinct increase in slope Occurs over the pressure range studied. This change of slope is V robably related to the fact that at 400 p, s. i. CH, 39339=increasing the Recovery of Petroleum, Osgood, vol. 1, (c) 1936, page 113., 30716=These data are particularly interesting in that not only does the presence of carbon dioxide increase the solubility of ethane in oil at a given pressure but, at the same time, the presence of ethane increases the solubility of the carbon dioxide. These examples were carried out at a C0,:QH, partial pressure ratio of 1.50:0.04. At this ratio, an examination of Figures 3 and 4 shows that a very rapid increase in solubility occurs in both the carbon dioxide and ethane curves at partial pressures of: about 450 and 325 p. s. i. respectively., 37280=1. In a method of recovering liquid hydrocarbons from a subterranean oil formation, the steps of injecting into such formation carbon dioxide and a gas, predominantly hydrocarbon of from 2 to 4 carbon atoms, the partial pressure of the gas, predominantly hydrocarbon, being within the range from about to about 500 p. s. i., the ratio or partial pressure of carbon dioxide to gas, predominantly hydrocarbon, being in the range. from about 2:1 to about 1:1, contacting said liquid hydrocarbons with said gases at a temperature of the order of 27 degrees C., and withdrawing from said formation an eifiuent comprising liquid hydrocarbons and said gases., 10927=March 3, 1959 Filed Oct. 25, 1952 SOLUBILITY OF ETHANE IN PRESENCE 0F C J W. MARTIN ETAL GASEOUS HYbRocARBoN AND CARBON DIOXIDE SOLUTIONS IN HYDROGARBONS OIL I CO ETHANE MIXTURE LSOppRATlO II ETHANE PRESSURE P S! FIG.3, 11166=s00 JAMES W. MARHN FREDERICK A.HESSEL lRVING 9. HAMMER JOHN P. RUST SJW' ATTORNEY 6 Sheets-Sheet 3 INVENTORS PERCENTAGE INCREASE RN SOLUBLITY March 3, 1959 J. w. MARTIN A!- GASEOUS HYDROCARBON AND CARBON DIOXIDE SOLUTIONS IN hYDROCARBONS Filed Oct. 23, 1952 6 Sheets-Sheet 5 RCENTAGE INCREASE IN METHANE AND ETHANE OLUBILI'HES \\N PRESENCE OF CO2 I co ETHANE MIXTURE 1.50 \"RATIO :1 co -mammz wx'ruRE |.s4,,.RAT|o COZ-METHANE mxTuRs I.30\".RATIO O0 'NVENTORS JAMES w. MARTIN FREDERlCK A.HESSEL mvmc P. HAMMER JOHN P. RUST ATTORNEY PRESSURE PSI FIG. 5, 17795=A particularly valuable gas for use in the present invention is the gas obtained in treating subterranean hydrocarbon bearing formations with carbon dioxide under pressure of at least about 300 p. s. i. with more desirably of from about 600 p. s. i. up to 1400 p. s. i. and higher, there being no upper limit on the stated pressure other than convenience or economy. It has been found that the efiluent from such processes contains carbon dioxide and hydrocarbons which are both gaseous and liquid under standard conditions of temperature (0 C.) and pressure (760 mm.) and after liquids are condensed from such et'lluent the residuum may desirably be recycled to be used as the gaseous medium for contacting hydrocarbon oils in situ in the earth or otherwise. Such gas residuum contains substantial amounts of normally gaseous hydrocarbons and some higher hydrocarbons also. Its character may depend on the conditions under which, and the locality where, it is produced. The quantity of methane in the gases may be greatly reduced from normal for such locality, and ethylene and propylene may be substantially absent. But substantial quantities of higher unsaturates (materials soluble in sulfuric acid) may be present which may run from 1 to 20% by weight, for example up to 7.5% of hydrocarbons in the range from butyleno to pcntylene. Under other conditions, substantial amounts of methane may be present., 10412=90o PRESSURE PSI 1200 I500 woo INVENTORS JAMES W. MARTIN FREDERICK A. HESSEL IRVING P. HAMMER JOHN a; RUST ATTORNEY FIG. 1, 11974=- 2,575,832 GASEQUS HYDRGCARBON AND CARBON DIOX- HDE SSLUTIONS 1N HYDRGCARBONS Blames W. Martin, Tucltahoe, N. Y., and Frederick A. Hessel, Upper Montclair, lrving 2. Hammer, Nutley, and John B. Rust, Verona, N. 3., assignors to Oil Recover-y Corporation, New York, N. Y., a corporation of New York Application October 23, 1952, Serial No. 316,492 2 Claims. (Cl. 166-9) This invention relates to the recovery of oil or other hydrocarbon materials from subterranean hydrocarbon formations, to methods of effecting such recoveries, to materials and compositions useful in such methods, and to products recovered., 10216=S'OLUBILITYY (v'0 L..oAs/vo| OIL) March 3, 1959 J w. MARTIN ETAL Filed Oct. .25, 1952 GASEOUS HYROCARBON AND CARBON DIOXIDE SOLUTIONS IN HYDROCARBONS 6 Sheets-Sheet 1 L50; RAT, 25571=As a general rule, the carbon dioxide will he at least 50% by volume of the total gas in contact with the liquid hydrocarbons, so that the ratios of partial pressure of carbon dioxide to hydrocarbon gas will be at least 1:1. it may be as low as 0.1:1 but in such cases, the partial pressure of the hydrocarbon gas present will have to be very much greater as for example with methane or the order of 1400 to 16% p. s. i. in order to get substantial increase in solubility over that obtained in the abs-once of carbon dioxide. The prwnrc ratio will generally not emed about 2:1 and usually not above 15:1. -'lhus methane, the pressure may generally be a partial pressure of methane of horn about 50 to the p. s. i. and a ratio of partial prmsurce of 35303 i- 15 of crude oil was contacted intimately with the gas or gases for the desired determination, until saturation wasrcached, which usually required several hours. When the a pressure remained constant, this was taken as indicating that maximum solubility of the gas in the oil had been reached. The gas dissolved in the oil was determined., 22445=criiicai points or areas are evidenced in which the increase in solubility is very substantially evidenced as will appear from data given below. Here again methane decameos oxide to methane of from about 2:1 or tolllzl.}",
    "textBeforeTable": "Patent Citations increasing the Recovery of Petroleum, Osgood, vol. 1, (c) 1936, page 113. nsrciaanmsuetua msz UNITED STATES PATENTS 1,249,232 Squires Dec. 4, 1917 -1,826,371 Spindler Oct. 6, 1931 2,166,160 King July 18, 1939 2,188,013 Pilat et al. Jan. 23, 1940 2,623,596 Whorton et a1. Dec. 30, 1952 GI'HER REFERENCES I Petroleum Development 8: Technology in 1925, P:- troleum Diva, A. I. M. E. pp. 51-63. 2. In a method of recovering liquid hydrocarbons from a subterranean oil formation, the steps oi injecting into such formation carbon dioxide at a total pressure of at least about 300 p. s. i. to form an efiuent containing carbon dioxide and hydrocarbons which are gases and liquids at standard conditions of temperature and pressure, condensing liquid hydrocarbons from said etiluent, recycling the residual efiluent including carbon dioxide and hydrocarbons containing predominantly 2 to 4 carbon atom hydrocarbons in substantial amount into an oil formation, contacting liquid hydrocarbons therein at a temperature of the order of 27 degrees C. with said recycled residual ethuent, the partial pressure of the 2 to 4 carbon atom hydrocarbons in the recycled gas being within the range from about 300 to 500 p. s. i. and the ratio of partial pressure of carbon dioxide to 2 to 4 carbon atom hydrocarbons being from 2:1 to 0.1:1, and withdrawing from this formatron an efiiuent, comprising liquid hydrocarbons and said gases.",
    "textAfterTable": "US4635721 * Oct 21, 1985 Jan 13, 1987 Amoco Corporation Method of displacing fluids within a gas-condensate reservoir US4678036 * Feb 22, 1985 Jul 7, 1987 Mobil Oil Corporation Miscible oil recovery process US5019279 * Dec 21, 1989 May 28, 1991 Marathon Oil Company Process for enriching a gas US5074357 * Dec 27, 1989 Dec 24, 1991 Marathon Oil Company Process for in-situ enrichment of gas used in miscible flooding US6880610 Jan 7, 2003 Apr 19, 2005 Harold D. Bush Drive for multiple suspended doors DE1204162B * Dec 5, 1961 Nov 4, 1965 Deutsche Erdoel Ag Verfahren zur Sekundaergewinnung von bituminoesen Stoffen aus untertaegigen Lagerstaetten DE2335896A1 * Jul 14, 1973 Feb 7, 1974 Texaco Development Corp Verfahren zur oelgewinnung aus einer mit mindestens einer injektionsbohrung und einer foerderbohrung durchteuften lagerstaette DE2336016A1",
    "hasKeyColumn": true,
    "keyColumnIndex": 3,
    "headerRowIndex": 0
}