{
    "relation": [
        [
            "Citing Patent",
            "US7280269 *",
            "US7280271 *",
            "US7606273",
            "US20130265634 *",
            "EP1971004A2 *"
        ],
        [
            "Filing date",
            "Jun 15, 2006",
            "Jun 15, 2006",
            "Oct 15, 2007",
            "Dec 20, 2011",
            "Mar 14, 2008"
        ],
        [
            "Publication date",
            "Oct 9, 2007",
            "Oct 9, 2007",
            "Oct 20, 2009",
            "Oct 10, 2013",
            "Sep 17, 2008"
        ],
        [
            "Applicant",
            "At&T Corporation",
            "At&T Corp.",
            "Pavilion Integration Corporation",
            "Oclaro Technology Limited",
            "Avanex Corporation"
        ],
        [
            "Title",
            "Fast dynamic gain control in cascaded Raman fiber amplifiers",
            "Fast dynamic gain control in cascaded Raman fiber amplifiers",
            "Wavelength and intensity stabilized laser diode and application of same to pumping solid-state lasers",
            "Raman Amplifiers",
            "System and method for dynamic range extension of optical amplifiers"
        ]
    ],
    "pageTitle": "Patent US7016104 - Wider dynamic range to a FBG stabilized pump - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US7016104?ie=ISO-8859-1&dq=6188988",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 7,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042981856.5/warc/CC-MAIN-20150728002301-00321-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 463179959,
    "recordOffset": 463157011,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{35010=In U.S. patent application Ser. No. 10/269,925 filed Oct. 11, 2002, hereby incorporated by reference, Ratoff et al. disclose a method of increasing the dynamic range of pump sources used in rare-earth doped amplifiers, such as erbium doped fiber amplifiers (EDFAs). In particular, Ratoff et al. teach a method of modulating an EDFA pump source via pulse width modulation. The purpose of this modulation is to extend the dynamic range of the EDFA pump source such that channel dropping/adding does not significantly affect the EDFA's power output for each channel. Notably, this problem is more significant for EDFAs than for ROAs because EDFAs are more easily saturated., 36773=Modulated pumps, however, have been used in Raman amplifiers to reduce pump interactions in the fiber arising from the use of two different pumps (see U.S. Pat. No. 6,456,426 hereby incorporated by reference), to provide a closed loop control by providing a small amount of low frequency modulation to the pump (see U.S. Pat. Nos. 6,373,621 and 6,452,716 hereby both incorporated by reference), and to provide a degree of randomness to the pump signal to minimize cross talk between signals and improve the transfer of power from the pump to the signal (see U.S. patent application Ser. No. 09/990,206 filed Nov. 21, 2001)., 28157=This application claims priority from U.S. provisional application Ser. No. 60/392,298 filed Jul. 1, 2002.}",
    "textBeforeTable": "Patent Citations The embodiment(s) of the invention described above is (are) intended to be exemplary only. The scope of the invention is therefore intended to be limited solely by the scope of the appended claims. The instant invention is particularly suited to low power applications of grating stabilized lasers. The invention is not, however, limited to WDM systems, but also extends to low power specifications for single wavelength amplifiers that are frequently are more demanding. As discussed above, Raman amplifiers are frequently pumped with more than one laser pump to tailor the gain spectrum. For example, in one embodiment a ROA includes three or more pumps, each operating at a different wavelength and in a counter-propagating configuration. In accordance with the instant invention one or more of these laser pumps is optionally operated at power levels below that achievable with CW operation. Advantageously, these low pump power levels are achieved using standard components, thus eliminating the need to create an additional and/or expensive custom pump. When operating two or more laser pumps, the ROA is optionally operated with the modulation of each pump laser phase offset to the other(s). Advantageously, the modulation in accordance with the instant invention allows the pump laser to be driven at levels that provide stable coherence collapse, yet also provide less pump power than that achieved with CW operation. In particular, when the modulated pump is driven at levels",
    "textAfterTable": "US6331908 Nov 22, 1999 Dec 18, 2001 Lucent Technologies Inc. Optical system for reduced SBS US6373621 Jan 18, 2001 Apr 16, 2002 Nortel Networks Limited Method and apparatus for safer operation of raman amplifiers US6452716 Oct 5, 2000 Sep 17, 2002 Nortel Networks Limited Amplitude modulation of a pump laser signal in a distributed raman amplifier US6456408 Mar 22, 1999 Sep 24, 2002 Lucent Technologies Inc. Method and apparatus for controlling the optical power of a optical transmission signal US6456426 Aug 7, 2001 Sep 24, 2002 Onetta, Inc. Raman amplifiers with modulated pumps US6516113 Oct 13, 2000 Feb 4, 2003 Siemens Aktiengesellschaft Method for reducing stimulated brillouin backscatter US6611368 * Apr 20, 2000 Aug 26, 2003 Lucent Technologies Inc. Time-division multiplexed pump wavelengths resulting in ultra broad band, flat, backward pumped Raman gain US6748136 * Mar 15, 2002 Jun 8, 2004 Fitel",
    "hasKeyColumn": true,
    "keyColumnIndex": 3,
    "headerRowIndex": 0
}