{
    "relation": [
        [
            "YEAR",
            "2005-2006",
            "2006-2007",
            "2007-2008",
            "2008-2009",
            "2009-2010",
            "2009-2010",
            "2010-2011",
            "2010-2011",
            "2011-2012",
            "2011-2012",
            "2012-2013",
            "2012-2013",
            "2012-2013",
            "2013-2014",
            "2013-2014",
            "2013-2014"
        ],
        [
            "NAME OF COMPETITION",
            "Surana & Surana National Trial Advocacy Moot Court Competition",
            "Surana & Surana National Trial Advocacy Moot Court Competition",
            "Surana & Surana National Trial Advocacy Moot Court Competition",
            "Surana & Surana National Trial Advocacy Moot Court Competition",
            "Surana & Surana National Trial Advocacy Moot Court Competition North Rounds",
            "Surana & Surana National Trial Advocacy Moot Court Competition South Rounds",
            "Surana & Surana National Trial Advocacy Moot Court Competition North Rounds",
            "Surana & Surana National Trial Advocacy Moot Court Competition South Rounds",
            "Surana & Surana National Trial Advocacy Moot Court Competition North Rounds",
            "Surana & Surana National Trial Advocacy Moot Court Competition South Rounds",
            "Surana & Surana National Trial Advocacy Moot Court Competition North Rounds",
            "Surana & Surana National Trial Advocacy Moot Court Competition South Rounds",
            "Surana & Surana National Trial Advocacy Moot Court Competition North East Rounds",
            "Surana & Surana National Trial Advocacy Moot Court Competition North Rounds",
            "Surana & Surana National Trial Advocacy Moot Court Competition South Rounds",
            "Surana & Surana National Trial Advocacy Moot Court Competition North East Rounds"
        ],
        [
            "WINNER",
            "NUALS, Cochin",
            "NUALS, Kochi",
            "NLSIU, Bangalore",
            "Army Institute Of Law, Mohali",
            "UILS, PURC, Ludhiana",
            "NALSAR, Hyderabad",
            "NLIU, Bhopal",
            "ILS Law College, Pune",
            "GNLU, Gandhinagar",
            "G L C, Mumbai",
            "Jindal Global Law School, Sonipat",
            "NLSIU, Bangalore",
            "H N L U, Raipur",
            "Dr. RMLNLU, Lucknow",
            "Symbiosis Law School, Pune",
            "H N L U, Raipur"
        ],
        [
            "RUNNER",
            "Symbiosis Law College, Pune",
            "NLU, Jodhpur",
            "DES Law College, Pune",
            "NALSAR, Hyderabad",
            "NUALS, Kochi",
            "UILS,Panjab University Chandigarh",
            "RGNUL-Punjab, Patiala",
            "School Of Excellence In Law, Chennai",
            "NLU, Jodhpur",
            "NLSIU, Bangalore",
            "Jamia Milia Islamia, Delhi",
            "G L C, Mumbai",
            "WB NUJS, Kolkata",
            "Gujarat National Law University, Gandhinagar.",
            "ILS Law College, Pune",
            "Pravin Gandhi College Of Law, Mumbai"
        ],
        [
            "BEST INDIVIDUAL / STUDENT",
            "Nimrat Gill, ILS Law College, Pune",
            "Mayur Khandeparkar, G L C, Mumbai",
            "Ranbir L Chhabda, ILS Law College, Pune",
            "Vaibhav Sharma, Army Institute Of Law, Mohali",
            "Silky Avasthy, UILS, PURC, Ludhiana",
            "Pranshu Chaturvedi, UILS,Panjab University, Chandigarh",
            "Deeksha Manchanda, NLIU, Bhopal",
            "R.S. Diwaagar, School Of Excellence In Law, Chennai",
            "Satyam Thareja, NLU, Jodhpur",
            "Yuvraj Choksey, G L C, Mumbai",
            "Sanjay Vasshishtha, Jamia Milia Islamia, Delhi",
            "Tuhina Pandey, New Law College, BVP University, Pune",
            "Subhro Sengupta, H N L U, Raipur",
            "Divya Swamy, Dr. RMLNLU, Lucknow",
            "Nrapen Shanker Acharya, V M Salgaocar College Of Law, Panjim, Goa",
            "Devanshu Gantra, Pravin Gandhi College Of Law, Mumbai"
        ]
    ],
    "pageTitle": "Mock trial - Wikipedia, the free encyclopedia",
    "title": "",
    "url": "https://en.wikipedia.org/wiki/Mock_trial",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 0,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438043060830.93/warc/CC-MAIN-20150728002420-00260-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 868814459,
    "recordOffset": 868773851,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{10593=Guam has been hosting the Asia-Pacific Invitational Mock Trial Competition annually. In 2011 and 2012, there were 14 teams from Guam, South Korea, and Saipan in its 4th annual competition. The competition was held at the Superior Court of Guam. The teams made up of mostly junior and senior students from high schools. The Champion for 4th Annual Asia-Pacific Invitational Mock Trial Competition was Marianas Baptist Academy of Saipan.[2], 9767=Established in 2005, the Surana & Surana National Trial Advocacy Moot was conceived as a one of its kind with the aim of promoting skills of trial advocacy. In its 10th successful year (2014), this national trial moot is one of the most appreciated for its innovation and structure. Popular demand led to the creation of three more editions of this unique trial competition [India North, India South, India North East & India West (from 2014–15) rounds.] This competition has the distinction of being the first ever to be held in the North Eastern region of India in 2012. The structure is such that maximum law students from the host institution) participate by enacting the role of witnesses for the oral rounds. The students and faculty welcome this, as it provides a unique opportunity to learn practical aspects of a trial, first hand., 897=The Bar National Mock Trial Competition involves students to take on the roles of barristers and witnesses and present their case against teams from other schools. It has been running annually since 1991 with regional tournaments and the national final. There are 2,000 students in years 10 to 13, 300 barristers and advocates, and 90 judges involved in this competition.[7]}",
    "TableContextTimeStampAfterTable": "{27456=Inter-collegiate mock trial is governed by the American Mock Trial Association or AMTA.[36] This organization was founded in 1985 by Dean Richard Calkins of Drake Law School and serves as a regulator of mock trial competition at the collegiate level. AMTA sponsors regional and national-level competitions, writes and distributes case packets and rules, and keeps a registry of mock trial competitors and alumni.[37] The case packet is generally written and distributed prior to the scholastic year in August, and case changes are made throughout the season, usually in September, December, and finally in February after Regional competitions and prior to the Opening Round of Championships. Approximately 600 teams from over 350 universities and colleges will compete in AMTA tournaments. In total, AMTA provides a forum for over 5,300 undergraduate students each academic year to engage in intercollegiate mock trial competitions across the country.[38], 23939=The National High School Mock Trial Championship started in 1984.[10] This first competition consisted of teams from Illinois, Iowa, Minnesota, Nebraska, and Wisconsin.[10] The competition since has grown and now is considered to be an All-State tournament. Each year, various participating states around the country take turns hosting the tournament. The 2011 Championship was held in Phoenix, Arizona. Albuquerque, New Mexico hosted in 2012, Indianapolis, Indiana hosted in 2013, Madison, Wisconsin hosted in 2014, and Raleigh, North Carolina is hosting in 2015. New York State does not participate in the national competition; rather, it has its own intrastate competition consisting of over 350 teams throughout the state. It follows similar rules to that of the national competition. New York has three levels of play, county competition, regional competition, and the finals, which is held in Albany, New York in May. The state of Maryland also does not compete in the National High School tournament, and thus has their own statewide mock trial competition similar to that of New York. New Jersey and North Carolina both pulled out of the NHSMTC competition following the 2005 season due to a refusal by the organization to accommodate an Orthodox Jewish team, Torah Academy of Bergen County, that had won New Jersey's state championship.[32] Both states rejoined in 2010 after their concerns regarding accommodation had been addressed. [33], 36270=In 2013, Florida State University defeated Rhodes College in FSU's first championship round appearance by a 4-1 ballot decision. This was Rhodes' eighth championship round appearance to date., 34740=In 2007, the University of Virginia again defeated Harvard University. This marked the first ever re-match of a previous year's final round. Virginia again won via a split decision, winning two of the three ballots in the final round. Virginia also became the 4th school to repeat as champions, joining UCLA, the University of Iowa, and Rhodes College, which accomplished the feat twice. Harvard University became the second program to finish as runner up in consecutive years, joining the University of Maryland, College Park. Maryland, however, had the distinction of losing to themselves in one of those two defeats., 36772=In 2015, Harvard defeated Yale in a 4-0-1 ballot decision. This marked Harvard's first championship win, despite having been the runner-up 3 times previously (in 2006, 2007, and 2010). This also marked Yale's first championship round appearance. Finally, this marked the first year that the case problem for the National Championship Tournament was different from the case schools had been using in competition for the earlier elimination rounds. (I.e. In the past colleges had argued the same case all year long, but starting in 2015 any team that qualified for the championship tournament was given a brand new case to learn and argue in the span of just a few weeks.), 36474=In 2014, UCLA defeated Princeton University in a 3-2 ballot decision. With this victory, UCLA tied Rhodes for the second-highest record of championships (4 wins), behind University of Maryland, College Park (5 wins). This round was also Princeton's first championship round appearance., 31444=For 22 years, the National Championship Tournament was held in Des Moines, Iowa, the city in which collegiate mock trial began. The tournament left Iowa for the first time in 2007 when Stetson University in St. Petersburg, Florida hosted the Championship. The 2008 National Championship Tournament was held in Minneapolis, Minnesota. Between 2009-2011, the Championship returned to Des Moines in odd-numbered years, while even-numbered years featured a different venue. The 2010 Championship was hosted by Rhodes College at courthouses in downtown Memphis, Tennessee, while the 2012 Championship was held in Minneapolis. Beginning in 2013, future Championships will be awarded solely on a competitive bidding process, although Des Moines, if it bids, will be given preference during \"landmark\" years, such as anniversaries of AMTA's founding in 1985. The 2013 Championship was held in Washington, D.C. with the University of Virginia handling hosting duties. The 2014 Championship was held in Orlando, Florida at the Orange County Courthouse, with the University of Central Florida serving as the host institution. The 2015 Championship was hosted by the University of Cincinnati, with trials held at the Hamilton County Courthouse in Cincinnati., 30778=The regular season begins in late January, starting with regional tournaments. There are typically more than 600 teams spread across 24 regional tournaments. Each school is limited to two post-regional bids to the \"Opening Round Championship Series.\" Though there were once direct bids from Regionals to the National Championship Tournament, these bids no longer exist. 192 teams advance to the Opening Round Championship, which is held at eight different tournament sites. The top teams at each Opening Round Championship Tournament qualify for a berth in the National Championship Tournament. There are 48 total bids to the final tournament., 34118=In 2006, the University of Virginia beat Harvard University to win the National Championship.[39] In what was the closest final round in AMTA history, the University of Virginia won the championship by a single point using a tiebreaker, after a three judge panel split with one judge choosing Virginia as the winner, one choosing Harvard, and one calling the round a draw. The University of Virginia's victory ended the then-recent run by UCLA, which had won the two previous national championships., 35372=In 2008, the University of Maryland prevailed over the George Washington University in a split-ballot decision (2-1). This was Maryland's fifth title, giving them more total wins than any other university in AMTA history., 35732=In 2010, New York University defeated Harvard University 3-1-1 to win its first National Championship. This was Harvard's third championship round appearance in the last five years following its consecutive losses to Virginia., 36153=In 2012, Duke defeated Rutgers 2-1, in what was the first championship round appearance for both squads., 26573=Each state has its own case every year that is different from the national case. This means that the winners of the state competitions, who move on to nationals, must study and prepare a completely different case in time for the National High School Mock Trial Competition in May.[34] The national competition is governed by National Mock Trial Championship, Inc.[35], 35606=In 2009, Northwood University defeated George Washington University 5-0 to claim its first National Championship., 35971=In 2011, UCLA defeated defending champion New York University 4-1 to claim the Bruins' third title, the third-most in the history of the American Mock Trial Association.}",
    "lastModified": "Mon, 27 Jul 2015 14:42:37 GMT",
    "textBeforeTable": "Established in 2005, the Surana & Surana National Trial Advocacy Moot was conceived as a one of its kind with the aim of promoting skills of trial advocacy. In its 10th successful year (2014), this national trial moot is one of the most appreciated for its innovation and structure. Popular demand led to the creation of three more editions of this unique trial competition [India North, India South, India North East & India West (from 2014–15) rounds.] This competition has the distinction of being the first ever to be held in the North Eastern region of India in 2012. The structure is such that maximum law students from the host institution) participate by enacting the role of witnesses for the oral rounds. The students and faculty welcome this, as it provides a unique opportunity to learn practical aspects of a trial, first hand. Guam has been hosting the Asia-Pacific Invitational Mock Trial Competition annually. In 2011 and 2012, there were 14 teams from Guam, South Korea, and Saipan in its 4th annual competition. The competition was held at the Superior Court of Guam. The teams made up of mostly junior and senior students from high schools. The Champion for 4th Annual Asia-Pacific Invitational Mock Trial Competition was Marianas Baptist Academy of Saipan.[2] Asia Pacific[edit] Competitive school-related",
    "textAfterTable": "Australia[edit] Mock trial competitions in Australia are held regionally. These include: The Law Society of South Australia Mock Trial Competition comprises a series of simulated court cases by students years 10, 11 and 12 from 32 schools in South Australia.[3] The Law Society of Western Australia Interschool Mock Trial Competition is held each year for students enrolled in years 10, 11 and 12 in Western Australia. There were 773 students representing 68 teams from 38 schools participated in 2011.[4] The Capital Region Mock Trial Competition is organized by University of Canberra. There were teams of schools in Australian Capital Territory region with year 10, 11 and 12 students. The New South Wales Mock Trial Competition has been running since 1981 for students years 10 and 11 in New South Wales initially with 28 schools. There have also been international events with mock trial competitions between Australia and the United Kingdom. In 2008, schools from this region also traveled to New York City to compete in the Empire Mock Trial Competition. The first Asia-Australia mock trial competition via video conference between Australian teams and a Korean team was held in 2009.[5][6] United Kingdom[",
    "hasKeyColumn": true,
    "keyColumnIndex": 4,
    "headerRowIndex": 0
}