{
    "relation": [
        [
            "",
            "1",
            "2",
            "3",
            "4",
            "5",
            "6",
            "7",
            "8",
            "9",
            "10",
            "11"
        ],
        [
            "Nome",
            "Movin' On Up",
            "Slip Inside This House",
            "Don't Fight It, Feel It (feat. Denise Johnson)",
            "Higher Than the Sun (Higher Than The Orb Mix)",
            "Inner Flight",
            "Come Together",
            "Loaded",
            "Damaged",
            "I'm Comin' Down",
            "CleanHigher Than the Sun (feat. Jah Wobble's Invaders of the Heart) [A Dub Symphony In Two Parts (featuring Jah Wobble)]",
            "Shine Like Stars"
        ],
        [
            "Artista",
            "Primal Scream",
            "Primal Scream",
            "Primal Scream",
            "Primal Scream",
            "Primal Scream",
            "Primal Scream",
            "Primal Scream",
            "Primal Scream",
            "Primal Scream",
            "Primal Scream",
            "Primal Scream"
        ],
        [
            "Durata",
            "3:48",
            "5:14",
            "6:51",
            "3:36",
            "5:00",
            "10:19",
            "7:01",
            "5:37",
            "5:59",
            "7:37",
            "3:45"
        ],
        [
            "Prezzo",
            "0,99 €",
            "0,99 €",
            "0,99 €",
            "0,99 €",
            "0,99 €",
            "Solo con l'album",
            "0,99 €",
            "0,99 €",
            "0,99 €",
            "0,99 €",
            "0,99 €"
        ],
        [
            "",
            "Vedi in iTunes",
            "Vedi in iTunes",
            "Vedi in iTunes",
            "Vedi in iTunes",
            "Vedi in iTunes",
            "Vedi in iTunes",
            "Vedi in iTunes",
            "Vedi in iTunes",
            "Vedi in iTunes",
            "Vedi in iTunes",
            "Vedi in iTunes"
        ]
    ],
    "pageTitle": "iTunes - Musica - Screamadelica di Primal Scream",
    "title": "",
    "url": "https://itunes.apple.com/it/album/higher-than-sun-higher-than/id262848981?i=262849195",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 0,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438043060830.93/warc/CC-MAIN-20150728002420-00188-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 862947951,
    "recordOffset": 862920501,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{21108=There's no overestimating the importance of Screamadelica, the record that brought acid house, techno, and rave culture crashing into the British mainstream — an impact that rivaled that of Nirvana's Nevermind, the other 1991 release that changed rock. Prior to Screamadelica, Primal Scream were Stonesy classic rock revivalists with a penchant for Detroit rock. They retained those fascinations on Screamadelica — one listen to the Jimmy Miller-produced, Stephen Stills-rip \"Movin' on Up\" proves that — but they burst everything wide open here, turning rock inside out by marrying it to a gleeful rainbow of modern dance textures. This is such a brilliant, gutsy innovative record, so unlike anything the Scream did before, that it's little wonder that there's been much debate behind who is actually responsible for its grooves, especially since Andrew Weatherall is credited with production with eight of the tracks, and it's clearly in line with his work. Even if Primal Scream took credit for Weatherall's endeavors, that doesn't erase the fact that they shepherded this album, providing the ideas and impetus for this dubtastic, elastic, psychedelic exercise in deep house and neo-psychedelic. Like any dance music, this is tied to its era to a certain extent, but it transcends it due to its fierce imagination and how it doubles back on rock history, making the past present and vice versa. It was such a monumental step forward that Primal Scream stumbled before regaining their footing, but by that point, the innovations of Screamadelica had been absorbed by everyone from the underground to mainstream. There's little chance that this record will be as revolutionary to first-time listeners, but after its initial spin, the genius in its construction will become apparent — and it's that attention to detail that makes Screamadelica an album that transcends its time and influence., 25482=Formato(a): 1984, Glasgow, Scotland, 128701=Copyright © 2014 Apple Inc. Tutti i diritti riservati.}",
    "lastModified": "Wed, 05 Aug 2015 04:22:28 GMT",
    "textBeforeTable": "Apri iTunes per visualizzare in anteprima, acquistare e scaricare musica. Vedi altri articoli di questo artista Primal Scream Screamadelica iTunes per Mac+PC Hai già iTunes? Fai clic su Anche io ho iTunes! per aprirlo. Non abbiamo trovato iTunes sul tuo computer. Per le anteprime e l'acquisto di musica da Screamadelica di Primal Scream, installa iTunes adesso. iTunes is the world's easiest way to organize and add to your digital media collection. iTunes Progress Indicator Se iBooks non si apre, clicca sull'app iBooks nel Dock. Apertura di iBooks Store in corso Progress Indicator Se iTunes non si apre, fai clic sull'icona dell'applicazione iTunes nel Dock o sul desktop di Windows. Apertura di iTunes Store.",
    "textAfterTable": "11 brani Recensione album There's no overestimating the importance of Screamadelica, the record that brought acid house, techno, and rave culture crashing into the British mainstream — an impact that rivaled that of Nirvana's Nevermind, the other 1991 release that changed rock. Prior to Screamadelica, Primal Scream were Stonesy classic rock revivalists with a penchant for Detroit rock. They retained those fascinations on Screamadelica — one listen to the Jimmy Miller-produced, Stephen Stills-rip \"Movin' on Up\" proves that — but they burst everything wide open here, turning rock inside out by marrying it to a gleeful rainbow of modern dance textures. This is such a brilliant, gutsy innovative record, so unlike anything the Scream did before, that it's little wonder that there's been much debate behind who is actually responsible for its grooves, especially since Andrew Weatherall is credited with production with eight of the tracks, and it's clearly in line with his work. Even if Primal Scream took credit for Weatherall's endeavors, that doesn't erase the fact that they shepherded this album, providing the ideas and impetus for this dubtastic, elastic, psychedelic exercise in deep house and neo-psychedelic. Like any dance music, this is tied to its era to a certain extent, but it transcends it due to its fierce imagination and how it doubles back on rock history,",
    "hasKeyColumn": true,
    "keyColumnIndex": 1,
    "headerRowIndex": 0
}