{
    "relation": [
        [
            "PDF",
            "23",
            "23",
            "28",
            "29",
            "29",
            "29",
            "34",
            "34",
            "35",
            "35",
            "36",
            "36",
            "36",
            "36",
            "36",
            "36",
            "36",
            "36",
            "39",
            "39",
            "45",
            "",
            "52",
            "53",
            "62",
            "62",
            "94",
            "94",
            "97",
            "108",
            "115",
            "117",
            "118",
            "124",
            "130",
            "131",
            "160",
            "165",
            "165",
            "238"
        ],
        [
            "Paper",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "50",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            ""
        ],
        [
            "Description",
            "#36470: The ruby command is two lines but is not highlighted on the second line. This was very misleading, and caused me to have to go back and painfully correct my mistake.--Adrian Anttila #36470: The ruby command is two lines but is not highlighted on the second line. This was very misleading, and caused me to have to go back and painf...more...",
            "#35300: In the example on page 23 , the generate script is demonstrated. In the figure, the command text gets wrapped to the next line and the part of the command that gets wrapped has a blue typeface that does not match the red, bold typeface that the first part of the command had. --Jeff Harrington #35300: In the example on page 23 , the generate script is demonstrated. In the figure, the command text gets wrapped to the next line and the par...more...",
            "#35394: After adding the new column with rake db:migrate, the text says to add the new field to the existing view pages. It says to \"Open app/views/new.html.erb\" which doesn't exist. It should say \"Open app/views/books/new.html.erb\"--Mike Admire #35394: After adding the new column with rake db:migrate, the text says to add the new field to the existing view pages. It says to \"Open app/views/n...more...",
            "#35396: It seems like the code example should include the changes that are being talked about in the text. Adding the code for the new field: <b>Purchased on</b> <%= f.date_select :purchased_on %> --Mike Admire #35396: It seems like the code example should include the changes that are being talked about in the text. Adding the code for the new field: <...more...",
            "#36206: The sentence on PDF p29 \"Using the same technique, you should also go ahead and enhance app/views/NEW.html.erb in the same way.\" should presumably reference app/view/EDIT.html/erb instead.--Chris Kapilla #36206: The sentence on PDF p29 \"Using the same technique, you should also go ahead and enhance app/views/NEW.html.erb in the same way.\" should presum...more...",
            "#36471: The source listing for new.html.erb does not include the purchased_on field.--Adrian Anttila",
            "#35345: The wording in the last paragraph of the to_s vs. ToString() section on page 34 implies that the an example of to_s was shown to the reader.--Andrew Gaskell",
            "#36472: The comment about to_s appears before the code it refers to; perhaps it should be moved?--Adrian Anttila",
            "#36473: 5 x 10 should be printed out as 50, not 500 as shown in the code listing.--Adrian Anttila",
            "#35301: On PDF page 35 under section 2.3, the following ruby code is sampled: puts \"\\t#{5*10}\" and the result in the book is said to be 500 when the true result is (clearly) 50--Jeff Harrington #35301: On PDF page 35 under section 2.3, the following ruby code is sampled: puts \"\\t#{5*10}\" and the result in the book is said to be 5...more...",
            "#35346: On page 36 the line puts flight.sub(/(w+)\\bto/, 'PDX to') doesn’t produce the listed output.--Andrew Gaskell",
            "#35347: The first line of output in the flight example is actually the first line of code – flight = \"United Airlines, Flight #312, ORD to LAX, 9:45AM to 11:45AM\"--Andrew Gaskell #35347: The first line of output in the flight example is actually the first line of code – flight = \"United Airlines, Flight #312, ORD to LAX, 9:45AM...more...",
            "#35348: There are also some code color issues with the output of the flight example.--Andrew Gaskell",
            "#36474: The standard class for working with regular expressions in .NET is Regex, not RegExp.--Adrian Anttila",
            "#36475: The second output listing on the page should not include the first line. It is a repeat of the variable assignment, and wouldn't be displayed.--Adrian Anttila",
            "#36476: The second output listing should not have the output colored green, as if each line contained a comment.--Adrian Anttila",
            "#37092: puts flight.sub(/(w+)\\bto/, 'PDX to') # is a pattern match and should use the gsub method NOT the sub method--Matthew Erker",
            "#37095: puts flight.sub(/(w+)\\bto/, 'PDX to') # the regular expression is incorrect; maybe: gsub(/\\w+ \\bto/, 'PDX to')--Matthew Erker",
            "#36484: The List<> type is a collection, not an array. Either the text needs to be updated to note the distinction, or an actual array should be used in the C# code examples.--Adrian Anttila #36484: The List<> type is a collection, not an array. Either the text needs to be updated to note the distinction, or an actual array should be used...more...",
            "#35302: On PDF page 39 on line 1 of the .NET code example a string of characters is present that is not .NET code: #--Jeff Harrington",
            "#37379: \"A symbol is globally unique, named representation of\" should be \"A symbol is *a* globally unique, named representation of\"--Mark Cohen",
            "#48616: In the second paragraph of 3.1 Working with Collections and Iterators you state \"...we may way want to synthesize an entirely new data set containing only those elements that meet certain criteria.\" The word \"way\" shouldn't be there. --Amanda #48616: In the second paragraph of 3.1 Working with Collections and Iterators you state \"...we may way want to synthesize an entirely new data set con...more...",
            "#35349: \"A static method called Models() returns a list of available models that can be used.\" Models is a property.--Andrew Gaskell",
            "#35350: \"In the body of the initializer, we have defined two instance variables, @model and @altitude.\" There are 3 instance variables defined.--Andrew Gaskell",
            "#35351: There’s 2 methods nested inside of a method for the C# 2.0 example.--Andrew Gaskell",
            "#35352: Small issue with the LINQ version – if you want to keep the examples functionally equivalent then AddDays(-8) is incorrect.--Andrew Gaskell",
            "#35356: The text/symbol \">\" appears twice in the example of the generate script: c:\\dev\\flight> ruby script\\generate model flight c:\\dev\\flight> ruby script\\generate controller flights--Jeff Harrington #35356: The text/symbol \">\" appears twice in the example of the generate script: c:\\dev\\flight> ruby script\\generate model flight c:\\dev\\...more...",
            "#36735: The command prompts have the > character escaped in the code listing but shouldn't.--Adrian Anttila",
            "#35357: The text/symbol \">\" appears twice on this page in the example of the scaffold generate: c:\\dev\\> rails flight c:\\dev\\flight\\> ruby script\\generate scaffold flight--Jeff Harrington #35357: The text/symbol \">\" appears twice on this page in the example of the scaffold generate: c:\\dev\\> rails flight c:\\dev\\flight\\> r...more...",
            "#35379: Missing a space in @passengersArray - should read \"@passengers Array\"--Andrew Gaskell",
            "#35442: Unexplained #END HIGHLIGHT comment. I'm guessing the arrows are supposed to stop at that line because the code after #END HIGHLIGHT didn't change.--Andrew Gaskell",
            "#35443: #BEGIN HIGHLIGHT comment. Guessing that the code is supposed to be highlighted with arrows.--Andrew Gaskell",
            "#37465: Missing from code listing: <%= will_paginate @passengers %> But available in referenced download--Mark Cohen #37465: Missing from code listing: <%= will_paginate @passengers %> But available ...more...",
            "#37466: \"This additional line of code with result in a standard error message displayed inline,\" should read \"This additional line of code *will* result in a standard error message displayed inline,\" --Mark Cohen #37466: \"This additional line of code with result in a standard error message displayed inline,\" should read \"This additional line of code *will* resu...more...",
            "#36796: Shouldn't the text \"/flights-for-today/\" map to the AirlinesController, not the FlightsController?--Adrian Anttila",
            "#35450: The proposed show action potentially hits the database twice. Not a big deal if you're consistently using the named route, but I'd probably use the ternary operator to determine whether or not we have a name parameter. --Andrew Gaskell #35450: The proposed show action potentially hits the database twice. Not a big deal if you're consistently using the named route, but I'd probably us...more...",
            "#36820: Shouldn't the airports variable be prefixed with the @ symbol, since it's a member of the generated view?--Adrian Anttila",
            "#35482: Few things on this page: \"header and footer to our views\" - there isn't really a footer being added. There's a header and you're styling the content. It's also unclear if the flights_enhanced layout's header's id is set correctly. If it is set correctly I think you should add styling for this element in scaffold.css. This would make your intentions clearer (the reader would have a visual confirmation). There's a lot of issues with the downloadable code in this section. Layouts render as html in my browser and a lot of it contains markup (<%# START_HIGHLIGHT %>, <%# END_HIGHLIGHT %>, etc).--Andrew Gaskell #35482: Few things on this page: \"header and footer to our views\" - there isn't really a footer being added. There's a header and you're styling t...more...",
            "#36822: Either the id of the h1 element or the CSS needs to change, since they don't have the same value (flights vs header) in the code listings.--Adrian Anttila",
            "#37226: Context: ---------------- Using a third-party gem from within your Rails code is dirt simple. Rails knows to activate the RubyGems environment when it starts up, so all you have to do is tell Rails which Rails your application depends upon. You’ll then need to decide whether you want to bundle a copy of each Description: ------------ the second line (bottom to top) of the las paragraph should say: \"so all you have to do is tell Rails which Gem\" instead of \"so all you have to do is tell Rails which Rails\"--Ganso de Soya #37226: Context: ---------------- Using a third-party gem from within your Rails code is dirt simple. Rails knows to activate the RubyGems environ...more..."
        ],
        [
            "Found in",
            "P1.0 16-Dec-08",
            "P1.0 16-Oct-08",
            "P1.0 22-Oct-08",
            "P1.0 22-Oct-08",
            "P1.0 30-Nov-08",
            "P1.0 16-Dec-08",
            "P1.0 19-Oct-08",
            "P1.0 16-Dec-08",
            "P1.0 16-Dec-08",
            "P1.0 16-Oct-08",
            "P1.0 19-Oct-08",
            "P1.0 19-Oct-08",
            "P1.0 19-Oct-08",
            "P1.0 16-Dec-08",
            "P1.0 16-Dec-08",
            "P1.0 16-Dec-08",
            "P1.0 16-Jan-09",
            "P1.0 16-Jan-09",
            "P1.0 17-Dec-08",
            "P1.0 16-Oct-08",
            "P1.0 30-Jan-09",
            "P1.0 30-Jan-12",
            "P1.0 19-Oct-08",
            "P1.0 19-Oct-08",
            "P1.0 19-Oct-08",
            "P1.0 19-Oct-08",
            "P1.0 19-Oct-08",
            "P1.0 30-Dec-08",
            "P1.0 19-Oct-08",
            "P1.0 20-Oct-08",
            "P1.0 25-Oct-08",
            "P1.0 25-Oct-08",
            "P1.0 03-Feb-09",
            "P1.0 03-Feb-09",
            "P1.0 01-Jan-09",
            "P1.0 25-Oct-08",
            "P1.0 02-Jan-09",
            "P1.0 26-Oct-08",
            "P1.0 02-Jan-09",
            "P1.0 23-Jan-09"
        ],
        [
            "Fixed in",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            ""
        ]
    ],
    "pageTitle": "The Pragmatic Bookshelf | Errata for Rails for .NET Developers",
    "title": "",
    "url": "https://pragprog.com/titles/cerailn/errata",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 0,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986022.41/warc/CC-MAIN-20150728002306-00310-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 873506187,
    "recordOffset": 873487855,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{1175=By default this page displays the errata for the latest version of the book. If you have a previous version, select it here:   2008-10-14: P1.0}",
    "TableContextTimeStampAfterTable": "{8580=#35347: The first line of output in the flight example is actually the first line of code – flight = \"United Airlines, Flight #312, ORD to LAX, 9:45AM to 11:45AM\"--Andrew Gaskell, 28798=The Pragmatic Bookshelf™ is an imprint of The Pragmatic Programmers, LLC. Copyright © 1999–2015 The Pragmatic Programmers, LLC. All Rights Reserved.}",
    "textBeforeTable": "(To find out what version you have, look at the copyright page, a few pages in from the front of the book. If it says (say) 'Second Printing', then here it'll be P2.0. If there are interim PDF releases in that printing, they'll be 2.1, 2.2, and so on.) By default this page displays the errata for the latest version of the book. If you have a previous version, select it here:   2008-10-14: P1.0 Key: Typo Tech. Error Suggestion Not a problem Next edition The latest version of the book is P1.0, released almost 7 years ago. If you've bought a PDF of the book and would like to upgrade it to this version (for free), visit your home page. We try to keep our books accurate, but sometimes mistakes creep in. This page lists the errors submitted by our astute readers. If you've found a new error, please submit it. Errata for Rails for .NET Developers",
    "textAfterTable": "Home | About Us | Connect! | Write For Us | Privacy Policy | Security | Terms of Use | Credits | Contact Us The Pragmatic Bookshelf™ is an imprint of The Pragmatic Programmers, LLC. Copyright © 1999–2015 The Pragmatic Programmers, LLC. All Rights Reserved.",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}