{
    "relation": [
        [
            "Name",
            "Matt Barkley, USC",
            "Diondre Borel, Utah St.",
            "Ryan Colburn , Fresno St.",
            "Zach Collaros, Cincinnati",
            "Kirk Cousins, Michigan St.",
            "Andy Dalton, TCU",
            "Dwight Dasher, Middle Tenn.",
            "Ricky Dobbs, Navy",
            "Nathan Enderle, Idaho",
            "Nick Foles, Arizona",
            "Blaine Gabbert, Missouri",
            "Robert Griffin, III, Baylor",
            "Jacory Harris, Miami",
            "Jordan Jefferson, LSU",
            "Jerrod Johnson, Texas A&M",
            "Landry Jones, Oklahoma",
            "Colin Kaepernick , Nevada",
            "Case Keenum, Houston",
            "G.J. Kinne, Tulsa",
            "Jake Locker , Washington",
            "Andrew Luck, Stanford",
            "Ryan Mallett , Arkansas",
            "Greg McElroy, Alabama",
            "Kellen Moore, Boise St.",
            "Joshua Nesbitt, Ga. Tech",
            "Kyle Padron, SMU",
            "Christian Ponder, Florida St.",
            "Terrelle Pryor, Ohio St.",
            "Kevin Riley, California",
            "Ricky Stanzi , Iowa",
            "Tyrod Taylor, Virginia Tech",
            "Scott Tolzien, Wisconsin",
            "Russell Wilson, N.C. State"
        ],
        [
            "Class",
            "So.",
            "Sr.",
            "Sr.",
            "Jr.",
            "Jr.",
            "Sr.",
            "Sr.",
            "Sr.",
            "Sr.",
            "Jr.",
            "Jr.",
            "So.",
            "Jr.",
            "Jr.",
            "Sr.",
            "So.",
            "Sr.",
            "Sr.",
            "Jr.",
            "Sr.",
            "So.",
            "Jr.",
            "Sr.",
            "Jr.",
            "Sr.",
            "So.",
            "Sr.",
            "Jr.",
            "Sr.",
            "Sr.",
            "Sr.",
            "Sr.",
            "Jr."
        ],
        [
            "Cmp-Att",
            "211-352",
            "214-366",
            "181-298",
            "93-124",
            "198-328",
            "199-323",
            "219-399",
            "56-105",
            "192-312",
            "260-409",
            "262-445",
            "45-69",
            "242-406",
            "182-296",
            "296-497",
            "261-449",
            "166-282",
            "492-700",
            "210-345",
            "230-395",
            "162-288",
            "225-403",
            "198-325",
            "277-431",
            "75-162",
            "135-201",
            "227-330",
            "167-295",
            "209-382",
            "171-304",
            "136-243",
            "211-328",
            "224-378"
        ],
        [
            "Pct.",
            ".599",
            ".585",
            ".607",
            ".750",
            ".604",
            ".616",
            ".549",
            ".533",
            ".615",
            ".636",
            ".589",
            ".652",
            ".596",
            ".615",
            ".596",
            ".581",
            ".589",
            ".703",
            ".609",
            ".582",
            ".563",
            ".558",
            ".609",
            ".643",
            ".463",
            ".672",
            ".688",
            ".566",
            ".547",
            ".563",
            ".560",
            ".643",
            ".593"
        ],
        [
            "Yards",
            "2,735",
            "2,885",
            "2,459",
            "1,434",
            "2,680",
            "2,756",
            "2,789",
            "1,031",
            "2,906",
            "2,486",
            "3,593",
            "481",
            "3,352",
            "2,166",
            "3,579",
            "3,198",
            "2,052",
            "5,671",
            "2,732",
            "2,800",
            "2,575",
            "3,627",
            "2,508",
            "3,536",
            "1,701",
            "1,922",
            "2,717",
            "2,094",
            "2,850",
            "2,417",
            "2,311",
            "2,705",
            "3,027"
        ],
        [
            "TDs",
            "15",
            "17",
            "19",
            "10",
            "19",
            "23",
            "23",
            "6",
            "22",
            "19",
            "24",
            "4",
            "24",
            "17",
            "30",
            "26",
            "20",
            "44",
            "22",
            "21",
            "13",
            "30",
            "17",
            "39",
            "10",
            "10",
            "14",
            "18",
            "18",
            "17",
            "13",
            "16",
            "31"
        ],
        [
            "INTs",
            "14",
            "4",
            "11",
            "2",
            "9",
            "8",
            "14",
            "3",
            "9",
            "9",
            "9",
            "0",
            "17",
            "7",
            "8",
            "14",
            "6",
            "15",
            "10",
            "11",
            "4",
            "7",
            "4",
            "3",
            "5",
            "4",
            "7",
            "11",
            "8",
            "15",
            "5",
            "11",
            "11"
        ],
        [
            "Wins",
            "9",
            "4",
            "8",
            "4",
            "5",
            "12",
            "10",
            "9",
            "8",
            "6",
            "8",
            "2",
            "9",
            "8",
            "6",
            "7",
            "8",
            "10",
            "5",
            "5",
            "8",
            "8",
            "14",
            "14",
            "11",
            "5",
            "4",
            "11",
            "8",
            "11",
            "10",
            "10",
            "5"
        ]
    ],
    "pageTitle": "News / Allstate Sugar Bowl",
    "title": "",
    "url": "http://www.allstatesugarbowl.org/site.php?pageID=19&newsID=185",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 2,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988511.77/warc/CC-MAIN-20150728002308-00037-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 285000671,
    "recordOffset": 284986487,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{1=Wilson ranked fourth nationally in touchdown passes last season with 31; that mark led the ACC and was the second-highest single-season tally in school history. The junior has tossed just 12 interceptions in his career (against 48 TDs) and had a stretch of 379 straight passes without an interception from 2008 into 2009, the longest streak in NCAA history. In addition to tying a school record by throwing for five scores at Florida State, he rushed for 91 yards in the win over Pitt, the highest rushing total for a Wolfpack QB since 1976. Wilson's baseball career makes for an interesting story as he sat out spring practice to play for the Wolfpack baseball squad, and then was drafted in the fourth round of the MLB Draft by the Colorado Rockies.  He spent the summer playing baseball for the Tri-City Dust Devils, but is scheduled to report to N.C. State football camp on Aug. 3. The Wolfpack will open the 2010 campaign at home against Western Carolina on Sept. 4. Raleigh News-Observer story about Wilson as a dual sport athlete Wilmington Star-Journal article on the challenges of the baseball/football double life}",
    "TableContextTimeStampAfterTable": "{56038=© 2012 Allstate Sugar Bowl. All rights reserved. Privacy Policy \"SUGAR BOWL\" is a registered trademark of the Sugar Bowl, 13842=Monday, July 19, 2010, 49239=2010-11 Manning Award Watch List Photo Gallery The Manning Award was created by the Allstate Sugar Bowl in 2004 to honor of the college football accomplishments of Archie, Peyton and Eli Manning. It is the only quarterback award that takes into consideration the candidates' bowl performances. Ten finalists will be selected in late-November and the winner will be announced after the bowls in January and will be honored at a ceremony in New Orleans. The preseason Watch List recognizes some of the top quarterbacks in the nation based on previous collegiate performance, however, every quarterback in the nation remains eligible for the honor. Additional quarterbacks may be added to the Watch List after the start of the season. The list of 10 finalists will be released on Monday, Nov. 29. The winner will be announced on Wednesday, Jan. 19. The Manning Award will be recognizing its seventh winner this year. USC's Matt Leinart was the inaugural winner of the award in 2005, followed by Texas' Vince Young in 2006. Both went on to be top 10 NFL draft picks. In 2007, LSU's JaMarcus Russell earned the award and was the NFL's No. 1 draft pick. Boston College's Matt Ryan claimed the award in 2008 and was drafted No. 3, quickly becoming the starting quarterback for the Atlanta Falcons. In 2009, Florida star Tim Tebow earned the honor - he also went on to be selected in the first round of the NFL Draft. Last year's winner was Texas signal-caller Colt McCoy, the winningest quarterback in college football history. McCoy was picked by the Cleveland Browns in the 2010 NFL Draft.}",
    "textBeforeTable": "Raleigh News-Observer story about Wilson as a dual sport athlete Wilmington Star-Journal article on the challenges of the baseball/football double life   Manning Award Watch List (Final) Wilson ranked fourth nationally in touchdown passes last season with 31; that mark led the ACC and was the second-highest single-season tally in school history. The junior has tossed just 12 interceptions in his career (against 48 TDs) and had a stretch of 379 straight passes without an interception from 2008 into 2009, the longest streak in NCAA history. In addition to tying a school record by throwing for five scores at Florida State, he rushed for 91 yards in the win over Pitt, the highest rushing total for a Wolfpack QB since 1976. Wilson's baseball career makes for an interesting story as he sat out spring practice to play for the Wolfpack",
    "textAfterTable": "2010-11 Manning Award Watch List Photo Gallery The Manning Award was created by the Allstate Sugar Bowl in 2004 to honor of the college football accomplishments of Archie, Peyton and Eli Manning. It is the only quarterback award that takes into consideration the candidates' bowl performances. Ten finalists will be selected in late-November and the winner will be announced after the bowls in January and will be honored at a ceremony in New Orleans. The preseason Watch List recognizes some of the top quarterbacks in the nation based on previous collegiate performance, however, every quarterback in the nation remains eligible for the honor. Additional quarterbacks may be added to the Watch List after the start of the season. The list of 10 finalists will be released on Monday, Nov. 29. The winner will be announced on Wednesday, Jan. 19. The Manning Award will be recognizing its seventh winner this year. USC's Matt Leinart was the inaugural winner of the award in 2005, followed by Texas' Vince Young in 2006. Both went on to be top 10 NFL draft picks. In 2007, LSU's JaMarcus Russell earned the award and was the NFL's No. 1 draft pick. Boston College's Matt Ryan claimed the award in 2008 and was drafted No. 3, quickly becoming the starting quarterback for the Atlanta Falcons. In 2009, Florida star Tim Tebow earned the honor - he also went on to be selected in the first round of the NFL Draft. Last",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}