{
    "relation": [
        [
            "",
            "HEALTH1",
            "HEALTH2",
            "HEALTH3",
            "HEALTH4",
            "Infant mortality rate²",
            "POPCH"
        ],
        [
            "Overall¹ ± s National average",
            "1.1 (0.7)",
            "9.1 (3.3)",
            "15.3 (9.1)",
            "2.0 (1.2)",
            "159.8 (73.6)",
            "5.5 (11.0)"
        ],
        [
            "Alice Springs",
            "3",
            "14",
            "16",
            "2",
            "286",
            "27"
        ],
        [
            "Katherine",
            "2",
            "10",
            "19",
            "2",
            "528",
            "24"
        ],
        [
            "Tennant Creek",
            "1",
            "8 15",
            "13",
            "2",
            "441",
            "25"
        ],
        [
            "Kalgoorlie",
            "1",
            "5",
            "26",
            "4",
            "205",
            "-8"
        ],
        [
            "Mt. Isa",
            "1",
            "10",
            "6",
            "1",
            "183",
            ".."
        ],
        [
            "Broken Hill",
            "1",
            "",
            "13",
            "2",
            "112",
            "-7"
        ]
    ],
    "pageTitle": "Arid Zone Settlement in Australia: A Focus on Alice Springs (UNU, 1985, 129 pages): 8. Health service provision and perceptions of service adequacy",
    "title": "",
    "url": "http://www.nzdl.org/gsdlmod?e=d-00000-00---off-0ccgi--00-0----0-10-0---0---0direct-10---4-------0-1l--11-en-50---20-about---00-0-1-00-0--4----0-0-11-10-0utfZz-8-10&a=d&c=ccgi&cl=CL1.1&d=HASHe47e134de57bf7d61d45a3.9",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 6,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986022.41/warc/CC-MAIN-20150728002306-00213-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 624819307,
    "recordOffset": 624798485,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{28643=Moreover, it cannot be assumed that the same proportions of different types of services are required in arid zone areas as in other regions. First, selective migration has meant that certain services need to be provided at relatively higher rates, while others can be reduced. Figure 8.2 demonstrates the imbalance in the age structure of the Northern Territory: with the large number of young mothers, more obstetric and gynaecology facilities have to be provided, and conversely, fewer geriatric facilities are required. Such differences in facility provision do in fact occur (Hospitals and Health Services Commission 1974, p. 61), and special units are established. The Alice Springs Child Care Unit assists in convalescence and treatment of malnourishment of children from the whole region (Northern Territory Department of Health, Southern Region Annual Report, 1978-1979)., 65530=TABLE 8.10. Adequacy of Treatment by Nature of Illness, 1980, 39518=INC2 Percentage of households with incomes of A$6,000 or less UNEMP Percentage of the labour force unemployed UTIL1 Percentage of total occupied private dwellings with no piped water UTIL2 Percentage of occupied private dwellings with no sanitation IMR Infant mortality rates; infant deaths: live births ratio (1974-1978), 63858=Field studies in Alice Springs in 1980 found that the lack of quality of medical services in the town (rather than the absolute lack of facilities) was identified strongly by residents as a major drawback of living in Alice Springs (Burnley, chapter 9). Specific problems residents mentioned are listed in table 8.11. That so many residents perceive such problems with the health service is of importance. One improvement which would help to alleviate some of the criticism would be the addition of another private doctor in the town to offer those who dislike the present dominantly hospital-based system a viable alternative. At present the single private doctor cannot meet apparent market demand alone., 68658=Source: Sample Survey, August 1980., 11234=TABLE 8.1. Patients Treated, Northern Territory Hospitals 1977/78: Rates Per Capita and Length of Stay, 61794=1 Turnover = Number of cessations (including transfers) x 100/average number employed. 2 Number employed. Source: Northern Territory Medical Service Bulletin 18,1977., 62002=The second major obstacle to improvements in specialist services is the problem of attracting staff. As table 8.9 illustrates, staff turnover is exceptionally rapid in the Northern Territory, and especially in the arid land centres. A turnover of over 100 per cent per annum in most clinical employment categories (including doctors) in Alice Springs is astonishing. In 1978/79, 74 per cent of new nursing staff failed to complete their 12-month contract. Apart from all the difficulties such staff changes cause within the hospital, there is the continuing problem of finding staff replacements. Positions are frequently left vacant until a replacement can be found who is willing to live in the town, and various inducements have to be offered to attract personnel. The higher salaries and auxiliary benefits increase total hospital expenditure. In 1978/79, the Alice Springs Hospital reported that \"the positions of Radiologist and Paediatric Registrar are vacant .... The revised housing policy has made recruitment of married R.M.O.'s difficult .... The retention of nursing staff improved although the turnover rate, 82%, is still very high\" (Northern Territory Department of Health, Southern Region Report, p. 16). Staff are offered higher commencing salaries, a district allowance, additional annual leave, recreation leave fares, and recruitment travel and removal allowances, yet still it is difficult to attract permanent staff., 16504=TABLE 8.2. Northern Territory Infant Mortality Rates, 1965-1979, 53035=TABLE 8.8. Northern Territory Interstate Specialist Referrals, 1979/80, 13635=Source: Northern Territory Department of Health Submission, 1979. p. 26.}",
    "textBeforeTable": "TABLE 8.4. Comparisons in the Provision of Services and Infant Mortality For a key to DIST1-DIST3 variables see table 8.5. .064 .065 -.133 (Maternity beds:births) HEALTH4 -.062 -.077 -.188 (Hospital beds:population) HEALTH3 -.068 -.073 -.004 (Nurses:population) HEALTH2 -.047 -.026 .024 (Doctors:population) HEALTH1 DIST3 DIST2 DIST1   Health service TABLE 8.3. The Relationship between Isolation and Health Service Provision Source: Northern Territory Department of Health, Supplement to Bulletin Issue No. 26 (1979).   54.6 21.1 9.8 45.0 1979 12.2 38.9 22.4 9.7 48.1 1978 12.5 73.8 30.5 9.9 74.6 1977 13.8 42.7 27.7 16.1 52.8 1976 14.3 54.2",
    "textAfterTable": "1 Mean for 118 urban areas, except for IMR (data not obtained for Victoria). Key to variables: see tables 8.3 and 8.5. 2 Infant mortality rate here = deaths per ten thousand live births. FIG. 8.1. Regional Acute Bed to Population Ratios, Australia 1972-1973 However, such apparent \"oversupply\" in arid zone areas must be reviewed in the context of the very remoteness of these areas. It is important to locate facilities within a reasonable distance of users, and this \"necessitates the location of hospitals in places where they may not be utilised continuously by the local population at a reasonable level of occupance\" (Northern Territory Department of Health Submission). Hospital bed occupancy rates tend to be lower in remote areas (under 60 per cent) than in metropolitan centres (over 70 per cent, Hospitals Commission 1974), but to suggest that these areas had a surplus of hospital beds would be erroneous. Basic services have to be provided to care not only for a constant demand but also seasonal variations and peak admission levels, which could adversely affect hospitals in isolated areas that do not have nearby back-up facilities. A simple bed-population ratio cannot be used as a standard for measuring the adequacy of need in different areas. This is especially so in Alice Springs, where a population of 150,000 visitors inevitably makes casualty and other demands on hospital services. Moreover, it cannot be assumed that the",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}