{
    "relation": [
        [
            "Groom",
            "Joseph B. Papillo",
            "Richard Aquilina",
            "Alex Swencicki",
            "William R. Waterman",
            "L. Wayne Woodard",
            "E. Charles Wooding",
            "Albert J. Moyse",
            "William H. Van Zeilen"
        ],
        [
            "Age",
            "31",
            "22",
            "40",
            "23",
            "40",
            "39",
            "27",
            "26"
        ],
        [
            "Occupation",
            "surveyor",
            "waiter",
            "Delco worker",
            "truck driver",
            "credit correspondent",
            "machinist",
            "chemist",
            "gas station attendant"
        ],
        [
            "Groom's Address",
            "826 Flower City Pk.",
            "87 Grape St.",
            "14 Thomas St.",
            "336½ Plymouth Ave. S.",
            "392 Alexander St.",
            "31 Halford St.",
            "300 Murray St.",
            "445 Winton Rd. N."
        ],
        [
            "Bride",
            "Mary O'Kane",
            "Carmela Bonanza",
            "Helen Cramer",
            "Marguerite Toner",
            "Ruth Morey",
            "Margaret H. Barrett",
            "Mildred B. Pletsch",
            "Marie I. Weidman"
        ],
        [
            "Age",
            "29",
            "22",
            "40",
            "20",
            "28",
            "49",
            "25",
            "27"
        ],
        [
            "Bride's Address",
            "555 Magee Ave.",
            "13 Arklow St.",
            "14 Thomas St.",
            "128 Roslin St.",
            "80 Santee St.",
            "31 Halford St.",
            "7 Draper St.",
            "600 Campbell St."
        ]
    ],
    "pageTitle": "Marriage Licenses extracted from the Rochester Daily Record; July 1, 1936 - Dec. 31, 1936",
    "title": "Published on October 3, 1936; page 2",
    "url": "http://mcnygenealogy.com/vr/daily-record-1936b.htm",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 74,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986022.41/warc/CC-MAIN-20150728002306-00303-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 157434051,
    "recordOffset": 157369084,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{884=In 1936 a couple could obtain a marriage license and get married the same day. The marriage had to be preformed within a couple of months from the day it was issued. Just because the marriage license was issued in Rochester doesn't mean that the couple got married there. They could get married anywhere in the State., 357412=© Richard T. Halsey, 2013}",
    "lastModified": "Tue, 22 Jan 2013 01:54:22 GMT",
    "textBeforeTable": "A good research strategy would be to look in both the Democrat & Chronicle and Rochester Times-Union (daily) newspapers for the days a few days before and up to a month after The Daily Record published date for a marriage notice. There are probably going to be some marriages that were not announced in either of those two newspapers. You can also check the vital record index that are in the Rochester Public Library and 10 other locations around the State. See this web page for those locations. You can order a copy of the marriage record from the NY State Department of Health in Albany. They charge $22 for an uncertified copy for genealogical research and take up to about 8 months to get a copy to you. The Rochester City Hall only asks $10 for a one year search (& copy) and $1 for another year. Go to this web page for an online PDF form to order from Rochester City Hall. In 1936 a couple could obtain a marriage license and get married the same day. The marriage had to be preformed within a couple of months from the day it was issued. Just because the marriage license was issued in Rochester doesn't mean that the couple got married there. They could get married anywhere in the State. There isn't a date published when",
    "textAfterTable": "Luther I. Webster 30 attorney 520 Park Ave. Edna C. Hartsen 30 35 Hartsen St. Armistead Jones 35 laborer 376 Clarissa St. Pearl Anderson 19 123 Ford St. George Newton 69 attendant 255 S. Goodman St. Nettie A. Willison 68 255 S. Goodman St. Clarence H. Ager 46 manufacturer 385 Monroe Ave. Maude M. Casey 44 1011 University Ave.   Published on July 2, 1936; page 2 Groom Age Occupation Groom's Address Bride Age Bride's Address Emil Tonchak 24 factory 15 Durnan St. Irene Kaminski 23 15 Durnan St. Theodore G. Schlaefer, Jr. 28 shipping clerk 1070 Joseph Ave. Helen Ruster 21 7 Boston St. Michael J. Nee 42 bricklayer Newton, Mass. Dora Emby 43 75 Oakland St. James C. Smith 28 salesman Bradford, Pa. Irene M. Riordan 22 652 Broadway Henry B. Cornwell, Jr. 21 clerk Schnectady, N. Y. Ruth Stone 22 262 Warwick Ave. Wynhand De Jonge 31 painting 34 Howell St. Grace Bauch 20 29 Comfort St. Joseph E. Meyers 24 U. S. Army West Point, N. Y. Mary Featherby 21 214 Otis St. Lester T. French 24 machinist 87 Watkins Ter. Velida M. Stein 23 250 Ernst St.   Published on July 3, 1936; page 2 Groom Age Occupation Groom's Address Bride Age Bride's Address",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}