{
    "relation": [
        [
            "Project",
            "1. Statewide Bacteria TMDLs (B)",
            "2. Nashua River TMDL (N)",
            "3. Oyster Pond (N)",
            "4. Little Pond (N)",
            "5. Centerville Harbor (N)",
            "6. Three Bays/Princes Cove (N)",
            "7. Wareham (N)",
            "8. West Falmouth Harbor (N)",
            "9. Acushnet River/New Bedford (N)",
            "10. Sessachacha Pond, Nantucket (N)",
            "11. Pleasant Bay (N)",
            "12. Rushy Marsh (N)",
            "13.Phinney's Harbor/ Back River/Eel Pond (N)",
            "14. Nantucket Harbor (N)",
            "15. Edgartown Great Pond (N)",
            "16. Little Namasket River (N)",
            "17. Namasket River (N)",
            "18. Rock Harbor (N)",
            "19. Lewis Bay (N)",
            "20. Nauset Marsh (N)",
            "21. Lake Tashmoo (N)",
            "22.Lagoon Pond (N)",
            "23. Pocasset Harbor (N)",
            "24. Madaket Harbor (N)",
            "25. Long Pond, Nantucket (N)",
            "26. Parkers River (N)",
            "27. Saquatucket Harbor (N)",
            "28. Allen Harbor (N)",
            "29. Herring River (N)",
            "30. Wychmere Harbor (N)",
            "31. Chilmark Pond (N)",
            "32.Farm Pond (N)",
            "33. Slocums River (N)",
            "34. Little River, Dartmouth (N)",
            "35. Apponagansett Bay (N)",
            "36. Lower Charles (N)",
            "37. Regional Mercury TMDL"
        ],
        [
            "Draft Tech Report",
            "N/A",
            "N/A",
            "Completed",
            "Completed",
            "Completed",
            "Completed",
            "Completed",
            "Completed",
            "Completed",
            "Completed",
            "Completed",
            "Completed",
            "Completed",
            "Completed",
            "Completed",
            "Completed",
            "Completed",
            "Completed",
            "Completed",
            "Q2- 20081",
            "Q2- 20081",
            "Q2- 20081",
            "Q2- 20081",
            "Q3- 20081",
            "Q3-20081",
            "Q3-20081",
            "Q2-20081",
            "Q2-20081",
            "Q2-20081",
            "Q2-20081",
            "Q2-20081",
            "Q3-20081",
            "Completed",
            "Completed",
            "Q2-20081",
            "NA",
            "NA"
        ],
        [
            "Final Tech Report",
            "N/A",
            "N/A",
            "Completed",
            "Completed",
            "Completed",
            "Completed",
            "Q1- 20081",
            "Completed",
            "Q1- 20081",
            "Q1- 20081",
            "Completed",
            "Completed",
            "Completed",
            "Q4- 20071",
            "Q1- 20081",
            "Q1- 20081",
            "Q1- 20081",
            "Q1- 20081",
            "Q1- 20081",
            "Q3- 20081",
            "Q3- 20081",
            "Q3- 20081",
            "Q3- 20081",
            "Q4- 20081",
            "Q4-20081",
            "Q4-20081",
            "Q3-20081",
            "Q3-20081",
            "Q3-20081",
            "Q3-20081",
            "Q3-20081",
            "Q4-20081",
            "Q3-20081",
            "Q3-20081",
            "Q3-20081",
            "NA",
            "NA"
        ],
        [
            "Draft TMDL",
            "27 watersheds Completed",
            "Completed",
            "Completed",
            "Completed",
            "Completed",
            "Completed",
            "Q1- 20081",
            "Completed",
            "Q1- 20081",
            "TBD2",
            "Completed",
            "Completed",
            "Completed",
            "Completed",
            "Q1- 20081",
            "Q1- 20081",
            "Q1- 20081",
            "Q1- 20081",
            "Q2- 20081",
            "Q3- 20081",
            "Q3- 20081",
            "Q3- 20081",
            "Q3- 20081",
            "Q4- 20081",
            "Q4-20081",
            "Q4-20081",
            "Q3-20081",
            "Q3-20081",
            "Q3-20081",
            "Q3-20081",
            "Q3-20081",
            "Q4-20081",
            "Q3-20081",
            "Q3-20081",
            "Q3-20081",
            "Completed",
            "Completed"
        ],
        [
            "Final TMDL",
            "50% Q4 - 20081 50% Q4- 20091",
            "Q2- 20081",
            "Q1- 20081",
            "Q2- 20081",
            "Q2- 20081",
            "Q1- 20081",
            "Q4- 20081",
            "Q1- 20081",
            "Q4- 20081",
            "TBD2",
            "Completed",
            "TBD2",
            "Q1- 20081",
            "Q2- 20081",
            "Q3- 20081",
            "Q3 - 20081",
            "Q3 - 20081",
            "Q3 - 20081",
            "Q4 - 20081",
            "Q1- 20091",
            "Q1- 20091",
            "Q1- 20091",
            "Q1- 20091",
            "Q2- 20091",
            "Q2-20091",
            "Q2-20091",
            "Q1-20091",
            "Q1-20091",
            "Q1-20091",
            "Q1-20091",
            "Q1-20091",
            "Q2-20091",
            "Q1-20091",
            "Q2-20091",
            "Q1-20091",
            "Q4-20071",
            "Q1-20081"
        ]
    ],
    "pageTitle": "Environmental Progress Report FY 2008 | MassDEP",
    "title": "",
    "url": "http://www.mass.gov/eea/agencies/massdep/water/reports/surface-groundwater-results-2008.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 10,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438043060830.93/warc/CC-MAIN-20150728002420-00201-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 579893871,
    "recordOffset": 579787635,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{229794=In January 2007 revisions to the state water quality standards promulgated by the MassDEP became effective. The revised regulations include statewide site-specific copper criteria for 23 specific streams and stream segments. The adoption of the criteria replaces EPA's national criteria in determining NPDES permit limits for approximately 30 facilities. EPA/Region 1 approved the use of the site-specific copper criteria on March 26, 2007 as required under the federal Clean Water Act. MassDEP is in the process of instituting the application of the new criteria as permits are proposed for renewal and through individual permit modification. The result will be more accurate toxicity limits for copper and increased compliance., 401075=With the adoption of the new Water Management Permitting Policy in April 2004, MassDEP expects the number of permits containing performance standards and demand management controls to increase. The Policy describes MassDEP's work to review and condition permits relative to basin stress in order to protect aquatic habitat and ensure a stable water budget for all basins, especially those under high or medium stress. Implementation of this policy will dramatically increase the number of permits that have controls designed to prevent waste of  valuable water resources. In addition, all WMA permits are reviewed on a 5-year cycle. At the time of a permit's 5-Year Review, MassDEP will amend permits that have water sources located in high and medium stress basins to include higher level performance standards., 437602=Maintaining Strong Performance Through the adoption and implementation of the new \"Water Management Policy for Permit and Permit Amendment Applications and 5-Year Reviews effective April 5, 2004, specific performance standards for water use need to be met. These performance standards require that public water suppliers in high and medium stressed basins (as defined by the MA Water Resources Commission report \"Stressed Basins in Massachusetts,\" approved December 13, 2001) meet a performance standard of 65 gallons per person per day for residential water use and have an unaccounted-for water loss of less than 10% in their system. The Policy also requires an evaluation of the feasibility of reducing water losses to the basin for new withdrawals and increases in authorized water withdrawals in stressed basins. When new sources or increases in withdrawal volumes are proposed, MassDEP will evaluate whether additional conditions and offsets are necessary to achieve the appropriate balance between competing water uses. MassDEP believes these requirements will improve conditions by reducing overall water use, particularly in those basins identified as being \"stressed\" in Massachusetts., 428637=The number of exceedances of the authorized withdrawal volume fell from twenty-two (22) in 2005, to fifteen (15) in 2006. While the reasons may vary for the reduction in violations it may in part be attributable to a wetter than normal late spring early summer in the summer of 2006, and the increased visibility of the Water Management Program in recent years. In 2005, three (3) golf courses and two (2) agricultural users, use types that reflect climatic conditions, violated their authorized withdrawal volumes. In 2006, no golf courses or agricultural users exceeded. Of the fifteen (15) exceedances, eight (8) were cranberry growers who had constructed additional acreage, and five (5) were public water suppliers who may not actually be exceeding but reflect either data reporting issues or a failure to manage withdrawals from two basins to effectively, 412618=In order to protect aquatic habitat, MassDEP has established that mandatory restrictions on non-essential outside water use be triggered either by a streamflow threshold or based on a calendar trigger. Restrictions will be required when stream flow falls below the US Fish and Wildlife's New England Base Flow (ABF) default value of 0.5 cubic feet per second square mile (cfsm)* for three consecutive days (*or other number based on site specific stream flow), or from May 1 through September 30., 394281=The WRC study indicates that approximately 5% or 393 square miles of drainage area is classified as \"high stress\" for stream flow conditions; 35% or 898 square miles are under \"medium stress\"; 27% or 2207 square miles are under \"low stress\"; and 32% or 2594 square miles of drainage area are un-assessed for flow conditions. While MassDEP knows the relative degree of flow stress for rivers within 68% of the state's drainage areas, we are not able to determine flow stress in 32% of the drainage areas using the WRC stress basin report. These basins cannot be assessed using the current gauge data of the WRC stressed basin report due to the limited number of gauges available for this study. No conclusions can be made about the degree of stress in these unassessed basins without further investigation. One recent investigation and report submittal of an unassessed area was performed for the Weir River in Weymouth, where WRC determination added the Weir River basin to the High Stress category., 162554=Targeted Source Identification Monitoring Program: The biggest gap in the monitoring program is addressing the number of impaired waters with unknown sources of contamination. This issue is highlighted several places, but none more telling than the 2004 Integrated List, which indicates that of the water bodies listed as impaired the sources of impairments are \"unknown\" for 96% of impaired lakes, 67% of impaired marine waters, and 36% of the impaired rivers. This data/information shortage has significant ramifications for the prevention of water quality degradation, control of pollution from nonpoint sources, and the restoration of degraded water quality. For these reasons, an increased effort in the \"targeted\" monitoring could, if successful, improve the results of the overall monitoring program, and would provide valuable input to those cleanup programs in which source identification is critical (e.g., TMDLs, NPS grants, SRF grants, and possibly permitting activities such as NPDES). For example, in the Blackstone Watershed alone ten river segments representing about 56.4 river miles fail to meet swimming standards because of bacterial contamination. Although monitoring has been useful in identifying these impairments MassDEP currently does not know what the sources of the contamination are and whether the sources are natural or due to human activities. A targeted approach would seek to identify and quantify the sources of contamination so corrective actions can be taken., 433410=Detailed Work Plans WMA staffing was increased in 2006 in 3 of the 4 regions by 1 FTE to conduct 5 -year compliance reviews, track compliance with new permit conditions, review ASRs annually, and initiate enforcement for those that fail to file ASR or exceed permit conditions., 427312=The above graph represents the fifteen (15) entities that MassDEP has confirmed have exceeded their authorized water withdrawal volumes and that are in violation of the Water Management Act. The graph also depicts the 55 entities that have not filed an annual report for withdrawal volume. Those fifty-five (55) are in violation of the Water Management Act for failing to file an annual report and may also be in violation for exceeding authorized permit volumes, but this cannot be determined because they did not file the report providing the necessary information. Of the fifty-Five (55) non-filers, twenty-nine (29) are cranberry bogs, eleven (11) are industrial users, three (3) are agricultural, five (5) are golf courses, and seven (7) are public water suppliers. Of the fifty-five non-filers, forty-one (41) of them are registrants who will need to address the failure to file and their failure to pay annual compliance fees at the time of registration renewal in FFY2008., 168484=Targeted \"source identification\" monitoring: As previously noted, the DWM has identified source monitoring as a key program element for continued enhancement in FY2008. In 2005, the DWM staff developed and implemented a targeted monitoring program to track down and identify bacterial sources in areas of the Blackstone and Sudbury watersheds. That program was expanded in FY06 and FY07 to include staff in two regional offices. For FY08, the focus has been placed on identifying bacterial sources near several beaches and segments that are presently on the state list of integrated waters. Although the results of that program have not yet been completely evaluated, DWM has already expanded that program to the northeast region of the state and will be participating on an EPA beach initiative in FY08. It is hoped that this program can be useful to follow up on the recommendations for recently completed bacterial TMDLs and to work in partnership with local watershed groups and municipalities to reduce or eliminate bacterial contamination across the state., 263039=eDEP: The program has invested considerable time and effort to develop electronic overflow reporting in an effort to collected this data electronically and thereby improve its ability to analyze the information to focus resources in an effort to eliminate chronic SSOs. This effort is continuing in Fiscal Year 2008 and will be expanded to include gathering data of sanitary sewer connections and extensions, 417708=Water Management Registrations: The WMA registration renewal process began in FFY2007 and approximately 160 cranberry registrations were renewed. MassDEP will be reviewing and issuing approximately 708 additional registrations in FFY2008, and initiating enforcement for those registrants not complying with their registrations or those not filing a renewal form. MassDEP is also evaluating including registration conditions that require the efficient use of our water resources. Considering registrations account for 85% of the water allocated, these actions could have a significant impact on the condition of water resources in Massachusetts., 313669=As of March 2003, stormwater (polluted runoff) discharges in almost seventy-five percent (250) of the communities in Massachusetts became regulated under EPA's National Pollutant Discharge Elimination System (NPDES). In accordance with the provisions of the Clean Water Act, as amended (33 U.S.C. s. 1251 et. seq.), operators of small municipal separate storm sewer systems will be required to meet six minimum stormwater control measures: (1) Public education and outreach; (2) Public involvement and participation; (3) Illicit discharge detection and elimination; (4) Construction site stormwater runoff control (5) Post construction stormwater management in new development and redevelopment; (6) Pollution prevention and good housekeeping in municipal operations. Because stormwater is the universal vehicle that transports a major portion of nonpoint source pollution to waters of the Commonwealth, tracking activities and enforcement of this new permit requirement is expected to result in significant improvements in water quality in the state., 167878=Detailed work plans Monitoring Program Development: Although the Statewide Monitoring Strategy was completed in December 2004, monitoring program design is an iterative process so discussions continue with EPA to make the Strategy more comprehensive in nature. Areas under discussion include wetland and marine monitoring. Results from those discussions and with financial support from EPA, MassDEP's wetlands program is in the process of developing a wetlands monitoring strategy ., 390026=How are we doing? MassDEP has initial stress condition information on 68% of Massachusetts' drainage basin areas. This data represents the drainage areas within Massachusetts where we have a relative measure of stress on rivers and streams as defined by the Water Resources Commission's Stressed Basin Report (WRC). Data from 72 gauges, mostly along main stems, was used by the WRC in the Stressed Basin Classification Report to designate hydrologic stress for river basins by comparing low flow statistics at gauged streams. The hydrologically stressed basins represent the rivers with the relatively lowest flows (per square mile of drainage area) in Massachusetts. The WRC Report indicates that approximately 5% or 407 square miles of drainage area is classified as \"high stress\" for stream flow conditions; 35% or 2898 square miles are under \"medium stress\"; 27% or 2207 square miles are under \"low stress\"; and 32% or 2580 square miles of drainage area are un-assessed for flow conditions., 424204=In early 2000, an evaluation of the facilities regulated by the Groundwater Discharge Permit Program demonstrated that over 80% of the facilities were out of compliance with one or more program requirements. In response to this finding, MassDEP adopted a Comprehensive Compliance and Enforcement Strategy in FY 2001. The first 3 years of the strategy, the significant noncompliance rate decreased to 23%. However, FY 2004 showed a slight increase in this percentage and FY 2005 & 2006 showed a greater increase in noncompliance with rates of 57.5% and 63.5% respectively. The reason for the increases is due to several factors, two of which are the transition of enforcement reviews and enforcement action issuance from Boston to the regional offices and the initiation of electronic reporting which allowed some leniency for missing DMRs. In FY 2007, the noncompliance rate was reduced to 47.8%. Cursory review shows that effluent violations continue to be the largest contributors to the noncompliance rate. Boston will continue to work with the regional offices in the effort to improve compliance., 338316=Massachusetts has taken action to drastically reduce local sources of mercury together with other Northeast states and Eastern Canadian Provinces. A workgroup developed the New England Governors and Eastern Canadian Premiers Mercury Action Plan  , which was unanimously adopted by the region's Governors and Canadian Premiers in June 1998 at the 23rd annual meeting of the Conference of New England Governors and Eastern Canadian Premiers. The Plan includes 45 specific elements in six action areas and explicitly calls for comprehensive actions to the problem that cross traditional media, programmatic, and political boundaries. It establishes a regional goal of virtually eliminating anthropogenic mercury releases. A fifty percent reduction target was achieved by 2003, and subsequently, a 75% reduction goal was established for 2010 and adopted by the Governors and Premiers by resolution. The plan establishes a regional task force for implementation; specifies strict emission limits for major sources that are considerably more stringent than federal requirements; supports pollution prevention efforts to reduce mercury use in products and increased collection and recycling of mercury-added products where environmentally preferable alternatives do not exist; directs state and provincial agencies to implement outreach and education programs about mercury and coordinate environmental monitoring efforts to track results; and calls for the retirement of the federal strategic mercury stockpile., 310643=Since 1998, the Department has consistently prioritized and targeted Section 319 Nonpoint Source Competitive grants projects that will implement structural best management practices to improve water quality. Over 75% of the Section 319 funds during the last five years (approximately $8.8 million) have been directed to projects that address nonpoint source water quality impairments. More specifically, Section 319 grants have been used as a funding source to implement Massachusetts Total Maximum Daily Load (TMDL) analyses, recommendations made in Diagnostic / Feasibility studies, and priorities of the former Massachusetts Watershed Initiative. The goal of this program is to identify and remediate nonpoint source water quality problems and reduce or eliminate water quality impairments., 144120=What's behind the numbers: Massachusetts has assessed 67% of the lake area, 9% of marine waters, and 26% of river miles in the State for one or more designated uses, as described in the Surface Water Quality Standards [Data from the Final 2004 Integrated List] (see below)., 212227=The 2004 Integrated List of Waters for Massachusetts identifies 511 surface water body segments (streams and estuaries) as impaired. Nutrients (phosphorus & nitrogen) and pathogens are the most prevalent causes of impairment. Based on a preliminary of GIS, there are 158 permitted point sources that discharge to or within 1/4 mile of an impaired water body.1 MassDEP has conducted an initial analysis of the data for nutrient controls [see CSO section below for analysis of pathogens.] The initial analysis is that 138 of the NPDES permits contain nutrient limits (71 permits contain water quality based limits for BOD/NH-3N, 67 permits contain nutrient controls, 3 have nitrogen limits, and all have phosphorus limits). This analysis suggests that a review of the prioritized permits, and an inclusion of nutrient controls, could have water quality benefits., 445962=© 2015 Commonwealth of Massachusetts. Mass.Gov® is a registered service mark of the Commonwealth of Massachusetts., 238637=1 This number includes only the major discharges on impaired segments identified in the 1998 list as neither the minor permits nor the more expansive 2004 Integrated Waters List is included in GIS yet. The actual number of discharges to impaired segments is therefore likely to be more than 158., 324261=1 Massachusetts Nonpoint Source Management Plan-Volume III (2001); Commonwealth of Massachusetts Summary of Water Quality (2000); Massachusetts Year 2004 Draft Integrated List of Waters, 239965=How are we doing? In 2007, there were 26 NPDES facilities out of 287 (9%) in Significant Noncompliance (SNC) with their permits compared to 32 of 289 in 2006 (11%), 29 of 292 in 2005 (10%), 23 of 324 in 2004 (7%) and 41 of 314 (13%) in 2003. Seventeen of these facilities violated monthly average effluent limits and nine violated other requirements such as non-monthly limits, report filings, compliance schedules and daily monitoring report (DMR) data omissions. Enforcement orders with compliance schedules have been issued or are pending for all seventeen that violated monthly average effluent limits. The effluent parameters most frequently triggering SNC at the 17 facilities were: biochemical oxygen demand (BOD), total suspended solids (TSS), copper (Cu), aluminum (Al), and total phosphorus (TP). A more detailed accounting of the specific violations is provided in the Surface Water Discharge Compliance Work Plan. Copper is the most frequently violated parameter, because many current NPDES permits have very stringent compliance limits for copper based on EPA national criteria that are difficult for most facilities to achieve, in many cases lower than is necessary to protect water quality. On January 11, 2007 revisions to the state water quality standards promulgated by MassDEP became effective pursuant to state law. The revised regulations included statewide site-specific copper criteria for 23 specific streams and stream segments. The adoption of the criteria replaced EPA's national criteria in determining NPDES permit limits for approximately 30 facilities. EPA/Region 1 approved the use of the site-specific copper criteria on March 26, 2007 as required under federal Clean Water Act. MassDEP is in the process of instituting the application of the new criteria as permits are proposed for renewal and through specific permit modification. The result will be more accurate toxicity limits for copper and less non-compliance while continuing to protect water quality without requiring unwarranted levels of investment by regulated entities in an attempt to achieve the limits. More troubling are the numbers of TSS and BOD violations associated with POTWs receiving more wastewater, as a result of excessive infiltration and inflow (I/I), than can be effectively managed. Discharge monitoring data from many POTWs indicate that mass loading limits for conventional pollutants such as BOD and TSS or percent removal criteria are being violated during wet weather events. Plans to address these violations are set forth in the work plan., 177462=Integrated List of Massachusetts Waters: The DWM submitted the Proposed 2006 Massachusetts Integrated List of Waters to the EPA on April 1, 2006 and initiated the public participation process at that same time. Completion of the report has been delayed due to the number of comments received and several data management issues. DWM anticipates the Final 2006 Integrated List will be submitted to EPA for approval in August 2007.With the hiring of a data management specialist, the DWM will partially implement the Assessment Database (ADB) during FY08 to make the process of translating the assessments into an integrated list more efficient. It is anticipated that \"full\" implementation will be possible in subsequent years once a plan is developed and implemented to migrate existing assessments into the new system. The DWM will also develop a new Integrated List by April 2008 for submittal to EPA for review and approval. The 2008 Integrated List will incorporate new assessment information from those watersheds for which new assessments have been completed since the 2006 Integrated List was developed. MassDEP will submit a public notice for comment on the proposed changes to the list prior to submittal to the EPA and provide an electronic update to the EPA upon receiving final approval of the list., 377914=4. Taunton River: Over the next several years MassDEP will begin data collection efforts to develop a nutrient TMDL for the Taunton River. MassDEP received funding to begin data collection activities and has entered into a contract with USGS to begin data collection next year. Presently, data collection is expected to occur during FY08 & FY09 to be followed by water quality modeling and TMDL development in FFY2010 & FFY2011., 396022=Maintaining Strong Performance The Massachusetts and Rhode Island stream gauge network includes 131 stream gauges maintained by the USGS in cooperation with funding provided by MassDEP, MA Department of Conservation and Recreation (DCR), U.S. Army Corps of Engineers, individual towns, regional water companies, and water pollution control entities. In 2006, the Executive Office of Energy and Environmental Affairs (EOEEA) contracted with USGS to establish and install approximately 30 new gauges along with additional funding for two years of operation and maintenance costs. The new gauges will deliver real time data via telemetry to the USGS web page. One year of operation and maintenance cost approximately $13,000 to $16,000 per gauge. MassDEP's cost share to operate and maintain the cooperative stream-gauging network in SFY2008 is $274,384., 227072=Stormwater: MassDEP will continue to review notices of intent and community stormwater management program plans, conduct site visits, and provide technical assistance. MassDEP will continue to take the lead on the issuance of the City of Worcester Phase 2 plan with the intent of issuing the permit during FY07. MassDEP will concentrate its efforts in FY2007 to revising the Stormwater Management Handbook., 256337=Copper: As stated above, in early 2007 MassDEP promulgated revisions to the state water quality standards that established site-specific copper criteria for 23 stream and stream segments to discontinue the use of EPA national copper criteria in developing individual permit limits. The EPA-approved site-specific criteria will result in permits that more accurately determine acceptable effluent concentrations that are protective of water quality and attainable with existing technology and proper operation and maintenance. Toxicity testing data will continue to be used to monitor for any toxic effects from heavy metals (including copper) or other pollutants., 328406=The first step toward restoring impaired waters is to know the cause of the impairment: e.g., whether the problem is low dissolved oxygen or high levels of nutrients. MassDEP's knowledge of causes is fairly good. The cause of problems is known in 100% of the 207 impaired marine segments, 100% of the 304 impaired lakes, and 86% of the 274 impaired river segments listed on the 2004 Integrated List., 363344=To support these efforts MassDEP redeveloped the Nonpoint Source Megamanual as the Clean Water Toolkit. The Clean Water Toolkit provides a complete resource for understanding and mitigating the effects of nonpoint source pollution. The original version was released in 1994. The new Clean Water Toolkit is available on the MassDEP website and as a CD. The electronic format affords access to a wealth of additional information through the use of hot links to outside resources. The Toolbox also provides a Best Management Practice Selector Tool, which will allow the user to select appropriate fact sheets and best management practices according to specific criteria or resource areas of concern., 136909=What's behind the numbers: In 2006, the Bureau of Resource Protection (BRP) promulgated revisions to the Massachusetts' surface water quality standards. Those changes have now been submitted to EPA for review and approval. In FY 2008, BRP will be working directly with EPA to obtain final approval of both the Surface Water Quality Standards and Antidegradation Implementation Procedures. BRP will also review policy changes resulting from the revised standards., 175104=Trend Monitoring: The Monitoring Strategy completed in FY2005 identified the need for a monitoring program element that would determine the amount of contaminants carried by major rivers at strategic locations and how they change over time (i.e., \"trend monitoring\"). Any commitment to assess trends also requires a long-term commitment in monitoring resources. The sampling approach suited to meet this need is a fixed-station monitoring regimen where the same sites are sampled repeatedly over time and over a range of hydrologic conditions. Repeated sampling over time generates data that are suitable for determining trends in water-quality conditions and, over the longer term, for determining trends in contaminant loads. Sampling would not be constrained by the watershed management cycle (i.e., restricted to one year in five) but would be conducted on a regular and continuous basis (e.g., monthly). The Monitoring Strategy estimated that two (2) new staff are needed for water-quality sample collection, with additional costs and staff time needed for field preparation, laboratory analyses, and data analysis and management. The DWM is seeking additional funding to begin to implement this new initiative as both an internal program element and through contractual services. It is anticipated that DWM staff assigned to the MassDEP regional offices may perform the fixed-site network sampling. Careful planning will be needed to develop and implement this program and this planning process will be initiated in FY08. If successful in obtaining funding the DWM will begin to implement a trend and load monitoring program over the next three years., 375889=1 Federal Fiscal Year Quarters (Q1: October-December; Q2: January - March; Q3: April - June; Q4: July-September), 427165=For calendar year 2006, ninety four percent (94%) of the WMA registrants/permit holders complied with annual reporting requirements., 243834=Copper remains the analyte causing the most SNC violations. Effluent copper limits are concentration based. The facilities in SNC are generally characterized by having a very low dilution factor (e.g. <1:2 @ 7Q10) resulting in effluent copper concentration limits of <0.010mg/L. EPA/Region 1 has issued generic administrative orders to almost all of these facilities to evaluate their ability to come into compliance with these very low concentrations. For most facilities the copper limits are very stringent, likely more stringent than necessary to protect water quality. MassDEP requires the facilities to monitor not just copper concentrations but also the toxicity of the discharge, and generally uses the toxicity standard for determining when action must be taken to improve discharge performance., 172123=Finally, some staff time will be set aside in this plan to accommodate unplanned for requests for monitoring assistance. New and emerging water quality problems and water emergencies, such as contamination from spills and bypasses, response to algal blooms, and/or monitoring to determine the extent of contamination from aerial mosquito spraying for the EEE virus are recent examples of an unforeseen need for monitoring support that was provided, in part, by the DWM. These issues necessitate environmental sampling that is not envisioned when the annual program plan is prepared. Some modest allowance for these contingencies in the FFY2008 monitoring plan is proposed., 263461=Industrial Pretreatment: Fifty POTWs are required to implement industrial pretreatment programs (IPP) in Massachusetts. In total, there are approximately 1700 indirect dischargers in the state, with approximately 600 of them located outside the MWRA service area. POTWs submit annual reports to MassDEP and EPA detailing their activities for the past year, including remedies for any noncompliance by any industrial users. Neither EPA nor MassDEP has mandated any new IPP programs for the past seven years, though growth and industrial development have occurred during that time that merit consideration of whether new IPPs are warranted. At present, neither MassDEP nor EPA conducts much oversight of the IPP implementation due to staffing constraints., 426306=Of the 938 entities with registrations and/or permits, only fifteen (15) entities exceeded their authorized withdrawal volumes, resulting in a 98.4 % compliance rate. In calendar year 2006, those that were over their permit or registration volumes is as follows:, 205536=What's behind the numbers: Massachusetts has different types of permits for discharges to surface waters. The major categories, with data current as of July 2006 are:, 352039=For bacteria the goal is to identify and eliminate the sources of bacteria to the waterbody. MassDEP has focused on developing and implementing field protocols to help isolate and define bacterial sources. A pilot study was conducted in FY2004 to develop field-sampling protocols necessary for tracking sources of bacteria on the Sudbury River in the Concord River watershed and Peters River in the Blackstone watershed. In FY05 MassDEP expanded this pilot to try to track bacteria sources at several beach areas in the Blackstone, Westfield, and Connecticut River Watersheds. The results of these studies confirmed that identifying specific bacterial sources is resource and time intensive but necessary to solve the problem. The results were also used to help local authorities find and repair dry weather discharges to swimming areas. Through these efforts it has become evident that an important component of bacteria source tracking is the ability to differentiate between human and non-human bacteria sources. MassDEP has taken two important steps to respond to these issues. First, MassDEP received a federal grant and is presently conducting studies with the MassDEP Wall Experiment Station and USGS in the Shawsheen River during FFY06-09, which is aimed at validating human marker DNA analyses and other source differentiation techniques that will improve bacteria source tracking techniques. Second, MassDEP pursued and received funding to hire regional monitoring coordinators in the West, Southeast, and Northeast Regions to conduct bacterial source monitoring as well as other activities. Staff have developed tracking plans for several watersheds that are impaired due to bacterial contamination. Additionally MassDEP is participating with EPA on its beach initiative in 2008 using the previously identified protocols., 285565=Pollution from groundwater discharges remains a significant problem for both groundwater and surface water quality. The 2004 Integrated List of Waters for Massachusetts identifies 1,097 surface water body segments as impaired while only 52% of the assessed state waters are known to fully meet designated uses. Nutrients and pathogens are the most significant cause of impairment. While the connection between the known impairments and ground water discharges needs to be further assessed, in many cases, wastewater discharges to the ground, particularly from septic systems, contribute to the impairment. Nutrient loading of many Massachusetts embayments and inland waters is approaching, or has exceeded, the limits of their ability to maintain ecological health. Critical ecological resources are at risk, including shellfish and finfish habitat, eelgrass beds, and the recreational value of the waters. Based on the data collected to date, it appears that the primary cause of these eutrophication problems for marine waters is an overabundance of nitrogen, and for inland waters, an overabundance of phosphorus discharged within the watersheds of these water bodies., 249287=During fiscal year 2007, basin schedule year two watersheds were targeted for inspection. MassDEP conducted a total of 112 compliance inspections of these facilities, and EPA conducted an additional 37 compliance inspections. Facility inspections are important for several reasons. First, periodic inspections (e.g. annual) remind the facility operator that both MassDEP and EPA consider proper operation and maintenance (O&M) of wastewater treatment facilities as key to protecting the public health and the environment. Second, sole reliance on DMR review does not provide a complete picture of the compliance status of the facility particularly in terms of routine operation and maintenance. Third, there are many permit conditions, such as the General Permit Conditions at 314 CMR 3.19, that address issues such as chemical storage, laboratory functions, emergency power testing, staffing and record keeping that are important to maintaining compliance. In conjunction with these conditions, compliance with MassDEP's O&M and Pretreatment Standards (314 CMR 12.00) can only be verified through a facility inspection. Fourth, inspector familiarity with both the facility and its operator supports the inspector in assisting the operator in maintaining compliance by providing technical assistance and guidance on permit matters, effectively responding to O&M problems/emergencies/violations at the facility and inquires/complaints from the public regarding a specific facility. Equally important is that the inspection process, when performed properly, is proactive in protecting the environment by identifying and requiring correction of conditions and events that, if ignored, may result in environmental harm., 170159=Additional monitoring will be started during FY08 for the development of TMDLs and/or for assessing the conditions following TMDL development. In FY08, MassDEP, with the assistance of the U.S. Geological Survey (USGS), will begin detailed monitoring activities in the Assabet, Blackstone, and Taunton River Watersheds. In FY06, MassDEP developed a nutrient TMDL for the Assabet River. The TMDL required large reductions of phosphorus from several public-owned treatment works (POTWs) and up to a 90% reduction in sediment in several impounded sections of the river. Key to the successful implementation of the TMDL is the ability to monitor the extent of phosphorus release from sediment and the amount of biomass produced within the system. The USGS project will allow data collection for an additional two years prior to new treatment being added to the POTWs in 2009., 306197=MassDEP's Nonpoint Source Management Plan sets forth an integrated strategy and identifies programs (including Section 319 Nonpoint Source Competitive Grants) to prevent, control and reduce pollution from nonpoint sources and protects and improves the quality of waters of the Commonwealth. The Clean Water Act, Section 319, specifies the contents of the Management Plan to ensure that the plan realistically addresses all of the major categories of nonpoint source pollution in the state (Volume III, The Statewide Plan and Its Goals). The Plan is an implementation strategy for best management practices with attention given to funding sources and a milestone schedule. The strategy was developed to provide a roadmap of implementation activities and tools available to address nonpoint source related problems. Implementation activities include regulatory enforcement, technical assistance, education, training, technology transfer, and pilot and full-scale projects. The plan was initially developed several years ago and was updated in FFY2007 to enhance opportunities to utilize State Revolving Fund (SRF) funds for implementation., 418372=Water Management Permitting: An analysis of past 5-year review performance indicates that MassDEP is not always completing reviews on schedule. This failure reflects the delays incurred as a result of on-going policy deliberations involved with the implementation of the 2004 Permitting Policy. Issuance of permit modifications in High and Medium Stressed basins were held throughout the deliberations of the Blue Ribbon Panel, and continue to be delayed as measures are evaluated to provide flexibility to those meeting the RGPCD Performance Standard and in the development of a Best Management Approach to offsetting increased withdrawal volumes., 187001=Nonpoint source (NPS) control grants: MassDEP funds nonpoint source mitigation projects aimed at reducing contamination of surface waters from sources such as urban run-off and stormwater through the Section 319 Nonpoint Source Competitive grant program. NPS grants continue to provide critical funding for implementation efforts such as the control of runoff from agricultural land and the design and construction of detention basins to control watershed and stormwater runoff. During FFY06 and FFY07 important improvements were made to the 319 grant program. First, MassDEP spent considerable time and effort to redevelop the former Nonpoint Source Megamanual now called the \"Clean Water Toolkit\". The Clean Water Toolkit provides a complete resource for understanding and mitigating the effects of nonpoint source pollution. The original version, also called the \"Megamanual,\" was released in 1994. The new Clean Water Toolkit is available through MassDEP's website and as a CD. The electronic format affords access to a wealth of additional information through the use of hot links to outside resources. The Toolkit also provides a Best Management Practice Selector Tool that allows the user to select appropriate fact sheets and best management practices according to specific criteria or resource areas of concern., 244659=On January 11, 2007 revisions to the state water quality standards promulgated by MassDEP became effective pursuant to state law. The revised regulations included statewide site-specific copper criteria for 23 specific streams and stream segments. The adoption of the criteria replaced EPA's national criteria in determining NPDES permit limits for approximately 30 facilities. EPA/Region 1 approved the use of the site-specific copper criteria on March 26, 2007 as required under the federal Clean Water Act. MassDEP is in the process of instituting the new criteria as permits are proposed for renewal and through individual permit modification. The result will be more accurate toxicity limits for copper and increased compliance while continuing to protect water quality., 242604=What's behind the numbers: The U.S. EPA's Significant Non-Compliance (SNC) report lists the facilities that do not meet the compliance thresholds set by EPA. The SNC list is generated quarterly by EPA based on data submitted by the permit holders. In general the criteria for inclusion on the list is a permit limit exceedance over a specified threshold for the same parameter any time in two consecutive quarters. In 2007, of the 287 permitted major and minor discharges (not general permits), there were a total of twenty-six (26) NPDES permitted facilities in Significant Non-Compliance: nineteen (19) for monthly average effluent limit violations and thirteen (13) for other violations such as non-monthly limits, report filings, compliance schedules and discharge monitoring reports (DMR) data omissions. Municipal and institutional facilities account for seventeen (17) of the facilities in SNC; the remaining facility was an industrial source and not reported in SNC for effluent violations. The effluent parameters most frequently triggering SNC at the seventeen (17) facilities are presented below. Detailed compliance information is also available on EPA's web site., 269184=What's behind the numbers: In early 2000, an evaluation of the facilities regulated by the Groundwater Discharge Permit Program demonstrated that over 80% of the facilities were out of compliance with one or more program requirements. In response to this finding, MassDEP adopted a Comprehensive Compliance and Enforcement Strategy (CCS) in Fiscal Year 2001. The CCS established thresholds for significant noncompliance (SNC), resulting in the timely issuance of Notices of Noncompliance (NONs) for these SNC violations and establishing consistent monthly reviews of Discharge Monitoring Report (DMR) data. The four requirements deemed as surrogate measures for environmental benefits were: DMR submittal, timely renewal application submittal, groundwater quality standard violations as evidenced by monitoring well results, and permit effluent limitations. For the first 3 years of the strategy, the significant noncompliance rate decreased to 23%. However, FY 2004 showed a slight increase in this percentage and FY 2005 & 2006 showed a greater increase in noncompliance with rates of 57.5% and 63.5% respectively. The reason for the increases was due to several factors, two of which are the transition of enforcement reviews and enforcement action issuance from Boston to the regional offices and the initiation of electronic reporting which allowed some leniency for missing DMRs. In FY 2007, the noncompliance rate was reduced to 47.8%. Review of the four compliance measures shows that effluent violations and missing DMR violations, typically the largest contributors to the noncompliance rate, showed significant reductions from the past two years while the other measures were relatively unchanged., 267983=How are we doing? In early 2000, an evaluation of the facilities regulated by the Groundwater Discharge Permit Program demonstrated that over 80% of the facilities were out of compliance with one or more program requirements. In response to this finding, MassDEP adopted a Comprehensive Compliance and Enforcement Strategy in FY 2001. The first 3 years of the strategy, the significant noncompliance rate decreased to 23%. However, FY 2004 showed a slight increase in this percentage and FY 2005 & 2006 showed a greater increase in noncompliance with rates of 57.5% and 63.5% respectively. The reason for the increases is due to several factors, two of which are the transition of enforcement reviews and enforcement action issuance from Boston to the regional offices and the initiation of electronic reporting which allowed some leniency for missing DMRs. In FY 2007, the noncompliance rate was reduced to 47.8%. Cursory review shows that effluent violations continue to be the largest contributors to the noncompliance rate. Boston will continue to work with the regional offices in the effort to improve compliance., 246112=In 2003, EPA piloted a new system called the \"Watch List\". Region 1 - New England was selected to participate. Essentially, the list consists of facilities that meet specific criteria indicating that they are reporting chronic violations on the monthly DMR that are not serious enough to trigger a SNC but may be a concern if the trend continues. The intent is to be proactive in heading off environmental impacts by identifying facilities for consultation or inspection to correct the problem before it is in SNC. EPA instituted the Watch List nationally on January 1, 2004., 272598=Maintaining Strong Performance Upon its inception, the Groundwater CCS had a positive effect on reducing the percent of significant non-compliance (SNC) program wide. The most pronounced success has been the near elimination of the administrative violations of discharge monitoring report (DMR) submittal and renewal application submittal. There has been a spike in violations in FY 2005 and 2006, due to the initial implementation of electronic reporting but that was considered to be temporary until permittees gain more experience with the reporting format. This was borne out in the reduction in overall violations in FY 2007. However, due to difficulties that permittee's experienced with using electronic reporting, MassDEP will be coordinating with the information technology office (ITO) staff to make uploading the information easier. Past program history indicates that in order to maintain such a high level of compliance with administrative requirements and continue to decrease the percent SNC with other permit program violations, the program must continue implementing the Groundwater CCS. In the beginning BRP Boston staff implemented the CCS. However, the strategy called for the transition of the groundwater CCS to the regions and, as the number of permits continues to increase statewide, regional implementation becomes more of a necessity. Of critical importance to transitioning this program from Boston to the regions and maintaining the CCSs strong performance will be the enhancement of the groundwater data system and the implementation/enhancement of electronic reporting. The program began the transition to electronic reporting in July 2004. Electronic methods of reporting for permittees and improved tracking and analysis tools for regional staff were developed to allow efficient and timely review of compliance data., 253487=Improving Results NPDES Point Source Permits: In the past, each region has informally developed inspection schedules with EPA. Last year, a formal plan was implemented. MassDEP and EPA will continue under the formal plan that was implemented last year to ensure that inspection resources are directed to the highest priority problems. MassDEP's enforcement and compliance efforts will be focused on the most significant water quality challenges, rather than proceeding on a strict basin schedule. The program will select compliance work according to significant threats to public health and/or the environment, as well as priority water resource needs based on our knowledge of impaired waters rather than simply inspecting all Basin Schedule Year 2 facilities. During Federal Fiscal Year 2008, in addition to inspecting Basin schedule Year 2 facilities, facilities discharging to impaired water bodies will be targeted, particularly those discharging to the Taunton, Ten Mile, and Blackstone Basins, as part of the nitrogen loading evaluation to Mount Hope Bay and Narragansett Bay, regardless of Basin schedule year. MassDEP will complete a comprehensive evaluation of nutrient removal capabilities and options at 22 permitted facilities in the Ten Mile, Blackstone, and Connecticut River basins in the fall of 2007. The inspections will assist MassDEP in developing a point source nutrient loading reduction and implementation plan to address impacts to the bays. Other facilities discharging to other surface waters that are impaired for nutrients or bacteria will also be targeted where the DMR review indicates high levels of nutrients or bacteria are discharged., 313187=The MassDEP's State Revolving Fund (SRF) is available to help fund projects designed to control stormwater runoff. MassDEP anticipates this vehicle will increasingly be used for such projects under the Stormwater Phase II requirements. In FFY2007, the Massachusetts Nonpoint Source Management Plan was amended to facilitate the use of these funds., 202677=How are we doing? The 2004 Integrated List of Waters for Massachusetts identifies 1,097 surface water body segments as impaired of which 302 and 209 are river segments and estuaries, respectively. Nutrients and pathogens are the most prevalent causes of impairment. A preliminary analysis of the data indicates that at least 158 of NPDES/BRP permits authorize discharges to waters known to be impaired. This suggests the need to investigate further but does not by itself demonstrate that those permits are causing the water quality problem; many other factors contribute to water quality impairment, including nonpoint sources and physical alterations. All BRP permits contain bacteria limits. With respect to nutrients, only 75 of the 157 permits include limits, which are known to be a significant cause of water quality problems in many water bodies. As is true of discharges to impaired waters, this alone does not demonstrate that the permit is not protective; the discharge may not contain excessive amounts of nutrients and/or the water body to which it discharges may not have nutrient problems. Further investigation is needed to determine which permits require tighter limits., 172810=Assessment Monitoring: The DWM biologists and monitoring coordinators will develop QAPPs for assessment monitoring using benthic macroinvertebrate RBP methodologies, habitat assessment, fish community analysis, nuisance algae assessment and water quality sampling. In addition, biologists will continue to develop and evaluate methods for assessing larger rivers, lakes and other wetlands. The DWM is seeking additional funding for one full-time staff biologist to add to the biomonitoring staff in FY2008 to support ongoing biomonitoring activities and methods development. The DWM will continue to focus on both unassessed and previously assessed waters when possible. Additionally, the DWM will continue to support the Interagency Committee on Toxics in Fish by performing fish toxics monitoring in accordance with the rotating watershed schedule and in response to public requests. Finally, the DWM will continue to automate data collection by expanding its capacity to collect continuous dissolved oxygen data through the deployment of unattended, multi-parameter probes. Assessment monitoring will continue to be performed in accordance with the DWM's five-year, rotating, watershed schedule, as presented in the table below. It should be noted that presently DWM has three vacant monitoring positions. DWM has requested and will continue to request that these positions be considered a high priority for backfilling., 301583=Approximately 70% of all impaired segments in the Commonwealth are impaired because of excessive nutrients or bacterial contamination. Nutrient and bacterial contamination from non-point sources alone, such as stormwater runoff and surface runoff from the land affect approximately half of the segments listed as impaired.1 The major categories of nonpoint source pollution by waterbody are summarized in the following table, based on the MassDEP's initial 1988/1989 Nonpoint Source Assessment of problem areas. The NPS Assessment was compiled from a statewide municipal survey, which reported a 40% response rate, and from assessment information provided in the 1988 305(b) report. In 1988, a total of 1,550 river miles, 22,016 lake acres, and 182 square miles of marine waters were assessed statewide. The evaluation concluded that of these assessed waters, approximately 1,066 river miles (69%), 22,016 lake acres (100%), and 127 square miles of marine waters (70%) were impacted by non-point sources. The summary table provides a breakdown of the 1988 Assessment showing the estimated percentage of the assessed waters for each non-point source category., 425365=What's behind the numbers: The majority of registered and permitted users complied with authorized withdrawal limits in 2006; only 1.6 % exceeded their authorized volume, a reduction from the 2% that exceeded in 2005. Although these are good statistics, we note that it reflects compliance by entities with existing registrations and permits, and does not include any withdrawers who exceed the Water Management Act (WMA) permitting threshold but do not have a permit or registration., 311451=In October of 2003, EPA issued guidelines that include a requirement for watershed-based plans as a prerequisite for using 319 supplemental funds for implementation projects, Nonpoint Source Program and Grants Guidelines for States and Territories. The purpose of these plans is to provide guidance and assistance in determining the potential nonpoint sources where water quality impairments have been identified. To comply with EPA's requirement, in the spring of 2005 MassDEP contracted with a consultant for the development of a Watershed-Based Plan (WBP) for all Massachusetts's watersheds. The WBP has been finalized and is consistent with the nine elements of a watershed-based plan as outlined by EPA in the Guidelines including the following:, 440109=Flow data and historical comparisons are only available on streams with USGS stream gauging stations, which currently number about 131 in MA & RI on larger, perennial streams and rivers. There is little data available on smaller streams that may be affected by low stream flow. To obtain a more accurate assessment of changes to stream flow and basin-wide flow restoration, EOEEA has contracted with USGS to establish and install approximately 30 new gauges in 2006 & 2007. Approximately 20 of these new gauges have been installed to date., 209984=The Environmental Protection Agency (EPA) has a significant backlog of permit applications that have not been acted upon. As of July 2007 there were 197 facilities that have applied for permits and not yet received them. Of them, 112 are facilities seeking permits for groundwater remediation, many of which may be covered the new general permit from EPA. These discharges are allowed pursuant to the emergency exclusion provisions of the regulations. The remaining 85 facilities with pending permit applications are minor dischargers with expired permits and are counted above in the tally of existing permittees. EPA has taken steps to reduce this permitting backlog by increasing the number of staff available to write these permits. The prior permits are administratively continued pending renewal. In addition to the groundwater remediation general permit, EPA has issued new general permits for small publicly owned sewage treatment plants and for incidental process waste streams at hydroelectric generating facilities. Qualifying facilities that have outstanding applications for individual permits or those that have minor permits will be granted coverage under the general permits where appropriate. This is expected to further reduce the backlog of unissued permits., 300993=The Massachusetts 2004 Integrated List of Waters lists approximately 848 impaired water body segments due to a pollutant. Although point sources have significant impacts in some watersheds, nonpoint sources are emerging as the leading cause of water quality problems in Massachusetts. Nonpoint sources are likely the primary source of pollution for our lakes and coastal areas, which together account for approximately 66% of the impaired water segments. Rivers, which account for about 34% of the impaired waters, are affected by a combination of point and nonpoint sources., 255193=Inspection Prioritization: The 2008 inspection schedule will be based upon review of the following: Basin schedule Year 2 facilities (Charles, North Coastal, Ten Mile, Housatonic and Hudson); wet weather SSOs municipalities; EPA's 2008 NPDES re-issuance list and the remainder of the 2008 list [inspect facility prior to permit re-issuance]. Watch and SNC lists will be reviewed quarterly and inspection of facilities on the list for violations other than copper or reporting failures will be conducted in addition to facilities which have violated due to excessive flows and other regional office priorities. A meeting of the program manager and the regional offices will be held to discuss the inspection plan and develop a final plan for submittal to EPA., 379796=In order to protect aquatic habitats, MassDEP has provided water suppliers the option of implementing mandatory restrictions on non-essential outside water use triggered by either an interim streamflow threshold, or based on the calendar year (May 1 - September 30th). Those water suppliers who choose to implement non-essential outside water restrictions triggered by streamflow will be required to do so when stream flow falls below the US Fish and Wildlife's New England Base Flow (ABF) default value of 0.5 cubic feet per second square mile (CFSM) for three consecutive days unless a site-specific study has established a more detailed flow statistic. Water suppliers can check real time data on stream flows at the nearest gauge at the USGS website at http://waterdata.usgs.gov/nwis/., 287302=eDEP: The groundwater program has invested considerable time and effort developing electronic Discharge Monitoring Reports in an effort to increase the amount of data collected to improve its ability to analyze the performance of permitted facilities. This effort is continuing in FY 2008 and may be expanded to include monitoring data received on Title 5 Innovative/Alternative systems (I/A). This potential expansion will greatly enhance the program's ability to assess compliance with permit limits., 385993=Until flow targets are established, MassDEP is using either an interim streamflow threshold that triggers mandatory restrictions on non-essential outside water use, or requiring the implementation of restrictions seasonally from May 1 - September 30. For those choosing to implement restrictions based on streamflow, restrictions will be required when stream flow falls below the US Fish and Wildlife's New England Base Flow (ABF) default value of 0.5 cubic feet per second square mile (CFSM) for three consecutive days unless a site-specific study has established a more detailed flow statistic. This interim threshold is necessary to protect aquatic habitat while more specific protective flow targets are being developed., 413129=The new WMA policy will require conditions be placed on all new permits and on existing permits during the 5-year reviews to control seasonal demand, and limit unaccounted for water and Residential Gallons Per Capita Day (RGPCD). A revised guidance document outlining the implementation of the policy was issued in January 2006. The revisions to the guidance reflected the input provided by a focus group that convened in May 2005 to evaluate the policy and its implementation., 328820=The data (2004 Integrated List) on causes of impairments in assessed waters overwhelmingly indicates that the major causes of impairment are excess nutrients and pathogens. As can be seen in Figure 1 below the biggest single cause of impairment is pathogens, which has been identified as a problem in roughly 24% of the assessed waters. Nutrient impairment and its secondary effects such as low dissolved oxygen, noxious aquatic plants, and turbidity have been identified as the cause of impairment in approximately 46% of the Commonwealth's assessed waters. Combined, these two causes account for roughly 70% of the impairments in Massachusetts., 142954=In 2004 MassDEP conducted a needs analysis and developed a \"Water Quality Monitoring Strategy for the Commonwealth of Massachusetts \". The Plan discussed and evaluated different types of monitoring needed to fill important information gaps and identified resource gaps and monitoring priorities. The Strategy is being used to help support the need for additional monitoring personnel. Recent accomplishments have included hiring regional monitoring coordinators in three (3) of MassDEP's regional offices, and implementation of a program to begin development of a monitoring protocol for wetlands assessment made possible with EPA funding. However more needs to be done. The goal is to address the gaps within 10 years. MassDEP does not currently have any comprehensive data on the condition of the state's groundwaters, although there is data on a number of individual locations. Gathering this data to see what picture it presents of the state's groundwater quality is something MassDEP needs to do as resources become available., 260058=As a result, MassDEP in concert with the other New England states and EPA Region 1, has initiated a formal study through the NEIWPCC to update the POTW staffing guidance. A New England workgroup of state regulators, operators, design engineers, and equipment manufacturer representatives has also been established to oversee and review the study. Preliminary report recommendations are currently being discussed and piloted with operators at selected municipal facilities. The ground-truthing phase should be completed by September 2007., 252744=EPA and MassDEP targeted 16 communities for detailed evaluation and resolution of SSO issues in 2006 and 2007. Through the use of enforceable information requests to selected communities, the agencies are evaluating the efficacy of each community's implementation plan for preventing and minimizing SSO events. Many communities, including Worcester, Fitchburg, Holyoke, Chicopee and Taunton, are at various stages of implementing multi-million dollar treatment facility and collection system improvements to address wet weather issues. EPA and MassDEP will continue to monitor existing SSO reduction projects and identify those communities that need to dedicate more effort and resources to reduce SSO events in a timely manner., 171044=In addition to the Assabet River, additional targeted monitoring activities will be conducted on both the Blackstone and Taunton River systems. In the Blackstone, several questions need to be answered such as: 1) what is the amount or load of nitrogen and selected metals leaving MA into Rhode Island; 2) what is the extent of nitrogen attenuation associated with the discharge of the Upper Blackstone Water Pollution Abatement District; and 3) what is the extent of nutrient and metals re-suspension in major impoundments on the river? Each of these questions will be studied and answered in projects that began in FY07 and will extend through FY09. Monitoring of the Taunton River system will begin with the goal of establishing a nutrient TMDL in the future. As of August 2007, a preliminary monitoring plan has been developed by USGS and is being discussed with MassDEP. It is anticipated that monitoring will commence in FY08 at a number of locations and will extend for a minimum of one year (through 2009) with subsequent modeling and TMDL development., 296768=1 The data regarding Title 5 large systems is not current. One of the workplan priorities discussed below is updating our information about large Title 5 systems. 2 This information is based on the 1998 List of Impaired Waters. The actual number of discharges near impaired waters may in fact be higher using the newer Integrated Waters List., 164837=The DWM staff presently assists volunteer groups by reviewing Quality Assurance Project Plans (QAPPs) where data are intended to supplement regulatory efforts. However, while the collection of the data is lower cost, MassDEP needs to provide staff for data management, expanded QAPP review, and possibly, the training of volunteer staff (if the training was not assumed by another agency or office within EOEEA). These staffing needs have been included in the Statewide Monitoring Strategy. The first place MassDEP will focus on to increase use of volunteer monitoring programs will be stream team surveys and bacteria source identification. These data will be used to continue development of statewide bacterial TMDLs during FY08 and beyond both on inland and coastal waters. The 2004 Integrated List includes approximately 195 coastal segments not meeting designated uses because of pathogens. Volunteer monitoring to identify sources of pathogens in rivers is also a very high priority because there are 173 segments listed for pathogens in the 2004 Integrated List. Finally, the Statewide Monitoring Strategy has identified the need for one full time position to work directly with volunteer monitoring groups to address the highest priority water quality problems., 222286=Summary of toxics discharged to Massachusetts POTW for the years 1998-2002 (2002 is the most recent year for which data are available). Data are from the Toxics Release Inventory and are reported here as tons per year., 340161=Massachusetts and other New England States and the Eastern Canadian Provinces are doing their part to address local sources of mercury. As these actions are implemented, it becomes increasingly apparent that further progress requires reductions of mercury from out-of-region atmospheric sources. In the MassDEP 2004 and 2006 integrated list process, MassDEP proposed to move about 90 waters impaired solely by atmospheric mercury to category 4b of the integrated list. MassDEP believed this request was justified because of the aggressive stance in addressing in-state and in-region sources. Limited resources could then be used to implement solutions rather than developing a TMDL. Secondly, MassDEP believed there was little point in spending time developing clean up plans for water bodies impaired solely by air deposition of mercury originating outside of Massachusetts due to the lack of authority in implementing the needed reductions in air emissions of mercury from out of state. Recently, EPA has denied the request and as a result during FY07 MassDEP has worked cooperatively with the other New England States and the State of New York to develop a Regional Mercury TMDL for submittal to EPA. As of July 2007 a Draft TMDL has been developed and received public comment throughout the northeast. The Northeast States are now developing a response to comment document and revising the TMDL with the goal of submitting it to EPA in early in FY08., 419912=Work Load Projected Work Load by Region and Basin FY 2008, 231643=eDEP: The program has invested considerable time and effort in developing electronic DMR reporting in an attempt to collect this data electronically and improve its ability to analyze the information and focus its resources to eliminating chronic SSOs. This effort is continuing in fiscal year 2008 and will be expanded to include gathering data of sanitary sewer connections and extensions. By reinforcing the reporting requirements and the consequences associated with non-compliance, the desired result will be an increase of reporting and the accuracy of the information supplied. In addition, MassDEP will be able to focus its resources on the serious violators., 376868=2. Nutrient Criteria Development: In addition to the above, MassDEP will continue development of nutrient criteria for lakes and rivers. This will involve finalizing contracts with USGS, collecting data where needed, evaluating data and synthesizing the information to establish the criteria. A public hearing will be necessary to incorporate these criteria into the Massachusetts Water Quality Standards. It is anticipated that this will take place during the 2008 work year.}",
    "textBeforeTable": "The following table presents the % of each waterbody type that fully meets the referenced designated use. Waters that are assessed are evaluated against the Surface Water Quality Standards for relevant designated uses and ranked as to whether they support those uses or not. For the assessed waters and uses, that evaluation is described here. The present data on marine waters are primarily bacteria data collected by the Division of Marine Fisheries for shellfish bed safety, although a significant amount of data have been collected over the last several years to assess the condition of estuaries in Southeastern MA as part of the Massachusetts Estuaries Project (MEP). Although the percentage of river miles assessed is low, historically there are targeted assessment resources for larger rivers and streams, which are expected to be more likely impacted by pollution sources. While MassDEP cannot say definitively that the unassessed rivers and streams are better quality than the waters we do assess, we focus our monitoring on waters expected to be of poorer quality. Over the last few years a conscious effort has been made to assess waters previously not evaluated. The relatively high percentage of lakes assessed reflects the generally rapid approach (synoptic surveys) of assessment used for lakes. Synoptic surveys are screening level surveys conducted during one day to determine the overall condition of the waterbody. Uses that are assessed include recreational uses such as primary contact recreation (swimming) and secondary contact recreation (boating, fishing, etc.), aquatic life support (survival",
    "textAfterTable": "The Environmental Protection Agency (EPA) has a significant backlog of permit applications that have not been acted upon. As of July 2007 there were 197 facilities that have applied for permits and not yet received them. Of them, 112 are facilities seeking permits for groundwater remediation, many of which may be covered the new general permit from EPA. These discharges are allowed pursuant to the emergency exclusion provisions of the regulations. The remaining 85 facilities with pending permit applications are minor dischargers with expired permits and are counted above in the tally of existing permittees. EPA has taken steps to reduce this permitting backlog by increasing the number of staff available to write these permits. The prior permits are administratively continued pending renewal. In addition to the groundwater remediation general permit, EPA has issued new general permits for small publicly owned sewage treatment plants and for incidental process waste streams at hydroelectric generating facilities. Qualifying facilities that have outstanding applications for individual permits or those that have minor permits will be granted coverage under the general permits where appropriate. This is expected to further reduce the backlog of unissued permits. The data for each category is described below. NPDES point source permits: Massachusetts is not a delegated state under the federal Clean Water Act, so EPA is the entity responsible for issuing NPDES permits to facilities located in Massachusetts. MassDEP has its own permitting authority and therefore issues joint discharge permits with EPA to draft permits. NPDES permits",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}