{
    "relation": [
        [
            "Pos.",
            "1.",
            "2.",
            "3.",
            "4.",
            "5.",
            "6.",
            "7.",
            "8.",
            "9.",
            "10."
        ],
        [
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            ""
        ],
        [
            "Driver",
            "L. Hamilton",
            "N. Rosberg",
            "F. Alonso",
            "N. Hulkenberg",
            "J. Button",
            "K. Raikkonen",
            "K. Magnussen",
            "D. Kvyat",
            "S. Perez",
            "S. Vettel"
        ],
        [
            "Team",
            "Mercedes",
            "Mercedes",
            "Ferrari",
            "Force India",
            "McLaren",
            "Ferrari",
            "McLaren",
            "Toro Rosso",
            "Force India",
            "Red Bull"
        ],
        [
            "Time",
            "01:37.502",
            "01:37.733",
            "01:37.953",
            "01:38.122",
            "01:38.636",
            "01:38.783",
            "01:38.949",
            "01:39.056",
            "01:39.102",
            "01:39.389"
        ]
    ],
    "pageTitle": "Hamilton quickest in opening Sakhir practice - GPUpdate.net",
    "title": "",
    "url": "http://www.gpupdate.net/en/f1-news/308780/hamilton-quickest-in-opening-sakhir-practice/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 2,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988511.77/warc/CC-MAIN-20150728002308-00128-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 484999179,
    "recordOffset": 484978455,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{16814=GP2 and GP3 organisers have confirmed that Bahrain has been added to the 2015 calendar. Organisers had been working towards a…, 30688=Haas F1 owner, Gene Haas, discusses how his team is progressing ahead of its planned 2016 entry., 21957=Monza has a \"90 per cent\" chance of remaining on the Formula 1 calendar beyond 2016, according to Roberto Maroni, the President…, 50636=GPUpdate.net, the daily motorsport news website which is celebrating over a decade of the latest in Formula 1, publicly dates back to 1998. Founded as F1Racing.net, the online magazine is part of JHED Media BV, a registered company operating out of The Netherlands., 19854=Sebastian Vettel has not ruled out fighting for the 2015 world title after notching up his and Ferrari's second victory of the…, 1558=4 April 2014 – Lewis Hamilton set the pace during the first practice session for the Bahrain Grand Prix on Friday afternoon. Fresh from victory in Malaysia, the Mercedes driver clocked a time of 1:37.502 to lead team-mate Nico Rosberg by 0.231 seconds, while Ferrari's Fernando Alonso completed the top three positions. Although the Sakhir circuit, celebrating its 10th anniversary, will is staging a Formula 1 night race for the first time, opening practice took place in daylight, with the floodlights not being switched on until FP2. Hamilton and Rosberg looked on course to claim the top two positions from the off, having comfortably topped the timesheets at the end of the opening 30 minutes, when Pirelli's extra set of Prime tyres were available. Long spells in the Mercedes garage allowed Alonso and Nico Hülkenberg to move ahead in the closing stages, but the pair re-emerged to restore their one-two and send out a clear message to the rest of the field. Alonso was the final man to break the 1m38s barrier, but he endured one of the most embarrassing moments of 2014 when Ferrari sent him out with one Soft and three Medium tyres, forcing the Spaniard to stop in the pits. Hülkenberg delivered another impressive display in the Force India to finish fourth, well clear of the closely-matched pack of Jenson Button, Kimi Räikkönen, Kevin Magnussen, Daniil Kvyat and Sergio Pérez. Reigning World Champion Sebastian Vettel experienced a quiet opening session, rounding out the top ten positions for Red Bull. New team-mate Daniel Ricciardo was just over a second adrift in 14th place. Three reserve drivers made their first appearances of the season in the session. Williams reserve Felipe Nasr wound up 13th, two places behind regular driver Felipe Massa, Sauber's Giedo van der Garde finished 18th, three spots down on Adrian Sutil, while Robin Frijns beat Marcus Ericsson as Caterham brought up the rear. Second practice at the Bahrain International Circuit gets underway at 6pm local time (GMT +3)}",
    "textBeforeTable": "first free practice results 2014 Bahrain Formula 1 Grand Prix Photos } display: inline !important; #mc_embed_signup input { #mc_embed_signup form { padding: 10px 0 0; margin: 0; } #mc_embed_signup { background:#fff;font:14px Helvetica,Arial,sans-serif; width:316px; padding: 0 10px }",
    "textAfterTable": "Full results Related news articles Mercedes Grand Prix 30 Jul Wolff: Mercedes will overcome poor starts 30 Jul Häkkinen: Vettel a danger to Mercedes 30 Jul Video of the Day: Sound of painting an F1 car 27 Jul Wolff: Rushed stop cost Rosberg victory 27 Jul Video: Rosberg's Hungaroring blog Lewis Hamilton 27 Jul Hamilton among drivers given penalty points 26 Jul Hamilton laments 'really bad performance' 25 Jul Hamilton revels in 'one of the best' weekends 25 Jul Hamilton takes comfortable Hungary pole 25 Jul Hamilton completes practice clean sweep Formula 1 1 Aug Video of the Day: Button's golden boots 31 Jul",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}