{
    "relation": [
        [
            "Nafn",
            "Table of Legislation.pdf",
            "Table of Cases.pdf",
            "Niðurstaða.pdf",
            "Inngangur.pdf",
            "Efnisyfirlit.pdf",
            "Bibliography.pdf",
            "Heildartexti.pdf"
        ],
        [
            "Stærð",
            "25,3KB",
            "32,9KB",
            "42,1KB",
            "55,1KB",
            "75,4KB",
            "84,5KB",
            "742KB"
        ],
        [
            "Aðgangur",
            "Opinn",
            "Opinn",
            "Opinn",
            "Opinn",
            "Opinn",
            "Opinn",
            "Lokaður"
        ],
        [
            "Lýsing",
            "Lagaskrá",
            "Dómaskrá",
            "Lokaorð",
            "Inngangur",
            "Efnisyfirlit",
            "Heimildaskrá",
            "Heildartexti"
        ],
        [
            "Skráartegund",
            "PDF",
            "PDF",
            "PDF",
            "PDF",
            "PDF",
            "PDF",
            "PDF"
        ],
        [
            "",
            "Skoða/Opna",
            "Skoða/Opna",
            "Skoða/Opna",
            "Skoða/Opna",
            "Skoða/Opna",
            "Skoða/Opna",
            ""
        ]
    ],
    "pageTitle": "Lokaverkefni: \"Free movement of patients in the EU/EEA. The everlasting search for legal certainty\" eftir Sólveig Ingadóttir 1984 [2010] | Skemman",
    "title": "",
    "url": "http://skemman.is/item/view/1946/4888%3Bjsessionid=DCC2485726AAA3A070189FACF59C369D",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 0,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986022.41/warc/CC-MAIN-20150728002306-00019-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 227272485,
    "recordOffset": 227264283,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{6111=Vinsamlegast notið þetta auðkenni þegar þið vitnið til verksins eða tengið í það: http://hdl.handle.net/1946/4888}",
    "textBeforeTable": "Skrár http://hdl.handle.net/1946/4888 URI 3.5.2010 Birting The subject of the paper is the current status of the free movement of patients in the EU/EEA, in particular the financial coverage in cross-border health care and how it is evolving. Both existing and the proposed framework currently under negotiations on EU level, the relevant case law of the Court of Justice and the EFTA Court as well as sources of academic literature are reviewed. The interest of European Union in social security matters, in particular health care services are examined as well as it is established who has the competence to regulate such matters. Traditionally cross-border health care on the cost of the home Member State has been seen as a privilege granted by the competent institution, through a scheme of prior authorisation, only to be granted under certain circumstances. The case-law of the Court of Justice however suggests that reimbursement of cost incurred for cross-border treatment is a Treaty based right of every Union citizen, only to be limited through measures which are justifiable and based on objective, non-discriminatory and proportionate criteria. The Court has established that the Member States’ public health care systems do without a doubt fall within the scope of the internal market provisions, in particular the principle of free movement of services and",
    "textAfterTable": "Öll gögn í Skemmunni eru vernduð af ákvæðum höfundalaga og með öllum réttindum áskildum, nema annað sé tekið fram.   Vefhringur Landsbókasafns Íslands - Háskólabókasafns Stafrænar endurgerðir Tímarit.is Dagblöð og tímarit frá Færeyjum, Grænlandi og Íslandi Handrit.is Samskrá íslenskra handrita með mynduðum eintökum Bækur.is Stafræn endurgerð gamalla íslenskra bóka Íslandskort.is Myndir af gömlum Íslandskortum og ágrip af kortasögu Gagnasöfn Skemman Safn námsritgerða og rannsóknarita Rafhlaðan Rafrænt varðveislusafn Íslenska vefsafnið Íslenskir",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}