{
    "relation": [
        [
            "Date",
            "9/10/2014",
            "12/12/2014",
            "12/13/2014",
            "12/23/2014",
            "12/28/2014",
            "12/29/2014"
        ],
        [
            "Winner",
            "Robert Hannon",
            "James Horwitz",
            "Ronald Brosnan",
            "Sharon Sullivan",
            "Antonio Losanno",
            "Carol Snow"
        ],
        [
            "City",
            "Brockton",
            "Peabody",
            "Worcester",
            "Dracut",
            "Saugus",
            "Methuen"
        ],
        [
            "Agent",
            "Marshfield Hills General - Marshfield",
            "South Peabody Liquors - Peabody",
            "Value Mart - Worcester",
            "Lakeview Package Store - Dracut",
            "Tedeschi Food Shop - Saugus",
            "Galloway's Convenience - Methuen"
        ],
        [
            "Quic Pic",
            "Y",
            "N",
            "N",
            "Y",
            "Y",
            "N"
        ]
    ],
    "pageTitle": "Massachusetts State Lottery - Winners",
    "title": "",
    "url": "http://www.humanresources@masslottery.com/winners/index.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 120,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988511.77/warc/CC-MAIN-20150728002308-00016-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 501668723,
    "recordOffset": 501611787,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{40429=One $15 million prize remains in the award-winning “World Class Millions” game, the Mass. Lottery’s first $30 instant ticket, which launched in April of 2014. In addition to the three $15 million prize winners in the game, there have been 27 instant $1 million prize winners and four $1 million Second Chance Drawing winners. Nine $1 million instant prizes remain and there will be one additional Second Chance Drawing with a top prize of $1 million, 85612=To enter this Second Chance Drawing, which took place Friday, April 24, players submitted non-winning “Ultimate Garden Party” tickets through the Mass. Lottery website.  Brown’s winning entry was randomly selected from over 134,000 tickets that were entered.  Additional Second Chance prize packages include premium seats at a selection of TD Garden events, behind-the-scenes tours of the TD Garden and cash., 349133=Gailliard’s lucky ticket was purchased at Tedeschi Food Shops, 1187 Hyde Park Avenue in Hyde Park. The store will receive a $10,000 bonus on the sale., 164962=Over 16.8 million “World Class Millions” tickets have been sold statewide since the game’s launch on April 22, 2014., 36897=There are three $15 million prizes and fifty-nine $1 million prizes remaining in the “Supreme Millions” instant game, which went on sale Tuesday, April 28. Ten additional $1 million prizes will be awarded in the game’s Second Chance Drawings. “Supreme Millions” is the Lottery’s second $30 instant ticket, joining “World Class Millions,” which launched in April of 2014., 293646=Stokes claimed his two prizes at Mass. Lottery’s Braintree headquarters on Thursday, October 23, choosing the cash option on both of his winning tickets. He received a pair of checks for $390,000 (less taxes) each, and plans on using the winnings to pay for his son’s college tuition and his daughter’s remaining car payments, as well as take his family on a vacation., 292828=When Kenneth J. Stokes of Norwood received a call from a Massachusetts Lottery representative notifying him that his Lucky for Life season ticket won a $25,000 a Year for Life prize in the Monday, October 20th drawing, he was predictably excited to learn of his good fortune. As it turns out, when the phone conversation ended, he literally didn’t know the half of it., 264943=Heys chose the cash option on his prize and received a one-time payment of $1,625,000, less taxes. He plans on using his winnings to buy a house in Florida. His winning ticket was purchased at Marty’s Gas & Go, 2963 Acushnet Ave. in New Bedford. The store will receive a $25,000 bonus for its sale., 59305=Michael Casazza of Arlington is the seventh $1 million prize winner in the Massachusetts State Lottery’s “100X The Cash” instant game that went on sale in March., 336419=Mason LLC elected to receive a one-time cash payment of $650,000, less taxes. The winning ticket was purchased at 7-Eleven, 1435 Centre St. in Roslindale. The store will receive a $10,000 bonus on the sale., 253795=Mark Paul of Chicopee is the winner of a $1 million Mega Millions prize after his Quic Pic ticket matched the first five numbers drawn in the multi-state game’s drawing held Friday, December 5, 2014., 12208=Anthony Laventure (right) of Dracut is the first $1 million prize winner in the Massachusetts State Lottery’s new “$4,000,000 Payout” instant game that went on sale in June., 48086=Daniel Mejia of Everett is the fourth $1 million prize winner in the Massachusetts State Lottery’s new “40X The Cash” instant game that went on sale in March., 378258=Glenn Ward of Randolph is the winner of a $1 million prize in the multi-state Powerball game’s drawing held Wednesday, August 6, 2014., 116176=Boudreau claimed his $1 million prize (less taxes) at the Massachusetts State Lottery’s Braintree headquarters on Friday, April 17. He plans to use his winnings to pay some bills and invest., 182304=Malone won the game’s $25,000 a year for life second prize when one of the combinations on his Quic Pic ticket matched the first five numbers in the Monday, February 9 drawing. “Lucky for Life” also gives players the opportunity to win $1,000 a day, every day, for the rest of their lives, if they correctly match the first five numbers, as well as the Lucky Ball number., 130054=Margaret Novis of Chelmsford is the second $1 million prize winner in the new edition of the Massachusetts State Lottery’s popular “100X The Cash” instant game that went on sale March 3., 87249=Kristie Barrow of Andover is the fifth $1 million prize winner in the Massachusetts State Lottery’s newest “100X The Cash” instant game that went on sale March 3., 210217=“World Class Millions,” the Mass. Lottery’s first $30 instant ticket, offers players the chance to win $15 million, the highest instant prize in Mass. Lottery history. In October of 2014, “World Class Millions” was named “Best New Instant Game” by the North American Association of State and Provincial Lotteries., 249447=Ernest Tomascik of Fairhaven won a $1 million prize in the Massachusetts State Lottery’s “Million Dollar Drive,” which took place at halftime of the New England Patriots’ 41-13 victory over the Miami Dolphins at Gillette Stadium on Sunday, December 14., 164125=Two $15 million prizes remain in the “World Class Millions” game, the Mass. Lottery’s first $30 instant ticket and recipient of the North American Association of State and Provincial Lotteries’ Best New Instant Game Award for 2014. Twenty-two of the game’s thirty-six $1 million instant prizes have been claimed to date., 46899=“Supreme Millions” is the Lottery’s second $30 instant ticket, joining “World Class Millions,” which launched in April of 2014 and has produced two $15 million winners to date. Nearly three million “Supreme Millions” tickets have been sold statewide in the seven and a half weeks since the game went on sale., 143457=By playing the KENO Bonus multiplier for an extra dollar, Howard was able to triple the standard $40,000 payout for matching nine of nine spots when the 3X multiplier was drawn. Howard claimed his $120,000 prize (less taxes) on Monday, March 23 at the Lottery’s Braintree headquarters., 245383=Three $15 million prizes and 18 $1 million prizes remain in the “World Class Millions” $30 instant game, which went on sale April 22, 2014., 376818=James Bloom of South Hadley is the first $1 million prize winner in the Massachusetts State Lottery’s “$500 Frenzy” instant game that went on sale August 5., 119458=Margaret Melanson of Danvers is the third $1 million prize winner in less than a month in the Massachusetts State Lottery’s popular “100X The Cash” /instant game that went on sale March 3., 372203=Kevin Walsh of Newton is the second of two $1 million winners claiming their prizes on Monday, August 11 in the Massachusetts State Lottery’s “Platinum Millions” instant game., 250769=Sales for the $5 2009 New England Patriots Instant Ticket, the lottery industry’s first scratch ticket to feature a National Football League team logo, officially ended in September of 2013., 100176=Since Powerball was introduced in Massachusetts in January of 2010, there have been three jackpot prize winners, five $2 million prize winners and now twenty-nine $1 million prize winners in the Commonwealth., 304486=Robert Bara of Dudley is the winner of a $25,000 a Year for Life prize in the multi-state “Lucky for Life” drawing held Thursday, October 9, 2014., 314883=Robert Withrow of Winthrop is the winner of a $25,000 a Year for Life prize in the multi-state “Lucky for Life” drawing held Monday, September 29, 2014., 115936=Philip Boudreau of Woburn is Massachusetts’s newest $1 million Powerball prize winner after matching the first five winning numbers in the multi-state game’s drawing held Saturday, March 7, 2015., 151972=Cesar Sanchez of Fitchburg is the fourth $1 million prize winner in the Massachusetts State Lottery’s “$500 Frenzy” instant game that went on sale in August of 2014., 167988=Nine $1 million prizes remain in the “$10,000,000 Diamond Millionaire” $20 instant game, which launched in 2011. All four of the game’s $10 million prizes have been claimed., 64522=There are four (4) $15 million prizes and sixty-two (62) $1 million prizes remaining in the “Supreme Millions” instant game, which went on sale Tuesday, April 28. Ten additional $1 million prizes will be awarded in the game’s Second Chance Drawings. “Supreme Millions” is the Lottery’s second $30 instant ticket, joining “World Class Millions,” which launched in April of 2014., 185231=Dioum claimed his $2 million prize (less taxes) at Massachusetts Lottery headquarters in Braintree on Wednesday, February 11. He intends to use his winnings to pay some bills, take a vacation and invest., 184745=Aliou Dioum of North Providence, RI is the winner of a $2 million Powerball prize, having matched the first five winning numbers while playing the Power Play option in the multi-state game’s drawing held Saturday, February 7, 2015., 385199=Three (3) $15 million prizes and twenty-seven (27) $1 million prizes remain in the “World Class Millions” instant game, which went on sale April 22., 98137=Fogel claimed her $2 million prize (less taxes) at the Massachusetts State Lottery’s Braintree headquarters on Monday, May 4.  This is the third $2 million Powerball prize claimed in Massachusetts this year.  She plans on using some of her winnings to support a non-profit group and intends to put the remainder away for retirement., 173911=Alan Rosenfield of Upton is the first $1 million prize winner in the Massachusetts State Lottery’s “$1,000,000 Holiday Gifts” $5 instant game that went on sale at the start of the 2014 holiday season., 309013=Ann Luippold of Greenfield is the winner of a $2 million Powerball prize after matching the first five winning numbers while playing the Power Play option in the multi-state game’s drawing held Saturday, September 27, 2014., 286922=Three $15 million prizes and twenty-two $1 million prizes remain in the “World Class Millions” $30 instant game, which went on sale April 22, 2014., 212982=Jessica Demelo of New Bedford won a $10,000 prize after participating in the Massachusetts State Lottery's \"On Ice Challenge\" during the second intermission of the Boston Bruins’ game vs. the Tampa Bay Lightning on January 13, 2015., 200123=Amato, Jr. was joined by his girlfriend Rose Sylvain at Massachusetts Lottery headquarters in Braintree on Tuesday, January 20 to claim his $2 million prize (less taxes). He plans on using his winnings to assist his parents and to purchase a condominium., 51526=Zion chose the cash option on his prize and received a one-time payment of $650,000, less taxes. He plans on putting most of his winnings towards retirement. New England Farms, located at 2505 Cranberry Highway in Wareham, will receive a $10,000 bonus for selling this grand prize winning ticket., 52797=Ana Perez of Fitchburg is the fourth $1 million prize winner in the Massachusetts State Lottery’s “Red Hot and Wild 7’s” instant game that went on sale in January of 2015., 57755=Ann Marie Reardon of Marshfield scratched off a $10 million prize in the Mass. Lottery’s “40th Anniversary Millions” instant game to become the fourth such winner in this $20 game, which launched in April of 2012 to commemorate the Lottery’s 40th Anniversary., 120955=Abelino de Leon of Chelsea is the second $1 million prize winner in the Massachusetts State Lottery’s new “40X The Cash” instant game that went on sale on March 3., 97885=Sally Fogel of West Newton is the winner of a $2 million Powerball prize, having matched the first five winning numbers while playing the Power Play option in the multi-state game’s drawing held Saturday, May 2, 2015., 168983=Jason Jones of the Indian Orchard neighborhood of Springfield is the third $1 million prize winner in the Massachusetts State Lottery’s “$500 Frenzy” instant game that went on sale in August of 2014., 167833=The winning ticket was purchased at Convenience Plus, 1480 Broadway Rd. in Dracut. The store will receive a $10,000 bonus for its sale., 313629=Galotti will receive her winnings in annual payments of $50,000 (less taxes) over 20 years. She intends to use her windfall to buy herself a car. Galotti’s winning ticket was purchased at Tedeschi Food Shops, 2302 State Road in Plymouth. The store receives a $10,000 bonus on the sale., 93819=There are four (4) $15 million prizes and sixty-five (65) $1 million prizes remaining in the “Supreme Millions” instant game, which went on sale Tuesday, April 28. “Supreme Millions” is the Lottery’s second $30 instant ticket, joining “World Class Millions,” which launched in April of 2014., 103464=There is one $1 million prize remaining in the “$1,000,000 Holiday Gifts” instant game, which went on sale during the 2014 holiday season., 147699=Two $15 million prizes and thirteen $1 million instant prizes remain in the “World Class Millions” instant game, which launched in April of 2014., 387699=60 Columbian Street Braintree, MA 02184 (781) 849-5555, 77869=Thomasina Tavernelli of Plymouth is the sixth $1 million prize winner in the Massachusetts State Lottery’s newest “100X The Cash” instant game that went on sale March 3., 272167=Sales for the $5 2011 Boston Bruins Stanley Cup Champions Instant Ticket officially ended on April 10, 2014. All claims for instant prizes in the game must be received at the Lottery’s Braintree headquarters prior to 5:00 pm on April 10, 2015., 280590=Ugolini claimed her $1 million (less taxes) at the Massachusetts State Lottery’s headquarters in Braintree on Monday, November 3. She plans to set aside her winnings for her retirement., 350268=Donald Hutchinson of Greenfield, MA won the $2.15 million jackpot that was at stake in the Massachusetts State Lottery’s Megabucks Doubler drawing that took place on Wednesday, September 3, 2014., 36745=His winning ticket was purchased at Stop N Save, 1625 Robeson St. in Fall River. The store will receive a $10,000 bonus for its sale., 291837=Three $15 million prizes and twenty-one $1 million prizes remain in the “World Class Millions” $30 instant game, which went on sale April 22, 2014., 45056=Stacy Foster of Orleans, who was just married on May 1 of this year, today claimed the first $15 million grand prize in the Massachusetts State Lottery’s new $30 “Supreme Millions” instant game. It is the largest instant “scratch and win” prize offered on a Mass. Lottery instant ticket., 160387=Eight $1 million prizes remain in the “$10,000,000 Diamond Millionaire” $20 instant game, which launched in 2011. All four of the game’s $10 million prizes have been claimed., 271193=Coelho won the opportunity to vie for up to $250,000 after being randomly selected as a grand prize winner in the fifth and final drawing in the 2011 Boston Bruins Stanley Cup Champions Instant Ticket's Second Chance program, which took place on June 23, 2014., 46425=There are three additional $15 million prizes and sixty-one $1 million prizes remaining in the “Supreme Millions” instant game, which went on sale Tuesday, April 28. Ten more $1 million prizes will be awarded through the game’s Second Chance Drawings, which allow players to enter their non-winning tickets online for opportunities to win substantial cash prizes. Two $1 million winners will be selected in each of five drawings., 209432=To enter this Second Chance Drawing, which took place Wednesday, January 14, players submitted non-winning “World Class Millions” tickets through the Mass. Lottery website. Couture’s winning entry was randomly selected from over 962,000 tickets that were entered., 199821=Joseph Amato, Jr. of North Reading is the winner of a $2 million Powerball prize, having matched the first five winning numbers while playing the Power Play option in the multi-state game’s drawing held Saturday, January 17, 2015., 289834=Three $15 million prizes and twenty $1 million prizes remain in the “World Class Millions” $30 instant game, which went on sale April 22, 2014., 159932=Phillip made the trip from Nantucket to the Lottery’s Braintree headquarters on Friday, March 6 to claim his prize, which he opted to receive in the form of a one-time payment of $650,000, less taxes. He has not yet determined what he will do with his winnings., 270932=Mark Coelho of New Bedford won a $100,000 prize after participating in the Massachusetts Lottery's \"On-Ice Challenge,\" which took place during the second intermission of the Bruins/Blues game on November 18, 2014., 245225=Charlton’s winning ticket was purchased at 7 Pantry, 1699 Shawsheen St. in Tewksbury. The store will receive a $10,000 bonus for its sale., 21479=To enter this Second Chance Drawing, which took place Thursday, July 9, players submitted non-winning “Ultimate Garden Party” tickets either through the Mass. Lottery website or by mail. Kimball’s winning entry was randomly selected from over 237,000 tickets that were entered. Additional Second Chance prize packages include premium seats at a selection of TD Garden events, behind-the-scenes tours of the TD Garden and cash., 162912=Michael Milford, a 28-year-old sales manager from Melrose, today claimed the second $15 million grand prize in the Massachusetts State Lottery’s $30 “World Class Millions” instant ticket. It is the largest instant “scratch and win” prize ever awarded in Mass. Lottery history, matching the game’s first $15 million prize claimed in July of 2014., 219976=Johnny To of Garden Grove, CA is the winner of a $25,000 a Year for Life prize in the multi-state “Lucky for Life” drawing that was held November 13, 2014., 280284=Valerie Ugolini of Watertown is the latest Massachusetts resident to claim a $1 million Powerball prize after the first five numbers on her Quic Pic ticket matched the winning numbers selected in the multi-state game’s drawing held Saturday, October 25, 2014., 240015=Huffman isn’t the only lucky one in her family. She and her husband both bought tickets from the same vending machine at Market Basket, 1999 Boston Road in Billerica, and her husband won $1,000 on his ticket. The store will receive a $10,000 bonus for its sale of the $1 million winning ticket., 76674=Marino claimed his $1 million prize (less taxes) on Tuesday, May 26 at the Massachusetts State Lottery’s Braintree headquarters. He plans on using his winnings to pay for his kids’ education and invest for his eventual retirement., 301465=Lester Salisbury of Brockton is the winner of a $25,000 a Year for Life prize in the multi-state “Lucky for Life” drawing held Monday, October 13, 2014., 185048=Dioum’s winning combination of 05-10-21-34-58 was a set of numbers that he was playing for the first time. He says that he plans to continue to play these numbers., 214426=Launched September 30, 2014, the 2014 Boston Bruins Instant Ticket features over $22 million in instant win and second chance prizes. There will be four additional Second Chance Drawings for the opportunity to win an On Ice Challenge and other great Bruins prizes., 38600=There are three $15 million prizes and sixty $1 million prizes remaining in the “Supreme Millions” instant game, which went on sale Tuesday, April 28. “Supreme Millions” is the Lottery’s second $30 instant ticket, joining “World Class Millions,” which launched in April of 2014., 99791=Skinner claimed his $1 million prize (less taxes) at the Massachusetts State Lottery’s Braintree headquarters on Monday, May 4.   He plans on buying a house and a car with his winnings., 374249=McCarthy’s winning ticket was purchased at Myette’s Country Store, 1143 Broadway in Hanover. The store will receive a $10,000 bonus on the sale., 101179=A split-second decision made while choosing which $10 ticket to purchase has made Adam Barber of Wareham the first $4 million prize winner in the latest edition of the Massachusetts State Lottery’s popular “100X The Cash” instant game that went on sale March 3., 350708=Hutchinson and his wife Helen visited the Lottery’s headquarters in Braintree the following day to claim his windfall. He selected the cash option on the jackpot prize, which had been growing since June, and received a one-time payment of $1,699,276. The Hutchinsons have eight children, 15 grandchildren and nine great-grandchildren. Donald, an engineer at a paper mill, is now planning to retire., 378430=Ward, accompanied by his wife Debra, claimed his $1 million (less taxes) at the Massachusetts State Lottery headquarters in Braintree on Friday, August 8. He plans to use his winnings to pay off his mortgage and invest., 337662=Lori Bolton of Swansea is the first grand prize winner in the Massachusetts State Lottery’s new “2014 New England Patriots” instant game., 203845=Moore’s winning ticket was purchased at 7-Eleven, 38 Maple Ave. in Shrewsbury. The store will receive a $10,000 bonus for its sale. Three $15 million prizes and fifteen $1 million instant prizes remain in the “World Class Millions” instant game, which went on sale April 22, 2014., 306510=Three $15 million prizes and twenty-three $1 million prizes remain in the “World Class Millions” $30 instant game, which went on sale April 22, 2014., 16946=Kevinette Considine of Plymouth is the eighth $1 million prize winner in the Massachusetts State Lottery’s “100X The Cash” instant game that went on sale in March., 19114=There are three $15 million prizes and fifty-seven $1 million prizes remaining in the “Supreme Millions” instant game, which went on sale April 28. Ten additional $1 million prizes will be awarded in the game’s Second Chance Drawings. “Supreme Millions” is the Lottery’s second $30 instant ticket, joining “World Class Millions,” which launched in April of 2014., 51046=When Mark Zion of Wareham stopped for gas at New England Farms in Wareham and decided to purchase an instant ticket, he had hoped to play the new $30 “Supreme Millions” game from the Massachusetts State Lottery, but it was sold out at this location. Instead, he bought a “World Class Millions” ticket and became the twenty-seventh $1 million instant prize winner in the Lottery’s first $30 game, which launched in April of 2014., 133425=The February 2 drawing was the second “Lucky for Life” drawing held after the game expanded outside of the six New England states on January 27. “Lucky for Life” also gives players the opportunity to win $1,000 a day, every day, for the rest of their lives, if they correctly match the first five numbers, as well as the Lucky Ball number., 190695=Sonia Jordan of Dorchester is the third $2.5 million prize winner in the Massachusetts State Lottery’s “$2,500,000 Holiday Gifts” instant game that was launched last October., 345913=Anne Rougan of Boston is the winner of a $25,000 a year for life prize in the multi-state “Lucky for Life” drawing held Thursday, August 14, 2014., 87626=Barrow’s winning ticket was purchased at 7 Pantry, 1699 Shawsheen St. in Tewksbury. The store will receive a $10,000 bonus for its sale., 143129=Glenn Howard of Boston won $120,000 playing the Massachusetts State Lottery's KENO monitor game after all nine of the spots on his KENO to-go with KENO Bonus ticket were drawn in a game that took place on Friday evening, March 20., 323311=This is the second time that luck has struck for Koul, who also claimed a $1 million “Set For Life” instant prize in 2007. Koul elected to receive her prize in annual payments of $50,000 (less taxes) over 20 years., 133062=Eleanor Miller of the Cataumet section of Bourne is the winner of a $25,000 a year for life prize in the recently expanded multi-state “Lucky for Life” game after her combination of anniversary dates (07-11-18-19-28) correctly matched the first five numbers selected in the drawing that took place Monday, February 2., 252303=Laton Brown of Allston is the winner of a $1 million Powerball prize after the first five numbers on his ticket matched the winning numbers selected in the multi-state game’s drawing held Saturday, December 6, 2014., 383709=Three (3) $15 million prizes and twenty-six (26) $1 million prizes remain in the “World Class Millions” instant game, which went on sale April 22., 11133=Hall’s winning ticket was purchased at Don Quijote Market, 1639 Washington St. in Boston. The store will receive a $10,000 bonus for its sale., 76414=Peter Marino of Everett is the winner of a $1 million Mega Millions prize after his Quic Pic ticket matched the first five numbers drawn in the multi-state game’s drawing held Friday, May 22, 2015., 357158=Freddy Maria of Dorchester is the latest Massachusetts resident to win a $1 million prize in the multi-state Powerball game, matching the five winning numbers selected in the drawing held Wednesday, August 27, 2014., 383446=Asher chose to collect her winnings in a one-time cash payment of $650,000, less taxes. Asher’s winning ticket was purchased at Cranberry Plaza Mobil, 2900 Cranberry Highway in East Wareham. The store will receive a $10,000 bonus on the sale., 165883=Greg Wilcox of Centerville is the second $1 million prize winner in the Massachusetts State Lottery’s new “Red Hot and Wild 7’s” instant game that went on sale in January., 254041=Paul claimed his $1 million prize (less taxes) on Tuesday, December 9 at Massachusetts Lottery headquarters in Braintree. He intends to invest his winnings., 338228=There are six $250,000 prizes remaining in the $5 “2014 New England Patriots” instant game, which went on sale August 26, 2014., 250995=The Lottery and the Patriots launched a new $5 ticket in August that is currently on sale at licensed Lottery retailers across the state. The 2014 New England Patriots Instant Ticket features over $46.2 million in instant win and second chance prizes. The $2 2012 New England Patriots Instant Ticket has one remaining Second Chance Drawing for the opportunity to win up to $200,000 in a “Halftime Challenge” at a future Patriots home game., 319801=Van-Gemert elected to receive his winnings in a one-time payment of $650,000, less taxes. It is the second $1 million prize for Van-Gemert, who won in “Precious Gems” in 2008., 116548=Since Powerball was introduced in Massachusetts in January of 2010, there have been three jackpot prize winners, four $2 million prize winners and twenty-eight $1 million prize winners in the Commonwealth., 101476=Barber, who bought his lucky ticket at Gateway Gas, 2537 Cranberry Highway in Wareham, was going to buy a “$1,000,000 Cashword” ticket, but changed his mind at the last moment and asked for a “100X The Cash” ticket instead., 114483=Three $250,000 prizes remain in the $5 “Ultimate Garden Party” instant game, which went on sale March 31, 2015. The game’s four Second Chance Drawings all feature an exclusive top prize of an All Access Garden Party Pass that includes two premium seats to each ticketed event held at the TD Garden for one full year (all regular season and postseason professional and amateur sporting events, concerts, circus and family shows and more), one premium parking space for each event and $25,000 in cash. Additional Second Chance prize packages include premium seats at a selection of TD Garden events, behind-the-scenes tours of the TD Garden and cash., 140285=The February 2015 Nominee Trust of Hanover has claimed a $1 million prize in the Massachusetts State Lottery’s “Million Dollar Gold” $5 instant game., 213260=Demelo, an avid Bruins fan, won the opportunity to vie for up to $25,000 after being randomly selected as a grand prize winner in the first drawing in the 2014 Boston Bruins Instant Ticket's Second Chance program, which took place on December 22, 2014., 371200=Three (3) $15 million prizes and twenty-five (25) $1 million prizes remain in the “World Class Millions” instant game, which went on sale April 22., 103098=Annino opted to claim her prize in the form of a one-time payment of $650,000, less taxes. A proud mother, Annino plans on using her winnings to celebrate her daughter’s wedding in October of 2016., 240501=Three $15 million prizes and 17 $1 million prizes remain in the “World Class Millions” $30 instant game, which went on sale April 22, 2014., 342819=Pamela Reinap of Framingham is one of two Massachusetts residents who won a $25,000 a year for life prize in the multi-state “Lucky for Life” drawing held Thursday, September 4, 2014., 191203=Jordan’s winning ticket was purchased at Sid’s Smoke Shop, 1120 Washington St. in Boston. The store will receive a $25,000 bonus for its sale., 370745=Bradley won her first $1 million prize in December of 2005 in the $10“Set For Life” game. She opted to collect her most recent windfall in the form of a one-time cash payment of $650,000, less taxes. She plans on putting her winnings into a trust., 310614=James Wallace of Sterling is the first $1 million prize winner in the Massachusetts State Lottery’s “$1,000,000 Pay Day” instant game that went on sale September 16., 252565=Brown claimed his $1 million (less taxes) at the Massachusetts State Lottery’s headquarters in Braintree on Wednesday, December 10. He plans on using his winnings to treat himself to a few new items and to invest., 99559=Alvin Skinner of Springfield is Massachusetts’s newest $1 million Powerball prize winner after matching the first five winning numbers in the multi-state game’s drawing held Saturday, May 2, 2015., 107682=Petro Lamllari of South Boston is the third $1 million prize winner in the Massachusetts State Lottery’s new “40X The Cash” instant game that went on sale in March., 283256=David Alan Druid of Reading is the second $1 million prize winner in the Massachusetts State Lottery’s “$500 Frenzy” instant game that went on sale in August., 61332=There are four (4) $15 million prizes and sixty-one (61) $1 million prizes remaining in the “Supreme Millions” instant game, which went on sale Tuesday, April 28. Ten additional $1 million prizes will be awarded in the game’s Second Chance Drawings. “Supreme Millions” is the Lottery’s second $30 instant ticket, joining “World Class Millions,” which launched in April of 2014., 196742=Peter Evangelista of Wakefield is the second $2.5 million prize winner in the Massachusetts State Lottery’s “$2,500,000 Holiday Gifts” instant game that went on sale at the start of the 2014 holiday season., 375591=Oliveira claimed her $1 million prize (less taxes) on Monday, August 11 at Massachusetts Lottery headquarters in Braintree. She intends to use her winnings to support charitable causes, help her family and invest., 213548=In the \"On Ice Challenge,\" ten oversized 2014 Boston Bruins Instant Tickets were placed on the ice. Each ticket was numbered 1-10. Beneath nine of the tickets were $10,000 prizes, and under one was a $25,000 grand prize. Demelo selected ticket number 8 in honor of Bruins President and Hockey Hall of Famer Cam Neely. The $25,000 prize was under ticket number 1. Demelo was presented with a prize check by Lottery Executive Director Beth Bresnahan., 193834=Jesse Martin of Holland, MA is the first $1 million prize winner in the Massachusetts State Lottery’s new “Red Hot and Wild 7’s” instant game that went on sale January 6, 2015., 321116=Just a few hours before his winning ticket was to expire, Dennis Cote of Ware arrived at Massachusetts Lottery headquarters in Braintree to claim his $25,000 a year for life prize from the “Lucky for Life” drawing held September 26, 2013., 66299=To enter this Second Chance Drawing, which took place Wednesday, May 27, players submitted non-winning “World Class Millions” tickets through the Mass. Lottery website. Sorornejad’s winning entry was randomly selected from over 995,000 tickets that were entered., 95353=Her lucky ticket was purchased at Venient Food Mart, 1027 Central St. in Leominster. The store will receive a $10,000 bonus for its sale., 276833=Roseline Viera of New Bedford is the second $1 million prize winner in as many days in the Massachusetts State Lottery’s new “$2,500,000 Holiday Gifts” instant game that went on sale October 28, 2014., 271490=In the \"On Ice Challenge,\" 30 oversized 2011 Boston Bruins Stanley Cup Champions Instant Tickets were placed on the ice. Each ticket was numbered 1-30. Beneath 29 of the tickets were $100,000 prizes, and under one was a $250,000 grand prize. Coelho selected ticket number 17 in remembrance of his late grandmother’s birthday. She passed away earlier this year at the age of 101., 98514=Fogel’s winning combination of 02-06-11-30-31 represents a mix of birthdays and anniversary dates., 161384=Joaquim Santos-Neto of Newburyport is the sixth $1 million prize winner in the Massachusetts State Lottery’s “$2,500,000 Holiday Gifts” $10 instant game that went on sale at the start of the 2014 holiday season., 66954=“World Class Millions,” the Mass. Lottery’s first $30 instant ticket, offers players the chance to win $15 million, the highest instant prize in Mass. Lottery history. In October of 2014, “World Class Millions” was named “Best New Instant Game” by the North American Association of State and Provincial Lotteries., 15716=There are three $15 million prizes and fifty-six $1 million prizes remaining in the “Supreme Millions” instant game, which went on sale Tuesday, April 28. Ten additional $1 million prizes will be awarded in the game’s Second Chance Drawings. “Supreme Millions” is the Lottery’s second $30 instant ticket, joining “World Class Millions,” which launched in April of 2014., 268349=Three $15 million prizes and nineteen $1 million prizes remain in the “World Class Millions” $30 instant game, which went on sale April 22, 2014., 83202=There are four (4) $15 million prizes and sixty-three (63) $1 million prizes remaining in the “Supreme Millions” instant game, which went on sale Tuesday, April 28. Ten additional $1 million prizes will be awarded in the game’s Second Chance Drawings. “Supreme Millions” is the Lottery’s second $30 instant ticket, joining “World Class Millions,” which launched in April of 2014., 109640=One $1 million prize remains in the “Nutcracker Cash” instant game, which launched in 2013., 272448=The Lottery and the Bruins launched a new $2 offering in October 2014 that is currently on sale at licensed Lottery retailers across the state. The 2014 Boston Bruins Instant Ticket features over $22 million in instant win and second chance prizes. Players can learn more about the $2 2014 Boston Bruins Instant Ticket by picking up a game brochure at a Lottery retailer location or by visiting us here., 355716=Mark Houle of Haverhill is the third Grand Prize winner in the $2,500 a Week for Life instant game launched in April of this year., 27583=There are three $15 million prizes and fifty-eight $1 million prizes remaining in the “Supreme Millions” instant game, which went on sale Tuesday, April 28. Ten additional $1 million prizes will be awarded in the game’s Second Chance Drawings. “Supreme Millions” is the Lottery’s second $30 instant ticket, joining “World Class Millions,” which launched in April of 2014., 357421=Maria claimed his $1 million (less taxes) at the Massachusetts State Lottery headquarters in Braintree on Tuesday, September 2. He plans to use some of his winnings to take a trip to visit his family., 256660=– Margaret Shephard of Worcester is the third Grand Prize winner in the “$500 a Week for Life” instant game launched in April of this year., 180351=Catherine Glockling of Westminster is the fifth $1 million prize winner in the Massachusetts State Lottery’s “$2,500,000 Holiday Gifts” $10 instant game that went on sale at the start of the 2014 holiday season., 156796=David Chow of Brighton is the third $1 million prize winner in the Massachusetts State Lottery’s new “Red Hot and Wild 7’s” instant game that went on sale in January., 344344=Alice Ryan of Dorchester is one of two Massachusetts residents to win a $25,000 a year for life prize in the multi-state “Lucky for Life” drawing held Thursday, September 4, 2014., 38307=The trust, represented by trustee Barry S. Fox Esq., elected to receive its prize in the form of a one-time payment of $650,000, less taxes. The winning ticket was sold at ODB Liquors II, 1151 Blue Hill Ave. in Dorchester. The store will receive a $10,000 bonus for its sale., 249735=Tomascik won his chance at $1 million after being randomly selected in a drawing that included over 965,000 internet entries in the 2009 New England Patriots Instant Ticket Second Chance program. His $1 million prize is the largest ever awarded by the Mass. Lottery in any of the Second Chance promotions offered through its sports-themed instant tickets., 201905=Joined by his wife Lisa, Noll claimed his prize at the Mass. Lottery’s Braintree headquarters on Tuesday, January 20. He chose the cash option on his prize and received a one-time payment of $6,500,000, less taxes. Noll plans on using his winnings to buy a house, make some investments and take his granddaughter to Disney World., 90646=There are four (4) $15 million prizes and sixty-four (64) $1 million prizes remaining in the “Supreme Millions” instant game, which went on sale Tuesday, April 28. “Supreme Millions” is the Lottery’s second $30 instant ticket, joining “World Class Millions,” which launched in April of 2014., 364931=The “$4,000,000 Gold Bullion” instant game debuted on June 17th and offers five (5) $4 million prizes and fifteen (15) $1 million prizes., 163303=Milford, who was accompanied by his fiancée Allison Gilgun at the Mass. Lottery’s Braintree headquarters to claim his prize, selected the cash option on his prize and received a one-time payment of $9,750,000, less taxes. Milford purchased his lucky ticket on Sunday, March 1 at Boyles Family Market, 199 Mystic Avenue in Medford. The store will receive a $50,000 bonus for selling the $15 million winning ticket. It is the highest retailer bonus paid by the Mass. Lottery., 150260=Annemarie Lutz of Foxboro is the first $1 million prize winner in the latest edition of the Massachusetts State Lottery’s popular “100X The Cash” instant game that went on sale March 3., 261616=John Descoteaux of Stoughton is the third $1 million prize winner in the Massachusetts State Lottery’s new “$2,500,000 Holiday Gifts” instant game that went on sale October 28, 2014., 45741=The purchase of the lucky ticket is a story unto itself. When the Fosters visited Tedeschi Food Shops, 2360 State Highway (Route 6) in Eastham on Saturday, they asked for a “Supreme Millions” ticket from the dispenser that was behind a different register, which was not open at that moment. The clerk notified them that they would have to select a ticket from the dispenser behind the active register, as the ticket sales for each register are tracked separately. As luck would have it, that is how Stacy ended up with her winning ticket. The store will receive a $50,000 retailer bonus for its sale, the highest paid by the Mass. Lottery., 67471=The Lottery’s second $30 instant ticket, “Supreme Millions,” features five Second Chance Drawings, each with two top prizes of $1 million for a total of ten $1 million Second Chance prizes. The first “Supreme Millions” drawing is forecasted for August of 2015. All four of this game’s $15 million instant prizes and sixty-three $1 million instant prizes are still available., 331123=To enter this Second Chance Drawing, which took place Tuesday, September 16, players submitted non-winning “World Class Millions” tickets through the Mass. Lottery website. Kelley’s winning entry was randomly selected from over 936,000 tickets that were entered., 347381=Ronald Ralls of Dracut is the second Grand Prize winner in the $500 a Week for Life instant game launched April 22, 2014., 358620=Jose Ricardo Rocha of Everett is the second $1 million grand prize winner in the Massachusetts State Lottery’s “Million Dollar Gold” $5 instant game that went on sale June 17., 283742=Druid’s lucky ticket was purchased at 7 Pantry, 1699 Shawsheen St. in Tewksbury. The store will receive a $10,000 bonus on its sale., 278577=Lawrence J. Jones of the village of Leeds in Northampton is the first $1 million prize winner in the Massachusetts State Lottery’s new “$2,500,000 Holiday Gifts” instant game that went on sale October 28, 2014., 117947=Nancy Muise of Rockport is the third $1 million prize winner in the last seven days in the Massachusetts State Lottery’s popular “100X The Cash” instant game that went on sale March 3., 186868=There are two $5,000 a Week for Life grand prizes remaining in this $10 instant game, which launched in 2012., 261845=Descoteaux opted to receive his prize in a one-time payment of $650,000, less taxes. He plans to use his winnings to pay off some bills. His winning ticket was purchased at Veronica’s, 1074 Main St. in Waltham. The store will receive a $10,000 bonus for its sale., 375415=Patricia Oliveira of New Bedford is the winner of a $1 million prize in the multi-state Mega Millions drawing held Friday, August 8, 2014., 202380=Noll is the third $10 million “Platinum Millions” prize winner since this instant game was launched in 2013. There are two additional $10 million prizes and sixteen $1 million prizes remaining in the game., 264715=Randy Heys of New Bedford is the first $2.5 million prize winner in the Massachusetts State Lottery’s new “$2,500,000 Holiday Gifts” instant game that went on sale October 28, 2014., 163803=Milford and Gilgun, a school teacher, have been planning their December wedding in the Dominican Republic for several months. In addition to paying for their wedding, Milford indicated that he would be using some of his winnings to pay off existing bills, help family members and invest for the future., 10760=Jayjuana Hall of Dorchester is the second $1 million prize winner in three days in the Massachusetts State Lottery’s “$4,000,000 Payout” instant game, which went on sale in June.}",
    "lastModified": "Thu, 30 Jul 2015 15:40:34 GMT",
    "textBeforeTable": "Congratulations to our newest Mass Cash $100,000 winners! SUMMER 2015     Mass Cash Summer Winners One $4 million prize and two additional $1 million prizes remain in the “$4,000,000 Jackpot” $10 instant game. Azeredo’s winning ticket was purchased at Harss Express Mart, 775 Brock Ave. in New Bedford. The store will receive a $10,000 bonus for its sale. Azeredo chose to claim her prize in the form of a one-time cash payment of $650,000, less taxes. She plans on using her winnings to buy a house. Kelly Azeredo of New Bedford is the thirteenth $1 million prize winner in the Massachusetts State Lottery’s “$4,000,000 Jackpot” instant game. July 27, 2015       New Bedford resident hits ‘Jackpot’ -->",
    "textAfterTable": "7/17/2015 Jose Vasconcelos-Neto Framingham Av's Market - Framingham N 7/19/2015 Joseph Diserio Revere 7-Eleven - Revere N Second $1 million 'Payout' prize in three days       July 24, 2015 Jayjuana Hall of Dorchester is the second $1 million prize winner in three days in the Massachusetts State Lottery’s “$4,000,000 Payout” instant game, which went on sale in June. Hall opted to receive her prize in the form of a one-time cash payment of $650,000, less taxes. She plans on using her winnings to buy a home. Hall’s winning ticket was purchased at Don Quijote Market, 1639 Washington St. in Boston. The store will receive a $10,000 bonus for its sale. There are five $4 million prizes and 13 more $1 million prizes still available in the “$4,000,000 Payout” $10 instant game. First $1 million ‘Payout’ prize claimed       July 22, 2015 Anthony Laventure (right) of Dracut is the first $1 million prize winner in the Massachusetts State Lottery’s new “$4,000,000 Payout” instant game that went on sale in June. Laventure chose",
    "hasKeyColumn": true,
    "keyColumnIndex": 1,
    "headerRowIndex": 0
}