{
    "relation": [
        [
            "Model",
            "shuffle",
            "shuffle",
            "nano",
            "nano",
            "4G iPod",
            "5G iPod",
            "4G iPod",
            "5G iPod"
        ],
        [
            "Capacity",
            "512MB",
            "1GB",
            "2GB",
            "4GB",
            "4G 20GB",
            "30GB",
            "60GB",
            "60GB"
        ],
        [
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            ""
        ],
        [
            "Price",
            "$99",
            "$129",
            "$199",
            "$249",
            "$299",
            "$299",
            "$399",
            "$399"
        ],
        [
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            ""
        ],
        [
            "Ratio",
            "$198 per gigabyte",
            "$129 per gigabyte",
            "$99.50 per gigabyte",
            "$62.25 per gigabyte",
            "$14.95 per gigabyte",
            "$9.97 per gigabyte",
            "$6.65 per gigabyte",
            "$6.65 per gigabyte"
        ]
    ],
    "pageTitle": "Review: Apple Computer iPod 5G with Video (30GB/60GB) | iLounge",
    "title": "",
    "url": "http://www.ilounge.com/index.php/reviews/entry/apple-computer-ipod-5g-with-video-30gb-60gb-ipod/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 7,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986022.41/warc/CC-MAIN-20150728002306-00163-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 532711331,
    "recordOffset": 532671517,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{59843=For the first time since its release in early 2001, iTunes 6 now includes support for iTunes Music Store video downloads, enabling consumers to buy music videos and episodes of select TV shows for $1.99 each. These videos are delivered in a ready-for-iPod video format (protected MPEG-4), and require around 5 Megabytes of storage space per minute of run time. As such, a four-minute music video requires around 20 Megabytes, while a one-hour TV show - compressed to 40 minutes without commercials - requires around 200 Megabytes. iTunes stores your videos in a new Videos section of your Source list, and allows you to set auto-synchronization preferences for your iPod in a new Video tab., 49420=The new hard drive components also place Apple in an interesting situation. By going with Toshiba’s slimmest and most efficient 1.8” disk drive - one introduced in June of this year - the company can apparently choose today between only 4 capacities - 20GB, 30GB, 40GB and 60GB - without having to further increase the iPod’s enclosure size and power consumption. Until Toshiba releases an 80GB drive in the same series, or Apple decides to thicken the enclosure for the drive and a bigger battery, the 5G iPod should top out at 60GB. That said, a new drive could easily be in the works at this very moment, and launched within months., 48539=Unlike iPod nano, which uses a scaled-down version of the color iPod interface released in October, 2004, the 5G iPod uses a partially scaled-up version. As before, a light gray bar at the top of each screen identifies where you are in the iPod’s menus, while a battery indicator on its right provides a mostly accurate count down to complete discharge. Newly blue-colored Play and Pause icons in the upper left corner let you know whether the iPod’s paused or playing., 2821=But there is also no getting around its omissions as a video player, or pretending that it is the sort of true Video iPod that would merit our unabated excitement and an unqualified high recommendation. Apple knows as much, having set the bar for itself since 2004 with accurate public statements it has since uneasily sidestepped. Specifically, though its 4:3 screen is better than expected, it is still too small, and the device is further limited by its short on-screen video playback time, inability to play existing videos in already-popular video standards, and its lack of free, fast tools to convert videos into its own formats. In essence, it is for video what the original iPod would have been like without MP3 support, a CD ripper, a good battery, and good headphones., 38088=With only three options, the Video Settings menu is fairly simple: TV Out can be switched to on, off, or Ask, TV Signal to NTSC (US/Japan) or PAL (Europe), and Widescreen to on or off. If you turn TV Out on, videos will not display on the iPod’s screen - you’ll get a simple text display with volume and scrubber controls. Turn it off and the videos will display on the iPod. Unless you’re travelling overseas, you’ll leave the TV Signal setting alone. And widescreen mode is a universal toggle for all of the iPod’s video displays. Set it “on,” and any video clip formatted for 16:9 or another widescreen aspect ratio will display on screen with black bars at their tops and bottoms. Set it “off,” and videos will consume virtually all of the iPod’s screen. The widescreen mode setting affects TV output in the same way., 31720=The first is a clock pre-set to California time - genericized from Cupertino, and starting with the year 2000, just in case Apple invents a time travel machine and you bring your iPod along for the ride. You can bring up a menu that lets you choose an alarm clock playlist or beeping sound, your preferred city, whether daylight saving time is on or off, and whether you’d like your iPod to turn off on a sleep timer. You can also add more than one clock to the display by choosing “New Clock” from the main Clock screen, then selecting a city from many around the world. Once that’s done, you’ll have two (or more) clocks at once running on the iPod, and can scroll through them with ease. Clocks go black during night time in a specific city, gray during daylight hours., 66590=Since 2004, iPod boxes have continuously shrunk in physical size, and even dropped the exciting “origami art” unfolding process that once hid each iPod and its accessories in separate compartments for the user to discover. But like the iPod nano, the full-sized iPod has largely recovered in class from the multicolored silhouette boxes released last year., 42322=Landscape-orientation, 4:3 (TV-ratio) photos still display in full-screen mode, while portrait-orientation (tall) and widescreen-formatted photos appear with significant black bars on their sides. In any case, a photo will look better than on the prior color iPod., 23474=To provide a frame of reference, color 4G iPods were able to achieve music playback times of around 17 hours a piece, beating Apple’s estimates by 2 hours. By comparison, the black-and-white 4G iPod that was introduced last July ran for 12-14 hours, and 3G iPods ran for much less. Therefore, regardless of whether they meet or miss Apple’s estimates, the new iPods are at least acceptable overall. The 30GB 5G iPod is a bit under the color 4G in battery performance, while the 60GB 5G iPod is superior. The only iPod that’s ever done better than the 60GB 5G was the second-generation iPod mini, which actually ran for over 26 hours in our testing., 51034=For years, the insides of a full-sized iPod have been pretty predictable - a PortalPlayer CPU (here, a PP5021, like the one in iPod nano), a Wolfson Micro audio chip (here, the new WM8758), 32 Megabytes of RAM, and a 1.8” hard disk drive (here, a super-slim Toshiba MK3008GAL or MK6008GAH). To that mix, Apple has added a new component: the Broadcom BCM2722 video processor, which is an iPod-customized version of Alphamosaic’s VC02 (VideoCore II), a chip that decompresses H.264 and standard MPEG-4 video, and can create 3-D visual effects as well. This processor was accurately reported as a new iPod component back in April of this year, and is exciting to see in action., 69461=Like its predecessors, the newest iPod is a portable digital media player equipped with a screen, a circular touch-sensitive, five-button controller called the “Click Wheel,” and a rechargeable battery. It is Apple Computer’s “fifth-generation” (5G) full-sized iPod, having been preceded by the original iPod in 2001, the second-generation iPod in 2002, the third-generation iPod in 2003, and both the fourth-generation black-and-white and color iPods in 2004. The 5G retains the same 4.1” by 2.4” footprint as all of these predecessors, and is distinguished from the tiny, screen- and Click Wheel-less iPod shuffle audio player and the mid-sized, color-screened iPod nano audio and photo player. It is the first full-sized iPod to be sold in two colors - white and black - in both of its storage capacities, and without any price premium., 63184=The most notable piece of hardware missing from the new iPod’s box is a wall charger (sold separately for $29, iLounge rating: B+), a part that has been included with every full-sized iPod since 2001, but gradually disappeared from other models over the past year. We’re disappointed but not surprised to see it go. Consequently, you’ll have to recharge your iPod using a powered USB-port equipped computer, which Apple assumes everyone has, or buy the adapter. Mac users will also note that there is no FireWire-to-iPod cable, which as with iPod nano is no longer supported for anything except power recharging. Plugging an optional FireWire cable into the 5G iPod will yield a screen notifying you that data (such as music) cannot be transferred with the cable, but charging is supported.}",
    "TableContextTimeStampAfterTable": "{16849=iLounge is an independent resource for all things iPod, iPhone, iPad, and beyond. iPod, iPhone, iPad, iTunes, Apple TV, Mac, and the Apple logo are trademarks of Apple Inc. iLounge is © 2001 - 2015 iLounge, Inc. All Rights Reserved. Terms of Use | Privacy Policy}",
    "textBeforeTable": "In order to provide a balanced perspective on each of the iPod models, we have felt compelled to point out the comparatively poor dollar-to-Gigabyte ratio of Apple’s smaller music players - despite the fact that we know that many people don’t care. With the release of the new iPod, we feel equally compelled to offer praise to Apple for improving the capacity (and generally, other features) of its $299 iPod model, thereby increasing its value to consumers. Therefore, while we’ll update our prior chart below, it suffices to say that the new 5G iPods are the company’s best values to date. Value (Click here for details.) All of these fixes make us considerably happier about the 5G iPod’s audio performance than we were before, and we’re thrilled to see that Apple has addressed them. That said, the iPod is still not perfect in audio. For instance, iLounge readers correctly point out that there’s a minor bug that occurs when you stop a video to play back an audiobook: the video’s audio track continues to play and overlaps with the audiobook, creating a messy, staticy sound. And we continue to wait for the company to provide custom dynamic equalization through graphic equalizers on the 5G’s screen, a feature found in many of the iPod’s best competitors, and still hope that Apple will add pro-friendly features such as crossfading, tempo and pitch adjustment. Piano solos are now clean. Previously, in certain tracks, distortion (a light sizzling)",
    "textAfterTable": "As the table shows, strictly from a value-for-dollar standpoint, the 5G 30GB iPod and 5G 60GB iPod are the best choices you could make today, and even better than their 4G competitors because of their added features. By comparison with past iPods, there are only two major offsets: the 5G’s lack of a top-mounting accessory port, which we hope will be remedied soon by industrious third-party developers, and its lack of a wall charger - a $29 added purchase that has now been passed on to the consumer. But by comparison with present iPods, none of which now includes a charger or a top-mounting accessory port, the value equation is profoundly tilted in favor of the new iPods. Because of either 5G’s battery strength, hard drive capacity, and superior audio/video/photo functionality, the only reason to prefer a $50 less expensive iPod nano is physical size. And the only reason to prefer an iPod shuffle is the super low price. Compatibility of Existing Accessories (Click here for details.) When we reviewed the iPod nano a month and a half ago, we cautioned readers to wait on third-party accessory purchases. Now we will repeat the warning again: we know for a fact that some developers are rushing “5G” products to market in order to satisfy holiday demand, and will only later revise and improve their designs to fix some of the rough edges. You can make the choice as to whether something that’s released quickly",
    "hasKeyColumn": true,
    "keyColumnIndex": 1,
    "headerRowIndex": 0
}