{
    "relation": [
        [
            "",
            "1st",
            "2nd",
            "3rd",
            "4th",
            "5th",
            "6th",
            "7th",
            "8th",
            "9th",
            "10th",
            "11th",
            "20th",
            "21st",
            "30th",
            "100th",
            "1000th"
        ],
        [
            "masculine singular",
            "primer (1r)",
            "segon (2n)",
            "tercer (3r)",
            "quart (4t)",
            "cinquè (5è)",
            "sisè (6è)",
            "setè (7è)",
            "vuitè (8è)",
            "novè (9è)",
            "desè (10è)",
            "onzè (11è)",
            "vintè (20è)",
            "vint-i-unè (21è)",
            "trentè (30è)",
            "centè (100è)",
            "milè (1000è)"
        ],
        [
            "masculine plural",
            "primers (1rs)",
            "segons (2ns)",
            "tercers (3rs)",
            "quarts (4ts)",
            "cinquens (5ns)",
            "sisens (6ns)",
            "setens (7ns)",
            "vuitens (8ns)",
            "novens (9ns)",
            "desens (10ns)",
            "onzens (11ns)",
            "vintens (20ns)",
            "vint-i-unens (21ns)",
            "trentens (30ns)",
            "centens (100ns)",
            "milens (1000ns)"
        ],
        [
            "feminine singular",
            "primera (1a)",
            "segona (2a)",
            "tercera (3a)",
            "quarta (4a)",
            "cinquena (5a)",
            "sisena (6a)",
            "setena (7a)",
            "vuitena (8a)",
            "novena (9a)",
            "desena (10a)",
            "onzena (11a)",
            "vintena (20a)",
            "vint-i-unena (21a)",
            "trentena (30a)",
            "centena (100a)",
            "milena (1000a)"
        ],
        [
            "feminine plural",
            "primeres (1es)",
            "segones (2es)",
            "terceres (3es)",
            "quartes (4es)",
            "cinquenes (5es)",
            "sisenes (6es)",
            "setenes (7es)",
            "vuitenes (8es)",
            "novenes (9es)",
            "desenes (10es)",
            "onzenes (11es)",
            "vintenes (20es)",
            "vint-i-unenes (21es)",
            "trentenes (30es)",
            "centenes (100es)",
            "milenes (1000es)"
        ]
    ],
    "pageTitle": "Catalan Tutorial: Basic Phrases, Vocabulary and Grammar",
    "title": "",
    "url": "http://www.ielanguages.com/catalan.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 15,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986022.41/warc/CC-MAIN-20150728002306-00257-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 518296175,
    "recordOffset": 518268075,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{70058=a.) el + day + de + month + de + year (e.g. el vint-i-cinc de desembre de vuit-cents OR el 25 de desembre de 800 = \"December 25, 800\"), 77113=The traditional Catalan method of telling time is the quarter system. More specifically, it's based on how many quarters (i.e. 15 minute intervals) of the mentioned hour have passed (e.g. 'Són tres quarts de quatre de la tarda' would translate to 3:45PM and NOT 4:45PM because it's as if 4 o'clock is some glass and \"3/4 of it\" are full). In the phrase 'quart i mig,' generally this \"half of 15 minutes\" turns out to be 7 or 8 minutes. Thus, 'Són dos quarts i mig de tres de la matinada' would be either 3:37AM or 3:38AM. However, to be more precise (and less complex), time in Catalan can also be rendered as simply: 'Són les deu vint-i-cinc' (10:25) or by the equation: són/és + the hour + \"i\" + number of minutes + \"minuts\" (e.g. Són les onze i quaranta minuts (11:40))., 84529=b.) with full or last names in a formal context (Josep Pla va néixer el 20 d'abril de 1893), 26914=a.) If a word ends in an unstressed vowel, an untressed vowel + s, the combination \"-en\", or the combination \"-in\", then the stress of the word is on the penultimate, or second-to-last syllable (e.g. cotxe [COHCH-uh] \"car\", cotxes [COHCH-uhs] \"cars\", parlen [PAR-luhn] \"they speak\", parlin [PAR-leen] \"they speak (present subjunctive)\") b.) If a word ends in a consonant other than s (even if that consonant, notably r, is not pronounced) or ends in \"-an\", \"-on\", \"-un\", then the stress of that word is on the final syllable (e.g. estimar [uh-stee-MAH] \"to love\", perdut [puhr-THUT] \"lost\", parlaran [par-lah-RAN] \"they will speak\", Ramon [rrah-MOHN] man's name, algun [al-GOON] \"some\"). c.) If word has an accent on any vowel, the first two rules are ignored and the stress falls on the syllable containing the accented vowel (e.g. català [kah-tah-LAH] Catalan, telèfon [tuh-LEH-foon]., 70215=b.) the \"day\" in a date is always a cardinal number, except for the first day which optionally uses the ordinal \"primer\" (e.g. el primer de gener de dos mil OR l'u de gener de dos mil \"January 1, 2000\"). Also, contrary to the norm used in the United States, Catalan dates (when written with numbers only) are recorded Day/Month/Year and not Month/Day/Year, as is the American style., 100260=© 1997 - 2015 Jennifer Wagner, 84641=The personal article is still permissible with full or last names in more informal contexts (e.g. Diuen que el Josep Pla tenia amics franquistes). In these (and all contexts involving the personal article, really), the article functions as a sign of familiarity towards the person to whom it refers., 80191=Expressions like \"de la matinada, del matí, etc.\" are generally only used with the traditional Catalan system of telling time (i.e. the quarter system). When telling time using the international system (i.e. the 24 clock), no such expressions are necessary (e.g. Són les divuit i set minuts \"18:07,\" or \"6:07PM\" using the 12 hour clock)., 57920=\"U\" is only used for 1 when it stands by itself (telling time, giving a phone number, counting out loud, etc.); otherwise use \"un\" for masculine nouns and \"una\" for feminine ones. Similarly, \"dos\" is used to go with masculine nouns and \"dues\" for feminine ones. When writing numbers out in words, Catalan observes the D-U-C (Desena-Unitat-Centena) rule which states that hyphens (except in the case of the 20s, e.g. 23 vint-i-tres) only occur between \"D\" (e.g. 10, 20, 30, etc.) and \"U\" (1,2,3, etc.) and/or \"U\" and \"C\" (100). To put this in perspective, here are several examples: mil nou-cents noranta-dos 1992 (nou is a \"U\" and cents is a \"C\", so nou-cents; noranta is a \"D\" and dos is a \"U\" so noranta-dos), dos-cents vuitanta-set 287, dos-cents seixanta mil cinc-cents 260.500, and tres-cents vint-i-set 327.}",
    "textBeforeTable": "5. Subject Pronouns (Els pronoms personals forts) The Neutral Demonstative Pronouns are used to refer to anything from an entire sentence (e.g. Facebook és gratuït. M'agrada això. \"Facebook is free. I like that.\") to an abstract genderless object (Què és això? \"What is this/that?\"). Això is much more preferred in everyday usage to allò and can thus function as either \"this\" or \"that.\" However, allò is still possible and sometimes preferrable in certain cases. However, in cases where clarification is needed, then aquell (as noted in the above chart) can simply translate to \"that\" in English (e.g. Vull aquell, no aquest\" I want that one, not this one.\") In everyday usage, aquell and its various forms really only designate things at a signifcant distance from the speaker, so much so that \"that (insert noun) over there\" is a better translation. This corresponds to the Spanish este-ese-aquel with aquest playing the role of both \"este\" and \"ese\" and aquell being more closely associate with \"aquel.\" To form demonstrative pronouns in Catalan simply use the adjective form without any succeeding noun. For example, I n the sentence: M'agrada molt aquesta camisa, però prefeixo aquella (I like this shirt a lot, but I prefer that one over there) aquesta is acting as a demonstrative adjective, whereas aquella is a demonstrative pronoun. **Similarly, the first s in aquests is never pronounced. (e.g. aquests tipus [ah-kehts tee-poos] ) *The s in aquest is only pronounced when the word is",
    "textAfterTable": "són they / you are van ser they / you were seran they / you will be   estar - to be present past future estic I am vaig estar I was estaré I will be estàs you are vas estar you were estaràs you will be està he/she/it is / you are va estar he/she/it was / you were estarà he/she/it / you will be estem we are vam estar we were estarem we will be esteu you are vau estar you were estareu you will be estan they / you are van estar they / you were estaran they / you will be   tenir - to have present past future tinc I have vaig tenir I had tindré I will have tens you have vas tenir you had tindràs you will have té he/she/it has / you have va tenir he/she/it / you had tindrà he/she/it / you will have tenim we have vam tenir",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}