{
    "relation": [
        [
            "INTL",
            "XS",
            "XS",
            "S",
            "S",
            "M",
            "M",
            "L",
            "XL",
            "XXL"
        ],
        [
            "US",
            "28",
            "29",
            "30",
            "31",
            "32",
            "33",
            "34",
            "36",
            "38"
        ],
        [
            "UK/AU",
            "28",
            "29",
            "30",
            "31",
            "32",
            "33",
            "34",
            "36",
            "38"
        ],
        [
            "FR",
            "36",
            "36",
            "38",
            "38",
            "40",
            "40",
            "42",
            "44",
            "46"
        ],
        [
            "IT",
            "44",
            "46",
            "46",
            "46",
            "48",
            "48",
            "50",
            "52",
            "54"
        ],
        [
            "CN",
            "165/74A",
            "165/78A",
            "170/82A",
            "170/86A",
            "175/90A",
            "175/94A",
            "180/98A",
            "185/102A",
            "185/106A"
        ]
    ],
    "pageTitle": "Alexander Olch Solid Pajama Set | EAST DANE",
    "title": "",
    "url": "https://www.eastdane.com/solid-pajama-set-alexander-olch/vp/v=1/1556687167.htm?folderID=23028&extid=wordpress-AOLCH30064",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 0,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988511.77/warc/CC-MAIN-20150728002308-00177-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 900118983,
    "recordOffset": 900102102,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Model Measurements Measurements from size M Inseam: 27in / 68.5cm Rise: 15in / 38.0cm Sleeve: 31in / 78.5cm Length: 29in / 73.5cm, at center of back Measurements True to size. Buy your normal size. Fit Size & Fit Measurements from size M Inseam: 27in / 68.5cm Rise: 15in / 38.0cm Sleeve: 31in / 78.5cm Length: 29in / 73.5cm, at center of back Measurements Made in the USA. Dry clean. 100% cotton. Fabric: Lightweight twill. A lightweight Alexander Olch pajama set made of fine cotton. The top has a 4-button front and a single breast pocket. The relaxed bottoms have a single patch pocket at the hip. Drawstring waist and button fly. Description Alexander Olch > Brands >",
    "textAfterTable": "Because sizing and cut will vary between brands, please use this chart as a general guide. If you are between sizes or need assistance selecting the proper size, please contact Customer Service Designer Since launching his namesake label in 2002, designer Alexander Olch has become one of the most well-respected purveyors of luxury men’s accessories in the U.S. Alexander Olch ties and pocket rounds are the brand’s signature; they are expertly crafted and detailed with unique touches that are statement-making without being gaudy. 2013 marked Alexander Olch’s first forays into designing apparel, as well as the opening of the brand’s first storefront on Manhattan’s Lower East Side, endeavors that represent a continuation of the brand’s refined aesthetic. Shipping & Returns Free Shipping Worldwide: No matter where you are sending your order, we offer free express shipping across the globe. Shipping Details Easy Returns: Because we understand that not every purchase is exactly right, we've made returns easy. With the return form and return shipping label included with every order, customer service calls aren't necessary. And if you're in the USA, returns are free. Return Details Shipping Available: Shipping Within USA Only: For",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}