{
    "relation": [
        [
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            ""
        ],
        [
            "Forum",
            "GTA V PC, Gameplay, Guides & Strategies, Help & Support This forum is dedicated to discussion about the latest installment in the series, Grand Theft Auto V.",
            "GTA IV PC, Gameplay, Episodes from Liberty City, Multiplayer, Guides & Strategies, Help & Support This section is dedicated to Grand Theft Auto IV - the ninth title in the series, released in 2008.",
            "GTA Chinatown Wars This forum is dedicated to GTA: Chinatown Wars - the tenth game in the series, and the first to be developed for Nintendo DS.",
            "GTA Vice City Stories This forum is dedicated to GTA: Vice City Stories - a prequel to GTA: Vice City, released in 2006.",
            "GTA Liberty City Stories This forum is dedicated to GTA: Liberty City Stories - the first 3D portable Grand Theft Auto title, released in 2005.",
            "GTA San Andreas Gameplay, Mission Help, Guides & Strategies, Help & Support, PC Modding This forum is dedicated to GTA: San Andreas - the fifth title in the series, released in 2004.",
            "GTA Vice City Gameplay, Guides & Strategies, Help & Support, PC Modding This forum is dedicated to GTA: Vice City - the fourth title in the series, released in 2002.",
            "GTA III Gameplay, Guides & Strategies, Help & Support, PC Modding This section is dedicated to Grand Theft Auto III - the first 3D title in the series, released in 2001.",
            "Top Down Games GTA Advance, GTA 2, GTA This section is dedicated to the 2D Grand Theft Auto titles, including the original, GTA 2, and GTA Advance.",
            "GTA Series GTA Concepts General chat related to the series. This section can also be used to post concept threads for new GTAs."
        ],
        [
            "Stats",
            "85,152 topics 2,126,116 replies",
            "85,562 topics 1,154,111 replies",
            "1,071 topics 11,072 replies",
            "4,218 topics 64,767 replies",
            "5,996 topics 75,824 replies",
            "50,550 topics 466,302 replies",
            "22,767 topics 196,333 replies",
            "4,274 topics 60,516 replies",
            "1,127 topics 8,222 replies",
            "3,609 topics 115,746 replies"
        ],
        [
            "Last Post Info",
            "Windows10 - wow, performance! By Nick930930 3 minutes ago",
            "Character switch scenarios By Xing of Virtue A minute ago",
            "6 Star Wanted Level Survival? By Militia A day ago",
            "Is Victor Vance the most hu... By crashrock2 10 hours ago",
            "Unique Vehicles By Militia 10 hours ago",
            "GTA San Andreas Windows 8.1... By Phoenix_Poop 7 minutes ago",
            "Is There a way to Cap Vice... By s2n vaniish An hour ago",
            "How to pronounce his name. By Voit Turyv 13 minutes ago",
            "The incredible Arachnid By Cerium 5 hours ago",
            "GTA VI: Satire vs. Realism,... By Phoenix_Poop 2 minutes ago"
        ]
    ],
    "pageTitle": "GTAForums",
    "title": "",
    "url": "http://gtaforums.com/index.php?act=Post&CODE=06&f=78&t=548933&p=1062315474",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 1,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989301.17/warc/CC-MAIN-20150728002309-00203-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 104564155,
    "recordOffset": 104538757,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{12440=This forum is dedicated to GTA: Vice City Stories - a prequel to GTA: Vice City, released in 2006., 18514=This forum is dedicated to GTA: Vice City - the fourth title in the series, released in 2002., 14037=This forum is dedicated to GTA: Liberty City Stories - the first 3D portable Grand Theft Auto title, released in 2005., 20672=This section is dedicated to Grand Theft Auto III - the first 3D title in the series, released in 2001., 16347=This forum is dedicated to GTA: San Andreas - the fifth title in the series, released in 2004., 47322=Google, TacoSmuggler, Bing, Yahoo, Xing of Virtue, Days Are Gone, unicornace, SilentSeasons, Voit Turyv, B0tLike, RedDagger, icecoldkilla1467, HipsterHillbilly, Krystofer, eman675, SpaceJunk, TalkToMyAgent, ghoraaa, TalkingPear, TCMike, marshallbslayer, StalinBballin, robharris, TragicMods, Max Payne, Tranquiliti, JaegerPilot1, John Smith, Furious_Wave, Red Lynx 23, Zello, Guccitootimez, Craank_AG, The_Anti-tragedy, TexasRocks, helresa, TarHeelJohn, MatthewH, dTrutha, (ACR), Electrogypsy, thafablifee46, Doctor Ray, REXX93, terminalnapkin, Pentalarc, ClaudX, Fearx--, GearMech, ZANTHERA, kasper_hdz, Sveittjpong, monkb4skunk, TJGM, flcon02, Midnight Hitman, kuusko, Queen Elizabeth II, VercettiGuy, Matttheking2015, Joethebuilder, FreshPrinceOfLosSantos, PSI-Breakaway, Marwin, Nick930930, Phoenix_Poop, SARDYNA108, Bullit1990, IamnotaJedi, AztecaEh, Dave_TE, Kiyone_Alien_Cop, reix2x, Geefiasco, -Jacking-, Twin Turbo, glenster, WhyDoINeedAName, Fireman, FUBAR1991, the_wabz, TheBaronOfHell, manitouscott, GTAKid667, RafaeShe, Google Mobile, WrongAgainNoobs, Kakaoen404, CoCkPuNcH, LordRaijin, Markuza97, acalmocean, This Guy Is Here, PhilosophicalZebra, DaWiesel, Benny164, totally_blown, Mokrie Dela, RoloBabs, craigdyid, Frantz Fuchs, 313izzle, moBEttablUesz, pedinhuh, BeckermannDewitt, ARC8_1982, TCA, blk95ta, AUScowboy, Videogames888, A Maned Wolf, CXonor1476, Puritaah, thehambone, No1PartyAnthem, Jon3s, RedRyder2142, nmk111, Fuzzknuckles, Stig, Facebook, NikoBellicGTAIV, Mithridates158, svanderman, joe grizzly, J-B, TOOMtheRaccoon, fullxthrottle94, minigunsRcool, bama764, Lonewolvez, Judicious 7, Cico555, Gummy , jerryinohio78, TheIllaDopest, Ezuu, TDWP_Adam, k1LR12, gavin-xx, iBUCKEYE, Gutslab, Mona Sax, MRSJEIKS, Victor Strawn, Brazil301, Zodape, Poke 123, xHaviiHx, Oddtester, Thecomrade9, Ermacs, Non Biased GTA 4 fan, IxI JoKeR IxI, Jurm, OG Viking, unikatil, Yan22, Blackhailer, jadeskyee, OuttaMyMind, nillis014, SpreeMurder, Rooster Mods, toxluv, CanOdope, Ocelot., JPull07, TG_Stig, spaceeinstein, Edmachine, Pavle, AllNighter1, Aquilus, KingVee, confederatestatesgta, TheUnholy, LDHalcrow1215, GTA_Matt24, SSJEavan747, CarimboHanky, chillcutz, Daz, Pat, Made In Detroit, BaboBaggings199, fireguy109, paperbagdude, Joekill95, LibertyKing, Cognoscenti, Wheatley, Ryan_Codebreaker, EssDot, swirler, alchemist3321, Junko Enoshima, gtuned, steve_blue5, -Anti-, BenStone, dkluin, VivaLaCebus, Mr. Fahrenheit, TWERKSCOPEZ, Eggobites90, Fisciletti, DumbForum, deadx23, Flash525, ApexReclaimer, FMHn, Tomasak, Kixa, Jax765, DontTry2Hard, Martins Matraze, Killerman29, GTAVNoob, slayso, Captain Sensib1e, raggazam, James_158202, Cyberzone2, dice, nodtomc, EvilFuture, dingodile_r89, waters, Alexander Blade, Marticus, r0eladn, stonedpimpso, Darkraven2, OGLuke, SouthLand, Pyro_Indigo, deadmessenger72, Rohith_Kumar_Sp, SigiloHQ, Shenmue18, Kool_R, Nuclear-SJJ, rapidwiz, Quarthon, Starpaul20, DzxProx, REDDICE0818, whywontyoulisten, -Z31N-, ReRo, slowburn29, JoeFury1997, laskaland, Holy Spirit, TheMcSame, JimmyFantastic, TheNameless, jeremy81385, CriminaL277, SPECTER II, progamer1258, Tossin Salad, GVJLIMA, s2n vaniish, StoneCold-Y2J, StangOne50, Flava0ne, tmitchell48, hoopz71, fnxrak, topkek, epoxi, RafaelSousaSam, Claptrap NL, Modojo, IParadise CityI, daliakiller, CaptainPlinky, Ashy_ash, GTAandStuff, lexustt, Smesi, MarshalMoo, 9254=This section is dedicated to Grand Theft Auto IV - the ninth title in the series, released in 2008., 119485=© 2001-2015 GTANet.com | Cookies and Privacy Policy | Copyright Statement}",
    "textBeforeTable": "Toggle Grand Theft Auto Grand Theft Auto (adsbygoogle = window.adsbygoogle || []).push({}); 3 minutes ago By CoCkPuNcH The Duping Crew 614,036 replies 15,210 topics Social lounge for multiplayer crews & forum gangs. Recruitment Crews & Gangs A minute ago By BallistiX Custom L.S.C. & Crew Co... 2,287,770 replies 113,571 topics This is a general discussion forum for Grand Theft Auto Online. Help & Support",
    "textAfterTable": "Toggle GTA Mods GTA Mods   Forum Stats Last Post Info GTA Modding GTA V, GTA IV, GTA III, VC & SA, Tutorials, Art Support General discussion and support. 48,485 topics 416,732 replies [C#] control player ped wit... By marhex 50 minutes ago Mod Showroom Scripts & Plugins, Maps, Total Conversions, Vehicles,",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}