{
    "relation": [
        [
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            ""
        ],
        [
            "Forum",
            "GTA V PC, Gameplay, Guides & Strategies, Help & Support This forum is dedicated to discussion about the latest installment in the series, Grand Theft Auto V.",
            "GTA IV PC, Gameplay, Episodes from Liberty City, Multiplayer, Guides & Strategies, Help & Support This section is dedicated to Grand Theft Auto IV - the ninth title in the series, released in 2008.",
            "GTA Chinatown Wars This forum is dedicated to GTA: Chinatown Wars - the tenth game in the series, and the first to be developed for Nintendo DS.",
            "GTA Vice City Stories This forum is dedicated to GTA: Vice City Stories - a prequel to GTA: Vice City, released in 2006.",
            "GTA Liberty City Stories This forum is dedicated to GTA: Liberty City Stories - the first 3D portable Grand Theft Auto title, released in 2005.",
            "GTA San Andreas Gameplay, Mission Help, Guides & Strategies, Help & Support, PC Modding This forum is dedicated to GTA: San Andreas - the fifth title in the series, released in 2004.",
            "GTA Vice City Gameplay, Guides & Strategies, Help & Support, PC Modding This forum is dedicated to GTA: Vice City - the fourth title in the series, released in 2002.",
            "GTA III Gameplay, Guides & Strategies, Help & Support, PC Modding This section is dedicated to Grand Theft Auto III - the first 3D title in the series, released in 2001.",
            "Top Down Games GTA Advance, GTA 2, GTA This section is dedicated to the 2D Grand Theft Auto titles, including the original, GTA 2, and GTA Advance.",
            "GTA Series GTA Concepts General chat related to the series. This section can also be used to post concept threads for new GTAs."
        ],
        [
            "Stats",
            "85,152 topics 2,126,111 replies",
            "85,562 topics 1,154,107 replies",
            "1,071 topics 11,072 replies",
            "4,218 topics 64,767 replies",
            "5,996 topics 75,824 replies",
            "50,550 topics 466,299 replies",
            "22,767 topics 196,333 replies",
            "4,274 topics 60,516 replies",
            "1,127 topics 8,222 replies",
            "3,609 topics 115,744 replies"
        ],
        [
            "Last Post Info",
            "How to make Steam not show... By REDDICE0818 2 minutes ago",
            "What happened to Luis Lopez? By svanderman A minute ago",
            "6 Star Wanted Level Survival? By Militia A day ago",
            "Is Victor Vance the most hu... By crashrock2 10 hours ago",
            "Unique Vehicles By Militia 10 hours ago",
            "any good? By minigunsRcool 3 minutes ago",
            "Is There a way to Cap Vice... By s2n vaniish An hour ago",
            "How to pronounce his name. By Voit Turyv A minute ago",
            "The incredible Arachnid By Cerium 5 hours ago",
            "F*ck ,Marry,Kill By Xing of Virtue 11 minutes ago"
        ]
    ],
    "pageTitle": "GTAForums",
    "title": "",
    "url": "http://gtaforums.com/index.php?act=Post&CODE=06&f=231&t=380783&p=1058883449",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 1,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989301.17/warc/CC-MAIN-20150728002309-00279-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 104664687,
    "recordOffset": 104639469,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{9346=This section is dedicated to Grand Theft Auto IV - the ninth title in the series, released in 2008., 20742=This section is dedicated to Grand Theft Auto III - the first 3D title in the series, released in 2001., 18584=This forum is dedicated to GTA: Vice City - the fourth title in the series, released in 2002., 12539=This forum is dedicated to GTA: Vice City Stories - a prequel to GTA: Vice City, released in 2006., 14136=This forum is dedicated to GTA: Liberty City Stories - the first 3D portable Grand Theft Auto title, released in 2005., 47312=Bing, Cognoscenti, Max Payne, Google, VivaLaCebus, svanderman, unicornace, SilentSeasons, totally_blown, Rohith_Kumar_Sp, Yahoo, REXX93, Captain Sensib1e, helresa, Quarthon, Marticus, Tomasak, Voit Turyv, Bullit1990, TheBaronOfHell, Kool_R, Lonewolvez, Twin Turbo, Nuclear-SJJ, minigunsRcool, rapidwiz, Cyberzone2, IxI JoKeR IxI, Doctor Ray, This Guy Is Here, RoloBabs, ClaudX, Sveittjpong, Fearx--, SigiloHQ, Starpaul20, DzxProx, Poke 123, Phoenix_Poop, Stig, REDDICE0818, gtuned, whywontyoulisten, OGLuke, -Z31N-, Pavle, ReRo, slowburn29, GTAKid667, JoeFury1997, marshallbslayer, FUBAR1991, laskaland, MatthewH, manitouscott, Markuza97, stonedpimpso, Holy Spirit, TheMcSame, alchemist3321, Videogames888, reix2x, JimmyFantastic, TheNameless, The_Anti-tragedy, PhilosophicalZebra, raggazam, deadmessenger72, Blackhailer, jeremy81385, CriminaL277, Martins Matraze, SPECTER II, Jon3s, progamer1258, Zello, Tossin Salad, Marwin, GVJLIMA, thehambone, Jurm, s2n vaniish, StoneCold-Y2J, Geefiasco, dTrutha, deadx23, Flash525, StangOne50, Flava0ne, CarimboHanky, tmitchell48, hoopz71, Google Mobile, fnxrak, topkek, epoxi, RafaelSousaSam, Claptrap NL, John Smith, RedDagger, Modojo, Midnight Hitman, IParadise CityI, DontTry2Hard, daliakiller, CaptainPlinky, Frantz Fuchs, Ashy_ash, GTAandStuff, DumbForum, lexustt, LDHalcrow1215, Smesi, MarshalMoo, Facebook, OG Viking, Ray, ApexReclaimer, Delta8042, auntjeff, paperbagdude, TacoSmuggler, Rooster Mods, PSI-Breakaway, Jokerg4l, sseebbyy, RafaeShe, chillcutz, TimmyM56, iamcornholio, Ryan_Codebreaker, Wheatley, alexindex57, BenStone, funmw2, lydianduck, Pyro_Indigo, Mr. Fahrenheit, josephene123, Furry_Monkey, Pegassi Autobot, unikatil, Xing of Virtue, ice_phoenix_66, A Maned Wolf, iNero, Joekill95, TragicMods, BeckermannDewitt, dewtech_2008, Halal Cyborg, Flying Racooon, Days Are Gone, Hocko1999_fgc, Bxx88, CeasarGuy, DiscoPanda, xxCAMBERxx, Edmachine, ChickenAndBeer, Zodape, flitcroft101, FullMetal, McH2Oz2, Killerman29, Corndog93, camo_boy67, MeatSafeMurderer, -Anti-, the 918 mafia, Shenmue18, SAVILLAIN, Electrogypsy, marhex, Scarface187, El Chubito, bravercoolio, Nick930930, cheen, J-B, Milesinho, RedRyder2142, TJGM, The Squirrel, YngDady, Epic., Bob_Dole, monkb4skunk, DaWiesel, Slasherr, waters, 69_black_69, Lochie, Tycek, Bender.ㅤ, joe grizzly, dbthesuperstar, truthy, theminted, EvilFuture, Between3and20chars, _Douglas_, Pandassaurus, 78 lil red express, jimmy8309, Fakeplastictrees, Black_MiD, nehctik, GTA4LIFE9000, Verum, dice, NadoVargas, WhosYu, Mach1bud, WrongAgainNoobs, Alfred Packer, fiebru787, WestsideResider, AztecaEh, lpgunit, Schachmatt777, NikkoCharger, Shimo815, SomeDBKid, KingVee, xmrsam, dragoon371, Stripes1981, JRC99, kulomet333, Zonnex, ashbashbluesfan, koztop, kuusko, SalvatoreCJ1903, Nez Man, mrmehoff, TheUnholy, Kimmedrano92, Tranquiliti, Miro, OrionSR, Retired Mafia, bemek01, Krazorrr, SSJEavan747, jerryinohio78, CvrnivalxVenice, Kimpreza, VicRattlehead27, TBONE1138, nodtomc, Honch777, FlacidJack, confederatestatesgta, swirler, iSTELLARi, SouthLand, TalkingPear, adirtygriff, bama764, eimaj1779, Valanga, Pat, ARC8_1982, nmk111, bt flash, Schleemil, blacknambala, Geralt of Rivia, steven4015, sasuke78200, Rozaay, SpaceJunk, misterright1, BUZZARDBUTCHER, ManoniLc, BlackMilk, GTA_REEFER, BlackHeartedGovernor, Xorthian, Aquilus, 7nvd, Zyo, meta187, B-Right, BlackZmith10, Razbos, CountySheriff, LeopardGecko, LordRaijin, Thousand Accent, catmandoza, WastedEngland, timiw, HipsterHillbilly, 125398=© 2001-2015 GTANet.com | Cookies and Privacy Policy | Copyright Statement, 16446=This forum is dedicated to GTA: San Andreas - the fifth title in the series, released in 2004.}",
    "textBeforeTable": "Toggle Grand Theft Auto Grand Theft Auto (adsbygoogle = window.adsbygoogle || []).push({}); 2 minutes ago By Verum [PS4] Cypris Crew Recruitin... 614,035 replies 15,210 topics Social lounge for multiplayer crews & forum gangs. Recruitment Crews & Gangs A minute ago By Zhake is GTA Online a sin? 2,287,753 replies 113,570 topics This is a general discussion forum for Grand Theft Auto Online. Help",
    "textAfterTable": "Toggle GTA Mods GTA Mods   Forum Stats Last Post Info GTA Modding GTA V, GTA IV, GTA III, VC & SA, Tutorials, Art Support General discussion and support. 48,485 topics 416,732 replies [C#] control player ped wit... By marhex 38 minutes ago Mod Showroom Scripts & Plugins, Maps, Total Conversions, Vehicles,",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}