{
    "relation": [
        [
            "Citing Patent",
            "US8131373",
            "US8489185",
            "US8571654",
            "US8577458",
            "US8600505",
            "US8630709",
            "US8688212",
            "US8700150",
            "US8818513",
            "US8918190",
            "US8918191",
            "US8923964",
            "US8923990",
            "US8934967",
            "US8965522",
            "US9005100",
            "US9028391",
            "US9042979",
            "WO2010096774A2"
        ],
        [
            "Filing date",
            "Mar 30, 2010",
            "Jun 16, 2009",
            "Jan 17, 2012",
            "Dec 7, 2011",
            "Dec 7, 2011",
            "Dec 7, 2011",
            "Jul 20, 2012",
            "Jun 30, 2013",
            "Mar 1, 2012",
            "Dec 7, 2011",
            "Dec 7, 2011",
            "Nov 9, 2012",
            "Apr 26, 2013",
            "Jun 16, 2009",
            "Feb 13, 2014",
            "Dec 14, 2012",
            "Apr 4, 2014",
            "Jan 29, 2014",
            "Feb 22, 2010"
        ],
        [
            "Publication date",
            "Mar 6, 2012",
            "Jul 16, 2013",
            "Oct 29, 2013",
            "Nov 5, 2013",
            "Dec 3, 2013",
            "Jan 14, 2014",
            "Apr 1, 2014",
            "Apr 15, 2014",
            "Aug 26, 2014",
            "Dec 23, 2014",
            "Dec 23, 2014",
            "Dec 30, 2014",
            "Dec 30, 2014",
            "Jan 13, 2015",
            "Feb 24, 2015",
            "Apr 14, 2015",
            "May 12, 2015",
            "May 26, 2015",
            "Aug 26, 2010"
        ],
        [
            "Applicant",
            "Cardiac Pacemakers, Inc.",
            "The Board Of Regents, The University Of Texas System",
            "Cyberonics, Inc.",
            "Cyberonics, Inc.",
            "Cyberonics, Inc.",
            "Cyberonics, Inc.",
            "Cyberonics, Inc.",
            "Cyberonics, Inc.",
            "Cardiac Pacemakers, Inc.",
            "Cyberonics, Inc.",
            "Cyberonics, Inc.",
            "Cyberonics, Inc.",
            "Cyberonics, Inc.",
            "The Board Of Regents, The University Of Texas System",
            "Cyberonics, Inc.",
            "The Board Of Trustees Of The Leland Stanford Jr. University",
            "The Board Of Trustees Of The Leland Stanford Jr. University",
            "Sunshine Heart Company Pty Limited",
            "Endurance Rhythm, Inc."
        ],
        [
            "Title",
            "Baroreflex stimulation synchronized to circadian rhythm",
            "Timing control for paired plasticity",
            "Vagus nerve neurostimulator with multiple patient-selectable modes for treating chronic cardiac dysfunction",
            "Implantable device for providing electrical stimulation of cervical vagus nerves for treatment of chronic cardiac dysfunction with leadless heart rate monitoring",
            "Implantable device for facilitating control of electrical stimulation of cervical vagus nerves for treatment of chronic cardiac dysfunction",
            "Computer-implemented system and method for selecting therapy profiles of electrical stimulation of cervical vagus nerves for treatment of chronic cardiac dysfunction",
            "Implantable neurostimulator-implemented method for managing bradycardia through vagus nerve stimulation",
            "Implantable neurostimulator for providing electrical stimulation of cervical vagus nerves for treatment of chronic cardiac dysfunction with bounded titration",
            "Baroreflex stimulation synchronized to circadian rhythm",
            "Implantable device for evaluating autonomic cardiovascular drive in a patient suffering from chronic cardiac dysfunction",
            "Implantable device for providing electrical stimulation of cervical vagus nerves for treatment of chronic cardiac dysfunction with bounded titration",
            "Implantable neurostimulator-implemented method for enhancing heart failure patient awakening through vagus nerve stimulation",
            "Implantable device for providing electrical stimulation of cervical vagus nerves for treatment of chronic cardiac dysfunction with leadless heart rate monitoring",
            "Systems, methods and devices for treating tinnitus",
            "Implantable neurostimulator for providing electrical stimulation of cervical vagus nerves for treatment of chronic cardiac dysfunction with bounded titration",
            "Apparatus and methods for treating pulmonary hypertension",
            "Apparatus and methods for treating pulmonary hypertension",
            "Combination heart assist systems, methods, and devices",
            "Implantable micro-generator devices with optimized configuration, methods of use, systems and kits therefor"
        ]
    ],
    "pageTitle": "Patent US7616990 - Implantable and rechargeable neural stimulator - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US7616990?dq=5754119",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 7,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986806.32/warc/CC-MAIN-20150728002306-00159-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 475225959,
    "recordOffset": 475187694,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{6324=FIG. 10 illustrates a system 1050 including an implantable medical device (IMD) 1052 and a programmer 1054, according to various embodiments of the present subject matter. Various embodiments of the IMD 1052 include neural stimulator functions only, and various embodiments include a combination of NS and CRM functions. The programmer 1054 and the IMD 1052 are capable of wirelessly communicating data and instructions. In various embodiments, for example, the programmer and IMD use telemetry coils to wirelessly communicate data and instructions. Some embodiments use ultrasound transducers for communications, and some embodiments use ultrasound transducers to recharge the IMD. Thus, the programmer can be used to adjust the programmed therapy provided by the IMD, and the IMD can report device data (such as battery data and lead resistance) and therapy data (such as sense and stimulation data) to the programmer using radio telemetry, for example. According to various embodiments, the IMD stimulates baroreceptors to provide NS therapy such as AHT therapy. Various embodiments of the IMD stimulate neural targets using a lead fed through vasculature. Various embodiments of the IMD have a form factor conducive to subcutaneous implantation through a hypodermic needle. According to various embodiments, the IMD includes a sensor to sense ANS activity. Such a sensor can be used to perform feedback in a closed loop control system. For example, various embodiments sense surrogate parameters, such as respiration and blood pressure, indicative of ANS activity. Thus, various embodiments provide a pressure sensor to sense pressure. According to various embodiments, the IMD further includes cardiac stimulation capabilities, such as pacing and defibrillating capabilities in addition to the capabilities to stimulate baroreceptors and/or sense ANS activity.}",
    "textBeforeTable": "Patent Citations This disclosure includes several processes, circuit diagrams, and structures. The present invention is not limited to a particular process order or logical arrangement. Although specific embodiments have been illustrated and described herein, it will be appreciated by those of ordinary skill in the art that any arrangement which is calculated to achieve the same purpose may be substituted for the specific embodiments shown. This application is intended to cover adaptations or variations. It is to be understood that the above description is intended to be illustrative, and not restrictive. Combinations of the above embodiments, and other embodiments, will be apparent to those of skill in the art upon reviewing the above description. The scope of the present invention should be determined with reference to the appended claims, along with the full scope of equivalents to which such claims are entitled. Another example of a neural stimulation therapy includes Functional Electric Stimulation (FES), such as may be used in a therapy for foot drop, standing, walking, hand grasp, and shoulder control. FES can be used as a therapy for spinal cord injuries, and its debilitating effect on a variety of bodily functions. In various embodiments, electrodes used in FES therapies can be subcutaneously placed near or next to a desired nerve for the therapy. Other examples include therapies for the treatment of stroke, epilepsy, eating disorders, sleeping disorders, and pain. Various facial nerves can be",
    "textAfterTable": "US5436548 Nov 25, 1992 Jul 25, 1995 Motorola, Inc. Battery charging and discharging system and corresponding method US5496360 Apr 12, 1994 Mar 5, 1996 Ventritex, Inc. Implantable cardiac electrode with rate controlled drug delivery US5522854 May 19, 1994 Jun 4, 1996 Duke University Method and apparatus for the prevention of arrhythmia by nerve stimulation US5540730 Jun 6, 1995 Jul 30, 1996 Cyberonics, Inc. Treatment of motility disorders by nerve stimulation US5551953 Oct 31, 1994 Sep 3, 1996 Alza Corporation Electrotransport system with remote telemetry link US5562711 Nov 30, 1994 Oct 8, 1996 Medtronic, Inc. Method and apparatus for rate-responsive cardiac pacing US5562713 Jan 18, 1995 Oct 8, 1996 Pacesetter, Inc. Bidirectional telemetry apparatus and method for implantable device US5578061 Oct 3, 1995 Nov 26, 1996 Pacesetter Ab Method and apparatus for cardiac therapy by stimulation of a physiological representative of the parasympathetic nervous system",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}