{
    "relation": [
        [
            "Date",
            "Jun 7, 1995",
            "Sep 20, 2001",
            "Sep 14, 2005",
            "Sep 29, 2009",
            "Oct 3, 2011"
        ],
        [
            "Code",
            "AS",
            "FPAY",
            "FPAY",
            "FPAY",
            "AS"
        ],
        [
            "Event",
            "Assignment",
            "Fee payment",
            "Fee payment",
            "Fee payment",
            "Assignment"
        ],
        [
            "Description",
            "Owner name: INTERNATIONAL BUSINESS MACHINES CORPORATION, NEW Y Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNORS:ROGERS, R.M.;LAGARDE, K.C.;REEL/FRAME:007559/0530 Effective date: 19950606",
            "Year of fee payment: 4",
            "Year of fee payment: 8",
            "Year of fee payment: 12",
            "Owner name: GOOGLE INC., CALIFORNIA Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNOR:INTERNATIONAL BUSINESS MACHINES CORPORATION;REEL/FRAME:027005/0673 Effective date: 20110930"
        ]
    ],
    "pageTitle": "Patent US5752246 - Service agent for fulfilling requests of a web browser - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US5752246?dq=yavitz",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 9,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986444.39/warc/CC-MAIN-20150728002306-00010-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 475027719,
    "recordOffset": 474971476,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{60353=These improvements are accomplished by providing for Web clients to request information from an application processing agent in which the application processing agent server performs tasks based on received requests from a client in a distributed environment by a web server supported by an access agent link and control program agent which in turn causes a decision support function to be executed by the application processing agent server. This is performed within the distributed environment by the application processing agent server which forms part of a network coupled to and under control of the control program agent. According to our invention the decision support function is provided by a data interpretation system which functions as part of the application processing agent and the decision support function is programmable and generated by a data interpretation system, DIS or other decision support element performing similar functions, and provided in a form accessible to our control program agent which presents the output generated to be presented to the user on the Web who made the initial request. We have provided, in a preferred embodiment, a link between IBM's Hypertext Markup Language (HTML), the Common Gateway Interface (CGI), and the Open DIS Access Server (ODAS), all of which may be used on machines which are are commercially available from IBM. In order to write additional functions which develop our invention, the reader is referred to the Medaphor Data Interpretation System publication \"Developing Applications with OpenDIS Access Service, Version 2.0, available from IBM, First Edition (September 1994) Part Number 315-0002-01 which is incorporated herein by reference., 79166=FIG. 4 is a sample result screen which illustrates how a sample report conforming to the request results are presented to the client after the requested service is provided by the computer system network in accordance with our invention formatted according to the specifications of a DIS capsule which is illustrated by example in FIG. 9. In this example, the return was a file, whose file name is displayed as P81484 at 43. Informative text accompanying the file is included as illustrated by the example information 44 The screen provides the content of file 43 in the requested form of preformatted text 50 in the form of a display of a text report generated by a DIS capsule stored in the DIS server 17. While we show text as the form the report results, the form of the request can be another form of presentation, as and image, a voice response, or other multimedia presentation. Reports can be returned translated into any desired language based upon the request, as may be provided by DIS capsule calls to a translator. These features are included in the result 50 report., 80823=FIG. 6 is a sample result screen which illustrates how the request results are presented to the client after the requested service is provided by the computer system network in accordance with our invention formatted according to the specifications of a DIS capsule. In this instance selection of the object 32 links to the the screen of FIG. 5, which in turn with the DIS capsule created the output shown in FIG. 6. DIS Capsules will be illustrated by examples in FIG. 9 and 10. In this example the output of the DIS capsule illustrated in FIG. 10 is presented on the screen shown by FIG. 6. The screen comprises a file name identifier, descriptive information 61, and preformatted text 60 which is the display of the named file P555119. This is the display of a graphic report showing what might be deemed (but is not) Confidential information relating to Catalog Revenue for 1995 YTD, with revenue given in $M, and breakout as to HDW, SFW, PMV, MN and MNT from selected locations in Chicago, New York, Dallas, and Los Angeles, all of which are located on different systems, and which, as illustrated in FIG. 1, may be on different databases such as DB2, Oracle, and Sybase relational databases. This report was generated by a DIS capsule which is illustrated in FIG. 9. This example illustrates how multiple actions can be taken on information retrieved. In this example data was translated into image material by calculation and formatting in the form of a graphic pie shaped report. Other image data could also be displayed, as frames of selected images, or a sequence of images in the form of a moving picture display, which can be outputted from a server as will be described in FIG. 11., 49174=HTML is the language used by Web servers to create and connect documents that are viewed by Web clients. HTML uses Hypertext documents. Other uses of Hypertext documents are described in U.S. Pat. No. 5,204,947, granted Apr. 20, 1993 to Bernstein et al.; U.S. Pat. No. 5,297,249, granted Mar. 22, 1994 to Bernstein et al.; U.S. Pat. No. 5,355,472, granted Oct. 11, 1994 to Lewis; all of which are assigned to International Business Machines Corporation, and which are referenced herein., 43270=This application entitled \"A Service Agent for Fulfilling requests of a Web Browser\", is related to other United States of America Patent applications filed concurrently herewith, and specifically to the applications entitled \"Computer Network for WWW Server Data Access over Internet\", U.S. Ser. No. 08/474,471, filed Jun. 7, 1995; and \"A Sub-Agent Service Agent for Fulfilling Requests of a Web Browser\", U.S. Ser. No. 08/474,575, filed Jun. 7, 1995; and \"A Web Browser System\", U.S. Ser. No. 08/479,481, filed Jun. 7, 1995; and \"A Method for Fulfilling Requests of a Web Browser\" U.S. Ser. No. 08/474,577, filed Jun. 7, 1995; and \"A Method for Distributed Task Fulfillment of Web Browser Requests\", U.S. Ser. No. 08/474,572, filed Jun. 7, 1995.}",
    "textBeforeTable": "Patent Citations While we have described our preferred embodiments of our invention, it will be understood that those skilled in the art, both now and in the future, may make various improvements and enhancements which fall within the scope of the claims which follow. These claims should be construed to maintain the proper protection for the invention first disclosed. Physically, the network 132 will have its own access server 135 preferably in the form of a TCP/IP server 135 to make the physical connection across the Internet. We illustrate in FIG. 11 this other logical layer as located on the network. This TCP/IP server supports the physical connections which are needed by the other logical higher levels of service supported on the network. The use of an InterNetwork Routing Protocol (INR) allows the logical coupling illustrated between a application processing server 134 to an external intranet application processing server 134'. On each network there can be one or more web servers. A Hypertext document request asking for a field to be seached, as by a Hyperlink, could index to a server directly, e.g. a second web server 134\" on the same network which would have its own control program agent function duplicating the control program agent resident in web server 134. Thus at the request homepage a menu which say if \"Art&Literature search\", when selected in a Hyperlink setting, would index to a particular web server and a",
    "textAfterTable": "Jan 19, 1993 Ibm Corporation Adaptive routing in a parallel computing system US5224098 * Jul 17, 1991 Jun 29, 1993 International Business Machines Corporation Compensation for mismatched transport protocols in a data communications network US5241625 * Nov 27, 1990 Aug 31, 1993 Farallon Computing, Inc. Screen image sharing among heterogeneous computers US5278978 * Mar 26, 1990 Jan 11, 1994 International Business Machines Corporation Method and system for describing and exchanging data between heterogeneous database systems with data converted by the receiving database system US5297249 * Oct 31, 1990 Mar 22, 1994 International Business Machines Corporation Hypermedia link marker abstract and search services US5307456 * Jan 28, 1992 Apr 26, 1994 Sony Electronics, Inc. Integrated multi-media production and authoring system US5317688 * Feb 26, 1993 May 31, 1994 Hewlett-Packard Company Software agent used to provide instruction to a user for a plurality of",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}