{
    "relation": [
        [
            "Citing Patent",
            "US8258837 *",
            "US8407509 *",
            "US8411258",
            "US8949069",
            "US20110148486 *",
            "US20120089857 *",
            "WO2011153177A2 *"
        ],
        [
            "Filing date",
            "Dec 17, 2009",
            "Oct 11, 2010",
            "Dec 22, 2010",
            "Dec 16, 2009",
            "Dec 17, 2009",
            "",
            "May 31, 2011"
        ],
        [
            "Publication date",
            "Sep 4, 2012",
            "Mar 26, 2013",
            "Apr 2, 2013",
            "Feb 3, 2015",
            "Jun 23, 2011",
            "Apr 12, 2012",
            "Dec 8, 2011"
        ],
        [
            "Applicant",
            "Intel Corporation",
            "Freescale Semiconductor, Inc.",
            "Intel Corporation",
            "Intel Corporation",
            "Praveen Mosalikanti",
            "Freescale Semiconductor, Inc.",
            "Altera Corporation"
        ],
        [
            "Title",
            "Controlled clock phase generation",
            "Method for compensating for variations in data timing",
            "Systems and methods for determining position using light sources",
            "Position determination based on propagation delay differences of multiple signals received at multiple sensors",
            "Controlled clock generation",
            "Method for compensating for variations in data timing",
            "Apparatus for source-synchronous information transfer and associated methods"
        ]
    ],
    "pageTitle": "Patent US20090251976 - Method and apparatus for DQS postamble detection and drift compensation in a ... - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US20090251976?ie=ISO-8859-1",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 5,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986806.32/warc/CC-MAIN-20150728002306-00032-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 472048286,
    "recordOffset": 472032330,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Referenced by It will be appreciated by persons skilled in the art that the present invention is not limited by what has been particularly claimed hereinbelow. Rather the scope of the present invention includes various combinations and subcombinations of the features described hereinabove as well as modifications and variations thereof as would occur to persons skilled in the art upon reading the foregoing description with reference to the drawings and which are not in the prior art. It is appreciated that, while the above embodiments of control logic circuitry 134 include selecting an intermediate delay which is a function of the initial and terminal data integrity delays, control logic circuitry 134 may alternatively select an intermediate delay which is a function of the only initial data integrity delay. In this alternative, steps f′ and g above may be obviated. h. selecting an intermediate delay which is a function of the initial and terminal data integrity delays and applying said intermediate delay as the variable time delay. g. repeating steps c. and d. for further increasing delays until write/read data integrity is found to not to exist for a terminal data integrity delay; f′. writing to the double data rate type memory at least a first burst of data; f. repeating steps c. and d. for increasing delays until write/read data integrity is found to exist for",
    "textAfterTable": "* Cited by examiner Classifications U.S. Classification 365/189.15, 365/193, 365/233.13, 365/194 International Classification G11C7/00, G11C8/00 Cooperative Classification G11C7/1066, G11C7/10 European Classification G11C7/10R7, G11C7/10 Legal Events Date Code Event Description Apr 7, 2008 AS Assignment Owner name: CHIPX INCORPORATED,CALIFORNIA Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNORS:AMARILIO, LIOR;SCHKOLNIK, DAVID;NADIR, OPHIR;REEL/FRAME:020816/0527 Effective date: 20080212 Apr 15, 2011 AS Assignment Owner name: SILICON VALLEY BANK, CALIFORNIA Free format text: SECURITY INTEREST;ASSIGNOR:CHIPX, INC.;REEL/FRAME:026179/0023 Effective date: 20100423 Oct 18, 2013 REMI Maintenance fee reminder mailed Mar",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}