{
    "relation": [
        [
            "Date",
            "Jan 17, 2001",
            "Mar 11, 2003",
            "Nov 22, 2006",
            "May 6, 2007",
            "Jul 3, 2007"
        ],
        [
            "Code",
            "AS",
            "AS",
            "REMI",
            "LAPS",
            "FP"
        ],
        [
            "Event",
            "Assignment",
            "Assignment",
            "Maintenance fee reminder mailed",
            "Lapse for failure to pay maintenance fees",
            "Expired due to failure to pay maintenance fee"
        ],
        [
            "Description",
            "",
            "",
            "",
            "",
            "Effective date: 20070506"
        ]
    ],
    "pageTitle": "Patent US6559838 - Power management in a monitor - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US6559838?dq=7,013,345/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 8,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986444.39/warc/CC-MAIN-20150728002306-00161-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 473764615,
    "recordOffset": 473740082,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Patent Citations In the claims, any reference signs placed between parentheses shall not be construed as limiting the claim. The word “comprising” does not exclude the presence of other elements or steps than those listed in a claim. The invention can be implemented by means of hardware comprising several distinct elements, and by means of a suitably programmed computer. In the device claim enumerating several means, several of these means can be embodied by one and the same item of hardware. It should be noted that the above-mentioned embodiments illustrate rather than limit the invention, and that those skilled in the art will be able to design many alternative embodiments without departing from the scope of the appended claims. The sequencers may be implemented in a state machine using memory elements other than D-type flip-flops. The state machine may be implemented in a software algorithm. It may than be required to store successive transition instants of the video signal to lower the speed of operation of the software algorithm. The sequencers may influence each other in another configuration as shown in FIG. 2. To summarize, a preferred embodiment in accordance with the invention, the solution described in this application proposes the examination of the analog video content of the R, G and B signals in their mutual variations in the crossing of a prefixed analog threshold (both in the raising and in the falling direction) and the subsequent",
    "textAfterTable": "US5892959 * Dec 17, 1996 Apr 6, 1999 Vadem Computer activity monitor providing idle thread and other event sensitive clock and power control US5987614 * Jun 17, 1997 Nov 16, 1999 Vadem Distributed power management system and method for computer EP0734010A2 Mar 14, 1996 Sep 25, 1996 Sun Microsystems, Inc. Video frame signature capture EP0923065A1 Nov 29, 1993 Jun 16, 1999 Elonex I.P. Holdings Limited Low-power-consumption monitor standby system JPH05344371A Title not available WO1997015913A1 Oct 24, 1996 May 1, 1997 Elonex Technologies Inc Computer peripherals low-power-consumption standby system * Cited by examiner Referenced by Citing Patent Filing date Publication date Applicant Title US7184035 * Jun 12, 2001 Feb 27, 2007 Sharp Kabushiki Kaisha Image",
    "hasKeyColumn": true,
    "keyColumnIndex": 2,
    "headerRowIndex": 0
}