{
    "relation": [
        [
            "type",
            "FR Doc.",
            "RIN",
            "GN Docket No.",
            "FCC"
        ],
        [
            "regulations.gov",
            "2014-30079",
            "",
            "12-268",
            "14-143"
        ]
    ],
    "pageTitle": "47 CFR Part 27 - MISCELLANEOUS WIRELESS COMMUNICATIONS SERVICES | US Law | LII / Legal Information Institute",
    "title": "",
    "url": "https://www.law.cornell.edu/cfr/text/47/part-27",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988860.4/warc/CC-MAIN-20150728002308-00306-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 922716127,
    "recordOffset": 922692288,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{1001=Title 47 published on 2014-10-01.}",
    "TableContextTimeStampAfterTable": "{20349=§ 302 - Repealed. June 5, 1936, ch. 511,, 45749=In this document, the Wireless Telecommunications Bureau (Bureau) further extends the deadline for filing comments on the Auction 1000 Request for Comment, which initiates the pre-auction process by which the Federal Communications Commission will develop detailed procedures for the broadcast television spectrum incentive auction, taking into account public comment received in response to its proposals., 21670=Title 47 published on 2014-10-01, 8449=In this document, the Federal Communications Commission (Commission) announces that the Office of Management and Budget (OMB) has approved, for a period of three years, the information collection requirements associated with the Commission's Report and Order for Commercial Operations in the 1695-1710 MHz, 1755-1780 MHz, and 2155-2180 MHz Bands (Service Rules for Advance Wireless Service (AWS)), FCC 14-31. This notice is consistent with the Report and Order, which stated that the Commission would publish a document in the Federal Register announcing OMB approval and the effective date of the new or modified information collection requirements., 51551=The Auction 1000 Request for Comment initiates the pre-auction process by which the Federal Communications Commission will develop detailed procedures for the broadcast television spectrum incentive auction, taking into account public comment received in response to its proposals. The Auction 1000 Request for Comment includes specific proposals, including on determination of the initial broadcast television spectrum clearing target, opening bid prices, benchmarks for the final stage rule, and the final television channel assignment process, and seeks comment on those proposed procedures., 21284=§ 1451 - Deadlines for auction of certain spectrum, 21059=§ 1403 - Enforcement, 13385=This document contains corrections to the final regulations to the Commission's rules which were published in the Federal Register on Thursday, November 6, 2014 (79 FR 65906). The Commission published a clarification in the Declaratory Ruling, which clarifies how the Commission intends to preserve the “coverage area” of eligible broadcasters in the repacking process associated with the broadcast television spectrum incentive auctions. This document contains corrections to the adopted date., 91338=The Federal Communications Commission published a document in the Federal Register of October 27, 2014 (79 FR 63883), regarding Petitions for Reconsideration filed of Action in a rulemaking proceeding. The document contained the incorrect deadline for filing replies to an opposition to the Petition. This document revises the deadline for replies to an opposition to the Petition., 21141=§ 1404 - National security restrictions on use of funds and auction participation, 31191=The Incentive Auction Task Force provides the results of several staff simulations of the initial clearing target optimization procedure proposed in the Auction 1000 Comment PN and/or Comment PN as discussed further in this under the Supplementary Information. In this document, the Federal Communications Commission's (Commission) Incentive Auction Task Force seeks comment on the data and analyses released in this document and the attached Appendix.}",
    "lastModified": "Thu, 16 Jul 2015 14:30:00 GMT",
    "textBeforeTable": "Additional Documents GPO FDSys XML | Text 80 FR 38812 - WRC-07 Implementation Report and Order and WRC-12 Order 2015-07-07; vol. 80 # 129 - Tuesday, July 7, 2015 For a complete list of all Rules, Proposed Rules, and Notices view the Rulemaking tab. The following are only the Rules published in the Federal Register after the published date of Title 47. Title 47 published on 2014-10-01. 62 FR 9658 33633230930730330230147 U.S.C. 154 SUBPART N — 700 MHz Public/Private , Mar. 3, 1997, unless otherwise noted. Source: , and 337 unless otherwise noted. , , , , , , , Authority:",
    "textAfterTable": "FEDERAL COMMUNICATIONS COMMISSION Final rule. Effective August 6, 2015. 47 CFR Parts 1, 2, 25, 27, 74, 78, 80, 87, 90, 97, and 101 Summary In this document, the Commission implemented allocation changes from the World Radiocommunication Conference (Geneva, 2007) (WRC-07) and updated related service rules. The Commission took this action in order to conform its rules, to the extent practical, to the decisions that the international community made at WRC-07. This action will promote the advancement of new and expanded services and provide significant benefits to the American people. In addition, the Commission revised the International Table of Frequency Allocations within its rules to generally reflect the allocation changes made at the World Radiocommunication Conference (Geneva, 2012) (WRC-12). 2015-01-28; vol. 80 # 18 - Wednesday, January 28, 2015 80 FR 4515 - Commercial Operations in the 1695-1710 MHz, 1755-1780 MHz, and 2155-2180 MHz Bands GPO FDSys XML | Text",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}