{
    "relation": [
        [
            "Harga",
            "Status Harga",
            "Kondisi",
            "Kilometer"
        ],
        [
            ":",
            ":",
            ":",
            ":"
        ],
        [
            "",
            "harga nego",
            "Mobil Bekas",
            "km"
        ]
    ],
    "pageTitle": "Bursa Mobil Bekas Toyota Kijang Super - Page 1",
    "title": "",
    "url": "http://www.mobilbekas.co.id/bursa_mobil_bekas_t.php?s_model=1106=Toyota%20Kijang%20Super",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988860.4/warc/CC-MAIN-20150728002308-00259-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 602829423,
    "recordOffset": 602810427,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{57689=Dijual Kijang Super (Nusa) tahun 1991, kondisi sangat baik siap pakai, warna merah hati, cat orisinil, ban baru, sudah power stearing, plat AE, pajak panjang. hub : 085102822326 / 081331388843, 62183= KIjang Super KF 50 th. 1995, 43278=Super Kijang th 91 warna hijau, kondisi masih prima, mesin masih oke, pajak hidup. Harga 45 juta nego sambil ngopi-ngopi dirumah saya :) Berminat hub saya langsung 085693161694 ( Pin BB: 28DAFBE4 ) Ngga usah malu-malu untuk bertanya atau datang langsung kerumah saya. Terima kasih, 72309=Kijang Super Tahun 1993 Plat B Kondisi terawat, 5 pintu. Mesin sehat. Dokumen kepemilikan lengkap (Atas nama sendiri) modifikasi: - gearbox 5 speed - Dinamo starter & Ampere pakai punya kijang kapsul - Sudah pakai CDI (Asli platina) - Power Steering - Power lock - Power Windows Aksesoris: - Velg variasi (Mercy) ring 16, ban 195/50 - Cat OK - Audio komplit (CD player, radio/ speaker) - AC}",
    "textBeforeTable": "",
    "textAfterTable": "Home Pasang Iklan Mobil Cara Pasang Iklan Iklan Mobil Terkini Berita Otomotif Join Facebook Daftar Mobil Dicari Contact Us Pencarian Semua Merk Mobil Audi Bentley BMW Chery Chevrolet Chrysler Citroen Daewoo Daihatsu Datsun Dodge Ferrari Fiat Ford Hino Holden Honda Hummer Hyundai Infiniti Isuzu Jaguar Jeep Kia Lamborghini Land Rover Lexus MAN Maserati Mazda Mercedes-Benz Mini Mitsubishi Nissan Opel Peugeot Porsche Proton Rolls-Royce",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}