{
    "relation": [
        [
            "Player",
            "Chris Stewart",
            "Gaby Sanchez",
            "Clint Barmes",
            "Josh Harrison",
            "Jose Tabata"
        ],
        [
            "Position",
            "C",
            "1B",
            "IF",
            "IF/OF",
            "OF"
        ],
        [
            "Bats",
            "R",
            "R",
            "R",
            "R",
            "R"
        ]
    ],
    "pageTitle": "MLB Power Rankings: Re-Ranking All 30 MLB Lineups at the 1-Quarter Mark | Bleacher Report",
    "title": "",
    "url": "http://bleacherreport.com/articles/2062190-mlb-power-rankings-re-ranking-all-30-mlb-lineups-at-the-1-quarter-mark",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042981576.7/warc/CC-MAIN-20150728002301-00323-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 25499847,
    "recordOffset": 25414849,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{264788=After losing Prince Fielder, Omar Infante and Jhonny Peralta over the winter—and then losing Andy Dirks and Jose Iglesias to injury during the spring—it was fair to expect a drop in the Detroit Tigers' offensive production., 277865=Jose Bautista has reestablished himself as one of the game's most dangerous hitters, while Melky Cabrera (pictured) has seemingly put his PED-related distractions and injury-filled 2013 behind him, ranking among the league leaders in batting average and runs scored., 180637=That may not seem like a major difference, but in what is shaping up to be the most heated divisional race in baseball, it could be the difference between a division crown and another October spent watching the playoffs on TV., 147832=Starlin Castro and Anthony Rizzo have put their miserable 2013 campaigns behind them and have swung the bats with a purpose, looking very much like the cornerstone pieces for GM Jed Hoyer to build a lineup around in Chicago., 109613=Not even Seth Smith's torrid start to May (.447 BA, 1.399 OPS) was enough to keep the San Diego Padres lineup from ranking as the worst in baseball, one that suffers from a severe case of underperformingitis., 104391=*All lineups and rosters courtesy of MLBDepthCharts. All statistics courtesy of FanGraphs and Baseball-Reference, unless otherwise linked/noted and are current through May 17. Players whose names are italicized are part of a platoon; those with an asterisk (*) after their name are injury replacements., 103238=A downturn in offensive production, which began in 2010, continues, with major leaguers hitting only .250 through games as of May 17. While batting average is only one way for us to measure a player or team's effectiveness at the plate, with so many lineups looking mediocre, it makes ranking MLB lineups difficult., 265643=The power the Tigers lost has been replaced with players who hit to contact and have above-average speed once they get on base. Detroit's contact rate has risen from 78 percent in 2013 to 81.7 percent, and the team has already stolen more bases (36) than it did all of last season (35)., 186473=While the Washington Nationals ranked seventh in baseball with 299 runs scored over the second half of the 2013 season, the team struggled to hit with runners in scoring position, bating a meager .245, the ninth-worst mark in the game., 265289=The Tigers are averaging 4.89 runs per game this season after averaging 4.91 runs in 2013, despite the offensive firepower they lost in the offseason. But the 2013 Tigers were shut out 12 times. The 2014 Tigers have been shut out just once. They are on pace to be shut out just four or five times., 159581=The St. Louis Cardinlas not only excelled at hitting with runners in scoring position in 2013 (a MLB-best .330/.402/.463 slash line), but they posted the third-highest team on-base percentage (.332)—tops in the National League., 135943=The team's lone All-Star representative last season, Jason Castro (pictured), has regressed as expected. His unsustainable .359 BABIP in 2013 has dropped to a .299 mark, resulting in an equal drop in his batting average (.276 to .217)., 141823=The Cincinnati Reds were having enough trouble scoring runs before Jay Bruce (pictured) went down with an injured knee that's expected to keep him out of action until June at the earliest., 217090=After outscoring the rest of baseball by nearly 60 runs a season ago, the Boston Red Sox's offense has taken a step back in 2014. Some regression was expected, of course, given that the team needed to replace Stephen Drew and Jacoby Ellsbury., 199865=As was the case in 2013, injuries have hit the heart of Milwaukee Brewers lineup, with Ryan Braun spending time on the disabled list earlier this season and Aramis Ramirez currently sidelined., 315107=Copyright © 2015 Bleacher Report, Inc. Turner Broadcasting System, Inc. All Rights Reserved. BleacherReport.com is part of Bleacher Report - Turner Sports Network, part of the Turner Sports and Entertainment Network. Certain photos copyright © 2015 by Getty Images. Any commercial use or distribution without the express written consent of Getty Images is strictly prohibited., 171924=Take a look at where the Mariners currently sit among AL clubs and where they sat at the end of the 2013 season:, 265961=Oh, and the Tigers still have that Miguel Cabrera fellow, who after a slow start has begun to deliver his usual MVP-caliber performance, hitting .350 with 10 extra-base hits, 22 RBI and an OPS of 1.077 in May.}",
    "textBeforeTable": "Primary Lineup Denis Poroy/Getty Images 30. San Diego Padres (Previous Rank: 24) Next » 32 of 2 « Prev Begin Slideshow » *All lineups and rosters courtesy of MLBDepthCharts. All statistics courtesy of FanGraphs and Baseball-Reference, unless otherwise linked/noted and are current through May 17. Players whose names are italicized are part of a platoon; those with an asterisk (*) after their name are injury replacements.   What you see is what you get, and what we've got following the first quarter of the regular season are rankings that look quite different from what we expected. Unlike our Opening Day rankings, which were based on history, expectations for the upcoming season and what we saw in spring training, these updated rankings are based solely on a team's production so far. But we're going to give it a shot. A downturn in offensive production, which began in 2010, continues, with major leaguers hitting only .250 through games as of",
    "textAfterTable": "Jedd Gyorko 2B R Yasmani Grandal C S Yonder Alonso 1B R Pitcher P L/R   Bench Player Position Bats Nick Hundley C R Rene Rivera C R Alexi Amarista IF/OF L Chris Denorfia OF R Cameron Maybin OF R   Injury Report None.   Overview Not even Seth Smith's torrid start to May (.447 BA, 1.399 OPS) was enough to keep the San Diego Padres lineup from ranking as the worst in baseball, one that suffers from a severe case of underperformingitis. Everth Cabrera has forgotten how to get on base, where he can use his elite speed and baserunning skills to cause havoc for the opposition. That's left the likes of Chase Headley, Jedd Gyorko and Will Venable with fewer run-producing opportunities—never a good thing. Of course, it would help if the aforementioned trio of run producers were hitting above the Mendoza Line, which they're not, with a combined .177 batting average. The recent return to action for oft-injured outfielders Cameron Maybin and Carlos Quentin should help, but neither one can be counted on to stay healthy for any length of time. Factoring them in to the equation is only setting yourself up for disappointment if you're one of the Friars' faithful.",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}