{
    "relation": [
        [
            "Element",
            "custom-resource",
            "external-jndi-resource",
            "jdbc-resource",
            "mail-resource",
            "admin-object-resource",
            "connector-resource",
            "resource-adapter-config",
            "jdbc-connection-pool",
            "connector-connection-pool",
            "work-security-map"
        ],
        [
            "Required",
            "zero or more",
            "zero or more",
            "zero or more",
            "zero or more",
            "zero or more",
            "zero or more",
            "zero or more",
            "zero or more",
            "zero or more",
            "zero or more"
        ],
        [
            "Description",
            "Defines a custom resource.",
            "Defines a resource that resides in an external JNDI repository.",
            "Defines a JDBC (Java Database Connectivity) resource.",
            "Defines a JavaMail resource.",
            "Defines an administered object for an inbound resource adapter.",
            "Defines a connector (resource adapter) resource.",
            "Defines a resource adapter configuration.",
            "Defines the properties that are required for creating a JDBC connection pool.",
            "Defines the properties that are required for creating a connector connection pool.",
            "Defines a work security map."
        ]
    ],
    "pageTitle": "Elements of the GlassFish Server Deployment Descriptors",
    "title": "",
    "url": "http://docs.oracle.com/cd/E26576_01/doc.312/e24929/dd-elements.htm",
    "hasHeader": true,
    "headerPosition": "MIXED",
    "tableType": "RELATION",
    "tableNum": 125,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042981576.7/warc/CC-MAIN-20150728002301-00020-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 74289975,
    "recordOffset": 74206196,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{394054=Internet Explorer 5.00 for Windows 2000, 603884=1800, 394380=Netscape 4.7.7 for Windows 2000}",
    "lastModified": "Wed, 13 May 2015 05:25:13 GMT",
    "textBeforeTable": "Table C-126 resources Subelements The following table describes subelements for the resources element. Subelements none Superelements You must specify a Java Naming and Directory Interface (JNDI) name for each resource. To avoid collisions with names of other enterprise resources in JNDI, and to avoid portability problems, all names in a GlassFish Server application should begin with the string java:app/. Note: Defines application-scoped resources for an enterprise application, web module, EJB module, connector module, or application client module. This is the root element; there can only be one resources element in a glassfish-resources.xml file. See The glassfish-resources.xml File. resources </resource-ref> <jndi-name>jdbc/EmployeeDB</jndi-name> <res-ref-name>jdbc/EmployeeDBName</res-ref-name> <resource-ref>  Example       Specifies the default principal (user) for the resource. zero or one default-resource-principal Specifies the absolute jndi-name of a resource. only one jndi-name Specifies the res-ref-name in the corresponding Java EE deployment descriptor file resource-ref entry. only one",
    "textAfterTable": "Note: Subelements of a resources element can occur in any order. response-policy Defines the authentication policy requirements of the authentication provider's response processing. Superelements provider-config (sun-acc.xml) Subelements none Attributes The following table describes attributes for the response-policy element. Table C-127 response-policy Attributes Attribute Default Description auth-source none Specifies the type of required authentication, either sender (user name and password) or content (digital signature). auth-recipient none Specifies whether recipient authentication occurs before or after content authentication. Allowed values are before-content and after-content. response-protection Defines the authentication policy requirements of the application's response processing. Superelements message-security (glassfish-web.xml,",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}