{
    "relation": [
        [
            "Property",
            "Atrium Center",
            "Blankenbaker Business Center I",
            "Blankenbaker Business Center II",
            "Anthem Office Center",
            "Plainview Center",
            "Plainview Point Office Center Phase I and II",
            "Plainview Point Office Center Phase III",
            "ITT Parking Lot",
            "Springs Medical Office Center",
            "Springs Office Center",
            "Outlet Mall",
            "Sears Office Building"
        ],
        [
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            ""
        ],
        [
            "Location",
            "Louisville, KY",
            "Louisville, KY",
            "Louisville, KY",
            "Louisville, KY",
            "Louisville, KY",
            "Louisville, KY",
            "Louisville, KY",
            "Louisville, KY",
            "Louisville, KY",
            "Louisville, KY",
            "Louisville, KY",
            "Louisville, KY"
        ],
        [
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            ""
        ],
        [
            "Status",
            "Sold 2008",
            "Sold 2008",
            "Sold 2008",
            "Sold 2008",
            "Sold 2008",
            "Sold 2008",
            "Sold 2008",
            "Sold 2008",
            "Sold 2007",
            "Sold 2007",
            "Asset Held for Sale",
            "Asset Held for Sale"
        ]
    ],
    "pageTitle": "NTS REALTY HOLDINGS LP - FORM 10-K - March 29, 2010",
    "title": "",
    "url": "http://www.getfilings.com/sec-filings/100329/NTS-REALTY-HOLDINGS-LP_10-K/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042981576.7/warc/CC-MAIN-20150728002301-00215-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 477282351,
    "recordOffset": 477209061,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{786625=Sold 2007, 1011976=Accounts receivable, net of allowance for doubtful accounts of $203,359 and $90,932 at December 31, 2009 and 2008, respectively, 195432=2007, 163617=·                  Lakeshore Business Center Phase I, which was constructed in 1986, is a business center with approximately 100,400 net rentable square feet in Fort Lauderdale, Florida.  As of December 31, 2009, there were 16 tenants leasing space aggregating approximately 88,700 square feet.  The tenants are professional service entities, principally in engineering, insurance and financial services, telecommunication and dental equipment suppliers.  Three of these tenants individually lease more than 10% of the net rentable area at Lakeshore Business Center Phase I.  Lakeshore Business Center Phase I was 88% occupied as of December 31, 2009., 927216=Loss on disposal of assets from continuing operations for the years ended December 31, 2009, 2008 and 2007 can be attributed to assets that were not fully depreciated at the time of replacement, spread amongst the, 467727=October 2009, 109018=As of December 31, 2009, Mr. J.D. Nichols beneficially owns approximately 60.0% of the outstanding NTS Realty Holdings Limited Partnership Units.  Mr. Nichols effectively has the power to elect all of the directors and control the management, operations and affairs of NTS Realty Holdings Limited Partnership.  His ownership may discourage someone from making a significant equity investment in NTS Realty Holdings Limited Partnership, even if we needed the investment to operate our business.  His holdings could be a significant factor in delaying or preventing a change of control transaction that other limited partners may deem to be in their best interests, such as a transaction in which the other limited partners would receive a premium for their units over their current trading prices., 170682=·                  Park Place Apartments, which was constructed in three phases, is a 464-unit luxury apartment complex located on a 44.8-acre tract in Lexington, Kentucky.  Phases I and II were constructed between 1987 and 1989, and Phase III was constructed in 2000.  As of December 31, 2009, the property was 93% occupied., 166048=·                  Lakeshore Business Center Phase III, which was constructed  in 2000, is a business center with approximately 38,900 net rentable square feet in Fort Lauderdale, Florida.  As of December 31, 2009, there were 4 tenants leasing space aggregating all 38,900 square feet.  The tenants are professional service entities, principally in insurance services, consulting services, real estate development and engineering.  Three of these tenants individually lease more than 10% of the net rentable area at Lakeshore Business Center Phase III.  Lakeshore Business Center Phase III was 100% occupied as of December 31, 2009., 704319=June, 2008, 175551=·                  The Grove at Swift Creek Apartments, which was purchased in 2006 and constructed in 2000, is a 240-unit luxury apartment complex located on a 32.9-acre tract in Richmond, Virginia.  As of December 31, 2009, the property was 87% occupied., 736280=Financed by a $9.6 million mortgage payable to Federal Home Loan Mortgage Corporation. Our ownership percentage at December 31, 2009, was 51%., 857255=Operating expenses from continuing operations for the years ended December 31, 2009 and 2008 were approximately $10.7 million and $9.4 million, respectively.  The increase of $1.3 million, or 14%, was primarily the result of a $1.6 million increase in operating expenses from our 2009 and 2008 acquisitions, $0.2 million increase in bad debt expense and repairs and maintenance across the commercial segment and $0.1 million increase in landscaping and utilities at Park Place Apartments.  The increase was partially offset by a $0.6 million decrease in repairs and maintenance at Willow Lake Apartments and The Willows of Plainview Apartments.  There were no other material offsetting changes in operating expenses for the years ended December 31, 2009 and 2008., 849015=The components of long-lived assets held for sale at December 31, 2007, consisted primarily of cash and equivalents-restricted, accounts receivable, land, buildings and amenities, prepaid leasing commissions and other assets for the properties being sold.  The components of long-lived liabilities held for sale at December 31, 2007, consisted primarily of accounts payable and accrued expenses, accounts payable and accrued expenses due to affiliate, security deposit liabilities, other liabilities and any stand-alone mortgage on the properties being sold., 473476=November 2009, 172391=·                  Willow Lake Apartments, which was constructed in 1985, is a 207-unit luxury apartment complex located on an 18-acre tract in Indianapolis, Indiana.  As of December 31, 2009, the property was 96% occupied., 683652=Net cash provided by operating activities decreased to approximately $7.9 million from $8.1 million for the years ended December 31, 2008 and 2007, respectively.  This decrease of approximately $0.2 million was primarily due to an increase in cash used to satisfy accounts payable and accrued expenses primarily due to the sale of Atrium Center, Blankenbaker Business Center Phases I and II, Plainview Center, Plainview Point Office Center Phases I and II, Plainview Point Office Center Phase III and the ITT Parking Lot (the \u0093Office Portfolio\u0094), along with a decrease in other liabilities including a decrease in land deposits and in the valuation of our interest rate swap agreement., 422578=Beginning December 29, 2004, our Units were listed for trading on the American Stock Exchange under the symbol NLP.  Beginning December 1, 2008, our Units ceased trading on the American Stock Exchange and now trade on the NYSE Amex under the symbol NLP.  The NYSE Amex is the successor to the American Stock Exchange.  The approximate number of record holders of our Units at December 31, 2009, was 2,124., 892678=Professional and administrative expenses from continuing operations for the years ended December 31, 2008 and 2007 were approximately $1.3 million and $1.4 million, respectively.  The decrease of $0.1 million, or 7%, was primarily the result of an overall decrease in legal and professional fees.  There were no other material offsetting changes in professional and administrative expenses for the years ended December 31, 2008 and 2007., 162683=·                  Clarke American, which was constructed in 2000, is a business center with approximately 50,000 net rentable square feet in Louisville, Kentucky.  As of December 31, 2009, one tenant was leasing all 50,000 square feet.  The tenant is a professional service entity in the check printing industry.  Clarke American was 100% occupied as of December 31, 2009., 177940=·                  Shelby Farms Apartments, which was purchased in 2008 and constructed in two phases, is a 450-unit luxury apartment complex located on a 30.2-acre tract in Memphis, Tennessee. Phase I was constructed in 1997 and Phase II was constructed in 2007.  As of December 31, 2009, the property was 98% occupied., 688014=Net cash provided by financing activities was approximately $43.8 million for the year ended December 31, 2009, compared to cash used in financing activities of approximately $10.1 million for the year ended December 31, 2008.  Our 2009 activity included proceeds from mortgages payable for our 2009 acquisitions and our December 17, 2009 refinancing of approximately $180.5 million along with contributions from noncontrolling interest holders of approximately $5.6 million, which were partially offset by the payoff of mortgages by our December 17, 2009 refinancing totaling approximately $128.1 million, principal payments on mortgages of approximately $3.4 million, payments on our revolving note payable of approximately $6.5 million, additions to loan cost pertaining to refinancing of approximately $2.1 million and cash distributions of approximately $2.3 million., 1001938=March 30, 2009,, 695049=On February 12, 2010, we made a principal payment of $8.2 million, from our proceeds from refinancing on December 17, 2009, on our new $8.2 million revolving mortgage payable to a bank., 793626=The components of discontinued operations are outlined below and include the results of operations for the respective periods in which we owned such assets during the years ended December 31, 2009, 2008 and 2007., 950730=Gain on sale of discontinued operations for the year ended December 31, 2008 was approximately $18.9 million due to the sale of the Office Portfolio in May 2008., 59036=At December 31, 2009, we owned wholly, as a tenant in common with an unaffiliated third party or through joint venture investments, 24 properties, comprised of 7 office and business centers, 14 multifamily properties and 3 retail properties.  The properties are located in and around Louisville (8) and Lexington (1), Kentucky; Fort Lauderdale (3) and Orlando (2), Florida; Indianapolis (4), Indiana; Memphis (1) and Nashville (2), Tennessee; Richmond (2), Virginia; and Atlanta (1), Georgia.  Our office and business centers aggregate approximately 671,000 square feet.  Our multifamily properties contain 4,029 units.  Our retail properties contain approximately 210,000 square feet., 735595=Financed by a $14.6 million mortgage payable to Federal Home Loan Mortgage Corporation. Our ownership percentage at December 31, 2009, was 51%., 302066=The tables below reflect our outstanding indebtedness from mortgages and notes payable for our properties owned wholly, as a consolidated joint venture investment or as an unconsolidated joint venture investment in tenants in common as of December 31, 2009.  Properties that are not encumbered by mortgages or notes are not listed below.  Some of our mortgages and notes bear interest in relation to the Libor Rate.  As of December 31, 2009, the Libor Rate was 0.23%.  The Libor Rate is a variable rate of interest that is adjusted from time to time based on interest rates set by London financial institutions., 358667=SCHEDULE OF ANNUAL PROPERTY TAX RATES AND TAXES-2009, 104046=Cautionary Statements under the Private Securities Litigation Reform Act of 1995., 1003891=Consolidated Balance Sheets as of December 31, 2009 and 2008, 884468=Management fees from continuing operations for the years ended December 31, 2009 and 2008 were approximately $2.2 million and $2.0 million, respectively.  The increase of $0.2 million, or 10%, was primarily the result of our 2009 and 2008 acquisitions.  There were no other material offsetting changes in management fees for the years ended December 31, 2009 and 2008., 685114=Net cash used in investing activities was approximately $32.7 million for the year ended December 31, 2009, compared to cash provided by investing activities of approximately $1.4 million for the year ended December 31, 2008.  The change of approximately $34.1 million was primarily due to no sales of discontinued operations in 2009, while there were proceeds from the sales of discontinued operations of approximately $50.0 million in 2008, primarily from the sale of the Office Portfolio.  This change was primarily offset by less cash used in acquisitions (approximately $32.2 million was used in 2009 acquisitions, while approximately $41.0 million was used in the 2008 acquisition of Shelby Farms Apartments (June 2008), referred to as our \u00932008 acquisition\u0094) and less cash used for additions to land, buildings and amenities of approximately $0.1 million.  In addition, in 2008, we loaned $3.5 million to the unaffiliated third party purchaser of the Office Portfolio, with $2.5 million of that balance being repaid in 2009., 24434=As of June 30, 2009, the aggregate market value of the registrant\u0092s limited partnership units held by nonaffiliates of the registrant was $17,477,591, based on the closing price of the NYSE Amex.  As of March 29, 2010, there were 11,380,760 limited partnership units of the registrant issued and outstanding., 423981=High and low Unit prices for the period January 1, 2008, through December 31, 2008, were $6.65 to $3.00, respectively.  Quarterly distributions are determined based on current cash balances, cash flow generated by operations and cash reserves needed for future leasing costs, tenant finish costs and capital improvements., 744694=May, 2008, 461448=On December 1, 2009, three entities created or controlled by Mr. Nichols commenced pre-arranged trading plans to purchase limited partnership units of NTS Realty pursuant to Rule 10b5-1 under the Act.  Each of the plans authorize its administrator, Wells Fargo Investments, LLC, to purchase approximately $225,000, $52,000 and $26,000, respectively, of NTS Realty\u0092s limited partnership units from time to time through no later than November 2010.  Under the terms of the plans, Mr. Nichols has no discretion or control over the timing, effectuation or the amount of each purchase., 180205=·                  Outlet Mall, which was constructed in 1983, is an approximately 162,600 square foot mall in Louisville, Kentucky.  As of December 31, 2009, one tenant, Garden Ridge L.P., was leasing all 162,600 square feet.  The tenant is a retail service entity principally in the sale of domestic merchandise and home furnishings.  Outlet Mall was 100% occupied as of December 31, 2009.  See Item 7 Future Liquidity - for a discussion of our sale of Outlet Mall. (1), 851126=YEAR ENDED DECEMBER 31, 2009 AS COMPARED TO DECEMBER 31, 2008, 174751=·                  The Grove at Whitworth Apartments, which was purchased in 2006 and constructed in 1994, is a 301-unit luxury apartment complex located on 12.1-acre tract in Nashville, Tennessee.  As of December 31, 2009, the property was 93% occupied., 925932=Interest expense from continuing operations for the years ended December 31, 2008 and 2007 was approximately $11.4 million and $11.2 million, respectively.  The increase of $0.2 million, or 2%, was primarily the result of our 2008 acquisition and an increase in interest expense related to the interest rate swap offset by a decrease in interest expense on our variable rate debt.  There were no other material offsetting changes in interest expense for the years ended December 31, 2008 and 2007., 173160=·                  The Lakes Apartments, which was purchased in 2005 and constructed in 1997, is a 230-unit luxury apartment complex located on a 19.7-acre tract in Indianapolis, Indiana.  As of December 31, 2009, the property was 94% occupied., 107296=We undertake no obligation to publicly update any forward-looking statements, whether as a result of new information, future events or otherwise.  However, any further disclosures made on related subjects in our subsequent reports on Forms 10-K, 10-Q and 8-K should be consulted.  The following cautionary discussion of risks, uncertainties and possible inaccurate assumptions relevant to our business includes factors we believe could cause our actual results to differ materially from expected and historical results.  Other factors beyond those listed below, including factors unknown to us and factors known to us, which we have not determined to be material, could also adversely affect us.  This discussion is provided as permitted by the Private Securities Litigation Reform Act of 1995, and all of our forward-looking statements are expressly qualified in their entirety by the cautionary statements contained or referenced in this section., 161766=·                  Sears Office Building, which was constructed in 1987, is an office building with approximately 66,900 net rentable square feet in Louisville, Kentucky.  Sears Office Building was vacant as of December 31, 2009.  See Item 7 Future Liquidity - for a discussion of our sale agreement for Sears Office Building dated February 23, 2010. (1), 183134=staffing, financial and medical equipment sales.  Three of these tenants individually lease more than 10% of the net rentable area at Springs Station.  Springs Station was 100% occupied as of December 31, 2009., 194845=2008, 690752=Our future liquidity depends significantly on our properties\u0092 occupancy remaining at a level which allows us to make debt payments and have adequate working capital, currently and in the future.  If occupancy were to fall below that level and remain at or below that level for a significant period of time, our ability to make payments due under our debt agreements and to continue paying daily operational costs would be materially impaired.  In the next twelve months, we intend to operate the properties in a similar manner to their operation in recent years.  Cash reserves, which consist of unrestricted cash as shown on our balance sheet, were $11.2 million on December 31, 2009., 4449=For the fiscal year ended December 31, 2009, 851382=AS COMPARED TO DECEMBER 31, 2007, 5657=TRANSITION REPORT PURSUANT TO SECTION 13 OR 15(d) OF THE SECURITIES EXCHANGE ACT OF 1934, 654583=We adopted FASB ASC Topic 805 Business Combinations on January 1, 2009, which requires us to expense acquisition costs as incurred., 767991=On February 23, 2010, we entered into an agreement to sell our Sears Office Building to an unaffiliated third party for approximately $3.8 million.  The proposed purchaser is expected to close by April 30, 2010, with an option to extend to July 31, 2010.  We have offered seller financing to the purchaser, including additional proceeds to improve the building, totaling $4.7 million., 265137=(3)          We believe the changes in average occupancy from period to period are temporary effects of each property\u0092s specific mix of lease maturities and are not indicative of any known trend.  Lakeshore Business Center Phase II was 79% occupied as of December 31, 2009., 686491=Net cash provided by investing activities decreased to approximately $1.4 million from $10.2 million for the years ended December 31, 2008 and 2007, respectively.  The decrease of approximately $8.8 million was primarily the result of $23.8 million in additional proceeds related to property dispositions than in the comparable prior period, partially offset by issuing notes receivable to the unaffiliated third party purchaser of the Office Portfolio for $3.5 million, along with a $10.4 million decrease in cash used to invest in joint ventures as a tenant in common, a $1.7 million decrease in cash used for additions to land, buildings and amenities and a $0.3 million decrease in deposits on property acquisitions., 697593=During the years ended December 31, 2009, 2008 and 2007, we made the following property acquisitions either wholly or through investments in joint ventures:, 951226=Gain on sale of discontinued operations for the year ended December 31, 2007 was approximately $13.5 million due to the sale of the Springs Medical Office Center and the Springs Office Building in February 2007., 691773=We made quarterly distributions of $0.05 per unit to our limited partners of record on April 17, 2009; July 16, 2009; October 16, 2009; and January 15, 2010, respectively., 64835=The independent directors engaged an independent nationally recognized real estate expert (the \u0093expert\u0094) to assist them in their review of the management agreement entered into as of December 28, 2004, as amended.  The expert made suggestions as to the types and amounts of fees and reimbursements to be included in the amended and restated management agreement and assisted in the drafting of the amended and restated management agreement.  The amended and restated management agreement was approved by the independent directors and entered into on April 11, 2006, and was effective as of December 29, 2005.  It is automatically renewed annually unless terminated pursuant to its terms.  The independent directors review the amended and restated management agreement periodically., 859479=Operating expenses reimbursed to affiliate from continuing operations for the years ended December 31, 2009 and 2008 were approximately $4.9 million and $4.4 million, respectively.  The increase of $0.5 million, or, 848211=The components of long-lived assets held for sale at December 31, 2008, consisted primarily of cash and equivalents-restricted, accounts receivable, land, buildings and amenities and other assets for the properties being sold.  The components of long-lived liabilities held for sale at December 31, 2008, consisted primarily of accounts payable and accrued expenses, accounts payable and accrued expenses due to affiliate and other liabilities on the properties being sold., 695586=We expect to receive $1.0 million on or before May 1, 2011, in satisfaction of our unaffiliated notes receivable., 739801=During the years ended December 31, 2009, 2008 and 2007 we made the following property dispositions:, 123550=Future terrorist attacks in the U.S., such as the attacks that occurred in New York, Washington, D.C. and Pennsylvania on September 11, 2001, and other acts of terrorism or war could harm the demand for, and the value of, our properties.  A decrease in demand could make it difficult for us to renew or re-lease our properties at lease rates equal to, or above, historical rates.  Terrorist attacks also could directly impact the value of our properties through damage, destruction, loss, or increased security costs, and the availability of insurance for these acts may be limited or costly.  To the extent that our tenants are impacted by future attacks, their ability to honor obligations under their existing leases with us could be adversely affected., 103695=Factors That May Affect Our Future Results, 894138=Professional and administrative expenses reimbursed to affiliate from continuing operations for the years ended December 31, 2008 and 2007 were approximately $1.6 million and $1.7 million, respectively.  The decrease of $0.1 million, or 6%, was primarily due to decreased personnel costs and compensation reimbursed to NTS Development Company as a result of the sale of the Office Portfolio.  There were no other material offsetting changes in professional and administrative expenses reimbursed to affiliate for the years ended December 31, 2008 and 2007., 773257=Sold 2008, 173950=·                  The Grove at Richland Apartments, which was purchased in 2006 and constructed in 1998, is a 292-unit luxury apartment complex located on a 10.5-acre tract in Nashville, Tennessee.  As of December 31, 2009, the property was 97% occupied., 423329=High and low Unit prices for the period January 1, 2009, through December 31, 2009, were $5.51 to $2.95, respectively.  Quarterly distributions are determined based on current cash balances, cash flow generated by operations and cash reserves needed for future leasing costs, tenant finish costs and capital improvements., 885181=Management fees from continuing operations for the years ended December 31, 2008 and 2007 were approximately $2.0 million and $1.9 million, respectively.  The increase of $0.1 million, or 5%, was primarily the result of our 2008 acquisition.  There were no other material offsetting changes in management fees for the years ended December 31, 2008 and 2007., 715166=June, 2009, 491029=The following table sets forth our selected financial data for 2009, 2008, 2007, 2006 and 2005.  We have derived the consolidated statement of operations and consolidated balance sheet data for the years ended December 31, 2009, 2008, 2007, 2006 and 2005 from our audited financial statements., 928779=commercial and multifamily properties.  The 2009 replacements included heating and air conditioning units, tenant improvements, exterior lighting, fitness equipment, property handrails and a fire alarm system.  The 2008 replacements included roof replacements, heating and air conditioning units, tenant improvements and signage. The 2007 replacements included heating and air conditioning units, tenant improvements, signage, fitness equipment and a telephone system replacement, amongst others., 496132=2006, 194258=2009, 858368=Operating expenses from continuing operations for the years ended December 31, 2008 and 2007 were approximately $9.4 million and $7.9 million, respectively.  The increase of $1.5 million, or 19%, was primarily the result of a $0.6 million increase in operating expenses from our 2008 acquisition along with a $0.4 million increase in repairs and maintenance across the remaining multifamily segment, a $0.4 million increase in operating expenses across the commercial segment primarily related to repairs and maintenance at the Lakeshore Business Centers and a $0.1 million increase in utilities across all of our remaining multifamily properties.  There were no other material offsetting changes in operating expenses for the years ended December 31, 2008 and 2007., 186230=·                  Sabal Park Apartments, which was purchased in 2009 and constructed in 1986, is a 162-unit luxury apartment complex located on a 14.3-acre tract in Orlando, Florida.  As of December 31, 2009, the property was 91% occupied.  We own a 51% interest in this property., 681406=Net cash provided by operating activities decreased to approximately $0.1 million from $7.9 million for the years ended December 31, 2009 and 2008, respectively.  The decrease of approximately $7.8 million was primarily related to cash used for prepayment penalties of approximately $3.8 million, property taxes of approximately $1.5 million, lender held cash escrows of approximately $0.8 million, prepaid insurance of approximately $0.3 million and approximately $0.9 million of loan costs, all related to the December 17, 2009, debt refinancing.  We also used approximately $0.9 million to fund lender held cash escrows related to the acquisitions of Golf Brook Apartments and Sabal Park Apartments (June 2009), referred to as our \u00932009 acquisitions\u0094.  These increased uses of cash were partially offset by decreased usages of cash totaling $0.4 million, which were individually immaterial., 424633=The following table sets forth the price range of our limited partnership units on the NYSE Amex or its predecessor, the American Stock Exchange, and distributions declared for each quarter during the years ended December 31, 2009 and 2008., 479133=December 2009, 924823=Interest expense from continuing operations for the years ended December 31, 2009 and 2008 was approximately $16.2 million and $11.4 million, respectively.  The increase of $4.8 million, or 42%, was primarily the result of $3.8 million in prepayment premiums and approximately $0.6 million of unamortized loan costs related to the debt refinancing on December 17, 2009.  The remaining increase of $0.4 million is the result of interest expense related to mortgages from our 2008 and 2009 acquisitions offset by decreased interest expense related to the interest rate swap and a decrease in the interest expense on our variable rate debt.  There were no other material offsetting changes in interest expense for the years ended December 31, 2009 and 2008., 177144=·                  Lake Clearwater Apartments, which was purchased in 2006 and constructed in 1999, is a 216-unit luxury apartment complex located on a 10.6-acre tract in Indianapolis, Indiana.  As of December 31, 2009, the property was 92% occupied., 496788=2005, 851779=This section includes our actual results of operations for the years ended December 31, 2009, 2008 and 2007.  As of December 31, 2009, we owned wholly or as a tenant in common with an unaffiliated third party or through joint venture investments, 7 office and business centers, 14 multifamily properties and 3 retail properties.  We generate substantially all of our operating income from property operations., 930067=Loss from investment in tenants in common for the years ended December 31, 2009, 2008 and 2007 includes net operating losses attributable to our investments in tenants in common with an unaffiliated third party acquired in 2007.  The properties are The Overlook at St. Thomas Apartments and Creek\u0092s Edge at Stony Point Apartments., 931167=Net income from discontinued operations for the years ended December 31, 2009, 2008 and 2007 were approximately $0.3 million, $0.4 million and $1.7 million, respectively.  Discontinued operations, net, for the years ended December 31, 2009, 2008 and 2007 include the operating results for the properties previously sold and currently held for sale as listed below., 187846=·                  The Overlook at St. Thomas Apartments, which was purchased in 2007 and constructed in 1991, is a 484-unit luxury apartment complex located on a 24.9-acre tract in Louisville, Kentucky.  As of December 31, 2009, the property was 94% occupied.  We own a 60% tenant in common interest in this property., 8414=41-2111139, 662735=The components of the consolidated statements of cash flows for the years ended December 31, 2009, 2008 and 2007 are outlined below., 694120=On February 1, 2010, we amended our $24.0 million mortgage payable to a bank.  The amendments converted $8.2 million of the balance to a revolving note payable due June 1, 2011.  The amendments also add a Debt Service Test, effective after June 30, 2010.  The revolver proceeds may be used to fund capital improvements, or to pay our mortgage payable to GE Commercial Finance Business Property due August 1, 2010.  Both the $15.3 million mortgage and the $8.2 million revolving note payable are secured by our Lakeshore Business Center properties., 3965=ANNUAL REPORT PURSUANT TO SECTION 13 OR 15(d) OF THE SECURITIES EXCHANGE ACT OF 1934, 429844=2009, 922472=Interest and other income from continuing operations for the years ended December 31, 2009 and 2008 was approximately $0.3 million and $0.4 million, respectively.  The decrease of $0.1 million, or 25%, was primarily the result of a decrease in miscellaneous income from a prior tenant at NTS Center and a decrease in interest income earned on our unaffiliated notes receivable offset by an increase in interest earned on property tax refunds and miscellaneous charges in our multifamily segment.  There were no other material offsetting changes in interest and other income for the years ended December 31, 2009 and 2008., 847461=The components of long-lived assets held for sale at December 31, 2009 consisted primarily of land, buildings and amenities and other assets for the properties being sold.  The components of long-lived liabilities held for sale at December 31, 2009, consisted primarily of accounts payable and accrued expenses, accounts payables and accrued expenses due to affiliate and other liabilities on the properties being sold., 923438=Interest and other income from continuing operations for the years ended December 31, 2008 and 2007 was approximately $0.4 million and $0.1 million, respectively.  The increase of $0.3 million was primarily due to interest earned on the proceeds from the sale of the Office Portfolio along with interest earned on our notes receivable from an unaffiliated third party as consideration from the sale of the Office Portfolio and miscellaneous income from a prior tenant at NTS Center.  There were no other material offsetting changes in interest and other income for the years ended December 31, 2008 and 2007., 57027=NTS Realty Holdings Limited Partnership (\u0093NTS Realty,\u0094 \u0093we,\u0094 \u0093us\u0094 or \u0093our\u0094) was organized as a limited partnership in the State of Delaware in 2003 and was formed by the merger of NTS-Properties III; NTS-Properties IV; NTS-Properties V, a Maryland limited partnership; NTS-Properties VI, a Maryland limited partnership; and NTS-Properties VII, Ltd. (the \u0093Partnerships\u0094), along with other real estate entities affiliated with their general partners, specifically Blankenbaker Business Center 1A and the NTS Private Group\u0092s assets and liabilities.  The merger was completed on December 28, 2004, after a majority of each Partnership\u0092s limited partners voted for the merger.  The Partnerships and Blankenbaker Business Center 1A were terminated by the merger and ceased to exist.  Concurrent with the merger, ORIG, LLC (\u0093ORIG\u0094), a Kentucky limited liability company, affiliated with the Partnerships\u0092 general partners, contributed substantially all of its assets and liabilities to NTS Realty, including the NTS Private Group properties.  The merger was part of a court approved settlement of class action litigation involving the Partnerships.  Prior to the merger and contribution, we had no operations and a limited amount of assets.  On December 29, 2004, the American Stock Exchange began to list our limited partnership units (the \u0093Units\u0094) for trading.  Our Units currently are listed on the NYSE Amex under the trading symbol \u0093NLP.\u0094  As used in this Form 10-K, the terms \u0093we\u0094, \u0093us\u0094 or \u0093our\u0094, as the context requires, may refer to NTS Realty, its wholly-owned properties and its interests in consolidated and unconsolidated joint venture investments., 88206=In addition to the foregoing, we may engage in transactions structured as \u0093like-kind exchanges\u0094 of property to obtain favorable tax treatment under Section 1031 of the Internal Revenue Code.  If we are able to structure an exchange of properties as a \u0093like-kind exchange,\u0094 then any gain we realize from the exchange would not be recognized for federal income tax purposes.  The test for determining whether exchanged properties are of \u0093like-kind\u0094 includes  whether the properties are of the same nature or character., 997187=We have audited the accompanying consolidated balance sheet of NTS Realty Holdings Limited Partnership (the \u0093Company\u0094) as of December 31, 2008, and the related consolidated statements of operations, partners\u0092 equity and cash flows for each of the two years in the period ended December 31, 2008.  Our audits also included the financial statement schedule III listed in the Index at Part IV, Item 15(2).  These financial statements and schedule III are the responsibility of the Company\u0092s management.  Our responsibility is to express an opinion on these financial statements and schedule III based on our audits., 689227=Net cash used in financing activities decreased from approximately $17.5 million for the year ended December 31, 2007 to approximately $10.1 million for the year ended December 31, 2008.  Our 2008 activity included repayment of mortgages and our revolving note payable from proceeds of our sale of the Office Portfolio totaling approximately $36.3 million along with principal payments on mortgages of $3.0 million, an additional payment of our revolving note payable of $4.6 million and cash distributions of $4.1 million, which were partially offset by an increase in our revolving note payable of $5.0 million, a $6.2 million increase in mortgage payable and an increase in mortgages payable of $26.3 million issued for the permanent financing of Shelby Farms., 104461=Certain information included in this report or in other materials we have filed or will file with the Securities and Exchange Commission (the \u0093SEC\u0094) (as well as information included in oral statements or other written statements made or to be made by us) contains or may contain forward-looking statements within the meaning of Section 27A of the Securities Act of 1933, as amended.  You can identify these statements by the fact that they do not relate strictly to historical or current facts.  They contain words such as \u0093anticipate,\u0094 \u0093estimate,\u0094 \u0093expect,\u0094 \u0093project,\u0094 \u0093intend,\u0094 \u0093plan,\u0094 \u0093believe,\u0094 \u0093may,\u0094 \u0093can,\u0094 \u0093could,\u0094 \u0093might\u0094 and other words or phrases of similar meaning in connection with any discussion of future operating or financial performance.  Such statements include information relating to anticipated operating results, financial resources, changes in revenues, changes in profitability, interest expense, growth and expansion, anticipated income to be realized from our investments in unconsolidated entities, the ability to acquire land, the ability to gain approvals and to open new communities, the ability to sell properties, the ability to secure materials and subcontractors, the ability to produce the liquidity and capital necessary to expand and take advantage of opportunities in the future, and stock market valuations. From time to time, forward-looking statements also are included in our other periodic reports on Forms 10-Q and 8-K, in press releases, in presentations, on our website and in other material released to the public., 696020=On October 31, 2009, we amended our revolving note payable.  The amendment extended the maturity date to May 31, 2010, and included an Entity Level Debt Service Coverage Ratio.  Our availability on the revolving note payable was approximately $10.0 million at December 31, 2009.  We complied with all covenants and requirements at December 31, 2009., 17517=Indicate by check mark whether the registrant (1) has filed all reports required to be filed by Section 13 or 15(d) of the Securities Exchange Act of 1934 during the preceding 12 months (or for such shorter period that the registrant was required to file such reports), and (2) has been subject to such filing requirements for the past 90 days. Yes x No o, 893460=Professional and administrative expenses reimbursed to affiliate from continuing operations for each of the years ended December 31, 2009 and 2008 were approximately $1.6 million.  There were no material offsetting changes in professional and administrative expenses reimbursed to affiliate for the years ended December 31, 2009 and 2008., 176353=·                  Castle Creek Apartments, which was purchased in 2006 and constructed in 1999, is a 276-unit luxury apartment complex located on a 16-acre tract in Indianapolis, Indiana.  As of December 31, 2009, the property was 92% occupied., 267255=We are not dependent upon any tenant for 10% or more of our revenues.  The loss of any one tenant should not have a material adverse effect on our business or financial performance.  The following table sets forth our ten largest tenants based on annualized base rent from continuing operations as of December 31, 2009., 891895=Professional and administrative expenses from continuing operations for the years ended December 31, 2009 and 2008 were approximately $1.1 million and $1.3 million, respectively.  The decrease of $0.2 million, or 15%, was primarily the result of an overall decrease in legal and professional fees.  There were no other material offsetting changes in professional and administrative expenses for the years ended December 31, 2009 and 2008., 79245=We pay distributions if and when authorized by our managing general partner.  We are required to pay distributions on a quarterly basis of an amount no less than sixty-five percent (65%) of our \u0093net cash flow from operations\u0094 as this term is defined in regulations promulgated by the Treasury Department under the Internal Revenue Code of 1986, as amended; provided that if a law is enacted or existing law is modified or interpreted in a manner that subjects us to taxation as a corporation or otherwise subjects us to entity level taxation for federal, state or local income tax purposes, we will adjust the amount distributed to reflect our obligation to pay tax.  Any distribution other than a distribution with respect to the final quarter of a calendar year shall be made no later than forty-five (45) days after the last day of such quarter based on our estimate of \u0093net cash flow from operations\u0094 for the year.  Any distribution with respect to the final quarter of a calendar year shall be made no later than ninety (90) days after the last day of such quarter based on actual \u0093net cash flow from operations\u0094 for the year, adjusted for any excess or insufficient distributions made with respect to the first three quarters of the calendar year.  For these purposes, \u0093net cash flow from operations\u0094 means taxable income or loss increased by:, 657277=a lease.  Due to the impact of \u0093straight-lining\u0094 on a historical consolidating basis, rental income exceeded the cash collected for rent by approximately $0.3 million for each of the years ended December 31, 2009 and 2008.  Cash collected for rent exceeded rental income by approximately $0.3 million for the year ended December 31, 2007.  If rental income calculated on a straight-line basis exceeds the cash rent due under the lease, the difference is recorded as an increase in deferred rent receivable and included as a component of accounts receivable on the relevant balance sheet.  If the cash rent due under the lease exceeds rental income calculated on a straight-line basis, the difference is recorded as a decrease in deferred rent receivable and is recorded as a decrease of accounts receivable on the relevant balance sheet.  We defer recognition of contingent rental income, such as percentage or excess rent, until the specified target that triggers the contingent rental income is achieved.  We periodically review the collectability of outstanding receivables.  Allowances are generally taken for tenants with outstanding balances due for a period greater than sixty days and tenants with outstanding balances due for a period less than sixty days but that we believe are potentially uncollectible., 305471=Balance as of December 31, 2009, 994762=March 29, 2010, 446584=2008, 179239=·                  Bed, Bath & Beyond, which was constructed in 1999, is an approximately 35,000 square foot facility in Louisville, Kentucky.  As of December 31, 2009, one tenant was leasing all 35,000 square feet.  The tenant is a retail service entity principally in the sale of domestic merchandise and home furnishings.  Bed, Bath & Beyond was 100% occupied as of December 31, 2009., 6689=Commission file number 001-32389, 167251=·                  Peachtree Corporate Center, which was constructed in 1979, is a business park with approximately 196,000 net rentable square feet in Atlanta, Georgia.  As of December 31, 2009, there were 41 tenants leasing space aggregating approximately 143,700 square feet.  The tenants are professional service entities, principally in sales-related services.  None of these tenants individually lease more than 10% of the net rentable area at Peachtree.  Peachtree was 73% occupied as of December 31, 2009., 990388=We have audited the accompanying consolidated balance sheet of NTS Realty Holdings Limited Partnership (the \u0093Partnership\u0094) as of December 31, 2009, and the related consolidated statements of operations, partners\u0092 equity and cash flows for the year then ended.  The Partnership\u0092s management is responsible for these financial statements.  Our responsibility is to express an opinion on these financial statements based on our audit., 1002099=except for the items restated for the Company\u0092s reclassification of the Outlet Mall and Sears Office Building from continuing operations to discontinued operations, as described in Note 2, as to which the date is March 29, 2010, 462388=During the year ended December 31, 2009, 136,400 units were purchased by the entities created or controlled by Mr. Nichols pursuant to the trading plans announced May 16, 2008; December 1, 2008; December 15, 2008; and December 1, 2009, respectively.  The table below summarizes activity pursuant to these plans for the quarterly period ended December 31, 2009., 768725=We may engage in transactions structured as \u0093like-kind exchanges\u0094 of property to obtain favorable tax treatment under Section 1031 of the Internal Revenue Code.  If we are able to structure an exchange of properties as a \u0093like-kind exchange,\u0094 then any gain we realize from the exchange would not be recognized for federal income tax purposes.  The test for determining whether exchanged properties are of \u0093like-kind\u0094 is whether the properties are of the same nature or character., 920571=Depreciation and amortization from continuing operations for the years ended December 31, 2009 and 2008 was approximately $17.3 million and $14.7 million, respectively.  The increase of $2.6 million, or 18%, was primarily due to our 2009 and 2008 acquisitions.  There were no other material offsetting changes in depreciation and amortization for the years ended December 31, 2009 and 2008., 992607=In our opinion, the consolidated financial statements referred to above present fairly, in all material respects, the financial position of NTS Realty Holdings Limited Partnership as of December 31, 2009, and the results of its operations and its cash flows for the year then ended, in conformity with accounting principles generally accepted in the United States of America., 160586=·                  NTS Center, which was constructed in 1977, is an office complex with approximately 123,000 net rentable square feet in Louisville, Kentucky.  As of December 31, 2009, there were 8 tenants leasing office space aggregating approximately 70,700 square feet, including 5,400 square feet which was leased but unoccupied.  NTS Center\u0092s tenants are professional service entities, principally in real estate, secondary education and information services.  One of these tenants individually lease more than 10% of the net rentable area at NTS Center.  NTS Center was 58% occupied as of December 31, 2009., 921306=Depreciation and amortization from continuing operations for the years ended December 31, 2008 and 2007 was approximately $14.7 million and $13.2 million, respectively.  The increase of $1.5 million, or 11%, was primarily due to our 2008 acquisition.  There were no other material offsetting changes in depreciation and amortization for the years ended December 31, 2008 and 2007., 762149=February, 2007, 861027=11%, was primarily the result of our 2009 and 2008 acquisitions, which was partially offset by a $0.1 million decrease in operating expenses reimbursed to affiliate across the remaining multifamily segment.  There were no other material offsetting changes in operating expenses reimbursed to affiliate for the years ended December 31, 2009 and 2008., 855807=Rental income and tenant reimbursements from continuing operations for the years ended December 31, 2008 and 2007 were approximately $40.9 million and $36.8 million, respectively.  The increase of $4.1 million, or 11%, was primarily the result of a $2.3 million increase in rental income from our 2008 acquisition, a $1.0 million increase in rental income across all of our remaining multifamily properties and a $0.7 million increase in rental income across the commercial segment.  There were no other material offsetting changes in rental income and tenant reimbursements for the years ended December 31, 2008 and 2007., 171558=·                  The Willows of Plainview Apartments, which was constructed in three phases between 1985 and 1988, is a 310-unit luxury apartment complex located on two tracts of land totaling 19.1-acres in Louisville, Kentucky.  As of December 31, 2009, the property was 96% occupied., 852524=Net (loss) income for the three years ended December 31, 2009, 2008 and 2007 was approximately ($17.2) million, $7.7 million and $3.9 million, respectively.  Our decrease in net income for the year ended December 31, 2009, as compared to 2008 was driven by an $18.9 million decrease in our gain on sale of discontinued operations, an increase of $4.8 million in interest expense and a decrease in operating income of approximately $1.7 million primarily related to the 2009 acquisitions and the 2008 acquisition, partially offset by an increase of approximately $0.5 million in net loss attributable to noncontrolling interests as the result of the 2009 acquisitions.  Our increase in net income for the year ended December 31, 2008, as compared to 2007 was driven by a $5.4 million increase in our gain on sale of discontinued operations and an increase in operating income in our partnership segment of approximately $0.5 million primarily related to increased interest income and decreased professional and administrative expenses and professional and administrative expenses reimbursed to affiliate.  The increase is offset by a decrease in income from discontinued operations of approximately $1.2 million primarily related to the sale of the Office Portfolio in May 2008 and an increase in the loss from investments in tenants in common of approximately $0.8 million., 890239=Property taxes and insurance from continuing operations for the years ended December 31, 2008 and 2007 were approximately $5.6 million, and $4.7 million, respectively.  The increase of $0.9 million, or 19%, was primarily due to a $0.7 million increase in property taxes at Castle Creek Apartments, Lake Clearwater Apartments and The Lakes Apartments due to higher property tax assessments and a $0.5 million increase in property taxes and insurance from our 2008 acquisition.  The increases were partially offset by a $0.3 million decrease in property taxes at Willow Lake Apartments due to a successful property tax assessment appeal.  There were no other material offsetting changes in property taxes and insurance for the years ended December 31, 2008 and 2007., 732895=August, 2007, 188715=·                  Creek\u0092s Edge at Stony Point Apartments, which was purchased in 2007 and constructed in 2006, is a 202-unit luxury apartment complex located on a 26.3-acre tract in Richmond, Virginia.  As of December 31, 2009, the property was 93% occupied.  We own a 51% tenant in common interest in this property., 854712=Rental income and tenant reimbursements from continuing operations for the years ended December 31, 2009 and 2008 were approximately $44.5 million and $40.9 million, respectively.  The increase of $3.6 million, or 9%, was primarily the result of a $4.8 million increase in rental income from our 2009 and 2008 acquisitions, which was partially offset by a $0.5 million decrease in rental income primarily related to the increase in rental concessions at our multifamily properties located in Tennessee and a $0.6 million decrease in occupancy related to Kroger\u0092s departure from NTS Center in October 2008.  There were no other material offsetting changes in rental income and tenant reimbursements for the years ended December 31, 2009 and 2008., 889150=Property taxes and insurance from continuing operations for the years ended December 31, 2009 and 2008 were approximately $6.5 million and $5.6 million, respectively.  The increase of $0.9 million, or 16%, was primarily due to a $1.0 million increase in property taxes and insurance from our 2009 and 2008 acquisitions and a $0.4 million increase in property taxes at Willow Lake Apartments due to higher property tax assessments.  The increases were partially offset by a $0.5 million decrease in property taxes at The Lakes Apartments, Castle Creek Apartments and Lake Clearwater Apartments.  There were no other material offsetting changes in property taxes and insurance for the years ended December 31, 2009 and 2008., 97531=Each of our general partners is controlled directly or indirectly by Mr. J.D. Nichols.  As of December 31, 2009, Mr. Nichols beneficially owns approximately 60.0% of the issued and outstanding limited partnership units.  Other entities controlled directly or indirectly by Mr. Nichols have made and may continue to make investments in properties similar to those that we acquired in the merger or contribution.  In addition, affiliates of our general partners currently own vacant lots located adjacent to our Outlet Mall property, located in Louisville, Kentucky.  These affiliates may acquire additional properties in the future, which are located adjacent to properties that we acquired in the merger or contribution., 767041=On June 23, 2009, we announced that we entered into an agreement to sell our Outlet Mall retail property to an unaffiliated third party.  The property was sold on March 12, 2010 for approximately $4.0 million in proceeds.  Pursuant to our management agreement, we paid a disposition fee of approximately $0.2 million, or 4%, of the gross sales price, to NTS Development Company.  We intend to use the proceeds from the sale to repay outstanding debt, for working capital requirements and/or to purchase properties in a manner that would qualify as a Section 1031 Exchange under the Internal Revenue Code., 729354=March, 2007, 25090=Documents Incorporated by Reference: Portions of the registrant\u0092s proxy statement for the annual meeting of limited partners to be held in 2010 are incorporated by reference into Part III of this Form 10-K., 90403=On April 11, 2006, the board of directors of NTS Realty Capital, our managing general partner, approved the Amended and Restated Agreement of Limited Partnership of NTS Realty Holdings Limited Partnership effective December 29, 2005.  The following policies were included:, 264144=(1)          We believe the changes in average occupancy from period to period are temporary effects of each property\u0092s specific mix of lease maturities and are not indicative of any known trend.  NTS Center was 58% occupied as of December 31, 2009., 181249=·                  Springs Station, which was constructed in 2001, is a retail facility with approximately 12,000 net rentable square feet in Louisville, Kentucky.  As of December 31, 2009, there were 7 tenants leasing space aggregating all 12,000 square feet.  The tenants are professional service entities, principally in, 792171=These assets and liabilities held for sale have been separately identified on our balance sheets at December 31, 2009 and 2008., 185384=·                  Golf Brook Apartments, which was purchased in 2009 and constructed between 1987 and 1988, is a 195-unit luxury apartment complex located on a 19.2-acre tract in Orlando, Florida.  As of December 31, 2009, the property was 93% occupied.  We own a 51% interest in this property., 693287=Pursuant to lease agreements signed by December 31, 2009, we are obligated to incur expenditures of approximately $1.2 million funded by borrowings on our debt during the next twelve months primarily for renovations and tenant origination costs necessary to continue leasing our properties. This discussion of future liquidity details our material commitments. We anticipate repaying, seeking renewal or refinancing of our note and mortgage payable coming due in the next twelve months., 164834=·                  Lakeshore Business Center Phase II, which was constructed in 1989, is a business center with approximately 95,700 net rentable square feet in Fort Lauderdale, Florida.  As of December 31, 2009, there were 18 tenants leasing space aggregating approximately 75,200 square feet.  The tenants are governmental and professional service entities, principally in medical equipment sales, financial and engineering services and technology.  One of these tenants individually leases more than 10% of the net rentable area at Lakeshore Business Center Phase II.  Lakeshore Business Center Phase II was 79% occupied as of December 31, 2009., 952169=The following table represents our obligations and commitments to make future payments as of December 31, 2009, under contracts, such as debt and lease agreements including principal and interest, and under contingent commitments, such as debt guarantees., 999560=In our opinion, the financial statements referred to above present fairly, in all material respects, the consolidated financial position of NTS Realty Holdings Limited Partnership at December 31, 2008 and the consolidated results of their operations and their cash flows for each of the two years in the period ended December 31, 2008, in conformity with U.S. generally accepted accounting principles.  Also, in our opinion, the related financial statement schedule III, when considered in relation to the basic financial statements taken as a whole, presents fairly in all material respects the information set forth therein., 861711=Operating expenses reimbursed to affiliate from continuing operations for the years ended December 31, 2008 and 2007 were approximately $4.4 million and $4.3 million, respectively.  The increase of $0.1 million, or 2%, was primarily the result of our 2008 acquisition.  There were no other material offsetting changes in operating expenses reimbursed to affiliate for the years ended December 31, 2008 and 2007., 264719=(2)          Sears Office Building was vacant and unoccupied at December 31, 2009, 2008 and 2007.}",
    "textBeforeTable": "  (Mark One)   FORM 10-K   Washington, D.C. 20549 SECURITIES AND EXCHANGE COMMISSION UNITED STATES       Table of Contents a09-36054_1ex21d01.htm EX-21.01 - EX-21.01 - NTS REALTY HOLDINGS LP a09-36054_1ex32d1.htm EX-32.1 - EX-32.1 - NTS REALTY HOLDINGS LP a09-36054_1ex32d2.htm EX-32.2 - EX-32.2 - NTS REALTY HOLDINGS LP a09-36054_1ex31d2.htm EX-31.2 - EX-31.2 - NTS REALTY HOLDINGS LP a09-36054_1ex31d1.htm EX-31.1 - EX-31.1 - NTS REALTY HOLDINGS LP filename file Attached files (adsbygoogle = window.adsbygoogle ||",
    "textAfterTable": "Indicate by check mark whether the registrant (1) has filed all reports required to be filed by Section 13 or 15(d) of the Securities Exchange Act of 1934 during the preceding 12 months (or for such shorter period that the registrant was required to file such reports), and (2) has been subject to such filing requirements for the past 90 days. Yes x No o   Indicate by check mark whether the registrant has submitted electronically and posted on its corporate Website, if any, every Interactive Data File required to be submitted and posted pursuant to Rule 405 of Regulation S-T (232.405 of this chapter) during the preceding 12 months (or for such shorter period that the registrant was required to submit and post such files.  Yes o No o   Indicate by check mark if disclosure of delinquent filers pursuant to Item 405 of Regulation S-K is not contained herein, and will not be contained, to the best of the registrant\u0092s knowledge, in definitive proxy or information statements incorporated by reference in Part III of this Form 10-K or any amendment to this Form 10-K. ",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}