{
    "relation": [
        [
            "Categories",
            "Great for these types of students",
            "Tips for prospective students",
            "Am enjoying being here",
            "Am learning a lot"
        ],
        [
            "Comments",
            "Great for students who have the motivation and are willing to study",
            "Hard work Friendship communicative Respectful",
            "I enjoy my stay at this school due to my hard work and friends.",
            "I am Majored in Environmental health science and just got during the first semester with a 3.14 GPA."
        ]
    ],
    "pageTitle": "Eastern Kentucky University (EKU) Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Eastern-Kentucky-University/reviews?_escaped_fragment_=/show/44655",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042981576.7/warc/CC-MAIN-20150728002301-00229-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 904314419,
    "recordOffset": 904243532,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{297823=Eastern Kentucky University is a great school. I graduated in May 2012 and I am now going back for my second bachelor's degree from them. I love the opportunities afforded by EKU that come along with a small college atmosphere., 396605=© 2015, Cappex.com, LLC, 282935=EKU is a great school, I transferred to EKU in August of 2012 to complete my bachelors degree and I am so glad I transferred when I did. I have completed a lot of my classes and have gotten extra certifications that I wouldn't have been able to at other schools and I feel that I am actually prepared for my career., 339489=I started here at EKU in Fall of 2013. I love the campus size, classroom sizes, teachers, and most importantly the students here as well. There will always be something to do on and off campus. You're not far from Lexington and Louisville, either. Everyone on campus is here to make sure you become successful. I plan on graduating from here. #ColonelPride, 108227=If you are looking to major in Education then EKU is the school for you. The major courses there are specifically designed to make you feel confident in all content areas. I am set to graduate in December of this year and I feel very satisfied with the education I have recieved.}",
    "textBeforeTable": "09/11/2009 Reviewer is A current student here. 12 out of 14 people found this review useful. 1 of 97 Stephanie from Cincinnati, OH Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5",
    "textAfterTable": "Am learning a lot The degrees I am pursuing are Fire Arson and Explosion Investigation & Correctional and Juvenile Justice Studies, a bit of a mouthful. Eastern Kentucky University happened to be the only school that offers the Arson Investigation Program, we are #1. I love being a Colonel and I love campus. This is a great school with a lot of dedicated teachers who have earned the title of Dr. Login to rate or flag the reviews Natalie from Lexington, KY 10/06/2010 Reviewer is A current student here. 11 out of 11 people found this review useful. 2 of 97 Categories Comments Great for these types of students It's great if you come from a small town and want to keep it that way on campus. If you're like me, you'll love how close it is to home, but still far enough away to be gone. Tips for prospective students Do your homework, study, and go to class! Talk to your teachers if you don't",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}