{
    "relation": [
        [
            "Categories",
            "What to do for fun",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "It's close to Lawrence & KC.",
            "Visit with your advisor about all opportunities for scholarships.",
            "Great campus! Wonderful opportunities!"
        ]
    ],
    "pageTitle": "Baker University Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Baker-University/reviews?_escaped_fragment_=/show/8528",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987135.9/warc/CC-MAIN-20150728002307-00019-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 900340347,
    "recordOffset": 900300881,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{42768=Baker usually has a sporting event going on almost every weekend and if you're a student here you get in for free! There is also chapel and bible studies offered during the week if you are looking for any religious aspects or just a break in your week. Baker also has a lot of free activities put on by the Student Activities Council such as free movie nights, study breaks during finals, ice skating sessions in the winter, trips to big sporting events such as the Sporting KC soccer games, comedians, and various musicians performing here on campus. With Baldwin City being in a central location you are never far from anything. In Baldwin itself you can go out to the Douglas County lake, go to the Baldwin City pool (when open), get together with friends at one of the parks, or go to the annual Maple Leaf Festival in October where many craft and food vendors display their works. Baldwin City is also only 20 minutes from Lawrence where there are many things to do such as getting frozen yogurt, seeing a movie, or just checking out the many different shops. Kansas City is only an hour from Baldwin City and there are a few large malls and shopping outlets, lots of places to go eat, movie theaters, and also an outdoor ice skating rink for the winter time. Also the airport is close by so don't worry about driving to far to go home or on spring break., 98515=Every year, during the third weekend of October, there is the Maple Leaf Festival. The Baker campus is part of the Tree Campus USA, and during this time of year, you can see all of the different trees changing color. At this festival, there are booths with crafts, food, clothes, jewelry, and much more. The whole town comes in to visit the Baker campus and stroll around downtown to take part in the festivities., 68486=If you come from a small town school, then Baker University is the place for you. It has great athletic programs in which over 50% of the students that attend Baker are in. The teacher to student ratio is around 10:1, so there is alot of one on one time. All the teachers are great and are flexible with there time schedules to accomodate the students. If you are interested in Greek Life, Baker has 3 Fraternities, and 3 Sororities. If you are wanting a job right out of college, then Baker is the place for you!, 75817=Maple Leaf Festival in Baldwin City- it's the third full week of October., 117364=Baker will be undergoing student union renovation in the summer 2013 which included the renovation of our old fashioned cafeteria. It is transforming into a modern day cafeteria with stations and booths for common tasty foods with regular updated menu. In addition to that a new sort of coffee shop with new menus is going to be opened. Baker is going to give even more pleasant dining experience as compared to now., 145556=© 2015, Cappex.com, LLC, 119485=Baker university is a beautiful, small and peaceful campus with good student teacher ratio of 1:18. It is quite expensive. Gifted with hardworking and understanding faculty members.}",
    "textBeforeTable": "01/04/2011 Reviewer is A current student here. 4 out of 5 people found this review useful. 1 of 33 Eldina from Saint Louis, MO Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 }",
    "textAfterTable": "Am enjoying being here I love being here on campus. This almost feels like a second home to me. It is a fantastic place to learn and grow. Am learning a lot I am learning so much not only about the course materials, but also how to grow up and take control of my own future. Login to rate or flag the reviews Tim from Manhattan, KS 01/27/2012 Reviewer is Researching this school. Reviewer has not been to campus. 2 out of 3 people found this review useful. 2 people found it offensive. 2 of 33 Categories Comments Tips for prospective students don't go. In three sentences terrible people who mislead and have no problem not telling you the truth. they say one thing then you find out it's not true, especially the department faculty i worked with. don't believe their claims of integrity.",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}