{
    "relation": [
        [
            "Categories",
            "Great for these types of students",
            "Share any unusual traditions or locations on campus",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "Students who like to have a personal, close-knit study body.",
            "There is this really beautiful spot on campus that is tucked away and only a few people know about it. It's full of vines and flowers that cascade down the wall and there's these big outdoor couches and it feels like you're escaping the world.",
            "Hmm. I go on walks with friends and longboard. I also like to go to Zumba class and read books on the lawn while the sunsets!",
            "Dining is alright. I mean, we have a really wide selection of food and we can take as much as we want. The food isn't always the best or that full of flavor but at least we are able to fill our bellies up every day!",
            "Dorm life is great! I have made amazing connections with the girls on my floor. It's like one big sleepover because you're living right across the hall from all your best friends!",
            "The homework load is big but bearable. I have been able to balance my work load with my social life. I've really had to make sure I'm making time for all my school work before I invest time in my other activities.",
            "Make sure you are prepared for professors who challenge you intellectually and spiritually! They will take your hidden talents and skills and expose them for you to see. The homework may be challenging, but it's only strengthening you.",
            "The size is perfect for people who aren't quite ready to be thrown into the real world. The professors are personal and attentive. My fellow classmates are wonderful and so unbelievably friendly!"
        ]
    ],
    "pageTitle": "Oklahoma Christian University Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Oklahoma-Christian-University/reviews?_escaped_fragment_=/show/19673",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988860.4/warc/CC-MAIN-20150728002308-00000-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 909148783,
    "recordOffset": 909100588,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{61742=ice skating (free during sga date week! and you don't actually have to have a date), the zoo (tons of concerts at the okc zoo ampitheater, if you're into concerts), work out (oc is building a new outdoor 5k running trail which will be completed in july 2012), get involved in sga., 17770=an annual tradition at oklahoma christian university is the holiday hussle. university and local community members gather together for a 5k race in november. spring sing is another tradition that has students, faculty, alumni and communities far and wide have come to love and enjoy. clubs compete through dance and music to achieve the ultimate prize of recognition and a club trophy., 208914=© 2015, Cappex.com, LLC, 100991=There are times when I have left campus at 10:30 and walked out to my car and felt completely safe. We have plenty of campus security to secure your safety.}",
    "textBeforeTable": "06/03/2009 Reviewer is A current student here. 14 out of 15 people found this review useful. 1 of 50 James from Keller , TX Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6,",
    "textAfterTable": "Am learning a lot The classes right now are just the basics for me personally so they are not amazing but much needed. I never realized how much math I did not know and napping in class is definitely not a habit you would like to build up. Overall you just have to learn how to be responsible for getting the work done and getting it done on time. Login to rate or flag the reviews Ty from Oklahoma City, OK 01/13/2011 Reviewer is A current student here. 5 out of 6 people found this review useful. 3 of 50 Categories Comments Great for these types of students Anyone who wants to continue their education after high school while being in a christian setting would feel right at home at OC. Bang for the buck For the technology they give you and all the things you get to do just for being a student, OC is affordable and",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}