{
    "relation": [
        [
            "Patent application number",
            "20120092816",
            "20120262383"
        ],
        [
            "Description",
            "ELECTRONIC DEVICE HAVING A HIDDEN INPUT KEY AND METHOD OF MANUFACTURING AN ELECTRONIC DEVICE - An electronic device comprises a housing having an outer face and an inner face. A key is provided on the housing, which comprises a micro hole formed in the housing and a conductive material extending within the micro hole to the outer face of the housing. A sensor is coupled to the conductive material to detect whether an object is brought into contact or out of contact with the micro hole at the outer face.",
            "TOUCH-SENSITIVE DEVICE AND COMMUNICATION DEVICE - Touch-sensitive device ("
        ],
        [
            "Published",
            "04-19-2012",
            "10-18-2012"
        ]
    ],
    "pageTitle": "Moran - Patent applications",
    "title": "",
    "url": "http://www.faqs.org/patents/inventor/moran-6/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042981576.7/warc/CC-MAIN-20150728002301-00263-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 434546287,
    "recordOffset": 434514404,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Jonas Moran, Torna Hallestad SE 05-02-2013 Bird deflector and air replacement system 20130104518 Published Description Patent application number John Patrick Moran, Lakeland, FL US 08-07-2014 CAPILLARY ABSORPTION SPECTROMETER AND PROCESS FOR ISOTOPIC ANALYSIS OF SMALL SAMPLES - A capillary absorption spectrometer and process are described that provide highly sensitive and accurate stable absorption measurements of analytes in a sample gas that may include isotopologues of carbon and oxygen obtained from gas and biological samples. It further provides isotopic images of microbial communities that allow tracking of nutrients at the single cell level. It further targets naturally occurring variations in carbon and oxygen isotopes that avoids need for expensive isotopically labeled mixtures which allows study of samples taken from the field without modification. The method also permits sampling in vivo permitting real-time ambient studies of microbial communities. 20140220700 Published Description Patent application number James J. Moran, Richland, WA US 01-07-2010 SYSTEM AND METHOD FOR VIDEO-PROCESSING ALGORITHM IMPROVEMENT - A method for improving a video-processing algorithm ( 20100002142 Published Description Patent application number James C. Moran, Oakville CA 12-17-2009 ADJUSTING MEANS - A single lever valve for mixing hot and cold liquids has a mixer which can internally impose an upper limit on the temperature of any liquid emerging from it. The means used may",
    "textAfterTable": "Kelley Margaret Moran, Kingsport, TN US Patent application number Description Published 20130261333 HYDROCARBOXYLATION OF FORMALDEHYDE IN THE PRESENCE OF A HIGHER ORDER CARBOXYLIC ACID AND HETEROGENEOUS CATALYST - Disclosed is a process for the production and purification of glycolic acid or glycolic acid derivatives by the carbonylation of formaldehyde in the presence of a solid acid catalyst and a carboxylic acid. This invention discloses hydrocarboxylations and corresponding glycolic acid separations wherein the glycolic acid stream is readily removed from the carboxylic acid and the carboxylic acid is recycled. 10-03-2013 20130261337 HYDROCARBOXYLATION OF METHYLENE DIPROPIONATE IN THE PRESENCE OF PROPIONIC ACID AND A HETEROGENEOUS CATALYST - Disclosed is a process for the production and purification of glycolic acid or glycolic acid derivatives by the carbonylation of methylene dipropionate in the presence of a solid acid catalyst and propionic acid. This invention discloses hydrocarboxylations and corresponding glycolic acid separations wherein the propionic acid stream is readily removed from the glycolic acid and the propionic acid is recycled. 10-03-2013 20130310598 Reactive Distillation of a Carboxylic Acid and a Glycol - Disclosed is a process for producing glycolate ester oligomers. The process comprises reacting ethylene glycol and glycolic acid to produce a stream of glycolate ester oligomers and glycolic acid oligomers while simultaneously removing water. The stream of glycolate ester oligomers and glycolic acid oligomers has a low concentration of water and glycolic acid-ends, and thus is useful in",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}