{
    "relation": [
        [
            "Categories",
            "What to do for fun",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "You will see signs everywhere about stuff happening on campus. Word of mouth travels fast too. You wont be bored.",
            "Every major has its rigors. Just be willing to work. This is the final segway between you and your career.",
            "Do not feel like you need to know your major when you get here. You can change. Professors are willing and excited to work with you. Come in with a good attitude, and you will succeed.",
            "The campus is small and connected. The academics and professors are challenging and push you forward. The student body is one of the most respectful and nice groups of people I have ever seen."
        ]
    ],
    "pageTitle": "Westminster College - Pennsylvania Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Westminster-College-Pennsylvania/reviews?_escaped_fragment_=/show/2516",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042981576.7/warc/CC-MAIN-20150728002301-00319-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 901082731,
    "recordOffset": 901048591,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{8241=At Westminster College, there is a 12:1 student/faculty ratio. This provides students with the opportunity to have one on one time with the professors. The professors are always in their offices waiting to give academic advice, proofread a paper, or to simply talk. In fact, most of my professors requested a one on one meeting just to get to know the students better. While some colleges have student professors, Westminster’s professors are all highly acclaimed in their field, and they are extremely knowledgeable and capable of teaching students what they know. There are also free tutors on campus who are willing to proofread papers, help you understand a concept, or answer your questions. Knowing professors and peers are there to help makes it easy to succeed even in tough courses. This is probably why 98% of Westminster Graduates have a job or are enrolled in Grad School within a year of graduating., 118021=Go to first year events! they may sound stupid or lame (and they are), but they are also a great time to make friends. I made some of my best friends there! Also, get to know your RA on a 1:1 level, trust me they want to talk to you, and they've also probably got some experience with anything you are possibly going through., 138926=© 2015, Cappex.com, LLC}",
    "textBeforeTable": "08/13/2009 Reviewer is A current student here. 6 out of 6 people found this review useful. 1 of 32 Quinn from Beaver Falls, PA Check out reviews left by other students or leave your own review. You could win a free scholarship. Westminster College - Pennsylvania Reviews Westminster College - Pennsylvania › Pennsylvania › By State › Colleges › } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.create', -->",
    "textAfterTable": "Login to rate or flag the reviews Rebecca from New Castle, PA 01/12/2010 Reviewer is A current student here. 6 out of 6 people found this review useful. 2 of 32 Categories Comments Great for these types of students Westminster College is an excellent campus for students who enjoy a friendly, exciting, and safe environment. Whether it's the students, professors, or faculty, everyone on campus will greet you with a warm smile. The college is also perfect for students who prefer a small campus. It is easy to know more people and to be known, and it's nearly impossible to get lost! There are many activities available on campus, whether you enjoy sports, music, or nature. In addition, it is also great for students who enjoy serving their community. The fraternities, sororities, and many of the other clubs provide students with opportunities to go out in the community and make a difference. The largest of these is the Habitat for Humanity group which renovates local homes. Since it is affiliated with the Presbyterian Church, there are many opportunities to get involved in Bible studies and worship",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}