{
    "relation": [
        [
            "Categories",
            "Campus Safety",
            "Greek Life",
            "Clubs and Activities",
            "Great for these types of students",
            "Bang for the buck",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "Campus Safety is Terrible, alot of break ins from the locals during holidays and breaks.",
            "Greek Life is OK!! Its what you make of it",
            "Association of Campus Entertainment, SGA",
            "Great for all type of students.",
            "Tuition when I first applied was pretty affordable. Out of all the UNC's UNC Pembroke is about the cheapest one.",
            "I am involved in a lot of campus organizations, I have many friends and we find things to do.",
            "Not that many food options that are healthy, Cafe food is OK.",
            "I recommend all freshmen to live in a dorm there first year. Dorm living is plus because your able to meet new people and adapt.",
            "UNC PEMBROKE is not difficult. There are some hard classes and there are some easy classes. As long as you stay on top of your studies, you should be fine at UNC P.",
            "Have a GPA of at least a 2.6 and higher to apply. Apply to many Scholarships. Do well on SAT and ACT test.",
            "Rural, Its what you make of it, get involved."
        ]
    ],
    "pageTitle": "University of North Carolina at Pembroke Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/University-of-North-Carolina-at-Pembroke/reviews?_escaped_fragment_=/show/47439",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042981576.7/warc/CC-MAIN-20150728002301-00231-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 908914399,
    "recordOffset": 908823432,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{313844=The original school was founded by lumbee Indians, so there are a lot of natives around the area. Every fourth of July have a huge festival that bring lumbees from all over its definitely something that you should check out if you ever wanted to learn more about a different culture!, 483820=© 2015, Cappex.com, LLC, 35062=With a student-faculty ration of 15:1 I would assume that one-on-one time is more readily available at UNC Pembroke than at other schools. Furthermore, having spoken to various admissions representatives, current and former students, the quality of education has been portrayed as one which is well-rounded and addresses students' personal and educational needs. Determining a major might be difficult if you begin school undeclared because UNC Pembroke offers 41 undergraduate programs, 17 graduate programs, and 1 certification programs. Personally I believe that a smaller school that has a variety of programs available and teachers willing to give students individual attention is the best type of school., 39043=Graduated in 1979 and coming back for an add-on licensure. Taking on-line classes, works for my busy schedule and prices are a little less than the larger schools. Learning a great deal in my field of study., 175598=This university is in the middle of Lumbee territory. You will learn a lot about these Native Americans while you are here. Be sure to check out their Pow Wows and the Lumbee Homecoming in July., 434658=I paid $2000 for my first semester and that includes my books, I took 16 credit hours., 463913=When I first came to Pembroke in 2011, the cafeteria food was tolerable. Now (2014), the cafeteria food is MUCH better! They've made some serious overhauls and it's actually delicious. There are also other options for food nearby in the same building, but be prepared to pay a little more for the convenience., 32302=I am the second oldest of four siblings, my older sister is going to be a junior in college the fall I begin, and my two younger brothers will graduate in 2015 and 2016. One of my parents is self-employed, and the other makes enough to pay the bills and put a little aside each month for a rainy day. Thank God the House signed for the tax cut extension compromise, I was glued to CNN until they made the announcement because my family wouldn't make it with $40 out of each paycheck. UNC Pembroke is an exceptional institution and thankfully also one of the most affordable in North Carolina, with a cost of $12,366.00 (2010-2011) for state residents, you don't get much better than that for a 4 year institution, you don't get much better than that unless you attend community college (which I am not knocking in any way). However, realistically, no one can deny that anything under $20, 000 nowadays isn't a steal when it comes to education., 303902=I would say the area has normal small town prices with gas at $3.30 as of April 26th 2013 and the price of a 16oz Coke being $1.25. A beer at the local hang out spot called Mighty J's is around $2.00. School tuition is very inexpensive compared to other Universities., 33541=Although I have never been on campus, I will be visiting during the February open house. It may sound crazy, but UNC Pembroke was my first choice and the only school I applied to. If you speak to either Christina Bell or Tony Lewis in the admissions office they will tell you that this is the school that I wanted to attend. Even though Pembroke has approximately 80 student organizations including Greek Life and Honors programs, these were not my priority. I have heard, from some locals visiting Charlotte, that every 4th of July there is a huge celebration in Pembroke and that the community is more like a family. Personally I like the sound of that. A current student, a 2011 graduate and personal friend of mine, told me which dorm rooms she thought were the best, and given that we have exactly the same preferences in living spaces, I am just going to work out any kinks that may arise on campus in the fall of 2012. I looked up the school's credentials, safety ratings, and asked all the students, faculty, and locals that I have encountered how they like the community. Having been told the school is extremely safe, diverse, and generally speaking an exceptional place to live, I know that I will love being on campus., 23186=It is VERY easy to overload your schedule. I have learned from personal experience that you cannot do everything and can be difficult to tell the people you respect, No. Go to bed at a somewhat decent hour, i.e., before 3:30 in the morning. When teachers say that college is a lot more work than high school, they really do mean it. It is a LOT of work. Teachers WILL NOT accept late work like they did in high school., 363579=It is a very cheap/inexpensive University. Its the cheapest in-state, if im not mistaken. I pay roughly 2400 per semester, as a commuter and still get the full college effect, with the exception of the dorm life. (Which is something Im not missing out on, from what Ive heard and experienced)}",
    "textBeforeTable": "07/16/2009 Reviewer is A current student here. 22 out of 23 people found this review useful. 1 of 114 Emily from Fayetteville, NC Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new",
    "textAfterTable": "Will enjoy being here I have lived in Pembroke all of my life (for 16 years) and I am Native American just like mainly every one else in Pembroke. Its safe around here. There is not a huge crime rate at all. Yeah stuff happens but thats everywhere. I have visted the school like a million times and it is a very nice campus in my opinion. Will learn a lot I have family that go to UNCP and they say that the learning environment is great!! Login to rate or flag the reviews Nyaisha from Charlotte, NC 06/04/2009 Reviewer is A current student here. 9 out of 19 people found this review useful. 2 people found this inaccurate. 3 of 114 Categories Comments Tips for prospective students Vist before attending this school. Not every one can handle being in the middle of no where. Login to rate or flag",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}