{
    "relation": [
        [
            "Information",
            "SUBJECT",
            "AGE",
            "GENDER",
            "STIM TARGET",
            "BI/UNI-LATERAL",
            "EFF FREQ",
            "INEFF FREQ",
            "INTENSITY",
            "PULSE WIDTH",
            "MODE",
            "STIM CONTACTS",
            "YEAR DIAGNOSED",
            "YEAR DBS RIGHT",
            "YEAR DBS LEFT",
            "TOT DAILY MED",
            "150% SINGLE DOSE"
        ],
        [
            "Description",
            "2 character subject identification: Stimulation target (v=Vim, s=STN, g=GPi), and Subject number (1-16)",
            "Age at the time of testing (years)",
            "Male (n=11) or female (n=5)",
            "Vim = ventro-intermediate nucleus of the thalamus GPi = internal Globus Pallidus STN=subthalamic nucleus",
            "Bilateral stimulation (n=12) or unilateral stimulation (n=4)",
            "Frequency (Hz) of effective stimulation (> 100 Hz)",
            "Frequency (Hz) of so-called ineffective stimulation (< 100 Hz)",
            "Stimulation intensity (V)",
            "Stimulation pulse width (µsec)",
            "Cont = continuous stimulation, Cycl=cyclic stimulation (e.g. 1 minute on, 1 second off)",
            "Listed in order of proximal distal direction on quadripolar stimulating electrode: - negative polarity + positive polarity . not stimulated",
            "Year diagnosed with Parkinson's disease",
            "Year of right brain DBS surgery",
            "Year of left brain DBS surgery",
            "Total medication of morning, noon and evening doses (mg)",
            "Dose taken before testing \"medication on\" condition (mg)"
        ]
    ],
    "pageTitle": "Effect of Deep Brain Stimulation on Parkinsonian Tremor",
    "title": "",
    "url": "http://www.physionet.org/physiobank/database/tremordb/?C=M;O=A",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042981576.7/warc/CC-MAIN-20150728002301-00078-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 662525263,
    "recordOffset": 662510333,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{37443=Updated Tuesday, 14 July 2015 at 13:16 EDT}",
    "textBeforeTable": "subject_description.txt contains information on the 16 subjects: The file Subjects 9-16 with low amplitude tremor (LAT) who are receiving DBS to relieve other symptoms such as rigidity or dyskinesias (Group 2). Subjects 1-8 with high amplitude tremor (HAT) who are receiving DBS to relieve tremor (Group 1), and Subjects: The 16 subjects can be divided into two groups: For the \"medication off\" condition, the subject did not take any medication for at least 12 hours. For the \"medication on\" condition, the subject took 150% of his or her morning dose of dispersible Modopar and testing began after the neurologist determined the medication had taken effect (approximately 40 minutes). Please note that not all subjects were tested under all conditions. every 15 minutes when DBS was stopped for 60 minutes (medication off) [total: 46 recordings of approx 60 seconds each] two conditions of DBS (on-off) and two conditions of medication (L-dopa on-off) [total: 55 recordings of approx 60 seconds each] DBS/Medication Conditions: Tremor was recorded for approximately 60 seconds under various conditions: The raw data were obtained using a low intensity velocity-transducing laser that was directed at a piece of reflective paper on the subject's index finger tip (Figure 2), with the output voltage proportional to the velocity of the finger. Figure 2. Velocity laser recording of rest tremor.",
    "textAfterTable": "Filename Structure: The file name structure of the records is: 2 character subject identification: stimulation target (v=Vim, s=STN, g=GPi) and subject number (1-16) 1 character tremor type: r = resting tremor 1 character DBS condition: e = effective (> 100 Hz), o = no stimulation (optional) 2 character time since stimulator arrest: if a 2 digit number follows the DBS condition, it indicates the number of minutes since the stimulation was stopped 1 character medication condition: n= medication on, f=medication off 3 character extension indicates the side tested: let = left index finger tremor, rit = right index finger tremor Filename Examples: s6ren.let contains a recording (approx. 60 sec) of rest tremor in the left index finger of subject 6 in the \"dbs on and medication on\" condition: the subject had taken 150 % of his or her morning dose of L-dopa and was receiving \"effective\" stimulation of the STN. v4rof.rit contains a recording (approx. 60 sec) of rest tremor in the right index finger of subject 4 in the \"dbs off and medication off\" condition: the subject was off medication for at least 12 hours and the subject's stimulator (implanted in the Vim) was switched off. g1r30of.rit contains a recording (approx. 60 sec) of rest tremor in the right index finger of subject 1 at 30-minutes after the stimulator (implanted in the",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}