{
    "relation": [
        [
            "Location: SWITCHING POINT",
            "Highway: 9022 SIEMPRE VIVA ROAD",
            "County: SAN DIEGO, CA"
        ],
        [
            "Mile Post:",
            "Origin:",
            "Destination:"
        ],
        [
            "Shipper:",
            "Bill of Landing:",
            "Cargo:"
        ]
    ],
    "pageTitle": "Servicio De Transporte Internacional Y Local SA DE CV PASA | Federal Motor Carrier Safety Administration",
    "title": "",
    "url": "http://www.fmcsa.dot.gov/international-programs/mexico-cross-border-trucking-pilot-program/servicio-de-transporte-1",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 125,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987135.9/warc/CC-MAIN-20150728002307-00291-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 447749743,
    "recordOffset": 447721544,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{87764=Pertaining to this item we inform you that we have had a stock ownership and managerial relationship with International Transportation Services, Inc, a US corporation incorporated in 1993 but did not carry out any transportation activities until January 20I2, when operating authority was granted to the company. The main partners of this company are Mr. Raul Valenzuela and Hector Mendoza., 86786=Federal Motor Carrier Administration 1200 New Jersey Avenue SE Washington, DC 20590, 88255=If this requirement applies to the applicant, provide the name of the Affiliated company the latter's MC or MX Number its USDOT Number if any and the company's latest U.S. DOT safety rating. Applicant must indicate whether these entities have been disqualified from operating commercial motor vehicles anywhere in the United States pursuant to Section 219 of the Motor Carrier Safety Improvement Act of 1999. (Pub. L.106-159, 113 Stat.l748) (MCSIA)., 89289=This entity has never been disqualified from operating commercial motor vehicles pursuant to section 219 of the Motor Carrier Safety Administration act of 1999., 86452=USDOT #: 557341Z Applicant's Name: Servicio de Transporte Internacional y Local, S.A. de C.V. dba: STIL Address: Prolongacion Paseo Del Bosque # 9750 Ciudad Juarez, Chih, Mexico, C.P. 32470, 295264=1200 NEW JERSEY AVENUE, SE, 89717=At the time the OP-1 was submitted in October 20 11, International Transportation Services, Inc. was not undertaking transportation activities. It was until January 2012, that operating authority as a carrier was granted to this company under MC-770314-C US DOT2257332, remaining Mr. Raul Valenzuela and Hector Mendoza as the main partners.}",
    "lastModified": "Thu, 30 Jul 2015 06:24:27 GMT",
    "textBeforeTable": "Gross Revenue: $28,714,609.00     for year ending: 12/31/2011 Business: Corporation N/A Cargo Tank: N/A N/A Shipper: N/A Non-HM Carrier: Intrastate Interstate Operation Types Territory: Location of Review/Audit: Company facility in another country Scope: Entire Operation Review Type: Safety Audit - Pre-Authority (OP1) Application Tracking #: 11024 Federal Tax ID: 74-2696904 (EIN) RFC #: STI911202-C13 MC/MX #: 226885 Legal: SERVICIO DE TRANSPORTE INTERNACIONAL Y LOCAL SA DE CV Operating (DBA): STIL   UNITED STATES DEPARTMENT OF TRANSPORTATION",
    "textAfterTable": "Fax E-Mail Address: hector.mendoza@stil.com.mx Company Mailing Address: 310 N MESA STE 402 EL PASO, TX 79901 Process Agent Address: 2503 E YANDELL EL PASO, TX 79903 Contact Name: MARIA GARCIA Phone numbers: (1) (915) 838-1080 (2) Fax (915) 351-2372 E-Mail Address: Carrier Classification Authorize for Hire Cargo Classification Other: AUTO PARTS, SPEAKER",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}