{
    "relation": [
        [
            "Project Details",
            "Translation Volume: 4127 words Completed: Aug 2007 Languages: English to Greek",
            "Translation Volume: 24277 words Completed: Jun 2007 Languages: English to Greek",
            "Translation Volume: 2898 words Completed: May 2007 Languages: English to Greek",
            "Translation Volume: 7000 words Completed: May 2007 Languages: English to Greek",
            "Translation Volume: 3226 words Completed: May 2007 Languages: English to Greek"
        ],
        [
            "Project Summary",
            "Legal/Divorce petition Divorce petition and supporting documents. Law (general)",
            "Medical device operator's manual IT (Information Technology), Medical: Cardiology",
            "Medical device software installation manual IT (Information Technology), Medical: Cardiology",
            "Ambulatory ECG recorder/controller Ambulatory ECG recorder/controller, operation's manual Medical: Cardiology",
            "Treadmill operator's manual Treadmill for diagnostic stress tests, operator's manual Medical (general)"
        ],
        [
            "Corroboration",
            "positive : High quality translation, excellent communication, reliable",
            "positive Unlisted : No comment.",
            "positive Unlisted : No comment.",
            "positive Unlisted : No comment.",
            "positive Unlisted : No comment."
        ]
    ],
    "pageTitle": "Katerina Athanasaki - English to Greek translator. Translation services in Medical (general) - Greek translator, traductor de griego, uebersetzer, uebersetzerin, Griechish, Englisch, translation, proofreading, subtitling, editing, legal, medical, cardiology, IVD, medical instruments, pharma, life sciences, pharmaceutical, healthcare, health care, traducción, traduccion, μετάφραση, μεταφράσεις, μεταφραστής, English, Englisch, Deutsch, Aleman, Spanish, German, ελληνικά, Greek, griego, ingles, CAT, CAT tools, XML, TRADOS, tags, tag, tagged, Workbench, Tag editor, SDLX, Idiom Worldserver Workbench, Windows XP, Logoport, Passolo, software localisation, localization, medical translation, medical translator, medical translations, translation of user manuals, user manuals, copywriting, post-dtp proofreading, cultural adaptation",
    "title": "",
    "url": "http://www.proz.com/translator/49184",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988860.4/warc/CC-MAIN-20150728002308-00010-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 691339887,
    "recordOffset": 691304300,
    "tableOrientation": "VERTICAL",
    "textBeforeTable": "5 projects entered    5 positive feedback from outsourcers Project History PRO-level points: 1085, Questions answered: 393, Questions asked: 79 KudoZ activity (PRO) Less More Transport / Transportation / Shipping Poetry & Literature Cinema, Film, TV, Drama Furniture / Household Appliances Games / Video Games / Gaming / Casino Finance (general) Government / Politics",
    "textAfterTable": "More Less Portfolio Sample translations submitted: 6 English to Greek: Annuloplasty band user's guide Detailed field: Medical: Cardiology Source text - English CONTRAINDICATIONS • Heavily calcified valves. • Valvular retraction with severely reduced mobility. • Active bacterial endocarditis. WARNINGS For single use only • Only surgeons who have received adequate training to determine whether incompetent, stenotic or diseased heart valves are capable of being repaired or replaced should use this device. • Only surgeons who have received appropriate training in valve repair, including band implant and sizing techniques, should use this device. • Care should be taken that sutures are not placed in atrial tissue, as this may result in impairment of the cardiac conduction system. • Intra-operative and/or post-operative echocardiography, in conjunction with a cardiologist, should be used to evaluate the effectiveness of the valve repair. Minimizing regurgitation and systolic anterior motion (SAM) are important elements of an effective repair. • Surgeons who use annuloplasty bands should be current on all anticoagulation regimes. • When post-operative",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}