{
    "relation": [
        [
            "Item Code",
            "RSDA1BTXDVHS14",
            "RSDA2BTXDVHS14"
        ],
        [
            "Version",
            "Standard",
            "Pumped"
        ],
        [
            "Price",
            "£667.00",
            "£763.00"
        ],
        [
            "Free Delivery On These Items (UK Mainland)",
            "",
            ""
        ]
    ],
    "pageTitle": "Aqualisa Rise Digital Showers | Aqualisa Rise Showering | The Original Bathroom Company",
    "title": "",
    "url": "http://www.originalbathroomcompany.co.uk/html/showers/Aqualisa_Rise.htm",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042981576.7/warc/CC-MAIN-20150728002301-00128-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 633717391,
    "recordOffset": 633702900,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{5468=Call us on 01772 611622 (ask for website sales) if you need any help or advice, or prefer to order on the phone.}",
    "lastModified": "Mon, 15 Jun 2015 14:17:12 GMT",
    "textBeforeTable": "Aqualisa Rise Digital Concealed Shower On Riser Range: Aqualisa - Rise Item Code: RSDA1BV14 & RSDA2BV14 Details: Aqualisa Rise Digital Concealed Shower On Riser (No diverter on this model). Rise Digital showers offer simplicity, great showering and, above all, the reassurance that only comes from intelligent digital showering technology. This technology includes three intelligent water saving features - Warm up, Pause and Timer, which can be activated if desired. The added luxury of a remote control means that you'll never have to experience a blast of cold water when you reach in to turn your shower on. Warm up - once your shower reaches temperature, Rise will stop the water flow and hold it until it is time to start showering. Pause - save water when shampooing or shaving by pausing your shower for up to 2 minutes. Timer - control your showering time by setting a pre-set timer - ideal for keeping an eye on water usage, especially amongst younger members of the family. Features: 5 spray handset with massage function, adjustable head on riser, one touch control with 'shower ready' lighting display, water saving warm up, pause and pre-set shower timer, remote control. Concealed Systems: A concealed Digital showers hot and cold blended water pipe is concealed in the wall. This makes for a neat and compact shower, where only the showers control and shower head are visible.",
    "textAfterTable": "Click for larger image Aqualisa Rise Digital Exposed Shower On Riser Range: Aqualisa - Rise Item Code: RSDA1EV14 & RSDA2EV14 Details: Aqualisa Rise Digital Exposed Shower On Riser (No diverter on this model). Rise Digital showers offer simplicity, great showering and, above all, the reassurance that only comes from intelligent digital showering technology. This technology includes three intelligent water saving features - Warm up, Pause and Timer, which can be activated if desired. The added luxury of a remote control means that you'll never have to experience a blast of cold water when you reach in to turn your shower on. This exposed, single outlet model can be up and running in a matter of hours, with no damage to your tiles or decor. Warm up - once your shower reaches temperature, Rise will stop the water flow and hold it until it is time to start showering. Pause - save water when shampooing or shaving by pausing your shower for up to 2 minutes. Timer - control your showering time by setting a pre-set timer - ideal for keeping an eye on water",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}