{
    "relation": [
        [
            "Task ID",
            "ipv6",
            "network",
            "config-services"
        ],
        [
            "Operations",
            "read, write",
            "read, write",
            "read, write"
        ]
    ],
    "pageTitle": "Cisco IOS XR IP Addresses and Services Command Reference for the Cisco XR 12000 Series Router, Release 4.1 - Network Stack IPv4 and IPv6 Commands [Cisco IOS XR Software (End-of-Sale)] - Cisco",
    "title": "",
    "url": "http://www.cisco.com/c/en/us/td/docs/routers/xr12000/software/xr12k_r4-1/addr_serv/command/reference/b_ipaddr_cr41xr12k/b_ipaddr_cr41xr12k_chapter_01000.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 125,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987135.9/warc/CC-MAIN-20150728002307-00266-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 360068703,
    "recordOffset": 359995175,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{7976=For detailed information about network stack concepts, configuration tasks, and examples, refer to the Cisco IOS XR IP Addresses and Services Configuration Guide for the Cisco XR 12000 Series Router.}",
    "TableContextTimeStampAfterTable": "{191103=The DupAddrDetectTransmits node configuration variable (as specified in RFC 2462, IPv6 Stateless Address Autoconfiguration) is used to automatically determine the number of consecutive neighbor solicitation messages that are sent on an interface while duplicate address detection is performed on a tentative unicast IPv6 address., 125094=Configuring an IPv4 virtual address enables you to access a dual RP router from a single address without prior knowledge of which RP is active. An IPv4 virtual address persists across RP failovers. For this to happen, the virtual IPv4 address must share a common IPv4 subnet with a Management Ethernet interface on both RPs. On a Cisco XR 12000 router, in which each RP has multiple Management Ethernet interfaces (two on PRP-1 or three on PRP-2), the virtual IPv4 address maps to whichever Management Ethernet interface on the active RP with which it shares a common IP subnet., 313587=The following example configures a pool of 1024 IP addresses:, 227177=This keyword must be in the form documented in RFC 2373 where the address is specified in hexadecimal using 16-bit values between colons., 35085=The following example shows how to set 192.168.1.27 as the primary address and 192.168.7.17 and 192.168.8.17 as the secondary addresses on interface 0/1/1/0:, 210754=0 milliseconds (unspecified) is advertised in router advertisements, and the value 1000 is used for the neighbor discovery activity of the router itself., 191469=The interval between the sending of duplicate address detection neighbor solicitation messages (the duplicate address detection timeout interval) is specified by the neighbor discovery-related variable RetransTimer (as specified in RFC 2461, Neighbor Discovery for IP Version 6 [IPv6]), which is used to determine the time between retransmissions of neighbor solicitation messages to a neighbor when the address is being resolved or when the reachability of a neighbor is being probed. This is the same management variable used to specify the interval for neighbor solicitation messages during address resolution and neighbor unreachability detection. Use the ipv6 nd ns-interval command to configure the interval between neighbor solicitation messages that are sent during duplicate address detection., 71357=One common application that requires IPv4 helper addresses is Dynamic Host Configuration Protocol (DHCP), which is defined in RFC 1531. DHCP protocol information is carried inside of BOOTP packets. To enable BOOTP broadcast forwarding for a set of clients, configure an IPv4 helper address on the networking device interface physically closest to the client. The IPv4 helper address should specify the address of the DHCP server. If you have multiple servers, you can configure one IPv4 helper address for each server. Because BOOTP packets are forwarded by default, DHCP information can now be forwarded by the networking device. The DHCP server now receives broadcasts from the DHCP clients., 109612=If you are configuring Intermediate System-to-Intermediate System (IS-IS) across a POS interface, you should configure the POS interface as unnumbered. This strategy allows you to conform to RFC 1195, which states that IP addresses are not required on each interface., 313232=The following example creates a local IPv4 address pool named “pool2,” which contains all IPv4 addresses in the range 172.16.23.0 to 172.16.23.255:, 210355=Interval (in milliseconds) between IPv6 neighbor solicit transmissions. Range is 1000 to 3600000., 235314=The following example includes the IPv6 prefix 2001:0DB8::/35 in router advertisements sent out POS interface 0/1/0/0 with a valid lifetime of 1000 seconds and a preferred lifetime of 900 seconds:, 230708=All prefixes configured on interfaces that originate IPv6 router advertisements are advertised with a valid lifetime of 2592000 seconds (30 days) and a preferred lifetime of 604800 seconds (7 days), and with both the “onlink” and “autoconfig” flags set., 131424=This argument must be in the form documented in RFC 2373 where the address is specified in hexadecimal using 16-bit values between colons., 21858=The rfc keyword selects a source address that conforms to RFC 1812. RFC 1812 states that when generating an ICMP packet, the source address must be one of the addresses on the outgoing physical interface. If such an address is not available, selection may resort to the global router ID., 179426=MTU in bytes. Range is 1280 to 65535 for IPv6 packets. The maximum MTU size that can be set on an interface depends on the interface medium., 249130=seconds : 1800 seconds}",
    "textBeforeTable": "Syntax Description interface-path-id ] [ interface-type address duplicate ipv6 clear To trigger a Duplicate Address Detection (DAD) request for addresses that are found in DUPLICATE status, use the clear ipv6 duplicate address command. If a request is already triggered , then the clear ipv6 duplicate address command clears the DUPLICATE status of an address and makes it usable. clear ipv6 duplicate address vrf (mhost) vrf (description) vrf(address-family) vrf show vrf show mpa ipv6 show mpa ipv4 show mpa groups show mpa client show ipv6 traffic show ipv6 neighbors summary show ipv6 neighbors show ipv6 interface show ipv6 interface show ipv4 traffic show local pool show ipv4 interface show clns statistics show arm vrf-summary show arm summary show arm registrations producers show arm router-ids show arm database show arm conflicts local pool ipv6 unreachables disable ipv6 neighbor ipv6 nd suppress-ra ipv6 nd scavenge-timeout",
    "textAfterTable": "Command Default None Command Modes EXEC Command History Release Modification Release 3.8.0 This command was introduced. Usage Guidelines If none of the optional keywords is specified, the command iterates through all the duplicate addresses and retriggers a DAD request for each of these addresses. Task ID Task ID Operations network read, write IPv6 execute Examples The following example shows how to use the clear ipv6 duplicate address command:  RP/0/0/CPU0:router# clear ipv6 duplicate address",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}