{
    "relation": [
        [
            "Patent application number",
            "20100044110",
            "20100206553",
            "20110042069",
            "20110203791",
            "20110220348",
            "20110220415",
            "20140173995"
        ],
        [
            "Description",
            "Ultra-low friction coatings for drill stem assemblies - Provided are drill stem assemblies with ultra-low friction coatings for subterraneous drilling operations. In one form, the coated drill stem assemblies for subterraneous rotary drilling operations include a body assembly with an exposed outer surface including a drill string coupled to a bottom hole assembly or a coiled tubing coupled to a bottom hole assembly and an ultra-low friction coating on at least a portion of the exposed outer surface of the body assembly, wherein the coefficient of friction of the ultra-low friction coating is less than or equal to 0.15. The coated drill stem assemblies disclosed herein provide for reduced friction, vibration (stick-slip and torsional), abrasion and wear during straight hole or directional drilling to allow for improved rates of penetration and enable ultra-extended reach drilling with existing top drives.",
            "Coated oil and gas well production devices - Provided are coated oil and gas well production devices and methods of making and using such coated devices. In one form, the coated oil and gas well production device includes an oil and gas well production device including one or more bodies, and a coating on at least a portion of the one or more bodies, wherein the coating is chosen from an amorphous alloy, a heat-treated electroless or electro plated based nickel-phosphorous composite with a phosphorous content greater than 12 wt %, graphite, MoS",
            "Coated sleeved oil and gas well production devices - Provided are coated sleeved oil and gas well production devices and methods of making and using such coated sleeved devices. In one form, the coated sleeved oil and gas well production device includes an oil and gas well production device including one or more bodies and one or more sleeves proximal to the outer or inner surface of the one or more bodies, and a coating on at least a portion of the inner sleeve surface, outer sleeve surface, or a combination thereof, wherein the coating is chosen from an amorphous alloy, a heat-treated electroless or electro plated based nickel-phosphorous composite with a phosphorous content greater than 12 wt %, graphite, MoS",
            "COATED SLEEVED OIL AND GAS WELL PRODUCTION DEVICES - Provided are coated sleeved oil and gas well production devices and methods of making and using such coated sleeved devices. In one form, the coated sleeved oil and gas well production device includes one or more cylindrical bodies, one or more sleeves proximal to the outer diameter or inner diameter of the one or more cylindrical bodies, hardbanding on at least a portion of the exposed outer surface, exposed inner surface, or a combination of both exposed outer or inner surface of the one or more sleeves, and a coating on at least a portion of the inner sleeve surface, the outer sleeve surface, or a combination thereof of the one or more sleeves. The coating includes one or more ultra-low friction layers, and one or more buttering layers interposed between the hardbanding and the ultra-low friction coating. The coated sleeved oil and gas well production devices may provide for reduced friction, wear, erosion, corrosion, and deposits for well construction, completion and production of oil and gas.",
            "Coated Oil and Gas Well Production Devices - Provided are coated oil and gas well production devices and methods of making and using such coated devices. In one form, the coated device includes one or more cylindrical bodies, hardbanding on at least a portion of the exposed outer surface, exposed inner surface, or a combination of both exposed outer or inner surface of the one or more cylindrical bodies, and a coating on at least a portion of the inner surface, the outer surface, or a combination thereof of the one or more cylindrical bodies. The coating includes one or more ultra-low friction layers, and one or more buttering layers interposed between the hardbanding and the ultra-low friction coating. The coated oil and gas well production devices may provide for reduced friction, wear, erosion, corrosion, and deposits for well construction, completion and production of oil and gas.",
            "ULTRA-LOW FRICTION COATINGS FOR DRILL STEM ASSEMBLIES - Provided are drill stem assemblies with ultra-low friction coatings for subterraneous drilling operations. In one form, the coated drill stem assemblies for subterraneous rotary drilling operations include a body assembly with an exposed outer surface including a drill string coupled to a bottom hole assembly, a coiled tubing coupled to a bottom hole assembly, or a casing string coupled to a bottom hole assembly and an ultra-low friction coating on at least a portion of the exposed outer surface of the body assembly, hardbanding on at least a portion of the exposed outer surface of the body assembly, an ultra-low friction coating on at least a portion of the hardbanding, wherein the ultra-low friction coating comprises one or more ultra-low friction layers, and one or more buttering layers interposed between the hardbanding and the ultra-low friction coating. The coated drill stem assemblies disclosed herein provide for reduced friction, vibration (stick-slip and torsional), abrasion, and wear during straight hole or directional drilling to allow for improved rates of penetration and enable ultra-extended reach drilling with existing top drives.",
            "METHODS OF MAKING A DRILLING TOOL WITH LOW FRICTION COATINGS TO REDUCE BALLING AND FRICTION - Provided are methods to make a drilling tool with low friction coatings to reduce balling and friction. In one form, the method includes providing one or more drilling tool components with specified locations for fitting cutters, inserts, bearings, rollers, additional non-coated components, or combinations thereof; cleaning the one or more drilling tool components; applying masking for fitting cutters, inserts, bearings, rollers, additional non-coated components or combinations thereof; applying a multi-layer low friction coating to the cleaned specified locations; removing the masking from the cleaned and coated specified locations of the one or more drilling components; inserting cutters and inserts and assembling moving parts to the cleaned and coated specified locations of the one or more drilling tool components; and assembling the one or more drilling tool components to form a drilling tool."
        ],
        [
            "Published",
            "02-25-2010",
            "08-19-2010",
            "02-24-2011",
            "08-25-2011",
            "09-15-2011",
            "09-15-2011",
            "06-26-2014"
        ]
    ],
    "pageTitle": "Bailey, TX - Patent applications",
    "title": "",
    "url": "http://www.faqs.org/patents/inventor/bailey-tx-3/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987135.9/warc/CC-MAIN-20150728002307-00130-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 438650095,
    "recordOffset": 438606602,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Jeffrey Roberts Bailey, Houston, TX US //]]> BarDraw('2567543',['Patent applications by Jeffrey R. Bailey, Houston, TX US'],[[1,1,1,2,4,3,1]],['2005','2009','2010','2011','2012','2013','2014'],0); // <script type=\"text/javascript\"> </div> <div id=\"legend2567543\" align=\"center\"></div> </div> <canvas id=\"bg2567543\" style=\"max-width: 500px; width: 100%;\"></canvas> <div> <p align=\"center\">Patent applications by Jeffrey R. Bailey, Houston, TX US</p> <div class=\"bar2567543\" style=\"max-width: 500px; width: 100%; float:left; \"> <div align=\"left\" style=\"padding-top:20px;\"> </table> </tbody> </tr> <td>09-18-2014</td> <td><a href=\"/patents/app/20140277752\">Drilling Advisory Systems and Methods to Filter Data</a> - Integrated methods and systems for optimizing drilling related operations include recording data, parsing the data into intervals and analyzing the intervals to determine if the performance data in each time interval is of sufficient quality for using the interval data in a performance optimization process. The quality assessment may involve evaluating the data against a set of determined standards or ranges. The performance optimization process may utilize data mapping and/or modeling to make performance optimization process recommendations.</td> <td>20140277752</td> <tr> </tr> <td>10-24-2013</td> <td><a href=\"/patents/app/20130282342\">Modeling and Designing of Well Drilling System That Accounts For Vibrations</a> - A method and apparatus associated with the production of hydrocarbons is disclosed. The method, which relates to modeling of drilling equipment, includes constructing one or more design configurations for at least a portion of a bottom hole assembly (BHA) and calculating results from each of the one or more design configurations. The calculated results of the modeling may include one or more performance indices that characterize the BHA vibration performance of the design configurations for operating parameters and boundary conditions that are substantially the same",
    "textAfterTable": "Patent applications by Jeffrey Roberts Bailey, Houston, TX US Jennifer L. Bailey, Pampa, TX US Patent application number Description Published 20090131715 Processes for preparing organic compounds having improved color characteristics - Carboxylic acids, ketones, and esters having improved color characteristics are produced by combining small quantities of water with these compounds. An amount of water ranging from about 100 ppm to about 50,000 ppm of the organic compound is combined to provide lighter color compounds in comparison to these same compounds to which no water is added. Additionally, the color characteristics of the organic compounds may be improved by introducing a stream of the organic compound into at least one distillation column maintained at a temperature of about 23° C. to about 250° C. and at a pressure of about 10.1 kPa to about 202.6 kPa. Subjecting the organic compound stream to distillation under these conditions allows precursors of color bodies, having boiling points lower than the boiling point of the product being produced, to thermally breakdown or to be removed in the overhead stream form the distillation column. 05-21-2009 Joel Brad Bailey, Austin, TX US Patent application number Description Published",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}