{
    "relation": [
        [
            "Input Name",
            "zipCodeList",
            "startDate",
            "numDays",
            "Unit",
            "format"
        ],
        [
            "Example",
            "20910",
            "2004-04-27",
            "7",
            "e",
            "12 hourly"
        ],
        [
            "Description",
            "The zip code of the area for which you want NDFD grid points.",
            "The beginning day for which you want NDFD data. If the string is empty, the start date is assumed to be the earliest available day in the database. This input is only needed if one wants to shorten the time window data is to be retrieved for (less than entire 7 days worth), e.g. if user wants data for days 2-5.",
            "The number of days worth of NDFD data you want. If the string is empty, numDays is assumed to be the full amount of daysi in the database. This input is only needed if one wants to shorten the time window data is to be retrieved for (less than entire 7 days worth), e.g. if user wants data for days 2-5.",
            "The unit data is to be retrieved in. The default value is U.S. Standard, or English units (\"e\"). A string value of \"m\" will return data in Metric, or SI units (The International System of Units). If the string is empty, data will be returned in U.S. Standard units, thus the input is only needed for metric conversion.",
            "There are two formats. The “24 hourly” format returns NDFD data summarized for a 24 hour period running from 6:00 AM to 6:00 AM. The “12 hourly” format summarizes NDFD data into two 12 hour periods per day that run from 6:00 AM to 6:00 PM and 6:00 PM to 6:00 AM"
        ]
    ],
    "pageTitle": "National Digital Forecast Database XML/REST Service - NOAA's National Weather Service",
    "title": "",
    "url": "http://graphical.weather.gov/xml/rest.php",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042981576.7/warc/CC-MAIN-20150728002301-00110-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 102070907,
    "recordOffset": 102047888,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{101229=All latitude and longitude values provided as input or in the output DWML are based on the World Geodetic System 1984 (WGS84). For more inforation on the NDFD spatial reference system see the NDFD Spatial Reference System page., 64696=http://graphical.weather.gov/xml/sample_products/browser_interface/ndfdXMLclient.php?whichClient=GmlLatLonList&gmlListLatLon=38.99,-77.02 39.70,-104.80 47.6,-122.30&featureType=Forecast_Gml2Point&&begin=2000-01-01T00:00:00&end=2015-01-01T00:00:00&compType=Between&propertyName=maxt,wx, 30296=http://graphical.weather.gov/xml/sample_products/browser_interface/ndfdXMLclient.php?lat1=35.00&lon1=-82.00&lat2=35.5&lon2=-81.50&resolutionSub=20.0&product=time-series&begin=2004-01-01T00:00:00&end=2013-04-21T00:00:00&maxt=maxt&mint=mint, 57279=http://graphical.weather.gov/xml/sample_products/browser_interface/ndfdXMLclient.php?centerPointLat=38.0&centerPointLon=-97.4&distanceLat=50.0&distanceLon=50.0&resolutionSquare=20.0&product=time-series&begin=2004-01-01T00:00:00&end=2013-04-21T00:00:00&maxt=maxt&mint=mint, 25228=http://graphical.weather.gov/xml/sample_products/browser_interface/ndfdXMLclient.php?listLatLon=38.99,-77.02 39.70,-104.80 47.6,-122.30&product=time-series&begin=2004-01-01T00:00:00&end=2013-04-20T00:00:00&Unit=e&maxt=maxt&mint=mint, 104483=NDFD-XML: Updated the degrib executable and ndfdXMLserver.php and the wsdl: ndfdXML.wsdl, for NDFD Web Service to address missing elements (maxrh, minrh, iceaccum, 6 Tropical wind threshold probabilities). Mar 13, 2014 at 11AM Easter Time. A new deployment of the NDFD REST And SOAP Web Service will be implemented to address Maximum Relative Humidity, Minimum Relative Humidity, and Ice Accumulation not dissiminating via the Web Service. They have been added to the weatherParameters array in ndfdXMLserver.php file. Also, 2 defunct elements, the tstmprb and tstmcat, were removed from the ndfdXML.wsdl file. Also, there was a long standing issue with the 6 Tropical Wind Threshold Probability elements (incw34, incw50, incw64, cumw34, cumw50, cumw64) causing Seg Faults depending on list of point's in query, or a doubling up of the data. NDFD-XML: New NDFD SOAP/REST XML Web Service Install Tuesday June 19th, 2012 On Tuesday, June 19th, MDL will install a new version of the NDFD SOAP/REST XML Web Service. The release is for the addition of two new NDFD elements: Maximum and Minimum Daily Relative Humidity. This should not interrupt services, except for those who have scripts in which every parameter must be denoted: i.e., for a new SOAP Request, the following will need to be added: ------------------------------------------------------------------------------------------------------------------------- maxrh xsi:type=\"xsd:boolean\">0 /maxrh> ------ minrh xsi:type=\"xsd:boolean\">0 /minrh> -------------------------------------------------------------------------------------------------------------------------------- On Mon June 18th or Tuesday June 19th, as the time of the switchover becomes clear, we will send out another email, we will post the information on the NDFD Web Service yahoo list forum at http://tech.groups.yahoo.com/group/NDFD_SOAP_Service/ and post the information here in xml_changes.xml (http://graphical.weather.gov/xml/xml_changes.xml and http://graphical.weather.gov/xml/xml_change_notices.php) Please use the following channels to let us know of any problems accessing the NDFD Web Service immediately after the switch: 1) Email the NIDS support crew at nids.support@noaa.gov ----------------------------------------------- 2) Open up a trouble ticket with the National Weather Service Telecommunication Gateway's TOC (Traffic Operations Center) at toc.nwstg@noaa.gov ------------------------------------------------- 3) Use the NDFD Web Service yahoo list forum to report issues: http://tech.groups.yahoo.com/group/NDFD_SOAP_Service/ NDFD-XML: Maximum and Minimum Relative Humidity added to NDFD Web Service Two new Fire Weather elements, Maximum and Minimum Relative Humidity, will be added for dissimination through the NDFD Web Service. For more information see the Technical Implementation Notice (TIN). The name of the elements are \"maxrh\" and \"minrh\", seen here in the WSDL (http://graphical.weather.gov/xml/SOAP_server/ndfdXMLserver.php?wsdl). Changes list last updated Thursday 01st 1970f January 1970 12:00:00 AM, 21568=http://graphical.weather.gov/xml/sample_products/browser_interface/ndfdXMLclient.php?lat=38.99&lon=-77.01&product=time-series&begin=2004-01-01T00:00:00&end=2013-04-20T00:00:00&maxt=maxt&mint=mint, 50207=http://graphical.weather.gov/xml/sample_products/browser_interface/ndfdXMLclient.php?citiesLevel=12&product=time-series&begin=2004-01-01T00:00:00&end=2013-04-21T00:00:00&maxt=maxt&mint=mint, 69814=http://graphical.weather.gov/xml/sample_products/browser_interface/ndfdXMLclient.php?gmlListLatLon=38.99,-77.02+39.70,-104.80+47.6,-122.30&featureType=Forecast_Gml2Point&begin=2000-01-01T00:00:00&end=2018-01-01T00:00:00&compType=Between&propertyName=maxt,wx, 44668=http://graphical.weather.gov/xml/sample_products/browser_interface/ndfdXMLclient.php?zipCodeList=20910+25414&product=time-series&begin=2004-01-01T00:00:00&end=2013-04-21T00:00:00&maxt=maxt&mint=mint, 38191=http://graphical.weather.gov/xml/sample_products/browser_interface/ndfdXMLclient.php?endPoint1Lat=38.99&endPoint1Lon=-77.01&endPoint2Lat=39.99&endPoint2Lon=-78.01&product=time-series&begin=2004-01-01T00:00:00&end=2013-04-21T00:00:00&maxt=maxt&mint=mint}",
    "textBeforeTable": "Single Point Unsummarized Data: Returns DWML-encoded NDFD data for a point What is the NDFD REST Service? National Digital Forecast Database (NDFD) REST service provides the public, government agencies, and commercial enterprises with data from the National Weather Service’s (NWS) digital forecast database.   This service, which is defined in a Service Description Document, provides NWS customers and partners the ability to retrieve NDFD data over the internet that is encoded in XML. The XML dialect used is called Digital Weather Markup Language (DWML) and its schema can be found at the following link: http://graphical.weather.gov/xml/DWMLgen/schema/DWML.xsd The schema defines the XML language’s vocabulary (available tags and attributes) and syntax (expected order of tags).   Knowing how DWML is constructed, users can write programs to process the XML document to get at the data it contains. To see a sample Digital Weather Markup Language document that conforms to the DWML schema, click on any of the following links: http://graphical.weather.gov/xml/DWMLgen/schema/latest_DWML.txt http://graphical.weather.gov/xml/DWMLgen/schema/latest_DWML_glance.txt http://graphical.weather.gov/xml/DWMLgen/schema/latest_DWMLByDay24hr.txt http://graphical.weather.gov/xml/DWMLgen/schema/latest_DWMLByDay12hr.txt Why provide an NDFD REST service? The National Weather Service is striving to serve society’s needs for weather information by evolving its services from a text-based paradigm to one based on making NWS information available quickly, efficiently, and in convenient and understandable forms.   The NDFD is one example of this transformation.   NDFD REST takes yet another step towards a digital services era by",
    "textAfterTable": "Unit e The unit data is to be retrieved in. The default value is U.S. Standard, or English units (\"e\"). A string value of \"m\" will return data in Metric, or SI units (The International System of Units). If the string is empty, data will be returned in U.S. Standard units, thus the input is only needed for metric conversion. One or more ndfd elements maxt=maxt&mint=mint The NDFD parameters that you are requesting.   For valid inputs see the NDFD Element Names Page. A sample query string follows: http://graphical.weather.gov/xml/sample_products/browser_interface/ndfdXMLclient.php?lat=38.99&lon=-77.01&product=time-series&begin=2004-01-01T00:00:00&end=2013-04-20T00:00:00&maxt=maxt&mint=mint Multiple Point Unsummarized Data: Returns DWML-encoded NDFD data for a list of points Input Name Example Description listLatLon 38.99,-77.02 39.70,-104.80 List of WGS84 latitude and longitude pairs for the points for which you want NDFD data.   Each point's latitude and longitude value is seperated by a comma. Each pair (one latitude and longitude value) is separated by a space. Number of points requested can not exceed 200. product time-series There are two products.   The “time-series” product returns all data between the start and",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}