{
    "relation": [
        [
            "Parameter",
            "extension",
            "bucket"
        ],
        [
            "Description",
            "The replacement file extension.",
            "(Optional) Common to all obj.conf functions. Adds a bucket to monitor performance. For more information, see The bucket Parameter."
        ]
    ],
    "pageTitle": "Chapter 7 Predefined SAFs and Filters in obj.conf (Oracle iPlanet Web Server 7.0.9 Administrator's Configuration File Reference)",
    "title": "",
    "url": "http://docs.oracle.com/cd/E19146-01/821-1827/6nmpl1h51/index.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988860.4/warc/CC-MAIN-20150728002308-00084-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 76516303,
    "recordOffset": 76462828,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{389192=Regardless of whether the $docroot variable has been defined in server.xml, its value is set to /var/www/docs/closed when the server is accessed after 5:00 p.m. and before 8:00 a.m. local time.}",
    "lastModified": "Wed, 26 Jan 2011 11:10:38 GMT",
    "textBeforeTable": "basic-auth Parameters Table 7–1 The following table describes parameters for the basic-auth function. Parameters The basic-auth function verifies the authorization information sent by the client. The Authorization header is sent as part of the basic server authorization scheme. This function is usually used with the PathCheck-class function require-auth. basic-auth set-variable match-browser In addition, the following common SAFs are valid for the AuthTrans directive: qos-handler get-sslid basic-ncsa basic-auth The following AuthTrans-class functions are described in detail in this section: The Authtrans directive instructs the server to check for authorization before allowing a client to access resources. For more information, see AuthTrans. AuthTrans For more information on performance buckets, see Using Performance Buckets in Oracle iPlanet Web Server 7.0.9 Performance Tuning, Sizing, and Scaling Guide. The all-requests bucket records perfdump statistics for all NSAPI SAFs, including those in the default-bucket. The default-bucket records statistics for the functions not associated with any user-defined or built-in bucket. The following performance buckets are predefined: The bucket parameter is common to all SAFs. You can measure the performance of any SAF in obj.conf by adding a bucket=bucket-name parameter",
    "textAfterTable": "userfn Name of the user custom function to verify authorization. This function must have been previously loaded with load-modules. It has the same interface as all of the SAFs, but it is called with the user name (user), password (pw), user database (userdb), and group database (groupdb), if supplied, in the pb parameter. This function checks the name and password using the database and returns REQ_NOACTION if they are not valid. It returns REQ_PROCEED if the name and password are valid. The basic-auth function will then add auth-type, auth-user (user), auth-db (userdb), and auth-password (pw, Windows only) to the rq->vars pblock. For more information on custom functions, see Chapter 2, Creating Custom Server Application Functions, in Oracle iPlanet Web Server 7.0.9 NSAPI Developer’s Guide. groupdb (Optional) Specifies the full path and file name of the user database. This parameter will be passed to the group function.  groupfn (Optional) Name of the group custom function that must have been previously loaded with load-modules. It has the same interface as all of the SAFs, but it is called with the user name (user), password (pw), user database (userdb), and group database (groupdb) in the pb parameter. This parameter also has access to the auth-type, auth-user (user), auth-db (userdb), and auth-password (pw, Windows only)",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}