{
    "relation": [
        [
            "Categories",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "It is very academically challenging so be prepared to work.",
            "An outstanding institution. Very challenging courses and the professors care about your future. Beautiful campus."
        ]
    ],
    "pageTitle": "Bucknell University Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Bucknell-University/reviews?_escaped_fragment_=/show/29438",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988860.4/warc/CC-MAIN-20150728002308-00054-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 908350275,
    "recordOffset": 908314275,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{39156=Almost all of the dorms have AC. They are all pretty spacious, and everything on campus is in easy walking distance--it only takes about 8 minutes to walk from the farthest edge of campus to the other. Your freshman hall oftentimes becomes your family and closest friends throughout your four years here. Some of the dorms are a little older, but have gone under extensive renovations in the past few years. And by 2014, we will have brand new dorms for upperclassmen, which are rumored to be apartment-style., 130733=© 2015, Cappex.com, LLC, 94523=There is a clear difference in quality of dorming for freshman as opposed to upperclassmen, but I think this is the case at many other schools as well. I love my dorming situation and lucked out with a wonderful roommate my freshman year in 2009.}",
    "textBeforeTable": "07/21/2009 Reviewer is A current student here. 22 out of 22 people found this review useful. 1 of 28 Margaret from Islip, NY Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp",
    "textAfterTable": "Bang for the buck If you are going for an engineering degree, every engineering student I've spoken with has gotten a job offer right out of senior year. Bucknell prepares their students for the work force. They teach you how to solve problems and use your own resources to come up with solutions. That's not to say that engineers are the only ones who succeed. The College of Engineering is only a small portion of the student population. The other Liberal Arts majors can excel in many aspects, from business, to art, to drama, to education. Am enjoying being here I have never felt so at home when I'm not at home. Bucknell is beautiful, open, and welcoming in every sense of the word. There is excellent food, nice dorms and great faculty who will come and eat lunch with you if you invite them. The social scene is mostly Greek dominated, so over 50% of the student population is involved in Greek Life. There are also great concerts and speakers which come to the campus frequently. The university makes sure that the student body gets a chance to experience things outside the bubble as it's not close to any major cities. Am learning a lot As a small private school,",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}