{
    "relation": [
        [
            "Payment method",
            "",
            "Postal order/Banker's draft",
            "Personal cheque"
        ],
        [
            "Preferred/Accepted",
            "PayPal preferred",
            "Accepted",
            "Accepted"
        ],
        [
            "",
            "",
            "",
            ""
        ]
    ],
    "pageTitle": "Funeral For A Friend - Streetcar - UK 2 track CD NEW | eBay",
    "title": "",
    "url": "http://www.ebay.co.uk/itm/Funeral-Friend-Streetcar-UK-2-track-CD-NEW-/130773023758?pt=UK_CDsDVDs_CDs_CDs_GL&hash=item1e72adfc0e",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042981576.7/warc/CC-MAIN-20150728002301-00269-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 424655731,
    "recordOffset": 424603696,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Payment details receiving cleared payment - opens in a new window or tab. Will usually dispatch within 3 working days of Domestic dispatch time payment clears - opens in a new window or tabestimated delivery date . based on the seller’s dispatch time and delivery service. Delivery times may vary, especially during peak periods and will depend on when your * You’ll see an Seller ships within 3 days after receiving cleared payment - opens in a new window or tab. Thu. 6 Aug. and Wed. 12 Aug. Estimated between Standard Int'l Postage United States",
    "textAfterTable": "Seller's payment instructions All payments must be in UK pounds sterling ONLY, no exceptions. Payments must be received within 7 days of auction end or negative feedback will be left, DO NOT BID IF YOU DO NOT INTEND TO BUY!! All items are sent out in secure mailers and are well protected. Items will be sent as soon after payment has been received/ cleared as possible, always within 4 days. Please email with any questions and happy bidding!! Current bid amount + + import charges (shown at checkout) time left ##2## left | Bid count",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}