{
    "relation": [
        [
            "Initiator phone security level",
            "Nonsecure",
            "Secure"
        ],
        [
            "Feature used",
            "Barge",
            "Barge"
        ],
        [
            "Call security level",
            "Encrypted call",
            "Encrypted call"
        ],
        [
            "Results of action",
            "Call barged and identified as nonsecure call",
            "Call barged and identified as secure call"
        ]
    ],
    "pageTitle": "Cisco Unified IP Phone 8961, 9951, and 9971 Administration Guide for Cisco Unified Communications Manager 9.0 (SIP) - Cisco Unified IP Phone [Cisco Unified IP Phones 9900 Series] - Cisco",
    "title": "Table 4 Call Security Interactions when using Barge",
    "url": "http://www.cisco.com/c/en/us/td/docs/voice_ip_comm/cuipph/9971_9951_8961/9_0_1/english/admin_guide/P567_BK_A3A732A5_00_admin-guide-8961_9951_9971-9_0/P567_BK_A3A732A5_00_admin-guide-8961_9951_9971-9_0_chapter_01.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042981576.7/warc/CC-MAIN-20150728002301-00324-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 376570775,
    "recordOffset": 376527921,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{34219=Network port (10/100/1000 SW) with IEEE 802.3af and 802.3at power enabled, 109964=SDP capabilities, such as codec types, DTMF detection, and comfort noise, are normally configured on a global basis by Cisco Unified Communications Manager or Media Gateway in operation. Some SIP endpoints may allow configuration of these parameters on the endpoint itself., 4914=Network port (10/100/1000 SW) with IEEE 802.3af and 802.3at power enabled, 3741=Computer port (10/100/1000 PC) connection, 13427=Solid green : May be a connected call or an outgoing call that is not yet connected. If the call is connected, press this button to display the call details or the participants of a conference call. If the call is not yet connected, press this button to end the call.}",
    "textBeforeTable": "Connect your phone to the corporate IP telephony network, using the following diagram. Phone Connections for Cisco Unified IP Phone 8961 Buttons and Hardware Phone Connections for Cisco Unified IP Phone 8961 The following sections describe attributes of the Cisco Unified IP Phone 8961. Cisco Unified IP Phone 8961 Phone and Cable Lock Connect Footstand Cisco Unified IP Phone 9971 Cisco Unified IP Phone 9951 Cisco Unified IP Phone 8961 Cisco Unified IP Phone 8961, 9951, and 9971 components. For more information, see Cisco Unified IP Phone 8961, 9951, and 9971 User Guide for Cisco Unified Communications Manager. This section describes the Cisco Unified IP Phone 8961, 9951, and 9971 Using a cell, mobile, or GSM phone, or two-way radio in close proximity to a Cisco Unified IP Phone might cause interference. For more information, see the manufacturer’s documentation of the interfering device. Caution A Cisco Unified IP Phone,",
    "textAfterTable": "The following diagram shows the phone from the side. 1 USB port 2 Accessory connector; for example, to connect a Cisco Unified IP Color Key Expansion Module Note Each USB port supports the connection of up to five supported and nonsupported devices. Each device connected to the phone is included in the maximum device count. For example, the USB port on your phone can support a maximum of five USB devices (such as three Cisco Unified IP Color Key Expansion modules, one hub, and one other standard USB device). Many third-party USB products count as multiple USB devices, for example, a device containing USB hub and headset can count as two USB devices. For more information, see the USB device documentation. Buttons and Hardware Your phone provides quick access to your phone lines, features, and call sessions: Programmable feature buttons (left side): Use to view calls on a line",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}