{
    "relation": [
        [
            "CRN",
            "78994",
            "78995",
            "78997"
        ],
        [
            "COURSE NO.",
            "NA 1020",
            "NA 1093",
            "NA 1190"
        ],
        [
            "SEC",
            "353",
            "353",
            "953"
        ],
        [
            "DAYS",
            "WF",
            "WF",
            "MWF"
        ],
        [
            "TIMES",
            "8:00 - 10:15 AM",
            "11:00 - 2:20 PM",
            "7:00 - 2:15 PM"
        ],
        [
            "ROOM",
            "WS II 209",
            "WS II 213",
            "TBA"
        ],
        [
            "CAMPUS",
            "WESTSIDE",
            "WESTSIDE",
            "OFF CAMPUS"
        ]
    ],
    "pageTitle": "Learning Communities — Central New Mexico Community College",
    "title": "",
    "url": "http://www.cnm.edu/student-resources/class-schedule/learning-communities",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988860.4/warc/CC-MAIN-20150728002308-00162-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 382496367,
    "recordOffset": 382474559,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{687=This paring of courses is required for gaining EMT-Basic licensure in the State of New Mexico. Students must also take HLTH 1001 as a pre- or corequisite. If taking HLTH 1001 as a co-requisite, please do so IN THE FIRST TWO WEEKS OF THE TERM .These linked courses create a community of students gaining the knowledge, skills, and behaviors required to provide entry-level emergency care in the pre-hospital environment. The clinical Course EMS 1190 has an 4 week classroom component along with a clinical experience in the hospital, which is scheduled OUTSIDE OF REGULAR CLASS HOURS AT A HOSPITAL. Please register for the learning communities as grouped below.}",
    "TableContextTimeStampAfterTable": "{43102=9:45-1:20 PM, 37385=PCT 1020, 2206=8:00 - 8:50 AM, 38259=PCT 1092, 46394=9:30-11:20 AM, 42813=8:00-9:35 AM, 13829=Ready for a challenge? Want to earn college credit for English 1101 while taking English 0950? If you place into English 0950, you can take this co-requisite course in which you will learn to write college essays, conduct research, cite sources, and master grammar. Best of all, you will finish English 0950 and English 1101 in one semester instead of two. Be prepared to attend regularly, read faithfully, discuss enthusiastically, and write critically! Norton Field Guide textbook provided free for students' use in this course., 19243=9:30-10:45 AM, 26285=10:30-11:45 AM, 12064=EMS 1412, 3291=9:00AM-11:50 AM, 18046=Are you enrolling in MATH 1315, College Algebra this Semester? Would you like to:, 19534=10:50-11:50 AM, 21252=3:30-4:45 PM, 5614=6:00 - 7:50 PM, 32668=7:00 - 2:15 PM, 20539=2:50-3:15 PM, 15198=6:00 - 7:15 PM, 29392=NA 1020, 38365=11:15 - 2:45 PM, 6708=9:00 - 12:50 PM, 44807=4:30-5:45 PM, 27598=11:30-11:55 AM, 12355=EMS 1493, 22545=7:20-7:45 PM, 3917=8:00-8:50 AM, 1875=12:30 - 3:20 PM, 22255=6:00-7:15 PM, 15925=10:30 - 12:20 PM, 434=EMS 1001, 15091=ENG 1101, 37966=PCT 1090, 8297=9:00 - 11:50 AM, 29681=NA 1093, 12171=9:00 - 11:50 PM, 29971=NA 1190, 18471=If you answered yes to the questions above, consider signing up for MATH 1315 (College Algebra) and MATH 1316 (College Algebra workshop). These two back-to-back classes form our new Paced College Algebra Learning Community., 48401=12:00-1:50 PM, 24561=11:30-11:55 PM, 17653=12:00-1:15 PM, 10124=9:00 - 4:20 PM, 2089=EMS 1190, 1758=EMS 1093, 539=8:00 - 10:20 AM, 5280=9:00 - 5:20 PM, 54109=Why is our society the way it is? Why do some people have so much and others so little? Why do some people fit in and others don’t? Why does your family interact the way it does? If you have questions like these you are ready for the sociological perspective. In Intro to Sociology you will develop a better understanding of the social forces that affect you and how you might act collectively to make a real impact on society. Enroll in both RDG0950 and SOC1101 by choosing a learning community and the reading prerequisite is automatically waived., 30077=1:30 - 8:45 PM, 23258=9:30-10:40 AM, 45499=Ever wonder why people do what they do? How can we manage stress better? Why do we fall in love? How do we learn? Why do we forget? Would you like to take Psychology 1105, but you need a Reading 0950 prerequisite? You don’t have to wait! Enroll in both courses by choosing a learning community and the reading prerequisite is automatically waived., 1575=9:00 - 11:50AM, 21542=4:50-5:15 PM, 42993=PHLB 1092, 17545=MATH 1315, 56499=3:00-4:15 PM, 46577=PSY 1105, 8866=3:30 - 5:30 PM, 19426=MATH 1316, 40240=7:00 - 12:45 PM, 17254=MATH 1310, 38072=7:00 - 2:20 PM, 38656=8:30 - 2:45 PM, 45104=6:00-8:45 PM, 43282=PHLB 1090, 46684=9:00-10:15 AM, 7313=8:00 - 8:50AM, 26582=11:50-12:15 PM, 7011=1:30 - 5:20 PM, 32377=11:00 - 2:20 PM, 55389=SOC 1101, 4982=6:00 - 8:50 PM, 3604=12:30PM-3:20 PM, 16225=10:30 - 11:45 PM, 29497=3:00 - 5:15 PM, 1468=EMS 1053, 17362=12:00-1:45 PM, 29786=5:30 - 8:50 PM, 23551=10:50-11:15 AM, 20249=1:30-2:45 PM, 10412=4:30 - 6:20 PM, 37491=8:30 - 11:05 AM, 42704=PHLB 1010, 840=11:00 - 2:45PM, 16624=This pairing links Intermediate Algebra and College Algebra, affording students the opportunity to apply concepts they will learn in MATH 1310 to the problems assigned to them in MATH 1315., 725=EMS 1091, 32087=8:00 - 10:15 AM}",
    "textBeforeTable": "This paring of courses is required for gaining EMT-Basic licensure in the State of New Mexico. Students must also take HLTH 1001 as a pre- or corequisite. If taking HLTH 1001 as a co-requisite, please do so IN THE FIRST TWO WEEKS OF THE TERM .These linked courses create a community of students gaining the knowledge, skills, and behaviors required to provide entry-level emergency care in the pre-hospital environment. The clinical Course EMS 1190 has an 4 week classroom component along with a clinical experience in the hospital, which is scheduled OUTSIDE OF REGULAR CLASS HOURS AT A HOSPITAL. Please register for the learning communities as grouped below. EMS 1053, EMS 1093 and EMS 1190 Fall 2015 Learning Communities At CNM, dynamic and experienced instructors team up to plan and teach these paired courses and to give you the support and attention you need. CNM Calendar of Events Academic Calendars (Official) Important Dates & Deadlines Registration Deadlines & Financial Aid Disbursement Related Calendars In a Learning Community, students enroll in two or more classes together to create a \"community\" of learners. Learning Communities Info Learning Communities",
    "textAfterTable": "TIMES ROOM CAMPUS 79053 EMS 1053 151 M/W 9:00 - 11:50AM S 202 MAIN 79058 EMS 1093 151 M/W 12:30 - 3:20 PM S 202 MAIN 79063 EMS 1190 151 M/W 8:00 - 8:50 AM S 202 MAIN   EMS 1190 151 M/W ARRANGED TBA OFF   CRN COURSE NO. SEC DAYS TIMES ROOM CAMPUS 79054 EMS 1053 152 F/S 9:00AM-11:50 AM S202 MAIN 79059 EMS 1093 152 F/S 12:30PM-3:20 PM S202 MAIN 79064 EMS 1190 152 F/S",
    "hasKeyColumn": true,
    "keyColumnIndex": 5,
    "headerRowIndex": 0
}