{
    "relation": [
        [
            "Death #",
            "118",
            "355",
            "235",
            "98",
            "157",
            "218",
            "236"
        ],
        [
            "\"Event\" Name",
            "Blown Job (NOTE: This is the second death on the show given this name.)",
            "Anger Damagement",
            "Wrin-Killed",
            "Huffington Toast",
            "Hydro-Co-Done",
            "Samu-Fry",
            "Screwged"
        ],
        [
            "Date of Death",
            "April 21, 2001",
            "August 6, 2002",
            "June 8, 2008",
            "March 17, 2008",
            "July 26, 2003",
            "September 18, 2001",
            "December 24, 1988"
        ],
        [
            "Location",
            "La Jolla, California",
            "Lawrence, Kansas",
            "Pittsburgh, Pennsylvania",
            "Seattle, Washington",
            "Las Vegas, Nevada",
            "Tustin, California",
            "Lansing, Michigan"
        ],
        [
            "Circumstances of Death",
            "A woman who is addicted to energy drinks attempts to get a promotion at her job, but her sexist (and unbeknownst to her, bisexual) boss will only give her the promotion if she performs fellatio on him. She refuses (despite tolerating his other acts of sexual harassment) and, in disgust, guzzles down multiple energy drinks. When she sees a new male employee get the promotion instead by doing what she wouldn't do, she immediately gets angry and furiously confronts her boss. Her anger, combined with extreme amounts of caffeine, causes her to go into cardiac arrest from a caffeine overdose.",
            "A group of friends gather at one's house to watch professional wrestling. A newcomer, who met the host at an anger management class, starts picking fights with the other guests. He is killed when he runs headfirst into the widescreen television, embedding glass shards in his face, breaking his neck, and electrocuting himself.",
            "A purse snatcher attempts to steal an elderly woman's purse. The woman, however, has 30 years of experience in Taekwondo, and beats him severely before crushing his windpipe as impressed passers-by watch in amusement.",
            "Three huffers get high off aerosol fumes from spray paint cans. Later, they find jars of solvent, and one decides to pour it on himself, attempting to get higher. The liquid evaporates quickly and absorbs his body heat and, in an attempt to get warm, he asks his friends for a lighter. When one hands him a lit match, his clothes quickly catch fire and he burns to death. His friends run off, and are later arrested for manslaughter.",
            "A couple get high in their hot tub after overdosing on painkillers and drinking champagne. The temperature gauge malfunctions, and the temperature of the water rises to the boiling point, but they are both too intoxicated to react and are boiled alive.",
            "Two Japanese-American teenagers attempt to engage in a katana battle after watching a samurai movie and playing samurai video games. One of them gets angry with the other for breaking his mother's favorite lamp, but the other one shows no remorse. When they take their fight outside, the one who broke the lamp attempts to land a deadly strike on his friend, but his katana slices through a low-hanging power line and he electrocutes himself.",
            "An elderly Scrooge attacks a group of carolers gathered outside his house during a hailstorm by throwing rotten fruit at them. As the carolers run off, a large hailstone hits the man on the head, fracturing his skull."
        ]
    ],
    "pageTitle": "1000 Ways To Die Episodes - 1000 Ways to Die Wiki",
    "title": "",
    "url": "http://1000waysdie.wikia.com/wiki/1000_Ways_To_Die_Episodes",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988860.4/warc/CC-MAIN-20150728002308-00074-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 133803,
    "recordOffset": 24543,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{105980=Season 2 was set to premiere on Dec. 9, 2009 at 10 PM (EST), but a special airing of the season premiere episode was shown on Dec. 6, 2009 at 12:30 AM (EST). The real-life scenarios of people escaping death shown at the ending were dropped to make room for more segments. The deaths are slightly more graphic in this season, and \"Idiot Alerts\" (in the same font as the \"Way to Die #\" and nicknames descriptions are) were added to deaths from moronic and ill-advised stunts that could easily be imitated in real life. Another change is that under \"Location\", only the city is told, not the city and the specific location as it was in Season 1. The wording of the opening disclaimer was changed slightly from Season 1:, 192154=Originally aired Feb. 3, 2010., 1103=March 26, 2012, 276670=Originally Aired October 19, 2010., 61672=Originally aired Mar. 8, 2009., 172152=Originally aired Jan. 20, 2010., 3958=The first two episodes are visually distinct from the rest of the series, as they were originally intended to be the only episodes. They both open with the words of the disclaimer displayed in white font on black background, while the voice-over reads: \"The stories you are about to see are true and based on actual events. Names have been changed to protect the identities of the deceased.\" \"WARNING: The deaths portrayed in this show are real and extremely graphic.\" The disclaimer then cuts to a scene of a city at night, followed by images of various manners of death, either from episodes or file footages, while the voice-over reads the monologue, which appears in \"comic-book\" style (comic font inside yellow boxes, as in a comic book): \"The human body is remarkably resilient...\" \"But death...is everywhere. Most of us try to avoid it, others can't get out of its way...\" (note: in the following sentence, only the ALL CAPPED words are illustrated in large, red \"Sin City\"/\"comic\" font; the rest are only heard) \"Every day we fight a new WAR against GERMS, TOXINS, INJURY, ILLNESS, CATASTROPHE and Calamity.\" \"There's a lot of ways to wind up dead.\" \"The fact that we survive at all is a miracle...\" \"Because, every day we live...\" \"We face 1000 WAYS TO DIE.\" The first story begins with the opening screenshot drawn as a comic, which fades to the live action. The narrator gives an account of the story as it unfolds, describing the circumstances leading up to the death and details of the death itself. The story is interspersed with expert testimony from physicians and scientists about the science of the death (what happens to the body, etc.). The story ends with another comic screenshot, over which the \"Way to Die # \" and the nickname for the death is typed over the image in black and red \"True Crimes\"/\"Sin City\"/\"comic\" font. This pans right to trivia about a similar incident or related scientific fact, usually less than 30 seconds long, which is depicted entirely in comic formatting. The process repeats with the second story, which then cuts directly to commercial after the trivia. The third and fourth stories also follow this format. The fifth story follows suit, but instead goes directly to commercial after the trivia bit. The sixth story is also depicted, and then cuts to the real-life story segment, which does not employ the comic face. When the real-life story ends, the credits roll in red and yellow comic font on black/white-flecked background., 8292=Originally aired May 14, 2008., 285537=Originally Aired October 26, 2010., 77716=Originally aired Mar. 22, 2009., 367755=Originally aired February 16, 2011, 107576=Originally aired Dec. 6, 2009., 359230=Originally Aired February 8, 2011, 359076=Season 4 Episode 1 / Episode 39: The One About Dumb People Dying Airs February 8, 2011, 37964=Originally aired Feb. 15, 2009., 403454=Originally aired March 16, 2011, 321825=Originally aired December 15, 2010., 432487=Air Date:April 5, 2011, 303623=Originally aired November 9, 2010, 219299=Originally aired Feb. 24, 2010., 54056=Originally aired Mar. 1, 2009., 228160=Originally aired Aug. 3, 2010., 126003=Originally aired Dec. 16, 2009., 412809=Originally aired March 23, 2011, 13471=Originally aired May 21, 2008., 161193=Originally aired Jan. 13, 2010., 46183=Originally aired Feb. 22, 2009., 200788=Originally aired Feb. 10, 2010., 209697=Originally aired Feb. 17, 2010., 401998=(Technically some time in 1995.), 30413=Originally aired Feb. 8, 2009., 181683=Originally aired Jan. 27, 2010., 21672=Originally aired Feb. 8, 2009. gówno, 350258=Originally aired January 5, 2011, 86729=Originally aired Mar. 29, 2009, 422518=Originally Aired March 29, 2011, 394486=Originally aired March 9, 2011, 266227=Originally Aired October 5, 2010., 138379=Originally aired Dec. 30, 2009., 95127=Originally aired Apr. 5, 2009., 19639=\"Death...is everywhere. Most of us try to avoid it, others can't get out of its way. Every day we fight a new war against GERMS, TOXINS, INJURY, ILLNESS, and CATASTROPHE.\" \"There's a lot of ways to wind up dead. The fact that we survive at all is a miracle, because every day we live, we face 1000 WAYS TO DIE.\" This introduction cuts to a screenshot of the \"victim\", framed by gray grainy film art, and information appears as being typed out onto screen: \"DATE\" and \"LOCATION\". The stories are played out as in the \"Pilot Season\", but end as they began, with a different screenshot of the \"victim\" (this time, they are usually dead), again framed in grainy film art, over which the \"Way to Die # \" and the nickname for the death typed over the image in black, yellow and red \"True Crimes\"/\"Sin City\"/\"comic\" font. Two stories are shown in this manner, then an outro to the commercial says, \"Coming up:\" followed by brief, clever descriptions of upcoming deaths. This is usually repeated twice. After the last commercial break, the real-life story is shown, followed immediately by the end credits, which appear as white spray-painted bold letters on a grainy film background, backed by heavy metal music., 386338=Originally aired March 2, 2011, 341383=Originally aired December 29, 2010., 376892=Originally aired February 23, 2011, 236704=Originally aired September 14, 2010., 247355=Originally aired September 21, 2010., 294283=Originally aired November 2, 2010., 2291=August 5, 2015, 28142=January 31, 2004, 313660=Originally aired December 8, 2010. Comedian Charlie Murphy guest stars in this episode., 331239=Originally aired December 22, 2010., 116626=Originally aired Dec. 9, 2009., 150800=Originally aired Jan. 6, 2010., 257118=Originally aired September 28, 2010, 69274=Originally aired Mar. 15, 2009.}",
    "lastModified": "Sat, 11 Jul 2015 00:18:13 GMT",
    "textBeforeTable": "Originally aired May 14, 2008. Pilot Episode 1: Life Will Kill YouEdit The second episode mimics the first, except that the first and second stories are so long on their own that they go straight to commercial after their related trivia. The third and fourth stories follow the prior pattern, only without the trivia bits; the fifth story then leads into the real-life story, both without trivia. The first two episodes are visually distinct from the rest of the series, as they were originally intended to be the only episodes. They both open with the words of the disclaimer displayed in white font on black background, while the voice-over reads: \"The stories you are about to see are true and based on actual events. Names have been changed to protect the identities of the deceased.\" \"WARNING: The deaths portrayed in this show are real and extremely graphic.\" The disclaimer then cuts to a scene of a city at night, followed by images of various manners of death, either from episodes or file footages, while the voice-over reads the monologue, which appears in \"comic-book\" style (comic font inside yellow boxes, as in a comic book): \"The human body is remarkably",
    "textAfterTable": "91 De-Coffinated A land dispute between two brothers in Haiti ends with one brother asking a witch doctor to poison the other with tetrodotoxin, causing paralysis. Believed to be dead, the poisoned brother is buried alive, and his corpse is later found by grave robbers. Shortly before the brother's death, he tried to claw his way out with his fingers, wearing them down to the bone. 606 Wet Dream A man who wants to live like a fish constructs a fish suit out of waterbed material and attempts to use it. The suit is so constricting, however, that he cannot get into the water fast enough, and he perishes from heat exhaustion. (This is a based off the death of a man in Melbourne, Australia.) 112 Fur Burger In the 2nd century, one method of execution was wrapping the victim in freshly-killed animal skins, tying him to a tree, and leaving him to be eaten alive by whatever carnivores happened to be in the area. In this",
    "hasKeyColumn": true,
    "keyColumnIndex": 1,
    "headerRowIndex": 0
}