{
    "relation": [
        [
            "Resolution of Fever",
            "b.i.d. dose (mg)",
            "500",
            "1000",
            "2000"
        ],
        [
            "Resolution of Night Sweats",
            "% ever afebrile",
            "67%",
            "67%",
            "62%"
        ],
        [
            "",
            "% afebrile ≥ 6 weeks",
            "23%",
            "12%",
            "22%"
        ],
        [
            "",
            "b.i.d. dose (mg)",
            "500",
            "1000",
            "2000"
        ],
        [
            "",
            "% ever resolving",
            "85%",
            "70%",
            "72%"
        ],
        [
            "",
            "% resolving ≥ 6 weeks",
            "42%",
            "33%",
            "36%"
        ]
    ],
    "pageTitle": "DailyMed - BIAXIN - clarithromycin tablet, film coated",
    "title": "",
    "url": "http://dailymed.nlm.nih.gov/dailymed/drugInfo.cfm?id=89268&dictionary=on",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042981576.7/warc/CC-MAIN-20150728002301-00130-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 60448367,
    "recordOffset": 60387880,
    "tableOrientation": "VERTICAL",
    "TableContextTimeStampBeforeTable": "{56570=Among patients experiencing night sweats prior to therapy, 84% showed resolution or improvement at some point during the 12 weeks of clarithromycin at 500 to 2000 mg b.i.d. doses. Similarly, 77% of patients reported resolution or improvement in fevers at some point. Response rates for clinical signs of MAC are given below:, 51028=The adverse event profiles showed that both the 500 and 1000 mg b.i.d. doses were well tolerated. The 2000 mg b.i.d. dose was poorly tolerated and resulted in a higher proportion of premature discontinuations., 124676=Concomitant administration of clarithromycin and ritonavir (n = 22) resulted in a 77% increase in clarithromycin AUC and a 100% decrease in the AUC of 14-OH clarithromycin. Clarithromycin may be administered without dosage adjustment to patients with normal renal function taking ritonavir. Since concentrations of 14-OH clarithromycin are significantly reduced when clarithromycin is co-administered with ritonavir, alternative antibacterial therapy should be considered for indications other than infections due to Mycobacterium avium complex (see PRECAUTIONS – Drug Interactions). Doses of clarithromycin greater than 1000 mg per day should not be co-administered with protease inhibitors., 117567=Both clarithromycin and atazanavir are substrates and inhibitors of CYP3A, and there is evidence of a bi-directional drug interaction. Following administration of clarithromycin (500 mg twice daily) with atazanavir (400 mg once daily), the clarithromycin AUC increased 94%, the 14-OH clarithromycin AUC decreased 70% and the atazanavir AUC increased 28%. When clarithromycin is co-administered with atazanavir, the dose of clarithromycin should be decreased by 50%. Since concentrations of 14-OH clarithromycin are significantly reduced when clarithromycin is co-administered with atazanavir, alternative antibacterial therapy should be considered for indications other than infections due to Mycobacterium avium complex (see PRECAUTIONS – Drug Interactions). Doses of clarithromycin greater than 1000 mg per day should not be co-administered with protease inhibitors., 109332=Four teratogenicity studies in rats (three with oral doses and one with intravenous doses up to 160 mg/kg/day administered during the period of major organogenesis) and two in rabbits at oral doses up to 125 mg/kg/day (approximately 2 times the recommended maximum human dose based on mg/m2) or intravenous doses of 30 mg/kg/day administered during gestation days 6 to 18 failed to demonstrate any teratogenicity from clarithromycin. Two additional oral studies in a different rat strain at similar doses and similar conditions demonstrated a low incidence of cardiovascular anomalies at doses of 150 mg/kg/day administered during gestation days 6 to 15. Plasma levels after 150 mg/kg/day were 2 times the human serum levels. Four studies in mice revealed a variable incidence of cleft palate following oral doses of 1000 mg/kg/day (2 and 4 times the recommended maximum human dose based on mg/m2, respectively) during gestation days 6 to 15. Cleft palate was also seen at 500 mg/kg/day. The 1000 mg/kg/day exposure resulted in plasma levels 17 times the human serum levels. In monkeys, an oral dose of 70 mg/kg/day (an approximate equidose of the recommended maximum human dose based on mg/m2) produced fetal growth retardation at plasma levels that were 2 times the human serum levels., 50400=The following analyses summarize experience during the first 12 weeks of therapy with clarithromycin. Data are reported separately for Study 500 (randomized, double-blind) and Study 577 (open-label, compassionate use) and also combined. Adverse events were reported less frequently in Study 577, which may be due in part to differences in monitoring between the two studies. In adult patients receiving clarithromycin 500 mg b.i.d., the most frequently reported adverse events, considered possibly or probably related to study drug, with an incidence of 5% or greater, are listed below. Most of these events were mild to moderate in severity, although 5% (Study 500: 8%; Study 577: 4%) of patients receiving 500 mg b.i.d. and 5% (Study 500: 4%; Study 577: 6%) of patients receiving 1000 mg b.i.d. reported severe adverse events. Excluding those patients who discontinued therapy or died due to complications of their underlying non-mycobacterial disease, approximately 8% (Study 500: 15%; Study 577: 7%) of the patients who received 500 mg b.i.d. and 12% (Study 500: 14%; Study 577: 12%) of the patients who received 1000 mg b.i.d. discontinued therapy due to drug-related events during the first 12 weeks of therapy. Overall, the 500 and 1000 mg b.i.d. doses had similar adverse event profiles., 115892=Both clarithromycin and saquinavir are substrates and inhibitors of CYP3A and there is evidence of a bi-directional drug interaction. Following administration of clarithromycin (500 mg bid) and saquinavir (soft gelatin capsules, 1200 mg tid) to 12 healthy volunteers, the steady-state saquinavir AUC and Cmax increased 177% and 187% respectively compared to administration of saquinavir alone. Clarithromycin AUC and Cmax increased 45% and 39% respectively, whereas the 14–OH clarithromycin AUC and Cmax decreased 24% and 34% respectively, compared to administration with clarithromycin alone. No dose adjustment of clarithromycin is necessary when clarithromycin is co-administered with saquinavir in patients with normal renal function. When saquinavir is co-administered with ritonavir, consideration should be given to the potential effects of ritonavir on clarithromycin (refer to interaction between clarithromycin and ritonavir) (see PRECAUTIONS – Drug Interactions)., 76100=A randomized, double-blind study (561) compared clarithromycin 500 mg b.i.d. to placebo in patients with CDC-defined AIDS and CD4 counts < 100 cells/µL. This study accrued 682 patients from November 1992 to January 1994, with a median CD4 cell count at study entry of 30 cells/µL. Median duration of clarithromycin was 10.6 months vs. 8.2 months for placebo. More patients in the placebo arm than the clarithromycin arm discontinued prematurely from the study (75.6% and 67.4%, respectively). However, if premature discontinuations due to MAC or death are excluded, approximately equal percentages of patients on each arm (54.8% on clarithromycin and 52.5% on placebo) discontinued study drug early for other reasons. The study was designed to evaluate the following endpoints:, 1410=Revised: 07/2012, 63241=Three randomized studies (500, 577, and 521) compared different dosages of clarithromycin in patients with CDC-defined AIDS and CD4 counts < 100 cells/µL. These studies accrued patients from May 1991 to March 1992. Study 500 was randomized, double-blind; Study 577 was open-label compassionate use. Both studies used 500 and 1000 mg b.i.d. doses; Study 500 also had a 2000 mg b.i.d. group. Study 521 was a pediatric study at 3.75, 7.5, and 15 mg/kg b.i.d. Study 500 enrolled 154 adult patients, Study 577 enrolled 469 adult patients, and Study 521 enrolled 25 patients between the ages of 1 to 20. The majority of patients had CD4 cell counts < 50/µL at study entry. The studies were designed to evaluate the following end points:, 52154=Median survival time from study entry (Study 500) was 249 days at the 500 mg b.i.d. dose compared to 215 days with the 1000 mg b.i.d. dose. However, during the first 12 weeks of therapy, there were 2 deaths in 53 patients in the 500 mg b.i.d. group versus 13 deaths in 51 patients in the 1000 mg b.i.d. group. The reason for this apparent mortality difference is not known. Survival in the two groups was similar beyond 12 weeks. The median survival times for these dosages were similar to recent historical controls with MAC when treated with combination therapies.6, 205386=Steady-state concentrations of clarithromycin and 14-OH clarithromycin observed following administration of 500 mg doses of clarithromycin every 12 hours to adult patients with HIV infection were similar to those observed in healthy volunteers. In adult HIV-infected patients taking 500- or 1000-mg doses of clarithromycin every 12 hours, steady-state clarithromycin Cmax values ranged from 2 to 4 mcg/mL and 5 to 10 mcg/mL, respectively., 209244=After constitution, each 5 mL of BIAXIN suspension (clarithromycin for oral suspension, USP) contains 125 mg or 250 mg of clarithromycin. Each bottle of BIAXIN granules contains 1250 mg (50 mL size), 2500 mg (50 and 100 mL sizes) or 5000 mg (100 mL size) of clarithromycin and the following inactive ingredients: carbomer, castor oil, citric acid, hypromellose phthalate, maltodextrin, potassium sorbate, povidone, silicon dioxide, sucrose, xanthan gum, titanium dioxide and fruit punch flavor., 79638=Bottles of 60 (NDC 0074-2586-60) and ABBO-PAC unit dose strip packages of 100 (NDC 0074-2586-11)., 51505=Median survival time from study entry in Study 577 was 199 days for the 500 mg b.i.d. dose and 179 days for the 1000 mg b.i.d. dose. During the first four weeks of therapy, while patients were maintained on their originally assigned dose, there were 11 deaths in 255 patients taking 500 mg b.i.d. and 18 deaths in 214 patients taking 1000 mg b.i.d., 58313=Although the 1000 mg and 2000 mg b.i.d. doses showed significantly better control of bacteremia during the first four weeks of therapy, no significant differences were seen beyond that point. The percent of patients whose blood was sterilized as shown by one or more negative cultures at any time during acute therapy was 61% (30/49) for the 500 mg b.i.d. group and 59% (29/49) and 52% (25/48) for the 1000 and 2000 mg b.i.d. groups, respectively. The percent of patients who had 2 or more negative cultures during acute therapy that were sustained through study Day 84 was 25% (12/49) in both the 500 and 1000 mg b.i.d. groups and 8% (4/48) for the 2000 mg b.i.d. group. By Day 84, 23% (11/49), 37% (18/49), and 56% (27/48) of patients had died or discontinued from the study, and 14% (7/49), 12% (6/49), and 13% (6/48) of patients had relapsed in the 500, 1000, and 2000 mg b.i.d. dose groups, respectively. All of the isolates had an MIC < 8 mcg/mL at pre-treatment. Relapse was almost always accompanied by an increase in MIC. The median time to first negative culture was 54, 41, and 29 days for the 500, 1000, and 2000 mg b.i.d. groups, respectively. The time to first decrease of at least 1 log in CFU count was significantly shorter with the 1000 and 2000 mg b.i.d. doses (median equal to 16 and 15 days, respectively) in comparison to the 500 mg b.i.d. group (median equal to 29 days). The median time to first positive culture or study discontinuation following the first negative culture was 43, 59 and 43 days for the 500, 1000, and 2000 mg b.i.d. groups, respectively.}",
    "textBeforeTable": "Clarithromycin and the 14-OH clarithromycin metabolite distribute readily into body tissues and fluids. There are no data available on cerebrospinal fluid penetration. Because of high intracellular concentrations, tissue concentrations are higher than serum concentrations. Examples of tissue and serum concentrations are presented below. The pharmacokinetics of clarithromycin was also altered in subjects with impaired renal function. (See PRECAUTIONSand DOSAGE AND ADMINISTRATION.) The steady-state concentrations of clarithromycin in subjects with impaired hepatic function did not differ from those in normal subjects; however, the 14-OH clarithromycin concentrations were lower in the hepatically impaired subjects. The decreased formation of 14-OH clarithromycin was at least partially offset by an increase in renal clearance of clarithromycin in the subjects with impaired hepatic function when compared to healthy subjects. Steady-state concentrations of clarithromycin and 14-OH clarithromycin observed following administration of 500 mg doses of clarithromycin every 12 hours to adult patients with HIV infection were similar to those observed in healthy volunteers. In adult HIV-infected patients taking 500- or 1000-mg doses of clarithromycin every 12 hours, steady-state clarithromycin Cmax values ranged from 2 to 4 mcg/mL and 5 to 10 mcg/mL, respectively. After a 250 mg tablet every 12 hours, approximately 20% of the dose is excreted in the urine as clarithromycin, while after a 500 mg tablet every 12 hours, the urinary excretion of clarithromycin is somewhat greater, approximately 30%. In comparison, after an oral dose",
    "textAfterTable": "Analyte Middle Ear Fluid (mcg/mL) Serum (mcg/mL) Clarithromycin 2.5 1.7 14-OH Clarithromycin 1.3 0.8 In adults given 250 mg clarithromycin as suspension (n = 22), food appeared to decrease mean peak plasma clarithromycin concentrations from 1.2 (± 0.4) mcg/mL to 1.0 (± 0.4) mcg/mL and the extent of absorption from 7.2 (± 2.5) hr•mcg/mL to 6.5 (± 3.7) hr•mcg/mL. When children (n = 10) were administered a single oral dose of 7.5 mg/kg suspension, food increased mean peak plasma clarithromycin concentrations from 3.6 (± 1.5) mcg/mL to 4.6 (± 2.8) mcg/mL and the extent of absorption from 10.0 (± 5.5) hr•mcg/mL to 14.2 (± 9.4) hr•mcg/mL. Clarithromycin 500 mg every 8 hours was given in combination with omeprazole 40 mg daily to healthy adult males. The plasma levels of clarithromycin and 14-hydroxy-clarithromycin were increased by the concomitant administration of omeprazole. For clarithromycin, the mean Cmax was 10% greater, the mean Cmin was 27% greater, and the mean AUC0-8 was 15% greater when clarithromycin was administered with omeprazole than when clarithromycin was administered alone. Similar results were seen for 14-hydroxy-clarithromycin, the mean Cmax was 45% greater, the mean Cmin was 57% greater, and the mean AUC0-8 was 45% greater. Clarithromycin concentrations in the gastric tissue and mucus were also increased by concomitant administration of omeprazole.",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}