{
    "relation": [
        [
            "Patent application number",
            "20090311305",
            "20130123716",
            "20140271495",
            "20140271798",
            "20140271919"
        ],
        [
            "Description",
            "Vaginal therapeutic device including copper metal and method of treating the vaginal using the vaginal therapeutic device - A vaginal therapeutic device made of copper metal has a shape to fit in the vagina and utilizes the copper metal as an antimicrobial agent to therapeutically treat abnormal biological conditions in the vagina.",
            "Vaginal Therapeutic Device Including Copper Metal - A vaginal therapeutic device having an exterior surface of copper metal that has a configuration for insertion in and retention in the vagina, and utilizes the copper metal as an antimicrobial agent to therapeutically treat abnormal biological conditions in the vagina. The exterior configuration of the device defines a plurality of protuberances to resist expulsion of the device from the vagina.",
            "Topical Copper Ion Treatments and Methods of Treatment Using Topical Copper Ion Treatments in the Oral-Respiratory-Otic Areas of the Body - Copper ion treatments and methods of treatment are provided to treat various body conditions affecting the oral, respiratory and/or otic areas of the body. The copper ion treatments contain copper ions which bring about local and systemic therapeutic effects as a result of contacting anatomical tissue of the oral cavity, the nasal passages or ear canal. The copper ion treatments and methods involve copper ion-containing solutions, copper ion toothpaste and copper ion mouthwash. The copper ion-containing solutions can be delivered to the oral cavity by spraying or swabbing, can be delivered to the nostrils as spray, drops, or by swabbing, and can be delivered to the ear canal as spray, drops, or by swabbing. The copper ion toothpaste is used for brushing the teeth, and the copper ion mouthwash is used for rinsing the mouth.",
            "Topical Copper Ion Treatments and Methods of Making Topical Copper Ion Treatments for Use in Various Anatomical Areas of the Body - A topical copper ion treatment in basic form comprises a copper ion-containing solution composed of a biocompatible solution containing copper ions obtained by leaching of the copper ions from copper metal into the solution. The copper ion-containing solution can be combined with various carriers to form various forms of the copper ion treatment including creams, gels, lotions, foams, pastes, tampons, solutions, suppositories, body wipes, wound dressings, skin patches, and suture material. A method of making the copper ion-containing solution involves placing solid copper metal in a quantity of a biocompatible solution and maintaining the solution at a specified temperature for a predetermined period of time during which copper ions leach from the copper metal into the solution, and thereafter separating the solution from the solid copper metal.",
            "Topical Copper Ion Treatments and Methods of Treatment Using Topical Copper Ion Treatments in the Genital-Rectal Areas of the Body - Copper ion treatments and methods of treatment are provided to treat various body conditions affecting the genital and/or rectal areas. The copper ion treatments contain a copper ion-containing solution which, as a result of the copper ions contacting anatomical tissue of the vagina, the rectal canal and/or the external genital or rectal areas, brings about local and systemic therapeutic effects. The copper ion treatments and methods for treating conditions affecting the genital and/or rectal areas involve the use of tampons, suppositories, lotions, creams, gels, foams and solutions, each containing a copper ion-containing solution. The tampon bodies and the copper ion lotions, creams, gels and foams may be delivered into the vagina, and the suppositories can be delivered into the vagina or into the rectal canal. The copper ion lotions, creams, gels, foams and solutions may also be topically applied to the external genital and/or rectal areas."
        ],
        [
            "Published",
            "12-17-2009",
            "05-16-2013",
            "09-18-2014",
            "09-18-2014",
            "09-18-2014"
        ]
    ],
    "pageTitle": "Abbott, US - Patent applications",
    "title": "",
    "url": "http://www.faqs.org/patents/inventor/abbott-us-5/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042981576.7/warc/CC-MAIN-20150728002301-00072-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 446697071,
    "recordOffset": 446663554,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Dominic C. Abbott, Pittsburgh, PA US 09-22-2011 Methods for Controlling Perspiration-Related Body Odor - A deodorizer device for controlling body odor comprises a structure having an external metal oxide surface with a contour to contact the surface of the skin where perspiration is produced and is degraded by bacterial organisms on the skin into body odor. The metal oxide surface is reactable with water supplied to the surface of the skin to render the bacterial organisms ineffectual to degrade perspiration later produced on the skin into body odor. The deodorizer device together with a water source form a deodorizer system. A method of controlling body odor involves supplying water to the surface of the skin where perspiration is produced and is degraded by bacterial organisms into body odor and, at the same time, contacting the surface of the skin with a metal oxide surface of a deodorizer device. 20110229370 Published Description Patent application number Dominic C. Abbott, Pittsburg, PA US 09-18-2014 Topical Copper Ion Treatments and Methods of Treatment Using Topical Copper Ion Treatments in the Dermatological Areas of the Body - Copper ion treatments for dermatological areas of the body include solutions, creams, lotions, gels, foams, wound dressings, skin patches and suture material, each containing copper ions that bring about therapeutic effects when the copper ion treatments are applied to dermatological tissue. Methods of treating dermatological areas of the body include treatments for use",
    "textAfterTable": "Patent applications by Dominic C. Abbott, Pittsburgh, PA US Donald Charles Abbott, Norton, MA US Patent application number Description Published 20090315159 LEADFRAMES HAVING BOTH ENHANCED-ADHESION AND SMOOTH SURFACES AND METHODS TO FORM THE SAME - Example leadframes having both rough surfaces to enhance adhesion to molding compounds and selectively smoothed surfaces to enhance bonding wire performance, and methods to form the same are disclosed. A disclosed example packaged integrated circuit chip includes a bond wire, a leadframe having a die pad coupled to a carrier rail, and an inner lead coupled to an outer lead via a dam bar, the inner lead having a first portion having a rough surface and a second portion having a smoothed surface, a first end of the bond wire attached to the second portion of the inner lead, an integrated circuit attached to the die pad, a second end of the bond wire attached to a pad disposed on the integrated circuit, and a molding compound to encapsulate the inner lead, the integrated circuit and the bond wire. 12-24-2009 20140097527 METHOD OF MANUFACTURE INTEGRATED CIRCUIT PACKAGE - An integrated circuit package may be formed using a leadframe having an open",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}