{
    "relation": [
        [
            "Code or Value",
            "0",
            "1",
            "2",
            "."
        ],
        [
            "Value Description",
            "detectable result",
            "below detectable limit",
            "detectable result and exceeds the calibrated range of assay",
            "Missing"
        ],
        [
            "Count",
            "962",
            "2054",
            "0",
            "529"
        ],
        [
            "Cumulative",
            "962",
            "3016",
            "3016",
            "3545"
        ],
        [
            "Skip to Item",
            "",
            "",
            "",
            ""
        ]
    ],
    "pageTitle": "NHANES 2005 - 2006: Volatile Organic Compounds in Blood Data Documentation, Codebook, and Frequencies",
    "title": "",
    "url": "http://www.cdc.gov/nchs/nhanes/nhanes2005-2006/VOCWB_D.htm",
    "hasHeader": true,
    "headerPosition": "MIXED",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988860.4/warc/CC-MAIN-20150728002308-00199-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 362905627,
    "recordOffset": 362885823,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{11413=Automated data collection procedures for the survey were introduced in NHANES 2003–2004. In the MECs and analytical laboratories, data for the laboratory component are recorded directly onto a computerized data collection form. The system is centrally integrated, and it allows for ongoing monitoring of much of the data. Although the complete blood count and pregnancy analyses are performed in the MEC laboratory, most analyses are conducted elsewhere by approximately 21 laboratories across the United States., 8897=The NHANES QA/QC protocols meet the 1988 Clinical Laboratory Improvement Act mandates. Detailed QA/QC instructions are discussed in the NHANES LPM., 15853=Title: Volatile Organic Compounds in Blood (VOCWB_D ) Contact Number: 1-866-441-NCHS Years of Content: 2005 - 2006 First Published: December, 2011 Revised: NA Access Constraints: None Use Constraints: None Geographic Coverage: National Subject:Volatile Organic Compounds in Blood and Related Questionnaire Items Record Source: NHANES 2005 - 2006 Survey Methodology: NHANES 2005 - 2006 is a stratified multistage probability sample of the civilian non-institutionalized population of the U.S. Medium: NHANES Web site; SAS transport files}",
    "lastModified": "Fri, 09 May 2014 20:28:07 GMT",
    "textBeforeTable": "Both males and females 12 YEARS - 150 YEARS Target: VOC subsample 2 yr MEC Weight English Text: VOC subsample 2 yr MEC Weight SAS Label: WTSVOC2Y Variable Name: WTSVOC2Y - VOC subsample 2 yr MEC Weight Both males and females 12 YEARS - 150 YEARS Target: Respondent sequence number. English Text: Respondent sequence number SAS Label: SEQN Variable Name: SEQN - Respondent sequence number Codebook and Frequencies U.S. Occupational Safety and Health Administration (OSHA). Organic Vapors, Method 07 in Analytical Methods Manual. Salt Lake City, Utah; OSHA Analytical Laboratory: 1985. Morandi MT, Stock TH. Personal Exposures to Toxic Air Pollutants, Vol. 2. Houston, TX; The University of Texas – Houston, Health Science Center, School of Public Health: 1998. Cardinali FL, Ashley DL, Morrow JC, Moll DM, Blount BC (2004), Measurement of Trihalomethanes and Methyl Tertiary-Butyl Ether in Tap Water Using Solid-Phase Microextraction GC/MS, Journal of Chromatographic Sciences, 42:200-206. Bonin MA, Silva LK, Smith MM, Ashley DL, Blount BC (2005) Measurement of trihalomethanes and methyl tert-butyl ether in whole blood using gas chromatography with high-resolution mass spectrometry. J Anal Toxicol. 29(2):81-89. Blount BC, Kobelski RJ, McElprang DO, Ashley DL, Morrow JC, Chambers DM, Cardinali FL (2006) Quantification of",
    "textAfterTable": "Blood 1,1-Dichloroethane (ng/mL) English Text: Blood 1,1-Dichloroethane (ng/mL) Target: Both males and females 12 YEARS - 150 YEARS Code or Value Value Description Count Cumulative Skip to Item 0.0071 to 0.0071 Range of Values 3193 3193 . Missing 352 3545 LBDV1ALC - Blood 1,1-Dichloroethane Comment Code Variable Name: LBDV1ALC SAS Label: Blood 1,1-Dichloroethane Comment Code English Text: Blood 1,1-Dichloroethane Comment Code Target: Both males and females 12 YEARS - 150 YEARS Code or Value Value Description Count Cumulative Skip to Item 0 detectable result 0 0 1 below detectable limit 3193 3193 2 detectable result and exceeds the calibrated range of assay 0 3193 . Missing 352 3545 LBXV1D - Blood 1,2-Dichlorobenzene (ng/mL) Variable",
    "hasKeyColumn": true,
    "keyColumnIndex": 1,
    "headerRowIndex": 0
}