{
    "relation": [
        [
            "Patent application number",
            "20100012084",
            "20100258099",
            "20110303189"
        ],
        [
            "Description",
            "Controlling A Light-Duty Combustion Engine - A method and system for controlling a light-duty combustion engine and, more particularly, a method and system that use an engine speed governor to limit the engine speed to a level that is less than a clutch-in speed of a centrifugal clutch. If it is determined that an operator is attempting to throttle or accelerate the engine, the engine speed governor is disengaged so that normal operation can commence.",
            "ENGINE FUEL DELIVERY SYSTEMS, APPARATUS AND METHODS - A method of operating an engine is disclosed, which includes determining a peak power condition for the engine, measuring a temperature associated with the engine at said peak power condition, comparing the temperature measured with a previously determined temperature associated with a known peak power condition of the engine, determining an offset value based on the comparison made in step, controlling at least one of an air-fuel mixture delivered to the engine or ignition spark timing based on said offset value. Various engine fuel delivery systems, carburetors, fuel injection and control systems also are disclosed.",
            "POSITIVE DETECTION OF ENGINE POSITION DURING ENGINE STARTING - A system for managing ignition of a light-duty internal combustion engine during starting includes a charge winding used to create an ignition pulse; a first signal generated by the charge winding that indicates the speed of an engine; a second signal generated by the charge winding that indicates a piston position of the engine; a switch coupled to the charge winding for controlling the ignition pulse; and a processing device that receives the first signal and the second signal, wherein the processing device activates the switch when a comparison of the received first signal and second signal indicates that a piston is positioned at approximately top dead center (TDC)."
        ],
        [
            "Published",
            "01-21-2010",
            "10-14-2010",
            "12-15-2011"
        ]
    ],
    "pageTitle": "Andersson, US - Patent applications",
    "title": "",
    "url": "http://www.faqs.org/patents/inventor/andersson-us-5/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042981576.7/warc/CC-MAIN-20150728002301-00053-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 431421039,
    "recordOffset": 431396842,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{27825=Patent applications by Jan Olof Andersson, Apple Valley, MN US}",
    "textBeforeTable": "Martin N. Andersson, Caro, MI US 11-13-2014 Display Apparatus Incorporating Varying Threshold Voltage Transistors - This disclosure provides systems, methods and apparatus for controlling pixels of a display apparatus. An apparatus including a plurality of pixels can be controlled by a control matrix. The control matrix includes for each pixel a first transistor that has a first threshold voltage and a second transistor that has a second threshold voltage. A single data interconnect provides a common data voltage to the first and second transistors to control the states of corresponding first and second light modulators. 20140333598 Published Description Patent application number Mark B. Andersson, Northnorough, MA US 05-06-2010 MEMS ANCHORS - The invention relates to an improved apparatus and method for the design and manufacture of MEMS anchoring structures for light modulators in order to address the stresses of beams mounted on them. 20100110518 02-04-2010 Display with controlled formation of bubbles - The invention relates to a display apparatus including a first substrate supporting an array of light modulators, a second substrate separated from the first substrate by a gap, a fluid substantially filling the gap, sealing material joining the first substrate to the second substrate, and a bubble trapping region within a space enclosed by the sealing material for substantially constraining a location of a bubble trapped within the gap. In some embodiments, the bubble trapping region extends along a majority",
    "textAfterTable": "Patent applications by Martin N. Andersson, Caro, MI US Niklas Andersson, Seattle, WA US Patent application number Description Published 20140085082 PATIENT MONITORING DEVICE WITH REMOTE ALERT - A remote patient monitoring system provides patient physiological data and alerts/alarms from a main patient monitor to a remote patient monitor worn by a medical professional. The medical professional is alerted as to physiological data of the monitored patient, and provided alerts or alarms when predetermined levels are reached. The medical professional is able to reset the alert or alarms at the remote patient monitor. 03-27-2014 Per-Olof K. Andersson, Racine, WI US Patent application number Description Published 20100309746 Ultraclean Magnetic Mixer with Shear-Facilitating Blade Openings - A magnetically-coupled liquid mixer having a drive mount secured to and extending into a mixing vessel, a vessel-external first magnet array adjacent to the drive mount, a stub shaft extending into the vessel and having a first thrust bearing surface, a driven portion rotating on the stub shaft and having radially-mounted mixing blades a subset of which is characterized by each having an opening through which liquid flows during rotation, a second thrust bearing surface,",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}