{
    "relation": [
        [
            "Categories",
            "Campus Safety",
            "Greek Life",
            "Clubs and Activities",
            "Great for these types of students",
            "Share any unusual traditions or locations on campus",
            "What to do for fun",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "Very safe campus. Very dense, and security is always willing to give ladies a lift.",
            "none.",
            "Lots of clubs and every Saturday there is a Student Body activity.",
            "Active, artistic, Christian, business minded people.",
            "The clock tower sings every Friday night.",
            "Lincoln is full of bookstores and antique shops. I go rollerblading and hit up alot of movie theaters.",
            "Talk to Barry Forbes. Check out the campus, and bring your bicycle.",
            "Union College is a great Christian school. It is a small school, but this makes for a very friendly atmosphere and the teachers can remember you. The school also has an amazingly green campus."
        ]
    ],
    "pageTitle": "Union College Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Union-College/reviews?_escaped_fragment_=/show/17827",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042981576.7/warc/CC-MAIN-20150728002301-00323-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 906492103,
    "recordOffset": 906459983,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{114129=© 2015, Cappex.com, LLC}",
    "textBeforeTable": "04/06/2011 Reviewer is A current student here. 4 out of 4 people found this review useful. 1 of 28 Hiboombe from Plymouth, MN Check out reviews left by other students or leave your own review. You could win a free scholarship. Union College Reviews Union College › Nebraska › By State › Colleges › } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.create', -->",
    "textAfterTable": "Great for these types of students Union has excellent health-related programs and a top-of-the-line education program. Tips for prospective students I highly recommend making campus visits, talking to advisors from your discipline, and KEEP searching for financial aid. Bang for the buck While an education at Union College is quite pricey, I definitely agree that it is worth every last cent. Am enjoying being here I made friends right away when I came to Union and I can already tell that we will be friends for life. The people here make everything worthwhile. Everybody is so inviting and friendly that it's hard to not have a good time. Am learning a lot Professors at Union have an impressive knowledge of the content area and related areas of knowledge. They also strive to connect interdisciplinary ways of thinking and provide an all-around excellent educational experience. There is a very good combination of lecture and discussion at Union College. Login to rate or flag the reviews SK from Kansas",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}