{
    "relation": [
        [
            "Channel",
            "ABC1 NSW",
            "SBS ONE Sydney",
            "Channel Seven Sydney",
            "Channel Nine Sydney",
            "Network TEN Sydney"
        ],
        [
            "TV show",
            "Eggheads",
            "Japanese News",
            "Seven Early News",
            "Today",
            "The Project"
        ],
        [
            "Time",
            "5:29 am - 6 am",
            "5:40 am - 6:15 am",
            "5:30 am - 6 am",
            "5:30 am - 9 am",
            "5 am - 6 am"
        ]
    ],
    "pageTitle": "Sydney Morning Herald - Business & World News Australia | smh.com.au",
    "title": "Summary of what TV shows are on tonight",
    "url": "http://www.smh.com.au/am/2012/11/27/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988860.4/warc/CC-MAIN-20150728002308-00127-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 734747611,
    "recordOffset": 734676232,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{24038=Sonny Bill Williams says he would give Quade Cooper \"half my pay packet\" to lure him to rugby league as the pair announces a fight night in Brisbane on February 8. (02:28), 49385=DANIEL HURST The beginning of work to rebuild the walkway that washed away during Brisbane’s 2011 flood is a step closer, with Brisbane City Council finishing its detailed design stage.}",
    "TableContextTimeStampAfterTable": "{126169=December 6 She's famous for her splendid behind, and now you get to see it shake in the flesh., 245854=1068 views, 266422=Exiled Tibetans march in India, 123338=November 29 - December 1: Around 10,000 people are expected for this Kalgoorlie festival., 125251=December 8 Nicki Minaj is returning to her legion of Aussie fans in a brand new full-scale arena show., 122493=November 30 - December 2: Head to Fremantle for early gift ideas., 124325=December 4: Simple Minds continue an epic 30-year-long career., 250877=Peter Doyle, Nov 26, 2012, 4:55PM, 101258=Start your training for Run Melbourne 2013, to be held on Sunday, July 21., 263897=November 25 2012, 251770=Peter Doyle, Nov 26, 2012, 4:51PM, 245081=2957 views}",
    "textBeforeTable": "7am 6:30am 6am 5:30am 5am 4:30am Skip to: This gal-pal drama ends its second series with an engagement, a wedding, a mystery, several departures and a death. Winners & Losers What's on TV Tonight Heading to Brisbane Powerhouse? It could be your ticket to Paris! Win an art adventure in Paris Competition Once home to an S&M dungeon, Alliance now offers dining pleasure. Saucy old pub gets makeover Dining 6 Cauldron turned into a pulsing neon aquarium in spectacular show. Coldplay rocks 50,000 fans Stadium rock",
    "textAfterTable": "Summary of what TV shows are on tonight Channel TV show Time ABC1 QLD Eggheads 5:29 am - 6 am SBS ONE Queensland Korean News 5:05 am - 5:40 am Channel Seven Brisbane Sunrise Extra 5 am - 5:30 am Channel Nine Brisbane Nine's Early Morning News 5 am - 5:30 am Network TEN Brisbane The Project 5 am - 6 am Summary of what TV shows are on tonight Channel TV show Time ABC1 QLD Eggheads 5:29 am - 6 am SBS ONE Queensland Japanese News 5:40 am - 6:15 am Channel Seven Brisbane Seven Early News 5:30 am - 6 am Channel Nine Brisbane Today 5:30 am - 9 am",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}