{
    "relation": [
        [
            "Command",
            "domain list",
            "domain name-server",
            "show hosts"
        ],
        [
            "Description",
            "Defines a list of default domain names to complete unqualified hostnames.",
            "Specifies the address of one or more name servers to use for name and address resolution.",
            "Displays the default domain name, the style of name lookup service, a list of name server hosts, and the cached list of hostnames and addresses."
        ]
    ],
    "pageTitle": "Cisco ASR 9000 Series Aggregation Services Router IP Addresses and Services Command Reference, Release 4.0 - Host Services and Applications Commands [Cisco IOS XR Software (End-of-Sale)] - Cisco",
    "title": "",
    "url": "http://www.cisco.com/c/en/us/td/docs/routers/asr9000/software/asr9k_r4-0/addr_serv/command/reference/b_ir40asrbook/b_ir40asrbook_chapter_0101.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042981576.7/warc/CC-MAIN-20150728002301-00037-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 379788904,
    "recordOffset": 379749601,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Syntax Description value rate-limit cinetd no value rate-limit cinetd To configure the rate limit at which service requests are accepted by Cisco inetd (Cinetd), use the cinetd rate-limit command in global configuration mode. To restore the default, use the no form of this command. cinetd rate-limit traceroute tftp server tftp client source-interface telnet transparent telnet server telnet dscp telnet client source-interface telnet show hosts show cinetd services rcp client username rcp client source-interface ping (network) ftp client username ftp client source-interface ftp client password ftp client passive ftp client anonymous-password domain name-server domain name (global) domain lookup disable domain list domain ipv6 host domain ipv4 host clear host cinetd rate-limit For detailed information about host services and applications concepts, configuration tasks, and examples, see Cisco  ASR  9000 Series Aggregation Services Router IP Addresses and Services Configuration Guide. This chapter describes the commands used to configure and monitor host services and applications, such as Domain Name System",
    "textAfterTable": "Command History Release Modification Release 3.7.2 This command was introduced. Usage Guidelines To use this command, you must be in a user group associated with a task group that includes appropriate task IDs. If the user group assignment is preventing you from using a command, contact your AAA administrator for assistance. Any service request that exceeds the rate limit is rejected. The rate limit is applied to individual applications. Task ID Task ID Operations ip-services read, write Examples The following example shows the cinetd rate-limit being set to 10:  RP/0/RSP0/CPU0:router# config RP/0/RSP0/CPU0:router(config)# cinetd rate-limit 10 clear host To delete temporary entries from the hostname-to-address cache, use the",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}