{
    "relation": [
        [
            "Categories",
            "What to do for fun",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "go to soccer games, plays or hang out at the union. attend a dance or go on a trip to new york city. there's always something to do at messiah!",
            "apply for financial aid! even though it seems daunting, messiah can be affordable.",
            "messiah college is full of interesting, caring people. there are many extracurricular and cultural activities that are easy to find and enjoy. though some professors are mediocre, my experience with mine has, so far, been mostly good."
        ]
    ],
    "pageTitle": "Messiah College Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Messiah-College/reviews?_escaped_fragment_=/show/30435",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987135.9/warc/CC-MAIN-20150728002307-00339-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 902939187,
    "recordOffset": 902881155,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{83910=Check out our study abroad program. More than 2/3 of Messiah College students have an experience abroad during their time spent at Messiah. Whether this be studying in another country, doing a three week trip over a May Term or January Term or an international service trip. Stepping outside of the US is an experience that will blow you away., 150358=If you show interest in the school beforehand, your online application fee will be waived. This is only if you apply early, around November., 42430=--apply early with the rolling admissions --stay overnight for free in one of the dorms with a current student ----meet with a professor in your department of interest --visit the campus more than once to get a true view of what's going on --look up class pages on Facebook such as Messiah College Class of 2015 to get to know others --explore the surrounding area on campus visits --come prepared with a list of questions, especially on open house days when there are group tours, 259863=© 2015, Cappex.com, LLC, 199550=Creeking- prepare to get thrown in the creek on your birthday. Mine was on December 1st and they still did it. Midnight scream- Everyone screams at midnight during finals week. And many others..., 2961=Messiah is less expensive and more liberal than many of the other private Christian Colleges, and is bigger and/or much more diverse than Malone, Cedarville, EMU or Grove City. It is fairly easy to get a scholarship there if you have decent grades, and it has more majors than many of the other Christian Colleges. Included in each students bill is a student government and student activities fee. So, you don't have to worry about paying for each sorority or fraternity or group you would like to join. The groups that need money are given a budget, so you hardly ever have to pay to join or get involved (unless you need equipment or something). This makes it easy for you to do all the activities you would like, while still being able to afford the meal plan. Maybe. Our meal plan is expensive, and each freshman and sophomore must purchase the without limits ultra meal plan--or one that costs exactly the same as it. The food is really good, and you have TONS of options (just look at the menu if you are curious-we have even more than it shows). And, the dining hall is open from 7 AM to 7:30 PM, so it is very convenient, and something is always there that is good to eat. It is just expensive. But do not fear! When you are a junior, senior, or living in off-campus housing, you will not have to pay so much because you are not required to buy a meal plan (but you won't have quite as good meals, unless you are a good chef).}",
    "textBeforeTable": "08/10/2009 Reviewer is A current student here. 17 out of 17 people found this review useful. 1 of 52 Messiah Student, Health and Exercise Science Major Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6,",
    "textAfterTable": "Am enjoying being here The people, the landscaping, the activities, and the classes all keep me breathless and busy. When I am not hanging out with friends, making new friends in one of the hundreds of student-run organizations, or taking classes, I can run through the fitness trail through the woods or wander through beautiful gardens. Messiah has a wonderful balance of places to be active and with people and places to be by yourself to study, pray or take a break. There are so many clubs it is difficult to choose what to commit to, so you really have to make it a priority to choose things that you can do and have fun at, but not take out too much time for studying. Living in a somewhat rural location (although we are 15 min. from Harrisburg) allows us to do outdoors clubs with wilderness activities one day and work with inner-city kids the next day. Any activity you can imagine that you would like to try is there. And if, for some reason it isn't, you can start a club and go do it! Am learning a lot Mostly my classes have been small enough to be able to get to know the teacher, yet large enough to have a discussion that has representatives from many different worldviews. Even the lecture classes",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}