{
    "relation": [
        [
            "Names :",
            "Addresses of their affiliations :",
            "Contact Person:"
        ],
        [
            "Antonio La Marca -Yusuf Sezgin",
            "Università della Calabria -v. P. Bucci, cubo 21 B, 87036 Arcavacata di Rende CS - Italy & Celal Bayar University - Turkey",
            "Antonio La Marca"
        ],
        [
            "Titles :",
            "Contact Email addresses :",
            "Session Type :"
        ],
        [
            "Assistant professor Univ. of Calabria (Italy) & director of Italian Archaeologic Mission in Aeolian Kyme (La Marca) - Un. professor Celal Bayar University (Turkey) and Director of Aigai Mission (Sezgin)",
            "antonio.lamarca@unical.it",
            "Regular"
        ]
    ],
    "pageTitle": "EAA 2014 Istanbul Conference - T01 Connecting seas- across the borders",
    "title": "",
    "url": "https://www.eaa2014istanbul.org/sayfa/138",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042981576.7/warc/CC-MAIN-20150728002301-00055-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 899164127,
    "recordOffset": 899136236,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{71680=Eastern Anatolia and the Southern Caucasus (Transcaucasia) are among the most important cultural regions in the Ancient Near East, sharing many common features in terms of geography and culture. These two regions, which are located in the northern mountainous belt of Upper Mesopotamia, are defined as the highland. The main features of this vast region are mountain ranges reaching up to 5000 meters, high plateaus and river valleys which ecological niches sheltering among these volcanic ranges. Because of an increase in archaeological projects in recent years, particularly in the territory of the Southern Caucasus, light has been shed on the framework of regional archaeology. In this harsh geographical zone, there were some striking cultural and political transformations throughout the archaeological periods. This change and transformation sequence has been revealed from the rise of the Kura-Araxes Cultural Complex through to the origins of the Urartian Kingdom, which was the first central political structure in the highland. It is through graves and burial customs that these changes and transformations can be viewed effectively, with the evidence ranging from grave types to grave gifts. This evidence also has played a major role in our understanding of the socio-economic, cultural and political stages of the people living in that region. The main goal of this meeting which we are planning is to gather together archaeologists working in Eastern Anatolia and countries of Southern Caucasus (Azerbaijan, Georgia, Armenia and Northestern Iran) to share and convey information related individual case among them. The target audience is not only the archaeologists from those regional areas but also archaeologists from other countries who are working there. As is known, there are many overseas archaeology teams working in Transcaucasia., 76962=Early modern and modern colonial expansion had an irreversible impact on material culture, mobility, modes of production, use of space, consumption and diet. Colonial encroachment on the fringe areas of European kingdoms and on the territories in distant continents established novel connections and dependencies between places, enforced and stimulated a flow of people and things and led to cross-cultural interactions. These encounters and more permanent cohabitation engineered new identities, worldviews and human-object-landscape entanglements. This session aims to discuss archaeological aspects of colonialism and the colonial world and intends to create a platform for archaeologists dealing with questions related to the subjects of power, networks, exchanges, consumption and material entanglement in the colonial settings of early modern and modern period. It builds on a well-received session at EAA in Helsinki in 2012., 51041=Exploration of the material remains of Mediterranean ports and harbors extends back to the earliest days of underwater archaeology. Yet such studies have often focused on the strictly technical and architectural at the expense of the social and economic. In addressing together the many facets of these maritime archaeological sites, this session investigates how ports, harbors and anchorages fostered the development of socioeconomic relationships, communities and landscapes across the Mediterranean. Papers in this session will explore, at various analytical scales and through different methodologies, the cultural, environmental and economic processes behind constructed maritime landscapes, the interrelated effects of technological development and socioeconomic change, and the comparative and complementary roles played by a range of diverse facilities from massive built harbors to humble anchorages. Taking up the call of Horden and Purcell (2000, 393) to view these liminal spaces as “nodes of density in the matrix of connectivity”, this session provides a diachronic view of how ports, harbors and anchorages—large and small, built and natural, urban and peripheral, all-weather and seasonal—tied together the coastal populations of the pre-modern Mediterranean., 23286=The 4th millennium BC marks a period of remarkable cultural changes. In some regions the Late Chalcolithic cultures finished suddenly (e. g. Karanovo VI in Thrace), in other regions (especially in West- and Central Anatolia) the archaeological evidence seems to be underrepresented. The formation of Early Bronze Age Cultures starts later on, at around ca. 3200/3000 BC. According to chronological problems and limited sources, the process is still quite poorly understood and the correlation of European developments (e. g. Cernavoda, early Ezero, early Karaz, Maikop, etc.) with those in Anatolia is difficult to assess. Therefore this session addresses a wide range of aspects of the Late Chalcolithic/Early Bronze Age transition and its supraregional context: 1.) new excavations and stratigraphies for the 4th millennium BC; 2.) pottery chronology for the 4th millennium BC; 3.) supraregional connections and relations between Europe and Anatolia; 4.) the transition in to the Early Bronze Age and the formation of Early Bronze Age cultures at the end of the 4th millennium BC and in the early 3rd millennium BC: problems of change and continuity; 5.) new research on the economy (archaeozoological studies, metallurgy, etc.)., 68320=Vrije Universiteit Brussel, Pleinlaan 2, 1050 Brussel, Belgium & University of Aberdeen, School of Geosciences, St Mary's, Elphinstone Road, Aberdeen AB24 3UF, UK, 15503=After the groundbreaking study of Karl Lehmann-Hartleben from 1938, Mediterranean harbour cities have raised greater interest among classical and byzantine archaeologists only since a couple of years. Until then, technology focused studies on single elements such as moles, breakwaters or shipsheds have provided important evidence, but did not stimulate a wider discourse among various disciplines. Current studies, however, attempt to understand the particular urban, cultural, and economic character of harbor cities and try to analyze their particular role within Mediterranean networks. Topics such as urbanism and urban identity of harbour cities, their economy, connectivity and dis-connectivity, orientation towards sea and/or inland, or harbor-networks dominate the current debate. The proposed session intends to give a broad overview of current projects and approaches, including the western and the eastern Mediterranean. Established experts as well as early career researches from Turkey, Germany, Great Britain and France will discuss latest research from fieldwork as well as comprehensive studies. Furthermore, the section includes participants of large-scale European research activities in the field such as the new ERC Roman Ports Project or the Schwerpunktprogramm 1630 of Deutsche Forschungsgemeinschaft: “Häfen von der Römischen Kaiserzeit bis zum Mittelalter. Zur Archäologie und Geschichte regionaler und überregionaler Verkehrssysteme”., 74725=The study of post–Medieval archaeology is a growing field of inquiry globally. In the Mediterranean region it has often been included in large-scale projects aimed at exploring the longue durée, seen as an extension to Medieval archaeology, or has taken the form of rescue archaeology. Consequently, it is rare that researchers meet to discuss post-1400 archaeology. In this session we aim to both provide a platform of communication and an assessment of the current state of Mediterranean post-Medieval/historical archaeology. We invite papers that address terrestrial and underwater archaeology historical sites, along with methodological and interpretive approaches. The papers will be empirically grounded at sites from all regions of the Mediterranean world and will focus on the ways that people, ideas, and commodities flowed across the region connecting cultures and creating networks that helped shape the modern world. We would also like to include papers that critically assess issues that may create challenges for current and future Mediterranean historical archaeology, such as the impact of legislation or national disciplinary traditions.}",
    "textBeforeTable": "T01S001 Balkans and Anatolia in Prehistory: cultural interactions and barriers   T01 Connecting seas- across the borders Contact Various Language Shopping Visa Security Travel Facts Transportation EA Post-Meeting Tours EA Pre-Meeting Tours EA Daily Excursions EA Daily Tours Tours Accommodation Istanbul Turkey Star Alliance Promotion Travel Press News Exhibition & Sponsorship Privacy Policy Legal Notices Transfer Tour Booking Hotel Booking Payment Terms & Conditions Registration Fees and Conditions Registration Annual Dinner Registration & Booking Klaus Scmidt Gustave Mendel – Pascal Sébah From a dusty dig to dusty shelves The Forgotten Kingdom Side Activities Student Awards Heritage Prize Opening Ceremony Session Program Chart Abstracts Final Scientific Programme Meeting Programme Final Programme Meeting Secretariat Web Manual Wenner Gren Fund Notes for Speakers Notes for Poster Presentations Notes for",
    "textAfterTable": "  Many studies of the Neolithization process make reference to cultural interactions between Anatolia and the Balkans. As yet, however, no consensus has emerged on the nature, timing and direction of the cultural exchanges between the two regions, which exhibit a wide spectrum of mundane and artistic practices against the background of material cultures that are specific to each region. New concepts and paradigms have appeared only to be discarded when they fail to explain all facets of the archaeological record, such as monochrome vs white-on-red painted pottery, obsidian vs high quality Balkan flints, the full Neolithic package vs the scarce evidence of indigenous hunter-gatherer communities, and demic vs cultural diffusionist perspectives. The session will showcase empirical studies and theory-based investigations of human migrations, and the spread of ideas, technical achievements and social practices in the Balkan-Anatolian cultural interaction zone. The chronological scope of the session is confined to the Neolithic and Bronze Age.   TO1S002 Ports and Forts of the Muslims. Coastal military architecture, from the Arab Conquest to the Ottoman Period Names : Stephane Pradines / Eric Vallet / Ahmad al-Shoky Titles : Associate Professor / Lecturer / Associate Professor Addresses of their affiliations : Aga Khan University London / Paris I Sorbonne / Cairo University Contact Email addresses : stephane.pradines@aku.edu Contact Person: Stephane Pradines Session Type : Regular   Islam was always associated with merchants and trade. This session seeks to understand the",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}