{
    "relation": [
        [
            "Room type",
            "Standard Twin",
            "Deluxe Double",
            "Deluxe twin",
            "Suite"
        ],
        [
            "Status",
            "Limited Availability",
            "Limited Availability",
            "Limited Availability",
            "On Request"
        ],
        [
            "Cabin price (pp) from",
            "Cabin price (pp) from USD $3,625 plus extra USD $120 = USD $3,745.00*",
            "Cabin price (pp) from USD $4,145 plus extra USD $120 = USD $4,265.00*",
            "Cabin price (pp) from USD $4,145 plus extra USD $120 = USD $4,265.00*",
            "Cabin price (pp) from USD $3,795 plus extra USD $120 = USD $3,915.00*"
        ],
        [
            "",
            "Book now",
            "Book now",
            "Book now",
            "Book now"
        ]
    ],
    "pageTitle": "Wildlife Holidays in Ecuador | Galapagos Explorer Itinerary B - Premium",
    "title": "Tue 19 Jul 16 - Mon 25 Jul 16 Follows itinerary B in the Galapagos Islands View Cabin Rates",
    "url": "http://www.exodustravels.com/ecuador-holidays/galapagos-explorer/wgs?country=en-au",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987135.9/warc/CC-MAIN-20150728002307-00097-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 431732947,
    "recordOffset": 431691595,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{30226=Explore the spectacular wilderness at the southern end of the world. Departs: Sat 17 Oct. 2015, 38747=This unique cycling raid is a must-do route for any road cycling fan. It will take us on a journey over eleven of the most famous Cols in the Pyrenees. Departs: 15th August 2015, 18642=Stunning Croatian islands and the historic cities of Split, Trogir and Dubrovnik. Departs: 27 September 2015., 17848=Enjoy the best of Vietnam on two wheels. Departs: 22 August 2015 (Land only: 23 August 2015)., 31087=Exclusive photographic charter in the Svalbard Archipelago accompanied by Paul Goldstein and Mark Carwardine. Departs: 22 June and 3 July 2016}",
    "textBeforeTable": "Queen Beatriz Excluding flights Dates & prices We hope you enjoy using the Departure Lounge to meet your fellow travellers and continue to contribute right up to the start of your journey with Exodus. Please note: there might be slight a delay before your post/comment appears as intended because we moderate what is published on the website. When viewing the Forum area of the website, as you scroll through the 'Rooms' which are set out by 'travel months' during the current year within the Departure Lounge. You can then select the 'month' of intended travel, then filter the list of trips that have already been created by fellow travellers to see if your trip is listed. If the trip you are travelling on is not in the list, you can start the process by clicking on the 'Post new forum topic' link above the list on the same page. If you do see your trip within the list, select it to view the 'discussion' by your fellow travellers and you can join in by completing the 'Post your comment' section below the discussion thread. To join in a discussion, if already a member, please sign in to your Exodus website account (not related to booking reservations) to contribute",
    "textAfterTable": "Was USD $3,950 Now USD $2,885 plus extra USD $120 = USD $4,070.00* Contact Us Suite Unavailable Cabin price (pp) from USD $3,615 plus extra USD $120 = USD $3,735.00* Contact Us Tue 18 Aug 15 - Mon 24 Aug 15 Follows itinerary B in the Galapagos Islands View Cabin Rates Room type Status Cabin price (pp) from Standard Twin On Request Was USD $3,595 Now USD $2,637 plus extra USD $120 = USD $3,715.00* Book now Deluxe Double On Request Was USD $3,950 Now USD $2,885 plus extra USD $120 = USD $4,070.00* Book now Deluxe twin On Request Was USD $3,950 Now USD $2,885 plus extra USD $120 = USD $4,070.00* Book now Suite Fully booked Cabin price (pp) from USD $3,615",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}