{
    "relation": [
        [
            "Capacity",
            "Current",
            "Proposed"
        ],
        [
            "ACF Beds",
            "128",
            "128"
        ],
        [
            "ALP Beds",
            "14",
            "14"
        ],
        [
            "ALR Beds",
            "0",
            "0"
        ],
        [
            "EALR Beds",
            "0",
            "0"
        ],
        [
            "SNALR Beds",
            "0",
            "0"
        ]
    ],
    "pageTitle": "Adult Care Facility / Assisted Living Residence Applications in Erie County",
    "title": "",
    "url": "http://www.health.ny.gov/facilities/cons/adult_care/county/erie.htm",
    "hasHeader": true,
    "headerPosition": "MIXED",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042981576.7/warc/CC-MAIN-20150728002301-00144-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 483470362,
    "recordOffset": 483462160,
    "tableOrientation": "VERTICAL",
    "textBeforeTable": "Private Proprietary Adult Home BUSINESS CORP. Owner Type: CB Williamsville Operator, Inc. Applicant: Mark Ohlendorf - President Kristin Ferge - Treasurer Governing Authority: 02/22/2010 Date: 2439 Comment on this application APP #: Change of Operator App Type: Alterra Clare Bridge of Williamsville 6076 Main Street Williamsville NY 14221 Facility: Adult Care Facility / Assisted Living Residence Applications in Erie County > Adult Care Facility / Assisted Living Residence Applications in Erie County   Adult Care Facility / Assisted Living Residence Public Comment List > Home Page You are Here: A-Z Index A-Z En español Contact Help Home Information for a Healthy New York Department of Health Your browser does not support iFrames skip to main content",
    "textAfterTable": "Facility: Alterra Clare Bridge of Williamsville 6076 Main Street Williamsville NY 14221 App Type: Establish ALR/EALR/SNALR APP #: 2440 Comment on this application Date: 02/22/2010 Governing Authority: Mark Ohlendorf - President Kristin Ferge - Treasurer Applicant: CB Williamsville Operator, Inc. Owner Type: Private Proprietary Adult Home BUSINESS CORP. Capacity ACF Beds ALP Beds ALR Beds EALR Beds SNALR Beds Current 52 0 0 0 0 Proposed 52 0 52 52 52 Facility: Blocher Homes 135 Evans Street Williamsville NY 14221 App Type: Establish ALR/EALR/SNALR APP #: 2736 Comment on this application Date: 02/28/2013 Governing Authority: Kristin Crandall, Administrator Applicant: The Blocher Homes, Inc. Owner Type: Not-for-Profit Adult Home NOT-FOR-PROFIT CORP. Capacity ACF Beds ALP Beds ALR Beds EALR Beds SNALR Beds Current 65 0 65 17 0 Proposed 65 0 0 5 0 Facility: Bristol Village, Inc. 8455 Clarence Center Road Clarence Center NY 14032 App Type: Establish ALR/EALR/SNALR APP #:",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}