{
    "relation": [
        [
            "",
            "Total tax revenues",
            "Total non-tax revenues",
            "Less: bad debts",
            "Net results"
        ],
        [
            "Change %",
            "8.2%",
            "43.7%",
            "628.9%",
            "8.0%"
        ],
        [
            "2011–12",
            "25,113,359",
            "24,388",
            "53,146",
            "25,084,601"
        ],
        [
            "2010–11",
            "23,199,697",
            "16,975",
            "-10,049",
            "23,226,721"
        ]
    ],
    "pageTitle": "Part III - Departmental Performance Report (DPR) - 2011-12 Estimates",
    "title": "Condensed Statement of Administered Revenues For the period ending Year March 31, 2012 ($ thousands)",
    "url": "http://cbsa-asfc.gc.ca/agency-agence/reports-rapports/dpr-rmr/2011-2012/report-rapport-eng.html",
    "hasHeader": true,
    "headerPosition": "MIXED",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042981576.7/warc/CC-MAIN-20150728002301-00233-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 37543259,
    "recordOffset": 37498328,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{11062=Home > About the CBSA > Corporate documents > 2011-12 DPR, 4598=Created in 2003, the CBSA is an integral part of the Public Safety Portfolio, which is responsible for integrated national security, emergency management, law enforcement, corrections, crime prevention and border management operations. Specific responsibilities include the following:}",
    "TableContextTimeStampAfterTable": "{55713=In 2011–12, the CBSA and U.S. Customs and Border Protection (CBP) finalized the establishment of the Cooperative Border Management Framework. The framework comprised three pillars: information sharing; policy and program harmonization; and shared infrastructure. The Cooperative Border Management Framework has since been superseded following the December 2011 announcement of the Beyond the Border Action Plan. The three pillars of the Cooperative Border Management Framework are now part of the wider Beyond the Border Action Plan., 83210=1 Total Authorities and Actual Spending are based on what is published in the 2011–2012 Public Accounts., 112046=1 Total Authorities and Actual Spending are based on what is published in the 2011–2012 Public Accounts. * Planned Financial Resources and Human Resources are based on current annual reference levels and estimated planned items in the Report on Plans and Priorities; while actual Financial Resources and Human Resources are based on final amounts reported at the end of each fiscal year in the Departmental Performance Report. Variance between the planned and actual amounts can result from new Treasury Board submissions approved in Supplementary Estimates during the fiscal year., 126156=The Agency has also begun a multi-year project to improve the overall availability and resilience of its IT systems. With the creation of Shared Services Canada (SSC), the management of e-mail, data centres and networks are being transitioned to SSC’s oversight. The transition of the functional management in these domains is ongoing and is expected to take several years to complete. The Data Centre Recovery Project involves establishing a timely recovery capability of IT services in the event of a major disaster at the data centres operated by SSC on behalf of the CBSA. In 2011–2012, the CBSA completed the mirroring of mainframe data to its alternate data centre, which decreased the CBSA’s time required to recover from a service outage. The Data Centre Recovery project continues to work on decreasing recovery times for critical systems. The final outcome will be the capability to ensure near-continuous delivery of critical CBSA IT services. The implementation of upgrades and the multi-year recovery project respond to risk identified in the Agency’s Enterprise Risk Profile., 109572=In 2011–12, the Agency completed the Business Use Cases for ARL, which outlines the services, tasks and functions in the Ledger, and identifies its end users. In March 2012, the CBSA completed the ARL SAP (Systems, Application and Processes) blueprint sessions, which aim at strengthening financial controls. The CBSA completed numerous consultations and technical sessions with the trade community to confirm that the ARL design and the alignment of billing periods and payment dates were feasible. The ARL system is now in its application development stage, with the project plans having been endorsed by both the Chief Information Officers of the Canada Revenue Agency and Treasury Board Secretariat., 58163=Finally, in 2011–12, under the Beyond the Border Small and Remote Ports Initiative, the CBSA and CBP continued to work on establishing joint border management facilities through the bilateral discussions of the Small Ports Working Group. The CBSA will not close any small ports. Work continues towards the development of consensus recommendations for small and remote ports of entry. The final Joint Action Plan will be published by June 30, 2013., 121278=In 2011–12, the Agency designed and implemented a training fenced funding initiative that includes the establishment of training fenced funds centres for capturing training spending to come into effect on April 1, 2012. This initiative is instrumental in allowing the organization to track and monitor training and learning spending with the objective to better align this spending to the organization’s obligations and priorities. The CBSA also established a new functional table (Training and Learning) to set strategic and functional direction through clearly defined outcomes and priorities, as well as review both performance and expenditures of the program area., 95169=To continue and expand on the success of 2011–2012, the Agency is implementing the same approach to other immigration enforcement initiatives and program areas. As such, clear performance targets will be established and linked to budget allocations for all program areas within immigration enforcement, regular monitoring and reporting will be in place and the governance structure will be used to manage issues and risks., 71090=2010–2011 Performance, 120254=The construction project for the CBSA’s main training campus (National Defensive Tactics Training Facility) in Rigaud, Quebec proceeded on schedule in 2011–12 and was completed in the summer of 2012. This new state-of-the-art facility will provide defensive tactics training with a 36-lane firing range and six simulators. These facilities will provide sufficient capacity and infrastructure to deliver the new CBSA Officer Induction Training Program, which includes a significant arming component, as well as the delivery of arming training for existing officers. The main campus will also be a key location for other CBSA training deliveries, and provide the appropriate setting to support external partnerships, including our commitment defined in the letter of intent signed between the CBSA and the Royal Canadian Mounted Police and Correctional Services Canada to expand cooperation across the Public Safety Portfolio and begin sharing training facilities related to core firearms training., 101531=In 2011–12, the CBSA was successful in reducing the backlog of enforcement appeals. The goal was surpassed, as more than 500 appeals older than two years and/or nearing two years of age were completed during the fiscal year. Since April 2011, the number of undecided appeals of more than two years was reduced from 272 to 93, well below the targeted 20% of total undecided appeals. This outcome is directly attributed to the creation of a temporary team of appeals officers. The additional goal of ensuring that no more than 2,500 appeals would be outstanding at any one time was also met and exceeded as the inventory now stands at 2,207 files., 35911=For information on the CBSA’s organizational Votes and/or statutory expenditures, please see the Public Accounts of Canada 2012 (Volume II). An electronic version of the Public Accountsis available on the Public Works and Government Services Canada website, Public Accounts of Canada 2012., 122631=In 2011–12, the CBSA continued the delivery of ethics awareness sessions to CBSA staff. The CBSA also developed new ethics training and awareness products, including manager and employee toolkits and awareness sessions designed specifically for managers. These products are currently being amended to reflect changes to the CBSA Code of Conduct resulting from the tabling of the new Values and Ethics Code for the Public Sector and they will be introduced in January 2013. In addition, the CBSA introduced a robust Values and Ethics series of modules for recruits attending the Officer Induction Training Program., 73243=For more information on how the CBSA is managing threats to ecosystems, refer to the CBSA’s Sustainable Development Strategy Performance Report 2011–2013., 134460=Comparative figures have been reclassified to conform to the current year's presentation. The 2010–11 amounts for the Agency Activity financial statements have been restated according to the revised Treasury Board Accounting Standard (TBAS) 1.2: Departmental and Agency Financial Statements, which is effective for financial reporting of fiscal years ending March 31, 2012 and later., 94798=During the 2011–2012 fiscal year, the Agency was very successful in achieving all milestones and key targets associated with the refugee reform initiative. The success is directly linked with the functional management that was instituted for the initiative, including governance, financial management, performance tracking, risk and issue management., 113473=For details on the CBSA’s activities related to these targets areas, refer to the CBSA’s Sustainable Development Strategy Performance Report 2011–2013., 7823=The CBSA’s Change Agenda, a multi-year transformational initiative launched in 2009, concentrates on setting the foundation for a more dynamic, responsive and service-oriented organization. Promoting a culture of service excellence, the Change Agenda’s activities are centred on three themes: frontline service delivery, people management, and management excellence. During 2011–12, the Agency continued to make change a reality through key accomplishments such as the development of a Service Improvement Plan, the launch of a new officer induction, recruitment, and training program, and the ongoing implementation of the Functional Management Model., 48172=In 2011–12, the Agency completed the organizational design for the new centralized NTC and drafted the new Targeting Business Model. The NTC increases the Agency’s national risk response capacity by developing stronger partnerships between the targeting and intelligence communities within Canada and abroad. The new Targeting Business Model has further improved the Targeting Program by centralizing and better integrating critical targeting activities used to identify people, goods and/or conveyances posing threats to Canadians. In January 2012, air passenger targeting performed at the Edmonton, Ottawa, and Halifax airports was transitioned to the NTC as part of the test phase for implementation of the centralized model into the National Targeting Centre. The transition of the remaining airports for air passenger targeting is currently underway and set for completion in 2012–13. Air Cargo, Marine Cargo, and Marine Vessel and Crew will also be transitioned from regional units into the NTC prior to the end of the 2012–13 fiscal year., 102227=In 2009 the Recourse Program became responsible for accepting and storing security bonds from clients who need to pay or secure any duty owing before filing their appeal. This service was previously provided by Tax Services Offices of the Canada Revenue Agency. An internal evaluation found that the roles and responsibilities associated with this function were not clearly understood by the officers within the Recourse Program. Consequently, new policies and procedures have been developed and will be implemented within the year in order to ensure national consistency., 49259=In 2011–12, the Agency also implemented a number of related targeting initiatives, which included the development and delivery of the pilots for the Foundations of Targeting and Air Passenger Targeting training courses; and holding regional workshops to solicit best practices and provide information on the new targeting business model. The Targeting Program participated in outreach to regional operations including responding to enquiries concerning the implementation of the NTC and targeting business model, and discussing the Targeting Program communications strategy. In March 2012, a targeting officer job description was approved and classified, and came into effect on April 1, 2012., 1526=With regard to improving the Agency’s enforcement capacity, 2011–12 was a milestone year for the CBSA. In 2011–12, the Agency facilitated the largest number of removals since its inception in 2003, and increased the total volume of removals for the fifth consecutive year, with a total of 16,511 inadmissible persons removed from Canada, of which 1,914 (or 12%) were high‑priority criminal removals., 115650=The CBSA also continued to build risk management capacity through a number of important initiatives. In Fall 2011, the Agency launched a one-day risk management course for managers and executives. The course was designed to guide managers through the CBSA risk management process, allowing them to develop their skills to effectively manage risks in support of enhanced decision making. To date, 11 training sessions have been held (including three in the regions). The Agency also developed and piloted an online learning tool for all CBSA employees that will increase employees’ awareness and understanding of the Agency’s risk management process and its related concepts., 7257=In December 2011, the Prime Minister of Canada and the President of the United States of America signed an action plan arising from the declaration Beyond the Border: A Shared Vision for Perimeter Security and Economic Competitiveness. The Beyond the Border Action Plan signaled a strong commitment to further harmonize travel and trade facilitation and strengthen the security efforts between the two countries. Throughout 2011–12, the CBSA played an active role in the development, negotiation, and early advancement of the Action Plan., 124739=In 2011–12, the Agency developed a strategy to mitigate risks related to aging information technology used in critical systems (the Strategic Technology Plan). Phase one of the plan’s implementation began in February 2012. The development of this strategy responds to a risk identified in the Agency’s Enterprise Risk Profile with respect to system technology and sufficiency as well as to the Auditor General’s 2010 Spring Report. The Strategic Technology Plan has and will continue to identify the various business initiatives over the next five years that can be leveraged to address the Agency’s business applications., 74095=In 2009, the CBSA developed and implemented a new Service Strategy. The goal of the Strategy was to strengthen the CBSA’s culture of service, simplify and streamline how the CBSA and clients interact, and increase the CBSA’s accountability through the development of additional service standards and performance measures that can be reported on a regular basis. The Service Strategy includes the development of a service commitment, service web page and an Enhanced Complaint Mechanism, and sets out a uniform approach for designing or refining programs and policies that will ensure greater engagement with business and industry., 43364=A customs controlled area is a designated area where domestic workers and departing domestic travellers are more likely to come into contact with international travellers and goods not yet cleared by the CBSA. Under the 2009 amendments to the Customs Act, CBSA officers were given the legal authority to question, examine and search people and goods, both within customs controlled areas and at exit points. Regulations that specify how that authority will be administered were pre-published in the Canada Gazette,Part I, in November, 2010. Customs controlled areas will improve the security of Canadians as they will act as a deterrent to internal conspiracies at ports of entry and help mitigate the risks posed by organized crime and national security threats. They will also help the CBSA interdict contraband and other illegal items before they reach Canadian communities., 132647=100% completion by March 2012, 33486=For information on the CBSA’s sustainable development goals and targets, refer to the Agency’s Sustainable Development Strategy 2011–2013. For a broader perspective on the Government of Canada’s commitment to the environment, refer to the Federal Sustainable Development Strategy., 9876=The CBSA takes a proactive approach to managing risk by engaging the entire Agency in the Enterprise Risk Management process. The launch of the CBSA’s first full Enterprise Risk Profile (ERP) cycle in 2011, was a notable achievement. The bi-annual ERP identifies and ranks the top risks to the Agency’s achievement of its strategic objectives. The goal is to strengthen the Agency’s resilience to its changing environment by providing senior management with the risk‑based information needed to make better-informed decisions. Following the completion of the 2011 ERP, the Agency developed tailored Risk Response Strategies that outline the mitigation plans for each of the risks that were assigned a response of “Mitigate.” These Risk Response Strategies outline the CBSA’s risk mitigation plan for each of the risks., 71005=2011–2012 Performance, 60375=In keeping with the theme to offer programs to low-risk travellers, the CBSA committed to developing an implementation plan for the Canadian pilot of the Asia-Pacific Economic Cooperation (APEC) Business Traveller’s Card scheme during summer 2012 and work progresses to finalize the plan by early fall 2012.  This pilot will provide Canadian business travellers who are members of the NEXUS program, access to special service lanes when travelling abroad to participating APEC economies., 47177=In May 2012, the CBSA deployed systems functionality for rail carriers to provide advance cargo and conveyance data on commercial goods coming into Canada. This uses the newly developed Multi-Modal Manifest, which offers enhanced features to support the flow of goods., 91988=To support this objective, the Agency received funding to increase the number of removals of failed refugee claimants by a total of 4,200 cases over a three-year period (2010–11 to 2012–13). The CBSA’s regional offices have employed 60 new inland enforcement officers to build the necessary capacity to meet the 4,200 removal target. To maximize operational and cost effectiveness, the CBSA balanced the use of internal and external staffing processes, which has increased operational capacity and built maximum flexibility in dealing with sunsetting funding. Through these processes the CBSA hired 60 officers to support refugee reform. To date, the CBSA has reached its objective to remove 4,232 additional failed refugee claimants, well in advance of the March 2013 deadline., 125526=As the Information Technology (IT) footprint for the Agency expands and the dependency on reliable infrastructure becomes increasingy more critical to the CBSA border services operations, the facilities (including the building, electrical power and air conditioning) that house the Agency’s IT equipment must be expanded and upgraded. In 2011–2012, the CBSA began to upgrade the power and cooling capacity at its data centre facilities. These upgrades will ensure that sufficient capacity is available in either data centre to operate the CBSA business systems should one data centre become unavailable., 129284=Budget 2009 identified $80 million for the CBSA for accelerated infrastructure projects. This spending is included under the Admissibility Determination program activity. In 2011–12, the CBSA successfully completed the land border infrastructure projects that had been announced under the umbrella of the Government of Canada’s Economic Action Plan. These initiatives include: the expansion, modernization and redevelopment of the port of entry facilities at Kingsgate, British Columbia and Prescott, Ontario; the construction and expansion of the commercial examination facilities at Pacific Highway and Abbotsford-Huntingdon in British Columbia; the construction of an additional commercial primary inspection lane to increase processing capacity at Abbotsford-Huntingdon; and the completion of the additional staff residential housing units in Beaver Creek, Yukon., 128553=* Total authorities, as presented in the “2011–12 Financial Resources” table (and other relevant tables) in the “Summary of Performance” section, is the net of any transfers to Shared Services Canada. Actual spending does not include expenditures incurred on behalf of Shared Services Canada as of the Order in Council date. ** Pursuant to section 31.1 of the Financial Administration Act and Orders in Council P.C. 2011-0881, P.C. 2011-0877 and P.C. 2011-1297, this amount was deemed to have been appropriated to Shared Services Canada, which resulted in a reduction in the appropriation for  the CBSA., 50834=The 2007 October Report of the Auditor General of Canada, Chapter 5 “Keeping the Border Open and Secure” and the Agency’s Pre-Arrival Targeting Evaluation Study both determined that the historical methods of managing the Agency's Targeting Program could be improved and streamlined. As a result, the Agency has focused on streamlining the Targeting Program’s procedures and processes through the development of a national policy, mode-specific procedures, and the development and delivery of targeting officer training courses. Consolidation of targeting activities for optimal operational program delivery continued with the transition to the NTC effective April 1, 2012., 72251=** The number of seizures vary year to year du to a number of external factors outsidethe CBSA control of special note, while the total number of prohibited weapons seized decreased in 2011-12 relative to 2010-11, the number of firearms seized increased during this period.}",
    "textBeforeTable": "  3,084,691 3,305,513 7.2% Total administered liabilities and net amount due to the CRF on behalf of the Government of Canada 2,872,762 3,008,162 4.7% Net amount due to the Consolidated Revenue Fund (CRF) on behalf of the Government of Canada 211,929 297,351 40.3% Total administered liabilities 3,084,691 3,305,513 7.2% Total administered assets 2010–11 2011–12 Change %   ($ thousands) Condensed Statement of Administered Assets and Liabilities For the period ended March 31, 2012 Administered Activities The expenses shown above include the expenses (except bad debts associated with the administered revenues) of the Administered Activities of the Agency. The assets, liabilities and revenues of the Administered Activities are shown separately below. The change in net financial position is a result of the change in expenses, revenues and government funding and transfers. 140,990 271,964 92.9% Departmental net financial position 1,831,407 1,865,491 1.9% Net cost of operations before government funding and transfers 12,600 11,999 -4.8% Total revenues 1,844,007 1,877,490 1.8% Total expenses 2010–11 2011–12 Change",
    "textAfterTable": "Financial Highlights Charts – Agency Activities Tangible capital assets represent the largest portion at $576 million (84 percent) of total assets. Employee future benefits represent the largest portion at $229 million (55 percent) of total liabilities. The program activities included in the category “Other” are: Secure and Trusted Partnerships, Criminal Investigations, and Recourse. For Secure and Trusted Partnerships, the main source of revenue is from registration fees of NEXUS, a joint Canada-U.S. program that simplifies border crossings for pre-approved, low-risk travellers. For Revenue and Trade Management, the revenues are from various services the Agency provides such as food inspection and other border services, collection of Provincial tax and levies, and operation of customs bonded warehouses. Financial Highlights Charts – Administered Activities As per the Administered Activity financial statements, total assets were $3,305 million at the end of 2011–12, an increase of $221 million (7.2 percent) over the total assets of $3,084 million for 2010–11. Cash and taxes receivable represent the largest portion at $3,274 million (99 percent) of total assets. Administered total liabilities were $297 million at the end of 2011–12, an increase of $85 million (40 percent) over the total liabilities of $212 million for",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}