{
    "relation": [
        [
            "",
            "Deferred tax assets:",
            "Net operating loss carry-over",
            "Change in derivative liability",
            "Common stock issued for services rendered",
            "Valuation allowance",
            "Income tax expense per books"
        ],
        [
            "",
            "",
            "$",
            "",
            "",
            "",
            "$"
        ],
        [
            "",
            "December 31, 2012",
            "(370,383)",
            "(26,248)",
            "3,848",
            "(318,355)",
            "-"
        ],
        [
            "",
            "",
            "$",
            "",
            "",
            "",
            "$"
        ],
        [
            "",
            "December 31, 2011",
            "(86,779)",
            "-",
            "3,848",
            "(82,948)",
            "-"
        ]
    ],
    "pageTitle": "Technology Applications International Corp - FORM 10-K - April 16, 2013",
    "title": "",
    "url": "http://www.getfilings.com/sec-filings/130416/Technology-Applications-International-Corp_10-K/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042981576.7/warc/CC-MAIN-20150728002301-00338-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 473576223,
    "recordOffset": 473502529,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{471297=The valuation of the derivative liability is determined using a Black-Scholes Merton Model because that model embodies all of the relevant assumptions that address the features underlying these instruments.  Significant assumptions used in the Black-Scholes models at December 31, 2012 include the following:, 39099=On April 12, 2011, the Company launched its new business NueEarth, Inc., which is a wholly-owned subsidiary of TAIC with the plan to develop, build and sell environmental solutions for the treatment of municipal and industrial wastewater and sludge, as well as cosmetic cross-linking, medical waste disinfecting and many other possible applications. The Company owns and intends to operate the mobile electron beam particle accelerator unit installed in a semi-tractor trailer, which it plans to use for the commencement of operations and making sales presentations to prospective customers throughout the United States, and to other countries., 40656=The Company has commenced business operations and generated minimal revenues. The Company has a specific business plan and is seeking the funds to execute its business plan. The Company does not consider itself to be a blank check company as defined in Rule 419 of Regulation C of the Securities Act of 1933.  It is aggressively pursuing its business plan given the current financial status of the Company and the fact that the Board of Directors is active and supportive of the plan. The Company was acquired for the purpose of executing a specific business plan developed by its founder, Charles J. Scimeca, as set forth in the prospectus.  The Company is moving forward with development as defined in its business development objectives.  Based upon the above, the Company believes it is not within the scope of Rule 419., 113824=For the twelve months ended December 31, 2012, our total gross profit increased by $3,235 or 369.7% to $4,110 from $875 in 2011.  As a percent of sales, gross profit decreased to 51.5% in 2012 as compared to 58.3% in 2011.  The decrease is attributable to product costs., 117555=The Company\u0092s cost of revenue was $3,869 for the year ended December 31, 2012 compared to $4,494 for the period from inception to December 31, 2012., 441023=In conjunction with the Private Placement Memorandum dated October 28, 2011, the Company is offering up to 10,000 Units.  Each Unit consists of 1,000 shares of common stock priced at $0.50 per share and one Class A Warrant to purchase 1,000 shares of common stock with an exercise price of $1.00 per share.  These warrants expire on the earlier of (i) 180 days after the common stock commences quotation on the OTC Bulletin Board or (ii) one year after the date of issuance., 588493=Promissory Note between the Company and Joe-Val, Inc., dated March 27, 2012, 568603=During June 2012, the Company borrowed $125,000 from an affiliate.  The loan bears interest at 10% per annum and is unsecured and payable upon demand.  The Company has paid $36,120 towards the loan amount.  The outstanding balance as of December 31, 2012 is $88,880., 470749=The balance sheet caption derivative liability consists of derivative features embedded in convertible debentures including the conversion feature and warrants which have anti-dilution protections.  These derivative financial instruments are indexed to an aggregate of 800,000 shares of the Company\u0092s common stock as of December 31, 2012 and are carried at fair value.  The balance at December 31, 2012 and 2011 was $276,000 and $0, respectively., 591046=Filed with the SEC on November 29, 2012 as part of the Company\u0092s S-1/A., 462492=Fair Value at December 31, 2012, 73676=In the United States the Environmental Protection Agency (\u0093EPA\u0094) 2009 National Public Water Systems Compliance Report, states that there were over 150,000 public rural water districts in the United States serving over 300 million users. The majority of these are considered very small, small and medium-sized public water systems, which support populations of fewer than 10,000 people. Small systems comprise the vast majority of all systems. Noncompliance occurs more frequently at smaller systems often because they may have fewer resources to operate and maintain compliance. This problem is expected to worsen as more stringent EPA rules are implemented for small public water systems. Approximately 28 percent of all systems in the U.S. had at least one significant violation reported in 2009. This rate is comparable to those reported in previous years. The data submitted by primacy agencies indicate that 7 percent of all public water systems in the U.S., serving approximately 17,693,000 users, had violations of health-based standards in 2009.  In 2009, about 18 percent of all public water systems had significant monitoring and reporting violations. Substantial expenditures will be needed in the coming years for repair, rehabilitation, operation, and maintenance of the water and wastewater treatment infrastructure. Management believes that water districts using conventional treatment methods will be unable to comply with the EPA\u0092s Safe Drinking Water Act (\u0093SDWA\u0094) without massive installations of on-site chemical filter aids and disinfection equipment., 161161=December 31,, 114349=General and administrative expenses consisted primarily of consulting fees, rent, travel, meals and entertainment, and preparing reports and SEC filings relating to being a public company.  For the year ended December 31, 2012, general and administrative expenses increased to $681,875 from $228,713 compared to the year ended December 31, 2011 representing an increase of $453,162 or 198.1%.  The increase is primarily attributable to increases in advertising and marketing costs, consulting fees and officer compensation fees in the amounts of $72,627, $190,895, $120,000, respectively.  These increases are the result of the Company growing its business., 99684=As of April 16, 2013, there were 117,263,000 shares of the registrant\u0092s $0.001 par value common stock issued and outstanding and were owned by approximately 40 holders of record, based on information provided by our transfer agent., 599228=Dated: April 16, 2013, 441599=Warrants to purchase up to1,030,000 shares of common stock were issued in accordance with the Private Placement Memorandum stated above.  Of these issuances, warrants to purchase up to 236,000 shares of common stock expired during 2012.  Warrants to purchase up to 794,000 shares of common stock remain outstanding at December 31, 2012.  As these warrants were issued as part of a unit sold, there has been no value assigned to them., 401295=Research and development costs, which relate primarily to the development, design and testing of products, are expensed as incurred.  Such costs were approximately $7,700 and $18,000 for the years ended December 31, 2012 and 2011, respectively., 431157=Depreciation expense for the years ended December 31, 2012 and 2011 was $4,081 and $4,103, respectively., 61649=At the execution of the Third Amendment, Renuéll shall now have a worldwide exclusive contract for an initial period of five (5) years and two (2) five (5) year possible extensions that are available upon meeting Exhibit B quota requirements. Renuéll shall also deposit Fifty Thousand dollars ($50,000) which will be applied first to the down payment of any purchase order that Renuéll shall make.  On or before January 15, 2013, or upon the successful completion of stability testing of newly developed shampoo and approval by testing authority, whichever occurs later, Renuéll shall place a purchase order for 100,000 Duo-Packs (which consist of 100,000 .5 Oz units and 100,000 units for 100,000 10oz shampoo) or any order for any product that equates to the same dollar amount. The stability testing will comprise of ingredient consistency testing for the shampoo product to ensure that all the ingredients are compatible; this testing will be performed by LaDove Labs, Inc., which is located in Hialeah, Florida. The purchase order requires a 50% down payment, which was paid in December 2012., 112852=The Company\u0092s revenues were $7,979 for the year ended December 31, 2012 compared to $1,500 in 2011.  This represents an increase of $6,479 or 431.9%.  The increase is directly attributable to the Company starting to commence marketing for its product., 8178=San Diego, CA 92106, 487869=As of December 31, 2012, the Company had net operating loss carry forwards for income purposes of approximately $370,383 that may be offset against future taxable income.  The net operating loss carry-forwards expire through the year 2033.  Current tax laws limit the amount of loss available to be offset against future taxable income when a substantial change in ownership occurs or a change in the nature of the business.  Therefore, the amount available to offset future taxable income may be limited., 504334=April 12, 2010, 154395=The accompanying financial statements have been prepared assuming that the Company will continue as a going concern. As discussed further in Note 1, the Company has been in the development stage since its inception (October 14, 2009) and continues to incur significant losses. The Company's viability is dependent upon its ability to obtain future financing and the success of its future operations. These factors raise substantial doubt as to the Company's ability to continue as a going concern. Management's plan in regard to these matters is also described in Note 1. The financial statements do not include any adjustments that might result from the outcome of this uncertainty., 557957=Mr. Stickler was appointed as Vice President and Director on May 18, 2012, and is not compensated as a director., 438805=On October 20, 2011, the Company issued 101,800,000 shares of its common stock as payment for cancellation of debt for part of the amount due to its related party., 99089=As of April 16, 2013, there is no public market for our Common Stock. We intend to contact an authorized OTC Bulletin Board market-maker for sponsorship of our securities on the OTC Bulletin Board., 121420=As of December 31, 2012, total current assets were $299,919, which consisted primarily of cash, inventory and deposits., 466928=Balance as of January 1, 2011, 585159=Filed with the SEC on April 18, 2011 as part of the Company\u0092s Current Report on Form 8-K., 494014=In connection with the preparation of our annual report as of December 31, 2012, the Company\u0092s management, under the supervision and with the participation of the Chief Executive Officer and Chief Financial Officer, evaluated the effectiveness of the design and operation of our disclosure controls and procedures as of December 31, 2012. Based on that evaluation, our Chief Executive Officer and Chief Financial Officer have concluded that our disclosure controls and procedures were not effective as of December 31, 2012, as a result of the existence of material weaknesses in our internal control over financial reporting as discussed below., 590563=Filed with the SEC on January 17, 2013 as part of the Company\u0092s S-1/A..., 444728=Outstanding, December 31, 2010, 418998=2012, 119978=Net loss for the period October 14, 2009 (inception) through December 31, 2012 was $(1,089,363). The net loss for this period was primarily related to general and administrative expenses exceeding the amount of revenues for the period indicated., 584636=Filed with the SEC on January 19, 2010 as part of the Company\u0092s Registration of Securities on Form 10-12G., 489793=During June 2012, the Company borrowed $125,000 from an affiliate.  The loan bears interest at 10% per annum and is unsecured and payable upon demand.  The Company has paid $36,120 towards the loan amount.  The outstanding balance as of December 31, 2012 is $88,880., 96222=We are a smaller reporting company as defined by Rule 12b-2 of the Securities Exchange Act of 1934 and are not required to provide the information under this item., 398126=2016, 569487=$1,729 for each month of use and is payable in arrears.  For the years ended December 31, 2012 and 2011, the Company recorded expense of approximately $10,400 and $0.00, respectively.  No amounts were due at December 31, 2012 or 2011., 54956=On December 29, 2011, and then Amended on January 23, 2012, May 7, 2012 and December 13, 2012, the Company, through its wholly-owned subsidiary, Renuéll Int\u0092l Inc., a Florida corporation (\u0093Renuéll\u0094) entered into that certain distribution agreement (the \u0093Distribution Agreement\u0094) with Regenetech, Inc., a Texas corporation (\u0093RGT\u0094), see section \u0093Distribution Agreement\u0094 for further details of the agreement. Pursuant to the terms and conditions of the Distribution Agreement, Renuéll shall act as an exclusive distributor for a series of cosmetics created in a rotatable perfused time varying electromagnetic force bioreactor developed, manufactured and sold by RGT., 495607=A material weakness is a control deficiency (within the meaning of the Public Company Accounting Oversight Board (PCAOB) Auditing Standard No. 5) or combination of control deficiencies that result in more than a remote likelihood that a material misstatement of the annual or interim financial statements will not be prevented or detected.  Management has identified the following four material weaknesses which have caused management to conclude that, as of December 31, 2012, our disclosure controls and procedures and internal control over financial reporting were not effective at the reasonable assurance level:, 416047=During August 2012, the Company entered into a two-year commission agreement whereby it will pay a $35 commission for each product sold.  The agreement will automatically renew in one-year increments unless cancelled in writing sixty-days prior to expiration., 422870=Machinery and equipment, as of December 31, 2012 and 2011, consisted of the following:, 8106=1220 Rosecrans Street, PMB 258, 152040=We have audited the accompanying balance sheet of Technology Applications International Corporation and Subsidiaries (a development stage enterprise)(the \u0093Company\u0094) as of December 31, 2011 and the related statements of operations, shareholders\u0092 equity/(deficit), and cash flows for the year ended December 31, 2011, and for the period from October 14, 2009 (inception) through December 31, 2011. These financial statements are the responsibility of the company\u0092s management. Our responsibility is to express an opinion on these financial statements based on our audits., 93786=The business activities relating to NueEarth, Inc. are subject to environmental regulation under the same federal, state and local laws and regulations which apply to the Company\u0092s customers, including the Clean Water Act of 1972, as amended, and the Resource Conservation and Recovery Act of 1976, as amended. Management believes that the Company conducts its business in an environmentally responsible manner and is in material compliance with applicable laws and regulations. It is possible that future developments, such as increasingly strict requirements of environmental laws and enforcement policies thereunder, could affect the manner in which the Company operates projects and conducts business, including the handling, processing or disposal of the wastes, by-products and residues generated thereby., 586846=Filed with the SEC on March 28, 2010 as part of the Company\u0092s Annual Report on Form 10-K., 496743=We do not have written documentation of our internal control policies and procedures.  Written documentation of key internal controls over financial reporting is a requirement of Section 404 of the Sarbanes-Oxley Act which is applicable to us as of and for the year ended December 31, 2012.  Management evaluated the impact of our failure to have written documentation of our internal controls and procedures on our assessment of our, 411658=Financial instruments that potentially subject the Company to concentrations of credit risk consist principally of cash accounts.  The Company places its cash in what it believes to be credit-worthy financial institutions.  Accounts at each financial institution are insured by the Federal Deposit Insurance Corporation (\u0093FDIC\u0094) up to $250,000.  At December 31, 2012 and 2011, the Company\u0092s cash balances did not exceed federally insured limits., 216085=Period from October 14, 2009 (inception of development stage) through December 31, 2012, 113339=The Company\u0092s cost of revenue was $3,869 for the year ended December 31, 2012 compared to $625 in 2011.  This represents an increase of $3,244 or 519%.  The increase in cost of revenues is directly attributable to the increase in sales during 2012., 439496=During November and December 2011, the Company issued 236,000 shares of its common stock through a private placement to several investors for total cash consideration of $118,000., 278598=Balance, December 31, 2010, 117140=The Company\u0092s revenues were $7,979 for the year ended December 31, 2012 compare to $9,479 for the period from inception to December 31, 2012., 475261=December 31, 2011, 596889=*To be filed by amendment. Pursuant to Rule 406T of Regulation S-T, the Interactive Data Files on Exhibit 101 hereto are deemed not filed or part of a registration statement or prospectus for purposes of Sections 11 or 12 of the Securities Act of 1933, as amended, are deemed not filed for purposes of Section 18 of the Securities Exchange Act of 1934, as amended, and otherwise are not subject to liability under those sections., 589321=Filed with the SEC on August 20, 2012 as part of the Company\u0092s Quarterly Report on Form 10-Q, 196768=December 31, 2012 and 2011, respectively., 437627=The company amortizes the discount on the convertible debentures resulting from the initial allocation over the term of the convertible debt instruments using the effective method.  Amortization expense arising from this method during the period from inception to December 31, 2012 amounted to $65,708 which has been included as a component of interest expense., 147518=We have audited the accompanying consolidated balance sheets of Technology Applications International Corporation and Subsidiaries (\u0093the Company\u0094) as of December 31, 2012 and the related consolidated statements of operations, stockholders\u0092 deficit and cash flows for the year then ended and for the cumulative period from October 14, 2009 (date of inception) through December 31, 2012 .  These consolidated financial statements are the responsibility of the Company\u0092s management. Our responsibility is to express an opinion on these consolidated financial statements based on our audits., 500639=Our Board of Directors will nominate an audit committee or a financial expert on our Board of Directors in fiscal 2013., 215700=Year Ended December 31, 2011, 490952=Pursuant to Accounting Standards Codification 855-10, the Company has evaluated all events or transactions that have occurred from January 1, 2013 through the filing with the SEC.  , 506978=John Stickler \u0096 Mr. Stickler has served as Vice President and Director since May 18, 2012.  He has worked as a sales and marketing professional for over nineteen years. His experience is mainly in the corporate management of sales and in the selling of a product. From January 2007 until January 2011, Mr. Stickler was a consultant for Regenetech, Inc., whom our Company has a distribution agreement with.  While working for Regenetech, Mr. Stickler gained knowledge of the techniques necessary for manufacture and production of our cream as well as forming working relationships with the inventors of the Bio-Reactor that expands the fibroblast cells that make up the key ingredient for our cream. Mr. Stickler assisted Regenetech, Inc. in introducing their technologies and expansion services to healthcare professionals.  He test marketed the cream to individuals of both sexes with positive results. During this time period Mr. Stickler served as vice-president of Renuell, Inc. a Florida corporation that was dissolved in October of 2010. Renuell, Inc. did no business although it was formed.  No other corporations or organizations are a parent, subsidiary or other affiliate of the registrant that Mr. Stickler is or has been involved with. Because of Mr. Sticker\u0092s knowledge of the cream from its inception and hands on relationships with N.A.S.A. and Regenetech, as well as his experience with marketing skin cream we appointed him as Vice-President and as a Director., 105005=This Annual Report on Form 10-K contains forward-looking statements within the meaning of Section 27A of the Securities Act of 1933, as amended (the \u0093Securities Act\u0094) and Section 21E of the Securities Exchange Act of 1934, as amended (the \u0093Exchange Act\u0094). These forward-looking statements are not historical facts but rather are based on current expectations, estimates and projections. We may use words such as \u0093anticipate,\u0094 \u0093expect,\u0094 \u0093intend,\u0094 \u0093plan,\u0094 \u0093believe,\u0094 \u0093foresee,\u0094 \u0093estimate\u0094 and variations of these words and similar expressions to identify forward-looking statements. These statements are not guarantees of future performance and are subject to certain risks, uncertainties and other factors, some of which are beyond our control, are difficult to predict and could cause actual results to differ materially from those expressed or forecasted. You should read this report, 587861=Bill of Sale and Assignment between Raj Ventures, Inc., and High Voltage Environmental Applications, Inc., dated as of August 26, 2010, 418350=December 31,, 63017=The Third Amendment provides Renuéll with a worldwide exclusive rights to distribute and market the Regenetech cream. Renuéll has worldwide exclusive rights, as further detailed in the December 13, 2012 amendment, to any hair care products and any current or future topical SKU\u0092s developed by Regenetech.  Regenetech will have the exclusive right to provide their bio-molecules to all topical current or future topical products developed by Renuéll., 589876=Filed with the SEC on November 19, 2012 as part of the Company\u0092s Quarterly Report on Form 10-Q, 438441=On October 14, 2009, the Company issued 3,000,000 shares of common stock for $3,000., 442699=Subsequent to December 31, 2012, warrants to purchase up to 15,000 shares of common stock were issued in accordance with the Private Placement Memorandum dated February 13, 2013.  As these warrants were issued as part of a unit sold, there has been no value assigned to them., 263836=Balance, October 14, 2009, 440016=Subsequent to December 31, 2012, the Company issued 15,000 shares of its common stock through April 16, 2013., 587455=Filed with the SEC on April 12, 2010 as part of the Company\u0092s Current Report on Form 8-K., 115565=Other income (expense) consisted of gain on derivative valuation and interest expense.  The gain on derivative valuation is directly attributable to the change in fair value of the derivative liability from date of issuance during 2012 through December 31, 2012.  Interest expense is primarily attributable the initial interest expense associated with the valuation of derivative instruments at issuance and the accretion of the convertible debentures over their respective terms.  Interest associated with the derivative instruments amounted to approximately $219,000.  There was no gain on derivative valuation or interest expense for the year ended December 31, 2011., 3101=ANNUAL REPORT PURSUANT TO SECTION 13 OR 15(d) OF THE SECURITIES EXCHANGE ACT OF 1934.  For the Fiscal Year Ended December 31, 2012, 597914=Pursuant to the requirements of Section 13 or 15(d) of the Securities Exchange Act of 1934, the Company caused this report to be signed on its behalf by the undersigned, thereunto duly authorized., 312657=Year Ended December 31, 2012, 399354=The Company reviews long-lived assets for impairment whenever events or changes in circumstances indicate that the carrying amount of an asset may not be recoverable.  Recoverability of definite-lived assets to be held and used is measured by comparison of the carrying amount of an asset to future undiscounted cash flow expected to be generated by the asset.  If such assets are impaired, the impairment is recognized as the amount by which the carrying amount exceeds the estimated future cash flows.  Assets to be sold are reported at the lower of the carrying amount or the fair value less costs to sell.  Indefinite-lived assets are tested for impairment annually or when impairment is suspected by a comparison of the carrying amount of the asset to the net present value of future cash flows expected to be generated by the asset.  There were no impaired assets at December 31, 2012., 122047=During the period from October 14, 2009 (inception) through December 31, 2012, operating activities used cash of $(913,453). The cash used by operating activities related to general and administrative expenses, the purchase of inventory for resale and non-cash items related to derivative instruments. Except for cash in the amount of $7,979 from sales of our products, all of the cash during this period was provided by related party transactions, capital contributions and convertible debentures., 492438=This report includes the certifications of our Chief Executive Officer and Chief Financial Officer required by Rule 13a-14 of the Securities Exchange Act of 1934 (the \u0093Exchange Act\u0094). See Exhibits 31.1 and 31.2. This Item 9A includes information concerning the controls and control evaluations referred to in those certifications., 162199=2011, 392855=There were no contingencies which could be evaluated at December 31, 2012., 36671=The Company was incorporated as Raj Ventures, Inc., in the State of Florida on October 14, 2009, to effect a merger, exchange of capital stock, asset acquisition or other similar business combination, including being used as a vehicle for a reverse merger acquisition with an operating or development stage business which desired to utilize its status as a reporting corporation under the Exchange Act., 130769=DECEMBER 31, 2012, 474906=December 31, 2012, 480621=The income tax provision differs from the amount of income tax determined by applying the estimated U.S. federal and state income tax rates of 34 percent to pretax income from continuing operations for the year ended December 31, 2012 and 2011 due to the following:, 75476=Drinking water, regardless of its source, may contain impurities that can affect the health of consumers. Although municipal agencies and water utilities in the United States are required to provide drinking water that complies with the 1996 amendments to the SDWA, the water supplied to homes and businesses from municipalities and utilities may contain high levels of bacteria, toxins, parasites and human and animal-health pharmaceuticals, as, 448696=Outstanding, December 31, 2011, 592104=Filed with the SEC on April 16, 2012 as part of the Company\u0092s Annual Report on Form 10-K, 102148=On September 25, 2012, the Company issued a $100,000 convertible debenture.  The convertible debenture bears interest at a rate of five-percent (5%) per annum and is payable September 21, 2013.  At the Holder\u0092s option, principle and unpaid accrued interest shall be convertible into common stock at a rate of $0.50 per share.  In addition to the common stock, the Holder shall receive warrants to purchase an equal number of shares of common stock exercisable at $1.00 per share at the earlier of 180 days after the common stock commences quotation on the OTC Bulletin Board or one year from date of exercise., 419384=2011, 494922=Management, with the participation of our Chief Executive Officer and Chief Financial Officer, has conducted an evaluation of the effectiveness of our internal control over financial reporting based on the framework set forth in \u0093Internal Control\u0097Integrated Framework\u0094 issued by the Committee of Sponsoring Organizations of the Treadway Commission. Based on management\u0092s assessment under this framework, management has concluded that our internal control over financial reporting was not effective as of December 31, 2012, as a result of the existence of material weaknesses., 531863=2012, 455743=Outstanding, December 31, 2012, 149456=In our opinion the consolidated financial statements referred to above present fairly, in all material respects, the financial position of Technology Applications International Corporation and Subsidiaries as of December 31, 2012 and the results of their operations and cash flows for the year then ended and for the cumulative period from October 14, 2009 (date of inception) through December 31, 2012, in conformity with accounting principles generally accepted in the United States of America., 13834=As of April 16, 2013, there were 117,263,000 shares of the registrant\u0092s $0.001 par value common stock issued and outstanding., 116473=Our net loss for the year ended December 31, 2012 was $834,079 compared to a net loss of $227,838 for the year ended December 31, 2011, an increase of $606,241 or 266.1%.  The net loss is influenced by the matters discussed in the other sections of this MD&A., 37183=On April 12, 2010, one hundred percent of the issued and outstanding common stock of the Company was transferred and sold to Raj Ventures Funding, Inc., a company owned and controlled by Charles J. Scimeca, which resulted in a change in control of the Company. Ms. Colleen Foyo, Raj Ventures, Inc. sole officer and director resigned on April 12, 2010, and Mr. Scimeca replaced such person, as the President, Secretary and Treasurer and sole director of the Company and he continues to serve in such capacity., 569849=The Company has entered into a consulting agreement (\u0093Consulting Agreement\u0094) with Mr. John Stickler one of the Company\u0092s directors, as of January 1, 2011. The Consulting Agreement was filed as Exhibit 10.9 on December 27, 2012 as part of the Company\u0092s Amended Registration Statement on Form S-1/A. As per the Consulting Agreement, Mr. Stickler is paid on an invoice basis up to $5,000 a month in payments. The Consulting Agreement may be canceled by either party upon thirty (30) days written notice., 107547=December 31, 2012, 558287=All Other Compensation for the year ended December 31, 2012 for Mr. Stickler includes $60,000 as compensation for Mr. Stickler\u0092s work as a consultant to the Company as provided for in his Consultant Agreement., 396715=The estimated future amortization expense related to trademarks as of December 31, 2012 is as follows:, 298676=Balance, December 31, 2012, 271703=Balance, December 31, 2009, 499084=Management, with the participation of our Chief Executive Officer and Chief Financial Officer, has assessed whether any changes in our internal control over financial reporting that occurred during the year ended December 31, 2012 have materially affected, or are reasonably likely to materially affect, our internal control over financial reporting. Significant changes are being implemented during the 2013 to remediate our material weaknesses in internal control over financial reporting. Management believes that such measures we are implementing to remediate the material weaknesses in internal control over financial reporting will have a favorable impact on our internal control over financial reporting. Changes in our internal control over financial reporting through the date of this report that have materially affected, or are reasonably likely to materially affect, our internal control over financial reporting are described below., 60011=On December 29, 2011, Renuéll Int\u0092l, Inc. entered into a Distribution Agreement (the \u0093Distribution Agreement\u0094) with Regenetech, Inc., a Texas corporation, pursuant to which Renuéll will act as a distributor and marketer of Regenetech\u0092s cosmetic products. The Distribution Agreement was first amended on January 23, 2012 to more clearly define section 9.2, that Regentech makes no warranty as to materials provided to them by Renuéll.  On May 7, 2012 the Company reached a second amendment to the Distribution Agreement; whereby, Regenetech gave permission to Renuell to use Regenetech\u0092s Lab Report findings. The Distribution Agreement was amended a third time on December 13, 2012 (the \u0093Third Amendment\u0094), amends the Terms, Territories, Exhibit A and Exhibit B sections of the Distribution Agreement. The Third Amendment provides a worldwide exclusivity to Renuéll of the Regenetech cosmetic products, for an initial period of five (5) years and two (2) five (5) year extensions that are predicated on meeting quota requirements. The Third Amendment also requires a deposit of $50,000 to be made by the Company. The Distribution Agreement contains quota requirements that Renuéll must meet in order to retain the worldwide exclusivity, territory and extensions to the contract.  The Company has paid the $50,000 deposit that is required by the Third Amendment., 410085=Income taxes are accounted for under the asset and liability method.  Deferred tax assets and liabilities are recognized for the future tax consequences attributable to differences between the financial statement carrying amounts of existing assets and liabilities and their respective tax bases and operating loss and tax credit carry-forwards.  Deferred tax assets and liabilities are measured using enacted tax rates expected to apply to taxable income in the years in which those temporary differences are expected to be recovered or settled.  The effect on deferred tax assets and liabilities of a change in tax rates is recognized in income during the period that includes the enactment date.  The Company recognizes the effect of income tax positions only if those positions are more likely than not of being sustained.  Recognized income tax positions are measured at the largest amount that is greater than 50% likely of being realized.  Changes in recognition or measurement are reflected in the period in which the change in judgment occurs.  The Company records interest related to unrecognized tax benefits in interest expense and penalties in general and administrative expenses.  No interest expense or penalties have been assessed as of, and for the years ended, December 31, 2012 and 2011., 313468=Period from October 14, 2009 (inception of development stage) through December 31, 2012, 30373=This Annual Report on Form 10-K contains forward-looking statements within the meaning of Section 27A of the Securities Act of 1933, as amended (the \u0093Securities Act\u0094) and Section 21E of the Securities Exchange Act of 1934, as amended (the \u0093Exchange Act\u0094). These forward-looking statements are not historical facts but rather are based on current expectations, estimates and projections. We may use words such as \u0093anticipate,\u0094 \u0093expect,\u0094 \u0093intend,\u0094 \u0093plan,\u0094 \u0093believe,\u0094 \u0093foresee,\u0094 \u0093estimate\u0094 and variations of these words and similar expressions to identify forward-looking statements. These statements are not guarantees of future performance and are subject to certain risks, uncertainties and other factors, some of which are beyond our control, are difficult to predict and could cause actual results to differ materially from those expressed or forecasted. These risks and uncertainties include the following:, 215315=Year Ended December 31, 2012, 121649=As of December 31, 2012, total current liabilities were $782,325, which consisted primarily of accounts payable and accrued expenses, a loan from a related party, related party advances and convertible debentures. We had negative net working capital of $(482,406) as of December 31, 2012., 39853=On August 9, 2011, the Company founded its wholly-owned subsidiary Renuéll Int\u0092l, Inc., that distributes markets and sells a line of molecularly enhanced skin cream products, under the brand name Renuéll.  On December, 29, 2011, and amended on January 23, 2012, May 7, 2012, and December 13, 2012, the Company entered into a distribution agreement with Regenetech, Inc., whereby, Renuéll shall act as a distributor for a series of cosmetics created in a rotatable perfused time varying electromagnetic force bioreactor developed and patented by the National Aeronautics and Space Administration (\u0093NASA\u0094) and Regenetech, Inc., then manufactured and sold by Regenetech., 586618=Lease between Brickell Bay Tower Ltd., Inc. and Raj Ventures, Inc. dated October 18, 2010, 412933=For the years ended December 31, 2012 and 2011, there were warrants to purchase 794,000 shares and 236,000 shares, respectively, of common stock that were excluded from the diluted earnings per share computation because the impact of the assumed exercise of such warrants would have been anti-dilutive, based on the fact that their exercise price exceeded the market price of the common stock as of December 31, 2012 and 2011., 439060=On October 28, 2011, the Company issued 5,727,000 shares of its common stock to a consultant as payment for services rendered., 566932=Based on 117,263,000 issued and outstanding shares of common stock as of April 16, 2013., 415843=Rent expense was approximately $37,700 and $34,900 for the years ended December 31, 2012 and 2011, respectively., 460053=On a recurring basis, we measure certain financial assets and liabilities based upon the fair value hierarchy as described in the Company\u0092s significant accounting policies in Note 1.  The following table presents information about the Company\u0092s liabilities measured at fair value as of December 31, 2012:, 561661=The following table sets forth certain information concerning the number of shares of our common stock owned beneficially as of April 16, 2013, by: (i) each of our directors; (ii) each of our named executive officers; and (iii) each person or group known by us to beneficially own more than 5% of our outstanding shares of common stock. Unless otherwise indicated, the shareholders listed below possess sole voting and investment power with respect to the shares they own., 588682=Filed with the SEC on March 27, 2012 as part of the Company\u0092s Current Report on Form 8-K., 438617=On August 26, 2010, the Company issued 100,000 shares of its common stock to purchase equipment., 398414=2017, 590287=Distribution Agreement between Regenetech, Inc. and Renuéll Int\u0092l, Inc., dated December 29, 2011 and Amended on December 13, 2012., 397261=2013, 313082=Year Ended December 31, 2011, 401767=Advertising and marketing expenses are expensed as incurred.  Expense recorded for the years ended December 31, 2012 and 2011 were approximately $72,600 and $10,400, respectively., 110323=October 14, 2009, 161842=2012, 123068=The Company\u0092s material commitments were $0 as of December 31, 2012., 559705=No executive officer received any equity awards, or holds exercisable or unexercisable options, as of the year ended December, 2012., 291977=Balance, December 31, 2011, 397838=2015, 258964=For the Period from Inception (October 14, 2009 to December 31, 2012, 116851=Results for the Period from October 14, 2009 (Inception) through December 31, 2012, 66866=The foregoing summary description of the terms of the Distribution Agreement may not contain all information that is of interest to the reader. For further information regarding the terms and conditions of the Distribution Agreement, this reference is made to such agreement, which was originally filed on November 29, 2012 and the amended contract is filed as 10.07 hereto and is incorporated herein by this reference., 443071=The following table summarizes all warrant activity for the years ended December 31, 2012 and 2011:, 469984=Balance as of December 31, 2012, 385259=Technology Applications International Corporation (formerly Raj Ventures, Inc.) (\u0093Technology\u0094) was incorporated on October 14, 2009 under the laws of Florida.  Renuell Int\u0092l, Inc. and NueEarth, Inc., Technology\u0092s wholly owned subsidiaries and Technology, collectively, are referred to here-in as the \u0093Company\u0094, a development stage company.  The Company is engaged in developing market entry technology products and services into early and mainstream technology products and services.  Through our subsidiaries, we are focused on developing and manufacturing a line of technologically advanced skin care products and providing environmental management solutions that use electron particle accelerator technology., 579876=During the fiscal year ended December 31, 2011, we incurred approximately $10,000 in fees to our principal independent accountants for professional services rendered in connection with the audit and reviews of our financial statements for fiscal year ended December 31, 2011., 155383=April 11, 2012, 450477=Exercisable at December 31, 2011, 588134=Filed with the SEC on September 1, 2010 as part of the Company\u0092s Current Report on Form 8-K., 416918=Inventories, as of December 31, 2012 and 2011, consisted of the following:, 439767=During January and February 2012, the Company issued 794,000 shares of its common stock through a private placement for total cash consideration of $397,000., 589088=Promissory Note between the Company and Coast To Coast Equity Group, Inc., dated June 25, 2012, 117979=For the twelve months ended December 31, 2012, our total gross profit was $4,110 compared to $4,985 for the period from inception to December 31, 2012., 598899=Pursuant to the requirement of the Securities Exchange Act of 1934, this report has been signed below by the following persons on behalf of the Company and in the capacities and on the dates indicated:, 490166=The Company periodically rents a recreational vehicle from an affiliate of the Company, an entity owned by the Company\u0092s president, which is utilized for advertising and promotional events.  The Company is charged $1,729 for each month of use and is payable in arrears.  For the years ended December 31, 2012 and 2011, the Company recorded expense of approximately $10,400 and $0.00, respectively.  No amounts were due at December 31, 2012 or 2011., 432470=On September 25, 2012, the Company issued a $100,000 convertible debenture.  The convertible debenture bears interest at a rate of five-percent (5%) per annum and is payable September 20, 2013.  At the Holder\u0092s option, principle and unpaid accrued interest shall be convertible into common stock at a rate of $0.50 per share.  In addition to the common stock, the Holder shall receive warrants to purchase an equal number of shares of common stock exercisable at $1.00 per share.  These warrants expire at the earlier of 180 days after the common stock commences quotation on the OTC Bulletin Board or one-year from exercise., 580386=The aggregate fees billed during the fiscal years ended December 31, 2012 and 2011 for assurance and related services by our principal independent accountants that are reasonably related to the performance of the audit or review of our financial statements (and are not reported under Item 9(e)(1) of Schedule 14A was $0 and $0, respectively., 112556=Results for the Year Ended December 31, 2012 Compared to the Year Ended December 31, 2011, 80908=At December 31, 2012, the Company has approximately 3,800 - 1.7 oz. Breakthrough Facial Cream items in stock fully paid for at its shippers, Trans Express located in Miami, Florida.  These products have a retail price of $45.00 to $249.00 per item depending on various types of marketing strategies such as retail pharmacies, discount stores, Internet, info commercials, hotels and spas. The products have a shelf life of two years. Management estimates that the Company can sell the products in inventory within 3 to 4 months. In the initial testing sales the Company sold $1500 worth of its product in approximately 2 months.  In this initial test phase the Company sold 80% of its test product in 8 days, and the last 20% was sold approximately two months later.  The Company has not sold any product in the last three months, as the Company has been working on branding and market strategies.  The Company can market these products in the USA, Canada, Latin America, the countries that make up the Euro Zone member countries and Russia., 397550=2014, 38360=On April 12, 2011, the Company filed Amended and Restated Articles of Incorporation of the Company with the Secretary of State of Florida and changed the corporate name from \u0093Raj Ventures, Inc.\u0094 to \u0093Technology Applications International Corporation\u0094. The Company also increased the authorized capital from 100 million shares of common stock to 350 million shares of capital stock, of which 300 million shares are common stock, par value $.001 per share, and 50 million shares are preferred stock, par value $.001 per share (\u0093Preferred Stock\u0094). The Company also adopted Amended and Restated Bylaws of the Company on the same date., 538147=2011, 489041=An affiliate of the Company, an entity owned by the Company\u0092s president, has been funding operations of the Company by making payments directly to third parties or advancing monies to the Company.  These amounts bear no interest and are payable on demand.  Amounts advanced to the Company during the years ended December 31, 2012 and 2011 were approximately $142,700 and $218,300, respectively.  Payments of approximately $102,800 and $120,000 were made during the years ended December 31, 2012 and 2011, respectively, resulting in amounts due to the affiliate at December 31, 2012 and 2011 are approximately $157,000 and $117,900, respectively., 468430=Balance as of December 31, 2011, 405344=As of December 31, 2012 and December 31, 2011, the derivative liabilities amounted to $276,000 and $0, respectively.  In accordance with the accounting standards, the Company determined that the carrying value of these derivatives approximated the fair value using the level 3 inputs., 580953=The aggregate fees billed during the fiscal years ended December 31, 2012 and 2011 for professional services rendered by our principal accountant tax compliance, tax advice and tax planning were $0 and $0, respectively., 457619=Exercisable at December 31, 2012, 13052=The aggregate market value of the voting and non-voting common equity held by non-affiliates of the registrant as of June 30, 2012 was NIL based upon the price ($NIL) at which the common stock was last sold as of the last business day of the most recently completed second fiscal quarter, multiplied by the approximate number of shares of common stock held by persons other than executive officers, directors and five percent stockholders of the registrant without conceding that any such person is an \u0093affiliate\u0094 of the registrant for purposes of the federal securities laws. Our common stock is not traded in the over-the-counter market and quoted on the Over-The-Counter Bulletin Board., 598392=Dated: April 16, 2013, 119060=Other income (expense) for the period October 14, 2009 (inception) through December 31, 2012 was $(156,314).  Other income (expense) consisted of gain on derivative valuation and interest expense.  The gain on derivative valuation is directly attributable to the change in fair value of the derivative liability from date of issuance during 2012 through December 31, 2012.  Interest expense is primarily attributable the initial interest expense associated with the valuation of derivative instruments at issuance and the accretion of the convertible debentures over their respective terms.  Interest associated with the derivative instruments amounted to approximately $219,000., 37801=On August 26, 2010, the Company, completed the purchase of a semi-trailer mountable mobile electron beam accelerator unit contained therein (collectively, the \u0093e-beam\u0094) from High Voltage Environmental Applications, a Florida corporation (\u0093HVEA\u0094), in exchange for Ten Dollars ($10) and the issuance of one hundred thousand (100,000) shares of common stock of the Company to HVEA, which was payable as purchase price consideration for the transaction., 491230=Subsequent to December 2012, the Company issued 15,000 shares of its common stock and warrants to purchase up to 15,000 shares of its common stock to several investors for total cash consideration of $15,000., 150945=April 16, 2013, 101385=During March 2012, the Company converted a $100,000 deposit into a convertible debenture.  The convertible debenture bears interest at a rate of five-percent (5%) per annum and is payable March 21, 2014.  At the Holder\u0092s option, principle and unpaid accrued interest shall be convertible into common stock at a rate of $0.50 per share.  In addition to the common stock, the Holder shall receive warrants to purchase an equal number of shares of common stock exercisable at $1.00 per share at the earlier of 180 days after the common stock commences quotation on the OTC Bulletin Board or one year from date of exercise., 122771=The Company\u0092s intangible assets were $2,049 as of December 31, 2012., 522026=The table set forth below summarizes the annual and long-term compensation for services in all capacities to us payable to our officers and directors for the fiscal years ended December 31, 2012 and 2011. Our Board of Directors may adopt an incentive stock option plan for our executive officers that would result in additional compensation., 581403=The aggregate fees billed during the fiscal years ended December 31, 2012 and 2011 for products and services provided by our principal independent accountants (other than the services reported in Items 9(e)(1) through 9(e)(3) of Schedule 14A was $0 and $0, respectively., 504823=May 18, 2012, 563704=1001 Brickell Bay Drive, Suite 1716, 9128=Indicate by check mark whether the registrant (1) has filed all reports required to be filed by Section 13 or 15(d) of the Securities Exchange Act of 1934 during the preceding 12 months (or for such shorter period that the registrant was required to file such reports) and (2) has been subject to such filing requirements for the past 90 days., 473712=Deferred income taxes for 2012 and 2011 were provided for the temporary differences between the financial reporting basis and the tax basis of the Company\u0092s assets and liabilities.  The effects of temporary differences and carry-forwards at December 31, 2012 and 2011 are as follows:, 51400=Through Renuéll Int\u0092l, Inc., the Company is currently distributing a line of technologically advanced skin care products, produced and developed by Regenetech, Inc.; in the future the Company will develop its own line of advanced skin care products. On July 27, 2011, it commenced providing to the marketplace its first product, the Renuéll\u0099 skin cream, and had generated revenues in the amount of $9,479 as of December 31, 2012. The Renuéll\u0099, 439278=On November 8, 2011, the Company issued 5,591,000 shares of its common stock to a consultant as payment for services rendered., 520532=Section 16(a) of the Securities Exchange Act of 1934 requires our directors and executive officers and persons who beneficially own more than ten percent of a registered class of our equity securities to file with the SEC initial reports of ownership and reports of change in ownership of common stock and other equity securities of the Company. Officers, directors and greater than ten percent stockholders are required by SEC regulations to furnish us with copies of all Section 16(a) forms they file. Based solely upon a review of Forms 3 and 4 and amendments thereto furnished to us under Rule 16a-3(e) during the year ended December 31, 2012, Forms 5 and any amendments thereto furnished to us with respect to the year ended December 31, 2012, and the representations made by the reporting persons to us, we believe that during the year ended December 31, 2012, our executive officers and directors and all persons who own more than ten percent of a registered class of our equity securities complied with all Section 16(a) filing requirements., 567969=An affiliate of the Company, an entity owned by the Company\u0092s president, has been funding operations of the Company by making payments directly to third parties or advancing monies to the Company.  These amounts bear no interest and are payable on demand.  Amounts advanced to the Company during the years ended December 31, 2012 and 2011 were approximately $142,700 and $218,300, respectively.  Amounts due to the affiliate at December 31, 2012 and 2011 are approximately $157,000 and $117,900, respectively., 414800=Three and one customers accounted for approximately 44% and 20% of total sales for the years ended December 31, 2012 and 2011, respectively., 399040=Amortization expense for the years ended December 31, 2012 and 2011 was $101 and $20, respectively., 506238=Charles J. Scimeca \u0096 Mr. Scimeca has served as our Chief Executive Officer, Chief Financial Officer, Secretary and sole director since April 2010. Since February 2003, Mr. Scimeca has served as President and Chief Executive Officer of Coast To Coast Equity Group, Inc., which provides consulting services for private companies going public, including investor relations and marketing services. Since January 1998, Mr. Scimeca has served as President and Chief Executive Officer of Coast To Coast Realty Group, Inc., which offers commercial and residential real estate services. Mr. Scimeca is a licensed real estate broker., 416403=As of December 31, 2012 and through the date of these financial statements, the Company has no insurance policies in place.  As of the date of these financial statements, the Company has not been advised of any liability or claims against it., 153846=In our opinion, the financial statements referred to above present fairly, in all material respects, the financial position of Technology Applications International Corporation and Subsidiaries (a Florida corporation) as of December 31, 2011 and the results of its operations and its cash flows for the year then ended and the period October 14, 2009 (inception) through December 31, 2011, in conformity with accounting principles generally accepted in the United States of America., 118425=General and administrative expenses consisted primarily of consulting fees, rent, travel, meals and entertainment, and preparing reports and SEC filings relating to being a public company.  For the year ended December 31, 2012, general and administrative expenses was $681,875 compared to $938,034 for the period from inception to December 31, 2012., 579488=During the fiscal years ended December 31, 2012, we incurred approximately $10,000 in fees to our principal independent accountants for professional services rendered in connection with the audit and reviews of our financial statements for fiscal years ended December 31, 2012., 587202=Share Purchase Agreement by and among Raj Ventures, Inc., Willowhuasca Wellness, Inc., and Raj Ventures Funding, Inc., dated April 12, 2010, 100474=Between January 1, 2012 and June 30, 2012, the company entered into subscription agreements with certain investors whereby it sold an aggregate of 794 private placement units with each unit consisting of 1,000 shares of common stock (794,000 shares) priced at $.50 per share and one Class A Warrant to purchase 1,000 shares of common stock with an exercise price of $1.00 per share for a total of three hundred ninety seven thousand ($397,000) dollars.  The warrants expire on the earlier of (i) 180 days after the common stock commences quotation on the OTC Bulletin Board or (ii) one year after the date of issuance.  The private placement was made pursuant to Rule 506 of Regulation D  promulgated  under  Section 4(2) of the  Securities  Act of 1933, as amended., 107754=December 31, 2011, 591632=Filed with the SEC on December, 27, 2012 as part of the Company\u0092s S-1/A, 431587=During December 2011, the Company received $100,000 as a deposit for entering into a distribution agreement.  On March 22, 2012, the Company converted the $100,000 deposit into a convertible debenture.  The convertible debenture bears interest at a rate of five-percent (5%) per annum and is payable March 21, 2014.  At the Holder\u0092s option, principle and unpaid accrued interest shall be convertible into common stock at a rate of $0.50 per share.  In addition to the common stock, the Holder shall receive warrants to purchase an equal number of shares of common stock exercisable at $1.00 per share.  These warrants expire at the earlier of 180 days after the common stock commences quotation on the OTC Bulletin Board or one-year from exercise., 442139=In conjunction with the Private Placement Memorandum dated February 13, 2013, the Company is offering up to 3,000,000 units.  Each unit consists of 1 share of common stock priced at $1.00 and one Class A Warrant to purchase 1 share of common stock with an exercise price of $1.50 per share.  These warrants expire on the earlier of (i) 180 days after the common stock commences quotation on the OTC Bulletin Board or (ii) one year after the date of issuance., 414235=Certain amounts in the financial statements as of and for the year ended December 31, 2011 have been reclassified for comparative purposes to conform to the presentation in the financial statements as of and for the year ended December 31, 2012., 400487=The Company's revenue recognition policies are in compliance with Staff Accounting Bulletin No. 104, \"Revenue Recognition.\"  Sales revenue which has been insignificant to December 31, 2012, is recognized at the date of shipment to customers when a formal arrangement exists, the price is fixed or determinable, the delivery is completed, no other significant obligations of the Company exist and collectability is reasonably assured.  Payments received before all of the relevant criteria for revenue recognition are satisfied are recorded as unearned revenue., 589680=Convertible debenture between the Company and Shane Case, dated September 26, 2012}",
    "textBeforeTable": "(Mark One)                                                                                                                                                                                                FORM 10-K Washington, D.C. 20549 SECURITIES AND EXCHANGE COMMISSION UNITED STATES ex31_1apg.htm EX-31.1 - EXHIBIT 31.1 - Technology Applications International Corp ex32_1apg.htm EX-32.1 - EXHIBIT 32.1 - Technology Applications International Corp ex31_2apg.htm EX-31.2 - EXHIBIT 31.2 - Technology Applications International Corp filename file Attached files (adsbygoogle = window.adsbygoogle || []).push({}); @media(min-width: 800px) { .sec-filings-responsive-top { width: 728px; height: 90px; } } @media(min-width: 500px) { .sec-filings-responsive-top { width: 468px; height: 60px; } } #ad-top { margin-top: 5px; } .sec-filings-responsive-top { width: 320px; height: 50px; }",
    "textAfterTable": "  Copy of all Communications to: Law Office of Andrew Coldicutt 1220 Rosecrans Street, PMB 258 San Diego, CA 92106 Phone: 619-228-4970   Indicate by check mark if the registrant is a well-known seasoned issuer, as defined in Rule 405 of the Securities Act.   Yes [   ]  No [X] Indicate by check mark if the registrant is not required to file reports pursuant to Section 13 or Section 15(d) of the Act.   Yes [   ]  No [X] Indicate by check mark whether the registrant (1) has filed all reports required to be filed by Section 13 or 15(d) of the Securities Exchange Act of 1934 during the preceding 12 months (or for such shorter period that the registrant was required to file such reports) and (2) has been subject to such filing requirements for the past 90 days. Yes [X]  No [   ]. Indicate by check mark whether the registrant has submitted electronically and posted on its corporate Web site, if any, every Interactive Data File required to be submitted and posted pursuant to Rule 405 of Regulation S-T (§ 232.405 of this",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}