{
    "relation": [
        [
            "Repo ID",
            "apache.snapshots",
            "sonatype-nexus-snapshots",
            "central",
            "jvnet-nexus-snapshots"
        ],
        [
            "URL",
            "http://repository.apache.org/snapshots",
            "https://oss.sonatype.org/content/repositories/snapshots",
            "http://repo.maven.apache.org/maven2",
            "https://maven.java.net/content/repositories/snapshots"
        ],
        [
            "Release",
            "No",
            "No",
            "Yes",
            "No"
        ],
        [
            "Snapshot",
            "Yes",
            "Yes",
            "No",
            "Yes"
        ]
    ],
    "pageTitle": "Commons Email – Project Dependencies",
    "title": "",
    "url": "https://commons.apache.org/proper/commons-email/dependencies.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988860.4/warc/CC-MAIN-20150728002308-00022-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 877412854,
    "recordOffset": 877404652,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{53499=Copyright © 2001-2015 The Apache Software Foundation. All Rights Reserved.}",
    "lastModified": "Sat, 23 May 2015 06:50:57 GMT",
    "textBeforeTable": "The following is a list of compile dependencies for this project. These dependencies are required to compile and run the application: compile Project Dependencies Thanks Sponsorship Developer Resources Get Involved How the ASF works ASF Wiki Releasing Components Commons Build Plugin Commons Parent Pom Building Components Contributing Patches Volunteering Security General Information Dormant Sandbox Components License Home Commons Project Reports",
    "textAfterTable": "GroupId ArtifactId Version Type License commons-io commons-io 2.2 jar The Apache Software License, Version 2.0 junit junit 4.11 jar Common Public License Version 1.0 org.easymock easymock 3.2 jar Apache 2 org.powermock powermock-api-easymock 1.4.12 jar The Apache Software License, Version 2.0 org.powermock powermock-module-junit4 1.4.12 jar The Apache Software License, Version 2.0 org.slf4j slf4j-jdk14 1.7.7 jar MIT License org.subethamail subethasmtp 3.1.7 jar Apache 2.0 Project Transitive Dependencies The following is a list of transitive dependencies for this project. Transitive dependencies are the dependencies of the project dependencies. test The following is a list of test dependencies for this project. These dependencies are only required to compile and run unit tests for the application: GroupId ArtifactId Version Type License cglib cglib-nodep 2.2.2 jar ASF 2.0 com.google.code.findbugs jsr305 1.3.9 jar The Apache Software License, Version 2.0 org.hamcrest hamcrest-core 1.3 jar New BSD License org.javassist javassist 3.16.1-GA jar MPL 1.1-LGPL 2.1-Apache License 2.0",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}