{
    "relation": [
        [
            "Categories",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "For fun I like to read my favorite books. Watch documentary's and volunteer at the El Paso Zoo. I also enjoy spending time with my family, I love to cook and I like to be outside in the nature. I go hiking, I cook for fun, and I play with my pets.",
            "I personally love the food. The DACC cafeteria serves great hot food like breakfast burritos and hot beverages. the cafeteria have many sorts of different foods that the students can choose from. And sometimes we even get free food like chili dogs, burritos, hot dogs and many other things. DACC staff is extremely nice to their students.",
            "I do not live in dorms but I have heard from close friends that they are so comfortable and relaxing. they say it is a great place to live in during your school years because you live with other students and you feel as if you are a huge family reaching for a same goal witch is to be a successful person in the future.",
            "For many students college is difficult but with the help of family members and especially the communication you have with your professors help you through out the semester. I have personally have some rough times but I always find my way out with the help of tutors, professors and family members and friends who attend DACC as well.",
            "For prospective students I recommend that you attend DACC because it is a great start to your career. Professor's and all members of staff are very kind and helpful. Professors at DACC not only educate you more but they encourage you to fight for your dreams.",
            "Dona Ana Community College has expanded my knowledge with the help of great professors. I believe DACC is a great school for students to attend because you gain the knowledge that you did not have before. Being a DACC student makes me proud because this college takes their students education extremely seriously."
        ]
    ],
    "pageTitle": "New Mexico State University-Dona Ana Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/New-Mexico-State-University-Dona-Ana/reviews",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988860.4/warc/CC-MAIN-20150728002308-00009-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 917942891,
    "recordOffset": 917906672,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{117743=© 2015, Cappex.com, LLC}",
    "textBeforeTable": "08/22/2009 Reviewer is A current student here. 5 out of 5 people found this review useful. 1 of 30 Shante from Las Cruces, NM Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\");",
    "textAfterTable": "Anna from Chaparral, NM 12/17/2010 Reviewer is A current student here. 1 out of 1 people found this review useful. 2 of 30 Categories Comments Great for these types of students This school has great programs for disabled students. Tips for prospective students Don't fall behind, come on if you're in college just keep going until you get to your goal. Bang for the buck Tuition is decent, no complains. Am enjoying being here I enjoy the ambient from this school. People are very nice and sociable, also it's not hard to get around the school. Am learning a lot All the teachers focus on each individual student. I you have any questions or concerns each teacher is attentive to give you an answer right away. Classrooms are quite small but that's the best part because teachers pay attention to you.",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}