{
    "relation": [
        [
            "type",
            "FR Doc.",
            "RIN",
            "Docket No."
        ],
        [
            "regulations.gov",
            "2015-02421",
            "0648-XD43",
            "140811659-5070-02"
        ]
    ],
    "pageTitle": "50 CFR 660.353 - Recreational fishery | LII / Legal Information Institute",
    "title": "",
    "url": "https://www.law.cornell.edu/cfr/text/50/660.353",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988860.4/warc/CC-MAIN-20150728002308-00238-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 940796987,
    "recordOffset": 940770364,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{1120=Title 50 published on 2014-10-01}",
    "TableContextTimeStampAfterTable": "{70969=This proposed rule would establish the 2015-2016 harvest specifications and management measures for groundfish taken in the U.S. exclusive economic zone off the coasts of Washington, Oregon, and California, consistent with the Magnuson-Stevens Fishery Conservation and Management Act (MSA) and the Pacific Coast Groundfish Fishery Management Plan (PCGFMP). This proposed rule would also revise the management measures that are intended to keep the total catch of each groundfish species or species complex within the harvest specifications. This action also includes regulations to implement Amendment 24 to the PCGFMP, which establishes default harvest control rules for setting harvest specifications after 2015-2016., 122329=This ANPR announces a control date of June 23, 2014, that may be used as a reference for allocation decisions when considering potential future management actions to limit the number of participants in the large-mesh drift gillnet (DGN) fishery that targets swordfish and thresher sharks. The Pacific Fishery Management Council (Council) selected the June 23, 2014, control date based on discussions at its June meeting. The Council requested this ANPR to discourage speculative fishing effort as they review the current state-managed DGN limited entry program and consider establishing a federally-managed limited entry program for this fishery. This ANPR is intended to promote public awareness of the Council's interest and the potential for a future rulemaking., 132304=This proposed rule would revise regulations for the Pacific Coast Groundfish fishery with a target implementation date of January 1, 2015. Final implementation of the 2015-2016 biennial harvest specifications and management measures will likely be delayed beyond January 1, 2015. NMFS has identified two issues that must be addressed prior to January 1, 2015, to prevent interruption of ongoing fisheries and to allow harvest of the total allowable groundfish catch. This action would address those issues by revising groundfish regulations in two ways. First, this action would replace language that was inadvertently deleted after a series of temporary rulemakings. This would reinstate a mechanism whereby NMFS can issue interim groundfish allocations at the beginning of the year, allowing the Pacific coast groundfish fishery to continue in years when annual groundfish harvest specifications are expiring and new ones are not yet finalized, as is likely for January 1, 2015. Second, this action would amend regulations to extend NMFS' authority to issue the full shorebased trawl allocation of groundfish to current quota share holders in the Shorebased Individual Fishing Quota Program. Specifically, the rule would allow NMFS to issue that portion of the allowable catch currently allocated to an Adaptive Management Program (AMP), to quota share holders until final criteria and a process for distribution of the AMP quota shares is developed and implemented., 50074=§ 1802 - Definitions, 37207=NMFS is reopening the U.S. commercial fishery for Pacific bluefin tuna (PBF) in the eastern Pacific Ocean (EPO) until the 500 metric ton (mt) catch limit is reached. If the 500-metric ton limit, which was established under the Tuna Conventions Act (TCA) and regulations implementing Resolution C-13-02 of the Inter-American Tropical Tuna Commission (IATTC) in the EPO, is not met, the fishery will close on December 31, 2014. This reopening of the fishery vacates the closure made by NMFS on September 5, 2014. Following the closure, NMFS received updated information indicating that only 404 mt of the 500 mt catch limit was caught. Thus, the closure was imposed prematurely. This rule also imposes a 1 mt trip limit on retention of PBF in the EPO by commercial vessels as an emergency action under the Magnuson-Stevens Fishery Conservation and Management Act (MSA)., 17761=NMFS issues a final rule under authority of the Magnuson-Stevens Fishery Conservation and Management Act (MSA) to implement Amendment 18 to the Pacific Coast Salmon Fishery Management Plan for Commercial and Recreational Salmon Fisheries off the Coasts of Washington, Oregon, and California (FMP). Amendment 18 revises the description and identification of essential fish habitat (EFH) for Pacific salmon managed under the FMP, designates habitat areas of particular concern (HAPCs), updates information on fishing activities, and updates the list of non-fishing related activities that may adversely affect EFH and potential conservation and enhancement measures to minimize those effects. NMFS approved Amendment 18 on September 12, 2014., 50156=§ 1803 - Authorization of appropriations, 127176=NMFS proposes to implement the annual catch limit (ACL), harvest guideline (HG), and associated annual reference points for Pacific mackerel in the U.S. exclusive economic zone (EEZ) off the Pacific coast for the fishing season of July 1, 2014, through June 30, 2015. This rule is proposed pursuant to the Coastal Pelagic Species (CPS) Fishery Management Plan (FMP). The proposed 2014-2015 HG for Pacific mackerel is 29,170 metric tons (mt). This is the primary commercial fishing target level. The proposed annual catch target (ACT), which will be the directed fishing harvest target, is 24,170 mt. If the fishery attains the ACT, the directed fishery will close, reserving the difference between the HG (29,170 mt) and ACT as a 5,000 mt set-aside for incidental landings in other CPS fisheries and other sources of mortality. This rule is intended to conserve and manage the Pacific mackerel stock off the U.S. West Coast., 55768=This action would implement revisions to the Pacific Coast Groundfish Trawl Rationalization Program affecting the limited entry midwater trawl fisheries managed under the Pacific Coast Groundfish Fishery Management Plan (FMP). This action would revise the Shorebased Individual Fishing Quota (IFQ) Program regulations to change the primary season opening date for the shorebased whiting fishery and the shorebased non-whiting midwater trawl fishery to May 15 north of 40°30′ N. lat. to the U.S./Canada border. This moves the season a month earlier off Washington and Oregon, and a month and half later off northern California (north of 40°30′ N. lat.), increasing consistency in the season start date along the coast and between the shorebased and at-sea midwater trawl fleets., 8253=NMFS implements the annual catch limit (ACL), harvest guideline (HG), and associated annual reference points for Pacific mackerel in the U.S. exclusive economic zone (EEZ) off the Pacific coast for the fishing season of July 1, 2014, through June 30, 2015. This rule is implemented according to the Coastal Pelagic Species (CPS) Fishery Management Plan (FMP). The 2014-2015 HG for Pacific mackerel is 29,170 metric tons (mt). This is the primary commercial fishing target level. The annual catch target (ACT), which will be the directed fishing harvest target, is 24,170 mt. If the fishery attains the ACT, the directed fishery will close, reserving the difference between the HG (29,170 mt) and ACT as a 5,000 mt set-aside for incidental landings in other CPS fisheries and other sources of mortality. This final rule is intended to conserve and manage the Pacific mackerel stock off the U.S. West Coast., 22652=This action revises regulations for the Pacific coast groundfish fishery with an implementation date of January 1, 2015. Final implementation of the 2015-2016 biennial harvest specifications and management measures will be delayed beyond January 1, 2015. NMFS has identified two issues that must be addressed prior to January 1, 2015, to prevent interruption of ongoing fisheries and to allow harvest of the total allowable and available groundfish. This action addresses those issues by revising groundfish regulations in two ways. First, this action reinstates a mechanism whereby NMFS can issue interim groundfish allocations at the beginning of the year in years when annual groundfish harvest specifications are not yet finalized, as is the case for January 1, 2015. Second, this action amends regulations to allow NMFS to issue that portion of the allowable catch currently allocated to an Adaptive Management Program (AMP) to quota shareholders until final criteria and a process for distribution of the AMP quota shares is developed and implemented., 49974=§ 1801 - Findings, purposes and policy}",
    "lastModified": "Thu, 26 Feb 2015 12:08:25 GMT",
    "textBeforeTable": "Additional Documents GPO FDSys XML | Text 80 FR 7390 - Magnuson-Stevens Act Provisions; Fisheries Off West Coast States; Pacific Coast Groundfish Fishery; Pacific Whiting Allocations and Fishery Closure; Pacific Whiting Seasons 2015-02-10; vol. 80 # 27 - Tuesday, February 10, 2015 For a complete list of all Rules, Proposed Rules, and Notices view the Rulemaking tab. The following are only the Rules published in the Federal Register after the published date of Title 50. Title 50 published on 2014-10-01 660.13 (a) through (c), subpart C, apply to the recreational fishery. Recordkeeping and reporting requirements at § § 660.353 Recreational fishery—recordkeeping and reporting. next prev | Rulemaking Authorities (U.S. Code) Updates",
    "textAfterTable": "DEPARTMENT OF COMMERCE, National Oceanic and Atmospheric Administration Reapportionment of tribal Pacific whiting allocation, and implementation of an Ocean Salmon Conservation Zone to protect Chinook salmon. The rules set out in this document were made through automatic action, and are published in the Federal Register as soon as practicable after they are issued. The Ocean Salmon Conservation Zone was effective 0800 local time October 20, 2014 until December 31, 2014. The reapportionments of Pacific whiting were effective from 1200 local time, September 12, 2014 (25,000 mt) and 2000 local time October 23, 2014 (additional 20,000 mt), until December 31, 2014. Comments will be accepted through February 25, 2015. 50 CFR Part 660 Summary This document announces the reapportionment of 45,000 metric tons (mt) of Pacific whiting from the tribal allocation to the non-tribal commercial fishery sectors via two actions, in order to allow full utilization of the Pacific whiting resource. It also announces the implementation of an Ocean Salmon Conservation Zone that prohibited the targeting of Pacific whiting with midwater trawl gear shoreward of approximately 100 fathoms (fm) (183 m) to reduce Chinook salmon bycatch in the Pacific whiting fishery. 2015-02-06; vol. 80 # 25 - Friday, February 6, 2015",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}