{
    "relation": [
        [
            "Categories",
            "Campus Safety",
            "Greek Life",
            "Great for these types of students",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "The police station is located in the student center. If you feel unsafe in anyway just call campus police and they will escort you where you need to go.",
            "No Greek life :(",
            "Catholics, athletes, cyclists, med-students, education majors",
            "There are so many clubs and sports around campus to join. If you don't end up joining a club there are lots of other activities to get involved in. Each spring there is a campus wide Nerf battle, and there are activities such as Up all knight in the library to stay active and involved.",
            "The food is wonderful! There are so many choices, and the chefs accommodate to dietary needs!",
            "I have never lived in the dorms at Marian; but my friends have told me wonderful things about their experiences.",
            "The academics are challenging; but can be easily completed as long as you study the material given.",
            "Make sure to study and take notes, no matter where you are this is important in college.",
            "Marian is a great place where all the professors make you feel wanted. You're definitely not just a number at this University."
        ]
    ],
    "pageTitle": "Marian University Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Marian-University-Indiana/reviews?_escaped_fragment_=/show/7268",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042981576.7/warc/CC-MAIN-20150728002301-00080-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 896040571,
    "recordOffset": 896009091,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{11702=Marian University is a great place to become a teacher or anything else that they offer. It is a small community, where we start gaining experience from the first semester. At Marian, I will be entering my second semester of my sophomore year in August. When I went to visit a friend at Marian, I fell in love with the campus and the people. The professors are very hands-on in their approach of teaching and really want us to achieve all of our goals. I believe that God has a plan for me, and I strongly believe that plan is to continue school at Marian University to go on to be a teacher and change the lives of children and let them reach for the stars., 89319=Marian University is a nice community. I transferred here from California and although its not home, I wouldn't want to be anywhere else. The professors I had this semester were down to earth and made it their priority to make sure each student passed. MU is a 15:1 student:teacher ratio., 88739=Spring 2013, was my first semester at MU. I enjoyed going to the basketball games, watching movies in the library theater, and bonfires the dorms would host. Sometimes, my friends and I would meet at the Clair Hall's recreation room and watch NBA games on the bigger screen. Finally, the Ruth Lilly Center has racket ball, two basketball gyms, and a weight room to get in some exercise., 110168=© 2015, Cappex.com, LLC, 89790=Marian is a very beautiful campus that is growing each semester. It is very clean, and the staff/students are friendly. FMO, Marian is a 10:10 rating., 58463=Marian Univeristy is a private Univeristy with accepting role models and motivated students. I love the unique University and rustic features. I am very thrilled and excited to meet the diversity of students and professors while attending here in Spring 2013.}",
    "textBeforeTable": "11/02/2010 Reviewer is A current student here. 2 out of 2 people found this review useful. 1 of 25 Myles from Indianapolis, IN Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp",
    "textAfterTable": "Tips for prospective students Live on campus for at least your first year! Go to as many campus activities as possible! Don't be scared to talk to anyone, they are all so sweet and willing to help you with any question you have about anything and everything! Get involved in at least one club/committee! Bang for the buck I don't know exactly where ALL of my money goes, but I know that a good portion is referred back to me in many ways. The leftover? Well, I do suppose it has something to do with the new medical center they are building. Most on-campus activities are completely free to students and I foresee it staying that way for a long time. Am enjoying being here I definitely love my choice. I'll admit, at first I wasn't sold that this was going to be the school for me. I thought it was too small for the things I wanted to do, but it has totally shown me different. I love the small atmosphere; everyone knows everyone and they are probably the nicest and most inviting people compared to any school in the country. There is ALWAYS something going on around campus and we have amazing school spirit! Doyle Hall, the dormitory where all on-campus freshmen live,",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}