{
    "relation": [
        [
            "Categories",
            "Campus Safety",
            "Greek Life",
            "Clubs and Activities",
            "Great for these types of students",
            "Share any unusual traditions or locations on campus",
            "Bang for the buck",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "Constant police patrol all day and night, very safe her.",
            "Unsure, but I no that they have it.",
            "Theres a lot of clubs and activities.",
            "This university has a lot of areas of majors that can be great for any major.",
            "Most people hang out in the computer labs or the mall are, which is an are you can hear people playing music, talking, eating, and other things.",
            "Even though this is a catholic college it shows equility to other religions. Theres an organization that promotes the rights of the LGTB community.",
            "There are always activities to partake in, concerts, and different organizations to join.",
            "Depending on what is being serve the food is great.",
            "I'm a communter, so I can't give information on dorm life.",
            "The classes in Social Work are very demanding, so keep up with your work and don't take a lot of classes.",
            "Talk to other students to learn what classes are needed and which professors to take.",
            "Our Lady of the Lake is a great university. I like the small setting of the classes. The only thing that I do not like is some of the Professors."
        ]
    ],
    "pageTitle": "Our Lady of the Lake University Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Our-Lady-of-the-Lake-University-San-Antonio/reviews",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987135.9/warc/CC-MAIN-20150728002307-00121-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 898741867,
    "recordOffset": 898701335,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{173947=© 2015, Cappex.com, LLC, 129466=Activities going on campus are usually free for all students =), There is a Anime Convention held on campus every year in March called Mizuumi Con, 9614=If you are looking for a university where you will feel at home, this is where you should be. On my first campus tour I was addressed by everyone & given all the attention necessary. I was able to ask questions and get a better understanding of this university and am pleased to be attending this university for the fall of 2012.}",
    "textBeforeTable": "01/10/2011 Reviewer is A current student here. 6 out of 6 people found this review useful. 1 of 41 Savannah from San Antonio, TX Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new",
    "textAfterTable": "Am learning a lot The teachers are great and they help you as long as you ask for the help. Login to rate or flag the reviews Lizbeth from San Antonio, TX 05/05/2012 Reviewer is Accepted here and planning to attend soon. Reviewer has been to campus. 3 out of 3 people found this review useful. 3 of 41 Categories Comments Great for these types of students This university is for any student looking for small classes, close relationships with peers, & a small campus. What to do for fun They have plenty of planned activities to choose from. Food and Dining Excellent and nutritional Dorm Life The rooms are small but that's what makes them cozy. Academic Rigor The",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}