{
    "relation": [
        [
            "Option",
            "Raises for Not Applicable Keys",
            "Display Pattern"
        ],
        [
            "Binding option constant",
            "NSRaisesForNotApplicableKeysBindingOption",
            "NSDisplayPatternBindingOption"
        ],
        [
            "Value class",
            "NSNumber (Boolean)",
            "NSString"
        ]
    ],
    "pageTitle": "NSTokenField Bindings",
    "title": "",
    "url": "https://developer.apple.com/library/mac/documentation/Cocoa/Reference/CocoaBindingsRef/BindingsText/NSTokenField.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042981576.7/warc/CC-MAIN-20150728002301-00161-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 882731997,
    "recordOffset": 882723795,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{54289=Copyright © 2004, 2014 Apple Inc. All Rights Reserved. Terms of Use | Privacy Policy | Updated: 2014-07-15}",
    "textBeforeTable": "Binding Options Binding is Read-Only. Available in OS X v10.4 and later. Availability: The contents of the NSTokenField are editable if a logical AND operation on all the editable bindings results in a Boolean value of YES. When editable is bound, a new binding, editable2, is exposed and can be bound. Binding to editable2 causes editable3 to be exposed, and so on. A multiple-value binding that determines if the NSTokenField is editable in the user interface. editable Availability Bindings Available in OS X v10.4 and later. Availability NSTokenField Related class NSTokenField Bindings PreviousNext Download Sample Code Jump To\u0085 Table of Contents PDF Companion File Cocoa Bindings",
    "textAfterTable": "Placeholders Description Placeholder constant Value class Multiple Values Placeholder NSMultipleValuesPlaceholderBindingOption NSNumber (Boolean) or NSNull No Selection Placeholder NSNoSelectionPlaceholderBindingOption NSNumber (Boolean) or NSNull Not Applicable Placeholder NSNotApplicablePlaceholderBindingOption NSNumber (Boolean) or NSNull Null Placeholder NSNullPlaceholderBindingOption NSNumber (Boolean) or NSNull enabled A multiple-value binding that determines if the NSTokenField is enabled in the user interface. When enabled is bound, a new binding, enabled2, is exposed and can be bound. Binding to enabled2 causes enabled3 to be exposed, and so on. The NSTokenField is enabled if a logical AND operation on all the enabled bindings results in a Boolean value of YES. Availability: Available in OS X v10.4 and later. Binding is Read-Only. Binding Options Option Binding option constant Value class Raises for Not Applicable Keys NSRaisesForNotApplicableKeysBindingOption NSNumber (Boolean) Placeholders",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}