{
    "relation": [
        [
            "Categories",
            "Campus Safety",
            "Greek Life",
            "Great for these types of students",
            "Share any unusual traditions or locations on campus",
            "Bang for the buck",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "There is not really a need for increased campus safety. It is in a safe area.",
            "Phi Theta Kappa is the best!",
            "All types of students fit in here.",
            "The annual fall festival has a great haunted house that attracts many ghouls and goblins.",
            "Definitely a good choice for students on a budget.",
            "There is a local mall, movie theater, and bowling alley close by.",
            "Subway is available.",
            "Do not live in a dorm.",
            "Start here. Go far.",
            "The price of tuition is reasonable. The campus is user friendly. The staff is very helpful and well educated."
        ]
    ],
    "pageTitle": "Victoria College Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Victoria-College/reviews?_escaped_fragment_=/show/79393",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988860.4/warc/CC-MAIN-20150728002308-00165-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 916333915,
    "recordOffset": 916302203,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{129416=© 2015, Cappex.com, LLC}",
    "textBeforeTable": "07/20/2009 Reviewer is Accepted here and planning to attend soon. Reviewer has been to campus. 1 out of 2 people found this review useful. 1 of 32 Crystal from Palacios, TX Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp =",
    "textAfterTable": "Share any unusual traditions or locations on campus I just take the online courses but I plan to be apart of these in the future. What to do for fun There is a student center where you can play billiards and socialize. You get to meet a bunch of new people. Food and Dining There is The Grind, which is like a subway and the tables and cafeteria are big and spacious. There is also a Starbucks at every building, sometimes two in one building. Victoria is all about learning and food. The teachers even bring food for their students. Dorm Life I do not know much about this for it is a okay drive from my home. My friend is just going to get a nice apartment there. Academic Rigor The teachers and other students push you to learn all you can. Every time I went to class the teacher talked about the clubs and when the meetings were and enticed us to join and gave points if you did. Tips for prospective students If you are unsure about taking Victoria College, just know",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}