{
    "relation": [
        [
            "Language",
            "English",
            "English",
            "English",
            "English",
            "English",
            "English",
            "English",
            "Japanese"
        ],
        [
            "Description",
            "PowerFX Systems AB. official homepage",
            "VocaTone official homepage",
            "VOCALOID3 OLIVER product page for",
            "Vocaloid Oliver The official Facebook page for VOCALOID OLIVER",
            "Oliver @vocaloid_oliver The official Twitter account for VOCALOID OLIVER",
            "Oliver Fanclub The official tumblr for VOCALOID OLIVER",
            "deviantArt , art and media community",
            "Pixiv , art and media community"
        ],
        [
            "Site",
            "Link",
            "Link",
            "Link",
            "Link",
            "Link",
            "Link",
            "Link",
            "Link"
        ]
    ],
    "pageTitle": "OLIVER - Vocaloid Wiki - Voice synthesizer",
    "title": "",
    "url": "http://vocaloid.wikia.com/wiki/Oliver",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042981576.7/warc/CC-MAIN-20150728002301-00225-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 261390823,
    "recordOffset": 261357338,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{13440=In April 2012, OLIVER overtook BIG AL in English VOCALOID popularity. He is currently the most popular VOCALOID designed to sing only in English in the fandom for both Japan and overseas., 13245=In late August 2012, his PV demo song, \"Dinky Dink\", became the first demo for an English-only built VOCALOID to reach 100,000+ views., 13093=According to Google trends, the height of his popularity was August 2013, this was most likely due to the popularity of the \"Bee and Puppycat\" animation on YouTube. This caused the average search engine results to be higher in the year after August 2013, then it was prior to August 2013. OLIVER was also one of the few new VOCALOIDs in VOCALOID3 whose search popularity growth meant it was higher near the end of the VOCALOID3 era then at the start., 64381=OLIVER is an English VOCALOID developed and distributed by PowerFX Systems AB. in collaboration with VocaTone, and was released in December 2011 for the VOCALOID3 engine. OLIVER's vocals are \"based on a 12 year old boy soprano\", a choir boy. His voice provider is from Britain, and during the time of recording, he was 13 years of age. Therefore, the identity of his provider has never been revealed for legal reasons.[4] He is the first young male VOCALOID whose voice samples were not produced by an adult., 10231=In 2015 a survey was made based on the popularity of Vocaloids on website Nico Video. For the year 2014, Oliver was the 31st most popular Vocaloid and the most popular \"Engloid\".[17], 16611=A competition for OLIVER was run by VocaTone, the prize being OLIVER himself. Details were found on the VocaTone website. An MMD model was supplied for the use of entries, though MMD is not required for entering the competition nor the use of these specific models. Those taking part must create a PV to accommodate the song \"Birds\". The competition expired on the 4th of December., 16106=The overall winner was Porifra, with runners up Pikadude31451 and MagikSalem.[11]}",
    "lastModified": "Mon, 27 Jul 2015 15:19:34 GMT",
    "textBeforeTable": "External linksEdit ↑ Example (note; title has since been corrected) ↑ link ↑ link ↑ kick starter ↑ link ↑ link ↑ link ↑ link ↑ link ↑ MikuStar's blog - Q&A With Anders Sodergren ↑ link ↑ link ↑ link ↑ http://vocatoneofficial.tumblr.com/post/74776973815/vocatone-character-profile-1-vocaloid-3-oliver ↑ VocaloidOtaku: Vocaloid Oliver - (original name) ↑ VocaloidOtaku: VOCALOID3: Oliver PowerFX + new VOCALOID company, VocaTone ↑ [1] Vocaloid Answer Wiki - Why are some voice providers not revealed? ↑ PowerFX website",
    "textAfterTable": "Navigation v  •  d  •  e VocaTone Vocalists OLIVER • YOHIOloid • Ruby VOCALOID 3 OLIVER • YOHIOloid VOCALOID 4 Ruby • Announced Vocals Providers YOHIO • Misha Misc. Language English Phonetics • Japanese Phonetics Illustrators",
    "hasKeyColumn": true,
    "keyColumnIndex": 1,
    "headerRowIndex": 0
}