{
    "relation": [
        [
            "Patent application number",
            "20100245311",
            "20100245313",
            "20110115690"
        ],
        [
            "Description",
            "LOW VOLTAGE DRIVER SCHEME FOR INTERFEROMETRIC MODULATORS - A method of driving electromechanical devices such as interferometric modulators includes applying a voltage along a common line to release the electromechanical devices along the common line, followed by applying an address voltage along the common line to actuate selected electromechanical devices along the common line based on voltages applied along segment lines. Hold voltages may be applied along common lines between applications of release and address voltages, and the segment voltages may be selected to be sufficiently small that the segment voltages will not affect the state of the electromechanical devices along other common lines not being written to.",
            "LOW VOLTAGE DRIVER SCHEME FOR INTERFEROMETRIC MODULATORS - A method of driving electromechanical devices such as interferometric modulators includes applying a voltage along a common line to release the electromechanical devices along the common line, followed by applying an address voltage along the common line to actuate selected electromechanical devices along the common line based on voltages applied along segment lines. Hold voltages may be applied along common lines between applications of release and address voltages, and the segment voltages may be selected to be sufficiently small that the segment voltages will not affect the state of the electromechanical devices along other common lines not being written to.",
            "MODE INDICATOR FOR INTERFEROMETRIC MODULATOR DISPLAYS - A method and apparatus for displaying data on bi-stable and non-bi-stable displays is provided. The apparatus includes a controller chip capable of being connected to a non-bi-stable display through a first interface channel and also capable of being connected to a bi-stable display via the first interface channel and an additional second interface channel. When connected the non-bi-stable display, the second interface channel is not connected. The second interface channel may carry mode information bits to the bi-stable display module to allow the bi-stable display to utilize power-saving features."
        ],
        [
            "Published",
            "09-30-2010",
            "09-30-2010",
            "05-19-2011"
        ]
    ],
    "pageTitle": "Cummings, CA - Patent applications",
    "title": "",
    "url": "http://www.faqs.org/patents/inventor/cummings-ca-3/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988860.4/warc/CC-MAIN-20150728002308-00274-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 440743528,
    "recordOffset": 440719633,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "William Cummings, Millbrae, CA US //]]> BarDraw('2731787',['Patent applications by Uri Cummings, Santa Monica, CA US'],[[2,1,1,1,2,1,1]],['2005','2006','2008','2009','2010','2011','2012'],0); // <script type=\"text/javascript\"> </div> <div id=\"legend2731787\" align=\"center\"></div> </div> <canvas id=\"bg2731787\" style=\"max-width: 500px; width: 100%;\"></canvas> <div> <p align=\"center\">Patent applications by Uri Cummings, Santa Monica, CA US</p> <div class=\"bar2731787\" style=\"max-width: 500px; width: 100%; float:left; \"> <div align=\"left\" style=\"padding-top:20px;\"> </table> </tbody> </tr> <td>09-13-2012</td> <td><a href=\"/patents/app/20120230182\">GLOBAL PORTS IN MULTI-SWITCH SYSTEMS</a> - Global ports are supported in multi-switch systems having arbitrary topologies. In some implementations, global ports are implemented in a manner which makes the switch system robust in the face of link failure. In specific Ethernet implementations, global ports enable flooding, learning, forwarding, and link aggregation across the switch system.</td> <td>20120230182</td> <tr> </tr> <td>07-07-2011</td> <td><a href=\"/patents/app/20110164496\">FLOW AND CONGESTION CONTROL IN SWITCH ARCHITECTURES FOR MULTI-HOP, MEMORY EFFICIENT FABRICS</a> - A shared memory switch and switch fabric architecture are described which employ partitions of the shared memory to implement multiple, independent virtual congestion domains, thereby allowing congestion to be handled for different classes of traffic independently.</td> <td>20110164496</td> <tr> </tr> <td>12-23-2010</td> <td><a href=\"/patents/app/20100325370\">SHARED-MEMORY SWITCH FABRIC ARCHITECTURE</a> - A shared memory is described having a plurality of receive ports and a plurality of transmit ports characterized by a first data rate. A memory includes a plurality of memory banks organized in rows and columns. Operation of the memory array is characterized by a second data rate. Non-blocking receive crossbar circuitry is operable to connect any of the receive ports with any of the memory banks. Non-blocking transmit crossbar",
    "textAfterTable": "Patent applications by William Cummings, Millbrae, CA US William J. Cummings, San Jose, CA US Patent application number Description Published 20110044496 METHOD AND DEVICE FOR MULTISTATE INTERFEROMETRIC LIGHT MODULATION - A multi-state light modulator comprises a first reflector. A first electrode is positioned at a distance from the first reflector. A second reflector is positioned between the first reflector and the first electrode. The second reflector is movable between an undriven position, a first driven position, and a second driven position, each having a corresponding distance from the first reflector. In one embodiment, the three positions correspond to reflecting white light, being non-reflective, and reflecting a selected color of light. Another embodiment is a method of making the light modulator. Another embodiment is a display including the light modulator. 02-24-2011 20110053304 METHOD OF MAKING AN ELECTRONIC DEVICE WITH A CURVED BACKPLATE - A package is made of a transparent substrate having an interferometric modulator and a back plate. A non-hermetic seal joins the back plate to the substrate to form a package, and a desiccant resides inside the package. A method of packaging an interferometric modulator includes providing a transparent substrate and manufacturing an interferometric modulator array",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}