{
    "relation": [
        [
            "Keywords and Parameters",
            "AT",
            "FOR :host_integer",
            "subquery",
            "schema",
            "table",
            "view",
            "FOR :host_integer",
            "subquery",
            "schema",
            "table",
            "view"
        ],
        [
            "Description",
            "Identifies the database to which the DELETE statement is issued. The database can be identified by either: db_name: Is a database identifier declared in a previous DECLARE DATABASE statement. host_variable: Is a host variable whose value is a previously declared db_name. If you omit this clause, the DELETE statement is issued to your default database.",
            "Limits the number of times the statement is executed if the WHERE clause contains array host variables. If you omit this clause, Oracle executes the statement once for each component of the smallest array.",
            "Is a subquery that returns new values that are assigned to the corresponding columns. For the syntax of a subquery, see \"SELECT\" in Oracle Database SQL Language Reference.",
            "Is the schema containing the table or view. If you omit schema, Oracle assumes the table or view is in your own schema.",
            "The name of a table from which the rows are to be deleted.",
            "The name of a view. Oracle deletes rows from the view's base table.",
            "Limits the number of times the statement is executed if the WHERE clause contains array host variables. If you omit this clause, Oracle executes the statement once for each component of the smallest array.",
            "Is a subquery that returns new values that are assigned to the corresponding columns. For the syntax of a subquery, see \"SELECT\" in Oracle Database SQL Language Reference.",
            "Is the schema containing the table or view. If you omit schema, Oracle assumes the table or view is in your own schema.",
            "The name of a table from which the rows are to be deleted.",
            "The name of a view. Oracle deletes rows from the view's base table."
        ]
    ],
    "pageTitle": "Embedded SQL Statements and Directives",
    "title": "",
    "url": "http://docs.oracle.com/cd/E18283_01/appdev.112/e10825/pc_afemb.htm",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042981576.7/warc/CC-MAIN-20150728002301-00301-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 75814451,
    "recordOffset": 75759975,
    "tableOrientation": "HORIZONTAL",
    "lastModified": "Sat, 14 Aug 2010 15:00:11 GMT",
    "textBeforeTable": "Keywords and Parameters Description of the illustration return.gif Where the DML returning clause is: Description of the illustration delete.gif Syntax The DELETE ANY TABLE system privilege also provides the ability to delete rows from any table or any view's base table. For you to delete rows from the base table of a view, the owner of the schema containing the view must have DELETE privilege on the base table. Also, if the view is in a schema other than your own, you must be granted DELETE privilege on the view. For you to delete rows from a table, the table must be in your own schema or you must have DELETE privilege on the table. Prerequisites To remove rows from a table or from a view's base table. Purpose DELETE (Executable Embedded SQL) DECLARE TABLE (Oracle Embedded SQL Directive). Related Topics EXEC SQL DECLARE employees TYPE AS TABLE OF emp_objects ; EXEC SQL DECLARE project_array TYPE as VARRAY(20) OF project_type ; budget NUMBER); pname CHAR(20), pno CHAR(5), EXEC",
    "textAfterTable": "Usage Notes The host variables in the WHERE clause must be either all scalars or all arrays. If they are scalars, Oracle executes the DELETE statement only once. If they are arrays, Oracle executes the statement once for each set of array components. Each execution may delete zero, one, or multiple rows. Array host variables in the WHERE clause can have different sizes. In this case, the number of times Oracle executes the statement is determined by the smaller of the following values: The size of the smallest array The value of the :host_integer in the optional FOR clause If no rows satisfy the condition, no rows are deleted and the SQLCODE returns a NOT_FOUND condition. The cumulative number of rows deleted is returned through the SQLCA. If the WHERE clause contains array host variables, this value reflects the total number of rows deleted for all components of the array processed by the DELETE statement. If no rows satisfy the condition, Oracle returns an error through the SQLCODE of the SQLCA. If you omit the WHERE clause, Oracle raises a warning flag in the fifth component of SQLWARN in the SQLCA. For more information on this statement and the SQLCA, see Chapter 9, \"Handling Runtime Errors\". You can use Comments in a DELETE statement to pass instructions, or hints, to the optimizer. The optimizer uses hints to choose",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}