{
    "relation": [
        [
            "Categories",
            "What to do for fun",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "I go to the gym after school for fun.",
            "Keep your grades up no matter what happens.",
            "The University of Arizona is a great school and has many different opportunities for prosperous students. They work with you in completing your school. They are very helpful overall."
        ]
    ],
    "pageTitle": "University of Arizona (UA) Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/University-of-Arizona/reviews?_escaped_fragment_=/show/58306",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 125,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042981576.7/warc/CC-MAIN-20150728002301-00261-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 919394387,
    "recordOffset": 919187618,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{1090819=SO MANY THINGS. The University of Arizona has things going on all the time. The mall (this large grassy area that stretches across the entire campus) almost always has visitors. In 2012, Mac Miller visited the university for a free concert. There is a lovely pool at the Rec Center that is usable almost all year long. Sporting events are huge at UA and a huge number of people participate in tailgating. There are pickup games of football, ultimate frisbee, and soccer that take place on the mall almost daily. Plus, intramural sports at the Rec Center allow for competitive play., 755589=There are no such things as cafeteria food here! The food at the U of A is great! If you are the healthy type, we have that, If you rather pig out, we got that too, but nothing is better than getting a breakfast burrito at 2:30 in the morning!, 45690=Make sure you apply for financial aid before March 1st! That's their priority deadline and the school can be really generous. I also recommend living on campus for at least your first year if you can afford it. It's a great way to meet friends and even study buddies. If you decide to enroll in the honors program, consider living in an Honors-only residence hall. They have great study rooms so you don't have to walk all the way to do the library to catch up with some quiet homework time. I also recommend getting a Zona Zoo pass, which is your ticket to all sporting events at home. Going to games is another great way to blow off steam during the school year. Join clubs too! Put your name on their mailing lists so you're always updated. If you can't find a club you like, make your own! It's really easy if you talk to the student association. They'll give you start-up money too., 793015=Make sure to have pepper spray! There will be times when you will have to walk 2 o'clock in the morning to your car! I have heard of a girl being sexually assaulted by a cab driver so be weary of who you ride with. They do have a Safe Ride that works real well and is run by students. Make sure you have their number and hours they are open. They also have this program where you are escorted by two other college students who will have flashlights and pepper spray. They also have a blue light system in place to where no matter where you are on campus you will always be able to see a blue light station, where you will find an intercom that directly connects you to the campus police. But always remember that you need to think about your safety no matter where you are., 688449=The hotter it gets, the less people wear to class. Tank tops become the uniform by May. A couple blocks away from campus you can expect to find a really cool art community., 385561=The learning process involves more than just taking notes, attending lectures, and getting good grades. Most classes will be engaging, allowing you to speak your opinion and share previous knowledge from other courses, and even life experiences. This part of the learning process is really nice because you get to hear the voices and experiences of peers in your field of study; and not just quotes from a textbook. Guest speakers from the field or speakers who have experienced and witnessed historical moments, often present and engage a discussion with the students. The beauty of this process allowed me to see my peers as not just another student beside me, but an individual who is strong about what they are studying/working towards; whether it be the same goal or not. This collective discussion has often opened my thinking. As an undergraduate in the UA Bolton Guitar Studies program, I can think of a fine example. During Fall 2011, we had the Third International Tucson Guitar Festival, which showcased a number of master classes, performances, and discussions presented by famous performers and scholars in guitar such as the Assad Brothers and Mark Wilson. Mark Wilson is an expert and scholar in the field of 20th century music for the guitar. What he presented to the program one afternoon was incredible. He demonstrated how the guitar could be played like a piano, by literally tapping on the strings, along the neck of the guitar. During and after the lecture, my peers and myself were able to discuss and ask questions about this technique. I have encountered and have used this style of guitar before, but some of my peers haven't. So this allows us to discuss and share new ideas to one another., 504579=A bicycle or even a skateboard for that matter will make your life so much easier. Parking on campus can get very expensive and it's a big place. The gen ed classes are HUGE lecture courses that are so easy that you might as well take them at a community college to save money; the upper division classes are much better and the teachers are able to give individual attention. The campus has a lot of areas where you can jog, walk or play with your dog. Once someone even brought two giant fluffy rabbits to one of the grassy areas near the mall and student union, and they hopped around happily sniffing everybody who was chilling out there. On the mall, every day from the months of April through October, you get cute boys playing frisbee in the afternoons with their shirts off. There is a very welcoming Chicano/Hispanic studies department (in the Cesar Chavez building) that has regular days where the abuelas come in and talk to everyone and hug you and feed you lunch, even if you're just a lost art major who wandered over to recharge your laptop in the department lounge. Just total acceptance and love and free homemade food. They're awesome. This currently happens at least one Thursday a month, though the schedule may change between semesters. You can't plagiarize and get away with it, the teachers have databases and programs where they can catch even something as subtle as a couple phrases. Besides, it would be a waste of time. The writing requirements for any class outside the English department and a good many in it are nothing; if you can write at high school level, you should be fine. The art department is so open minded that in many cases their brains have fallen out. If you want to do whatever insane thing-- controversial performance art, sculptures of genitalia, painting with your feet (seriously someone in one of my figure drawing classes did this), whatever-- they will be intrigued and encourage you to pursue your unique vision. This can make critiques frustrating for more traditional artists, and I would recommend the Illustration program in Visual Communications over the Fine Arts program if you want to do realistic art that you can make a living selling commercially or on commissions rather than through the gallery system. You can find comfy couches in the most unexpected places. Get bottled energy drinks and bottled iced teas from the vending machines rather than the stores or restaurants, you end up paying up to 50 cents less that way. You can stay in the art studios working overnight if you really have to. I've never done it but I know people who have., 382902=Unfortunately, we all are living under the same economic situation. Tuition has increased about double since I started back in 2008. Some departments are suffering in size, so the best thing I can tell for future students; is to make everything you do count, and worthwhile. Because you will be paying for a higher tuition, utilize every service, career fair, event, and question you have to further your education, in order to really seal and make your career happen/worthwhile. Thankfully we live in an age where the internet is everywhere on campus. Therefore, there is no excuse to not find a computer and take the time to research jobs, internships, study abroad programs, housing, and so forth. The bang for your buck really depends on the student's will to make a valued and strong effort in the items mentioned above and more., 131164=It's November and it's still t-shirt and shorts weather! I love the school set up. We were just on game day on ESPN and our campus looked gorgeous. It's a great learning atmosphere., 891076=If you want to live on campus apply before March 1; otherwise you could get to school not knowing where you are living. Financial aid is a moving target, so get everything in writing. Make sure you have the number of credits you need, rather than relying on your counselors as they won't take the time to check and you could lose your scholarship if you don't enroll in enough units., 389077=Don't miss out on anything! May it be school, sports, or social related, do it all!, 319139=I graduated from UofA in May 2011 as a double major in mathematics (with an education option) and Africana Studies. I learned a tremendous amount by being at UofA. Most of the professors are great, however, I do advise looking up professor ratings on the UofA website just to get an idea of which professors have the best reviews from students. These really helped me throughout my four years there and were pretty accurate as far as the critiques. The secondary mathematics education program is great! The classes were interesting and truly prepared me to be a math teacher.}",
    "textBeforeTable": "06/19/2009 Reviewer is A current student here. 73 out of 76 people found this review useful. 1 of 448 Alexis from Phoenix, AZ Check out reviews left by other students or leave your own review. You could win a free scholarship. University of Arizona Reviews University of Arizona › Arizona › By State › Colleges › } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.create', -->",
    "textAfterTable": "Am enjoying being here I absolutely looooove this school. I've taken classes at some other colleges during the summer when I was in high school, so I know what other colleges offer and how they work. UA just absolutely blows them all out of the water. The people are nice and friendly, the city's great, the campus is beautiful, and the programs are all so unbelievable. I wouldn't want to be anywhere else. Am learning a lot Not all of the learning you do is academic. Much of my first year was personal growth learning. Just be expected for both. Login to rate or flag the reviews Kristy from small town, NY 01/17/2010 Reviewer is A current student here. 35 out of 37 people found this review useful. 2 of 448 Categories Comments Great for these types of students Of course self-motivated, responsible adults like any college. Also social people, it's a big school so if you are afraid",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}