{
    "relation": [
        [
            "Patent application number",
            "20090232398",
            "20100115097",
            "20120092727",
            "20120299942",
            "20120301023",
            "20140343962",
            "20150051918",
            "20150086947"
        ],
        [
            "Description",
            "PAPER INTERFACE TO AN ELECTRONIC RECORD SYSTEM - After markings have been placed on a pre-printed form by a user who interacted with an entity, the form is scanned to produce a scan file. The scan file is analyzed to identify whether user added markings are present on machine readable selection items. The method can take a number of automated actions, depending upon which pre-printed machine readable selection items were checked by the user. For example, in response to checkbox selections, the method can obtain (read) some form of electronically storable data relating to the entity based on which of the machine readable selection items the user checked. Alternatively, in response to other checkbox selections, the method can ignore the user added markings on the machine readable selection items. In addition, in response to the checkmarks, the system can maintain only an image of the user added handwritten text. Alternatively, the system can be instructed to not only maintain an image of the user added handwritten text, but to automatically forward the image of the user added handwritten text to a transcription center.",
            "SYSTEM AND METHOD FOR DECENTRALIZED JOB SCHEDULING AND DISTRIBUTED EXECUTION IN A NETWORK OF MULTIFUNCTION DEVICES - A system and method for scheduling and executing jobs in a decentralized multifunction device (MFD) network is provided. The method includes receiving at an origin node of the network of MFDs a job, where the job includes data and a request to perform an operation on the data. MFDs of the network are selected to execute the requested operation on at least a portion of the job data. Portions of the job data are apportioned to the selected MFDs for processing thereof by executing the requested operation. The selecting and the apportioning are performed using historical information related to previous performance and reliability of the MFDs of the network.",
            "APPARATUS FOR LOW COST EMBEDDED PLATFORM FOR DEVICE-SIDE, DISTRIBUTED SERVICES ENABLEMENT - A class of add-on system components providing functionality of devices, management of self-help, customization and enhancement of services for devices, and remote monitoring at significantly reduced cost. It reduces the cost of UI and greatly enhances ease-of-use by realizing that the networked system can be headless and use a browser-based UI for its platform. It embeds a Device Model Agent (DMA) and connects to the Device-Centric Services platform to offer services. Additionally, it offers customized diagnostic access for customer representatives to enable self-help service actions to be performed, unifies and manages multiple access needs to several disparate data access mechanisms, and uses largely COTS PC hardware rather than customized PWBs.",
            "MODIFYING COLOR ADJUSTMENT CHOICES BASED ON IMAGE CHARACTERISTICS IN AN IMAGE EDITING SYSTEM - What is disclosed is a system and method for dynamically reducing the number of choices by reordering the selectable menu options in each menu of a color adjustment tool based on image content, selections in other menus, and usage history. Color names and color modifiers are reduced and/or reordered through image analysis, with most frequently occurring colors being placed at the top of the menu and excluding less frequently used or unused colors from the menu. Adjustment adjectives are reduced by eliminating nonsensical or rare color adjustment combinations (e.g. make the grays much more colorful, make the blues yellower), and/or reordered based on usage history, either by the individual user or by aggregating over many users.",
            "METHOD AND APPARATUS FOR EDITING COLOR CHARACTERISTICS OF ELECTRONIC IMAGE - A method of editing color characteristics of an electronic image includes: a) receiving an original electronic image at a color editing subsystem; b) analyzing the original electronic image to identify original color characteristics and to identify a recommended set of color editing options, the recommended set of color editing options being less than a complete set of color editing options provided by the color editing subsystem; c) presenting the recommended set to a user via a user interface device; d) receiving a color editing instruction from the user interface device in response to the user selecting a corresponding color editing option from the recommended set; and e) adjusting the original color characteristics to form an adjusted electronic image having adjusted color characteristics based at least in part on the color editing instruction. An apparatus for editing color characteristics of an electronic image is also provided.",
            "COMPUTER-BASED SYSTEM AND METHOD FOR PRESENTING AND CONTROLLING ACCESS TO MEDICAL INFORMATION - A computer-based method for presenting medical information, including: storing, in at least one memory element of at least one computer, computer readable instructions; and executing, using at least one processor for the at least one computer, the computer readable instructions to: receive an input selecting a medical condition; identify a portion of an electronic medical record (EMR) for the patient, specific to the patient, related to the medical condition; generate a video including at least one video segment with the portion of the EMR; designate at least one first level of access for the at least one video segment; and control access to the at least one video segment according to the at least one first level of access.",
            "COMPUTER-BASED SYSTEM AND METHOD FOR PRESENTING CUSTOMIZED MEDICAL INFORMATION - A computer-based method for presenting customized medical information, including: storing, in at least one memory element of at least one computer, computer readable instructions; and executing, using at least one processor for the at least one computer, the computer readable instructions to: receive an input identifying a patient; access electronic medical-related records (EMRRs) for the patient; formulate, based on data in the EMRRs, a query requesting information/input from the patient; transmit the query for display on a first graphical user interface (GUI) device; receive, in response to the query, an input providing the information/input; generate a video including at least one video segment related to the information/input; and transmit the video for display on the first GUI device or on a second GUI device.",
            "COMPUTER-BASED SYSTEM AND METHOD FOR CREATING CUSTOMIZED MEDICAL VIDEO INFORMATION USING CROWD SOURCING - A computer-based apparatus including a computer including a processor arranged to select a first video regarding a medical condition; create a second video including segments from the first video; transmit the second video for viewing by qualified medical personnel; receive input from the personnel; based on the input confirm accuracy of a first segment or modify a second segment or delete a third segment; create, from the second video, by at least including the first or second segment or deleting the third segment; transmit the third video for viewing by viewers; receive a respective response from each viewer identifying a respective fourth segment of the third video deemed relevant to the medical condition or enjoyable; create a fourth video including at least a portion of the respective fourth segments; and store the fourth video for inclusion in a video regarding the medical condition."
        ],
        [
            "Published",
            "09-17-2009",
            "05-06-2010",
            "04-19-2012",
            "11-29-2012",
            "11-29-2012",
            "11-20-2014",
            "02-19-2015",
            "03-26-2015"
        ]
    ],
    "pageTitle": "Kehoe, US - Patent applications",
    "title": "",
    "url": "http://www.faqs.org/patents/inventor/kehoe-us-5/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042981576.7/warc/CC-MAIN-20150728002301-00176-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 441445571,
    "recordOffset": 441427806,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Michael P. Kehoe, Rochester, NY US 03-12-2009 TheVR - A method and apparatus for making viscous products easier to work with by reducing their viscosity using regularly available heat sources. 20090065511 Published Description Patent application number Michael P. Kehoe, Falls, PA US 01-14-2010 POLYNUCLEOTIDES ENCODING ANTI-SULFOTYROSINE ANTIBODIES - The invention provides anti-sulfotyrosine specific antibodies capable of detecting and isolating polypeptides that are tyrosine-sulfated. The sulfotyrosine antibodies and antibody fragments of the invention may be used to discriminate between the non-sulfated and sulfated forms of such proteins, using any number of immunological assays, such ELISAs, immunoblots, Western Blots, immunoprecipitations, and the like. Using a phage-display system, single chain antibodies (scFvs) were generated and screened against tyrosine-sulfated synthetic peptide antigens, resulting in the isolation of scFvs that specifically recognize sulfotyrosine-containing peptides and/or demonstrate sulfotyrosine-specific binding in tyrosine sulfated proteins. The VH and VL genes from one such sulfotyrosine-specific scFv were employed to generate a full length, sulfotyrosine-specific immunoglobulin. 20100009441 Published Description Patent application number John Kehoe, Saint Davids, PA US 08-07-2014 Antibodies binding human collagen II - The present invention relates to antibodies against human collagen II, polypeptides and polynucleotides encoding human collagen II antibodies or fragments thereof, and methods of making and using the foregoing. 20140220634 05-03-2012 Antibodies Binding Human Collagen II - The present invention relates to antibodies against human collagen",
    "textAfterTable": "Patent applications by Michael P. Kehoe, Rochester, NY US Sean T. Kehoe, Waukesha, WI US Patent application number Description Published 20120255183 HYDRAULIC HAND-HELD KNOCKOUT PUNCH DRIVER - A hand-held knockout driver for use with a punch and die. The hand-held knockout driver including a housing having a handle portion, a motor positioned within the housing, the motor having a drive shaft defining a first axis, a pump assembly positioned within the housing, the pump assembly having a piston moving along a second axis, a dump valve positioned within the housing, the dump valve defining a third axis, and a working piston moveable with respect to the housing along a fourth axis. Where the second axis, the third axis, and the fourth axis are all not parallel to the first axis 10-11-2012 20130014968 MOTOR MOUNT FOR A POWER TOOL - A power tool includes a motor having a can and a shaft extending axially from the can, a gear case having an inner surface that defines an opening, a bearing positioned around a portion of the shaft that extends from the can and at least partially within the opening in the gear case, and a motor mount",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}