{
    "relation": [
        [
            "Religion",
            "Catholic",
            "Mainline Protestant",
            "Evangelical Protestant",
            "Other",
            "Orthodox",
            "Black Protestant",
            "None"
        ],
        [
            "Adherents",
            "38,243",
            "22,030",
            "12,007",
            "7,187",
            "500",
            "285",
            "201,422"
        ],
        [
            "Congregations",
            "19",
            "96",
            "85",
            "44",
            "1",
            "2",
            "-"
        ]
    ],
    "pageTitle": "Westbrook, Maine (ME 04092) profile: population, maps, real estate, averages, homes, statistics, relocation, travel, jobs, hospitals, schools, crime, moving, houses, news, sex offenders",
    "title": "",
    "url": "http://www.city-data.com/city/Westbrook-Maine.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042981576.7/warc/CC-MAIN-20150728002301-00018-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 372364911,
    "recordOffset": 372230238,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{7584=According to our research of Maine and other state lists there were 18 registered sex offenders living in Westbrook, Maine as of July 27, 2015. The ratio of number of residents in Westbrook to the number of sex offenders is 978 to 1. The number of registered sex offenders compared to the number of residents in this city is smaller than the state average., 22781=Incorporated on 02/14/1814}",
    "TableContextTimeStampAfterTable": "{80382=6.28% of this county's 2011 resident taxpayers lived in other counties in 2010 ($45,472 average adjusted gross income), 62113=2012 Presidential Elections Results, 41518=Air Quality Index (AQI) level in 2012 was 83.6. This is about average., 61255=2000 Presidential Elections Results, 57627=Educational Attainment (%) in 2013, 43633=Sulfur Dioxide (SO2) [ppb] level in 2012 was 1.02. This is significantly better than average. Closest monitor was 0.4 miles away from the city center., 58025=School Enrollment by Level of School (%) in 2013, 61541=2004 Presidential Elections Results, 62397=Graphs represent county-level data. Detailed 2008 Election Results, 17014=On 10/10/1966, a category F2 (max. wind speeds 113-157 mph) tornado 27.6 miles away from the Westbrook city center caused between $5000 and $50,000 in damages., 82601=6.10% of this county's 2010 resident taxpayers moved to other counties in 2011 ($39,995 average adjusted gross income), 61827=2008 Presidential Elections Results, 60969=1996 Presidential Elections Results, 176054=Total of 60 patent applications in 2008-2015., 42887=Nitrogen Dioxide (NO2) [ppb] level in 2012 was 9.79. This is significantly worse than average. Closest monitor was 4.7 miles away from the city center., 45825=Particulate Matter (PM2.5) [µg/m3] level in 2012 was 8.39. This is about average. Closest monitor was 0.9 miles away from the city center., 44377=Ozone [ppb] level in 2012 was 27.5. This is about average. Closest monitor was 4.7 miles away from the city center., 17257=On 5/14/1963, a category F2 tornado 37.3 miles away from the city center caused between $5000 and $50,000 in damages., 42165=Carbon Monoxide (CO) [ppm] level in 2012 was 0.400. This is worse than average. Closest monitor was 4.7 miles away from the city center., 45076=Particulate Matter (PM10) [µg/m3] level in 2012 was 20.7. This is about average. Closest monitor was 0.4 miles away from the city center., 177362=Recent home sales and price trends information powered by Onboard Informatics © 2015 Onboard Informatics. Information is deemed reliable but not guaranteed.   City-data.com does not guarantee the accuracy or timeliness of any information on this site.  Use at your own risk. Website © 2015 Advameg, Inc.}",
    "textBeforeTable": "Religion statistics for Westbrook city (based on Cumberland County data) Graphs represent county-level data. Detailed 2008 Election Results 2012 Presidential Elections Results 2008 Presidential Elections Results 2004 Presidential Elections Results 2000 Presidential Elections Results 1996 Presidential Elections Results 2012 2008 2004 2000 1996 Presidential Elections Results Other fuel (2%) Wood (3%) Electricity (7%) Bottled, tank, or LP gas (8%) Utility gas (16%) Fuel oil, kerosene, etc. (64%) Most commonly used house heating",
    "textAfterTable": "Source: Clifford Grammich, Kirk Hadaway, Richard Houseal, Dale E.Jones, Alexei Krindatch, Richie Stanley and Richard H.Taylor. 2012. 2010 U.S.Religion Census: Religious Congregations & Membership Study. Association of Statisticians of American Religious Bodies. Jones, Dale E., et al. 2002. Congregations and Membership in the United States 2000. Nashville, TN: Glenmary Research Center. Graphs represent county-level data Food Environment Statistics: Number of grocery stores: 72 Cumberland County: 2.62 / 10,000 pop. Maine: 2.80 / 10,000 pop. Number of supercenters and club stores: 3 This county: 0.11 / 10,000 pop. State: 0.14 / 10,000 pop. Number of convenience stores (no gas): 67 Cumberland County: 2.44 / 10,000 pop. Maine: 2.20 / 10,000 pop. Number of convenience stores (with gas): 105 Cumberland County: 3.82 / 10,000 pop. State: 5.75 / 10,000 pop. Number of full-service restaurants: 330 Here: 12.01 / 10,000 pop. State: 11.02 / 10,000 pop. Adult diabetes rate: This county:",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}