{
    "relation": [
        [
            "Domain Created On",
            "1998-08-24",
            "16 years, 334 days old"
        ],
        [
            "Last Modified On",
            "1998-08-24",
            "16 years, 334 days ago"
        ],
        [
            "Expires On",
            "2018-08-24",
            "3 years, 30 days from today"
        ]
    ],
    "pageTitle": "apeoesp.org.br APEOESP - Sindicato dos Professores do Ensino Oficial do Estado de São Paulo | SEOCert",
    "title": "",
    "url": "http://www.seocert.net/analyzer.apeoesp.org.br",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988860.4/warc/CC-MAIN-20150728002308-00037-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 700279407,
    "recordOffset": 700259728,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{3680=IP address of apeoesp.org.br is : 186.202.12.7. The domain apeoesp.org.br was created on 1998-08-24 and it is 16 years, 334 days old. It will expire on 2018-08-24 which is 3 years, 30 days from today. The homepage of website apeoesp.org.br has a size of 29842 bytes, and a text size of 4506 bytes, its Text to Code Ratio is 17.78% Homepage of apeoesp.org.br has 87 links, 72 link to internal pages, while 15 link to pages on other websites. It takes 1.12 s ( 26.66 Kb/s ) to load the website apeoesp.org.br.}",
    "textBeforeTable": "APEOESP - Sindicato dos Professores do Ensino Oficial do Estado de São Paulo Words count: 14    Unique Words: 13    Length: 77 characters [ To optimize the page title, Use this SEO Title Optimizer ] : Title Content Analysis Register To View All >> the 21 recommended tasks to improve your SEO performance. ... Implement HTTP compression for your site. Host the site closer to the geo location where most of your site visitors come from. Create more back-links from root domains. Get rid of the 19 errors and 9 warnings from W3C validation. Configure the server so that your site IP http://186.202.12.7 is redirected to the site domain name apeoesp.org.br. Remove flash component from your site. Create and add a robots.txt for your site. Use more straight forward terms, avoid using too much jargon in the page content. Create one H1 element for your page, put the most important keywords in. Edit the title tag, ensure it contains 1-12 words, and with 10-70 characters.",
    "textAfterTable": "Tips: 1. ideally, the title should contain 10 to 70 characters, including spaces. (Google displays up to 70 characters in the title, and takes into account only the first 12 words.) 2. put the most important and relevant keywords in the title, try not to repeat any word. 3. each individual page should have a unique title. Description : APEOESP - Sindicato dos Professores do Ensino Oficial do Estado de São Paulo Words count: 14    Length: 77 characters [ To optimize the page description, Use this SEO Meta Description Optimizer ] Excellent! Your meta description contains between 70 and 160 characters. Meta Descriptions provide concise explanations of the contents of web pages, that are commonly used by search engines on search result pages to display preview snippets for a given page. Tips: 1. it is best to keep meta descriptions between 70-160 characters. 2. a readable, compelling description using important keywords can draw a much higher click-through rate of searchers to the given web page. 3. avoid keyword stuffing, ensure each page has its own unique description. Google SERP Preview : APEOESP - Sindicato dos Professores do Ensino Oficial ... www.apeoesp.org.br/",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}