{
    "relation": [
        [
            "JUNIOR YEAR",
            "Approved electives (3000 level or above) in Business Administration. . . . . . . . . .",
            "Business Law 3201. . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . .",
            "Management 3200 . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . .",
            "Marketing 3401 or 3402 . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . .",
            "ISDS 3100, 3107, 3110, 3115 or 3117, 4113. . . . . . . . . . . . . . . . . . . . . . . . . . .",
            "Approved non-business electives*. . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . .",
            ""
        ],
        [
            "SEM. HRS.",
            "3",
            "3",
            "3",
            "3",
            "15",
            "3",
            "30"
        ]
    ],
    "pageTitle": "LSU General Catalog 2008-2009",
    "title": "",
    "url": "http://www.lsu.edu/catalogs/2008/151business.shtml",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042981576.7/warc/CC-MAIN-20150728002301-00243-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 558549175,
    "recordOffset": 558529863,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{56765=CHAIR • Newman OFFICE • 2107 Patrick F. Taylor Hall TELEPHONE • 225-578-5211 FAX • 225-578-3807, 15813=Students admitted as freshmen must register for and successfully complete BADM 1000 in their first semester to remain in the college. In addition, students admitted as freshmen must successfully complete the Pre- Business Core (English 1001, Math 1021 and 1431, Economics 2000, ISDS 1100 and Accounting 2001) with a “C” or better during their freshman year. Students who place out or test out of any of the Pre-Business Core classes will be given credit for successfully completing those classes. Freshmen who earn less than a “C” on any Pre-Business Core course will be put on college probation. Freshmen are subject to all other maintenance standards in order to continue as a business major., 12425=The E. J. Ourso College of Business is a member school of the American Assembly of Collegiate Schools of Business (AACSB). Its undergraduate programs have been accredited continuously by the AACSB since 1931., 12683=The statement of mission and objectives below was developed by the E. J. Ourso College of Business's strategic planning committee and was approved by the faculty of the college in the spring of 1993., 77778=INTERIM CHAIR • Slawson OFFICE • 2163 Patrick F. Taylor Hall TELEPHONE • 225-578-6291 FAX • 225-578-6366, 88868=CHAIR • Schneider OFFICE • 3199 Patrick F. Taylor Hall TELEPHONE • 225-578-2126 FAX • 225-578-2511, 23494=All business majors must complete six hours of Communication Studies courses. Students are required to take Communication Studies 1061 and one fo the following courses: Communication Studies 2010, 2061, 2064, 4101, 4113, or 4114., 29751=Founded in 1897 at the University of Maine, Phi Kappa Phi is the nation’s oldest, largest, and most selective honor society for all academic disciplines. Its chapters are on nearly 300 campuses in the United States, Puerto Rico, and the Philippines. Each year, approximately 30,000 members are initiated. Some of the organization’s more notable members include former President Jimmy Carter, writer John Grisham, NASA astronaut Wendy Lawrence, and Netscape founder James Barksdale. The LSU chapter was founded in 1930 as the 43rd chapter in the nation., 57349=If postgraduate study in economics is anticipated, it is strongly recommended that the calculus sequence, MATH 1550-1552 and 2085, be taken., 27974=Students who complete degree requirements during spring intersession should plan to graduate in August and must inform the dean's office of this intention. Such students should see a counselor and register in the summer for “degree only.” Students who complete degree requirements during winter intersession should plan to graduate in May and must inform the dean’s office of this intention. Such students should see a counselor and register in the spring semester for “degree only.” Students who complete degree requirements during summer intersession should plan to graduate in December and must inform the dean’s office of this intention. Such students should see a counselor and register in the fall semester for “degree only.”}",
    "textBeforeTable": "**To be selected from the offerings of at least four of the following departments: Accounting, Economics, Finance, Management, Marketing, and Information Systems and Decision Sciences. *See “Electives” under “Degree Requirements of the College.” TOTAL SEM. HRS. • 121 CURRICULUM IN GENERAL BUSINESS ADMINISTRATION GENERAL BUSINESS ADMINISTRATION DEPARTMENTS AND CURRICULA The University maintains a professionally staffed placement service located on the first floor of Patrick Taylor Hall. Interviews are conducted throughout the year. The major concern of the placement office is to assist both students and alumni in finding positions consistent with their career objectives. PLACEMENT SERVICE The Master of Public Administration is a professional program for students interested in public management and/or public policy issues. The MPA program provides students with the management and financial skills to work in public agencies, non-profit organizations, private consulting and research organizations, and private companies in governmental relations. This program is administered by the Public Administration Institute. MPA students take 30 credit hours of core courses and 12 credit hours in an area of specialization. Master of Public Administration The combination of a general or a technical undergraduate education with a graduatelevel Master of Business Administration degree is a widely recognized avenue to opportunity and success in the business world. To this end, the college offers an MBA program for students who aspire to management careers in business and industry. The program is open to those who hold degrees in arts and sciences or",
    "textAfterTable": "Communication studies 1061. . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 3 General education humanities course. . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . .  3   31 SOPHOMORE YEAR SEM. HRS. Accounting 2101 or 2102 or 3001 or 3002. . . . . . . . . . . . . . . . . . . . . . . . . . . . . 3 English 2000 . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 3 Economics 2010 or 2011, 2035 or",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}