{
    "relation": [
        [
            "Postage and handling",
            "US $4.00",
            "US $7.95"
        ],
        [
            "Each additional item",
            "US $2.00",
            "US $2.00"
        ],
        [
            "To",
            "United States",
            "United States"
        ],
        [
            "Service",
            "Economy Postage (USPS Media MailTM)",
            "Express Postage (USPS Priority Mail®)"
        ],
        [
            "Delivery*",
            "Estimated between Wed. 5 Aug. and Wed. 12 Aug.",
            "Estimated between Tue. 4 Aug. and Fri. 7 Aug."
        ]
    ],
    "pageTitle": "Elvis Presley HIS Hand IN Mine Vinyl Record 33 1 3 RCA Records Album 1976 | eBay",
    "title": "",
    "url": "http://www.ebay.com.au/itm/ELVIS-PRESLEY-HIS-HAND-IN-MINE-VINYL-RECORD-33-1-3-RCA-RECORDS-ALBUM-1976-/290758513313?pt=Music_on_Vinyl&hash=item43b28ed2a1",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988860.4/warc/CC-MAIN-20150728002308-00010-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 439376495,
    "recordOffset": 439332108,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Please enter five or nine numbers for the postcode. Please enter a valid postcode. Postcode: Select a valid country. There are 1 items available. Please enter a number less than or equal to 1. -Select- United States Change country: Item location: Posting cost can't be calculated. Please enter a valid postcode. Contact the seller- opens in a new window or tab and request a shipping method to your Excludes: US Protectorates Posting to: United States Benton, Arkansas, United States",
    "textAfterTable": "* Estimated delivery dates- opens in a new window or tab include seller's handling time, origin ZIP Code, destination ZIP Code and time of acceptance and will depend on shipping service selected and receipt of cleared payment- opens in a new window or tab. Delivery times may vary, especially during peak periods. Domestic handling time Will usually post within 1 business day of receiving cleared payment - opens in a new window or tab. Return policy Item must be returned within Refund will be given as 30 days after the buyer receives it Money Back The buyer is responsible for return postage costs. Return policy details",
    "hasKeyColumn": true,
    "keyColumnIndex": 3,
    "headerRowIndex": 0
}