{
    "relation": [
        [
            "Name",
            "Gypsum (Calcium Sulfate)",
            "Chalk",
            "Calcium Chloride",
            "Epsom Salt (MgSO4)",
            "Lactic Acid",
            "Gypsum (Calcium Sulfate)",
            "Chalk",
            "Calcium Chloride",
            "Epsom Salt (MgSO4)"
        ],
        [
            "Amount",
            "6.00 g",
            "3.00 g",
            "2.00 g",
            "1.00 g",
            "0.50 ml",
            "4.80 g",
            "2.40 g",
            "1.60 g",
            "0.80 g"
        ],
        [
            "Time",
            "60 min",
            "60 min",
            "60 min",
            "60 min",
            "60 min",
            "60 min",
            "60 min",
            "60 min",
            "60 min"
        ],
        [
            "Use",
            "Mash",
            "Mash",
            "Mash",
            "Mash",
            "Mash",
            "Boil",
            "Boil",
            "Boil",
            "Boil"
        ],
        [
            "Type",
            "Water Agent",
            "Water Agent",
            "Water Agent",
            "Water Agent",
            "Water Agent",
            "Water Agent",
            "Water Agent",
            "Water Agent",
            "Water Agent"
        ]
    ],
    "pageTitle": "Nick's Brew Blog | Brewing Illegally Since 2004 (Now Legal!)",
    "title": "",
    "url": "http://nhudson.org/2008_10_01_archive.html/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988860.4/warc/CC-MAIN-20150728002308-00107-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 173287023,
    "recordOffset": 173266075,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{84807=So I’ve been a few years without posting anything.  I switched over to using WordPress from Blogger a few months back and am going to try to keep things up this go around.  Lots of beers have been brewed since August 31st 2012 and I will not rehash those.  I also tied this into Google+ to see how that works, so technically anything I post here should post there and vice versa.  I will hopefully be posting up some recent recipes soon., 62971=So since I could not get Blood Oranges at the time of brewing I opted for 100% Blood Orange juice to add at the end of the boil.  I zested 4 Minneola Tangelos and added them in at flame out.  The grist is made up of mainly Pale and Wheat malts, with some Munich, Acid Malt, Golden Naked Oats and Flaked Barley.  Anyway once the pellicle had taken hold and then mostly dropped out I took a sample gravity which was still really high and no where near where I would have liked it (1.026).  I then took a PH reading and it read 3.1, which would explain why everything seemed to stop fermenting.  In a really heavy acid solution, nothing is going to work correctly.  I have spent several months trying to figure out what to do about this.  Blending comes to mind, but that requires extra work and extra brewing with extra beer left over.  I added in 2 packets of Champagne yeast and still nothing is fermenting.  Forward to spring 2014 and I run across some Blood Oranges in Whole Foods so I figure I would try one last thing before brewing another batch to blend.  I peeled and cut up the 4 lbs of Blood Oranges added them to a new sanitized fermenter and then racked the beer over to the pulp of the oranges.  I then added in a good dose of ECY Bug County (ECY20), now it’s finally showing signs of life again.  It’s another wait and see beer that I hope pans out, because the aroma on this beer is fabulous., 27693=For the longest I’ve been wanting to have a “house beer”  A beer that can be easily made, quickly fermented, lowish gravity and easy drinking.  I wanted something with some hop flavor, not really bitterness.  I wanted a good balance of malt/hop flavor with a heavy hopped aroma (dry hopping).  This lead me down to brew a Pale Ale back around the 1st of the year.  I acquired a 1lb each of Columbus, Cascade and Amarillo, all of which from this past season crop and all of which are leaf hops.  I find that leaf hops add a different flavor than pellets.  If the leaf hops are left in the beer at dry hopping too long you can get a grassy effect, which I do not want.  Either way, I love the hint of grassy/earthy notes that whole leaf hops give off.  Drinking a Sierra Nevada Pale Ale brings that into mind.  We know from past cloning recipes that they use whole cone Cascades and it shows.  Sierra Nevada has a “house flavor”, that is found in all their beers; I think all home brewers have that as well, including myself.  Anyway, so I  wanted to find a good showcase of the 3 lbs of hops I just bought.  So I made a Pale Ale back in January.  I took zero notes and it turned out fabulous.  Great, so now I have nothing to build off of, so I started over with what I thought to be the original recipe I used.  I had everything I needed already in house, Crisp Pale Ale malt, Riverbend Heritage, which is a bit darker (4-5L) than pale malt.  All I needed was the pound of Flaked Wheat.  Brew day rolls around and low and behold I forget to go get the Wheat.  Luckily I had a pound of Flaked Spelt, that I used in a pinch and I think it works., 37264=Update: 2014-06-20: Tasting Notes, 49591=One of my favorite blogs to read is Ron Pattinson’s Shut up about Barclay Perkins.  I’ve been reading it for years now, I have made several of his historical recipes that get posted on his Let’s Brew Wednesday topics.  Really love making these beers and trying to relive how people drank beer back in the late 1800’s to all the way till after WWII.  It’s always amazing to see the hopping rates, the interesting malt bills and use of different invert sugars and colorings (caramel coloring).  For this beer I had bought a whole sack (55lb) of Pauls Mild Malt almost a year ago and split it with a buddy of mine.  Having used a few pounds of it here and there, I was really looking for a way to make a beer showcasing this malt in some way.  So after some research and thought, I settled on this recipe from Barclay Perkins.  It’s from 1839, so it’s pretty old and pretty odd by today’s standard.  There is 1 malt and 1 type of hops, well 1 type of a lot of hops.  I settled on making only a 3 gallon batch, due to the amount of malt I had on hand and I didn’t want to bottle 5 gallons of this.  The bad part about this is the 4 hour boil, yeah 4 freaking hours.  I had to use 2 propane tanks to make this beer.  So I mashed in and started with a pre-boil volume like I would normally have for a 6 gallon (9 gallons) batch.  Over the 4 hours it boiled down to around 3.5 gallons.  Also adding in 2.75oz of hops for 3 gallons is a ton of hops.  So I had an issue of getting the beer out of the kettle due to all the hop matter.  Other than that, this beer is pretty normal.  It did have a starting gravity of 1.114SG and it ended at 1.024SG, and fermented pretty quickly at 65F for about a week.  It helped that I pitched a ton of yeast for the 3 gallons., 72192=Anyway my first introduction to Gose was though the Mad Fermentationist’s blog post about Gose back in 2010, since then it’s really come back as a style, so much so that I believe that the BJCP’s next style releases will include a Gose style category.  So I have really been wanting to make one for some time.  I had a chance to come up with a quick recipe a few weeks back hoping for a quick turn around and an easy drinking beer ready for the hotter days coming up soon.  Sadly fermentation stopped at around 1.020 and I couldn’t get it started again (more on this later).  I wanted something fairly salty and somewhat sour with some Hibiscus.  So I opted for the Acid malt way of souring this beer so I wouldn’t have to endure a lacto fermentation and mess up another better bottle., 60409=This one started a while back.  I wanted to somewhat clone Crooked Stave’s St. Bretta but add in Blood Oranges.  I am pretty sure their Summer variant of this beer is made with Blood Oranges, but I never had the pleasure of drinking it.  So I went with a recipe pulled from the May/June 2012 Zymurgy magazine where Chad talks about brewing with 100% brett.  Their is a recipe for a 100% Brett Belgian White, which is kind of the base beer for St. Bretta which originally got it’s name from his WWB series WWBO (Orange).  WWBO is a wheat forward beer, 100% brett fermented with oranges added.  I believe everything about the orange is added, the zest, skin, pulp and juice.}",
    "textBeforeTable": "Recipe Details After all of this, I ended up with 6 gallons that is already off fermenting with the WLP029 yeast I used.  I want to say that I took the recipe from the book The Home Brewers Guide to Vintage Beer where Ron has a few pages on the style.  If you don’t have this book you need it.  Now on to the recipe. For some stupid reason I thought with all the wheat I would use a single decoction method when mashing to best help break down the proteins needed for conversion.  So I mashed in at 122F for 15 minutes, pulled 40% of the grain and brought it up to 155 for 5 minutes. With this decoction I tried to leave behind as much liquid as possible.  Then boiled the decoction for 5 minutes. Added it back to the main mash. Mash temp was supposed to be 156F, but I ended up being a little low. Added in 2 gallons of boiling water to bring it up to temp. From here I batched sparged normally with 4.5 gallons of water at 185F.  This resulted in pretty good run off and extraction.  Of course I am sure some of that was due to the entire pound of rice hulls I had to use. I have been wanting to brew this style of beer for the longest time.  If you wish",
    "textAfterTable": "Hops Name Amount Time Use Form Alpha % Lublin 2 oz 90 min First Wort Pellet 4 Lublin 2 oz 20 min Boil Pellet 4 Miscs Name Amount Time Use Type Calcium Chloride 5.00 g 60 min Mash Water Agent Gypsum (Calcium Sulfate) 3.00 g 60 min Mash Water Agent Lactic Acid 3.00 ml 60 min Mash Water Agent Epsom Salt (MgSO4) 2.00 g 60 min Mash Water Agent Campden Tablets 1.00 Items 0 min Mash Water Agent Calcium Chloride 5.00 g 60 min Boil Water Agent Gypsum (Calcium Sulfate) 3.00 g 60 min Boil Water Agent Epsom Salt (MgSO4) 2.00 g 60 min Boil Water Agent Yeast Name Lab Attenuation Temperature German Ale/Kolsch (WLP029) White Labs 75% 65°F - 69°F Notes Ran a single decoction. Mashed in at 122 for 15 minutes. Pulled 40% of the grain and brought it up to 155 for 5 minutes. Then boiled the decoction for 5 minutes. Added it back to the main mash. Mash temp was supposed to be 156F, but I ended up being a little low. Added in 2 gallons of boiling water to bring it up",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}