{
    "relation": [
        [
            "",
            "Consideration received from Monrovia, reflecting cash of $732 and note receivable of $4,036",
            "Carrying value of assets sold, principally inventory",
            "Curtailment of employee benefit plan (see Note 10)",
            "Severance and other expenses",
            "​",
            "Pretax loss on sale",
            "​",
            "​",
            "​"
        ],
        [
            "",
            "",
            "",
            "",
            "",
            "​",
            "",
            "​",
            "​",
            "​"
        ],
        [
            "",
            "$",
            "",
            "",
            "",
            "​",
            "$",
            "​",
            "​",
            "​"
        ],
        [
            "",
            "4,768",
            "(4,561",
            "309",
            "(563",
            "​",
            "(47",
            "​",
            "​",
            "​"
        ],
        [
            "",
            "",
            ")",
            "",
            ")",
            "​",
            ")",
            "​",
            "​",
            "​"
        ]
    ],
    "pageTitle": "",
    "title": "",
    "url": "http://www.sec.gov/Archives/edgar/data/1037390/000104746915000791/a2222978z10-k.htm",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042981576.7/warc/CC-MAIN-20150728002301-00107-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 703110751,
    "recordOffset": 703015500,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{1=Griffin is Subject to Litigation That May Adversely Impact Operating Results}",
    "TableContextTimeStampAfterTable": "{296753=        Depreciation and amortization expense increased from approximately $6.3 million in fiscal 2012 to approximately $6.7 million in fiscal 2013. The increase in depreciation and amortization expense of approximately $0.4 million in fiscal 2013 as compared to fiscal 2012 was due principally to an increase of approximately $0.3 million in fiscal 2013 on the 228,000 square foot Lehigh Valley industrial building that was completed and placed in service at the end of the fiscal 2012 third quarter, an increase of approximately $0.1 million related to new tenant improvements in several of Griffin Land's buildings and an increase of approximately $0.1 million in fiscal 2013 from accelerating depreciation on tenant improvements as a result of a tenant exercising its early lease termination option effective at the end of the fiscal 2013 third quarter. These increases in depreciation expense were partially offset by a decrease in depreciation expense of approximately $0.1 million in fiscal 2013 from certain tenant improvements becoming fully depreciated., 78658=        Griffin Land currently owns nine buildings in Griffin Center South with an aggregate of approximately 235,000 square feet, of which approximately 217,000 square feet is single story office and flex space and approximately 18,000 square feet is storage space. In fiscal 2014, Griffin Land leased approximately 38,000 square feet in a Griffin Center South building (approximately 19,000 square feet had been vacant and the balance became vacant when the lease with the previous tenant was terminated early because of the tenant's bankruptcy and subsequently re-leased to a successor company) and renewed three leases with an aggregate of approximately 28,000 square feet., 953401=        The income tax (provision) benefit for discontinued operations in fiscal 2014, fiscal 2013 and fiscal 2012 is net of the effect of recording valuation allowances on certain state deferred tax assets for state net operating losses of Imperial. The effect on the income tax provision for the valuation allowances in fiscal 2014, fiscal 2013 and fiscal 2012 were charges of $24, $93 and $44, respectively, less federal, 266151=As of November 30, 2014, 260987=        The net increase of approximately $0.5 million in rental revenue in fiscal 2014 as compared to fiscal 2013 reflects occupancy changes that resulted in: (a) an increase of approximately $1.8 million of rental revenue from leasing previously vacant space; (b) approximately $0.5 million in revenue from the Imperial Lease; and (c) an increase of approximately $0.1 million in revenue from work done for tenants; partially offset by (d) a decrease in rental revenue of approximately $1.9 million from leases that expired and were not renewed. The increase in rental revenue due to leasing previously vacant space includes an increase in rental revenue of approximately $0.9 million from the full building lease of the 228,000 square foot industrial building in the Lehigh Valley of Pennsylvania that was completed in fiscal 2012 and leased in the third quarter of fiscal 2013., 355669=        The above information in Management's Discussion and Analysis of Financial Condition and Results of Operations includes \"forward-looking statements\" within the meaning of Section 27A of the Securities Act of 1933, as amended, and Section 21E of the Exchange Act of 1934, as amended. These forward-looking statements include, but are not limited to, Griffin's expectations regarding the leasing of currently vacant space, completion and timing of construction on the Lehigh Valley industrial building under construction as of November 30, 2014, completion of the sale of approximately 29 acres of an approximately 45 acre land parcel in Griffin Center in Bloomfield, Connecticut under contract as of November 30, 2014, construction of additional facilities in the real estate business, the ability to obtain mortgage financing on Griffin Land's unleveraged properties and refinancing of Griffin's nonrecourse mortgage loan collateralized by three industrial buildings in Tradeport, Griffin's anticipated future liquidity, and other statements with the words \"believes,\" \"anticipates,\" \"plans,\" \"expects\" or similar expressions. Although Griffin believes that its plans, intentions and expectations reflected in such forward-looking statements are reasonable, it can give no assurance that such plans, intentions or expectations will be achieved. The forward-looking statements made herein are based on assumptions and estimates that, while considered reasonable by Griffin as of the date hereof, are inherently subject to significant business, economic, competitive and regulatory uncertainties and contingencies, many of which are beyond the control of Griffin. Griffin's actual results could differ materially from those anticipated in these forward-looking statements as a result of various important factors, including those set forth under the heading Item 1A. \"Risk Factors\" and elsewhere in this Annual Report., 39337=        A significant portion of Griffin Land's commercial and industrial development effort has been focused on Tradeport, a master-planned industrial park near Bradley International Airport and Interstate 91, located in Windsor and East Granby, Connecticut. Within Tradeport, Griffin Land built and currently owns approximately 1,466,000 square feet of warehouse and light manufacturing space in thirteen buildings, of which approximately 79% was leased as of November 30, 2014., 760090=        During fiscal 2014, Griffin did not transfer any assets or liabilities in or out of Levels 1 and 2. The following are Griffin's financial assets and liabilities carried at fair value and measured at fair value on a recurring basis:, 101845=        In fiscal 2013, Griffin Land acquired a 49 acre parcel of undeveloped land in Hanover Township, Pennsylvania, also in the Lehigh Valley, and in fiscal 2014 Griffin Land acquired an additional adjacent one acre of undeveloped land. The total cost of these parcels was approximately $7.6 million. The funds used to acquire the 49 acre parcel were principally the proceeds from the Dollar Tree Sale in fiscal 2012 that were used to acquire a replacement property as part of a like-kind exchange under Section 1031 of the Internal Revenue Code of 1986, as amended. In the latter part of fiscal 2014, Griffin Land started construction on an approximately 280,000 square foot industrial building, the first of two industrial buildings approved for this site that is expected to have a total of approximately 530,000 square feet of industrial space when fully developed. Subsequent to the end of fiscal 2014, Griffin Land entered into a five-year lease for approximately 196,000 square feet of the building being built. The tenant has an option to lease the balance of the building as specified under the terms of the lease. Griffin Land expects the completion of construction of this building and commencement of the lease to take place in the third quarter of fiscal 2015., 1155136=non-employee directors upon their reelection to the board of directors vest on the second anniversary from the date of grant. Stock options granted to employees vest in equal installments on the third, fourth and fifth anniversaries from the date of grant. None of the stock options outstanding at November 30, 2014 may be exercised as stock appreciation rights., 30138=        In fiscal 2012, Griffin Land entered into three new leases of industrial/warehouse space for an aggregate of approximately 151,000 square feet and two new leases of office/flex space for an aggregate of approximately 32,000 square feet. The new leases for industrial/warehouse space included a three-year lease (with two one-year renewal options) for an entire building, approximately 127,000 square feet in Tradeport. In connection with this new full building lease, Griffin Land entered into a lease termination agreement with an existing tenant that had leased approximately 42,000 square feet in, 670567=        Cash equivalents are composed of highly liquid investments and money market funds with an initial maturity of three months or less at the date of purchase. At November 30, 2014 and November 30, 2013, $16,433 and $175, respectively, of the cash and cash equivalents included on Griffin's consolidated balance sheets were held in cash equivalents., 251872=        The consolidated financial statements of Griffin Land & Nurseries, Inc. (\"Griffin\") reflect Griffin's real estate business which is conducted through its wholly-owned subsidiary, Griffin Land, LLC (\"Griffin Land\"), and Griffin's wholly-owned subsidiary in the landscape nursery business, Imperial Nurseries, Inc. (\"Imperial\"). Imperial's growing operations are reflected as a discontinued operation in Griffin's consolidated financial statements for all periods presented as a result of the sale (the \"Imperial Sale\") of Imperial's growing operations to Monrovia Connecticut LLC (\"Monrovia\") and the lease of Imperial's Connecticut farm to Monrovia (the \"Imperial Lease\", and together with the Imperial Sale, the \"Imperial Transaction\") that was effective January 8, 2014. In addition to the growing operations of Imperial, Griffin's results of discontinued operations also include the operating results and gain on the sale of the warehouse building that was owned by Griffin Land and sold in fiscal 2012., 297962=        Griffin's general and administrative expenses increased from approximately $6.8 million in fiscal 2012 to approximately $7.8 million in fiscal 2013. The increase of approximately $1.0 million in general and administrative expenses principally reflected an increase of approximately $0.5 million in expenses related to Griffin's non-qualified deferred compensation plan, an increase of approximately $0.2 million in real estate taxes on undeveloped land and smaller increases in other general and administrative expenses that aggregate to approximately $0.3 million. The higher expenses of the non-qualified deferred compensation plan reflected the effect on participant balances of higher stock market performance in fiscal 2013 as compared to fiscal 2012., 313022=        Net cash provided by financing activities was approximately $1.4 million in fiscal 2014 as compared to approximately $5.7 million in fiscal 2013. The net cash provided by financing activities in fiscal 2014 reflects net proceeds of approximately $4.5 million from the refinancing of two nonrecourse mortgage loans by Griffin Land and approximately $0.1 million received from the exercise of stock options; partially offset by approximately $2.0 million for payments of principal on Griffin Land's nonrecourse mortgages, payment of approximately $1.0 million for a dividend on Griffin's common stock that was declared in the fiscal 2013 fourth quarter and paid in the fiscal 2014 first quarter and approximately $0.1 million for payments of debt issuance costs. The net cash provided by financing activities in fiscal 2013 reflects proceeds of approximately $9.1 million from a nonrecourse mortgage loan and cash of approximately $0.1 million received from the exercise of stock options. These were partially offset by approximately $1.9 million for payments of principal on Griffin Land's nonrecourse mortgages, a dividend payment of approximately $1.0 million for the dividend on Griffin's common stock that was declared in the fiscal 2012 fourth quarter and paid in the fiscal 2013 first quarter, approximately $0.4 million for payment of debt issuance costs related to the new nonrecourse mortgage loan and Griffin's revolving credit agreement, both of which closed in fiscal 2013, and approximately $0.1 million related to the modification of a mortgage loan with First Niagara Bank (\"First Niagara\")., 675322=        In fiscal 2014, Griffin terminated its postretirement benefit program (see Note 10). Griffin had accounted for postretirement benefits in accordance with FASB ASC 715-10, \"Compensation\u0097Retirement Benefits\" (\"ASC 715-10\"). This guidance requires an employer to recognize the overfunded or underfunded status of a defined benefit postretirement plan (other than a multiemployer plan) as an asset or liability in its statement of financial position and to recognize changes in that funded status in the year in which the changes occur through other comprehensive income. This guidance also requires an employer to measure the funded status of a plan as of the date of its year-end statement of financial position, with limited exceptions., 295956=        Operating expenses of rental properties increased from approximately $6.7 million in fiscal 2012 to approximately $7.5 million in fiscal 2013. The increase of approximately $0.8 million in operating expenses of rental properties principally reflected an increase of approximately $0.3 million of snow removal expenses and increases of approximately $0.1 million in both real estate taxes on rental properties and repair and maintenance expenses. The increase in snow removal expenses reflected the effect of relatively mild winter weather in fiscal 2012, when there was a minimal amount of snowfall, as compared to a higher amount of snowfall in fiscal 2013., 951473=        In fiscal 2014, Griffin decreased its expected realization of the tax benefit related to its Connecticut state net operating loss carryforwards and Connecticut state other temporary differences. This decrease is based on management's current projections of taxable income in the state of Connecticut in future years that would generate income taxes in excess of capital based taxes. A charge of approximately $375 is reflected in the fiscal 2014 tax provision for state taxes to reflect the expected lower realization of certain state tax benefits., 698464=        In May 2014, the FASB issued Accounting Standards Update No. 2014-09, \"Revenue from Contracts with Customers,\" which outlines a single comprehensive model for entities to use in accounting for revenue arising from contracts with customers and supersedes most current revenue recognition guidance, including industry specific guidance. This standard requires an entity to recognize the amount of revenue to which it expects to be entitled for the transfer of promised goods or services to customers. Additionally, the update requires improved disclosures to help users of financial statements better understand the nature, amount, timing and uncertainty of revenue that is recognized. The update permits the use of either the retrospective or cumulative effect transition method. This update will be effective for Griffin in fiscal 2018 and early adoption is not permitted. Certain aspects of this new standard may affect revenue recognition of Griffin Land. Griffin is evaluating the impact that the application of this update will have on its consolidated financial statements., 677743=        There were no impairment losses recorded in the fiscal years ended November 30, 2014, November 30, 2013 and December 1, 2012., 1074589=        Griffin accounted for postretirement benefits in accordance with ASC 715-10, which requires recognition of the funded status on Griffin's consolidated balance sheet of its postretirement benefits program. The effect of ASC 715-10 in fiscal 2013 was a decrease in other liabilities of $118 and a decrease of $68, after tax, in accumulated other comprehensive loss. The effect in fiscal 2012 was an increase in other liabilities of $64 and an increase of $48, after tax, in accumulated other comprehensive loss., 172865=1936 Blue Hills Avenue, Windsor, CT, 45175=December 1, 2012, 724568=        Imperial's pretax income in fiscal 2014 includes $451 for the reclassification of actuarial gains related to Griffin's postretirement benefits program from other comprehensive income into pretax income as a result of the termination of Griffin's postretirement benefits program (see Note 10)., 211943=        On February 6, 2015, the number of record holders of common stock of Griffin was approximately 197 which does not include beneficial owners whose shares are held of record in the names of brokers or nominees. The closing market price as quoted on The NASDAQ Stock Market LLC on such date was $31.62 per share., 274424=        Operating expenses of rental properties increased from approximately $7.5 million in fiscal 2013 to approximately $7.8 million in fiscal 2014. The net increase of approximately $0.3 million principally reflects an increase of approximately $0.2 million in property maintenance expenses, principally snow removal, and increases in real estate taxes and utility expenses aggregating approximately $0.2 million in fiscal 2014 as compared to fiscal 2013, partially offset by a net decrease of approximately $0.1 million in all other expenses. The increase in snow removal expenses reflected more severe winter weather in fiscal 2014 as compared to fiscal 2013. The increase in real estate taxes principally reflects real estate taxes being fully assessed on the 228,000 square foot industrial building in the Lehigh Valley that was completed in fiscal 2012 and fully leased in fiscal 2013., 3545=Commission file number 1-12879, 272572=the costs of the required road construction are incurred, which is expected to be mostly by the second quarter of fiscal 2015. In addition to the revenue recognized from the Windsor Land Sale, property sales revenue in fiscal 2014 also included approximately $0.6 million from the sale of a land parcel that was once part of Imperial's growing operations in Connecticut but was not part of the Imperial Lease., 281659=        The loss on debt extinguishment in fiscal 2014 was related to the refinancing of two nonrecourse mortgage loans by two of Griffin's subsidiaries with Farm Bureau Life Insurance Company (\"Farm Bureau\"). The mortgage loans that were refinanced had original maturity dates of April 1, 2016 and October 1, 2017 and interest rates of 8.13% and 7.0%, respectively. The refinancings generated additional mortgage proceeds, reduced the interest rates to 5.09% for both mortgage loans and extended the maturities of both mortgage loans for fifteen years from the date of the refinancing. The two loan refinancings with Farm Bureau were also accounted for as debt extinguishments and new financings. As such, all deferred costs related to the existing mortgage loans with Farm Bureau are reflected as a loss on debt extinguishment in Griffin's fiscal 2014 consolidated statement of operations., 26039=        As of November 30, 2014, Griffin Land owned thirty one buildings comprising approximately 2.8 million square feet. Approximately 84% of this square footage is industrial/warehouse space, with the balance principally being office/flex space. As of November 30, 2014, approximately 84% of Griffin Land's industrial/warehouse space was leased and approximately 93% of Griffin Land's office/flex space was leased. As detailed in \"Item 2. Properties\" below, Griffin Land uses nonrecourse mortgages to finance some of its real estate development activities, and as of November 30, 2014, approximately $70.2 million was outstanding under such loans. In fiscal 2014, Griffin Land's rental revenue, less operating expenses of rental properties, was approximately $12.8 million, while debt service on Griffin Land's nonrecourse mortgages was approximately $6.0 million., 128156=        Centaur Media plc (\"Centaur Media\") is a publicly traded company listed on the London Stock Exchange. As of November 30, 2014, Griffin held 1,952,462 shares of Centaur Media and accounts for its investment in Centaur Media as an available-for-sale security. Accordingly, changes in the fair value of Griffin's investment in Centaur Media, including both changes in the stock price and changes in the foreign currency exchange rate, are not included in Griffin's net income but are included in Griffin's other comprehensive income. In fiscal 2014, Griffin sold 500,000 shares of its Centaur Media common stock for total cash proceeds of approximately $566,000., 8162=         Indicate by check mark whether the registrant (1) has filed all reports required to be filed by Section 13 or 15(d) of the Securities Exchange Act of 1934 during the preceding 12 months (or for such shorter period that the registrant was required to file such reports), and (2) has been subject to such filing requirements for the past 90 days. Yes ý    No o, 701133=        Effective January 8, 2014, in accordance with the terms of the Imperial Sale, Imperial sold its inventory and certain assets for $732 in cash and a non-interest bearing note receivable of $4,250 (the \"Promissory Note\"). Net cash of $732 was received from Monrovia in fiscal 2014 and Griffin paid $563 in severance and other expenses. The Promissory Note is due in two installments: $2,750 was due and paid on June 1, 2014 and $1,500 is due on June 1, 2015. The Promissory Note was discounted at 7% to its present value of $4,036 at inception and is secured by an irrevocable letter of credit. Under the terms of the Imperial Sale, Griffin and Imperial agreed to indemnify Monrovia for any potential environmental liabilities relating to periods prior to the effective date of the Imperial Sale and also agreed to certain non-competition restrictions for a four-year period., 1067797=        The Webster Credit Line is collateralized by Griffin Land's properties in Griffin Center South, aggregating approximately 235,000 square feet, and an approximately 48,000 square foot single-story office building in Griffin Center. These are the same properties that collateralized the Doral Credit Line. There were no borrowings under either the Webster Credit Line or the Doral Credit Line in fiscal 2014, fiscal 2013 or fiscal 2012., 167677=        As of November 30, 2014, Griffin Land owned thirty-one buildings, comprised of nineteen industrial/warehouse buildings, eleven office/flex buildings and a small restaurant building. A listing of those facilities is as follows:, 306907=2013, including cash of approximately $2.4 million received in fiscal 2014 from the new tenant in the approximately 138,000 square foot Tradeport building, that will be recognized as rental revenue over the lease term. The cash received was used for Griffin Land's investment in tenant improvements to the approximately 138,000 square foot Tradeport building, included in additions to Griffin's real estate assets (see below). In addition, the increase in cash provided by operating activities of continuing operations in fiscal 2014 as compared to fiscal 2013 reflects higher income from continuing operations, after adjustments for gains on property sales and gains on sales of investments., 273052=        Revenue from property sales in fiscal 2013 included: (a) approximately $2.7 million from the initial recognition of revenue from the Windsor Land Sale; (b) approximately $2.5 million from the recognition of revenue from the sale of approximately 93 acres of undeveloped land in Tradeport to Dollar Tree Distribution, Inc. (the \"Dollar Tree Sale\") that closed in fiscal 2012; and (c) approximately $0.3 million from two sales of small parcels of undeveloped land. Under the terms of the Dollar Tree Sale, Griffin Land was required to construct a sewer line to service the property sold. Accordingly, because of Griffin Land's continuing involvement with the land that was sold, Griffin Land accounted for the Dollar Tree Sale using the percentage of completion method, under which the revenue and the gain on sale were recognized as the total costs related to the property sale were incurred. All of the revenue from the Dollar Tree Sale was recognized as of the end of fiscal 2013 as the required construction of the sewer line was completed. Property sales occur periodically, and changes in revenue from year to year from those transactions may not be indicative of any trends in Griffin's real estate business., 1056895=        The GCD Mortgage Loan and the TD Mortgage Loan are cross-collateralized and cross-defaulted with each other. The loans may not be voluntarily prepaid for seven years; thereafter, any prepayment would require a prepayment fee and the simultaneous prepayment of both loans. Griffin reported $51 for the write-off of all deferred costs related to the two mortgages refinanced with Farm Bureau as a loss on debt extinguishment on Griffin's fiscal 2014 consolidated statement of operations., 122479=        In fiscal 2006, Griffin Land completed the infrastructure for a fifty lot residential subdivision in Suffield, Connecticut called Stratton Farms. Griffin Land sold twenty-five residential lots in Stratton Farms to a local homebuilder in fiscal 2006 and fiscal 2007. In fiscal 2010, Griffin Land entered into an agreement with a privately owned regional homebuilder under which in exchange for a payment of $100,000, the homebuilder obtained an option to purchase the remaining twenty-five residential lots of Stratton Farms. The option agreement terminated after four lots were sold. Subsequently, Griffin Land sold one Stratton Farms residential lot in fiscal 2013. As of November 30, 2014, Griffin Land held twenty Stratton Farms residential lots. The book value for Griffin Land's Stratton Farms holdings was approximately $1.1 million at November 30, 2014., 35480=        Also in fiscal 2012, Griffin Land sold approximately 93 acres of undeveloped land in Tradeport that Griffin Land had held for an extended time period to Dollar Tree Distribution, Inc. for cash proceeds of $7.0 million (the \"Dollar Tree Sale\"). Because Griffin Land was required, under the terms of the Dollar Tree Sale, to construct a sewer line to service the land sold, the Dollar Tree Sale was accounted for under the percentage of completion method, under which the revenue and gain on sale were recognized as the total costs related to the property sold were incurred. The proceeds from the Dollar Tree Sale were placed in escrow for the purchase of a replacement property under a Section 1031 like-kind exchange. On December 28, 2012, Griffin Land closed on the purchase of an approximately 49 acre parcel of undeveloped land in the Lehigh Valley of Pennsylvania using the proceeds from the Dollar Tree Sale that had been held in escrow to complete the Section 1031, 1074143=        As a result of the Imperial Sale (see Note 2) prior to the termination of the postretirement benefit program, the liability for postretirement benefits was reduced from $332 at November 30, 2013 to $23 in the 2014 first quarter. A curtailment gain of $309 is included in the determination of the loss on the Imperial Sale., 32575=        In fiscal 2014, Griffin Land completed one land sale for approximately $562,000. In fiscal 2013, Griffin Land completed three land sales, the principal one of which was the sale of approximately 90 acres of undeveloped land in Windsor, Connecticut (the \"Windsor Land Sale\") for cash proceeds of approximately $9.0 million, before transaction expenses. The land sold under the Windsor Land Sale is part of an approximately 253 acre parcel of undeveloped land that had been held by Griffin Land for an extended time period. Under the terms of the Windsor Land Sale, Griffin Land and the buyer are constructing roadways connecting the land parcel that was sold to existing town roads. The roads being built also provide access to the remaining acreage in Griffin Land's land parcel. As a result of Griffin Land's continuing involvement with the land sold, the Windsor Land Sale is being accounted for under the percentage of completion method, under which the revenue and gain on sale are recognized as the total costs related to the property sold are incurred. At the closing of the Windsor Land Sale, the cash proceeds were placed in escrow for the potential purchase of a replacement property in a like-kind exchange under Section 1031 of the Internal Revenue Code of 1986, as amended. Griffin Land did not acquire a replacement property, therefore, the cash proceeds that were held in escrow were returned to Griffin in fiscal 2014. Griffin Land also closed on two smaller land sales in fiscal 2013 for aggregate net cash proceeds of approximately $0.3 million., 1076281=        Changes in the program's benefit obligation for the fiscal years ended November 30, 2014 and November 30, 2013 are as follows:, 280211=        Griffin's loss on debt extinguishment decreased from approximately $0.3 million in fiscal 2013 to approximately $0.1 million in fiscal 2014. In fiscal 2013, Griffin incurred a loss on debt extinguishment related to a loan modification agreement on a mortgage loan with First Niagara Bank (\"First Niagara\") due in January 2020 (the \"2020 First Niagara Mortgage\"). On April 1, 2013, Griffin Land and First Niagara entered into an agreement that reduced the interest rate on the 2020 First Niagara Mortgage from a fixed rate of 5.25% to a variable rate of the one month LIBOR rate plus 2.5%. Because the difference between the present value of future payments under the existing loan was greater than 10% of the present value of the payments under the modified loan, the loan modification was accounted for as a debt extinguishment. As such, all deferred costs related to the existing 2020 First Niagara Mortgage (approximately $0.2 million) and the fee paid to First Niagara for the loan modification (approximately $0.1 million) are reflected as a loss on debt extinguishment. Concurrent with that agreement, Griffin also entered into an interest rate swap agreement with First Niagara to fix the interest rate on the 2020 First Niagara Mortgage at 3.91% for the remainder of the loan term., 567883=Balance at November 30, 2014, 264900=As of November 30, 2013, 316154=        On December 31, 2014, two subsidiaries of Griffin closed on a new mortgage (\"the 2025 First Niagara Mortgage\") for $21.6 million with First Niagara. The 2025 First Niagara Mortgage refinanced the existing mortgage loan with First Niagara on the approximately 228,000 square foot industrial building in Lehigh Valley Tradeport and added the other approximately 303,000 square foot Lehigh Valley Tradeport industrial building to the collateral. The existing mortgage loan with First Niagara had a maturity date of September 1, 2023 and a floating rate of the one month LIBOR rate plus 1.95%. Griffin had entered into an interest rates swap agreement with First Niagara to fix the rate on that loan at 4.79%. Griffin received net cash proceeds from the 2025 First Niagara Mortgage of approximately $10.9 million at closing (before transaction costs), reflecting approximately $8.9 million used to refinance the existing mortgage loan with First Niagara Mortgage and $1.85 million that will not be advanced by First Niagara until a portion of the vacant space in the approximately 303,000 square foot building is leased. The 2025 First Niagara Mortgage has a ten-year term with monthly payments based on a twenty-five year amortization schedule. The interest rate for the 2025 First Niagara Mortgage is a floating rate of the one month LIBOR rate plus 1.95%. At the time the 2025 First Niagara Mortgage closed, Griffin entered into an interest rate swap agreement, that combined with the existing interest rate swap agreement with First Niagara, effectively fixes the rate of the 2025 First Niagara Mortgage at 4.43% at over the mortgage loan's ten-year term., 24166=        The greater Hartford industrial market had been slow in recent years, but experienced some recovery in 2014. A national real estate services company reported that the overall vacancy rate in the greater Hartford industrial market decreased from 13.3% at the end of 2013 to 12.3% at the end of 2014. Market activity for office/flex space in the north submarket of Hartford was slow in 2014, with overall vacancy, availability and asking rates remaining relatively flat. Griffin Land believes that it benefits from its reputation as a stable landlord with sufficient resources to meet its obligations and deliver space to tenants timely and in accordance with the terms of their lease agreements. The, 663775=        Imperial was engaged in growing landscape nursery plants in containers for sale to independent retail garden centers and rewholesalers, whose main customers are landscape contractors. Imperial's operations are reflected in the accompanying consolidated financial statements as a discontinued operation due to the sale, effective January 8, 2014, of its inventory and certain of its assets (the \"Imperial Sale\") to Monrovia Connecticut LLC (\"Monrovia\"), a subsidiary of Monrovia Nursery Company (see Note 2). Concurrent with the Imperial Sale, a subsidiary of Griffin and Imperial entered into a long-term lease with Monrovia for Imperial's Connecticut production nursery. As the growing operations of Imperial are reflected as a discontinued operation in Griffin's consolidated financial statements, Griffin's continuing operations presented in the accompanying financial statements solely reflect its real estate business and, therefore, industry segment information is not presented. Accordingly, certain prior period amounts in Griffin's consolidated financial statements have been reclassified to conform to the current presentation which better reflects Griffin's real estate business, including presentation of an unclassified balance sheet consistent with real estate industry practice. Certain parts of Imperial's prior year results, such as rental revenue and expense related to the leasing of Imperial's Florida farm to another grower and certain expenses related to the property and equipment of Imperial's Connecticut farm, which continues to be owned by Griffin and leased to Monrovia, are included in Griffin's continuing operations. All intercompany transactions have been eliminated., 755161=        On January 31, 2012, Griffin Land closed on the sale of its Manchester, Connecticut warehouse to its full building tenant in that building, an affiliate of Raymour & Flanigan (\"Raymour\"). Accordingly, the gain on the sale of the Manchester warehouse and the operating results of the Manchester warehouse are reflected as a discontinued operation in Griffin's fiscal 2012 consolidated statement of operations. Net cash proceeds from the sale, after selling expenses of $438 paid out of proceeds at closing and $25 paid separately, were $15,537, and a pretax gain of $2,886 is included in the results of discontinued operations in fiscal 2012. Upon completion of the sale, Griffin deposited the cash of $15,562 received from the sale at closing into an escrow account for the potential purchase of a replacement property under a Section 1031 like-kind exchange. As Griffin Land did not identify a replacement property within the time frame required under the tax rules and regulations governing a Section 1031 like-kind exchange, in the second quarter of fiscal 2012, the cash being held in escrow was released to Griffin Land. Rental revenue and pretax income from the operations of the Manchester warehouse in fiscal 2012 prior to its sale were $273 and $221, respectively., 699671=        In July 2013, the FASB issued Accounting Standards Update No. 2013-11, \"Presentation of an Unrecognized Tax Benefit When a Net Operating Loss Carryforward, a Similar Tax Loss, or a Tax Credit Carryforward Exists,\" which provides guidance on the financial statement presentation of an unrecognized tax benefit when a net operating loss carryforward, a similar tax loss, or a tax credit carryforward exists. Specifically, this update requires that an unrecognized tax benefit, or a portion of an unrecognized tax benefit, be presented in the financial statements as a reduction to a deferred tax asset for a net operating loss carryforward, a similar tax loss, or a tax credit carryforward, with certain exceptions. This update was effective for Griffin in the 2014 second quarter. The adoption of this guidance did not have an impact on Griffin's financial position or results of operations., 1093507=        Griffin's liability for postretirement benefits, included in other liabilities, as of November 30, 2013 was attributed to the following:, 98341=        In fiscal 2010, Griffin Land completed its first acquisition of property outside of the Hartford, Connecticut area, when it acquired a fully leased approximately 120,000 square foot industrial building (the \"Olympus Building\") in Breinigsville, Pennsylvania, which is located in the Lehigh Valley. Subsequent to the purchase of the Olympus Building, Griffin Land and the tenant in that building agreed to a nine year extension of the lease, through 2025. Also in fiscal 2010, Griffin Land acquired approximately 51 acres of undeveloped land in Lower Nazareth, Pennsylvania, a major industrial area of the Lehigh Valley, which Griffin Land named Lehigh Valley Tradeport. The land acquired had approvals for the development of two industrial buildings totaling approximately 530,000 square feet. In fiscal 2012, Griffin Land completed construction, on speculation, of an approximately 228,000 square foot industrial building, the first of two buildings built in Lehigh Valley Tradeport. In fiscal 2013, Griffin Land entered into a five-year full building lease of this building. In fiscal 2014, Griffin Land completed construction, also on speculation, of an approximately 303,000 square foot industrial building, the second of two buildings in Lehigh Valley Tradeport. In the fiscal 2014 fourth quarter, Griffin Land entered into a five-year lease of approximately 201,000 square feet of the most recently completed building in Lehigh Valley Tradeport. Tenant occupancy and lease commencement is expected in the fiscal 2015 first quarter upon completion of tenant improvements. As of November 30, 2014, Griffin Land invested approximately $13.2 million in the development of this new building, not including the land and leasing related costs., 127180=        Imperial's Florida farm is also being leased to another private company grower of landscape nursery plants. Imperial shut down its growing operations on its Florida farm in 2009 and entered into a six-year lease of that facility. The annual rent payable is $600,000 and that lease is scheduled to expire on July 31, 2015. The tenant has an option to purchase the facility any time during the lease term., 58290=        Griffin Land has received favorable indications as to the renewal of much of the Tradeport space under leases scheduled to expire in fiscal 2015 as well as receiving favorable indications as to the leasing of some of the vacant space in Tradeport as of November 30, 2014. Subsequent to November 30, 2014, Griffin Land entered into a ten-year lease for approximately 42,000 square feet of previously vacant space in Tradeport. There is no guarantee that such favorable indications will result in the renewal of leases scheduled to expire in fiscal 2015 or in the additional leasing of space that was vacant as of November 30, 2014., 103475=        Griffin Land owns a 31,000 square foot warehouse building (fully leased) in Bloomfield, Connecticut on an approximately 5 acre site that is part of an approximately 253 acre land parcel known as Phoenix Crossing, located partly in Bloomfield and partly in Windsor, Connecticut. In fiscal 2013, Griffin Land sold approximately 90 acres of the Phoenix Crossing land in the Windsor Land Sale. Griffin Land owns the remaining approximately 159 acres of undeveloped land in Phoenix Crossing which is zoned for industrial and commercial development., 354372=        As of November 30, 2014, Griffin had cash and cash equivalents of approximately $17.1 million. Management believes that its cash and cash equivalents as of November 30, 2014, cash generated from operations, proceeds from new mortgage loans and borrowing capacity under its $12.5 million revolving credit agreement with Webster Bank will be sufficient to meet Griffin's working capital requirements, the continued investment in Griffin's real estate assets, including completion of the Lehigh Valley industrial building under construction as of November 30, 2014 and the payment of dividends on its common stock, when and if declared by the Board of Directors. Griffin may also continue to seek additional financing secured by nonrecourse mortgages on its properties. Griffin Land's real estate portfolio currently includes five buildings located in Connecticut aggregating approximately 411,000 square feet that are not mortgaged., 1027384=        At November 30, 2014, Griffin had federal net operating loss carryforwards of approximately $9,019 with expirations ranging from sixteen to twenty years and state net operating loss carryforwards of approximately $20,437, principally in Connecticut, with expirations ranging from eight to twenty years. Management has determined that a valuation allowance is required for net operating loss carryforwards in certain states (other than Connecticut) related to Imperial. Realization of the tax benefits related to the Connecticut state net operating loss carryforwards, which are not subject to valuation allowances, and the state effective tax rates at which those benefits will be realized is dependent upon future results of operations. Differences between forecasted and actual future operating results could adversely impact Griffin's ability to realize tax benefits from Connecticut state net operating losses. Therefore, the deferred tax assets relating to Connecticut state net operating loss carryforwards could be reduced in the future if estimates of future taxable income are reduced. Griffin has evaluated the likelihood that it will realize the benefits of its deferred tax assets. Based on a, 360714=        Griffin does not have foreign currency exposure in operations. However, Griffin does have an investment in a public company, Centaur Media plc, based in the United Kingdom. The ultimate liquidation of that investment and conversion of proceeds into United States currency is subject to future foreign currency exchange rates involving the UK pound sterling. A 10% decrease in the foreign currency exchange rate at November 30, 2014 would have resulted in an approximately $0.2 million reduction of the fair value of that investment., 22647=        Through fiscal 2009, all of Griffin Land's real estate assets, including buildings and undeveloped land, were located in the north submarket of Hartford, Connecticut. In fiscal 2010, Griffin Land started the expansion of its real estate holdings to areas outside of Hartford by purchasing an industrial building and undeveloped land in the Lehigh Valley of Pennsylvania (see Lehigh Valley on page 9). Griffin Land expects to continue to seek to acquire and develop properties that are consistent with its core strategy of developing and leasing industrial and commercial properties. Griffin Land expects that most of such potential acquisitions of either undeveloped land or land and buildings will likely be located outside of the Hartford area., 13419=         As of February 6, 2015, 5,149,574 shares of common stock were outstanding., 79441=        As of November 30, 2014, approximately $7.0 million was invested (net book value) in Griffin Land's buildings in Griffin Center South and approximately $0.4 million was invested by Griffin Land in the undeveloped land there. As of November 30, 2014, Griffin Land's nine properties in Griffin Center South are included as collateral under Griffin's $12.5 million revolving line of credit. There were no borrowings under the revolving line of credit as of November 30, 2014. Griffin Land believes that the approximately 66 acres of undeveloped land remaining that it owns in Griffin Center South is sufficient to build at least two additional buildings aggregating approximately 175,000 square feet., 321620=        Griffin's payments (including principal and interest) under contractual obligations as of November 30, 2014 are as follows:, 279203=        Griffin's interest expense decreased from approximately $3.8 million in fiscal 2013 to approximately $3.5 million in fiscal 2014. The decrease of approximately $0.3 million in fiscal 2014 as compared to fiscal 2013 is principally due to: (a) approximately $0.6 million of interest capitalized in fiscal 2014 as compared to approximately $0.1 million of interest capitalized in fiscal 2013; and (b) a decrease of approximately $0.1 million of interest expense on mortgage loans outstanding in both periods, due to the payment of principal; partially offset by (c) an increase of approximately $0.3 million of interest expense related to a full year's interest in fiscal 2014 from a nonrecourse mortgage loan on the 228,000 square foot industrial building in the Lehigh Valley that was outstanding for only one fiscal quarter in fiscal 2013., 41239=        In fiscal 2014, Griffin Land leased approximately 216,000 square feet of previously vacant space in Tradeport and renewed two leases for a total of approximately 10,000 square feet, while leases totaling approximately 43,000 square feet expired and were not renewed. As of November 30, 2014, approximately $55.4 million was invested (net book value) in buildings owned by Griffin Land that are located in Tradeport and approximately $4.4 million was invested (net book value) by Griffin Land in the undeveloped land there. As of November 30, 2014, ten of Griffin Land's Tradeport buildings were mortgaged for an aggregate of approximately $43.3 million. Two Tradeport buildings built in fiscal 2007 and an older Tradeport building, aggregating, for the three buildings, approximately 373,000 square feet, are currently not mortgaged. A summary of Griffin Land's square footage owned and leased in, 1065953=taxes of $100 and $776, respectively, on its interest rate swap agreements. In fiscal 2013, Griffin recognized a net gain, included in other comprehensive income, before taxes of $969 on its interest rate swap agreements., 31261=that building, but had previously vacated its space and was seeking to sublease. Griffin Land received $325,000 in connection with the early termination of that lease, which was scheduled to expire in 2014. In fiscal 2012, Griffin Land renewed and extended several leases aggregating approximately 87,000 square feet of industrial space and approximately 70,000 square feet of office/flex space. In fiscal 2012, leases aggregating approximately 98,000 square feet expired and were not renewed. Of such space, approximately 85,000 square feet was industrial space (including the approximately 42,000 square foot lease that was terminated early and is now subject to a new, full building lease) and approximately 13,000 square feet was office/flex space., 726701=        The pretax loss from the Imperial Sale in fiscal 2014 was as follows:, 1061171=        On April 1, 2013, a subsidiary of Griffin entered into a modification agreement for its 5.25% nonrecourse mortgage loan with First Niagara due January 27, 2020 (the \"2020 First Niagara Mortgage\"). The modification agreement changed the interest rate of the 2020 First Niagara Mortgage from a fixed rate of 5.25% to a variable rate of the one month LIBOR rate plus 2.5%. The loan modification did not change the loan's collateral or maturity date. Griffin Land paid $70 to First Niagara for the loan modification, plus transaction costs. Because the difference between the present values of the future payments under the existing loan and the modified loan was greater than 10%, the loan modification was accounted for as a debt extinguishment in fiscal 2013. As such, all deferred costs related to the 2020 First Niagara Mortgage ($216) and the fee paid to First Niagara for the modification agreement were reflected as a loss on debt extinguishment on Griffin's fiscal 2013 consolidated statement of operations. Concurrent with the completion of the loan modification agreement, Griffin Land entered into an interest rate swap agreement with First Niagara to fix the interest rate on the 2020 First Niagara Mortgage at 3.91% for the duration of the loan., 1152775=        The Griffin Land & Nurseries, Inc. 2009 Stock Option Plan (the \"2009 Stock Option Plan\") makes available options to purchase 386,926 shares of Griffin common stock, including 161,926 options to purchase the 161,926 shares that were available for issuance under Griffin's prior stock option plan. The Compensation Committee of Griffin's Board of Directors administers the 2009 Stock Option Plan. Options granted under the 2009 Stock Option Plan may be either incentive stock options or non-qualified stock options granted at fair market value on the date approved by Griffin's Compensation Committee. Vesting of all of Griffin's stock options is solely based upon service requirements and does not contain market or performance conditions., 303436=        Griffin's effective tax rate was 34.2% in fiscal 2013 as compared to an effective tax rate of 57.9% in fiscal 2012. The lower effective tax rate in fiscal 2013 as compared to fiscal 2012 reflected the impact of permanent differences between pretax income for book purposes and tax purposes being greater in fiscal 2012 than fiscal 2013 due to the lower amount of pretax income in fiscal 2012 as compared to fiscal 2013., 206196=2014, 359715=        For variable rate debt, changes in interest rates generally do not impact the fair market value of the debt instrument, but do affect future earnings and cash flows. As of November 30, 2014, Griffin had a total of approximately $37.7 million of variable rate debt outstanding, for which Griffin has entered into interest rate swap agreements which effectively fix the interest rate on that debt. There were no other variable rate borrowings outstanding as of November 30, 2014., 60489=        In fiscal 2014, a lease for approximately 16,000 square feet in Griffin Center expired and was not renewed, and a tenant that leases approximately 29,000 square feet in one of Griffin Land's multi-story office buildings exercised its early termination option that will terminate its lease in fiscal 2015, two years earlier than the original lease expiration date. Currently there are approximately 207 acres of undeveloped land in Griffin Center owned by Griffin Land. In the fiscal 2014 third quarter, Griffin Land entered into an agreement to sell approximately 29 acres of an approximately 45 acre land parcel of the undeveloped land in Griffin Center for a purchase price of a minimum of $3.25 million, subject, 259271=        Griffin's discontinued operations in fiscal 2014 and fiscal 2013 reflect the results of the growing operations of Imperial's landscape nursery business. The results from discontinued operations in fiscal 2012 reflect Imperial's landscape nursery growing operations along with the results of operations and gain on the sale of Griffin Land's 308,000 square foot warehouse building in January 2012. The loss from discontinued operations in fiscal 2013 principally reflects a pretax charge of $10.4 million to reduce the carrying value of Imperial's inventories to its fair value, which was the net realizable value based on the terms of the Imperial Sale., 897255=        Griffin's investment in the common stock of Centaur Media is accounted for as an available-for-sale security under ASC 320-10. Accordingly, changes in the fair value of Centaur Media, reflecting both changes in the stock price and changes in the foreign currency exchange rate, are included, net of income taxes, in accumulated other comprehensive income (see Note 11). Griffin's investment income includes dividend income from Centaur Media of $82, $110 and $188 in fiscal 2014, fiscal 2013 and fiscal 2012, respectively., 303969=        The loss from discontinued operations, net of tax, of approximately $7.7 million in fiscal 2013, is entirely from the growing operations of the landscape nursery business. The income from discontinued operations, net of tax, of approximately $0.7 million in fiscal 2012 principally reflected the gain, net of tax, of approximately $1.5 million on the sale of an approximately 308,000 square foot warehouse building (the \"Manchester Warehouse\") and income from operations, net of tax, before the Manchester Warehouse was sold, partially offset by a loss, net of tax, from the growing operations of the landscape nursery business of approximately $0.9 million. The higher loss from the growing operations of the landscape nursery business in fiscal 2013 as compared to fiscal 2012 principally reflected a pretax charge of $10.4 million incurred in fiscal 2013 to reduce inventory that was sold in the Imperial Sale to fair value, which was the net realizable value based on the terms of the Imperial Sale., 1055464=        Also on June 6, 2014, a subsidiary of Griffin completed the refinancing of its nonrecourse mortgage loan (the \"TD Mortgage Loan\") with Farm Bureau that was due October 1, 2017. The TD Mortgage Loan is collateralized by an approximately 100,000 square foot industrial building and a 57,000 square foot industrial building, both located in Windsor, Connecticut. At the time of the refinancing, the TD Mortgage Loan had a balance of $5,632 and an interest rate of 7.0%. The refinancing increased the loan amount to $6,632, reduced the interest rate to 5.09% and extended the loan term to fifteen years from the time of the refinancing, with payments based on a fifteen year amortization schedule. The mortgage loan proceeds of $1,000 from the refinancing of the TD Mortgage Loan are being held in escrow. The escrowed funds will be released to Griffin if the approximately 57,000 square foot industrial building, which is expected to become vacant after the current short-term lease of that building expires, is re-leased under terms agreed upon with Farm Bureau. If a replacement lease reflecting the rental terms agreed upon with Farm Bureau is not obtained, the proceeds being held in escrow are required to be used to make a partial prepayment, without penalty, on the TD Mortgage Loan., 971058=        The differences between the income tax benefit (provision) at the United States statutory income tax rates and the actual income tax benefit (provision) on continuing operations for fiscal 2014, fiscal 2013 and fiscal 2012 are as follows:, 214407=        The following graph compares the total percentage changes in the cumulative total stockholder return (assuming the reinvestment of dividends) on Griffin's Common Stock with the cumulative total return of the Russell 2000 Index from November 28, 2009 to November 30, 2014. It is assumed in the graph that the value of each investment was $100 at November 28, 2009. Griffin is not aware of any other company that substantially participated in both the landscape nursery and real estate businesses during that period, and would therefore be suitable for comparison to Griffin as a \"peer issuer\" within Griffin's lines of business., 81367=        As of November 30, 2014, approximately 227,000 square feet of space in the Griffin Center South buildings owned by Griffin Land was leased, comprising 97% of Griffin Land's total space in Griffin Center South. In the fiscal 2014 fourth quarter, Griffin Land received notice from a tenant that has a full building lease for approximately 40,000 square feet in Griffin Center South that it was exercising its early termination option and will terminate its lease in fiscal 2016 (three years earlier than the original lease expiration date). In accordance with the lease terms, Griffin Land received approximately $557,000 from the tenant when the early termination notice was rendered. A summary of Griffin Land's square footage owned and leased in Griffin Center South at the end of each of the past three fiscal years and leases in Griffin Center South scheduled to expire during each of the next three fiscal years are as follows:, 291972=        The increase in square footage leased as of November 30, 2013, as compared to December 1, 2012, reflected a new full building lease in fiscal 2013 for the approximately 228,000 square foot Lehigh Valley industrial building and the leasing of several other previously vacant spaces aggregating approximately 81,000 square feet (approximately 50,000 square feet of office/flex space and approximately 31,000 square feet of industrial/warehouse space) in fiscal 2013, partially offset by leases aggregating approximately 192,000 square feet that expired in fiscal 2013 and were not renewed or terminated early. The greater Hartford industrial market had been slow, but experienced some recovery in 2012 and 2013. Market activity for office/flex space in the north submarket of Hartford was slow in 2013, with overall vacancy, availability and asking rates remaining relatively flat. Griffin Land believes that it was able to secure new leases for office/flex space because of its reputation as a stable, well capitalized landlord that maintains its properties to a high standard, meets its obligations and can deliver space to tenants timely and in accordance with the tenant's requirements and budget., 46419=November 30, 2013, 512420=GRIFFIN LAND & NURSERIES, INC. Consolidated Statements of Changes in Stockholders' Equity For the Fiscal Years Ended November 30, 2014, November 30, 2013 and December 1, 2012 (dollars in thousands), 1068345=        The aggregate book value of land and buildings that are collateral for the revolving line of credit was approximately $10,097 at November 30, 2014., 665859=        Through the fiscal year ended November 30, 2013 (\"fiscal 2013\"), Griffin reported on a 52-53 week fiscal year that ended on the Saturday nearest November 30 and included four quarters of 13 weeks each. Starting in the fiscal year ended November 30, 2014 (\"fiscal 2014\"), Griffin is reporting on a twelve month fiscal year that ends on November 30., 20672=        Until January 8, 2014, Griffin also operated a landscape nursery business through its wholly owned subsidiary, Imperial Nurseries, Inc. (\"Imperial\"). Imperial was engaged in the growing of containerized plants for sale principally to independent retail garden centers and rewholesalers, whose main customers are landscape contractors. On January 8, 2014, Griffin and Imperial entered into an Asset Purchase Agreement pursuant to which Imperial's inventory and certain of its assets were sold to Monrovia Connecticut LLC (\"Monrovia\"), a subsidiary of Monrovia Nursery Company, for approximately $0.7 million in cash, before transaction and severance costs, and a non-interest bearing note receivable of $4.25 million (the \"Imperial Sale\"). Monrovia paid $2.75 million of the note receivable on June 1, 2014, as scheduled, and the balance is due on June 1, 2015. Concurrently with the Imperial Sale, Imperial and River Bend Holdings, LLC, a wholly owned subsidiary of Griffin, entered into a Lease and Option Agreement and an Addendum to such agreement (the \"Imperial Lease\", and together with the Imperial Sale, the \"Imperial Transaction\") with Monrovia, pursuant to which Monrovia agreed to lease Imperial's Connecticut production nursery for a ten-year period, with options to extend for up to an additional fifteen years exercisable by Monrovia. The Imperial Lease also grants Monrovia an option to purchase the land, land improvements and other operating assets that were used by Imperial in its Connecticut growing operations during the first thirteen years of the lease period for $10.5 million, or $7.0 million if only a certain portion of the land is purchased, subject in each case to certain adjustments as provided for in the Imperial Lease., 169757=1985 Blue Hills Avenue, Windsor, CT*, 270921=        Revenue from property sales decreased from approximately $5.5 million in fiscal 2013 to approximately $3.7 million in fiscal 2014. Property sales revenue in fiscal 2014 includes the recognition of approximately $3.1 million of revenue related to the sale of approximately 90 acres of undeveloped land in Windsor, Connecticut (the \"Windsor Land Sale\") for cash proceeds of approximately $9.0 million (before transaction expenses) that closed in fiscal 2013. Under the terms of the Windsor Land Sale, Griffin Land is required to construct roadways that will connect the land sold to existing town roadways. Accordingly, because of Griffin Land's continuing involvement with the land that was sold, the Windsor Land Sale is being accounted for under the percentage of completion method. Through fiscal 2014, Griffin Land has recognized approximately $5.8 million of the approximately $9.0 million of total revenue that will be recognized on the Windsor Land Sale when all of the required road work is completed. The balance of the revenue from the Windsor Land Sale will be recognized as, 1030740=        Federal income tax returns for fiscal 2013, fiscal 2012 and fiscal 2011 are subject to examination by the Internal Revenue Service. In fiscal 2014, the state of New York completed an examination of Griffin's fiscal 2007, fiscal 2008 and fiscal 2009 tax returns. In fiscal 2012, the state of Connecticut completed an examination of Griffin's fiscal 2007 tax return. There were no significant adjustments made as a result of those examinations. The remaining periods subject to examination for Griffin's significant state return, which is Connecticut, are fiscal 2008 through fiscal 2013., 130369=        As of November 30, 2014, Griffin employed 26 people on a full-time basis. Presently, none of Griffin's employees are represented by a union. Griffin believes that its relations with its employees are satisfactory., 703870=        Concurrent with the Imperial Sale, Imperial and River Bend Holdings, LLC, a wholly owned subsidiary of Griffin, entered into a Lease and Option Agreement and an Addendum to such agreement (the \"Imperial Lease\", and together with the Imperial Sale, the \"Imperial Transaction\") with Monrovia, pursuant to which Monrovia is leasing Imperial's Connecticut production nursery for a ten-year period, with options to extend for up to an additional fifteen years exercisable by Monrovia. The Imperial Lease provides for net annual rent payable to Griffin of $500 for each of the first five years with rent for subsequent years determined in accordance with the Imperial Lease. The Imperial Lease also grants Monrovia an option to purchase most of the land, land improvements and other operating assets that were used by Imperial in its Connecticut growing operations during the first thirteen years of the lease period for $10,500, or $7,000 if only a certain portion of the land is purchased, subject in each case to certain adjustments as provided for in the Imperial Lease. Accordingly, the operating results of Imperial's growing operations are reflected as a discontinued operation in Griffin's consolidated statements of operations for all periods presented and the assets and liabilities of the growing operations of Imperial (excluding those assets that are part of the Imperial Lease) are shown as assets and liabilities of the discontinued operation on Griffin's consolidated balance sheets. The property and equipment previously used by Imperial and currently leased to Monrovia was reclassified on January 8, 2014 from property and equipment to real estate assets on Griffin's consolidated balance sheet. The property and equipment had a cost of $11,485 and accumulated depreciation of $9,850 at the time it was reclassified (see Notes 4 and 6)., 932422=        As a result of the Imperial Lease, certain assets of the Connecticut farm were reclassified from property and equipment to real estate assets on January 8, 2014. The net book value of the assets reclassified was $1,635, reflecting cost of $11,485 net of accumulated depreciation of $9,850 (see Notes 2 and 4)., 52442=Percentage of leased space at Nov. 30, 2014, 1069826=        Griffin maintains a non-qualified deferred compensation plan (the \"Deferred Compensation Plan\") for certain of its employees who, due to IRC regulations, cannot take full advantage of the Griffin Savings Plan. Griffin's liability under its Deferred Compensation Plan at November 30, 2014 and November 30, 2013 was $3,784 and $3,399, respectively. These amounts are included in other liabilities on Griffin's consolidated balance sheets. The expense for Griffin's matching benefit to the Deferred Compensation Plan in fiscal 2014, fiscal 2013 and fiscal 2012 was $28, $29 and $29, respectively., 293295=        Revenue from property sales decreased from approximately $5.8 million in fiscal 2012 to approximately $5.5 million in fiscal 2013. Property sales occur periodically, and changes in revenue from year to year from those transactions may not be indicative of any trends in the real estate business. Property sales in fiscal 2013 included the closing of the Windsor Land Sale for cash proceeds of approximately $9.0 million (before transaction expenses). Griffin Land is required, under the terms, 149929=        Members of the Cullman and Ernst families (the \"Cullman and Ernst Group\"), which include Frederick M. Danziger, Griffin's Chairman and Chief Executive Officer, Michael S. Gamzon, Griffin's President and Chief Operating Officer, David M. Danziger, a director of Griffin and John J. Kirby, Jr., a director of Griffin who is married to a member of the Cullman family, members of their families and trusts for their benefit, partnerships in which they own substantial interests and charitable foundations on whose boards of directors they sit, owned, directly or indirectly, approximately 45.9% of the outstanding common stock of Griffin as of November 30, 2014. There is an informal understanding that the persons and entities included in the Cullman and Ernst Group will vote together the shares owned by each of them. As a result, the Cullman and Ernst Group may effectively control the determination of Griffin's corporate and management policies and may limit other Griffin stockholders' ability to influence Griffin's corporate and management policies., 267425=        The increase in total square footage as of November 30, 2014 as compared to November 30, 2013 reflects the completion in fiscal 2014 of an approximately 303,000 square foot industrial building in the Lehigh Valley of Pennsylvania that was built on speculation. This building is located adjacent to the 228,000 square foot building built in fiscal 2012 and fully leased in fiscal 2013. These two industrial buildings comprise Lehigh Valley Tradeport, which was developed on land acquired in fiscal 2010. In the fiscal 2014 fourth quarter, Griffin Land entered into a five year lease for approximately 201,000 square feet in the recently completed industrial building in Lehigh Valley Tradeport., 1069055=        Griffin maintains the Griffin Land & Nurseries, Inc. 401(k) Savings Plan (the \"Griffin Savings Plan\") for its employees, a defined contribution plan whereby Griffin matches 60% of each employee's contribution, up to a maximum of 5% of base salary. Griffin's contributions to the Griffin Savings Plan in fiscal 2014, fiscal 2013 and fiscal 2012 were $64, $137 and $139, respectively., 445857=Income (loss) from landscape nursery business, net of tax, including loss on sale of assets of $28, net of tax, in fiscal 2014, 1123046=        A discount rate of 4.60% was used to compute the accumulated postretirement benefit obligations prior to the program termination in fiscal 2014 and at November 30, 2013. The discount rate used was based on the spot rate of the Citigroup Pension Discount Curve, which was used to discount the projected cash flows of the program. Discount rates of 4.60%, 3.59% and 4.50% were used to compute, 310637=        The net cash used in investing activities in fiscal 2013 principally reflects approximately $13.5 million of cash used for additions to real estate assets, a net of approximately $2.8 million of cash deposited in escrow and approximately $0.1 million of cash used for additions to property and equipment, offset by approximately $9.4 million of proceeds from property sales, approximately $3.4 million of proceeds from the sale of SNHC and approximately $2.5 million of proceeds from the sale of Centaur Media common stock. The cash deposited into escrow reflects the approximately $8.9 million of proceeds from the Windsor Land Sale that were placed in escrow for a potential acquisition of a replacement property in a like-kind exchange under Section 1031 of the Internal Revenue Code of 1986, as amended, and approximately $0.9 million of cash deposited in escrow to be used for a portion of the road construction related to the Windsor Land Sale; offset by approximately $6.9 million of cash that was returned from escrow from the Dollar Tree Sale. The funds returned from escrow from the Dollar Tree Sale were used for the acquisition of an approximately 49 acre parcel of undeveloped land in the Lehigh Valley. In addition to the acquisition of undeveloped land in fiscal 2013, Griffin Land's additions to its real estate assets included approximately $2.9 million for tenant improvements related to new leases, approximately $1.4 million for development costs, site work and, 100628=        As of November 30, 2014, Griffin Land owned three industrial buildings in the Lehigh Valley, the Olympus Building and the two Lehigh Valley Tradeport industrial buildings discussed above, which are collectively approximately 651,000 square feet. Approximately $30.1 million was invested (net book value) in these three buildings as of November 30, 2014. The Olympus Building in Pennsylvania is mortgaged for approximately $3.8 million as of November 30, 2014, and the 228,000 square foot industrial building in Lehigh Valley Tradeport was mortgaged for approximately $8.9 million as of November 30, 2014. On December 31, 2014, Griffin Land refinanced the existing mortgage loan on its Lehigh Valley Tradeport building into a new mortgage loan on both of its Lehigh Valley Tradeport buildings that generated additional mortgage proceeds of approximately $10.9 million. An additional $1.9 million of mortgage proceeds will be received when a portion of the vacant space in the most recently completed Lehigh Valley Tradeport industrial building is leased., 63263=        As of November 30, 2014, approximately 357,000 square feet of Griffin Land's buildings in Griffin Center were leased, comprising approximately 93% of Griffin Land's total space in Griffin Center. A summary of Griffin Land's square footage owned and leased in Griffin Center at the end of each of the past three fiscal years and leases in Griffin Center scheduled to expire during each of the next three fiscal years are as follows:, 894843=        During the year ended November 30, 2014, Griffin Land reclassified real estate assets into real estate assets held for sale the costs related to a residential development in Simsbury, Connecticut and two land parcels that are under contract to be sold. The residential development is being offered for sale either in its entirety or in segments., 1035567=8.13%, due April 1, 2016, 289448=As of December 1, 2012, 1067162=        On April 24, 2013, Griffin closed on a $12,500 revolving credit line with Webster Bank (the \"Webster Credit Line\"). The Webster Credit Line is for two years with an option for Griffin to extend the credit line for a third year. The Webster Credit Line replaced Griffin's $12,500 credit line with Doral Bank (the \"Doral Credit Line\") that was scheduled to expire on May 1, 2013. Interest on the outstanding borrowings under the Webster Credit Line are at the one month LIBOR rate plus 2.75%., 302112=        In fiscal 2013, Griffin incurred a loss on debt extinguishment of approximately $0.3 million, related to a loan modification agreement on a mortgage loan with First Niagara Bank due in January 2020 (the \"2020 First Niagara Mortgage\"). On April 1, 2013, Griffin Land and First Niagara Bank entered into an agreement that reduced the interest rate on the 2020 First Niagara Mortgage from a fixed rate of 5.25% to a variable rate of the one month LIBOR rate plus 2.5%. Because the difference between the present value of the future payments under the existing loan was greater than 10% of the present value of the payments under the modified loan, the loan modification was accounted for as a debt extinguishment. As such, all deferred costs related to the existing 2020 First Niagara Mortgage (approximately $0.2 million) and the fee paid to First Niagara Bank for the loan modification (approximately $0.1 million) are reflected as a loss on debt extinguishment. Concurrent with that agreement, Griffin also entered into an interest rate swap agreement with First Niagara Bank to fix the interest rate on the 2020 First Niagara Mortgage at 3.91% for the remainder of the loan term., 62525=        As of November 30, 2014, approximately $17.0 million was invested (net book value) in Griffin Land's buildings in Griffin Center and approximately $0.9 million was invested by Griffin Land in the undeveloped land there. Griffin Land's two multi-story office buildings and the NU Building in Griffin Center are separately mortgaged for an aggregate of approximately $14.1 million, and Griffin Land's single story office building is included as collateral under Griffin's $12.5 million revolving line of credit. There were no borrowings under the revolving line of credit as of November 30, 2014., 1034605=5.73%, due August 1, 2015, 882981=        In fiscal 2013, Griffin Land closed on the acquisition of approximately 49 acres of undeveloped land in the Lehigh Valley of Pennsylvania for $7,119 in cash, using the proceeds from the Dollar Tree Sale that were being held in escrow to complete the Section 1031 like-kind exchange., 875823=        In the 2013 fourth quarter, Griffin Land completed the sale of approximately 90 acres of undeveloped land for approximately $9,000 in cash, before transaction costs (the \"Windsor Land Sale\"). The land sold is located in Windsor, Connecticut and is part of an approximately 253 acre parcel of undeveloped land that straddles the town line between Windsor and Bloomfield, Connecticut. Under the terms of the Windsor Land Sale, Griffin Land and the buyer are each constructing roadways connecting the land parcel sold with existing town roads. The roads being built will become new town roads, thereby providing public access to the remaining acreage in Griffin Land's land parcel. As a result of Griffin Land's continuing involvement with the land sold, the Windsor Land Sale is being accounted for under the percentage of completion method. Accordingly, the revenue and pretax gain on the sale are being recognized on a pro rata basis in a ratio equal to the percentage of the total costs incurred to the total anticipated costs of sale, including the costs of the required roadwork. Costs included in determining the percentage of completion include the cost of the land sold, allocated master planning costs and the cost of road construction. At the closing of the Windsor Land Sale, cash proceeds of $8,860 were placed in escrow for the potential purchase of a replacement property in a like-kind exchange under Section 1031 of the Internal Revenue Code of 1986, as amended (\"the IRC\"), which was reflected as Proceeds Held in Escrow on Griffin's consolidated balance sheet as of November 30, 2013. The proceeds held in escrow were returned to Griffin in the second quarter of fiscal 2014, as a replacement property was not acquired., 686206=        As of November 30, 2014, Griffin is a party to several interest rate swap agreements to hedge its interest rate exposures. Griffin does not use derivatives for speculative purposes. Griffin applies FASB ASC 815-10, \"Derivatives and Hedging,\" (\"ASC 815-10\") as amended, which establishes accounting and reporting standards for derivative instruments and hedging activities. ASC 815-10 requires Griffin to recognize all derivatives as either assets or liabilities on its consolidated balance sheet and measure those instruments at fair value. The changes in the fair values of the interest rate swap agreements are measured in accordance with ASC 815-10 and reflected in the carrying values of the interest rate swap agreements on Griffin's consolidated balance sheet. The estimated fair values are based primarily on projected future swap rates., 1155569=        The following options were granted by Griffin under the 2009 Stock Option Plan to non-employee directors either upon their initial election or their re-election to Griffin's Board of Directors:, 1060363=proceeds of $10,875 at closing (before transaction costs), net of $8,875 used to refinance the 2023 First Niagara Mortgage and $1,850 held back until a portion of the vacant space in the 303,000 square foot building is leased. The 2025 First Niagara Mortgage has a ten-year term with monthly payments based on a twenty-five year amortization schedule. The interest rate for the 2025 First Niagara Mortgage is a floating rate of the one month LIBOR rate plus 1.95%. At the time the 2025 First Niagara Mortgage closed, Griffin entered into an interest rate swap agreement, that combined with an existing interest rate swap agreement, effectively fixes the rate of the 2025 First Niagara Mortgage at 4.43% over the mortgage loan's ten-year term., 724979=        In fiscal 2013, Imperial's pretax loss included a charge of $10,400 to reduce Imperial's inventories to fair value, which was the net realizable value based on the terms of the Imperial Sale. Also in fiscal 2013, Imperial's pretax loss included a charge of $500 to increase inventory reserves for plants that were expected to be sold below cost as seconds. In fiscal 2012, Imperial's pretax loss included a charge of $380 to increase reserves for unsaleable inventories and plants that were expected to be sold below cost as seconds., 215985=        The following table sets forth selected statement of operations data for fiscal years 2010 through 2014 and balance sheet data as of the end of each fiscal year. The selected statement of operations data for fiscal 2012, fiscal 2013 and fiscal 2014 and the selected balance sheet data for fiscal 2013 and fiscal 2014 are derived from the audited consolidated financial statements included in Item 8 of this report. The selected statement of operations data for fiscal 2010 and fiscal 2011 and the balance sheet data for fiscal 2010, fiscal 2011 and fiscal 2012 were derived from the audited consolidated financial statements for those years. This selected financial data should be read in conjunction with the consolidated financial statements and accompanying notes, \"Management's Discussion and Analysis of Financial Condition and Results of Operations\" and other financial information included elsewhere in this Annual Report. Historical results are not necessarily indicative of future performance., 283515=        Income from discontinued operations, net of tax, of approximately $0.1 million in fiscal 2014 principally reflects the effect of the termination of Griffin's postretirement benefits program and, 1057494=        On August 28, 2013, a subsidiary of Griffin closed on a $9,100 nonrecourse mortgage loan (the \"2023 First Niagara Mortgage\") with First Niagara Bank (\"First Niagara\"), collateralized by a 228,000 square foot industrial building in Lower Nazareth, Pennsylvania that was constructed in fiscal 2012 and fully leased in fiscal 2013. Although this mortgage is nonrecourse, Griffin and its subsidiary entered into a master lease that is coterminous with the 2023 First Niagara Mortgage which would become effective if the full building tenant in that building does not renew its five-year lease when it is scheduled to expire in fiscal 2018. The 2023 First Niagara Mortgage has a ten-year term with monthly payments based on a twenty-five year amortization schedule. The interest rate for the 2023 First Niagara Mortgage is a floating rate of the one month LIBOR rate plus 1.95%. At the time Griffin closed on the 2023 First Niagara Mortgage, Griffin also entered into an interest rate swap agreement with First Niagara for a notional principal amount of $9,100 at inception to fix the interest rate of the 2023 First Niagara Mortgage at 4.79%., 1033617=6.30%, due May 1, 2014, 125170=        Griffin and Imperial entered into a Purchase Agreement with Monrovia, effective January 8, 2014, pursuant to which Imperial's inventory and certain of its assets were sold to Monrovia for approximately $0.7 million in cash (before transaction and severance costs) and a non-interest bearing note receivable (the \"Promissory Note\") of $4.25 million that is secured by an irrevocable letter of credit. A payment of $2.75 million on the Promissory Note was received on June 1, 2014 and the balance of $1.5 million is due on June 1, 2015. Pursuant to the terms of the Imperial Sale, Griffin and Imperial agreed to indemnify Monrovia for any potential environmental liabilities relating to periods prior to the effective date of the Purchase Agreement., 37010=like-kind exchange. In fiscal 2012, Griffin Land also completed the sale of approximately 14 acres of undeveloped land in Windsor, Connecticut for cash proceeds of approximately $1.0 million., 15368=        This Annual Report on Form 10-K (the \"Annual Report\") contains forward-looking statements within the meaning of Section 21E of the Securities Exchange Act of 1934, as amended (the \"Exchange Act\"). For this purpose, any statements contained in this Annual Report that relate to future events or conditions, including without limitation, the statements in Part I, Item 1. \"Business\" and Item 1A. \"Risk Factors\" and in Part II Item 7. \"Management's Discussion and Analysis of Financial Condition and Results of Operations\" as well as located elsewhere in this Annual Report regarding industry prospects or Griffin Land & Nurseries, Inc.'s (\"Griffin\") plans, expectations, or prospective results of operations or financial position, may be deemed to be forward-looking statements. Without limiting the foregoing, the words \"believes,\" \"anticipates,\" \"plans,\" \"expects,\" and similar expressions are intended to identify forward-looking statements. Such forward-looking statements represent management's current expectations and are inherently uncertain. There are a number of important factors that could materially impact the value of Griffin's common stock or cause actual results to differ materially from those indicated by such forward-looking statements. Such factors include: adverse economic conditions and credit markets; a downturn in the commercial and residential real estate markets; risks associated with concentration of real estate holdings; risks associated with entering new real estate markets; potential environmental liabilities; competition and governmental regulations; inadequate insurance coverage; risks of environmental factors; risks associated with the cost of raw materials or energy costs; regulatory risks; risks of investing in a foreign company; litigation risks; and the concentrated ownership of Griffin common stock by members of the Cullman and Ernst families. These and the important factors discussed under the caption \"Risk Factors\" in Part I, Item 1A of this Annual Report for the fiscal year ended November 30, 2014, among others, could cause actual results to differ materially from those indicated by forward-looking statements made in this Annual Report and presented elsewhere by management from time to time. Any such forward-looking statements represent management's estimates as of the date of this Annual Report. While Griffin may elect to update such forward-looking statements at some point in the future, Griffin disclaims any obligation to do so, even if subsequent events cause Griffin's views to change. These forward-looking statements should not be relied upon as representing Griffin's views as of any date subsequent to the date of this Annual Report., 1036520=7.0%, due October 1, 2017, 34281=        In fiscal 2012, Griffin Land completed three property sales. The largest of these was the sale of its fully leased 308,000 square foot warehouse building in Manchester, Connecticut (the \"Raymour Building\"). Under the terms of the full building lease with Raymour & Flanigan (\"Raymour\") for that building, Griffin Land gave notice to Raymour in fiscal 2011 that Griffin Land was exercising the put option under its lease to sell the facility to Raymour. The proceeds of approximately $16.0 million from that sale were placed in escrow for the potential acquisition of a replacement property in a like-kind exchange under Section 1031 of the Internal Revenue Code of 1986, as amended. As Griffin Land did not acquire a replacement property, the proceeds from the sale of the Raymour Building were returned to Griffin Land in fiscal 2012. The sale of this property and all operating results for this property are reported as a discontinued operation for all periods presented in Griffin's consolidated statements of operations in this Annual Report., 671890=        Griffin's investment in Shemin Nurseries Holding Corp. (\"SNHC\") was accounted for under the cost method of accounting for investments. Griffin sold its entire investment in SNHC in fiscal 2013 (see Note 5)., 1072580=        Through March 10, 2014, Griffin maintained an unfunded postretirement benefits program that provided principally health and life insurance benefits to certain of its employees. Only those employees who were employed by Griffin's predecessor company as of December 31, 1993 were eligible to participate in the postretirement benefits program. The liability for postretirement benefits was included in other liabilities on Griffin's consolidated balance sheet at November 30, 2013., 1062560=        On June 15, 2012, Griffin and two of its wholly owned subsidiaries entered into the Third Modification Agreement (the \"Modification Agreement\") to the mortgage loan originally due January 1, 2013 with Webster Bank (the \"Webster Mortgage\"). The Modification Agreement extended the maturity of the Webster Mortgage to October 2, 2017. In accordance with the Modification Agreement, the interest rate under the Webster Mortgage, which was fixed at 6.08% through September 30, 2012, changed, effective October 1, 2012, to a floating rate of the one month LIBOR rate plus 2.75%. In anticipation of entering into the Modification Agreement, on June 7, 2012, Griffin entered into an interest rate swap agreement with Webster Bank to effectively fix the interest rate on the Webster Mortgage at 3.86% from October 1, 2012 through the maturity of the Webster Mortgage. Pursuant to the Modification Agreement, effective on October 1, 2012, principal payments on the Webster Mortgage were based on a twenty-five year amortization schedule. The Webster Mortgage is collateralized by Griffin Land's two multi-story office buildings in Windsor, Connecticut. The Modification Agreement did not alter the collateral for the Webster Mortgage., 143162=        Griffin Land has extensive land holdings in Connecticut and Massachusetts and, in fiscal 2010, started acquiring properties in the Lehigh Valley of Pennsylvania. Under federal, state and local environmental laws, ordinances and regulations, Griffin Land may be required to investigate and clean up the effects of releases of hazardous substances or petroleum products at its properties because of its current or past ownership or operation of the real estate. If previously unidentified environmental problems arise, Griffin Land may have to make substantial payments, which could adversely affect its cash flow. As an owner or operator of properties, Griffin Land may have to pay for property damage and for investigation and clean-up costs incurred in connection with a contamination. The law typically imposes clean-up responsibility and liability regardless of whether the owner or operator knew of or caused the contamination. Changes in environmental regulations may impact the development potential of Griffin Land's undeveloped land or could increase operating costs due to the cost of complying with new regulations., 534047=Balance at December 1, 2012, 300961=        Griffin's interest expense increased from approximately $3.5 million in fiscal 2012 to approximately $3.8 million in fiscal 2013, principally due to approximately $0.6 million of interest being capitalized in fiscal 2012 as compared to only approximately $0.1 million of interest capitalized in fiscal 2013 and interest expense of approximately $0.1 million on a nonrecourse mortgage loan entered into in fiscal 2013 on the Lehigh Valley industrial building that became fully leased in fiscal 2013. Partially offsetting these increases was a decrease in interest expense of approximately $0.2 million in fiscal 2013 as compared to fiscal 2012 due to lower interest rates on mortgage loans with Webster Bank and First Niagara Bank that were refinanced in the fiscal 2012 fourth quarter and fiscal 2013 second quarter, respectively. Interest capitalized in fiscal 2012 was on the construction projects ongoing during that year, principally the Lehigh Valley industrial building that was built by Griffin Land., 278389=carrying cost of its investment in SNHC, Griffin's gain on sale was also approximately $3.4 million. Also in fiscal 2013, Griffin sold 2,824,688 shares of its common stock of Centaur Media for cash proceeds of approximately $2.5 million and a gain of approximately $1.1 million. In fiscal 2014, Griffin's approximately $0.3 million gain from the sale of investments reflected the sale of 500,000 shares of its common stock in Centaur Media for cash proceeds of approximately $0.6 million. As of November 30, 2014, Griffin held 1,952,462 shares of Centaur Media common stock. Management expects that it will continue to sell its Centaur Media common stock when it believes that sales terms and conditions are favorable., 880461=        In fiscal 2012, Griffin Land sold 93 acres of undeveloped land in New England Tradeport (\"Tradeport\"), Griffin Land's industrial park located in Windsor and East Granby, Connecticut, to Dollar Tree Distribution, Inc. for cash proceeds of $7,000, before transaction costs (the \"Dollar Tree Sale\"). Under the terms of the Dollar Tree Sale, Griffin Land was required to construct a sewer line to service the land that was sold. As a result of Griffin Land's continuing involvement with the land sold, the Dollar Tree Sale was accounted for under the percentage of completion method. Accordingly, the revenue and the pretax gain on sale were recognized on a pro rata basis in a ratio equal to the percentage of the total costs incurred to the total anticipated costs of sale, including the costs of the required construction of the sewer line. Costs included in determining the percentage of completion included the cost of the land sold, allocated master planning costs of Tradeport, selling and transaction costs and the cost to construct the required sewer line. Upon completion of the sale, Griffin Land deposited the cash of $6,929 received from the Dollar Tree Sale at closing into an escrow account, for the potential purchase of a replacement property in a like-kind exchange under Section 1031 of the IRC, as amended. In fiscal 2013, Griffin Land closed on the acquisition of a parcel of undeveloped land to complete the Section 1031 like-kind exchange (see below)., 1063959=        As of November 30, 2014, Griffin was a party to several interest rate swap agreements related to its variable rate nonrecourse mortgages on certain of its real estate assets. Griffin accounts for its interest rate swap agreements as effective cash flow hedges (see Note 3). No ineffectiveness on the cash flow hedges was recognized as of November 30, 2014 and none is anticipated over the term of the agreements. Amounts in accumulated other comprehensive income (loss) will be reclassified into interest expense over the term of the swap agreements to achieve fixed rates on each mortgage. None of the interest rate swap agreements contain any credit risk related contingent features. In fiscal 2014 and fiscal 2012, Griffin recognized net losses, included in other comprehensive income (loss), before, 953058=        Included in total income (loss) from Griffin's discontinued operations, net of tax, is an income tax provision of $115 and $1,077 for fiscal 2014 and fiscal 2012, respectively, and an income tax benefit of $4,411 for fiscal 2013., 1052478=        The annual principal payment requirements under the terms of the nonrecourse mortgage loans for the fiscal years 2015 through 2019 are $19,828, $1,725, $7,663, $1,720 and $17,719, respectively. The aggregate book value of land and buildings that are collateral for the nonrecourse mortgage loans was approximately $70,226 at November 30, 2014., 212585=        Griffin's dividend policy is to consider the payment of an annual dividend at the end of its fiscal year, which enables the Board of Directors to evaluate both Griffin's prior full year results and its cash needs for the succeeding year when determining whether to declare an annual dividend. In fiscal 2014 and fiscal 2013, Griffin declared an annual dividend of $0.20 per share in each year., 550938=Balance at November 30, 2013, 120582=        Several years ago, Griffin Land filed plans for the creation of a residential community, called Meadowood, on a 363 acre site in the Town of Simsbury, Connecticut (\"Simsbury\"). After several years of litigation with the town regarding this proposed residential development, a settlement was reached. The settlement terms included, among other things, approval for up to 296 homes, certain remediation measures and offsite road improvements to be performed by Griffin Land and the purchase by Simsbury of a portion of the Meadowood land for open space. The sale of land to Simsbury closed in fiscal 2008. In fiscal 2012, Griffin Land performed a portion of the required remediation work on the site and completed the required offsite road improvements. In fiscal 2014, Griffin Land completed the required remediation work. As of November 30, 2014, the book value of the land for this development, including design, development and legal costs, was approximately $8.5 million. Griffin Land anticipates seeking offers for this property., 268242=        The increase in leased square footage as of November 30, 2014 as compared to November 30, 2013 principally reflects the leasing of approximately 201,000 square feet described above and a full building lease of an approximately 138,000 square foot building within New England Tradeport (\"Tradeport\"), Griffin Land's industrial park located in Windsor and East Granby, Connecticut with a tenant that is presently leasing an approximately 57,000 Tradeport industrial building under a short-term lease after its long-term lease in that building expired on August 31, 2014. Griffin Land expects the tenant to terminate the current short-term lease in fiscal 2015. In addition, the increase in space leased also reflects an increase of approximately 47,000 square feet leased to Tire Rack, Inc. (\"Tire Rack\") in a Tradeport industrial building. Under the terms of the existing lease with Tire Rack, effective August 1, 2014, the start of the sixth year of its lease, Tire Rack was required to lease the entire Tradeport building in which they are located. The balance of the change in leased square footage as of November 30, 2014 as compared November 30, 2013 reflects leasing approximately 31,000 square feet of previously vacant industrial/warehouse space and the expiration of leases aggregating approximately 43,000 square feet that were not renewed. The leasing market where Griffin's Connecticut properties are located (the north submarket of Hartford) remained competitive throughout fiscal 2014. Activity by prospective tenants was muted during most of fiscal 2014; however, there was an increase in inquiries from prospective tenants in the latter part of the year. Griffin Land has received favorable indications as to the renewal of much of the approximately 326,000 square feet of space in Tradeport under leases that are scheduled to expire in fiscal 2015 as well as to the leasing of a portion of the vacant space in Tradeport as of November 30, 2014. Subsequent to November 30, 2014, Griffin Land entered into a ten-year lease for approximately 42,000 square feet of previously vacant space in Tradeport. There is no guarantee that such favorable indications will result in the renewal of leases scheduled to expire in fiscal 2015 or that the recent increase in inquiries from prospective tenants or favorable indications as to the leasing of vacant space in Tradeport as of November 30, 2014 will result in the additional leasing of space that was vacant as of November 30, 2014., 692108=        Griffin Land's real estate holdings are mostly concentrated in the Hartford, Connecticut area. In fiscal 2010, Griffin Land started the expansion of its real estate holdings outside of the Hartford area by purchasing an industrial building and undeveloped land in the Lehigh Valley region of Pennsylvania. Griffin Land subsequently developed two industrial buildings on the land acquired, acquired additional undeveloped land in the Lehigh Valley and started construction of an industrial building on the most recently acquired land. The market and economic challenges experienced by the U.S. economy as a whole or the local economic conditions in the markets in which Griffin holds properties may affect Griffin Land's real estate business. Griffin's results of operations, financial condition or ability to expand may be adversely affected as a result of: (i) unfavorable financial changes to Griffin Land's tenants which may result in tenant defaults under leases; (ii) significant job losses impacting the demand for rental space causing market rental rates and property values to be negatively impacted; (iii) the ability of Griffin to borrow on terms and conditions that it finds acceptable; and (iv) possibly reduced values of Griffin Land's properties potentially limiting the proceeds from a sale of its properties or from debt financing collateralized by its properties., 38321=        Griffin does not maintain a corporate website. Griffin's Annual Report on Form 10-K, quarterly reports on Form 10-Q, current reports on Form 8-K and the proxy statement for Griffin's Annual Meeting of Stockholders can be accessed through the SEC website at www.sec.gov. Griffin will provide electronic or paper copies of its foregoing filings free of charge upon request. Griffin was incorporated in 1970., 277324=        Griffin's total gain from the sale of investments decreased from approximately $4.5 million in fiscal 2013 to approximately $0.3 million in fiscal 2014. In fiscal 2013, the gain reflected the sale of Griffin's investment in Shemin Nurseries Holding Corp. (\"SNHC\") and the sale of a portion of Griffin's holdings in Centaur Media plc (\"Centaur Media\"). In fiscal 2013, Griffin completed the sale of its investment in SNHC and received cash proceeds of approximately $3.4 million. Because of the low, 882080=        In fiscal 2013, all of the remaining costs related to the Dollar Tree Sale were incurred; therefore, from the date of the Dollar Tree Sale in fiscal 2012 through the end of fiscal 2013, all of the revenue and the pretax gain on sale were recognized in Griffin's consolidated statements of operations. Griffin's consolidated statement of operations for fiscal 2013 includes revenue of $2,474 and a pretax gain of $2,109 from the Dollar Tree Sale. Included in the pretax gain in fiscal 2013 is $177 from an amended agreement related to the Dollar Tree Sale whereby Griffin Land received $177 upon completion of the sewer line to service the land that was sold. Including the pretax gain on sale of $3,942 recognized in fiscal 2012, the total pretax gain on the Dollar Tree Sale was $6,051., 298862=        In fiscal 2013, the sale of Griffin's investment in SNHC was completed, and Griffin received cash proceeds of approximately $3.4 million. Because of the low carrying cost of its investment in SNHC, Griffin's gain on the sale was approximately $3.4 million, essentially equal to the cash proceeds received. Also in fiscal 2013, Griffin sold 2,824,688 shares of its common stock of Centaur Media for cash proceeds of approximately $2.5 million. Griffin's gain from the sale of its Centaur Media common stock in fiscal 2013 was approximately $1.1 million. After the sales of Centaur Media common stock, Griffin owned 2,452,462 shares of Centaur Media common stock as of November 30, 2013. There were no sales of investments in fiscal 2012; however, fiscal 2012 did include investment income of approximately $0.6 million principally from a cash distribution from SNHC., 672461=        Griffin's inventories reflected nursery stock and material and supplies of Imperial and were stated at the lower of cost, using the average cost method, or market. Abnormal costs of idle facility expenses, freight, handling costs and spoilage were treated as period costs. As of November 30, 2013, the carrying value of inventory was reduced to its fair value, which was the net realizable value based on the sale of the inventories, effective January 8, 2014, under the terms of the Imperial Sale (see Note 2)., 1066240=        As of November 30, 2014, $961 is expected to be reclassified over the next twelve months from accumulated other comprehensive loss to interest expense. As of November 30, 2014, the net fair value of Griffin's interest rate swap agreements was $2,322, with $8 included in other assets and $2,330 included in other liabilities on Griffin's consolidated balance sheet. As of November 30, 2013, the net fair value of Griffin's interest rate swap agreements was $2,222, with $63 included in other assets and $2,285 included in other liabilities on Griffin's consolidated balance sheet., 314816=        In fiscal 2014, Griffin Land refinanced two nonrecourse mortgage loans with Farm Bureau; the 8.13% mortgage that was due April 1, 2016 and the 7.0% mortgage that was due October 1, 2017. These two mortgage loans had a combined balance of approximately $9.0 million just prior to the refinancing. The combined balance after refinancing was $14.5 million, with both loans having a fixed interest rate of 5.09%. The refinanced mortgage loans each have a term of fifteen years with payments based on a fifteen year amortization schedule. $1.0 million of the mortgage loan proceeds from the refinancing of one of the mortgage loans with Farm Bureau is being held in escrow. The escrowed funds will be released to Griffin if an approximately 57,000 square foot industrial building that is part of the collateral for that mortgage loan, and is expected to become vacant after the current short-term full building lease expires, is re-leased under terms agreed upon with Farm Bureau. If a replacement lease on the terms agreed upon with Farm Bureau is not obtained, the proceeds being held in escrow are required to be used to make a partial prepayment, without penalty, on the mortgage loan., 856585=        Included in real estate assets, net as of November 30, 2014 is $1,444 reflecting the net book value of Imperial's Connecticut farm assets that were leased to Monrovia effective January 8, 2014 (see Notes 2 and 6). Prior to that date, these assets were reported as part of property and equipment. The assets reclassified from property and equipment to real estate assets had a cost of $11,485 and accumulated depreciation of $9,850 at the time of the reclassification., 129204=        Shemin Nurseries Holding Corp. (\"SNHC\") is a privately held company that operates a landscape nursery distribution business. At the beginning of fiscal 2013, Griffin held an approximately 14% equity interest in SNHC and accounted for its investment in SNHC under the cost method of accounting for investments. In fiscal 2013, Griffin sold its entire investment in SNHC for cash proceeds of approximately $3.4 million., 307680=        Net cash used in investing activities increased from approximately $1.2 million in fiscal 2013 to approximately $2.8 million in fiscal 2014. The net cash used in investing activities in fiscal 2014 reflects cash payments of approximately $15.6 million for additions to real estate assets and approximately $0.1 million for additions to property and equipment, substantially offset by cash proceeds from the Windsor Land Sale of approximately $8.9 million that were returned from escrow, cash proceeds of approximately $2.8 million from collecting the amount due on the note receivable from Monrovia on the Imperial Sale, cash proceeds of approximately $0.6 million from sales of Centaur Media common stock, cash proceeds of approximately $0.6 million from property sales closed in fiscal 2014 and cash proceeds (after payment of severance and transaction expenses) of approximately $0.2 million from the Imperial Sale. At the closing of the Windsor Land Sale in fiscal 2013, the cash proceeds of approximately $8.9 million were placed in escrow for the potential acquisition of a replacement property in a like-kind exchange under Section 1031 of the Internal Revenue Code of 1986, as amended. As Griffin Land did not acquire a replacement property, the cash proceeds were returned to Griffin in the fiscal 2014 second quarter., 1042325=5.09%, due July 1, 2029, 932855=        Total depreciation expense related to property and equipment in fiscal 2014, fiscal 2013 and fiscal 2012 was $111, $335 and $362, respectively., 1124624=the net periodic benefit expense for fiscal 2014 through the termination of the postretirement benefits program, fiscal 2013 and fiscal 2012, respectively., 123698=        In fiscal 2014, Griffin Land leased approximately 424 acres of undeveloped land in Connecticut and Massachusetts to local farmers. Approximately 512 acres and 542 acres were leased to local farmers in fiscal 2013 and fiscal 2012, respectively. The revenue generated from the leasing of farmland is not material to Griffin Land's total revenue., 284241=reclassification of actuarial gains previously reflected in other comprehensive income into net income, partially offset by the loss from the growing operations of the landscape nursery business through the date of the Imperial Sale and the loss on the Imperial Sale. As substantially all of the former participants in Griffin's postretirement benefits program were formerly employed in the growing operations of the landscape nursery business that is now reported as a discontinued operation, most of the amount of the reclassification of the actuarial gains is included in the results of discontinued operations in fiscal 2014. The loss from discontinued operations, net of tax, of approximately $7.7 million in fiscal 2013 principally reflects the loss from the growing operations of the landscape nursery business in fiscal 2013, including a pretax charge of $10.4 million to reduce inventory that was sold in the Imperial Sale to fair value, which was the net realizable value based on the terms of the Imperial Sale., 294330=of the Windsor Land Sale, to construct roadways that will connect the land sold to existing town roadways. Accordingly, because of Griffin Land's continuing involvement with the land that was sold, the Windsor Land Sale is being accounted for under the percentage of completion method, under which the revenue and the gain on sale are recognized as the total costs related to the property sale are incurred. In fiscal 2013, Griffin Land recognized approximately $2.7 million of revenue from the Windsor Land Sale. In addition to the revenue from the Windsor Land Sale, revenue from property sales in fiscal 2013 also included the recognition of approximately $2.3 million of previously deferred revenue from the Dollar Tree Sale that closed in fiscal 2012. As Griffin Land was required, under the terms of the Dollar Tree Sale, to construct a sewer line to service the property sold, Griffin Land accounted for the Dollar Tree Sale under the percentage of completion method. In addition to the recognition of previously deferred revenue on the Dollar Tree Sale, Griffin Land reported approximately $0.2 million of additional revenue from the Dollar Tree Sale in fiscal 2013 and also had a total of approximately $0.3 million of revenue from two smaller land sales. Property sales revenue in fiscal 2012 principally reflected the recognition of approximately $4.7 million of revenue from the Dollar Tree Sale and approximately $1.0 million of revenue from the sale of approximately 14 acres of undeveloped land in Windsor for cash., 952135=        Griffin did not recognize a current tax benefit in fiscal 2014, fiscal 2013 or fiscal 2012 from the exercise of employee stock options. A benefit was not recorded in fiscal 2014 and 2013 because Griffin did not have taxable income. In fiscal 2012, Griffin utilized net operating loss carryforwards to offset taxable income. As of November 30, 2014, Griffin has an unrecognized tax benefit of $1,170 for the effect of employee stock options exercised in fiscal years 2006 through 2014. In fiscal 2014 and fiscal 2012, the deferred tax asset related to non-qualified stock options was reduced by $4 and $38, respectively, as a result of exercises and forfeitures of those options. There were no adjustments to deferred tax assets for exercises and forfeitures of non-qualified stock options in fiscal 2013., 282681=        Griffin's effective tax rate was (8.3%) in fiscal 2014 as compared to 34.2% in fiscal 2013. The change in effective tax rate in fiscal 2014 as compared to fiscal 2013 principally reflects the effect in fiscal 2014 of reductions to certain state income tax benefits based on management's projections of the expected realization rate that those state tax benefits will provide to Griffin. As a result of such adjustments, the amount of the state income tax provision exceeded the federal income tax benefit, resulting in an overall income tax provision for fiscal 2014. To the extent that actual results differ from current projections, the projected realization rate would be different than the rate presently being used., 61732=to adjustment based on the actual number of acres conveyed. Completion of this transaction is subject to significant contingencies, including the satisfactory completion of due diligence by the purchaser (a public educational authority in the state of Connecticut) and the purchaser obtaining a commitment from the State of Connecticut to fund the land acquisition and develop the property as planned by the purchaser. If this sale were to be completed, the development potential of the remaining approximately 16 acres of that land parcel may be severely limited. The due diligence period does not expire until fiscal 2016. There is no guarantee that this transaction will be completed under the current terms, or at all., 877702=        As of November 30, 2014, approximately 64% of the total costs related to the Windsor Land Sale have been incurred; therefore, from the date of the Windsor Land Sale through November 30, 2014, approximately 64% of the total revenue and pretax gain on the sale have been recognized in Griffin's consolidated statements of operations. Griffin's consolidated statement of operations for fiscal 2014 includes revenue of $3,105 and a pretax gain of $2,358 from the Windsor Land Sale. Griffin's consolidated statement of operations for fiscal 2013 included revenue of $2,668 and a pretax gain of $1,990 from the Windsor Land Sale. The balance of the revenue and pretax gain on sale will be recognized when the remaining costs are incurred, which is expected to take place mostly in the first half of fiscal 2015. Included on Griffin's consolidated balance sheet as of November 30, 2014, is deferred revenue of $3,195 that will be recognized as the remaining costs are incurred (see Note 13). Including the pretax gain on sale recognized in fiscal 2013, the total pretax gain on the Windsor Land Sale is expected to be approximately $6,754 after all revenue is recognized and all costs are incurred., 1179330=Number of option holders at November 30, 2014, 25388=industrial/warehouse market in the Lehigh Valley region of Pennsylvania has experienced a fairly strong level of leasing activity during the past several years and reported vacancy rates are low. A national real estate services company reported that the overall vacancy rate in the Lehigh Valley industrial market was less than 5% in 2014. As a result of the relatively strong market, there has been an increase in industrial/warehouse space in the Lehigh Valley. There can be no assurances as to the directions of the Hartford and Lehigh Valley real estate markets in the near future., 275453=        Depreciation and amortization expense was approximately $6.7 million in both fiscal 2013 and fiscal 2014. Depreciation and amortization expense increased by approximately $0.2 million in fiscal 2014 as compared to fiscal 2013 due to tenant improvements on the full building lease of the 228,000 square foot industrial building in the Lehigh Valley that commenced in fiscal 2013 and approximately $0.2 million related to the approximately 303,000 square foot industrial building in the Lehigh Valley that was completed and placed in service in fiscal 2014. These increases were essentially offset by decreases in depreciation and amortization expense on tenant improvements of approximately $0.3 million related to leases that expired and approximately $0.1 million for real estate assets becoming fully depreciated., 309176=        The additions to Griffin Land's real estate assets in fiscal 2014 principally reflect approximately $9.6 million for the development, on speculation, of the approximately 303,000 square foot industrial building in the Lehigh Valley Tradeport on land contiguous to the 228,000 square foot industrial building that Griffin Land developed in fiscal 2012 and fully leased in fiscal 2013. Griffin Land expended a total of approximately $13.2 million (excluding land and leasing costs) on the Lehigh Valley Tradeport industrial building completed in fiscal 2014. Additions to Griffin Land's real estate assets in fiscal 2014 also include approximately $1.7 million for tenant improvements related to new leases (including the approximately 138,000 square foot Tradeport building that was fully leased in fiscal 2014), approximately $2.0 million for required remediation and site work on a residential project, approximately $0.9 million for road construction work related to the Windsor Land Sale, approximately $0.6 million for the start of site work on the undeveloped Lehigh Valley land acquired in fiscal 2013 and fiscal 2014 and approximately $0.3 million related to the acquisition of a parcel of undeveloped land adjacent to undeveloped land in the Lehigh Valley that was acquired in fiscal 2013., 260528=        Total revenue decreased from approximately $25.5 million in fiscal 2013 to approximately $24.2 million in fiscal 2014, reflecting a decrease of approximately $1.8 million in revenue from property sales, partially offset by an increase of approximately $0.5 million in rental revenue in fiscal 2014 as compared to fiscal 2013., 276407=        Griffin's general and administrative expenses decreased from approximately $7.8 million in fiscal 2013 to approximately $7.1 million in fiscal 2014. The lower general and administrative expenses in fiscal 2014 as compared to fiscal 2013 principally reflect a decrease of approximately $0.5 million of expenses related to Griffin's non-qualified deferred compensation plan and a decrease in donation and contributions expense of approximately $0.2 million, partially offset by a net increase of approximately $0.1 million in all other general and administrative expenses. The decrease in expenses of the non-qualified deferred compensation plan reflects the effect on participant balances of generally lower stock market performance during fiscal 2014 as compared to fiscal 2013., 516960=Balance at December 3, 2011, 320555=        In fiscal 2014, Griffin Land entered into an agreement to sell approximately 29 acres of an approximately 45 acre land parcel of undeveloped land in Griffin Center for a purchase price of a minimum of $3.25 million, subject to adjustment based on the actual number of acres conveyed. Completion of this transaction is subject to significant contingencies, including the satisfactory completion of due diligence by the purchaser (a public educational authority in the state of Connecticut) and the purchaser obtaining a commitment from the State of Connecticut to fund the land acquisition and develop the property as planned by the purchaser. If this sale were to be completed, the development potential of the remaining approximately 16 acres of that land parcel may be severely limited. The due diligence period does not expire until fiscal 2016. There is no guarantee that this transaction will be completed under the current terms, or at all., 319860=        Griffin's 5.73% nonrecourse mortgage loan with a balance of approximately $18.2 million as of November 30, 2014 matures on August 1, 2015 with a payment of approximately $18.0 million due on that date. Three industrial buildings in Tradeport, with an aggregate of approximately 392,000 square feet, collateralize this mortgage loan. Griffin expects to refinance this mortgage at its maturity. There is no guarantee that such refinancing will be available for the entire amount of the nonrecourse mortgage loan that is due or on terms acceptable to Griffin., 258038=        In fiscal 2014, Griffin incurred a net loss of approximately $1.1 million as compared to a net loss of approximately $5.8 million in fiscal 2013. The lower net loss in fiscal 2014 as compared to fiscal 2013 reflects a significant loss from discontinued operations in fiscal 2013 and a loss from continuing operations in fiscal 2014 as compared to income from continuing operations in fiscal 2013. Griffin incurred a loss from continuing operations of approximately $1.2 million in fiscal 2014 as compared to income from continuing operations of approximately $1.9 million in fiscal 2013. The lower results from continuing operations in fiscal 2014 as compared to fiscal 2013 is due in large part to a decrease in the gain from investment sales and lower gain on land sales in fiscal 2014 as compared to fiscal 2013, partially offset by lower general and administrative expenses in fiscal 2014 as compared to fiscal 2013. Rental revenue less the operating expenses of rental properties increased from approximately $12.6 million in fiscal 2013 to approximately $12.8 million in fiscal 2014., 1153651=        Stock options granted expire ten years from the grant date. In accordance with the 2009 Stock Option Plan, stock options granted to non-employee directors upon their initial election to the board of directors are fully exercisable immediately upon the date of the option grant. Stock options granted to, 285607=        Griffin's revenue increased from approximately $24.2 million in fiscal 2012 to approximately $25.5 million in fiscal 2013, reflecting an increase of approximately $1.6 million in rental revenue in fiscal 2013 as compared to fiscal 2012, partially offset by a decrease of approximately $0.3 million of revenue from property sales in fiscal 2013 as compared to fiscal 2012. The increase in rental revenue in fiscal 2013 as compared to fiscal 2012 was almost entirely due to higher occupancy in Griffin Land's rental properties in fiscal 2013 as compared to fiscal 2012. The net increase in rental revenue principally reflected: (a) an increase of approximately $2.1 million of rental revenue in fiscal 2013 due to leasing previously vacant space in buildings that were in service the entire year in both fiscal 2013 and fiscal 2012; and (b) an increase of approximately $0.5 million of rental revenue in fiscal 2013 from the commencement of a full building lease of the Lehigh Valley industrial building that was completed at the end of the fiscal 2012 third quarter; partially offset by (c) a decrease of approximately $0.9 million in rental revenue from leases that expired and were not renewed or terminated early., 47664=November 30, 2014, 910277=        At the beginning of fiscal 2013, Griffin held an approximate 14% equity interest in SNHC, which operated a landscape nursery distribution business. Griffin accounted for its investment in SNHC under the cost method of accounting for investments. Prior to fiscal 2013, Griffin had received cash distributions from SNHC which were treated as a return of investment. Accordingly, Griffin did not have any remaining book value in its investment in SNHC as of December 1, 2012. In fiscal 2013, Griffin sold its investment in SNHC for total cash proceeds of $3,418, resulting in a pretax gain of $3,397., 305745=        Net cash provided by operating activities was approximately $4.3 million in fiscal 2014 as compared to net cash used in operating activities of approximately $0.6 million in fiscal 2013. Net cash provided by operating activities of continuing operations was approximately $4.2 million in fiscal 2014, as compared to approximately $1.2 million in fiscal 2013. The increase in net cash provided by operating activities of continuing operations in fiscal 2014 as compared to fiscal 2013 principally reflects an increase of approximately $3.2 million in deferred rental revenue in fiscal 2014 as compared to fiscal, 897896=        At the beginning of fiscal 2013, Griffin held 5,277,150 shares of Centaur Media common stock. In fiscal 2014 and fiscal 2013, Griffin sold 500,000 and 2,824,688 shares, respectively, of its Centaur Media common stock for total cash proceeds of $566 and $2,487, respectively, after transaction costs. The sale of Centaur Media common stock resulted in a pretax gain of $318 and $1,088 in fiscal 2014 and fiscal 2013, respectively. Griffin held 1,952,462 shares of Centaur Media common stock as of November 30, 2014., 195818=1370 Blue Hills Avenue, Bloomfield, CT, 318391=        In the fiscal 2014 fourth quarter, Griffin started site work on the Lehigh Valley land acquired in fiscal 2013 and fiscal 2014, and subsequent to the end of fiscal 2014 started construction on an approximately 280,000 square foot industrial building on that land. This is expected to be the first of two industrial buildings approved for this site that is expected to have a total of approximately 530,000 square feet of industrial space when fully developed. Griffin Land expects to spend a total of approximately $3.5 million (including the approximately $0.6 million spent in fiscal 2014) on site work on the Lehigh Valley land acquired in fiscal 2013 and fiscal 2014 that is expected to support the development of the two industrial buildings. Griffin Land also expects to spend approximately $10.0 million in fiscal 2015 for construction of this new building. Subsequent to the end of fiscal 2014, Griffin Land entered into a five-year lease for approximately 196,000 square feet of the Lehigh Valley industrial building being built. The tenant has an option to lease the balance of the building as specified under the lease terms. Griffin Land expects the completion of construction of this building and commencement of the lease of approximately 196,000 square feet to take place in the fiscal 2015 third quarter., 12682=         The aggregate market value of the Common Stock held by non-affiliates of the registrant was approximately $73,673,000 based on the closing sales price on The NASDAQ Stock Market LLC on May 30, 2014, the last business day of the registrant's most recently completed second quarter. Shares of Common Stock held by each executive officer, director and persons or entities known to the registrant to be affiliates of the foregoing have been excluded in that such persons may be deemed to be affiliates. This assumption regarding affiliate status is not necessarily a conclusive determination for other purposes., 933311=        The income tax provision in continuing operations for fiscal 2014, fiscal 2013 and fiscal 2012 is summarized as follows:, 1073188=        On March 11, 2014, Griffin terminated its postretirement benefits program. Accordingly, the remaining liability under the postretirement benefits program was reversed and all actuarial gains under the postretirement program that had been reflected in accumulated other comprehensive income were reclassified into net income in the 2014 second quarter. As essentially all of the participants in the postretirement benefits program had been employees of Imperial, and charges related to the postretirement benefits program had been included in the results of the landscape nursery business that is now presented as a discontinued operation, the effect of the termination of the postretirement benefits program is mostly reflected in the results of discontinued operations in Griffin's consolidated statement of operations for fiscal 2014., 1054654=        On June 6, 2014, a subsidiary of Griffin completed the refinancing of its nonrecourse mortgage loan (the \"GCD Mortgage Loan\") with Farm Bureau Life Insurance Company (\"Farm Bureau\") that was due April 1, 2016. The GCD Mortgage Loan is collateralized by a 165,000 square foot industrial building in Windsor, Connecticut. At the time of the refinancing, the GCD Mortgage Loan had a balance of $3,391 and an interest rate of 8.13%. The refinancing increased the loan amount to $7,868, reduced the interest rate to 5.09% and extended the loan term to fifteen years from the time of the refinancing, with payments based on a fifteen year amortization schedule., 27062=        In fiscal 2014, Griffin Land entered into three new leases of industrial/warehouse space for an aggregate of approximately 371,000 square feet and three new leases of office/flex space for an aggregate of approximately 38,000 square feet. The leasing of industrial space in fiscal 2014 included a five-year lease of approximately 201,000 square feet in an industrial building developed by Griffin Land in fiscal 2014 on land in the Lehigh Valley acquired in fiscal 2010. In fiscal 2014, Griffin Land also entered into a ten-year full building lease for approximately 138,000 square feet in one of its industrial buildings in New England Tradeport (\"Tradeport\"), Griffin Land's industrial park in Windsor and East Granby, Connecticut. In fiscal 2014, leases of industrial space aggregating approximately 43,000 square feet expired and were not renewed, and a tenant's lease of industrial space increased by approximately 47,000 square feet as the remaining vacant space in the building leased was added to its leased space in accordance with the lease terms. The net effect of these transactions was an increase of approximately 374,000 square feet in industrial space under lease in fiscal 2014, while office/flex space under lease was essentially unchanged at the end of fiscal 2014 as compared to the end of fiscal 2013. Griffin Land also renewed and extended several leases aggregating approximately 27,000 square feet of office/flex space and approximately 11,000 square feet of industrial space in fiscal 2014., 209058=2013, 140749=        In fiscal 2010, Griffin Land acquired a fully-leased approximately 120,000 square foot industrial building in Breinigsville, Pennsylvania and a 51 acre parcel of undeveloped land in Lower Nazareth, Pennsylvania, known as Lehigh Valley Tradeport. Subsequently, Griffin Land built, on speculation, two industrial buildings in Lehigh Valley Tradeport and has started construction of another industrial building on approximately 50 acres of undeveloped land in Hanover Township, Pennsylvania that was acquired in fiscal 2013 and fiscal 2014. These acquisitions were Griffin Land's first purchases of properties outside of the Hartford, Connecticut market where Griffin Land's core real estate holdings are located. Griffin Land expects to continue to seek to acquire properties outside of the Hartford, Connecticut market. Operating in a real estate market that is new for Griffin Land creates additional risks and uncertainties to Griffin's operations., 1058776=        On December 31, 2014, two subsidiaries of Griffin, closed on a new mortgage (\"the 2025 First Niagara Mortgage\") for $21,600. The 2025 First Niagara Mortgage refinanced the 2023 First Niagara Mortgage and is collateralized by the same 228,000 square foot industrial building in Lower Nazareth, Pennsylvania along with an adjacent 303,000 square foot industrial building. Griffin received net, 28701=        In fiscal 2013, Griffin Land entered into three new leases of industrial space for an aggregate of approximately 259,000 square feet and several new leases of office/flex space for an aggregate of approximately 49,000 square feet. The new leasing of industrial space reflected a five-year full building lease of the approximately 228,000 square foot industrial building in the Lehigh Valley and approximately 31,000 square feet in Griffin Land's Tradeport industrial/warehouse buildings. Also in fiscal 2013, several leases of industrial space aggregating approximately 168,000 square feet expired and were not renewed. The net effect of these transactions was an increase of approximately 92,000 square feet of industrial space under lease as of November 30, 2013 as compared to December 1, 2012. In fiscal 2013, two leases for office/flex space aggregating approximately 24,000 square feet expired and were not renewed or terminated early. In fiscal 2013, Griffin Land renewed and extended several leases aggregating approximately 116,000 square feet of industrial space and approximately 20,000 square feet of office/flex space. Included in the fiscal 2013 lease renewals was a full building lease of approximately 100,000 square feet that was scheduled to expire in fiscal 2014 but was extended for ten years.}",
    "lastModified": "Fri, 13 Feb 2015 15:52:06 GMT",
    "textBeforeTable": "FORM 10-K UNITED STATES SECURITIES AND EXCHANGE COMMISSION WASHINGTON, D.C. 20549   10-K a2222978z10-k.htm 1 10-K",
    "textAfterTable": "Large accelerated filer o   Accelerated filer ý   Non-accelerated filer o (Do not check if a smaller reporting company)   Smaller reporting company o          Indicate by check mark whether the registrant is a shell company (as defined in Rule 12b-2 of the Act). Yes o    No ý          The aggregate market value of the Common Stock held by non-affiliates of the registrant was approximately $73,673,000 based on the closing sales price on The NASDAQ Stock Market LLC on May 30, 2014, the last business day of the registrant's most recently completed second quarter. Shares of Common Stock held by each executive officer, director and persons or entities known to the registrant to be affiliates of the foregoing have been excluded in that such persons may be deemed to be affiliates. This assumption regarding affiliate status is not necessarily a conclusive determination for other purposes.          As of February 6, 2015, 5,149,574 shares of common stock were outstanding.",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}