{
    "relation": [
        [
            "Bobby Deren scarletnation.com",
            "Rutgers may have better overall numbers this season, but there was a serious offensive drought last weekend in Piscataway when a subpar Houston defense held Rutgers to just 14 points. Quarterback Gary Nova was a big part of that drought as RU managed just 48 first-half passing yards against what was a Houston pass defense that ranked 117th in the nation. Rutgers is also without its top tailback in Paul James. Justin Goodwin has filled in adequately but struggles in the RU passing game is a major concern for the offense as a whole. Meanwhile, Temple quarterback P.J. Walker is emerging as one of the more exciting freshmen in the country. His ability to run the ball as well as hurt teams with his arm makes him a very dangerous weapon. At this point in the season, Walker trumps every quarterback on the RU roster and his emergence swings this one in the favor of Temple.",
            "Justin Goodwin. He may have to literally carry Rutgers to victory. Goodwin carried 31 times last weekend against Houston and that number could grow. With the Rutgers passing game in shambles, a solid and consistent ground attack could do wonders for both the RU offense and defense. Keeping Temple's defense on the field while the Rutgers defense watches Goodwin grind out yards is a major key to a Rutgers victory. This season, Nova and the RU defense has proven to be unreliable so Goodwin might have to take things on himself.",
            "It's tough to give an advantage to either team as both defenses have been consistently bad all season. Temple ranks 120th in the nation while Rutgers ranks 84th in total defense. However, RU has been so bad against the pass that teams don't always need to revert to the run. RU first-year defensive coordinator Dave Cohen has been overmatched and outcoached on multiple occasions. The Rutgers secondary has resorted to summoning a wide receiver [Ruhann Peele] to help out a depleted secondary. P.J. Walker is likely to have a field day throwing against the Scarlet Knights. But as bad as Rutgers has been, Temple has been worse. RU gets a slight advantage in the battle of bad defenses.",
            "The Rutgers secondary. True freshman Anthony Cioffi and junior Gareef Glashen are now the projected starters at the cornerback position. But all the the RU cornerbacks will have to play well against a dangerous P.J. Walker. The safety situation looks even grimmer with starting strong safety Lorenzo Waters likely to miss the game with an ankle issue. That means the safety position will depend on solid play from Jeremy Deering, Johnathan Aiken and Tejay Johnson. The secondary has been routinely shredded this year and if that continues, Temple could very well pull off the upset. When all is said and done on Saturday, a look back at the play of the Rutgers secondary will be a prime indicator as to which team came out on top.",
            "Rutgers. Blocking kicks is a forte of the RU special teams as the Scarlet Knights continue to be one of the best in the nation in that category. Return man Janarion Grant has been an exceptional weapon and is a threat to score every time he touches the football. The RU kicking game has not exactly been reliable this season but there has not been many occasions of late when head coach Kyle Flood has turned to Kyle Federico for a field goal. Punting has been an upgrade as Nick Marsh has been solid. Meanwhile, Temple has not been able to make much of a special teams impact this season. This is one of the few categories where there a decisive advantage swings Rutgers' way.",
            "Both teams have an equal chance simply because both defenses have trouble stopping anyone late in the game. Rutgers saw its defense falter late in the game against Fresno State, SMU and Louisville. The defense did not have to fold in the fourth quarter against Houston because the game was well in hand by that point in time. It was also the same Houston team that Temple played tight until the very end. One of the biggest concerns with the RU defense is that it seems to be less effective as the game goes on. Temple falls into the same category as the Owls surrendered 45 second-half points last weekend against SMU. Whichever offense has the ball last in this one has the best chance of driving the length of the field.",
            "Both defenses are bad. Both defenses have also shown a consistent trend to falter in the second half. For me, it comes down to which quarterback will be able to take better advantage of these lackluster defenses. Rutgers fans have seen the Gary Nova show play out before and he looks to be regressing. On the other side of things, Temple's P.J. Walker is just starting to come into his own as a starting college quarterback. This one looks like it will be a shootout and could be decided by which quarterback has a better day. If I had to choose between Nova and Walker, I'll take Walker every day of the week and twice on Sundays. Temple pulls off the upset in Piscataway. Temple 42 Rutgers 41."
        ],
        [
            "",
            "Which team has the more potent offense?",
            "Who is the Offensive 'X Factor,' and why?",
            "Which team has the better defense?",
            "Who is the defensive 'X Factor,' and why?",
            "Who has the edge on special teams?",
            "If the game comes down to a final drive, which team drives the length of the field?",
            "Which team will win?"
        ],
        [
            "John Di Carlo owlscoop.com",
            "Temple is riding a little bit of momentum right now. For a 1-7 team, they have some optimism right now on offense. A lot of the credit there goes to P.J. Walker because of the shot in the arm he's given them. Last week against SMU, he completed 16 of his first 17 passes and finished 26-of-37 from 293 yards and four passing touchdowns. And Robby Anderson has given them their really first dynamic wideout since Rob Streater who was really under utilized. Temple is starting to find its stride offensively for the first time and that's what kept them in the game against SMU. Rutgers looks good in the run game but the passing game is a huge question mark right now. I'll give Temple a slight edge because the type of game Rutgers is coming off and also because of their uncertainty at quarterback.",
            "P.J. Walker. He has really set the tone for Temple and may be the type of player who can open up the run game a little bit. Rutgers is very good against the run right now but Walker may be able to keep the RU defense honest. And he hasn't really been outwardly saying it at practice this week, but I think Walker will go up there with a little bit of a chip on his shoulder. I think he is going to go up there saying 'I am going to prove you guys wrong for not recruiting me as a quarterback.' He is somebody who can really make a difference in the game.",
            "I have to give the edge to Rutgers. I know they've been bad against the pass and it might be the reason why Temple has a chance to win this game. But Rutgers has been stout against the run and they have more proven playmakers at this point. Tyler Matakevich has been good but he can't do it by himself. When you look at Rutgers, they have guys like Steve Longa and Marcus Thompson who have been getting to the quarterback a little bit. Temple has not able to mount any kind of consistent pass rush. Temple has just not been able to be consistent enough as a defense. That's one area where they really need to rebuild. Last week, they wore down in the second half against SMU and gave up 45 points.",
            "Nate Smith. He is another guy who will play with a bit of a chip on his shoulder because he wanted to go to Rutgers like his brother L.J., and he never received a Rutgers offer. He plays well and if he is motivated, he is athletic enough to be a tackling machine. He might be a guy who could at least make a couple of plays potentially behind the line and maybe hold Justin Goodwin in check. If Temple does that, they have a shot. They experimented with Nate a few weeks ago at defensive end and it looks like they have him back at linebacker. If he can rush the edge and get a hit in on the Rutgers quarterback, he could be an x-factor. Temple knows what they will get out of Matakevich but Smith could push his game a little over the edge and make a couple of plays.",
            "Rutgers. Temple's lone strength has been Paul Layton. Statistically speaking, he has been one of the best punters in the country. He is a fifth-year kid who played at Albany and was immediately eligible this year. But Temple's kicking game has really struggled. They brought in two freshman kickers, both who were really good in high school. Jim Cooper was an Army All-American from Mainland (NJ) and he struggled early and lost his job to Nick Visco. But Temple has kicked only one field goal this year and Visco kicked that. If the game comes down to a field goal, Rutgers can at least go to Kyle Fedrico. Visco hasn't proven himself yet.",
            "Rutgers gets the edge in this one. Temple's defense just hasn't been able to get off the field on third down. They did in the first half last week against SMU. It was kind of encouraging but they couldn't sustain it in the second half. I know Rutgers fans are pretty upset with what is going on at quarterback right now. But as much as they are struggling, at least Gary Nova has done it before, some way, somehow. They could call upon that experience. I just think Rutgers has that intangible if it is a tie game and they have the ball last. Even though Rutgers has been inconsistent this year, they have an edge in experience and a running back who has proven himself.",
            "I am going to go out on a limb in spite of all Temple's struggles. I am going to say this is the week that Nick Visco gets a field goal early in the game and P.J. Walker continues to play well. The Temple defense will play just well enough to win and get a gift interception from either Nova or [Chas] Dodd. I think this week is tailor made for a Temple upset just because the way Rutgers' defense has struggled. Temple is also catching them at the right time with all the quarterback struggles and inconsistency. P.J. Walker has given life to the Temple offense and the Owl defense will make just enough plays. Temple 31 Rutgers 28."
        ]
    ],
    "pageTitle": "ScarletNation.com - Rutgers vs Temple: Who has the edge?",
    "title": "",
    "url": "https://rutgers.rivals.com/content.asp?CID=1569162",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042981576.7/warc/CC-MAIN-20150728002301-00249-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 896326844,
    "recordOffset": 896310883,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{1928=Rivals.com is your source for: College Football | Football Recruiting | College Basketball | Basketball Recruiting | College Baseball | High School | College Merchandise Site-specific editorial/photos © 2006 ScarletNation.com. All rights reserved. This website is an officially and independently operated source of news and information not affiliated with any school or team. About | Advertise with Us | Contact | Privacy Policy | About our Ads | Terms of Service | Copyright/IP policy | Yahoo! Sports - NBC Sports Network Statistical information ©2014 STATS LLC All Rights Reserved.}",
    "TableContextTimeStampAfterTable": "{41654=November 1, 2013, 61424=Analysis: Buckeyes add 2017 DB}",
    "textBeforeTable": "After suffering 2 straight defeats, Rutgers welcomes Temple to High Point Solutions Stadium on Saturday. The 1-7 Owls put a scare in SMU behind a 49 point offensive outburst. Will the Owl offense put up a fight against the reeling Rutgers defense? Which team has the edge? We asked our resident experts! November 1, 2013 Rutgers vs Temple: Who has the edge? Bobby Deren and John DiCarlo Scarlet Knight Shop Freelance Opportunities Rutgers on Ebay",
    "textAfterTable": "Talk about it in The Round Table FEATURED PRODUCT Nike Rutgers Scarlet Knights Scarlet Fly 3.0 Shorts Rutgers NEWS [More] Latest Headlines:",
    "hasKeyColumn": true,
    "keyColumnIndex": 1,
    "headerRowIndex": 0
}