{
    "relation": [
        [
            "Year",
            "1944",
            "1942",
            "1946",
            "1947",
            "1940"
        ],
        [
            "Rank",
            "4",
            "7",
            "10",
            "11",
            "21"
        ],
        [
            "Title",
            "“'Round Midnight”",
            "“Lover Man (Oh, Where Can You Be)”",
            "“Stella By Starlight”",
            "“Autumn Leaves (Les Feuilles Mortes)”",
            "“How High the Moon”"
        ]
    ],
    "pageTitle": "Jazz History: The Standards (1940s)",
    "title": "",
    "url": "http://www.jazzstandards.com/history/history-4.htm",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988860.4/warc/CC-MAIN-20150728002308-00056-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 539989882,
    "recordOffset": 539981680,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{167=Introduction  Early Period  1920s  1930s  1940s  1950s  1960s  1970s-2000}",
    "TableContextTimeStampAfterTable": "{14814=Here’s a brief list of tunes that were million sellers in the decade. Those underlined are part of the top 1000 jazz standards list., 7878=In March, 1940, ASCAP (the American Society of Composers, Artists and Producers), proposed a new contract increasing by 100 percent the royalties they received from broadcast use. In retaliation broadcasters created their own organization, BMI (Broadcast Music Incorporated) and began signing non-ASCAP songwriters. By the end of 1940, 650 broadcasters signed with BMI compared with only 200 who continued with ASCAP. At the end of 1941 ASCAP negotiated a new contract, but the “ban” of ASCAP material by many broadcasters had a substantial effect on popular music. Many of the artists BMI signed during the ban were country or western swing artists, who subsequently received considerable airplay and a rise in the popularity of western music., 8644=Then in August, 1942, American Federation of Musicians president James C. Petrillo initiated a ban on recording, in hopes of coercing record companies into returning part of their profits to the union to be used for special concerts and projects. This forced the record companies to focus on recording singers and singing groups and reissuing previously recorded material. The ban lasted until Decca Records capitulated in September, 1943, but it would be another 14 months before RCA and Columbia would give in. Consequently the recording ban further weakened the popularity that the big bands had, and by the end of the decade the swing era had given way to the era of the pop singer., 38551=Copyright 2005-2012 - JazzStandards.com - All Rights Reserved      Permission & contact information}",
    "lastModified": "Thu, 30 Aug 2012 00:33:17 GMT",
    "textBeforeTable": "Jazz Standards from the 1940s In general, tunes that became jazz standards from the 1940s tended to be from Tin Pan Alley, with Broadway show tunes being replaced by tunes from movies (for example, “Chattanooga Choo Choo”). There was a higher proportion of numbers written and performed by jazz artists like “Night in Tunisia,” “Perdido,” “Good Bait” and “Four Brothers.” “On a Slow Boat to China” “Buttons and Bows” “You Always Hurt the One You Love” “Paper Doll” “You Made Me Love You” “Chattanooga Choo Choo” “God Bless the Child” “Take the ‘A’ Train” “White Christmas” “Sentimental Journey” “Rum and Coca-Cola” “Tuxedo Junction” “In the Mood” Music from the 1940s reflected a wide spectrum of tastes, ranging from swing band numbers like “In the Mood,” “Tuxedo Junction” and “Take the ‘A’ Train,” to strictly Tin Pan Alley tunes like “Paper Doll” and “Buttons and Bows.” Here’s a brief list of tunes that were million sellers in the decade. Those underlined are part of the top 1000 jazz standards list.",
    "textAfterTable": "Click here to see the full list for this period Related Reading and Viewing The Birth of Bebop: A Social and Musical History Scott Deveaux Paperback: 587 pages University of California Press 1940\u0092s Jazz: The Small Groups - New Directions Various Artists CD",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}