{
    "relation": [
        [
            "Play Type",
            "Substitution",
            "Out",
            "Out",
            "Error-reached-base",
            "Out"
        ],
        [
            "Play",
            "Mike Carp remains in the game at designated hitter.",
            "Brian Dozier struck out swinging. None on with one out and Joe Mauer due up.",
            "Joe Mauer grounded out second to first. None on with two outs and Eduardo Escobar due up.",
            "Eduardo Escobar reached first on Stephen Drew's fielding error. Runner on first with two outs and Justin Morneau due up.",
            "Justin Morneau flied out to left to end the inning."
        ]
    ],
    "pageTitle": "Monday, May 6, 2013 Minnesota Twins - Boston Red Sox Box Scores, Game Results & Summary - USATODAY.com",
    "title": "",
    "url": "http://content.usatoday.com/sportsdata/baseball/mlb/game/Twins_RedSox/2013/5/6",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987135.9/warc/CC-MAIN-20150728002307-00078-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 61609995,
    "recordOffset": 61599365,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{2345=View all MLB box scores for 5/6/2013}",
    "TableContextTimeStampAfterTable": "{42004=Boston's Clay Buchholz, who posted a spectacular 1.01 ERA in winning each of his first six starts of 2013, was reached for four runs over a season-low six innings. Counterpart Vance Worley permitted three runs on nine hits through five-plus frames for Minnesota.}",
    "textBeforeTable": "Top of the 1st Lance Barksdale  3B Ed Hickox  2B Jeff Nelson  1B Cory Blaser  H Umpires 3.78 26 42 1 2 0 0 1 2.1 Clayton Mortensen (W, 1-2) 9.82 10 20 1 1 1 1 1 0.2 Joel Hanrahan (BS, 2) 0.00 10 12 1 0 0 0 0 1 Craig Breslow  3.12 8 10 2 0 0 0 0 0.2 Andrew Miller  1.86 10 18 1 1 0 0 1 0.1 Alex Wilson  1.60 78 116 9 2 4 4 7 6 Clay Buchholz  ERA Strikes Pitches SO BB ER R H IP Name 2.08 \" xmlns:fo=\"http://www.w3.org/1999/XSL/Format\" />Red Sox pitching http://i.usatoday.net/_common/_images/_sports/logos/mlb/redsox_22t.png 11 13 0 0 1 1 3 0.2 Jared Burton (L, 0-1) 2.37 34 54 4 1 0 0 2 3 Anthony Swarzak  5.11 20 30 0 0 2 2 2 1 Casey Fien (BS, 2) 1.80 8 19 1 1 0 0 1 1 Brian Duensing (H, 5) 6.95 61 89 3 0 3 3 9 5 Vance Worley  ERA Strikes Pitches SO BB ER R H IP Name \" xmlns:fo=\"http://www.w3.org/1999/XSL/Format\" />Twins pitching http://i.usatoday.net/_common/_images/_sports/logos/mlb/twins_22t.png",
    "textAfterTable": "Walk Trevor Plouffe walked. Bases loaded with one out and Oswaldo Arcia due up. Out Oswaldo Arcia struck out swinging. Bases loaded with two outs and Aaron Hicks due up. Out Aaron Hicks struck out swinging to end the inning. Bottom of the 1st Play Type Play Out Jacoby Ellsbury grounded out to first. None on with one out and Shane Victorino due up. Single Shane Victorino singled to center. Runner on first with one out and Dustin Pedroia due up. Out Dustin Pedroia grounded into a double play, second to short to first. On the play, Shane Victorino out at second to end the inning. Top of the 2nd Play Type Play Out Pedro Florimon struck out looking. None on with one out and Brian Dozier due up. Out Brian Dozier struck out looking. None on with two outs and Joe Mauer due up. Out Joe Mauer grounded out first to pitcher to end the inning. Bottom of the 2nd Play Type Play Out David Ortiz flied out to center. None on with one out",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}