{
    "relation": [
        [
            "WCF — Chapter XXII: Of Lawful Oaths and Vows",
            "1. A lawful oath is a part of religious worship, wherein upon just occasion, the person swearing solemnly calleth God to witness what he asserteth or promiseth; and to judge him according to the truth or falsehood of what he sweareth.",
            "2. The name of God only is that by which men ought to swear, and therein it is to be used with all holy fear and reverence; therefore to swear vainly or rashly by that glorious and dreadful name, or to swear at all by any other thing, is sinful, and to be abhorred. Yet, as, in matters of weight and moment, an oath is warranted by the Word of God, under the New Testament, as well as under the Old, so a lawful oath, being imposed by lawful authority, in such matters ought to be taken.",
            "3. Whosoever taketh an oath ought duly to consider the weightiness of so solemn an act, and therein to avouch nothing but what he is fully persuaded is the truth. Neither may any man bind himself by oath to any thing but what is good and just, and what he believeth so to be, and what he is able and resolved to perform. Yet it is a sin to refuse an oath touching any thing that is good and just, being imposed by lawful authority.",
            "4. An oath is to be taken in the plain and common sense of the words, without equivocation or mental reservation. It can not oblige to sin; but in any thing not sinful, being taken, it binds to performance, although to a man's own hurt: nor is it to be violated, although made to heretics or infidels.",
            "5. A vow is of the like nature with a promissory oath, and ought to be made with the like religious care, and to be performed with the like faithfulness. 6. It is not to be made to any creature, but to God alone: and that it may be accepted, it is to be made voluntarily, out of faith and conscience of duty, in way of thankfulness for mercy received, or for obtaining of what we want; whereby we more strictly bind ourselves to necessary duties, or to other things, so far and so long as they may fitly conduce thereunto. 7. No man may vow to do any thing forbidden in the Word of God, or what would hinder any duty therein commanded, or which is not in his own power, and for the performance of which he hath no promise or ability from God. In which respects, monastical vows of perpetual single life, professed poverty, and regular obedience, are so far from being degrees of higher perfection, that they are superstitious and sinful snares, in which no Christian may entangle himself."
        ],
        [
            "SDFO — Chapter XXIII: Of Lawful Oaths and Vows",
            "1. A lawful oath is a part of religious worship, wherein the person swearing in truth, righteousness and judgment, solemnly calleth God to witness what he asserteth or promiseth, and to judge him according to the truth or falsehood of what he sweareth.",
            "2. The name of God only is that by which men ought to swear, and therein it is to be used with all holy fear and reverence. Therefore to swear vainly, or rashly, by that glorious or dreadful name, or to swear at all by any other thing, is sinful and to be abhorred. Yet as in matters of weight and moment an oath is warranted by the Word of God under the New Testament, as well as under the Old; so a lawful oath, being imposed by lawful authority in such matters, ought to be taken.",
            "3. Whosoever taketh an oath, warranted by the Word of God, ought duly to consider the weightiness of so solemn an act, and therein to avouch nothing but what he is fully persuaded is the truth: neither may any man bind himself by oath to any thing, but what is good and just, and what he believeth so to be, and what he is able and resolved to perform. Yet it is a sin to refuse an oath touching any thing that is good and just, being lawfully imposed by authority.",
            "4. An oath is to be taken in the plain and common sense of the words, without equivocation or mental reservation. It cannot oblige to sin, but in any thing not sinful, being taken it binds to performance, although to a man's own hurt; nor is it to be violated, although made to heretics or infidels.",
            "5. A vow, which is not to be made to any creature, but God alone, is of the like nature with a promissory oath, and ought to be made with the like religious care, and to be performed with the like faithfulness. 6. Popish monastical vows of perpetual single life, professed poverty, and regular obedience, are so far from being degrees of higher perfection, that they are superstitious and sinful snares, in which no Christian may entangle himself."
        ],
        [
            "LBCF/PCF — Chapter XXIII/XXIV: Of Lawful Oaths and Vows",
            "1. A lawful oath is a part of religious worship, wherein the person swearing in truth, righteousness, and judgement, solemnly calleth God to witness what he sweareth, and to judge him according to the truth or falseness thereof.",
            "2. The name of God only is that by which men ought to swear; and therein it is to be used, with all holy fear and reverence; therefore to swear vainly or rashly by that glorious and dreadful name, or to swear at all by any other thing, is sinful, and to be abhorred; yet as in matters of weight and moment, for confirmation of truth, and ending all strife, an oath is warranted by the word of God; so a lawful oath being imposed by lawful authority in such matters, ought to be taken.",
            "3. Whosoever taketh an oath warranted by the Word of God, ought duly to consider the weightiness of so solemn an act, and therein to avouch nothing but what he knoweth to be truth; for that by rash, false, and vain oaths, the Lord is provoked, and for them this land mourns.",
            "4. An oath is to be taken in the plain and common sense of the words, without equivocation or mental reservation.",
            "5. A vow, which is not to be made to any creature, but to God alone, is to be made and performed with all religious care and faithfulness; but popish monastical vows of perpetual single life, professed poverty, and regular obedience, are so far from being degrees of higher perfection, that they are superstitious and sinful snares, in which no Christian may entangle himself."
        ]
    ],
    "pageTitle": "Tabular Comparison of 1646 WCF, 1658 Savoy Declaration, the 1677/1689 LBCF, and the 1742 PCF",
    "title": "",
    "url": "http://www.proginosko.com/docs/wcf_sdfo_lbcf.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042981576.7/warc/CC-MAIN-20150728002301-00160-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 666746419,
    "recordOffset": 666692493,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{298941=Copyright © Don Lowe & James N. Anderson 2007}",
    "lastModified": "Wed, 10 Aug 2011 13:13:41 GMT",
    "textBeforeTable": "Jump to chapter: I, II, III, IV, V, VI, VII, VIII, IX, X, XI, XII, XIII, XIV, XV, XVI, XVII, XVIII, XIX, XX, XXI, XXII, XXIII, XXIV, XXV, XXVI, XXVII, XXVIII, XXIX, XXX, XXXI, XXXII Jump to chapter: I, II, III, IV, V, VI, VII, VIII, IX, X, XI, XII, XIII, XIV, XV, XVI, XVII, XVIII, XIX, XX, XXI, XXII, XXIII, XXIV, XXV, XXVI, XXVII, XXVIII, XXIX, XXX, XXXI, XXXII Jump to chapter: I, II, III, IV, V, VI, VII, VIII, IX, X, XI, XII, XIII, XIV, XV, XVI, XVII, XVIII, XIX, XX, XXI, XXII, XXIII, XXIV, XXV, XXVI, XXVII, XXVIII, XXIX, XXX, XXXI, XXXII, XXXIII The 1677/1689 London",
    "textAfterTable": "6. The whole counsel of God, concerning all things necessary for his own glory, man's salvation, faith, and life, is either expressly set down in Scripture, or by good and necessary consequence may be deduced from Scripture: unto which nothing at any time is to be added, whether by new revelations of the Spirit, or traditions of men. Nevertheless we acknowledge the inward illumination of the Spirit of God to be necessary for the saving understanding of such things as are revealed in the Word; and that there are some circumstances concerning the worship of God, and the government of the Church, common to human actions and societies, which are to be ordered by the light of nature and Christian prudence, according to the general rules of the Word, which are always to be observed. 6. The whole counsel of God concerning all things necessary for his own glory, man's salvation, faith and life, is either expressly set down in Scripture, or by good and necessary consequence may be deduced from Scripture; unto which nothing at any time is to be added, whether by new revelations of the Spirit, or traditions of men. Nevertheless we acknowledge the inward illumination of the Spirit of God to be necessary for the saving understanding of such things as are revealed in the Word: and that there are some circumstances concerning the worship of God and government of the Church, common to human actions and societies,",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}