{
    "relation": [
        [
            "",
            "Raltegravir 400 mg b.i.d. + OBT",
            "Placebo + OBT"
        ],
        [
            "Description",
            "Raltegravir 400 mg b.i.d. plus OBT includes all participants initially randomized to raltegravir. Those who did not experience virologic failure by Week 156 may have continued into the open-label phase. During the open-label phase, these participants continued to receive raltegravir plus OBT until Week 240.",
            "Placebo plus OBT includes all participants initially randomized to placebo. Those who did not experience virologic failure by Week 156 may have continued into the open-label phase. During the open-label phase, these participants received raltegravir plus OBT until Week 240."
        ]
    ],
    "pageTitle": "A Study to Evaluate the Safety and Efficacy of Raltegravir (MK0518) in HIV-Infected Patients Failing Current Antiretroviral Therapies (0518-019) - Study Results - ClinicalTrials.gov",
    "title": "",
    "url": "https://clinicaltrials.gov/ct2/show/results/NCT00293254?sect=Xe015&view=results",
    "hasHeader": true,
    "headerPosition": "MIXED",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987135.9/warc/CC-MAIN-20150728002307-00316-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 859177662,
    "recordOffset": 859161724,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{2241=Phase 3; First Patient In: 08-Mar-2006; Last Patient Last Visit (LPLV) for Week 48: 31-Jul-2007; Extension Study LPLV Week 240: May 2011}",
    "textBeforeTable": "Reporting Groups Patients failed prior antiretroviral therapy (HIV RNA >1000 copies/mL), and had documented resistance to at least one drug in each class of licensed oral antiretroviral therapy (Nucleoside Reverse Transcriptase inhibitors, Non-Nucleoside Reverse Transcriptase Inhibitors, and Protease Inhibitors). All patients must have met laboratory criteria. Significant events and approaches for the overall study following participant enrollment, but prior to group assignment Pre-Assignment Details Phase 3; First Patient In: 08-Mar-2006; Last Patient Last Visit (LPLV) for Week 48: 31-Jul-2007; Extension Study LPLV Week 240: May 2011 53 sites (US, Brazil, Canada, Colombia, Mexico, and Puerto Rico). Key information relevant to the recruitment process for the overall study, such as dates of the recruitment period and locations Recruitment Details   Hide Participant Flow   Participant Flow Drug: raltegravir potassium Drug: Comparator: placebo Interventions:",
    "textAfterTable": "Participant Flow for 4 periods Period 1:   Primary Study - Double-Blind Week 0-48     Raltegravir 400 mg b.i.d. + OBT     Placebo + OBT   STARTED     232     119   Treated     230     119   Continuing in Double-Blind     177 [1]   55 [2] COMPLETED     177     55   NOT COMPLETED     55     64   Never Treated                 2            ",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}