{
    "relation": [
        [
            "",
            "",
            "",
            "Shares issued for cash",
            "Issue for cash",
            "Issue for cash",
            "Issue for cash",
            "Issue for cash",
            "",
            "",
            ""
        ],
        [
            "",
            "Date",
            "",
            "",
            "12/11/2012",
            "08/04/2013",
            "20/05/2013",
            "27/06/2013",
            "",
            "",
            ""
        ],
        [
            "Issue value per Share",
            "£",
            "",
            "",
            "0.33",
            "0.15",
            "0.15",
            "0.15",
            "",
            "",
            ""
        ],
        [
            "Par value per Share",
            "£",
            "",
            "",
            "0.05",
            "0.05",
            "0.05",
            "0.05",
            "",
            "",
            ""
        ],
        [
            "Share premium per Share",
            "£",
            "",
            "",
            "0.28",
            "0.10",
            "0.10",
            "0.10",
            "",
            "",
            ""
        ],
        [
            "Shares",
            "",
            "",
            "",
            "20,000,000",
            "8,800,000",
            "15,000,000",
            "15,000,000",
            "",
            "",
            "58,800,000"
        ],
        [
            "Share Capital",
            "£",
            "",
            "",
            "1,000,000",
            "440,000",
            "750,000",
            "750,000",
            "",
            "",
            "2,940,000"
        ],
        [
            "Share premium",
            "£",
            "",
            "",
            "5,600,000",
            "880,000",
            "1,500,000",
            "1,500,000",
            "",
            "",
            "9,480,000"
        ],
        [
            "Value of shares issued for cash",
            "£",
            "",
            "",
            "6,600,000",
            "1,320,000",
            "2,250,000",
            "2,250,000",
            "",
            "",
            "12,420,000"
        ]
    ],
    "pageTitle": "Final Results for period ended – Company Announcement - FT.com",
    "title": "",
    "url": "http://announce.ft.com/Detail/?DocKey=1323-11853891-18KEQGGRQ9S7I48VALJJJOOC85",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988860.4/warc/CC-MAIN-20150728002308-00050-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 8318135,
    "recordOffset": 8249244,
    "tableOrientation": "VERTICAL",
    "TableContextTimeStampBeforeTable": "{923=·        Gold shipped was 39,517 ounces for the year ended August 2013 compared to 52,616 ounces for the year ended August 2012. This was a result of both a lower grade delivered to the mill and lower tonnes., 3434=Final Results for the 12 months ended 31 August 2013, 3731=4 February 2014, 3263=Vatukoula Gold Mines Plc (AIM:VGM), the AIM listed gold producer, is pleased to announce its audited results for the year ended 31st August 2013.  Results are based on IFRS and expressed in Pounds Sterling  (£).}",
    "TableContextTimeStampAfterTable": "{68540=Gold prices have a significant impact on the Group's revenue, net profits and its ability to generate cash flows. In 2013 the price of Gold reached US$1,784 in October 2012 and traded as low as US$1,192 per ounce in June 2013. Our average realised gold price was US$1,537 per ounce., 37658=It is the development that we have achieved in the year that will assist in opening high-grade areas that will sustain production in the longer term. Over the coming first half year ending February 2014 this increase in capital development will continue to negatively impact our gold production. Subsequent to this, production from the Cayzer Prince ore body will come on stream and production should increase to targeted production levels., 204243=Balance at 31 August 2013, 123101=The CSA CPR reported the 2006 Mineral Resources, including the Tailings Mineral Resource, according to the JORC Code. No further estimates or data is available at the time of this report. AMC cannot verify the estimate and allocates a low reliability to the estimate., 20911=2014 will be a time of both change and consolidation for the Group. There have been a number of changes at both Board and Group executive committee level and there will be new challenges involved in implementing the Group's strategy., 576707=Balance at 1 September 2012, 80845=Depreciation and amortisation was £7.3 million for the year. This represents an increase of 12% from the prior year (£6.2 million). This increase is due to the higher capital investment base employed in late 2011 and in 2012 as a result of the accelerated development programme, capital equipment replacement programme and the rate of depreciation when compared to older capital development and equipment., 406620=The Finance Act 2013, which was substantively enacted on 2 July 2013, has reduced the main corporation tax rate to 23% from 1 April 2013, 21% from 1 April 2014 and 20% from 1 April 2015. This reduction has been taken into account when calculating deferred tax assets and liabilities. The changes are not expected to have a material cash impact on the company., 89203=EBITDA for the year ended 31 August 2013 was a loss of £8.9 million compared to a loss of £1.5 million in the prior year. This decrease was driven by decreases in production and lower average gold prices achieved during the years; this decrease was partly offset by lower mining costs., 88841=Other expenses amounted to £1 million in 2013 down from £1.5 million in the previous year. This decrease was primarily due to a reduction in provision against prepayments of more than one year which reduced to £0.3 million., 82869= Year ended 31 August 2012, 581595=Balance at 31 August 2013, 18720=In January 2013, Ian Stalker resigned from the board for personal reasons. Ian was appointed as a non-executive director in 2008 and was heavily involved in the initial commissioning of operations at the Vatukoula Gold Mine. His experience and knowledge was invaluable in planning the development of the Vatukoula Gold Mine., 19568=As part of the equity subscription agreement announced in May 2013, VGM agreed with DRK that they were entitled to nominate two directors for appointment to the board. The two directors appointed were Mr. Yongan Lu and Mr. Wei Li., 110210=2012, 95933=Intangible assets decreased from £36.8 million in 2012 to £32.8 million in 2013. The decrease is primarily attributable to the impairment charge incurred during the period of £3.3 million. The net book value of property, plant equipment and mine properties and development was £43.5 million (2012: £37.2 million). The main capital expenditure drivers being those outlined in the cash flow used in investing in activities section above, which were offset by amortisation and depreciation charges of £7.3 million (2012: £6.6 million)., 607598=© The Financial Times Ltd 2015 FT and 'Financial Times' are trademarks of The Financial Times Ltd., 87232=Administrative expenses totalled £2.3 million for the year ended August 2013 which was a 15% decrease in costs from the prior year of £2.8 million. The administrative expenses are those costs associated with maintaining the London office and the administrative expenses in Fiji not directly attributable to operating activities. Costs include salaries, office rent, regulatory, audit, legal fees and investor related expenses., 325916=2013, 122721=The Tailings Mineral Resource is an estimate developed by CSA Group Limited (CSA). In March 2008, CSA compiled an independent Competent Persons Report (CSA CPR), on behalf of River Diamonds, for inclusion in the application for readmission to trading on the Alternative Investment Market (AIM) of the London Stock Exchange., 434078=As at 31 August 2013, 119736=The information for the Waikatakata Mineral Resource is based on information compiled by Mrs Rachael Birch, who is a Member of the Australasian Institute of Mining and Metallurgy and a full-time employee of AMC Consultants Pty Ltd. Mrs Birch has sufficient relevant experience to be a Competent Person as defined by the JORC Code. Mrs Birch consents to the inclusion of this information in the form and context in which it appears. The Waikatakata Mineral Resource was first reported in 2012 and has not changed since., 46895=Year ended 31 August 2012, 249466=Vatukoula Gold Mines plc. is registered in England and Wales under number 5059077. The Company is governed by its articles of association and the principal statute governing the Company is the Companies Act 2006.  The Company's registered office is situated at Level 5, 2 More London Riverside, London, SE1 2AR. The Company is listed on the AIM market of the London Stock Exchange., 135509=2013, 452026=As at 1 September 2011, 96564=Total assets decreased from £90.7 million in 2012 to £86.5 million in 2013.  The decrease was for the large part due to a 39% decrease in current assets, which was driven by decreases in trade and other receivables and inventories., 62975=Year ended 31 August 2012, 494212=At 31 August 2013, 35582=On the 3rd of February 2014 we appointed Xuexin (Kevin) Zhu as General Manager of the Vatukoula Gold Mine. Xuexin is a professional mining engineer and PMI certified Project Management Professional with over twenty years' experience in corporate management, mine planning, engineering design, construction and operation management of open pit and underground precious and base metal mines., 327=Year ended 31 August 2013, 422890=Subsequent to year end the Group issued a total of 188,897,000 ordinary shares (note 13).  These share issues would have significantly changed the number of ordinary shares outstanding as at 31 August 2013, if the share issues had occurred before 31 August 2013., 95458=Zhongrun have informed the Group that it remains willing and will be able to complete the subscription for the secured loan notes. However as a result of administrative delays Zhongrun and the Group have agreed an extension of the time for payment until the end of February 2014., 597286=The Vatukoula Social Assistance Trust Fund (\"VSATF\") was established for the purpose of social assistance for the employees made redundant by the previous mine operator and the local mining community in accordance with the Trust Deed dated 18 December 2009., 58043=Total tonnes of ore, waste and capital mined for 2013 decreased by 17% to 397,995 tonnes compared to 2012. The lower tonnages were driven by decreases in strike drive development, which decreased from 4,034 metres to 1,682 metres representing a 58% decrease over the twelve months ending 31st August 2013., 77807=Year ended 31 August 2012, 25271=I firmly believe VGM is poised for growth and future success. With 2013 behind us, I take this opportunity to thank our employees for their tireless efforts and hard work; and acknowledge the support provided to the Company by all our stakeholders and suppliers., 110078=2013, 209424=Balance at 1 September 2011, 36936=Looking forward, the investment by Zhongrun allows us to make the necessary adjustments and positions the Company to increase production in 2014. The mine has a number of world class ore bodies, any one of which could be a mine by itself.  The mine is very shallow in international mining standards.  Deeper drilling has shown the continuation of ore bodies at depths of double our current deepest mining depth and exploration at Vatukoula has identified some very high grades.  Recent re-examination of the central Caldera has identified some indications of porphyry ore bodies and exploration will be undertaken in these areas over the coming year., 60161=The average grade decreased from 4.24 grams of gold per tonne in the year ending August 2012, to 3.81 grams of gold per tonne in the year ending August 2013. This was driven by lower grades delivered from underground operations., 555164=20/05/2013, 444674=Carrying value as at 31 August 2013, 10898=This is my first annual statement as VGM Chairman, having taken over from Colin Orr-Ewing as non-executive chairman of the board at the end of May 2013. I am honoured to serve as chairman of VGM and to tackle the challenges that VGM may encounter during one of the more difficult periods in the gold mining sector.  Nonetheless I have a firm belief in the Vatukoula Gold Mine and its potential. In a recent report,  by Natural Resource Holdings Ltd, the Vatukoula Gold Mine was ranked 212th   in terms of minerals resources among 580 mines, and ranked 29th among the top 50 producing mines by grade., 39128=VGM is the owner of the longest producing gold mine in Fiji. Operating for over 75 years, the mine has produced in excess of seven million ounces of gold. VGM acquired the mine in 2008 and aims to reach a sustainable and profitable production level. We are currently in our next phase of expansion at the mine, increasing our production from the current base of approximately 40,000 ounces per annum. The mine currently has 4.1 million ounces of Mineral Resources and 750,000 ounces of Mineral Reserves., 95161=In November 2013, and subsequent to the year end, the Group completed the first tranche of the US$40 million dollar financing via the placing of 188,897,000 new ordinary shares at 6.89 pence per share raising approximately £13 million, 15018=Another major factor influencing the gold price is China's strategy is to make its Renminbi (\"RMB\") freely exchangeable and as an international reserve currency. The Chinese government has been preparing for this since 1996 when China made RMB exchangeable under current account. To achieve its goal, China would have to substantially increase its current gold holding of 1,054 tonnes, which represents 1.2% of China's total foreign reserve of US$3.662 trillion in September 2013. In comparison, gold holding accounts for 50% to 70% of foreign reserves for the US and most of the European Union countries. In order to increases its gold holding to the global average of 10% of foreign reserves, China needs to acquire an additional 7,706 tonnes gold, in par with the US gold holding of 8,133 tonnes., 109426=The 2013 Mineral Resource estimate is compared to the 2012 Mineral Resource in Table 2., 97239=Total current liabilities for the year ended 31 August 2013 were £11.2 million, a decrease of £1.1 million from the balance of £12.3 million in 2012. This decrease is primarily driven by the decrease in trade payables as we reversed the trend of extending creditor terms in the previous year. Non-current liabilities decreased to £10.3 million from £10.4 million in the previous year. This decrease is the net result of an increase in employee related and mine rehabilitation provisions, and a decrease in the Deferred Tax Liability., 12996=Nonetheless commodity prices have always been cyclical in nature and the gold market is no exception. If the past events are any indication for the future, the gold market has now reached its bottom, and is poised to recover in the future years. Why? Over the last 20 years, since 1993, we have witnessed three major cycles for gold markets.  In January 1996, gold price reached its 7-year high at US$403 per ounce. A bear market followed, triggered by the 1997 Asian financial crisis. In January 2001, gold price reached its bottom at US$253 per ounce. This represents a 37.2% correction from its previous high. Then the gold price embarked on an initially gradual and later accelerated rise. In February 2008, gold price reached its 20 year high at US$973 per ounce.  This represents a 141% rise from its 2001 price.  This new high was followed by a major corrective phase triggered by the US financial crisis. In October 2008, gold price dropped to US$732 per ounce, representing a 24.8% correction over its previous high. This correction is then followed by another bull run in the gold market. In July 2011, gold price reached another new high of US$1,838 ounce, representing a 151% rise over its previous low; 3 quarters later in April 2013, because of the US monetary policy, the gold price fell to as low as US$1, 206 per ounce, representing a 34.4% drop from its previous high.  , 82734= Year ended 31 August 2013, 469763=The directors believe that there have been no indicators of impairment for the mining rights for the year ended 31 August 2013 (and 31 August 2012)., 218187=Balance at 31 Aug 2012, 90052=Year ended 31 August 2013, 429844=As at 1 September 2012, 130471=The Ore Reserve statement is based on mine design information prepared in 2012 under the supervision of Mr David Lee, who is a fulltime employee of AMC. The 2012 mining models were depleted with 31 August 2013 face positions to estimate the new Ore Reserve. The depletions were carried out by Mr Kevin Oborne, who is a full-time employee of VGMPLC, and reviewed by Mr Lee. Mr Oborne is a Member and Mr Lee is a Fellow of the Australasian Institute of Mining and Metallurgy. Mr Lee has sufficient relevant experience to be a Competent Person as defined by the JORC Code., 356089=2012, 556350=27/06/2013, 523182=At 31 August 2011, 469050=The Mining rights represent the mining rights acquired on the acquisition of the Vatukoula Gold Mine in April 2008. The amortisation of the Mining Rights is calculated on a unit of production basis, based on forecast production and the total Mineral Reserves.  At the current production, reserves and gold price, the economic useful life is expected to be 7 years. This rate will vary from year to year and is dependent on the mineral reserves which are reassessed every year.   Amortisation is included in depreciation and amortisation in the Statement of Comprehensive Income., 73301=Cost of Sales and Operating Expenses decreased to £51.7 million in 2013 from £61.5 million in 2012. A 34% decrease in underground mining costs decreased the cost of sales and operating expenses by £11.1 million. Removing the effect of the reduced tonnes mined and processed the reduction in costs on a like for like basis is £1.5 million. The £1.5 million is explained by the following variances:, 58405=The ore delivered from underground for 2013 was 240,156 tonnes, a 21% decrease compared to the same period last year. This reduction in ore delivered was due in part to lower strike drive development during the year, which is typically delivered as ore., 46767=Year ended 31 August 2013, 81722=Cash costs for the year ending 31 August 2013 were US$1,606 per ounce sold (2012: US$1,627 per ounce). This decrease in cash costs can mainly be attributed to the lower unit costs per tonne of ore mined, the effect of this would have reduced the cash costs per ounce to US$1,410. However decreases in recovery rates and lower grades increase the cash cost to US$1,606., 18265=2013 saw change on the Board, with the retirement of Colin Orr-Ewing and my appointment as his replacement. I would like to thank Colin for his service to the Group, both as chairman since 2004 and before that as a director of the Group. Continually refreshing is vitally important if a Board is to function as effectively as possible., 553981=08/04/2013, 546832=(31 Aug 2012: 96,558,339 ordinary shares of 5p each), 115223=AMC Consultants Pty Ltd (\"AMC\") completed a Mineral Resource estimate for VGM using geological and assay data available at 18 May 2012. The data supplied by VGM allowed AMC to generate a constrained grade model and estimate a Mineral Resource. AMC estimated the Mineral Resources using the end of August 2013 surveyed face positions., 117632=·     The Mineral Resource models use geological and assay data available at 18 May 2012., 36694=2013 was a difficult year for VGM in terms of achieving our targets that we set out at the beginning of the year. With limited financing we were not able to hit our production targets., 102213=Table 1  VGM Mineral Resources at 31 August 2013, 117399=·     The Mineral Resource models were depleted for mining to 31 August 2013, using surveyed mine outlines at 31 August 2013., 9152=+ 44 (0)20 7220 1666, 621592=1 Australasian Code for Reporting of Exploration Results, Mineral Resources and Ore Reserves, The JORC Code 2004 Edition, Effective December 2004, Prepared by the Joint Ore Reserves Committee of the Australasian Institute of Mining and Metallurgy, Australian Institute of Geoscientists and Minerals Council of Australia (JORC)., 35126=Subsequent to year-end VGM completed the first tranche of the US$ 40 million financing with the issue of 188,897,000 new ordinary shares at a subscription of 6.89 pence per share, raising approximately £13 million. The second tranche was due for completion at the end of January 2014 and we have subsequently agreed with Zhongrun that they will deliver these funds by the end of February 2014., 496304=At 31 August 2012, 479=Year ended 31 August 2012, 284858=Amortisation for both types of intangibles is calculated using the units of production method which is calculated over the life span of the mine.  As at 31 August 2013, the estimated remaining life span of the mine is 7 years. This is the entire period over which the mine is currently being amortised., 528301=Balance as at 1 September, 87816=Given the constrained cash flow during the year we substantially reduced exploration and evaluation costs to £1.1 million this year compared to £4.2 million in 2012. All the exploration and evaluation costs were capitalised as an Intangible Asset in accordance with the requirements of IFRS 6 Exploration for and Evaluation of Mineral Assets. Exploration costs to the amount £3,264,000 (2012: Nil) relate to specific areas which have not led to the discovery of commercially viable quantities of mineral resources, and the directors has decided to discontinue such activities in those specific areas. These costs have been impaired., 620251=On 21 October 2013, the Company completed the first tranche of a placing with Zhongrun whereby Zhongrun has subscribed for 90,000,000 new ordinary shares in the Company at a price of £0.69 per share, to raise £6.2 million., 62238=The purpose of this review is to provide a detailed analysis of the Group's consolidated 2013 results and the main factors affecting the financial performance. The Financial Review should be read in conjunction with the financial statements and associated notes., 109633=Table 2  Comparison with 2012 Mineral Resource, 22774=To re-embark on the resource definition drilling campaign started in 2011., 62847=Year ended 31 August 2013, 620605=On 5 November 2013, the Company completed the second tranche of the placing with Zhongrun whereby Zhongrun has subscribed for 98,897,000 new ordinary shares in the Company at a price of £0.69 per share, to raise £6.8 million.  As a result of this placing, Zhongrun's total holding increased to approximately 66% of the enlarged share capital of the Company., 135631=2012, 93097=Basic loss per share for the year ended 31 August 2013 was 12.74 pence compared to basic loss per share of 7.81 pence for the year ended 31 August 2012. This decrease was driven by the net loss for the year., 77679=Year ended 31 August 2013, 467931=Carrying value as at 31 August 2012, 120596=·           The Waikatakata Mineral Resource estimate was completed in October 2011 using 11 diamond drillholes and 133 reverse circulation drillholes for a total drilled length of 4,338 m. A twin drillhole programme was completed in 2011. Four twin diamond drillholes were drilled into the broader Waikatakata area, 422522=Outstanding share options could potentially dilute basic earnings per share by 8,407,112 shares in future periods, but were not included in the calculation of basic earnings per share because they are antidilutive for the year ended 31 August 2013., 101948=The Vatukoula Gold Mine Mineral Resource estimate is classified and reported in Table 1 below, in accordance with the 2004 JORC Code1., 221977=For the year ended 31 August 2013, 458402=As at 31 August 2012, 19164=As part of the equity subscription agreement announced in October 2012, VGM agreed with Zhongrun that they were entitled to propose four nominees for election as Directors at the Annual General Meeting (\"AGM\"). In January 2013, the following directors were appointed as directors of the Group; Mr. Yeung Ng, Mr. Fengwen Zheng and myself., 621099=In January 2014 the company agreed with Zhongrun to extend the time for payment by Zhongrun of the US20million loan note to 28 February 2014.  Zhongrun formally acknowledged and represented that it is willing and will be able to make full payment of the USD20million loan note., 94771=Cash provided by financing activities for the year ended 31 August 2013 was £12.2 million (2012: £5.3 million). The large majority (£12.4 million) of this relates to equity issues completed during the year. At 31 August 2013 the Group had cash and cash equivalents of £0.6 million (2012: £2.4 million)., 470031=A deferred tax liability of £10,757,000 arose in 2008 in respect of the intangible assets recognised on the acquisition in the prior periods. The deferred tax liability is in respect of future taxable profits potentially generated from the exploration of the mining rights., 597675=The VSATF is part of the Vatukoula Trust Deed, a binding contract between the Company's wholly owned subsidiary and the Fijian Ministry of Lands and Mineral Resources.  A total of F$6million is payable of which the Group paid F$1.5 million on 10 March 2010 and F$1.125 million on 31 December 2011.  The remaining F$3.375 million has been allocated to Current and Non Current Liabilities as follows:, 114812=Changes in the Mineral Resources between 2012 and 2013 were the result of reductions due to depletion of the models between mining face positions at 1 September 2012 and 31 August 2013 - 75,000 ounces gold, 17448=More importantly this year we finalised the US$40 million investment agreement with Zhongrun. The investment agreement stipulated that the funding will be provided in two tranches of approximately US$20 million each. The first tranche was completed after the year end in November 2013. The second tranche was due for completion at the end of January 2014 and we have subsequently agreed with Zhongrun that they will deliver these funds by the end of February 2014., 16762=As mentioned at last year's Annual General Meeting the Board highlighted that to achieve its production targets it would require US$40 million for capital investment and working capital.  While we secured this financing we continued to receive support from our major shareholders - including DRK Energy Co., Limited (\"DRK\"), who over the period under review, invested £4.5 million in May 2013 and Zhongrun International Mining Co. Ltd (\"Zhongrun\"), whom invested £6.6 million in October 2012 and £1.3 million in April 2013., 249972=The condensed consolidated financial information for the year ended 31 August 2013 was approved for issue by the Board of Directors of the Company on the 3 February 2014. The condensed consolidated financial information does not comprise statutory accounts within the meaning of section 434 of the Companies Act 2006. The condensed consolidated financial information is audited., 196545=Balance at 1 September 2012, 93427=Net cash used in operating activities was £0.1 million for the year, a decrease of £6.3 million on the prior year. The net operating loss before changes in working capital was £2.5 million compared to a net operating loss of £0.1 million in the previous year. This reduction was due to lower EBITDA. Changes in working capital generated £2.4 million (2012 generated £6.4 million) this cash was generated primarily from the Group decreasing its receivables., 423455=All potential shares were anti-dilutive as the Group was in a loss making position. As a result diluted loss per share for the years ended 31 August 2013 and 31 August 2012 is disclosed as the same value as basic loss per share.  The diluted weighted average ordinary shares in issue during the period were 122,958,339 (2012: 90,509,159)., 166232=As at 31 August 2013, 552793=12/11/2012}",
    "textBeforeTable": "    (b)        Share issues during the year   4,828 7,768 (31 Aug 2012: 96,558,339 ordinary shares of 5p each) 155,358,339 ordinary shares of 5p each Allotted, issued and fully paid £'000 £'000",
    "textAfterTable": "  11.       Provisions   Group 2013 2012 £'000 £'000 Current",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}