{
    "relation": [
        [
            "Days",
            "30",
            "50",
            "150",
            "200"
        ],
        [
            "BSE",
            "285.63",
            "307.08",
            "365.80",
            "357.00"
        ],
        [
            "NSE",
            "285.58",
            "307.14",
            "365.96",
            "357.16"
        ]
    ],
    "pageTitle": "Sun TV Network Stock Price, Share Price, Live BSE/NSE, Sun TV Network Bids Offers. Buy/Sell Sun TV Network news & tips, & F&O Quotes",
    "title": "",
    "url": "http://www.moneycontrol.com/india/stockpricequote/media-entertainment/suntvnetwork/STN01",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987135.9/warc/CC-MAIN-20150728002307-00267-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 589727375,
    "recordOffset": 589676722,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{136233=JSWSteel Jul Fut, 135526=UnitedBrewerie Jul Fut, 222992=Sun TV Network is in the Media & Entertainment sector. The current market capitalisation stands at Rs 12,271.80 crore. The company management includes Kalanithi Maran - Executive Chairman, K Vijaykumar - Managing Director & CEO, R Ravivenkatesh - Independent Director, Kavery Kalanithi - Executive Director, S Selvam - Director, J Ravindran - Independent Director, M K Harinarayanan - Independent Director, Nicholas Martin Paul - Independent Director. It is listed on the BSE with a BSE Code of 532733 and the NSE with an NSE Code of SUNTV. Its Registered office is at Murasoli Maran Towers, 73, MRC Nagar Main Road,,MRC Nagar Chennai (Madras),Tamil Nadu - 600028. Their Registrars are Karvy Computershare Private Ltd., 221682=Zensar Technologies Recommended on Mar 24th 2015, 135015=28 July 2015}",
    "textBeforeTable": "Edit Watchlist Have you invested in these stocks? You can track them better in your Portfolio close[x] Add to Watchist Account Optional Optional Optional Optional Add to Portfolio OR Add to watchlist } $('#mcpcp_addprof_info').hide(); { function close_info()",
    "textAfterTable": "Keep me signed in Forgot Password? New to Moneycontrol - Sign up now Its easy and FREE! Username Username should be atleast 4 characters Password Password should be 6 to 10 characters Confirm Password Email OR connect with LIVE",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}