{
    "relation": [
        [
            "Categories",
            "Campus Safety",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "Public Safety take their jobs seriously. They are always around campus, making sure everyone is safe and that no illegal activity is going on.",
            "As mentioned under dorm life, there is always something to do on campus. The school has events such as free movie night on campus as well as the local movie theater. They also offer ice skating, bowling, etc, usually free of charge.",
            "The cafeteria offers a variety of different things. However it is the same variety almost every day. But there is a section where you can cook for yourself if you do not want what is being served. Also, the school gives 100 flex dollars each semester so that you are able to buy food from The Grill, Nathans, and Snax, all places on campus. Spend your flex dollars wisely because they can go quickly.",
            "The dorms are a nice size and the custodians keep the bathrooms clean. There is always something to do on campus. If you are not interested in joining a sorority there are many clubs such as the ABC club (association of Black Collegians), the gospel choir, etc. If there isn't a party, you can always find a small get together in someones dorm at Park Ave. You'll never be bored.",
            "Academically the school is challenging. But the professors are helpful and you can always go to the academic support center for help on an essay, or anything else you may be having trouble with.",
            "This campus is surrounded by trees and nature. If you are not a fan of nature it may not be the right campus for you. Also, it is a bit of a walk from town but we do have a shuttle bus that takes you to Drew University, Main Street, and the grocery store. If you are from an urban area like myself, you may be used to public transportation, local chicken shacks, corner stores, and stores downtown that you would see in the mall. However, it is different in Madison. Most of the clothing stores are boutiques and there is not a snack store on every corner.",
            "Fairleigh Dickinson is a great school. The professors care about their students and are willing to help them when necessary. There is always something to do on campus and the people are extremely friendly."
        ]
    ],
    "pageTitle": "Fairleigh Dickinson University-College at Florham Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Fairleigh-Dickinson-University-College-at-Florham/reviews?_escaped_fragment_=/show/61098",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042981576.7/warc/CC-MAIN-20150728002301-00301-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 911172147,
    "recordOffset": 911135522,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{11093=Is FDU a bang for the buck? It depends on the individual in this case. Personally, I love FDU and everything they offer, but the college is definitely pricey- more for some than others. Some find it cheaper than a state school. It really does depend on whether you are a New Jersey resident or not and what you can academically qualify for. So try to keep your grades up high your senior year of high school! A high SAT score (Math & Verbal are the only ones FDU considers- a score of 1050 or higher) and at least a 3.0 GPA, and you can qualify for a good scholarship. However, as others have mentioned scholarships and awards are consistent and you can work out a payment plan so that you are paying at a rate that is right for you., 154557=© 2015, Cappex.com, LLC}",
    "textBeforeTable": "07/09/2009 Reviewer is A current student here. 17 out of 17 people found this review useful. 1 of 36 Student from FDU Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {//",
    "textAfterTable": "Categories Comments Great for these types of students Students who want a school that has a small school feel but is actually pretty big. Someone who wants to be out of the crazy city life, but can be in NYC withen an hour. Tips for prospective students FDU is a great fun school, you will learn a lot, and have a great time. Definately visit the school for a real feel. Bang for the buck While the tuition goes up every year, the scholarships and financial aid are good and consistent. Am enjoying being here There are tons of activities on campus for all types of interests. Am learning a lot I have not had a large class since i started. The classes close at 30 students so each student gets the attention they need. Most of the professors have real world experience about what they are teaching. Login to rate or flag the reviews Anonymous 03/16/2011 Reviewer is A",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}