{
    "relation": [
        [
            "Deva Gana",
            "Aswani",
            "Mrigasira",
            "Punarvasu",
            "Pushya",
            "Hasta",
            "Swathi",
            "Anuradha",
            "Sravana",
            "Revathi"
        ],
        [
            "Manushya Gana",
            "Bharani",
            "Rohini",
            "Ardhra",
            "Poorvaphalguni",
            "Uttaraphalguni",
            "Purvashada",
            "Uttarashada",
            "Poorvabhadrapada",
            "Uttarabhadrapada"
        ],
        [
            "Rakshasa Gana",
            "Krithika",
            "Ashlesha",
            "Makha",
            "Chitra",
            "Visaka",
            "Jyeshta",
            "Moola",
            "Dhanishta",
            "Satabisha"
        ]
    ],
    "pageTitle": "Star Match ,astrology matching,horoscope matching, DevarMatrimony",
    "title": "",
    "url": "http://www.devarmatrimony.com/aboutporutham.php",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987135.9/warc/CC-MAIN-20150728002307-00083-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 402996131,
    "recordOffset": 402980023,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "  This koota ensures compatible sex life. It is the matching of the human minds and their temperaments. 2.  Ganam (Sobanam Ganam Evacha) The presence of Dina Koota agreement ensures that the husband and wife remain healthy and free from all sorts of diseases and will enjoy all comforts and a long lease of life. Count the stars beginning from the star of the girl. If such counted number comes as 2,4,6,8,9,11,13,15,18,20,24,26, it is good and agrees. If Rohini, Ardhra, Maka, Visaka, Sravana, Hasta, Uttarashada, Revathi happens to be the same star for girl and boy they agree. In cases of Mrigasira, Aswani, Krithika, Punarvasu, Pushya, Uttara, Chitra, Uttarashada, Purvashada stars, if they are same they also agree but are given secondary choice. Others do not agree. In cases where the two stars are same it is good that the signs of the boy leads that of girl. 27th star even in different signs has to be rejected. 1.  Dinam (Dinath Ayushyam",
    "textAfterTable": "  If both are Deva or Manushya Gana they agree. In case the gana of the girl is Deva and that of the boy is Manushya it agrees as secondary. If both are of Rakshasa they do not agree. This agreement confers general happiness of marital life. 3. Yoni ( Yonitho Dhampathy Sneham ) This is another koota which is interpreted in two ways. The word Yoni indicates the private reproductive organ of a women. So it is said that presence of Yoni Koota is a must to ensure sexual compatibility.   Each star is having certain animal force associated with it.They are:   Nakshatra Animal Nakshatra Animal Aswini Horse Bharani Elephant Kritika Goat",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}