{
    "relation": [
        [
            "Categories",
            "Campus Safety",
            "Bang for the buck",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "Campus is very safe the officers are great",
            "Collin is a very affordable school for in residents its only $34 a credit hour",
            "Nice cafeteria conveniently located",
            "Apartments are basically on campus there are no dorms but there is campus housing",
            "Very professional and very great academics",
            "Be on time Communicate with your professor Do your homework",
            "Collin college is a great place to start your education it is low cost and affordable. You get a very high quality education for the amount of money that you pay for tuition. The professors are very organized and willng to work with you and they win alot of awards for stellar and excellence"
        ]
    ],
    "pageTitle": "Collin College Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Collin-College/reviews?_escaped_fragment_=/show/28602",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 125,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988860.4/warc/CC-MAIN-20150728002308-00312-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 896611447,
    "recordOffset": 896511398,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{606796=© 2015, Cappex.com, LLC, 194894=I needed to check some books out for a research paper, and had to be there on campus past 5:00 P.M. The campus, while dark and absent of a lot of people, still seemed to be extremely safe., 471102=You can't really expect to get an great cafeteria food at any school. But we do have separate cafes for healthier and fresh food so you're not stuck eating burgers and fries every day. Unfortunately, this option is not open past 3:00., 63157=Take Professor Eldridge for History 1301, He's amazing at giving you the information from a student friendly view.}",
    "textBeforeTable": "09/30/2009 Reviewer is A current student here. 7 out of 8 people found this review useful. 1 of 151 Rebecca from Mckinney, TX Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp",
    "textAfterTable": "Comments Great for these types of students Collin is great for students who are looking to get the basics out of the way, who aren't quite ready for university life or just want to take a quick course. Tips for prospective students Collin College is the best next step you can make, it's a great place to transition from high school to university life if you're not sure you're quite ready or need to improve your appearance for a college. This two year college provides a wide selection of programs that turn out highly prepared individuals. Login to rate or flag the reviews Student from Plano, TX 01/06/2011 Reviewer is A current student here. 3 out of 3 people found this review useful. 3 of 151 Categories Comments Great for these types of students If you aren't positive on what you want to do in your future, definitely go here because you can get some of your basics done at a cheaper rate. Also for students that want",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}