{
    "relation": [
        [
            "Categories",
            "Bang for the buck",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "PCC provides an excellent curriculum for the cost of attending. I have absolutely no complaint.",
            "Everyone makes their own fun...even the most mundane activities are fun if you let them be, including group projects!",
            "Everything you need is available on campus, from snacks between classes to full meals if you choose.",
            "No dorm life.",
            "PCC provides a great transition between high school and university, allowing you to get many, many classes completed before you move to a more expensive university.",
            "Read the blogs about the various classes before you enroll. Don't take everything you read to heart, just be informed before selecting a class.",
            "PCC works toward helping you complete your program. Classes are relatively easy to get as you move through your chosen program. Most teachers are knowledgeable in their field."
        ]
    ],
    "pageTitle": "Pasadena City College Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Pasadena-City-College/reviews?_escaped_fragment_=/show/27243",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988860.4/warc/CC-MAIN-20150728002308-00065-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 912225507,
    "recordOffset": 912137907,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{401365=Good. Not bad, not stellar. For women walking alone to cars in garage at night, ask for an escort or walk with another woman, especially to the Del Mar parking structure. Theft is problem here, even from padlocked lockers in the locker rooms, so watch your things carefully., 147330=Most of the time, for every one bad professor you end up taking a class with, you will have one to two professors who will make learning fun (ratio is 1:1.5). It's pretty much a life & death situation/battle for parking in the school parking lots during the first few weeks of the semester. The campus is alright; the annoying part is that there is always construction happening somewhere, and is sometimes a distraction during lectures., 315084=While I lived at home attending Pasadena City College, I have made friends who lived around the campus. There is no on-campus dorm option, but the apartments around the campus are around 400-1000 dollars per month. These apartments usually require you to be very quiet, but some have utility and game rooms., 475267=© 2015, Cappex.com, LLC}",
    "textBeforeTable": "12/02/2009 Reviewer is A current student here. 10 out of 11 people found this review useful. 1 of 114 Jeffrey from Arcadia, CA Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5",
    "textAfterTable": "Categories Comments Great for these types of students Art students Tips for prospective students Speak to your teachers, they really have some great stories and advice. Bang for the buck The classes are affordable, if you go to Art Center or any other art school, you'll be paying triple times more than here for about the same courses. But of course if you want to go to a prestigious art school be my guest, but you can save some money here before transferring to an art school. Am enjoying being here I enjoy being here for the available classes I've been able to get the necessary classes to transfer, most students beginning their first year here haven't been lucky enough to get general education classes. Am learning a lot I'm a design student at PCC, so this is helpful for those majoring in art. The professors at this school are amazing, they attended prestigious schools and have a lot to teach their students so take advantage of it. I've learned and understood a lot about art from basic drawing to 3 dimensional design and I will continue to take many",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}