{
    "relation": [
        [
            "Date",
            "Feb 18, 2004",
            "Mar 8, 2005",
            "Dec 30, 2005",
            "May 7, 2010",
            "Feb 29, 2012",
            "Mar 13, 2012",
            "May 28, 2014"
        ],
        [
            "Code",
            "AS",
            "AS",
            "AS",
            "FPAY",
            "AS",
            "AS",
            "FPAY"
        ],
        [
            "Event",
            "Assignment",
            "Assignment",
            "Assignment",
            "Fee payment",
            "Assignment",
            "Assignment",
            "Fee payment"
        ],
        [
            "Description",
            "Owner name: PROPAGATE NETWORKS INC., MASSACHUSETTS Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNORS:BACKES, FLOYD;VACON, GARY;CALLAHAN, PAUL;AND OTHERS;REEL/FRAME:015023/0136 Effective date: 20040217",
            "Owner name: AUTOCELL LABORATIES, INC.,MASSACHUSETTS Free format text: CHANGE OF NAME;ASSIGNOR:PROPAGATE NETWORKS, INC.;REEL/FRAME:015743/0534 Effective date: 20050217",
            "Owner name: AUTOCELL LABORATORIES, INC.,MASSACHUSETTS Free format text: SECURITY AGREEMENT;ASSIGNOR:HOLMAN, III, ALBERT A., AS AGENT FOR THE LENDERS;REEL/FRAME:017382/0502 Effective date: 20051028",
            "Year of fee payment: 4",
            "Owner name: AUTOCELL LABORATORIES, INC., MASSACHUSETTS Free format text: RELEASE BY SECURED PARTY;ASSIGNOR:HOLMAN, ALBERT A., III;REEL/FRAME:027781/0447 Effective date: 20120228",
            "Owner name: AUTOCELL LABORATORIES, INC., MASSACHUSETTS Free format text: RELEASE BY SECURED PARTY;ASSIGNOR:HOLMAN, ALBERT A., III;REEL/FRAME:027851/0628 Effective date: 20120228 Owner name: PICCATA FUND LIMITED LIABILITY COMPANY, DELAWARE Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNOR:AUTOCELL LABORATORIES, INC.;REEL/FRAME:027852/0201 Effective date: 20120224",
            "Year of fee payment: 8"
        ]
    ],
    "pageTitle": "Patent US7146166 - Transmission channel selection program - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US7146166?dq=5,490,216",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042981576.7/warc/CC-MAIN-20150728002301-00233-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 476251483,
    "recordOffset": 476189895,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{6335=In FIG. 58 there is shown one mechanism that can be used by the processor in the implementations of either FIG. 56 or FIG. 57 to maintain the short and long term averages needed to perform the process of FIG. 55 to ascertain movement. Two ring buffers 652 and 654 are maintained—one for the short term average and one for the long term average. Ring buffers are used so that power sample averaging can be accomplished over a sliding window in time. In a ring buffer, as a new sampled is added to the buffer, the oldest sample is removed. In the wireless networking example previously described, the short term average ring buffer stores the most recent 16 samples, and the long term average ring buffer stores on the order of 1024 or 2048 samples. Of course these sample sizes will vary depending on the application. It may also be reasonable to use an accumulator-based average for the long term average, but such an approach could be subject to buffer overflow.}",
    "TableContextTimeStampAfterTable": "{267668=The preferred implementation for the current wireless network example thus utilizes: (a) a short term average over N1=16 samples, (b) a long term average over 2048 samples, and (c) “N2” which is the number of samples taken so far in computing the long term average. The process is as follows:}",
    "textBeforeTable": "Patent Citations While the invention is described through the above exemplary embodiments, it will be understood by those of ordinary skill in the art that modification to and variation of the illustrated embodiments may be made without departing from the inventive concepts herein disclosed. Moreover, while the preferred embodiments are described in connection with various illustrative program command structures, one skilled in the art will recognize that the system may be embodied using a variety of specific command structures. Accordingly, the invention should not be viewed as limited except by the scope and spirit of the appended claims. Those skilled in the art should readily appreciate that programs defining the functions of the present invention can be delivered to a computer in many forms; including, but not limited to: (a) information permanently stored on non-writable storage media (e.g. read only memory devices within a computer such as ROM or CD-ROM disks readable by a computer I/O attachment); (b) information alterably stored on writable storage media (e.g. floppy disks and hard drives); or (c) information conveyed to a computer through communication media for example using baseband signaling or broadband signaling techniques, including carrier wave signaling techniques, such as over computer or telephone networks via a modem. It will be understood that each block of the flowchart illustrations, and combinations of blocks in the flowchart illustrations, can be implemented by computer program instructions. These computer program instructions",
    "textAfterTable": "May 18, 2004 Nokia Corporation Assembly, and associated method, for facilitating channel frequency selection in a communication system utilizing a dynamic frequency selection scheme US6741863 Dec 18, 1998 May 25, 2004 Lucent Technologies Inc. Method and apparatus for locating a wireless mobile unit US6760748 Jan 20, 1999 Jul 6, 2004 Accenture Llp Instructional system grouping student terminals US6795407 Apr 20, 2001 Sep 21, 2004 Atheros Communications, Inc. Methods for controlling shared access to wireless transmission systems and increasing throughput of the same US6870815 Dec 8, 2003 Mar 22, 2005 Atheros Communications, Inc. Methods for implementing a dynamic frequency selection (DFS) and a temporary channel selection feature for WLAN devices US6941143 * Aug 29, 2002 Sep 6, 2005 Thomson Licensing, S.A. Automatic channel selection in a radio access network US6993334 * Apr 30, 2002 Jan 31, 2006 Qualcomm Inc. Idle handoff with neighbor list channel replacement US20020060995 *",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}