{
    "relation": [
        [
            "Days",
            "30",
            "50",
            "150",
            "200"
        ],
        [
            "BSE",
            "52.42",
            "50.22",
            "53.25",
            "54.07"
        ],
        [
            "NSE",
            "52.40",
            "50.22",
            "53.27",
            "54.10"
        ]
    ],
    "pageTitle": "Pennar Industries Stock Price, Share Price, Live BSE/NSE, Pennar Industries Bids Offers. Buy/Sell Pennar Industries news & tips, & F&O Quotes",
    "title": "",
    "url": "http://www.moneycontrol.com/india/stockpricequote/steel-cr-hr-strips/pennarindustries/PI28",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987135.9/warc/CC-MAIN-20150728002307-00083-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 594875299,
    "recordOffset": 594820507,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{219173=Pennar Inds is in the Steel - CR & HR Strips sector. The current market capitalisation stands at Rs 724.50 crore. The company management includes Nrupender Rao - Chairman, Aditya Rao - Vice Chairman & Mng.Director, K Lavanya Kumar - Whole Time Director, Ravi Chachra - Director, B Kamalaker Rao - Director, Manish Sabharwal - Director, J Ramu Rao - Director, Vishal Sood - Director, Varun Chawla - Director, Sita Vanka - Independent Director. It is listed on the BSE with a BSE Code of 513228 and the NSE with an NSE Code of PENIND. Its Registered office is at Floor No. 3, DHFLVC Silicon Towers,,Kondapur Hyderabad,Telangana - 500084. Their Registrars are Karvy Computershare Private Ltd., 134024=JSWSteel Jul Fut, 132806=28 July 2015, 133317=UnitedBrewerie Jul Fut, 217866=Zensar Technologies Recommended on Mar 24th 2015}",
    "textBeforeTable": "Edit Watchlist Have you invested in these stocks? You can track them better in your Portfolio close[x] Add to Watchist Account Optional Optional Optional Optional Add to Portfolio OR Add to watchlist } $('#mcpcp_addprof_info').hide(); { function close_info()",
    "textAfterTable": "Keep me signed in Forgot Password? New to Moneycontrol - Sign up now Its easy and FREE! Username Username should be atleast 4 characters Password Password should be 6 to 10 characters Confirm Password Email OR connect with LIVE",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}