{
    "relation": [
        [
            "Feature",
            "Total number of Tenants supported on Unity Connection",
            "Total number of concurrent video calls",
            "Total number of Connection SRSV branches supported",
            "Total number of Connection SRSV branches supported"
        ],
        [
            "Descriptions",
            "60",
            "35",
            "10",
            "35"
        ],
        [
            "Minimum Software Version",
            "10.x",
            "N/A",
            "9.1(2)",
            "10.5(1)"
        ]
    ],
    "pageTitle": "Virtualization for Cisco Unity Connection - DocWiki",
    "title": "",
    "url": "http://docwiki.cisco.com/wiki/Virtualization_for_Cisco_Unity_Connection",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042981576.7/warc/CC-MAIN-20150728002301-00045-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 76521932,
    "recordOffset": 76505984,
    "tableOrientation": "HORIZONTAL",
    "lastModified": "Thu, 23 Jul 2015 20:19:06 GMT",
    "textBeforeTable": "Additional Features: Voice mail only (No Integrated or Unified Messaging) 4 ports iLBC or G.722 16 ports G.711 or G.729a (combined TUI, VUI, or TTS) Limits for Active/Active Cluster Configuration: Voice mail only (No Integrated or Unified Messaging) 2 ports iLBC or G.722 8 ports G.711 or G.729a (combined TUI, VUI, or TTS) Limits for Standalone Configuration: VMWare release 5.1 and older, requires reserving one physical core per physical server - see co-residency policy. With VMWare release 5.5 and later and Unity Connection release 10.5.2 and later while utilizing the latency sensitivity feature, you may remove the requirement of dedicated one physical core per physical server. This requires the Unity Connection VM Latency Sensitivity to be set to 'High' while at least one other VMs is set to 'Normal'. Recommend every VM to be set to 'Normal' except for Unity Connection VMs. For use only on UCS E series blades see Cisco Unity Connection on UCSE Notes on 100 user VM configuration No Yes Yes Yes Yes No No",
    "textAfterTable": "16 ports G.711 or G.729a (combined TUI, VUI, or TTS) 4 ports iLBC or G.722 Limits for Active/Active Cluster Configuration: 32 ports G.711 or G.729a (combined TUI, VUI, or TTS) 8 ports iLBC or G.722 Deprecated in the 8.6(2) release. Notes on 1000 user 1vcpu VM configuration When deployed on a BE6000S server, minimum supported version is 10.5(2), capacity is limited to 150 users / 300 devices and design must follow BE6000S requirements in www.cisco.com/go/ucsrnd. VMWare release 5.1 and older, requires reserving one physical core per physical server - see co-residency policy. With VMWare release 5.5 and later and Unity Connection release 10.5.2 and later while utilizing the latency sensitivity feature, you may remove the requirement of dedicated one physical core per physical server. This requires the Unity Connection VM Latency Sensitivity to be set to 'High' while at least one other VMs is set to 'Normal'.  Recommend every VM to be set to 'Normal' except for Unity Connection VMs. Limits for Standalone Configuration: 24 ports G.711 or G.729a (combined TUI, VUI, or TTS) 6 ports iLBC or G.722 Limits for Active/Active Cluster Configuration: 48 ports G.711 or G.729a (combined TUI, VUI,",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}