{
    "relation": [
        [
            "Categories",
            "Campus Safety",
            "Greek Life",
            "Clubs and Activities",
            "Great for these types of students",
            "Share any unusual traditions or locations on campus",
            "Bang for the buck",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "A Great group of guys",
            "There are 3 white fraternities. no diversity",
            "There are 3 white fraternities. no diversity",
            "The type of students that dont play a sport and dont mind busy work in the classroom.",
            "Grub fest. every year they dig up the ground and make a mud patch; people play in the mud.",
            "Its $42,000. Its way to expensive. I'm looking to transfer to University of Kentucky.",
            "There is nothing to but to go to the movies and go to Lexington which is 25 minutes away.",
            "the food is horrible, there is few options to eat healthily.",
            "The dorms are very uncomfortable and are 100 years old. The newer dorms are $1800 more and probably dont fit in your scholarship.",
            "Academics at the school is way to difficult.",
            "Go to UK instead",
            "Georgetown is a very small college. It is difficult academically and does not help a graduate find a job out of college. It is in Georgetown Kentucky, and 25 minutes from Lexington where the university of Kentucky is."
        ]
    ],
    "pageTitle": "Georgetown College Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Georgetown-College/reviews?_escaped_fragment_=/show/20867",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988860.4/warc/CC-MAIN-20150728002308-00024-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 894974515,
    "recordOffset": 894938529,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{110994=The Belle of the Blue is a beauty contest held on campus every year. It's tons of fun, and the winner gets a scholarship. We hold Songfest every October, and it is huge on campus. Every dorm creates their own skit and preforms. Almost everyone on campus participates or comes to watch. It's so much fun, and it really brings everyone together. The third floor of the library is kind of hidden. I didn't know about it until my second semester. It's a great place to study, since no one every goes up there., 99077=The dorms are very uncomfortable and are 100 years old. The newer dorms are $1800 more and probably dont fit in your scholarship., 130397=© 2015, Cappex.com, LLC}",
    "textBeforeTable": "08/10/2009 Reviewer is A past student here. 13 out of 13 people found this review useful. 1 of 31 Brittany from Georgetown, KY Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp",
    "textAfterTable": "Am learning a lot I am only in my first semester at Georgetown, but I already feel like I am learning a great deal. The teachers are very helpful, and will not hesitate to work with you until you understand something. Their doors are always open outside of class also, if you need more help. Login to rate or flag the reviews Wildcat23 07/20/2009 Reviewer is A past student here. 4 out of 8 people found this review useful. 3 of 31 Categories Comments Great for these types of students If you want to go to a small school where you can stand out, Georgetown is defiantly the school for you. Tips for prospective students If you plan on attending Georgetown College, I would highly recommend joining a sorority or fraternity because there is not many other clubs or activities for none greek students. Bang for the buck It is",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}