{
    "relation": [
        [
            "Composite ID",
            "MC-1-2",
            "MC-3",
            "MC-4"
        ],
        [
            "Drill Hole",
            "DDHSR 34 (Nova)",
            "DDH 17 (Marifil)",
            "DDH 20 (Marifil)"
        ],
        [
            "Samples",
            "8314-15-16-17-18-20-21-22-23-25-26-27-28-29-30-32-33",
            "9120-21-22-23-24-25-26-27-28-29-30-31-32-33",
            "9218-19-20-21-22-23-24-25"
        ],
        [
            "Number of samples",
            "17",
            "14",
            "8"
        ]
    ],
    "pageTitle": "Marifil Mines Ltd. : MARIFIL IDENTIFIES HIGH GOLD RECOVERIES IN OXIDE GOLD TESTS | 4-Traders",
    "title": "",
    "url": "http://www.4-traders.com/MARIFIL-MINES-LTD-169767/news/Marifil-Mines-Ltd--MARIFIL-IDENTIFIES-HIGH-GOLD-RECOVERIES-IN-OXIDE-GOLD-TESTS-15958772/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987135.9/warc/CC-MAIN-20150728002307-00219-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 264415767,
    "recordOffset": 264390564,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{70377=8314-15-16-17-18-20-21-22-23-25-26-27-28-29-30-32-33, 71294=9218-19-20-21-22-23-24-25, 68397=January 22, 2013, 70840=9120-21-22-23-24-25-26-27-28-29-30-31-32-33, 68704=Vancouver, B.C. -- January 22, 2013, MARIFIL MINES LTD. (TSX-V: MFM) (\"Marifil\" or \"the Company\") announces it has received preliminary results from bottle roll cyanide recovery tests from the Zone 34 oxide gold target at the San Roque Project, Rio Negro Province, Argentina.}",
    "textBeforeTable": "Table 1 Marifil submitted composite drill core samples from three holes to the Alex Steward Argentina S.A. laboratory for testing.  The purpose of these tests was to determine the amenability of the oxide mineralization to heap leach gold extraction.  The tests were highly successful and the Company intends to move forward with further testing and drilling of this gold deposit.  Table 1 shows the results of these tests Vancouver, B.C. -- January 22, 2013, MARIFIL MINES LTD. (TSX-V: MFM) (\"Marifil\" or \"the Company\") announces it has received preliminary results from bottle roll cyanide recovery tests from the Zone 34 oxide gold target at the San Roque Project, Rio Negro Province, Argentina. Receives Favourable Results from Cyanide Leach Tests in Zone 34 San Roque property, Argentina MARIFIL IDENTIFIES HIGH GOLD RECOVERIES IN OXIDE GOLD TESTS January 22, 2013 *Required fields Message : (You can enter multiple email addresses separated by commas) To* : From* : Name : Last Name : Send by mail:",
    "textAfterTable": "The laboratory carried out metallic screen assays to determine if coarse gold was present.  The assays of the three composites plus one duplicate sample show that 95% of the gold reports to the -140 mesh fraction.  This is important because fine-grained gold leaches more readily than coarse-grained gold. The bottle roll tests were carried out at a pH of 11.2.  The results for the 96 hour leach were 92.43%, 85.28%, and 95.14% recoveries of gold respectively.  Graph 1 below shows the results for grade vs time for gold. Graph 1 Silver recoveries were lower then expected, however this is typical for heap leach operations.  Silver accounts for less than 20% of the dollar value of the deposit. The Company is pleased with these preliminary results from San Roque. We look forward to conducting further testing on the property. On Behalf of the Board of Directors, John Hite President Head Office: John Hite, President Phone: 702.562.4880 Email: info@marifilmines.com Website: www.marifilmines.com Investor Relations: Hugh Oswald, Ascenta Capital Partners Inc. Phone: 604.684.4743 ext. 243 Toll Free: 1.866.684.4743 ext. 243 Email: hugh@ascentacapital.com For further information regarding Marifil Mines Ltd., please refer to the Company's filings available on SEDAR (h",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}