{
    "relation": [
        [
            "Categories",
            "What to do for fun",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "Winter Park is full of recreational activities.",
            "Check out the beautiful campus before applying.",
            "Rollins College offers a fantastic liberal studies program. They cater to each student's individual needs. And, they provide a quality educational experience."
        ]
    ],
    "pageTitle": "Rollins College Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Rollins-College/reviews",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042981576.7/warc/CC-MAIN-20150728002301-00277-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 913003031,
    "recordOffset": 912923558,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{87989=Rollins is a beautiful campus that feels like paradise. Its small enough so it is easy to get around but large enough so it's not crowded. Students make many friends. Because of the small class size, students get to know their classmates very well. The student population is about 1800 so everyone gets to know everyone pretty well. The dorms are for the most part nice and safe. The campus food is good too. There are many events on campus that are open to all students which are a great way to have fun with friends and to meet new people., 212188=Fox Day: A free random day off from school... sometime in April., 356529=© 2015, Cappex.com, LLC, 110293=Fox Day is one day in March or April when the President (P-Dunc) wakes up at 5 or 6 am, puts the statue of the Fox on Mills Lawn and all classes are cancelled for that day. Students go to the beach, to theme parks, and just relax, then come back to school for a huge bbq on the lawn., 30022=Okay, fine, you don't have to look Fox Day up - didn't see this box before. Fox Day happens every year in the spring, usually the first or second week of April. It's when the president picks a random day that is supposed to have beautiful weather, and doesn't tell anyone (literally), and at like 5:30am on that day, he goes out to the lawn and puts this big statue of a fox by the flagpole, and that means that class is canceled for the day! It has become such a huge deal, especially in the past few years. People play Fox Day Roulette weeks before it might happen, people place bets on when they think it will be, people won't do their homework/study for tests that are supposed to be on the day that they think Fox Day will be (which is stupid, btw), etc. And people legit camp out all night on the lawn if they think it's gonna be fox day, and when he finally does bring the fox out, people start running around like crazy at 6 in the morning screaming IT'S FOX DAYYY! and posting facebook statuses and calling their friends to wake them up and make sure they know, and then everyone goes and eats free breakfast in the cafeteria, and then goes and does whatever they want. Beach, Disney World, Universal (we sell discount tickets for all the theme parks), chill on campus by the pool, sleep, or Rollins always has some activities on campus for people who don't want to go anywhere, like slip and slides, giant inflatable twister, and so on. Then everyone comes back to campus by like 5:30 and there's more free food for the fox day barbecue! And then everyone goes and gets ready to come back to the real world for class the next day, cause Fox Day is ALWAYS in the middle of the week. Cruel, I know. But it's our own little holiday, and we get real excited about it.}",
    "textBeforeTable": "12/19/2009 Reviewer is A current student here. 17 out of 18 people found this review useful. 1 of 65 Emily from Afghanistan Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp =",
    "textAfterTable": "Am enjoying being here I had a great time at Rollins. Not only did I meet great friends, but I had the opportunity to already go abroad with Rollins before I even set foot on campus: I did a nine day field-study in Costa Rica on ecotourism. It was an amazing trip that changed my life and I met some of my best friends there. My dorm was incredibly clean and friendly, and I was placed with other students who come from different backgrounds yet have a lot in common with me. Also, there are many dining options which helped me not become sick of the food, and there was coffee always available for late night study sessions. The library offers a vast array of periodicals and other resources, along with quiet study rooms and technology assistance. I took full advantage of the gym and free yoga and pilates classes, along with the post office. Although Rollins is a small campus, this does offer many benefits. These include a close relationship with all professors who will be able to view you as an individual, not just another student; close proximity to classes which helps with tardiness and allows comprehensive understanding of the entire campus; and accessibility with faculty who are ready to help. Professors also do not lecture; instead, they do conversation-based classes that increase student involvement in the subject. Am learning a lot",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}