{
    "relation": [
        [
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            ""
        ],
        [
            "",
            "Formulation",
            "",
            "",
            "Microgranular titanium oxide",
            "Talc",
            "Mica",
            "Nylon powder",
            "Red iron oxide",
            "Yellow iron oxide",
            "Black iron oxide",
            "Dimethyl polysiloxane",
            "2-ethylhexyl palmitate",
            "Sorbitan sesquioleate",
            "N,N-dimethyl PABA octyl ester",
            "Ethyl acetate ester extract of shoot",
            "of Fagus crenata",
            "Preservative",
            "Antioxidant",
            "Perfume",
            ""
        ],
        [
            "",
            "wt %",
            "",
            "",
            "7.0",
            "40.0",
            "Bal.",
            "10.0",
            "1.0",
            "2.0",
            "0.2",
            "1.0",
            "9.0",
            "1.0",
            "0.3",
            "5.0",
            "",
            "q.s.",
            "q.s.",
            "q.s.",
            ""
        ]
    ],
    "pageTitle": "Collagen production promoter composition - Shiseido Company, Ltd.",
    "title": "",
    "url": "http://www.freepatentsonline.com/RE39043.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042981576.7/warc/CC-MAIN-20150728002301-00185-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 467507823,
    "recordOffset": 467486198,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{34765=As synthesized water-soluble polymers, vinyl base polymers such as a polyvinyl alcohol, polyvinylmcthyl ether, polyvinylpyrrolidone carboxyvinyl polymer (Carbopol), alkyl modified carboxyvinyl polymer, polyoxyethylene base polymers such as polyethylene glycol 2000, 4000, 6000; acryl base polymers such as polyoxyethylene polyoxypropylene copolymer brae polymer, sodium polyacrylate, polyethylene acrylate, polyacryl amide, polyethylene imine, cationic polymer, etc. may be mentioned., 89675=© 2004-2015 FreePatentsOnline.com. All rights reserved. Privacy Policy & Terms of Use. A SumoBrain Solutions Company, 60729=The carboxyvinyl polymer was dissolved in a small amount of ion exchange water (phase A). Polyethylene glycol 1500 and triethanolamine were added to the remaining ion exchange water, heated to melt, and held at 70′C. (aqueous phase). The rest of the ingredients were mixed and heated to melt, then held at 70° C. (oil phase). The oil phase was added to the aqueous phase and preliminarily emulsified, then the phase A was added and the mixture homogeneously emulsified by a homomixer. After the emulsification, the resultant mixture was cooled to 30° C. while stirring well.}",
    "textBeforeTable": "The following test of use was performed on creams obtained in Example 1 and Comparative Example 1 of the formulations shown in Table 1. The amounts formulated an shown in % by weight. The results are shown in Table 2. (Monitor Test) (2) Test Example: 2 The results are shown in FIG. 1. The amount of PIP increased according to the concentration of the extract from the shoot of the Fagus crenate. At 0.1%, a significant increase was observed. As explained above, the extract of the shoot of the Fagus crenate was observed to have the effect of promoting the type I collagen biosynthesis ability without affecting the proliferation of cells al extremely low concentrations of 0.01 to 0.1%. The amount of cells was estimated by the amount of DNA of the cells. The amount of DNA was measured using a Hoechst 33258 reagent according to the method of Cesar Labarca et al. (Analytical Biochemistry, 102, 344-352 (1980)). The type I collagen biosynthesis ability of the cells was evaluated by measuring the amount of Procollagen type IC-peptide (PIP) secreted into the culture supernatent. Specifically, this was measured using a “Procollagen type IC-peptide (PIP) measurement kit (made by",
    "textAfterTable": "5.0 5.0 (12)  Polyethylene glycol 1500 5.0 5.0 (13)  Purified water Balance Balance Process of Production The ingredients (1) to (10) shown in the above Table 1 were dissolved under heating (oil phase). On the other hand (11) and (12) were dissolved in purified water (13) and held at 70° C. (aqueous phase). The oil phase was added to the aqueous phase while stirring, Next, the emulsion was processed by a homomixer to reduce the emulsion granules it size, then stirred, then rapidly cooled with stirring, to obtain the desired cream. Test Method Eighty healthy adult women of ages 35 to 68 extracted a random were used as teat subjects. They were asked to us the cosmetics on the skin of their faces daily for one month then aloe effect of improvements in the tautness and sagging of the skin and the effect of improvement of wrinkles and crow's feet were investigated. Effect of Improvement of Tautness of Skin The state of the skin was observed visually and evaluates based on the following evaluation criteria. (Evaluation Criteria) A: Extremely improved B: Improved C: No change D: Became somewhat noticable E. Became noticable Effect of Improvement of Wrinkles and Crow's Feet The sate of the skin was observed visually and evaluated based on",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}