{
    "relation": [
        [
            "Days",
            "30",
            "50",
            "150",
            "200"
        ],
        [
            "BSE",
            "144.84",
            "140.11",
            "135.83",
            "135.04"
        ],
        [
            "NSE",
            "144.88",
            "140.15",
            "135.84",
            "135.04"
        ]
    ],
    "pageTitle": "Karnataka Bank Stock Price, Share Price, Live BSE/NSE, Karnataka Bank Bids Offers. Buy/Sell Karnataka Bank news & tips, & F&O Quotes",
    "title": "",
    "url": "http://www.moneycontrol.com/india/stockpricequote/banks-private-sector/karnatakabank/KB04",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987135.9/warc/CC-MAIN-20150728002307-00097-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 584749267,
    "recordOffset": 584695775,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{133637=UnitedBrewerie Jul Fut, 133126=28 July 2015, 225889=Karnataka Bank is in the Banks - Private Sector sector. The current market capitalisation stands at Rs 2,598.00 crore. The bank management includes Ananthakrishna - Non Executive Chairman, P Jayarama Bhat - Managing Director & CEO, S V Manjunath - Director, D Harshendra Kumar - Director, H Ramamohan - Director, T R Chandrasekaran - Director, Usha Ganesh - Director, Ashok Haranahalli - Director, Rammohan Rao Belle - Director, B A Prabhakar - Director. It is listed on the BSE with a BSE Code of 532652 and the NSE with an NSE Code of KTKBANK. Its Registered office is at P B No 599, Mahaveera Circle,, Kankanady Mangalore,Karnataka - 575002. Their Registrars are Integrated Enterprises (India) Ltd., 224579=Zensar Technologies Recommended on Mar 24th 2015, 134344=JSWSteel Jul Fut}",
    "textBeforeTable": "Edit Watchlist Have you invested in these stocks? You can track them better in your Portfolio close[x] Add to Watchist Account Optional Optional Optional Optional Add to Portfolio OR Add to watchlist } $('#mcpcp_addprof_info').hide(); { function close_info()",
    "textAfterTable": "Keep me signed in Forgot Password? New to Moneycontrol - Sign up now Its easy and FREE! Username Username should be atleast 4 characters Password Password should be 6 to 10 characters Confirm Password Email OR connect with LIVE",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}