{
    "relation": [
        [
            "Task",
            "Configure the PCM environment",
            "Run batch services"
        ],
        [
            "Required RM Right",
            "PCM.Admin.Manager",
            "PCM.Admin.Manager"
        ],
        [
            "Requestor",
            "",
            ""
        ],
        [
            "Admin",
            "X",
            "X"
        ]
    ],
    "pageTitle": "B Summary of Security Rights and Roles",
    "title": "",
    "url": "http://docs.oracle.com/cd/E23943_01/doc.1111/e10640/e02_securitymatrix.htm",
    "hasHeader": true,
    "headerPosition": "MIXED",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042981576.7/warc/CC-MAIN-20150728002301-00072-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 72693639,
    "recordOffset": 72677692,
    "tableOrientation": "HORIZONTAL",
    "lastModified": "Wed, 13 May 2015 05:21:12 GMT",
    "textBeforeTable": "The following table describes the default rights assigned to the default roles for tasks involving triggers. B.1.1 Triggers The default roles are rma (User), rmalocalrecordsofficer (Officer), and rmaadmin (Admin). This section describes the default rights and roles for tasks encountered while using Oracle WebCenter Content: Records. B.1 Rights and Roles for Oracle WebCenter Content: Records Section B.2, \"Physical Content Management Rights and Roles\" Section B.1, \"Rights and Roles for Oracle WebCenter Content: Records\" This chapter describes the following topics: This chapter provides tables that show the default rights assigned to default roles for different functions in the product. The information here is the same as that described in Section 5.3.4, \"Security Classifications Tasks and Defaults for Predefined Roles.\" It is merely presented in a different manner. B Summary of Security Rights and Roles 21/24 Skip Headers-->",
    "textAfterTable": "X Edit a trigger Admin.Triggers   X X Delete a trigger Admin.Triggers and Delete permission for the trigger's security group. The Delete permission is not granted by default.   X X B.1.2 Periods The following table describes the default rights assigned to the default roles for tasks involving periods. Task Required RM Right User Officer Admin View information about periods Admin.Triggers or Admin.RecordManager   X X Create a period Admin.RecordManager     X Edit a custom period Admin.RecordManager     X Delete a custom period Admin.RecordManager    ",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}