{
    "relation": [
        [
            "Categories",
            "Campus Safety",
            "Greek Life",
            "Clubs and Activities",
            "Great for these types of students",
            "Share any unusual traditions or locations on campus",
            "Bang for the buck",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "They are great. I always feel safe while on campus because there are so many!",
            "My boyfriend is apart of a fraternity and loves it! They do great activities and i always enjoy being around his fraternity brothers!",
            "WAC and many more clubs!",
            "During the week i am a study girl, but widener is always providing activities so that you can destress.",
            "I am honestly unsure!",
            "Widener is an expensive college, but they give out great scholarships and grants!",
            "WAC, Widener Activities Counsel provide many activities on campus. Make sure to know what WAC is planning. Hanging out with friends is also something i always enjoy doing.",
            "The dining room is great! Spacious and newly remodeled. There are many choices at once, but the food is repetitive.",
            "I do not live in the dorms but visit many of my friends in the dorms. A clean, nice, and safe living environment.",
            "If you meet the academic requirements and strive for the best you will be rewarded.",
            "Contact a student you know to be shown around campus. Although most tour guides are accurate, students know the college best.",
            "Widener University is a great school. Teachers are very helpful and want you to succeed. The campus is beautiful and very homey."
        ]
    ],
    "pageTitle": "Widener University Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Widener-University-Main-Campus/reviews?_escaped_fragment_=/show/79922",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987135.9/warc/CC-MAIN-20150728002307-00028-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 898835419,
    "recordOffset": 898792233,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{98723=I am really into motorcycles and pre-1973 muscle cars., 206067=© 2015, Cappex.com, LLC, 137172=The graduates from this school have an average mid-career salary of almost $80,000, according to a recent study by Business Insider, found here: http://www.businessinsider.com/most-underrated-colleges-in-america-2013-6#25-widener-university-1 With such a great campus and astonishing graduation rate, this school is a great value., 35158=off campus one tradition we have is called a keg crawl while you may think it is just about drinking, it is not. it's celebrated in march and it's when a lot of houses open for students to go and have a good time on campus and meet other students. an unusual tradition we have would be on our homecoming alumni come and have the traditional broom walk on the football field., 131990=The cafeteria was just redone in fall 2011, and the food court was redone for fall 2012. Both options have a wide variety of food to choose from and I like it all. Although I am not a picky eater, I know my friends who are always find something good to eat., 130328=A new garden was donated in the fall of 2012 by a alumni of the class of 1967 and in that garden there is a metal dome that incoming freshman will walk through and walk through again during graduation., 1078=Take advantage of as many Widener days as you can, even schedule a daily tour with the Admissions Office at Mueller Hall. Our average tuition is around $30,000 a year, but the school does offer many scholarships to help out the students. We have a great faculty, (75%+ possess a doctorate in their particular field). And we also have a student to teacher ratio of 12:1 meaning small class sizes. We have a large campus with plenty to do on weekends, along with nationally recognized varsity athletic teams and various club sports and student life organizations.}",
    "textBeforeTable": "07/18/2009 Reviewer is A current student here. 14 out of 14 people found this review useful. 1 of 44 Mike from Holmes, PA Check out reviews left by other students or leave your own review. You could win a free scholarship. Widener University-Main Campus Reviews Widener University-Main Campus › Pennsylvania › By State › Colleges › } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.create', -->",
    "textAfterTable": "Categories Comments Great for these types of students Anyone who wants to be more serious about getting a quality education. There are tutoring programs, along with a writing center for students who need to get their paper's reviewed. In the writing center, they also help you brainstorm your essay topic. Tips for prospective students If you do decide to come to Widener, join a club or two. Stay active on campus in extracurricular activities. Also get a planner, you will need to have good time management or you will be a mess. Bang for the buck I believe that for the small class sizes, how friendly most people on campus are, most teachers will tell you to get your priorities straight if you are doing not too well in a class, it is the best bang for the buck. Am enjoying being here Students are friendly and bubbly. There are tons of things to do on campus, such as the rock climbing wall, billiard tables, lounges, and various clubs. Am learning a lot Since Widener is a private school, the classes are generally small. The largest amount of students",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}