{
    "relation": [
        [
            "Patent application number",
            "20100059238",
            "20100084149",
            "20130087353"
        ],
        [
            "Description",
            "ROW UNIT SOIL FINISHING APPARATUS - The present invention provides a novel configuration for agricultural row units that feature soil finishing assemblies. This configuration of the finishing assembly provides a simple adjustment of the height of the finishing assembly to enhance usability and flexibility of the row unit. The improved adjustment mechanism enhances user control over the vertical distance between the finishing wheels/discs and the ground opening assembly. In an exemplary embodiment, soil finishing assembly is pivotally coupled to the row unit frame via a height adjustment assembly. The height adjustment assembly may feature a biasing member and other components to allow adjustment of one end of the pivotal coupling of the adjustment assembly within the row unit assembly.",
            "PIVOTING GAUGE WHEEL - Embodiments of the invention provide an innovative arrangement to control the height of ground engaging tools located on agricultural implements via gauge wheel assemblies, particularly for supporting and adjusting the height of winged extensions of the implement frame. The gauge wheel assemblies may provide an adjustment assembly in the form of a screw jack, which can be coupled to a support bracket that is attached to the implement frame and also coupled to a support tube that is coupled to a gauge wheel via pivot assembly and a bracket. The bracket and support tube may be coupled at discrete positions according to the height adjustment of the screw jack via pins and holes in the bracket and tube. When coupled, the pins and holes of the support bracket and tube may reduce the load of the winged extensions on the screw jack mechanism.",
            "PIVOTING GAUGE WHEEL - Embodiments of the invention provide an innovative arrangement to control the height of ground engaging tools located on agricultural implements via gauge wheel assemblies, particularly for supporting and adjusting the height of winged extensions of the implement frame. The gauge wheel assemblies may provide an adjustment assembly in the form of a screw jack, which can be coupled to a support bracket that is attached to the implement frame and also coupled to a support tube that is coupled to a gauge wheel via pivot assembly and a bracket. The bracket and support tube may be coupled at discrete positions according to the height adjustment of the screw jack via pins and holes in the bracket and tube. When coupled, the pins and holes of the support bracket and tube may reduce the load of the winged extensions on the screw jack mechanism."
        ],
        [
            "Published",
            "03-11-2010",
            "04-08-2010",
            "04-11-2013"
        ]
    ],
    "pageTitle": "Smart, US - Patent applications",
    "title": "",
    "url": "http://www.faqs.org/patents/inventor/smart-us-5/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042981576.7/warc/CC-MAIN-20150728002301-00164-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 453433967,
    "recordOffset": 453401535,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Greg S. Smart, Bettendorf, IA US //]]> BarDraw('2492548',['Patent applications by Gregory S. Smart, Morton, IL US'],[[1,1,3,1]],['2009','2011','2012','2013'],0); // <script type=\"text/javascript\"> </div> <div id=\"legend2492548\" align=\"center\"></div> </div> <canvas id=\"bg2492548\" style=\"max-width: 500px; width: 100%;\"></canvas> <div> <p align=\"center\">Patent applications by Gregory S. Smart, Morton, IL US</p> <div class=\"bar2492548\" style=\"max-width: 500px; width: 100%; float:left; \"> <div align=\"left\" style=\"padding-top:20px;\"> </table> </tbody> </tr> <td>11-14-2013</td> <td><a href=\"/patents/app/20130299205\">VERTICAL TILLAGE SYSTEM</a> - A vertical tilling implement to be pulled behind and agricultural vehicle having a number of gangs of fluted-concave disc blades, rolling baskets, and wheels connected to a main frame. As the vertical tilling implement is pulled, the fluted-concave disc blades move the soil in a direction lateral to the side of the blades as well as up. Meanwhile, the rolling bars aid in leveling the seedbed and crushing the remaining large pieces of soil. The vertical tilling implement reduces the amount of subsoil compaction and cuts through heavy residue making it ideal for use in the fall or in the spring.</td> <td>20130299205</td> <tr> </tr> <td>10-25-2012</td> <td><a href=\"/patents/app/20120267130\">VERTICAL TILLAGE SYSTEM</a> - A vertical tilling implement to be pulled behind and agricultural vehicle having a number of gangs of fluted-concave disc blades, rolling baskets, and wheels connected to a main frame. As the vertical tilling implement is pulled, the fluted-concave disc blades move the soil in a direction lateral to the side of the blades as well as up. Meanwhile, the rolling bars aid in leveling the seedbed and crushing the remaining large pieces of soil.",
    "textAfterTable": "Harold Randall Smart, Portsmouth, RI US Patent application number Description Published 20150041000 SYSTEM TO MONITOR PERFORMANCE OF PACKING MATERIAL IN A SEAL - Embodiments of a system that can detect leaks that occur in seals, and in one example, to seals found in a valve. In one embodiment, the system utilizes sensors that measure fluid properties of a sample volume proximate to the seal. The system can compare data from these measurements with data from a sample of a reference fluid (e.g., ambient air) to indicate the presence of working fluid in the sample volume. This result may indicate problems with the seal, e.g., degradation of the seal that is meant to prohibit the working fluid from migrating out of the valve. 02-12-2015 James W. Smart, Windham, NH US Patent application number Description Published 20140215108 REDUCING WRITE I/O LATENCY USING ASYNCHRONOUS FIBRE CHANNEL EXCHANGE - A FCP initiator sends a FCP write command to a FCP target within a second FC Exchange, and the target sends one or more FC write control IUs to the initiator within a first FC Exchange to request a transfer of data associated with the write command. The first and second FC exchanges are distinct from one another. A payload of each write control IU includes an OX_ID value with which the initiator originated the second Exchange and a RX_ID value assigned by the FCP",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}