{
    "relation": [
        [
            "Coalition for The Advancement and Protection of Fatherhood",
            "Fatherhood 101 of Orange County, Inc.",
            "Fatherhood Assistance, Lifestyle & Legal Service",
            "Fatherhood Coalition",
            "Fatherhood Foundation of The Pikes Peak Region",
            "Fatherhood Institute",
            "Fatherhood Ministries, Inc.",
            "Fatherhood Project – Next Generation (Fp-Ng)",
            "Lancaster Fatherhood Project",
            "Marine City Fatherhood Program",
            "Project Fatherhood Development, Inc.",
            "The DO-Right Fatherhood Program",
            "The Institute for Responsible Fatherhood and Family RevitalizationLet’s look at this one, which links only to “Charles Ballard“",
            "The Urban Fatherhood Project",
            "The Urban Fatherhood Project",
            "Urban Fatherhood Network Foundation, Inc."
        ],
        [
            "Company",
            "Company",
            "Company",
            "Company",
            "Company",
            "Company",
            "Company",
            "Company",
            "Company",
            "Company",
            "Company",
            "Company",
            "Company",
            "Company",
            "Company",
            "Company"
        ],
        [
            "Riverside",
            "Santa Ana",
            "Tampa",
            "Santa Barbara",
            "Colorado Springs",
            "Dublin",
            "Midland",
            "West Sacramento",
            "Lancaster",
            "Sausalito",
            "Los Angeles",
            "Sausalito",
            "San Diego",
            "Sacramento",
            "Sacramento",
            "Sacramento"
        ],
        [
            "CA",
            "CA",
            "FL",
            "CA",
            "CO",
            "CA",
            "TX",
            "CA",
            "SC",
            "CA",
            "CA",
            "CA",
            "CA",
            "CA",
            "CA",
            "CA"
        ]
    ],
    "pageTitle": "History of Family Court | Let's Get Honest! Blog | Page 16",
    "title": "",
    "url": "https://familycourtmatters.wordpress.com/category/history-of-family-court/page/16/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987135.9/warc/CC-MAIN-20150728002307-00315-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 865228399,
    "recordOffset": 864956579,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{180662=June 18, 2011 at 4:34 pm, 226693=This is from Illinois.  I learned today that Cook County  (i.e., Chicagoland) Clerk of the Court handles $74 million and over 2 million cases per year.  It’s larger than some Fortune 500 companies.   They opened a $64 million building in 2005 to centralize Domestic Violence Court — all under an AFCC Judge of course — you didn’t think THAT would be changed…., 195197=Of course then-President Clinton (a prime example of marital fidelity, & “keep it zipped” Democrat, both before and during the US Presidency) already started that conversation in 1995, responding to Republican “Contract with America.”  Why do I start to feel sometimes like a bystander when Democrats & Republicans jockey (as our Congress) for supremacy in the  “MY fatherhood programs are bigger than YOURS!” and “Who’s your Daddy!” posturing — and spending?, 34137=Funded Fatherhood Programs The Ohio Commission on Fatherhood awards grants to exemplary fatherhood programs throughout the state of Ohio each biennium. The Ohio Commission on Fatherhood recently completed another round of fatherhood grants for 2010-2011. The Commission awarded grants to nine fatherhood programs located through out the state of Ohio in the amount of $1.5 million.  More>> Fatherhood Regions Fatherhood regions mirrors Ohio Department of Development regions. This map will reflect fatherhood programs, activities, fatherhood initiatives and resources within each region. More>> Ohio County Fatherhood Initiative On January 18th, the Ohio Commission on Fatherhood launched the Ohio County Fatherhood Initiative.   Eleven counties have been selected to participate in this pilot project.  The Ohio County Fatherhood Initiative is a six-month process during which county leaders identify specific needs in their county and develop a fatherhood action plan.  If your county would like to participate in a future training, submit the on-line form to be added to the waiting list.   More>>, 554278=(b) telephone: 570-558-1002 888-215-7445 (toll free), 109538=And in 2008, they helped organize a marriage conference in Uganda:, 115095=July 15-17 Irvine, Scotland Bridge Church, 547255=http://www.pabulletin.com/secure/data/vol40/40-50/2355.html, 554756=SCHUYLKILL COUNTY COURTHOUSE 401 N. 2nd STREET POTTSVILLE, PA PHONE: 570-341-2007, 367312=9:40 – 10:00 am, 548946=(c) In addition to the information required by Pa.R.C.P. 1915.15, every complaint for custody, partial custody or visitation, and every petition for modification of an existing custody order, shall contain the following language:, 96619=The National Healthy Marriage Resource Center (NHMRC) will host a webinar entitled, Healthy Marriage Programs: Opportunities to Partner with Courts on Thursday, March 31, 2011 from 1:00 – 2:30pm (E.S.T.)., 349628=Posted on April 5, 2011 by Dr. Richard A. Warshak In a stunning ruling, of interest to all those concerned with parental alienation, the Supreme Court of New Hampshire overturned a lower court’s award of custody to a mother who was found to be alienating her children from their father.After effectively interfering with the father-child relationship, the trial court awarded custody to the mother primarily because the children had spent the majority of their lives with her and that is where they feel most comfortable. This is typical in cases where one parent has effectively interfered in the children’s relationship with the other parent. The absence of contact establishes a status quo that the court then feels bound to honor in order to spare the children a drastic change in their lives., 367335=10:00 – 10:05 am, 385924=In June 1992, Robin founded KidShare, the first Neutral Child-Exchange and Supervised Visitation facility ever established in San Antonio, Texas.  In 1993, she created a Cooperative Parenting program with Anne Marie Termini, who moved to Atlanta, Georgia after their first case and developed a recognized national program with Susan Boyan.   Robin was instrumental in bringing the Helping Children Cope with Divorce seminar to Bexar County (TX — back from Georgia?) and in 1996, this four-hour educational program for divorcing parents became a mandate in San Antonio due to her work with Jewish Family Service, the Women’s and Children’s Resource Center, Family Service Association and the Bexar County Judges., 600649=10. Future meeting dates. Committee members agreed to meet again on Friday, March 18, May 20, July 15, August 19, and November 18, 2011 from 10:30 a.m. – 4:00 p.m. at the Judicial Center. They also agreed to meet in conjunction with the Association of Family and Conciliation Courts Regional Meeting in Indianapolis on Oct. 27-29, 2011 in Indianapolis., 83191=The Dallas County Community College District officially opened the Business Incubation Center June 4, 1990. An integral part of the Bill J. Priest Campus, 1402 Corinth Street, Dallas, Texas, the Business Incubation Center has just over 30,000 square feet of space available for businesses located on site. Designed as a corporate headquarters facility, the Incubation Center offers cost-shared equipment and services for up to 50 small business owners., 224265=Ms. Glenda E. Hood June 18, 2004 Page Two, 382648=In 1978, Michael Dukakis appointed Dunphy as a Probate and Family Court judge. One of his proudest achievements in that post, and one he has worked to replicate statewide, was to institute a mandatory education program for parents going through a divorce. Participants must pay $50 each for two sessions in which they learn about such basics as not using their children as messengers between each other. “People lose sight of the needs of their children in the process of separating themselves from each other,” said Dunphy.He got the idea for the course from an article in Parade magazineabout a program in Cobb County, Georgia.  {Also found in Indiana — I wonder whose curriculum it is}, 112844=The Anti-Homosexuality Bill 2009 (click here for full text) would make any homosexual contact subject to life in prison, or even death if the participants are HIV positive. Those who know of homosexuals but do not report this information to the police could face fines and jail time. No exceptions are made for clergy or health care professionals., 750403=NOT MENTIONED ON THEIR TAX RETURNS (though known to many mothers) -- that CPPA is along with DVLEAP and \"National Court Watch\" a co-sponsor (at least now, 2013) of \"Battered Mother's Custody Conference\" (existed 2003-2013, and exceptionally notable for suppressing overall information about -- what I and some others blog and write on, and had to because CPPA and their many friends wouldn't listen to!!! CPPA leadership often on the podium at BMCC, it seems...., 267130=RSI and the Center for Conflict Resolution, RSI’s affiliate organization, is now accepting applications from law students or law clerks who would like to be considered as candidates to be sponsored as RSI/CCR’s September 2012 Skadden Fellow. The Skadden Fellowship Foundation provides a two-year fellowship that offers the opportunity to develop and execute a legal project with a public interest host organization that serves underrepresented populations. RSI/CCR seeks to sponsor a Fellow to work on court ADR program development. Click here for more information about sponsorship criteria and how to apply., 308306=Princeton, N.J. — Charles A. Ballard, founder, president, and CEO of the Institute for Responsible Fatherhood and Family Revitalization, will speak on “The Status of Fatherhood in America: How Do We Return Fathers to Families?”** at Princeton University’s Woodrow Wilson School of Public and International Affairs on Tuesday, September 23, at 4:30 p.m. in Robertson Hall, Bowl 5., 230742=In 1979, the Young Lawyers Section of The Chicago Bar Association supported the creation of a not-for-profit corporation to aid the Chicago community in effectively handling disputes., 549467=(d) A completed order shall be attached to the complaint or petition which includes a provision that all parties attend the Kids First program and the Custody Conciliation Conference which shall be in substantially the form set forth in Sch.R.C.P. 1915.15. All parties named in the pleadings must register for and attend the Kids First program as ordered., 367359=10:05 – 10:45 am, 222349=By the authority vested in me as Governor of Florida, under the provisions of Article III, Section 8, of the Constitution of Florida, I do hereby withhold my approval of and transmit to you with my objections, Committee Substitute for Senate Bill 2640, enacted during the 36th session of the Legislature, convened under the Constitution of 1968, during the Regular Session of 2004, and entitled:, 609520=Posted in 1996 TANF PRWORA (cat. added 11/2011), AFCC, Business Enterprise, Cast, Script, Characters, Scenery, Stage Directions, Designer Families, History of Family Court, Lackawanna County, Parent Education promotion, Parent Education promotion, Parenting Coordination promotion, Psychology & Law = an AFCC tactical lobbying unit, Who's Who (bio snapshots), 83658=The following is a profile of the businesses that are associated with Business Incubation Center as of March 2011.  (And on the list):, 558073=A “Needs based plan and narrative template” (FY2011-2012) for “OFFICE OF YOUTH & FAMILIES” (Pennsylvania) tells more about these two Kids First marketers, 518525=– Janet R. Johnston et al, “Allegations and Substantiations of Abuse in Custody-Disputing Families,” Family Court Review, Vol. 43, No. 2, April 2005, 284-294, p. 284; – Janet R. Johnston, “High-Conflict Divorce,” The Future of Children, Vol. 4, No. 1, Spring 1994, 165-182, p. 167 both citing large study by Maccoby and Mnookin, DIVIDING THE CHILD: SOCIAL AND LEGAL DILEMMAS OF CUSTODY. Cambridge, MA: Harvard U. Press (1992)., 152983=At her swearing-in ceremony July 2, 27-year-old Joshua Pariente Koehler said, “It’s the priority that she places on personal relationships that really makes her so special.” Turning to his mother, he said: “Mom, you are the very best person that I know.”, 359728=THE SUPREME COURT OF NEW HAMPSHIRE___________________________Portsmouth Family Division No. 2009-806, 226215=** He’d just about HAVE to work with the sponsors of that legislation:  they are helping run the states’ family law system, and if he didn’t, there’d probably be a riot.  Nevertheless, as we approach June 18, 2011 (seven years later), I’d have to agree with the points he made., 488432=Hearing Date: 05/26/2011, 156926=The event will take place at the Tampa International Airport  on Friday, November 9, and Saturday, November 10. Registration for the full conference before October 2& is $135, or $155 after. For more information about the symposium visit http://www.flafcc.org, or contact FLAFCC Secretary LindaFieldstone at (305)349-5575 or lfieldstone@jud11.flcourts.org., 526951=According to the Sunshine Lady Foundation (which was founded by Doris Buffett), the Sunshine Peace Award program “recognizes extraordinary individuals who make a difference; those who help to build communities that are intolerant of domestic violence and through whose work peoples’ lives are changed for the better.” Since Professor Meier founded DV LEAP in 2003, the organization has worked on cutting-edge issues in the domestic violence field, submitting 6 friend of court briefs in the Supreme Court.  In the past year, in addition to lecturing and consulting with survivors, DV LEAP staff have worked on 10 appeals, a remarkable output for an organization of its size, 361225=On December 23, 2003, Miller obtained an ex parte order in the circuit court in Michigan granting him sole temporary legal and physical custody of his daughters., 489347=2011-12 2012-13 2013-14 (thereafter, the FJCs are to be locally funded) _____________________________________________________________________, 372829=Dr. Lorandos retired from the active practice of clinical psychology to attend the University of Detroit Law School, where he graduated with honors in 1991. He is licensed in New York, California and Michigan an attorney, and in California and Michigan as a psychologist., 367268=8:30 – 8:40 am, 165680=The members of the AFCC Task Force on Parenting Coordination (2003 – 2005) were: Christine A. Coates, M.Ed., J.D., Chairperson and Reporter; Linda Fieldstone, M.Ed., Secretary; Barbara Ann Bartlett, J.D., Robin M. Deutsch, Ph.D., Billie Lee Dunford-Jackson, J.D, Philip M. Epstein, Q.C. LSM, Barbara Fidler, Ph.D., C.Psych, Acc.FM. Jonathan Gould, Ph.D., Hon. William G. Jones, Joan Kelly, Ph.D., Matthew J. Sullivan, Ph.D., Robert N. Wistner, J.D., 547821= And Now, this 23rd day of November, 2010 at 11:00 a.m., Schuylkill County Civil Rules of Procedure No. 1915.1(b), 1915.3, 1915.15 are amended and Civil Rule of Procedure No. 1915.3a is adopted for use in the Court of Common Pleas of Schuylkill County, Pennsylvania, Twenty-First Judicial District, Commonwealth of Pennsylvania, effective thirty days after publication in the Pennsylvania Bulletin., 307813=This is the 1997 release of his speech at Princeton (Dr. Ballard’s, I mean):, 218052=Parenting coordinator (PC) is a relatively new practice that is used to manage on-going issues in child custody and visitation cases by professional psychologist or a lawyer assigned by the Court.[1] There are 10 states as of May, 2011 that have passed legislation regarding parenting coordinators: Colorado (since 2005), Idaho (2002), Louisiana (2007), New Hampshire (2009), North Carolina (2005), Oklahoma (2001), Oregon (2002), Texas (2005), Massachusetts and Florida.[2], 740482=This is a tale of Building Peaceful Families (\"BPF\")(incorporated 1/3/2005), Healing and Hope (posted 7/28/2013, hover cursor for the content), Domestic Violence Intervention Coalition {\"DVIC\") Inc. 1/21/2005 [compare with \"BPF\" date] (this is actually a California Corporation (i.e., BUSINESS) set up as a fiscal agent (?) to handle the monies from the activities of the Council -- which appears to be an advisory agency under the Office of Women's Policy, i.e. part of government. ) the site is advertising: Engaging, Motivating and Inspiring Men: the next step in Domestic Violence Prevention (10/2011 [18th annual. Do the math] conference run by DVIC [that corp]. and selling DVIResources with keynote speakers Lundy Bancroft and Jerry Tello),; and a tale of Mr. Bancroft's alter ego organization (or is it?) Protective Mothers International (not incorporated yet? Apparently not in Florida anyhow; that's the search site) but still has co-founders, apparently). A search for the Activist Woman the 'Healing and Hope\" post is protecting, shows \"The National Organization for the Respect of Motherhood, Inc.\" was incorporated 12/18/2012 by a person under LegalZoom from Glendale, CA (Florida-California??) under Ms. Levinson and two others. However, that was quickly dissolved when they never (ever) filed an annual report... Nevertheless, let's protect the mothers internationally (and engage and inspire the fathers)., 609442=June 15, 2011 at 12:38 pm, 195708=((Here is Rep. Davis on Tax Day 4/15/2011 introducing “The Children’s Budget Act” and citing to Brookings Institute and The Urban Institute) talking about we need to spend more money on children.  For Brookings Institute, read Ron Haskins and others who produce “Fragile Family” and other “Strengthening the Family” reports indicating that marriage reduces poverty and is a great thing for children, which Deomcrat Rep. Anthony Weiner — who according to news “just out” (yesterday) — might be thinking about, about now — and I guess if he steps down at once, he won’t get to vote yes on more fatherhood funding — although he’s about to become one:**, 412198=In April 2009, the guardian ad litem filed a statement with the court indicating that Laurel’s first grade teacher had reported that on April 20 Laurel began to cry in class and disclosed that during her most recent visit with her father he said that he was going to hurt her mother and there was nothing she could do to stop him. In response, Miller (father) filed a motion to modify custody ofthe children due to new acts of child abuse. Following a hearing, the court denied the motion. The court noted that it understood that [Miller] fears that this new allegation, when combined with previous ones and the recent one in March, is a “slippery slope” spiraling into new and more serious ones., 529801=Nor do they mention how the money keeps flowing in after conferences, for example, as in this 2008 AFCC conference:, 83106=1402 Corinth Street, Dallas, TX 75215, (214) 860-5851, 204675=From the “What Took Them So-Long” category, is this Department of Justice, June 2009 release of remarks by Attorney General Holder which include: “Why are mothers who are the victims of domestic violence losing custody of their children to the courts and to the child protection system? ” Remarks by Attorney General Eric Holder June 2009, 367290=8:40 – 9:40 am, 369493= He has been a practicing Psychologist for 32 years and previous[ly] worked twenty years for the Trumbull County Family Court. He has testified in twelve states and has serviced [??] over 1000 families. He has appeared on the Montel show and Court TV and numerous radio shows. He has authored and coauthored numerous peer review journal articles on Parental Alienation and Spontaneous Reunification. He has authored and coauthored numerous peer review journal articles on Parental Alienation and Spontaneous Reunification. Dr. Darnall is on the editorial board for the American Journal of Family Therapy. Reference to his work has been written up in over 50 newspaper articles. Dr. Darnall has given presentations at both State and National Conferences including the Missouri State Bar and North Dakota State Bar Associations, AFCC, Children’s Rights Council, and Local and State Bar Associations on Parental Alienation and Parental Alienation Syndrome. He has gained international recognition for his work with divorced families., 341813=Tagged with \"absent fathers = $100 billion government costs per year\" (per Bayh), \"children do better in school and are less likely to drop out when fathers are involved\", Danny Davis, Do children need a relationship with their fathers even when their fathers have been abusive to them and their mothers in the past?, Eric Holder, Evan Bayh, Fatherhood -- the Panacea to all society's ills, HR 2193, Julia Carson Responsible Fatherhood, Obama asks OFCBI to focus on 4 priorities - incl. \"Promoting Responsible Fatherhood and Strong Communities\", Rep Anthony Weiner caught sexting while wife pregnant, Responsible Fatherhood and Healthy Families Act of 2009 (Senate), Why are children of color over-represented in the child protection system?, Why are mothers who are the victims of domestic violence losing custody of their children to the courts and to the child protection system?, 410669=The January 7, 2008 order setting forth a plan for restoring the relationship “failed in relatively short order.” The court attributed responsibility for its failure to both parties: “[Miller] because of his insistence and belligerence with the reunification therapist” and Todd “because of her fanciful concern about the therapist’s ‘fraudulent billing’ of insurance.” , 757247=[Interjection: 9/2010 commentary from his blog on the ideal batterers' intervention group, for society to show they are serious about stopping abuse -- would be two to three years, 2-3 times a week. [hover cursor]. I think this reveals about where it's coming from -- run more classes and therapy, behavioral change, trainings, etc. -- right?]], 188151=Bayh today introduced his Responsible Fatherhood and Healthy Families Act of 2009 with Senators Blanche Lincoln and Roland Burris, a bill cosponsored by then-Senator Barack Obama in the last Congress. Bayh’s bill is co-sponsored with Senators Blanche Lincoln and Roland Burris., 545215=Read more: http://www.time.com/time/magazine/article/0,9171,842452,00.html#ixzz1P1f1mSR1, 173022=I have found several nonprofits in the Florida area (in particular) with some very “odd” 990 filings — like NONE, or blank ones.  The membership, however, seems to see no problem with this and just goes out and forms another one.  One of these succeeded in crying about domestic violence to the right people, and got some more funding in 2011 to set up supervised visitation center (whether therapeutic or not, I didn’t check).  , 108880=This funding began in 2006.  FOr a comparison, in 2006, the same group contributed to opposing same-sex marriage in Arizona, under “NAME” — meaning it was taking from TANF for political activity:, 551536=(a) In addition to the information required by Pa.R.C.P. 1915.15(a) and (b), each complaint for custody, partial custody, or visitation, or a petition to modify an existing custody order, shall have attached to its front an order in substantially the following form:, 367657=4:45 – 5:00 pm, 593118=b.  Committee members discussed having the Association of Family and Conciliation Courts  (AFCC) hold their fall symposium in Indianapolis in November 2011 and the Judicial Center using the monies they would otherwise have spent on the two-day domestic relations conference on having Indiana judges attend the AFCC fall symposium in Indianapolis. Magistrate Bobay moved to have the Judicial Center contact AFCC about holding their fall symposium in November 2011 in lieu of the two-day domestic relations conference, with the Judicial Center using the monies they would otherwise have spent to have Indiana judges attend. Magistrate Raduenz seconded the motion. The motion was passed unanimously., 359908=Argued: November 17, 2010 Opinion Issued: March 31, 2011, 234150=Keeping Parenting Coordinating Cases on Track: Advanced Concepts and Case Management Strategies  Matthew J. Sullivan, Ph.D. June 20-21, 2011 Chicago, Illinois, 496771=(This report has been prepared and submitted to the California Legislature under Family Code section 3204(d).Copyright © 2010 by Judicial Council of California/Administrative Office of the Courts. All rights reserved.), 398772=“Post-conference New Zealand/Australia Trip AFCC is pleased to announce plans for the post-conference trip to New Zealand and Australia…The trip will depart (from) Honolulu on June 8, 2002, the final day of the AFCC 39th Annual Conference and return from Australia on June 18. The itinerary for this trip will keep even the most active travelers busy.”, 361903=On January 6, 2004, Todd was served with the Michigan custody order. On January 15, the Rockingham County Superior Court,** in response to Miller’s petition for enforcement of the Michigan custody decree, ordered Todd to appear at a hearing and on January 26, the trial court ordered Todd to bring the children to Miller within twenty-four hours for the purpose of transferring custody to him.Sometime in January, Todd’s mother told her that, four months earlier, she saw Miller molest Laurel by inserting his forefinger into her., 19704=This can be done in part because in 1995, President Clinton issued an Executive Order about Fatherhood.  You should read it sometime (again).  This was like an ignition that blasted free all kinds of information and technology, and monetary flow — a virtual riverhood of father-promotion and education.  …., 111761=(ARTICLE IS FEB 2010; as far as I know, this bill is still “live” in Uganda….)  Since October of last year, Uganda has been the focus of international attention due to a proposal in their Parliament which would ban homosexual behavior of any kind via the death penalty for HIV people who engage in homosexual behavior and life in prison for others who attempt such behavior. One of the chief supporters of the Anti-Homosexuality Bill has been Martin Ssempa, a pastor in Uganda’s capital city of Kampala and well-known among Western evangelicals. Rev. Ssempa this week has called for a “million man march” which he hopes will bring large crowds out to support the harsh legislation. In addition, Ssempa has organized several news conferences in order to rally support among Ugandans for the bill., 62051=North Texas Fatherhood Initiative is funded by IMANI -The David Project a 2009 Compassion Capital Fund Grant from U.S. Department of Health and Human Services and Administration for Children and Families. (HHS/ACF — what else?), 550078=(b) The name, address, and contact information for the presenter of the Kids First program are: Anthony J. Libassi, 200 Adams Avenue, Scranton, PA 18503, (570) 558-1002, (toll free) 888-215-7445, and www.libassimediation.com., 387969=this woman was already connected with the courts, probably.  Welfare Reform (PRWORA) of 1996 freed up money to the states to start supervised visitation centers, and in general encouraged increased noncustodial parenting access by “facilitating” this help.  In Texas, right now, it’s BIG, and probably has been.  Not to trouble us now with this information, but in looking up Access Visitation funding in Texas, which is very overt (on the Office of Attorney General page) it develops that the person (judge) who brought it in (or to her county?) is now on the Texas Supreme Court.  She’s AFCC.  (Tarrant County connection?).  Here is a 2010 AFCC announcement that member Debra Lehrman was appointed by the (republican) Governor to the Supreme Court:, 367635=4:05 – 4:45 pm, 334154=The CFDA Summary Report form will create a report of all grant dollars allocated by CFDA number by one or all Fiscal Years since 2005., 232777=The Association of Family and Conciliation Courts is offering two trainings in June for dispute resolution professionals in Chicago. “Keeping Parenting Coordinating Cases on Track: Advanced Concepts and Case Management Strategies” is a “practice-based, case-oriented” training for experienced parenting coordinators that will discuss ways to improve the parenting coordination process and work with high-conflict clients. It will be held June 20-21. “Children and Divorce: The Voice of the Child and Interventions When Children Resist Parental Contact” is a training for professionals who work with separating or divorcing families – including mediators, evaluators, lawyers, judges, etc. – and will focus on how to integrate children’s voices into the dispute resolution process and work with parent-child contact problems. It will be held June 22-23., 371579=He spent the next four years studying the philosophy of science at an experimental university, earning a Ph.D. in 1976. He served two clinical internships and completed his doctorate in Clinical Psychology with Union Graduate School in Cincinnati., 529244=They certainly don’t mention when a local legislator slips in some bill to legalize steering court business to court professionals, as Senator Christine Kehoe (San Diego area) did when an Assemblyperson in 2002 (proposing a bill naming Kids’ Turn in its first draft; see my  “kicking salesmanship up a notch” post), or as She (sponsoring?) did again in SB 557 (with her chief of staff then and now Assemblyperson, Atkins) in legalizing the “Family Justice Center Model with an alliance run out of the San Diego City’s original brainchild., 222321=June 18, 2004, 592086=a. Anne Jordan reported the two-day domestic relations conference in the areas of child development, family dynamics, custody and visitation is scheduled for November 19-20, 2009 in Indianapolis. Committee members suggested the following topics:, 307922=News from PRINCETON UNIVERSITY Communications and Publications, Stanhope Hall Princeton, New Jersey 08544 Tel 609/258-3601; Fax 609/258-1301 FOR IMMEDIATE RELEASE, 319171=(BACK to that 1997 Princeton anouncement, then), 573894=http://www.fullertonsfuture.org/2010/gerald-l-klein-for-judge/, 409397=Now,no matter what the facts of the Todd & Miller case, just what do you think (Gentle Reader) the odds are that it wouldn’t be labeled “Parental Alienation”?and punishment of some sort be recommended to counter the alienation?  This was a couple who met over the internet (for Pete’s sake!) and in which Dad’s move when the kids were real little was to attempt on Christmas 2003 to completely take them from the mother– sole legal and physical custody order, ex parte — and he GOT it.. (Another therapist also had to be demoted in this process).  Now for reunification therapy…(New Hampshire opinion, again):, 597413=(Showalter’s comment was June 2009. Note: obtaining a restraining order is sign of parental alienation.  wonder where that concept came from.  It has nothing to do with protection, obviously — just using for an advantage in divorce.  (the concept that perhaps her desire for divorce may have had to do with violence to start with doesn’t seem to have occurred to him…..), 68631=Strong Families Dallas Alliance for North Texas Healthy Effective Marriages (ANTHEM) 1201 Elm street Dallas, TX 75270, 115571=September 6-10 Lima, Peru Conferencia Salvemos a la Familia, 329767=In 1997, he developed the Children in the Middle Co-parenting Education class. Brad left the County in 1997 to open up a program called Children in the Middle Co-parenting Services, Inc., a comprehensive agency designed to help adults raise children between two homes.In addition, he began offering consultation sessions where he would meet with couples and their significant others to develop a shared parenting plan. Children in the Middle Co-parenting Services, Inc. was closed in December of 2003 when Brad was hired to develop and maintain a co-parenting program with a social service organization. He is currently in private practice and contracts with organizations to provide services to families., 611296=Tagged with Access-Visitation, AFCC, Andrew Libassi (KidsFirst Lackawanna Co PA), Chet Muklewicz (AFCC-PA), Indiana Judicial Conference Domestic Relations Committee aka AFCC outfit, Jeffrey Bercovitz (IN), KidsFirst, KidsFirst-1996 (Orange & L.A. Counties-California), Pennsylvania Council of Children, SCHUYLKILL COUNTY COURT RULES (mandated Parenting Class), Stuwart Showalter shows up, Supervised Visitation, Youth & Family Services (and Libassi-Muklewicz Contracts with them), 512539=Assistant Division Director,  Cntr for Families, Children & Courts, CA Administrative Office of the Courts Govt. Admin. Industry  1988 – Present (23 years)/ Education:  U Michigan,   PhD, Social Psychology 1972 – 1978, 282325=In about 1948, King Narcisse began to incorporate an ancient legally recognized ecclesial creature into the church kingdom and diocese structure to insure that the kingdom and its charitable properties were preserved in perpetuity. The ecclesial creature was the Sole Corporation. Likewise in other states, in California, Corporation Sole may be formed only by the bishop, chief priest of any religious denomination or Church for the purpose of administrating and managing the affairs, and properties of the Church. [17]  The management and control of Corporation Sole and it assets pass to the bishop or chief priest’s Church successor. [18], 672904=[The Road Not Taken, Robert Frost, 1874-1963, from \"The Poetry Foundation\"], 562726=For additional information, contact Kids First, 1527 Adams Avenue, Dunmore, PA 18509 or 570-341-2007, 99273=Ms. Susan L. Blumberg, Ph.D. Child and Family Program Specialist Administration for Children and Families, Region 8 1961 Stout St. 9th floor Denver, CO 80294  {{relates to welfare & foster care, this link.  }}, 509262=The OTHER Pruetts (I’m still on that 2004 AFCC flyer which mentions Diane Nunn as AFCC “Advisory Task Force”) include Dr. Kyle (child psychiatrist from Yale) and his wife Marsha Kline (also a Ph.D.).  They have three daughters and one son and have naturally dedicated themselves to promoting fatherhood, as a search on “Marsha Kline Pruett, Kyle Pruett Fatherhood” will readily show, at a glance.  Dr. Marsha Kline even got an award for “Fatherhood  Initiative Community Recognition Award, State of Connecticut (2002), and   Stanley Cohen Distinguished Research Award, Awarded by the Association of Family and Conciliation Courts.   She is definitely (with I gather her husband, Dr. Kyle) on the Grants stream for investigation:  “University of California, Berkeley: Supporting Father Involvement 7/1/09-6/30/12: Total (T) $176,924 Marsha Kline Pruett, Ph.D., Co-InvestigatorUniversity of California, Berkeley: Supporting Father Involvement 7/1/04-6/30/09: Total (T) $353,849 Marsha Kline Pruett, Ph.D., Co-Investigator, 400762=Pauline H. Tesler, AFCC member from Mill Valley, CA, has writ- ten a new book entitled, Collaborative Law: Achieving Effective Resolution in Divorce without Litigation. Ms. Tesler has been a fre- quent AFCC presenter on the topic of Collaborative Law. The book is published by the American Bar Association Section of Family Law and may be obtained by calling (800) 285-2221., 284525=I am going to finish reading this, if you would like to see the PRINCE RAY CHRONICLES (Dec. 2007), click HERE:  As you do, recall that one purpose of the $10million/year access visitation grants is promising projects as the Secretary of Health (HHS) shall assign; states must help. …   Including what “trainings” work better than others, and keeping the network open to subject parents and children to them, forcibly, targeting IV-D (welfare) families . . . . ???, 574406=Klein has been practicing law for 33 years and has sat as a temporary volunteer judge in Orange and Los Angeles counties since 1981.  He is active in the community and he also teaches Family Law and Community Property as a part-time professor at a local law school.  Although I only witnessed his expertise in family law, he is familiar with many types of law as he had a general practice in his early years., 482181=June 15, 2011 at 2:28 pm, 747542=[To my shame, I didn't find the CPPA connection until Nov. 2013, I was distracted by the \"Florida\" location of Ms. Janice...not that this wasn't possibly intentional. The phone contact (941-822-5592) listed is from Sarasota, FL it seems. Here's another \"tell your story disaster story site providing that #... It WAS, sounds like, a disaster story...It's from a California chapter of PMA about a Michigan custody case. Hover cursor or click to read the PMA salespitches (plural) at the bottom of the report., 222820=Committee Substitute for Senate Bill 2640 authorizes courts to appoint a parenting coordinator when the court finds the parties have not implemented the court-ordered parenting plan, mediation has not been successful, and the court finds the appointment is in the best interest of the children involved., 590895=4. Minutes approved. The minutes for the May 15, 2009 meeting were approved., 60980=July 2009 – Present (2 years), 450337=If a man does not know how to rule his own house, how will he take care of the church of God? -I Timothy 3:5, 224570=I will support a revised bill during the 2005 legislative session that makes the appointment and selection of a parenting coordinator subject to the consent of both parents. Also, I believe that we must limit the risk of “professionalization” of the parenting coordinator role by limiting it to volunteers. While I respect the Legislature’s policy choice to allow only licensed professionals, clergy or attorneys to qualify as parenting coordinators, I believe that any volunteer, especially any faith-based volunteer, who meets certain minimum criteria should be allowed to serve as a parenting coordinator., 367569=2:40 – 3:40 pm, 676939=[This text widget added Feb. 2014]. For over twenty years I have been dealing personally, first with domestic assault and battery, a.k.a. violence in the home, then by witnessing how ALL facets of the system collectively keep \"Abuse Awareness\" in the public's face and on-line, while locally, telling live clients in imminent danger, asking for help for the most part, go away and shut up. Or, when such people look for some agency with the words \"domestic violence\" or \"prevent family abuse,\" or related sound-bytes on their websites, to show up (sometimes pay for) a class to develop relationship skills for handling one's: stalker, batterer, or the parent that threatened to, or just did, kidnap the kids. The same crowd (generic) also stay positioned for Technical Assistance and Training -- not real-time help. It's probably good they are often on the conference trail; if they stuck around home more, the word might get out locally exactly what \"T&TA\" means. My translation? \"Need Help? Go Away! It's Not Our Job. We Just Train the Trainers. We Consult. Dial in for the Webinar.\"\" (etc), 31798=For example, in or about 2000, the good citizens of Ohio — or at least their elected representatives — voted in a ‘FATHERHOOD COMMISSION.”  to find it, simply type in “http://Ohio.fatherhood.gov”     I linked to the “funding” page which summarizes.  Don’t neglect to click on “More” under the first link, where you will see a column of cool graphics & logos, such as:, 744646=[[Finally found it -- NOT anywhere on the PMA actual site (and I sure went looking, too) -- but in 2009 under Lundy's BLOG called \"healing and hope.\" Look an early -- June, 16, 2009 -- post, \"Introducing the Protective Mothers' Alliance.\", 319242=Founded by Ballard in 1982 in Cleveland as a local grassroots program, the institute is considered a model fathering program, “dedicated to encouraging fathers to become involved in the lives of their children in a loving, compassionate, and nurturing way.” With its home-based outreach program, the institute has restored more than 3,000 fathers to their families. Fathers who might otherwise join the ranks of “deadbeat dads” find role models among the institute’s outreach workers, from whom they learn the skills of modern-day fatherhood. “Most men are capable of responsible fatherhood,” Ballard has said. “All we need to do is lead them to it.” Now based in Washington, D.C., the nonprofit organization has opened centers in Milwaukee, San Diego, Nashville, Tenn., and Yonkers, N.Y., 688797=has a retired? Judge LaDoris Cordell on its advisory board. GOOD. See Dec. 2013 Mercury News article about a (truly heinous) hate crime, racial, perpetrated (by 4 Caucasian young men upon a African-American young man, their roommate) at San Jose State. A bicycle lock around his neck, and worse, was involved. A task force was appointed. This same Judge Cordell, as its head, in November wrote the newspaper, asking why this hate crime \"wobbler\" was charged as a misdemeanor, given that:, 341580=June 17, 2011 at 9:56 pm, 408771=FRIDAY, April 15, 20118:00 AM Registration and Continental Breakfast8:20 AM Introductory remarks David Medoff, Ph.D. President Massachusetts Chapter of AFCCPeggie Ward, Ph.D. Conference Chair8:30 – 10:15 AM Parental Alienation Richard Warshak Ph.D.10:15 – 10:30 AM Break with refreshments10:30 AM – 12:00 PM Parental Alienation (cont.) Richard Warshak, Ph.D.12:00-1:00 PM Lunch is providedComments: David Medoff, Ph.D., President Lesley Goldsmith, J.D., President-Elect Massachusetts Chapter of AFCC, 731983=(\"Donate\" button only added Jul. 2013)., 194898=As the 2009 public statement from Rep. Davis says:, 407687=Here they are BOTH on faculty of an April 2011 (Note — This decision was im March, 2011) at a keynote meeting featuring Warshak, i.e., “Parental Alienation:  Not just Another Custody Case.”   The lineup went approximatelyh like this:, 397406=What excitement! A group of intrepid travelers met at Logan Airport in the wee hours of the morning of November 5, 2001 ready for our Cuban adventure. A Cuban American judge had organized a judicial exchange with members of the Cuban legal community interested in family law. We traveled via Jamaica (since direct flights to Cuba are not allowed) on a permit issued by the Treasury Department. Arriving in Havana only hours before the hurricane, we transferred directly to the famous Hotel Nacional. Our group included AFCC members Hon. Sean Dunphy, Chief Justice of the Massachusetts Probate and Family Court and Linda Cavallero, Ph.D., Director of the Worcester Family Court Clinic at the University of Massachusetts Medical Center. Guide books in hand, we ignored the hurricane winds for as long as we could and set out to explore the old city of Havana. Looking at the 1950’s vintage automobiles we felt as if we were in a time warp. …Is this where the idea to have AFCC develop the “shared parenting” brochure germinated?  (I guess that must have been earlier)., 143999=WHEN   July 7, 2005, 294469=Hours of Operation: 9:00a.m. – 5:00 p.m. Population Served: Custodial and non-custodial fathers, TANF Recipients Area Served: Primary target area is Ward 7 in DC; also serve those who are referred by our collaborative partners, 29827=“In May of 2003 (it reads) the Center for Families and Children in Ohio hosted the first “Fathers Matter” conference in the State of Ohio…a diverse group of stakeholders and practitioners was brought together to discuss the importance of fatherhood and the barriers faced by practitioners. … most participants agreed that there was a need for a Fatherhood Practitioner network in Ohio.”, 360575=We have reviewed the extensive record in this case and set forth the facts most relevant to the issues on appeal. Miller and Todd met in 1999 over the internet and established a relationship. At that time, Miller lived in Michigan and Todd lived in New Hampshire. Although they never married, their relationship produced two daughters, Laurel born in 2002 and Lindsay born in 2003. During 2002 and 2003, the parties spent some time living together in Michigan, Todd and the children spent some time alone in New Hampshire, 589733=Indianapolis, on the other hand, did it differently, and rather than going through the expense of flying its judges OUT, simply decided to invite AFCC to hold their fall conference locally.   This is from the Domestic Relations Committee, June 2009 meeting:, 367613=4:00 – 4:05 pm, 328996=BRADLEY CRAIG, received his Master’s Degree in Social Work at UTA and is a Licensed Social Worker and Certified Family Life Educator. He is a noted co-parent educator in the North Texas area, and has developed a number of parent education programs for families raising children in two homes. He began specializing in working with families raising children between two homes in 1992 when he was hired by Tarrant County to conduct social study investigations and provide mediation sessions. He helped them design an orientation for litigating families offered by the county., 116798=(granted, this seems to be before the marriage funding began from HHS):  “In 2003, Pastor Leo and Molly Godzich started the Pastoral Rescue Center. It was founded on the idea: “how can pastors lead people when they cannot lead their own home.” Pastors’ marriages often go through struggling seasons like anyone else, but the predicament is they do not know who they can talk to. Where do they go for help? What will happen if members of the congregation find out that their home life is falling apart?, 368015=He also serves on the Advisory Board of the Children’s Rights Council in Washington, D.C. Since 1976, Dr. Sauber has been the Editor-in-Chief of The American Journal of Family Therapy. His most recent book with Richard Gardner, M.D. and Demosthenes Lorandos, J.D., Ph.D.is entitled The International Handbook of PAS: Conceptual, Clinical and Legal Considerations (2006) is now being written in its second edition with Demosthenes Lorandos, J.D.,Ph.D., William Bernet, M.D., and S. Richard Sauber, Ph.D. entitled The Handbook of Parental Alienation for Mental Health and Legal Professionals., 495288=REPORT TO THE CALIFORNIA LEGISLATURE MARCH 2010, 367591=3:40 – 4:00 pm, 277164=4c (Code. )(Expenses$ 1,879,434.includinggrantsof$ )(Revenue$       )  PUBLIC COMMUNICATIONS – THE ORGANIZATION LAUNCHED THE FIRST-EVER NATIONAL PUBLIC EDUCATION CAMPAIGN ON DOMESTIC VIOLENCE – THERE’S NO EXCUSE FOR DOMESTIC VIOLENCE – IN 1994. NOW THE ORGANIZATION IS REACHING YOUNG MEN AND BOYS THROUGH THE COACHING BOYS INTO MEN CAMPAIGN, ENCOURAGING MEN TO TALK TO THE YOUNG MEN AND BOYS IN THEIR LIVES THAT VIOLENCE AGAINST WOMEN IS WRONG. THROUGH MEDIA AND THROUGH WORK WITH ALLIED ORGANIZATIONS, COACHES, AND OTHERS WHO REACH MEN AND BOYS, THE FVPF IS DELIVERING THE MESSAGE THAT MEN CAN MAKE A DIFFERENCE. THE ORGANIZATION’S RELATED FOUNDING FATHERS CAMPAIGN ENCOURAGES MEN TO STEP FORWARD ON FATHER’S DAY AND JOIN IN MAKING A PUBLIC STATEMENT ABOUT ENDING VIOLENCE AGAINST WOMEN., 572689=[Pa.B. Doc. No. 10-2355. Filed for public inspection December 10, 2010, 9:00 a.m.], 115940=and back to Tennessee for September 28-October 1 Nashville, TN AACC World Conference (that’s American Association of Christian Counselors)., 225978=For these reasons, and the reasons set forth herein, I am withholding my approval of Committee Substitute for Senate Bill 2640, and do hereby veto the same., 114170=heck out some of the upcoming speaking engagements of Dr. Leo and Molly Godzich. If there is one in your area, we hope to see you there! If you would like to schedule a Together Forever Weekend or Pastor Leo for a sunday, please call our office 602-404-2600., 458530=The article here is July, 2009. Contrast with the position of former U.S. President Bush, in 2001 (OFCBI), or in 2003 (heart of the Family Justice Center Alliance — see my post — cites an interest in keeping the “faith” component involved in helping people escape violence, abuse including sexual abuse of children, human trafficking and wife-beating.   And in 2008, the PCANH, in a casual reference, figures that they’ll go get some more data from the pastors…. Yeah, right.. Meanwhile, to clean up its racist act the conservatives targeted urban innercity black MEN to sell them on Fatherhood initiatives, when they were already en route to civil rights…., 53755=September 2009, University of Wisconsin–Madison, 544871=If you don’t believe that (yet), pls. review this 1966 TIME article, narrating the relationship between Judge Roger Alton Pfaff (who was childless) and Meyer Elkin (counselor) in the experimental “Conciliation” courts whose intent was to prevent divorce by forcing people into counseling who were headed for it:, 121681=Pastor John Hagee has grown into an enormously wealthy man. In the year 2001, his organization filed revenues of $18.3 million dollars with the IRS. What was John Hagee’s personal compensation package worth? More than $1.25 million dollars. His nonprofit organization, GETV, has a mission statement reading “Spread the Gospel of Jesus Christ”. Somehow I think his nearly 8,000 acre Texas ranch does not help that mission. Not only does Pastor John and his wife Diana Hagee own that sprawling ranch, but they also have a 5,275 foot, 6 bedroom mansion in one of San Antonio’s most exclusive gated communities (The Dominion). The house is appraised at $700,000., 539749=June 15, 2011 at 1:56 pm, 96311=Well, in March 2011, here is a nice webinar to explain some of the basics:, 709903=MacArthur-funded \"Models for Change: See 8/15/2013 post \"Private Wealth Acquisition/Disposition: Bankers Life (1879) MacArthur Foundation (pre-1978)\". This is PRIVATELY controlled money dominating court programs. You'll see (\"left-lurching\") MacArthur Foundation, for example, pouring money into the civil-servant-membership nonprofits (but with connections to statewide influence, preferably) causes, so they can practice on an entire state at a time.. This is top-down system change, and that it's top-down is absolutely intentional., 187666=Rep. Davis along with Reps. André Carson and Artur Davis today introduced companion legislation in the House called the Julia Carson Responsible Fatherhood and Healthy Families Act of 2009 Act, in honor of Representative Julia Carson, the late Indianapolis congresswoman who championed fatherhood reform throughout her long career., 572178=Americans with Disabilities Act of 1990: The Court of Common Pleas of Schuylkill County is required by law to comply with the Americans with Disabilities Act of 1990. For information about accessible facilities and reasonable accommodations available to disabled individuals having business before the court, please contact our office. All arrangements must be made at least 72 hours prior to any program, hearing or business before the court. You must attend the scheduled conference or hearing., 385228=Robin Brown Walton graduated Magna Cum Laude from The University of Texas in San Antonio in 1989 with a Bachelor’s degree in Psychology.  In May 1992, she received a Master’s of Science Degree in Counseling Psychology from Our Lady of the Lake University in San Antonio, Texas and again, graduated Summa Cum Laude.  Robin was licensed as a Professional Counselor by the State of Texas in 1994.  {Just in time for the National Fatherhood Initiative to get its foothold in the HHS business — see Ron Haskins…}}, 451761=2. As a self-appointed, unordained, sole elder of Boerne Christian Assembly, Mr. Phillips pronounced an “excommunication” on a member family of his church in 2005. 2 The “excommunication” was vindictive and appears to have been motivated over a difference in political views. 3 The “trial” was conducted without any due process in what can only be described as a Kangaroo Court. The accused were tried in absentia. No witnesses were called. No defense was afforded the accused. No specific, detailed list of charges was made. No evidence was provided. Any actual valid excommunicable sins had already been repented from, including a pre-conversion sin that had been repented of fifteen years prior. 4 A prominent Pastor has since described the excommunication as “the Salem Witch Trials.” The family has attempted ever since to be reconciled with Mr. Phillips, but he has refused all offers to meet with them, thus confirming his vindictiveness., 367503=1:35 – 2:15 pm, 348004=April 4th, 2011 by Robert Franklin, Esq., 407050=As such an avid student, certainly he might also be quite interested in teaching, and is doing so….What a huge spectrum of services to do while also being an associate professor:  http://dmedoff.com/spectrum.htmHere is his AFCC connection — President of the Massachusetts Chapter (reminder — it has a direct connection to the courts through Sean Dunphy, etc. in MA) and this  is a member interview, Spring 2010.If Ward & Medoff represent two independent professionals, it coulda fooled me., 114934=July 10 Paris, France Charisma Eglise Chretienne, 220674=Here’s what Florida Governor “Jeb” Bush wrote in 2004, explaining his VETO of a  certain bill promoting the Professionalization of Parental Coordination:, 115423=September 2-3 Harrison, OH Church on Fire, 367547=2:30 – 2:40 pm, 159934=Marsha Kline Pruett is a licensed clinical psychologist and the Maconda Brown O’Connor Professor at Smith College School for Social Work. She is researcher, mediator, and consultant to couples, attorneys, and judges. Dr. Kline Pruett has a national reputation for the development, implementation, and evaluation of preventive interventions in courts and family-focused community agencies. She has written extensively for academic and lay audiences, coauthoring Your Divorce Advisor (2001) and Partnership Parenting(2009). She is a member of the board of editors of the Family Court Review. She was awarded the AFCC Stanley Cohen Distinguished Research Award in 2004. The California Supporting Fatherhood Involvement (SFI) project is currently a major focus of her intervention and research efforts., 367525=2:15 – 2:30 pm, 455138=A millennium of Christian legal tradition came to an end in 1870. In that year, Christopher Columbus Langdell, newly appointed Dean of Harvard Law School, began a revolutionary approach to legal education which specifically discarded the Genesis foundation of law in favor of a philosophy rooted in Darwinism., 82903=BUSINESS INCUBATION CENTER BUSINESS PROFILES March 2011, 14467=By Kevan Goff-Parker Inside OKDHS Editor  (OCT 2004 article):, 77292=Here is a 2011 “webinar transcript” (obviously partial) talking about this “HEALTHY MARRIAGE OPPORTUNITIES TO PARTNER WITH THE COURTS”, 574047=Among his accomplishments, he founded Kid’s First in 1996. It is a program for separated or divorced parents and their children.  Both parents attend this 8 week course together with their children to help the kids cope with changes in the family., 411086=(probably therefore an area to investigate IF data could be gotten; fraudulent billing is a HALLMARK of these professions. and has been documented as far back as 1999 (Karen Anderson case, Amador County; Viola Stroud in Shockome case, Dutchess County, NY, etc.)And she’s not to consider a former therapist that DID say, abuse:, 390142=I’m sure she’s highly qualified.  And how great, she’s a woman on the State Supreme Court.  But somehow it’s less than assuring that someone on a committee which deals with child abuse and neglect has such close ties to an organization known for covering it up with cries of parental alienation, and prescribing anti-PAS programming for those who report, including the children themselves….  Here she is with a list of articles, including on  “Therapeutic Jurisprudence,” Texas Chapter of AFCC Fall Conference, 2003″ again, “Therapeutic Jurisprudence—A New Paradigm,” Texas Association of Mediators, Fort Worth, 2007″ {{yes, it IS a new paradigm!!! is it a GOOD one??}} and “Problem Solving Courts,” Alternative Dispute Resolution Symposium, Texas Wesleyan School of Law, February 2009″ and of course “Parenting Coordinators & Parenting Plans—the Proposed Statute,” Texas Association of Domestic Relations Offices (TADRO) Annual Convention, Austin, 2004″ ir “Domestic Violence in Family Law Cases,” Texas Wesleyan University School of Law, Spring, 2004″ or:  (see code words?):  ”, 114660=June 26 Torino, Italy Chiesa Evangelica Internazionale, 399988=Isolina Ricci, AFCC member from Tiburon, California is now the Director of The New Family Center, an organization she founded in 1978. The main focus of the Center is on consulting with courts, communities and government on programs, policies and adminis- trative structures that serve or impact children and families. You can contact Dr. Ricci at The New Family Center, P. O. Box 711, Tiburon, CA 94920-0711. Her telephone number is 415-435-7648 and her email address is IsolinaRicci@NewFamilyCenter.com., 320045=Ballard’s own young adult life could have served as a case study for the institute. At age 17, he fathered a child but abandoned the boy and his mother, joining the armed forces to avoid his responsibilities. Drugs and alcohol followed, as well as prison time for a crime Ballard says he did not commit. While in prison, Ballard had plenty of time to think about his son and decided to care for the boy when he was released. Ballard eventually adopted his son, earned a high school diploma, an undergraduate degree, and then a master’s degree in social welfare. In 1976, while working at a hospital, he observed that numerous women were having babies out of wedlock, with the fathers nowhere to be found. He gathered the names of nearly 600 fathers who had abandoned their children, then visited and counseled the men. From that simple beginning, Ballard’s institute grew into a national organization., 490150=…This bill would require the Office of Privacy Protection (OPP), in conjunction with the four pilot centers and relevant stakeholders, to develop best practices to ensure the privacy of all FJC clients and shall submit a report to the Legislature no later than January 1, 2013., 115255=August 19-20 Cincinnati, OH Towne Worship Center, 558714=“The following pages provide a template for counties to use to complete the narrative piece of the 2011-2012 Needs Based Plan and Budget.”, 564725=Here’s a local writer talking about a (different) local “Kids 4 Kash” scheme involving a single guardian ad litem (Danielle Ross) getting cases — $600 from parents upfront — and how, somehow, this county, almost 100% of the kids get a GAL:  http://scrantonpoliticaltimes.activeboard.com/t42441326/kids-4-kash-danielle-ross-guardian-atty-nancy-barresse-and-c/, 354175=“FamilyCourt Reform 2004 yahoo groupmail notes:” , 164021=The Task Force was reconstituted in 2003 by Hon. George Czutrin (NB:  ONTARIO, CANADA), AFCC President 2003-04. President Czutrin charged the Task Force with developing model standards of practice for parenting coordination for North America and named two Canadian members to the twelve-member task force. The Task Force continued investigating the use of the role in the United States and in Canada and drafted Model Standards for Parenting Coordination after much study, discussion and review of best practices in both the United States and Canada., 212535=And, Dec. 18, 2009 from “mainjustice.com” (AndrewRamonas), 367431=11:55 am – 12:00 pm, 446785=In the Matter of Father and Mother Case #2008-M-0000, 593958=As I see from the Feb 18, 2011 minutes (thanks for publishing them, guys….) the networking with AFCC is going to continue:, 393156=In September 1997, Robin licensed Family Service Association to run the KidShare (supervised visitation services) program and went into private practice.  Since that time, Robin has been appointed in thousands of cases by Family Law Attorneys and Judges in Bexar and surrounding counties to work in divorce cases that oftentimes involve a child custody dispute and/or a high conflict divorce situation.  Robin has been appointed to act as a Social Study investigator, Forensic Interviewer/Evaluator, Co-Parenting Coordinator/Coach, Child Advocate, Mediator, Arbitrator, Divorce Coach, Consultant and Counselor., 114442=June 19 Bologna, Italy La Parola Della Grazia, 144116=At the conclusion of the 2004 legislative session, Governor Jeb Bush vetoed a bill designed to provide guidance for the appointment and use of parenting coordinators to assist with high conflict dissolution cases where shared parenting schedules cannot be agreed upon by parents. This was due in part to concerns regarding the use of parenting coordinators when domestic violence is at issue in cases. In his veto message, he requested me to review the use of parenting coordinators to ensure that parents’ paramount rights are not compromised when this resource is accessed., 402361=That is, that Ms. Todd, after experiencing her parent’s concerns about Mr. Miller and after having experienced her own negative interactions with Mr. Miller, became increasingly convinced that Mr. Miller was harming Laurel.” Referring to a psychological report on Todd that was prepared in August 2007 by Dr. David Medoff, Dr. Ward noted that[p]sychological testing shows that Ms. Todd has a “serious impairment in her ability to accurately process the information she takes in from her surroundings and the degree of misperception she demonstrates has major implications for her adaptive functioning. Ms. Todd’s level of distortion is substantial and predisposes her to misunderstanding and misconstruing intentions, motivations and actions of other people. This places her at great risk for faulty judgment, for errors in decision-making, and for behaving in ways that are based on inaccurate information. These data indicate that Ms. Todd will not only fail to recognize or foresee the consequences of her actions at times, but that she will also become confused at times in separating fantasy from reality.”As Dr. Ward explained,Ms. Todd has the liability of distortion of information and failure to accurately identify intentions, motivations and behavior of others. Ms. Todd’s emotional state placed her at risk for misinterpreting information that she gained from her environment, adamantly believing that Laurel was sexually abused, and acting with full force on this information., 297080=The Reach Our Men Reach Our Sons Coalition (ROMROS) is a community-based collective of concerned individuals and organizations whose purpose is to improve our community by developing recruitment strategies to get more African American men involved in those organizations that service our youth in the community.  Real Men Bond: significantly increase active community involvement, commitment, and participation of male members. Will strengthen family ties, improve conditions in the community and facilitate personal growth and development. Men with a Mission: By reviving and building on the success of the Million Man March the spirit of unity and atonement guides and empowers fathers, sons and brothers., 367481=1:30 – 1:35 pm, 429626=June 15, 2011 at 3:54 pm, 575178=The “Kids First” program is a project of the Orange County Welfare Coalition, Inc., a nonprofit corporation started by Attorney Gerald L. Klein and Attorney Ruth Shapin, MFT, in 1975. Through 1990, the coalition assisted individuals in obtaining governmental entitlements including social security and supplemental security disability benefits., 118466=John Hagee was the leader of the charismatic {i.e., pentecostal} Trinity Church in 1975 and was the father of two children., 308129=Contact: Patricia Coen 609/258-5764 Date: September 11, 1997, 135834=June 19, 2011 at 8:36 pm, 367458=12:00 – 1:30 pm, 440626=John D. Cameron, Esq. Benjamin D. Garber, Ph.D. Co-Chairpersons, Parenting Coordinators Association of New Hampshire April 2008, 91926=Apparently (per “TAGGS.hhs.gov”) this group got only a single $50K grant in 2006, and were up and running?  If they received any more federal funding after that, I haven’t found it yet (however, my database skills aren’t professionally trained….)…, 362510=So mother “in law” was involved here.  However, wouldn’t you like to see that original ex parte give me my kids order? And who issued it?  There has to be SOME basis of change in circumstances (supposedly) for change of custody.  At least in theory….(**just a note, the sample “parenting coordinator” report was out of this county…)I don’t want to drag through all the detail, but the relevant point is when an AFCC alienation-proponent Psycholgist gets in the picture.  And that is in 2006, and AFTER DCYF., 348701=In 1999, James Miller met Janet Todd online.  They developed a relationship and, although they never married, had two daughters.  Laurel was born in 2002 and Lindsey in 2003.  Ultimately, a New Hampshire court awarded joint custody with Todd as primary custodian and Miller with visitation rights., 99067=Ms. Alicia Davis, J.D. Family Unit Supervisor, SCAO Colorado State Court Administrator’s Office 1300 Pennsylvania Street Denver, CO 80203, 367383=10:45 – 10:55 am, 515002=A 1996 report (issued by this CA Judicial Council AOC)  on “Future Directions for Mandatory Child-Custody Mediation Services:….”, 576121=Recognizing the need for a program focusing on the needs of children whose parents are separated, in 1995 Attorney Klein began looking for such a program. In 1995, he learned of the “Kids Turn” program in San Francisco which dealt with families going through divorce. The coalition adopted their idea and curriculum. Sara Doudna, MFT, became the Clinical Director, expanded upon it, and “Kids First” was born., 528317=They did not mention that in 1999, in Ohio, an AFCC-laced Task Force lifted some AFCC_designed policies for custody, then flew to Arizona to attend an AFCC conference as part of their transformations of the courts.  These groups do not mention, typically, fatherhood funding, or the history of Family Law as an offshoot of a brainstorm between “Roger & Meyer”  (Judge Pfaff and Counselor Meyer Elkin) long ago, or anything at all about the Marv Byer discoveries in the late 1990s.  They don’t mention that around the US, “fatherhood commissions” building of the National Fatherhood Initiative have been formed to legalize some of the policies these very groups say they oppose.   Nor, FYI, do they (for example) broadcast to women that the NCADV and associated alliances are actually collaborating with the father’s groups at the national and financing level, and talking policy with them., 363070=DCYF stated that “[t]here has been a concern that Laurel has been coached with the information that she has been disclosing. Please understand that this . . . type of coaching, if proven, is equally as abusive to a child as if the abuse had actually occurred.” The matter was also referred to the Manchester Police Department, which investigated but did not pursue charges.In July 2006, the parties agreed to be evaluated by psychologist Peggie Ward “to investigate and make recommendations . . . on the issues of a parenting/custody assess[ment], abuse allegations by both parties, parental alienation issues, scripting issue[s] and any and all other issues . . . which she deems relevant.” On December 18, 2007, Dr. Ward issued an eighty-eight page report in which she considered several hypotheses., 109113=PROTECT MARRIAGE ARIZONA C-02-2006 (ANTI-GAY) The National Association of Marriage Enhancement 13422 N Cave Creek Rd, Ste 3 Phoenix, AZ 85022 05/16/06 – $5,000.00 – Cash – Filed: 06/30/06 10/17/07 – $2,000.00 – Cash – Filed: 06/16/08, 114766=July 2-3 Alicante, Spain Iglesia Rio de Vida, 392614=Marsha Kline Pruett, AFCC member from Northampton, MA, has been awarded the 2010 Men-in-Families Best Research Article Award for an article she co-authored, “Promoting Fathers’ Engagement With Children: Preventive Interventions for Low-Income Families,” that appeared last year in Journal of Marriage and the Family, 56292=Conference papers are available in the Annals of the American Academy of Political and Social Sciences, Vol. 635 (May 2011): “Young Disadvantaged Men: Fathers, Families, Poverty, and Policy.” Special Editors Timothy M. Smeeding, Irwin Garfinkel, and Ronald E. Mincy., 210644=Here he is in 2010 speaking to an Alliance of Concerned Men on fatherhood.  It’s a good speech, but pulls out that phrasing:, 405731=Dr. Medoff has published numerous articles on a wide variety of clinical and forensic matters including the scientific basis of psychological testing, theuse of psychological testing in the forensic domain, juvenile sexual offenders and the major psychoses. He has presented at numerous professional workshops and seminars on a variety of subject matters including expert testimony, the use of psychological expert consultants, risk assessment, psychodiagnostic evaluations, child abuse and neglect, adolescent and adult psychopathology and legal risk management for clinical practice.He obtained his Bachelor’s Degree in Psychology from Boston University in 1986 and his Master’s and Doctoral degrees from Fairleigh Dickinson University in 1993 and 1995, respectively. {{in PSYCHOLGY?}} Following his academic training, Dr. Medoff completed his Pre-Doctoral Internship at the Children’s Hospital – Boston, Harvard Medical School and his Post-Doctoral Fellowship at the Children and the Law Program at the Massachusetts General Hospital, Harvard Medical School., 507921=The following report and recommendations are the result of this extensive research effort and debate and have been unanimously approved, without any abstentions or dissents, by official action of the 17 members of the Task Force present at the final meeting on June 1, 2001., 576562=In 1996, “Kids First” became operational.”, 364937=The American Journal of Family Therapy, 28:229-241, 2000, 488488=BILL SUMMARY: SB 557 would authorize the cities of San Diego and Anaheim, and the counties of Alameda and Sonoma, until January 1, 2014, to establish family justice centers (FJCs) to assist victims of domestic violence, sexual assault, elder abuse, human trafficking, and other victims of abuse and crime. This bill would require each FJC to maintain an informed consent policy in compliance with all state and federal laws protecting the confidentiality of the information of victims seeking services. This bill would require the Office of Privacy Protection (OPP), in conjunction with the four pilot centers and relevant stakeholders, to develop best practices to ensure the privacy of all FJC clients and shall submit a report to the Legislature no later than January 1, 2013., 189523=Yeah, emotional and behavioral problems like sexting strange women while your pregnant wife is away at work  —  or (see recent posts — I can’t recall the name — of key Obama appointee starting a baby in May out of wedlock, and then marrying a newer, better woman the following December, while one’s job description includes the words “healthy marriage, responsible fatherhood” oversight.  I DNR exact details but you can see my 2011 posts, there are photos) —, 487328=This has currently flown through House & Senate and as of June 9th was referred to  Location: Assembly Committee Public Safety Committee  and I think, Judiciary.  Here’s some analysis from the Senate Appropriations Committee.  Senator Christine Kehoe (who sponsored the bill) just so happens to be chair of the appropriations committee and from one of the cities involved in expanding the Justice Center concept (actually the city that started it:  San Diego)., 367407=10:55 – 11:55 am, 115754=September 22-24 Phoenix, AZ International Marriage Conference}",
    "textBeforeTable": "Sunday, 14th September, 2008 And in 2008, they helped organize a marriage conference in Uganda: PROTECT MARRIAGE ARIZONA C-02-2006 (ANTI-GAY) The National Association of Marriage Enhancement 13422 N Cave Creek Rd, Ste 3 Phoenix, AZ 85022 05/16/06 – $5,000.00 – Cash – Filed: 06/30/06 10/17/07 – $2,000.00 – Cash – Filed: 06/16/08 This funding began in 2006.  FOr a comparison, in 2006, the same group contributed to opposing same-sex marriage in Arizona, under “NAME” — meaning it was taking from TANF for political activity: 75-1552:Temporary Assistance for Needy Families Program Source: Reason for Modification: NATIONAL ASSOCIATION OF MARRIAGE ENHANCEMENT 13422 NORTH CAVE CREEK RD , PHOENIX, ARIZONA Recipient: Yes, this was money taken from TANF, or welfare, as another database shows: $ 1,250,000 362992336 MARICOPA 85022 AZ PHOENIX NATIONAL ASSOCIATION OF MARRIAGE ENHANCEMENT  Sum of Awards DUNS Number County ZIP Code State City Recipient Name $ 250,000 DR LEO GODZICH DEMONSTRATION DISCRETIONARY 93086 09/24/2010 HEALTHY MARRIAGE DEMONSTRATION, PRIORITY AREA 5 90FE0040 PHOENIX NATIONAL ASSOCIATION",
    "textAfterTable": "* * * *  Haggard’s support system includes Leo Godzich, who runs a Phoenix-based marriage ministry and said he met with Haggard at least once a week for more than a year. Godzich said Haggard remains committed to restoration, has paid a high price and still has much to offer. * * * * “If all men are honest, all men are liars and deceivers,” Godzich said. “Once someone is gifted and called, that is something they generally cannot escape. They will be used in that regard again.” Yes, this is definitely a type of religion  that believes in USING people — God uses people, and so do they.  SO what’s wrong with that, eh???   And NAME ave opened many marriage centers, particularly in churches.  THIS list (see site) is huge, and a bit disturbing only partial listing here: United States Alabama Huntsville The Rock Family Worship Center 2300 Memorial Pkwy SW 256-533-9292 http://www.the rockfwc.org Alaska Wasilla Wasilla Assembly of God PO Box 872010 907-376-5732 http://www.wasillaag.org Arizona Avondale Cornerstone Christian Center 11301 W Indian School Rd 623-877-3220 http://www.cornerstoneaz.org Arizona Chino Valley Word of Life Assembly",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}