{
    "relation": [
        [
            "Turn",
            "First Turn",
            "Second",
            "Second"
        ],
        [
            "Attack",
            "Earthquake",
            "Eruption",
            "Fissure"
        ],
        [
            "Category",
            "Tough",
            "Beauty",
            "Tough"
        ],
        [
            "Appeal",
            "1",
            "1",
            "2"
        ],
        [
            "Jam",
            "3",
            "0",
            "1"
        ],
        [
            "Description",
            "Badly startles those that have made appeals.",
            "The appeal works better the later it is performed.",
            "Cuts in half the appeal points of all Pokémon that appealed before the user."
        ]
    ],
    "pageTitle": "Contest combination - Bulbapedia, the community-driven Pokémon encyclopedia",
    "title": "",
    "url": "http://bulbapedia.bulbagarden.net/w/index.php?title=Contest_combination&oldid=824595",
    "hasHeader": true,
    "headerPosition": "MIXED",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989891.18/warc/CC-MAIN-20150728002309-00270-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 37104239,
    "recordOffset": 37087420,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Lead Move Category: Cute When the second move of any of the below are used it will receive double the appeal points it would have earned otherwise. Combinations usable in Pokémon Contests 2 Combinations in Super Contests 1.5 Lead Move Category: Beauty 1.4 Lead Move Category: Cool 1.3 Lead Move Category: Tough 1.2 Lead Move Category: Smart 1.1 Lead Move Category: Cute 1 Combinations usable in Pokémon Contests Contents Many moves are both a follow-up move for one combination while themselves able to be followed up by another move. This, however, is not allowed, and if a move is used as a follow-up move, it will not set up another move to follow it. Several of these combinations were actually introduced in Generation II before Contests as \"combination attacks\" which offered beneficial bonuses when used in battle, such as Defense Curl and Rollout. A Contest combination is a group of several moves, which, when used in Contests and Super Contests, will form a specially recognized combination with another move used afterwards, gaining the user more",
    "textAfterTable": "Appeal Jam Description First Turn Charm Cute 2 1 Subtract 4 appeal points from any Pokémon who appealed before the user who used the same type of move. Subtract 1 point from any who did not use the same type of move. Second Flatter Smart 2 0 Makes all Pokémon after the user nervous. Second Growl Cute 2 0 The appeal works great if performed last. Second Rest Cute 2 0 Can avoid being startled by others once. Second Sweet Kiss Cute 2 0 Makes all Pokémon after the user nervous. Second Tail Whip Cute 2 0 The appeal works great if used last Turn Attack Category",
    "hasKeyColumn": true,
    "keyColumnIndex": 1,
    "headerRowIndex": 0
}