{
    "relation": [
        [
            "Subcategory",
            "Automation",
            "Backup",
            "Benchmarking",
            "Dash Search Plugins",
            "Data Recovery",
            "Disk Utilities",
            "Package Management",
            "Themes"
        ],
        [
            "Rule",
            "debtag admin::automation",
            "debtag admin::backup",
            "debtag admin::benchmarking",
            "package name unity-lens-* but not *-dbgsym",
            "debtag admin::recovery",
            "debtag admin::filesystem or admin::forensics",
            "debtag admin::package-management",
            "???"
        ],
        [
            "Show non-application packages by default",
            "yes",
            "yes",
            "yes",
            "yes",
            "yes",
            "yes",
            "yes",
            "yes"
        ]
    ],
    "pageTitle": "SoftwareCenter - Ubuntu Wiki",
    "title": "",
    "url": "https://wiki.ubuntu.com/SoftwareCenter?action=show&redirect=AppCenter",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042992543.60/warc/CC-MAIN-20150728002312-00191-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 908560947,
    "recordOffset": 908482676,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{131579=“by Canonical until June 2027”, or “none (Canonical updates ended June 2011)”, 340967=In Ubuntu 11.04 (April 2011), we shipped Ubuntu Software Center 4.0, with ratings and reviews for software, and many performance improvements., 339177=In Ubuntu 10.04 LTS (April 2010), we shipped Ubuntu Software Center 2.0.2. This version:, 69392=A category screen should be searchable. It should always begin with a heading giving the name of the category, and end with centered text of the form “1234 items available” (this count should include items in any subcategories)., 339901=In Ubuntu 10.10 (October 2010), we shipped Ubuntu Software Center 3.0.4. This version:, 79110=At the end of the list should be centered text of the form “1047 items installed”., 75668=Like the category screen, a subcategory screen should be searchable. It should always begin with a link to the parent category and a heading naming the subcategory, and end with centered text of the form “1234 items available”. If more than one sort order has been implemented, opposite the heading should be an option menu for sorting “By Rating” (the default), “By Popularity” (once implemented), “By Name”, or “Newest First”., 5183=Created: 2005-08-29 by MatthewPaulThomas, 364927=SoftwareCenter (last edited 2015-06-15 08:51:37 by mpt), 337785=In Ubuntu 9.10 (October 2009), we shipped Ubuntu Software Center 1.0.2. This included:, 341498=In Ubuntu 12.04 (April 2012) we will ship Ubuntu Software Center 5.2, with personalized recommendations, Unity launcher integration, system requirements disclosure, and access to backports., 341228=In Ubuntu 11.10 (October 2011), we shipped Ubuntu Software Center 5.0, with a simpler layout, and “Top Rated” sections to feature interesting software., 95886=Within USC, examine the title, summary, and description of an item. Is it concise and helpful? Is the spelling, grammar, and paragraph formatting correct? If it’s a non-geek application, does the description avoid geek language? Is it in the appropriate category? If you find a problem, and you are comfortable diving into code to fix it yourself, follow the distributed development instructions with the app-install-data-ubuntu package to fix problems in an application’s title or summary, or the package itself to fix problems with its description. Otherwise, report a bug with (a) the current text, (b) what needs improving, and (c) your proposed replacement text, and give the bug report the metadata tag.}",
    "textBeforeTable": "The package Description should be: The application Comment should be “Lets you choose from thousands of applications available for Ubuntu” (without a period), and the summary in the About window should be “Lets you choose from thousands of applications available for Ubuntu.” (with a period). The package Summary should be “Utility for browsing, installing, and removing applications” (without a period). The package name and executable name should both be software-center. The name should be localized, for example as “Centre” in Commonwealth countries. It is not necessary to translate it word-for-word, but translations should (a) include the word “Ubuntu” (to reduce confusion with Debian Software Center etc), and (b) should not use a word that means “applications” in particular (because it also allows installation of non-application software such as add-ons, fonts, and themes). For example, you might say “JazzWriter, the hit note-taking app, has just arrived in Ubuntu Software Center.” the Software Center ✘ Software Center ✘ the Ubuntu Software Center ✘ Ubuntu Software Center ✔ The program itself, as",
    "textAfterTable": "If the package is known, the software item screen for the package. Test case: (sc-001) Follow the link apt:python-wxtools. It should show the item screen for “All Software” > “System” > “python-wxtools”. If the package is not known, an ephemeral error screen in the “All Software” section. It should be possible to return to this screen later in the navigation history, but it should not be possible to navigate to it directly. Test case: (sc-009) Follow the link apt:abcdefghijklmnop. If the URL is of the form “apt:package-name?minver=1.0”: If the package is not known, the same kind of ephemeral error screen as used for apt:unknown-package-name. If the package is known, the software item screen for the package. If a version late enough is not available, this screen should include an extra ribbon, between the summary and the installation state bar: “Sorry, version {minver} isn’t available in your current software sources.”. If the URL is of the form “apt:package1,package2,…”: A custom package list for the package names (including displaying the comma-separated names in the search field).",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}