{
    "relation": [
        [
            "Who to contact",
            "Susan Stephenson-Director of Financial Aid",
            "Rex Cogdill-VP of Student Services"
        ],
        [
            "Email Address",
            "susan.stephenson@ewc.wy.edu",
            "rex.cogdill@ewc.wy.edu"
        ],
        [
            "Phone Number",
            "307.532.8325",
            "307.532.8257"
        ]
    ],
    "pageTitle": "Consumer Information - Eastern Wyoming College - Eastern Wyoming College - It's A Great Decision!",
    "title": "",
    "url": "http://ewc.wy.edu/consumer-information/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989891.18/warc/CC-MAIN-20150728002309-00062-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 85926723,
    "recordOffset": 85897852,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{33713=Safety and security informationfor the Eastern Wyoming College Torrington Campus and Douglas Campus, including crime & fire statistics for the 2012 calendar year. This information was submitted to the U.S. Department of Education according to law., 61840=1931 N. Meacham Road, Suite 100, 77949=University of Wyoming: students transferring to UW from any Wyoming  community college with an associate of arts o science degree will have me the lower division USP 2003 requirements, except for the second math course. Students transferring to UW from any Wyoming community college without and AA or AS degree will their transcripts reviewed with the Transfer Guide on a course by course basis., 15768=Open Monday-Friday, 8:00 am to 5:00 pm, 34279= An email is sent to all students prior to October 1st each year with a link to this information., 15822=The first week of classes the bookstore will be open until 7:00 pm, 62185=EWC in Torrington was recommended for a ten-year reaccreditation following the Higher Learning Commission (HLC) Team Visit in 2010. EWC has notified HLC that it would enter the Open Pathway track for accreditation., 27040=The Rights of Students with disabilities attending Eastern Wyoming College (EWC) are protected under Section 504 of the Rehabilitation Act of 1973, the Americans with Disabilities Act of 1990 (ADA) and the ADA Amendments ACT of 2008.}",
    "textBeforeTable": "Academic Program (Educational Program, Instructional Facilities, and Faculty) More information can be found in the student handbook page 9, and each student is emailed notice annually through their LancerNet email.There is information for Faculty located in the Faculty Handbook. It is the policy of Eastern Wyoming College to respect the Copyright law. Materials that are distributed digitally, either on media or via download, including, but not limited to, software, music, books, movies and/or images are subject to copyright. The College will not tolerate copyright infringement that occurs on the Eastern Wyoming College network. 307.532.8221 dee.ludwig@ewc.wy.edu Dee Ludwig Phone Number Email Address Who to contact Copyright Information Consumer Information Topics The Higher Education Act of 1965 (HEA), as amended by the Higher Education Opportunity Act of 2008 (HEOA) requires that postsecondary institutions participating in federal student aid programs make certain disclosures to enrolled and prospective students, parents, employees, and the public. The following information is disclosed to you in compliance with federal law. For additional information, including requesting a paper copy of any materials, please call or e-mail the appropriate office or visit the indicated websites.  ",
    "textAfterTable": "Information concerning EWC’s current educational programs and course descriptions is available in the EWC catalog. This includes a listing of current faculty. Information about campus facilities, including those that relate to instructional programs is also available in the EWC catalog and also in the EWC College ViewBook. Code of Conduct for Education Loans Who to contact Email Address Phone Number Susan Stephenson-Director of Financial Aid susan.stephenson@ewc.wy.edu 307.532.8325 EWC recognizes that ensuring the integrity of the student financial aid process is critical to providing fair and affordable access to higher education. We adhere to the following guiding principles which were designed to avoid any potential conflict of interest between EWC and its students and their parents in the financial aid process: EWC Loan Code of Conduct Completion/Graduation and Transfer-out Rates (Including Disaggregated Completion/Graduation Rates)(Student Right-to-Know Act) Who to contact Email Address Phone Number Kimberly Russell kimberly.russell@ewc.wy.edu 307.532.8251 Please see Student Right to Know",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}