{
    "relation": [
        [
            "",
            "2001:H2",
            "2002:H1",
            "2002:H2",
            "2003:H1",
            "2003:H2"
        ],
        [
            "Average Monthly Change",
            "-203.00",
            "-26.00",
            "-5.00",
            "ND",
            "ND"
        ],
        [
            "Forecast",
            "ND",
            "ND",
            "ND",
            "107.00",
            "225.00"
        ]
    ],
    "pageTitle": "FRB: FOMC meeting -- January 28-29, 2003 presentation materials",
    "title": "",
    "url": "http://www.federalreserve.gov/monetarypolicy/files/FOMC20030129material.htm",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989891.18/warc/CC-MAIN-20150728002309-00154-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 454047283,
    "recordOffset": 454011125,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{40529=Title: S&P 500 Index Series: S&P 500 Index Horizon: November 1, 2002 - January 27, 2003 Description: The S&P 500 Index declined sharply in the last two weeks., 33048=English, William, William Nelson, and Brian Sack. 2002. \"Interpreting the Significance of the Lagged Interest Rate in Estimated Monetary Policy Rules,\" FEDS working paper 2002-24., 71258=The period covered is from 1998 to 2004. The data are plotted on a curve and are expressed as percent., 155750=Three-Month Yen Futures Rates, for 2002 through mid-2004, as of January 29, 2002, as of June 25, 2002, and as of January 27, 2003. The range of the y-axis is [0.0, 2.0]; unit is percent. The rates as of January 29, 2002, begin in mid-2002 at about 0.2 percent and rise to about 0.5 percent by the end of the period. The rates as of June 25, 2002, begin in mid-2002 at about 0.1 percent and rise to about 0.3 percent by the end of the period. The rates as of January 27, 2003 begin in early 2003 at about 0.1 percent and rise to about 0.2 percent by the end of the period., 94703=The figure's X-axis shows time periods from T through T+4. The Y-axis represents an index (trough equals 100); the range is from 99.0 through 100.5. The data are plotted on two curves. The first curve is for the current episode, trough equals 2001:Q4, and the second curve is for the 1990-91 recession, National Bureau of Economic Research (NBER) trough., 69687=The curve begins at just under 10 in 1974, dips to about 7 in 1975, and increases to about 19 in 1980. The curve then decreases through the early 1980s, dropping to about 13 in 1984. It then increases to about 16 in 1985. The curve then drops to about 8 in 1987, remains at about that level through 1989, then decreases to about 5 in 1990. The curve moves generally upward, reaching about 18 in 1999. It then decreases to about 5 in 2001, then turns upward to end at about 6 in 2002. Projections show the curve reaching about 9 in 2005., 160220=Total Employment, on a monthly basis for 2001 through November 2002 for the euro area and Japan, and through December 2002 for Canada. The range of the y-axis is [90, 110]; index, Jan. 2001 = 100. All three indexes start at 100 at the beginning of the period. The index for the euro area declines in a nearly straight line to about 96 by the end of the period. The index for Japan declines, with mild fluctuation, to about 98 by the end of the period. The index for Canada remains near 100 through late 2001 and then rises in a nearly straight line to about 104 by the end of the period., 70299=The figure shows other equipment excluding high-tech and transportation. The period covered is from 1974 to 2005. The data are plotted on a curve and represent a four-quarter percent change with a scale from negative 2 to 8. A horizontal line is drawn at 0., 24390=A line chart displays the actual funds rate (solid line), Taylor rule without inertia (dashed line), and Taylor rule with inertia (dotted line). The period covered is from 1988 through 2002. As noted above, the estimated Taylor rule with inertia follows the actual funds rate path much more closely than the estimated rule without inertia, which apparently supports gradualism., 2072=Estimated using real-time data from 1987 to 2000, 34528=Title: Current 3-Month Deposit Rates and Rates Implied by Traded Forward Rate Agreements Series: U.S. and Euro Area LIBOR fixings, U.S. and Euro Area 3-, 6-, and 9- Month Forward Rate Agreements Horizon: November 1, 2002 - January 27, 2003 Description: Three-month Libor fixings and rates implied by traded forward rate agreements in the U.S. and euro area declined during the intermeeting period., 179203=Real Exchange Rate Outlook, for 2001 through early 2003 (actual), along with the June 2002 Greenbook forecast for mid-2002 through 2003 and the January 2003 Greenbook forecast from early 2003 through 2004. The range of the y-axis is [90, 105]; index, 2001:Q1 = 100. The actual real exchange rate starts at 100 at the beginning of the period, rises to about 103 by early 2002, and then declines to about 99 by early 2003. The June 2002 Greenbook forecast starts at about 102 in mid-2002 and declines to about 99 by the end of 2003. The January 2003 Greenbook forecast starts at about 99 in early 2003 and declines to about 98 by the end of 2004., 51872=The period covered is from 1998 through 2002. The data are diffusion index values and are shown as per ISM, or Institute for Supply Management. The data are plotted on a curve, and a horizontal line is drawn at 50. Data above 50 are presented as too high, and data below 50 are presented as too low., 167762=Stock Market Indexes, on a weekly basis for Korea, Singapore, and Hong Kong for 2001 through early 2003. The range of the y-axis is [50, 175]; index, Jan. 5, 2001 = 100. The indexes for all the countries start at 100 at the beginning of 2001. With some volatility, the index for Korea declines to about 80 by late 2001, rises to about 160 by early 2002, and then falls to just over 100 by early 2003. With some volatility, the index for Singapore declines to about 70 by late 2001, rises to about 90 by early 2002, and then falls to about 70 by early 2003. With some volatility, the index for Hong Kong declines to about 60 by late 2001, rises to about 70 by end-2001 and fluctuates around that level until mid-2002, and then falls to about 60 by early 2003., 35489=Title: Euro-Dollar Exchange Rate Series: Euro-USD Horizon: January 1, 2002 - January 27, 2003 Description: The dollar has appreciated against the euro., 41584=Title: 10-Year European Sovereign Debt Spreads over German Bunds Series: Spreads between 10-Year Italian, Spanish, and French Sovereign Debt Yields and the German Bund Yield Horizon: November 1, 2002 - January 27, 2003 Description: The spreads between Italian, Spanish, and French sovereign debt yields and the German Bund yield have narrowed., 34246=Woodford, Michael. 1999. \"Optimal Monetary Policy Inertia.\" The Manchester School Supplement, pp. 1-35., 180994=Current Account, in terms of percent of GDP and in terms of level (billions of dollars) for 1995 through late 2002 (actual) and for late 2002 through 2004 (forecast). The range of the left y-axis, measured in terms of percent of GDP, is [-7, 1]. The range of the right y-axis, measured in terms of level or billions of dollars, is [-700, 100]. The graph shows the current account to be in deficit for the entire period, and the two series track closely for the entire period. The current account in terms of level starts at a deficit of about $100 billion, which widens to about $550 billion by late 2002. The forecast shows the deficit widening further, to about $625 billion by end-2004. The current account in terms of percent of GDP starts at a deficit of about 1½ percent of GDP, which widens to a deficit of about 5 percent of GDP by late 2002. The forecast shows the deficit widening further, to around 5¼ percent of GDP by end-2004., 36731=Title: Corporate Spreads to U.S. Treasuries and Corporate Issuance Data: Investment-Grade Series: Investment Grade U.S. Corporate Bond Index, Weekly Investment Grade U.S. Corporate Issuance Horizon: November 1, 2002 - January 24, 2003 Description: The investment grade U.S. Corporate Bond Index has decreased over the past few months., 71372=At the beginning of 1998, the curve starts at about 40 percent and remains at about that level until 1999:Q1. The curve decreases to about 39 percent at mid-1999 and stays at about that level until 2000:Q1. It increases to about 40 percent in 2000:Q2 then decreases to about 39 percent near the end of 2000. The curve decreases to about 32 percent in 2002:Q2, stays near that level until about 2002:Q3, and decreases to just under 32 percent in about 2002:Q3. Projections show a decrease to about 30 percent by the end of 2004., 157342=U.K. Housing Prices, on a monthly basis for 2001-2002. The index is a nationwide building society house price index. The range of the y-axis is [90, 140]; index, 2001:Q1 = 100. The series starts at 100 and rises on a gentle slope with few variations to nearly 140 by the end of the period., 32184=Dotsey, Michael, and Chris Otrok. 1995. \"The Rational Expectations Hypothesis of the Term Structure, Monetary Policy and Time-Varying Term Premia,\" Economic Quarterly, Federal Reserve Bank of Richmond, pp. 65-81., 4635=The middle-right panel illustrates how the prescriptions from the estimated and optimal policy rules differ. The prescription for the funds rate from the estimated policy rule falls gradually from about 1.25 percent at the end of 2002 to about 0.75 percent by the end of 2003 and then gradually increases to about 1 percent by the end of 2004. In contrast, the optimal policy rule incorporates much more aggressive easing, with the funds rate falling from about 1.25 percent to near 0 percent in the first quarter of 2003. Thereafter, the funds rate increases to 3 percent by the middle of 2004 and then falls to about 2 percent by the end of 2004. For reference, the chart also displays the policymaker perfect foresight path from the Bluebook. This path falls gradually to about 50 basis points in the third quarter of 2003 and then gradually increases to about 2 percent by the end of 2004. This path is smoother than the optimal policy path because the objective function used in generating this path assumes that the FOMC has a preference for smooth policy adjustment., 59872=The period covered is from 1998 through 2004. The data are given as a ratio of household net worth to total disposable personal income, or DPI, and are plotted on a curve., 33409=Rudebusch, Glenn D. 2002. \"Term Structure Evidence on Monetary Policy Inertia and Interest Rate Smoothing.\" Journal of Monetary Economics 49, pp. 1161-1187., 37270=Title: Corporate Spreads to U.S. Treasuries and Corporate Issuance Data: High Yield Series: High Yield U.S. Corporate Bond Index, Weekly High Yield U.S. Corporate Issuance Horizon: November 1, 2002 - January 24, 2003 Description: The high yield U.S. Corporate Bond Index has declined over the past few months., 70568=The curve begins at about 5.5 in 1974, dips to about 3 in 1976, then increases to about 5.5 in 1979. The curve generally decreases through the early 1980s, falling to just under 0 in 1982. It then increases to just under 2 in 1984. The curve decreases to about 1 in 1987, then increases to just above 2 in 1989. It drops to a little above 0 in 1991, then generally increases to just below 4 in 1997. The curve decreases to about 3.5 in 1999, then increases again to just below 4 in 2000. It then decreases and ends at about 2 in 2003. Projections show the curve increasing to about 3 in 2005., 156393=Stock Prices, on a weekly basis for the S&P 500, the DJ Euro Stoxx, and the TOPIX for 2001 through early 2003. The range of the y-axis is [70, 160]; index, June 25, 2002 = 100. The S&P 500 starts at about 132 and, with modest volatility, declines to about 95 by late 2001, rises to about 115 by early 2002, declines to about 80 by late 2002, then rises and fluctuates around 90, ending at about 88 at the end of the period. The DJ Euro Stoxx starts at 150 and, with modest volatility, declines to about 95 by late 2001, rises to about 120 by early 2002, declines to about 74 by late 2002, and then rises to just over 80 by the end of the period. The TOPIX starts at about 127, and, with modest volatility, rises to about 140 by mid-2001, declines to about 94 by early 2002, rises to about 110 by mid-2002, and then declines to about 85 by the end of the period., 162287=2003 Real GDP Contributions. Plots the contributions of domestic demand and net exports to 2003 real GDP growth for the euro area, Japan, and Canada as a bar chart. The range of the y-axis is [0, 3]. Approximate values are as follows., 65593=The figure shows the ratio of consumer payments to total disposable personal income, or DPI. Consumer payments include mortgage service, rental payments, motor vehicle leasing, and consumer credit payments. The data are expressed as a percent and plotted on a curve. The period covered is from 1985 through 2002., 33898=Rudebusch, Glenn D. 2001. \"Is the Fed Too Timid? Monetary Policy in an Uncertain World,\" Review of Economics and Statistics 83, pp. 203-217., 39715=Title: 10-Year U.S. Treasury Note Series: 10-Year U.S. Treasury Note Yield Horizon: November 1, 2002 - January 27, 2003 Description: The 10-year Treasury yield remains little changed since the last FOMC meeting., 163350=Real GDP Growth (Percent, SAAR) for 2002:H2 (actual), 2003:H1 (forecast), 2003:H2 (forecast), and 2004 (forecast)., 43508=STRICTLY CONFIDENTIAL (FR) CLASS I-FOMC* *Downgraded to Class II upon release of the February 2003 Monetary Policy Report., 907=The top panel plots a time-series of the intended federal funds rate over the period from 1987 to present. The chart demonstrates the FOMC has tended to adjust the stance of policy with a series of fairly small consecutive tightenings or easings. In the chart, 88% of policy actions moved in the same direction as policy action at the previous meeting, and 96% of policy actions were 50 basis points or less., 38347=Title: Total U.S. Corporate Debt Issuance Series: Quarterly U.S. Corporate Debt Issuance Horizon: 2001-2002 Description: Total U.S. corporate debt issuance declined between 2001 and 2002., 168593=CPI Inflation (Percent, SAAR) for 2002:H2 (actual), 2003:H1 (forecast), 2003:H2 (forecast), and 2004 (forecast)., 43991=The figure shows data plotted on a curve that depicts the production of motor vehicles. The curve starts in 2000:Q1 at about 13.5 million, decreases to about 13.15 million, increases to about 13.25 million, and falls to about 12.25 million near the end of 2000:Q2. In the third quarter of 2000, the curve increases to almost 13 million and then falls to about 10.75 million near the beginning of 2001:Q1. The curve then generally increases to reach approximately 12 million near the end of 2001:Q2, drops to about 10.75 million near the beginning of 2001:Q4, then climbs to about 12.25 million later in that quarter. The curve stays at about that rate through 2002:Q1 and midway through 2002:Q2, then increases to about 13.25 million near the beginning of 2002:Q3. The curve drops to about 12.25 million near the beginning of 2002:Q4, increases to almost 13 million at midquarter, then decreases to just below 12 million in December 2002., 39320=Title: 2-Year U.S. Treasury Note and Fed Funds Target Rate Series: 2-Year U.S. Treasury Note Yield, Fed Funds Target Rate Horizon: November 1, 2002 - January 27, 2003 Description: The 2-year Treasury yield has declined during the intermeeting period., 32427=Goodfriend, Marvin. 1991. \"Interest Rates and the Conduct of Monetary Policy.\" Carnegie-Rochester Series on Public Policy 34, pp. 7-30., 57215=Data for 2003 and 2004 are projections. Data above 0.0 are presented as stimulative, and data below 0.0 are presented as restrictive., 48532=The period covered is from 1998 through 2002. The data are plotted on a curve and represent manufacturing output, excluding motor vehicles. The data are expressed as index values (1996 equals 100)., 37801=Title: Monthly Corporate Bond Spreads to U.S. Treasuries Series: Investment Grade and High Yield U.S. Corporate Bond Indices Horizon: September 3, 2002 - January 24, 2003 Description: The spreads between investment grade and high yield U.S. corporate bond indices and U.S. Treasury yields have narrowed during the intermeeting period., 154247=Ten-Year Sovereign Bond Yields, on a weekly basis for the United States, Germany, and Japan for 2001 through early 2003. The range of the y-axis is [0, 6]; unit is percent. The U.S. yield starts at about 5 percent, fluctuates around 5 percent through mid-2002, falls to about 3.7 percent by late 2002, then rises slightly and fluctuates around 4 percent, ending just under 4 percent in early 2003. The German yield starts at about 5 percent, fluctuates around 5 percent through mid-2002, and then gradually declines to just over 4 percent by early 2003. The Japanese yield begins at just over 1½ percent and declines gradually to about ¾ percent by early 2003., 197696=In the middle panel, civilian unemployment rate peaks within a quarter or two of the current meeting before decreasing. The rate of decline varies in the different forecasts. In the Greenbook path, the unemployment rate reaches a maximum of 6-1/4 percent in mid-2003 and then drops gradually to about 5-1/4 percent by the end of 2004. The unemployment rates under the 1 percent inflation goal and the 1-1/2 percent inflation goal peak at about the same level and time as in the Greenbook but show steeper declines; they fall to 5 percent and to 4-3/4 percent, respectively, by the third quarter of 2004 and remain about flat until the end of 2008., 191242=The line graph in the top-left panel shows the expected federal funds rate inferred from future quotes for December 9, 2002 (dotted line) and January 28, 2003 (solid line). The January 28, 2003 line is flat for most of 2003, which indicates that market participants are not expecting a policy change, and then rises steadily to about 3.2 percent in 2005, which indicates expected policy firming starting year-end., 40847=Title: S&P 100 Volatility Index (VIX) Series: VIX Index Horizon: November 1, 2002 - January 27, 2003 Description: Implied volatility in equity markets has risen sharply in the last two weeks., 174982=EMBI+ Spreads, on a weekly basis for 2001 through early 2003 for Argentina and Brazil. For Argentina, the range of the left y-axis is [5, 75]. For Brazil, the range of the right y-axis is [5, 25]. Unit is percentage points. The spreads for Argentina start at about 7 percentage points at the beginning of the period, rise steeply to about 70 percentage points by mid-2002, then decline to about 60 percentage points by the end of the period. The spreads for Brazil start at about 8 percentage points, rise to about 12 percentage points by late 2001, decline to about 7 percentage points by early 2002, rise sharply to about 22 percentage points by mid-2002, drop briefly to about 17 percentage points, rise again to about 22 percentage points by late 2002, and then drop to about 14 percentage points at the end of the period., 97387=The period covered is from 1952 to 2003. The data are plotted on a curve and are expressed in billions of 1996 dollars., 161776=Long-Term Earnings Growth Forecast - Euro Area, for 1996-2002, where long-term earnings growth forecast is defined as 5-year earnings growth forecast constructed from I/B/E/S survey of analysts. The range of the y-axis is [10,18]; unit is percent per annum. The series starts at 14 percent, rises with some volatility to about 16½ percent by early 2001, and then drops sharply to about 10½ percent by end-2002., 196211=The top-left panel shows nominal federal funds rate. All the forecasts point to near-term policy easing. The Greenbook forecast is for the funds rate to move to 1-1/4 percent and hold there for most of 2003 and 2004 before inching up to 1-3/4 percent at the end of 2004. The optimal path under a 1 percent inflation goal prescribes a decline in the nominal federal funds rate by about 50 basis points to around 1/2 percent by mid-2003 and the optimal path with a 1-1/2 percent inflation goal points to a 100 basis points drop in the funds rate to about zero, also by mid-2003. After this trough, the two optimal policy paths recover steadily, and both hit a value of about 3.75 percent in 2006 after which they remain flat., 42869=Title: Domestic Portfolio: Permanent SOMA Holdings, Long-Term RPs, & Net Short-Term Operations Series: Permanent SOMA Holdings, Long-Term RPs, Short-Term RPs Horizon: June 26, 2002 - February 19, 2003 Description: Long-term RPs outstanding are projected to decline further., 34069=Rudebusch, Glenn D. 2002. \"Assessing Nominal Income Rules for Monetary Policy with Model and Data Uncertainty,\" Economic Journal 112, pp. 402-432., 155011=Three-Month Euro Futures Rates, for mid-2002 through mid-2004, as of January 29, 2002, as of June 25, 2002, and as of January 27, 2003. The range of the y-axis is [2.0, 5.0]; unit is percent. The futures rates as of January 29, 2002, begin in mid-2002 at about 3.7 percent and rise to about 4.9 percent by the end of the period. The futures rates as of June 25, 2002, begin in mid-2002 at about 3.6 percent and rise to about 4.7 percent by the end of the period. The futures rates as of January 27, 2003, begin in early 2003 at about 2.7 percent, decline to about 2.4 percent by mid-2003, and then rise to about 2.8 percent by the end of the period., 36101=Title: Trade Weighted U.S. Dollar Series: Trade-Weighted U.S. Dollar Horizon: January 1, 1995 - January 27, 2003 Description: The trade-weighted dollar has depreciated over the last year., 32836=Clarida, Richard, Jordi Gali, and Mark Gertler. 2000. \"Monetary Policy Rules and Macroeconomic Stability: Evidence and Some Theory.\" Quarterly Journal of Economics 115, pp. 147-180., 97651=The curve starts at about 20 billion dollars in 1952. It increases to about 90 billion in 1968. The curve remains near that level through about 1974, then increases to about 180 billion in 1992. The curve decreases to about 175 billion in 1993 and increases to about 260 billion in 2002. A dot represents an estimate of about 275 billion in 2003., 166721=Nominal Exchange Rates, Foreign currency/U.S. dollar, on a weekly basis for the Singapore dollar and the Korean won for 2001 through early 2003. The range of the y-axis is [90, 110]; index, Jan. 5, 2001 = 100. The indexes for both currencies start at 100 at the beginning of 2001. The index for the Singapore dollar rises to about 105 within a few months, fluctuates around that level through mid-2001, declines to about 100 by late 2001, rises again to around 105 and fluctuates around that level through early 2002, then declines to about 100 by mid-2002, rises to about 103 by late 2002, and then declines to just below 100 by the end of the period. The index for the Korean won dips to about 97½ within a few months, rises to about 107 in early 2001, immediately declines slightly, ranges from about 100-104 through early 2002, and then falls to about 92 by mid-2002, rises to about 98 in late 2002, and then drops to about 92 by the end of the period., 50729=The period covered is from 1998 through 2002. The data are inventory levels, excluding motor vehicles, and measured in days. The days' supply of inventories is an industrial production-based flow of goods system., 97518=An inset box shows the percent change at 4.0 percent for 2001, 2.4 percent for 2002, and 1.9 percent for 2003 (estimate)., 153265=Nominal Exchange Rates, Foreign currency/U.S. dollar, on a weekly basis for 2001 through early 2003. The range of the y-axis is [70, 110]; index, week of January 28, 2002 = 100. The three series are the euro, the yen, and a basket of \"major currencies,\" where the last is the trade-weighted average against major foreign currencies. The major currencies index starts at about 92, moves generally upward to nearly 100 by early 2002, and then declines to about 88 by early 2003. The euro begins at about 92, increases to about 103 by mid-2001, drops to about 95 a few months later, climbs to about 100 by early 2002, and then declines to about 80 by early 2003. The yen starts at about 86, fluctuates around 90 during most of 2001, rises to about 100 by early 2002, declines to about 87 by mid-2002, rises to about 93 by the end of the year, and then declines to about 88 by early 2003., 197118=The top-right panel shows the path for the real federal funds rate, which exhibits the same pattern, only shifted slightly lower. The Greenbook forecast indicates a flat path at about zero percent before ticking up to about 1/2 percent. The path under a 1 percent inflation goal drops to -1/2 percent while the path under a 1-1/2 percent inflation goal drops to about -1 percent in mid-2003. Both optimal paths recover to about 2.5 percent by early 2006 and then remain flat until the end of 2008., 33645=Levin, Andrew, Volker Wieland, and John C. Williams. 1999. \"Robustness of Simple Monetary Policy Rules under Model Uncertainty.\" In Monetary Policy Rules, ed. John B. Taylor, pp. 263-299. Chicago: Chicago University Press., 95133=The figure's X-axis shows time periods from T through T+4. The Y-axis represents an index (trough equals 100); the range is from 99 through 106. The data are plotted on two curves. The first curve is for the current episode, trough equals 2001:Q4, and the second curve is for the 1990-91 recession, National Bureau of Economic Research (NBER) trough., 200214=The panel depicts the actual real federal funds rate starting in the first quarter of 1990, together with market-based and staff estimates of the equilibrium real funds rate and an historical average calculated over the 1966-2002 period. The historical average is plotted as a horizontal line at 2.70 percent, while the actual real funds rate and the market-based estimate are plotted as declining lines. The staff estimates consist of a shaded region bound by the maximum and minimum values for each quarter. The market-based estimate is currently slightly above 3 percent, while the staff estimates range between roughly 1-1/2 percent and -1/4 percent. Two points correspond to alternative values of the actual real funds rate based on two possible monetary policy decisions--i.e., no change in the target federal funds rate, and a 25 basis point cut., 182024=Financial Flows, Billions of dollars. The table shows data for 2001 in Column 1, for projected 2002 in Column 2, and the change from 2001 to 2002 in Column 3., 43418=Material for Staff Presentation on the Economic Outlook January 28, 2003, 158015=Real GDP (percent change, SAAR*), U.S. and total foreign,** as a bar chart for 2002:H1 (actual), 2002:H2 (projected), 2003:H1 (projected), 2003:H2 (projected), and 2004 (projected). The range of the y-axis is [0, 6]. Approximate values for the five periods are as follows., 179936=Real Growth of Exports, Imports, as a bar chart for 2001 (actual), 2002 (projected), 2003 (projected), and 2004 (projected). The range of the y-axis is [-15, 10]. Approximate values for the four periods are as follows., 32593=Rudebusch, Glenn D. 1995. \"Federal Reserve Interest Rate Targeting, Rational Expectations, and the Term Structure.\" Journal of Monetary Economics 35, pp. 245-274., 95808=The 1990-91 recession curve starts at about 100 in the middle of period T. It increases to about 101.2 in the middle of T+1 and increases again to approximately 101.5 in the middle of T+2. The curve increases to about 102.2 in the middle of T+3, then increases to and ends at about 104.1 in the middle of T+4., 41223=Title: Global Equity Indices Series: S&P 500 Index, Dow Jones Euro Stoxx Index, German DAX Index Horizon: November 1, 2002 - January 27, 2003 Description: Global equity indices have declined over the last two weeks., 19993=Material for a presentation to the FOMC January 28, 2003, 160873=Orders, on a monthly basis for 2001 through November 2002 for Canada, Germany, and Japan. Orders are defined as manufacturing orders for Canada and Germany, and as private core machinery orders for Japan. The range of the y-axis is [70, 110]; index, Jan. 2001 = 100. All three indexes start at 100 at the beginning of the period. The index for Canada, with some volatility, immediately rises to about 105, declines to about 95 by late 2001, and then rises to about 101 by the end of the period. The index for Germany, with some volatility, declines to about 95 by late 2001, and then rises to about 99 by early 2002, and then fluctuates between about 96 and 99, ending at about 99 at the end of the period. The index for Japan, with some volatility, declines to about 82 by the end of the period., 2301=The bottom-right panel demonstrates how well this specification works in explaining the policy easing episode in 2001. The actual path of the funds rate is plotted along with the projected value of the funds rate derived from the estimated equation. The chart indicates that the estimated equation captures much of the observed behavior of the funds rate in 2001, although the actual path of policy easing was somewhat faster than the model would have predicted., 35061=Title: 10-Year U.S. Treasury and German Bund Yields Series: 10-Year U.S. Treasury and German Bund Yields Horizon: November 1, 2002 - January 27, 2003 Description: Ten-year U.S. Treasury and German Bund yields declined over the intermeeting period., 60055=The curve begins at about 5.75 at the start of 1998 and then decreases to about 5.4 by Q3. The curve increases through mid-1999 to about 5.9, dips to about 5.8 in Q3, and increases to about 6.3 near the end of 1999. The curve declines through 2001:Q1 to about 5.5. It then increases to about 5.6 at the beginning of Q2, decreases to about 5.3 in mid-2001, and increases to about 5.5 by year-end. The curve declines to about 4.8 by 2002:Q3. The curve then increases to about 4.8 at the end of 2002 and is projected to remain near that point through the end of 2004., 35782=Title: Dollar-Yen Exchange Rate Series: USD-Yen Horizon: January 1, 2002 - January 27, 2003 Description: The dollar has depreciated against the yen over the intermeeting period., 184107=* Projections for lines 2 through 4 incorporate TIC data through November, and, for line 2, FRBNY data for December. Return to table, 69534=The period covered is from 1974 to 2005. The data are plotted on a curve and represent a four-quarter percent change with a scale of 0 to 20., 195228=Exhibit 2 is comprised of four panels which focus on the nominal federal funds rate, the real federal funds rate, the unemployment rate, and PCE inflation. Each of these panels contain 3 lines: the Greenbook history and forecast (black solid line), the path under optimal policy based rules based on a policymaker perfect foresight with a 1-percent inflation goal (red dotted line), and the path under optimal policy with a 1-1/2 percent inflation goal (blue dashed line). The Greenbook history and forecast extends from 2001 to 2004 while the paths under the optimal policy assumptions start in 2003, where the historic data ends, and extend to 2008. The optimal policy paths extend key assumptions of staff simulations (other than the path of monetary policy).*, 198433=The final panel shows PCE inflation (excluding food and energy) as a four-quarter percent change. The Greenbook path shows inflation staying flat for a few quarters at 1.3 percent before slipping to 1.2 percent by the end of 2004. Under the 1 percent inflation goal, inflation ticks up slightly in the near term before moving down to 1.1 percent by the end of 2005, after which it holds steady. Under the 1-1/2 percent inflation goal, inflation rises a bit more than in the other cases, to 1.4 percent, after which it fluctuates in a modest range., 52183=The curve starts at about 47 at the start of 1998. It then decreases to about 46, increases to about 49, and drops to about 44 in 1998:Q2. The curve then increases to about 51, decreases to about 49, and returns to about 51 by the end of 1998:Q3. The curve then decreases through 1998:Q4 and into 1999:Q1, ending at about 43. The curve fluctuates between 43 and about 45 through 1999:Q3, then increases to about 48 toward the end of the year. The curve trends generally upward through 2000 and reaches about 56 by year-end. It then generally moves downward, decreasing to about 45 by mid-2001, followed by an increase to about 48 in 2001:Q3. The curve then decreases through 2002:Q2 to about 39. The curve then increases to approximately 44 in that same quarter, drops to about 41 in 2002:Q3, and increases to about 47 in 2002:Q4 before decreasing to about 43 in December 2002., 48741=At the beginning of 1998, the curve is at about 103. It continues generally upward and reaches about 116 by mid-2000. The curve stays at about that point through year-end 2000, then decreases throughout 2001 to end the year at about 108. The curve increases to approximately 111 in mid-2002, decreases to about 109, and increases to about 110 by the end of 2002., 33249=Gerlach-Kristen, Petra. 2002. \"Interest-Rate Smoothing: Monetary Policy Inertia or Unobserved Variables?\" manuscript, University of Basel., 157708=Chart 11 is a three-by-two array of panels including graphs of real GDP, total employment, orders, long-term earnings growth forecast for the euro area, and 2003 real GDP contributions, and a table of real GDP growth for industrial countries., 65917=The curve starts at about 18.5 percent in 1985 and increases to about 19.75 percent near the beginning of 1987. The curve then decreases to about 18.6 percent near the beginning of 1989. The curve increases to about 19 near the beginning of 1990, then decreases to about 17.1 percent near the end of 1992. The curve fluctuates between about 17 and 17.2 through early 1994, then increases to reach a little less than 19 percent in the second half of 1997. The curve then decreases to about 18.75 near the beginning of 1998, then increases to about 19 percent near the end of 1999 and into early 2000. It then decreases to about 18.8 in 2000:Q1, then increases to about 19.2 in 2001. The curve decreases to about 19 percent near the end of 2001, then increases to about 19.6 percent in early 2002. The curve decreases and ends at a little less than 19 percent in 2002:Q4., 26575=A line chart displays the target federal funds rate (solid line), and the expected funds rate path as of the middle of each quarter (dashed lines). The period covered is from 2000 through 2002. As noted above, although the funds rate gradually fell in 2001, market participants anticipated few of these declines at a 6- to 9-month horizon, as they would have under policy inertia., 50953=The data are plotted on a curve. At the beginning of 1998, the curve is at about 55.25 days and dips to about 54.75 days near the end of the first quarter. The curve then moves generally upward, reaching a little above 56 days by year-end. The curve moves generally downward through 1999, falling to about 54 days by the end of the year. In 2000:Q1, the curve increases to about 54.75 days, decreases to approximately 53.5 in Q2, increases to about 54.6 days in Q3, then decreases to about 54 days toward the end of 2000. The curve trends upward throughout 2001, peaking at about 57 days by year-end. In 2002:Q2, the curve falls to about 54.5 days, increases to about 55.25 days, then dips to about 54.5 days. In 2002:Q3 and into 2002:Q4, the curve increases to about 55 days, then decreases and ends at about 54.25 days in December 2002., 43793=The period covered is from 2000 through 2002, with a scheduled quarterly average for production shown in 2003:Q1. The seasonally adjusted data are in millions of units at an annual rate., 40068=Title: U.S. Treasury Yield Curve Spreads Series: Spread between 30-Year and 3-Month, 10-Year and 2-Year, and 10-Year and 3-Month Treasury Yields Horizon: January 1, 1991 - January 27, 2003 Description: In the last two years, 10- and 30- year Treasury yields have risen more than 3-month and 2-year Treasury yields.}",
    "lastModified": "Fri, 02 Aug 2013 23:30:44 GMT",
    "textBeforeTable": "Top-left panel Nonfarm Payrolls Chart 6 Labor Markets 3.3 3.0 2.9 2.9       Previous 3.4 3.2 3.3 2.9 5. Potential Output Memo: 1.5 1.6 1.8 1.3 4.    Multifactor Productivity .3 .3 .3 .3 3.    Labor Composition .7 .3 .3 .4 2.    Capital Deepening      Contributions of: 2.3 2.0 1.9 1.9       Previous 2.4 2.2 2.3 1.9 1. Structural Productivity 2004 2003 2002 2001   (percent change) Bottom panel Structural Productivity and Potential Output Growth Source: NSF and Battelle Institute",
    "textAfterTable": "Top-right panel Actual Labor Productivity Chained 1996 dollars per hour   Actual Actual Forecast Trend Trend Forecast 2000:Q1 37.11 ND 37.19 ND 2000:Q2 37.66 ND 37.43 ND 2000:Q3 37.72 ND 37.68 ND 2000:Q4 37.88 ND 37.92 ND 2001:Q1 37.75 ND 38.10 ND 2001:Q2 37.72 ND 38.28 ND 2001:Q3 37.91 ND 38.46 ND 2001:Q4 38.59 ND 38.64 ND 2002:Q1 39.40 ND 38.86 ND 2002:Q2 39.56 ND 39.09 ND 2002:Q3 40.10 40.10 39.31 39.31 2002:Q4 ND 40.05 ND 39.54 2003:Q1 ND 40.30 ND 39.76 2003:Q2 ND 40.37 ND 39.97 2003:Q3 ND 40.60 ND 40.19 2003:Q4 ND 40.76 ND 40.41 2004:Q1 ND 40.97 ND 40.65 2004:Q2 ND 41.18 ND 40.89 2004:Q3 ND 41.34 ND 41.14 2004:Q4 ND 41.48 ND 41.38 Middle-left panel Okun's Law Percent   Actual Forecast Simulation 2000:Q1 4.02 ND 4.1 2000:Q2 4.00 ND 3.9 2000:Q3 4.06 ND",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}