{
    "relation": [
        [
            "Field",
            "Ferullo Field",
            "Walsh Field",
            "Lexington HS",
            "Playstead",
            "East Boston",
            "Huskins",
            "Totals"
        ],
        [
            "AB",
            "766",
            "765",
            "782",
            "716",
            "505",
            "570",
            "4104"
        ],
        [
            "R",
            "155",
            "109",
            "117",
            "109",
            "71",
            "77",
            "638"
        ],
        [
            "H",
            "238",
            "204",
            "208",
            "185",
            "130",
            "117",
            "1082"
        ],
        [
            "2B",
            "30",
            "34",
            "35",
            "28",
            "10",
            "15",
            "152"
        ],
        [
            "3B",
            "5",
            "4",
            "1",
            "1",
            "3",
            "2",
            "16"
        ],
        [
            "HR",
            "7",
            "1",
            "2",
            "9",
            "1",
            "4",
            "24"
        ],
        [
            "RBI",
            "135",
            "86",
            "98",
            "97",
            "59",
            "67",
            "542"
        ],
        [
            "BB",
            "82",
            "53",
            "90",
            "69",
            "56",
            "66",
            "416"
        ],
        [
            "SO",
            "123",
            "117",
            "132",
            "120",
            "84",
            "88",
            "664"
        ],
        [
            "OBP",
            ".386",
            ".326",
            ".354",
            ".341",
            ".348",
            ".294",
            ".343"
        ],
        [
            "SLG",
            ".390",
            ".325",
            ".321",
            ".338",
            ".295",
            ".260",
            ".326"
        ],
        [
            "AVG",
            ".311",
            ".267",
            ".266",
            ".258",
            ".257",
            ".205",
            ".264"
        ],
        [
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            ""
        ],
        [
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            ""
        ],
        [
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            ""
        ],
        [
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            ""
        ],
        [
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            ""
        ]
    ],
    "pageTitle": "Andre Chiefs: 2008-2009 Archive",
    "title": "",
    "url": "http://www.eteamz.com/andrechiefs/news/index.cfm?cat=369950",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 125,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989891.18/warc/CC-MAIN-20150728002309-00328-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 434920047,
    "recordOffset": 434772892,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{76810=Chiefs Notebook…..In other games played as part of the Jerie DeAngelis Day, the Lexington Blue Sox shut out the Mooney Dental Tanners 4-0 and the Medford Americans rallied back to tie up the Testa Corp. Bombers 6-6…..Ellis recorded fourteen ground ball outs with Koslowski finishing the day with a like number of putouts at first base....... It was Ellis' 20th appearance in a Chiefs uniform….The Chiefs start the 2009 season with two all-stars from last season on the disabled list. Catcher Matt Lawlor of UMass Lowell is out indefinitely with a herniated disc in his back and third basemen Mike Andre, who underwent arthroscopic knee surgery on May 5 following his spring season with Merrimack College, is week to week….Veteran outfielder Brian Macrina is expected to make a return after nearly two years on the DL later this week.....Former San Diego Padre and Chiefs staff ace Keith Forbes is expected to see some mound time in the next ten days…..Justin Crisafulli’s RBI in the third inning was the 362nd of his illustrious Chiefs career…. Hal Landers is indeed the son of Chiefs legend Hank Landers who was a member of Chiefs championship teams in 1990, 1992, 1995 and 1997. Hank played in the Milwaukee Brewers fram system and is among the leaders in all Chiefs career batting categories including fourth in home runs with 40. Hal had a great year for 30-12 Wheaton College hitting a lofty .340 with two homers and 37 RBI's. He also stole 17 bases.....The Chiefs return to ICL action on Thursday when they host the Mooney Dental Tanners of Woburn at Tufts University's Huskins Field at 6:00 PM..., 97245=(Special to www.andrechiefs.com) August 18, 2008 Wakefield, MA- Right up until the moment Nate Leva's screaming line drive was snagged by Lexington shortstop Anthony Santos to end their semi-final series against the powerful and veteran laden Blue Sox late Sunday afternoon, they just would not quit., 131243=The Chiefs, now 13-7-5, head to Trum Field in Somerville on Tuesday night for a 6:15 PM date with the first place Cassell Club. Lefty David Garcia is expected to draw the starting assignment for the Chiefs., 125940=The win, the Chiefs fourth in a row and seventh in their last eight games, raised their season record to 14-7-5 with just six games remaining in the regular season. The first of those games will be played on Friday when they host the Medford Americans at Tufts University in a 6:00 PM start., 120642=The Chiefs are back in action on Sunday at 8:00 PM when they travel to Pine Banks in Melrose to meet the Gately A's before returning to Tufts for a rematch with the Americans on Monday at 6:00 PM., 90334=So the 2008 \"season of thunderstorms\" went into the books for the Chiefs late Sunday afternoon in Wakefield, thanks to a heavy dose of veterans like Cooke, Graham, McElroy and Hughes, but not before the Chiefs put up one more good fight., 536491=The Chiefs return to action on Sunday night at Ferullo Field in Woburn at 8:00 PM. Ace Keith Forbes is expected to draw the starting assignment., 598224=Dylan Ellis will get the start when the Chiefs travel to Playstaed Park to take on the Medford Americans on Friday at 6:00 PM. On Sunday the Chiefs travel to Ferullo Field in Woburn in an 8:00 PM start. Ace right-hander Keith Forbes will get the starting nod in that one., 96137=They fought through injuries and matched the ICL's best, pitch for pitch and hit for hit, as the young club matured with each passing day. In fact, the Chiefs went 11-2-1 over their last fourteen regular season games and finally clinched a playoff spot on August 9th. To go along with the six hard fought ties, the team was involved in ten one run games and five two run games. Those numbers mean that 21 of their 37 games were decided by two runs or less, including six last inning wins. 'These kids don't know how to quit\" said Chiefs veteran manager Chuck Andre, following another come from behind win in late July., 424081=The Chiefs are off on Wednesday and will host the Cassell Club in a battle of 3-1 teams on Thursday at Tufts University at 6:00 PM. Southpaw Dylan Ellis  (Gloucester, MA/Merrimack College), who took a no decision in the Chiefs 4-3 win over the Americans last Friday, is expected to draw the starting assignment., 173368=Lexington, MA- Damage to the field in Lexington has caused the postponement of tonight's (Tuesday) Chiefs at Blue Sox game that was scheduled for 8:00 PM. The Town of Lexington held their annual Fourth of July carnival and fireworks display over the holiday weekend, and despite the best efforts of the Lexington Recreation Department and Blue Sox management, the field will not be ready for tonight's game. It has been re-scheduled for Tuesday, August 5., 613603=The former San Diego Padres righty showed signs of brillance last season, his first back after two shoulder surgeries. Forbes was dominant while going 3-1 and posting an ERA of 1.75 despite some nagging shoulder issues. He threw the first Chiefs no hitter since 1995 when former Red Sox hurler Mike Carista accomplished the feat. Forbes was overpowereing in his no-no in Wakefield on June 13. He nearly duplicated that effort two weeks later when he took another no hitter into the last inning and settled for a one hit win over the Americans. Most impressive was Forbes 79 strikeouts in just 44 innings, a strikeout to innings pitched ratio not seen in the ICL in over a decade., 85328=Lexington, MA- The Chiefs will open their 2009 ICL season on Saturday, May 30 against the Wakefield Merchants at Lexington High School as part of the Eleventh Annual Jerie DeAngelis Memorial Day of Baseball., 154170=Bishop (1-0) picked up the first win of his three year ICL career while Foundas chalked up his fifth save of the season. The Chiefs are off on Thursday and travel to Lexington on Friday night to face the 10-1-2 Blue Sox at 8:00 PM., 53283=And Morse fondly remembers the summer of 1978, when the “Comeback Kids” went to the state semi-finals. He said the team that was always behind but somehow always won is one of his favorite memories. “I gave up 12 runs in the first inning,” Morse said of that championship game. “My favorite memory is of giving up a 300-foot home run and him laughing his rear end off in the dug out.”, 90055=\"This these guys remind me of the 1989 team \" said Andre, when approached after the game. If his assessment is correct, that will mean very good news for Chiefs fans. The 1989 team he was speaking of, qualified for the ICL playoffs on the final day of the regular season but was quickly dispatched by the veteran filled Augustine A's. That same group of players went on to dominate the ICL for the next ten seasons, winning four championships, six pennants, and playing over .750 baseball, which included two record setting eighteen game unbeaten streaks., 85084=The Chiefs-Merchants game is scheduled at 6:00 PM and will be part of three game slate that is planned. The Lexington Blue Sox will host the Woburn Tanners at 1:00 PM with Testa Corp. Bombers and Medford Americans scheduled at 3:30 PM., 256365=The Chiefs could not take advantage of their outstanding bullpen work and managed only three singles from Brendan Pyburn, Phil Costello (RBI) and Koslowski (RBI). The Chiefs will attempt to get their offense back on track on Monday evening at 6:00 PM when they host the Medford Americans at Tufts University at 6:00 PM., 92622=Veteran ace and former pro Keith Forbes anchored a solid pitching staff that will only improve next season with the expected return of a few arms that were with the club in 2006 and 2007. Two of those additions are expected to be righty's Danny Lozeau of Bryant and Mike DiCato of UMass-Amherst. Lefty Jeff DeCarlo of Michigan and Jared Freni of UMass could also be on the horizon. Lozeau, DiCato, DeCarlo and Freni all saw action with the young Chiefs in 2006 or 2007., 147881=The Chiefs infield was flawless as SS Brendan Pyburn (3 putouts, 5 assists), 2B Mike Barbati (2 putouts, 6 assists), 3B Mike Andre (5 assists) and 1B Paul Koslowski (15 putouts) backed Ellis' 81 pitch, complete game effort. The Chiefs infield quartet also turned two double plays. Ellis was the first Chiefs pitcher to throw a complete game without recording a strikeout since Ari Koufos turned the trick in a route going win over the Melrose Rams in 1992., 74755=Sat, 30 May, 6:00PM, at Lexington HS Andre Chiefs 5, Wakefield Merchants 1, 621629=2008, 90850=But without question, the single biggest reason for the 2008 turnaround was the re-emergence of veteran slugger Justin Crisafulli. The Chiefs captain re-established himself as an ICL force following two subpar season's by Crisafulli standards. The former Cleveland Indian hit a whopping .402 with three homers and 22 RBI's. He finished second in the ICL batting race and led the ICL in hits with 37. He ceratinly has to be considered as a serious candidate for the 2008 ICL MVP award., 174012=The Chiefs resume play on Sunday at 5:30 PM when they meet the Wakefield Merchants at Walsh Field at 5:30 PM. On Tuesday the Chiefs travel to Lexington to meet the Blue Sox at 8:00 PM., 116902=The Chiefs and Americans change venues and are right back at it tonight (Tuesday) when they square off in a 6:00 PM start at Playstead Park., 52098=With several thousand dollars in hand, John Veneziano said the league decided to put the money towards purchasing new lights for Gillis Park. After a few inquiries with Patriot Bank in Lexington, the $6,000 collected was used as a down payment toward a low-interest loan for the lights. John Veneziano said after the lights were installed in 2005, a small plaque was to go in at the park in his father’s honor. But the league had another idea., 605186=Pre-Season Ends with 3-1 Loss to Americans Medford, MA- The 2008 pre-season came to a conclusion on Monday evening when the Medford Americans dealt the Chiefs a 3-1 loss at Playstead Park. Lefty Connor Bishop (Arlington, MA/Bridgewater St.) started for the Chiefs and worked a credible four innings, allowing just one run on four hits. He gave way to right-hander Jose Pimental (Bani, DR/San Diego) who surrendered two runs on three hits in two innings, including a mamouth solo home run off the bat of Americans rookie Ben Waltrip (Medford, MA/Medford) in the sixth. The Chiefs only run of the night came on a sixth inning sacrifice fly from Andrew Hanson (Cumberland, ME/Princeton). Zack Bunzell (Medford, MA/American International) picked up the pre-season pitching win for Medford. Southpaw Matt Boleski worked a 1-2-3 seventh inning for the Chiefs., 612904=As a professional, Forbes climbed up the ladder in the Padres organization, eventually setting a record for the most minor league apperances in season with 74 in 2000. Forbes recorded almost a strikeout an inning, 209 in 214 innings, in his four year stint with the Padres., 179728=The Bombers and Chiefs will meet again on Monday at 6:00 PM at Tufts University. , 615610=Medford, MA- Pre-season began for the Chiefs on Sunday when the Chiefs hooked up with the Medford Americans at Playstead Park. From an original field of 77 hopefuls, 40 players are still in the running for one of the 26 final roster spots. Below is a tenative schedule of the Chiefs pre-season and non league contests leading up to the Intercity League opener on Tuesday, May 27. The final three games of the pre-season, a doubleheader against Lunenberg and a single game against the Americans, will be uniformed non league games., 370504=Lefty Dylan Ellis will draw the starting assignment tonight when the Chiefs, now 4-1, host the 4-0 Lexington Blue Sox at Tufts University at 6:00 PM., 176497=It does not get any easier for the Chiefs tonight (Tuesday) when the first place Cassell Club (11-1-1) pay a visit to Tufts University at 6:00 PM. The two teams battled to a 0-0 tie last Thursday night. Southpaw Dylan Ellis (Gloucester, MA/Merrimack) is the expected starter for the Chiefs., 608908=The Chiefs will conclude the non-league portion of the schedule on Monday when they travel to Playstead Park to take on the Americans at 5:30 PM. The Chiefs Intercity League opener is on Tuesday when they will send righthander Keith Forbes (Newton, MA/San Diego Padres) to the mound against Woburn at Tufts University at 6:00 PM. Forbes was 3-1 last season for the Chiefs with a league leading 79 strikeouts in 44 innings. Forbes signed with the Sussex of the Cam-Am League following the 2007 season where he made two starts for the New Jersey based club., 205550=Lowell, MA- Matt Cooney, who caught for the Chiefs last season, has been re-assigned by the Boston Red Sox to the Lowell Spinners of the Single A short season New York-Penn League. The Spinners open their 2008 season against the Tri-Valley Cats at LeLacheur Stadium tonight at 7:05 PM. Cooney hit .313 for the Chiefs in 2007, starting the first 13 games of the season before signing with the Red Sox in late June. He finished the 2007 campaign with the Greenville Drive where he also opened this season. The Arlington, MA native graduated from Eastern Connecticut State in the spring of 2007., 85715=2009, 52803=On May 29, Morse will emcee the North Medford Little League’s Legends of the League gala, a night to honor the people who have dedicated their time and effort to the league. Veneziano will be the organization’s first honoree at what the league hopes will be an annual event., 185700=The Blue Sox went ahead 1-0 in the first and threatened for much more. Holy Cross leadoff man Jack Laurendeau got things going with a single to right and Curley followed with a perfectly placed bunt single in front of the plate. Dan Graham then hit a deep fly to center on which Laurendeau tagged and went to third. With Boston College's cleanup man Jared McGuire at the plate, a pitch got by catcher Matt Lawlor allowing Laurendeau to score. Pimentel then walked both McGuire and Anthony Santos to reload the bases. The Chiefs averted further trouble when Ben Hewett bounced into a Brenden Shepard unassisted to Koslowski doubleplay. The Chiefs tried to knot things up in the home half of the first but came up empty. Pyburn led off with a single to right and Nate Leva sacrificed him to second. Hewett bore down and got Andrew Hanson looking at strike three and Crisafulli to bounce to third on a nice effort by Curley who ranged behind the bag to make the play. The Sox went up two zip in the second inning. Pimentel got Dan Haugh swinging but John Lerner and Coscia hit back to back singles before Laurendeau K'd for the second out. Curley then doubled just inside the right field line scoring Lerner and putting runners on second and third. Graham was intentionally walked and Pimentel got McGuire to fly to Phil Costello in right to end the inning. The Chiefs went down quietly in the both the second and third innings and Pimentel settled  down nicely to retire the sides in order in the Lexington third and fourth. The Chiefs tried to make some noise in the fourth when Crisafulli led off and reached on an infield single.  Kolowski then lofted a long fly ball that was tracked down by Graham on the warning track in right. Shepard then hit a pea right at Lerner at second base and when Andre followed with a long single to left center the Chiefs had two runners aboard. Hewett again got tough when he had to and got Lawlor to groundout to shortstop to end the inning. Pimentel got the Lexington side in order in the fifth and the Chiefs returned the favor by going 1-2-3 in the bottom of the inning. The Blue Sox threatened to blow it open in the top of the sixth when Jett Nolet walked and went to second on a wild pitch. Pimentel got Ben Hewett to fly out and the Chiefs chose to intentionally walk the right handed hitting Haugh to put runners on first and second. Koslowski came on to face lefties Lerner and Coscia and got a pop up and a nice play on a grounder to Shepard to keep it a 2-0 game. A Crisafulli single was all the Chiefs could muster in the sixth and Koslowski kept the Sox off the board in the top of the seventh. In the bottom of the inning, Hewett got Andre for the first out when he flew to center. Lawlor then singled and Nicky Dunn ran for him. Pinch hitter Matt Anderson made things interesting when he lined a single to right to put runners on the corners with one out. Pyburn followed with a RBI grounder to Nolet at first scoring Dunn and moving Mike Barbati, who had run for Anderson to second. That's where the Chiefs rally ended as Hewett struck out Doug Heald swinging to end the game. Pimentel worked 5.1 innings and allowed two earned runs on five hits while striking out seven and issuing four base on balls. Koslowski went 1.2 innings and gave up two hits anfd struck out a batter. The Chiefs begin an important home and home series with the Testa Corp. Bombers at East Boston Stadium on Sunday at 5:30 PM before both teams travel back to Tufts for a rematch on Monday evening at 6:00 PM., 171511=Wakefield, MA- In a season that has seen an unusual number of games ending in a tie, the Chiefs managed to turn the trick for the fifth time in just eighteen games, playing the Wakefield Merchants to a 4-4 standoff at Walsh Field on Sunday. The most ties the Chiefs have ever had in a season was back in 1990 when they finished with an overall record of 28-17-6 and won the ICL championship with a grueling playoff run., 187616=The defending champions Lexington Blue Sox visit Tufts University tonight (Thursday) at 6:00 PM. Righty Jose Pimentel (2-0), who pitched in the Padres organization last season, will get the start for the Chiefs. Click for Updated Chiefs Statistics  , 103623=(From www.intercityleaguebaseball.com)  Lexington, MA- Blue Sox righty Marc Hewett and Chiefs southpaw Dylan Ellis hooked up in a classic pitchers duel on Saturday afternoon with Lexington scratching out a run with two away in the bottom of the ninth inning to come away with a 2-1 win. With the extra inning victory, the Blue Sox take a 1-0 lead in the best of three semi-finals series. The Chiefs and Blue Sox traded first inning runs. Matt Lawlor gave the Chiefs a 1-0 lead in the top of the first with a sacrifice fly. The Blue Sox answered and tied the game in the bottom of the inning on a Danny Hughes RBI fielders choice. It stayed that way until the bottom of the ninth. Hughes led off and drew a full count walk. With Matt Gedman at the plate, Hughes advanced to second on a passed ball. Gedman then hit a hard shot labled for right field but Chiefs first baseman Paul Koslowski made a nice diving stop and just beat Gedman to the bag with Hughes going to third. Ellis then got pinch hitter Eric Poling to bounce back to him for the second out of the inning. Jack Laurendeau followed and won it for the Blue Sox when he hit a sharp grounder down the first base line. Koslowski was able make the diving stop, but the speedy Laurendeau beat his throw to first that allowed Hughes to score the winning run. Hewett of Rollins Collge, allowed just five hits and struck out seven while raising his overall 2008 record to 9-1. Ellis, from Merrimack College, allowed six hits and struck out four. He was tagged his first loss of the season in eight decisions., 93717=Another great storyline would be the tale of centerfielder Andrew Hanson. The Princeton graduate just completed law school and found time between Chiefs games to study for the bar exam which he took in July. He ended his first ICL year hitting .293., 172829=The Chiefs return to action on Wednesday at 7:30 PM when they travel to Trum Field in Somerville to take on the first place Cassell Club., 89133=Here's a look back at the selections from 2006-2008. MVP Award 2008 Josh Klimkiewicz-Cassell Club 2007 Dan Graham-Blue Sox & Josh Klimkiewicz Cassell Club (co-MVP) 2006 Zack Golden-Cassell Club Outstanding Hitter 2008 Josh Klimkiewicz-Cassell Club 2007 Josh Klimkiewicz-Cassell Club 2006 Zack Golden-Cassell Club Outstanding Pitcher 2008 Marc Hewett-Blue Sox 2007 Bryan Lambert-Cassell Club 2006 Bill Cooke-Blue Sox Rookie of the Year 2008 Ben Hewett-Blue Sox 2007 Bob McCarthy-Cassell Club 2006 Mike Andre-Chiefs Rookie Pitcher of the Year 2008 Marc Hewett-Blue Sox 2007 Connor O'Sullivan-Pierce-Gately A's 2006 Jeff Keefe-Americans Manager of the Year 2007 Rick DeAngelis-Blue Sox 2006 Bob Nasson-Cassell Club Playoff MVP 2008 Bill Cooke-Blue Sox 2007 Mike Kotarski-Blue Sox 2006 Tim Dempsey-Cassell Club Sportsmanship Award 2008 Orazio Azzarello-Americans 2007 Luke Begley-Reds 2006 Steve Coffey-Merchants, 52483=John Veneziano, another former Chiefs player, who played in the league as a kid and later coached, said the idea for the event came after his father’s death in 2003 when the family requested donations be made to the league in lieu of flowers. John remains the Chiefs number one financial supporter through his ERA Andrew Realty in Medford Square., 621188=Medford, MA (April 24) The Chiefs have announced that former Princeton University star and ex minor leaguer Andrew Hanson of Cumberland, Maine, has joined the Chiefs for the upcoming season. The OF-1B finished his record breaking career at Princeton University in 2001.  He helped lead the Tigers to four consecutive Gehrig Division Championships, two Ivy League Championships and NCAA Division 1 tournament appearances in 2000 and 2001.    Hanson, who hits left-handed, earned All-Ivy league honors for four consecutive years. By the time he graduated he re-wrote the Princeton record book which has a rich history of over 100 years of baseball. Andrew ranked 4th in most games played in a career (161), 1st in games played in a season (48), 4th in career at bats (570), 3rd in at bats in a season (186), 12th in runs scored in a season (35),  5th in career hits (184), 5th in career runs scored(111), 3rd in hits in a season (63),  1st in hits in a game (6), 10th in career doubles (31), 8th in doubles in a season (12), 5th in career homeruns, 6th in homeruns in a season (8), 5th in career extra base hits (56), 7th in extra base hits in a season (20), 1st in extra base hits in a game (5), 1st in total bases in a season (118), 1st in total bases in a game (16), 9th in career slugging percentage (.498), 5th in career RBIs (118), 3rd in RBI in a season (47), 1st in RBI in a game (7), 1st in career put-outs (811), 1st and 2nd in most put-outs in a season (376, 369), 2nd in put-outs in a game (19) and 1st in put-outs in a 7 inning game (17). , 258850=Medford, MA- Former Arlington High School and Suffield Academy standout Joe Martini will make the first start of his Intercity League career on Thursday evening when the Chiefs host the Wakefield Merchants at Tufts University at 6:00 PM., 87470=The Intercity has announced their Awards for the 2008 Season. The top vote getters in each category are shown. MVP 1-Josh Klimkiewicz-Cassell Club 2-Anthony Del Prete-Testa Corp. Bombers 3-Justin Crisafulli-Andre Chiefs 4-Ben Hewett-Lexington Blue Sox 5-Marc Hewett-Lexington Blue Sox OUTSTANDING HITTER 1-Josh Klimkiewicz-Cassell Club 2-Justin Crisafulli-Andre Chiefs 3-Pete John-Testa Corp. Bombers 4-Ben Hewett-Lexington Blue Sox 5-Josh Mackey-Cassell Club OUTSTANDING PITCHER 1-Marc Hewett-Lexington Blue Sox 2-Anthony Del Prete-Testa Corp. Bombers 3-Keith Forbes-Andre Chiefs 4-Nick Conway-Gately A's ROOKIE OF THE YEAR 1-Ben Hewett-Lexington Blue Sox 2-Josh Mackey-Cassell Club 3-Jeff Wojnar-Gately A's 4-Matt Lawlor-Andre Chiefs 5-Bryan Watkins-Mooney Dental Tanners ROOKIE PITCHER OF THE YEAR 1-Marc Hewett-Lexington Blue Sox 2-James Ramsey-Wakefield Merchants 3-Ryan McNiff-Medford Americans PLAYOFF MVP 1-Bill Cooke-Lexington Blue Sox 2-Marc Hewett-Lexington Blue Sox 3-Anthony Santos-Lexington Blue Sox 4-Mike Parissi-Cassell Club 5-Bob McCarthy-Cassell Club SPORTSMANSHIP AWARD 1-Orazio Azzarello-Medford Americans 2-Justin Crisafulli-Andre Chiefs 3-Keegan DeNapoli-Mooney Dental Tanners 4-Steve Langone-Wakefield Merchants 5-Anthony Del Prete-Testa Corp. 6-Brendan Smith-Gately A's 7-Joe Chiodo-Watertown Reds, 96782=Such was the saga of the 2008 Chiefs as the upstart club emptied the tank each night from late May to mid August. It will be remembered as the year the franchise regained some ICL prominence after two seasons of being a virtual expansion team and sporting the only two sub .500 records in team history. The team rediscovered its winning ways and battled into the ICL playoffs for the 44th time in 46 seasons. The Chiefs completed the regular ICL season with a 17-8-6 record to go along with a 3-1 non-league mark, and pretty much had a battle on thier hands every night, win, lose or tie., 195502=Monday's scheduled game against the Medford Americans was postponed due to heavy rain showers. The Chiefs and Americans will try again on Tuesday at Tufts at 6:00 PM. On Wednesday the Chiefs host the Cassell Club and on Thursday the defending champion Lexington Blue Sox pay a visit to Tufts. , 94858=Second baseman Brendan Pyburn, an ICL rookie, and shortstop Leva are both just 20. Third baseman Mike Andre, who is one of the Chiefs veterans in his third ICL campaign and was Rookie of the Year in 2006, is 21. Converted infiielder Mike Barbati, who rode the pine during the first half of the season until breaking into the lineup and can play any position, is just 19.  Outfielders Phil Costello and Matt Boleski are also just 21 years old. You can then add star lefty Dylan Ellis, who was sensational all year at age 20, and rookie reserves Alex Fisher and Nicky Leva, who are just 18 to the list. Closer Chris Foundas and relievers Joe Martini and Jose Pimental are also all just 21., 611286=Greenville, South Carolina- Catcher Matt Cooney, who caught for the Chiefs last season and signed with the Boston Red Sox in early July, collected his first hit of the 2008 season drilling a double for the Single A Greenville Drive in a recent game against the Columbus Catfish. The former Eastern Connecticut State star hit .313 for the Chiefs last summer before signing with the Sox. In 2007, Cooney appeared in 24 games for the Red Sox in both Fort Myers and Greenville., 137005=The ICL will continue to work to have all regular season games completed by Friday, August 8. The best three out five semi-final round of the playoffs are scheduled to begin on Sunday, August 10., 82937=Lozeau will return to the Chiefs staff this summer. He pitched for the club in 2007 before spending last summer in the NECBL., 315117=The Chiefs send big southpaw David Garcia of the Dominican Republic to the hill on Tuesday night in search of his first ICL win when they host the Mooney Dental Tanners of Woburn in a 6:00 PM start at Tufts University., 84834=The Chiefs home opener is on Thursday, June 4th when they take on Woburn at Tufts University in a 6:00 PM start., 612596=At the conclusion of the 2007 Chiefs season Forbes, now 31, signed another professional contract making two starts for Sussex Skyhawks of the Can-Am League. , 98504=Cooke, went to 4-0 overall in 2008 with the complete game victory. Forbes, worked 5.1 innings and allowed seven hits, struck out six, walked six and hit a batter., 618666=A former Princeton captain, he was the recipient of the prestigious Kafer Trophy. He was drafted sixth overall by the Evansville Otters of the Frontier League. In the spring of 2003, Andrew was signed by San Angelo Colts of the Central league and later traded to the Sioux Falls Canaries of the Northern League in 2004.  As a professional, Andrew played in 137 games, batted .248 with 77 runs scored, 46 RBI, 23 doubles, 5 triples and 4 homeruns., 92101=Injuries played a key part in the 2008 season. ICL all-star outfielder Brian Macrina was lost for the year in early May with nagging leg injuries. His status for 2009 is still uncertain. Franklin Pierce star Matt Anderson was able to play in only 14 games and his season ended in mid July when a knee injury put him on the shelf. He is expected to be healthy and bring a big bat to the 2009 lineup. Koslowski and Andre battled leg injuries during the season with both of them playing through it as best as possible. In fact, Andre started all 37 games for the Chiefs before finally being forced out of the lineup in the fourth inning of Sunday's game. Koslowski did his best Kurt Gibson impression on August 5 when he hobbled around the bases after hitting a huge pinch hit home run that broke a 4-4 tie and propelled the Chiefs to an important win over the Americans., 176175=Following Tuesday's game, the Chiefs will enjoy the traditional ICL Fourth of July mid season break. They will return to action next Sunday (July 6) when they travel to Walsh Field in Wakefield to meet the Merchants at 5:30 PM., 146314=With the win the Chiefs improve to 10-6-5 heading into a date with the Testa Corp. Bombers at East Boston Stadium on Tuesday night at 8:00 PM., 617574=Medford, MA (April 29) The Chiefs continued the upgrade of their 2008 pitching staff with the recent addition of pro journeyman lefthander David Garcia. Garcia was originally a product of Colorado Rockies system in the late 1990's. Following a stint in the Netherlands, where he pitched a couple of seasons in the Dutch Major League, Garcia returned to his native Domincan Republic where he continued his professional career in Dominican Winter League. In 2003 his career took him north of the border where he pitched for Saskatoon of the Canadian League before returning to the Domincan League for the last few seasons. Despite his long pro resume, the imposing 6' 5 southpaw is just 27 years old., 488159=Woburn, MA- Right-handed ace Keith Forbes picked up where he left off last season with six innings of dominating pitching,  propelling the Chiefs to their third straight win, 8-1 over the Mooney Dental Tanners on Sunday night at Ferullo Field.  Forbes, who was making his first start of the young season, led the ICL in 2007 with 79 K’s. The former San Diego Padre allowed just three hits in an 87 pitch effort, while striking out seven. The only run he surrendered was of the unearned variety in the sixth inning.   The Tanners Joe Curran (Arlington, MA/Southern Maine) matched blanks with Forbes for two innings before the Chiefs broke through with four \"twilight aided\" runs in the top of the third. With one out, Angel Valdez reached on an infield error. Andrew Hanson remained red hot with his second single of the night to right. Cleanup man Justin Crisafulli then popped out for the inning’s second out. Mike Andre then came to the plate and delivered a RBI single to center scoring Valdez and giving the Chiefs a 1-0 lead. The twilight sky then came into play as Matt Anderson lofted what seemed to be an inning ending fly ball to short right field. The ball was lost in the dusk and fell for a two RBI double, allowing both Hanson and Andre to score making it 3-0. Déja vu when the next batter up Phil Costello hit a fly ball to center that was also lost in the tough sky, dropping for a RBI single and a 4-0 Chiefs lead. The Chiefs added two more runs in the fifth to take a 6-0 lead. Nate Leva beat out a perfect bunt to get things going and Brendan Pyburn singled to left center putting runners on the corners with nobody out. Valdez lofted a sacrifice fly to center easily scoring Leva with the Chiefs fifth run. Hanson, who is hitting a league leading .727 (8-11), rapped his third consecutive single moving Pyburn to third. Crisafulli plated Pyburn with a RBI infield grounder. Forbes meanwhile went sailing through the first four innings before tiring a bit in the fifth and sixth. He pitched out of a bases loaded jam in the fifth, when runners reached on an error by first baseman Paul Koslowski, a single and a walk, by getting Bentley College star Kevin Vona to ground out. He allowed a run in the sixth when Ryan Doyle reached on an error at shortstop by Brenden Shepard and scored on a RBI double off the bat of Andrew Worden.   The Chiefs made it an 8-1 game with two runs in the seventh on singles from Anderson, Koslowski and Leva.  Joe Martini came on to pitch a scoreless seventh inning in his Chiefs debut, allowing one hit and striking out a batter., 141035=The Chiefs, now 10-7-5, return to action on Thursday when they host the Watertown Reds at Tufts University starting at 6:00 PM. Righthanded ace Keith Forbes is expeceted to draw the starting pitching assignment., 609597=Medford, MA- The Lunenberg Phillies of the Central Massachusetts League will travel to Medford on Sunday afternoon for a non-league doubleheader against the Chiefs. The first game at Huskins Field on the campus of Tufts University will get underway at 2:00 PM. First year Southpaw David Garcia (Santo Domingo, Dominican Republic/ Colorado Rockies) will get the start in game one. Another lefty, Dylan Ellis (Gloucester, MA/ Merrimack College) will get the nod in the nightcap. Ellis was 2-3 for the Chiefs in 2007 with an ERA of 3.02 in nine starts., 260039=The Chiefs are back in action on Thursday night at 6:00 PM when they host the Wakefield Merchants at Tufts University. Arlington native Joe Martini (0-0) is expected to make his first start of the season., 111156=After 43 straight seasons of qualifying for the playoffs, the Chiefs took a two year break from play in 2004 & 2005 before returning to the ICL at the start of the 2006 season. As a virtual expansion team, with only veterans Justin Crisafulli and Dave Marsters left from the glory days of the 1990's and early 2000's, the Chiefs fielded their youngest team ever. They struggled mightily in 2006, posting a franshise worst 7-20-1 record and missing the ICL playoffs for the first time since 1958. Although the club showed marked improvement last season, a late season tailspin knocked them out of contention in late July and they finished with a less than stellar 9-18-5 mark., 605925=Lunenberg hurlers limited the Chiefs to just four hits in the first game, singles from Andre, Valdez, Leva and Matt Boleski. The Chiefs conclude their pre-season with a non league contest against the Medford Americans on Memorial Day (Monday) at Playstead Park begining at 5:30 PM. Lefty Connor Bishop is expected to draw the starting assignment., 202157=The Chiefs finish off the week by hosting the Gately A's at Tufts on Thursday and the Mooney Dental Tanners on Friday with both games starting at 6:00 PM., 82775=Antother Chiefs righty, Chris Foundas, also wrapped up his Bryant career this week. Foundas, who has served as the Chiefs closer over the last two years making 26 appearances, was 3-3 in his final year at Bryant while moving into the Bulldogs starting rotation. Foundas started eight games for Bryant and threw 41.0 innings. He was named to the ICL all-star team in 2008., 116363=Medford, MA- Ailing veteran Paul Koslowski drilled a pinch hit solo home run leading off the sixth inning, breaking a 4-4 tie, and propelling the Chiefs to a darkness shortened 6-4 win over the Medford Americans at Playstead Park on Tuesday evening. Lefty Dylan Ellis survived a rocky four run third inning to stay unbeaten in seven 2008 decisions., 93431=Others like Connor Bishop and Nicky Dunn were very valuable assets to the 2008 team. Bishop, in his third season is also 20 years old. The Arlington lefty saw only limited action on the mound, but came up huge in a winning relief effort against Cassell in July. Dunn, another rookie from Salem State, is a gifted athlete and did anything needed to help the team, from pinch running, to catching, to playing second base, as well as all three outfield spots., 602937=Note: Tuesday Night's Scheduled Opener was Postponed -Rain Medford, MA- The Chiefs will send ace right-hander Keith Forbes to the mound on Tuesday evening when they open their 2008 Intercity League campaign against the Mooney Dental Tanners of Woburn. Game time is set for 6:00 PM at Huskins Field on the campus of Tufts University. Forbes was 3-1 for the Chiefs last season, registering 79 strikeouts in just 44 innings. The former San Diego Padres 31 year old right-hander signed with Sussex of the professional Can-Am League following the ICL season where he made two starts for the Skyhawks., 137923=All five ICL games that were scheduled on Sunday were rained out due to the severe thundrestorms that crossed the area this afternoon. ICL ation will resume on Monday with the Gately A's and the Lexington Blue Sox hooking up in a doubleheader at Lexington starting at 6:45 PM and the Testa Corp. Bombers visiting Watertown at 8:00 PM., 258564=Martini attended the University of Redlands last spring but will transfer this fall to a New England college. He was 4-1 in 2007 for Suffield Academy with an ERA of 1.75. The lanky 6' 5 righthander was named all-western New England while at Suffield. He has made two appearances out of the bullpen so far during the 2008 season.}",
    "TableContextTimeStampAfterTable": "{292068=2009 Intercity League Batting by Field, 47825=Medford, MA- The Chiefs will now take on the two time Central New England Baseball Association Champion Westford Willows in a non-league contest on Sunday at 12:30 PM at O'Donnell Field on the Malden Catholic Campus in Malden, MA. The game was originally scheduled to be played at Playstaed Park.  With the forecast of overnight and early moring rain showers it was decided, with the help of Malden Catholic Head Coach Steve Freker, to move the game to the field turf of Malden Catholic late Saturday night., 308119=East Boston, MA- For the better part of this summer, Chiefs right-hander Chris Foundas has been searching for the form that made him the unanimous selection as the Intercity League all-star closer in 2008., 150775=Wakefield, MA- Horrendous defense, miserable early April like weather, and about as many fans as you could put in the backseat of a mid-size car., 266615=Chiefs Chatter......All ICL games were postponed on Friday. Saturday, the Americans are home at Playstead Park in a 1:00 PM affair with the Testa Corporation Bombers. The Chiefs entertain the Bombers on Sunday at 1:00 PM at Tufts.....There was a scary moment in the second inning when Chiefs catcher Bob McCarthy was struck on the side on the face with a pitch. McCarthy stayed in the game for another half inning before being replaced by rookie Kevin McKenzie (Arlington, MA/Wentworth). McKenzie threw out the first runner of his ICL career when he gunned out Jay Olsen in the fifth inning. McCarthy was reportedly okay after the game and his status is day to day....Hal Landers took over the Chiefs team lead in batting average. The rookie (Salem, NH/Wheaton) is currently hitting .352 while centerfielder Jeff Bercume is a point behind at .351. Both are in top five of the ICL....Mike DiCato is the Chiefs expected starter on Sunday while lefty Dylan Ellis will get the start on Monday vs. Lexington...., 393714=By Bruce Hack Intercity Baseball League Media Relations Director Lexington, MA – Lexington came out swinging and tied the finals at 1-1 with a 5-2 win over the Chiefs at Lexington High School Friday night. The teams move to Medford for Saturday and Sunday. Both games are scheduled for 1:30 p.m. starts at Tufts University’s Huskins Field., 398749=The Best of Five series continues on Sunday at Tufts when Game Four will be played at 1:30 PM. If the Chiefs force a Game Five, it will be played in Lexington on Monday night. , 48671=Managed by Brian Thompson, the Willows have won the CNEBA Championship the past two seasons. In both 2007 and 2008 they beat the Metrowest A's from Worcester to claim their league crown., 376162=Chiefs Chatter….Ryan McNeill will take the mound for the Chiefs against the Bombers Mike Hashem when the teams hook up in Game Four of the series on Tuesday night at East Boston Stadium at 8:00 PM…..The Chiefs were forced to go without Peter Copa who suffered a hamstring pull on Sunday….The Game Three win was the Chiefs first extra inning playoff win since 2002 when they beat the Wakefield Merchants 1-0 in nine innings at Tufts behind Paul Koslowski….Machado threw a one-hitter against Lexington in his last regular season start and combined with Monday's outing he has now allowed just three hits in his last 13.2 innings...   , 155360=Enter Chris Foundas. The ICL all-star closer in 2008 struck out Kevin Johnson swinging and got pinch hitter Sam Choate to ground out to Baillaegeon stranding Russo at third with the go ahead run., 323646=GAME TWO- Chiefs 5, Americans 1 There was more work to do for the Chiefs as they packed up their gear and headed across town to Playstead Park for a 4:00 PM date with the Americans., 260416=The Americans return to Huskins Field Thursday when the Chiefs will again host their cross-town rivals. Dave Martin, another former Tufts University Jumbo pitcher, will be on the mound for the Americans in the 6:00 pm start. The Chiefs are expected to counter with rookie right-hander Rob Machado (1-2) of UMass-Amherst., 169838=Boston, MA- The annual Boston Park League vs. Intercity League All Star game will be held at Lexington High School on Sunday, July 19 at 2:00 PM. For the last three years the game has been named in honor of umpire Joe Driscoll who passed away in 2007. Rick DeAngelis, manager of the 2008 champions Blue Sox, will pilot the ICL squad., 222161=The Chiefs will send Mike DiCato (3-1) to the hill on Tuesday night, weather permitting, when they host the Medford Americans at Tufts University at 6:00 PM.   , 255239=  Plenty of Merrimack Warriors Flavor! Current Chiefs Brian Macrina (Captain 1999), Jeff Bercume (Captain 2008-09), Mike Andre (Capatin 2009), Bob McCarthy (2009) and Brendan Pyburn (Captain-elect 2010) have combined for 850 hits in their D-2 Merrimack College careers. Macrina (1996-99) played for Barry Rosen while Bercume, Andre, McCarthy and Pyburn all played four years under current Warriors Head Coach Joe Sarno. Pyburn will return to Merrimack for his senior season in September., 187147=Chiefs Chatter….Former UMass star Mike DiCato will take the mound in search of his third win of the season when the Chiefs host the Wakefield Merchants at Tufts on Monday at 6:00 PM…The Chiefs got some bad news in the pitching department when it was learned that Assumption righty Joe Martini will be lost for the remainder of the season with a labrum injury….., 197854=The Chiefs travel to Playstead Park in Medford on Wednesday night when the take on the Medford Americans at 6:00 PM. Dan Lozeau (1-2) will get the start for the Chiefs while the Americans will counter with righthanded veteran Lee Jamison (2-2)., 316002=The Chiefs and Blue Sox meet again on Sunday at 12:45 PM at Tufts University. Following that game, the Chiefs will travel across town to Playstead Park at 4:00 PM for a make-up game with the Medford Americans. That game will go a long way in determining the final playoff seedings., 231975=The Chiefs will try and rebound on Thursday when they host the Mooney Dental Tanners at Tufts University at 6:00 PM. Dan Lozeau is expected to get the starting assignment for the Chiefs.   , 149095=The Chiefs begin a three game pre-Fourth of July stretch on Sunday at Walsh Field in Wakefield at 3:00 PM. Lefty Dylan Ellis (1-0) is expected to start for the Chiefs.       , 48394=O'Donnell Field is located at the rear of the Malden Catholic Campus at 99 Crystal Street, Malden, MA 02148., 391987=Game Two is scheduled for Lexington High School on Friday at 8:00 PM.  , 352915=Chiefs Chatter......The Chiefs out hit the Bombers 9-7 in Friday's game.…...The Medford Americans came from behind to beat the Wakefield Merchants 6-5 in eight innings to take the deciding game of their best of three series in walk-off fashion. Luke Begley scored the winning run on an infield error with the bases juiced. Brian Casey went the route to pick up his first playoff win. ……Congratulations go out to Americans veteran skipper Kevin Burgoyne who picked up the first playoff win of his ICL career on Tuesday night and then made his initial playoff series a winning one…...The Americans will open their semi-final series with the Lexington Blue Sox on Sunday night at 8:00 PM in Lexington….. Game Two of the Chiefs-Bombers series will be played at 4:00 PM on Sunday at East Boston Stadium. The game was originally scheduled to be played at noon but was changed to the later starting time…...The Chiefs will send left-hander Dylan Ellis to the mound while the Bombers are expected to counter with Eddie Donovan…..Chiefs Hall of Famers Dave Clvio and Hank Landers were in the crowd for Friday’s series opener at Huskins .......J.P. Pollard was nursing a severely bruised foot and is day to day…..Jeff Bercume swiped his 15th base of the year in 18 attempts in the first inning…....Bercume’s former college teammate at Merrimack, Steve Buitkus, made an outstanding catch of his deep line drive that ended the game….Bobby Giarrantani surrendered nine hits and did not strike out a batter in the win. The former Bishop Fenwick star plays his college ball at Denison College in Ohio…Several Chiefs continue their climb up the all-time career leaders list. Justin Crisafulli, who tops the charts in home runs (86) and RBI (379), has inched a little closer to Mike Langston as the all-time hit leader. Crisafulli, with his two hits in Game One, now has 486 and trails Langston (538) by 52. Crisafulli began his Chiefs career as a rookie in 1994 before signing with the Cleveland Indians……Veteran Brian Macrina passed Alex Masel last week and now stands in eighth position in career hits with 215. Macrina is currently ninth in career homers with nine and holds position twelve in RBI with 76….Mike Andre, who hit his first post-season home run on Friday, has moved into slot 16 in career RBI with 60 and recently eclipsed Steve Puleo sliding into 17th place in career hits with 104. The former ICL Rookie of the Year in 2006 and two-time ICL all-star continues to make progress from knee surgery in May and raised his overall 2009 average to .309 on Friday night…..In the pitching department, Chris Foundas moved into the sixth spot in career appearances when he took the mound for the 35th time on Friday….Mike DiCato moved into the top dozen in career strikeouts (62) going past Dave Piho of Berlin, PA….The Chiefs have lost the first game of a semi-final series eleven times in franchise history. On eight of those occasions they came back to win the series. In 1968, 1971, 1974, 1980, 1990 & 1993 they came back to win a semi-final series after losing the first two games……Manager Chuck Andre will be shooting for playoff win number 50 on Sunday. The veteran manager had amassed 438 overall wins heading into this year’s playoffs……Monday’s Game Three is still listed as TBA, but barring an unexpected scheduling change to a field with lights, the game is most likely to be played at Tufts University at 5:20 PM…. Bruce Tillman, 344575=Such was the story of the Chiefs in a hard to take 7-4 loss to the Testa Corp. Bombers in the opening game of their best of five series at Huskins Field on Friday evening. With the loss, the Chiefs find themselves in a one game to none hole, with Game Two at East Boston Stadium facing them on Sunday afternoon at 4:00 PM. , 156702=With the win the Chiefs go to 5-1-1 on the season. They host the Lexington Blue Sox at Tufts University on Monday at 6:00 PM. Right-hander Ryan McNeill will draw the starting assignment for the Chiefs. , 224955=On Wednesday, the Chiefs will travel to Wakefield to meet the Merchants at Walsh Field in a 6:00 PM start and the Bombers head to Lexington High School to meet the Blue Sox under the lights at 8:00 PM., 5746=The Chiefs are back in action on Thursday night at 6:00 PM at Tufts University when they host the Lexington Blue Sox. Lefty Dylan Ellis (1-0) is expected to get the starting nod. On Friday the Chiefs entertain the Testa Corp. Bombers with Mike DiCato (1-0) drawing the assignment. On Sunday the Chiefs hook up with The Westford Willows of the Central New England League in a non-league contest at Playstead Park at 11:00 AM., 110464=The Chiefs are right back in action on Friday at 6:00 PM when they host the Testa Corp. Bombers at Tufts University with Dan Lozeau drawing the starting nod. The Bombers got a complete game three hitter from Mike Hashem and defeated the Medford Americans 3-1 under the lights East Boston Stadium on Thursday night., 247672=Ryan McNeill will get the start when the Chiefs travel to East Boston Stadium on Tuesday at 8:00 PM to face the Bombers., 435849= 1045, 196966=Del Prete scattered three hits and struck out three while raising his season mark to 3-0 and lowering his ERA to 0.50. Del Prete has been beaten only once in fifteen decisions (11-1-3) since returning to the ICL in 2008 after a four year professional career. He spent one season in the Northeast League and three years pitching for Evansville of the Frontier League. Former Harvard star Josh Klimkiewicz's second inning single and Joe Papa's bases loaded walk in the fourth accounted for the two Bomber RBI's., 265308=Mike Kalpopoulos kept things going when he singled to right, sending DelPonte into scoring position at second. DiCato took over and the red hot K.C. McCarthy welcomed him with a liner down the left field line that kicked up chalk and drove in DelPonte with the go ahead and what proved to be winning run. The run batted in by McCarthy, who joined the team July 8, was his twelfth in nine games played., 220153=Foundas regained some of the form that made him the ICL’s all-star closer in 2008 when he retired the Sox side in order in the bottom of the fifth. , 275766=The Chiefs are right back at it on Monday when they host the first place Lexington Blue Sox at Tufts at 6:00 PM. Southpaw Dylan Ellis (3-0) will draw the starting pitching assignment.   , 334137=Bercume said he had been cautiously optimistic about being drafted in June, “but the reality is it’s an uphill battle and it’s incredibly competitive to get to the next level as a positional player from a D-2 school. Baseball is one of those games where you can go 5-for-8 or 0-for-8, but I never feel I’m overmatched. It’s all about confidence and how you carry yourself.’’, 194303=Chiefs Chatter….The Chiefs will send rookie right-hander Rob Machado to the mound to make his first ICL start when they travel to East Boston Stadium to meet the Bombers on Tuesday night at 8:00 PM. Machado worked three impressive innings in relief against the Americans on Friday. The former Malden Catholic star made two starts for UMass-Amherst this spring against UConn and Northeastern……Shortstop Brendan Pyburn of Merrimack has been on fire at the plate over the last week going 9 for his last 15, including a home run and three doubles. With the hot streak, the former Bishop Fenwick star has raised his average to a lofty .354….Catcher Bob “Bobo” McCarthy has moved into the ICL’s top five in the batting race, currently hitting an even .400 (16 for 40), and is currently enjoying a seven game hitting streak….Former Boston College star and Boston Red Sox farmhand Steve Langone made a nice grab of a Justin Crisafulli pop up in short right field in the second inning. The veteran second baseman is hitting .261 so far this season for the Merchants….Wakefield is off on Tuesday and hosts the Bombers at Walsh Field on Wednesday at 6:00 PM…Following Tuesday’s game at East Boston the Chiefs travel to Playstead Park in Medford on Wednesday at 6:00 PM before returning home to host the Mooney Dental Tanners on Thursday….The 2009 ICL all-star team is expected to be announced on Wednesday. The annual ICL-Boston Park League all-star game will be held this Sunday at Lexington starting at 2:00 PM…..     , 174878=The Blue Sox are back in action on Friday hosting the Bombers at 8:00 PM and the Chiefs return to Tufts University and entertain the Americans in a 6:00 PM start., 251159=It stayed a 2-0 game until the bottom of the fifth when the Bombers finally broke through against McNeill to cut the lead to 2-1. Consecutive singles from Vin Eruzione and Mike Navarro put the Bombers in business with nobody out. Kevin O’Leary then moved the runners up to second and third with a sacrifice bunt. ICL all-star Jay DeFillipo then got the Bombers on the board with a single to left that scored Eruzione with Navarro stopping at third. McNeill then got the biggest out of the game when he struck out Joe Papa swinging. 2008 ICL MVP Josh Klimkiewicz (Harvard/El Paso) followed and McNeill got him to ground sharply to Pyburn at short to preserve the Chiefs one run lead. , 263925=The Chiefs threatened again in the fifth when Landers lead off single was followed by a Pyburn walk. With runners at first and second, Martin struck out current Intercity League runs batted in leader Jeff Bercume and got 2008 Intercity League runs batted in leader Justin Crisafulli to fly out to center before reaching back for a little extra to strike out Pollard and end the inning., 240757=The Chiefs and Tanners are right back at it on Monday in a 6:00 PM start at Tufts University. Mike DiCato (3-2) will get the nod for the Chiefs.   , 3206=It was Lozeau’s first start for the Chiefs since 2007. The Pelham, NH, native spent last summer in the NECBL. He just completed his career at Bryant by picking up his 20th NCAA win. , 168564=Dan Lozeau will get the start for the Chiefs on Tuesday when they travel to East Boston Stadium at 8:00 PM to face the Bombers., 162740=The right-hander out of Gettysburg College previously blanked the Medford Americans on June 16th and 26th and beat the Testa Corp. Bombers back on June 2nd. So far this season the Southboro native has only allowed a stingy nine hits in 27.0 innings of work., 285110=If you throw aside the Chiefs’ 12-7 opening night win against the Tanners and the Americans 11-5 win in early July, when the wind was blowing out on both occasions, there have been a total of 42 runs scored in the other twelve games. Without having everyone reach for the calculator, that number translates into the fact both teams are combining for 3.5 runs per game., 67463=With the deadlock, the Chiefs stay unbeaten in ICL play (3-0-1, 4-0-1 overall) and the Merchants go to 2-3-1. Next up for the Chiefs is a date with the Medford Americans on Thursday at 6:00 PM at Tufts University.  , 226186=After the three game set with the Tanners, the Chiefs travel to East Boston Stadium to meet the Testa Corp. Bombers on Tuesday night at 8:00 PM before returning home to host the Medford Americans on both Wednesday and Thursday. Next Friday, the Chiefs host the Blue Sox, also at Tufts University, at 6:00 PM. , 331612=By Marvin Pave, Globe Correspondent  |  August 9, 2009, 208221=McKenna, who was 3-3 with an ERA of 3.03 in twelve appearances for Amherst College in 2009, also struck out three and hit a batter. McKenna was named to the ICL all-star team yesterday. He has been lights out so far this summer for the Tanners. The Lexington native has surrendered just three earned runs in 23.1 innings of work, struck out 17 and has an impressive ERA of 0.90.  , 366601=Game Three will be played at Tufts University on Monday at 5:20 PM. , 56713=The Chiefs non-league win over the Central New England Baseball Association’s Westford Willows on Sunday was the first time the two teams had ever hooked up. The Chiefs also play an annual game against the CNEBA’s Lunenburg Phillies. This year's game will be held at Lunenburg’s Marshall Park on Sunday (June 21) at 11:00 AM…..The Chiefs first played Lunenberg back in 1994 with Richie Barker on the mound for the Chiefs. With many radar guns popping behind the plate, Barker pitched the Chiefs to a 6-1 win. Following the game Barker signed with Chicago Cubs. Barker’s career spanned seven professional seasons and he made his major league debut for the Cubs at Wrigley Field on April 25, 1999, at the age of 26. The former Malden High and Quinsigamond Community College star appeared in 275 games during his time in pro ball posting an overall record of 20-19 with an ERA of 4.25 in 398 professional innings…..Sunday’s win against Westford was the Chiefs 42nd win against non-league opponents against just 19 losses dating back to 1989….Rookie outfielder Dario Pizzano will miss Tuesday’s game against Wakefield as he has been chosen to appear in the Eastern Massachusetts High School all-star game at Fraser Field in Lynn. The recent Malden Catholic graduate led the state in hitting this past spring for Steve Freker’s Lancers. Pizzano, who had three hits in the Westford game, will be playing for Columbia University next spring. He gained national notoriety in 2003 when he led the Saugus Americans in a dramatic run during the Little League World Series in Williamsport, PA……The first Intercity League fundraiser, raffle and social will be held on Friday, June 19 at the Woburn Sons of Italy starting at 7:00 PM. ICL Umpire in Chief Joe Cacciatore will serve as Master of Ceremonies for the event which is expected to draw a throng of over 500 people. Those needing information should e-mail the Intercity League at IntercityLeague@aol.com. … Former Chiefs catcher Matt Cooney, who signed with the Red Sox in 2007, has returned to Eastern Connecticut State to complete his degree this summer. Cooney spent the last season and a half in the Sox organization playing for Gulf Coast, Greensboro and the Lowell Spinners. The Arlington product is expected to return to the Chiefs in 2010….UMass-Amherst star Jared Freni, who pitched for the Chiefs in 2006, has been very impressive in first two starts for the North Shore Navigators of the NECBL this season. Freni, another former Malden Catholic star, is 2-0 with an ERA of 0.69. He has struck out 20 batters in just 13 innings of work. If he is not chosen in the 2010 MLB draft next spring he is expected to return to the Chiefs pitching staff. He won his only two Chiefs starts as a rookie in 2006 posting a 3.71 ERA in 11.1 innings of work….Another former Chiefs pitcher Jeff DeCarlo just completed his junior season at the University of Michigan. The former St. John’s Prep standout was also with the Chiefs in 2006 before spending the last two seasons in the Great Lakes Collegiate League and the NECBL. This summer DeCarlo is pitching for the Front Royal Cardinals of the Valley Baseball League in Virginia. One of DeCarlo’s teammates on the Cardinals is former Cassell Club and present Bentley star James Roche of Arlington. DeCarlo has made two appearances so far for Front Royal with an ERA of 0.00 in five innings of work. DeCarlo is also expected to return to the Chiefs next summer when his collegiate league eligibility expires….Catcher Matt Lawlor, who hit .398 for the Chiefs last season, remains on the disabled list with a herniated disc in his back. The Dracut, MA, native and 2008 ICL all-star selection also had his college season at UMass-Lowell cut short by the injury….. There is some better news on the injury front as Mike Andre grabbed a couple of at bats in Sunday’s non-league game. Andre underwent arthroscopic knee surgery in early May after completing his senior year at Merrimack College. The two-time ICL all-star is expected back into the lineup soon…. Staff ace Keith Forbes continues to throw and is also expected back in the next couple of weeks….Chiefs catcher Nick Leva of Cambridge, MA has committed to attend the University of Southern New Hampshire in the fall….. Make up dates for the Chiefs three home rainouts will be finalized later this week..... Condolences go out to former ICL umpire Jake Falvey on the passing of his father Jeremiah A. Falvey, Jr. on June 11. Jake also served as the Everett High School Baseball Coach until he moved to Oklahoma with his wife Jill a few years ago …..Bruce Tillman, 223905=Wet grounds and more rain in the forecast for tonight (Tuesday) has already caused the early postponement of all three Intercity League games that were scheduled. The Medford Americans at Chiefs game scheduled for Tufts University at 6:00 PM has been washed out and will be made up on Wednesday, July 29 at 6:00 PM. The Wakefield Merchants at Lexington Blue Sox game at Lexington High School has also been postponed. The teams are currently working on a make-up date which is expected to be announced soon. The Mooney Dental Tanners at Testa Corp. Bombers game, slated for East Boston Stadium, was postponed at 4:45 PM. Bombers management observed the conditions of the artificial surface and decided that the ongoing rain would render the field unplayable., 254104=Chiefs Chatter…..Bercume, with his five RBI, has taken over the ICL lead in that category with 21. He had a grand slam and a two-run homer along with eight RBI in Sunday’s doubleheader at Woburn and has raised his average to .382 to move into third place in the ICL’s batting race….Landers has moved his average to .367 and currently sits in fifth place…. The Chiefs begin a two game series with the Medford Americans at Tufts University on Wednesday at 6:00 PM., 277114=With the win the Blue Sox clinched the 2009 regular season pennant. , 203341=The Chiefs will send right-hander Ryan McNeill (1-1) to the mound on Thursday when they return home to meet the Mooney Dental Tanners at Tufts University at 6:00 PM., 280512=The Chiefs have a rare day off on Tuesday and resume ICL play on Wednesday at 6:00 PM when they travel to Playstead Park to face the Americans. The Blue Sox are back in action tonight when they host the Wakefield Merchants in an 8:00 PM start in Lexington.     , 225720=Woburn, MA- The Chiefs will visit Ferullo Field in Woburn on Sunday as they take on the Mooney Dental Tanners in a doubleheader starting at 5:30 PM. On Monday, the two teams will play at Tufts University in a 6:00 PM start. Monday's game is a make-up of the game that was rained out on Thursday., 189891=In the other corner was the Chiefs’ Mike DiCato, the former Malden Catholic all-American who led his team to a 2003 state championship and just wrapped up his four year stint at UMass-Amherst with 59 appearances, including wins over Boston College as well as Harvard in the 2008 Beanpot at Fenway Park. , 306495=A severe downpour hit Playstead Park in West Medford shortly before 4:00 PM this afternoon leaving the field unplayable. \"It is the worst flooding that I have seen in quite awhile\", said Americans Manager Kevin Burgoyne, who was at the field and watched as the infield and baselines became flooded. The game will be made up at Playstead on Sunday afternoon at 4:00 PM., 313518=Chiefs Chatter…With the tie, Chiefs go to 14-10-3 (31 points) and assured themselves of another winning season, their 44th in 46 years….Mike DiCato (5-2) is the expected starter when the Chiefs host the Lexington Blue Sox at Playstead Park on Friday at 6:00 PM. The Chiefs will use Playstead as their home venue on Friday as Tufts University is playing host to a Top-96 showcase…The Chiefs were to play the Blue Sox again on Saturday but that game has been switched to Sunday at 12:45 PM at Tufts University. The Chiefs will then travel to meet the Americans at Playstead on Sunday at 4:00 PM as part of a two site doubleheader. The Americans will have their traveling shoes on as well, as following the Chiefs game, they head to Ferullo Field in Woburn to meet the Tanners at 8:00 PM in what is shaping up as the final regular season game of the ICL season….The best of three first round of the playoffs is scheduled to begin on Tuesday with Seed 3 hosting Seed 6 and Seed 4 hosting Seed 5….The best of semi-finals are slated to start on Friday, August 14….}",
    "textBeforeTable": "Medford, MA- Forget the dead ball era! Welcome to Huskins Field where pitchers frolic and hitters frown.  ICL observers are starting to ask the question, “why can’t anyone hit or score runs at Huskins Field”, home of the Chiefs.  Prevailing summer wind always seeming to blow in?  Quality pitching? Wood bats? Humungous dimensions? 354’ down the left field line? 379’ plus in the gaps? 410’ to center? Poor hitting? A thick carpet like lush infield? Great defense? Lots of room in foul ground? Take your pick.  There is no doubt that the perfectly manicured field on the campus of Tufts University in Medford is one of the finest natural grass surfaces in New England. It has just become a place where offensive baseball is virtually non-existent come the summertime.  Consider this - the ICL’s batting average at Huskins Field is 52 points less than any other field in the ICL, 59 points below the ICL average and 106 points less than what ICL batters hit at Ferullo Field in Woburn. Toss in the fact that all batters are close to the",
    "textAfterTable": ".341 .338 .258           East Boston 505 71 130 10 3 1 59 56 84 .348 .295 .257           Huskins 570 77 117 15 2 4 67 66 88 .294 .260 .205           Totals 4104 638 1082 152 16 24 542 416 664 .343 .326 .264             So batters beware and pitchers rejoice! Huskins is ready to humble you. - Bruce Tillman  Wednesday, August 5 Downpour Hits Playstead-Chiefs at Americans is PPD, Re-scheduled for Sunday at 4",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}