{
    "relation": [
        [
            "",
            "Deus Ex Human Revolution (2011)",
            "Anno 2070 (2011)",
            "Alan Wake (2012)",
            "Dirt Showdown (2012)"
        ],
        [
            "low",
            "116.4",
            "123.9",
            "43",
            "129.5"
        ],
        [
            "med.",
            "",
            "53",
            "25.9",
            "75.5"
        ],
        [
            "high",
            "61.8",
            "32.1",
            "",
            "46.5"
        ],
        [
            "ultra",
            "",
            "",
            "",
            ""
        ],
        [
            "",
            "fps",
            "fps",
            "fps",
            "fps"
        ]
    ],
    "pageTitle": "Review Gigabyte U2442N Notebook - NotebookCheck.net Reviews",
    "title": "",
    "url": "http://www.notebookcheck.net/Review-Gigabyte-U2442N-Notebook.79020.0.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042992543.60/warc/CC-MAIN-20150728002312-00049-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 620254831,
    "recordOffset": 620187484,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{184426=The rest of the hardware is similarly potent: 8 GB RAM, a 128 GB SSD and a 750 GB hard disk. This hardware is top class, which brings us to the price: (starts at) 1200 Euro (~$1555) for the U2442N. Other Ultrabooks are similarly expensive, so we will see what the test model can do in the following review., 182055=The back of the display is made of polished aluminum, as promised by the manufacturer. This ensures that the display is quite sturdy. Thanks to the well-designed hinges, the laptop can be opened with one hand. On the other hand, when the laptop shakes, the display wobbles. We did not find any workmanship flaws like sharp edges, which results in the Gigabyte U2442 receiving a good score in this section., 185209=The U2442 series has a 14-inch display, and places alongside Ultrabooks like the HP Envy 14 Spectre and the Acer Aspire Timeline Ultra M3. The notebook is not equipped with ULV components, but with a fast Core i5-3210M and the middle-class GeForce GT 640M graphics card. Officially, the U2442N cannot qualify as an Ultrabook with this hardware and only its sibling, the U2442V (identically equipped but with a ULV CPU - Core i7-3517U) can wear the title., 153412=The laptop is also generously equipped with 8 GB RAM (2x 4 GB DDR3-1333 - double that of most Ultrabooks) and a 750 + 128 GB HDD-SSD combination., 174248=The software extras are scarce. Thankfully, this means that the user will not have to uninstall unnecessary test versions. The obligatory Adobe Reader and Starter edition of Microsoft Office 2010 are pre-installed and can be accessed via desktop shortcuts., 168788=Gigabyte has picked a matte WXGA++ display for its 14-inch model. The screen has a resolution of 1600 by 900 pixels which translates to a nice pixel density of 131 dpi. This provides the user with a well-sized work space and an acceptable font size., 181376=Like many other notebooks of 2012, the Gigabyte U2442N has two USB 3.0 interfaces. In addition, the laptop offers two USB 2.0 ports and this should satisfy most users. It is a real pity that the test model lacks a (Mini-) DisplayPort interface, but the user is provided with both a VGA and a HDMI interface.}",
    "TableContextTimeStampAfterTable": "{16619=High graphics performance is alien to most Ultrabooks. The Gigabyte U2442 series breaks the norm, and is similar to the Acer Aspire Timeline Ultra M3 (tested earlier this year). The Acer laptop and the Gigabyte U2442 series (U2442N and U2442V) use the Nvidia GeForce GT 640M, a middle-class graphics card based on the Kepler architecture., 125972=Sadly, the manufacturer could not combine these interesting qualities into an irresistible package. The test model costs 1200 Euros, yet it uses a 0815 display, a rickety keyboard and office-class speakers. The case, which is composed mainly of synthetic material, could have been of better quality. Worst of all, the small 44 Wh battery does not grant this laptop, specifically designed for mobility, a lot of time away from the power socket., 90132=The two stereo speakers of the Gigabyte U2442N are hidden above the keyboard. These speakers are not what one would be expect to find in a 1200 Euros (~$1555) notebook. The high notes show distortion, whereas the middle notes are tinny and the bass is non-existent. The maximum volume is quite limited and is only slightly louder than room level. We recommend the use of a pair of external speakers or headphones (3.5 mm audio jack) or a Hi-Fi system (HDMI). Thankfully, the speakers are sufficient for normal office use., 47845=We will run three games: Deus Ex: Human Revolution, Anno 2070 and Dirt Showdown. We picked high graphics settings, a resolution of 1366x768 pixels and low AA (Anti-Aliasing). The laptop runs the games with these settings at: 32 fps (Anno 2070) and 62 fps (Deus Ex). This provides an ideal compromise between graphics and performance for each genre., 194334=We found quite a few flaws which dampened our joy. The display is matte and offers a high resolution, but the viewing angles and contrast are not worth of a 1200 Euros investment. The rattling keyboard was also a disappointment., 17698=Overall, the U2442N is as fast as the Timeline Ultra M3 and scores 1837 points in 3DMark 11. In comparison to the AMD competition, the GT 640M places just ahead of the Radeon HD 7730M, and lags behind the Nvidia Geforce GT 650M by around 30 percent.}",
    "lastModified": "Tue, 04 Aug 2015 10:19:49 GMT",
    "textBeforeTable": "The third-Person shooter, Alan Wake, proves to be far more demanding. The game could only run fluidly at the XGA resolution (1024x768 pixels) and low settings. Many competing Ultrabooks rely solely on the HD Graphics 4000 IGP and are usually about half as fluid as the U2442N. As such, we would like to conclude that the dedicated GeForce GPU is a very nice bonus. We will run three games: Deus Ex: Human Revolution, Anno 2070 and Dirt Showdown. We picked high graphics settings, a resolution of 1366x768 pixels and low AA (Anti-Aliasing). The laptop runs the games with these settings at: 32 fps (Anno 2070) and 62 fps (Deus Ex). This provides an ideal compromise between graphics and performance for each genre. We have extensively tested the gaming performance of the GT 640M in the past. As such, today we will limit the gaming test to a few games. We would like to mention that the graphics card is usually too slow to provide a fluid experience at the native resolution of 1600x900 pixels - at least at maximum graphics settings. Dirt Showdown Gaming Performance 17081 \">",
    "textAfterTable": "Emissions Noise Emissions The summer heat wave spared our lab and the surrounding temperature for the emissions test of the Gigabyte U2442N was around 28 degrees Celsius. This resulted in both cooler fans of the test model constantly running (even in idle mode). The resulting noise emission ranged between 33.5 to 36.1 dB(A). A few days later, the temperatures dropped (around 23 degrees Celsius), and occasionally the fans shut off, leaving the laptop almost silent. The access noises of the hard disk are practically not audible from a normal seating position. Even at load, the high temperatures contributed significantly to the high noise emissions. Our measurement device read 45.5 to 47.9 dB(A) (3DMark 06 and stress test). Taking into consideration the slim build and the high performance of the U2442N, these numbers seem reasonable. Noise Level Idle 33.5 / 33.5 / 36.1 dB(A)",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}