{
    "relation": [
        [
            "Patent application number",
            "20100001987",
            "20120105401"
        ],
        [
            "Description",
            "SOURCE DRIVING CIRCUIT, DISPLAYER AND CONTROL METHOD THEREOF - A source driving circuit is suitable for a display panel. The source driving circuit of the present invention has a plurality of latches and a plurality of output buffers. Each of the latches is used for respectively receiving a data signal. In addition, all of the latches output the corresponding data signals at different time intervals according to a data output signal. After all of the latches have output the data signals to the corresponding output buffers, all output buffers transmit the data signals to the display panel synchronously.",
            "ELECTRONIC DEVICE - An electronic device including a display unit and a photoelectric conversion board is provided. The display unit includes a display surface and a back surface which are opposite to each other, and an edge of the photoelectric conversion board is rotatably connected to the back surface of the display unit. The photoelectric conversion board includes a substrate, a first photoelectric conversion unit, and a second photoelectric conversion unit. The substrate has a first surface and a second surface which are opposite to each other, the first photoelectric conversion unit is disposed on the first surface, the second photoelectric conversion unit is disposed on the second surface, and an absorption band of the first photoelectric conversion unit is different from an absorption band of the second photoelectric conversion unit."
        ],
        [
            "Published",
            "01-07-2010",
            "05-03-2012"
        ]
    ],
    "pageTitle": "Lian, TW - Patent applications",
    "title": "",
    "url": "http://www.faqs.org/patents/inventor/lian-tw-5/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986646.29/warc/CC-MAIN-20150728002306-00230-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 427692379,
    "recordOffset": 427673606,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Wei-Jhih Lian, Taipei County TW 06-28-2012 DISPLAY PANEL, PIXEL CIRCUIT AND DRIVING METHOD OF DIFFERENTIAL VOLTAGE DRIVEN DEVICE THEREIN - A display panel, a pixel circuit and a driving method of a differential voltage driving device are disclosed. The driving method includes: respectively supplying an alternating common voltage in a first polarity and a first display data in a second polarity to two terminals of the differential voltage driven device in a first frame; disconnecting the differential voltage driven device from the alternating common voltage, thereby keeping one terminal of the differential voltage driving device at the first polarity of the alternating common voltage; converting the alternating common voltage to the second polarity in a second frame which is consecutive to the first frame; and respectively supplying the alternating common voltage in the second polarity and a second display data in the first polarity to the two terminals of the differential voltage driving device in the second frame, here the first polarity is inverse to the second polarity. 20120162181 05-03-2012 LIQUID CRYSTAL DISPLAY INTEGRATED WITH SOLAR CELL MODULE - The present invention provides a liquid crystal display integrated with a solar cell module, which includes a first transparent substrate, a second transparent substrate, a cholesteric liquid crystal layer, a third transparent substrate, and a photoelectric conversion layer. The second transparent substrate is disposed on a side of the first transparent substrate, and the cholesteric liquid crystal layer is disposed between the first transparent",
    "textAfterTable": "Wei-Jhih Lian, New Taipei City TW Patent application number Description Published 20120274263 POWER MANAGEMENT SYSTEM AND METHOD THEREOF - A system for power management electrically connected to a solar cell is provided. The system for power management includes a photo-sensor, a controller electrically connected to the photo-sensor, and a power manager. The photo-sensor detects an illumination (illuminance or irradiance) of an environment where the solar cell is located. A look-up table of illumination vs. maximum output power is built in the controller, wherein a corresponding maximum output power is determined by the controller according to the illumination detected by the photo-sensor. The power manager is electrically connected to the controller and the solar cell. The power manager controls the output current of the solar cell so as to equalize an output power of solar cell and the corresponding maximum output power. A method for power management is also provided. 11-01-2012 Wen-Chuan Lian, Tu-Cheng TW Patent application number Description Published 20090028357 AUDIO TEST APPARATUS CAPABLE OF DECREASING NOISE INFLUENCE IN PROCESS OF AUDIO DEVICE TESTING AND METHOD THEREOF - A audio test method for decreasing noise influence, which includes the following steps: obtaining analog signals; converting the analog signals into digital signals; intercepting digital signals of a first predetermined length and executing a first Fast Fourier Transform (FFT), then obtaining an first Fourier spectrum; recording the amplitudes of frequency values of",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}