{
    "relation": [
        [
            "Command",
            "ip sla",
            "ip sla reaction-configuration",
            "ip sla schedule"
        ],
        [
            "Description",
            "Begins configuration for an IP SLAs operation and enters IP SLA configuration mode.",
            "Configures certain actions to occur based on events under the control of the IP SLA.",
            "Configures the time parameters for an IP SLAs operation."
        ]
    ],
    "pageTitle": "IP SLA Command Reference, Cisco IOS XE Release 3SE (Cisco WLC 5700 Series) - I through R [Cisco 5700 Series Wireless LAN Controllers] - Cisco",
    "title": "",
    "url": "http://www.cisco.com/c/en/us/td/docs/ios-xml/ios/ipsla/command/sla-xe-3se-5700-cr-book/sla-xe-3se-3850-cr-book_chapter_01.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042992543.60/warc/CC-MAIN-20150728002312-00289-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 375931063,
    "recordOffset": 375889031,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{49256=IP SLA Y.1731 Configuration, 1438=IP SLAs allows a maximum of 2000 operations.}",
    "TableContextTimeStampAfterTable": "{139572=Loss configuration (config-sla-y1731-loss), 134430=To configure the Simple Network Management Protocol (SNMP) owner of a Cisco IOS IP Service Level Agreements (SLAs) operation, use the ownercommand in the appropriate submode of IP SLA configuration, IP SLA auto Ethernet configuration, IP SLA monitor configuration, or IP SLA Y.1737 configuration mode. To return to the default value, use the no form of this command., 144605=This command was modified. Support for the IP SLA Y.1731 configuration mode was added., 129468=In the following example, operation 25 begins actively collecting data at 3:00 p.m. on April 5. This operation will age out after 12 hours of inactivity, which can be before it starts or after it has finished with its life. When this operation ages out, all configuration information for the operation is removed (that is, the configuration information is no longer in the running configuration in RAM)., 32204=On a Cisco 2600 router, the maximum recommended value of operations per second is 6 or 7 (approximately 350 to 400 operations per minute). Exceeding this value of 6 or 7 operations per second could cause major performance (CPU) impact. Note that the maximum recommended value of operations per second varies from platform to platform., 139506=Delay configuration (config-sla-y1731-delay), 18593=(Optional) Specifies an absolute start time for the multioperation schedule using hours, minutes, and (optionally) seconds. Use the 24-hour clock notation. For example, start-time 01:02 means “start at 1:02 a.m.,” and start-time 13:01:30 means “start at 1:01 p.m. and 30 seconds.” The current day is implied unless you specify a month and day., 130428=In the following example, operation 15 begins automatically collecting data every day at 1:30 a.m.:, 113965=Specifies an absolute start time using hour, minute, and (optionally) second. Use the 24-hour clock notation. For example, start-time 01:02 means “start at 1:02 a.m.,” and start-time 13:01:30 means “start at 1:01 p.m. and 30 seconds.” The current day is implied unless you specify a month and day.}",
    "textBeforeTable": "Syntax Description interface-name ] { ip-address | hostname } | source-interface [ source-ip { destination-ip-address | destination-hostname } icmp-echo To configure an IP Service Level Agreements (SLAs) Internet Control Message Protocol (ICMP) echo operation, use the icmp-echocommand in IP SLA configuration mode. icmp-echo request-data-size paths-of-statistics-kept path-jitter path-echo owner ip sla schedule ip sla responder udp-echo ipaddress ip sla responder ip sla reset ip sla reaction-trigger ip sla low-memory ip sla logging traps ip sla group schedule ip sla icmp-jitter icmp-echo I through R request-data-size paths-of-statistics-kept path-jitter path-echo owner ip sla schedule ip sla responder udp-echo ipaddress ip sla responder ip sla reset ip sla reaction-trigger ip sla low-memory ip sla logging traps",
    "textAfterTable": "Command Default No IP SLAs operation type is configured for the operation being configured. Command Modes IP SLA configuration (config-ip-sla) Command History Release Modification 12.4(4)T This command was introduced. This command replaces the type echo protocol ipIcmpEchocommand. 12.0(32)SY This command was integrated into Cisco IOS Release 12.0(32)SY. 12.2(33)SRB This command was integrated into Cisco IOS Release 12.2(33)SRB. This command replaces the type echo protocol ipIcmpEcho command. 12.2(33)SRC Support for IPv6 addresses was added. 12.2(33)SB This command was integrated into Cisco IOS Release 12.2(33)SB. This command replaces the type",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}