{
    "relation": [
        [
            "Device Number",
            "50/87",
            "51EF",
            "51",
            "50BF"
        ],
        [
            "Function",
            "Unrestrained bus differential",
            "End fault protection",
            "Time overcurrent",
            "Breaker failure"
        ]
    ],
    "pageTitle": "B95Plus Bus Protection System",
    "title": "",
    "url": "http://www.gedigitalenergy.com/multilin/catalog/b95plus.htm",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042992543.60/warc/CC-MAIN-20150728002312-00196-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 458147163,
    "recordOffset": 458125072,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{47995=© 2015 General Electric Company, 12372=To save money in the long term, use the HardFiber Brick bay unit as an IEC 61850 process bus merging unit. This becomes the complete I/O interface for protective relays and all zones of protection. Relay installation for any future zone of protection becomes plug-and-play: mount the relay on a panel, plug the relay into the HardFiber Brick bay unit and commission., 30169=The B95Plus Bus Protection System is intended to operate as a standalone, distributed bus protection system. The bay units for this system are Bricks, part of the HardFiber IEC 61850 process bus solution. Once the Bricks for the B95Plus are installed process bus data is available for use for any other zone of protection. The Bricks, then, are a distributed I/O interface for all protection functions and zones, not just the B95Plus. With the B95Plus in place, installing line protection or feeder protection is a simple process: mount the relays in a panel, and patch to the fiber optic cable from the appropriate Bricks. The only requirement is the relays must implement the appropriate IEC 61850 datasets to interface successfully with the Bricks. All members of the Universal Relay family have the ability to interface with Bricks., 20722=IEC 61850 message formats for communications, including sampled value messaging for currents and voltages, 12132=room. Data signals are converted to digital signals per the IEC 61850 standard and communicated over a single fiber optic cable. Installation next to the primary signal source virtually eliminates all field wiring.}",
    "textBeforeTable": "ANSI Divice Numbers & Functions Multilin B95Plus Functional Block Diagram The B95Plus bus protection relay system provides robust and reliable protection for all bus protection applications. Highlights of the protection functions related to bus protection include: Multi-zone differential protection with both restrained (dual-slope percent or biased) and unrestrained (unbiased or instantaneous) functions incorporated. Differential protection is fast (typical response time: 1 power system cycle) and secure. Security is achieved by using a fast and reliable CT saturation detection algorithm and a phase comparison operating principle. Security is further enhanced by support for redundant process interface units (Bricks). Supports both three-phase tripping and individual phase tripping. Dynamic bus replica functionality and multi-zone protection (up to 6 zones) is supported allowing application of the B95Plus to multi-section reconfigurable buses. A zone expansion/contraction to an open breaker feature is included. Isolator position monitoring for up to 48 isolators. Check-zone functionality configured by programming one of the differential zones to enclose the entire bus. Additional bus protection functions including end fault protection, breaker fail and overcurrent protection for each bus source, CT trouble monitoring for each bus zone.   Protection  ",
    "textAfterTable": "Device Number Function 50/87 Unrestrained bus differential 51EF End fault protection 51 Time overcurrent 50BF Breaker failure   Applications   Reconfigurable multi-section bus bar with up to 24 feeders Retrofit and greenfield installations for power generation, transmission and distribution systems Reconfigurable bus bars for single bus, breaker-and-a-half and double bus with and without bus couplers Air-insulated and GIS stations Standardize on the B95Plus for Any Bus Configuration The B95Plus can be applied on a multitude of bus configurations due to the distributed architecture, and includes support for up to 6 zones of bus differential protection and support for up to 24 bus sources. The physical connection and wiring architecture for the B95Plus system will be identical for any bus configuration: Bricks installed to acquire measurements and equipment status, with the B95Plus unit connected to Bricks via fiber optic cables. The relay panel design will be identical for all applications, for all bus",
    "hasKeyColumn": true,
    "keyColumnIndex": 1,
    "headerRowIndex": 0
}