{
    "relation": [
        [
            "Name",
            "Topic Classification",
            "Operating System",
            "Os Version"
        ],
        [
            "Type",
            "select",
            "checkbox",
            "text"
        ],
        [
            "Size",
            "1",
            "3",
            "16"
        ],
        [
            "Values",
            "",
            "",
            ""
        ],
        [
            "Tooltip message",
            "blah blah...",
            "blah blah...",
            "blah blah..."
        ]
    ],
    "pageTitle": "jEdit Community Wiki . TWiki . TWikiDocumentation",
    "title": "",
    "url": "http://community.jedit.org/cgi-bin/TWiki/view/TWiki/TWikiDocumentation?sortcol=0&table=28&up=0",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989891.18/warc/CC-MAIN-20150728002309-00148-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 54117571,
    "recordOffset": 54003605,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "RCS (Revision Control System), a GNU Free Software package. TWiki is developed in a basic Linux/Apache environment. It also works with Microsoft Windows, and should have no problem on any other platform that meets the requirements. TWiki is written in Perl 5, uses a number of shell commands, and requires Server Requirements Low client and server requirements are core features that keep TWiki widely deployable, particularly across a range of browser platforms and versions. Server and client requirements for TWiki 01-Feb-2003 TWiki System Requirements TWiki Enhancement Requests TWiki Planned Features, TWiki History, TWiki Site, Related Topics: http://TWiki.org/cgi-bin/view/TWiki/TWikiDocumentation Note: Read the most up to date version of this document at Dev Flow 1998 Releases 01-Jul-1999 Release 01-Sep-1999 Release 01-May-2000 Release 01-Dec-2000 Release 01-Sep-2001 Release 01-Dec-2001 Release (Athens) 01-Feb-2003 Release (Beijing) Appendix B: TWiki Development Timeline TWiki File System Snapshot Files in twiki/templates Files under twiki/data Files under twiki/pub Files under twiki/lib Files in twiki/bin Files in twiki File Descriptions Directory Structure Who and What is This",
    "textAfterTable": "Cron/scheduler cron cron equivalents Web server Apache 1.3 is well supported; Apache 2.0 is not recommended yet (see TWiki:Support.FailedAuthenticationWithApache2OnWinNT). For other servers, CGI support, authentication, extended path required * Current documentation mainly covers Linux and Apache installations. See Windows Install Cookbook for a Windows installation guide. See TWiki:Codev.TWikiOn for help with installation on various platforms including Unix, MacOS X, Apache mod_perl, web hosts, etc. Client Requirements The TWiki standard installation has extremely low browser requirements: HTML 3.2 compliant generates XHTML 1.0 pages that are compatible with HTML 3.2 minimal use of JavaScript in the user interface (degrades gracefully) no cookies no CSS You can easily add functionality, by customizing TWiki Templates, for one, while tailoring the browser requirements to your situation. Known Issues The TWiki Plugins feature currently does not have compatibility guidelines for developers. Plugins can require just about anything - browser-specific functions, stylesheets (CSS), Java applets, cookies, specific Perl modules,... - check the individual Plugin specs. Plugins included in the TWiki",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}