{
    "relation": [
        [
            "type",
            "FR Doc.",
            "RIN",
            "TD"
        ],
        [
            "regulations.gov",
            "2015-09604",
            "1545-BL77",
            "9717"
        ]
    ],
    "pageTitle": "26 CFR 1.1441-1 - Requirement for the deduction and withholding of tax on payments to foreign persons. | US Law | LII / Legal Information Institute",
    "title": "",
    "url": "https://www.law.cornell.edu/cfr/text/26/1.1441-1",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989891.18/warc/CC-MAIN-20150728002309-00273-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 921369551,
    "recordOffset": 921319739,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{1019=Title 26 published on 2015-04-01.}",
    "TableContextTimeStampAfterTable": "{110958=103 Stat. 2413, 101445=§ 1244 - Losses on small business stock, 104393=§ 1474 - Special rules, 101851=§ 1275 - Other definitions and special rules, 102821=§ 1301 - Averaging of farm income, 103299=§ 1378 - Taxable year of S corporation, 17056=This document contains corrections to final regulations (TD 9719) that were published in the Federal Register on May 8, 2015 (80 FR 26437). The final regulations amend the treatment of nonperiodic payments made or received pursuant to certain notional principal contracts., 30208=This document contains final regulations under section 382 of the Internal Revenue Code (Code) that modify the effective date provision of recently published regulations. These regulations affect corporations whose stock is or was acquired by the Department of the Treasury (Treasury) pursuant to certain programs under the Emergency Economic Stabilization Act of 2008 (EESA)., 113146=Reorganization ... 1978 Plan No. 4, 270222=This document contains corrections to a notice of proposed rulemaking by cross-reference to temporary regulations (REG-143040-14) that was published in the Federal Register on Friday, March 13, 2015 (80 FR 13292). The IRS is issuing temporary regulations relating to information reporting by brokers for transactions involving debt instruments and options., 110395=§ 1001 note - Congressional findings and declaration of policy, 11551=This document contains temporary regulations relating to multiemployer pension plans that are projected to have insufficient funds, at some point in the future, to pay the full benefits to which individuals will be entitled under the plans (referred to as plans in “critical and declining status”). The Multiemployer Pension Reform Act of 2014 (“MPRA”) amended the Internal Revenue Code to incorporate suspension of benefits provisions that permit these multiemployer plans to reduce pension benefits payable to participants and beneficiaries if certain conditions are satisfied. MPRA requires the Secretary of the Treasury, in consultation with the Pension Benefit Guaranty Corporation and the Secretary of Labor, to approve or deny applications by these plans to reduce benefits. As required by MPRA, these temporary regulations, together with proposed regulations being published at the same time, provide guidance implementing these statutory provisions. These temporary regulations affect active, retired, and deferred vested participants and beneficiaries of multiemployer plans that are in critical and declining status as well as employers contributing to, and sponsors and administrators of, those plans. The text of these temporary regulations also serves, in part, as the text of the proposed regulations (REG-102648-15) set forth in the notice of proposed rulemaking on this subject in the Proposed Rules section of this issue of the Federal Register ., 102916=§ 1361 - S corporation defined, 111306=114 Stat. 2763, 100751=§ 1032 - Exchange of stock for property, 103921=§ 1445 - Withholding of tax on dispositions of United States real property interests, 104742=§ 1561 - Limitations on certain multiple tax benefits in the case of certain controlled corporations, 103092=§ 1374 - Tax imposed on certain built-in gains, 101957=§ 1286 - Tax treatment of stripped bonds, 101142=§ 1092 - Straddles, 155840=This document contains corrections to a notice of proposed rulemaking (REG-132634-14) that was published in the Federal Register on Wednesday, May 6, 2015 (80 FR 25970). The proposed rules provide guidance on qualifying income from exploration, development, mining or production, processing, refining, transportation, and marketing of minerals or natural resources., 39168=This document contains final and temporary regulations amending the treatment of nonperiodic payments made or received pursuant to certain notional principal contracts. These regulations provide that, subject to certain exceptions, a notional principal contract with a nonperiodic payment, regardless of whether it is significant, must be treated as two separate transactions consisting of one or more loans and an on-market, level payment swap. This document also contains temporary regulations regarding an exception from the definition of United States property. These regulations affect parties making and receiving payments under notional principal contracts, including United States shareholders of controlled foreign corporations and tax-exempt organizations. The text of the temporary regulations also serves as the text of the proposed regulations set forth in the notice of proposed rulemaking (REG-102656-15) on this subject in the Proposed Rules section in this issue of the Federal Register ., 103200=§ 1377 - Definitions and special rule, 102420=§ 1295 - Qualified electing fund, 73576=This document contains corrections to final and temporary regulations (TD 9713) that were published in the Federal Register on March 13, 2015 (80 FR 13233). The final regulations are relating to information reporting by brokers for bond premium and acquisition premium., 52804=This document contains corrections to final regulations (TD 9717) that were published in the Federal Register on Friday, April 3, 2015 (80 FR 18096). The final regulations are relating to the allocation of the credit for increasing research activities (research credit) to corporations and trades or businesses under common control (controlled groups)., 44339=This document contains corrections to final regulations (TD 9708) that were published in the Federal Register on December 31, 2014 (79 FR 78954). The final regulations provide guidance regarding the requirements for charitable hospital organizations added by the Patient Protection and Affordable Care Act of 2010., 104477=§ 1502 - Regulations, 103625=§ 1402 - Definitions, 100655=§ 1017 - Discharge of indebtedness, 104311=§ 1473 - Definitions, 69100=This document contains a correction to final and temporary regulations (TD 9674) that were published in the Federal Register on Wednesday, July 2, 2014 (79 FR 37630). The final and temporary regulations provide guidance to eligible organizations seeking recognition of tax-exempt status under section 501(c)(3) of the Internal Revenue Code., 247799=This document contains corrections to notice of proposed rulemaking by cross-reference to temporary and notice of public hearing (REG-133489-13) that were published in the Federal Register on Friday, April 3, 2015 (80 FR 18171). The notice of proposed rulemaking by cross-reference to temporary and notice of public hearing are relating to the allocation of the credit for increasing research activities (research credit) to corporations and trades or businesses under common control (controlled groups)., 112017=94 Stat. 1308, 101016=§ 1060 - Special allocation rules for certain asset acquisitions, 104559=§ 1503 - Computation and payment of tax, 139918=This document contains proposed regulations under section 529A of the Internal Revenue Code that provide guidance regarding programs under The Stephen Beck, Jr., Achieving a Better Life Experience Act of 2014. Section 529A provides rules under which States or State agencies or instrumentalities may establish and maintain a new type of tax-favored savings program through which contributions may be made to the account of an eligible disabled individual to meet qualified disability expenses. These accounts also receive favorable treatment for purposes of certain means-tested Federal programs. In addition, these proposed regulations provide corresponding amendments to regulations under sections 511 and 513, with respect to unrelated business taxable income, sections 2501, 2503, 2511, 2642 and 2652, with respect to gift and generation-skipping transfer taxes, and section 6011, with respect to reporting requirements. This document also provides notice of a public hearing on these proposed regulations., 3101=This document contains corrections to final and temporary regulations (TD 9722) that were published in the Federal Register on June 12, 2015 (80 FR 33402). The final and temporary regulations prevent a corporate partner from avoiding corporate-level gain through transactions with a partnership involving equity interests of the partner., 113432=Title 26 published on 2015-04-01, 102059=§ 1291 - Interest on tax deferral, 104193=§ 1472 - Withholdable payments to other foreign entities, 213719=In the Rules and Regulations section of this issue of the Federal Register, the IRS is issuing final and temporary regulations that amend the treatment of nonperiodic payments made or received pursuant to certain notional principal contracts. These regulations provide that, subject to certain exceptions, a notional principal contract with a nonperiodic payment, regardless of whether it is significant, must be treated as two separate transactions consisting of one or more loans and an on-market, level payment swap. The regulations provide an exception from the definition of United States property. These regulations affect parties making and receiving payments under notional principal contracts, including United States shareholders of controlled foreign corporations and tax-exempt organizations. The text of the temporary regulations also serves as the text of these proposed regulations. This document withdraws the notice of proposed rulemaking (REG-107548-11; RIN 1545-BK10) published in the Federal Register on May 11, 2012 (77 FR 27669)., 102514=§ 1296 - Election of mark to market for marketable stock, 110782=103 Stat. 2373, 135051=This document partially withdraws the portion of the notice of proposed rulemaking published in the Federal Register on September 16, 2013 (78 FR 56842), relating to the definition of issue price for purposes of the arbitrage restrictions under section 148 of the Internal Revenue Code (Code). This document also contains a notice of proposed rulemaking that provides a revised definition of issue price for purposes of the arbitrage restrictions. In addition, this document provides notice of a public hearing on the proposed regulations in this document. The proposed regulations in this document affect issuers of tax-exempt and other tax-advantaged bonds., 203922=This document contains proposed regulations that provide guidance regarding the application of the modified carryover basis rules of section 1022 of the Internal Revenue Code (Code). Specifically, the proposed regulations will modify provisions of the Treasury Regulations involving basis rules by including a reference to section 1022 where appropriate. The regulations will affect property transferred from certain decedents who died in 2010. The regulations reflect changes to the law made by the Economic Growth and Tax Relief Reconciliation Act of 2001 and the Tax Relief, Unemployment Insurance Reauthorization, and Job Creation Act of 2010., 122040=This document contains corrections to a notice of proposed rulemaking (REG-103281-11) that was published in the Federal Register on Wednesday, April 22, 2015 (80 FR 22449), the proposed regulations are relating to the 2 percent tax on payments made by the U.S. government to foreign persons pursuant to certain contracts., 101353=§ 1221 - Capital asset defined, 111846=94 Stat. 1208, 104067=§ 1471 - Withholdable payments to foreign financial institutions, 101222=§ 1202 - Partial exclusion for gain from certain small business stock, 102632=§ 1297 - Passive foreign investment company, 101546=§ 1248 - Gain from certain sales or exchanges of stock in certain foreign corporations, 100852=§ 1059 - Corporate shareholder’s basis in stock reduced by nontaxed portion of extraordinary dividends, 103818=§ 1443 - Foreign tax-exempt organizations, 26101=This document contains amendments to temporary regulations relating to information reporting by brokers for transfers of debt instruments. The amendments change the applicability date of the temporary regulations for reporting certain information on a transfer statement from June 30, 2015, to January 1, 2016. The amendments to the temporary regulations will provide guidance to brokers and their customers., 60782=This document contains corrections to final regulations (TD 9715) that were published in the Federal Register on April 1, 2015 (80 FR 17314). The final regulations are regarding the agent for an affiliated group of corporations that files a consolidated return (consolidated group)., 101694=§ 1254 - Gain from disposition of interest in oil, gas, geothermal, or other mineral properties, 150377=This document contains proposed regulations relating to multiemployer pension plans that are projected to have insufficient funds, at some point in the future, to pay the full benefits to which individuals will be entitled under the plans (referred to as plans in “critical and declining status”). The Multiemployer Pension Reform Act of 2014 (“MPRA”) amended the Internal Revenue Code to incorporate suspension of benefits provisions that permit these multiemployer plans to reduce pension benefits payable to participants and beneficiaries if certain conditions are satisfied. MPRA requires the Secretary of the Treasury, in consultation with the Pension Benefit Guaranty Corporation and the Secretary of Labor, to approve or deny applications by these plans to reduce benefits. As required by MPRA, these proposed regulations, together with temporary regulations being published at the same time, provide guidance implementing these statutory provisions. These proposed regulations would affect active, retired, and deferred vested participants and beneficiaries of multiemployer plans that are in critical and declining status as well as employers contributing to, and sponsors and administrators of, those plans., 104660=§ 1504 - Definitions, 102281=§ 1294 - Election to extend time for payment of tax on undistributed earnings, 103707=§ 1441 - Withholding of tax on nonresident aliens, 164300=This document cancels a public hearing on proposed regulations that provide the method to be used to adjust the applicable Federal rates (AFRs) under section 1288 of the Internal Revenue Code (adjusted AFRs) for tax-exempt obligations and the method to be used to determine the long-term tax-exempt and the adjusted Federal long-term rate under section 382., 103008=§ 1368 - Distributions, 102154=§ 1293 - Current taxation of income from qualified electing funds, 102737=§ 1298 - Special rules}",
    "lastModified": "Mon, 20 Jul 2015 06:07:48 GMT",
    "textBeforeTable": "Additional Documents GPO FDSys XML | Text 80 FR 38940 - Partnership Transactions Involving Equity Interests of a Partner; Correction 2015-07-08; vol. 80 # 130 - Wednesday, July 8, 2015 For a complete list of all Rules, Proposed Rules, and Notices view the Rulemaking tab. The following are only the Rules published in the Federal Register after the published date of Title 26. Title 26 published on 2015-04-01. 79 FR 12747, Mar. 6, 2014] 72 FR 18388, Apr. 12, 2007; T.D. 9658, 71 FR 13005, Mar. 14, 2006; T.D. 9323, 67 FR 70312, Nov. 22, 2002; T.D. 9253, 66 FR 18188, Apr. 6, 2001; T.D. 9023, 65 FR 32170, 32211, May 22, 2000; 64 FR 73409, 73412, Dec. 30, 1999; T.D. 8881, 63 FR 72184, 72187, Dec. 31, 1998;",
    "textAfterTable": "DEPARTMENT OF THE TREASURY, Internal Revenue Service Final and temporary regulations; correction. This correction is effective on July 2, 2015 and applicable beginning June 12, 2015. 26 CFR Part 1 Summary This document contains corrections to final and temporary regulations (TD 9722) that were published in the Federal Register on June 12, 2015 (80 FR 33402). The final and temporary regulations prevent a corporate partner from avoiding corporate-level gain through transactions with a partnership involving equity interests of the partner. 80 FR 38940 - Partnership Transactions Involving Equity Interests of a Partner; Correction GPO FDSys XML | Text Additional Documents type regulations.gov FR Doc. 2015-16674 RIN 1545-BM35 TD 9722 DEPARTMENT OF THE TREASURY, Internal Revenue Service Correcting amendments. This correction",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}