{
    "relation": [
        [
            "Date",
            "May 15, 2006",
            "Mar 15, 2013"
        ],
        [
            "Code",
            "AS",
            "FPAY"
        ],
        [
            "Event",
            "Assignment",
            "Fee payment"
        ],
        [
            "Description",
            "Owner name: LG ELECTRONICS INC., KOREA, REPUBLIC OF Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNORS:KIM, BEOM JOON;RYU, KI SEON;KIM, YONG HO;AND OTHERS;REEL/FRAME:017859/0118 Effective date: 20060511",
            "Year of fee payment: 4"
        ]
    ],
    "pageTitle": "Patent US20060194598 - Method of updating channel information by a mobile station that is in power ... - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US20060194598?ie=ISO-8859-1",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042992543.60/warc/CC-MAIN-20150728002312-00217-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 481269359,
    "recordOffset": 481236983,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{6381=FIG. 6 is diagram illustrating an example of an operation using a frame number instead of the DCD/UCD transmission offset of Table 14. If the DCD/UCD transmission offset is used, the transmission offset has to be 16 bits considering a 16-bit maximum paging cycle of the power saving mode and a 10-second maximum DCD/UCD transmission cycle (e.g., 2000 frames where 1 frame=5 milliseconds). As for using the frame number, even if lower 8 bits are used, a frame to transmit the DCD/UCD can be indicated, thus able to decrease the size of the transmission message.}",
    "TableContextTimeStampAfterTable": "{34045=This application claims the benefit of Korean Application Nos. 10-2004-0117275 filed on Dec. 30, 2004, 10-2005-0019841 filed on Mar. 9, 2005, and 10-2005-0131043 filed on Dec. 27, 2005, which is hereby incorporated by reference.}",
    "textBeforeTable": "Referenced by It will be apparent to those skilled in the art that various modifications and variations can be made in the present invention without departing from the spirit or scope of the inventions. Thus, it is intended that the present invention covers the modifications and variations of this invention provided they come within the scope of the appended claims and their equivalents. , the apparatus includes a receiver 10 which receives status information, such as the DCD message and/or the UCD message, of a first channel descriptor and transmission frame information which includes when the first channel descriptor is scheduled to be transmitted. The apparatus further includes a comparator 20 which is used to compare status information of the first channel descriptor with status information of a second channel descriptor. Here, the second channel descriptor is stored in a memory 30 of the MS. Furthermore, the receiver 10 also receives the first channel descriptor according to the transmission frame information if the compared status information from the comparator 20 are different. FIG. 7 is an example of an apparatus in a power saving mode which is used to update channel information. In FIG. 7 In another embodiment of the present invention, an operation of updating channel information can be performed by an apparatus in a power saving mode. As shown in",
    "textAfterTable": "US7826419 * Apr 27, 2006 Nov 2, 2010 Motorola Mobility, Inc. Method and system to improve transmission and receipt of channel descriptors US7937100 * Sep 13, 2010 May 3, 2011 Lg Electronics Inc. Method of updating channel information by a mobile station that is in power saving mode US8036152 * Jan 5, 2007 Oct 11, 2011 Proxense, Llc Integrated power management of a client device via system time slot assignment US8155674 * Aug 20, 2007 Apr 10, 2012 Research In Motion Limited Apparatus, and associated method, for dynamically configuring a page message used to page an access terminal in a radio communication system US8219129 Jan 5, 2007 Jul 10, 2012 Proxense, Llc Dynamic real-time tiered client access US8330866 * Jan 12, 2007 Dec 11, 2012 Qualcomm Incorporated Multi-program viewing in a wireless apparatus US8340672 Jan 5, 2007 Dec 25, 2012 Proxense, Llc",
    "hasKeyColumn": true,
    "keyColumnIndex": 2,
    "headerRowIndex": 0
}