{
    "relation": [
        [
            "Patent application number",
            "20110027560",
            "20140109510"
        ],
        [
            "Description",
            "Composite Materials And Applications Thereof - Embodiments of the present invention relate to composite materials. In one embodiment, a composite material comprises an inorganic ceramic matrix comprising a first surface and a second surface opposite the first outer surface and generally parallel to the first outer surface. At least one open weave fiber glass fabric is disposed in the inorganic ceramic matrix between the first surface and the second surface. In another embodiment, a composite material comprises a first inorganic ceramic matrix comprising pieces of stone, a second inorganic ceramic matrix attached adjacent to the first inorganic ceramic matrix, and at least one open weave fiber glass fabric disposed in the second inorganic ceramic matrix.",
            "Composite Materials And Applications Thereof And Methods Of Making Composite Materials - Various embodiments of the present invention provide composite materials and methods of making the same. In some embodiments, the composite materials comprise high temperature resistant composite materials and methods of making high temperature resistant composite materials. In some embodiments, high temperature resistant composite materials of the present invention can be fabricated into landing pads, components used in landing pads to provide a structure to support the take-off and landing of aircraft, roadways or similar travel paths for heavy equipment, and/or components used in roadways or similar travel paths for heavy equipment. In one embodiment, a composite material comprises an inorganic ceramic matrix having a top surface in facing opposition to a bottom surface and at least one side surface between the top surface and the bottom surface, a first open weave fabric comprising a plurality of fibers disposed in the matrix proximate the bottom surface of the matrix, and at least one additional open weave fabric comprising a plurality of fibers disposed in the matrix between the first open weave fabric and the top surface of the matrix, wherein the at least one additional open weave fabric is positioned closer to the bottom surface than the top surface of the matrix."
        ],
        [
            "Published",
            "02-03-2011",
            "04-24-2014"
        ]
    ],
    "pageTitle": "Morris, NC - Patent applications",
    "title": "",
    "url": "http://www.faqs.org/patents/inventor/morris-nc-3/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989891.18/warc/CC-MAIN-20150728002309-00093-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 434565739,
    "recordOffset": 434525232,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Steven John Morris, Shelby, NC US 09-26-2013 AUTOMATIC SURGICAL LIGATION CLIP APPLIER - An applier for ligation clip is provided. The applier includes: an outer tube having mounting bosses; a pair of jaws pivotally connected to the mounting bosses, the jaws having actuating projections; a feed tube located in the outer tube and configured to move axially within the outer tube, the feed tube having actuating slots in which the actuating projections are located; a clip lock arm located in the outer tube and configured to move axially within the outer tube; and a clip advance arm located in the outer tube and configured to move axially within the outer tube, the clip advance arm having flexible pinchers at one end of the clip advance arm. A method of applying a ligation clip is also disclosed. 20130253540 09-19-2013 Narrow Profile Surgical Ligation Clip - A narrow profile surgical ligation clip has two legs with clamping surfaces joined by a hinge near the proximal ends, allowing the clip to reversibly open and close. A locking mechanism is proximal to the hinge to bias or lock the clip closed, including first and second jaw structures spaced on opposite sides of a longitudinal axis of the clip thereby defining a locking space therebetween. In one embodiment, a wedge or buttress body moves by application of an external force applied to a proximal end of the clip towards the hinge to move into the locking space such",
    "textAfterTable": "Thomas Scott Morris, Lewisville, NC US Patent application number Description Published 20100199492 CONFORMAL SHIELDING EMPLOYING SEGMENT BUILDUP - A meta-module having circuitry for two or more modules is formed on a substrate, which is preferably a laminated substrate. The circuitry for the different modules is initially formed on the single meta-module. Each module will have one or more component areas in which the circuitry is formed. A metallic structure is formed on or in the substrate for each component area to be shielded. A single body, such as an overmold body, is then formed over all of the modules on the meta-module. At least a portion of the metallic structure for each component area to be shielded is then exposed through the body by a cutting, drilling, or like operation. Next, an electromagnetic shield material is applied to the exterior surface of the body of each of the component areas to be shielded and in contact with the exposed portion of the metallic structures. 08-12-2010 20110225803 CONFORMAL SHIELDING EMPLOYING SEGMENT BUILDUP - A meta-module having circuitry for two or more modules is formed on a substrate, which is preferably a laminated substrate. The circuitry for the different modules is initially formed on the single meta-module. Each module will have one or more component areas in which the circuitry is formed. A metallic structure is formed on or in the substrate for each component area to be shielded. A",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}