{
    "relation": [
        [
            "Shipping and handling",
            "Free shipping",
            "US $6.99"
        ],
        [
            "To",
            "United States",
            "United States"
        ],
        [
            "Service",
            "Standard Shipping",
            "Expedited Shipping (USPS Priority Mail®)"
        ],
        [
            "Delivery*",
            "Estimated within 2-7 business days",
            "Estimated within 2-5 business days"
        ]
    ],
    "pageTitle": "NEW MEN'S Molded Padded Butt Booster Enhancer Shaper Brief Boyshort Underwear | eBay",
    "title": "",
    "url": "http://www.ebay.ca/itm/NEW-MENS-MOLDED-PADDED-BUTT-BOOSTER-ENHANCER-SHAPER-BRIEF-BOYSHORT-UNDERWEAR-/231038847900?pt=US_CSA_MC_Underwear&var=&hash=item35cafd0b9c",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989891.18/warc/CC-MAIN-20150728002309-00325-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 423196271,
    "recordOffset": 423145319,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Please enter 6 digits for the Postal Code. Please enter a valid Postal Code. Postal Code: Select a valid country. There are 99 items available. Please enter a number less than or equal to 99. -Select- American Samoa Anguilla Antigua and Barbuda Argentina Aruba Australia Bahamas Barbados Belize Bermuda Bolivia Brazil British Virgin Islands Cambodia Canada Cayman Islands Chile China Colombia Cook Islands Costa Rica Denmark Dominica Dominican Republic Ecuador El Salvador Falkland Islands (Islas Malvinas) Fiji Finland France French Guiana French Polynesia Gibraltar Greenland Grenada Guadeloupe Guam Guatemala Guyana Haiti Honduras Hong Kong Iceland Indonesia Ireland Israel Jamaica Japan Kazakhstan Kiribati Korea, South",
    "textAfterTable": "* Estimated delivery dates- opens in a new window or tab include seller's handling time, origin Postal Code, destination Postal Code and time of acceptance and will depend on shipping service selected and receipt of cleared payment- opens in a new window or tab. Delivery times may vary, especially during peak periods. Domestic handling time Will usually ship within 1 business day of receiving cleared payment - opens in a new window or tab. Return policy Item must be returned within Refund will be given as 14 days after the buyer receives it Money Back The buyer is responsible for return shipping costs. Return policy details",
    "hasKeyColumn": true,
    "keyColumnIndex": 2,
    "headerRowIndex": 0
}