{
    "relation": [
        [
            "type",
            "FR Doc.",
            "RIN",
            "DA"
        ],
        [
            "regulations.gov",
            "2014-26429",
            "",
            "14-1507"
        ]
    ],
    "pageTitle": "47 CFR 15.219 - Operation in the band 510-1705 kHz. | LII / Legal Information Institute",
    "title": "",
    "url": "https://www.law.cornell.edu/cfr/text/47/15.219",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042992543.60/warc/CC-MAIN-20150728002312-00194-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 915284539,
    "recordOffset": 915269915,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{1025=Title 47 published on 2014-10-01}",
    "TableContextTimeStampAfterTable": "{12384=This document contains corrections to the final regulations to the Commission's rules which were published in the Federal Register on Thursday, November 6, 2014 (79 FR 65906). The Commission published a clarification in the Declaratory Ruling, which clarifies how the Commission intends to preserve the “coverage area” of eligible broadcasters in the repacking process associated with the broadcast television spectrum incentive auctions. This document contains corrections to the adopted date., 28175=§ 302 - Repealed. June 5, 1936, ch. 511,, 3373=This document modifies the rules governing the operation of Unlicensed Personal Communications Service (UPCS) devices in the 1920-1930 MHz band (UPCS band) to reference the 2013 version of the American National Standards Institute (ANSI) C63.17 standard, Methods of Measurement of the Electromagnetic and Operational Compatibility of Unlicensed Personal Communications Service (UPCS) Devices, ANSI C63.17-2013, by which UPCS devices must be measured for compliance with the technical requirements in the Commission's regulations., 71945=The Federal Communications Commission published a document in the Federal Register of October 27, 2014 (79 FR 63883), regarding Petitions for Reconsideration filed of Action in a rulemaking proceeding. The document contained the incorrect deadline for filing replies to an opposition to the Petition. This document revises the deadline for replies to an opposition to the Petition., 17302=On August 15, 2014, the Commission released a Report and Order, “Expanding the Economic and Innovation Opportunities of Spectrum Through Incentive Auctions.” This document announces an effective date for several sections in the final regulations that appeared in the Federal Register on August 15, 2014 (79 FR 48442)., 8143=On April 1, 2014, the Commission released a Report and Order, “Unlicensed National Information Infrastructure (U-NII) Devices in the 5 GHz Band.” This document contains corrections to the final regulations for “Unlicensed National Information Infrastructure (U-NII) Devices in the 5 GHz Band” that appeared in the Federal Register on May 1, 2014 (79 FR 24569).}",
    "lastModified": "Thu, 26 Feb 2015 02:18:40 GMT",
    "textBeforeTable": "Additional Documents GPO FDSys XML | Text 80 FR 2836 - Unlicensed Personal Communications Service Devices in the 1920-1930 MHz Band 2015-01-21; vol. 80 # 13 - Wednesday, January 21, 2015 For a complete list of all Rules, Proposed Rules, and Notices view the Rulemaking tab. The following are only the Rules published in the Federal Register after the published date of Title 47. Title 47 published on 2014-10-01 All emissions below 510 kHz or above 1705 kHz shall be attenuated at least 20 dB below the level of the unmodulated carrier. Determination of compliance with the 20 dB attenuation specification may be based on measurements at the intentional radiator's antenna output terminal unless the intentional radiator uses a permanently attached antenna, in which case compliance shall be deomonstrated by measuring the radiated emissions. (c) The total length of the transmission line, antenna and ground lead (if used) shall not exceed 3 meters. (b)",
    "textAfterTable": "DA 14-1189 FEDERAL COMMUNICATIONS COMMISSION Final rule. Effective January 21, 2015. The incorporation by reference listed in the rule is approved by the Director of the Federal Register as of January 21, 2015. 47 CFR Part 15 Summary This document modifies the rules governing the operation of Unlicensed Personal Communications Service (UPCS) devices in the 1920-1930 MHz band (UPCS band) to reference the 2013 version of the American National Standards Institute (ANSI) C63.17 standard, Methods of Measurement of the Electromagnetic and Operational Compatibility of Unlicensed Personal Communications Service (UPCS) Devices, ANSI C63.17-2013, by which UPCS devices must be measured for compliance with the technical requirements in the Commission's regulations. 2014-12-23; vol. 79 # 246 - Tuesday, December 23, 2014 79 FR 76902 - Unlicensed National Information Infrastructure (U-NII) Devices in the 5 GHz Band GPO FDSys XML | Text Additional Documents",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}