{
    "relation": [
        [
            "Categories",
            "Great for these types of students",
            "Tips for prospective students",
            "Bang for the buck",
            "Am enjoying being here",
            "Am learning a lot"
        ],
        [
            "Comments",
            "The school is great for everyone. You just have to find your niche. There's a place for everyone.",
            "Try talking to anyone you know who currently goes to UCI. Taking a tour around campus also really helps and gives you an idea if the school is right for you. In addition, for those who accept UCI as their college, try everything. It's a very common tip, trying everything really helps you in finding out what you are truly passionate about.",
            "I think the tuition and expensive for attending UC Irvine is quite pricey. Where does all the money go? It’s gone to maintenance of the school. You pay for your own textbooks and if you want extra tutoring through their LARC (Learning and Academic Resource Center) program, you pay an extra $100 per quarter, per class. I really wish tuition was cheaper. With the university located in an expensive city, everything is expensive. Although the campus is clean and well-maintained, it is expensive to attend; especially if you do not get financial aid.",
            "I don’t particularly love being at this school, but I don’t absolutely hate it either. Coming from northern California, southern California is quite different. Having no car in Irvine is actually a big problem as well since most activities are in inner LA. The city Irvine itself is operated by a big company so many of the groceries and items are more expensive. Yes, there are many clubs to join and you may find ones you like but for many, the clubs may not be for you. It depends on how much you want to be part of something. Some people go for a sorority or frat while others turn to their hallmates and become close to their hallmates. If you want to have fun, you’ll find it, but if you want to study you’ll easily be able to do that too.",
            "The professors that I encountered as a biological sciences major were pretty helpful in teaching the material. For biology, the material was presented through powerpoints and the instructor would elaborate on the material. Some professors were better than others, seeking to explain the material further while other professors dismissed questions that were asked. Although I studied a lot on my own, the professors provided an outline for my study. Just attending the lectures is really not enough to do well unless you’ve already learned the material before. Some professors place more importance in their lectures by not providing any powerpoint. Once again, it really depends on the professor you choose and how much you are willing to put into your studying. If you find the best combination between studying yourself and attending lectures, then doing well should not be a problem."
        ]
    ],
    "pageTitle": "University of California, Irvine (UC Irvine) (UC Irvine) Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/University-of-California-Irvine-UC-Irvine/reviews",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042992543.60/warc/CC-MAIN-20150728002312-00334-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 902943343,
    "recordOffset": 902738050,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{669643=Mitosis plaza next to BS3 1200. Students usually know they can also shake the Mesa bridge by jumping on it in the middle and that there is a building that can project your own voice back to you if you stand in the right spot. Also, there is a taxidermized anteater (Peter!) in the study lounge., 728083=Keep your GPA up, get a good SAT/ACT score and write a good personal statement! UCI is upping its standards according to my incoming year (2012/2013 freshmen). Many people who seemed likely to get in did not, and UCI under accepted so they had to accept so many appeals., 698467=Dorm life is amazing! You meet different types of people who are easy to get along with and are fun to be around. I currently live in Crickhollow, which I must say is the best hall in UCI dorms of the 2012-2013 school year. Big thanks to our RA Colin for being so great in not only being a resident advisor but also being a mentor to us first years. There several activities at the dorms anywhere from movie and karaoke nights to hall mixer/party. To dorm in UCI is a great experience; Dorm life here makes the transition from high school to college easier and joyful., 222588=I spend a lot of my free time with my friends. I've made amazing friends at UCI and I have the most fun with them whether we're making a run to Cha at 12:50 am, shopping at the Irvine Spectrum, or at a fraternity event in AV., 462156=You can see the Disneyland fireworks at around 9:45 from the top of Engineering Hall., 93939=Well with the 32% increase it is getting a little expensive for a public University but it is a really good research University with enough mediums to help you learn what you are interested in and the quality is worth the money. Also they have a lot of Scholarships to apply for and not only GPA based so it can be a great relief for people who cannot afford College. I know people going to UCI that only pay $2000 all include per quarter. Although it is really expensive for out-of-state students and I would not recommend it for them., 309846=Research-oriented students. UC Irvine has one of the greatest research institutions and is renowned for its research achievements all over the world. If you're in social movements, UC Irvine specializes in social movements. Our Sociology Department has a great, prestigious set of professors who have both contributed to the realm of sociological research and social advocacy. May I recommend you get to know the following: Prof. Caesar Sereseres, Prof. Al Valdez, Prof. Charles O'Connel, Prof. Carter Butts... these are only but a few of the AMAZING faculty we have in the Sociology department. And THAT's just one department within the School of Social Sciences... GO SOCIAL SCIENCES!, 324026=If you are bored, even for one second at UC Irvine, you are doing it all wrong. UCI is a place for fun, learning, and involvement. http://www.uci.edu/features/2011/09/feature_bucketlist_110926.php This bucket list should be a requirement for graduation., 810798=Quarterly Undie run the weekend before finals. Shocktoberfest is a HUGE concert where we've had artists such as TYGA, Kendrick Llamar, etc.. Raggaefest is at the end of Spring Quarter where artist like The Expendables, Iration, Rebelution, and other top Reggae artists., 923332=The Academic rigor is slightly harsh. For English courses, you need to have good grammar in order to enroll to a low division writing class. Also, attendance is mandatory for many class such as Chemistry lab, writing, and discussions., 840202=eat around. and there's lots of beaches, huntington, newport, corona del mar, 22569=Study hard in high school and try to get at least a 3.7 GPA. Participate in as many extracurricular activities as you can. Try and score at least an 1850 in your SATs., 1141747=Brandywhine best place to eat lunch. Lot 5 is the temporary food for Mesa Court (Dorms) while they are building the new dorms and dinning hall (Complete in 2016 I think). Lot 5 has ok food, better than high school for sure. Pippins is in middle-earth(dorms) and has a larger variety, but might get extra protein from bugs in the food. They have panda, subway, wendys, a pub on campus and other dinning venues. Across the street is taco bell, chick-fila, chipotle, Cha, in-and-out, and other eateries. Overall the food on campus is ok, but across the street is best.}",
    "textBeforeTable": "07/07/2009 Reviewer is A current student here. 64 out of 65 people found this review useful. 1 person found it offensive. 1 person found this inaccurate. 1 of 262 Alina from Torrance, CA Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove',",
    "textAfterTable": "Login to rate or flag the reviews Emi from Temecula, CA 08/25/2009 Reviewer is A current student here. 25 out of 25 people found this review useful. 2 of 262 Categories Comments Great for these types of students This school is great for a student looking for a top-notch education. Yes, you can still have fun but it's also good to be studious. There are a lot of Bio Sci Majors at UCI and there are a lot of Engineering Majors, but that doesn't mean the English or Drama Major cannot get his/her moneys worth at this school. It is a very well-rounded school that not many people know about so take the time to research it. Our sports teams are excellent with some of the top in the nation, yet no one seems to know these things. Tips for prospective students My number one tip is to work hard in high school and to keep that up all the way through until high school is over. There is never a time for slacking off or letting yourself get behind.",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}