{
    "relation": [
        [
            "Categories",
            "Clubs and Activities",
            "Great for these types of students",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students"
        ],
        [
            "Comments",
            "They have everything, and, if they happen to not, just make the club.",
            "Those who do not want to spend all their time studying, but still want a good education.",
            "Food is great, and an expansive amount of choices.",
            "I have seen most of the dorms, and they are all very comfortable and quaint, however some of the bathrooms are less than clean. The life seems enjoyable, nonetheless, with easy-going students.",
            "Not an easy-slide school, but it won't burn you out either.",
            "Get to know your admissions person and really see if this is the school for you."
        ]
    ],
    "pageTitle": "Lawrence University Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Lawrence-University/reviews?_escaped_fragment_=/show/86235",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989891.18/warc/CC-MAIN-20150728002309-00093-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 891186795,
    "recordOffset": 891138087,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{64535=LU was rated the 18th most rigorous college in the US in 2011, beating out Yale, Princeton, and Stanford. It's tough, but worth it., 19546=Never once have I felt unsafe, even walking across campus in the middle of winter at 4:30 AM., 59431=Oktoberfest takes over College Avenue every year, and is extremely well-attended by students. Lawrence students participate heavily in the Midwest Trivia Contest, which is an experience that can not be explained in writing. LUaRoo is a mini-music festival held each spring, and popular campus bands as well as outside acts are invited to play. My favorite tradition is senior streak, in which the senior class attends a final Senior Night at the Viking Room in June and then collectively streak through campus. Underclassmen often line the exit of the VR to cheer on their friends. The one famous location on campus is the large steeple/tower on top of Main Hall that is featured in the majority of photos of the campus. To students this structure is known as the Nipple of Knowledge., 163755=© 2015, Cappex.com, LLC, 90599=Lawrence is very academically challenging. In 2011, we ranked 18th in most rigorous U.S. colleges, right under Harvard, and above Yale, Princeton, and Stanford. Also, the 10 week trimester makes things a little bit harder as well - time will go by so fast, you have to work hard to understand the materials in classes in very little time. However, you will learn how to work effectively and manage your time. The professors at Lawrence are very understanding and supportive as well. They are always willing to help their students, and really want to see their students succeed. Thus, be diligent, and you will be fine., 54654=It's Wisconsin, and it's cold. It isn't terrible (though this winter - 2014 - has been unusually bad) because it means that you have to be very productive. When there's no incentive to go outside, you're more likely to do your homework inside. Bring layers and something to cover your face, that's the part that is the most uncomfortable when it's exposed.}",
    "textBeforeTable": "08/05/2009 Reviewer is A current student here. 45 out of 47 people found this review useful. 1 of 30 Grace from South Orange, NJ Check out reviews left by other students or leave your own review. You could win a free scholarship. Lawrence University Reviews Lawrence University › Wisconsin › By State › Colleges › } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.create', -->",
    "textAfterTable": "Bang for the buck Its expensive, but worth it. Will enjoy being here A huge turn off is the weather. Lawrence is right on a river so the wind chill is crazy. That being said, Appleton is a fun town. Personally I think its really cool that such a small town gets Broadway tours just like a big city. Will learn a lot My mom went to Lawrence and she and all of her classmates are amazing, intelligent people that have gone far. My mom has her PhD and has a friend in the Bankok Orchestra. Whenever I have gone to the campus, I've really loved that they have the conservatory of music integrated into the rest of the school. My mom was a pre-med major with a minor in theatre and that isn't uncommon. A girl from my town who is a freshman there now says it hasn't changed. She's currently doing freshman seminars, where a physics professor is studying the Odyssey with them with a totally different perspective that a Lit professor. Login to rate or flag the reviews Alexander from Wausau, WI",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}