{
    "relation": [
        [
            "Categories",
            "Campus Safety",
            "Greek Life",
            "Clubs and Activities",
            "Great for these types of students",
            "Share any unusual traditions or locations on campus",
            "Bang for the buck",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "We have the safest campus in the PAC 12 and the blue lights help. I always feel safe on campus.",
            "I don't partake",
            "If you want something you can find it here.",
            "Students who like to be involved in a large community and don't mind not having a city super close. Portland is an hour and a half away and Eugene isn't big.",
            "I'm not really sure there are any.",
            "It's a state school, I pay the same here I would pay to go to school in state which is nice. I think what I pay makes sense in the economy at whatever but I don't think everything is a 30 thousand dollar school",
            "The campus has lots of things to do and Corvallis has it's charm. Less to do than in a major city but it's a college town.",
            "Very typical dorm/college/cafeteria type food but they always have vegetarian options and it is affordable.",
            "McNary is pretty sketch... But some of the other dorms are great. I encourage people to research the dorms.",
            "So far academics have been easy here for me. But I am taking mostly general core classes.",
            "Apply early, visit the school, be sure that this is where you will be happiest. Even the greatest school isn't the right one if you aren't happy.",
            "Oregon State offers a wonderful campus environment. It has top of the line facilities with professors who are very skilled. Plus it's got a great D1 College Life feel."
        ]
    ],
    "pageTitle": "Oregon State University Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Oregon-State-University/reviews?_escaped_fragment_=/show/82436",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 125,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989891.18/warc/CC-MAIN-20150728002309-00034-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 908927323,
    "recordOffset": 908777207,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{516325=Here's a weird thing: No shave November..., 306022=I give it four stars mostly because of food quality. Food options aren't all that great, but food from the dining halls are relatively cheap and taste good. The most expensive options are in the MU (Togo's, Carl's Jr., Panda Express), but you can also find Bueno's Burritos which gives you a massive burrito for really cheap, plus there's hardly ever a long line, even at 12:30 PM on a weekday., 671018=Its winner of the prestigious 2009 Ivy Award. There are multifaceted food service operation that provides meals and services to the campus community. The campus welcomes all students, faculty and staff to dine in our three dining facilities. We offer menu selections that will meet dietary and budgetary needs of any guest. In addition, residential meal plans also accept Visa and Master Card, OSU Card Cash, checks and cash. The catering department provides all types of services from the simple coffee service to the extravagant wedding event., 851809=© 2015, Cappex.com, LLC, 288935=I have only tried the food once during a tour we did during December, and that was very good!, 226404=Apply for as many scholarships as possible. FAFSA is so important to do January of your senior year. And i'd say just to study hard and do your best on tests in high school.}",
    "textBeforeTable": "06/05/2009 Reviewer is Accepted here and planning to attend soon. Reviewer has been to campus. 41 out of 46 people found this review useful. 1 of 194 James from Cedar Knolls, NJ Check out reviews left by other students or leave your own review. You could win a free scholarship. Oregon State University Reviews Oregon State University › Oregon › By State › Colleges › } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.create',",
    "textAfterTable": "Am learning a lot Some of my teachers simply did not teach in a style that worked for me. Sometimes even the information I learned in classes I found to be completely irrelevant and worthless to my learning needs. It took a long time to adjust and honestly I would have to say high school did not prepare us enough for the change. When sitting in lectures with 200+ students in them you can find yourself easily distracted, especially when you do not always get the chance to ask questions if you are confused or understand what you are doing wrong. Fortunately once you learn how to affectively use your time it will become easier to adapt your learning style and use the resources available to you. Login to rate or flag the reviews Michelle from Auburn, WA 07/27/2009 Reviewer is A current student here. 20 out of 20 people found this review useful. 3 of 194 Categories Comments Great for these types of students There is more of an emphasis on",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}