{
    "relation": [
        [
            "Categories",
            "What to do for fun",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "nothing",
            "none",
            "easy",
            "dont come here",
            "very boring. i hate it. would do anything to transfer sooner."
        ]
    ],
    "pageTitle": "The Community College of Baltimore County Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/The-Community-College-of-Baltimore-County/reviews?_escaped_fragment_=/show/12571",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989891.18/warc/CC-MAIN-20150728002309-00316-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 904779375,
    "recordOffset": 904713423,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{221291=I am very excited to begin classes on October 17th., 221927=I am registered to attend classes at The Community College of Baltimore County in Catonsville, Maryland. I am impressed with the customer services provided by the Financial Aid, Registration and the Advising offices. I was encouraged to attend this college through on of the instructors of the Workforce program I am currently enrolled in at the college. I am excited for the opportunity to attend school and can hardly wait to start classes on October 17th., 297450=i would get refunds checks up to 1000 for your pocket or to continue to invest for school. it helped some of my peers buy new cars, electronics and any other items needed., 401966=© 2015, Cappex.com, LLC}",
    "textBeforeTable": "10/04/2010 Reviewer is A current student here. 4 out of 4 people found this review useful. 1 of 105 Mikea from Owings Mills, MD Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new",
    "textAfterTable": "Login to rate or flag the reviews Shannie from Perry Hall, MD 07/18/2011 Reviewer is A current student here. 2 out of 3 people found this review useful. 2 of 105 Categories Comments Tips for prospective students Do not get caught up in the fact that you know a lot of the student body if you are a baltimore county student; there are a lot fo parties. Login to rate or flag the reviews Daitoine from Windsor Mill, MD 02/01/2012 Reviewer is A current student here. 2 out of 2 people found this review useful. 3 of 105 Categories Comments What to do for fun go to the exercise room to lift weights or hang with friends around the campus.",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}