{
    "relation": [
        [
            "Patent application number",
            "20100114663",
            "20100114665",
            "20100114992"
        ],
        [
            "Description",
            "HYBRID PREDICTION MODEL FOR A SALES PROSPECTOR - Systems and methods provide a system for generating a sales prospect recommendation that uses demographic data to make a sales prospect recommendation that includes a product recommendation with a probability that the sale will close, and may include an estimated time to close the sale and projected revenue. The system imports customer data including past purchasing data and demographic data for a plurality of customers. The system can then generate a predictive model by training the model using the past purchasing data and the demographic data. When queried for a sales prospect recommendation, the system responds to the query with at least one sales prospect recommended by the predictive model.",
            "CUSTOMER REFERENCE GENERATOR - A system generates a customer reference recommendation based on similarity to other customers. The system includes a customer data file including demographic data and purchasing pattern data for a plurality of customers, a first cluster model trained on the demographic data, and a second cluster model trained on the purchasing pattern data. A customer reference generator produces a customer reference recommendation based on cluster membership in the first and second cluster models in response to a query from a user interface.",
            "DATA IMPORTER FOR A SALES PROSPECTOR - A data importer for a sales prospecting system imports one or more data tables that each may include one or more records. The data importer first (a) imports a data table into an intermediate table. The data importer then (b) determines if the imported data table depends on another data table and moves one or more records from the imported data table that have no missing dependencies to a corresponding working table; and (c) determines a set of previously imported data tables that refer to the imported data table. The data importer then, for each previously imported data table, repeats (b) and (c) above."
        ],
        [
            "Published",
            "05-06-2010",
            "05-06-2010",
            "05-06-2010"
        ]
    ],
    "pageTitle": "Campos, US - Patent applications",
    "title": "",
    "url": "http://www.faqs.org/patents/inventor/campos-us-5/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989891.18/warc/CC-MAIN-20150728002309-00018-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 439091215,
    "recordOffset": 439071287,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{55704=Patent applications by Michael Campos, Sylmar, CA US}",
    "textBeforeTable": "Marcos Campos, Billerica, MA US 07-01-2010 SYSTEM AND METHOD FOR ASSET BILLING RECONCILIATION MANAGEMENT - An approach is provided that includes assigning a unique identification to each individual of a plurality of individuals, compiling hierarchical data relating the individuals to each other, and collecting service data from one or more service providers relating to the plurality of individuals assigned with unique identifications, where the service data includes service charges associated with services provided to the plurality of individuals. Additionally, the hierarchical data and the service data are merged using the unique identifications to generate a table of service charges of the plurality of individuals in a hierarchical format. 20100169135 Published Description Patent application number Marc Campos, Lockport, NY US 03-17-2011 Encapsulation architectures for utilizing flexible barrier films - An article and method of using spacer layer regions is provided, containing a gas compound, to reduce gas permeation through barrier films overlying a substrate comprising creating a spacer layer between one or more of the barrier films, wherein the spacer layer comprises at least one inert gaseous compound. In another embodiment, an article and method is provided comprising creating alternating thin films of hybridized sol-gel spin-on glass and PDMS based and olefin based elastomers. 20110062603 04-16-2009 METHOD FOR NON-DESTRUCTIVE PATTERNING OF PHOTONIC CRYSTALS EMPLOYED FOR SOLID-STATE LIGHT EXTRACTION - A method for patterning metal oxides or ceramics on surfaces, and more particularly, a",
    "textAfterTable": "Marcos M Campos, La Jolla, CA US Patent application number Description Published 20140280143 PARTITIONING A GRAPH BY ITERATIVELY EXCLUDING EDGES - Methods, machines, and stored instructions are provided for partitioning a graph of nodes into clusters of nodes by iteratively excluding edges in the graph. For each node of at least a subset of nodes in the graph, a graph partitioning module determines whether to exclude edges for the node and, if so, selects for exclusion edge(s) to at least a subset of the node's neighbor(s). The module selects edge(s) to the node's neighbor(s) for exclusion based at least in part on a degree of overlap between the node's neighbor(s) and neighbor(s) of the node's neighbor(s). For any subset(s) that are yet not sufficiently partitioned into clusters, the module repeats the step of determining whether to exclude edges and, if so, selecting nodes for exclusion, and determining whether or not the nodes are sufficiently partitioned. Subset(s) of nodes that are already sufficiently partitioned may be skipped during the repeated steps. 09-18-2014 Marcos M. Campos, Billerica, MA US Patent application number Description Published 20090276403 PROJECTION MINING FOR ADVANCED RECOMMENDATION SYSTEMS AND DATA MINING - A method for projection mining comprises performing a first projection on a first data object of a first type comprising a plurality of data entries and a second data object of a second type comprising a plurality",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}