{
    "relation": [
        [
            "Citing Patent",
            "US7555637",
            "US7584461 *",
            "US7617383",
            "US7810080",
            "US7818729",
            "US7856624",
            "US7934075 *",
            "US8477383 *",
            "US8869123",
            "US20050097535 *",
            "US20100309511 *",
            "US20110185152 *",
            "EP2605105A2",
            "EP2808802A2"
        ],
        [
            "Filing date",
            "27 Apr 2007",
            "15 Oct 2004",
            "11 Aug 2006",
            "2 Nov 2005",
            "23 Jun 2006",
            "6 May 2005",
            "26 May 2006",
            "30 Apr 2010",
            "23 Mar 2012",
            "15 Oct 2004",
            "",
            "",
            "14 Dec 2012",
            "2 May 2014"
        ],
        [
            "Publication date",
            "30 Jun 2009",
            "1 Sep 2009",
            "10 Nov 2009",
            "5 Oct 2010",
            "19 Oct 2010",
            "21 Dec 2010",
            "26 Apr 2011",
            "2 Jul 2013",
            "21 Oct 2014",
            "5 May 2005",
            "9 Dec 2010",
            "28 Jul 2011",
            "19 Jun 2013",
            "3 Dec 2014"
        ],
        [
            "Applicant",
            "Vns Portfolio Llc",
            "Plum Thomas S",
            "Vns Portfolio Llc",
            "Thomas Plum",
            "Thomas Plum",
            "Thomas Plum",
            "Vns Portfolio Llc",
            "Canon Kabushiki Kaisha",
            "Robert Keith Mykland",
            "Plum Thomas S.",
            "Canon Kabushiki Kaisha",
            "Fujitsu Semiconductor Limited",
            "SRC Computers, LLC",
            "SRC Computers, LLC"
        ],
        [
            "Title",
            "Multi-port read/write operations based on register bits set for indicating select ports and transfer directions",
            "Automated safe secure techniques for eliminating undefined behavior in computer software",
            "Circular register arrays of a computer",
            "Automated safe secure techniques for eliminating undefined behavior in computer software",
            "Automated safe secure techniques for eliminating undefined behavior in computer software",
            "Automated safe secure techniques for eliminating undefined behavior in computer software",
            "Method and apparatus for monitoring inputs to an asyncrhonous, homogenous, reconfigurable computer array",
            "Processing based on command and register",
            "System and method for applying a sequence of operations code to program configurable logic circuitry",
            "Automated safe secure techniques for eliminating undefined behavior in computer software",
            "Image processing apparatus and control method thereof, computer-readable storage medium",
            "Reconfigurable circuit and semiconductor integrated circuit",
            "Mobile electronic devices utilizing reconfigurable processing techniques to enable higher speed applications with lowered power consumption",
            "Multi-processor computer architecture incorporating distributed multi-ported common memory modules"
        ]
    ],
    "pageTitle": "Patent US7155602 - Interface for integrating reconfigurable processors into a general purpose ... - Google Patents",
    "title": "",
    "url": "http://www.google.com.au/patents/US7155602",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989891.18/warc/CC-MAIN-20150728002309-00285-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 482616287,
    "recordOffset": 482577340,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{20768=This application claims the benefit of U.S. Provisional Patent Application No. 60/286,979 filed Apr. 30, 2001, and entitled “Delivering Acceleration: The Potential for Increased HPC Application Performance Using Reconfigurable Logic,” which is hereby incorporated by reference in its entirety., 96644=Multiple Data Register Load/Store Commands are two-word commands using 32-bit immediate values. The first word contains the command data and the second word contains immediate values for the data registers (i.e. bit2 is applied to DR2, bit3 to DR3 . . . , bit31 to DR31). Any of the data registers can be moved to/from on-board memory. Each 1 bit in the immediate value enables the corresponding data register to be loaded or stored. Each Data register that has a corresponding 0 bit is ignored. The data in on-board memory is packed/compressed. (For example, if the immediate value has only two 1 bits corresponding to DR3 and DR10 and the on-board memory address is 1000 in a store operation, then DR3 is stored in on-board memory in word 1000 and DR10 is stored in 1001.)}",
    "textBeforeTable": "Patent Citations It will be apparent to those skilled in the art that various modifications and variations can be made in the interface for integrating reconfigurable processors without departing from the spirit or scope of the invention. Thus, it is intended that the present invention covers the modifications and variations of this invention provided that they come within the scope of any claims and their equivalents. Contu on Error should normally be used only in a diagnostic or maintenance mode. The expected defaults for Bit Parameters 0, 1, and 2 are the zero-values. The Interrupt ID parameter need not be valid if interrupts are disabled. Page Table Base must be valid and point to an end-of-table entry. Page Table Physical address of 00–39 Page Table Base 10 interrupt ID number of processor to 32–41 Interrupt ID 7 Maintenance 2 6 Maintenance 1 corrected error 1-Halt execution if",
    "textAfterTable": "US6434687 * 22 Jun 2001 13 Aug 2002 Src Computers, Inc. System and method for accelerating web site access and processing utilizing a computer system incorporating reconfigurable processors operating under a single operating system image US6438737 * 15 Feb 2000 20 Aug 2002 Intel Corporation Reconfigurable logic for a computer US6542998 * 6 Aug 1999 1 Apr 2003 Pact Gmbh Method of self-synchronization of configurable elements of a programmable module US6564179 * 26 Jul 1999 13 May 2003 Agere Systems Inc. DSP emulating a microcontroller US6753925 * 30 Mar 2001 22 Jun 2004 Tektronix, Inc. Audio/video processing engine US6825698 * 26 Aug 2002 30 Nov 2004 Altera Corporation Programmable high speed I/O interface US6859869 * 12 Apr 1999 22 Feb 2005 Pact Xpp Technologies Ag Data processing system",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}