{
    "relation": [
        [
            "제목",
            "Intelligent Bioinformatics: The Application of Artificial Intelligence Techniques to Bioinformatics Problems",
            "Handbook of Toxicogenomics: Strategies and Applications",
            "Functional Metabolism: Regulation and Adaptation",
            "Analyzing Microarray Gene Expression Data",
            "Bioinformatics and Functional Genomics",
            "Data Mining: Multimedia, Soft Computing, and Bioinformatics"
        ],
        [
            "저자",
            "Edward Keedwell, Ajit Narayanan",
            "Jurgen Borlak",
            "Kenneth B. Storey",
            "Geoffrey J. McLachlan, Kim-Anh Do, Christophe Ambroise",
            "Jonathan Pevsner",
            "Sushmita Mitra, Tinku Acharya"
        ],
        [
            "형태 / 출판일",
            "Hardcover, June 2005",
            "Hardcover, March 2005",
            "E-Book, February 2005",
            "E-Book, February 2005",
            "E-Book, February 2005",
            "E-Book, January 2005"
        ]
    ],
    "pageTitle": "[BBON] 생물정보학 뉴스레터 Vol 1/4, 2005 > BRIC",
    "title": "",
    "url": "http://www.ibric.org/myboard/read.php?id=65&Page=11&Board=report&FindIt=&FindText=",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 125,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042992543.60/warc/CC-MAIN-20150728002312-00066-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 504968175,
    "recordOffset": 504919927,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{16877=9. The Plant Cell 저널의 Functional Genomics Collection GENE IDENTIFICATION (September 1999 ~ anuary 2001) http://www.plantcell.org/misc/papers1.shtml}",
    "TableContextTimeStampAfterTable": "{199737=5. 국외: Bioinformatics 2005 21(10):2264-2270 Prediction of protein interdomain linker regions by a hidden Markov model Kyounghwa Bae 1, Bani K. Mallick 1 and Christine G. Elsik 2,* 1Department of Statistics, Texas A&M University College Station, TX 77843-3143, USA 2Department of Animal Science and Intercollegiate Faculty of Genetics, Texas A&M University College Station, TX 77843-2471, USA Motivation: Our aim was to predict protein interdomain linker regions using sequence alone, without requiring known homology. Identifying linker regions will delineate domain boundaries, and can be used to computationally dissect proteins into domains prior to clustering them into families. We developed a hidden Markov model of linker/non-linker sequence regions using a linker index derived from amino acid propensity. We employed an efficient Bayesian estimation of the model using Markov Chain Monte Carlo, Gibbs sampling in particular, to simulate parameters from the posteriors. Our model recognizes sequence data to be continuous rather than categorical, and generates a probabilistic output. Results: We applied our method to a dataset of protein sequences in which domains and interdomain linkers had been delineated using the Pfam-A database. The prediction results are superior to a simpler method that also uses linker index. Contact: c-elsik@tamu.edu Supplementary information: http://racerx00.tamu.edu/kbae, 187549=15832365, 197857=4. 국외 : Bioinformatics 2005 21(10):2514-2516 PLATCOM: a Platform for Computational Comparative Genomics Kwangmin Choi 1, Yu Ma 2, Jeong-Heyon Choi 1 and Sun Kim 1,3,* 1School of Informatics, Indiana University Bloomington, IN 47404, USA 2Department of Computer Science, Indiana University Bloomington, IN 47404, USA 3Center for Genomics and Bioinformatics, Indiana University Bloomington, IN 47404, USA Motivation: As more whole genome sequences become available, comparing multiple genomes at the sequence level can provide insight into new biological discovery. However, there are significant challenges for genome comparison. The challenge includes requirement for computational resources owing to the large volume of genome data. More importantly, since the choice of genomes to be compared is entirely subjective, there are too many choices for genome comparison. For these reasons, there is pressing need for bioinformatics systems for comparing multiple genomes where users can choose genomes to be compared freely. Results: PLATCOM (Platform for Computational Comparative Genomics) is an integrated system for the comparative analysis of multiple genomes. The system is built on several public databases and a suite of genome analysis applications are provided as exemplary genome data mining tools over these internal databases. Researchers are able to visually investigate genomic sequence similarities, conserved gene neighborhoods, conserved metabolic pathways and putative gene fusion events among a set of selected multiple genomes. Availability: http://platcom.informatics.indiana.edu/platcom Contact: sunkim2@indiana.edu; kwchoi@indiana.edu, 201317=6. 카톨릭의대 정현준 박사(Bioinformatics 2005 21(10):2554-2555) ArrayCyGHt: a web application for analysis and visualization of array-CGH data Su Young Kim 1,2, Suk Woo Nam 1,2, Sug Hyung Lee 1,2, Won Sang Park 1,2, Nam Jin Yoo 1,2, Jung Young Lee 1,2 and Yeun-Jun Chung 3,* 1Microdissection Genomics Research Center, The Catholic University of Korea Seoul, 137-701, Republic of Korea 2Department of Pathology, The Catholic University of Korea Seoul, 137-701, Republic of Korea 3Department of Microbiology, College of Medicine, The Catholic University of Korea Seoul, 137-701, Republic of Korea Summary: ArrayCyGHt is a web-based application tool for analysis and visualization of microarray-comparative genomic hybridization (array-CGH) data. Full process of array-CGH data analysis, from normalization of raw data to the final visualization of copy number gain or loss, can be straightforwardly achieved on this arrayCyGHt system without the use of any further software. ArrayCyGHt, therefore, provides an easy and fast tool for the analysis of copy number aberrations in any kinds of data format. Availability: ArrayCyGHt can be accessed at http://genomics.catholic.ac.kr/arrayCGH/ Contact: yejun@catholic.ac.kr Supplementary information: Technical documentation is available. See http://genomics.catholic.ac.kr/arrayCGH/ 3. 국외 뉴스 5월 주요 국외 뉴스 클리핑 (자료출처: http://science.bio.org, 주요 저널에 발표된 성과 중심), 259680=3. 인간의 다양성은 개인적인 유전적인 차이보다는 지놈의 구조적인 차이에 기인했을지도... Nature 435, 252-253 (19 May 2005) | doi: 10.1038/435252b, 191415=1. 서울대 장병탁 박사(Bioinformatics 2005 21(9):2116-2117) CrossChip: a system supporting comparative analysis of different generations of Affymetrix arrays Sek Won Kong 1,2,*, , Kyu-Baek Hwang 3, , Richard D. Kim 4, Byoung-Tak Zhang 3, Steven A. Greenberg 5,6, Isaac S. Kohane 4,6 and Peter J. Park 4,6 1Bauer Center for Genomics Research, Harvard University Cambridge, MA, USA 2Molecular Medicine, Beth Israel Deaconess Medical Center Boston, MA, USA 3School of Computer Science and Engineering, Seoul National University Korea 4Harvard-Partners Center for Genetics and Genomics Boston, MA, USA 5Department of Neurology, Brigham and Women's Hospital Boston, MA, USA 6Children's Hospital Informatics Program Boston, MA, USA Summary: To increase compatibility between different generations of Affymetrix GeneChip arrays, we propose a method of filtering probes based on their sequences. Our method is implemented as a web-based service for downloading necessary materials for converting the raw data files (*.CEL) for comparative analysis. The user can specify the appropriate level of filtering by setting the criteria for the minimum overlap length between probe sequences and the minimum number of usable probe pairs per probe set. Our website supports a within-species comparison for human and mouse GeneChip arrays. Availability: http://www.crosschip.org Contact: skong@cgr.harvard.edu, 242217=2. Bioinformatics 2005 21(11):2791-2793 VariScan: Analysis of evolutionary patterns from large-scale DNA sequence polymorphism data The software: (1) can conduct many population genetic analyses; (2) incorporates a multiresolution wavelet transform-based method that allows capturing relevant information from DNA polymorphism data; and (3) it facilitates the visualization of the results in the most commonly used genome browsers. 자료: http://www.ub.es/softevol/variscan, 192971=2. KAIST 이도헌 박사(Bioinformatics 2005 21(9):1927-1934) Detecting clusters of different geometrical shapes in microarray gene expression data Dae-Won Kim 1, Kwang H. Lee 1,2 and Doheon Lee 1,* 1Department of BioSystems and Advanced Information Technology Research Center, Korea Advanced Institute of Science and Technology 373?1 Guseong-dong, Yuseong-gu, Daejeon, 305?701, Korea 2Department of Electrical Engineering and Computer Science, Korea Advanced Institute of Science and Technology 373?1 Guseong-dong, Yuseong-gu, Daejeon, 305?701, Korea Motivation: Clustering has been used as a popular technique for finding groups of genes that show similar expression patterns under multiple experimental conditions. Many clustering methods have been proposed for clustering gene-expression data, including the hierarchical clustering, k-means clustering and self-organizing map (SOM). However, the conventional methods are limited to identify different shapes of clusters because they use a fixed distance norm when calculating the distance between genes. The fixed distance norm imposes a fixed geometrical shape on the clusters regardless of the actual data distribution. Thus, different distance norms are required for handling the different shapes of clusters. Results: We present the Gustafson?Kessel (GK) clustering method for microarray gene-expression data. To detect clusters of different shapes in a dataset, we use an adaptive distance norm that is calculated by a fuzzy covariance matrix (F) of each cluster in which the eigenstructure of F is used as an indicator of the shape of the cluster. Moreover, the GK method is less prone to falling into local minima than the k-means and SOM because it makes decisions through the use of membership degrees of a gene to clusters. The algorithmic procedure is accomplished by the alternating optimization technique, which iteratively improves a sequence of sets of clusters until no further improvement is possible. To test the performance of the GK method, we applied the GK method and well-known conventional methods to three recently published yeast datasets, and compared the performance of each method using the Saccharomyces Genome Database annotations. The clustering results of the GK method are more significantly relevant to the biological annotations than those of the other methods, demonstrating its effectiveness and potential for clustering gene-expression data. Availability: The software was developed using Java language, and can be executed on the platforms that JVM (Java Virtual Machine) is running. It is available from the authors upon request. Contact: dhlee@bisl.kaist.ac.kr Supplementary information: Supplementary data are available at http://dragon.kaist.ac.kr/gk, 195880=3. 국가유전체정보센터 박종화 박사(Bioinformatics 2005 21(10):2541-2543) PSIbase: a database of Protein Structural Interactome map (PSIMAP) Sungsam Gong 1, Giseok Yoon 2, Insoo Jang 3, Dan Bolser 4, Panos Dafas 5, Michael Schroeder 6, Hansol Choi 1, Yoobok Cho 2, Kyungsook Han 7, Sunghoon Lee 3, Hwanho Choi 1, Michael Lappe 8, Liisa Holm 9, Sangsoo Kim 3, Donghoon Oh 2 and Jonghwa Bhak 1,2,3,10,* 1Biomatics Lab, Department of BioSystems, KAIST Daejeon, Korea 2OITEK Daejeon, Korea 3NGIC, KRIBB Daejeon, Korea 4MRC-DUNN Cambridge, UK 5City University London, UK 6Biotechnologisches Zentrum TU Dresden, Germany 7Inha University Incheon, Korea 8Max Planck Institute for Molecular Genetics Berlin, Germany 9Helsinki University Finland 10BiO Centre, KAIST Daejeon, Korea Summary: Protein Structural Interactome map (PSIMAP) is a global interaction map that describes domain?domain and protein?protein interaction information for known Protein Data Bank structures. It calculates the Euclidean distance to determine interactions between possible pairs of structural domains in proteins. PSIbase is a database and file server for protein structural interaction information calculated by the PSIMAP algorithm. PSIbase also provides an easy-to-use protein domain assignment module, interaction navigation and visual tools. Users can retrieve possible interaction partners of their proteins of interests if a significant homology assignment is made with their query sequences. Availability: http://psimap.org and http://psibase.kaist.ac.kr/ Contact: biopark@kaist.ac.kr Supplementary information: Supplementary material is available at http://psibase.kaist.ac.kr/Doc/supplementary_material.htm}",
    "textBeforeTable": "5월 Bioinformatics 저널에 발표된 국내 연구자 논문 1. 서울대 장병탁 박사(Bioinformatics 2005 21(9):2116-2117) CrossChip: a system supporting comparative analysis of different generations of Affymetrix arrays Sek Won Kong 1,2,*, , Kyu-Baek Hwang 3, , Richard D. Kim 4, Byoung-Tak Zhang 3, Steven A. Greenberg 5,6, Isaac S. Kohane 4,6 and Peter J. Park 4,6 1Bauer Center for Genomics Research, Harvard University Cambridge, MA, USA 2Molecular Medicine, Beth Israel Deaconess Medical Center Boston, MA, USA 3School of Computer Science and Engineering, Seoul National University Korea 4Harvard-Partners Center for Genetics and Genomics Boston, MA, USA 5Department of Neurology, Brigham and Women's Hospital Boston, MA, USA 6Children's Hospital Informatics Program Boston, MA, USA Summary: To increase compatibility between different generations of Affymetrix GeneChip arrays, we propose a method of filtering probes based on their sequences. Our method is implemented as a web-based service for downloading necessary materials for converting the raw data files (*.CEL) for comparative analysis. The user can specify the appropriate level of filtering by setting the criteria for the minimum overlap length between probe sequences and the minimum number of usable probe pairs per probe set. Our website supports a within-species comparison for human and mouse GeneChip arrays. Availability: http://www.crosschip.org Contact: skong@cgr.harvard.edu 2. KAIST 이도헌 박사(Bioinformatics 2005 21(9):1927-1934) Detecting clusters of different geometrical shapes in microarray gene expression data Dae-Won Kim 1, Kwang H. Lee 1,2 and Doheon Lee 1,* 1Department",
    "textAfterTable": "5월 12일 Bioinformatics in Computer-Aided Drug Design (B-EYE-Network) 5월 12일 A Scan for Positively Selected Genes in the Genomes of Humans and Chimpanzees (PLoS Biology) 5월 11일 FDA Approves First DNA-based Test to Detect Cystic Fibrosis (FDA) 5월 11일 Program finds lost genes in nematode genome (Washington University in St. Louis) 5월 10일 New genome project, new controversy (The Scientist) 5월 09일 Researchers Develop Promising New Gene Network Analysis Method (Brown University) 5월 06일 Celera to End Subscriptions and Give Data to Public GenBank (Science) 5월 06일 Functional Genomic Analysis of the Wnt-Wingless Signaling Pathway (Science) 5월 05일 A genome-wide scalable SNP genotyping assay using microarray technology (Nature Genetics) 5월 05일 Mutation accumulation of the transcriptome (Nature Genetics) 5월 04일 Biologists Determine Genetic Blueprint Of Social Amoeba (University of California - San Diego) 5월 02일 Planarians enter the genomic era (The Scientist) 참고: 주요 유전자은행 소식",
    "hasKeyColumn": true,
    "keyColumnIndex": 1,
    "headerRowIndex": 0
}