{
    "relation": [
        [
            "Name",
            "ID field",
            "Name field"
        ],
        [
            "Description",
            "The identifier for the port channel. Enter an integer between 1 and 256. This ID cannot be changed after the port channel has been saved.",
            "A user-defined name for the port channel. This name can be between 1 and 16 alphanumeric characters. You cannot use spaces or any special characters, and you cannot change this name after the object has been saved."
        ]
    ],
    "pageTitle": "Cisco UCS Manager GUI Configuration Guide, Release 1.4 - Configuring Ports [Cisco UCS Manager] - Cisco",
    "title": "",
    "url": "http://www.cisco.com/c/en/us/td/docs/unified_computing/ucs/sw/gui/config/guide/1-4/b_UCSM_GUI_Configuration_Guide_1_4/b_UCSM_GUI_Configuration_Guide_1_4_chapter_0101.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989891.18/warc/CC-MAIN-20150728002309-00172-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 365827707,
    "recordOffset": 365796457,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "In the Configure as Appliance Port dialog box, complete the following fields: Step 7   If Cisco UCS Manager GUI displays a confirmation dialog box, click Yes. Step 6   Right-click the selected port or ports and choose Configure as Appliance Port. Step 5   Click one or more of the ports under the Unconfigured Ethernet Ports node. If you want to reconfigure a server port, uplink Ethernet port, or FCoE storage port, expand the appropriate node. Step 4   Expansion Module Fixed Module Depending upon the location of the ports you want to configure, expand one of the following: Step 3   On the Equipment tab, expand Equipment > Fabric Interconnects > Fabric_Interconnect_Name. Step 2   In the Navigation pane, click the Equipment tab. Step 1   Procedure This task describes only",
    "textAfterTable": "bronze—Use this priority for vNIC traffic only. fc—Use this priority for vHBA traffic only. gold—Use this priority for vNIC traffic only. platinum—Use this priority for vNIC traffic only. silver—Use this priority for vNIC traffic only. Pin Group drop-down list The LAN pin group that you want to use as the appliance pin target to the specified fabric and port, or fabric and port channel Create LAN Pin Group link Click this link if you want to create a LAN pin group. Admin Speed field The data transfer rate for this port. Select the value that matches the destination to which the port is linked. This can be: 1Gbps 10Gbps Note   ",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}