{
    "relation": [
        [
            "Categories",
            "Campus Safety",
            "Greek Life",
            "Clubs and Activities",
            "Great for these types of students",
            "Share any unusual traditions or locations on campus",
            "Bang for the buck",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "Very safe campus but for bike theft. Unfortunately that is a problem at any college campus. Always lock up your bikes. Other than that, I leave my car/house unlocked in Golden.",
            "Both party types and dry frat. Some people like that kind of thing.",
            "All the typical clubs/activities at any college",
            "Hard workers, self motivated, intelligent.",
            "The geology museum on campus is world class, really. E-days (Engineering Days) is a three day booze party.",
            "The school can be pricy for out of staters, but it has been well worth while for me. I have an offer on the table for after I graduate for 6 figures. I will be able to pay off all my debt in just a few years.",
            "Study or go have fun int he mountains.",
            "Getting better every day. They recently opened up a Starbucks and a Subway on campus. The freshman dining gall is greatly improving as well with a brand new caterer.",
            "Lots of nerds, lots of video games. But if you like that kind of stuff, this would be for you.",
            "Come to Mines if you are interested in academic success, hard work, and getting a job after you graduate. Do not come to Mines if you want to party, have an easy 4 years and live with mom and dad while you work at Starbucks.",
            "A school with above all else a great reputation in industry. The coursework is difficult and may not be fore everyone, but most everyone who has made it through are glad they did. Bottom line: choose Mines if you are interested in getting a job after you graduate."
        ]
    ],
    "pageTitle": "Colorado School of Mines (CSM) Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Colorado-School-of-Mines/reviews?_escaped_fragment_=/show/89839",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042992543.60/warc/CC-MAIN-20150728002312-00047-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 921732279,
    "recordOffset": 921658990,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{296126=The food here is not very good. However, they are adding more food options starting spring semester 2015., 312852=© 2015, Cappex.com, LLC, 261095=E-DAYS! First week of April the school throws a concert and other fun things., 45114=as far as dorm life is concerned, the school of mines has many options and a great variety of student living. there are four traditional halls, which is 'traditional' living, meaning you have a roommate (note: you can live in your own room in the traditionals, it's just a limited option), there are community bathrooms, (sinks, toilets, and 4 private showers per floor). there are also many other options, including mines park (apartment-style living about a ten minute walk from campus, (still owned and policed by the school though)), weaver towers, (suite-style living, where you have up to 5 suite-mates, share a living area, 2 private bathrooms (with showers), and can live in a closet-sized space pretty much. and finally, there is maple hall, the brand new residence hall on campus, finished the summer of 2011 and in it's first year of use, (the academic year of fall 2011-spring 2012). in maple, there are many options, you can live by yourself in a single, live with another, (one roommate), or live in a suite, where you share a bathroom with two other suite mates, but they live on the other side of the bathroom., 98231=study up on your algebra, trigonometry, and if possible, calculus, before you start your freshman year. when you take physics 1, you will be surprised at how many integrals you have to do. also, don't think that you won't be writing just because the application doesn't require an essay. brush up on your grammar and spelling, because you will have to do quite a lot of writing just for the core classes., 59447=If you decide to become an engineering major then the School of Mines is definitely worth your money. You have a 14:1 teacher rating which means lots of 1 on 1 attention. The school is challenging, but well respected throughout the engineering world which is helpful in acquiring jobs after college., 35818=In my opinion this is where Mines really needs a lot of improvement. The school is terribly expensive, and while there are quite a few scholarships available from the school it is still much to high priced. The main reason that I don't feel that it is worth as much a I am paying is because monetary waste can be seen all over campus, from brand new landscaping around the president's house as tuition goes up $1000 a semester to the absurd amount of vice-presidents and the huge mess of bureaucracy that slows everything down to a painfully slow crawl., 110307=Slate was TERRIBLE my freshman year (2007-2008), but I've heard that it has improved substantially with the new vendor., 235994=Entering in the Fall 2013 so am not able to rate this fairly but what I have seen and heard about dorm life it will be fine., 16267=I enjoy being at Mines because the school focuses on my favorite subjects, math and sciences. Its not like high school where the students are here just to be here, like other colleges; Mines students care about their education and what they get out of it when at school. Its true, the nerdy vibe that Mines gives off, but the environment encourages more than just studying. The campus is very open and the school itself wants the students to have a rounded life. On Thursday nights the school sponsors a movie night and the ORC rents out equipment for activities such as boarding, skiing, camping, and tubing. I live so close to the mountains now, every weekend I go up and board. The city of Golden is cute and very friendly, but there are several, i guess, entertainment areas near by such as Colorado Mills mall and Belmar shopping center.}",
    "textBeforeTable": "07/16/2009 Reviewer is A current student here. 26 out of 28 people found this review useful. 1 of 66 Krista from Colorado Springs, CO Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code",
    "textAfterTable": "Am enjoying being here Even though I just said that Mines is super hard, there really is a lot of fun to be had. There are so many clubs that a person can join, it made my head spin. The community in the dorms is tight knit and friendly. Even as a freshman living off campus, I find plenty of ways to have fun and hang out with other people. Am learning a lot I would definitely say I'm learning a lot. As is par with the idea of Mines being super hard and everyone always doing homework, there is always work to do and new material to be learned. The material is very interesting, though, and thoroughly engaging. Login to rate or flag the reviews Molly from Billings, MT 12/31/2009 Reviewer is A current student here. 6 out of 8 people found this review useful. 3 of 66 Categories Comments Great for these types of students Hard-working,",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}