{
    "relation": [
        [
            "Count",
            "1",
            "1",
            "1"
        ],
        [
            "Component",
            "",
            "",
            ""
        ],
        [
            "DateTime",
            "2007-01-01T00:00:00",
            "2008-04-28T00:00:00",
            "2009-07-20T00:00:00"
        ],
        [
            "Description",
            "HAMPTON TRACT, JUDY TRACT, LAKE WALES, PEACE RIVER (NORTH) The LiDAR data was acquired using a Leica ALS50 from an altitude of 1,000-meters above ground level to provide an average ground sample distance of 1-meter. The scanner field of view was 44-degrees, and the scan rate was 33-hertz. First and last return data was collected along with the signal return intensity. Two redundant airborne GPS bases stations were utilized during the data acquisition with maximum line-of-sight distance between the base station and aircraft of 20-km. The LiDAR data was reduced using Grafnav (Waypoint Consulting) for GPS post-processing, PosProc (Applanix Crop) for IMU processing, ALS50 Post Processor (LH Systems) to initial LiDAR processing, TerraScan (Terrasolid) for initial point classification, and proprietary Woolpert developed software for refining the point classification and QC. The LAS files contain 4 classifications: 1 = unclassified; 2 = ground; 9 = water; and 10 = photogrammetric mass points. The class 1 consists of all points not on the ground. Class 2 consists of bare earth points. Class 9 consists of points within water polygons such as swamps and/or wetlands. Class 10 consists of supplementary mass points that were photogrametrically compiled on points features such as as peaks or pits, and they were created to maintain the accuracy of the DTM. Process Date: 20060125 POLK REMAINDER The LiDAR data was acquired using a Leica ALS50 from an average altitude of 3,000-feet above ground level to provide an average ground sample distance of 3.3-feet. The scanner field of view was 44-degrees, and the scan rate was 33-hertz. First and last return data collected along with the signal return intensity. Two redundant airborne GPS bases stations were utilized during the data acquisition with maximum line-of-sight distance between the base station and aircraft of 20-km. The LiDAR data was reduced using Grafnav (Waypoint Consulting) for GPS post-processing, PosProc (Applanix Crop) for IMU processing, ALS50 Post Processor (LH Systems) to initial LiDAR processing, TerraScan (Terrasolid) for initial point classification, and proprietary Woolpert developed software for refining the point classification and QC. The LiDAR data was reviewed in 3D using a digital photogrammetric work station using ADS40 digital stereo imagery. The LiDAR ground points are adjusted, if needed, to fit the ground. Breaklines were added to hydrologically enforce the DTM. The edited LiDAR data and the photogrammetrically compiled breaklines are merged and processed to create the final DTM files. During the production process, LiDAR data gaps between the flight lines were observed. These gaps between flight lines were corrected by adding photogrammetrically compiled mass points. These points are classified as class 10, in the LAS file. In the areas with the compiled masspoints, it may be noted that the masspoints are not as dense the areas with complete LiDAR coverage. The masspoints were compiled at a sufficient density to define the surface to contract specifications. Anomalies were noted in the 2005 Peace River North and Hampton Tract LiDAR data, during the LiDAR QA/QC process for the 2007 Remainder Polk County Project. The 2005 LiDAR datasets for Peace River North (P692) and Hampton Tract (DO19) required additional processing to ensure correct ground points classification. In areas with gaps in the LiDAR coverage, photogrammetrically compiled masspoints were added to the surface data. The LAS files contain 5 classifications: 1 = unclassified; 2 = ground; 9 = water; 10 = photogrammetric masspoints; and 11 = swamp and/or wetlands. The class 1 consists of all points not considered to be ground. Class 2 consists of bare earth (ground) points. Class 9 consists of points within water polygons. Class 11 consists of point within swamps and/or wetlands. Class 10 consists of supplementary mass points that were photogrametrically compiled on points features such as peaks or pits, and LiDAR data gaps. These points were created to maintain the accuracy of the DTM. 3D breaklines were collected at the digital photogrammetric workstation during the LiDAR data review. These breaklines were delineated to insure the DTM is hydrologically correct. Hydrologically Enforced Elevation Data is defined as \"Hydro enforced TINS, DEMS, or contours ensure that top surfaces of bridges and culverts are cut by stream breaklines so that computer models will accurately represent drainage flow\" per FEMA's Appendix A A.4.10. The breaklines were collected for hydrologically significant features as appropriate to support the development of the generation of 2-foot contours meeting National Map Accuracy Standards. The following breakline features were classified and separated: Closed Water Body Features, Linear Hydrographic Features, Coastal Shorelines, Road Features, Soft Features, Obscured Vegetated Areas, Island Features, Overpasses, and Bridges. Per contract specifications, culverts were not collected as part of this project. Therefore continuity of hydrographic features may not be consistent. For a complete description of survey methods, processing methods, software, system parameters, and accuracy analysis, see the Florida MTS Report of Specific Purpose Survey, SWFWMD MTS Report of DOI Survey, FY2007 Digital LiDAR (L672) (dated 4/8/2008)).",
            "The NOAA Coastal Services Center (CSC) received the files in LAS format. The files contained Lidar elevation measurements. The data was in Florida State Plane Projection and NAVD88 vertical datum. CSC performed the following processing to the data to make it available within the LDART Retrieval Tool (LDART): 1. The data were converted from Florida State Plane West coordinates to geographic coordinates. 2. The data were converted from NAVD88 (orthometric) heights to GRS80 (ellipsoid) heights using Geoid 03. 3. The LAS data were sorted by latitude and the headers were updated.",
            "The NOAA National Geophysical Data Center (NGDC) received lidar data files via ftp transfer from the NOAA Coastal Services Center. The data are currently being served via NOAA CSC Digital Coast at http://www.csc.noaa.gov/digitalcoast/. The data can be used to re-populate the system. The data are archived in LAS or LAZ format. The LAS format is an industry standard for LiDAR data developed by the American Society of Photogrammetry and Remote Sensing (ASPRS); LAZ is a loseless compressed version of LAS developed by Martin Isenburg (http://www.laszip.org/). The data are exclusively in geographic coordinates (either NAD83 or ITRF94). The data are referenced vertically to the ellipsoid (either GRS80 or ITRF94), allowing for the ability to apply the most up to date geoid model when transforming to orthometric heights."
        ]
    ],
    "pageTitle": "Docucomp ISO19115Components-HTMLTable",
    "title": "",
    "url": "http://www.ngdc.noaa.gov/docucomp/page?xml=NOAA/NESDIS/NGDC/MGG/Lidar/iso/xml/2005_FL_SWFWMD_Polk_m71.xml&view=ISO19115Components-HTMLTable&altview=none",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989891.18/warc/CC-MAIN-20150728002309-00299-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 627335287,
    "recordOffset": 627324455,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "MD_DataIdentification Aggregation Info | Bands | Citations | Constraints | Coverage Descriptions | Dimensions | Extents | Formats | Geographic Bounding Box Georectified Information | Georeferenceable Information | Identifiers | Instruments | Mediums | OnlineResources | Operations Platforms | Process Steps | Range Elements | Reference Systems | Responsible Parties | Series | Sources | Spatial Grids | Temporal Extents Metadata Identifier: gov.noaa.csc.maps:2005_FL_SWFWMD_Polk_m71Get DataFAQHTML, 19139 XML Assess Metadata For: Completeness, DOI Readiness, CSW Readiness, Components ISO Table ViewBack to Collection NOAA/NESDIS/NGDC/MGG/Lidar View Metadata As: , , } background-color:#F0F0F0; th{ } empty-cells:show; table{",
    "textAfterTable": "Component Title Date Citation Identifier 1 2005-2006 Southwest Florida Water Management District (SWFWMD) Lidar: Polk County (Including Hampton, Judy, Lake Wales, Peace River (North), and Polk District Remainder Tracts) 1 Lidar Final Report 2 None 1 North American Datum 1983 2007-01-19 Top CI_Series none found Top CI_ResponsibleParty Count Component Individual Organization Position Email Role Linkage 1 resourceProvider http://www.epsg-registry.org/export.htm?gml=urn:ogc:def:crs:EPSG::4269 1 Citation URL ftp://ftp.csc.noaa.gov/pub/crs/beachmap/qa_docs/fl/swfwmd/Remainder_Polk_District_2005_LiDAR_and_Polk_District_Contours.pdf 1 Chris O'Neill Woolpert, Inc. Technical Operations",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}