{
    "relation": [
        [
            "Dept.",
            "SOC-S",
            "SOC-S",
            "SOC-S",
            "SOC-S",
            "SOC-S",
            "SOC-R"
        ],
        [
            "Course Number",
            "305",
            "314",
            "319",
            "360",
            "405",
            "481"
        ],
        [
            "Title",
            "Population",
            "Social Aspects of Health & Medicine",
            "Science, Technology & Society",
            "Topics in Social Policy",
            "Selected Social Institutions",
            "Evaluation Research Methods"
        ],
        [
            "Credit Hours",
            "3",
            "3",
            "3",
            "3",
            "3",
            "3"
        ],
        [
            "Minimum Grade",
            "C",
            "C",
            "C",
            "C",
            "C",
            "C"
        ],
        [
            "Co-Reqs or Pre-reqs",
            "P:SOC-S163",
            "P:SOC-S163",
            "P:SOC-S163",
            "P:SOC-S163 & Permission",
            "P:SOC-S163",
            "P:SOC-S163"
        ]
    ],
    "pageTitle": "Informatics (Bachelor of Science) : Academic Bulletin",
    "title": "",
    "url": "http://bulletins.iu.edu/ius/2013-2015/schools/natural-sciences/bs-informatics.shtml",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986646.29/warc/CC-MAIN-20150728002306-00244-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 35520583,
    "recordOffset": 35502948,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{87841=Copyright © 2015 The Trustees of Indiana University, Copyright Complaints}",
    "textBeforeTable": "Note: This is not a re-statement of the University’s General Education Requirement but a list of specific General Education courses which are also requirements or pre-requisites for course work in the school/major. General Education Component See “General Requirements for Undergraduate Degrees at IU Southeast.” P: Computer literacy C 4 Introduction to Informatics 101 INFO-I Co-Reqs (C) or Pre-reqs (P) Minimum Grade Credit Hours Title Course Number Dept. To be admitted to a degree program in Informatics, a student must satisfy the IU Southeast admission requirements. Additionally, a student must complete INFO-I 101 Introduction to Informatics and have an overall GPA of at least 2.0. Degree Program Admission Requirements Degree  Requirements The graduate will be able to recognize and propose the creation of new information technology solutions to the organization’s long-term problems. The graduate will contribute to the development of these new solutions by representing the nontechnical end users in the development process. The graduate will be able to recognize opportunities for the application of “off-the-shelf” technology to the day-to-day problems faced by the graduate’s organization. Furthermore, the graduate, in many",
    "textAfterTable": "3 C P:INFO-I110, INFO-I111, INFO-I308 OR     CSCI-N 341 Introduction to Client-side Web Programming AND 3 C P:INFO-I110, INFO-I111, INFO-I210 CSCI-N 342 Server-side Programming for the Web 3 C P:INFO-I110, INFO-I111, INFO-I210 C:CSCI-N341 International Dimension Choose from one of the following options: Three semesters in the same foreign language, or demonstrated equivalent proficiency. An international experience approved by the program director. Two courses from the IU Southeast Informatics International Dimension list, displayed below. Note: These courses cannot be used to satisfy other General Education requirements. See http://www.ius.edu/naturalsciences/Informatics/intdim.cfm, to see if additional course options have been added since publication of this Bulletin. Dept. Course Number Title Credit Hours Minimum Grade",
    "hasKeyColumn": true,
    "keyColumnIndex": 2,
    "headerRowIndex": 0
}