{
    "relation": [
        [
            "Year",
            "2008",
            "1962",
            "1958",
            "2004",
            "1994",
            "2007",
            "1999",
            "2002",
            "2005",
            "2000"
        ],
        [
            "Ppg",
            "28.9",
            "23.8",
            "23.4",
            "23.2",
            "22.3",
            "21.4",
            "20.6",
            "20.4",
            "20.3",
            "19.1"
        ],
        [
            "Record",
            "3-9",
            "2-7",
            "2-6-1",
            "9-3",
            "8-4",
            "9-4",
            "10-2",
            "10-3",
            "7-5",
            "9-3"
        ]
    ],
    "pageTitle": "UGASports.com - Michigan looking to fix disappointing defense",
    "title": "",
    "url": "https://uga.rivals.com/content.asp?CID=961296",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042992543.60/warc/CC-MAIN-20150728002312-00218-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 893797391,
    "recordOffset": 893773490,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{1923=He isn't watching game film from 2008. What's the point, Robinson figures? He wasn't in charge of last season's defense, which struggled mightily. Instead, Robinson wants to form his own opinion of the players, so he studies cut-ups of spring practice.}",
    "TableContextTimeStampAfterTable": "{41738=July 2, 2009, 43780=\"There\" could be contending for a Big Ten championship, something Michigan hasn't won since 2004. The last time the Wolverines went four seasons in a row without at least a share of the crown was 1993-96, and the program responded in a huge way by winning a share of the 1997 national championship., 48544=That shouldn't happen this season. Robinson brings impressive credentials to Ann Arbor. While he struggled in four seasons as coach at Syracuse (a 10-37 record), he has forged a stellar reputation as a defensive coach. He was a longtime coordinator in the NFL with the New York Jets (1994), Denver Broncos (1995-2000, including helping the franchise to Super Bowl titles in 1997 and '98) and Kansas City Chiefs (2001-03) before returning to the college game in 2004 to run Texas' defense., 44104=No one is thinking BCS title this fall with the program coming off a stunningly horrid 3-9 season that saw college football's winningest program miss the postseason for the first time since 1974.}",
    "textBeforeTable": "Ten worst scoring defenses Where have you gone, Charles Woodson? And you, too, LaMarr Woodley? Michigan's defense looked more like Eastern Michigan's last season. In fact, it was one of the worst defenses in school history. The Wolverines set a school record for average points allowed per game at 28.9. Here is a look at the worst scoring defenses and total defenses in Wolverines history. A porous unit That shouldn't happen this season. Robinson brings impressive credentials to Ann Arbor. While he struggled in four seasons as coach at Syracuse (a 10-37 record), he has forged a stellar reputation as a defensive coach. He was a longtime coordinator in the NFL with the New York Jets (1994), Denver Broncos (1995-2000, including helping the franchise to Super Bowl titles in 1997 and '98) and Kansas City Chiefs (2001-03) before returning to the college game in 2004 to run Texas' defense. \"I don't know if they really knew what they wanted to do philosophically. Scott is a 4-3 guy and Rich is a 3-3 guy [WVU ran a 3-3-5 set under Rodriguez]. There was a time when Rich was letting Scott do his thing, and then had him do some others. They never seemed to be on the same",
    "textAfterTable": "Ten worst total defenses Year Ypg Record 2000 389.9 10-3 2008 366.9 3-9 1982 366.8 8-4 1994 362.0 8-4 2002 347.7 10-3 2005 345.2 7-5 1984 343.2 6-6 2004 336.2 9-3 2007 335.7 9-4 1999 333.0 10-2 \"It wasn't so much scheming, even though there were some philosophical differences,\" Rodriguez says of last season's struggles. \"A lot of it \u0096 I didn't feel the chemistry was there between the defensive staff and most of the players. I thought that was important. I said, 'Greg, this is what I want. I need someone who can help and develop the chemistry among the staff and defensive players.' \"For whatever reason, it was missing last year. I thought Greg had the personality to do that. That was as important as anything. He is a positive guy and has a lot of experience. We need someone to bring all of the defensive assistants' minds together, and I thought Greg was the guy to do it.\" Robinson will alter Michigan's scheme. He",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}