{
    "relation": [
        [
            "Company",
            "Allocation",
            "",
            "",
            "Amount"
        ],
        [
            "A",
            "400",
            "500",
            "",
            "80"
        ],
        [
            "B",
            "100",
            "500",
            "",
            "20"
        ],
        [
            "Total",
            "",
            "",
            "",
            "100"
        ]
    ],
    "pageTitle": "Treasury Decision 9278, August 21, 2006",
    "title": "",
    "url": "http://unclefed.com/Tax-Bulls/2006/td9278.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989891.18/warc/CC-MAIN-20150728002309-00297-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 250480607,
    "recordOffset": 250357101,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{37389=The 2003 proposed regulations provided for a Comparable Profits Method (CPM) for services, which was similar to the CPM in existing §1.482-5. In general, the CPM for services evaluated whether the amount charged in a controlled services transaction is arm’s length by reference to objective measures of profitability (profit level indicators or PLIs) derived from financial information regarding uncontrolled taxpayers that engage in similar services transactions under similar circumstances. The CPM for services applied only where the renderer of controlled services is the tested party., 583901=(3) Expiration date. The applicability of this section expires on or before July 31, 2009., 589229=(g) Effective date—(1) This section is generally effective February 9, 1996. However, taxpayers may elect to apply this section to all open taxable years beginning after December 31, 1993., 101311=Commentators suggested that certain statements in the 2003 proposed regulations incorrectly equated a licensee of intangible property with a distributor of tangible property. In response to these comments, the Treasury Department and the IRS have revised the examples in §1.482-4T(f)(4)(ii) to avoid any implication that these regulations equate or distinguish these business relationships., 25318=The 2003 proposed regulations set forth the comparable uncontrolled services price (CUSP) method. This method evaluated whether the consideration in a controlled services transaction is arm’s length by comparison to the price charged in a comparable uncontrolled services transaction. This method was closely analogous to the comparable uncontrolled price (CUP) method in existing §1.482-3(b)., 589980=(iii) Expiration date. The applicability of §1.6662-6T expires on or before July 31, 2009., 25750=One commentator objected to the statement in §1.482-9(b)(1) of the 2003 proposed regulations that, to be evaluated under the CUSP method, a controlled service ordinarily needed to be “identical to or have a high degree of similarity” to the uncontrolled comparable transactions. The commentator viewed the comparability analysis in the examples in proposed §1.482-9(b)(4) as more consistent with the standard in existing §1.482-3(b)(2)(ii)(A). The Treasury Department and the IRS agree that the comparability standards under the CUSP method for services should run parallel to those under the CUP method for sales of tangible property. Indeed, the provisions are parallel. The commentator misconstrues the purpose of the quoted provision., 596266=Internal Revenue Bulletin 2006-34, 4624=Section 482 of the Internal Revenue Code generally provides that the Secretary may allocate gross income, deductions and credits between or among two or more taxpayers owned or controlled by the same interests in order to prevent evasion of taxes or to clearly reflect income of a controlled taxpayer. Regulations under section 482 published in the Federal Register (33 FR 5849) on April 16, 1968, provided guidance with respect to a wide range of controlled transactions, including transfers of tangible and intangible property and the provision of services. Revised and updated transfer pricing regulations were published in the Federal Register (59 FR 34971, 60 FR 65553 and 61 FR 21955) on July 8, 1994, December 20, 1995, and May 13, 1996. A notice of proposed rulemaking and notice of public hearing were published in the Federal Register (REG-146893-02, 2003-2 C.B. 967 [68 FR 53448]) on September 10, 2003. A correction to the notice of proposed rulemaking and notice of public hearing was published in the Federal Register (Published in the IRB as Announcement 2004-7, 2004-1 C.B. 365 [68 FR 70214]) on December 17, 2003. A public hearing was held on January 14, 2004., 32540=The cost of services plus method in the 2003 proposed regulations was generally analogous to the cost plus method for transfers of tangible property in existing §1.482-3(d). The method implicitly recognized that financial accounting standards applicable to services have not developed to the same degree as the standards applicable to other categories of transactions, such as manufacturing or distribution of tangible property. For that reason, the method adopted the concept of “comparable transactional costs,” which the 2003 proposed regulations defined as all costs of providing the services taken into account in determining the gross services profit markup in comparable uncontrolled services transactions. In this context, comparable uncontrolled transactions could be either services transactions between the controlled taxpayer and uncontrolled parties (internal comparables), or services transactions between two uncontrolled parties (external comparables)., 34951=Several commentators objected to §1.482-9(d)(3)(ii)(A) of the 2003 proposed regulations. In their view, this provision required the results obtained under the cost of services plus method to be confirmed by means of a separate analysis under the comparable profits method (CPM) for services. If a confirming analysis under the CPM for services were required in all cases, commentators reasoned, the cost of services plus method could not be viewed as a specified method in its own right., 29643=The 2003 proposed regulations defined the terms “related uncontrolled transaction,” “applicable uncontrolled price,” and “appropriate gross services profit”. A “related uncontrolled transaction” is a transaction between a member of the controlled group and an uncontrolled taxpayer for which a controlled taxpayer performs either agent services or an intermediary function. The “applicable uncontrolled price” is the sales price paid by the uncontrolled party in the related uncontrolled transaction. The “appropriate gross services profit” is the product of the applicable uncontrolled price and the gross services profit margin in comparable uncontrolled services transactions. The gross services profit margin takes into account all functions performed by other members of the controlled group and any other relevant factors., 529055=Example 21. Disaggregation of transactions. (i) X performs a number of administrative functions for its subsidiaries, including Y, a distributor of widgets in Country B. These services include those relating to working capital (inventory and accounts receivable/payable) management. To facilitate provision of these services, X purchases an ERP system specifically dedicated to optimizing working capital management. The system, which entails significant third-party costs and which includes substantial intellectual property relating to its software, costs $1000., 58514=In response to comments, however, §1.482-9T(j) of the temporary regulations clarifies that all contributions in cash or in kind (including stock-based compensation) are included in total services costs. In addition, the third sentence of §1.482-9T(j) states that “costs for this purpose should comprise provision for all resources expended, used, or made available to achieve the specific objective for which the service is rendered.” To better reflect, for example, the inclusion of stock-based compensation in total services costs, the term “provision” is adopted in place of the term “consideration” as used in the 2003 proposed regulations., 5959=The Treasury Department and the IRS received a substantial volume of comments on a wide range of issues addressed in the 2003 proposed regulations. These comments were very helpful and substantial changes have been incorporated in response. In order to achieve the goal of updating the 1968 regulations, while facilitating consideration of further public input in refining final rules, these regulations are issued in temporary form with a delayed effective date for taxable years beginning after December 31, 2006., 27920=The CUSP provisions in these temporary regulations are substantially similar to the corresponding provisions in the 2003 proposed regulations., 50893=The contingent-payment contractual term provisions in the 2003 proposed regulations built on the fundamental principle that, in structuring controlled transactions, taxpayers are free to choose from among a wide range of risk allocations. This provision in the 2003 proposed regulations also acknowledged that contingent-payment terms—terms requiring compensation to be paid only if specified results are obtained—may be particularly relevant in the context of controlled services transactions. The 2003 proposed regulations provided detailed guidance concerning contingent-payment contractual terms, including economic substance considerations as well as documentation requirements., 81572=A transaction structured as a controlled services transaction may include material elements that do not constitute controlled services. Section 1.482-9(m)(1) of the 2003 proposed regulations provided that, the decision whether to evaluate such a transaction in an integrated manner under the transfer pricing methods in §1.482-9 or to evaluate one or more elements separately under services and non-services methods depends on which of these approaches would provide the most reliable measure of an arm’s length result. If the non-services component(s) of an integrated transaction could be adequately accounted for in evaluating the comparability of the controlled transaction to the uncontrolled comparables, then the transaction could generally be evaluated solely as a controlled service under §1.482-9., 589490=(2)(i) The provisions of paragraphs (d)(2)(ii)(B), (d)(2)(iii)(B)(4) and (d)(2)(iii)(B)(6) of this section are applicable for taxable years beginning after December 31, 2006., 75048=The proposed regulations appear to have created confusion on the part of some taxpayers regarding the appropriate characterization of financial guarantees for tax purposes. The provision of a financial guarantee does not constitute a service for purposes of determining the source of the guarantee fees. See Centel Communications, Inc. v. Commissioner, 920 F.2d 1335 (7th Cir. 1990); Bank of America v. United States, 680 F.2d 142 (Ct. Cl. 1980). Nevertheless, some taxpayers have suggested that guarantees are services that could qualify for the cost safe harbor and that the provision of a guarantee has no cost. This position would mean that in effect guarantees are uniformly non-compensatory. The Treasury Department and the IRS do not agree with this uniform no charge rule for guarantees. As a result, financial transactions, including guarantees, are explicitly excluded from eligibility for the SCM by §1.482-9T(b)(3)(ii)(H). However, no inference is intended by this exclusion that financial transactions (including guarantees) would otherwise be considered the provision of services for transfer pricing purposes. The Treasury Department and the IRS subsequently intend to issue transfer pricing guidance regarding financial guarantees, in particular, along with other guidance concerning the treatment of global dealing operations. See Section A.12.e of this preamble for a discussion of coordination with global dealing operations. Such guidance will also include rules to determine the source of income from financial guarantees., 543622=(3) In general. The applicability of §1.482-9T expires on or before July 31, 2009., 593477=(d) Effective date—(1) In general. This section is applicable with respect to wages paid after December 31, 1978. [§31.3121(s)-1]. The fourth sentence of paragraph (c)(2)(iii) of this section is applicable with respect to wages paid after December 31, 1978, and on or before December 31, 2006. The fifth sentence of paragraph (c)(2)(iii) of this section is applicable with respect to wages paid after December 31, 2006., 594314=(3) Expiration date. The applicability of §31.3121(s)-1T expires on or before July 31, 2009., 177194=(j)(6)(i) The provisions of paragraphs (a)(1), (b)(2)(i), (d)(3)(ii)(C) Example 3, Example 4, Example 5, and Example 6, (d)(3)(v), (f)(2)(ii)(A), (f)(2)(iii)(B), (g)(4)(i), (g)(4)(iii), and (i) of this section are generally applicable for taxable years beginning after December 31, 2006., 118350=In order to achieve the goal of updating the 1968 regulations, while facilitating consideration of further public input in refining final rules, these regulations are issued in temporary form with a delayed effective date for taxable years beginning after December 31, 2006. Controlled taxpayers may also elect to apply these temporary regulations to any taxable year beginning after September 10, 2003, the date of publication of the 2003 proposed regulations. Where such an election is made, the temporary regulations will apply in full to such taxable year and all subsequent taxable years of the taxpayer making the election. Such an election must be made by attaching a statement to the taxpayer’s timely filed U.S. tax return (including extensions) for its first taxable year after December 31, 2006., 33554=The 2003 proposed regulations also recognized that comparable transactional costs could be a subset of total services costs. Generally accepted accounting principles (GAAP) or Federal income tax accounting rules (if income tax data for comparable uncontrolled transactions are available) could provide an appropriate platform for analysis under this provision, but neither is necessarily conclusive., 80614=Section 1.482-9(m) of the 2003 proposed regulations provided coordination rules applicable to a controlled services transaction that is combined with, or includes elements of, a non-services transaction. These coordination rules relied on the best method rule in existing §1.482-1(c)(1) to determine which method or methods would provide the most reliable measure of an arm’s length result for a particular controlled transaction., 53942=Second, in response to comments, the temporary regulations eliminate duplicative or unnecessary references to the economic substance rules. For example, §1.482-9T(i)(2)(ii) has been modified to provide that the contingent-payment arrangement as a whole, including both the contingency and the basis of payment, must be consistent with economic substance, as evaluated under existing §1.482-1(d)(3)(ii)(B). This section eliminates the additional requirement under the 2003 proposed regulations, that the arm’s length charge under a contingent-payment arrangement must be evaluated by reference to economic substance principles., 84504=Section 1.482-9(m)(2) of the 2003 proposed regulations provided that a transaction structured as a controlled service may result in the transfer of intangible property, may include an element that constitutes the transfer of intangible property, or may have an effect similar to the transfer of intangible property. In such cases, if the element of the transaction that related to intangible property was material, the arm’s length result for that element would be determined or corroborated under a method provided for in the regulations applicable to transfers of intangible property. See existing §1.482-4., 547498=(ii) Paragraph (e)(4), the last sentence of paragraph (f)(4)(i), and paragraph (g), Example 17, Example 18, and Example 30 of this section are generally applicable for taxable years beginning after December 31, 2006. In addition, a person may elect to apply the provisions of paragraph (e)(4) of this section to earlier years. Such election shall be made in accordance with the rules set forth in §1.482-9T(n)(2)., 592401=(c)(2)(iii) Group-wide allocation rules. Under the group-wide method of allocation, the district director may allocate the taxes imposed by sections 3102 and 3111 in an appropriate manner to a related corporation that remunerates an employee through a common paymaster if the common paymaster fails to remit the taxes to the Internal Revenue Service. Allocation in an appropriate manner varies according to the circumstances. It may be based on sales, property, corporate payroll, or any other basis that reflects the distribution of the services performed by the employee, or a combination of the foregoing bases. To the extent practicable, the Commissioner may use the principles of §1.482-2(b) of this chapter in making the allocations with respect to wages paid after December 31, 1978, and on or before December 31, 2006. To the extent practicable, the Commissioner may use the principles of §1.482-9T of this chapter in making the allocations with respect to wages paid after December 31, 2006., 70956=In addition, §1.482-9(l)(3)(v) of the 2003 proposed regulations provided that certain “passive association” effects do not give rise to a benefit within the meaning of the regulations concerning controlled services. Passive association was defined as an increment of value that a controlled party obtains on account of its membership in the controlled group. Section 1.482-9(l)(3)(v) of the 2003 proposed regulations provided, however, that membership in a controlled group may be considered in evaluating comparability between controlled and uncontrolled transactions., 3054=Effective Date: These regulations are effective on January 1, 2007., 541563=(n) Effective date—(1) In general. This section is generally applicable for taxable years beginning after December 31, 2006. In addition, a person may elect to apply the provisions of this section, §1.482-9T, to earlier taxable years. See paragraph (n)(2) of this section., 48013=Finally, based on the public comments, and in light of the changes described in this preamble, §1.482-9(g)(2) Example 2 of the 2003 proposed regulations has been withdrawn and replaced by a new example that more effectively illustrates application of the profit split method to nonroutine contributions by multiple controlled parties., 56623=Under the 2003 proposed regulations, total services costs included all costs directly identified with provision of the controlled services, as well as all other costs reasonably allocable to such services under §1.482-9(k). The Treasury Department and the IRS intended that, in this context, “costs” must comprise provision for all resources expended, used, or made available to render the service. Generally accepted accounting principles (GAAP) or Federal income tax accounting rules may provide an appropriate analytic platform, but neither would necessarily be conclusive in evaluating whether an item must be included in total services costs. The issue of determining total services costs is not a new one; it is relevant under the current 1968 regulations as well., 96780=Section 1.482-4(f)(3)(i)(B) of the 2003 proposed regulations excluded certain intangibles that are subject to the cost sharing provisions of §1.482-7. The Treasury Department and the IRS are currently revising the existing regulations related to cost sharing. When final cost sharing regulations are issued, §1.482-4(f)(3) and (4) will take into account the changes made to the cost sharing provisions., 43139=The Treasury Department and the IRS received numerous comments on the profit split method. Commentators objected in particular to references in the 2003 proposed regulations to “interrelated” transactions in §1.482-6(c)(3)(i)(B)(1), and to “high-value services” and “highly integrated transactions” in §1.482-9(g)(1). Commentators viewed these terms as vague and subjective. Commentators also sought more specific guidance concerning the circumstances in which the residual profit split method would constitute the best method under the principles of existing §1.482-1(c). In addition, some commentators suggested that one hallmark of a nonroutine contribution in the context of controlled services is that the renderer bears substantial risks. Another commentator suggested that the arm’s length compensation for a function performed by an employee or group of employees should not in any event be evaluated under a profit split method. In this commentator’s view, such an activity should be classified as routine because the market return for the function is equivalent to the total compensation paid to the employees. Commentators also raised several objections to the factual assumptions in the proposed analysis concerning §1.482-9(g)(2) Example 2 of the 2003 proposed regulations., 48843=The 2003 proposed regulations provided that an unspecified method may provide the most reliable measure of an arm’s length result under the best method rule. Such an unspecified method must take into account that uncontrolled taxpayers compare the terms of a particular transaction to the realistic alternatives to that transaction., 28541=The 2003 proposed regulations provided for a gross services margin method, which evaluated the amount charged in a controlled services transaction by reference to the gross services profit margin in uncontrolled transactions that involve similar services. The method was analogous to the resale price method for transfers of tangible property in existing §1.482-3(c)., 89148=Section 1.482-9(m)(3) of the 2003 proposed regulations provided that services provided by a controlled participant under a qualified cost sharing arrangement are subject to existing §1.482-7. The Treasury Department and the IRS are in the process of comprehensively revising the regulations applicable to cost sharing. In the interim, and pending issuance of final regulations that coordinate these two provisions, the rule in §1.482-9T(m)(3) retains this coordination rule., 180470=(e) Effective date—(1) In general. The provision of paragraph (b) of this section is generally applicable for taxable years beginning after December 31, 2006., 68759=One commentator suggested that, because the benefit test in the 2003 proposed regulations focused on the recipient, the arm’s length charge should also be analyzed from the perspective of the recipient and economic conditions in the recipient’s geographic market. The commentator misunderstands the application of the benefit test. Although the benefit test focuses on the recipient, evaluation of the arm’s length charge under the best method rule in a particular case (for example, under a profit split method) may require analysis of the recipient, the renderer, or both (depending, for example, on which party performs the simplest, most easily measurable functions)., 541952=(2) Election to apply regulations to earlier taxable years—(i) Scope of election. A taxpayer may elect to apply §§1.482-1T, 1.482-2T, 1.482-4T, 1.482-6T, 1.482-8T, and 9T, 1.861-8T, §1.6038A-3T, §1.6662-6T and §31.3121(s)-1T of this chapter to any taxable year beginning after September 10, 2003. Such election requires that all of the provisions of this section, §§1.482-1T, 1.482-2T, 1.482-4T, 1.482-6T, 1.482-8T, and 1.482-9T, as well as the related provisions, §§1.861-8T, 1.6038A-3T, 1.6662-6T and 31.3121(s)-1T of this chapter be applied to such taxable year and all subsequent taxable years (earlier taxable years) of the taxpayer making the election., 66619=Section 1.482-9(l)(3) of the 2003 proposed regulations provided rules for determining whether an activity provides a benefit. Under §1.482-9(l)(3)(i), a benefit is present if the activity directly results in a reasonably identifiable increment of economic or commercial value that enhances the recipient’s commercial position, or is reasonably anticipated to do so. Another requirement is that an uncontrolled taxpayer in circumstances comparable to those of the recipient would be willing to pay an uncontrolled party to perform the same or a similar activity, or be willing to perform for itself the same or similar activity. The 2003 proposed regulations thus made significant changes to the benefit test under the existing regulations, which is based on whether an uncontrolled party in the position of the renderer would expect payment for a particular activity. The 2003 proposed regulations adopted the so-called “specific benefit” approach, which mandates an arm’s length charge only if a particular activity provides an identifiable benefit to a particular taxpayer. In addition, §1.482-9(l)(3)(ii) of the 2003 proposed regulations provided that no benefit is present if an activity has only indirect or remote effects., 10909=Commentators suggested a range of proposed alternatives to the SCBM regime. One such proposal was simply to return to the approach in the existing regulations under §1.482-2(b). The 1968 regulations are fairly rudimentary in nature, particularly, in today’s tax compliance environment. In addition, those regulations were open to substantial manipulation by taxpayers (both inbound and outbound). Moreover, there have been extensive and far-reaching developments in the services economy since the existing regulations were published in 1968, with real prospects that many intragroup services have values significantly in excess of their cost. As a result, in the course of considering comments on the 2003 proposed regulations, the Treasury Department and the IRS have concluded that it would not be appropriate simply to readopt the standard in the 1968 regulations. Additional proposals by commentators included development of a list of activities that would qualify to be priced at cost or detailed provisions regarding cost sharing arrangements for low value services performed on a centralized basis, and other options., 150793=(a) In general—(1) Purpose and scope. The purpose of section 482 is to ensure that taxpayers clearly reflect income attributable to controlled transactions and to prevent the avoidance of taxes with respect to such transactions. Section 482 places a controlled taxpayer on a tax parity with an uncontrolled taxpayer by determining the true taxable income of the controlled taxpayer. This section sets forth general principles and guidelines to be followed under section 482. Section 1.482-2 provides rules for the determination of the true taxable income of controlled taxpayers in specific situations, including controlled transactions involving loans or advances or the use of tangible property. Sections 1.482-3 through 1.482-6 provide rules for the determination of the true taxable income of controlled taxpayers in cases involving the transfer of property. Section 1.482-7T sets forth the cost sharing provisions applicable to taxable years beginning on or after October 6, 1994, and before January 1, 1996. Section 1.482-7 sets forth the cost sharing provisions applicable to taxable years beginning on or after January 1, 1996. Section 1.482-8 provides examples illustrating the application of the best method rule. Finally, §1.482-9T provides rules for the determination of the true taxable income of controlled taxpayers in cases involving the performance of services., 69961=The 2003 proposed regulations provided additional rules concerning application of the benefit test to particular circumstances, such as application to activities with indirect or remote effects, duplicative activities, shareholder activities, and passive association. These rules in the 2003 proposed regulations were substantially similar to the rules in existing §1.482-2(b)(2). For example, §1.482-9(l)(3)(ii) and (l)(3)(iii) provided that no benefit is present if an activity has only indirect or remote effects or merely duplicates an activity that the recipient has already performed on its own behalf. Section 1.482-9(l)(3)(iv) provided that shareholder activities do not confer a benefit on controlled parties and therefore do not give rise to an arm’s length charge. Shareholder activities were defined as activities that primarily benefit the owner-member of a controlled group in its capacity as owner, rather than other controlled parties., 579787=(2) In addition, §1.861-10T(e) (concerning the treatment of related controlled foreign corporation indebtedness) is applicable for taxable years commencing after December 31, 1987. For rules for taxable years beginning before January 1, 1987, and for later years to the extent permitted by §1.861-13T, see §1.861-8 (revised as of April 1, 1986)., 94891=The 2003 proposed regulations also adopted a provision that parallels the requirement in the existing regulations, to the effect that ownership for purposes of section 482 must be consistent with the economic substance of the controlled transaction. Intellectual property law generally places relatively few limitations on the ability of members of a controlled group to assign or transfer legal ownership among themselves. As a result, this rule is a safeguard against purely formal assignments of ownership that, if given effect for purposes of section 482, could produce results that are inconsistent with the arm’s length standard., 40621=One commentator expressed reservations concerning a statement in the preamble to the 2003 proposed regulations, which indicated that PLIs based on return on capital or assets might be unreliable for controlled services because the reliability of these PLIs decreases as operating assets play a less prominent role in generating operating profits. This commentator contended that such PLIs are reliable for all firms, including service providers. The Treasury Department and the IRS clarify that, although return on capital PLIs may produce reliable results in the case of certain service providers, in general, such PLIs are subject to the general reservation in existing §1.482-5(b)(4)(i) to the effect that the reliability of such PLIs increases as operating assets play a greater role in general operating profits., 56321=Section 1.482-9(j) of the 2003 proposed regulations defined “total services costs” for purposes of the SCBM, the CPM for services, and the cost of services plus method where the gross services profit was restated in the form of a markup on total services costs., 113881=The examples in §1.482-1(d)(3)(ii)(C) of the 2003 proposed regulations described alternative constructions that the Commissioner might adopt if the contractual terms for the controlled transaction were not in accordance with economic substance: These alternatives included: (1) imputation of a separate services arrangement, with contingent-payment terms; (2) imputation of a long-term, exclusive distribution arrangement; or (3) requiring compensation for termination of an imputed long-term license arrangement. The Treasury Department and the IRS believe that one or more of these arrangements may be appropriate, depending on the facts of the specific case., 597257=2006 Document Types | 2006 Weekly IRBs, 96285=The 2003 proposed regulations did not adopt the developer-assister rule, so they also eliminated related provisions pertaining to assistance to the owner of intangible property. In place of those rules, the 2003 proposed regulations contained new provisions relating to contributions to the value of intangible property owned by another controlled party. See Proposed §1.482-4(f)(4)(i). These rules are discussed in greater detail in section B.2 of this preamble., 110869=Commentators raised several concerns regarding the potential interaction between the economic substance rules in existing §1.482-1(d)(3) and certain provisions in the 2003 proposed regulations, including those relating to contributions to the value of intangibles and contingent-payment contractual terms. Some commentators suggested that application of these provisions together with the existing economic substance rules could create incentives for the Commissioner to make inappropriate adjustments, e.g., to impute contingent-payment terms or transfers of intangibles in any situation in which non-arm’s length pricing was identified., 93858=Section 1.482-4(f)(3)(i)(A) of the 2003 proposed regulations contained modified rules for determining the owner of intangible property for purposes of section 482. In general, under these rules, the controlled party that was identified as the owner of a legally protected intangible under the intellectual property laws of the relevant jurisdiction or other legal provision was treated as the owner of that intangible for purposes of section 482., 115794=Commentators also suggested that under the 2003 proposed regulations, the Commissioner’s authority to impute contingent-payment contractual terms was unnecessarily broad. In the commentators’ view, this authority would lead the Commissioner to apply commensurate with income principles to controlled transactions that have no significant intangible property component. The Commissioner’s authority to impute contingent-payment contractual terms was appropriately tailored to result in application of economic substance principles in those situations where it was warranted. The Treasury Department and the IRS believe that the commensurate with income principle of the statute is consistent with the arm’s length principle and fundamentally relates to the underlying economic substance and true risk allocations inherent in the relevant controlled transactions. Related parties may, with economic substance, agree to compensate one another for services with compensation payable only in future periods contingent on the success or failure of the services to produce the contemplated results. Related parties may expressly enter into those contractual terms and, in the absence of express terms or where the related parties’ conduct and arrangements are inconsistent with their contractual terms, the IRS may in appropriate facts and circumstances impute contingent-payment contractual terms., 12072=The Treasury Department and the IRS may have decided not to return to the 1968 regulations, but have nonetheless taken the full range of comments on the 2003 proposed regulations seriously. Therefore, in light of the extensive comments on these issues, the Treasury Department and the IRS have substantially redesigned the relevant provisions. The Treasury Department and the IRS recognize that the section 482 services regulations potentially affect a large volume of intragroup back office services that are common across many industries. It is in the interest of good tax administration to minimize the compliance burdens applicable to such services, especially to the extent that the arm’s length markups are low and the activities do not significantly contribute to business success or failure., 91160=In §1.482-9(m)(5) of the 2003 proposed regulations, the section for coordination with the global dealing regulations was “reserved.” In response to comments, this provision is omitted in these temporary regulations, based on the view that reserved treatment is not appropriate. The Treasury Department and the IRS are presently working on new global dealing regulations. The intent of the Treasury Department and the IRS is that when final regulations are issued, those regulations, not §1.482-9T, will govern the evaluation of the activities performed by a global dealing operation within the scope of those regulations. Pending finalization of the global dealing regulations, taxpayers may rely on the proposed global dealing regulations, not the temporary services regulations, to govern financial transactions entered into in connection with a global dealing operation as defined in proposed §1.482-8. Therefore, proposed regulations under §1.482-9(m)(5) issued elsewhere in the Bulletin clarify that a controlled services transaction does not include a financial transaction entered into in connection with a global dealing operation., 87392=Section 1.482-9(m)(6) Example 4 of the 2003 proposed regulations illustrated the application of this rule to a controlled services transaction that included an element constituting the transfer of an intangible. Several commentators questioned the factual assumptions in Example 4. Commentators contended that a controlled party performing R&D for another controlled party generally would not have rights in any know-how or technical data arising out of the R&D activity; instead the contract would specify that the party that paid for the research would obtain such rights., 38960=Section 1.482-9(e)(2)(ii) of the 2003 proposed regulations provided for a new profit level indicator that may be particularly useful for controlled services transactions: the ratio of operating profits to total services costs, or the markup on total costs (also referred to as the “net cost plus”). Because this profit level indicator evaluates operating profits by reference to the markup on all costs related to the provision of services, it is more likely to use a cost base of the tested party that is comparable to the cost base used by uncontrolled parties in performing similar business activities., 94331=The 2003 proposed regulations also clarified that a license or other right to use an intangible may constitute an item of intangible property for purposes of section 482. This provision, which contemplated the identification of a single owner for each discrete set of rights that constitutes an intangible, replaced provisions in the existing regulations that could be interpreted as providing for multiple owners of an intangible. See Proposed §1.482-4(f)(3)(i) and (f)(3)(iv), Example 4., 578180=(h) Effective dates—(1) In general. In general, the rules of this section, as well as the rules of §§1.861-9T, 1.861-10T, 1.861-11T, 1.861-12T, and 1.861-14T apply for taxable years beginning after December 31, 1986, except for paragraphs (a)(5)(ii), (b)(3), (e)(4), (f)(4)(i), and paragraph (g) Example 17, Example 18, and Example 30 of this section, which are generally applicable for taxable years beginning after December 31, 2006. Also, see §1.861-8(e)(12)(iv) and §1.861-14(e)(6) for rules concerning the allocation and apportionment of deductions for charitable contributions. In the case of corporate taxpayers, transition rules set forth in §1.861-13T provide for the gradual phase-in of certain provisions of this and the foregoing sections. However, the following rules are effective for taxable years commencing after December 31, 1988:, 42684=The 2003 proposed regulations provided that the guidance regarding the profit split methods in existing §1.482-6, as amended by proposed §1.482-6(c)(3)(i)(B) and by other changes, applied to controlled services transactions. Section 1.482-9(g) of the 2003 proposed regulations also provided specific additional guidance concerning application of existing §1.482-6, as amended, to controlled services transactions., 8953=The 2003 proposed regulations set forth a simplified cost based method (SCBM). The SCBM was intended to preserve the salutary aspects of the current §1.482-2(b) cost safe harbor that provide appropriately reduced administrative and compliance burdens for low margin services. At the same time, the existing rules would be brought more in line with the arm’s length standard, and various problematic features of those rules would be eliminated. The goal was to provide certainty concerning the pricing of low margin services, thus allowing the compliance efforts of both taxpayers and the IRS to concentrate on those services for which a robust transfer pricing analysis is particularly appropriate. The preamble to the 2003 proposed regulations also indicated that in certain cases, the allocation or sharing among group members of expenses or charges relating to corporate headquarters or other centralized service activities may be consistent with the proposed regulations, but no further guidance was provided on such service sharing arrangements., 57439=Commentators objected that §1.482-9(j) of the 2003 proposed regulations failed to list the specific items that were included in total services costs. Some commentators suggested that, absent more precise guidance in this regard, controlled taxpayers should be permitted to rely on the definition of costs applicable under GAAP or Federal income tax principles. Commentators also requested clarification whether total services costs included stock-based compensation., 110130=Central to the approach taken in the 2003 proposed regulations were the concepts that controlled taxpayers have substantial freedom to adopt contractual terms, and that such contractual terms are given effect under section 482, provided they are in accord with the economic substance of the controlled parties’ dealings. An important corollary of these principles, however, applies where controlled parties fail to specify contractual terms, or specify terms that are not consistent with economic substance. In such cases, the Commissioner may impute contractual terms to accord with the economic substance of the controlled parties’ activities. See §1.482-1(d)(3) of the existing regulations., 210054=(3) Expiration date. The applicability of §1.482-6T expires on or before July 31, 2009., 209367=(d) Effective date—(1) In general. The provisions of paragraphs (c)(2)(ii)(B)(1) and (D), (c)(3)(i)(A) and (B), and (c)(3)(ii)(D) of this section are generally applicable for taxable years beginning after December 31, 2006., 107927=Commentators sought clarification regarding the term “incremental marketing activities,” which was used in several examples in §1.482-4(f)(4)(ii) of the 2003 proposed regulations., 44567=The Treasury Department and the IRS agreed with a number of comments and, as a result, have made substantial changes to these provisions. Under these temporary regulations, all references to “interrelated” transactions in §1.482-6(c)(3)(i)(B)(1), as well as references to “high-value services” and “highly integrated transactions” in §1.482-9(g)(1) have been eliminated. Section 1.482-9T(g)(1) now states that the profit split method is “ordinarily used in controlled services transactions involving a combination of nonroutine contributions by multiple controlled taxpayers.” This change from the 2003 proposed regulations (which referred to “high-value” or “highly-integrated” transactions), conforms to the changes to §1.482-6T(c)(3)(i)(B)(1), as described below., 198656=(iii) Expiration date. The applicability of §1.482-4T expires on or before July 31, 2009., 17175=Under §1.482-9T(b)(2), specified covered services or low margin covered services otherwise eligible for the SCM will qualify for the method if the taxpayer reasonably concludes in its business judgment that the services do not contribute significantly to key competitive advantages, core capabilities, or fundamental chances of success or failure in one or more trades or businesses of the renderer, the recipient, or both. Unlike the quantitative judgment called for under the SCBM, this is a business judgment preeminently within the business person’s own expertise. Exact precision is not needed and it is expected that the taxpayer’s judgment will be accepted in most cases. This condition is intended to focus transfer pricing compliance resources of both taxpayers and the IRS principally on significant valuation issues. Thus, it is anticipated that in most cases the examination of relevant services will focus only on verification of total services costs and their appropriate allocation. These are issues even under the 1968 regulations. There will be little need in all but the most unusual cases to challenge the taxpayer’s reasonable business judgment in concluding that such typical back office services do not contribute significantly to fundamental risks of success or failure. The condition effectively is reserved to allow the IRS to reject any attempt to claim that a core competency of the taxpayer’s business qualifies as a mere back office service. For illustrations of the role performed by this condition, see the contrasting pairs of Example 1 and Example 2, Example 3 and Example 4, Example 5 and Example 6, Example 8 and Example 9, Example 10 and Example 11, and Example 12 and Example 13 in §1.482-9T(b)(6)., 51617=Under §1.482-9(i)(2) of the 2003 proposed regulations, a contingent-payment arrangement was given effect if it met three basic requirements: (1) the arrangement is contained in a written contract executed prior to the start of the activity; (2) the contract makes payment contingent on a future benefit directly related to the outcome of the controlled services transaction; and (3) the contract provides for payment on a basis that reflects the recipient’s benefit from the services rendered and the risks borne by the renderer., 53194=The temporary regulations respond to each of these concerns. First, under §1.482-9(i)(1) of the 2003 proposed regulations, one factor that needed to be considered was whether an uncontrolled taxpayer would have paid a contingent fee if it engaged in a similar transaction under comparable circumstances. In response to comments, the temporary regulations eliminate this requirement and instead emphasize the importance of the economic substance principles under §1.482-1(d)(3) of the existing regulations. That is, whether a particular arrangement entered into by controlled parties has economic substance is not determined by reference to whether it corresponds to arrangements adopted by uncontrolled parties., 64240=One commentator interpreted this provision as indicating that any activity properly analyzed under one or more other provisions of the transfer pricing regulations should not be subject to §1.482-9 of the 2003 proposed regulations. Other commentators suggested that the “predominant character” of a transaction should control whether it is analyzed as a controlled service under §1.482-9 of the 2003 proposed regulations or under other provisions of the section 482 regulations., 198083=(f)(7) Effective date. (i) In general. The provisions of paragraphs (f)(3) and (f)(4) are generally applicable for taxable years beginning after December 31, 2006., 41470=Aside from the addition of the examples described above, the CPM for services provisions in these temporary regulations are substantially similar to the provisions in the 2003 proposed regulations., 3185=Applicability Dates: These regulations apply to taxable years beginning after December 31, 2006., 42168=The 2003 proposed regulations provided additional guidance concerning application of the comparable profit split and the residual profit split methods to controlled services transactions. Generally, these methods evaluated whether the allocation of the combined operating profit or loss attributable to one or more controlled transactions is arm’s length by reference to the relative value of each controlled taxpayer’s contributions to the combined operating profit or loss., 31743=The 2003 proposed regulations set forth the cost of services plus method. This method evaluated the amount charged in a controlled services transaction by reference to the gross services profit markup in comparable uncontrolled services transactions. The gross services profit is determined by reference to the markup as a percentage of comparable transactional costs in comparable uncontrolled transactions. This method would ordinarily apply where the renderer of controlled services provides the same or similar services to both controlled and uncontrolled parties. In general, those are the only circumstances in which a controlled taxpayer would likely have the detailed information concerning comparable transactional costs necessary to apply this method reliably., 49209=No significant comments were received concerning the unspecified method provisions. Consistent with the general aim to coordinate the analyses under the various sections of the regulations under section 482 so that economically similar transactions will be evaluated similarly, however, §1.482-9T(h) has been modified to provide that in applying an unspecified method to services, the realistic alternatives to be considered include “economically similar transactions structured as other than services transactions.” This provision allows flexibility to consider non-services alternatives to a services transaction, for example, a transfer or license of intangible property, if such an approach provides the most reliable measure of an arm’s length result. The Treasury Department and the IRS are considering similar changes to §§1.482-3(e)(1) and 1.482-4(d)(1) of the existing regulations. Public comments are requested regarding the advisability of such changes and the form they should take. Aside from this change, the unspecified method provisions in these temporary regulations are substantially similar to the provisions in the 2003 proposed regulations., 103359=Section 1.482-4(f)(4)(i) of the 2003 proposed regulations provided that compensation for a contribution may be embedded within the terms of another transaction, may be stated separately as a fee for services, or may be provided for as a reduction in the royalty or the transfer price of tangible property. The regulations also recognized that if a controlled party’s activities are reasonably anticipated to enhance only the value of its own rights under a license or exclusive distribution arrangement, no compensation is due under the arm’s length standard. The rules addressed the most commonly encountered factual scenarios that potentially give rise to contributions on the part of a controlled party., 57937=The Treasury Department and the IRS view the definition of total services costs in the 2003 proposed regulations as having struck the correct balance between specificity and flexibility. In general, the accounting standards applicable to services do not provide a uniform means of determining all costs that relate to the provision of services. Consequently, the Treasury Department and the IRS conclude that total services costs for purposes of section 482 cannot be determined solely by reference to GAAP or other accounting standards or practices., 181029=(3) Expiration date. The applicability of §1.482-2T expires on or before July 31, 2009., 14870=An initial proposed list of specified covered services is contained in an announcement being published contemporaneously with these temporary regulations. This announcement will be published in the Internal Revenue Bulletin. For copies of the Internal Revenue Bulletin, see §601.601(d)(2)(ii)(b). The Treasury Department and the IRS solicit public input on whether the list of services sufficiently covers the full range of back office services typical within multinational groups, on the descriptions provided for these covered services, and on other matters related to the announcement. It is contemplated that a final revenue procedure, reflecting appropriate comments, will be issued to coincide with the effective date of the temporary regulations for taxable years beginning after December 31, 2006. In the future, particular services may be added to, clarified in, or deleted from the list, depending on ongoing developments., 178168=(iii) The applicability of §1.482-1T expires on or before July 31, 2009., 38541=The 2003 proposed regulations stated that the degree of consistency in accounting practices between the controlled services transaction and the uncontrolled services transaction might affect the reliability of the results under the CPM for services. If appropriate adjustments to account for such differences are not possible, the reliability of the results under this method will be reduced., 77144=Commentators observed that the definition of “total services costs” in §1.482-9(j) of the 2003 proposed regulations did not address situations in which the costs of a controlled service provider included significant charges from uncontrolled parties. Commentators claimed that such third-party costs should be treated as “pass through” items that, in most cases, should not be subject to the markup (if any) applicable to costs incurred by the renderer in its capacity as service provider. This comment was potentially relevant to all cost-based methods in §1.482-9 of the 2003 proposed regulations. The Treasury Department and the IRS agreed that these comments raised an issue that needed to be addressed, but decided to do so in a manner different from that suggested by the commentators., 529724=(ii) Based on a detailed functional analysis, the Commissioner determines that in providing administrative services for Y, X performed functions beyond merely operating the ERP system itself, since X was effectively using the ERP as an input to the administrative services it was providing to Y. In determining arm’s length price for the services, the Commissioner may consider a number of alternatives. For example, if the most reliable uncontrolled data is derived from companies that use similar ERP systems purchased from third parties to perform similar administrative functions for uncontrolled parties, the Commissioner may determine that a CPM is the best method for measuring the functions performed by X, and, in addition, that a markup on total services costs, based on the markup from the comparable companies, is the most reliable PLI. In this case, total services cost, and the basis for the markup, would include appropriate reflection of the ERP costs of $1000. Alternatively, X’s functions may be most reliably measured based on comparable uncontrolled companies that perform similar administrative functions using their customers’ own ERP systems. Under these circumstances, the total services cost would equal X’s costs of providing the administrative services excluding the ERP cost of $1000., 596472=You can either: Search all IRS Bulletin Documents issued since January 1996, or Search the entire site. For a more focused search, put your search word(s) in quotes., 60629=Section 1.482-9(k) of the 2003 proposed regulations retained the flexible approach of existing §1.482-2(b)(3) through (6), which permitted taxpayers to use any reasonable allocation and apportionment of costs in determining an arm’s length charge for services. In evaluating whether the allocation used by the taxpayer is appropriate, the 2003 proposed regulations required that consideration be given to all bases and factors, including practices used by the taxpayer to apportion costs for other (non-tax) purposes. Such practices, although relevant, need not be given conclusive weight by the Commissioner in evaluating the arms length charge for controlled services., 102203=Under §1.482-4(f)(4)(i) of the 2003 proposed regulations, the rules of section 482 were applied to determine the arm’s length compensation for any activity that was reasonably anticipated to increase the value of an intangible owned by another controlled party. Such an activity was defined as a “contribution” under this provision. This provision replaced certain rules in the existing regulations that required arm’s length compensation to be provided for any assistance by a controlled party to the owner of the intangible., 594778=Approved July 11, 2006., 59237=Commentators also observed that the definition of total services costs in the 2003 proposed regulations did not address situations in which the costs of a controlled service provider include significant charges from uncontrolled parties. Commentators posited that such third-party costs should be permitted to “pass through,” rather than being subject to a markup under the transfer pricing method used to analyze the controlled services transaction. The Treasury Department and the IRS agree that these comments raised an issue that needs to be addressed, but decided to do so in a manner different from that suggested by the commentators. In response to this comment, the temporary regulations add §1.482-9T(l)(4), which under certain circumstances allows a controlled services transaction that involves third-party costs to be evaluated on a disaggregated basis. See section A.11.e of this preamble., 543070=(iii) Time and manner of making election. An election to apply the regulations to earlier taxable years must be made by attaching a statement to the taxpayer’s timely filed U.S. tax return (including extensions) for its first taxable year after December 31, 2006., 71571=Concerning indirect or remote effects, one commentator suggested that if a centralized activity by a parent confers only occasional or intermittent benefits on a subsidiary, such benefits should be classified as indirect or remote. As to the shareholder provisions, commentators noted that the 2003 proposed regulations failed to address the potential that an activity that confers a reasonably identifiable increment of value on a controlled party might also be appropriately classified as a shareholder activity. As to the passive association provisions, commentators questioned whether membership in a controlled group is relevant to evaluation of comparability. Commentators raised the concern that virtually any uncontrolled transaction could potentially be considered unreliable, because it generally would not reflect the same efficiencies and synergies as the controlled services transaction., 105526=Commentators objected to certain aspects of Example 2, Example 3, Example 5, and Example 6 in §1.482-4(f)(4)(ii) of the 2003 proposed regulations. Those examples stated that, if it is not possible to identify uncontrolled transactions that incorporated a similar range of interrelated elements as the nonroutine contributions by the controlled parties, it may be appropriate to apply a residual profit split analysis. In the opinion of commentators, these statements implied that profit split methods were preferred methods in any case that involved a contribution to the value of an intangible., 580174=(3) Expiration date. The applicability of the paragraphs (a)(5)(ii), (b)(3), (e)(4), (f)(4)(i), and paragraph (g) Example 17, Example 18, and Example 30 of this section, expires on or before July 31, 2009., 100675=The Treasury Department and the IRS also believe that the 2003 proposed regulations properly adopted a practical control standard for “non-legally protected” intangibles. The control standard should not displace valid contractual terms intended to specify that a particular controlled party is the owner of an existing intangible or an intangible under development. Because a contractual term constitutes a “legal provision,” the intangible would be analyzed as a legally protected intangible, as opposed to a non-legally protected intangible subject to the practical control rule., 67912=Commentators viewed the 2003 proposed regulations as providing insufficient guidance concerning methods that controlled taxpayers might use to allocate or share expenses or charges, in particular with respect to centralized services performed on a centralized basis for multiple affiliates., 95560=Under §1.482-4(f)(3)(i)(A) of the 2003 proposed regulations, in situations where it was not possible to identify the owner of an intangible under the intellectual property law of the relevant jurisdiction, contractual term, or other legal provision, the controlled taxpayer with practical control over the intangible would be treated as the owner for purposes of section 482. This provision replaced the so-called “developer-assister” rule in existing §1.482-4(f)(3)(ii)(B). In the case of non-legally protected intangibles, the developer-assister rule assigned ownership of an intangible to the controlled taxpayer that bore the largest portion of the costs of development., 225569=(c) Effective date—(1) In general. The provisions of §1.482-8T Example 10, Example 11, and Example 12 are generally applicable for taxable years beginning after December 31, 2006., 120614=It has been determined that this Treasury decision is not a significant regulatory action as defined in Executive Order 12866. Therefore, a regulatory assessment is not required. It also has been determined that section 553(b) of the Administrative Procedure Act (5 U.S.C. chapter 5) does not apply to these regulations. For the applicability of the Regulatory Flexibility Act (5 U.S.C. chapter 6) refer to the Special Analyses section of the preamble to the cross-reference notice of proposed rulemaking published in this issue of the Bulletin. Pursuant to section 7805(f) of the Internal Revenue Code, these temporary regulations will be submitted to the Chief Counsel for Advocacy of the Small Business Administration for comment on their impact on small business., 30582=One commentator mistakenly interpreted the term “related uncontrolled transaction” to suggest that the comparable transaction under this method is one that takes place between controlled parties. While this was not intended, the Treasury Department and the IRS agree that the nomenclature is potentially confusing, and as a result, these regulations substitute the term “relevant uncontrolled transaction” in lieu of “related uncontrolled transaction” wherever that appeared. In other respects, the gross services margin provisions in these temporary regulations are substantially similar to the provisions in the 2003 proposed regulations., 595210=(Filed by the Office of the Federal Register on July 31, 2006, 4:40 p.m., and published in the issue of the Federal Register for August 4, 2006, 71 F.R. 44465), 38017=Section 1.482-9(e) of the 2003 proposed regulations provided that the profit level indicators (PLIs) provided for in existing §1.482-5(b)(4)(ii) may also be used under the CPM for services. The relative lack of uniformity in financial accounting standards for services, combined with potentially incomplete information regarding the cost accounting practices of the uncontrolled comparables, strongly suggest that PLIs that require accurate segmentation of costs may have limited reliability., 63641=Section 1.482-9(l) of the 2003 proposed regulations set forth a threshold test for determining whether an activity constituted a controlled services transaction subject to the general framework of §1.482-9. The 2003 proposed regulations broadly defined a controlled services transaction as any activity by a controlled taxpayer that resulted in a benefit to one or more other controlled taxpayers. An “activity” was in turn defined as the use by the renderer, or the making available to the recipient, of any property or other resources of the renderer., 90148=Section 1.482-9T(m)(4) is adopted in substantially the same form as in the 2003 proposed regulations. A transaction structured other than as a controlled services transaction may include material elements that constitute controlled services. Section 1.482-9T(m)(4) of these temporary regulations provides rules for evaluating such integrated transactions. As with the corresponding rules in the 2003 proposed regulations, these rules complement the more general rule in §1.482-9(m)(1), which relates to integrated transactions structured as controlled services transactions., 104106=Section 1.482-4(f)(4)(i) of the 2003 proposed regulations provided that in general a separate allocation is not appropriate if the compensation for a contribution was embedded within the terms of a related controlled transaction. In such cases, the contribution is taken into account in evaluating the comparability of the controlled transaction to the uncontrolled comparables and in determining the arm’s length consideration for the controlled transaction that includes the embedded contribution., 226412=(3) Expiration date. The applicability of §1.482-8T expires on or before July 31, 2009., 92829=The 2003 proposed regulations substantially replaced §1.482-4(f)(3) of the existing regulations, which dealt with issues relating to the allocation of income from intangibles. The 2003 proposed regulations adopted new §1.482-4(f)(3) and (f)(4), which provided modified rules for determining the owner of an intangible for purposes of section 482 and also provided rules for determining the arm’s length compensation in situations where a controlled party other than the owner makes contributions to the value of an intangible., 583391=(i) Effective date—(1) In general. This provision is generally applicable for taxable years beginning after December 31, 2006., 28940=Under the 2003 proposed regulations, this method would ordinarily be used where a controlled taxpayer performs activities in connection with a “related uncontrolled transaction” between a member of the controlled group and an uncontrolled taxpayer. For example, the method may be used where a controlled taxpayer renders services to another member of the controlled group in connection with a transaction between that other member and an uncontrolled party (agent services), or where a controlled taxpayer contracts to provide services to an uncontrolled taxpayer and another member of the controlled group actually performs the services (intermediary function).}",
    "lastModified": "Thu, 05 Feb 2009 18:46:14 GMT",
    "textBeforeTable": "(ii) Companies X, Y and Z reasonably anticipate benefits from service A. Company P does not reasonably anticipate benefits from service A. Assume that if relative reasonably anticipated benefits were precisely known, the appropriate allocation of charges pursuant to §1.482-9T(k) to Company X, Y and Z for service A is as follows: Example 20. Shared services arrangement and reliable measure of reasonably anticipated benefit (allocation key). (i) Company P performs human resource services (service A) on behalf of the PXYZ Group that qualify for the services cost method. Under that method, Company P determines the amount charged for these services pursuant to a shared services arrangement based on an application of paragraph (b)(5) of this section. Service A constitutes a specified covered service described in a revenue procedure pursuant to paragraph (b)(4)(i) of this section. The total services costs for service A otherwise determined under the services cost method is 300. (iii) Employee headcount or total compensation paid to employees may provide a more reliable basis for evaluating the shares of reasonably anticipated benefits from the covered services. (ii) In evaluating the shares of reasonably anticipated benefits from these centralized services, the total revenues of each subsidiary may not provide the most reliable measure of reasonably anticipated benefit shares, because total revenues do not bear a relationship to the shares of reasonably anticipated benefits from the underlying services. Example 19. Shared services arrangement and reliable measure of reasonably anticipated benefit",
    "textAfterTable": "Company Y - 250 employees Company Z - 250 employees   (iv) Company P allocates the 300 total services costs of service A based on employee headcount as follows:     Service A Total Cost 300   Company Allocation Key: (Headcount) Amount X 600 164 Y 250 68 Z 250 68 (v) Based on these facts, Company P may reasonably conclude that the employee headcount allocation basis most reliably reflects the",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}