{
    "relation": [
        [
            "",
            "1",
            "2",
            "3",
            "4",
            "5"
        ],
        [
            "Player",
            "Beau Sparks",
            "Jacob Yordy",
            "Karsten Short",
            "Nick Fuller",
            "Zach Boland"
        ],
        [
            "Team",
            "Hockinson",
            "R. A. Long",
            "Washougal",
            "Woodland",
            "Washougal"
        ],
        [
            "Week # 1-13",
            "1-13",
            "1-13",
            "1-13",
            "1-13",
            "1-13"
        ],
        [
            "Recpt.",
            "31",
            "33",
            "12",
            "18",
            "13"
        ],
        [
            "Yds",
            "524",
            "448",
            "364",
            "350",
            "307"
        ],
        [
            "Avg",
            "16.90",
            "13.58",
            "30.33",
            "19.44",
            "23.62"
        ],
        [
            "TD",
            "6",
            "5",
            "4",
            "7",
            "2"
        ],
        [
            "Yds/G",
            "52.4",
            "49.8",
            "45.5",
            "43.8",
            "51.2"
        ]
    ],
    "pageTitle": "Battle Ground | Greater St. Helens League Football",
    "title": "",
    "url": "http://gshlfootball.com/category/4a-headlines/battle-ground-stories",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042992543.60/warc/CC-MAIN-20150728002312-00186-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 110061179,
    "recordOffset": 110020081,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{2032=Greater St. Helens League 3A Rushing: Remick Kawawaki (Columbia River) 121-1070 12TD Receiving: Jesse Zalk (Prairie) 46-815 8TD Passing: Colin Seitz (Prairie) 159/245 2243 28TD 6INT, 2302=Greater St. Helens League 4A Rushing: Parker Henry (Skyview) 169-1667 24TD Receiving: E’Lon Mack (Heritage) 48-617 6TD Passing: Kieran McDonagh (Skyview) 106/158 1698 18TD 2INT, 148552=Trey was dedicated football player who played in CCYF and at Skyview High School. During football season his sophomore year, he was diagnosed with Osteosarcom – a very aggressive cancer of the bone. After enduring chemotherapy, three major surgeries and a partial amputation of his leg, Trey was informed that he was healed. However, the cancer returned. On October 19, 2006 Trey was finally cancer free again when he passed from this world. He holds a special place with the Skyview football community. To honor is courage and dedication, the family has formed a foundation in his name to help battle childhood cancer., 2582=Greater St. Helens League All Level Leaders Rushing: Parker Henry (Skyview) 169-1667 24TD Receiving: Jesse Zalk (Prairie) 46-815 8TD Passing: Colin Seitz (Prairie) 159/245 2243 28TD 6INT, 143264=Air One Football Academy Visit, March 2012, 286664=To view a team’s schedule simply click on the team to go to their team page. 2012 schedules are under the video., 152496=Was invited and attended the NFL combine in 1993, but due to the previous injury to his throwing wrist, he was selected as free agent in the 1993 NFL Draft by the Atlanta Falcons. Played in preseason… In 1996, he played one season for the Arena Leagues, San Jose Sabercats. A shoulder injury forced him to retire., 290119=Paul and Bryan talk about the 2012 Greater St. Helens high school football schedules. They look week-by-week at all the key games such as Skyview at Central Catholic week 1, Union at Jesuit week 2, Lakes at Skyview week 3, Camas at Lakes week 4, Skyview at Camas week 5, Camas at Union week 7 and Union at Skyview week 9. They also touch on other key games such as Columbia River at Mountain View week 9, Prairie at Columbia River week 7 and who the whole 2A is again up for grabs once again. They talk about this and much more in this 28 minute podcast!, 157910=Mountain View High School (California): John is a 1989 graduate of Mountain View High School. As a sophomore and junior, he helped shepherd the Spartans to the 1987 and 1988 Santa Clara Valley Athletic League championships where Mountain View posted impressive 10-0 season records… Outstanding Offensive Player of the Year as a junior… Santa Clara Valley Athletic League All League player… his center was, Charles Huang, the creator of Guitar Hero., 6755=While up in Tacoma for the 2011 WIAA Semifinals, I shot a behind the scenes of me editing the Camas game vs O’Dea. It will give you an idea of what it’s like to edit the highlight videos we know and love., 287011=Here is the full week-by-week 2012 season schedule for all 18 GSHL football teams, and even a few Trico teams., 147322=March 25th, @6pm vs. Golden State Warriors or March 29th, @7pm vs. New Orleans Hornets, 241412=We plan on dropping in at the Air One Football Academy from time to time to keep an eye on the GSHL guys as they get ready for the soon upcoming 2012 season., 290230=May 11, 2012, 156072=As a sophomore, he broke the national community college career passing yardage record by throwing for 5,925 yards in his two seasons… went 22 of 30 passing for 452 yards and 4 touchdowns to break the old records mark of 5,448 yards set by Tim Green of El Camino… was 37-64 with 485 yards and 3 touchdowns vs San Jose… helped the Owls get to the Lions Bowl where he completed 30 of 43 passes for 375 yards and 3 touchdowns… named MVP of the Lions Bowl game… rated the top-ranked junior college player… Region 1 California All-State selection… Coast Conference North Division Offensive Player of the Year… named to the 1990 All-America Community College team… honored as the 1991 Times Tribune Male Athlete of the Year… the 1991 Athlete of the Year for the Greater San Jose Sports Association Awards. Past recipients for the award include Jim Plunkett, and Ronnie Lott… For his career, he completed 60 percent or 419 of 702 for 6,300 yards and 45 touchdowns., 144444=There were 26 athletes there working on their crafts under the direction of former Portland State QB John Charles. Most of those were either current, future or former Greater St. Helens League players. Players such as Camas Seniors Tony Gennaro (2011 2nd Team 3A GSHL All-League QB) and John Payne (20111st Team 3A GSHL All-League DB), Hockinson Sophomore Jess Krahn (20112nd Team 2A GSHL All-League QB) and Union Junior Treve’ Ensley along with several younger players who will be making a name for themselves in 2012., 154150=In his 2 years at Portland State, he completed 63.9 percent of his passes and went 326 of 510 for 5,389 yards and 65 touchdowns against only 19 interceptions. He finished his Portland State career with an efficiency rating of 183.4… The first player in Western Football Conference history to be named player of the year twice… Completed 33-40 passes with 444 yards and 3 touchdowns to upset 16th ranked Boise state University… first player in conference history to be named player of the week four times in one season, three weeks in a row, seven times in two seasons… named Sports Illustrated national player of the week in 1991… named national player of the week twice in 1992 with USA Today and Sports Illustrated… honored by NCAA for winning total offense national title in 1992… passed for three touchdowns or more in 17 of 18 starts the past two seasons, three or more touchdowns in every game… Oregon Banquet Of Champions finalist two years in a row… finalist for the prestigious Harlon Hill Award (Division II’s equivalent of the Heisman Trophy). Despite wrist injury and 8 games, he finished third in balloting with 106 points and 13 first place votes… completed a perfect sweep of NCAA All-America First Teams by being selected to the USA Today All-America Team, Kodak/American Football Coaches Association, and Associated Press All-America Teams… He was one of five National Jefferson Award winners for Public Service in 1993. Winners receive a Bronze medallion from the Franklin Mint in Washington, D.C. and also published with the American Institute for Public Service in Washington, D.C., 150176=Former Skyview football player Trey Foote, passed away in 2006 after he battled Osteosarcom, a very aggressive cancer of the bone., 241242=Air One Football Academy Visit, May 2012, 154430=As a senior, he led the nation in total offense averaging 338 yards… completed 194 of 281 for a school record 69 percent, 2944 yards, 24 touchdowns and only 8 interceptions to rank second in the nation in pass efficiency with a 181.3 rating for the second straight season., 156368=Foothill Junior College: As a freshman starter… second in the state in passing… completed 57 percent or 210 of 366 for 3,000 yards exactly and 19 touchdowns with a 131.9 rating… averaged 300 yards per game… First team All-Conference in 1989 (the other QB was Jeff Garcia), 156756=Also lettered 3 years in baseball, it was during his senior year that he led the Spartans to win the 1989 Santa Clara Valley Athletic League Baseball championships… was 9-1 with a 1.90 ERA… topped out at 89 mph… He earned All-League, Peninsula and State honors. He was a top 10 finalist for the 1989 Times Tribune Athlete of the Year Award., 1757=Greater St. Helens League 2A Rushing: Cy Whitmire (Woodland) 170-1281 14TD Receiving: Beau Sparks (Hockinson) 31-524 6TD Passing: Ryan Peerboom (R. A. Long) 94-198 1145 10TD 9INT}",
    "TableContextTimeStampAfterTable": "{122229=Copyright © 2008-2012 Greater St. Helens League Football · Developed by St. Hellens Media · Log in}",
    "lastModified": "Tue, 04 Aug 2015 23:52:19 GMT",
    "textBeforeTable": "Receiving More… 83.1 8 7.48 748 100 1-13 R. A. Long Jacob Yordy 10 70.1 12 8.29 771 93 1-13 Union Gabe Rego 9 107.6 16 6.78 861 127 1-13 Union Brandon Brody-Heim 8 100.1 9 6.72 901 134 1-13 Hockinson Josiah Niemela 7 100.4 11 7.73 904 117 1-13 Washougal Sam O’Hara 6 104.2 16 7.69 938 122 1-13 Mountain View Michael Rivers 5 118.9 12 8.84 1070 121 1-13 Columbia River Remick Kawawaki 4 84.8 15 6.23 1103 177 1-13 Camas Zach Marshall 3 128.1 14 7.54 1281 170 1-13 Woodland",
    "textAfterTable": "6 Zach Eagle Camas 1-13 37 650 17.57 6 50.0 7 E’Lon Mack Heritage 1-13 48 617 12.85 6 68.6 8 Dennis Henderson Columbia River 1-13 48 584 12.17 4 64.9 9 Beau Sparks Hockinson 1-13 31 524 16.90 6 52.4 10 Tanner Nelson Union 1-13 28 466 16.64 3 42.4 More… Passing   Player Team Week # 1-13 Comp-Att (%) Yds Avg TD INTs Yds/G 1 Kieran McDonagh Skyview",
    "hasKeyColumn": true,
    "keyColumnIndex": 1,
    "headerRowIndex": 0
}