{
    "relation": [
        [
            "Payment method",
            "",
            "Cash on pickup",
            "Money Order/Bank cheque",
            "Other - See seller's payment instructions",
            "Bank Deposit"
        ],
        [
            "Preferred/Accepted",
            "PayPal Preferred",
            "Accepted",
            "Accepted",
            "Accepted",
            "Accepted"
        ],
        [
            "",
            "",
            "",
            "",
            "",
            ""
        ]
    ],
    "pageTitle": "Viva LAS Vegas 1964 Brand NEW Sealed R1 DVD Elvis Presley ANN Margret | eBay",
    "title": "",
    "url": "http://www.ebay.com.au/itm/VIVA-LAS-VEGAS-1964-BRAND-NEW-SEALED-R1-DVD-ELVIS-PRESLEY-ANN-MARGRET-/251303663362?pt=AU_DVDsBlurayDiscs&hash=item3a82dd9702",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042992543.60/warc/CC-MAIN-20150728002312-00115-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 409661051,
    "recordOffset": 409606025,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{64337=Important information regarding DVD Region Codes - Please read before you purchase this product!!! Before purchasing this DVD, please make sure your DVD player is capable of playing Region 1 discs.    In general Australian DVD players are locked to Region 4,  however more and more new DVD players sold these days are Multi Region compatible.   We strongly recommend that you make sure before purchasing as we are unable to refund purchases for incompatibility.   Your DVD instructions manual should include the Region information for your DVD player.   Alternatively if you email us your DVD player make & model, we will endeavour to find out for you.  FORMAT: CONDITION: BRAND NEW/FACTORY SEALED REGION CODE:  REGION 1 (U.S./CANADA) ** PLEASE NOTE:  THIS IS A REGION 1 ENCODED DVD.  PLEASE CHECK THAT YOUR DVD PLAYER IS CAPABLE OF PAYING REGION 1 DISCS IF YOU ARE UNSURE, PLEASE EMAIL US AND WE WILL ENDEAVOUR TO FIND OUT FOR YOU JEWEL CASE: STANDARD DVD CASE (NEW/SEALED) NO. OF DISCS:  1 PICTURE FORMAT:  Widescreen FEATURE RUNNING TIME:  85 Minutes AUDIO: English SUBTITLES:  English, French DISTRIBUTOR/STUDIO:  Warner Home Video RELEASE DATE: AUGUST 7th 2007 Product Description: Viva Las Vegas, one of Elvis Presley's most popular vehicles, adheres as rigidly to formula as a Kabuki dance. Elvis plays a race-car driver competing in the Las Vegas Grand Prix opposite his principal rival, Cesare Danova. To finance his entry, Elvis takes a job as a casino waiter. Naturally, he is occasionally prevailed upon to sing, making one wonder why he didn't choose this talent as a means of making some quick cash. As always, Elvis chases all the wrong girls, only to ignore the \"right\" one, portrayed by Ann-Margret in her considerable youthful prime (We're supposed to believe that A-M is the daughter of irascible William Demarest. So much for the reliability of gene pools). With a pre-fat Presley, an indescribably gorgeous Ann-Margret, and no fewer than 12 songs on the soundtrack, how could Viva Las Vegas help but reap a fortune at the box office? Bonus Features: Commentary by Steve Pond, author of Elvis in Hollywood New featurette: Kingdom: Elvis in Vegas Digitally remastered for imporved picture quality Soundtrack remastered in Dolby Digital 5.1 as well as original Mono Theatrical trailer Subtitles: Français (main feature. bonus material/trailer may not be subtitled)  }",
    "textBeforeTable": "Payment details returns - opens in a new window or tab. Refunds by law: In Australia, consumers have a legal right to obtain a refund from a business for goods purchased if the goods are faulty, not fit for purpose or don't match description. More information at We are 100% committed to ensuring our customers are fully satisfied with their purchase. If you receive a product that is faulty, we will gladly replace the faulty item with a new copy once the faulty item has been returned to us for inspection. We will under no circumstance accept returns for items which are not found to be faulty. If purchasing a DVD from our store, please check the region code of the DVD before purchasing. If you are unsure what a Region code is, please email us and we will gladly explain it to you. Most of the DVDs stocked in our store are imported from the U.S. Therefore your DVD player will need to be compatible with REGION 1 encoded DVD discs. Most DVD players made these days are multi region compatible, however if you are unsure please contact us and we will endeavour to find out for you.",
    "textAfterTable": "Seller's payment instructions Payment is required within 7 days of purchase. If you require more time to pay, please contact us before your purchase is made. Australian buyers may pay via Paypal, Money Order or Bank Deposit. Bank Details: Commonwealth Bank Acc. Name: Urban World Australia BSB No.: 063125 Acc. No.: 10854631 Please note: if paying by bank deposit, we require you to leave your eBAY username as a reference. Current bid amount + + import charges (shown at checkout) time left ##2## left | Bid Count",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}