{
    "relation": [
        [
            "Patent application number",
            "20100204613",
            "20100326587"
        ],
        [
            "Description",
            "Method and apparatus for manipulating a surgical guidewire - A method and apparatus for manipulating a surgical guidewire. The apparatus comprises a chuck for selectively coupling motive force to a surgical guidewire and an actuator, coupled to the chuck, for imparting an axial motive force to the chuck. Embodiments of the invention further comprise a method of using the apparatus.",
            "UPON A CARTRIDGE FOR CONTAINING A SPECIMEN SAMPLE FOR OPTICAL ANALYSIS - An improved cartridge for holding a fluid sample with a small volume is disclosed herein. The cartridge has a test chamber and a vestibule through which the test fluids are inserted into the test chamber. Improved grips are flared-out to aid manipulation. The handle portion is reinforced to prevent flexing, and a prefabricated trough along the edge of the land surface prevents introduction of the adhesive into the region for analysis. The cartridge has a stopper having a dual sealing mechanism, which seals the test chamber inlet between the vestibule and the test chamber, and the mouth of the vestibule so that when the stopper is in place, the test chamber is closed to the admission of air or other contaminants. The vestibule is similarly closed against escape of the overflow from the test chamber. The stopper is composed of a single elastomer. An improved locking mechanism has two flexible walls on either side of the handhold that locks into their respective keepers on the cartridge to provide a secure lock. Additionally, an improved method for loading the cartridge allows for an even distribution of magnetically responsive particles contained within a fluid sample to be viewed in an array through the optically clear land surface portion of the cartridge."
        ],
        [
            "Published",
            "08-12-2010",
            "12-30-2010"
        ]
    ],
    "pageTitle": "Alden, US - Patent applications",
    "title": "",
    "url": "http://www.faqs.org/patents/inventor/alden-us-5/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042992543.60/warc/CC-MAIN-20150728002312-00064-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 438878995,
    "recordOffset": 438860198,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Tor Alden, Basking Ridge, NJ US 01-15-2015 SIGNAL DISTRIBUTION INTERFACE - A user interface for a distributed antenna system (DAS) is provided. When executed by a processor, a signal distribution engine receives information about signals transported by the DAS and components of the DAS. The signal engine generates a signal set assignment user interface including a list of signals transported by the DAS and a signal set formation area for receiving a signal set. The signal engine also generates a signal distribution user interface that includes representations of signal sets, hardware components, and associations between hardware components. In response to receiving a request to associate the signal set with a specified hardware component, a command is output to configure a signal path so that signals in the signal set are provided to the specified hardware component. 20150019979 Published Description Patent application number Sandra D. Alden, Bedford, VA US //]]> BarDraw('3214271',['Patent applications by Robert J. Alden, Birmingham, AL US'],[[1,1,1,1,1]],['2005','2009','2011','2012','2014'],0); // <script type=\"text/javascript\"> </div> <div id=\"legend3214271\" align=\"center\"></div> </div> <canvas id=\"bg3214271\" style=\"max-width: 500px; width: 100%;\"></canvas> <div> <p align=\"center\">Patent applications by Robert J. Alden, Birmingham, AL US</p> <div class=\"bar3214271\" style=\"max-width: 500px; width: 100%; float:left; \"> <div align=\"left\" style=\"padding-top:20px;\"> </table> </tbody> </tr> <td>07-24-2014</td> <td><a href=\"/patents/app/20140202075\">SEED LABELS AND MANUFACTURING METHOD THEREOF</a> - A seed label including a label layer removably attached to a clear film layer by an adhesive layer, and at least one seed disposed between the label layer",
    "textAfterTable": "Patent applications by Tor Alden, Basking Ridge, NJ US Tor Andrew Alden, Basking Ridge, NJ US Patent application number Description Published 20090099473 Apparatus and Method for Acquiring a Signal - An electrode cap for obtaining EPM signals from a head of a subject, the cap comprising: (i) an insulating layer ( 04-16-2009 Trevor Alden, Huntingdon Vally, PA US Patent application number Description Published 20140319825 Battery Water Replenishment System and Method of Installation - The present invention relates to a system and method for coupling a conduit to a valve. The valve includes at least one coupling, wherein the coupling includes inlet leading to an internal chamber of the valve, a collar positioned within the inlet, a gripper positioned partially within the inlet and in contact with at least a portion of the collar, and a wiper seal positioned within the internal chamber. The system further includes a conduit, wherein the conduit is insertable through the gripper via a first force, and wherein the conduit is subsequently insertable through the wiper seal via a second force that is less than the value of the first force. The conduit may",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}