{
    "relation": [
        [
            "Acronym",
            "YAU",
            "YCM",
            "YH",
            "YPM",
            "YU"
        ],
        [
            "Museum",
            "Yunnan Agricultural University, Kunming, China.",
            "Yokosuka City Museum, Yokosuka, Japan",
            "Yukihiko Hirano private collection, Kanagawa, Japan",
            "Peabody Museum of Natural History, 170 Whitney Avenue, Yale University, New Haven, Connecticut 06520, USA",
            "Yunnan University, Kunming, Yunnan, P.R. China"
        ]
    ],
    "pageTitle": "Holotype - Wikispecies",
    "title": "Musea \"Y\"",
    "url": "https://species.wikimedia.org/wiki/Holotype",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042992543.60/warc/CC-MAIN-20150728002312-00306-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 888840375,
    "recordOffset": 888796017,
    "tableOrientation": "HORIZONTAL",
    "lastModified": "Thu, 30 Jul 2015 21:55:53 GMT",
    "textBeforeTable": "A[edit] Directory A B C D E F G H I J K L M N O P Q R S T U V W X Y Z search navigation, Jump to: From Wikispecies Holotype",
    "textAfterTable": "ABF Acaroteca Berlesiana, Istituto Sperimentale per la Zoologia Agraria, Cascine del Riccio (formerly Florence), Italy ABSRC AgroBioSys International Reference collection, Wetteren, Belgium. AC Amherst College [On permanent loan to University of Massachusetts, see MASS] AcAT Agricultural Research Council – Plant Protection Research Institute, Pretoria, South Africa AEI American Entomological Institute, Gainesville, Florida, USA AFCU Plant Protection Dept of the Agricultural Faculty, Cukurova University, Adana, Turkey. AFRI African Butterfly Research Institute, Nairobi. AFUA Department of Biology, Al-Farabi Kazakh National University, Almaty, Kazakhstan AHF Allan Hancock Foundation, Los Angeles, California, USA AHI Alexander Humboldt Institute, Villa de Leyva, Boyacá, Bogotá, Colombia. AI Asociación Ictiológica, La Plata AIK Arachnological Institute of Korea, Seoul, South Korea AJB A.J. Bruce (pers. coll.) AJOU Herbarium, Biological Sciences Department, Ajou University, Suwon City, South Korea AK Herbarium, Auckland War Memorial Museum, New Zealand AL A. Laštuvka personal Collection, Prostejov, Czech Republic. AL-MNRJ Adolpho Lutz collection in MNRJ. AM, AMS, AMSA Australian Museum, Sydney, New South Wales, Australia. AMAZ Herbario Amazonense, Universidad Nacional de la Amazónia Peruana, Iquitos, Peru AME (See MGCL) The McGuire Center for Lepidoptera and Biodiversity, Florida Museum of Natural History, Gainesville, Florida, USA AMEC Australian Museum Entomology Collection. AMES Oakes Ames Orchid Herbarium, Botanical Museum, Harvard University, Cambridge, Massachusetts AM(MMUS)",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}