{
    "relation": [
        [
            "Patent application number",
            "20090192965",
            "20090252345",
            "20110095916",
            "20120254088"
        ],
        [
            "Description",
            "MODEL-DRIVEN EVENT DETECTION, IMPLICATION, AND REPORTING SYSTEM - An event analysis system monitors information available from both publicly and privately distributed networks of information for events that are relevant to the user's particular business concerns. Those concerns are defined in a customized model of the user's organization and external business environment. The system receives the information, detects events in the information, interprets the events, and determines implications of these events. The detection and implication proceeds with regard to specific entities, relationships between entities, and definitions of the types of events which may occur in the environment in which the entities exist. Accordingly, the analysis system intelligently adapts its processing to recognize and report events which may be of interest for any particular entity.",
            "Wearable Computer System and Modes of Operating the System - A wearable computer system has a user interface with at least an audio-only mode of operating, and that is natural in appearance and facilitates natural interactions with the system and the user's surroundings. The wearable computer system may retrieve information from the user's voice or surroundings using a passive user interface. The audio-only user interface for the wearable computer system may include two audio receivers and a single output device, such as a speaker, that provides audio data directly to the user. The two audio receivers may be miniature microphones that collaborate to input audio signals from the user's surroundings while also accurately inputting voice commands from the user. Additionally, the user may enter natural voice commands to the wearable computer system in a manner that blends in with the natural phrases and terminology spoken by the user.",
            "Mobile Personal Services Platform for Providing Feedback - Methods, systems, and apparatus, including computer program products, for generating feedback. In one aspect, a method includes receiving sensor data from a plurality of sensors, wherein at least one of the plurality of sensors is associated with a mobile device of a user; aggregating the received sensor data to generate aggregated sensor data; processing the aggregated sensor data to determine an aggregated metric; comparing the aggregated metric to a target associated with the user to determine a measure of performance; and generating feedback based on the determined measure of performance. Further, the mobile device can comprise a mobile personal services device that includes one or more of an audio sensor, a video sensor, an environmental sensor, a biometric sensor, a location sensor, an activity detector, and a health monitor. The feedback can be displayed on the mobile personal services device. The feedback also can be displayed in near real-time.",
            "MODEL-DRIVEN EVENT DETECTION, IMPLICATION, AND REPORTING SYSTEM - An event analysis system monitors information available from both publicly and privately distributed networks of information for events that are relevant to the user's particular business concerns. Those concerns are defined in a customized model of the user's organization and external business environment. The system receives the information, detects events in the information, interprets the events, and determines implications of these events. The detection and implication proceeds with regard to specific entities, relationships between entities, and definitions of the types of events which may occur in the environment in which the entities exist. Accordingly, the analysis system intelligently adapts its processing to recognize and report events which may be of interest for any particular entity."
        ],
        [
            "Published",
            "07-30-2009",
            "10-08-2009",
            "04-28-2011",
            "10-04-2012"
        ]
    ],
    "pageTitle": "Hughes, CA - Patent applications",
    "title": "",
    "url": "http://www.faqs.org/patents/inventor/hughes-ca-3/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042992543.60/warc/CC-MAIN-20150728002312-00081-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 456449371,
    "recordOffset": 456408690,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Lucian P. Hughes, Half Moon Bay, CA US //]]> BarDraw('3665564',['Patent applications by Kerry F. Hughes, San Francisco, CA US'],[[2,1,1,1,1,1]],['2005','2007','2008','2011','2012','2014'],0); // <script type=\"text/javascript\"> </div> <div id=\"legend3665564\" align=\"center\"></div> </div> <canvas id=\"bg3665564\" style=\"max-width: 500px; width: 100%;\"></canvas> <div> <p align=\"center\">Patent applications by Kerry F. Hughes, San Francisco, CA US</p> <div class=\"bar3665564\" style=\"max-width: 500px; width: 100%; float:left; \"> <div align=\"left\" style=\"padding-top:20px;\"> </table> </tbody> </tr> <td>02-27-2014</td> <td><a href=\"/patents/app/20140053981\">Retaining Ring With Shaped Surface</a> - A retaining ring can be shaped by machining or lapping the bottom surface of the ring to form a shaped profile in the bottom surface. The bottom surface of the retaining ring can include flat, sloped and curved portions. The lapping can be performed using a machine that dedicated for use in lapping the bottom surface of retaining rings. During the lapping the ring can be permitted to rotate freely about an axis of the ring. The bottom surface of the retaining ring can have curved or flat portions.</td> <td>20140053981</td> <tr> </tr> <td>03-22-2012</td> <td><a href=\"/patents/app/20120071067\">RETAINING RING WITH SHAPED SURFACE</a> - A retaining ring can be shaped by machining or lapping the bottom surface of the ring to form a shaped profile in the bottom surface. The bottom surface of the retaining ring can include flat, sloped and curved portions. The lapping can be performed using a machine that dedicated for use in lapping the bottom surface of retaining rings. During the lapping the ring can be permitted to rotate freely about an axis of the ring. The bottom",
    "textAfterTable": "Patent applications by Lucian P. Hughes, Half Moon Bay, CA US Matthew Hughes, San Diego, CA US Patent application number Description Published 20090238210 SLOTTED MODE ACQUISITION - A method for conserving resources in a communication system includes entering an awake state from a sleep state at a first time, where the first time occurs a predetermined period prior to a communication event. The predetermined period is greater than or equal to a worst-case determination period for determining a timing offset relative to an access point. An initial timing offset relative to the access point is determined during the predetermined period. The sleep state is entered for a remainder of the predetermined period upon determination of the initial timing offset. The awake state is entered for the communication event. The timing offset relative to the access point is determined based at least in part on the initial timing offset. 09-24-2009 20100238974 DOWNLINK COMMUNICATION - A method for conserving bandwidth in a communication system includes spreading a data frame and a broadcast frame. A complex data stream having a first component and a second component is generated. The data frame is assigned to the first component",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}