{
    "relation": [
        [
            "Payment method",
            "",
            "Personal cheque",
            "Credit Card"
        ],
        [
            "Preferred/Accepted",
            "PayPal Preferred",
            "Accepted",
            "Accepted"
        ],
        [
            "",
            "",
            "",
            ""
        ]
    ],
    "pageTitle": "Foscam Camera FI8905W 5M DC Extension Cable Lead | eBay",
    "title": "",
    "url": "http://www.ebay.com.au/itm/Foscam-Camera-FI8905W-5M-DC-Extension-Cable-Lead-/140584372677?pt=UK_ConsumerElectronics_PowerAdaptors_SM&hash=item20bb7b49c5",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042992543.60/warc/CC-MAIN-20150728002312-00170-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 424997487,
    "recordOffset": 424953076,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{55210=We always provide a Telephone Number for your to Speak to Us whenever you need to - 0116 212 2754}",
    "textBeforeTable": "Payment details If you have questions about this VAT tax, please contact the seller. The actual VAT requirements and rates may vary depending on the final sale. VAT price: 20.0% (included in the listed price). paid before 23:00 AEST (excludes weekends and holidays). Expected post time may vary and is based on seller's order cut-off time. Will usually send within same business day if Domestic handling time cleared payment- opens in a new window or tabEstimated delivery dates- opens in a new window or tab . Delivery times may vary, especially during peak periods. include seller's handling time, origin ZIP Code, destination ZIP Code and time of acceptance and will depend on shipping service selected and receipt of * Wed. 12 Aug. and Thu. 20 Aug. Estimated between",
    "textAfterTable": "Seller's payment instructions All items paid before 2pm (Mon - Fri) will be posted on the Same Day, aiming for Next Day Delivery in the UK. Customer Services Telephone Number : 0116 212 2754 (Mon - Fri 10am - 3pm) Current bid amount + + import charges (shown at checkout) time left ##2## left | Bid Count",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}