{
    "relation": [
        [
            "Categories",
            "Campus Safety",
            "Greek Life",
            "Clubs and Activities",
            "Share any unusual traditions or locations on campus",
            "Bang for the buck",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "100% best campus safety I've heard of. They even have security vehicles that will transport you to the parking garage at night. I never felt unsafe at all.",
            "We actually don't have greek life.",
            "There are a lot of opportunities for clubs!",
            "I can't think of any.",
            "I feel that I paid a little extra for a great education, and I learned so much. The professors work hard to make sure that you understand everything.",
            "The whole town is fun!",
            "I feel that they could really improve the food honestly, aside from the sandwich line and the mongolian line.",
            "It was pretty great and my dorm advisors were really nice. I really felt comfortable and like I could talk to anyone.",
            "For me, there was a lot of work, but personally hard work is the only way you can learn anything. I loved all of my classes this past semester and learned so much!",
            "I would tell people to start saving money for extra spending...and also that there are no exceptions for partying on campus.",
            "I love the size of Flagler College! The teachers and staff are really in tune with their students. I learned so much this semester."
        ]
    ],
    "pageTitle": "Flagler College-St Augustine Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Flagler-College-St-Augustine/reviews?_escaped_fragment_=/show/16853",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989891.18/warc/CC-MAIN-20150728002309-00185-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 894463523,
    "recordOffset": 894413922,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{41069=Apply early because they were full by Mid- Feb., 255642=© 2015, Cappex.com, LLC, 227481=The teachers are very passionate, they want their students to learn and are willing to do what it takes to help them succeed. The school can be rather strict, the attendance policy is crazy and no interdorm visitation except in FEC starting Fall 2015 semester. There are plenty of opportunities to be involved on campus, plenty of clubs, organizations, a few Greek things., 242866=The Harry Potter Month. Flagler looks like Hogwarts, so it is expected we have a Harry Potter month. Each November the school becomes Hogwarts. The dining hall becomes the great hall with flying owls and all of the faculty becomes a professor of Hogwarts, bitterer and wizardly treats are ensured. There is also de destress week and some festivals on west lawn., 226310=Quiet for the most part, it's easy to change roommates if necessary. You can't have drugs or alcohol but there's specific smoking places. No interdorm visitation but there will be in FEC fall 2015 and there will be limits on that., 166772=We have a Harry Potter day in November which is pretty cool.}",
    "textBeforeTable": "09/08/2009 Reviewer is A current student here. 30 out of 31 people found this review useful. 1 of 61 Amy from Saint Augustine , FL Check out reviews left by other students or leave your own review. You could win a free scholarship. Flagler College-St Augustine Reviews Flagler College-St Augustine › Florida › By State › Colleges › } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.create', -->",
    "textAfterTable": "Login to rate or flag the reviews Rebecca from Jacksonville, FL 12/14/2010 Reviewer is A current student here. 9 out of 9 people found this review useful. 3 of 61 Categories Comments Great for these types of students This college is great for people who like small classes and wants a close relationship with the professor. Also, if you really like art and history, this is the place to be. Tips for prospective students Make sure you get a job during college. That money will depleat faster than you think. Also, make sure you budget. Take some time to go to the gym. College food is better than high school, but remember they make it in masses. So, it might not be as healthy as you think. Don't put off work. You will be stressing extremely bad if you put it off along with all-nighters. Bang for the buck The cost of Flagler is quite low, which I love. I barely pay $10,000, which",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}