{
    "relation": [
        [
            "",
            "Sitagliptin",
            "Placebo"
        ],
        [
            "Description",
            "Sitagliptin 100 mg daily (q.d.) + acarbose (continuing the current stable dose of at least 50 mg three times daily [t.i.d.])",
            "Placebo q.d. + acarbose (continuing the current stable dose of at least 50 mg t.i.d.)"
        ]
    ],
    "pageTitle": "Clinical Trial to Evaluate the Safety and Efficacy of the Addition of Sitagliptin in Participants With Type 2 Diabetes Mellitus Receiving Acarbose Monotherapy (MK-0431-130) - Study Results - ClinicalTrials.gov",
    "title": "",
    "url": "https://clinicaltrials.gov/ct2/show/results/NCT01177384?sect=X01256&view=results",
    "hasHeader": true,
    "headerPosition": "MIXED",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989891.18/warc/CC-MAIN-20150728002309-00094-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 859810137,
    "recordOffset": 859793743,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Reporting Groups All participants randomized population. The participant flow module includes the second sequential randomization of a participant in the placebo group. Data for the second sequential randomization were excluded from the efficacy and safety analyses and the reason for not completed was a protocol violation. Significant events and approaches for the overall study following participant enrollment, but prior to group assignment Pre-Assignment Details No text entered. Key information relevant to the recruitment process for the overall study, such as dates of the recruitment period and locations Recruitment Details   Hide Participant Flow   Participant Flow Drug: Sitagliptin phosphate Drug: Comparator: Placebo Drug: Acarbose Drug: Glimepiride Interventions: Type 2 Diabetes Mellitus Condition: Allocation: Randomized;   Endpoint Classification: Safety/Efficacy Study;   Intervention Model: Parallel Assignment;   Masking: Double Blind (Subject, Investigator);   Primary Purpose: Treatment",
    "textAfterTable": "Participant Flow:   Overall Study     Sitagliptin     Placebo   STARTED     191     190 [1] COMPLETED     177     164   NOT COMPLETED     14     26   Adverse Event                 6                 4   Lack of Efficacy                 0                 1   Lost to Follow-up                 3  ",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}