{
    "relation": [
        [
            "Religion",
            "Other",
            "Catholic",
            "Evangelical Protestant",
            "Mainline Protestant",
            "Black Protestant",
            "None"
        ],
        [
            "Adherents",
            "230,405",
            "12,782",
            "7,928",
            "1,135",
            "200",
            "54,029"
        ],
        [
            "Congregations",
            "556",
            "1",
            "34",
            "7",
            "1",
            "-"
        ]
    ],
    "pageTitle": "Syracuse, Utah (UT 84075) profile: population, maps, real estate, averages, homes, statistics, relocation, travel, jobs, hospitals, schools, crime, moving, houses, news, sex offenders",
    "title": "",
    "url": "http://www.city-data.com/city/Syracuse-Utah.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989891.18/warc/CC-MAIN-20150728002309-00210-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 358343279,
    "recordOffset": 358215260,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{7346=According to our research of Utah and other state lists there were 30 registered sex offenders living in Syracuse, Utah as of August 03, 2015. The ratio of number of residents in Syracuse to the number of sex offenders is 837 to 1. The number of registered sex offenders compared to the number of residents in this city is smaller than the state average., 26136=Incorporated on 09/03/1935, 128572=We are giving away $1200 in prizes - enter simply by sending us your own city pictures!}",
    "TableContextTimeStampAfterTable": "{46591=Graphs represent county-level data. Detailed 2008 Election Results, 45735=2004 Presidential Elections Results, 31119=Particulate Matter (PM10) [µg/m3] level in 2012 was 21.0. This is about average. Closest monitor was 6.3 miles away from the city center., 31868=Particulate Matter (PM2.5) [µg/m3] level in 2012 was 6.93. This is better than average. Closest monitor was 7.8 miles away from the city center., 28945=Nitrogen Dioxide (NO2) [ppb] level in 2012 was 16.3. This is significantly worse than average. Closest monitor was 7.4 miles away from the city center., 61639=7.52% of this county's 2011 resident taxpayers lived in other counties in 2010 ($41,365 average adjusted gross income), 45163=1996 Presidential Elections Results, 29689=Sulfur Dioxide (SO2) [ppb] level in 2012 was 2.58. This is worse than average. Closest monitor was 10.5 miles away from the city center., 28223=Carbon Monoxide (CO) [ppm] level in 2012 was 0.410. This is worse than average. Closest monitor was 6.3 miles away from the city center., 24219=Tourist attraction: Syracuse Museum And Cultural Center (1726 Heritage Ln)., 46307=2012 Presidential Elections Results, 42002=Educational Attainment (%) in 2013, 30420=Ozone [ppb] level in 2012 was 31.9. This is about average. Closest monitor was 6.3 miles away from the city center., 63836=7.93% of this county's 2010 resident taxpayers moved to other counties in 2011 ($41,491 average adjusted gross income), 46021=2008 Presidential Elections Results, 135433=Recent home sales, price trends, and home value evaluator powered by Onboard Informatics © 2015 Onboard Informatics. Information is deemed reliable but not guaranteed.   City-data.com does not guarantee the accuracy or timeliness of any information on this site.  Use at your own risk. Website © 2015 Advameg, Inc., 70724=Fatal road traffic accident statistics for 1975 - 2013 (per 100,000 population), 45449=2000 Presidential Elections Results, 27571=Air Quality Index (AQI) level in 2012 was 94.8. This is worse than average., 42400=School Enrollment by Level of School (%) in 2013, 134148=Total of 190 patent applications in 2008-2015.}",
    "textBeforeTable": "Religion statistics for Syracuse city (based on Davis County data) Graphs represent county-level data. Detailed 2008 Election Results 2012 Presidential Elections Results 2008 Presidential Elections Results 2004 Presidential Elections Results 2000 Presidential Elections Results 1996 Presidential Elections Results 2012 2008 2004 2000 1996 Presidential Elections Results Electricity (9%) Utility gas (91%) Most commonly used house heating fuel:",
    "textAfterTable": "Source: Clifford Grammich, Kirk Hadaway, Richard Houseal, Dale E.Jones, Alexei Krindatch, Richie Stanley and Richard H.Taylor. 2012. 2010 U.S.Religion Census: Religious Congregations & Membership Study. Association of Statisticians of American Religious Bodies. Jones, Dale E., et al. 2002. Congregations and Membership in the United States 2000. Nashville, TN: Glenmary Research Center. Graphs represent county-level data Food Environment Statistics: Number of grocery stores: 25 Davis County: 0.87 / 10,000 pop. Utah: 1.37 / 10,000 pop. Number of supercenters and club stores: 6 This county: 0.21 / 10,000 pop. State: 0.18 / 10,000 pop. Number of convenience stores (no gas): 6 Davis County: 0.21 / 10,000 pop. Utah: 0.41 / 10,000 pop. Number of convenience stores (with gas): 56 Davis County: 1.95 / 10,000 pop. State: 2.82 / 10,000 pop. Number of full-service restaurants: 106 Here: 3.68 / 10,000 pop. State: 5.09 / 10,000 pop. Adult diabetes rate: This county:",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}