{
    "relation": [
        [
            "Box",
            "18",
            "18",
            "18",
            "18",
            "18",
            "18",
            "18",
            "18",
            "18",
            "18",
            "18",
            "18",
            "18",
            "18",
            "18",
            "18",
            "18",
            "18",
            "18",
            "18",
            "18",
            "18",
            "18"
        ],
        [
            "Reel",
            "unfilmed",
            "unfilmed",
            "unfilmed",
            "unfilmed",
            "unfilmed",
            "unfilmed",
            "unfilmed",
            "unfilmed",
            "unfilmed",
            "unfilmed",
            "unfilmed",
            "unfilmed",
            "unfilmed",
            "unfilmed",
            "unfilmed",
            "unfilmed",
            "unfilmed",
            "unfilmed",
            "unfilmed",
            "unfilmed",
            "unfilmed",
            "unfilmed",
            "unfilmed"
        ],
        [
            "",
            "Manuscript, undated",
            "Manuscript (Italian Translation), undated",
            "Idea: The History of a Concept",
            "Appendices, undated",
            "Footnotes, undated",
            "Manuscript (1968 edition), circa 1967",
            "Preface (in German), 1959",
            "Meaning in the Visual Arts: Papers in and on Art History",
            "Preface, List of Illustrations and Captions, Footnotes, undated",
            "Chapter 3, \"Abbot Suger and St.-Denis,\" circa 1944 (2 folders)",
            "Chapter 4, \"Titian's Allegory of Prudence: A Postscript,\" undated",
            "Chapter 5, \"The First Page of Giorgio Vasari's Libro, undated",
            "Chapter 6, \"Albrecht Dürer and Classical Antiquity With an Excursas on the Illustrations of Apianus' Inscriptiones in Relation to Dürer,\" undated",
            "Problems in Titian, Mostly Iconographic (see also: Lecture Notes)",
            "Draft, undated (4 folders)",
            "Draft (List of Illustrations), undated",
            "Galley Proofs (corrected), undated (2 folders)",
            "Manuscript, undated (8 folders)",
            "Notes, undated",
            "Renaissance and Renascences in Western Art",
            "Footnotes and Illustrations (1960 edition), undated",
            "Saturn and Melancholy: Studies in the History of Natural Philosophy, Religion, and Art [with Raymon Klibansky and Fritz Saxl]",
            "Galley Proofs (corrected), 1936 (3 folders)"
        ]
    ],
    "pageTitle": "Detailed description of the Erwin Panofsky papers, 1904-1990, bulk, 1920-1968 | Archives of American Art, Smithsonian Institution",
    "title": "",
    "url": "http://www.aaa.si.edu/collections/erwin-panofsky-papers-8926/more",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989891.18/warc/CC-MAIN-20150728002309-00292-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 268651855,
    "recordOffset": 268606310,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{5129=Among the Archives' holdings is a collection of letters from Erwin Panofsky to art historians Wolfgang Stechow (1930-1931) and Lili Fröhlich-Bum (1931), and to Brooklyn Museum art librarian William B. Walker (1960) which is available on 35-mm microfilm reel 5136, frames 812-824. The letters to Stechow were written as he was preparing a review of Panofsky's book, Hercules am Scheidewege und andere antike Bildstoffe inder neueren Kunst, and provide additional information not found in the book itself. The letter to Mr. Walke is in Englishe, and the remainder are in German. The originals are still in the possession of Irving Lavin, who found them in Stechow's copy of Hercules am Scsheidewege given him by Mrs. Stechow., 3459=Series 1: Correspondence, is available on 35-mm microfilm reels 2108-2128 at Archives of American Art and through interlibrary loan., 4319=Correspondence was processed by AAA staff prior to microfilming in 1981. The papers were rehoused and the unmicrofilmed portion was arranged in accordance with archival standards by Catherine S. Gaines in 2006., 11150=He taught at the University of Hamburg from 1920 to1933, and during this period began to develop iconographic approaches to interpreting art through analysis of its subject matter's symbols, themes, and history. His work in this area eventually had international influence in the development of art history as a discipline., 7926=The papers of Erwin Panofsky measure 19.3 linear feet and are dated 1904-1990 (bulk dates 1920-1968). They consist of correspondence, writings, biographical material, and printed material documenting Panofsky's career as an art historian, teacher, and writer., 3237=Erwin Panofsky papers, 1904-1990 (bulk dates 1920-1968). Archives of American Art, Smithsonian Institution., 8854=The recipient of numerous honorary degrees, Panofsky most prized the first from the University of Utrecht, 1936, as it brought great satisfaction at a time when he was still coping with the trauma of expatriation. He was a member of the American Philosophical Society, the American Academy of Arts and Sciences, the British Academy, and several other foreign academies. In 1962, Panofsky received the Haskins Medal awarded by The Medieval Academy of America for a distinguished book in medieval history., 5290=The Erwin Panofsky papers were donated by his widow, Dr. Gerda Soergel Panofsky, in 1979 and 1990., 10812=Beginning in 1931, Panofsky taught at New York University, spending alternate semesters at the University of Hamburg until the Nazis dismissed all Jewish officials. He and his family fled Germany and came to the United States in 1933. During the academic year 1934/35, Panofsky held concurrent appointments at both New York University and Princeton University. He joined the faculty of the newly formed Institute for Advanced Study, Princeton, New Jersey, in 1935, where he remained until his retirement in 1962. In addition, he continued to teach graduate seminars at New York University and Princeton Universtiy., 8336=His wife Dora Mosse Panofsky died in 1965; in 1966, he married Gerda Soergel, also an art historian. Erwin Panofsky died in Princeton, New Jersey, March 14, 1968., 12010=Erwin Panofsky (1892-1968), a native of Hannover, Germany, grew up in Berlin where he received a classical education at the Joachimsthalsches Gymnasium. He then studied at the universities of Berlin, Munich and Freiburg/Breslau. After earning a Ph. D. in 1914 from the University of Freiburg, Panofsky spent three years on post-doctoral study in Berlin, and during this period, married fellow student and art historian Dorothea (Dora) Mosse., 9189=Panofsky wrote on subjects other than art history. He was an authority on Mozart, and also wrote about the history of cinema. His 1934 article \"On Movies\" (originally published in Princeton University's Bulletin of the Department of Art and Archaeology), remains a highly regarded work on the subject.}",
    "TableContextTimeStampAfterTable": "{316507=Copyright (c) 2015 Archives of American Art   |   Smithsonian Institution   |   Privacy   |   Terms of Use   |   Contact Us       }",
    "textBeforeTable": "Colleagues, Scholars, Students and Other Individuals, 1921-1978, undated 1.1: 1.9: Unfilmed Correspondence, 1925-1967, undated (unfilmed) 1.8: Miscellaneous, 1940-1969 (Reels 2127-2128) 1.7: Periodicals, 1937-1967 (Reel 2127) 1.6: Organizations, Societies, and Congresses, 1937-1967 (Reel 2127) 1.5: Colleges, Universities, and Institutes, 1936-1968, undated (Reels 2126-2127) 1.4: Libraries, 1941-1967 (Reels 2125-2126) 1.3: Galleries and Museums, 1925-1968 (Reel 2125) 1.2: Art Dealers, 1932-1967 (Reels 2124-2125) 1.1: Colleagues, Scholars, Students and Other Individuals, 1921-1978, undated (Reels 2108-2124) This series is arranged into 9 subseries. Subseries 1.2, 1.3 and 1.4 are arranged alphabetically by geographical location. Subseries 1.9 is in chronological order. All remaining subseries are arranged alphabetically. 1.8: Miscellaneous, arranged by subject, includes: requests for reviews, contributions to encyclopedias and dictionaries, and requests to write books; acknowledgements and thank you letters, 70th birthday congratulations; U.S. government, embassies and consulates. 1.9: Unfilmed Correspondence, received many years after microfilming was completed, is arranged chronologically and overlaps the dates and categories of correspondents represented in the preceeding subseries. His most prolific correspondents include: Udo von Alvensleben, Walter William Spencer Cook, Paul Coremans, Walter Friedländer, William S. Heckscher, Ludwig H. Heydenreich, Horst Janson, Adolf Katzenellenbogen, Richard Krauatheimer, Edward E. Lowinsky, Millard Meiss, Gert von der Osten, Richard Salomon, Craig Smyth, Wolfgang Stechow, Booth and Betty Tarkington, Egon Verheyen, and Wilhelm Vöge. Erwin Panofsky's correspondence documents his research, writing, teaching, lecturing, and",
    "textAfterTable": "1 2108 Askew - Aubert, 1952-1965 Askew, Pamela Aubert, Marcel 1 2108 Auerbach, Erich, 1949-1965 1 2108 Aurenhammer, Hans, 1956-1967 1 2108 Aydelotte, 1944-1965 Aydelotte, Frank Aydelotte, William O. 1 2108 B, General (single letters, Bailey - Blair), 1937-1967 Bailey, Stephen K. Bainton, Roland H. Baker, Carlos Bannister, Turpin Barbour, J. Murray Barker, John W. Barnhart, Clarence L. Barnouw, A. J. Baron, H. Barton, Jess Bassi, Stelio Bates, Donald G. Baudry, J. Bayón, Damián Carlos Beaujouan, Guy Becker, Marion R. Beckley, Quitman Behling, Lottlisa Belangie, W. M. Belen, Van der, Jack and Herman Liebaers Beller, Elmer Bellinger, Alfred R. Belluschi, Pietro Belt, Elmer Berenson, Bernard [copy from S. J. Camp] Berg, Gösta Van der Berg-Noë Berger, Pamela Bergamnn, Rosemarie Berry, Francis Bertelli, Dr. and Mrs. Carlo Biberman, Herbert Bielefeld, Erwin Bishop, Katherine Blair, David Blair, Madeline S. 1 2108 B, General (single letters, de Blanc - Brown), 1946-1966 de Blanc, George G. Blanco-Gguinaga, Carlos Bloch, Robert Blom, Frans Blue Card, Inc. Bock von Wülfingen, Ordenberg Boehringer, Erioco Boggs, Jean S. Bonow, Eunice R. Bony, Mary Borgerhoff, E. Borromeo d'Adda, Contessa Orietta Bosi, Maria",
    "hasKeyColumn": true,
    "keyColumnIndex": 2,
    "headerRowIndex": 0
}