{
    "relation": [
        [
            "Postage and handling",
            "Free postage",
            "US $25.00"
        ],
        [
            "Each additional item",
            "Free",
            "Free"
        ],
        [
            "To",
            "United States",
            "United States"
        ],
        [
            "Service",
            "Economy Shipping from outside US",
            "Standard Shipping from outside US"
        ],
        [
            "Delivery*",
            "Estimated within 12-36 business days",
            "Estimated within 6-13 business days"
        ]
    ],
    "pageTitle": "",
    "title": "",
    "url": "http://www.ebay.com.au/itm/wholesale-lot-24pcs-Fashion-Rhinestone-Nose-Ring-Bone-Stud-Body-Piercing-Jewelry-/130695052608?pt=LH_DefaultDomain_0&var=&hash=item6422087dc8",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042992543.60/warc/CC-MAIN-20150728002312-00226-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 411115119,
    "recordOffset": 411069843,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Please enter five or nine numbers for the postcode. Please enter a valid postcode. Postcode: Select a valid country. There are 0 items available. Please enter a number less than or equal to 0. -Select- Brazil Cyprus Czech Republic Denmark Finland Greece Iceland Israel Korea, South Mexico Netherlands New Zealand Norway Philippines Poland Portugal Singapore Sweden Ukraine United States Virgin Islands (U.S.) Change country: Excludes: Fiji, Papua New Guinea, Guadeloupe, Marshall Islands, Wallis and Futuna, Gambia, Malaysia, Mayotte, Taiwan, Suriname, Oman, Kenya, United Arab Emirates, Argentina, Guinea-Bissau, Togo, Senegal, Armenia, Bhutan, Uzbekistan, Ireland, Qatar, Falkland Islands (Islas Malvinas), Burundi, Slovakia, Iraq, Equatorial Guinea, Slovenia,",
    "textAfterTable": "* Estimated delivery dates- opens in a new window or tab include seller's handling time, origin ZIP Code, destination ZIP Code and time of acceptance and will depend on shipping service selected and receipt of cleared payment- opens in a new window or tab. Delivery times may vary, especially during peak periods. Domestic handling time Will usually post within 1 business day of receiving cleared payment - opens in a new window or tab. Return policy Item must be returned within Refund will be given as 14 days after the buyer receives it Money Back The buyer is responsible for return postage costs.",
    "hasKeyColumn": true,
    "keyColumnIndex": 3,
    "headerRowIndex": 0
}