{
    "relation": [
        [
            "type",
            "FR Doc.",
            "RIN",
            "Docket No."
        ],
        [
            "regulations.gov",
            "2015-07836",
            "0648-XD66",
            "141216999-5311-01"
        ]
    ],
    "pageTitle": "50 CFR 224.104 - Special requirements for fishing activities to protect endangered sea turtles. | US Law | LII / Legal Information Institute",
    "title": "",
    "url": "https://www.law.cornell.edu/cfr/text/50/224.104?quicktabs_7=3",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989891.18/warc/CC-MAIN-20150728002309-00201-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 924021727,
    "recordOffset": 923995107,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{1193=Title 50 published on 2014-10-01.}",
    "TableContextTimeStampAfterTable": "{28769=We, the National Marine Fisheries Service, announce the revised taxonomy of Monachus schauinslandi (Hawaiian monk seal) under the Endangered Species Act of 1973, as amended (ESA). We are revising the Enumeration of endangered marine and anadromous species and Critical habitat for Hawaiian monk seals to reflect the scientifically accepted taxonomy and nomenclature of this species. We revise the scientific name of the species as follows: Neomonachus schauinsland i (= M. schauinslandi )., 31312=§ 1533 - Determination of endangered species and threatened species, 22829=We, NMFS, issue this final rule implementing our determination that the narrow sawfish ( Anoxypristis cuspidata ), dwarf sawfish ( Pristis clavata ), largetooth sawfish (collectively Pristis pristis; formerly Pristis pristis, Pristis microdon, and Pristis perotteti ), green sawfish ( Pristis zijsron ), and the non-U.S. distinct population segment (DPS) of smalltooth sawfish ( Pristis pectinata) are endangered species under the Endangered Species Act (ESA) of 1973, as amended. We also include a change in the scientific name for largetooth sawfish in this final rule to codify the taxonomic reclassification of P. perotteti to P. pristis. We are not designating critical habitat because the geographical areas occupied by the species are entirely outside U.S. jurisdiction and we have not identified any unoccupied areas within U.S. jurisdiction that are essential to the conservation of any of the five species. We have reviewed the status of the five species of sawfish, considered public and peer review comments, and conservation efforts being made to protect all five species, and we have made our determination based on the best available scientific and commercial data that all five species of sawfish—the narrow sawfish ( Anoxypristis cuspidata ), dwarf sawfish ( Pristis clavata ), largetooth sawfish (collectively Pristis pristis; formerly Pristis pristis, Pristis microdon, and Pristis perotteti ), green sawfish ( Pristis zijsron ), and the non-U.S. DPS of smalltooth sawfish ( Pristis pectinata) —are at risk of extinction throughout all of their ranges and should be listed as endangered species., 7941=On January 25, 2013, we, NMFS, received a petition submitted by the People for the Ethical Treatment of Animals Foundation to remove the exclusion of captive animals from the endangered species listing of Southern Resident killer whale DPS, as well as, recognize the captive killer whale ( Orcinus orca ) “Lolita” as a protected member of the endangered Southern Resident killer whale Distinct Population Segment (DPS). We completed a status review and published a proposed rule, and we are now amending the regulatory language of the Endangered Species Act (ESA) listing of the DPS by removing the exclusion for captive members of the population. We have further determined that Lolita, a female killer whale captured from the Southern Resident killer whale population in 1970 who resides at the Miami Seaquarium in Miami, Florida, is not excluded from the Southern Resident killer whale DPS due to her captive status. We proposed to amend the regulatory language of the ESA listing to remove the exclusion for captive whales from the Southern Resident killer whale DPS on January 27, 2014. Additionally, we solicited scientific and commercial information pertaining to the proposed rule and also conducted a peer review of the status review information on Lolita that informed the proposed rule. We have determined that captive members of the Southern Resident killer whale population should be included in the listed Southern Resident killer whale DPS. This rule amends the regulatory language of the listing to remove the exclusion for captive members of the DPS., 18226=This action corrects the amendatory instruction to a final rule published on December 12, 2014, which incorrectly instructed deletion of the U.S. Distinct Population Segment of smalltooth sawfish ( Pristis pectinata ) from the list of endangered species under the Endangered Species Act. This correction removes the incorrect language from the instruction., 32173=§ 1541 - Endangered plants, 63378=We, NMFS, have completed a comprehensive status review of the humpback whale ( Megaptera novaeangliae ) under the Endangered Species Act of 1973, as amended (ESA) (16 U.S.C. 1531 et seq. ) and announce a proposal to revise the listing status of the species. We propose to divide the globally listed endangered species into 14 distinct population segments (DPSs), remove the current species-level listing, and in its place list 2 DPSs as endangered and 2 DPSs as threatened. The remaining 10 DPSs are not proposed for listing based on their current statuses. This proposal also constitutes a negative 12-month finding on a petition to delineate and “delist” a DPS of humpback whales spanning the entire North Pacific and a positive 12-month finding on a petition to delineate and “delist” a DPS in the Central North Pacific (Hawaii breeding population). At this time, we do not propose to designate critical habitat for the two listed DPSs that occur in U.S. waters (Western North Pacific, Central America) because it is not currently determinable. In order to complete the critical habitat designation process, we also solicit information on essential physical and biological features of the habitat of these two DPSs., 30897=§ 1361 - Congressional findings and declaration of policy, 48009=On March 23, 2015, we (NMFS and USFWS, or the Services) published a proposed rule to revise the green sea turtle ( Chelonia mydas; hereafter referred to as the green turtle) listings under the Endangered Species Act (ESA). We proposed to remove the current range-wide listing and, in its place, list eight distinct population segments (DPSs) as threatened and three as endangered. We opened a public comment period that lasted through June 22, 2015, announced a public hearing in Honolulu, Hawaii, and solicited requests for additional public hearings. With this document, we announce additional public hearings in Guam, the Commonwealth of the Northern Mariana Islands (CNMI), and American Samoa. To allow adequate time for comments after the last public hearing, we extend the public comment period through July 27, 2015., 31996=§ 1539 - Exceptions, 31622=§ 1536 - Interagency cooperation, 31441=§ 1534 - Land acquisition, 31016=§ 1362 - Definitions, 31910=§ 1538 - Prohibited acts, 31230=§ 1532 - Definitions, 31098=§ 1531 - Congressional findings and declaration of purposes and policy, 57975=We, the National Marine Fisheries Service (NMFS), announce a 90-day finding on a petition to delist the Snake River fall-run Chinook salmon ( Oncorhynchus tshawytscha ) (Snake River fall-run Chinook) Evolutionarily Significant Unit (ESU) under the Endangered Species Act (ESA). The Snake River fall-run Chinook ESU was listed as threatened under the ESA in 1992. We reviewed the status of the ESU in 2005 and again in 2011 and concluded that the ESU's classification as a threatened species remained appropriate. We find that the petition presents substantial scientific information indicating that the petitioned action may be warranted. We hereby initiate a status review of the Snake River fall-run Chinook ESU to determine whether the petitioned action is warranted. To ensure that the status review is comprehensive, we are soliciting scientific and commercial information pertaining to this species., 32261=§ 1542 - Authorization of appropriations, 32077=§ 1540 - Penalties and enforcement, 37208=On March 23, 2015, NMFS and USFWS (or the Services) published a proposed rule to revise the listings of the green sea turtle ( Chelonia mydas; hereafter referred to as the green turtle) under the Endangered Species Act (ESA). We opened a public comment period that lasted through June 22, 2015. On June 7, 2015, we published a notice extending the public comment period through July 27, 2015. Having received requests to further extend the comment period, with this document we extend the comment period to August 26, 2015., 31716=§ 1537 - International cooperation, 78636=We, NMFS, are accepting two 2010 petitions to list porbeagle sharks ( Lamna nasus ) on the Federal List of Endangered and Threatened Wildlife under the Endangered Species Act (ESA) of 1973, as amended. This action is being taken in response to a December 12, 2014, U.S. District Court decision that our previous rejection of the petitions in 2010 was arbitrary and capricious. To ensure a comprehensive review, we are soliciting scientific and commercial data and other information relevant to the status of porbeagle sharks worldwide. We will publish the results of that review and will make a finding as to whether the petitioned action is or is not warranted on or before December 12, 2015., 31528=§ 1535 - Cooperation with States, 52879=We, NMFS, announce the extension of the public comment period on our March 03, 2015, 90-day finding on a petition to list the Common Thresher Shark ( Alopias vulpinus ) as endangered or threatened under the ESA, or, in the alternative, delineate six distinct population segments (DPSs) of the common thresher shark, as described in the petition, and list them as endangered or threatened. As part of that finding, we solicited scientific and commercial information about the status of this species and announced a 60-day comment period to end on May 04, 2015. Today, we extend the public comment period by 60 days to July 6, 2015. Comments previously submitted need not be resubmitted, as they will be fully considered in the agency's 12-month finding., 32363=§ 1543 - Construction with Marine Mammal Protection Act of 1972, 32762=Title 50 published on 2014-10-01}",
    "lastModified": "Mon, 03 Aug 2015 13:10:54 GMT",
    "textBeforeTable": "Additional Documents GPO FDSys XML | Text 80 FR 7977 - Endangered and Threatened Species; Designation of Critical Habitat for the Puget Sound/Georgia Basin Distinct Population Segments of Yelloweye Rockfish, Canary Rockfish and Bocaccio; Correction 2015-02-13; vol. 80 # 30 - Friday, February 13, 2015 For a complete list of all Rules, Proposed Rules, and Notices view the Rulemaking tab. The following are only the Rules published in the Federal Register after the published date of Title 50. Title 50 published on 2014-10-01. 72 FR 31757, June 8, 2007] 69 FR 18453, Apr. 7, 2004; 68 FR 8471, Feb. 21, 2003; 66 FR 67496, Dec. 31, 2001; 66 FR 44552, Aug. 24, 2001; 64 FR 14066, Mar. 23, 1999, as amended at [ Special prohibitions relating to sea turtles are provided at § 223.206(d).",
    "textAfterTable": "DEPARTMENT OF COMMERCE, National Oceanic and Atmospheric Administration Correcting amendment. This final rule is effective February 11, 2015. 50 CFR Parts 223 and 224 Summary This action corrects an omission in the final rule to designate critical habitat for three DPSs of rockfish from the Puget Sound/Georgia Basin. The final rule for “Designation of Critical Habitat for the Puget Sound/Georgia Basin Distinct Population Segments of Yelloweye Rockfish, Canary Rockfish and Bocaccio” failed to update the columns labeled “Critical habitat,” in the tables of threatened and endangered species to cross reference these new rules. Therefore, this document corrects the tables by citing the critical habitat designations in the columns of the tables. 2015-02-10; vol. 80 # 27 - Tuesday, February 10, 2015 80 FR 7380 - Listing Endangered or Threatened Species: Amendment to the Endangered Species Act Listing of the Southern Resident Killer Whale Distinct Population Segment GPO FDSys XML | Text",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}