{
    "relation": [
        [
            "",
            "Chest (IN.)",
            "Waist (IN.)",
            "Hip (IN.)"
        ],
        [
            "X-LARGE",
            "39-40",
            "31¼",
            "42¼"
        ]
    ],
    "pageTitle": "Patagonia Women's Lightweight Synchilla™ Snap-T® Pullover | Portofino Pink",
    "title": "",
    "url": "http://www.patagonia.com/eu/enGB/product/womens-synchilla-lightweight-fleece-snap-t-pullover?p=25455-0-POFP&pcc=1148",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989891.18/warc/CC-MAIN-20150728002309-00142-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 636008615,
    "recordOffset": 635983060,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{61286=Patagonia has worked with bluesign technologies since 2000 to evaluate and reduce resource consumption in our materials supply chain, and to assist us with managing the chemicals, dyes and finishes used in the process. bluesign technologies, based in Switzerland, works at each step in the textile supply chain to approve chemicals, processes, materials, and products that are safe for the environment, safe for workers, and safe for end customers., 61749=In 2007, Patagonia became the first brand to officially join the network of bluesign® system partners., 59614=In 1993, we adopted fleece into our product line made from post consumer recycled (PCR) plastic soda bottles. We were the first outdoor clothing manufacturer to do so. PCR™ clothing was a positive step towards a more sustainable system – one that uses fewer resources, discards less and better protects people’s health., 69935=Measurements refer to body size, not garment dimensions. * Beginning with our Spring 2015 styles, we've improved our women’s fit: There’s a slight increase at the waist for shaping and to ensure the fit is truer to size. All other measurements, such as chest and hip, remain the same. Please refer to our new, updated Women's Size Chart for details. Note: this change applies to full-price Spring 2015 styles, not to past-season or on-sale items.}",
    "textBeforeTable": "Women's Sizing Information Fit Guide Size Chart We promote fair labor practices, safe working conditions and environmental responsibility throughout the Patagonia supply chain. Below are the suppliers that impact the Patagonia Women's Lightweight Synchilla™ Snap-T® Fleece Pullover View our supply chain The Footprint Chronicles® Any fabric you see that’s bluesign® approved offers the highest level of consumer safety by employing methods and materials in their manufacture that conserve resources and minimize impacts on people and the environment. In 2007, Patagonia became the first brand to officially join the network of bluesign® system partners. Patagonia has worked with bluesign technologies since 2000 to evaluate and reduce resource consumption in our materials supply chain, and to assist us with managing the chemicals, dyes and finishes used in the process. bluesign technologies, based in Switzerland, works at each step in the textile supply chain to approve chemicals, processes, materials, and products that are safe for the",
    "textAfterTable": "Waist (IN.) 25.5-26.5 27.5-28.5 29.5-30.5 32-33.5 35 Inseam (IN.) 31 32 32 32 32 Short Inseam (IN.) 30 30 30 30 30 Regular Inseam (IN.) 32 32 32 32 32 Long Inseam (IN.) 34 34 34 34 34 IN = Inches. X-Small Small Medium Large X-Large 0-2 4-6 8-10 12-14 16 Waist (CM.) 65-67 70-72 75-77 81-85 90 Inseam (CM.) 79 81 81 81 81 Short Inseam (CM.) 76 76 76 76 76 Regular Inseam (CM.) 81 81 81 81 81 Long Inseam (CM.) 86 86 86 86 86 CM",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}