{
    "relation": [
        [
            "Pos",
            "1",
            "2",
            "3",
            "4",
            "5",
            "6",
            "7",
            "8",
            "9",
            "10"
        ],
        [
            "Car Number",
            "10",
            "71",
            "11",
            "34",
            "37",
            "07",
            "2",
            "M74",
            "68",
            "69"
        ],
        [
            "Name",
            "Chuck Wilkinson",
            "Harold Morence Jr.",
            "Brian Beckner",
            "Dale Wagner",
            "Bruce Jones",
            "Jordan Harvey",
            "Jamie Feguer",
            "Nathan Moon",
            "Tony Pastorino",
            "Al Williams"
        ],
        [
            "Behind Leader",
            "",
            "1.304",
            "1.410",
            "2.607",
            "2.838",
            "2.969",
            "3.346",
            "3.380",
            "7.314",
            "--7 Laps--"
        ],
        [
            "Gap",
            "",
            "1.304",
            "0.106",
            "1.197",
            "0.231",
            "0.131",
            "0.377",
            "0.034",
            "3.934",
            "--7 Laps--"
        ]
    ],
    "pageTitle": "Spartan Speedway 2005 Archive Race Recap",
    "title": "",
    "url": "http://spartanspeedway.com/numbers/2005recap.php?id=590",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989891.18/warc/CC-MAIN-20150728002309-00327-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 213835207,
    "recordOffset": 213823472,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{1319=Lee Taylor found himself in the WITL Winner’s Circle again at Spartan Speedway. Taylor started on the pole for the Andrews Chevrolet Super Late Model 40-lap feature, with Bill Heeney Jr. taking the lead on lap one. Heeney continued to lead as point leader, Dave Stehouwer, methodically picked off cars to make his way to the lead pack from his eighth starting position. Heeney put some real estate between himself and Taylor, Evan Barrett, John Ledwidge, and Jimmy Gallagher by the fifth lap. Gallagher made several attempts to stick a nose under Ledwidge for fourth, but Ledwidge kept closing the door. Stehouwer kept coming to the front at a frantic pace, using both the high and low side to pass cars. Heeney, Taylor, Barrett, Ledwidge, and Gallagher continued to battle for position as the feature continued caution-free until lap 34, when telltale signs of smoke from Heeney’s car and fluid on the track saw him retire to the pit for the evening. The lead was handed down to Taylor, setting up a six-lap dash for the checker. Barrett gave chase and they pulled away from Gallagher, Ledwidge, and Stehouwer. Stehouwer moved to the inside of Ledwidge on lap 36. The two were side by side as they crossed the line, but Ledwidge couldn’t hold him off and Stehouwer moved into fourth. Taylor led them to the finish, followed by Barrett, Gallagher, Stehouwer, and Ledwidge. Brian Clay and Taylor scored heat wins. Justin Kazmar set fast time for the MI Army National Guard MI Modifieds garnering him the seventh start position for the 35 lap feature. Brian Heeney and Earl Miles brought the field down to the green with Heeney jumping out to the early lead, as third through eighth position ran side by side behind Miles. Bud Perry made the high side work for him as he drove through the field. Heeney, Miles, Jason Parish, Perry, and Tim Easey were running in a tight little pack as Perry got around Parish for third and immediately went to work on Miles. Easey followed Perry to run alongside Miles. They got together, bringing out a caution that closed up Heeney’s lead and ended the night for both Easey and Miles. With Perry sitting second for the restart on lap 10, it was only a matter of time before he glued himself to Heeney’s rear bumper. Another caution on lap 15 opened the door of opportunity for Perry and he went to work on Heeney for that top spot. Heeney did a fine job of holding him off until lap 22, when Perry made his pass stick and went into the lead. Kazmar went to work on Ozanich from his fifth position and got around him on lap 25, zeroing in on Parish in third. At the stripe, it was Perry, Heeney, Kazmar, Parish, and Ozanich. Tracey Heeney took her first ever checkered flag for a heat win. Leroy Ellis also won his heat. After the dust cleared from the wild Performance Automotive Northwest Street Stock heat races, twenty cars lined up for their 25-lap feature, with a couple starting shotgun as a result of battle scars from the heat. Jordan Harvey was shown as the lap one leader, as Damon Place moved up through the field. Place jumped into the lead on lap seven, with Ron Heeney coming fast. Lap nine saw Place and Heeney side by side at the line, with Heeney taking away first by lap ten. Corey Davis moved into the third position followed by Bubber Patrick and Scott Sigman. At the completion of 25 laps, it was Heeney, Place, Davis, Patrick, and Sigman. The Q106 Pony Stocks were chomping at the bit to get their twenty lap feature underway. Sixteen of them took off on the start like every one of them had a burr under their saddle. Jason Brunn managed to come through unscathed to lead lap one. Caution on lap two set up a huge rush for the front on the restart. Cars were three-wide into turn three, with Bryan Passick II, John Ward, and Keith Holden negotiating their way through the turn. Ward grabbed the lead on lap four with Jimmy Scavarda, Jason Brunn, Trei Deubel, and Dave Hartman rounding out the top five. Scavarda and Deubel led the charge on lap 10, with Russ Potter going after Ward for third. George Wyers worked his way into the top five as well by lap 10. Scavarda opened up a bit of a lead over Deubel on lap 13, but Deubel reeled him in, and on lap 16 Scavarda went sent careening toward the turn two wall. Neither Scavarda, nor Deubel, were able to continue on the restart, so the lead went back to Ward. Russ Potter whittled away at everyone and eventually caught and passed Ward with three laps to go. At the line, it was Potter, Ward, Wyers, Julie Dailey, and Hartman.}",
    "textBeforeTable": "Andrews Chevrolet Superlate Models Qualifying Results By: Michelle Sprague Lee Taylor found himself in the WITL Winner’s Circle again at Spartan Speedway. Taylor started on the pole for the Andrews Chevrolet Super Late Model 40-lap feature, with Bill Heeney Jr. taking the lead on lap one. Heeney continued to lead as point leader, Dave Stehouwer, methodically picked off cars to make his way to the lead pack from his eighth starting position. Heeney put some real estate between himself and Taylor, Evan Barrett, John Ledwidge, and Jimmy Gallagher by the fifth lap. Gallagher made several attempts to stick a nose under Ledwidge for fourth, but Ledwidge kept closing the door. Stehouwer kept coming to the front at a frantic pace, using both the high and low side to pass cars. Heeney, Taylor, Barrett, Ledwidge, and Gallagher continued to battle for position as the feature continued caution-free until lap 34, when telltale signs of smoke from Heeney’s car and fluid on the track saw him retire to the pit for the evening. The lead was handed down to Taylor, setting up a six-lap dash for the checker. Barrett gave chase and they pulled away from Gallagher, Ledwidge, and Stehouwer. Stehouwer moved to the inside of Ledwidge on lap 36. The two were side by side as they crossed the line, but Ledwidge couldn’t hold him off",
    "textAfterTable": "13.468 10 007 Dale Lewis 13.485 0.351 13.497 11 1 Chris Place 13.486 0.352 13.487 12 32 Garry Duram 13.520 0.386 13.545 13 T2 Doc Dutton 13.571 0.437 13.601 14 75 Craig Willett 13.595 0.461 13.607 15 89 Tim Bullis 13.716 0.582 13.718 16 30 Bryan Clay 13.717 0.583 13.726 17 45. Carl Sodman 13.774 0.640 13.785 Michigan National Guard MMA Modifieds Pos Car Number Name Best Time",
    "hasKeyColumn": true,
    "keyColumnIndex": 2,
    "headerRowIndex": 0
}