{
    "relation": [
        [
            "RPM",
            "2,500",
            "2,600",
            "2,700",
            "2,800",
            "2,900",
            "3,000",
            "3,100",
            "3,200",
            "3,300",
            "3,400",
            "3,500",
            "3,600",
            "3,700",
            "3,800",
            "3,900",
            "4,000",
            "4,100",
            "4,200",
            "4,300",
            "4,400",
            "4,500",
            "4,600",
            "4,700",
            "4,800",
            "4,900",
            "5,000",
            "5,100",
            "5,200",
            "5,300",
            "5,400",
            "5,500",
            "5,600",
            "5,700",
            "5,800",
            "5,900",
            "6,000",
            "6,100",
            "6,200",
            "6,300",
            "6,400",
            "6,500"
        ],
        [
            "TQ",
            "337",
            "350",
            "357",
            "357",
            "355",
            "351",
            "345",
            "339",
            "343",
            "356",
            "371",
            "385",
            "396",
            "404",
            "410",
            "415",
            "418",
            "420",
            "422",
            "421",
            "420",
            "421",
            "425",
            "426",
            "427",
            "427",
            "427",
            "426",
            "425",
            "423",
            "421",
            "419",
            "417",
            "415",
            "412",
            "407",
            "401",
            "397",
            "393",
            "390",
            "386"
        ],
        [
            "HP",
            "161",
            "173",
            "184",
            "190",
            "196",
            "201",
            "204",
            "207",
            "216",
            "230",
            "247",
            "264",
            "279",
            "292",
            "305",
            "316",
            "327",
            "336",
            "345",
            "353",
            "360",
            "369",
            "380",
            "390",
            "398",
            "407",
            "414",
            "421",
            "428",
            "445",
            "440",
            "446",
            "453",
            "458",
            "462",
            "466",
            "466",
            "469",
            "471",
            "475",
            "477"
        ]
    ],
    "pageTitle": "2007 Jeg's Engine Masters Challenge - Popular Hot Rodding Magazine",
    "title": "",
    "url": "http://www.hotrod.com/events/coverage/0802phr-2007-jegs-engine-masters-challenge/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989891.18/warc/CC-MAIN-20150728002309-00018-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 502212623,
    "recordOffset": 502168753,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{49563=In past years, we based the JEMC on a cubic inch limit, but that was no fun for builders, and it really didn't put things into perspective for readers more familiar with 305 Chevys, 318 Mopars, and 351 Fords. Average guy stuff. The rules for 2007 were simply to build a pump-gas musclecar engine between 302 ci and 500 ci, using the original OEM bore and stroke dimensions, plus a small margin for overbore and journal cleanup. Compression ratio was limited to 10.5:1. Components had to be commonly available aftermarket heads, intake, carb, and block, with full compatibility to the OEM components for the model year of engine built. For fun, we threw in a flat-tappet hydraulic camshaft rule because that presented a realistic limitation that the regular gearheads can emulate., 49222=The 2007 Jeg's Engine Masters Challenge was the forum for the recent shootout of factory-based musclecar engines, where the country's top builders duked it out for $192,000 in contingency prize money. With that kind of cash on the line, guys were going to put their best foot forward and employ every legal trick in the book.}",
    "textBeforeTable": "BES Racing Engines 400 Small-block Chevy Claimed displacement: 403 CI Qualifying score: 2,461.1 What follows is the breakdown of each engine in competition, its qualifying score, OEM engine size, claimed displacement, and the best dyno sheet from the three pulls made during official qualifying. We've also included the important engine specs for your reference. Yes, we know there are gaping holes in the selection of engines (where's the 426 Hemi, the Mopar big-block 383 and 440 Wedge, the 302 Windsor, and the Boss 429-to name a few?). But when push came to shove, these were the engines our competitors elected to build, based on their perceived competitive advantage. Let's crank up the dyno! The qualifying scores were computed by taking (from three pulls) the average corrected torque and average corrected horsepower between 2,500 and 6,500 rpm, adding them together, multiplying by 1,000, then dividing by the claimed cubic inches. The score would then reflect the relative efficiency per cubic inch of each engine, thus leveling the playing field and removing the advantage of larger displacement motors. In past years, we based the JEMC on a cubic inch limit, but that was no fun for builders, and it really didn't put things into perspective for readers more familiar with 305 Chevys, 318 Mopars, and 351 Fords. Average guy stuff. The rules for 2007 were simply to build a pump-gas musclecar engine between 302 ci and 500 ci, using the original OEM bore and stroke dimensions, plus",
    "textAfterTable": "4,500 545 467 4,600 555 486 4,700 565 505 4,800 573 523 4,900 578 539 5,000 580 552 5,100 581 564 5,200 578 573 5,300 578 584 5,400 579 595 5,500 578 605 5,600 578 616 5,700 577 626 5,800 575 635 5,900 570 640 6,000 565 645 6,100 561 651 6,200 558 658 6,300 553 663 6,400 548 668 6,500 544 673 School of Automotive Machinists 351C Small-block Ford Claimed displacement: 358 ci Qualifying score: 2,433.8 Team leader: Judson Massingill Team members: Chris Bennett, Shawn Hooper, Ryan Fischer Hometown: Houston, TX Bore: 4.030 inch Stroke: 3.500 inch Compression ratio: 10.4:1 Carburetor: Holley 950 HP Carb spacer: SAM Intake: CHI Cylinder heads: CHI Block: Ford Intake valve: 2.150 inch Exhaust valve: 1.590 inch Camshaft specs: COMP; 248/254 degrees @ .050, .684/.666-inch lift Rocker arms: Jesel, 1.9:1",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}