{
    "relation": [
        [
            "First Name",
            "Marek",
            "Pamela",
            "Jennifer"
        ],
        [
            "Last Name",
            "Gootman",
            "Welsh",
            "Cetta"
        ],
        [
            "Suffix",
            "",
            "",
            ""
        ],
        [
            "Covered Official Position (if applicable)",
            "",
            "",
            ""
        ],
        [
            "New",
            "",
            "",
            ""
        ]
    ],
    "pageTitle": "LD-2 Disclosure Form",
    "title": "",
    "url": "http://soprweb.senate.gov/index.cfm?event=getFilingDetails&filingID=A3E12E18-F0D1-4155-ACC5-FB459F690FB9&filingTypeID=78",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989891.18/warc/CC-MAIN-20150728002309-00042-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 221149819,
    "recordOffset": 221141810,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{14323=Sustainable Communities Initiative planning grant implementation, and other urban area revitalization and metropolitan collaboration initiatives. Housing foreclosure response legislative proposals. Home Modernization Assistance and Neighborhood Stabilization Program funding and implementation. Publicly-assisted housing authorizations (e.g. H.R. 4868, H.R. 5814). S. 1619 / H.R. 4690, Livable Communities Act. Choice Neighborhoods program development. S. 3642 / H.R. 5766 PACE Assessment Protection Act., 1019=Lobbying Disclosure Act of 1995 (Section 5) - All Filers Are Required to Complete This Page, 36815=H.R. 2454, American Clean Energy and Security Act (and related climate change legislation): support for local government environmental, energy efficiency, renewable energy, transportation, and economic development activities. S. 2899, the Renewable Energy Incentive Act. H.R. 3534 Consolidated Land, Energy, and Aquatic Resources (CLEAR) Act. S. 3663 Clean Energy Jobs and Oil Accountability Act. S. 3642 / H.R. 5766 PACE Assessment Protection Act., 24065=Sustainable Communities, metropolitan collaborations, and urban revitalization policy. S. 1619 / H.R. 4690, Livable Communities Act. S. 3642 / H.R. 5766 PACE Assessment Protection Act. H.R. 4173 Restoring American Financial Stability Act of 2010 and proposed tax extender legislative provisions impacting local governments. Infrastructure financing legislative proposals. Job creation legislative and funding proposals., 39914=D Block spectrum transfer for public safety purposes; S. 3625 / H.R. 4992 First Responders Protection Act of 2010 and S. 3756 Public Safety Spectrum and Wireless Innovation Act. H.R. 3745, Community Access Preservation Act., 21021=FY2011 Appropriations -- CJS: juvenile delinquency prevention and truancy reduction. Energy and Water: watershed ecosystem restoration, and water-sewer infrastructure. Financial Services: minority small business support center. LHHS: workforce training, and educational enrichment. THUD: road improvements, and homeless resource facility construction. Interior: water reclamation and water-sewer infrastructure., 43347=Illegal gun tracking, information-sharing, and enforcement legislative and administrative proposals. D Block spectrum transfer for public safety purposes; S. 3625 / H.R. 4992 First Responders Protection Act of 2010 and S. 3756 Public Safety Spectrum and Wireless Innovation Act. H.R. 413 / S. 1611 / S. 3194, Public Safety Employer-Employee Cooperation Act., 49072=H.R. 413 / S. 1611 / S. 3194, Public Safety Employer-Employee Cooperation Act. H.R. 4213 Unemployment Compensation Act.}",
    "textBeforeTable": "",
    "textAfterTable": "State DC Zip Code 20037 Country USA 3. Principal place of business (if different than line 2) City   State   Zip Code   Country   4a. Contact Name b. Telephone Number c. E-mail  Mr.  James B. Christian  2024576484  LDAdmins@pattonboggs.com 5. Senate ID#  30906-556 7. Client Name Self Check if client is a state or local government or",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}