{
    "relation": [
        [
            "Name",
            "Twinkling lights to adorn your Frostfell tree!",
            "tray of Gigglegibber cookies",
            "turlif whizgig",
            "beard trimming kit",
            "book of Erud's teachings",
            "jumjum pie",
            "Halas crafted dagger"
        ],
        [
            "Level",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0"
        ],
        [
            "Type",
            "Item",
            "Item",
            "Item",
            "Item",
            "Item",
            "Item",
            "Item"
        ],
        [
            "Relation",
            "Reward",
            "Reward",
            "Reward",
            "Reward",
            "Reward",
            "Reward",
            "Reward"
        ],
        [
            "Requirements",
            "None",
            "None",
            "None",
            "None",
            "None",
            "None",
            "None"
        ]
    ],
    "pageTitle": "Feelin' Gifty in Freeport! :: Quests :: EverQuest II :: ZAM",
    "title": "",
    "url": "http://eq2.zam.com/db/quest.html?eq2quest=e35c0ce434e5a534488741ac91eb645b",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989891.18/warc/CC-MAIN-20150728002309-00049-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 83352923,
    "recordOffset": 83335357,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "The Gigglegibber goblin was very happy with my assistance, and has granted me the ability to adorn the Frostfell tree that Gh'lad Tydingz rewarded me with. I delivered all the gifts to the right citizens! I spoke to G'shugahplum. Complete: Return to G'shugahplum. Start: Stage 4Whether the gifts went to the person that G'shugahplum had intended, I do not know. I should now return to G'shugahplum. I have delivered all of the gifts that were given to me. I gave a gift to Klaessa L'tek. Complete: Deliver a gift to Klaessa L'tek. Start: I gave a gift to Gemellus Sperasius. Complete: Deliver a gift to Gemellus Sperasius. Start: I gave a gift to Kamaria Cheefar. Complete: Deliver a gift to Kamaria Cheefar. Start: I gave a gift to Thabit Kalila. Complete: Deliver a gift to Thabit Kalila. Start: I gave a gift to Gowan Macgillivray. Complete: Deliver a gift to Gowan Macgillivray.",
    "textAfterTable": "Subscribe About ZAM FAQ Press Advertise Privacy Policy Terms of Service Forum Rules Featured Game Sites Wowhead Hearthhead Lolking TF2Outpost DayZDB Esohead DestinyDB Database Sites Wowhead Hearthhead LolKing DayZDB D3head Esohead Rifthead Torhead DestinyDB Final Fantasy XI XIV DB EverQuest EverQuest II Addon Sites MMOUI",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}