{
    "relation": [
        [
            "First Name",
            "Denise",
            "Thomas",
            "Larson"
        ],
        [
            "Last Name",
            "Cardman",
            "Susman",
            "Frisby"
        ],
        [
            "Suffix",
            "",
            "",
            ""
        ],
        [
            "Covered Official Position (if applicable)",
            "",
            "",
            ""
        ],
        [
            "New",
            "",
            "",
            ""
        ]
    ],
    "pageTitle": "LD-2 Disclosure Form",
    "title": "",
    "url": "http://soprweb.senate.gov/index.cfm?event=getFilingDetails&filingID=51B7F630-4FD1-472B-BA17-0BAE87A47116&filingTypeID=78",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989891.18/warc/CC-MAIN-20150728002309-00198-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 219905191,
    "recordOffset": 219892884,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{41606=S.244, Education Begins at Home Act. H.R.911, the Stop Child Abuse in Residential Programs for Teens Act of 2009. H.R.2667, the Early Support for Families Act. H.R.3827, Every Child Deserves a Family Act. H.R. 6192, Foster Children Self-Support Act. H.R. 6193, Foster Youth Financial Security Act of 2010., 1019=Lobbying Disclosure Act of 1995 (Section 5) - All Filers Are Required to Complete This Page, 67250=H.R. 265, the Drug Sentencing Reform and Cocaine Kingpin Trafficking Act of 2009. H.R.1022, S.132, Gang Abatement and Prevention Act of 2009, provisions related to definition of gang crimes, transfer of juveniles to adult criminal justice system and mandatory minimum sentences. H.R.1064, S.435, the Youth PROMISE Act. H.R.1133, Family Telephone Connection Protection Act of 2009, provisions relating to regulation of contracts for telephone service by prison inmates. H.R.1412, S.495, the Justice Integrity Act. H.R.1459, the Fairness in Cocaine Sentencing Act. H.R.1466, the Major Drug Trafficking Prosecution Act of 2009. H.R.1873, the Juvenile Justice Improvement Act of 2009 H.R.1931, the Juvenile Crime Reduction Act. H.R.2289, the Juvenile Justice Accountability and Improvement Act. H.R.2934, the Common Sense in Sentencing Act. H.R.3245, the Fairness in Cocaine Sentencing Act. H.R.3237, the Ramos-Compean Justice Act of 2009. H.R.3335, S.1516, the Democracy Restoration Act. H.R.4335, Prison Abuse Remedies Act. S.678, the Juvenile Justice and Delinquency Prevention Reauthorization Act of 2009. S.714, H.R. 5143, the National Criminal Justice Commission Act of 2009. S.1390, National Defense Authorization Act for Fiscal Year 2010, provisions of the Matthew Shepard Hate Crime Prevention Act. S.1789, the Fair Sentencing Act of 2009. S.2772, H.R.4080, the Criminal Justice Reinvestment Act of 2009. S. 445, H.R. 4326, Attorney-Client Privilege Protection Act H.R. 5304, The Byrne/JAG Program Accountability Act Proposed changes to Justice Department internal policy involving waiver of attorney-client privilege, work product, and employee legal protections as conditions for receiving cooperation credit during investigations (set forth in 1999 Holder Memorandum, 2003 Thompson Memorandum, October 2005 McCallum Memorandum, December 2006 McNulty Memorandum, and August 2008 corporate charging guidelines amendment to U.S. Attorneys Manual [Filip Memorandum]). Proposed Presidential executive order applying a modified version of the Justice Departments August 2008 corporate charging guidelines provisions dealing with waiver of attorney-client privilege, work product, and employee legal protections to all federal agencies. Proposed changes to Securities and Exchange Commission policy involving waiver of attorney-client privilege, work product, and employee legal protections as conditions for receiving cooperation credit during investigations (set forth in the Commissions Seaboard Report, formally known as the Report of Investigation Pursuant to Section 21(a) of the Securities Act of 1934 and Commission Statement on the Relationship of Cooperation to Agency Enforcement Decisions, issued on October 23, 2001 as Releases 44969 and 1470; and in Section 4.3 of the SECs Enforcement Manual issued on October 6, 2008 and revised on January 13, 2010). Proposed changes to Department of Housing and Urban Development policy involving waiver of attorney-client privilege and work product protections (set forth in the HUDs February 3, 2006 formal Notice to public housing authorities urging them to include an addendum in all contracts with legal counsel that would restrict their attorneys ability to assert the attorney-client privilege on behalf of these clients in regard to HUD investigations and enforcement proceedings) and policy pressuring state and local government entities that administer federal awards to not pay their employees attorneys fees during investigations. Proposed changes to Environmental Protection Agency policy involving waiver of attorney-client privilege, work product, and employee legal protections as conditions for receiving cooperation credit during investigations (set forth in the EPA Cooperation Standards, \"Incentives for Self-Policing: Discovery, Disclosure, Correction and Prevention of Violations,\" Effective May 11, 2000). Proposed changes to Department of Defense policy involving waiver of attorney-client privilege and work product protections (set forth in DOD policy titled Use of DOD Information SystemsStandard Consent Banner and User Agreement requiring military defense lawyers to provide access to client computer files issued on May 9, 2008). H.R.5300, the Fairness and Accuracy in Employment Background Checks Act of 2010 H.R.5748, End Racial Profiling Act H.R.6059, First Offender Improvement Act, 27795=H.R. 12, S. 182, the Paycheck Fairness Act H.R. 3017, S.1584 Employment Non-Discrimination Act H.R. 2134, Native Hawaiian Government Reorganization Act of 2010 H.R. 1283, S. 3065, Military Readiness Enhancement Act of 2009 Provisions relating to repeal 10 U.S.C. Sec. 654, Dont Ask, Dont Tell H.R. 4902, S. 3065, H.R. 6520, S. 4022, S. 4023, H.R. 2965, : Provisions related to repeal 10 U.S.C. 654, Dont Ask, Dont Tell. 28 CFR Parts 35 and 36, comments related to revising the regulations implementing title III of the Americans with Disabilities Act in order to establish requirements for making websites accessible to individuals with disabilities., 34781=H.R. 1020, S. 931, Arbitration Fairness Act H.R. 1237, S. 512, Fairness In Nursing Home Arbitration Act H.R. 3190, S. 148, Discount Pricing Consumer Protection Act, 54170=Proposed physician payment regulations, regarding inclusion of advanced care planning in the annual exam (Fed. Reg. November 29, 2010), 81405=Activity in support of federal funding and logistical support for programs that provide pro bono legal representation for homeless or justice-involved veterans e.g. addressing arrearages in child support payments, benefits access, and others. H.R. 2138 SERV Act -- Activity in support of federal funding for the establishment of veterans treatment courts, including for persons who may have committed certain more serious crimes. Activity in support of funding and programs to provide pro bono legal representation for homeless or justice-involved veterans e.g. addressing arrearages in child support payments., 44570=P.L. 111-203 (formerly, H.R. 4173), Dodd-Frank Wall Street Reform and Consumer Protection Act; provisions, amendments and/or implementing rules relating to federal regulation of lawyers, debt settlement services, protecting the attorney-client privilege, bankruptcy law, antitrust law, reducing systemic risk in the U.S. financial system, consumer protection issues, creation of an Office of Financial Research, derivatives reform, whistleblower protection, the Volcker Rule (involving prohibition on proprietary trading), and eight financial reform principles endorsed by the American Bar Association S. 3264, the Debt Settlement Consumer Protection Act - provisions and/or amendments relating to federal regulation of lawyers Proposed changes to the Practice of Law Exemption, FTC Mortgage Assistance Relief Services Rulemaking, Rule No. R911003 75 Fed. Reg. 10707, March 9, 2010 Activity in support for the retroactive inclusion of lawyer IOLTA accounts under the extensions of the FDIC transactional account guarantees of P.L. 111-203 Proposed Changes to the Practice of Law Exemption, HUD Proposed Rule titled SAFE Mortgage Licensing Act: HUD Responsibilities Under the SAFE Act, Docket No. FR-5271-P-01, 74 Fed. Reg. 66548, December 15, 2009, 64113=S. 2977, A bill to prohibit the use of Department of Justice funds for the prosecution in Article III courts of the United States of individuals involved in the September 11, 2001 terrorist attacks S. 3081, Enemy Belligerent Interrogation, Detention, and Prosecution Act of 2010, to provide for the interrogation and detention of enemy belligerents who commit hostile acts against the United States, to establish certain limitations on the prosecution of such belligerents for such acts, and for other purposes., 49807=H. R. 984, S. 417, the State Secrets Protection Act HR 429, S. 446, A bill to permit the televising of Supreme Court proceedings. H.R. 156, Stop the Congressional Pay Raise Act H.R. 215, Congressional Pay Reform Act of 2009 H.R. 282, Delay Congressional Pay Raise Act S. 102, S. 317, S. 620, A bill to repeal the provision of law that provides automatic pay adjustments for Members of Congress. S. 2725, Federal Judicial Fairness Act H.R. 3662, S. 1653, the Federal Judgeship Act of 2009 H. Res 473, Reaffirmation of American Independence (foreign judgments) H. R. 4115, Open Access to Courts Act of 2009, to provide restoration of notice pleading S. 1504, S. 4054, Notice Pleading Restoration Act of 2009 Proposed appointment of new Chair, suggested reform projects and other proposed start-up activities for the newly reconstituted Administrative Conference of the United States. H.R. 4113, Federal Courts Jurisdiction and Venue Clarification Act S. 537, H.R. 1508, the Sunshine in Litigation Act of 2009, 19185=FY 2011 Labor, Health and Human Services, Education and Related Agencies Appropriations provisions related to funding for the Social Security Administration; funding for programs authorized under the Strengthening Abuse and Neglect Courts Act (SANCA), funding for programs authorized under the federal Child Abuse Prevention and Treatment Act (CAPTA); and funding for Elder Justice Act programs S. 3636, FY 2011 Commerce, Justice, Science and Related Agencies Appropriations Act provisions relating to funding for the Legal Services Corporation; funding and operations of the U.S. Patent and Trademark Office; funding for reentry programs under the Second Chance Act; funding for juvenile justice programs and indigent defense services administered by the Office of Juvenile Programs; funding for the Executive Office of Immigration Review, including for additional immigration judges and the Legal Orientation Program; S. 3677, FY 2011 Financial Services and General Government Appropriations Act provisions providing funding for the Administrative Conference of the United States, the Internal Revenue Service (IRS) and for the IRS Volunteer Income Tax Assistance (VITA) and Low-Income Taxpayer Clinic (LITC) programs; funding for Defender Services. S. 3676, FY 2011 State, Foreign Operations and Related Programs Appropriations Act funding for international rule of law programs in general, and funding for ABA Rule of Law Initiative programs Activity in support for funding for the Thurgood Marshall Legal Educational Opportunity Program for FY2011 and FY2012 Activity in support of funding for the ABA Military Pro Bono Project for FY2012 Activity in support for the retroactive inclusion of lawyer IOLTA accounts under the extensions of the FDIC transactional account guarantees, H.R. 6398 (P.L. 111-343) H.R.3082, Continuing Appropriations and Surface Transportation Extensions Act, 2011provisions relating to funding for Legal Services Corporation, John R. Justice Loan Forgiveness Program; provisions providing funding for the Administrative Conference of the United States, the Internal Revenue Service (IRS) and for the IRS Volunteer Income Tax Assistance (VITA) and Low-Income Taxpayer Clinic (LITC) programs; funding for Defender Services., 60253=H.R. 6497, S. 3992, Development, Relief, and Education for Alien Minors Act (DREAM Act) H.R. 1651, Access to Justice Act H.R. 1992, S. 577, the Immigration Fraud Prevention Act General communications on immigration detention conditions and enforcement of ICE Detention Standards, access to legal representation and notice of legal rights to detainees by ICE. Draft legislation to establish an Article I Immigation Court General issues regarding reform of the immigration removal adjudication system, including: increasing prosecutorial discretion for DHS trial attorneys; increasing attorney involvement in issuing Notices to Appear; amending the definition of aggravated felony under immigration laws; increasing the number of immigration judges, BIA members and support staff; improving hiring criteria and providing additional training for immigration judges; incorporating a single code of conduct, judicial performance reviews, and a new disciplinary system for immigration judges; enhancing access to legal representation for noncitizens in removal proceedings; and creating an Article I court for the immigration adjudication system., 12242=HR 3763,S. 3416, To amend the Fair Credit Reporting Act to provide for exclusion from Red Flag Guidelines for certain businesses H.R. 6398 To require the Federal Deposit Insurance Corporation to fully insure Interest on Lawyers Trust Accounts S. 3987, the Red Flag Program Clarification Act of 2010 Comments to FDIC on Notice of Proposed Rule: Temporary Unlimited Coverage for Noninterest- Bearing Transaction Accounts related to Interest on Lawyers Trust Accounts, 31735=H.R. 2584, to make tax planning methods unpatentable H.R. 5322, the Patent and Trademark Office Funding and Stabilization Act of 2010 H.R. 4954, relating to remedies for false marking of patents S. 515, the Patent Reform Act of 2009. H.R. 1260, the Patent Reform Act of 2009. S. 3804, the Combating Online Infringement and Counterfeiting Act., 37594=H.R. 4469 re: Military Child Custody; H.R. 5136 Section 544; H.R. 6523; S.3454 National Defense Authorization Act of FY2011 Activity in opposition to problem legislation concerning child custody matters for members of the military and provision dealing with inspector general investigations of attorneys who represent Guantanamo detainees; repeal of \"Don't Ask, Don't Tell\" provisions; provisions dealing with restrictions on transfer of Guantanamo detainees S.4058 Helping Heroes Keep Their Homes Act of 2010, and related activities, supporting an extension of federal protection under the Servicemember Civil Relief Act protecting returning military servicemembers in mortgage foreclosure proceedings. Support federal funding of the ABA Military Pro Bono Project, 75328=H.R. 947, the James Zadroga 9/11 Health and Compensation Act of 2010 - Section 301 treaty override provsion Urge resolution of systemic uncertainties resulting from suspension of estate and generation-skipping transfer taxes and reinstatement of the 2001 transfer tax laws; HR 4213, the American Jobs and Closing Tax Loopholes Act of 2010 Senate amendment to alter the taxation of certain carried interests by adding a new section 710 to the Internal Revenue Code, 16013=Draft bankruptcy technical corrections bill proposing partial repeal of bankruptcy attorney liability provisions contained in Sections 102, 203(a), and 226-229 of P.L. 109-8 (formerly S. 256), Bankruptcy Abuse Prevention and Consumer Protection Act of 2005, to add a new partnership section to the Bankruptcy Code, and to make certain technical amendments to Section 363(f) of the Code regarding certain sales of real property P.L. 111-327 (formerly, H.R. 6198) the Bankruptcy Technical Corrections Act, 84661=General issues surrounding structure and substance of U.S. foreign assistance programs, focused primarily on rule of law programs, in relation to draft legislation to rewrite the Foreign Assistance Act. S. 2982, H.R. 4594, the International Violence Against Women Act Treaty Doc. 96-53, Convention on the Elimination of All Forms of Discrimination Against Women Proposal to establish a mechanism to impose civil responsibility on states that engage in state-sponsored violence against women as a weapon of war and to provide reparations for victims.}",
    "textBeforeTable": "",
    "textAfterTable": "State DC Zip Code 20005 Country USA 3. Principal place of business (if different than line 2) City   State   Zip Code   Country   4a. Contact Name b. Telephone Number c. E-mail  Ms.  THOMAS M. SUSMAN  2026621765  thomas.susman@americanbar.org 5. Senate ID#  1808-12 7. Client Name Self Check if client is a state or local government or",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}