{
    "relation": [
        [
            "Procedure",
            "CREATE_AWCUBE_ACCESS Procedure",
            "CREATE_AWCUBE_ACCESS_FULL Procedure",
            "CREATE_AWDIMENSION_ACCESS Procedure",
            "CREATE_AWDIMENSION_ACCESS_FULL Procedure",
            "DELETE_AWCUBE_ACCESS Procedure",
            "DELETE_AWCUBE_ACCESS_ALL Procedure",
            "DELETE_AWDIMENSION_ACCESS Procedure",
            "DELETE_AWDIMENSION_ACCESS_ALL Procedure",
            "REFRESH_AWCUBE_VIEW_NAME Procedure",
            "REFRESH_AWDIMENSION_VIEW_NAME Procedure",
            "SET_AWCUBE_VIEW_NAME Procedure",
            "SET_AWDIMENSION_VIEW_NAME Procedure"
        ],
        [
            "Description",
            "Creates a script that enables access to a cube in an analytic workspace.",
            "Enables access to a cube in an analytic workspace.",
            "Creates a script that enables access to a dimension in an analytic workspace.",
            "Enables access to a dimension in an analytic workspace.",
            "Creates a script that deletes the enablement views and metadata for a cube in an analytic workspace.",
            "Deletes the enablement views and metadata for a cube in an analytic workspace.",
            "Creates a script that deletes the enablement views and metadata for a dimension in an analytic workspace.",
            "Deletes the enablement views and metadata for a dimension in an analytic workspace.",
            "Creates metadata in the analytic workspace to support user-defined view names. (Not for use with REFRESH_AWCUBE)",
            "Creates metadata in the analytic workspace to support user-defined view names. (Not for use with REFRESH_AWDIMENSION)",
            "Replaces the system-generated names for the views of an analytic workspace cube.",
            "Replaces the system-generated names for the views of an analytic workspace dimension."
        ]
    ],
    "pageTitle": "1 Creating Analytic Workspaces with DBMS_AWM",
    "title": "",
    "url": "http://docs.oracle.com/cd/B12037_01/olap.101/b10334/using_dbmsawm.htm",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042992543.60/warc/CC-MAIN-20150728002312-00246-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 71688743,
    "recordOffset": 71664729,
    "tableOrientation": "HORIZONTAL",
    "lastModified": "Mon, 02 Feb 2004 04:02:00 GMT",
    "textBeforeTable": "Table 1-11 The OLAP API Enabler Procedures The OLAP API enabler procedures are listed in Table 1-11. 1.7.3 The OLAP API Enabler Procedures Call the procedure CREATE_AWCUBE_ACCESS_FULL to create the fact views for the cube. This procedure accomplishes the same basic steps as the corresponding procedure for dimensions. Call CREATE_AWDIMENSION_ACCESS_FULL for each of the cube's dimensions. This procedure creates the enablement scripts in temporary memory and runs the scripts to create the dimension views and OLAP Catalog metadata. The scripts delete any previous views and OLAP Catalog metadata before creating new views and metadata. Refresh the cube and its dimensions in the analytic workspace, as described in \"Procedure: Generate and Run the Enablement Scripts\". To create and run the enablement scripts automatically, use the following steps: 1.7.2 Procedure: Run the Enablement Scripts Automatically Run the enablement scripts. The scripts will delete any previous generation of views and metadata before creating new views and metadata. Call the CREATE_AWCUBE_ACCESS procedure. Set the access_type parameter to OLAP. This procedure call will create an enablement script in a directory that you specify. The script will contain statements that create the fact views and an OLAP Catalog cube that maps to the views. Call the CREATE_AWDIMENSION_ACCESS procedure for each",
    "textAfterTable": "Note: If you capture the SQL generated by Analytic Workspace Manager and use it to create your own scripts, you will need to edit the enablement procedure calls. Analytic Workspace Manager uses different versions of the enablement procedures. In your scripts, you must use the syntax described in this manual. 1.7.4 Enablement Metadata in the Analytic Workspace The REFRESH_AWDIMENSION and REFRESH_AWCUBE procedures create metadata in the analytic workspace related to enablement. This metadata includes a set of default names for the views that will be created by the enablement scripts. Whenever you refresh, new view names are generated. If you have previously created your own names (SET_AWDIMENSION_VIEW_NAME and SET_AWCUBE_VIEW_NAME), the refresh process uses them as the basis for the new names. Note: If you use some other process to refresh the cube (for example, the OLAP Analytic",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}