{
    "relation": [
        [
            "First Name",
            "Mark",
            "Theresa"
        ],
        [
            "Last Name",
            "Boudreaux",
            "Fariello"
        ],
        [
            "Suffix",
            "",
            ""
        ],
        [
            "Covered Official Position (if applicable)",
            "",
            ""
        ],
        [
            "New",
            "",
            ""
        ]
    ],
    "pageTitle": "LD-2 Disclosure Form",
    "title": "",
    "url": "http://soprweb.senate.gov/index.cfm?event=getFilingDetails&filingID=2624987C-4E0C-4EB2-A566-3CACB77C8712&filingTypeID=60",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042992543.60/warc/CC-MAIN-20150728002312-00261-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 211615551,
    "recordOffset": 211601516,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{59512=HR 1: American Recovery and Reinvestment Act of 2009; Provisions regarding trade and contracting preferences. HR 3081: Making Appropriations for Department of State, foreign operations and related programs for the fiscal year ending September 30, 2010 and for other purposes; Provisions regarding international issues., 1019=Lobbying Disclosure Act of 1995 (Section 5) - All Filers Are Required to Complete This Page, 12228=H. Con. Res. 85: Setting forth the congressional budget for the United States Government for fiscal year 2010 and including the appropriate budgetary levels for fiscal years 2009 and 2011 through 2014; Provisions regarding budget levels., 41457=HR 1482: Consumer Reasonable Energy Price Protection Act of 2009; Provisions regarding funding levels. HR 1586: To impose an additional tax on bonuses received from certain TARP recipients; Provisions regarding compensation. HR 1664: To amend the executive compensation provisions of the Emergency Economic Stabilization Act of 2008 to prohibit unreasonable and excessive compensation and compensation not based on performance standards; Provisions regarding compensation. HR 2346: Supplemental Appropriations Act, 2009; Provisions regarding funding levels. HR 2847: Commerce, Justice, Science and Related Agency Appropriations, 2010; Provisions regarding funding levels. HR 2892: Department of Homeland Security Appropriations Act, 2010; Provisions regarding funding levels. HR 2918: Legislative Branch Appropriations Act, 2010; Provisions regarding funding levels. HR 2996: Department of the Interior, Environment and Related Agencies Appropriations Act, 2010; Provisions regarding funding levels. HR 2997: Agriculture, Rural Development, Food and Drug Administration, and Related Energies Appropriations Act, 2010; Provisions regarding funding levels., 52205=HR Res 393: Expressing the sense of the House of Representatives that the Obama Administration and Congress should end the assault on America's energy independence by leaving in place domestic energy tax incentives; Provisions regarding funding levels. HR Con Res. 85: Setting forth the congressional budget for the United States Government for fiscal year 2010 and including the appropriate budgetary levels for fiscal years 2009 and 2011 through 2014; Title III. HR 594: Save Our Climate Act of 2009; All provisions of the bill. HR1337: Americas Energy Security Trust Fund Act of 2009; All provisions of the bill. HR 1666: Safe Markets Development Act of 2009; All provisions of the bill. HR 1683: Clean Environment and Stable Energy Market Act of 2009; All provisions of the bill. HR 1862: Cap and Dividend Act of 2009; All provisions of the bill. HR 2380: Raise Wages, Cut Carbon Act of 2009; All provisions of the bill. HR 2454: American Clean Energy and Security Act of 2009; Title III. HR 3416: Americas Energy Security Trust Fund Act of 2007; All provisions of the bill. S 888: Oil Industry Tax Break Repeal Act of 2009; All provisions of the bill. General discussions regarding taxes and tax issues., 22389=HR 469: Produced Water Utilization Act of 2009; Provisions regarding energy issues. HR 1404: Federal Land Assistance, Management and Enhancement Act (FLAME Act); Provisions regarding land management. HR 1462: Study of Ways to Improve the Accuracy of the Collection of Federal Oil, Condensate, and Natural Gas Royalties Act of 2009; Provisions regarding energy impacts. HR 1666: Safe Markets Development Act of 2009; Provisions regarding energy impacts. HR 1698: To establish the Green Bank to assist in the financing of qualified clean energy projects and qualified energy efficiency projects; Provisions regarding funding mechanisms. HR 1759: Emission Migration Prevention with Long-Term Output Yields Act (EMPLOY Act); Provisions regarding energy/environment impacts. HR 1787: Low Carbon Fuel Standard Act of 2009; Provisions regarding energy impacts. HR 1835: New Alternative Transportation to Give Americans Solutions Act of 2009; Provisions regarding energy impacts. HR 2212: 21st Century Energy Technology Deployment Act; Provisions regarding energy and technology issues. HR 2227: American Conservation and Clean Energy Independence Act; Provisions regarding energy issues. HR 2300: American Energy Innovation Act; Provision regarding energy issues. HR 2454: American Clean Energy and Security Act of 2009; All provisions of the bill. HR 2475: Limitation on Nuclear Cooperation with the United Arab Emirates Act of 2009; Congressional review of the agreement. HR 2828: American Energy Innovation Act; Title I Subtitle G Sec 1607: hydraulic fracturing; Title I Subtitle H Part 2: permitting reform; Title I Subtitle J: natural gas; Title III production; and provisions regarding energy issues. HR 2990: Disabled Military Retiree Relief Act of 2009; Provisions regarding the energy fund. HR 2998: American Clean Energy and Security Act of 2009; Provisions regarding energy impacts. HR 3082: Military Construction and Veterans Affairs Appropriations Act of 2010; Provisions regarding energy issues. Draft House Natural Resources Committee Energy Bill (no number): Federal Lands and Resources Energy Development Act of 2009; Section 2 definitions; Title I - consolidation of federal lands and waters energy leasing programs; Title II outer continental shelf energy coordination and planning; Title III - onshore energy siting and development planning; Title IV - new onshore leasing authority; Title V - oil and gas royalty reform; Title VI - onshore reforms; Title VII - offshore reforms; and Title VIII - miscellaneous provisions. Rahall Draft: Federal Lands and Resources Energy Development Act of 2009; Provisions regarding development. S 22: Omnibus Public Land Management Act of 2009; Provisions regarding water issues. S 548: Save American Energy Act; Provisions regarding energy impacts. S 598: Appliance Standards Improvement Act of 2009; Provisions regarding energy markets, access to resources, and heavy oils/oil sands. S 774: National Energy Security Act of 2009 (NESA of 2009); Sec. 361inventory of outer continental shelf oil and gas resources, Sec. 363environmental stewardship and allowable activities; Sec. 364moratorium of oil and gas leasing in certain areas of the Gulf of Mexico; Provisions regarding energy impacts, energy markets, access to resources, and heavy oils/oil sands. S 807: Sound Management of Americas Resources and Technologies for Energy Act of 2009 (SMART Energy Act of 2009); TITLE II: Section 202--Tax on crude oil and natural gas produced from the outer continental shelf in the Gulf of Mexico; Chapter 56--Tax on severance of crude oil and natural gas from the outer continental shelf in the Gulf of Mexico; Title III: Section 301: Prohibition on export of outer continental shelf oil and gas production, Special Commission on Offshore Oil and Gas Leasing, and Production Incentives Fee; provisions regarding energy impacts. S 949: 21st Century Energy Technology Deployment Act; Provisions regarding energy markets, access to resources, heavy oils/oil sands and energy and technology issues. S 967: Strategic Petroleum Reserve Modernization Act of 2009; Provisions regarding energy markets, access to resources, and heavy oils/oil sands. S 1013: Department of Energy Carbon Capture and Sequestration Program Amendments Act of 2009; Provisions regarding energy markets, access to resources, heavy oils/oil sands and location of projects for carbon capture and sequestration for natural gas. Draft Senate ENR Committee Energy Bill (no number): American Clean Energy Leadership Act of 2009; Title III, Section Dfederal oil and gas development General discussions regarding oil shale leasing, increased domestic production, climate change policy, energy, climate change and pricing issues., 57301=HR 1256: Family Smoking Prevention and Tobacco Control Act/Federal Retirement Reform Act of 2009/Thrift Savings Plan Enhancement Act of 2009; Provisions regarding tobacco sales.}",
    "textBeforeTable": "",
    "textAfterTable": "City IRVING State TX Zip Code 75039 Country USA 3. Principal place of business (if different than line 2) City   State   Zip Code   Country   4a. Contact Name b. Telephone Number c. E-mail  Ms.  KRISTINA L. MITCHELL  9724441131  kristina.l.mitchell@exxonmobil.com 5. Senate ID#  14017-12",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}