{
    "relation": [
        [
            "Patent application number",
            "20090121056",
            "20090121060",
            "20100019074",
            "20110033351"
        ],
        [
            "Description",
            "FINE GRINDING ROLLER MILL - A roller mill for pulverizing material and separating the pulverized material has a mill for crushing the material and a classifier disposed on the mill for separating the crushed material. The mill includes a grinding mechanism that has a plurality of grinding rolls and a grinding ring that coact to pulverize material within a mill housing, which defines a grinding chamber. The classifier is a centrifugal-type classifier having a motor-driven rotor disposed within a classifier housing, which define a classifying chamber. The rotor has a plurality of blades that extend outwardly from the rotor. As the rotor rotates within the classifying chamber, the blades separate fine sized particles from oversized particles by passing the finer sized particles through the blades, and contacting and propelling the oversized particles against the classifier housing. The oversize particles fall downward through an outer annular passage defined by a baffle and the mill housing back to the grinding mechanism. The baffle is disposed along the inner periphery of the mill housing spaced at a distance from the mill housing to provide an inner passage and an outer annular passage. The inner passage directs particle-laden air upward through the grinding chamber to the classifier. The goat annular passage receives and directs the oversized particles downward to the grinding mechanism of the mill through an opening at the bottom of the outer annular passage for directing the oversized particles to the grinding mechanism.",
            "FINE GRINDING ROLLER MILL - A roller mill",
            "IMP MILL HAVING A UNIFORM WEAR HAMMER ARRANGEMENT - A hammermill, such as an imp mill",
            "SYSTEM AND METHOD FOR CALCINING GYPSUM"
        ],
        [
            "Published",
            "05-14-2009",
            "05-14-2009",
            "01-28-2010",
            "02-10-2011"
        ]
    ],
    "pageTitle": "Chen, IL - Patent applications",
    "title": "",
    "url": "http://www.faqs.org/patents/inventor/chen-il-3/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042992543.60/warc/CC-MAIN-20150728002312-00273-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 456282115,
    "recordOffset": 456244480,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Michael M. Chen, Naperville, IL US 02-26-2009 THREE DIMENSIONAL IMAGE PROCESSING APPARATUS AND X-RAY DIAGNOSIS APPARATUS - A three dimensional image processing apparatus includes a storage unit storing data of images in different radiographing directions together with information concerning cardiac phases, a key image selection unit selecting key images from the images, a feature point designation unit designatting feature points on the selected key images in accordance with operation by an operator, and an image reconstruction unit reconstructing a three dimensional image from the images on the basis of positions of the designated feature points, wherein the key image selection unit selects, as the key images, a pair of images which are located at the same cardiac phase and whose radiographing directions are different by a substantially predetermined angle and images spaced apart from each other by an angle obtained by substantially equally dividing an interval between the pair of images by a predetermined number. 20090052613 Published Description Patent application number Mei Chen, Elk Grove Village, IL US 01-20-2011 Selective Aliphatic C-H Oxidation - A composition including a complex of a metal, a tetradentate ligand, at least one ancillary ligand, and a counterion may be used for selective sp 20110015397 09-03-2009 Selective Aliphatic C-H Oxidation - A composition including a complex of a metal, a tetradentate ligand, at least one ancillary ligand, and a counterion may be used for selective sp 20090221083",
    "textAfterTable": "Patent applications by Michael M. Chen, Naperville, IL US Nannan Chen, Urbana, IL US Patent application number Description Published 20080219320 CONFORMAL MESH FOR THERMAL IMAGING - This invention provides thermal sensors and imagers that are flexible and capable of conforming to curved surfaces and corresponding methods of making and methods of thermal sensing. The thermal sensors contain an array of thermal resistors patterned in a row and column configuration, with each thermal resistor electrically isolated from other thermal resistors within the sensor. Thermal information is obtained from a region by measuring the resistance of each thermal resistor and calculating a thermal resistance for each entry of the array. 09-11-2008 Paul Lin Chen, Naperville, IL US Patent application number Description Published 20090218862 ROCKER BASE - The present invention relates to a furniture support structure, and more particularly to a base for supporting a rocking chair. The rocker base has a lower frame, an upper frame, and a plurality of cams. The lower frame has a plurality of lower U-shaped cross members connected to a plurality of side rails, and a plurality of lower spring mounts extending between the lower",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}