{
    "relation": [
        [
            "Categories",
            "Campus Safety",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "Campus safety is 100% safe, campus police is always on the move making there rounds around campus",
            "ANY AND EVERTHING LONG AS IT CLEAN FUN",
            "THE BEST THEIR IS .BUT CAN CAN BETTER AT TIMES",
            "dorm life is amazing the dorms are up to date. they have all types of activities that be going on",
            "REALLY IS PREPARING YOU FOR THE NEXT LEVEL OF COLLEGE",
            "be ready to have fun and learn new thing about life and people",
            "Mississippi Gulf Coast Community College is one of the best community colleges in Mississippi you can come to. The teacher ,faculty and the student body will always open their hearts to you about any thing. I chosen Gulf coast for a reason and I'm happy I chosen them"
        ]
    ],
    "pageTitle": "Mississippi Gulf Coast Community College Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Mississippi-Gulf-Coast-Community-College/reviews?_escaped_fragment_=/show/34825",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986646.29/warc/CC-MAIN-20150728002306-00124-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 893349047,
    "recordOffset": 893314907,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{145199=© 2015, Cappex.com, LLC, 444=My busiest day I am in class for 5 hours. Meaning there's at least another 10 hours of free time during the day. Learn to separate social time and homework. Set time apart for homework. Log off Facebook! Maybe plan frequent study dates with friends. Whatever needs to be done, it's just imperative to study or you'll get behind real quick. On a lighter note; WORK STUDY! Work = Money. Simple as that. Within the first or second week of July go to the Financial Aid office and ask for Work Study. PUT YOUR NAME ON THE LIST. They may or may not ask you to, YOU ask to if they don't. If you don't put your name on the list, you won't get work study., 63463=Gulf Coast football games are the best to be at. Great players and amazing fans. The football players love the band and can't get enough of us when we play in the stands and march during half time., 119503=We have official Gautier police officers who keep watch at our campus 24/7. We are able to keep their number on speed dial and call them for pretty much any need. For example, I have a night class and don't get out till 9 or 9:30, if I did not feel safe walking to my car alone I could call them and they would escort me to my vehicle., 92629=It's a really good school! My tuition is usually somewhere around 1300 dollars each semester.}",
    "textBeforeTable": "01/13/2010 Reviewer is A current student here. 5 out of 5 people found this review useful. 1 of 36 Tiffany from Gulfport, MS Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {//",
    "textAfterTable": "Campus Safety The campus police are everywhere which definitely makes me feel safe and most importantly for my 3 year old son who also attends the campus daycare. Bang for the buck I am currently in my second semester of the surgical tech program and as a returning student I love this school! What to do for fun There is always something going on on campus such as pep rallies, fashion shows, talent shows and extra curricular activities. Food and Dining Its terrific the cafeteria always looks very clean and the food smells and tastes terrific. Dorm Life Not sure I don't nor have I ever stayed on campus. Academic Rigor Its very important to keep up and always study. Stay motivated! Tips for prospective students To make sure you are at least taking classes geared toward your goals so in case you change up your major you can always apply your classes. In three sentences The",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}