{
    "relation": [
        [
            "Question",
            "| + How many systems?",
            "| + name of system number XX"
        ],
        [
            "Default",
            "2",
            "2"
        ],
        [
            "Variable",
            "$nsystem;",
            "$sysname[XX];"
        ]
    ],
    "pageTitle": "CRYSTAL Tutorial project - Webvib script",
    "title": "",
    "url": "http://www.theochem.unito.it/crystal_tuto/mssc2008_cd/tutorials/webvib/index.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989891.18/warc/CC-MAIN-20150728002309-00298-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 748322663,
    "recordOffset": 748311533,
    "tableOrientation": "HORIZONTAL",
    "lastModified": "Fri, 15 Feb 2013 11:14:30 GMT",
    "textBeforeTable": "It generates the folowing files: webvib quick system.xyz This command line is: Webvib is a perl script; it is called from the command line and takes as input a .xyz file (saved from JmolEdit). It splits this file to create one .xyz file by mode (stored in the XYZfiles directory) that can be read by Jmol. It generates of course also an html page that contains the Jmol applet and several controls that affect the system representation. In this simple case we will use the \"quick\" command line option to run the script with defaults and generate very simple page. On the left part of the html page, is the list of the modes; You can choose with radio buttons to focus only on modes of a given activity or symmetry. Under this list a key-color is automaticaly created. The right part contains the Jmol applet. A simple web page Once satisfied with the view of your system, click the Use this set of atomsto generate the corresponding xyz file needed by WEBVIB to create an",
    "textAfterTable": "index.html The web page The webvib script options Webvib lets the user set several variables/options that control the layout of the produced web page. Two ways are available to set these variables. Edit by the hand a configuration file and set the variables as you wish (using the perl syntax; click here to see an example). If the configuration file is called var.dat, the command line is for example: This command line is: webvib with var.dat file.xyz The user has only to answer to questions prompted by the script which create (or update) the configuration file containing the perl variables. The command is then simply : webvib file.xyz To modify an existing configuration file you can edit directly the file and run the command as above; or go through the questions typing the following command: webvib modify var.dat file.xyz In the following section we will present all the possible options of the webvib script. The options are gathered in 7 parts:",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}