{
    "relation": [
        [
            "Payment method",
            "",
            "Money Order/Bank cheque",
            "Personal cheque",
            "Bank Deposit"
        ],
        [
            "Preferred/Accepted",
            "PayPal Preferred",
            "Accepted",
            "Accepted",
            "Accepted"
        ],
        [
            "",
            "",
            "",
            "",
            ""
        ]
    ],
    "pageTitle": "BN 52mm 2 Inch Universal Dual Gauge Holder POD | eBay",
    "title": "",
    "url": "http://www.ebay.com.au/itm/BN-52MM-2-INCH-UNIVERSAL-DUAL-GAUGE-HOLDER-POD-/260767871825?pt=AU_Car_Parts_Accessories&hash=item3cb6f9f351",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989891.18/warc/CC-MAIN-20150728002309-00108-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 417969851,
    "recordOffset": 417919994,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{87051=JTM-AUTO began business in 2000 and with 5 years experience at based on EBAY Located in Sydney. NOW JTM-AUTO become a biggest Car Accessories wholesale in Australia. JTM-AUTO is best known for the car parts which special to the INTERNAL and EXTERNAL for the car performance. For resellers we supply a massive range of Bulk Wholesale Products with HIGH QUALITY. JTM-AUTO deal scouts procure in bulk directly from factories and distributors around the world at heavily reduced prices. Which means there are no middlemen and as such we are able to pass all the savings to you., 64574=YBZH-2002}",
    "textBeforeTable": "Payment details returns - opens in a new window or tab. Refunds by law: In Australia, consumers have a legal right to obtain a refund from a business for goods purchased if the goods are faulty, not fit for purpose or don't match description. More information at The buyer is responsible for return postage costs. Money Back 14 days after the buyer receives it Refund will be given as Item must be returned within Return policy business days of receiving cleared payment - opens in a new window or tab. Will usually send within 2 Domestic handling time",
    "textAfterTable": "Seller's payment instructions Dear buyer: Thank you for shopping from JTM AUTO Our bank detail is: ST.GEORGE account name: JTM AUTO ACCESSORIES pty ltd account number:439831601 BSB number:112-879 Please use your eBay ID name to be reference of your bank payment. This Goods will be despatch via Aus Post eParcel or Couriers service. May takes 1~7 working days to Australia wide. Kind Regards JTM TEAM Current bid amount + + import charges (shown at checkout) time left ##2## left | Bid Count",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}