{
    "relation": [
        [
            "Output Format",
            "gcg",
            "gcg8",
            "embl em",
            "swiss sw",
            "fasta",
            "pearson",
            "ncbi",
            "nbrf pir",
            "genbank gb",
            "ig",
            "codata",
            "strider",
            "acedb",
            "staden experiment",
            "text plain raw",
            "fitch",
            "msf",
            "clustal aln",
            "phylip",
            "phylip3",
            "asn1",
            "hennig86",
            "mega",
            "meganon",
            "nexus paup",
            "nexusnon paupnon",
            "jackknifer",
            "jackknifernon",
            "treecon",
            "debug"
        ],
        [
            "Single/ Multiple",
            "single",
            "single",
            "multiple",
            "multiple",
            "multiple",
            "multiple",
            "multiple",
            "multiple",
            "multiple",
            "multiple",
            "multiple",
            "multiple",
            "multiple",
            "single",
            "single",
            "multiple",
            "multiple",
            "multiple",
            "multiple",
            "multiple",
            "multiple",
            "multiple",
            "multiple",
            "multiple",
            "multiple",
            "multiple",
            "multiple",
            "multiple",
            "multiple",
            "multiple"
        ],
        [
            "Comments",
            "Wisconsin Package GCG 9.x and 10.x format with the sequence type on the first line of the file.",
            "GCG 8.x format where anything up to the first line containing \"..\" is considered as heading, and the remainder is sequence data.",
            "EMBL entry format with available fields filled in and others with no infomation omitted. The EMBOSS command line allows missing data such as accession numbers to be provided if they are not obtainable from the input sequence.",
            "SwisProt entry format with available fields filled in and others with no infomation omitted. The EMBOSS command line allows missing data such as accession numbers to be provided if they are not obtainable from the input sequence.",
            "Standard Pearson FASTA format, but with the accession number included after the identifier if available.",
            "Simple Pearson FASTA format, an alias for \"fasta\" format.",
            "NCBI style FASTA format with the database name, entry name and accession number separated by pipe (\"|\") characters.",
            "NBRF (PIR) format, as used in the PIR database sequence files.",
            "GENBANK entry format with available fields filled in and others with no infomation omitted. The EMBOSS command line allows missing data such as accession numbers to be provided if they are not obtainable from the input sequence.",
            "Intelligenetics format, as used by the Intelligenetics package",
            "CODATA format.",
            "DNA strider format",
            "ACeDB format",
            "The experiment file format used by the \"gap\" program in the Staden package. Some alternative nucleotide ambiguity codes are used and are converted.",
            "Plain sequence, no annotation or heading.",
            "Fitch format",
            "Wisconsin Package GCG's MSF multiple sequence format.",
            "Clustal multiple sequence format.",
            "PHYLIP non-interleaved format.",
            "PHYLIP interleaved format.",
            "A subset of ASN.1 containing entry name, accession number, description and sequence, similar to the current ASN.1 output of readseq",
            "Hennig86 format",
            "Mega format",
            "Meganon format",
            "Nexus/PAUP format",
            "Nexusnon/PAUPnon format",
            "Jackknifer format",
            "Jackknifernon format",
            "Treecon format",
            "EMBOSS sequence object report for debugging showing all available fields. Not all fields will contain data - this depends very much on the input format used."
        ]
    ],
    "pageTitle": "EMBOSS: seqret",
    "title": "",
    "url": "http://emboss.sourceforge.net/apps/release/6.0/emboss/apps/seqret.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042992543.60/warc/CC-MAIN-20150728002312-00128-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 81773855,
    "recordOffset": 81757032,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{44795=N.B This behaviour changed in EMBOSS version 1.7.0. (31 Oct 2000) Previously, EMBOSS programs that were asked to write multiple sequences in a single format would ignore the requested output file name and would write each sequence into a separate file whose name was constructed from the sequence name and the name of the format. This resulted in ouput to files whose names could not be reliably controlled. A decision was taken that EMBOSS users were intelligent people who could live with the consequences of their actions and who could learn not to write out multiple sequences to a file in formats that could not cope with multiple sequences.}",
    "textBeforeTable": "Example USAs The following are valid USAs for sequences: The output USA name 'stdout' is special. It makes the output go to the device 'standard output'. This is the screen, by default. Database queries, and individual entries in files that have more than one sequence entry, use wildcards of \"?\" for any character and \"*\" for any string of characters. There are some problems with the Unix shell catching these characters so they do need to be hidden in quotes or preceded by a backslash on the Unix command line, (for example \"embl:hs\\*\") Valid names of the databases set up in your local implementation of EMBOSS can be seen by using the program 'showdb'. Note also that '::' separates the specified format of a file from the name of the file. Normally the format can be omitted, in which case the program will attempt to identify the correct format when reading the sequence in and will default to using FASTA format when writing the sequence out. Note that ':' separates the name of a file containing many possible entries from the specific name of a sequence entry in that file. It also separates the name of a database from an entry in that database \"@file\" \"database\" \"database:entry\" \"format::file:entry\" \"format::file\" \"file:entry\" \"file\" The basic USA syntax is one of: See the full specification of",
    "textAfterTable": "treecon Treecon format mega Mega format meganon Meganon format ig IntelliGenetics format. staden experiment The experiment file format used by the \"gap\" program in the Staden package, where the sequence identifier is optional and the remainer is plain text. Some alternative nucleotide ambiguity codes are used and must be converted. unknown text plain Plain text. This is the format with no format. The whole of the file is read in as a sequence. No attempt is made to parse the file contents in any way. Anything is acceptable in this format. raw Like unknown/text/plain format except that it accepts only alphanumeric and whitespace characters and rejects anything else. asis This is not so much a sequence format as a quick way of entering a sequence on the command line, but it is included here for completeness. Where a filename would normally be given, in asis format there is the sequence itself. An example would be: asis::atacgcagttatctgaccat In 'asis' format the name is the sequence so no file needs to be opened. This is a special case. It was intended as a joke, but could be quite useful for generating command lines. Output sequence formats To date, the following sequence formats are available as output. Some sequence formats can hold multiple sequences in",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}