{
    "relation": [
        [
            "Timestamp",
            "2008-11-08",
            "2008-10-21",
            "2008-08-18"
        ],
        [
            "Action",
            "Added",
            "Deleted",
            "Added"
        ],
        [
            "Category",
            "OBSOLETION",
            "OBSOLETION",
            "OBSOLETION"
        ],
        [
            "Detail",
            "replaced_by GO:0004222 (metalloendopeptidase activity)",
            "replaced_by GO:0004222 (metalloendopeptidase activity)",
            "replaced_by GO:0004222 (metalloendopeptidase activity)"
        ]
    ],
    "pageTitle": "GO:0030406 obsolete matrix metalloproteinase 25 activity",
    "title": "",
    "url": "http://www.ebi.ac.uk/QuickGO/GTerm?id=GO:0030406",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989891.18/warc/CC-MAIN-20150728002309-00244-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 422960751,
    "recordOffset": 422938165,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{129172=EMBL-EBI, Wellcome Trust Genome Campus, Hinxton, Cambridgeshire, CB10 1SD, UK +44 (0)1223 49 44 44, 129305=Copyright (c) EMBL-EBI 2013 | EBI is an Outstation of the European Molecular Biology Laboratory | Privacy | Cookies | Terms of use}",
    "textBeforeTable": "icon for more details. Synonyms are alternative words or phrases closely related in meaning to the term name, with indication of the relationship between the name and synonym given by the synonym scope. Click on the Synonyms GO:0030406 Wiki Page GONUTS This term was made obsolete because it represents a gene product. Comment OBSOLETE. Was not defined before being made obsolete. Definition Molecular Function Ontology obsolete matrix metalloproteinase 25 activity Name GO:0030406 ID Term Information This term is obsolete. Dataset Web Services P06727 This term was made obsolete because it represents a gene product. Term Basket",
    "textAfterTable": "Advice GO Identifier Ontology GO Term Name Replaced by GO:0004222 Molecular Function metalloendopeptidase activity Ancestor Chart This chart is interactive; you can click on the term boxes and legend for more information. Display Key ShowHide GO IDs ShowHide Term box width Term box height Slim colours ShowHide Show children ShowHide Image size limit (in megapixels) Note that setting the limit too high may result in images being generated slowly; it may even cause the browser to crash. The maximum limit is 20 megapixels. Child Terms This table lists all terms that are direct descendants (child terms) of GO:0030406: Term has no children Protein Annotation",
    "hasKeyColumn": true,
    "keyColumnIndex": 1,
    "headerRowIndex": 0
}