{
    "relation": [
        [
            "Type of Training",
            "Through course work",
            "Take district SB 1969",
            "Through credential program",
            "CLAD by examination",
            "Retire before 2000",
            "B-CLAD training",
            "Unclear about CLAD"
        ],
        [
            "# of Teachers",
            "47",
            "46",
            "3",
            "14",
            "6",
            "26",
            "8"
        ],
        [
            "Range of expenses",
            "$300 to $3000",
            "0 to $24",
            "two summers in Mexico",
            "",
            "0",
            "$200 to $13,000",
            "?"
        ],
        [
            "Mean",
            "$1271",
            "",
            "",
            "$ 70",
            "",
            "",
            ""
        ]
    ],
    "pageTitle": "Teachers Network: TNLI: Action Research: Policy for Effective Classroom Reform",
    "title": "",
    "url": "http://teachersnetwork.org/tnli/research/growth/williams.htm",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989891.18/warc/CC-MAIN-20150728002309-00213-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 238682557,
    "recordOffset": 238666163,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{29520=In May 1997, the district allowed me to survey all 650 Santa Barbara teachers. The evaluation form asked for teacher progress in meeting the CTC language requirement, costs, and value to their classroom instruction and student achievement. 150 surveys were returned for compilation., 47373=Darling-Hammond, Linda. November 1996. \"What Matters Most: A competent teacher for Every Child.\" Phi Delta Kappan 193-200, 47527=Darling-Hammond, Linda, Milbrey W. McLaughlin. April 1995. \"Policies That Support Professional Development In an Era of Reform.\" Phi Delta Kappan 597-604, 27807=When the CLAD/BCLAD regulations were issued in June 1994, California Teachers' Association (CTA) tried to exclude the life credential teachers from this training. Office of Civil Rights (OCR) of the U.S. Department of Education. warned that the rights of children took absolute priority and that no group of teachers could be exempted from a retraining requirement. OCR threatened that any district in which a teacher without proper training was employed in a LEP setting would lose its federal funding. In 1995, CTA was instrumental in the passage of SB 1969 which required 45 or 90 hours of training for seasoned teachers depending on their length of service. SB 1969 training must be completed by February 2000., 34192=The results suggests a need to modify the instructional methods since the desired outcomes of any staff development are to increase teacher skill and student achievement. Dennis Sparks, Fall 1994, says it well:, 25073=AUGUST, 1997, 40297=California State Superintendent Delaine Eastin was interviewed by the Santa Barbara News Press on September 25, 1996:, 48369=What Matters Most: Teaching for America's Future. September 1996 Summary Report: Report of the National Commission on Teaching & America's Future. Teachers College, Columbia Univ. Box 117, 525 W. 120th St.,NY NY 10027, 47868=Fullan, Michael G, and Matthew B. Miles. June 1992. \"Getting Reform Right: What Works and What Doesn't\" Phi Delta Kappan. 745-751, 33927=Teachers did not think the CLAD instruction by course work, examination, or SB 1969 had a great effect on their classroom instruction or their students' achievement. Even less effect was noted by the seasoned teachers taking the SB 1969 training., 48191=Sparks, Dennis. Fall 1994. \"A Paradigm Shift in Staff Development\", Journal of Staff Development. and The Eric Review Vol. 3 Issue 3, Winter 1995, 36248=My second experience was in 1983 when I was selected as a National Science Foundation Tri-County Math Project Fellow. The first year in the project began with a summer institute and then monthly meetings. Since then, at least two support meetings have been offered each year. This format helped me to realize the value of long term high-quality effective professional development that includes support groups and follow-up training. What a wonderful way to learn! Teachers, working with their peers, would share a lesson they had developed which was followed by peer interaction and support which made us feel valued. Each was encouraged and supported as we took on leadership roles outside the Project and became county, state, and national workshop presenters, district mentors, and staff development facilitators. The Project brought effective changes to my teaching style and helped my students gain deeper understandings and higher achievements in math and language., 28964=In October 1996, I conducted an informal evaluation of the district's quickly arranged SB 1969 training and received a negative reaction from most of the teachers. They were affronted that the district would mandate this review of English language theory and cultural sensitivity training when they had been scheduled earlier to attend their schools' regular staff development. When the Santa Barbara Teachers' Association and district explained the state's mandate and the fact the training could save their jobs, there was a change in attitude., 41262=Linda Darling-Hammond and Milbrey McLaughlin , April 1995, mention,, 47713=Dilworth, Mary E. and David G. Imig. Winter 1995. \"Professional Teacher Development\" The ERIC Review. Vol. 3 Issue 3. 5-11, 38581=Linda Darling-Hammond and Milbrey McLaughlin , April 1995, state:, 48030=Liberman, Ann, and Lynne Miller.June 1990. \"Restructuring Schools: What Matters and What Works.\" Phi Delta Kappa 71 (10):759-764, 28531=The OCR threat involved districts in the problem of training. My 1996-97 research in the districts of Santa Barbara County showed that the Santa Barbara School Districts were the only two who reached out to help their GTC teachers by offering the 45 hour SB 1969 CLAD training to teachers who had taught more than nine years. The staff development was scheduled during the work day with a $24 text book as the only expense., 25889=In an attempt to deal with this problem, California passed legislation Senate Bill (SB) 2987 in 1991 to collapse into two the nearly one dozen different English as a Second Language (ESL) and bilingual education certificates then being issued by the Commission on Teacher Credentialing (CTC). On January 7,1994, the CTC adopted proposed regulations for new certificates that authorized instructional services to LEP students. These new certificates were the Cross-cultural, Language and Academic Development (CLAD) Certificate and the Bilingual, Cross-cultural, Language and Academic Development (BCLAD) Certificate. When the regulations became official, the CTC immediately implemented them. The purpose of the CLAD/BCLAD Certificates was to identify teachers who had demonstrated the level of knowledge and skills required to teach LEP students satisfactorily.}",
    "lastModified": "Mon, 15 Jun 2015 22:35:35 GMT",
    "textBeforeTable": "by Lynda Williams AUGUST, 1997 Recommendations District Policies Regarding Professional Development Elements of Effective Staff Development Works Cited California has been centralizing both school finance and educational standards for two decades. It has made aggressive efforts to reform educational practice aligning the goals, content, and outcome standards for classroom instruction. As the school population's language diversity increased and included more Limited-English-proficient (LEP) children, it became concerned about the low school performance of many of these students and the shortage of teachers qualified to teach bilingual students. In an attempt to deal with this problem, California passed legislation Senate Bill (SB) 2987 in 1991 to collapse into two the nearly one dozen different English as a Second Language (ESL) and bilingual education certificates then being issued by the Commission on Teacher Credentialing (CTC). On January 7,1994, the CTC adopted proposed regulations for new certificates that authorized instructional services to LEP students. These new certificates were the Cross-cultural, Language and Academic Development (CLAD) Certificate and the Bilingual, Cross-cultural, Language and Academic Development (BCLAD) Certificate. When the regulations became official, the CTC immediately implemented them. The purpose of the CLAD/BCLAD Certificates was to identify teachers who had demonstrated the level of knowledge and skills required to teach LEP students satisfactorily. Some teachers held or met some of the requirements for earlier certificates that authorized instructional services to LEP students. Most of",
    "textAfterTable": "Rate CLAD instruction on the following scale as to application to your classroom instruction: 0 to 5, 0 being no change, 5 being postive improvement Type of Training Median Through course work 3 Take district SB 1969 2 CLAD by examination 3 B-CLAD training 3 Rate CLAD instruction on the following scale as to its impact on your students' achievements: 0 to 5, 0 being no change, 5 being postive improvement Type of Training Median Through course work 3 Take district SB 1969 2 CLAD by examination 3 B-CLAD training 3 I found that most teachers who chose to meet the B-CLAD had qualified under their previous bilingual training. Teachers did not think the CLAD instruction by course work, examination, or SB 1969 had a great effect on their classroom instruction or their students' achievement. Even less effect was noted by the seasoned teachers taking the SB 1969 training. The results suggests a need to modify the instructional methods since the desired outcomes of any staff development are to increase teacher",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}