{
    "relation": [
        [
            "",
            "First downs",
            "Net yards rushing",
            "Net yards passing"
        ],
        [
            "M",
            "15",
            "160",
            "111"
        ],
        [
            "C",
            "9",
            "63",
            "116"
        ]
    ],
    "pageTitle": "Prep football summaries from Week 4 - The Commercial Appeal",
    "title": "",
    "url": "http://www.commercialappeal.com/sports/high-school/prep-football-summaries-week-4",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989891.18/warc/CC-MAIN-20150728002309-00063-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 365871499,
    "recordOffset": 365831859,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{47645=Jackson Prep 52, Lamar School 27, 41587=Lamar 37, Dover 8}",
    "textBeforeTable": "CRAIGMONT 14, BOLTON 13 At Bolton REGION 7-5A FRIDAY'S SUMMARIES MaxPreps: Click for prep football stats and summaries Yazoo City 47, Yazoo County 22 Wilkinson County Christian Academy 22, Franklin Academy, La. 6 West Tallahatchie 52, O'Bannon 20 West Point 21, New Hope 12 West Jones 21, Laurel 14 Wesson 35, Loyd Star 10 Wayne County 34, Starkville 0 Wayne Aca. 28, Winston Aca. 14 Washington School 33, Oak Hill Aca. 0 Vicksburg 31, Callaway 6 Veritas School 21, Deer Creek School 0 Velma Jackson 47, Humphreys 0 Vardaman 30, Okolona 6 Tylertown 34, North Pike 0 Trinity Episcopal 42, Prairie View, La. 14 Tri-County Aca. 34, Benton Aca. 24 TCPS 10, DeSoto, Ark. 7 Taylorsville 26, Morton 12 Sylva-Bay Aca. 27, Prentiss Christian 13 Strider Aca. 54, North Sunflower Aca. 0 Stone County 21, Harrison Central 14 St. Stanislaus 45, Bay St. Louis 13 St. Martin 24, East Central 20 St. Joseph, Greenville 63, Coldwater 8 St. Andrew's 44, McLaurin 18 St. Aloysius 31, Cathedral 28 Southeast Lauderdale 34, Carthage 6 Southaven 51, Frayser, Tenn. 6 South Pontotoc 38, Houston 14 South Pike 31, Wilkinson County 0 South Panola 28, Apopka, Fla. 18 Smithville 29, West Lowndes 20 Simpson Aca. 35, Indianola Aca. 14 Shaw 40, Broad Street 16 Shannon 21, Amory 0 Senatobia 24, Water Valley 16 Seminary 20, Enterprise Lincoln 0 Sebastopol 34, Edinburg 0 Russell Christian Academy 54, Mt. Salus 6 Riverside 28, Ruleville 16 Riverfield, La. 9, Canton Aca. 7 Ridgeland 28, Canton 0",
    "textAfterTable": "C — Keenan Thompkins 16 pass from Dearron Williams (Coronado Manuel kick) B — Jamel Harbison 3 run (kick failed) C — Jeremy Swift 11 run (Coronado Manuel kick) C B First downs 7 9 Net yards rushing 133 115 Net yards passing 146 104 INDIVIDUAL STATISTICS RUSHING — Craigmont, Trey Woods 5-50. Bolton, Tyler Perkins 8-56. PASSING — Craigmont, Logan Schear 1-2-(minus-4)-0, Dearron Williams 5-10-160-0. Bolton, Tyler Perkins 7-17-104-0. RECEIVING — Craigmont, Tevin Hines 3-40, Ricky Herron 1-71. Bolton, Kevin Sullivan 4-84. RECORDS — Craigmont 2-2 (1-1, Region 7-5A), Bolton 1-3 (1-2, Region 7-5A). At Cordova CORDOVA 20, OVERTON 8 Overton 0 0 0 8 — 8 Cordova 0 7 7 6 — 20 C — Rashard Shaw 1 run (Ahmad Zahir kick) C — Rashard Shaw 6 run (Ahmad Zahir kick) C — Ahmad Zahir 32 FG C — Ahmad Zahir 41 FG O — Courtney Jeffries 37 pass from Adrian Fox (Antonio Dodson pass from Adrian Fox) O C First downs 9 14 Net yards rushing (-4) 168 Net yards passing 206 135 INDIVIDUAL STATISTICS RUSHING — Cordova, Rashard Shaw 18-63, Brandon Woods 9-87. PASSING — Overton, Adrian Fox 8-17-206-0. Cordova, Keaton Baker 7-19-135-2. RECEIVING — Overton, Montae Houston 1-59. Cordova, Fletcher Cleaves 2-77. RECORDS — Overton 0-4 (0-2, Region 7-5A), Cordova 4-1",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}