{
    "relation": [
        [
            "Year",
            "1936",
            "1958",
            "1966",
            "1966",
            "1968",
            "1968",
            "1969",
            "1969",
            "1969",
            "1970",
            "1970",
            "1970",
            "1971",
            "1972",
            "1974",
            "1974",
            "1975",
            "1975",
            "1976",
            "1976",
            "1977",
            "1977",
            "1979",
            "1979",
            "1980",
            "1980",
            "1981",
            "1982",
            "1983",
            "1984",
            "1984",
            "1985",
            "1985",
            "1986",
            "1991",
            "1991",
            "1992",
            "1995",
            "2000",
            "2001",
            "2002",
            "2004",
            "2005",
            "2006",
            "2007",
            "2008",
            "2009",
            "2010",
            "2011"
        ],
        [
            "Team (Men's)",
            "",
            "Basketball[362]",
            "Cricket[362]",
            "Squash[362]",
            "Cricket[362]",
            "Table Tennis[362]",
            "Cricket[362]",
            "",
            "Table Tennis[362]",
            "Cricket[362]",
            "",
            "Table Tennis[362]",
            "Table Tennis[362]",
            "",
            "",
            "Trampolining[362]",
            "",
            "",
            "Ten Pin Bowling[362]",
            "",
            "",
            "",
            "Squash[362]",
            "Trampolining[362]",
            "Squash[362]",
            "Volleyball[362]",
            "Volleyball[362]",
            "",
            "Volleyball[362]",
            "Archery[362]",
            "Weight Lifting[362]",
            "Archery[362]",
            "5-a-side[362]",
            "5-a-side[362]",
            "Archery[362]",
            "5-a-side[362]",
            "Archery[362]",
            "",
            "Windsurf[362]",
            "Windsurf[362]",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            ""
        ],
        [
            "Team (Women's)",
            "Tennis[362]",
            "Badminton[362]",
            "",
            "",
            "",
            "",
            "Squash[362]",
            "",
            "",
            "Hockey[362]",
            "",
            "",
            "",
            "",
            "Tennis[362]",
            "",
            "Badminton[362]",
            "Tennis[362]",
            "Badminton[362]",
            "Squash[362]",
            "Badminton[362]",
            "Swimming[362]",
            "Lacrosse[362]",
            "Ten Pin Bowling[362]",
            "Lacrosse[362]",
            "",
            "",
            "Fencing[362]",
            "",
            "",
            "",
            "Volleyball[362]",
            "",
            "Volleyball[362]",
            "",
            "",
            "",
            "Rowing[362]",
            "",
            "",
            "",
            "",
            "",
            "Rifle Shooting",
            "",
            "Rifle Shooting",
            "Rifle Shooting",
            "",
            ""
        ],
        [
            "Team (Mixed)",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "Rifle Shooting[362]",
            "",
            "",
            "Rifle Shooting[362]",
            "",
            "",
            "Rifle Shooting[362]",
            "Rifle Shooting[362]",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "Rifle Shooting",
            "Rifle Shooting",
            "Rifle Shooting",
            "Rifle Shooting",
            "Rifle Shooting",
            "Rifle Shooting",
            "",
            "Rifle Shooting",
            "Rifle Shooting"
        ]
    ],
    "pageTitle": "University of Southampton - Wikipedia, the free encyclopedia",
    "title": "",
    "url": "https://en.wikipedia.org/wiki/University_of_Southampton",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989891.18/warc/CC-MAIN-20150728002309-00112-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 874933871,
    "recordOffset": 874841127,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{85884=In the 2014 Research Excellence Framework assessing the research output of 154 British Universities and Institutes, Southampton was ranked 18th for GPA (15th among Russell Universities), 11th for research power (11th among Russell Universities), and 8th for research intensity (7th among Russell Group Universities).[90], 60815=The campus was formerly the Biomedical Sciences campus of the university and acted, until 2010, as a non-hospital base for the School of Medicine and home to a research facility for the Biological Sciences. These departments were then relocated to either Southampton General Hospital,the new Life Sciences building at Highfield, or the University of Southampton science park., 220509=The Southampton Mustangs Baseball Club was founded in 1997 by a group of students. In the early years, the club participated in mainly friendly games against other British university baseball teams, as no formal university league was in existence. Starting in 1998, the Mustangs started to host a university baseball tournament – inviting other teams including Oxford, Cambridge, Portsmouth, Royal Holloway, and Norwich. In 2004 the Mustangs entered into the national adult baseball leagues run by the British Baseball Federation (BBF). The club entered in the lowest division, but after a few years of consolidation, the Mustangs have worked their way up from the lower leagues in the BBF to play in the top-tier league of the British baseball, the British National Baseball League (NBL), in the 2010 season.[361] The British National Baseball League is with the aim of establishing flagship British Baseball clubs., 37726=In the autumn of 1997, the university experienced Britain's worst outbreak of meningitis, with the death of three students.[27] The university responded to the crisis by organising a mass vaccination programme, and later took the ground-breaking decision to offer all new students vaccinations.[26], 191004=The student union is actually separate from the University of Southampton, and is its own business. It gets funds partially from the university to finance many of its activities. The multiple award winning student radio station, Surge, broadcasts from new studios in the main union building. The award winning website[335] SUSU.org was created and run by students at the university. A brand new purpose built studio has been constructed for the TV station SUSUtv. The student newspaper, originally Wessex News, is now published once every three weeks as Wessex Scene following a name change in 1996. The Edge, originally an insert of the Wessex Scene, is now an editorially independent entertainment magazine. Events are held in The Cube, the union's nightclub (In 2013 the unions nightclub was \"rebranded\" Pulse, This then ended due to lack of interest),[336] The Bridge, the union's cocktail bar, and in the Stag's Head, the union pub. National touring bands play in the Garden Court in the West Building., 31869=On 29 April 1952, Queen Elizabeth II granted the University of Southampton a Royal Charter, the first to be given to a university during her reign, which enabled it to award degrees.[23] Six faculties were created: Arts, Science, Engineering, Economics, Education and Law. The first University of Southampton degrees were awarded on 4 July 1953, following the appointment of the Duke of Wellington as Chancellor of the university. Student and staff number grew throughout the next couple of decades as a response to the Robbins Report. The campus also grew significantly, when in July 1961 the university was given the approval to acquire some 200 houses on or near the campus by the Borough Council.[24] In addition, more faculties and departments were founded, including Medicine and Oceanography (despite the discouragement of Sir John Wolfenden, the chairman of the University Grants Committee).[24] Student accommodation was expanded throughout the 1960s and 1970s with the acquisition of Chilworth manor and new buildings at the Glen Eyre and Montefiore complexes., 55662=The university's involvement began in 1971, when it became the first to house a new school of medicine alongside the universities of Nottingham and Leicester, and currently extends to several operations and specific research centres., 83207=As of 2014 the Webometrics Ranking of World Universities places Southampton 32nd worldwide and 5th in the UK,[85] the Center for World University Rankings ranks Southampton 11th in the UK.,[86] and Scimago institutions rankings puts Southampton 11th for research output and 13th for scientific talent pool. Also, Southampton is one of the few British universities who succeed a top 20 position in all of the most established international and national rankings (see table on the right)., 61536=The University of Southampton Science Park contains approximately 50 businesses that either wish to work with the university or were established by the university itself and which use the surroundings of the park to grow. Originally established in 1983 as Chilworth Science Park, named after the manor house that is now a luxury hotel and conference centre,[63] the park houses business incubator units to help these companies. The companies occupying the park range in expertise and fields including oil and gas exploration, pharmaceuticals, nanotechnology and optoelectronics, with the businesses being particularly effective[64] with three of the twelve successful spin-out companies created since 2000 being floated on London's Alternative Investment Market (AIM) with a combined market capitalisation value of £160 million.[65] The park was renamed in 2006.[66] Notable companies include Merck KGaA, PrimerDesign, Karus Therapeutics and Synairgen., 57817=The university opened its first international campus, based in Nusajaya, Malaysia in October 2012.[58][59] The campus operates courses in the engineering sectors at present and students are able to continue their studies by travelling to the UK. The Malaysian campus includes state of the art equipment and facilities.[60], 56620=The Winchester School of Art, located in central Winchester, houses the university's arts and textiles courses that are part of the Faculty of Business and Law. The school itself was established in the 1960s and was integrated into the University of Southampton in 1996. The campus contains the original school buildings from the 1960s in addition to structures built when the merger occurred and in 1998 when the Textile Conservation Centre moved to the site from Hampton Court Palace. The centre remained with the school until its closure in 2009. The campus also contains a small union building run by the university's Students' Union., 208797=The final of the three Art Council supported venues on campus is the John Hansard Gallery. The gallery was opened on 22 September 1980 but is housed in a building that previously housed a tidal model of Southampton Water between 1957 and 1978.[353] It took over responsibility from a photographic gallery, a gallery in the Nuffield Theatre and one located on Boldrewood campus.[353] It houses various exhibitions in contemporary art and is due to move to new premises in Guildhall Square in c.2015.[354], 26617=In 1902, the Hartley College became the Hartley University college, a degree awarding branch of the University of London. This was after inspection of the teaching and finances by the University College Grants Committee,[20] and donations from Council members (including William Darwin the then Treasurer). An increase in student numbers in the following years motivated fund raising efforts to move the college to greenfield land around Back Lane (now University Road) in the Highfield area of Southampton. On 20 June 1914, Viscount Haldane opened the new site of the renamed Southampton University College. However, the outbreak of the First World War six weeks later meant no lectures could take place there, as the buildings were handed over by the college authorities for use as a military hospital. To cope with the volume of casualties, wooden huts were erected at the rear of the building. These were donated to university by the War Office after the end of fighting, in time for the transfer from the high street premises in 1920. At this time, Highfield Hall, a former country house and overlooking Southampton Common,[21] for which a lease had earlier been secured, commenced use as a halls of residence for female students. South Hill, on what is now the Glen Eyre Halls Complex was also acquired, along with South Stoneham House to house male students., 189554=The University of Southampton Students' Union (SUSU), is sited in three buildings opposite the Hartley Library. One, the West Building, dates back to the 1940s in a red brick style, complementing the Hartley Library opposite; the main building was built in the 1960s in the Basil Spence masterplan. This was extended with new nightclub and cinema facilities in 2002. The newest building was built during the mid-1990s which includes the recently refurbished union shop, on the ground floor, and hairdressers, Unilink office and Wessex Clothing, all on the first floor., 42241=The university joined The Science and Engineering South Consortium (SES-5) on 9 May 2013. the SES-5 was created to pool the collective insights and resources of the University of Oxford, University of Cambridge, Imperial College London and University College London to innovate and explore new ideas through collaboration whilst providing efficiencies of scale and shared utilisation of facilities. This is the most powerful cluster of research intensive universities in the UK and the new consortium is to become one of the world's leading hubs for science and engineering research.[49], 82666=The University of Southampton has been rated as one of the world's top 100 universities by the Times Higher Education Table,[83] while the 2012 QS World University Rankings[84] ranked Southampton 73rd overall in the world (and up to 2014 in the top 100 worldwide for eight consecutive years)., 207686=The Turner Sims Concert Hall was added to the art provision in October 1974 following a £30,000 (£460,000 in 2012) donation from Margaret Grassam Sims in 1967.[352] It was made to provide a venue specifically for music following difficulties in gaining space in the Nuffield Theatre and due to acoustical differences with the spaces.[352] The new space has a single auditorium, designed by the university's Institute of Sound and Vibration Research with musical performances in mind, with a flat space at the bottom so it could be used for exams.[352], 219700=The University Athletic Union was formally established on 29 November 1929, by the University College council. Versions of the union had existed previously to which many clubs such as Cricket, Association Football, Rugby, Boxing, Gymnastics, Tennis and Boat clubs (all formed before the turn of the 20th century) were members.[360], 217433=The university's Sport and Wellbeing department runs the majority of the sports facilities on campus which are based predominately at two locations: the Jubilee Sports Centre and Wide Lane Sports Ground. The Jubilee Sports Centre, opened in 2004 at a cost of £8.5 million, is located on the Highfield Campus and contains a six-lane 25-metre swimming pool, 160 workstation gym and an eight-court sports hall.[357] Wide Lane meanwhile is located nearby in Eastleigh and was refurbished at cost of £4.3 million in 2007. The 73-acre (30 ha) complex includes flood-lit synthetic turf and grass pitches, tennis courts, a pavilion and a 'Team Southampton' Gym.[358] The university also runs facilities at the Avenue Campus, National Oceanography Centre, the Watersports Centre on the River Itchen and at Glen Eyre and Wessex Lane halls while there is another sports hall, squash courts, martial arts studio and bouldering wall located within the Students' Union.[357][358], 68039=Responsibility for running the university is held formally by the Chancellor, currently Dame Helen Alexander, and led at the executive level by the Vice-Chancellor, currently Don Nutbeam. On 20 March 2015 the University announced[69] that Christopher Snowden had been appointed as its new Vice Chancellor and would join the university in October 2015 following Don Nutbeam's retirement. The key bodies in the university governance structure are the Council, Court and Senate., 206332=The university's main Highfield campus is home to three main arts venues supported and funded by the university and Arts Council England. The Nuffield Theatre opened in 1963 with construction funded by a grant from the Nuffield Foundation of £130,000 (£2,450,000 in 2013).[348] The building was designed by Sir Basil Spence as part of his campus masterplan with additional direction provided by Sir Richard Southern.[349] The theatre consists of a 480-seat auditorium, that also served as the principle lecture theatre at the time of construction, as well as additional lecture theatres and adjacent Kitchen bar.[350][351], 7061=The origins of the university date back to the founding of the Hartley Institution in 1862 following a legacy to the Corporation of Southampton by Henry Robinson Hartley. In 1902, the Institution developed into the Hartley University College, with degrees awarded by the University of London.[7] On 29 April 1952, the institution was granted a Royal Charter to give the University of Southampton full university status. It is a member of the European University Association, the Association of Commonwealth Universities and is an accredited institution of the Worldwide Universities Network., 49473=Avenue Campus is currently home to the Faculty of Humanities, with the exception of Music, and is located a short distance away from the main Highfield campus. The site previously housed the Southampton Tramsheds and Richard Taunton's College, of which the existing building still stands on the site. It was purchased by the university from Southampton City Council for £2 million in December 1993[26] so that the university may expand – planning regulations meant that excess land on the Highfield campus couldn't be built on and had to be reserved for future car parking spaces.[53] The departments moved onto the campus in 1996.[54] The campus consists of the original Tauntons building from the early 20th century but redevoloped with a glass-fronted courtyard and extension and a new Archaeology building built in 2006 costing £2.7 million.[55], 64555=To connect the university's Southampton campuses, halls of residence, hospitals, and other important features of the city, the university operates the Unilink bus service for the benefit of the students, staff and the general public. Created in 1998, the service is currently operated by local bus company Bluestar using the Unilink name. The service consists of four routes. The most popular is the U1, which runs between Southampton Airport and the National Oceanography Centre via Wessex Lane Halls, Highfield campus, Portswood, Southampton City Centre and Southampton Central railway station. The other regular routes, the U2 and the U6, run between the City Centre and Bassett Green and Southampton General Hospital respectively while the final route, the U9, runs an infrequent service between Southampton General hospital and Townhill Park. Students who live in halls of residence receive an annual smart-card bus pass, allowing them to use all of the Unilink services without extra payment., 8221=In the 2014 Research Excellence Framework Southampton was ranked 8th for research intensity. Besides being recognised as one of the leading research universities in the UK, Southampton has also achieved consistently high scores for its teaching and learning activities.[8] It additionally has one of the highest proportions of income derived from research activities in Britain,[9][10] and is regularly ranked in the top 100 universities in the world. As of 2014 Southampton is one of the few universities to achieve a top 20 UK position in the most established national and international rankings[citation needed] (along Cambridge, Oxford, Imperial, UCL, LSE and Warwick)., 38303=The university celebrated its Golden Jubilee on 22 January 2002. By this time, Southampton had research income that represented over half of the total income,[26] which remains one of the highest proportions of income derived from research activities of British Universities.[9] In recent years a number of new landmark buildings have been added as part of the estates development. New constructions on the main campus include the Jubilee Sports Hall in 2004,[28][29] the EEE (ECS, Education and Entrance) building in 2007,[30][31][32] the new Mountbatten building in 2008 housing the School of Electronics and Computer Science[33][34] following a fire[35][36] and the Life Sciences building in 2010.[37][38][39] In addition, the Hartley Library and Student Services Centre were both extended and redesigned in 2005[40][41][42] and the Students' Union was also extended in 2002.[43][44] Other constructions include the Archaeology building on Avenue Campus in 2006[45][46] and the Institute of Development Sciences building at Southampton General Hospital in 2007.[47] The university is currently constructing a new research centre on a nearby campus which will be occupied by the University and part of Lloyd's Register.[48], 45605=The university's main campus is located in the residential area of Highfield. Opened on 20 June 1914, the site was initially used as a military hospital during World War I. The campus grew gradually, mainly consisting of detailed red brick buildings (such as the Hartley library and West building of the Students' Union) designed by Sir Giles Gilbert Scott.[51] In 1956, Sir Basil Spence was commissioned to prepare a masterplan of the campus for the foreseeable future.[52] This included incorporating the University Road, that split the 59-acre (24 ha) campus in two and the quarry of Sir Sidney Kimber's brickyard that itself was split by a stream. Unable to remove the road and the private houses along it, Spence designed many of the buildings facing away from it, using contemporary designs working in concrete, glass and mosaic.[52] During recent decades, new buildings were added that contravened the master plan of Spence, such as the Synthetic Chemistry Building and Mountbatten Building (the latter of which was destroyed by fire in 2005)., 53792=Planning of the campus began in 1989 and was completed in 1994 due to cuts and uncertainties whether a national research centre could be successfully integrated with a university.[57] It was opened in 1996 by the Duke of Edinburgh. The campus was also the base for the NERC purpose-built research vessels RRS James Cook and until recently the RRS Discovery and the RRS Charles Darwin., 33688=In 1987, a crisis developed when the University Grants Committee announced, as part of nationwide cutbacks, a series of reductions in the funding of the university.[25] To eliminate the expected losses, the budgets and deficits subcommittee proposed reducing staff numbers. This proposal was met with demonstrations on campus and was later reworked (to reduce the redundancies and reallocate the reductions in faculties funding) after being rejected by the university Senate.[25], 201124=The university's primary library is the Hartley Library, located on Highfield campus and first built in 1935 and extended further in 1959 and 2005.[339] The majority of the books and periodicals are held there as well as specialist collections of works such as Ford collection of Parliamentary papers and the European Documentation Centre. In addition, the main library houses the Special Collections and Archives centre, housing more than 6 million manuscripts and a large archive of rare books.[340] Specific collections include the correspondence of Arthur Wellesley, 1st Duke of Wellington, acquired by the university in 1983, as well as the Broadlands Archive, including the Palmerston and Mountbatten papers. The library also contains 4,500 volumes of Claude Montefiore's library on Theology and Judaism, the Ford Parliamentary Papers, Frank Perkins' collection of books on agriculture, Sir Samual Gurney-Dixons's Dante collection and the James Parkes Library of Jewish/non-Jewish relations.[340] The library also includes six rare editions of the Divina Commedia; the first of these, the Brescia edition of 1487, is the library's earliest book.[340], 72142=The university comprises eight faculties, each with a number of academic units.[73] This current faculty structure came into effect in 2010, taking over from a structure consisting of three faculties and several separate schools as part of them.[74] The current faculty structure is:, 198810=The university is currently in the process of constructing a new halls of residence on Burgess Road, approximately half way between Highfield Campus and Wessex Lane Halls complex, called City Gateway. This is due to open in time for the start of the 2015/2016 academic year.[337][338] They are also in the process of replacing the former Chamberlain hall.[337], 21952=The University of Southampton has its origin as the Hartley Institution which was formed in 1862 from a benefaction by Henry Robinson Hartley (1777–1850). Hartley had inherited a fortune from two generations of successful wine merchants.[16] At his death in 1850, he left a bequest of £103,000 to the Southampton Corporation for the study and advancement of the sciences in his property on Southampton's High Street, in the city centre., 47301=A new masterplan for the Highfield campus was drawn up in 1998 by Rick Mather, who proposed that the University Road should become a tree-lined boulevard backed by white-rendered buildings. He also contributed some of the newer buildings such as the Zepler and Gower Buildings. In 1991, the Highfield Planning Group was formed within the university under the chairmanship of Tim Holt. This led to the development of new buildings such as the Jubilee Sports Hall, Student Services Building and the Institute of Sound and Vibration Research. In addition, existing buildings, such as the Hartley Library, were extensively renovated and extended., 190142=In May 2002, (after numerous attempts going back several years), it chose to disaffiliate itself from the NUS, believed by SUSU to be too bureaucratic.[332] In December 2010, a referendum was held to decide whether SUSU should re-affiliate with the NUS, with the result being that SUSU should remain outside the NUS.[333] A Further Referendum took place in 2012, with 73% of voters opting to remain independent of the NUS.[334], 184739=The Institute of Sound and Vibration Research (ISVR), is an acoustical research institute which is part of the University of Southampton. Founded in 1963, it has been awarded a 2006 Queen's Anniversary Prize for Higher and Further Education.[326], 84327=Southampton is the only UK university in which every engineering department has received the top 5* rating for research. It is cited as being the UK's leading university for engineering.[87] The Guardian ranked the university at number 1 in the UK for Mechanical Engineering, Aeronautical Engineering, Naval Architecture, Electronic and Electrical Engineering in 2011.[88][89], 65968=The fleet of buses was replaced in September 2013 with new Alexander Dennis Enviro400 double-decker buses on most routes.[67][68], 24700=On 15 October 1862, the Hartley Institute was opened by the Prime Minister Lord Palmerston in a major civic occasion which exceeded in splendor anything that anyone in the town could remember.[19] After initial years of financial struggle, the Hartley Institute became the Hartley College in 1883. This move was followed by increasing numbers of students, teaching staff, an expansion of the facilities and registered lodgings for students.}",
    "lastModified": "Mon, 03 Aug 2015 05:03:06 GMT",
    "textBeforeTable": "National Student Champions from the University of Southampton Throughout its history the university has had a number of successful teams in national student championships. National student championships[edit] The Southampton Mustangs Baseball Club was founded in 1997 by a group of students. In the early years, the club participated in mainly friendly games against other British university baseball teams, as no formal university league was in existence. Starting in 1998, the Mustangs started to host a university baseball tournament – inviting other teams including Oxford, Cambridge, Portsmouth, Royal Holloway, and Norwich. In 2004 the Mustangs entered into the national adult baseball leagues run by the British Baseball Federation (BBF). The club entered in the lowest division, but after a few years of consolidation, the Mustangs have worked their way up from the lower leagues in the BBF to play in the top-tier league of the British baseball, the British National Baseball League (NBL), in the 2010 season.[361] The British National Baseball League is with the aim of establishing flagship British Baseball clubs. Mustangs Baseball Club[edit] The University Athletic Union was formally established on 29 November 1929, by the University College council. Versions of the union had existed previously to which many clubs such as Cricket,",
    "textAfterTable": "Notable people[edit] Main article: List of University of Southampton people Academics[edit] Academics working at the university include Sir Tim Berners-Lee, inventor of the World Wide Web,[363] Erich Zepler, who made leading contributions to radio receiver development,[364] David Payne, who invented EDFA for use in fibre optics cables,[365] Sir Barry Cunliffe, a pioneer of modern British archaeology,[366] Ray Monk, the biographer of Ludwig Wittgenstein, Albie Sachs, former Judge of the Constitutional Court of South Africa,[367] and Tim Holt, former President of the Royal Statistical Society and Office for National Statistics.[368] See also[edit] Hampshire portal",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}