{
    "relation": [
        [
            "Categories",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "Again, this is a community college. A cafeteria is not offered, but the Huntsville campus is close to several dining options.",
            "Since this is a community college, there are no dorm rooms available. However, many apartment complexes as well as town homes are within walking distance of the Huntsville campus.",
            "Over the past few years, Calhoun has a higher expectation of students maintaining a good standing academically to hold financial aid.",
            "Talk to an advisor about any questions you may have about your classes. They will direct you in the right path and offer options you may not know about.",
            "Calhoun has been a great community college for me. This school offers on site classes as well as distance learning for convenience. The tuition costs are reasonable as well."
        ]
    ],
    "pageTitle": "John C Calhoun State Community College Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/John-C-Calhoun-State-Community-College/reviews?_escaped_fragment_=/show/40190",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042992543.60/warc/CC-MAIN-20150728002312-00013-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 899539567,
    "recordOffset": 899497946,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{186949=© 2015, Cappex.com, LLC, 167632=Get a map and locate your classes pior to starting Get to campus early if your class is at 8am it would be safe to get to campus at 7:30 in order to get a good parking spot. Work hard at the beginging of the semster, 136819=This is really a good school, so far I have been here going on three years and have had really good teachers. The science classes have gone really well. Decatur is the more beautiful out of the two campuses. Like any other college it dies not mean you will have an easy A just because it is a community college. You have to study, but almost every teacher I have had has been very helpful and cares for there students. Thankfully neither are easy to get lost at and if you do you can ask some one who happens to be walking the same direction as you. Just make sure they do not look lost too. Over all I really like this school and am glad to say that this May I will be graduating with my associates of science. This really is a good school and a way to get the same basics for cheaper. My greatest advice though is if you need to figure out your schedule and plan to transfer, do your own research on the next colleges requirements. The advisors sometimes do not truly know what that talk about. You must rely on your own research but they are still good for some advice and helpful information about Calhoun., 162670=I love Calhoun Community College! I am currently enrolled in the Nursing program there and will graduate as an RN in December. It is such a blessing to be involved in a program that truly cares about the patient and where our instructors go out of their way to help us understand what it is really like to be a nurse!, 24069=On the Huntsville campus, you will find Chick-Fil-A for lunch and Kira's Lunchbox from 1:30 to around 3:00 at the student center. And naturally, you will find Vending Machines. I have never tried Chick-Fil-A or Kira's Lunchbox, so I don't have much to say. But my friend has told me that Chick-Fil-A is unusually expensive.}",
    "textBeforeTable": "01/16/2011 Reviewer is A current student here. 2 out of 3 people found this review useful. 1 of 48 patricia from Athens, AL Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\");",
    "textAfterTable": "Login to rate or flag the reviews Anonymous 08/28/2011 Reviewer is A current student here. 2 out of 2 people found this review useful. 2 of 48 Categories Comments Great for these types of students Looking to go back to college; Looking to receive your basics; Great for nursing; Students who want a Vocational Certificate or an Associates degree; Those who are looking for a cheaper education, but still want a quality education. Tips for prospective students Don't buy your books until you have had your first class. I bought all mine the week before classes started, all a bunch of people had books that were a lot cheaper. I would have done this but the online bookstore is not vary specific on their text book policy. Wait until your professor gives you instructions. Bang for the buck The tuition is very cheap in comparison to other colleges. The tuition is currently $131 per credit hour and this covers fees, parking, student ID and your classes.",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}