{
    "relation": [
        [
            "Citing Patent",
            "US9077661 *",
            "US20130031224 *",
            "US20130166746 *",
            "WO2014008210A2 *"
        ],
        [
            "Filing date",
            "23 Dec 2011",
            "",
            "23 Dec 2011",
            "1 Jul 2013"
        ],
        [
            "Publication date",
            "7 Jul 2015",
            "31 Jan 2013",
            "27 Jun 2013",
            "9 Jan 2014"
        ],
        [
            "Applicant",
            "Cisco Technology, Inc.",
            "LabTech, LLC",
            "Cisco Technology, Inc.",
            "Cooper Bradley"
        ],
        [
            "Title",
            "System and method for policy selection and switching function in a network environment",
            "Automated provisioning and management of cloud services",
            "System and method for policy selection and switching function in a network environment",
            "Providing cross-channel opt-in, management and advertising"
        ]
    ],
    "pageTitle": "Patent US8180909 - Managed services platform - Google Patents",
    "title": "",
    "url": "http://www.google.com.au/patents/US8180909",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989891.18/warc/CC-MAIN-20150728002309-00153-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 484881575,
    "recordOffset": 484820665,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{63238=http://subscriptions.esoft.com/cgi-bin/GetServiceLocation?ServiceID=1040, 34260=This application is a continuation of application Ser. No. 11/154,891, filed Jun. 16, 2005, which is a continuation of application Ser. No. 09/766,469, filed Jan. 19, 2001, now U.S. Pat. No. 6,961,773, the contents of which are hereby incorporated by reference., 62989=http://subscriptions.esoft.com/cgi-bin/Subscribe.cgi?DeviceID+00A0CC6955B2&ServiceID=1040}",
    "textBeforeTable": "Patent Citations Because the invention is susceptible to various modifications and alternative forms, specific examples thereof have been shown in the drawings and are herein described in detail. It should be understood, however, that the invention is not to be limited to the particular forms or methods disclosed, but to the contrary, the invention should encompass all modifications, alternatives, and equivalents falling within the spirit and scope of the appended claims. In this document, the term “computer program product” is used to refer to any media that may be used to provide programming instructions or data to the system 10, or to any server or processor within the system 10, through for example, the Internet. Examples of such media include any memory products used by or within the system 10, any storage drives or devices (whether fixed or removable) used by or within the system 10, and any signals that may be transmitted to, from, or within the system 10. Those skilled in the art will appreciate that, in addition to the systems and methodologies described herein, the present invention is directed to the computer software applications, programs, protocols, routines, and instructions (collectively “computer programming instructions”) that are used to implement the above-described features and functions. Computer programming instructions preferably are stored within memory of the system, and may be received or transmitted via a communications interface. When executed by a processor (not shown) of",
    "textAfterTable": "US4992940 13 Mar 1989 12 Feb 1991 H-Renee, Incorporated System and method for automated selection of equipment for purchase through input of user desired specifications US5023907 30 Sep 1988 11 Jun 1991 Apollo Computer, Inc. Network license server US5138712 2 Oct 1989 11 Aug 1992 Sun Microsystems, Inc. Apparatus and method for licensing software on a network of computers US5155809 17 May 1989 13 Oct 1992 International Business Machines Corp. Uncoupling a central processing unit from its associated hardware for interaction with data handling apparatus alien to the operating system controlling said unit and hardware US5204897 14 Jul 1992 20 Apr 1993 Digital Equipment Corporation Management interface for license management system US5283868 17 May 1989 1 Feb 1994 International Business Machines Corp. Providing additional system characteristics to a data processing system through operations of an application program, transparently to the operating system US5329619 30 Oct 1992 12 Jul 1994 Software Ag Cooperative processing interface and communication broker for heterogeneous computing environments",
    "hasKeyColumn": true,
    "keyColumnIndex": 3,
    "headerRowIndex": 0
}