{
    "relation": [
        [
            "United States",
            "Canada",
            "Mexico",
            "Subject Areas:"
        ],
        [
            "Lead: Western Illinois University",
            "Lead: Université de Moncton",
            "Lead: Universidad Veracruzana",
            "Business"
        ],
        [
            "Partner: Western Kentucky University",
            "Partner: Université Laval",
            "Partner: Universidad Panamericana",
            "Trade"
        ]
    ],
    "pageTitle": "FY 2000 Project Abstracts -- Program for North American Mobility in Higher Education",
    "title": "",
    "url": "http://www2.ed.gov/programs/fipsenortham/2000projects.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989891.18/warc/CC-MAIN-20150728002309-00143-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 850667131,
    "recordOffset": 850649541,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "P116N000021 AQUA3: North American Alliance for Sustainable Water Resources FY 2000 PROJECT ABSTRACTS Awards Office of Postsecondary Education Home Contacts Performance FAQs",
    "textAfterTable": "The North American Alliance for Sustainable Water Resources will focus on the development of a program of study in the area of sustainable water resource management. The program will allow students from the United States, Canada, and Mexico to become knowledgeable in the area of cross-border water resource issues. Obtaining adequate supplies of water for present and future demand is one of the greatest environmental and economic issues facing the world today. The universities in this consortium were chosen not only for their diverse expertise in water resource management, but for their geographical diversity. The location of each university provides a different context with regard to climate, proximal water resources, and the local social and political dimensions of water resource management. This program trains students to think about water resources as a global problem. Total US funding for 4 years: $213,840 US Contact:James P. Cross, Michigan Technological University, 906 487-2160, jpcross@mtu.edu Canada Contact:François Anctil, Université Laval, 418 656-2131, Mexico Contact: José Luis García Ruíz, Universidad de Sonora, 62 59 21 09, jgarcia@guaymas.uson.mx North American Consortium on Legal Education P116N000003",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}