{
    "relation": [
        [
            "Frequency",
            "478.52500",
            "478.43750",
            "478.81250"
        ],
        [
            "License",
            "WQJX549",
            "",
            ""
        ],
        [
            "Type",
            "M",
            "M",
            "M"
        ],
        [
            "Tone",
            "",
            "",
            ""
        ],
        [
            "Alpha Tag",
            "SIMPLEX A",
            "LADA",
            "LADA"
        ],
        [
            "Description",
            "LADA Simplex-A",
            "LADA - Metro West / San Dimas / Pomona / SFV / SCV",
            "LADA - Antelope Vly / Pasadena / South LA / SGV"
        ],
        [
            "Mode",
            "FMN",
            "FMN",
            "FMN"
        ],
        [
            "Tag",
            "Law Tac",
            "Law Tac",
            "Law Tac"
        ]
    ],
    "pageTitle": "Los Angeles County, California (CA) Scanner Frequencies and Radio Frequency Reference",
    "title": "",
    "url": "http://www.radioreference.com/apps/db/?ctid=201&ts=0",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989891.18/warc/CC-MAIN-20150728002309-00069-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 670989947,
    "recordOffset": 670916192,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{351943=LAPD channels being renumbered on a ongoing basis through summer 2014.  Below reflects future configuration., 340519=LAPD channels being renumbered on a ongoing basis through summer 2014.  Below reflects future configuration.}",
    "textBeforeTable": "NOTE: Mobile traffic is not rebroadcasted over the output frequency of the dispatch channels. Instead, only a beeping tone is broadcast to signify to the field units that someone is talking. To monitor units in the field you must program in the input frequencies also. The corresponding L-TAC channel is included in brackets. The following explanation is an excerpt directly from the Southern California Frequency Directory: Los Angeles County Sheriff's Department operates a conventional radio system referred to as the \"480 System\" within the department, because of the frequencies it occupies. The system uses over sixty repeater sites around the county, most of which are on hilltops, to relay communications. The hilltops from which a particular repeater transmits from is dependant upon the area that channel was intended to cover. Communications on a particular channel will sound the best when monitoring from within or near the area that the personnel assigned to that channel patrol. With the exception of Special Units Dispatch (which has countywide coverage), Dispatch and Local Tactical channels each have the smallest area of intended coverage. As a result, a listener must be relatively closer to a particular dispatch area to hear communications on that channel clearly. Conversely, Area Tactical and Countywide Tactical channels each are intended to cover the territory of several or all of the dispatch channels combined. As a result, listeners can hear communications on any given Area Tactical and Countywide Tactical channels from further",
    "textAfterTable": "483.26250  WII792  RM CSQ CENTRY-D4 Disp 4 - Century [L-TAC 9]  FM  Law Dispatch  482.86250  WII801  RM CSQ SCV-D5 Disp 5 - Santa Clarita [L-TAC 8]  FM  Law Dispatch  482.93750  WII791  RM CSQ WAL-SDMD6 Disp 6 - Walnut / San Dimas / Diamond Bar [L-TAC 7]  FM  Law Dispatch  484.03750  WII792  RM CSQ LMT-AVAD7 Disp 7 - Lomita / Avalon [L-TAC 2]  FM  Law Dispatch  483.68750  WQAF451  RM CSQ INDSTRYD8 Disp 8 - Industry [L-TAC 4]  FM  Law Dispatch  484.16250  WII792  RM CSQ CARS-CPT9 Disp 9 - Carson /",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}