{
    "relation": [
        [
            "Categories",
            "Share any unusual traditions or locations on campus",
            "What to do for fun",
            "Food and Dining",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "Los Angeles City College is very diverse, a great place to socialise and meet new people from other cultures.",
            "There is a pool and arcade place in front of the school.",
            "There's a coffee place in the school. Outside of school there is a Japanese restaurant where you can sushi, a Mexican food restaurant, Jack in the Box, Cesar's Pizza Pizza, Subway, an Italian restaurant that has really good pizza and much more.",
            "Be proactive, do you work, ask questions, and talk to you professors about your future.",
            "Out of one to ten I would rate Los Angeles City College a ten from all the other community colleges in the district of Los Angeles. Besides the fact that some of staff members in the office are not resourceful, the professors are wonderful, and truly care about your future goals, at least in the music department."
        ]
    ],
    "pageTitle": "Los Angeles City College Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Los-Angeles-City-College/reviews?_escaped_fragment_=/show/30702",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989891.18/warc/CC-MAIN-20150728002309-00306-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 911285583,
    "recordOffset": 911239049,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{192932=© 2015, Cappex.com, LLC, 6633=this place seems like any other community college and i thought i'd be there just for class but i was wrong. there's so many things to do at this school and everyone is so welcoming. i'm about to transfer in fall 2013 and i'm dreading that day since i grew attached to this place., 44906=lacc offers food from a very delicious and affordable food truck and tully's cafe. they are working on a new student lounge for fall 2012, which will include different food options ranging from mexican to chinese food. there are also great fast food and sit down places walking distance from lacc., 25854=In late 2012, a Student Center building opened that housed a cafeteria with a growing selection of food options.}",
    "textBeforeTable": "10/14/2010 Reviewer is A current student here. 5 out of 5 people found this review useful. 1 of 46 Dulce from Los Angeles, CA Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code",
    "textAfterTable": "Login to rate or flag the reviews Daisy from Los Angeles, CA 02/25/2012 Reviewer is A current student here. 3 out of 3 people found this review useful. 2 of 46 Categories Comments Clubs and Activities there's many clubs at this school and if what you want to do isn't here it's really easy to start your own club. there's events held every week and most of them are free for the students. Great for these types of students it's a good place for every type of student. the best thing is that students who are undecided with there majors can figure out what they want to do at this school and it isn't pricey. What to do for fun it's right in the middle of los angeles and the bus could get you anywhere that you need to go. the red line could take you to north hollywood or to downtown. there's also many things to do that are walking distance.",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}