{
    "relation": [
        [
            "Class",
            "A-1 (Various), A-2",
            "A-3, A-4, A-30, A-60, A-61",
            "B Through B-105 (Various)",
            "C Through C-106 (Various)",
            "D Through D-2b, J/a",
            "E-1b Through E-65 (Various)",
            "F-1 Through F-105 (Various)",
            "G-1 Through G-104 (Various)",
            "H Through H-3 (Various), H-30",
            "H-5 Through H-10b (Various)",
            "HS-1a, S-1a/b, S-2a",
            "I Through I-100a (Various)",
            "J-1 Through J-3 (Various)",
            "J-40, J-41",
            "K Through K-80 (Various)",
            "L-1 Through L-4 (Various)",
            "M, M-1 (Various)",
            "NB-1",
            "NE-1, NE-2/a/d",
            "NU-1",
            "U-1b Through U-61 (Various)",
            "Z-1"
        ],
        [
            "Type",
            "Berkshire",
            "Switcher",
            "Switcher",
            "American",
            "Saddle Tank",
            "Mogul",
            "Ten-Wheeler",
            "Consolidation",
            "Twelve-Wheeler",
            "Mikado",
            "Niagara",
            "Atlantic",
            "Hudson",
            "Prairie",
            "Pacific",
            "Mohawk",
            "Switcher",
            "Articulated",
            "Articulated",
            "Articulated",
            "Switcher",
            "Santa Fe"
        ],
        [
            "Wheel Arrangement",
            "2-8-4",
            "0-4-0",
            "0-6-0/T",
            "4-4-0",
            "2-4-4T, 2-6-6T, 4-6-6T",
            "2-6-0",
            "4-6-0",
            "2-8-0",
            "4-8-0",
            "2-8-2",
            "4-8-4",
            "4-4-2",
            "4-6-4",
            "2-6-2",
            "4-6-2",
            "4-8-2",
            "0-10-0",
            "0-6-6-0",
            "2-6-6-2",
            "0-8-8-0",
            "0-8-0",
            "2-10-2"
        ]
    ],
    "pageTitle": "The New York Central System",
    "title": "",
    "url": "http://www.american-rails.com/new-york-central-system.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989891.18/warc/CC-MAIN-20150728002309-00068-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 293186723,
    "recordOffset": 293166898,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{17012=While the Central had a large and exquisite passenger train fleet (far too many to mention and name here) the flagship was without doubt the 20th Century Limited, which operated over the railroad’s entire system from New York to Chicago. Arguably the most regal passenger train ever created the Limited was adorned in grays, silvers, and whites and ushered in the Art Deco era of interior design when it was streamlined in 1938 (and one could only hope to find a seat on the Limited, let alone afford a ticket!).   The New York Central System is remembered for many things but perhaps the railroad’s crowning achievement was its Grand Central Terminal located in downtown New York City. Opened in 1913, three years after the Pennsy opened its Pennsylvania Station, GCT replaced the earlier Grand Central Station and held an impressive 48-tracks below ground., 14986=The NYC&HR was again renamed as the New York Central Railroad when it merged with the LS&MS in 1914. Throughout the early 20th century the NYC continued to expand reaching Boston; Pittsburgh, PA; Wheeling, WV; the coalfields of southern West Virginia via the Toledo & Ohio Central; Columbus, OH; Cincinnati, Cleveland, and St. Louis via the Big Four Route (the Cincinnati, Cleveland, Chicago & St. Louis Railroad), Columbus, OH; Detroit (and virtually the rest of Michigan via the Michigan Central); and even Montreal, Quebec and Ontario, Canada. Through the years the railroad gained control of notable railroads to reach these markets including the Pittsburgh & Lake Erie, Indiana Harbor Belt, and the aforementioned Big Four., 46881=Realizing the severity of the situation the federal government stepped and setup the Consolidated Rail Corporation, which comprised the skeletons of several bankrupt Northeastern carriers, and began operations on April 1, 1976.  With federal backing Conrail began to slowly pull out of the red ink (it took many years) and by the late 1980s was a profitable railroad after thousands of miles of excess trackage (and sometimes perhaps not so excess when compared to today’s boom of the industry) was abandoned and/or upgraded.   Today even Conrail is no longer with us having been split up amongst CSX Transportation and Norfolk Southern in 1999, with CSX taking much of the NYC while NS got a good chunk of the Pennsy. In any event many parts of the railroad continue to serve an important role in moving goods (and people) from eastern markets to the Midwest and vice versa (such as its main line Water Level Route)., 22591=The NYC looked long and hard to find another partner but could find no serious interest and it lost out on a bid for the B&O to the Chesapeake & Ohio Railway in the early 1960s (perhaps the best fit for the NYC, a southern road with new marketing opportunities).  In the end and despite a long search for another partner it was eventually decided that a merger with the PRR was the only option for the New York Central System. Surprisingly the ICC approved the merger that virtually allowed for a monopoly in the Northeast and the ill-fated Penn Central Corporation was born on February 1, 1968., 10127=In a perfect world both the New York Central System and Pennsy would have found other, more logical merger partners and likely would still be competing today, thus completely changing the landscape and history of the industry. However, we do not live in a perfect world, of course, and despite all of their success both wound up making horrendous decisions during their final years of independence and die a horrible death as the Penn Central Corporation in 1968 (aside from competing in virtually every market, from a management and operations standpoint they were polar opposites, which became painfully clear upon merger day when their management teams could not work together).  The NYC had its humble beginnings as the Mohawk & Hudson Railroad, chartered and built in 1831 to connect Albany with Schenectady, New York., 13465=In an attempt to build a route connecting Albany with the Great Lakes at Buffalo, a series of railroads where constructed that would be incorporated as the original New York Central Railroad in 1853. Around this same time its most famous president, Cornelius Vanderbilt, who oversaw significant growth of the railroad and laid its future foundations as a world-class carrier, would head the new NYC.  He immediately changed the railroad’s name to the New York Central & Hudson River Railroad when he merged the NYC with his own Hudson River Railroad. Later including the New York & Harlem as well, the NYC&HR now held a commanding presence in New York City and after gaining control of the Lake Shore & Michigan Southern it reached Chicago on a northern route that was virtually flat (late known as the Water Level Route), in comparison to Pennsylvania Railroad’s main line through the Alleghenies., 66728=© Copyright 2007-2015 American-Rails.com. All content copyright American-Rails.com (unless otherwise noted). All photos and videos, copyright individual owners/organizations., 25011=The PC was losing over $1 million a day and trains were becoming lost throughout the system, as dispatchers were not properly trained on how to dispatch their trains. To make matters worse as the red ink began to become an unstoppable flash flood maintenance was deferred and derailments became the norm with large sections of main line reduced to 10 mph slow orders.   After only two years of operations and financial assistance completely gone, the destitute Penn Central officially declared bankruptcy on June 21, 1970. The result of this was a ripple effect throughout the entire Northeast, as other railroads, which depended on the PC to ferry traffic, no longer had a means to move their freight. It became so bad that the Penn Central was facing total shutdown if financial assistance, any means of help at all, were not located.  For more information about the NYC please click here to visit the New York Central System Historical Society's website.}",
    "textBeforeTable": "The American Locomotive Company Diesel Locomotive Roster Two F7As and a GP7 lead a manifest freight along the Indiana Harbor Belt at La Grange, Illinois on August 2, 1965. The PC was losing over $1 million a day and trains were becoming lost throughout the system, as dispatchers were not properly trained on how to dispatch their trains. To make matters worse as the red ink began to become an unstoppable flash flood maintenance was deferred and derailments became the norm with large sections of main line reduced to 10 mph slow orders.   After only two years of operations and financial assistance completely gone, the destitute Penn Central officially declared bankruptcy on June 21, 1970. The result of this was a ripple effect throughout the entire Northeast, as other railroads, which depended on the PC to ferry traffic, no longer had a means to move their freight. It became so bad that the Penn Central was facing total shutdown if financial assistance, any means of help at all, were not located.  For more information about the NYC please click here to visit the New York Central System Historical Society's website. Two NYC Pacifics, #4695 and #4722, power a freight train past the depot at Elkhart, Indiana on December 11, 1948.",
    "textAfterTable": "Several early, first-generation Electro-Motive units sit at the NYC's engine terminal in Urbana, Illinois on November 15, 1964. Baldwin-Lima-Hamilton Model Type Road Number Date Built Quantity RP-210 20 1956 1 VO-660 501-502, 752-761 1942-1945 12 DR-6-4-1500 (A) 3200-3203 1947-1948 4 DR-6-4-1500 (B) 3300-3301 1947-1948 2 DR-4-4-1500 (A) 3400-3403 1948 4 DR-4-4-1500 (B) 3700-3701 1948 2 RF16B 3702-3709 1951-1952 8 RF16A 3804-3821 1951-1952 18 LRS-1200 5800-5815 1950 16 RS12 5820-5836 1951 17 DRS-4-4-1500 8300-8301 1948 2 LS-1000 8400-8405 (CR&I) 1949 6 LS-1200 8406-8411 (CR&I) 1951 6 VO-1000 8600-8607 1944-1945 8 S12 9308-9328 1951-1952 21 LS-800 9800-9820 (CR&I) 1951 21 A GP7, #5800, totes a single caboose at Joliet, Illinois on September 1, 1969. Electro-Motive Corporation/Electro-Motive Division Model Type Road Number Date Built Quantity SC 604-610 (CR&I) 1936 7 SW1 574-654, 610-621 (CR&I) 1939-1950 93",
    "hasKeyColumn": true,
    "keyColumnIndex": 1,
    "headerRowIndex": 0
}