{
    "relation": [
        [
            "Categories",
            "Greek Life",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "Since",
            "I workout at the school's gym and walk around the city.",
            "The food at the beginning was horrible but it has improved.",
            "The dorms are nice but i did not like staying on campus.",
            "The work load is all pretty reasonable and the teachers are amazing.",
            "Prepare for the cold weather and long winters. Campus life is not very exciting but it is a good place to studying.",
            "It's a wonderful, small, private school with a variety of programs. So far, my experience has been very rewarded and I'm looking forward to the next year."
        ]
    ],
    "pageTitle": "Westminster College - Utah Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Westminster-College-Utah/reviews?_escaped_fragment_=/show/26131",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989891.18/warc/CC-MAIN-20150728002309-00211-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 898808311,
    "recordOffset": 898744103,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{126816=Haven't been to class yet; but I am thrilled with the opportunities such as free classes in May that Westminster offers!, 168413=Being a private school, you can expect higher tuition. (albeit, this school's price can be quite staggering without a scholarship.) However, Westminster offers some financial perks: free local transportation, access to hundreds of databases that you would normally pay for, an exciting May Term, a writing lab, discounted ski passes, and other interesting things., 293077=© 2015, Cappex.com, LLC, 158969=Westminster College is a school with a great reputation in the Salt Lake area that is an excellent choice for students that are active and/or those who seek more than lecture style classes from the start. Additionally, the school has pledged to be carbon neutral by 2030, which I happen to find amazing and admirable. This is a school with a lot to offer, with a prime location, small class sizes and knowledgable /helpful professors, what more could you want?}",
    "textBeforeTable": "08/12/2009 Reviewer is A current student here. 12 out of 12 people found this review useful. 1 of 66 Karen from West Jordan, UT Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code",
    "textAfterTable": "Categories Comments Great for these types of students This school is perfect for students who prefer small class room settings, one on one interaction, and a great sense of community wellness. There are so many clubs that there is always a group for someone. Tips for prospective students If you are a student who needs more one on one attention from a teacher, and works well in smaller settings then Westminster is perfect for you. I suggest living on campus if you do decide to make Westminster your college of choice. It allowed me to meet new friends and have opportunities to just chill when I'm not studying. If you want a bigger school with frats and sororities then I suggest maybe the University of Utah but just know they will have very large class settings, and won't have the intimate feeling Westminster provides. Bang for the buck Westminster is very expensive, and they keep raising the tuition cost every year. It was a very difficult choice to come here and spend triple then what I would at my state colleges. Yet, I still think it's worth it, I have been presented with more opportunities then I ever would have the chance to do at the state level. Also Westminster has provided me with plenty of scholarships",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}