{
    "relation": [
        [
            "Year",
            "1992",
            "1993",
            "1994",
            "1995",
            "1996",
            "1997",
            "1998",
            "1999",
            "2000",
            "2001",
            "2002",
            "2003",
            "2004",
            "2005",
            "2006",
            "2007",
            "2008",
            "2009",
            "2010",
            "2011",
            "2012",
            "2013",
            "2014",
            "2015"
        ],
        [
            "Seed",
            "#2",
            "#2",
            "#7",
            "#7",
            "#8",
            "#7",
            "#7",
            "#8",
            "#7",
            "#8",
            "#8",
            "#9",
            "#7",
            "#10",
            "#5",
            "#9",
            "#9",
            "#4",
            "#3",
            "#3",
            "#3",
            "#6",
            "#9",
            "#9"
        ],
        [
            "Round",
            "Quarterfinals Semifinals",
            "Quarterfinals",
            "Quarterfinals",
            "Quarterfinals",
            "First Round",
            "Quarterfinals",
            "First Round",
            "First Round Quarterfinals",
            "First Round Quarterfinals",
            "First Round",
            "First Round Quarterfinals",
            "First Round Quarterfinals",
            "Quarterfinals",
            "First Round",
            "First Round",
            "First Round Quarterfinals",
            "First Round Quarterfinals",
            "Quarterfinals Semifinals Championship Game",
            "Quarterfinals",
            "Quarterfinals",
            "Quarterfinals Semifinals Championship Game",
            "First Round Quarterfinals",
            "Second Round Quarterfinals",
            "Second Round Quarterfinals"
        ],
        [
            "Opponent",
            "#7 NC State #3 North Carolina",
            "#7 Clemson",
            "#2 North Carolina",
            "#2 Maryland",
            "#9 NC State",
            "#2 Wake Forest",
            "#8 NC State",
            "#7 Clemson #2 Maryland",
            "#8 Georgia Tech #2 Maryland",
            "#9 Clemson",
            "#9 Clemson #1 Maryland",
            "#8 Clemson #1 Wake Forest",
            "#2 NC State",
            "#7 NC State",
            "#12 Wake Forest",
            "#8 Clemson #1 North Carolina",
            "#8 Wake Forest #2 North Carolina",
            "#12 Georgia Tech #1 North Carolina #3 Duke",
            "#11 NC State",
            "#6 Virginia Tech",
            "#6 Miami (FL) #2 Duke #1 North Carolina",
            "#11 Clemson #3 North Carolina",
            "#8 Maryland #1 Virginia",
            "#8 Clemson #1 Virginia"
        ],
        [
            "Result",
            "W 93–80 L 76–80",
            "L 75–87",
            "L 69–83",
            "L 64–71",
            "L 65–80",
            "L 65–66",
            "L 63–65",
            "W 87–85 L 69–93",
            "W 63–62 L 61–82",
            "L 64–66",
            "W 91–84 L 59–85",
            "W 72–61 L 61–69",
            "L 71–78",
            "L 54–70",
            "L 66–78",
            "W 67–66 L 58–73",
            "W 70–60 L 70–82",
            "W 64–62 W 73–70 L 69-79",
            "L 52–58",
            "L 52-51",
            "W 82–71 W 62–59 W 85-82",
            "W 73–69 L 62-83",
            "W 67–65 L 51-64",
            "W 76–73 L 44-58"
        ]
    ],
    "pageTitle": "Florida State Seminoles men's basketball - Wikipedia, the free encyclopedia",
    "title": "",
    "url": "https://en.wikipedia.org/wiki/Florida_State_Seminoles_men%27s_basketball",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989891.18/warc/CC-MAIN-20150728002309-00338-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 862478515,
    "recordOffset": 862437237,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{45280=Florida State has appeared in the NCAA Division I Tournament's National Championship game once, in 1972. The Seminoles, coached by Hugh Durham, lost to John Wooden and his UCLA Bruins, 81-76, at the Memorial Sports Arena in Los Angeles, California. The Seminoles defeated powerhouse Kentucky in the Mideast Region Final and North Carolina in the Semifinals., 120749=The NCAA began seeding the tournament with the 1979 edition., 16357=Dixie 1951, 105308=The Seminoles have appeared on ESPN's College Game Day three times since 2005. Florida State is 1-2 in games played when College GameDay has traveled to Seminole games. Florida State has hosted the program 1 time, in 2012, when the North Carolina Tar Heels played in Tallahassee. The Seminoles have a 1-0 record when Gameday is on campus., 36711=Steve Robinson took over the program for the 1997–1998 season and led the Seminoles to the NCAA tournament his first year. However, the team suffered losing records the next four seasons and Robinson left the program after the 2001–2002 campaign. Robinson is now an assistant coach with the North Carolina Tarheels., 35549=The 1992–1993 season would see the emergence of one of the Seminoles' best players in its history, Bob Sura . Not much was expected of the Seminoles in 1992 as they entered into their first season in the ACC, yet they finished second in the conference to national champion Duke. The team repeated the second-place finish in 1993, establishing itself as a legitimate national power. In the 1993 NCAA Tournament they fell to Kentucky in the Elite Eight round. In Kennedy's final season (1996–1997) he led the team to the NIT Final, losing to the Michigan Wolverines., 42779=*^22 wins vacated from Leonard Hamilton's record from the 2006-2007 basketball season, 131419=Florida State has won the ACC Tournament once, in 2012, under coach Leonard Hamilton. The Seminoles have a record of 15-23 at the ACC Tournament., 128025=The NCAA began seeding the tournament with the 2006 edition., 33522=After the departure of Hugh Durham, Joe Williams took over the Seminole basketball program. One of the standout players during this period was George McCloud. McCloud helped the Seminoles rebuild after the departure of Durham by becoming one of the most prolific scorers in FSU history. During his senior season, McCloud had the second-highest scoring average and the sixth-highest in Florida State history.[4] Joe Williams would coach his final season in 1986., 15916=Metro 1991, 29436=Florida State University has officially fielded a basketball team since 1947, and the Seminoles are currently in their 68th season of play., 38513=Leonard Hamilton became Florida State’s seventh head basketball coach on March 19, 2002. In two years, Tim Pickett scored 1,039 points, earning him First-Team All-ACC and All-American Honorable Mention honors.[5] In the 2008–2009 season, Hamilton led the Seminoles to a #5 seed in the NCAA tournament and runner-up in the ACC tournament. Hamilton was named ACC coach of the year in 2009 and 2012. Hamilton is also the first Seminole coach to win an ACC championship, capturing the league tournament title in 2012. During his tenure, Florida State has been the third-most successful team in the conference. Hamilton is the winningest coach in the program's history., 48877=Florida State has appeared in the National Invitation Tournament's National Championship game once, in 1997. The Seminoles, coached by Pat Kennedy, lost to Michigan, coached by Steve Fisher, 82-73, at Madison Square Garden in New York City., 31328=Hugh Durham played at Florida State in the 1950s, scoring 1,381 points in three years. His average of 21.9 points per game in 1958–59 is the seventh best tally in Florida State history.[3] Durham's career average of 18.9 points per game is still the ninth best in school history. After his playing career had ended, he began his coaching career as an assistant coach in 1959. Seven years later, Durham would be named head coach in 1966. One of the top players during this time was future NBA Hall-of-Famer Dave Cowens. Durham led the Seminoles from 1966 to 1978. In 1972, Durham led Florida State to a runner-up finish in the NCAA tournament. A hard-fought 81–76 loss to the top-ranked UCLA Bruins in the NCAA Championship game prevented Durham's Florida State team from winning the NCAA Tournament. Another key player for the Seminoles was Harry Davis, who helped the program sustain stability., 84359=*122 total wins vacated from the 2006-2007 basketball season due to the academic scandal *27 ACC wins vacated from the 2006-2007 basketball season due to the academic scandal, 15733=Florida Intercollegiate 1955, 102012=*^wins vacated from the 2006-2007 basketball season due to the academic scandal}",
    "lastModified": "Mon, 03 Aug 2015 02:10:22 GMT",
    "textBeforeTable": "Current coaching staff[edit] *^22 wins vacated from Leonard Hamilton's record from the 2006-2007 basketball season .575 1,099-812 67 seasons 7 coaches Totals .577 236-173^ 13 Leonard Hamilton 2003–present .427 64-86 5 Steve Robinson 1998-2002 .607 202-131 11 Pat Kennedy 1987-1997 .551 129-105 8 Joe Williams 1979-1986 .705 229-96 12 Hugh Durham 1967-1978 .529 234-208 18 J.K. Kennedy 1949–1966 .278 5-13 1 Don Loucks 1947-1948 Pct. Record Years Coach Tenure Florida State has had seven head coaches. Head coaches[edit] Leonard Hamilton became Florida State’s seventh head basketball coach on March 19, 2002. In two years, Tim Pickett scored 1,039 points, earning him First-Team All-ACC and All-American Honorable Mention honors.[5] In the 2008–2009 season, Hamilton led the Seminoles to a #5 seed in the NCAA tournament and runner-up in the ACC tournament.",
    "textAfterTable": "Louisville 72 81 1984-85 Metro Joe Williams Freedom Hall (Louisville, Kentucky) Memphis State 86 90 1988-89 Metro Pat Kennedy Carolina Coliseum (Columbia, South Carolina) Louisville 80 87 1990-91 Metro Pat Kennedy Roanoke Civic Center (Roanoke, Virginia) Louisville 76 69 2008-09 ACC Leonard Hamilton Georgia Dome (Atlanta, Georgia) Duke 69 79 2011-12 ACC Leonard Hamilton Philips Arena (Atlanta, Georgia) North Carolina 85 82 Championship Results: 3-7   772 799 Conference regular season championships[edit] Season Conference Coach Overall Conference 1950-51 Dixie J.K. Kennedy 18-9 7–0 1954-55 Florida Intercollegiate J.K. Kennedy 22–4 10–0 1977-78 Metro Hugh Durham 23–6 12–1 1988-89 Metro Pat Kennedy 22–8 9–3 Total Conference Titles 4",
    "hasKeyColumn": true,
    "keyColumnIndex": 3,
    "headerRowIndex": 0
}