{
    "relation": [
        [
            "Title Author",
            "L.S.E. Essays on Cost James M. Buchanan and George F. Thirlby, eds. CEE",
            "Public Principles of Public Debt The Collected Works of James M. Buchanan, Vol. 2 James M. Buchanan CEE",
            "The Calculus of Consent The Collected Works of James M. Buchanan, Vol. 3 James M. Buchanan and Gordon Tullock CEE",
            "Public Finance in Democratic Process The Collected Works of James M. Buchanan, Vol. 4 James M. Buchanan CEE",
            "The Demand and Supply of Public Goods The Collected Works of James M. Buchanan, Vol. 5 James M. Buchanan CEE",
            "Cost and Choice The Collected Works of James M. Buchanan, Vol. 6 James M. Buchanan CEE",
            "The Limits of Liberty The Collected Works of James M. Buchanan, Vol. 7 James M. Buchanan CEE",
            "Democracy in Deficit The Collected Works of James M. Buchanan, Vol. 8 James M. Buchanan and Richard E. Wagner CEE",
            "The Power to Tax The Collected Works of James M. Buchanan, Vol. 9 Geoffrey Brennan and James M. Buchanan CEE",
            "\"Readers' Forum, Comments on 'The Tradition of Spontaneous Order' by Norman Barry\" James M. Buchanan, David Gordon, Israel Kirzner, et al CEE",
            "The Reason of Rules The Collected Works of James M. Buchanan, Vol. 10 Geoffrey Brennan and James M. Buchanan CEE"
        ],
        [
            "First Pub. Date",
            "1934",
            "1962",
            "1958",
            "1967",
            "1968",
            "1969",
            "1975",
            "1977",
            "1980",
            "Winter 1982",
            "1985"
        ],
        [
            "Edition/ Comments",
            "Collected essays, various authors, 1934-1973. First published as a collection 1973 for the London School of Economics. Includes essays by Ronald H. Coase, Friedrich A. Hayek, Lionel Robbins, and more.",
            "Foreword by Geoffrey Brennan.",
            "Foreword by Robert D. Tollison.",
            "Foreword by Geoffrey Brennan.",
            "Foreword by Geoffrey Brennan.",
            "Foreword by Hartmut Kliemt.",
            "Foreword by Hartmut Kliemt.",
            "Foreword by Robert D. Tollison.",
            "",
            "Collected commentary, various authors. Literature of Liberty. Vol. v, no. 4, pp. 5-18.",
            "Foreword by Robert D. Tollison."
        ],
        [
            "More",
            "SEARCH",
            "SEARCH Liberty Fund, Inc.",
            "SEARCH Liberty Fund, Inc.",
            "SEARCH Liberty Fund, Inc.",
            "SEARCH Liberty Fund, Inc.",
            "SEARCH Liberty Fund, Inc.",
            "SEARCH Liberty Fund, Inc.",
            "SEARCH Liberty Fund, Inc.",
            "SEARCH Liberty Fund, Inc.",
            "SEARCH",
            "SEARCH Liberty Fund, Inc."
        ]
    ],
    "pageTitle": "Browse Book Archives by Author, B | Library of Economics and Liberty",
    "title": "",
    "url": "http://econlib.org/library/classicsauB.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042992543.60/warc/CC-MAIN-20150728002312-00151-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 82693415,
    "recordOffset": 82685213,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Babington, Thomas, Lord Macaulay Bu Bo Bi Be Ba On this page: Z Y X W V U T S R Q P O N M L K J I H G F",
    "textAfterTable": "See also, \"Readers' Forum, Comments on 'The Tradition of Spontaneous Order' by Norman Barry\", by James M. Buchanan, et. al. Bastable, Charles F. (1855-1945) Title Author First Pub. Date Edition/ Comments More Public Finance Charles F. Bastable BIO 1892 3rd edition SEARCH Bastiat, Frédéric (1801-1850) Title Author First Pub. Date Edition/ Comments More Economic Sophisms Frédéric Bastiat CEE 1845 Arthur Goddard, trans. Introduction by Henry Hazlitt SEARCH Selected Essays on Political Economy Frédéric Bastiat CEE 1848 Seymour Cain, trans. Includes Preface by George B. de Huszar, introduction by Friedrich A. Hayek SEARCH Economic Harmonies Frédéric Bastiat CEE 1850 George B. de Huszar, trans. and",
    "hasKeyColumn": true,
    "keyColumnIndex": 2,
    "headerRowIndex": 0
}