{
    "relation": [
        [
            "Categories",
            "Campus Safety",
            "Greek Life",
            "Clubs and Activities",
            "Great for these types of students",
            "Share any unusual traditions or locations on campus",
            "Bang for the buck",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "Excellent. There are always polite police officers around and they are highly respectful and vigilant.",
            "Non-existant",
            "Of which I know nothing of. Drama club only began recently so, I am far from the best judge.",
            "This school is great for hard workers looking to better themselves and their academic record in order to move onto bigger and better schools.",
            "There is a beautiful bamboo garden that not all the students know about. It's very peaceful.",
            "Considering I'm a performing arts student, this was the most cost effective way for me to totally immerse myself in my art, and not break the bank. Worth more than you pay.",
            "As part of a program with less than 30 students, we have made ways to have fun with each other, but in regards to the school's initiative to provide entertainment, there is none. Make some friends, then you'll have no choice but to have fun.",
            "Foothill is fairly isolated. You can usually either eat in the cafeteria or in an obscure little kiosk on the other side of the school. The food is fairly good, and there are a wide variety of options in the way of salads, soups and sandwiches. There is also a hot foods station that makes burgers and burritos. However, it's a little pricey and the food gets tiring after a few months. I have also had two friends complain from getting food poisoning from the cafe's clam chowder (months apart).",
            "Doesn't exist!",
            "The rigor of the theatre dept. vary from quarter to quarter. The higher work load classes often intersect schedule wise. But, as previously stated- the harder you work, the better you do. You will pass your classes with minimal effort, but if you put in the effort you shall flourish!",
            "Foothill is a great place to go if you're looking for a specific program. I am a current second year at the theatre conservatory and have learned that Foothill gives you what you put into it. Take that for what you will!",
            "Foothill is a high quality community college that feels like a full fledged university. It features specialized programs that are not generally offered for this price at this level particularly in vet tech, and theatre. It also is incredibly beautiful on campus."
        ]
    ],
    "pageTitle": "Foothill College Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Foothill-College/reviews?_escaped_fragment_=/show/86000",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989891.18/warc/CC-MAIN-20150728002309-00037-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 916651643,
    "recordOffset": 916602591,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{192022=© 2015, Cappex.com, LLC}",
    "textBeforeTable": "03/10/2011 Reviewer is A current student here. 3 out of 3 people found this review useful. 1 of 43 Megan from Santa Clara, CA Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 }",
    "textAfterTable": "Am learning a lot Foothill is a calm and peaceful school environment. You can sit outside under a tree on a sunny day and study without any distractions. The teachers are serious about their work and will make the course interesting and unique, they will teach whatever they feel is necessary for you to learn in their course. I have learn more then what is needed for each course I have taken from Foothill, some of the skills you can put in use for life and the future. Login to rate or flag the reviews Kassandra from San Jose, CA 08/07/2011 Reviewer is Accepted here and planning to attend soon. Reviewer has been to campus. 1 out of 1 people found this review useful. 3 of 43 Categories Comments Will enjoy being here I visited the campus and I was pleasantly surprised with a beautiful scenery. If I hand't seen the sign labeling the place as Foothill College, I swear I would've thought it",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}