{
    "relation": [
        [
            "Categories",
            "Great for these types of students",
            "Bang for the buck",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "Small town, small classes. Lots of one on one if needed.",
            "couple of different malls in the area, good restaurants around are good places to eat off campus. Fairmont's sports teams are good and are interesting to watch. Basketball's team is doing good this year.",
            "Morgantown. Your right outside of Morgantown which is where WVU is located. Falcon center offers lots of activities there on campus. exercise equipment, indoor tract, lots of basketball, pin pong etc..",
            "Food is great!",
            "some dorms are old and crappy. Apply early to get the better dorm.",
            "Professors are very nice and helpful",
            "Register early and apply for housing early to get the better dorm.",
            "Faculty is helpful and very nice. Small University. Falcon center is nice and has lots to offer."
        ]
    ],
    "pageTitle": "Fairmont State University Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Fairmont-State-University/reviews?_escaped_fragment_=/show/69484",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989891.18/warc/CC-MAIN-20150728002309-00211-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 898713079,
    "recordOffset": 898679349,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{9518=Most freshman have to take the same classes. English, a math, Info 1100 (computer competency), and maybe some classes pertaining to your major. Collge classes are more difficult & more time consuming than high school classes! Make sure you manage your time well, and once again, use your professors! If you're having trouble, ask for assistance., 128443=© 2015, Cappex.com, LLC, 119328=I gave it 4/5 stars because it all really depends on your major and which classes you choose to take. Some classes are harder than others but it comes down to you yourself and your learning ability/ English 1108 has been my only extremely hard class so far the rest have been pretty normal., 90244=It depends on where you stay. Pence Hall is the athletic dorm. It contains mostly guys. Prichard Hall is for those students that participate in the Honors Program. Its the brainy dorm. I cannot really say anything about Morrow Hall except that it is the oldest dorm. Bryant is pretty nice. It is a suite-style place; yu have singles and doubles. You can have your own room. However, it is about $1000 more expensive than the other halls.}",
    "textBeforeTable": "04/05/2010 Reviewer is Accepted here and planning to attend soon. Reviewer has been to campus. 8 out of 9 people found this review useful. 1 person found this inaccurate. 1 of 27 Ciera from Weirton, WV Check out reviews left by other students or leave your own review. You could win a free scholarship. Fairmont State University Reviews Fairmont State University › West Virginia › By State › Colleges › } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp;",
    "textAfterTable": "Campus Safety Aside from the campus police who drive around in their decked out dodge avengers, who are very helpful by the way, security drives around in golf cars throughout the parking garage periodically. Car trouble? I'm sure they'll help. And in the very rare, off chance that you are being followed, attacked, or whatever, there are many emergency....towers? I guess that's what you'd call them. They kind of look like phone booths. They're yellow and they have an emergency button. There's like five around campus. Greek Life I'm not in a fraternity or sorority, but they are there. I've seen them. Clubs and Activities FSU has lots of sport teams, clubs, sororities, fraternities, whatever, you name it. There's a lot of activities too. In the Falcon Center, you can take spinning classes, yoga classes, zumba classes. Plays are constantly being put on. For some reason, ultimate Frisbee is really popular at FSU. There's always a bake sale or some informational booth set up. The activities are endless. Great for these types of students FSU is great for ALL types of students. That's the wonderful thing about college. In high school, there were cliques and whatnot, but college is different. Everyone gets along with everyone. Well, at",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}