{
    "relation": [
        [
            "Categories",
            "Campus Safety",
            "Greek Life",
            "Clubs and Activities",
            "Great for these types of students",
            "Share any unusual traditions or locations on campus",
            "Bang for the buck",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "Super great. I've never not felt safe on campus. They do a great job and will even come pick you up if you feel uncomfortable at a party.",
            "Three fraternities and four sororities. All very nice people that don't cause problems.",
            "A ridiculous number of things to do on campus. If you're bored then that is by choice.",
            "Focused, outgoing, loves to learn.",
            "Finney fun run!!! Ask someone when you get here! Also, you have to participate in midnight ultimate Frisbee at least once (clothing discouraged).",
            "Very good education and by far the best you can get in Idaho, but be prepared to pay a lot. Not just for tuition, but for your books, housing, and food as well. They offer scholarships, but they don't often cover everything.",
            "Caldwell does't offer much but it's close proximity to other places helps a lot. Boise is only thirty minutes away so either have a car or make friends with someone that does. Once there the possibilities are endless whether your're into music, shopping, or outdoor activities, you'll find something there.",
            "Great food, but a very crowded cafeteria. Plan to get there before or after the rush or before or after the teams come in. Nothing worse than getting stuck behind the soccer or football players.",
            "I had several bad experiences in the dorms and chose to move off of campus after freshman year. However, they do have great RA's and the dorms themselves are very nice. If you hang out with the right people you'll have a great time in the dorms.",
            "Challenging, but not impossible as long as you think ahead and stay on top of it. You will receive a major and three minors and they push you and expect that you can do that in four years. With your adviser's help it will be easy.",
            "Get involved early! If you wait too late you will feel left out and not have nearly as much fun. Always do your assigned readings. They only assign things that will help you.",
            "Academically challenging and lively campus with professors who really care."
        ]
    ],
    "pageTitle": "The College of Idaho Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/The-College-of-Idaho/reviews?_escaped_fragment_=/show/10628",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042992543.60/warc/CC-MAIN-20150728002312-00085-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 904536027,
    "recordOffset": 904504564,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{68973=From a scale from one to ten, I'll give it an eight. The students that attend here make you feel welcomed and a part of the Coyote family. Not a lot of students, about less than 2000, but it is about quality and not quantity, 94024=We have two places to eat, McCain and the Caf (aka Simplot). Both have really good food and are at a reasonable price. McCain uses coyotecash which is where you pay per item while The Caf uses a meal to get in and then it is all you can eat. As long as you don't try to get into the caf at about 12:30 it is pretty quick to get in and out, but 12:30 is the lunch rush, just like 9:10 is the breakfast rush., 112222=© 2015, Cappex.com, LLC}",
    "textBeforeTable": "07/16/2009 Reviewer is A current student here. 6 out of 6 people found this review useful. 1 of 25 Toni from Nampa, ID Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for",
    "textAfterTable": "The classes are challenging and the professors always ask thought provoking questions. Login to rate or flag the reviews Tori from Pendleton, OR 07/11/2011 Reviewer is A current student here. 3 out of 3 people found this review useful. 3 of 25 Categories Comments Great for these types of students Students who are looking for a smaller, less-hectic college. Also, students who are interested in a well-rounded liberal arts kind of education. Tips for prospective students Learn to organize! This was the worst problem I had. Everything works out fine if you can keep on top of it. Also, if you need a quiet place to work on something, the library worked wonders for me. Bang for the buck All in all, College of Idaho definitely feels like it lives up to its price. The professors are very friendly and very good at what they do, there's lots of diversity in the things you can study, and it just",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}