{
    "relation": [
        [
            "Categories",
            "Great for these types of students",
            "Tips for prospective students",
            "Bang for the buck",
            "Am enjoying being here",
            "Am learning a lot"
        ],
        [
            "Comments",
            "Great for any kind of student. Anyone is bound to make friends and find some activity of interest. The residence halls try to get people to socialize and there is any kind of personality in this school.",
            "For sure apply to outside scholarships to pay for school. Get involved as soon as you can because it really makes the experience. There are a lot of resources for students and so I recommend the career planning office for internships.",
            "Being a private school it is more expensive but they do offer you some aid. I no doubt had to seek other scholarships and take out loans to cover the cost but as of right now it feels worth it to me.",
            "The moment I stepped on campus I felt like I belonged there. The school has to best view of Austin in town and the campus is small enough to make it feel like home. There are a lot of ways to get involved with clubs and internships.",
            "Every single class I have taken here I feel like I have learned at least one important thing. Even the basic classes I found to be interesting because I haven't had a bad professor yet."
        ]
    ],
    "pageTitle": "St. Edward's University Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/St-Edwards-University/reviews?_escaped_fragment_=/show/10172",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989891.18/warc/CC-MAIN-20150728002309-00338-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 897894579,
    "recordOffset": 897820192,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{82957=Wonderful teach/student dynamic. They encourage students to meet with them as much as possible and because professors are required to have office hours they can't say no if you ask to meet with them. They make time to help. This also means there are some difficult times ahead, I'm not going to sugar-coat the work you have to complete. As long as you pay attention and ask for help when you need it you'll do very well. And allow me to just add that in 2010, every single student who applied for Med School after attending St. Edward's got in. 100% of those that applied. They will make sure you know you're stuff before you leave their school with a BA., 98314=It's a beautiful campus with wonderful professors. However, it has terrible management if tuition keeps going up $1000 every year and they force us to pay for food we don't want (you have to pay the meal plan or you can't register). At least the professors work hard to get us the grants we need to improve and expand our programs., 331745=Visit the campus and talk to current students there to see if it really is the best option for you. They have a Scholar Weekend in February or March where you can stay in the dorms and really experience campus life. It's a great way to meet prospective students and see what life on campus is like., 384188=© 2015, Cappex.com, LLC, 312879=Some dorms (east, Moody) are really run down. buy the new ones, Dujarie, BM, and Johnson are nice. Get to know your RA's in case you get locked out of your room at 2:00 am!!!, 325768=There are three cafeterias: The Huddle (Tex-med and BBQ), Hunt Hall Cafe (cafeteria, coffee shop, convenience store), and South Congress Market (Cafeteria). There are also two Jo's coffee shops on campus, and another coffee shop may be added to the new library that will open in fall 2013. Students may tire of the menu after living on campus, but there are many off campus food options close by, which is why I give four stars., 64962=St. Edward's is a private institution so... It can get pricey. Tuition has increased for the Fall 2012 school year so you may have to pull out loans just to attend. It costs more to come here than say, attending UT Austin (a public university) but you may benefit by having smaller classes and greater use of campus resources., 95847=They don't know how to make business, so they force you to buy a meal plan regardless of whether you live on campus or not. And even though you have to pay out of your own pocket, if you have left over money they will not reimburse you, they'll just keep it (freshmen end up with about $1000 leftover). At first you think, oh so much to choose from!, and then you realize it's basically the same thing every day.}",
    "textBeforeTable": "01/08/2010 Reviewer is A current student here. 14 out of 14 people found this review useful. 1 of 84 Carter from Houston, TX Check out reviews left by other students or leave your own review. You could win a free scholarship. St. Edward's University Reviews St. Edward's University › Texas › By State › Colleges › } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.create', -->",
    "textAfterTable": "Login to rate or flag the reviews Nicole 04/08/2011 Reviewer is A current student here. 10 out of 10 people found this review useful. 2 of 84 Categories Comments Great for these types of students St. Edward's is great for religious studies, but also for any artsy people. St. Edward's keeps an Austin wierdness about it, so if you do not fit in at the moment, you can probably fit in here just by being different. St. Edward's is also very big on giving back, so if you love to volunteer or help others they offer many opportunities. St. Edward's is very welcoming to any student, and if you are curious if you would fit in just come and see it! They allow you to stay the night with a student, and love to give tours! Tips for prospective students Once you get here, get involved! Do not be intimidated; everyone truly wants you to get involved. When you have classes, do not be afraid to talk/ask your professor anything. Get out of your shell - meet others. Keep up",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}