{
    "relation": [
        [
            "What:",
            "When:",
            "Where:"
        ],
        [
            "",
            "",
            ""
        ],
        [
            "SCSI Trade Association Technology Showcase: Taming the Data Beast!",
            "Wednesday, May 9, 6:30 - 9:30 p.m. PT",
            "Santa Clara Hyatt, 5101 Great America Parkway, Santa Clara, CA 95054"
        ]
    ],
    "pageTitle": "Western Digital Corp. : HGST Demonstrates Industry's First 12Gb/S SAS SSD | 4-Traders",
    "title": "",
    "url": "http://www.4-traders.com/WESTERN-DIGITAL-CORP-14853/news/Western-Digital-Corp--HGST-Demonstrates-Industrys-First-12GbS-SAS-SSD-14305282/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989891.18/warc/CC-MAIN-20150728002309-00200-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 264217551,
    "recordOffset": 264196483,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{68684=HGST (formerly Hitachi Global Storage Technologies and now a Western Digital company, NYSE:WDC) today announced the storage industry's first technology demonstration of a 12 gigabit per second (12Gb/s) SAS solid state drive (SSD), representing the next performance step in the evolution of SAS, the preferred interface technology for enterprise servers and storage solutions. HGST is participating in the 12Gb/s SAS demonstration at the SCSI Trade Association Technology Showcase on May 9, 2012, at the Hyatt Hotel in Santa Clara, Calif., 71140=\"Since the inception of SAS, LSI has delivered an industry-leading portfolio of SAS-based products,\" said Bill Wuertz, senior vice president and general manager, RAID Storage Division, LSI Corporation. \"As the preferred enterprise interface of the future, 12Gb/s SAS will be essential to unleashing the full performance potential of SSD storage solutions to help datacenters and cloud environments contend with massive data growth and accelerate application performance. With our ongoing validation processes and compatibility testing with HGST, we are paving the way for a smooth industry transition and market adoption of 12Gb/s SAS solutions by 2013.\", 76935=HGST Erin Hartin, 303-284-7790 (Office) Erin.Hartin@HGST.com or Voce Communications Katie Watson, 408-439-2002 (Cell) kwatson@vocecomm.com, 68488=HGST is Participating in the SCSI Trade Association Technology Showcase on May 9, 2012, 73145=As the datacenter continues to explode with increasing storage complexities, cutting-edge SAS technology solutions are taking on the challenge of \"Taming the Data Beast.\" SAS solutions can be seen in action at this year's SCSI Trade Association (STA) (http://www.scsita.org) Technology Showcase. Reservations can be made now for this free event at: http://www.scsita.org/sas-showcase-2012.html., 70582=\"We have successfully achieved interoperability between our 12Gb/s SAS drive and 12Gb/s SAS HBAs and expanders from both LSI and PMC-Sierra,\" said Brendan Collins, vice president of product marketing, HGST. \"Meeting these interoperability milestones is critical when preparing the industry for the adoption of a new interface standard. We will continue to promote broad industry support for 12Gb/s SAS, including our sponsorship and participation in the SCSI Trade Association Technology Showcase on May 9.\", 75333=HGST (formerly known as Hitachi Global Storage Technologies or Hitachi GST), a Western Digital company, develops advanced hard disk drives, enterprise-class solid state drives, innovative external storage solutions and services used to store, preserve and manage the world's most valued data. Founded by the pioneers of hard drives, HGST provides high-value storage for a broad range of market segments, including Enterprise, Desktop, Mobile Computing, Consumer Electronics and Personal Storage. HGST was established in 2003 and maintains its U.S. headquarters in San Jose, California. For more information, please visit the company's website at http://www.hgst.com.}",
    "textBeforeTable": "As the datacenter continues to explode with increasing storage complexities, cutting-edge SAS technology solutions are taking on the challenge of \"Taming the Data Beast.\" SAS solutions can be seen in action at this year's SCSI Trade Association (STA) (http://www.scsita.org) Technology Showcase. Reservations can be made now for this free event at: http://www.scsita.org/sas-showcase-2012.html. SCSI Trade Association Technology Showcase Event \"Taming the Data Beast\" \"PMC's 12Gb/s SAS protocol controllers, RAID-on-Chip (RoC) controllers and expanders enable breakthrough performance and scalability for next-generation server and networked storage systems,\" said Derek Dicker, vice president of marketing for PMC's Enterprise Storage Division. \"We have been working closely with HGST on interoperability testing, and the high-performance benefits of our 12Gb/s SAS solutions, coupled with HGST's 12Gb/s SAS drives, will enable a new generation of cutting-edge, scalable tiered storage for corporate and cloud datacenters.\" \"Since the inception of SAS, LSI has delivered an industry-leading portfolio of SAS-based products,\" said Bill Wuertz, senior vice president and general manager, RAID Storage Division, LSI Corporation. \"As the preferred enterprise interface of the future, 12Gb/s SAS will be essential to unleashing the full performance potential of SSD storage solutions to help datacenters and cloud environments contend with massive data growth and accelerate application performance. With our ongoing validation processes and compatibility testing with HGST, we are paving the way for a smooth industry transition and",
    "textAfterTable": "About HGST HGST (formerly known as Hitachi Global Storage Technologies or Hitachi GST), a Western Digital company, develops advanced hard disk drives, enterprise-class solid state drives, innovative external storage solutions and services used to store, preserve and manage the world's most valued data. Founded by the pioneers of hard drives, HGST provides high-value storage for a broad range of market segments, including Enterprise, Desktop, Mobile Computing, Consumer Electronics and Personal Storage. HGST was established in 2003 and maintains its U.S. headquarters in San Jose, California. For more information, please visit the company's website at http://www.hgst.com. One GB is equal to one billion bytes, and one TB equals 1,000 GB (one trillion bytes). Actual capacity will vary depending on operating environment and formatting. Western Digital, WD, and the WD logo are registered trademarks of Western Digital Technologies, Inc. All other trademarks are properties of their respective owners. HGST Erin Hartin, 303-284-7790 (Office) Erin.Hartin@HGST.com or Voce Communications Katie Watson, 408-439-2002 (Cell) kwatson@vocecomm.com",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}