{
    "relation": [
        [
            "Patent application number",
            "20110092664",
            "20130237683"
        ],
        [
            "Description",
            "Monomers Issued from Renewable Resources and Process for Polymerising Them - This invention relates to the synthesis of polycarbonates prepared from carbonate monomers derived from the biomass in the presence of a system comprising an organometallic transfer agent and alcohol. It also relates to the polymers resulting from these cyclic compounds.",
            "Monomers Issued From Renewable Resources and Process for Polymerising Them - This invention relates to the synthesis of polycarbonates prepared from carbonate monomers derived from the biomass in the presence of a system comprising an organometallic transfer agent and alcohol. It also relates to the polymers resulting from these cyclic compounds."
        ],
        [
            "Published",
            "04-21-2011",
            "09-12-2013"
        ]
    ],
    "pageTitle": "Marion - Patent applications",
    "title": "",
    "url": "http://www.faqs.org/patents/inventor/marion-7/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042992543.60/warc/CC-MAIN-20150728002312-00066-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 437503983,
    "recordOffset": 437472591,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Marion Helou, Rennes FR //]]> BarDraw('3766060',['Patent applications by Marion Helou, Ixelles BE'],[[2,3,2,2]],['2011','2012','2013','2014'],0); // <script type=\"text/javascript\"> </div> <div id=\"legend3766060\" align=\"center\"></div> </div> <canvas id=\"bg3766060\" style=\"max-width: 500px; width: 100%;\"></canvas> <div> <p align=\"center\">Patent applications by Marion Helou, Ixelles BE</p> <div class=\"bar3766060\" style=\"max-width: 500px; width: 100%; float:left; \"> <div align=\"left\" style=\"padding-top:20px;\"> </table> </tbody> </tr> <td>10-30-2014</td> <td><a href=\"/patents/app/20140323683\">PROCESS FOR THE PREPARATION OF DEFINED FUNCTIONAL LACTIC ACID OLIGOMERS</a> - A process for manufacturing defined functional lactic acid oligomers can include contacting lactide with at least one compound that is a transfer agent. Oligomers can be prepared according to the process.</td> <td>20140323683</td> <tr> </tr> <td>05-29-2014</td> <td><a href=\"/patents/app/20140148558\">ONE-STEP, ONE-POT PROCESS FOR PREPARING MULTIBLOCK AND GRADIENT COPOLYMER</a> - The present invention relates to the field of tailored di-, tri- and multi-block as well as gradient polyesters/polycarbonates copolymers prepared by introducing monomers simultaneously in the reaction medium in the presence of an organometallic, metal salt or organic catalyst.</td> <td>20140148558</td> <tr> </tr> <td>10-17-2013</td> <td><a href=\"/patents/app/20130274422\">POLYCARBONATES AS NUCLEATING AGENTS FOR POLYLACTIDES</a> - The present invention discloses the use of polycarbonate to increase the crystallisation rate of polylactides while maintaining its the mechanical properties.</td> <td>20130274422</td> <tr> </tr> <td>06-06-2013</td> <td><a href=\"/patents/app/20130144027\">ISOCYANATE-FREE METHOD FOR PREPARING POLY(CARBONATE-URETHANE) OR POLY(ESTER-URETHANE)</a> - The present invention discloses a method for preparing polycarbonate-urethane) or poly(ester-urethane) without isocyanate</td> <td>20130144027</td> <tr> </tr> <td>07-05-2012</td> <td><a href=\"/patents/app/20120172574\">Ring Opening Polymerisation of Cyclic Carbonates With Organic Catalyst Systems</a> - The present invention discloses a method for polymerising cyclic carbonates by immortal ring-opening polymerisation in the presence of organocatalysts and alcohol, said alcohol",
    "textAfterTable": "Marion Hermersdorf, Helsinki FI Patent application number Description Published 20090042565 CONNECTION POINT TRIGGERED SCANNING FOR POSITIONING RADIOS - A system for automatically controlling the scanning frequency of a radio based positioning application in a wireless communication device (WCD) based on the connection point information of the WCD. The connection point information may be utilized to identify if the WCD is near a positioning-enabled environment. Scanning may be activated, or the scanning frequency may be increased, when the WCD is in an environment that is served by certain connection points (e.g., connection points located in a city). On the other hand, when the WCD is in an environment that is not served by certain connection points (e.g., a rural area), scanning may be stopped or the scanning frequency may be reduced to conserve power in the mobile device. 02-12-2009 20090262673 AUTOMATED MODE CHANGE FOR WIRELESS DEVICES DURING INACTIVITY - Embodiments enable using the inactive time when a mobile device is not moving to change its mode to a new state or condition of performing as if it were an access point. The embodiments can include determining if a wireless device is stationary, changing an operating mode of the wireless device from mobile mode to access point mode, and determining a current location for the wireless device with respect to a plurality of wireless access point devices. Thereafter, the embodiments can include providing stationary location services with the wireless device",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}