{
    "relation": [
        [
            "Start Date",
            "1967 Aug 31",
            "1950 Jul 23",
            "1946 Oct 29",
            "1946 Feb",
            "1945 Jun 12",
            "1941 Sep 21",
            "1915 ± 1 years",
            "1913 Jun 23",
            "1912 Aug 28",
            "1911 Nov 8",
            "1910 Nov 16",
            "1909 Sep",
            "1908 Jan",
            "1907 Jul 9 (in or before)",
            "1907 Jan 7",
            "1905 Aug 4",
            "1904 Jan 2",
            "1903 Mar 26",
            "1901 Jan 29",
            "1900 Mar 29",
            "1899 Dec",
            "1899 Aug 11",
            "1899 Jan 17",
            "1898 Feb 23",
            "1897 Jan 1",
            "1896 May",
            "1895 May 22",
            "1893 Dec 11",
            "1893 Jan",
            "1892 Mar",
            "1889 Jan",
            "1888 Feb",
            "1887 Aug (?)",
            "1887 Feb",
            "1886 Jan 25",
            "1884 Dec 10 (?)",
            "1879",
            "1878",
            "1877 Sep",
            "1877 Apr",
            "1872 Oct 23",
            "1867 Apr 15 ± 5 days",
            "[ 1866 ]",
            "1865 Apr 15 ± 5 days",
            "[ 1864 Jul 2 ]",
            "1860 Apr",
            "1857 Aug 13",
            "1856 Sep 10",
            "1851 Jan",
            "[ 1849 ]",
            "1848 Aug 4",
            "1848 Feb",
            "1845 Jan",
            "1844 Sep 25",
            "1842 Jan",
            "1838 Jul",
            "1836 Aug 3",
            "1832 Apr 18",
            "1830 Dec 15",
            "1829 Feb",
            "1818 Nov 8"
        ],
        [
            "Stop Date",
            "2015 Apr 20 (continuing)",
            "1964 Dec",
            "1947 Jun",
            "1946 May",
            "1945 Jun 18",
            "1942 Feb",
            "Unknown",
            "1913 Jun 26 (?)",
            "Unknown",
            "1911 Dec",
            "1911 Feb",
            "1910 Mar 22",
            "1908 Dec",
            "Unknown",
            "1907 Jan 10",
            "Unknown",
            "1904 Jan 16",
            "1903 Jun",
            "1901 Jan 30 (in or after)",
            "1900 Apr 11 (in or after)",
            "Unknown",
            "Unknown",
            "1899 Mar 31 (?)",
            "Unknown",
            "1897 Jan 3",
            "1896 Jun",
            "1895 Oct 1",
            "1894 Feb",
            "1893 May",
            "1892 Apr",
            "1891 May 31 (in or after)",
            "1888 Oct",
            "1887 Oct 11",
            "1887 Mar",
            "1886 Aug 26 ± 5 days",
            "1885 Sep",
            "Unknown",
            "Unknown",
            "Unknown",
            "Unknown",
            "1872 Oct 23",
            "1867 May",
            "[ Unknown ]",
            "Unknown",
            "[ Unknown ]",
            "1860 Jun",
            "1857 Sep",
            "Unknown",
            "Unknown",
            "[ Unknown ]",
            "Unknown",
            "Unknown",
            "1845 Jul",
            "1844 Sep 27",
            "1842 Mar",
            "1838 Oct 18",
            "1836 Aug 5",
            "Unknown",
            "1830 Dec 16",
            "Unknown",
            "Unknown"
        ],
        [
            "Eruption Certainty",
            "Confirmed",
            "Confirmed",
            "Confirmed",
            "Confirmed",
            "Confirmed",
            "Confirmed",
            "Confirmed",
            "Confirmed",
            "Confirmed",
            "Confirmed",
            "Confirmed",
            "Confirmed",
            "Confirmed",
            "Confirmed",
            "Confirmed",
            "Confirmed",
            "Confirmed",
            "Confirmed",
            "Confirmed",
            "Confirmed",
            "Confirmed",
            "Confirmed",
            "Confirmed",
            "Confirmed",
            "Confirmed",
            "Confirmed",
            "Confirmed",
            "Confirmed",
            "Confirmed",
            "Confirmed",
            "Confirmed",
            "Confirmed",
            "Confirmed",
            "Confirmed",
            "Confirmed",
            "Confirmed",
            "Confirmed",
            "Confirmed",
            "Confirmed",
            "Confirmed",
            "Confirmed",
            "Confirmed",
            "Uncertain",
            "Confirmed",
            "Discredited",
            "Confirmed",
            "Confirmed",
            "Confirmed",
            "Confirmed",
            "Uncertain",
            "Confirmed",
            "Confirmed",
            "Confirmed",
            "Confirmed",
            "Confirmed",
            "Confirmed",
            "Confirmed",
            "Confirmed",
            "Confirmed",
            "Confirmed",
            "Confirmed"
        ],
        [
            "VEI",
            "3",
            "2",
            "2",
            "2",
            "2",
            "2",
            "2",
            "2",
            "2",
            "3",
            "2",
            "2",
            "2",
            "2",
            "2",
            "2",
            "2",
            "2",
            "2",
            "2",
            "2",
            "2",
            "2",
            "2",
            "2",
            "2",
            "2",
            "2",
            "2",
            "2",
            "2",
            "2",
            "2",
            "2",
            "2",
            "2",
            "2",
            "2",
            "2",
            "2",
            "2",
            "2",
            "2",
            "2",
            "",
            "2",
            "2",
            "2",
            "2",
            "",
            "2",
            "2",
            "2",
            "2",
            "2",
            "2",
            "2",
            "2",
            "2",
            "2",
            "2"
        ],
        [
            "Evidence",
            "Historical Observations",
            "Historical Observations",
            "Historical Observations",
            "Historical Observations",
            "Historical Observations",
            "Historical Observations",
            "Historical Observations",
            "Historical Observations",
            "Historical Observations",
            "Historical Observations",
            "Historical Observations",
            "Historical Observations",
            "Historical Observations",
            "Historical Observations",
            "Historical Observations",
            "Historical Observations",
            "Historical Observations",
            "Historical Observations",
            "Historical Observations",
            "Historical Observations",
            "Historical Observations",
            "Historical Observations",
            "Historical Observations",
            "Historical Observations",
            "Historical Observations",
            "Historical Observations",
            "Historical Observations",
            "Historical Observations",
            "Historical Observations",
            "Historical Observations",
            "Historical Observations",
            "Historical Observations",
            "Historical Observations",
            "Historical Observations",
            "Historical Observations",
            "Historical Observations",
            "Historical Observations",
            "Historical Observations",
            "Historical Observations",
            "Historical Observations",
            "Historical Observations",
            "Historical Observations",
            "",
            "Historical Observations",
            "",
            "Historical Observations",
            "Historical Observations",
            "Historical Observations",
            "Historical Observations",
            "",
            "Historical Observations",
            "Historical Observations",
            "Historical Observations",
            "Historical Observations",
            "Historical Observations",
            "Historical Observations",
            "Historical Observations",
            "Historical Observations",
            "Historical Observations",
            "Historical Observations",
            "Historical Observations"
        ],
        [
            "Activity Area or Unit",
            "Jonggring Seloko",
            "Jonggring Seloko",
            "Jonggring Seloko",
            "Jonggring Seloko",
            "Jonggring Seloko",
            "ESE flank (1400-1775 m)",
            "",
            "Jonggring Seloko",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            ""
        ]
    ],
    "pageTitle": "Global Volcanism Program | Semeru",
    "title": "",
    "url": "http://volcano.si.edu/volcano.cfm?vn=263300&vtab=Weekly",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042992543.60/warc/CC-MAIN-20150728002312-00195-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 248846287,
    "recordOffset": 248778739,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{54988=Elevated explosive activity continues; evacuation on 30 December 2002, 172415=12/2003 (BGVN 28:12) November volcanism includes 70-90 explosions per day, 57810=Higher-than-normal seismic and explosive activity during June-September 2002, 178384=07/1990 (BGVN 15:07) End to Vulcanian activity and dome growth; new collapse pit in crater, 100757=Two climbers die near crater. According to press reports, two German mountain climbers died near the crater on 2 September after being struck by large ejected ballistics. The two men were part of a group of 17 from a Munich-based climbing club. The victims, together with the group leader, had separated from the group to check the crater when the accident occurred. Warning signs not to approach the crater were posted along the path., 116715=On 21 July 1995, three pyroclastic avalanches descended along the Kembar river travelling a distance of 2 km. After 22 July, seismic, avalanche, and pyroclastic flow activity decreased somewhat. Still, on 27 and 28 July, pyroclastic avalanches descended the Kembar and Kobokan rivers, reaching lengths of 1 and 2 km, respectively., 98066=Mass wasting in March; ash eruptions continue; 9-km-high ash cloud in May, 124295=Eruptive activity on 3 February 1994 produced ashfalls, lava avalanches, and pyroclastic flows, destroying a village and killing 6 people (19:01). Total volume of the pyroclastic-flow deposits was about 6 million m3., 280670=According to the Darwin Volcanic Ash Advisory Centre (VAAC), during 18-19 November 2010, ash plumes rose to an altitude of 4.6 km and drifted 75-110 km N and NW. Sulfur dioxide gas was detected 75 km SW., 41302=According to the Volcanological Survey of Indonesia (VSI), activity during 24 March-29 June 2003 was continually at a high level. Explosions produced white-gray ash plumes several times per week that rose 300-600 m over the summit. Pyroclastic flows on 27 March had a run-out distance of 3,750 m toward Besuk Bang. More pyroclastic-flow events on 14 and 18 April traveled toward Besuk Bang (3,500 m) and Besuk Kembar (2,500 m). On 11 May a pyroclastic flow entered Besuk Kembar and extended 1,500 m. Seismographs continually recorded earthquake activity (table 12). The hazard status remained at Level 2 (on a scale of 1-4) throughout the report period., 120528=Tremor and volcanic earthquakes (both A- and B-type) were variable, with 20-110 events/day and 1-12 events/day, respectively (figure 5, top). Maximum tremor amplitude was 3-18 mm during the first week of January before increasing and peaking at 30 mm on the 8th. The daily number of explosions, recorded by a seismograph, showed an overall decline from 40-190 events/day in December to <100 events/day in mid-Mar (figure 5, bottom)., 225734=An ash plume from Semeru was reported on 4 June at ~4.5 km a.s.l., 251092=CVGHM reported that during 15, 17-19, and 21 May, ash plumes rose from Semeru's summit, rockfalls descended the flanks, and multiple pyroclastic flows traveled 500-3000 m from the active crater. On 21 May, incandescent material was propelled from the summit. Based on visual observations and increased seismicity, CVGHM raised the Alert Level from 2 to 3 (on a scale of 1-4). The community was advised not to go within 4 km from the summit on the SE flank., 140325=Activity continued in March 1989, with lava flows, avalanches of lava debris, and [pyroclastic flows] that sometimes generated lightning. The number of lava avalanches increased from the previous month, with debris extending 700-1,000 m from the summit. Some associated [pyroclastic flows] reached 1,000-2,000 m from the summit. Thunderous incandescent lava explosions sometimes produced plumes that rose 400-700 m above the summit. During March, seismic stations near Semeru recorded 3,263 explosion earthquakes, 83 avalanche events, 33 strong and five local tectonic shocks, five [pyroclastic flow] signals, and two A-type volcanic events., 194213=Seismic data revealed that during 9-15 July activity was higher than in the previous week. During this period 687 explosion events were recorded, as well as 57 avalanches, and 11 tectonic earthquakes. The volcano remained at Alert Level 2 (on a scale of 1-4)., 164622=During 1979, the rate of dome growth slowed, and ash explosions became weaker and less frequent, occurring at intervals of 45 minutes to 1 hour in contrast to 30-35 minutes in 1977-8. Although almost all of the 1977-8 explosions were recorded by a seismograph 7 km S of the summit, few of the most recent explosions can be detected by this instrument., 73186=Information Contacts: Volcanological Survey of Indonesia (VSI), Jalan Diponegoro No. 57, Bandung 40122, Indonesia (Email: isya@vsi.esdm.go.id, URL: http://www.vsi.esdm.go.id/); Darwin Volcanic Ash Advisory Centre (VAAC), Bureau of Meteorology, Northern Territory Regional Office, PO Box 40050, Casuarina, NT 0811, Australia (URL: http://www.bom.gov.au/info/vaac/); John Seach, P.O. Box 16, Chatsworth Island, NSW 2469, Australia; Ed Venzke, Global Volcanism Program, Smithsonian Institution, Washington DC 20560-0119, USA., 184156=05/1972 (CSLP 27-72) Review of recent activity since 1967, 147388=. . . Vulcanian activity during May and June., 186103=The VSI reported that during 5-11 December fume from Jonggring Seloko crater located in the S sector of Semeru's summit rose up to 600 m above the crater. The seismic record was dominated by explosion earthquakes and the record showed that two pyroclastic flows occurred. The volcano remained at Alert Level 2 (ranging from 1 to 4)., 229157=On 24 August a thin plume emitted from Semeru was visible on satellite imagery extending to the WSW., 165710=Semeru continued its activity essentially unchanged during February, with lava avalanches, occasional nuées ardentes, and emission of ash and gases., 246148=Based on a pilot report and information from CVGHM, the Darwin VAAC reported diffuse ash plumes from Semeru at an altitude of 4.6 (15,000 ft) a.s.l. on 25 May. The plumes drifted W. Ash was not detected on satellite imagery., 221950=During 1-28 September, volcanic activity at Semeru continued at relatively high levels. Several ash explosions produced plumes to 400-500 m above the volcano. Seismicity was dominated by as many as 735 explosion earthquakes per week. Semeru remained at Alert Level 2 (on a scale of 1-4)., 278766=On 2 February 2012 a large explosion was reported and incandescent material fell up to 2.5 km from the crater. Tables 20 and 21 indicate the types and numbers of earthquakes and other seismic events reported by CVGHM for February to April 2012. Based on the increased seismic activity and visual observations, CVGHM raised the Alert Level from 2 to 3 on 2 February 2012., 236165=According to the Darwin VAAC, on 29 June a small plume from Semeru that was visible on satellite imagery drifted SE at an unknown altitude., 72088=From August 2000 through August 2001, activity at Semeru was characterized by continuous seismic activity and ash-and-steam plumes of varying heights above the summit. The Alert Level at Semeru remained at level 2 (on a scale of 1-4) throughout the report period., 176046=06/1996 (BGVN 21:06) Eruptions form ash plumes, 173873=06/2002 (BGVN 27:06) Seismicity increases beginning in March 2002; Alert Level increased to 2, 220543=During 11-17 August, volcanic activity at Semeru continued at relatively high levels. Explosions produced ash columns that rose to 400 m above the summit. Seismicity was dominated by 550 explosion earthquakes. Semeru remained at Alert Level 2 (on a scale of 1-4)., 265881=CVGHM reported that during 1-29 February multiple pyroclastic flows from Semeru traveled 500 and 2,500 m into the Besuk Kembar and Besuk Kobokan rivers (on the S flank), respectively. During 1 February-30 April dense gray-to-white plumes rose 100-500 m above Jongring Seloko crater and drifted W and N. Incandescence was visible up to 50 m above the crater during 1 February-31 March. Seismicity decreased from March to April. Observations indicated that the lava dome grew in April. On 2 May CVGHM lowered the Alert Level to 2 (on a scale of 1-4) and reminded the public not to approach the crater within a 4-km radius., 33556=Volcanic activity at Semeru continued at a high level over the period 27 October-30 November, with a white-grey ash plume 300-600 m above the crater. A summary of seismicity (table 15) shows a ~ 20 percent reduction in the number of explosions compared to the previous four weekly intervals (BGVN 28:10). Semeru's hazard status remained at alert level 2 (on a scale of 1-4)., 183079=03/1981 (SEAN 06:03) Nuées ardentes and lava avalanches; one killed, 272 evacuated, 182531=12/1985 (SEAN 10:12) Frequent explosions and lava extrusion throughout 1985, 218604=Based on information from an aircraft report, the Darwin VAAC reported that an ash plume emitted from Semeru rose to ~4.5 km a.s.l. on 31 July at 1120. No ash was visible on satellite imagery., 118939=Increasing seismicity, avalanches, and pyroclastic flows with runout distances over 3 km began in early June 1995 (figure 6). The local government (Lumajang Regency) issued a warning on 21 June, but on 17 July they raised the hazard status and issued a volcano alert., 135485=August 1990 aerial photographs showed that the active crater (Jonggring Seloko) was a pit ~150 m deep and 850 m in diameter., 142059=. . . Vulcanian activity during April., 175089=10/1997 (BGVN 22:10) Ash plumes during October and November, 157366=\"Semeru has been active throughout 1985. The principal activity consisted of frequent small Vulcanian explosions and slow lava extrusion from the summit vent, small rockfalls from the steep-sided walls of the summit lava plug, and occasional nuées ardentes d'avalanche from the lava flow, where it rests on the steep SE flank of the summit cone. These small pyroclastic flows generally remain within 5 km of the summit vent. Typical maximum cloud height for the small Vulcanian explosions is 1,000 m or less. The frequency of explosions decreased steadily from 3,832 in May (125/day) to 1,797 in December (60/day). The monthly average number of rockfalls was about 320. The maximum number of nuées ardentes d'avalanche was 18 in July, declining from 15 in August to five in December (table 1). The composition of a breadcrust bomb sample collected on 17 August is shown in table 2.\", 280211=In an account posted online by Volcano Discovery on 15 September 2011, the group visited the volcano and noted that an active lava dome was growing inside the crater and that 3-4 eruptions occurred daily. They inferred that the size and frequency of the eruptions had apparently increased in the past days (figure 19)., 15356=On 15, 17-19, and 21 May 2008 ash plumes, rockfall avalanches, and multiple pyroclastic flows were observed, as well as increased seismic activity. At that time, the alert level was raised from 2 to 3. By 22 May pyroclastic flows and rockfall avalanches had declined in frequency, and consequently on 5 June the hazard was lowered to Level 2. During 7-9 July 2008, ash plumes rose to altitudes of 4.9-7.6 km, the tallest of the reporting interval., 63153=Seismicity increases beginning in March 2002; Alert Level increased to 2, 102338=During a 6-hour stay in the summit area on 26 July, 19 explosions were seen. They were separated by intervals of 2-38 minutes with a mean of 15 minutes (or 17 minutes if the last two intervals of 2 and 4 minutes are discarded), suggesting that activity remained stable since 22 July. Most explosions sent only ash plumes above the highest point of the crater rampart. The plumes immediately drifted SE with a strong wind. About 1/3 of the explosions threw blocks well above the N crater rim and some fell on the pyroclastic cone. A brief visit to the rim of the active crater showed that a pyroclastic rampart was being built between the S-SW breach and the active vents. In contrast to the pre-1994 through 1995 eruptions, the bottom of the crater could not be seen from the NE crater rim. No evidence for dome or lava flow emplacement within the present funnel-shaped crater could be seen from the NE crater rim., 141509=Normal Vulcanian activity continued during May and June., 176247=01/1996 (BGVN 21:01) Explosions, pyroclastic flows, and lava avalanches continue, 148697=Normal activity continued . . . with several small Vulcanian explosions/hour during March. Maximum eruption cloud height was ~1 km above the summit., 154893=Further Reference. Suryo, I., 1986, Semeru: Bulletin of the Volcanological Survey of Indonesia, no. 111, 52 p., 33119=Table 15. Seismicity recorded at Semeru, 27 October-30 November. Courtesy of VSI., 137677=By the beginning of July, however, local inhabitants reported that this activity had stopped. A visit to the crater on 28 July revealed a large collapse within the crater formerly occupied by the lava dome (figure 1). The new pit was roughly 200 m deep. Material observed sloughing down the walls caused little dust clouds. No sign of activity was visible within the new pit; one group of fumaroles and light sulfur deposition was found on the SW inner wall of the crater, 30 m below the rim., 177222=07/1994 (BGVN 19:07) Small ash eruptions to 500 m above the summit, 183587=01/1980 (SEAN 05:01) Dome growth and ash explosions decline, 29110=During the week of 26 April-2 May, explosion and avalanche signals increased, with continuing tremor, and volcanic earthquakes. Tremor and explosion signals increased, but avalanche signals decreased, during the week of 3-9 May. White-gray ash plumes were observed reaching heights of 300-400 m above the summit during both weeks. The Darwin VAAC reported that a thin ash plume from Semeru was visible on satellite imagery on 23 May around 0625; it reached a height of ~ 4.3 km altitude and extended ~ 110 km SSE., 180735=06/1987 (SEAN 12:06) Normal Vulcanian activity, 283060=According to reporting by the Center of Volcanology and Geological Hazard Mitigation (CVGHM) and the USGS Volcano Disaster Assistance Program (VDAP), six large explosions between 1981 and 2002 resulted in many fatalities. They noted that since 1995, pyroclastic flows have been restricted to S drainages such as Kali Kembar; however, a small proportion of recent flows have entered the headwaters of Kali Koboan on the SE, which leads to heavily populated areas, including Sumberrejo and Candipuro (figure 18). This report discusses activity between February 2010 (the end of the previous report) and 2 May 2012., 33655=November volcanism includes 70-90 explosions per day, 94625=J. Bardintzeff reported that on 15-16 August activity seemed to alternate from rest to explosiveness over periods of several hours. Explosions followed each other at intervals of 15 minutes, but later this interval increased to 1 hour. The first explosion of the period was the strongest and generated a plume 1,000 m high. Explosions were observed at 0732, 0812, 0840, 0905, and 0950 on 16 August., 274812=Information Contacts: Center of Volcanology and Geological Hazard Mitigation (CVGHM), Jalan Diponegoro 57, Bandung 40122, Indonesia (URL: http://www.vsi.esdm.go.id/); Volcano Disaster Assistance Program (VDAP), US Geological Survey (USGS), 1300 SE Cardinal Court, Bldg. 10, Suite 100, Vancouver, WA 98683; Darwin Volcanic Ash Advisory Centre (VAAC), Bureau of Meteorology, Northern Territory Regional Office, PO Box 40050, Casuarina, NT 0811, Australia (URL: http://www.bom.gov.au/info/vaac); Jakarta Globe (URL: http://www.thejakartaglobe.com); Peopleâ\u0080\u0099s Daily Online (URL: english.peopledaily.com; Volcano Discovery (URL: http://mobile.volcanodiscovery.com)., 198159=Volcanic activity remained higher than normal at Semeru during 15-21 April. A small plume rose ~400 m above the summit and a \"red reflection\" was occasionally visible 25 m above the crater rim. Lava avalanches traveled 750 m to the E down Besuk Kembar River. The volcano remained at Alert Level 2., 260127=Based on information from CVGHM, the Darwin VAAC reported that on 12 March an eruption from Semeru produced a plume to an altitude of 4.6 km (15,000 ft) a.s.l. Ash was not identified on satellite imagery., 112822=Volcanic activity continued until the end of 1995 at a level of intensity comparable to August-October (BGVN 20:09). During November and December, small to moderate explosions and avalanches occurred from the Jonggring Seloko summit crater. The average plume height was 300-500 m. Pyroclastic avalanches descended along the Kembar river to a distance of 500-1,000 m from the summit. The number of lava avalanches increased during November, traveling down the Kembar river up to 300 m from the summit. On 27 December an incandescent lava flow traveled 500 m; during this event volcanic tremor was recorded with a maximum amplitude of 3 mm., 163706=Ash eruptions were continuing in late September. However, no additional dome growth has been observed, and nuées ardentes have not been reported since January., 38431=Frequent ash explosions continue through September, 134795=Explosions continued during April, with column heights averaging 300-400 m, and explosion earthquakes recorded an average of 112 times/day . . . . Seismographs also recorded 2-3 daily avalanches of material off the lava flow erupted 17 February. A total of one deep volcanic earthquake and 18 tectonic events were recorded., 107315=Semeru is the highest and one of the most active volcanoes of Java. It lies at the S end of a volcanic massif extending N to the Tengger Caldera and has been in almost continuous eruption since 1967., 182151=05/1986 (SEAN 11:05) Explosions continue, nuée adente observed, 216596=Plumes emitted from Semeru were visible on satellite imagery at a height of ~6 km a.s.l. on 29 May at 0838 drifting NW, and on 2 June at 0625 drifting SSE., 223237=Satellite imagery on 2 December at 1728 showed an ash plume from Semeru at ~4 km a.s.l. that extended ~55 km WSW., 275743=According to CVGHM and VDAP, a new lava dome started to extrude in late 2011 directly over a dome formed in 2010. The new dome probably will not completely fill the summit crater because it is being drained by two new lava flows, both flowing SE. The longer of the two lava flows extended about 1.9 km from the summit vent. Pyroclastic flows are being generated by collapse of the steep termini of the lava flows, and their deposits extend to 3.2 km from the summit, i.e. 0.7 km from the front shown in figure 18. In addition, the collapsing lava flow fronts are resulting in high levels of avalanche and rockfall activity. According to CVGHM and VDAP, the closest villages in the highest-risk areas on the S and SE flanks are about 10 km from the summit., 99151=Ash plumes during October and November, 139136=The small Vulcanian explosions and avalanches . . . continued in late July. During the second week of the month, thick ashfalls occurred at Sawur (13 km SW of the summit), Tawangsongo, and Argosuko observatories. Ash and incandescent tephra rose 50-100 m above the crater through late July. Avalanches of lava debris reached 750 m from the crater, while associated [pyroclastic flows] traveled 1,000-4,000 m. No changes on the lava dome were observed. The type and number of earthquakes recorded 1-20 July were: explosion (793), collapse (1), volcanic A-type (9), volcanic B-type (8), and [pyroclastic flows] (11). Although activity has increased, it is still considered within the normal range., 108356=A pilot report from Qantas Airlines on 1 August noted an ash cloud at an altitude of 4,000 m. Animated visible and infrared GMS satellite data through 0832 on 2 August did not reveal any discernible ash plume., 56888=Table 9. Earthquakes and tremor registered at Semeru during 17 June-8 September 2002. Courtesy VSI., 77519=Between 0725 and 1010, 13 eruptive events were observed. During this interval the N rim of Jonggring could not be approached because of the intermittent rain of blocks falling outside the crater and into the valley 50 m from the crater. Two vents produced short-lived Vulcanian eruptions with variable timing and size. Eruptions commenced with degassing, explosions, or the sound of breaking rock, followed by falling bombs and brown ash emission. The explosions were relatively quiet and not accompanied by groundshaking. Brown ash clouds rose to 600 m above the vent and drifted SE. The plume detached from the summit before the next eruption began. Steam emission occurred between eruptions., 73657=Continuing activity through August. Visual observations were hindered by bad weather the first week of August. Activity generally decreased through 22 August. White to light-brown ash clouds rising to about 600 m in height were frequently seen during this period. Seismicity increased again in late August, and on 25 and 27 August three pyroclastic flows were recorded. Thin white-gray ash plumes rose ~600 m., 176643=07/1995 (BGVN 20:07) Hazard status raised; mid-July explosion earthquakes, pyroclastic flows, 246760=The Darwin VAAC reported that a pilot observed an ash plume over the summit of Semeru on 12 June. Ash was not detected on satellite imagery., 160172=Thirty centimeters of rain in two hours on 14 May dislodged pyroclastic deposits from the upper flanks. Approximately 5-6 x 106 m3 of breccia, volcanic sands, ash, surficial cover, and vegetation flowed down the 40 -60 E flank into the valleys of the Tunggeng and Sat Rivers. The mudflow killed 252 persons, left 152 injured and 120 missing, and flooded 626 hectares of rice fields and 16 villages along the river's banks. It eroded old mudflow deposits and washed away a dike built in 1912 after a similar event had destroyed the city of Lumajang (40 km E of the volcano) in 1901. The devastated area appears to be within the alert zone on VSI's 1973 hazard map., 40622=Table 12. Seismicity at Semeru, 24 March-29 June 2003. Courtesy of VSI., 245467=Based on satellite imagery and information from CVGHM, the Darwin VAAC reported diffuse ash plumes from Semeru at an altitude of 4.6 (15,000 ft) a.s.l. during 3-5 May. The plumes drifted SW., 106173=Ongoing pyroclastic flows associated with lava avalanches tended to be larger in October than September. On 7 October, one such pyroclastic flow ran down the Besuk Kembar river to a distance of ~2 km. At the end of October ash had accumulated to ~1 mm thick in villages around the volcano. Seismicity was dominated by explosions and avalanche earthquakes., 43446=From April 2002 until the end of the year, MODIS thermal alerts for Semeru increased in frequency and magnitude. This period was characterized by continuous explosions, avalanches and pyroclastic flows, and is related to seismicity increases beginning in March 2002 that prompted VSI to raise the Alert Level to 2 (BGVN 27:06). Thermal alerts reached a maximum amplitude on 16 August (two alert pixels with a maximum alert ratio of -0.364) and 1 September (one alert pixel with alert ratio of -0.389). VSI reported that seismic activity was higher than normal during June-September 2002 (BGVN 27:09), and the explosions produced plumes that reached 300-500 m above the crater. Observers reported that lava avalanches traveled toward the Besuk Kembar river to distances of ~750 m from the crater rim, and an ash explosion ejected glowing material ~150 m toward the upper Besuk Kembar drainage. Center coordinates of alert pixels were concentrated in four adjacent pixels close to Semeru's summit, especially on the S side., 248143=Based on a pilot observation, the Darwin VAAC reported that an ash plume, possibly from Semeru, rose to an altitude of 6.1 km (20,000 ft) a.s.l. on 6 August. Ash was not detected on satellite imagery., 253471=The Darwin VAAC reported that on 27 July an ash plume at an altitude of 4.3 km (14,000 ft) a.s.l. was spotted by a pilot in the vicinity of Semeru. Ash was not identified on satellite imagery., 174495=09/1999 (BGVN 24:09) Short-lived Vulcanian explosions continuing from Jonggring Seloko Crat, 190432=VSI reported that during 9-15 April activity at Semeru was higher than normal. Minor explosions that rose 300 m above the volcano were observed during clear weather. Seismographs recorded an increase in seismicity in comparison to the previous week, with 339 explosion events, 51 avalanche events, and three tectonic earthquakes. Semeru remained at Alert Level 2 (on a scale of 1-4)., 47786=Table 11. Summary of weekly seismicity at Semeru during 1 January-23 March 2003. Courtesy VSI., 285499=PVMBG reported that both white plumes and gray to brownish-gray plumes from Semeru were observed rising as high as 600 m above the crater and drifting N, NW, W, and SW during 1 April-13 July; inclement weather sometimes prevented observations. Ashfall was reported in Sawur and surrounding areas in April, and incandescent avalanches that traveled as far as 1 km were observed in May. Seismicity was dominated by explosions and emission signals. The Alert Level remained at 2 (on a scale from 1-4); visitors and residents were warned to avoid the SE flank within 4 km of the crater., 97069=Seismic events decreased during 27 April-3 May, but a white-gray ash plume continued to reach up to 600 m. There was a marked increase in seismic events from 4-17 May. From 18-24 May the ash plume varied from white-gray to white-brown and extended to between 400 and 600 m above the summit. Eruptions dominated the seismic record, with a decrease in volcanic events. During the week pilots reported occasional ash clouds drifting NW. On 24 May the plume height reached ~6 km, drifting NW., 80262=Explosions and lava avalanches continued in March. Clouds and haze often obscured the volcano, but sometimes thick white emissions appeared above the summit to a maximum height of 500 m. Visual activity and seismicity appeared to increase in late March-early April., 175879=09/1996 (BGVN 21:09) Intermittent pilot reports of eruptions from August to October, 173011=07/2003 (BGVN 28:07) Ash plumes, pyroclastic flows, and high seismicity continue through June, 25615=Our previous report (BGVN 29:06) covered activity at Semeru through 4 July 2004. This report, compiled chiefly from reports from the Center of Volcanology and Geological Hazard Management (CVGHM) and the Darwin Volcanic Ash Advisory Centre (Darwin VAAC), discusses subsequent activity into early 2007. Minor eruptions with the highest reported plumes reaching 7.6 km altitude continued from mid-2006 through April 2007. During mid-2006 to May 2007 there were also numerous thermal anomalies. The thermal data were captured by MODIS satellite sensors and presented on the MODVOLC system., 104970=Aviation ash advisories were issued on 21-23 March, 16-19, and 30 May, and 6 June following reports by Qantas pilots who encountered ash at altitudes of 3.5-7 km. Another Qantas report on 10 July described light ash as high as 10 km altitude. Lower level (3-6.1 km) ash was encountered again by Qantas flights on 10, 13, 20, 23 and 24 July. Neither BOM nor SAB observed ash in satellite imagery because of clouds over the mountains., 27386=Foggy weather made visual observation difficult again during the week of 21-27 June. On one clear day a white-gray ash explosion was observed rising 500-600 m above the summit. Seismographs recorded volcanic, tremor, and tectonic earthquakes, and explosion and avalanche signals. Seismicity had generally increased, except for tectonic earthquakes, compared to the previous week., 21268=Information Contacts: Dali Ahmad, Hetty Triastuty, Nia Haerani, and Suswati, Center of Volcanology and Geological Hazard Mitigation (CVGHM), Jalan Diponegoro No. 57, Bandung 40122, Indonesia (Email: dali@vsi.esdm.go.id, URL: http://www.vsi.esdm.go.id/); Darwin Volcanic Ash Advisory Centre (VAAC), Bureau of Meteorology, Northern Territory Regional Office, PO Box 40050, Casuarina, NT 0811, Australia (URL: http://www.bom.gov.au/info/vaac/); Hawai'i Institute of Geophysics and Planetology (HIGP) Thermal Alerts System, School of Ocean and Earth Science and Technology (SOEST), University of Hawai'i, 2525 Correa Road, Honolulu, HI 96822, USA (http://hotspot.higp.hawaii.edu/); Agence France-Presse. (AFP) (http://www.afp.com/english/home/)., 184327=04/1972 (CSLP 27-72) Lava flows and eruption plume, 256504=Based on pilot observations, the Darwin VAAC reported that a low-level plume from Semeru was present on 28 August. A pilot reported that an ash plume rose to an altitude of 4.6 km (15,000 ft) a.s.l. and drifted SW on 31 August., 183777=03/1977 (NSEB 02:03) Long-running eruption continues typical activity, 182700=08/1985 (SEAN 10:08) Two-year eruption continues, 140942=. . . normal activity in July. Explosions every few minutes ejected plumes as high as 1 km., 227108=A pilot reported an ash plume from Semeru on 18 July at a height of ~3 km a.s.l. drifting NW. No ash was visible on satellite imagery., 19126=Table 18. Compilation of data on Semeru during February 2007-March 2009. Courtesy of CVGHM., 64217=During 27 March-1 April 2001, VSI personnel observed several lava avalanches that traveled to Kembar River valley as far as 750 m S of the summit. No seismic data were available because the seismometers broke on 24 March 2001. They were repaired on 1 April., 57687=During 17 June-8 September, activity at Semeru was higher than normal. Seismicity was dominated by explosion and avalanche earthquakes. Volcanic and tectonic earthquakes also occurred, along with occasional tremor episodes (table 9). During June and July, and on 6 August, when fog did not obscure the view, observers reported that lava avalanches traveled toward Besuk Kembar river at distances of ~750 m from the crater rim. At times during July explosions produced white ash plumes that reached 300-500 m above the crater. During mid-August to early September, a white-gray ash plume rose 400-500 m above the crater. On 8 September at 1947 an ash explosion ejected glowing material ~150 m toward the upper stream of Besuk Kembar river. Semeru remained at Alert Level 2., 181606=11/1986 (SEAN 11:10) Vulcanian explosions continue, 104511=A pyroclastic flow and minor ashfall was reported in October 1996, along with explosions and avalanches earthquakes (BGVN 21:11). Semeru is the highest and one of the most active volcanoes of Java. It lies at the S end of a volcanic massif extending N to the Tengger Caldera and has been in almost continuous eruption since 1967., 276416=According to a news account (People’s Daily Online) on 1 March 2012, seismic activity had increased from 28 to 38 tremors per day. According to the news account, Dr. Surono, head of CVGHM, stated that the volcano was erupting daily, emitting ash plumes, and tremor occurred every 15-30 minutes. He also noted that the volcanic dome was increasing in size., 78812=Explosive activity was continuing in the second half of June; observers noted white-gray plumes ~600 m above the summit. Pyroclastic flows that reached maximum distances of ~2.5-3 km were reported on 1-2, 4, 10, and 15 July., 11816=MODVOLC Thermal Alerts. According to MODVOLC data, intermittent thermal alerts have been observed for years near Semeru. During this reporting period (April 2009 through October 2010), multiple hotspots were observed only in 2010, on 20 February, 29 April, 2, 20, and 25 May, 14, 21, and 30 June, 7, 28, and 30 July, 6, 8, 15, and 31 August, and 7 and 30 September., 261820=On 1 March, CVGHM reported that although inclement weather often prevented observations of Semeru during November 2009-February 2010, \"smoke\" was often seen rising 50-500 m above the Jonggring Seloko crater. During 25-28 February, incandescent rock avalanches traveled as far as 750 m from the crater. The Alert Level remained at 2 (on a scale of 1-4)., 41421=Ash plumes, pyroclastic flows, and high seismicity continue through June, 240449=Based on pilot reports, the Darwin VAAC reported that an eruption plume from Semeru reached 4.3 km (14,000 ft) a.s.l. and drifted W on 15 September., 215217=During the week of 16-22 April, Semeru was continually active. A white-gray ash plume@ rose 400-500 m over the summit. Seismic signals interpreted as pyroclastic flows were recorded multiple times during the week. One pyroclastic flow on 18 April traveled into several local drainages, reaching lengths of ~2.5 and ~3.5 km., 54872=Higher-than-normal seismic and explosive activity occurred at Semeru during June-September 2002 (BGVN 27:09). During 9 September-29 December, activity continued to be higher than normal. Seismicity was dominated by explosions and avalanche earthquakes (table 10). Throughout the report period, a white-gray ash plume rose 400-500 m high above the Jonggring Seloko crater rim. There were eight explosions on 23 December, one explosion on 25 December, seven explosions on 26 December, eight explosions on 27 December, and another seven explosions on 29 December., 96020=Ash emissions and pyroclastic flows during June-September, 136099=Eruptive activity and the number of explosion earthquakes sharply decreased from the beginning of May to December 1990. However, ash was frequently emitted to 300-400 m above the crater, and one large explosion on 21 December ejected ash to 1,000 m. Avalanches to the E (into the Besuk Kembar river) were also common. In February, observers at Gunungsawur Observatory (~10 km SE of the crater) reported a lava flow that traveled 400 m from the crater. An average of 140 explosion earthquakes and one tectonic earthquake were recorded daily in March, but no tremor episodes were detected., 108465=Intermittent pilot reports of eruptions from August to October, 51050=On 25 December, a pyroclastic flow traveled 2.5 km and entered the Besuk Kembar river. On 27 December lava avalanches traveled 250 m toward Besuk Kembar. On 29 December a 5 km pyroclastic flow occurred. The same day during 1700-2015 a lahar flowed along Besuk Kembar closer to Supit village. Early on the morning of 30 December residents of Supit village were evacuated. The same day at 0720 a pyroclastic flow traveled 2.0 km toward Besuk Kembar and at 1000 a pyroclastic flow traveled 4.0 km, approaching Supit village. Semeru remained at Alert Level 2 (on a scale of 1-4)., 176832=03/1995 (BGVN 20:03) Ash eruptions, lava avalanches, and summit glow, 229761=On 25 August, a thin plume emitted from Semeru was visible on satellite imagery extending WSW. No ash was visible on the satellite imagery., 227834=During 5-10 August, pilots reported to the Darwin VAAC that several ash clouds were emitted from Semeru. The highest rising cloud reached ~7.6 km a.s.l. Ash was not visible on satellite imagery. The Alert Level at Semeru was at 2 (on a scale of 1-4)., 235564=Based on a pilot report, the Darwin VAAC reported that an ash plume from Semeru reached 5.5 km (18,000 ft) a.s.l. on 25 June., 208427=During 13-26 January volcanic activity remained at relatively high levels at Semeru, with ash plumes rising 400-600 m above the summit. On 19 and 23-24 January incandescent lava avalanches traveled ~500 m down Besuk Kembar River. Semeru was at Alert Level 2 (on a scale of 1-4)., 115458=The VSI reported that by 3 August a tongue of glowing lava had reached 300 m long; at 1932 that evening the lava collapsed to feed lava avalanches. Qantas airlines reported additional activity at 1510 on 8 August, describing volcanic \"smoke\" near Semeru to above 4 km. Two days later, around 1530 on 10 August, a Qantas flight reported an ash cloud to 9 km altitude with a SW drift., 31719=According to the Volcanological Survey of Indonesia (VSI), Semeru remained at Alert Level II (on a scale of 1-4) for the entire report period of April-June 2004. VSI characterizes Level II as \"increasing seismic activity and other volcanic events and visual changes around the crater\" but also states that this definition implies \"no eruption is imminent.\" A pilot reported an 18 June ash plume rising to 6 km., 221151=An ash plume emitted from Semeru on 9 September rose to ~7.3 km a.s.l. and drifted S. Ash was not visible on satellite imagery., 233660=According to the Darwin VAAC, a pilot reported multiple minor eruptions from Semeru on 4 June. Small ash plumes were detected on satellite imagery on 5-6 June., 171615=08/2010 (BGVN 35:08) Incandescent rock avalanches travel 750 m, plumes reach 500 m above crater, 217387=During 2-29 June, activity continued at high levels at Semeru. Several explosions occurred during the report period, with the highest ash plumes rising to a height of ~600 m. Seismicity was dominated by hundreds of explosion events per week. Semeru remained at Alert Level 2 (on a scale of 1-4)., 278369=Table 20. Types and numbers of earthquakes and plumes observed at Semeru during February-April 2012. Key to seismic signals variously classified as follows: LD, long-distance volcanic earthquake; Erup, eruptive; Expl, explosive; HTr, harmonic tremor; and PF, pyroclastic flow; “-”, either none detected or data not provided. Courtesy of CVGHM., 178775=05/1989 (SEAN 14:05) Frequent lava avalanches and nuees ardentes, 62485=Table 7. Seismicity registered at Semeru during 3 March-16 June 2002. \"--\" indicates that information was not reported. Courtesy VSI., 244791=Based on a news report, eruption plumes from Semeru drifted E on 10 and 11 February. Ashfall was reported from areas including the town of Lumajang, about 35 km E., 177819=11/1991 (BGVN 16:11) More frequent explosions and tremor; lava avalanches, 107479=On 6 October an eruption was reported by Qantas pilots at 1418. The dense plume was rising to ~4.6 km altitude with no significant drift., 158440=\"Semeru has been continuously active during at least the past two years. Activity consists of a blocky lava flow from the Semeru vent accompanied by Vulcanian explosions that occurred 6-10 times/hour during August, sending tephra-rich plumes to 1 km above the vent.\", 13283=Table 19. Types and numbers of earthquakes and plumes observed at Semeru during January 2009-February 2010., 173441=12/2002 (BGVN 27:12) Elevated explosive activity continues; evacuation on 30 December 2002, 69202=Explosion earthquakes dominated the seismicity (table 6), and pyroclastic flows occurred 17 times between 31 July 2000 and 15 July 2001. The Volcanological Survey of Indonesia (VSI) reported that a significant change in seismic activity occurred during 3-9 October 2000, when the number of explosion earthquakes increased to more than 700. A pyroclastic flow that reached the Kembar Besuki river, as far as 2,500 m from the summit, occurred on 2 October., 63034=Since mid-July 2001, Semeru was at Alert Level 1 (on a scale of 1-4). On 8 March 2002 two pyroclastic flows traveled 2.5 km downslope to the Besuk Kembar river. The same day, tectonic and volcanic earthquakes increased, prompting the Volcanological Survey of Indonesia (VSI) to raise the Alert Level to 2. Tectonic and volcanic earthquakes continued, along with explosions, avalanches, pyroclastic flows, and tremor (table 7). Plumes, sometimes containing ash, were visible reaching up to 500 m above the summit (table 8)., 238042=Eruption plumes from Semeru were visible on satellite imagery on 18, 21, and 24 July and reached a maximum altitude of 4.3 km (14,000 ft) a.s.l., 13711=Continuing eruptions at Semeru through March 2009 included ash plumes and some pyroclastic flows (BGVN 34:05). The Center of Volcanology and Geological Hazard Mitigation (CVGHM) reported in late July 2009 that ash eruptions had gradually ceased and seismicity had decreased. Seismicity increased again during November 2009 through at least February 2010 (table 19)., 68721=Table 6. Summary of seismicity at Semeru, 31 July 2000-15 July 2001. Ash plume heights are distances above the summit unless otherwise noted. Courtesy of the Volcanic Survey of Indonesia (VSI)., 128113=Reference: Reksowirogo, L.D., 1979, Semeru, in Kusumadinata, K., ed., Data Dasar Gunungapi Indonesia: Volcanological Survey of Indonesia, 820 p. (p. 304-319)., 37568=Table 13. Seismicity at Semeru, 30 June-28 September 2003. Courtesy of VSI., 255812=Based on pilot reports and observations of satellite imagery, the Darwin VAAC reported that during 21-22 August ash plumes from Semeru rose to an altitude of 3.7 km (12,000 ft) a.s.l. and drifted W., 109916=A pilot report from Qantas Airlines on 5 May noted activity around 1800 generating a plume to ~10.5 km altitude. Eruptive activity was again observed from the same flight at 1745 on 7 May, but the ash cloud was only ~1 km above the summit and drifting NE., 123141=Several hours of observations were made on 7 August by J. Sesiano from the N rim of Jonggring Seloko crater. Gas-and-ash plumes rose hundreds of meters above the crater. Generally mild explosions occurred at intervals of ~15-20 minutes, each resulting in a white plume that barely rose above the crater rim. The explosions originated from the same vent where very slow lava extrusion was feeding a flow moving SE that exhibited red glow and incandescent cracks at night. Based on the movement of unique morphological features of the lava flow, a velocity of tens of meters/day was estimated. Incandescent boulders were thrown from the flow front by violent explosions that occurred an average of 4-5 times/day. Collapses of the lava flow, located on a 35° slope, sent boulders down into the valley accompanied by small pyroclastic flows. Whistles and roaring noises were heard almost continuously, similar to the noises heard at a busy airport: jets taking off, landing, turning off engines, and disappearing into the distance. Thunder-like claps, rhythmic pulses (~1 Hz frequency, for ~10 minutes), and other sounds could also be heard. Seismicity recorded by VSI during 5-14 August indicated that activity was at normal levels, with 40-100 explosion events/day (19:07)., 179833=12/1987 (SEAN 12:12) Continued Vulcanian activity, 118164=On 19 July, explosion earthquakes having maximum amplitudes of 35 mm were recorded. On 20 July at 1140, seismographs recorded continuous earthquakes associated with avalanche-type pyroclastic flows. At 1350 on 20 July, the Semeru Volcano Observatory informed local authorities, the Mt. Semeru Project, and the Ministry of Public Works that lava avalanches and pyroclastic flows were descending SE from Semeru's summit along the Kobokan river (figure 7). A warning was sent to local residents near the Kobokan river in the villages of Sumbersari, Renteng, Deli, and Sukosari. The 20 July pyroclastic flows advanced 9.5 km from the summit along the Sumbersari and Lengkong rivers (figure 7). The pyroclastic flows ceased at 1550 on 20 July; no one was reported injured during this most recent episode, although in a previous episode, in February 1994, lava avalanches and pyroclastic flows killed six people in Sumbersari., 121064=Activity from the Jonggring Seloko summit crater continued in January and February 1995. Ash eruptions rose as high as 600 m above the summit. Lava avalanches increased in frequency during January and early February, and traveled down the Kembar River drainage to a distance of 750 m from the summit. Glow was sometimes observed 50-100 m above the summit. On the morning of 6 February three pyroclastic avalanches moved 800-1,000 m from the summit along the Kembar River before turning into the Kobokan River., 183252=02/1981 (SEAN 06:02) Ash emission and hot avalanches, 175477=06/1997 (BGVN 22:06) Pilots saw April-June ash at 3- to 7-km altitudes, 170062=Review of recent activity since 1967, 23985=Table 17. Summary of reported ash plumes emitted from Semeru, July 2004 to February 2007. Courtesy of CVGHM and the Darwin VAAC., 115039=VSI noted that during Aug-Oct small-to-moderate explosions and avalanches continued from the Jonggring Seloko summit crater. Plumes rose to a maximum of 600 m above the summit; the average plume height was 300-500 m. In August and September, pyroclastic flows often traveled down the Kember River, then descended the Kobokan River, reaching a distance of 1-3 km. The frequency of lava avalanches increased in September, extending along the Kember River for up to 500 m from the summit., 145685=. . . Vulcanian activity continued through August. Field geologists observed several [glowing avalanches] that traveled down the SE flank . . . ., 92850=On 17 September there were 17 explosions witnessed during day-time hours. The time interval between two successive explosions ranged from 1 to 71 minutes, with an average of one explosion every 36 minutes. The next day 25 explosions were witnessed with 1 to 75 minutes between explosions and an average of one explosion every 32 minutes. These consistent statistics suggest that the present level of activity is lower than that observed in July 1996 and 1997 (BGVN 22:08). Of the 18 explosions closely witnessed, only two were capable of sending ballistic blocks higher than the N crater rim. All ballistic material felt back into the crater. However, the presence of fresh impact structures on the northern pyroclastic rampart of Jonggring Seloko Crater indicated that it is still occasionally showered by pyroclastic blocks., 264751=On 3 February, CVGHM reported that from 29 December 2011 to 2 February 2012 seismicity increased at Semeru, and dense white and gray plumes rose as high as 600 m above the Jonggring Seloko crater. During the month of January crater incandescence was observed and avalanches carried incandescent material 200-400 m away from the crater. On 2 February a large explosion was reported and incandescent material was ejected 2.5 km from the crater. Based on the seismic activity and visual observations, CVGHM raised the Alert Level from 2 to 3 (on a scale of 1-4) on 2 February., 209303=During 3-9 February, volcanic activity remained at high levels at Semeru, with ash plumes rising 300-400 m above the summit. On 7 February a pyroclastic flow traveled 2-4 km into the Besuk Bang River. Seismicity during the report period was dominated by 777 explosion events and 14 pyroclastic flows were recorded. Semeru remained at Alert Level 2 (on a scale of 1-4)., 132763=During an 18-hour visit to the summit region 21-22 October by the German-Indonesian Volcano Expedition, volcanic activity was confined to the Jonggring Seloko crater (figures 2 and 3). At least 35 explosions occurred during the summit visit, most associated with steam releases from the crater bottom, sometimes forming mushroom-shaped clouds that rose ~1 km above the crater. The average time between explosions was ~22 minutes, but varied between 3 and 46 minutes., 105066=Pilots saw April-June ash at 3- to 7-km altitudes, 11389=Information Contacts: Center of Volcanology and Geological Hazard Mitigation (CVGHM), Jalan Diponegoro 57, Bandung 40122, Indonesia (URL: http://portal.vsi.esdm.go.id/joomla/); Hawai'i Institute of Geophysics and Planetology (HIGP) Thermal Alerts System, School of Ocean and Earth Science and Technology (SOEST), Univ. of Hawai'i, 2525 Correa Road, Honolulu, HI 96822, USA (URL: http://hotspot.higp.hawaii.edu/)., 180568=07/1987 (SEAN 12:07) Glowing rockfall avalanches enter new drainages, 25709=Minor ash eruptions continue into February 2007, 223919=The Darwin VAAC reported that ash plumes from Semeru were visible in satellite imagery on 18 and 20 April. The plumes reached heights of ~4.5 km and extended ~90 km NW and ~75 km SSE, respectively., 45191=Lava avalanches in January 2003 extended up to 750 m from the crater rim and sometimes entered the Besuk Kembar river. One pyroclastic flow traveled 1,500 m and also entered Besuk Kembar. Pyroclastic flows were more numerous in February, travelling between 2.5 and 4 km from the summit into the Besuk Bang drainage. Lava avalanches were continuous during 17-23 February towards Besuk Kambar. Several pyroclastic flows in March moved toward Besuk Bang (up to 4 km long) and Besuk Kembar (up to 2 km long)., 155525=Table 2. Whole rock analyses of breadcrust bomb sample collected from Semeru, 17 August 1985. X-ray fluorescence analyses by the USGS Laboratory, Denver, Colorado. Total iron expressed as Fe2O3; loss on ignition at 900°C., 248816=Based on a pilot observation, the Darwin VAAC reported that an ash plume from Semeru rose to an altitude of 7.3 km (24,000 ft) a.s.l. on 22 September. Ash was not detected on satellite imagery., 230379=Satellite imagery on 21 May showed a thin plume from Semeru at a height of ~4.6 km (~15,000 ft) a.s.l. extending to the S and later SSE., 252140=CVGHM reported that pyroclastic flows and rockfall avalanches from Semeru detected by the seismic network declined in frequency during 22 May-3 June. On 22 May, four pyroclastic flows traveled a maximum distance of 2.5 km from the active crater. Visual observations of smaller rockfalls detected during the rest of the reporting period were inhibited by fog, but were observed to travel 200-300 m from the active crater. Based on visual observations and the decline in seismic activity, CVGHM lowered the Alert Level to 2 (on a scale of 1-4) on 5 June., 199685=When weather conditions were clear during 1-7 July, lava avalanches were sometimes observed traveling 750 m from Semeru's crater rim E toward Besuk Kembar River. Seismicity decreased in comparison to the previous week. Semeru remained at Alert Level 2 (on a scale of 1-4)., 129710=The features in the N region of the summit conformed well to the 1941 map in Reksowirogo (1979). However, the S part of the summit region has changed extensively. Where the 1941 map shows the N edge of the crater, there is now an E-W valley filled with ash, lapilli, tuff, and some volcanic bombs. This valley is ~50 m deep, and ends to the E in a ridge, shown as part of the crater wall on the 1941 map. The valley separates the summit (Mahameru) from the new rim of the Jonggring Seloko crater. The crater is nearly cylindrical with a diameter of roughly 300 m and an estimated depth of 150 m. The very steep crater walls exhibit fumarolic and solfataric activity. Steam explosions occurred occasionally and the rim was heaped with ash. The crater walls show alternating layers of andesitic or rhyolitic lava and ash. The N, W, and SW walls of the crater are relatively intact. The highest point of the rim in the N was measured to be 40 m lower than the Mahameru summit. The crater opens to the SSE, allowing volcanic material to flow out, and there is a shallower gap in the NE wall. Except for the gas vents in the walls, nearly all of the volcanic activity was concentrated at the bottom of the pit where a double ash ring surrounded a small lava dome or plug ~30 m in diameter. Near the SSE opening of the crater is an area of additional activity. From this inaccessible location, a small, old, aa flow seems to have been extruded., 16228=October 2007. Based on reports from CVGHM, the Darwin VAAC reported that an unconfirmed eruption was heard 17 km away on 31 October 2007 (table 18). No plume was seen in MTSAT-IR satellite imagery. A news report from Antara News on 5 November 2007 (\"Ash blankets town near Indonesian volcano\") noted that scientists monitoring the volcanoes confirmed Semeru as the source. The news report stated that initially residents thought the thin layer of ash had come from Kelut, a volcano that went to Alert Level 4 (the highest status) on 16 October. The eruption of Kelut, while emitting a large dome into a crater lake, triggered few if any sustained explosions (BGVN 33:03). Ash fell in Blitar, outside a 10 km danger zone around Kelut; Semeru is ~ 90 km away., 174909=05/1999 (BGVN 24:05) Mass wasting in March; ash eruptions continue; 9-km-high ash cloud in May, 146812=. . . Vulcanian activity during July. Beginning 15 July, glowing rockfall avalanches from the crater entered the Tretes drainage, which lies between the Kobokan drainage SE of the crater and the Kembar, S of the crater. Apparently the upper Kobokan and Kembar drainages have both been filled with material, so avalanches have begun to overflow from them into the Tretes drainage. This change in the flow pattern does not represent a significant change in eruptive activity, but only a change in the direction in which rockfall avalanches are channeled out of the summit crater., 254236=CVGHM reported on 5 August that ash plumes from Semeru rose to altitudes of 4-4.3 km (13,100-14,100 ft) a.s.l. and were occasionally accompanied by ejected incandescent tephra. Based on visual observations and instrumental data, the Alert level remained at 2 (on a scale of 1-4)., 159460=Fresh nuée ardente deposits on the upper S flank, combined with the onset of the monsoon season, had prompted the VSI to warn local authorities in January of the danger of mudflows S and SE of Semeru. Although a mudflow also moved down the S flank on 14 May, no casualties were reported there. Activity at Semeru was normal during May, with about 80 gas eruptions each day. The lava dome continued to grow at about 100 m3/day., 174062=08/2001 (BGVN 26:08) Continuous seismic activity, plumes to ~11.6 km, 217951=An ash cloud from Semeru was visible on satellite imagery on 21 July at 2316 extending ~75 km to the WSW., 241832=Based on a pilot report, the Darwin VAAC reported that on 18 October, an eruption plume from Semeru reached 4.6 km (15,000 ft) a.s.l., 188674=During 27 March-1 April, VSI personnel observed several lava avalanches that traveled to Kembar River valley as far as 750 m S of the summit. No seismic data were available because the seismometers broke on 24 March 2001. They were repaired on 1 April. Semeru is at hazard level 2 (on a scale of 1-4)., 181091=03/1987 (SEAN 12:03) Normal Vulcanian explosions continue, 179305=04/1988 (SEAN 13:04) Vulcanian explosions continue in 21-year eruption, 197350=Volcanic and seismic activity remained high at Semeru during 11-17 March. Observations on 12, 14, and 17 March revealed that a gray plume rose 300-400 m above the summit. Seismicity was dominated by 444 explosion earthquakes, and there was a decrease in the number of tectonic and deep volcanic earthquakes in comparison to the previous week. The volcano remained at Alert Level 2 (on a scale of 1-4)., 210909=During 3-9 March, volcanism at Semeru remained at high levels. \"White-gray ash plume[s]\" rose to low levels above the summit and several \"pyroclastic avalanches\" traveled 200-2,000 m into Besuk Kembar River. Seismicity was dominated by 794 explosion earthquakes. The Alert Level at Semeru remained at 2 (on a scale of 1-4)., 182335=04/1986 (SEAN 11:04) Normal small Vulcanian explosions continue, 76798=Observations on 14 July 2000. Volcanologists on an International Association of Volcanology and Chemistry of the Earth's Interior (IAVCEI) field trip in east Java observed eruptions of Semeru from an observation point on the N rim of the Sand Sea caldera at Bromo (figure 10). Eruption plumes became visible just before sunrise. Gray ash-and-steam plumes rose a few hundred meters and drifted out over the ocean. Multiple plumes from earlier eruptions were visible downwind. Eruptions lasted up to 2 minutes, and occurred at intervals of between 5 and 30 minutes during the approximately 2 hours of observations. One explosion event was quickly followed by another explosion, apparently from a second location within the crater. Plumes were frequently seen during the next two days from other points around the volcano., 181961=06/1986 (SEAN 11:06) Continued small explosions, 238644=According to the Darwin VAAC, on 24-25 and 31 July small plumes from Semeru were visible on satellite imagery and reached unknown altitudes., 142758=. . . Vulcanian activity in March. A NOTAM on the 26th reported that clouds reached 7.5 km altitude and were moving E., 242530=Based on a pilot report, the Darwin VAAC reported that on 25 and 26 October, an eruption plume from Semeru reached 7.6 km (25,000 ft) a.s.l. and drifted W. On 30 October, ash-and-steam emissions were detected on satellite imagery., 35517=Frequent ash explosions continue through October, 222639=During October, ash explosions at Semeru continued to produce low-level plumes and seismicity was dominated by hundreds of explosion earthquakes. Semeru remained at Alert Level 2 (on a scale of 1-4)., 259460=On 6 March, CVGHM reported that an ash eruption from Semeru was characterized by increased seismicity and booming sounds from the Jonggring Seloko crater; fog prevented visual observations. The Alert Level was raised to 3 (on a scale of 1-4). Based on analysis of satellite imagery, the Darwin VAAC reported that on 7 March a possible plume rose to altitudes of 3.7-4.3 km (12,000-14,000 ft) a.s.l., 175286=08/1997 (BGVN 22:08) Frequent explosions and ash plumes; two climbers killed, 185279=On 11 December an air report to the Darwin VAAC stated that volcanic ash was observed near Semeru at an altitude of ~7.6 km a.s.l. The Darwin VAAC stated that the activity may have been associated with Semeru, which frequently erupts ash to ~4.5 km. Due to cloudy conditions, any low-level volcanic activity that was occurring at that time was not visible in satellite imagery., 243497=Based on a pilot report, the Darwin VAAC reported that on 22 November an ash plume from Semeru reached 7.6 km (25,000 ft) a.s.l. and drifted S. On 24 November, CVGHM reported an eruption plume to an altitude of 4.4 km (14,000 ft) a.s.l. Incandescent material fell to the ground in all directions within a 200 m radius from the center of the plume., 126510=Visual and seismic activity had increased in late 1993, with frequent collapses from the summit lava flow SE into the area between the Kembar and Kobokan rivers. Volcanic earthquakes had been recorded since October, and peaked on 25 December 1993. Continuous tremor with a maximum amplitude of 26 mm was recorded from 26 January until 3 February 1994 (figure 4)., 255150=Based on information from CVGHM, the Darwin VAAC reported that on 7 August ash plumes from Semeru rose to an altitude of 4.3 km (14,100 ft) a.s.l. and that incandescent material was ejected from the crater. CVGHM indicated that the activity was normal; the Alert Level remained at 2 (on a scale of 1-4)., 82873=Table 4. Summary of seismicity at Semeru, 31 January-29 August 2000. * Six days of data, through 15 July. Courtesy of VSI., 274961=On 2 May 2012 CVGHM lowered the Alert Level to 2, but reminded the public not to approach the crater within a 4-km radius., 124041=During 5-14 August observations, visual and seismic activity . . . were normal. The daily number of explosion earthquakes fluctuated between 40 and 100 events, and volcanic tremor was occasionally recorded with a maximum amplitude of 4 mm. Ash eruptions generated clouds up to 500 m above the summit. There were no pyroclastic flows or lava avalanches., 177417=01/1994 (BGVN 19:01) Lava avalanches and pyroclastic flows kill six people, 164991=Extrusion of a summit dome began in 1967 and was continuing in late 1979. Until 1974, dome growth was concentrated in the S portion of the summit, shifting since then to the SE but remaining in the summit area. Lava avalanches, nuées ardentes (traveling a maximum of about 7 km), and ash explosions have accompanied the dome extrusion., 30826=During 19-25 April, white-gray ash plumes were observed reaching heights of 100-400 m above the summit. The Darwin VAAC reported that an ash plume was visible in satellite imagery on 20 April, reaching a height of ~ 4.5 km and extending ~ 75 km SSE. Another plume on 21 April rose to ~ 4.6 km altitude and drifted ESE. Increases occurred in tremor as well as tectonic earthquakes, shallow-volcanic earthquakes, and explosion earthquakes. The number of avalanche signals decreased (table 16)., 137888=The press reported that heavy ashfall occurred 21-22 March, with accumulations of up to 5 mm in Malang (20 km NW). VSI noted that the activity was considered \"normal\" . . . ., 19799=Our last report (BGVN 32:03) covered through October 2006 in terms of CVGHM reporting and through February 2007 in terms of Darwin VAAC reporting. As has been the case for decades, Semeru's eruptions continued and were ongoing through this reporting interval, February 2007-March 2009. During the reporting interval, ash plumes were periodically observed over the summit at low altitudes of 3.7-4.6 km. Taller plumes, when they occurred, are noted below. There were several cases of plumes over 6 km altitude and as tall as ~ 7.6 km altitude. Pyroclastic flows ran out to distances as great as 3 km (table 18)., 154159=\"Semeru continued to have several small Vulcanian explosions/hour during April. The maximum height of the eruption clouds was ~1 km above the summit. This represents the normal state of activity at Semeru.\", 172020=03/2007 (BGVN 32:03) Minor ash eruptions continue into February 2007, 183407=09/1980 (SEAN 05:09) Ash eruptions, 89204=Semeru has been undergoing nearly constant eruptive activity since 1967. Volcanological Survey of Indonesia (VSI) reports through mid-September 1999 (BGVN 24:09) and earlier described seismicity (including seismically detected pyroclastic flows) and ongoing eruptive outbursts. Accessible Darwin VAAC reports since 3 June 1998 help to characterize the long-term eruptive patterns (table 3). VSI reports are not available for September 1999 through January 2000., 260959=CVGHM reported that on 15 March an eruption from Semeru produced a white-and-gray plume that rose 600 m above the crater. White plumes and ash eruptions gradually ceased and seismicity decreased. From 5 May until the end of June, fog prevented visual observations. On 16 July, the Alert Level was lowered to 2 (on a scale of 1-4)., 97294=On 19 April the Darwin Volcanic Ash Advisory Center (VAAC) issued an advisory to aviators, citing reported eruption ash clouds at 9 km. There was no evidence of the ash cloud from satellite imagery., 12167=CVGHM reported that, although inclement weather often prevented visual observations, \"smoke\" was seen rising 50-500 m above the Jonggring Seloko crater through February 2010. On 5 January 2010 incandescence was observed. During 25-28 February, incandescent rock avalanches traveled as far as 750 m from the crater., 83428=Activity during February-July 2000. Explosive activity during February 2000 included ash emissions, numerous rockfalls, and a few deep A-type earthquakes (table 4). Plumes of thick white ash were seen to rise up to 400 m above the summit on many occasions. Persistent haze or cloudy weather prevented direct observation throughout most of the month. At night during the week of 8-14 February observers noted a 60-m-high flame. Generally, explosions and rockfalls dominated recorded seismicity., 26980=During the week of 28 June-4 July, visual observations of the summit were again difficult because of cloud cover, but a gray ash plume was observed rising to 500-600 m above the summit on one clear day. Seismographs still recorded volcanic, tremor, and tectonic earthquakes, and explosion and avalanche signals., 231034=The Darwin VAAC received a report that a small plume was visible above Semeru's summit on 25 May. The Darwin VAAC received a report that a small plume was visible above Semeru's summit on 25 May., 224533=The Darwin VAAC reported that an ash plume from Semeru was visible on satellite imagery on 21 April. The plume rose to ~4.6 km a.s.l. and drifted ESE., 204488=Ash clouds were observed at Semeru rising to ~7.6 a.s.l. on 22 September at 1453 and on 23 September at 1700. The September 23rd cloud drifted SW. Neither cloud was visible on satellite imagery due to meteorological clouds in the area., 152198=Small explosions continued from the summit crater in June, the same style of activity . . . since 1967., 211652=During 10-16 March at Semeru, \"white-gray ash plumes\" rose to low levels and several pyroclastic flows traveled 1.5-4 km down Bang River. Seismicity was dominated by 550 explosion earthquakes. Semeru remained at Alert Level 2 (on a scale of 1-4)., 194916=According to the Darwin VAAC, a pilot reported observing an ash plume rising 1-4 km above Semeru on 1 October at 1457. No ash was visible in satellite imagery, possibly due to low-level meteorological clouds obscuring the plume., 239819=According to the Darwin VAAC, ash plumes from Semeru were visible on satellite imagery on 25 August., 180913=04/1987 (SEAN 12:04) Continued small Vulcanian explosions, 213399=Seismic and volcanic activity continued at relatively high levels at Semeru during 24-30 March, with \"gray ash plumes\" rising to low levels, pyroclastic-flow activity, and several explosions. On 27 March a pyroclastic flow travelled around 3,750 m toward Bang River. During the week, seismicity was dominated by 794 explosion events. Semeru remained at Alert Level 2 (on a scale of 1-4)., 125522=Eruptive and seismic activity continued after 3 February, but the intensity and energy had decreased. The daily number of explosion earthquakes increased to 360 on 5 February, then declined again, but remained >70/day through mid-month (figure 4). Volcanic tremor was recorded again on 9-14 February with a maximum amplitude of 13 mm. Ash eruptions generated clouds reaching heights of up to 700 m above the summit. Pyroclastic flows and lava avalanches traveled as far as 3 km down the Kembar and Kobokan rivers. Lava extruded from the crater over the S rim formed a 750-m-long lobe moving down the S flank toward the Kembar river., 180379=08/1987 (SEAN 12:08) Vulcanian activity continues; nuées ardentes de avalanche, 95916=Ash emissions and pyroclastic flows continued at Semeru during June-September. In early June emissions of \"white colored ash\" rose up to 700 m above the summit. Lava avalanches flowed along the Besuk Kembar river valley to distances of up to 750 m from the crater. A pilot reported seeing the top of an ash plume drifting northeast at 6,100 m altitude at 0944 on 13 June. Explosions and lava avalanches occurred frequently during the first week of July, although thick haze often precluded visual observation. On 16 July a pyroclastic flow along the Besuk Kembar river reached a distance of 2 km from the summit., 93956=Information Contacts: Volcanological Survey of Indonesia (VSI), Jalan Diponegoro No. 57, Bandung 40122, Indonesia (URL: http://www.vsi.esdm.go.id/); Jacques-Marie Bardintzeff, Laboratoire de Petrographie-Volcanologie, bat 504, Universite Paris-Sud, 91405, Orsay, France (Email: bardizef@geol.u-psud.fr)., 174283=07/2000 (BGVN 25:07) Ongoing eruptive activity; 27 July explosion causes injuries and two fatalities, 179663=02/1988 (SEAN 13:02) Continued Vulcanian activity, 273796=2015: April | July 2014: April 2013: October 2012: February | May 2010: February | November 2009: March | July 2008: April | May | June | July | August | September | October 2007: February | May | June | August | September | October 2006: March | April | May | June | July | August | September | October | November | December 2005: May 2004: April | May | June | July | August 2003: January | February | March | April | May | July | August | September | October | December 2002: March | April | June | July | August | September | December 2001: February | March | April | May | July | September | October 2000: December, 144456=. . . Vulcanian activity in October., 205569=During 9-22 December, volcanic and seismic activity remained above normal levels at Semeru. Ash columns rose 400-500 m above the volcano, and lava avalanches and pyroclastic flows were seismically recorded. The Alert Level was at 2 (on a scale of 1-4). According to news articles, the emission of lava and hot gas caused authorities to ban all recreational activity at Semeru beginning on 22 December., 276735=During 1 February-30 April 2012, dense gray-to-white plumes rose 100-500 m above Jongring Seloko crater and drifted W and N. Incandescence was visible up to 50 m above the crater during 1 February-31 March. Seismicity decreased toward the end of April, although the lava dome grew that month., 143904=Vulcanian activity continued during November and December., 284360=Increased seismicity with lava flows and pyroclastic flows during February-April 2012, 244123=The Darwin VAAC reported that a plume from Semeru was visible on satellite imagery on 21 December at an altitude of 4.3 (14,000 ft) a.s.l., 182869=05/1981 (SEAN 06:05) Mudflow kills more than 250, 196463=An increase in volcanic and seismic activity at Semeru during 3-10 March led VSI to raise the Alert Level from 1 to 2 (on a scale of 1-4). On 8 March observers saw an emission rise ~400 m above the volcano, and two pyroclastic flows travel S as far as 2.5 km down the Kembar River. During the report period there was an increase in tectonic and volcanic earthquakes in comparison to the previous week., 31262=During the week of 12-18 April, tectonic earthquakes and tremor increased. Plumes sometimes containing ash were observed reaching heights of 110-400 m above the summit. Other seismic signals (including those from explosions, avalanches, and tremor) also continued. The Darwin VAAC reported that an ash plume was visible in satellite imagery on 18 April, reaching a height of ~ 4.5 km and extending ~ 90 km NW., 27972=Visual observation was difficult during 14-20 June due to fog, although a white-gray plume was observed on 18 June, rising to heights of 500-600 m above the summit. Based on a pilot's report, the Darwin VAAC reported that on 18 June an ash cloud from Semeru was visible at a height of ~ 6 km altitude, extending ~ 40 km E; this was the highest recorded ash cloud during the report interval. No ash was visible on satellite imagery. The number of volcanic, tremor, and tectonic earthquakes, and explosion and avalanche signals decreased from the previous week., 193469=Seismic data revealed that during 2-8 July the number of explosions and avalanche earthquakes at Semeru decreased in comparison to the previous week. The volcano was at Alert Level 2., 258442=Based on analysis of satellite imagery, the Darwin VAAC reported that on 22 October a plume from Semeru rose to an altitude of 4.3 km (14,000 ft) a.s.l. and drifted WSW., 179114=06/1988 (SEAN 13:06) Vulcanian activity continues, 171399=04/2012 (BGVN 37:04) Increased seismicity with lava flows and pyroclastic flows during February-April 2012, 219217=Thin ash plumes from Semeru were visible on satellite imagery on 8 and 9 August. On 9 August the plume extended ~40 km SW of the volcano., 226498=Based on information from a pilot's report, the Darwin VAAC reported that on 18 June an ash cloud from Semeru was visible at a height of ~6 km a.s.l., extending ~40 km E. Ash was not visible on satellite imagery. The Darwin VAAC reported that DVGHM listed the volcano at Alert Level 2 (on a scale of 1-4)., 262948=On 4 November, CVGHM reported that from August to October seismic activity at Semeru had increased, and \"smoke\" and occasional gas plumes rose 400-500 m above the crater. During September incandescent avalanches traveled 400 m SE into the Besuk Kembar drainage on three occasions. Incandescence from the crater was observed in October. Incandescent avalanches traveled 600 m E into Besuk Kembar on 2 November and 4 km into the Besuk Kembar and Besuk Bang (SSE) drainages on 4 November. CVGHM noted that the lava dome in the Jonggring Saloko crater was growing. The Alert Level remained at 2 (on a scale of 1-4)., 145023=. . . Vulcanian activity continued during September., 75098=Explosion on 27 July 2000. At approximately 0706 on the morning of 27 July an explosion resulted in two deaths and injuries to five other volcanologists near the NE rim of the active summit crater Jonggring Seloko (see map in BGVN 17:10). The group consisted of a five-member Semeru evaluation team of the Volcanological Survey of Indonesia (VSI), four local porters, and foreign scientists who had attended the IAVCEI conference in Bali the previous week. The fatalities and injuries were caused by impacts and burns from ballistic clasts. These originated from the second of two closely spaced explosions from separate vents that ejected material out to a few hundred meters. Both fatalities were VSI staff members: Asep Wildan was the team leader, and Mukti was a volcano observer from the Semeru Volcano Observatory. Those injured included Suparno, a VSI volcano observer from the Semeru Volcano Observatory, Amit Mushkin from the Hebrew University in Israel, Mike Ramsey from the University of Pittsburgh, and Lee Siebert and Paul Kimberly from the Smithsonian Institution. Kimberly sustained the most serious injuries among the five survivors, including a broken hand, broken arm, and 3rd-degree burns. Following surgeries in Singapore and burn treatments in the United States, Kimberly was released from the hospital in early September., 181435=12/1986 (SEAN 11:12) Frequent summit explosions continue, 173659=09/2002 (BGVN 27:09) Higher-than-normal seismic and explosive activity during June-September 2002, 161533=Activity increased 28 March. The first nuée ardente moved about 4 km from the summit down the Kembar and Kobokan Rivers (on the S flank) at 1755. During the following days, increasingly intense nuées ardentes reached a distance of more than 7 km from the summit. Four nuées ardentes and 19 lava avalanches (presumably accompanied by nuées ardentes of eruptive origin) were reported on 29 March and four more nuées ardentes and 36 lava avalanches were observed the next day. As of 31 March, tremors were being continuously recorded by the VSI seismograph about 10 km from the summit., 24966=On 9 March 2006, the CVGHM reported \"ash rain\" fell in the vicinity of Semeru. An eruption associated with earthquakes was photographed on 31 October 2006 (figure 16). On April 22, based on information from a significant meteorological notice and satellite observations the Darwin VAAC reported the first of a series of eruptions. Plumes rose to an altitude of ~ 4 km. Table 17 summarizes reported ash plume eruptions at Semeru through February 2007., 178590=07/1989 (SEAN 14:07) Vulcanian explosions, lava avalanches, and nuées ardentes, 214407=Volcanic activity remained at relatively high levels at Semeru during 31 March to 6 April. \"White-gray ash plumes\" rose 400-600 m above the summit and seismicity was dominated by 738 explosion events. According to the Darwin VAAC, a pilot reported seeing ash ~2.5 km above Semeru on 15 April at 1038. No ash was visible on satellite imagery. The Alert Level at Semeru remained at 2 (on a scale of 1-4)., 143330=. . . Vulcanian activity during February., 270067=PVMBG reported that white plumes and grayish white plumes from Semeru rose as high as 600 m above the crater during January-20 April, although inclement weather often prevented observations. Seismicity fluctuated, and was dominated by explosions and emission signals. During January incandescent avalanches from lava-flow fronts traveled 100-300 m. Eruptions were heard five times during 16-28 February. Nine explosions were heard during 1-15 March; minor ashfall from one of the explosions fell on the observation post. The Alert Level remained at 2 (on a scale from 1-4); visitors and residents were warned to avoid the SE flank within 4 km of the crater., 180173=09/1987 (SEAN 12:09) Vulcanian activity continues, 108120=Another Qantas pilot report indicated that Semeru erupted at 1625 and 1637 on 12 September with ash reaching 4,600-m altitude and drifting NW; no plume was seen on satellite imagery. At approximately 0640 the next day a localized plume was evident on satellite imagery drifting SSW to ~35 km away. Eruptive activity was again observed by Qantas pilots who reported at 1154 on 29 September thick black \"smoke\" at 6 km altitude. Another aircraft report at 2110 later that day indicated ash to 6 km moving N and NW. Satellite data showed local high cloud cover throughout the day, but no apparent ash plume., 31825=Persistent seismicity and ash plumes during April-June 2004, 234308=According to the Darwin VAAC, satellite imagery showed small ash plumes from Semeru on 6 and 12 June and minor ash-and-steam plumes on 11 and 13 June, all at unknown altitudes., 153231=When . . . visited 7-8 June, small explosions were continuing at intervals of ~5-20 minutes, producing eruption columns that rose <1 km. The fairly ash-rich plumes were generally carried WSW. For a few minutes after each explosion, fine ash fallout was observed around the summit area. During 3 hours of clear weather on 8 June, one [glowing avalanche] was observed, ~55 minutes after the preceding explosion., 202979=During 5-18 August, volcanic and seismic activity at Semeru remained at higher-than-normal levels. On 6 August a lava avalanche traveled ~750 m E toward Besuk Kembar River. Seismicity consisted of tectonic, explosion, and avalanche earthquakes. Semeru remained at Alert Level 2 (on a scale of 1-4)., 281352=On 4 November 2010, CVGHM reported that from August to October 2010 seismic activity at Semeru had increased, and “smoke” and occasional gas plumes rose 400-500 m above the crater. During September incandescent avalanches traveled 400 m SE into the Besuk Kembar drainage on three occasions. Incandescence from the crater was observed in October. Incandescent avalanches traveled 600 m into Besuk Kembar on 2 November. Two days later, they reached 4 km into the Besuk Kembar and Besuk Bang (S) drainages (figure 18). CVGHM noted that the lava dome in the Jonggring Saloko crater was growing. The Alert Level remained at 2 (on a scale of 1-4)., 88680=Table 3. A summary of aviation reports (Volcanic Ash Advisories) describing Semeru's plumes during 3 June 1998-21 August 2000. The first two columns describe the time and date when a report was issued. Time entries with commas signify that multiple reports were generated with similar comments. Where available, the time of the observations appear with the comment. Dash marks indicate lack of mention in report. Note that for plume heights, Semeru's summit lies at 3,676 m above sea level. Information sources include air reports (for example, routed via airlines, AIREPS), pilot reports (PIREPS), Notice to Airmen (NOTAM), satellite data, and reports from ground observations. Source data was provided by the Darwin VAAC., 172605=10/2003 (BGVN 28:10) Frequent ash explosions continue through October, 247468=Based on visual observations, CVGHM reported that during 18-25 June multiple ash explosions from Semeru produced plumes that rose to an altitude of 4.2 km (13,800 ft) a.s.l. The Alert Level remained at 2 (on a scale of 1-4)., 176430=10/1995 (BGVN 20:10) Explosions and pyroclastic flows continue, 59095=On 31 March two tremor earthquakes occurred with amplitudes of ~3-17 mm. During mid-April, a tremor earthquake occurred with an amplitude of 0.2 mm. Lava avalanches continued to travel up to 750 m down to Besuk Kembar. Seismic signals thought to indicate local floods registered 15-21 April. Incandescence was observed up to 25 m above the crater rim during 1820-2025 on 18 April. During that time, seismicity was dominated by low-frequency earthquakes, with amplitudes of 2-3 mm. During 27 May-2 June ash explosions produced white-gray plumes that reached ~200-400 m above the summit, while lava avalanches traveled ~100 m away. Semeru remained at Alert Level 2 through at least 16 June 2002., 276018=According to Volcano Discovery, an expedition leader visiting Semeru observed frequent explosions every few minutes on 27 March 2012, with many powerful enough to eject glowing bombs that produced small glowing avalanches down the S flank., 149850=Frequent explosions continued through early January from the summit crater., 59905=Table 8. Plumes observed at Semeru during 8 March-16 June 2002. Courtesy VSI., 54249=Table 10. Earthquakes recorded at Semeru during 9 September 2002-1 January 2003. \"*\" indicates that the report was part of a special report issued by VSI and may break the sequence of weekly reports. Courtesy VSI., 116358=A Semeru eruption was mentioned in an aviation alert on 3 August. The alert, which was based on a report from Qantas Airlines, stated that the estimated eruption time was 1500; the column reached ~4,600 m (roughly 900 m above the summit) and was blown W at 22 km/hour. Convective cloud cover prevented the Synoptic Analysis Branch from searching for the plume., 177996=04/1991 (BGVN 16:04) Continued explosions and seismicity, 157467=Frequent explosions and lava extrusion throughout 1985, 169979=Card 1389 (02 May 1972) Review of recent activity since 1967, 195556=VSI reported that as of 5 October volcanic activity at Semeru was at normal levels, with a plume rising ~600 m above the volcano., 173230=04/2003 (BGVN 28:04) Continued ash explosions, with frequent lava avalanches and pyroclastic flows, 170794=Card 1382 (18 April 1972) Lava flows and eruption plume, 180003=10/1987 (SEAN 12:10) Vulcanian activity continues, 79970=During 4-10 April explosions and lava avalanches were still continuing and became stronger. Seismicity also increased significantly; tremor earthquakes took place 56 times, with maximum amplitudes of 3-15 mm. One pyroclastic flow traveled 1,500 m down the Besuk Kembar river. Many observations in clear conditions showed that the ash cloud was thick and white, rising 400-600 m above the summit. Emissions continued the following week, and explosions increased. \"Red flames\" sometimes appeared at the summit during night observations. Similar activity continued throughout April. The number of pyroclastic flows increased in late April, and continued at a typical rate of 2-7 per week for the next few months (table 4). On 30 April at 0743, from a location 15 km NNW of Semeru, a pyroclastic flow was observed travelling 800 m down the SSW flank., 200543=When weather conditions were clear during 8-14 July, lava avalanches were sometimes observed traveling 750 m from Semeru's crater rim E toward Besuk Kembar River. Low-level ash plumes rose above the crater. Seismicity was dominated by 898 explosion earthquakes, while the number of other types of earthquakes decreased. Semeru remained at Alert Level 2 (on a scale of 1-4)., 239255=Eruption plumes from Semeru were visible on satellite imagery on 2 August. They reached a maximum altitude of 5.2 km (17,000 ft) a.s.l., 237437=Eruption plumes from Semeru were visible on satellite imagery on 14 July drifting SE at unknown altitudes. On 17 July plumes reached altitudes of 4.3 km (14,000 ft) a.s.l., 168888=Formation of lava dome that continuously became higher. Growth of this dome is directed W and S. Formation of lava stream in upper branch of river Iglidik and river Sarat. Accompanying avalanches entering rivers Glidik, Sat, Bang, and Sarat (all of them on the S slope) reaching maximum distance ~1.5 km. Number of avalanches reached its peak in months of March 1968, January 1969, and April 1970 Viz. over 40 times within one month. Bigger avalanches caused burning of forest on upper slopes. Also nuee ardente avalanches very often took place on S. slope reaching maximum distance ~4.5 km in river Glidik. Peak number was recorded during months of April and May 1968, viz. over 500 times within one month. Extrusion of lava was accompanied by minor explosions and volcanic tremors., 89330=Ongoing eruptive activity; 27 July explosion causes injuries and two fatalities, 19920=Many ash plumes and some pyroclastic flows during February 2007-March 2009, 91961=The morphology of the crater floor changed considerably after the 1994 and 1995 eruptions. In mid-1996 and 1997 the bottom of Jonggring Seloko Crater was too deep to be visible from the NE crater rim. Observations on 18 September 1999 showed that the floor of the crater had risen several tens of meters and about 2/3 of the crater floor could be clearly seen. No evidence of lava or dome extrusion could be observed because of a thick carapace of pyroclastic ejecta and scree. The floor consists of an irregular platform. The southern part of the platform showed evidence of a recent subsidence event (scalloped normal faulting of ~10 m). The platform contained three principal active vents covered by their own ejecta. The central vent was partly surrounded by a small pyroclastic crescent., 277610=Table 21. Observed Semeru plumes during February-April 2012. Data from CVGHM. (The only other plume noted by the Darwin VAAC between February 2010 and May 2012 was on 18-19 November 2010; this plume was noted earlier in the text). Courtesy of CVGHM., 111090=Typical activity for this volcano was observed by Steve O'Meara on 13 November from the rim of Tengger Caldera. Thick cauliflower-shaped columns of gray ash rose up to 200 m high every 15-20 minutes, and the sky to the SW was spotted with ash clouds from previous eruptions. One event lasted ~5 minutes, generating a dark gray ash cloud that caused ashfall on the S slopes before detaching from the summit. Another eruption cloud spilled over the SW rim and flowed downslope., 162944=Ash emission continued at an average rate of once every 56 minutes in November and December. Ash columns typically rose 500-700 m above the crater rim. Some clouds were less ash-rich, as indicated by a grayish color. Incandescent lava fragments were sometimes visible at night. Strombolian-type eruptions have accompanied the formation of the lava dome since extrusion began in 1967., 187871=The summit of the volcano was covered by clouds during 12-18 March, but the seismic record showed increasing activity. Explosion and avalanche earthquakes still dominated seismicity and increased over the past week. There were 349 explosion earthquakes, an increase over the 303 detected during 6-12 March. The count of explosion earthquakes decreased to 259 the week of 19-26 March. Semeru is at hazard level 2 (on a scale of 1-4)., 162534=Lava avalanches from the dome have usually been contained at about 3 km altitude on the S flank of the volcano, in the upper reaches of the Kembar River, but one traveled farther down the river valley in early December. Before this year's monsoon rains VSI has alerted local authorities to the S and SE of the danger of lahars along the Kembar, Kobokan, Rejali, Sat, and Glidil Rivers., 97946=Due to increased seismicity, officials raised the status to \"Caution\" during the week of 23-29 March. Earlier, during the week of 9-15 March a white-gray ash plume attained heights of 400-500 m and the number of events involving debris flows rose from 6 to 42 (with a maximum run-out of 2 km). In addition, weekly volcanic B-type events increased from 1 to 35, tectonic events went from 9 to 27, and explosions increased from 280 to 385. From 23 to 29 March there were 224 earthquakes related to emissions. In addition there was one volcanic A-type, one volcanic B-type, and 14 events associated with moving debris., 250134=Based on pilot observations, the Darwin VAAC reported that a plume from Semeru rose vertically to an altitude of 6.1 km (20,000 ft) a.s.l. on 21 April., 266486=The Darwin VAAC reported that on 18 October a pilot saw a low-level ash plume from Semeru. Ash was not identified in satellite images., 95267=During the week of 3-9 August white-brown ash emissions rose 600 m above the summit and explosions and avalanches increased in number. At 0410 on 5 August a pilot reported a volcanic ash plume at 6,100 m altitude moving west. During 10-16 August there were eight ash explosions producing columns reaching 500 m above the summit. Five lava avalanches flowed down the Besuk Kembar river valley. Pyroclastic flows and rockfalls moving 2 km down Besuk Kembar river originated from Jonggring Seloko Crater during 18-23 August. Scientists at Sawur Observatory could see lava rockfalls running 400-700 m down Besuk Kembar., 252819=Based on pilot reports and observations of satellite imagery, the Darwin VAAC reported that during 7-9 July ash plumes from Semeru rose to altitudes of 4.9-7.6 km (16,000-25,000 ft) a.s.l. and drifted SSW., 179493=03/1988 (SEAN 13:03) Vulcanian activity continues; clouds to 7.5 km, 219791=A faint ash plume from Semeru was visible on satellite imagery on 13 August, extending ~75 km E of the summit., 257160=Based on analysis of satellite imagery, the Darwin VAAC reported that on 9 September ash plumes from Semeru rose to an altitude of 4.3 km (14,000 ft) a.s.l. and drifted SSW., 133922=Emission of gas plumes, sometimes containing ash, to a maximum height of 600 m continued through early December. The press, citing an unnamed local volcanologist, reported that small explosions occurred as often as every 5 minutes after 4 December. Avalanches extended 500 m downslope from the growing lava dome. Explosion shocks were recorded at rates of 35-110/day, accompanied by 2-10 avalanche events daily. Volcanic tremor was more frequent in November than in October. Although activity was increasing, it remained within the normal range for the eruption . . . ., 268924=PVMBG reported that during 1 January-10 April white and gray plumes were observed rising above Semeru even though inclement weather sometimes prevented visual observations. During January white plumes and nine instances of grayish-white plumes rose 200-500 m above the crater. Seven incandescent avalanches from a lava-flow front traveled at most 300 m down the flank. In February white plumes and 19 instances of grayish-white plumes rose 200-600 m above the crater. Eruption sounds were reported five times. In March white plumes and 21 instances of grayish-white plumes rose 200-500 m above the crater. Nine explosions were heard. During 1-10 April there were 18 instances of grayish-white emissions. Seismicity from 1 January through 10 April fluctuated, and was dominated by emission and explosion signals. The Alert Level remained at 2 (on a scale of 1-4) and the public was reminded not to approach the crater within a 4-km radius., 277050=CVGHM reported that during 1-29 February 2012 multiple pyroclastic flows from Semeru traveled 500 and 2,500 m into the Besuk Kembar and Besuk Kobokan rivers (on the S flank), respectively. Government officials set up an exclusion zone on the SE flank where pyroclastic flows had occurred., 175675=11/1996 (BGVN 21:11) A 2-km-long pyroclastic flow on 7 October; minor ashfall, 234977=According to the Darwin VAAC, a pilot reported that ash plumes from Semeru on 14 June reached altitudes of 6.1 km (20,000 ft) a.s.l. Small ash plumes were detected on satellite imagery on 15, 17, and 18 June., 198915=During 17-23 June, seismic and volcanic activity were higher than normal at Semeru. Lava avalanches were observed traveling 750 m E to the Besuk Kembar River. Seismicity included 670 explosion events. Semeru remained at Alert Level 2 (on a scale of 1-4)., 210080=During 24 February to 2 March, volcanism at Semeru remained at high levels. \"White-gray ash plumes\" were observed rising 300-400 m above the summit. Seismicity was dominated by 629 explosion earthquakes. Semeru remained at Alert Level 2 (on a scale of 1-4)., 215982=Volcanic and seismic activity at Semeru continued at relatively high levels during 12-18 May. Several small ash explosions rose to low levels above the summit. Seismicity was dominated by 730 explosion events. Semeru remained at Alert Level 2 (on a scale of 1-4)., 212501=Seismic and volcanic activity continued at relatively high levels at Semeru during 17-23 March, with \"gray ash plumes\" rising 300-400 m above the summit, and several pyroclastic flows traveling toward Bang River to runout distances of around 500 m. Seismicity was dominated by 563 explosion events. Semeru remained at Alert Level 2 (on a scale of 1-4)., 78561=Observations on 2 May 2000. John Seach and Geoff Mackley made observations during a 3-hour summit stay on 2 May 2000. During the climb from Ranu Pani village in the N, ash deposits were observed to cover vegetation at a distance of 10 km from the volcano. The bottom third of the cone was vegetated, and zones of mass-wasting had sliced away 20- m-wide sections of forest. The top two-thirds of the cone consisted of ash, cinders, and blocks up to 1.5 m in diameter. There were areas of deep erosion and the risk of rockfalls posed a hazard to climbers., 28570=An ash plume from Semeru was reported on 4 June rising to ~ 4.5 km altitude During the week of 7-13 June, a white-gray plume was observed on a clear day rising to heights of 300-400 m above the summit. Seismographs recorded an increasing number of volcanic, tectonic, and tremor earthquakes, and explosion and avalanche signals compared to the previous week. Indeed, that week was the most seismically active on the basis of most parameters, with more than 900 explosion signals and more volcanic earthquakes, tremor, and avalanche signals than any other week (table 16)., 174694=08/1999 (BGVN 24:08) Ash emissions and pyroclastic flows during June-September, 225197=The Darwin VAAC reported that a thin ash plume from Semeru was visible on satellite imagery on 23 May around 0625. The plume reached a height of ~4.3 km a.s.l. and extended ~110 km SSE., 119057=Hazard status raised; mid-July explosion earthquakes, pyroclastic flows, 172797=09/2003 (BGVN 28:09) Frequent ash explosions continue through September, 241209=Based on satellite imagery, the Darwin VAAC issued multiple aviation ash advisories for Semeru during 20-21 September. Plumes were initially reported to be near 11 km (36,000 ft) a.s.l. and drifting SW. The later reports noted a plume at 4.9 km (16,000 ft) a.s.l. extending about 90 km W., 130434=One phase of activity that could not be correlated with the release of steam from any particular fumarole was a rhythmic, puffing sound emitted from the bottom of the crater. The sound was reminiscent of a steam locomotive starting to pull a heavy freight train. The frequency of the \"puffs\" ranged from 1.5 to 0.6 Hz. Sometimes the sound sequence lasted only a short time, with as few as six separate puffs. At other times it continued for more than 3 minutes with >100 puffs. The frequency and duration of the puffs remained relatively constant during each series, no matter how long it lasted. The rhythmic sound was also heard on 23 October at Oro-oro Ombo, ~7 km N of the summit., 93115=The activity at Jonggring Seloko Crater in mid-September 1999 was very similar to that observed in the last recent years at the volcano. It consisted of short-lived non-sustained Vulcanian explosions producing 300-1,000-m-high ash plumes., 280440=According to Volcano Discovery, the group observed 2-3 small-to-medium ash explosions per day during a photo expedition in May 2011, but noted that activity had increased during the past weeks., 156433=Table 1. Monthly numbers of explosions, rockfalls, and nuées ardentes d'avalanche at Semeru, April-December 1985. Explosion and rockfall counts are from seismic records; nuées ardentes are counted from extended rockfall signals on seismic records and from observations from Gunungsawur Observatory at 650 m altitude, 12 km SE of the summit., 178173=03/1991 (BGVN 16:03) Ash emissions; 400-m-long lava flow, 109634=Based on a report from Japan Air Lines, another aviation notice of volcanic ash from Semeru was posted at 0335 on 11 May. The report indicated that ash extended ~300 m above the peak and was moving SE at 18.5 km/hour. Lauda Air reported a low-level ash cloud around 1,300 m altitude on the early morning of 12 May, and a Qantas Airlines flight observed periodic emissions later that evening that did not rise above 6 km altitude. Satellite imagery throughout 5-12 May showed no ash plumes., 44660=Infrared satellite data, January 2001-March 2003. Between January 2001 and March 2003, MODIS detected quasi-continuous thermal alerts at Semeru (figure 15). During January 2001-March 2002, the anomalies were characterized by 1-2 alert-pixels with a maximum alert ratio of -0.567 (4 May 2001). The Darwin VAAC reported ash plumes and clouds on several occasions throughout this period, and VSI reported numerous seismic events representing explosions and other phenomena (BGVN 26:08)., 177625=10/1992 (BGVN 17:10) Frequent explosions eject 1-km clouds; summit morphology described, 38334=Volcanic activity at Semeru between 30 June and 28 September remained at high levels. Except for the middle two weeks of July, ash explosions were reported several times every week, producing white-gray plumes that rose 400-500 m above the summit. Recorded seismic data (table 13) reflected this continued activity, with between 447 and 804 explosion events weekly (~ 88 per day on average over this 90-day period). Avalanche events, tremor, tectonic, deep-volcanic, shallow-volcanic, and flood-related seismicity were also recorded. A pilot report from Qantas noted a plume to twice the height of the volcano (~ 7.2 km altitude) on 9 September that was drifting S. The hazard status remained at Alert Level 2 throughout the report period., 167454=Recent activity of Mt. Semeru is considered not dangerous yet. At end of first quarter of 1972 activity is slightly decreasing. To face any possibility of acceleration of volcanic activity in near future, in 1970 \"Danger Zone Map\" of Mt. Semeru was submitted to local authorities to be used as guidance for eventual evacuation of inhabitants when the situation becomes critical., 99066=Satellite imagery revealed an ash cloud at a height of ~8.5 km near Semeru on 16 October. Winds at the level of the ash cloud were from the W to NW at 27-37 km/hour. On 22 October another small ash signature originating from Semeru was observed on satellite imagery. The plume was ~46 km long, ~18.5 km wide, and extended to the WNW. The height of the plume was below 7.3 km. On 9 November a volcanic cloud with a top at 4,200 m was reported; the cloud was drifting SW., 203782=On 8 September at 1947 an ash explosion at Semeru was accompanied by ejected incandescent material. The material traveled 150 m E to the upper portion of the Kembar River. During 2-8 September, seismicity was dominated by explosion earthquakes. Semeru remained at Alert Level 2 (on a scale of 1-4)., 284228=Semeru is one of the most active volcanoes worldwide and is of special concern because the drainage area is heavily populated. The volcano has a steep canyon that extends from the summit to the SE, which has funneled pyroclastic flows and lahars into populated areas. The decades-long seismicity from Semeru has typically included mildly explosive Strombolian style eruptions, earthquakes and tremor, ash plumes, and occasional pyroclastic flows (BGVN 32:03, 34:05, and 35:08). See the location of Semeru with respect to the regional setting in figure 17., 49763=At Semeru, the end of December 2002 was characterized by high numbers of explosions and pyroclastic flows (BGVN 27:12). The 29 December pyroclastic flow at Besuk Bang (figures 11 and 12) traveled ~9 km from the summit. During January through 23 March 2003, the Volcanological Survey of Indonesia (VSI) reported that seismicity was dominated by explosions and avalanches (table 11). A \"white-gray ash\" column rose 300-700 m above the summit. Activity was especially high during 1-12 January, when tens of ash explosions were visually observed per week (figures 13 and 14). Continuous tremor occurred on 8 January, with an amplitude of 11-12 mm. The Alert level remained at 2., 105791=Semeru, the highest peak on Java, has frequent pyroclastic flows, lahars, and lava flows. Since 1967, many Vulcanian eruptions have accompanied lava dome extrusion., 114527=Earthquakes associated with the pyroclastic flows were variable, with 1-16 events/day through early October; after that the frequency of earthquakes decreased. Increasing numbers of volcanic earthquakes (both A-and B-type) started on 11 October and continued until the end of the month, fluctuating at 1-14 events/day (figure 8). The number of explosion earthquakes was typically 45-109/day (figure 06sem08f), except on 26 and 27 September, when there were only 33 and 24 events, respectively., 94200=Pyroclastic flows and rockfalls, with moderate ash emissions, continued in September. An ash explosion during the week 14-20 September produced thick dull-white to dark-colored ash that reached 500 m above the summit., 103378=Activity observed during fieldwork in July 1997 consisted of frequent short-lived Vulcanian explosions. Continuous crater observations were made over more than 5 hours on the morning of 22 July from the Gunung Sawur observatory, 11 km SSE of the volcano. During that time 18 \"cannon-like\" explosions were each followed by rapidly declining ash emission at intervals of 2-40 minutes with a mean of 18 minutes. Explosion durations ranged from about 1 to 3.5 minutes; plume heights remained low, from a few hundred meters up to 1.5 km maximum. The plumes were blown by the wind as soon as they rose above the crater rim, except for the strongest explosions. Ash sometimes fell at the observatory. Blocks were occasionally seen rolling within the S-SW breach of the crater and glowing pyroclastic material was seen at night. The explosions could be heard 9 km from the crater but not from the observatory. Some explosions were accompanied by base surges, but they were limited to the interior of the crater., 171831=05/2009 (BGVN 34:05) Many ash plumes and some pyroclastic flows during February 2007-March 2009, 249498=Based on reports from CVGHM, the Darwin VAAC reported that an unconfirmed eruption from Semeru was heard from 17 km away on 31 October. An eruption plume was not detected on satellite imagery., 71798=The Darwin Volcanic Ash Advisory Center (VAAC) reported volcanic ash plumes and clouds on several occasions throughout the year (table 5). The plumes ranged from ~4.6 to ~11.6 km altitude, and moved mainly SSE. On 8 July at 1503 a SE-drifting ash plume rose to ~2.5 km above the volcano. Ground-based reports prior to the eruption revealed that each day during 18-24 June Semeru emitted ash to ~0.6 km above the volcano., 166472=The eruption that began on 31 August 1967 continued with ejection of ash and nuées ardentes, and growth of the lava dome., 201452=When weather conditions were clear during 15-21 July, lava avalanches were observed traveling ~750 m from Semeru's crater rim E toward Besuk Kembar River. Explosions produced ash plumes reaching 300-500 m above the crater. Seismicity was dominated by 670 explosion earthquakes, while the number of other types of earthquakes decreased in comparison to the previous week. Semeru remained at Alert Level 2 (on a scale of 1-4)., 101397=Aviation warnings. Volcanic ash advisories for Semeru have been issued frequently since March (BGVN 22:06) At least two such advisories were issued during August after aviators for Qantas Airlines reported ash plumes. On 10 August a Qantas flight flying from Sydney to Singapore reported a plume between 7.6 and 9.1 km (25-30,000 feet) altitude that was drifting S near its base and N at its top. Another plume was seen on 30 August to 8.5 km (28,000 feet) altitude. No evidence of volcanic plumes was seen on either day in satellite imagery., 158137=On 4 August, Space Shuttle astronauts [Mission STS51-F] observed a plume extending 100 km W of the summit., 236806=According to the Darwin VAAC, an ash plume from Semeru reached a maximum altitude of 5.5 km (18,000 ft) a.s.l. on 10 July. The plume was visible on satellite imagery., 149262=Minor explosions continued through February., 112121=The frequency of volcanic earthquakes (both A- and B- types) during the November- December period ranged from 1 to 10 events/day. Volcanic tremor was recorded on 1, 2, 17, and 18 November; tremor from 15 to 18 December increased to 3-8 events/day (figure 9). Explosion earthquakes were variable (31-136 events/day), with two minima on 5 and 25 December (24 and 19 events/day, respectively) (figure 9)., 189562=There was a significant increase in the number of earthquakes detected at Semeru during 2-9 April following a decrease in volcanic activity during the previous several weeks. Seismographs recorded 28 deep volcanic earthquakes, 305 explosion events, 248 avalanche events, and 3 tectonic earthquakes. Cloudy conditions prohibited visual observations. Semeru remained at Alert Level 2 (on a scale of 1-4)., 79087=Ashfall occurred at the Semeru Volcano Observatory during the week of 2-8 May, when five pyroclastic flows were recorded. Seismicity decreased again, but \"red flame\" was still seen at night and plumes rose as high as 600 m through 23 May., 172221=06/2004 (BGVN 29:06) Persistent seismicity and ash plumes during April-June 2004, 181793=09/1986 (SEAN 11:09) Frequent summit Vulcanian explosions continue, 206817=Volcanic and seismic activity were relatively high at Semeru during 17-30 December. During the report period the most notable seismically recorded events were 1,085 explosions, 49 lava avalanches, 6 pyroclastic flows, and 3 floods/lahars. Explosions sent ash plumes to 400 m above Jonggring Seloko crater. On 25 December a pyroclastic flow traveled 2.5 km into the Besuk Kembar River. On 29 December during 1700-2015, a lahar traveled along the Besuk Kembar River relatively close to Supit village. Early that morning the residents of Supit were evacuated. On 30 December pyroclastic flows traveled 2 km toward the Besuk Kembar River at 0720, and at 1000 one traveled 4 km toward Supit village. The Alert Level at Semeru remained at 2 (on a scale of 1-4)., 71351=Table 5. Summary of Volcanic Ash Advisories from the Darwin VAAC issued between August 2000 and August 2001. Note that heights are given in altitude. Semeru's summit lies at 3,767 m above sea level. Information sources include air reports (for example, routed via airlines, AIREPS), pilot reports (PIREPS), satellite data, and reports from ground observations), and information from the Meteorological and Geophysical Agency of Indonesia. Source date was provided by the Darwin VAAC., 263666=Based on analysis of satellite imagery, the Darwin VAAC reported that during 18-19 November ash plumes from Semeru rose to an altitude of 4.3 km (14,000 ft) a.s.l. and drifted 75-110 N and NW. Sulfur dioxide gas concentrations were detected 75 km SW., 127243=On 3 February, VSI observers and local residents near Semeru heard a sharp thunder-clap at 0350 and later saw falling ash. Lava avalanches and pyroclastic flows from the summit crater descended SE along the Kembar and Kobokan rivers, reaching 7.5 km and 11.5 km from the summit, respectively. Volcanic materials also entered Sumbersari village (8 km SE of the summit), located between the rivers. Four people were killed; another three were injured, and two of those later died. Following the lava avalanches and pyroclastic flows, 275 people were evacuated from Sumbersari, where many houses and 1.5 km2 of plantation land were destroyed. A seismic station maintained by VSI was also destroyed., 35422=Frequent ash explosions at Semeru during 29 September-26 October 2003 produced white-gray ash plumes 400-500 m over the summit. The hazard status remained at Alert Level 2 (on a scale of 1-4) during this time. Although tectonic earthquakes, tremor events, shallow volcanic earthquakes, and avalanches were all detected seismically, the record was dominated by explosions (table 14). Explosions over this 4-week period averaged 95 per day, or one every 15 minutes., 30308=Table 16. Summary of seismicity at Semeru during 12 April-4 July 2004. The highest values in several categories occured during 7-13 June. Courtesy of VSI., 34932=Table 14. Seismicity at Semeru, 29 September-26 October 2003. Four shallow volcanic earthquakes were also detected during 6-12 October. Courtesy of VSI., 181258=02/1987 (SEAN 12:02) Minor explosions continue, 228591=A pilot reported to the Darwin VAAC that on 10 August ash from Semeru was at a height of ~6.1 km a.s.l. According to a news article, people were temporarily banned from climbing the volcano., 232463=Based on information from a significant meteorological forecast (SIGMET), the Darwin VAAC reported that on 22 April an eruption at Semeru generated a plume that rose to ~4 km (13,000 ft) a.s.l. Ash was not visible on satellite imagery., 980=Information Contacts: Center of Volcanology and Geological Hazard Mitigation (CVGHM), Jalan Diponegoro 57, Bandung 40122, Indonesia (URL: http://www.vsi.esdm.go.id/); Volcano Disaster Assistance Program (VDAP), US Geological Survey (USGS), 1300 SE Cardinal Court, Bldg. 10, Suite 100, Vancouver, WA 98683; Darwin Volcanic Ash Advisory Centre (VAAC), Bureau of Meteorology, Northern Territory Regional Office, PO Box 40050, Casuarina, NT 0811, Australia (URL: http://www.bom.gov.au/info/vaac); Jakarta Globe (URL: http://www.thejakartaglobe.com); Peopleâ\u0080\u0099s Daily Online (URL: english.peopledaily.com; Volcano Discovery (URL: http://mobile.volcanodiscovery.com)., 178944=07/1988 (SEAN 13:07) Vulcanian activity persists, 12441=Regarding tremor and explosion eruptions in June 2009 (table 19), there were fewer than 15 eruptive earthquakes/tremor events per day. The average during May and June 2009 was much less than average daily number of earthquakes during January 2009., 183978=11/1976 (NSEB 01:14) Ejection of ash and nuées ardentes; lava dome growth, 14882=From January to mid-February 2009, explosion earthquakes occurred on average 100-150 times a day (table 18). Ash and cinder eruptions from Jonggring Saloko crater took place daily every 15-20 minutes, with plumes reaching altitudes of 3.7-4.3 km. During a ~ 5 minute interval on 6 March 2009 at 0010, a loud boom was followed by a bluish flash of lightning 5-7 seconds in duration., 257783=Based on analysis of satellite imagery, the Darwin VAAC reported that on 10 September a plume from Semeru rose to an altitude of 4.3 km (14,000 ft) a.s.l., 121839=A NOTAM issued from the Bali Flight Information Region (FIR) on 24 October noted volcanic ash from Semeru, but the cloud top and drift direction were unknown., 177035=10/1994 (BGVN 19:10) Normal mild explosive activity in August; slow lava extrusion, 169857=Recent activity is a continuation of renewed activity which started August 1967 and lasted intermittently up to present. Renewed activity in 1967 was initiated by continuous emission of smoke from \"1963-vent.\" At lower end of ~4-km-long \"1963-Lava stream\" in upper branch of river Glidik (S slope) solfataras emitting a bluish-white smoke were visible. Towards end of August glares were observed and hissing sounds were heard. In beginning of September lava was extruded and formed lava stream in direction of river Sarat (S slope) accompanied by continuous tremors (recorded by mechanical seismographs at Tawonsongo Observatory 1-15 September, and at Argosuko Observatory 2-4 September). This lava sttream attained length of ~1,700 m (September 1967). In following period (during 1968, 1969, 1970, 1971, and the first quarter of 1972) activity still continued [with extrusion of \"Lava 1967\" as described below]., 267487=PVMBG reported that during 1 March-27 April white-and-gray plumes rose 100-400 m above Semeruâ\u0080\u0099s Jongring Seloko crater and drifted W; during April eight â\u0080\u009ceruptionâ\u0080\u009d plumes rose 300-500 m. On 26 April at 1852 and 1934, and on 27 April at 0500, incandescent rockslides from the lava dome traveled as far as 300 m down the S flank. As of 28 April the Alert Level remained at 2 (on a scale of 1-4) and the public was reminded not to approach the crater within a 4-km radius., 207659=Relatively high volcanic and seismic activity continued at Semeru during 1-12 January. Several explosions sent ash columns to 700 m above the crater. Lava avalanches sent material up to 750 m from the crater rim and a pyroclastic flow traveled 1.5 km E to the Besuk Kembar River. Semeru remained at Alert Level 2 (on a scale of 1-4)., 150512=Frequent Vulcanian explosions continued through October from the summit crater., 279305=CVGHM reported that on 29 December 2011, both earthquakes and tremor increased, and dense white-and-gray plumes rose as high as 600 m above the active crater. During January 2012, crater incandescence was observed, and avalanches carried incandescent material 200-400 m away from the crater. According to a 4 January 2012 article in the Jakara Globe, a government official indicated that authorities had closed the trail to the peak of Semeru because of heavy rain and an increased danger of landslides., 192802=Based on information from pilot reports and the Meteorological and Geophysical Agency of Indonesia, the Darwin VAAC reported that on 8 July at 1503 a SE-drifting ash plume rose to ~2.5 km above the volcano. Ground based reports prior to the eruption revealed that each day during 18-24 June Semeru emitted ash to ~0.6 km above the volcano.}",
    "TableContextTimeStampAfterTable": "{3423=Mulyadi E, Zaennudin, Wahyudin D, Dana I N, 2000. Guide book for field excursion at Lamongan, Semeru, Bromo-Tengger volcanic complex, East Java, 13-17 July 2000. IAVCEI General Assembly, Bali 2000 Excursion Guide, 28 p., 4005=Suryo I, 1986. G Semeru. Bull Volc Surv Indonesia, 111: 1-52 (in Indonesian)., 3658=Neumann van Padang M, 1951. Indonesia. Catalog of Active Volcanoes of the World and Solfatara Fields, Rome: IAVCEI, 1: 1-271., 4098=Thouret J-C, Lavigne F, Suwa H, Sukatja-Surono B, 2007. Volcanic hazards at Mount Semeru, East Java (Indonesia), with emphasis on lahars. Bull Volc, 70: 221-244., 1817=Semeru, the highest volcano on Java, and one of its most active, lies at the southern end of a volcanic massif extending north to the Tengger caldera. The steep-sided volcano, also referred to as Mahameru (Great Mountain), rises abruptly to 3676 m above coastal plains to the south. Gunung Semeru was constructed south of the overlapping Ajek-ajek and Jambangan calderas. A line of lake-filled maars was constructed along a N-S trend cutting through the summit, and cinder cones and lava domes occupy the eastern and NE flanks. Summit topography is complicated by the shifting of craters from NW to SE. Frequent 19th and 20th century eruptions were dominated by small-to-moderate explosions from the summit crater, with occasional lava flows and larger explosive eruptions accompanied by pyroclastic flows that have reached the lower flanks of the volcano. Semeru has been in almost continuous eruption since 1967., 3799=Siswowidjoyo S, Sudarsono U, Wirakusumah A D, 1995. The threat of hazards in Semeru volcano, East Java, Indonesia. Eight Regional Conf GEOSEA '95, Manilla, Philippines, 14-18 Feb 1995, 17 p., 4275=van Bemmelen R W, 1937. The volcano-tectonic structure of the residency of Malang (eastern Java). Ing Ned-Indie, 4: 159-172., 3028=Carn S A, 1999. Application of synthetic aperture radar (SAR) imagery to volcano mapping in the humid tropics: a case study in East Java, Indonesia. Bull Volc, 61: 92-105., 3215=Carn S A, Pyle D M, 2001. Petrology and geochemistry of the Lamongan volcanic field, east Java, Indonesia: primitive Sunda arc magmas in a extensional tectonic setting?. J Petr, 42: 1643-1683., 4415=Wahyudin D, 1990. Volcanology and petrology of Mt. Semeru volcanic complex, East Java - Indonesia. Unpublished undergraduate thesis, Victoria University of Wellington, 131 p.}",
    "textBeforeTable": "Summary of Holocene eruption dates and Volcanic Explosivity Indices (VEI). Eruptive History The following references have all been used during the compilation of data for this volcano, it is not a comprehensive bibliography. Carn S A, 1999. Application of synthetic aperture radar (SAR) imagery to volcano mapping in the humid tropics: a case study in East Java, Indonesia. Bull Volc, 61: 92-105. Carn S A, Pyle D M, 2001. Petrology and geochemistry of the Lamongan volcanic field, east Java, Indonesia: primitive Sunda arc magmas in a extensional tectonic setting?. J Petr, 42: 1643-1683. Mulyadi E, Zaennudin, Wahyudin D, Dana I N, 2000. Guide book for field excursion at Lamongan, Semeru, Bromo-Tengger volcanic complex, East Java, 13-17 July 2000. IAVCEI General Assembly, Bali 2000 Excursion Guide, 28 p. Neumann van Padang M, 1951. Indonesia. Catalog of Active Volcanoes of the World and Solfatara Fields, Rome: IAVCEI, 1: 1-271. Siswowidjoyo S, Sudarsono U, Wirakusumah A D, 1995. The threat of hazards in Semeru volcano, East Java, Indonesia. Eight Regional Conf GEOSEA '95, Manilla, Philippines, 14-18 Feb 1995, 17 p. Suryo I, 1986. G Semeru. Bull Volc Surv Indonesia, 111: 1-52 (in Indonesian). Thouret J-C, Lavigne F, Suwa H, Sukatja-Surono B, 2007. Volcanic hazards at Mount Semeru, East Java (Indonesia), with emphasis on lahars. Bull Volc, 70: 221-244. van Bemmelen R W, 1937. The volcano-tectonic structure of the residency of Malang",
    "textAfterTable": "This compilation of synonyms and subsidiary features may not be comprehensive. Features are organized into four major categories: Cones, Craters, Domes, and Thermal Features. Synonyms of features appear indented below the primary name. In some cases additional feature type, elevation, or location details are provided. Synonyms Mahameru | Semeroe | Smeroe | Smiroe | Smeru Cones Feature Name Feature Type Elevation Latitude Longitude Kepolo, Gunung     Kepala, Gunung Stratovolcano 3035 m 8° 6' 0\" S 112° 56' 0\" E Kukusan Cone Leker Cone Papak, Gunung Cone Totogan Malang Cone Craters Feature Name Feature Type Elevation Latitude Longitude Ajek-Ajek Caldera Darungan, Ranu     Daroegan, Ranoe Maar Jambangan     Djembangan Caldera Jonggring Seloko     Djonggring Seloko Crater 3643 m Kemmerling Crater Kumbolo, Ranu Maar Pakis, Ranu Maar",
    "hasKeyColumn": true,
    "keyColumnIndex": 1,
    "headerRowIndex": 0
}