{
    "relation": [
        [
            "Postage and handling",
            "GBP 9.95",
            "GBP 12.95"
        ],
        [
            "To",
            "United States",
            "United States"
        ],
        [
            "Service",
            "Standard Int'l Postage",
            "Royal Mail International Signed"
        ],
        [
            "Delivery*",
            "Estimated between Mon. 10 Aug. and Fri. 14 Aug. Seller ships within 1 day after receiving cleared payment - opens in a new window or tab.",
            "Estimated between Tue. 11 Aug. and Wed. 19 Aug. Seller ships within 1 day after receiving cleared payment - opens in a new window or tab."
        ]
    ],
    "pageTitle": "NEW Adidas Supernova Glide 3M Orange Mens Running Shoes ALL Sizes G42899 | eBay",
    "title": "",
    "url": "http://www.ebay.com.au/itm/New-Adidas-Supernova-Glide-3M-Orange-Mens-Running-Shoes-ALL-SIZES-G42899/111297263410?_trkparms=aid%3D222006%26algo%3DSIC.FITP%26ao%3D1%26asc%3D20140107090050%26meid%3D5442133774079612636%26pid%3D100011%26prg%3D20140107090050%26rk%3D2%26rkt%3D10%26sd%3D290886193353",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989891.18/warc/CC-MAIN-20150728002309-00326-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 423030951,
    "recordOffset": 422983430,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{66635=Product: New Adidas Supernova Glide 3M Orange Mens Running Shoes ALL SIZES G42899, 68395=Condition: New RRP: £90.00 Product code: G42899}",
    "textBeforeTable": "Please enter five or nine numbers for the postcode. Please enter a valid postcode. Postcode: Select a valid country. There are 5 items available. Please enter a number less than or equal to 5. -Select- Afghanistan Albania Andorra Anguilla Antigua and Barbuda Argentina Armenia Aruba Australia Austria Azerbaijan Republic Bahamas Bahrain Bangladesh Barbados Belarus Belgium Belize Bermuda Bhutan Bolivia Bosnia and Herzegovina Brazil British Virgin Islands Brunei Darussalam Bulgaria Cambodia Canada Cayman Islands Chile China Colombia Costa Rica Croatia, Republic of Cyprus Czech Republic Denmark Dominica Dominican Republic Ecuador El Salvador Estonia Falkland Islands (Islas Malvinas) Finland France French Guiana Georgia Germany Gibraltar Greece Greenland",
    "textAfterTable": "* Estimated delivery dates- opens in a new window or tab include seller's handling time, origin ZIP Code, destination ZIP Code and time of acceptance and will depend on shipping service selected and receipt of cleared payment- opens in a new window or tab. Delivery times may vary, especially during peak periods. Domestic handling time Will usually post within 1 business day of receiving cleared payment - opens in a new window or tab. VAT price: 20.0% (included in the listed price). If you have questions about this VAT tax, please contact the seller. The actual VAT requirements and rates may vary depending on the final sale. Payment details Payment method Preferred/Accepted  ",
    "hasKeyColumn": true,
    "keyColumnIndex": 2,
    "headerRowIndex": 0
}