{
    "relation": [
        [
            "Property",
            "Properties in componentType",
            "MoveType",
            "Properties in the copy configGroup:",
            "IntradocDir",
            "WeblayoutDir",
            "VaultDir",
            "UserProfilesDir",
            "HttpServerAddress",
            "SocketHostAddressSecurityFilter",
            "Properties in the init configGroup:",
            "HttpServerAddress",
            "SocketHostAddressSecurityFilter"
        ],
        [
            "Description",
            "The componentType is Webcenter Content - Records, Content Server, or Inbound Refinery.",
            "The flag indicating whether to copy the entire test system instance, including configuration and data, or to create a new content server instance, based on the test system configuration. Valid values are copy and init. This property is not applicable to Inbound Refinery.",
            "Copy the configuration and data",
            "The path to the Intradoc directory. The directory value can begin with the string {domainHome} which will be substituted with the path of the domain home directory on the target system.",
            "The path to the Weblayout directory. The directory value can begin with the string {domainHome} which will be substituted with the path of the domain home directory on the target system. This property may not be present if the WebLayoutDir is located in the default location, under the Intradoc directory.",
            "The absolute path to the Vault directory. The directory value can begin with the string {domainHome} which will be substituted with the path of the domain home directory on the target system. This property may not be present if the VaultDir is located in the default location, under the Intradoc directory.",
            "The absolute path to the user profiles directory. The directory value can begin with the string {domainHome} which will be substituted with the path of the domain home directory on the target system. This property may not be present if it is located in the default location, under the Intradoc directory.",
            "The host name and port for the Content Server. This property is used to generate URLs that refer to Content Server.",
            "The security filter which lists the hosts that are allowed to directly access the server port. You can specify multiple values by separating them with a vertical bar (|).",
            "Create a new instance with the configuration of the source.",
            "The host name and port for the Content Server. This property is used to generate URLs that refer to Content Server",
            "The security filter which lists the hosts that are allowed to directly access the server port. You can specify multiple values by separating them with a vertical bar (|)."
        ],
        [
            "Sample Value",
            "",
            "copy",
            "",
            "/scratch/mw_home1/user_projects/domains/domain_name/ucm/cs or {domainHome}/ucm/cs",
            "/scratch/mw_home1/user_projects/domains/domain_name/ucm/cs/weblayout or {domainHome}/ucm/cs/weblayout",
            "/scratch/mw_home1/user_projects/domains/domain_name/ucm/cs/vault or {domainHome}/ucm/cs/vault",
            "/scratch/mw_home1/user_projects/domains/domain_name/ucm/cs/data/users/profiles or {domainHome}/ucm/cs/users/profiles",
            "example.com:16200",
            "127.0.0.1|0.0.0.0.0.0.0.1",
            "",
            "example.com:16200",
            "127.0.0.1|0.0.0.0.0.0.0.1"
        ]
    ],
    "pageTitle": "Using the Movement Scripts",
    "title": "",
    "url": "http://docs.oracle.com/cd/E23943_01/core.1111/e10105/clone.htm",
    "hasHeader": true,
    "headerPosition": "MIXED",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042992543.60/warc/CC-MAIN-20150728002312-00048-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 77610519,
    "recordOffset": 77567663,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{6877=Section 20.3.1.12, 5759=Section 20.3.1.10, 97975=Many move plan properties require that you provide the location of a file containing a password. If you want to use obfuscated passwords, you can use the obfuscatePassword script, as described in Section 20.3.1.12., 6320=Section 20.3.1.11, 8493=The host must have JDK 1.6.04 or higher installed. In addition, ensure that the PATH, CLASSPATH, and JAVA_HOME environment variables point to the JDK.}",
    "lastModified": "Wed, 13 May 2015 05:20:41 GMT",
    "textBeforeTable": "Table 20-26 Move Plan Properties for WebCenter Content Server, Records, and Inbound Refinery Table 20-26 describes the move plan properties that you can change for Oracle WebCenter Content Server, Oracle WebCenter Content: Records, and Oracle WebCenter Content: Inbound Refinery. You must edit the properties for each component under the appropriate componentType. http://example.com:9704/analytics   The URL corresponding to the action name. Note that there may be more than one name/value pair.   alias_name       Action Framework configuration   Property in the location-alias configGroup:      Sample Value Description Property   Table 20-25 Move Plan Properties for Oracle BI Action Framework  Table 20-25 describes the move plan properties that you can change for Oracle BI Action Framework.         10218   The SSL port (if configured for SSL) where the Web application is running.   SSL_Port    10217",
    "textAfterTable": "Table 20-27 describes the move plan properties that you can change for Oracle WebCenter Content: Imaging. Table 20-27 Move Plan Properties for Oracle WebCenter Content: Imaging Property Description Sample Value AdminUser Administrative user ID used during the pasteConfig operation to seed system security. If left blank, the domain administrator user provided on the pasteConfig command line is used. This property should be used for situations where the Imaging administrative user must be a user other than the domain administrator.  Admin2 Properties in the MBean Settings configGroup: MBeans configuration   InputAgentInputDirectories A comma-separated list of directories where input sources look for work.  IPM/InputAgent/Input InputSampleDirectory The directory that holds the sample data for the input UI.  IPM/InputAgent/Input/Sample RenderGDFontPath Location of the",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}