{
    "relation": [
        [
            "Patent application number",
            "20120008326",
            "20120235121"
        ],
        [
            "Description",
            "Lighting Device Capable of Reducing the Phenomenon of Melatonin Suppression - According to research, it found that blue light may cause significant effects on suppressing melatonin. For this reason, a lighting device capable of reducing the phenomenon of melatonin suppression is disclosed in the present invention, the lighting device comprises: a light-emitting device being able to emit a visible light; and a light-filtering device being close to the light-emitting device, wherein when the light-emitting device emits the visible light, the light-filtering device is able to filter a blue light component of the visible light, so as to reduce the blue light component within the visible light emitted by the light-emitting device, then the effects on suppressing the melatonin caused by the visible light are reduced.",
            "ORGANIC LIGHT EMITTING DEVICE AND METHOD FOR FORMING THE SAME - According to an embodiment of the disclosure, an organic light emitting device is provided, which includes: an inflexible tube comprising an external surface and an internal surface; a transparent conductive layer on the internal surface of the inflexible tube; an organic light emitting layer disposed in the inflexible tube and on the transparent conductive layer; and a conductive layer disposed in the inflexible tube and on the organic light emitting layer. According to an embodiment of the disclosure, a method for forming an organic light emitting device is also provided."
        ],
        [
            "Published",
            "01-12-2012",
            "09-20-2012"
        ]
    ],
    "pageTitle": "Jou, TW - Patent applications",
    "title": "",
    "url": "http://www.faqs.org/patents/inventor/jou-tw-5/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042992543.60/warc/CC-MAIN-20150728002312-00259-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 448272563,
    "recordOffset": 448226748,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Jwo-Huei Jou, Taipei City TW //]]> BarDraw('3115552',['Patent applications by Jwo-Huei Jou, Hsinchu TW'],[[1,1,2,4,2,3,1]],['2007','2008','2010','2011','2012','2014','2015'],0); // <script type=\"text/javascript\"> </div> <div id=\"legend3115552\" align=\"center\"></div> </div> <canvas id=\"bg3115552\" style=\"max-width: 500px; width: 100%;\"></canvas> <div> <p align=\"center\">Patent applications by Jwo-Huei Jou, Hsinchu TW</p> <div class=\"bar3115552\" style=\"max-width: 500px; width: 100%; float:left; \"> <div align=\"left\" style=\"padding-top:20px;\"> </table> </tbody> </tr> <td>03-12-2015</td> <td><a href=\"/patents/app/20150070701\">Light Quality Evaluating Device</a> - The present invention relates to a light quality evaluating device, comprising a light receiving unit, first processing unit, a memory unit, a second processing unit, a display unit, and a power management unit, and being used for evaluating the light quality light based on physiological perception of human. In evaluating operation, it transfers a power spectrum of the light emitted from a light source to a luminance spectrum of light through a luminosity function. Next, the method compares the luminance spectrum of light with a corresponding luminance spectrum of blackbody radiation thereof. Therefore, an index of spectral resemblance with respect to the black body radiation (SR</td> <td>20150070701</td> <tr> </tr> <td>10-23-2014</td> <td><a href=\"/patents/app/20140313512\">Light Source Quality Evaluating Method by Using Spectral Resemblance With Respect to the Blackbody Radiation</a> - The present invention relates to a light source quality evaluating method by using spectral resemblance with respect to the blackbody radiation, which mainly comprises 5 method steps. This method is used for evaluating the quality of light based on physiological perception of human. In evaluating operation, the method firstly transfers a power spectrum of a light source to a luminance spectrum",
    "textAfterTable": "Jwo-Huei Jou, Hsinchu City TW Patent application number Description Published 20110183454 Method for preparing OLED by imprinting process - A method for preparing an OLED by an imprinting process is disclosed, which comprises the following steps: (A) providing a substrate, and a first electrode is formed thereon; (B) coating a mold with a first organic material ink; (C) pressing the mold coated with the first organic material ink on the substrate to transfer the first organic material ink onto the first electrode of the substrate, to obtain a first light-emitting array; (D) baking the substrate having the first light-emitting array formed thereon; and (E) forming a second electrode on the first light-emitting array. 07-28-2011 20130100981 SYSTEM AND METHOD OF DETECTING SUBLIMATION POINT - The present invention provides a system and a method of detecting a sublimation point, preferably applied to organic molecules. The system of detecting a sublimation point comprises: a heater, a capillary device, a vacuum pump, an ultraviolet light source, a photography device, a digital vacuum meter and a needle valve. The system of detecting a sublimation point is suitable for detecting the sublimation point of an organic light emitting molecule such as tris(8-hydroxyquinolinato) aluminum (Alq 04-25-2013 Jwo-Huei Jou, Taipei TW Patent application number Description Published 20100300520 PHOTOVOLTAIC CELL HAVING NANODOTS AND METHOD FOR FORMING THE SAME - The present invention provides a photovoltaic cell",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}