{
    "relation": [
        [
            "Cart Icon",
            "Read Notice",
            "Add to Cart"
        ],
        [
            "Activity",
            "342101-01",
            "342101-02"
        ],
        [
            "Description",
            "Hip Hop I",
            "Hip Hop I"
        ],
        [
            "Dates",
            "07/21/15- 08/18/15",
            "08/25/15- 09/22/15"
        ],
        [
            "Times",
            "5:45P- 6:30P",
            "5:45P- 6:30P"
        ],
        [
            "Fees",
            "$65/$72",
            "$65/$72"
        ],
        [
            "Single Icon",
            "Item Details",
            "Item Details"
        ],
        [
            "Status",
            "Unavailable",
            "Available"
        ],
        [
            "Share",
            "Share Facebook Twitter Pinterest Email",
            "Share Facebook Twitter Pinterest Email"
        ]
    ],
    "pageTitle": "WebTrac Activity Search",
    "title": "",
    "url": "https://www.folsom.ca.us/wbwsc/webtrac.wsc/wbsearch.html?wbsi=a2c21c32-75f2-a2ac-e411-ff22e51d972d&xxmod=AR&xxcategory=YOUTH&xxcategory=2-6YOxxtype=SPORT",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042992543.60/warc/CC-MAIN-20150728002312-00116-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 912550675,
    "recordOffset": 912518203,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{11062=Recreational Youth Volleyball League with Aspire Volleyball Club The purpose of our Recreational league is to provide boys and girls, grades 4th-9th, with an opportunity to learn the basic skills of volleyball. We teach the fundamental skills of passing, setting, serving, rotation, rules, and encourage 3 contacts on each play. This is a recreational league, ideal for players looking to have fun and play in local recreational league. Teams will play a weekly game as part of their practice time on Fridays. Standings will be reported during the season and on March 13 we will hold a Tournament of Champions at the Folsom Sports Complex. Rules are modified to assist in the learning process. 1 Practice/Game shirt included Competitive team tryouts are in November, see the aspire-volleyball.com website for more information. Tryouts are not required for Development teams all players are guaranteed to make a team (space limited). Player evaluations will take place the first week of practices., 182825=SKYHAWKS MINI-HAWK CAMP (SOCCER, BASEBALL, BASKETBALL) w/ Skyhawks Academy This multi-sport program was developed to give children a positive first step into athletics. The essentials of baseball, basketball and soccer are taught in a safe, structured environment with lots of encouragement and a big focus on fun.Through games and activities, campers explore balance, hand/eye coordination, and skill development at their own pace. All participants receive a t-shirt, ball and player evaluation. Participant-to-coach ratio is 8:1. Ages 4-7, 162235=Improve your strokes on the court and enjoy strokes at the pool! Join our tennis pro, Bryan Solem and his staff for three hours of tennis instruction at Ed Mitchell Park Tennis Courts, then we will head over to Lembi Park, eat lunch, and enjoy a cool down swim at the aquatics center. Parents drop off their registered children at the Ed Mitchell Park Tennis courts and pick up their children at 3:00pm at the Aquatic Center. Children need to bring a racquet, one unopened can of tennis balls, lunch, waterbottle, bathing suit, sunscreen and towel. Price includes pool fees. Ages 6-16 NOTE: Folsom Aquatic Center 2015 Family Season Pass members receive $25 discount on Tennis Camp fee; pass must be presented at Aquatic Center for camp participant to gain pool entry.}",
    "textBeforeTable": "Recreational Youth Volleyball League with Aspire Volleyball Club The purpose of our Recreational league is to provide boys and girls, grades 4th-9th, with an opportunity to learn the basic skills of volleyball. We teach the fundamental skills of passing, setting, serving, rotation, rules, and encourage 3 contacts on each play. This is a recreational league, ideal for players looking to have fun and play in local recreational league. Teams will play a weekly game as part of their practice time on Fridays. Standings will be reported during the season and on March 13 we will hold a Tournament of Champions at the Folsom Sports Complex. Rules are modified to assist in the learning process. 1 Practice/Game shirt included Competitive team tryouts are in November, see the aspire-volleyball.com website for more information. Tryouts are not required for Development teams all players are guaranteed to make a team (space limited). Player evaluations will take place the first week of practices. 150097 - Aspire Volleyball Program Showing: 1 to 75 Total Results: 186 Activity Search Results SubType: Category: All Categories Adult",
    "textAfterTable": "250844 - Boyz Boogie w/ Leighton Dance Project In this boys only dance class they will lean to move and groove to some funky fresh tunes. Dances develop musically, creativity, listening skills and coordination. Ages 3-5       Cart Icon Activity Description Dates Times Fees       Single Icon       Status       Share Read Notice 250844-02 Boyz Boogie 06/29/15- 07/27/15 2:00P- 3:00P $57/$64 Item Details Unavailable Share Facebook Twitter Pinterest Email 310055 - Invention Action The Inventor\u0092s Proving Ground - Put your inventions to the ultimate test! Take designs that you and others create - inspired by the minds and methods of the greatest inventors - and put them to the ultimate test. You\u0092ll pit your catapults against a fort\u0092s protective walls, tweak wacky contraptions until they knock your socks off, escape a deserted island in your home-made boat, and see if",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}