{
    "relation": [
        [
            "Product",
            "miRBase Profiler Plate 7 miScript miRNA PCR Array",
            "miRBase Profiler Plate 7 miScript miRNA PCR Array",
            "miRBase Profiler Plate 7 miScript miRNA PCR Array",
            "miRBase Profiler Plate 7 miScript miRNA PCR Array"
        ],
        [
            "Species",
            "Human",
            "Mouse",
            "Rat",
            "Cow"
        ],
        [
            "Technology",
            "miScript miRNA PCR Array",
            "miScript miRNA PCR Array",
            "miScript miRNA PCR Array",
            "miScript miRNA PCR Array"
        ],
        [
            "Cat. No.",
            "MIHS-407Z",
            "MIMM-457Z",
            "MIRN-507Z",
            "MIBT-657Z"
        ]
    ],
    "pageTitle": "Metabolic Diseases Arrays and Assays",
    "title": "",
    "url": "http://sabiosciences.com/ArrayList.php?disease=METABO&sdisease=Inflammatory+Bowel+Disease+(Ulcerative+Colitis+%26+Crohn's+Disease)",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 325,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042992543.60/warc/CC-MAIN-20150728002312-00298-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 207902319,
    "recordOffset": 207857866,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "miRBase Profiler Plate 7 MIRS-706Z miScript miRNA PCR Array miRBase Profiler Plate 6 miScript miRNA PCR Array    MIBT-656Z miScript miRNA PCR Array Cow miRBase Profiler Plate 6 miScript miRNA PCR Array    MIQQ-556A miScript miRNA PCR Array Rhesus Macaque miRBase Profiler Plate 6 miScript miRNA PCR Array    MIRN-506Z miScript miRNA PCR Array Rat miRBase Profiler Plate 6 miScript miRNA PCR Array    MIMM-456Z miScript miRNA PCR Array Mouse miRBase Profiler Plate 6 miScript miRNA PCR Array    MIHS-406Z miScript miRNA PCR Array Human miRBase Profiler Plate 6 miScript miRNA PCR Array    Cat. No. Technology",
    "textAfterTable": "miRBase Profiler Plate 8 Product Species Technology Cat. No. miRBase Profiler Plate 8 miScript miRNA PCR Array    Human miScript miRNA PCR Array MIHS-408Z miRBase Profiler Plate 8 miScript miRNA PCR Array    Mouse miScript miRNA PCR Array MIMM-458Z miRBase Profiler Plate 8 miScript miRNA PCR Array    Rat miScript miRNA PCR Array MIRN-508A miRBase Profiler Plate 8 miScript miRNA PCR Array    Cow miScript miRNA PCR Array MIBT-658Z miRBase Profiler Plate 9 Product Species Technology Cat. No. miRBase Profiler Plate 9 miScript miRNA PCR Array   ",
    "hasKeyColumn": true,
    "keyColumnIndex": 1,
    "headerRowIndex": 0
}