{
    "relation": [
        [
            "Categories",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "Check out the local shopping malls in Mira Mesa.",
            "Very minimal food at this school as it is a community college. However, there is a nice starbucks by the library.",
            "There are no dorms at this school.",
            "Classes in general are not to hard and not too easy. This of course depends on the subject and professor.",
            "Make sure you plan ahead for registration to maximize your chances of getting all your classes. Don't be afraid to waitlist or crash classes.",
            "Great option for a community college in San Diego. Newly remodeled with ample parking. However, impacted school and therefore not enough classes available."
        ]
    ],
    "pageTitle": "San Diego Miramar College Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/San-Diego-Miramar-College/reviews?_escaped_fragment_=/show/5312",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042992543.60/warc/CC-MAIN-20150728002312-00107-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 917217663,
    "recordOffset": 917182719,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{112346=I feel very safe here. The structures are sound and well maintained, and trouble makers are scarce since Miramar has a police academy on campus!, 37568=Miramar College occasionally has campus events that benefit all students. They introduce clubs on campus, companies advertise their products, or universities visit to recruit students. These resources are great to get to know your school better, to experience new things, and broaden your knowledge of what is available to you., 79808=Miramar College have proven to be one of the best colleges in San Diego. The building, campus and class are comfortable and a good environment to learn., 62422=The center courtyard light patterns match the original Miramar flight paths., 13007=miramar college is a small community college, however it has a beautiful campus and is very well maintained. there isn't as many courses as compared to other community colleges, but the professors who teach the course are fully engaged with the students and love their job. parking was a pain in previous years, but with the recent addition of a parking structure finding parking is now easy!, 113077=All students with a desire to learn and an appreciation for beautiful scenery will enjoy Miramar college., 116282=As with all colleges, students need to be on top of their own education and finances. There are a lot of resources at Miramar college to make your dreams happen, but no one is going to do it for you. Study hard, and pay attention to deadlines!, 89875=Miramar college provides honors for a select number of classes which will help you transfer to a higher level university or may even help your GPA. Other than that, taking a regular class should be fairly easy, depending on the subject., 113977=Being a community college, Miramar is a great savings for transfer students, They offer many upper division courses, and you can get much of your program done here with out spending university prices. Along with this, the campus is well landscaped with great architecture and many social activities., 4015=Though only a community college, Miramar, along with the other colleges in the San Diego Community College District, has a gymnasium, swimming pool, weight room, and many more recreational resources., 116710=I think Miramar college is great for a community college. It has a lovely newly renovated campus, plenty of social activities and areas, and a great system for studying and tutoring. Above all of this, the teachers here are almost all a grade above what you would expect to find at a community college; which was the most important factor in my choosing this school., 48855=miramar college is a wonderful school for the busy individual. the class options and support is superb. whether you are student straight out of highschool or a returning student like me, you will benefit from attending miramar college., 36837=San Diego Miramar College is apart of the San Diego Community College District, and out of all three community colleges in this district, Miramar is the best. It has a beautiful campus with new buildings, great professors, and lots of diversity with the people that attend. The tuition is state regulated so it is the same at every junior college in CA, and it is good for the education you recieve. Find out if you can recieve any resources available to you like Financial Aid, EOPS, BOG, etc. Any student would be lucky to attend Miramar College., 101101=San Diego miramar college does not have dorms., 45235=Miramar college has greatly improved since I enrolled. The campus is currently under construction but the buildings that are finished look beautiful. I can't wait to see the final outcome!, 90856=Miramar College is a great place to further develop an individual's education, especially during financial hardships. I have met amazing teachers who are willing to help and teach their students to the best of their ability. There are two problems about the college and that is the amount of classes they offer and the lack of summer sessions, but it is probably only because the school has money problems to keep up their classes and to keep their teachers. I am very optimistic that they will improve this in the near future for upcoming students., 99741=This is my first year at San Diego Miramar college and I feel safe because the location is in a good area. The campus is small which makes it less dangerous in my opinion., 128508=I have enjoyed being a student at Miramar and have enjoyed the majority of my classes and professors. It is a pretty nice looking campus with good facilities. I attend mostly night classes so it's not too crowded and its lit well so I feel safe., 33097=The school is next to an Edwards Cinema Movie Theater that is always a hang-out spot, or if one is the exercising type, Miramar Lake is located just on the other side of the 15 freeway, behind the campus., 79152=for academic standing Miramar college is among the best in San Diego with competent professors and enough access to learning equipment., 57363=I give San Diego Miramar College 7.5 out of 10. SDMC is a great college and has many well educated teachers. Everyone is very energetic and spontaneous., 135065=© 2015, Cappex.com, LLC, 102133=San Diego Miramar College is very friendly. I'm not around campus during the day, my classes are during night. It's very quiet and less crowded which i like it that way., 52573=San Diego Miramar College is currently being renovated, which is both nice and annoying. There are not nearly enough classes for how many students attend. But they do have some exceptional professors who are very passionate about the subject(s) they teach., 57016=Some tips i have for prospective students is that to have a good time and dont get too flusted. Miramar college is a great place to meet new people and be yourself., 4504=Currently the cafeteria offers mediocre and fast-food type meals. In the Fall of 2013, a new building is going to be opened up with multiple floors. There will be many improvements including an increase in Library/Research resources as well as dining options and an indoor Starbucks cafe., 132446=I absolutely love Miramar College, there is so much involvement on campus and classes are affordable and flexible. The campus itself is beautiful and its a pretty diverse campus as well. There is plenty of classes to choose from to go along with your major. The resources on campus are great as well., 107273=As previously stated, I'm online student. I have visited all three campuses a time or two but they all seem to be pretty well patrolled with panic boxes throughout. Miramar and Mesa are both building to become pretty large schools and very nice campuses., 123660=Depends on how well you want to do. If you want to transfer to a good school, then Miramar is as hard a college as they come. If you want to just get by with C's and not really learn the material, well then you're basically back in high school, 34590=San Diego Miramar College is a beautiful, smaller open-plan campus, that has a few large construction projects underway. Most of the professors are good at their professions, with a few exceptions; especially in the math related departments. There is also always extra tutoring help if students need it., 127914=I absolutely love the Child Development classes, center, and professors! If you're trying to get a degree in child development SD Miramar is a great bet. One important tip I have is to really check what the counselors here tell you. I have experienced some problems with the counseling department giving me the wrong information as well as several of my peers getting the wrong information from the counselors., 105467=San Diego Miramar College provide excellent service to Veterans seeking to further their education. The Campus VA office is a one stop solution to any Veteran's needs. They provide counseling services, answer any VA benefits questions, and make transitioning easy., 19623=miramar college has fantastic teachers and staff. the new campus, which is still in progress, is convenient with most classes in the same building. also the classes are not packed., 55311=I am so glad I chose this college to start off my college career! The counselors are so helpful and are always available to talk to. Miramar has helped me get closer to my educational goals with less stress and for less money!, 27754=San Diego Miramar College is a wonderful school. The classrooms are new, the teachers are well informed and the library is top notch. I love the atmosphere and enjoy walking around campus., 101803=San Diego Miramar college is a mellow campus and very small which make first time students less confused about where there classes could be found., 34043=There are no dorms at San Diego Miramar College., 2361=Miramar has an on-site Police Department that does everything a regular police department would do. Though I have yet to use any of the services (besides parking lot security) they offer, I did an interview with a Police Sergeant there who made me aware of how the services they offer ARE what we would expect from any police department. They have a Health Department as well that will help you with any injuries/illness or even check-ups as well., 39733=San Diego Miramar College is a culturally diverse campus. It has all resources needed to succeed. It has amazing professors, faculty, and adminstration to guide you with your academic career., 61697=We have several diffrent clubs such as,Student Veteran Organization,Science Club,San Diego Miramar College Paralegal Group,Miramar USTA CLub,Food & Culture Club,Filipino American Student Association,EOPS CLub,Asian American Student Association and many more., 101439=I'm a first time student attending San Diego Miramar college so I have no idea what the academic rigor is like yet. The classes i'm currently taking is not tough at all., 47009=i find miramar college to be a great value., 38644=Academically, Miramar is lighter, yet challenging. Depending on your class, you will find work is never light. With every class you need to put a good effort and try your best to get all assignments and assessments done. Most use blackboard to help you get handouts, or important papers needed for the course. Use your resources, and you will do great.}",
    "textBeforeTable": "07/27/2009 Reviewer is A current student here. 6 out of 6 people found this review useful. 1 of 33 Mai from San Diego, CA Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code",
    "textAfterTable": "Clubs and Activities Several different clubs on campus, but of course not as much as at a university. There is the Phi Thetta Kappa society (a.k.a Honor Society) that will give you Financial Aid opportunities but will also look very well on your transcript if you plan to transfer. Bang for the buck Will save you a lot of money compared to taking General Ed courses at a university. Do NOT forget to take advantage of Financial Aid opportunities for a more FREE'er education. What to do for fun Though only a community college, Miramar, along with the other colleges in the San Diego Community College District, has a gymnasium, swimming pool, weight room, and many more recreational resources. Food and Dining Currently the cafeteria offers mediocre and fast-food type meals. In the Fall of 2013, a new building is going to be opened up with multiple floors. There will be many improvements including an increase in Library/Research resources as well as dining options and an indoor Starbucks cafe. Dorm Life Community colleges don't have dorms. Academic Rigor",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}