{
    "relation": [
        [
            "#",
            "",
            "",
            ".",
            ".",
            "",
            ""
        ],
        [
            "Date",
            "24/7/74",
            "30/9/82",
            "16/9/87",
            "13/2/89",
            "23/4/96",
            "08/6/96"
        ],
        [
            "Name",
            "Non Olympic Sports",
            "Commonwealth Games",
            "Aussie Kids",
            "1989 3c Aussie Rules",
            "AFL Centenary Sheetlet",
            "Brisbane Bears Book"
        ],
        [
            "Comments",
            "WCS issued four covers (the same design with different colours). Examples of the Red writing, Light Green writing and Blue writing for this series. It included a footballer going for a mark. There were also a cover with Dark Green writing.",
            "cover with stylised footballer and relevant postmarks. The cover also exists as a smaller size.",
            "Stylised kid.",
            "Group of footballers flying for mark.",
            "cover with stylised footballer and FDI postmarks",
            "Cover for FDI of booklet with overprint Olympics 96 Qld Stamp & Coin Expo"
        ]
    ],
    "pageTitle": "Covers",
    "title": "",
    "url": "http://footystamps.com/pl_covers.htm",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042992543.60/warc/CC-MAIN-20150728002312-00153-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 89084879,
    "recordOffset": 89051281,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{1=Updated: 17/04/2007}",
    "TableContextTimeStampAfterTable": "{186319=7. 2003, 80523=3. 1999, 36927=Silk 'STERLING' Cachet of Carlton v Richmond Match & 125th Anniversary of Aussie Rules PM (APM13630). The cover with an altered heading was used for the 1989 Melbourne Stamp Show., 101442=4. 2000, 229015=8. 2004, 48223=First Class Collectables (formerly Havilah Enterprises) PO Box 2591, Bakery Hill, Victoria Australia 3354, Phone 61 3 5334 3615 Fax 61 3 5334 2315. 1. 1997, 65264=2. 1998, 200733=First Class Collectables released covers for each of the 20 Players on the selvedge of the P stamps for each team. (See individual teams 2003 P stamp pages), 120933=5. 2001, 139787=6. 2002}",
    "lastModified": "Thu, 30 Oct 2008 09:01:35 GMT",
    "textBeforeTable": "Wesley Cover Service The Wesley Cover Service has been the main private producer of private FDCs in Australia for many years. At present their tradition is being continued by the Sydney Stamp Service. Benham issued four silk covers for this issue including the 90c barracking at the footy which had the National PM (PMCF36) Aussie Kids 16/9/87   Silk 'STERLING' Cachet of Carlton v Richmond Match & 125th Anniversary of Aussie Rules PM (APM13630). The cover with an altered heading was used for the 1989 Melbourne Stamp Show. 125th Anniversary 10/7/83   Comments Name Date # Silk Covers One cover showing the MCG and umpire was used with 4 sets of 4 stamps. The national PM was East Melbourne. The",
    "textAfterTable": "Frankston Stamps # Date Name Comments   1982 Frankston Stamps Vic 3199 1 Cover with VFL Logo and logos of each club, 12 covers with the logos of each VFL club, 1 Carlton cover overprinted with \"Premiers 1982\" each with VFL Grand Final PM (APM12220) and 1 cover with WAFL Logo and logos of each club, and WAFL Grand Final PM (APM12110). All in special Folder - See 1982 Covers page for VFL Clubs. The WAFL cover was also postmarked with the 125th Anniversary PM. First Class Collectables (formerly Havilah Enterprises) PO Box 2591, Bakery Hill, Victoria Australia 3354, Phone 61 3 5334 3615 Fax 61 3 5334 2315. 1. 1997",
    "hasKeyColumn": true,
    "keyColumnIndex": 2,
    "headerRowIndex": 0
}