{
    "relation": [
        [
            "Patent application number",
            "20080244100",
            "20080307283",
            "20100064192",
            "20110106997",
            "20120042207",
            "20120140840",
            "20120144082",
            "20130128946",
            "20140223270"
        ],
        [
            "Description",
            "METHODS AND STRUCTURES FOR TESTING SAS TRANSCEIVER TRAINING OPTIONS IN SAS-2 TRAINING WINDOWS - Method and structures provide for testing a SAS link in association with participating in training windows to determine success/failure in using a negotiated speed using one or more configured sets of transceiver training options. For each device linked to a master SAS device, each possible set of transceiver training options is configured and one or more SCSI requests are forwarded from the master device to the attached device. The SCSI requests may be non-destructive of data stored on the attached device. Results of the tests may be used to select a preferred set of transceiver training options for communication between the master device and that attached device. The transceiver training options to be varied and tested may include: amplitude, slew rate, de-emphasis, and spread spectrum clocking.",
            "Complex Pattern Generator for Analysis of High Speed Serial Streams - The present invention provides systems, devices and methods for generating user-defined test patterns within serial controller to facilitate signal testing and verification. These user-defined test patterns may be generated to more accurately reflect the actual traffic of a device-under-test or system, as well as allow a test engineer to more accurately test the boundaries of the device or system. In various embodiments of the invention, a programmable patterns generator is provided for generating user-defined test patterns that may be used during a testing procedure. This programmable pattern generator allows a user to define a particular test pattern by providing bit-by-bit test values, by defining a combination of canned sequences, or by supplementing one or more canned sequences with additional test bits.",
            "METHODS AND APPARATUSES FOR CORRECTING ERRORS IN DATA STREAMS - Methods and apparatuses for correcting an error in a data stream that is coded with a line code and an error detection scheme. Information relating to the line code is used to locate at least one possible error character. At least one possible correct character to replace one or more of the at least one possible error character is then identified. Subsequently, the error detection scheme is applied to the data stream updated with one of the at least one possible correct character. If none of the at least one possible correct character results in a valid data stream, an error that is observable by a user is generated.",
            "METHODS AND APPARATUS FOR INTERCONNECTING SAS/SATA DEVICES USING EITHER ELECTRICAL OR OPTICAL TRANSCEIVERS - Methods and apparatus for interconnecting Serial Attached SCSI (SAS) or Serial Advanced Technology Attachment (SATA) devices using either an electrical communication medium or an optical communication medium. Each device includes an out of band (OOB) encoder/decoder (endec) logic component to translate between standard OOB signals used by the devices and digitally encoded OOB signals exchanged over the communication medium. Thus the devices may be coupled using either optical or electrical cabling. The digitally encoded OOB signals may also be scrambled to reduce electromagnetic interference (EMI) generated during OOB communications using the digitally encoded OOB signals. The scrambled digitally encoded OOB signals may comprise information regarding capabilities of the device that generated the underlying OOB signal. Such information may indicate to the other high speed device certain capabilities of the transmitting device—the information to be used in establishing logical connections between devices.",
            "METHODS AND STRUCTURES FOR TESTING SAS-2 SPEED OPTIONS IN SPEED NEGOTIATION WINDOWS - Method and structures provide for testing a SAS link during speed negotiation windows to determine success/failure in using a negotiated speed at one or more configured sets of speed options. For each device linked to a master SAS device, each possible set of speed options is configured; the device participates in a speed negotiation window operation with the current speed options configured. One or more SCSI requests are forwarded from the master device to the attached device. The SCSI requests may be non-destructive of data stored on the attached device. Results of the tests may be used to select a preferred speed for communication between the master device and that attached device. The speed options to be varied and tested may include: link speed; spread spectrum clocking for each SAS speed; type of supported spread spectrum clocking; and logical link rate in support of multiplexing.",
            "DATA PATH UTILIZATION FOR LOW LEVEL PATTERN GENERATION AND CHECKIING - Decision modules are strategically located along with various modules to route signals from either a test pattern generator or the data link layer through the various modules for performing scrambling, encoding, and serializing procedures on the signals before transmission of the signals on a serial bus. Decision modules are strategically placed along with various modules to route signals to either a test pattern checker or the data link layer through the various modules for performing descrambling, decoding, and deserializing procedures on the signals after receiving the signals from a serial bus.",
            "DATA PREFETCH IN SAS EXPANDERS - A SAS expander collects data access information associated with a nexus and determines whether a data prefetch is appropriate. The SAS expander identifies potential data blocks utilizing previous data requests of the nexus. The SAS expander issues a data request to the target for the potential data blocks. The SAS expander stores the potential data blocks within a prefetch cache for future utilization within a data read.",
            "METHOD OF OPTIMIZING FLOATING DFE RECEIVER TAPS - A method for determining floating tap positions in a DFE of a receiver is disclosed. The method include providing a group of floating taps for the DFE; obtaining a baseline eye opening value for the receiver when the group of floating taps is disabled; providing a plurality of floating tap distribution configurations, each specifying a distribution configuration for the group of floating taps within the DFE; obtaining a plurality of eye opening values for the receiver, each particular eye opening value corresponding to a particular floating tap distribution configuration when the group of floating taps are distributed within the DFE according to the particular floating tap distribution configuration; comparing each of the plurality of eye opening values against the baseline eye opening value; and identifying an optimal floating tap distribution configuration based on the comparison of each of the plurality of eye opening values against the baseline eye opening value.",
            "CLASSIFYING BIT ERRORS IN TRANSMITTED RUN LENGTH LIMITED DATA - A test pattern is encoded using a run length limited line encoding to produce an encoded block of data. The encoded block of data is sent via a channel. A plurality of bits in the received block of data that are subsequent to a maximum length run in the sent data is compared to an expected plurality of bits. A type of bit error is classified based on a mismatch between the expected plurality of bits and the plurality of bits in the received block of data."
        ],
        [
            "Published",
            "10-02-2008",
            "12-11-2008",
            "03-11-2010",
            "05-05-2011",
            "02-16-2012",
            "06-07-2012",
            "06-07-2012",
            "05-23-2013",
            "08-07-2014"
        ]
    ],
    "pageTitle": "Romero, US - Patent applications",
    "title": "",
    "url": "http://www.faqs.org/patents/inventor/romero-us-5/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989891.18/warc/CC-MAIN-20150728002309-00213-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 443212659,
    "recordOffset": 443177908,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{55123=Patent applications by Jan Antoinette C. Romero, Somerville, MA US}",
    "textBeforeTable": "Gabriel L. Romero, Colorado Springs, CO US 07-05-2012 SENSOR-BASED SYSTEMS AND METHODS FOR ASSESSING INTERNAL BRIDGE DECK DETERIORATION - An interior volume of a bridge deck is probed using a transportable sensor system that produces deck data useful for assessing internal degradation of the bridge deck. Geographic position data of sensor system positioning is produced as the sensor system traverses the deck. The deck data is associated with the one or more deck locations using the geographic positioning data, and adjusted deck data is generated using adjustment data indicative of external factors that influence the deck data but are unrelated to a failure mechanism impacting the bridge deck interior. An output may be generated comprising at least the adjusted deck data. 20120173150 Published Description Patent application number Francisco Romero, Glen Gardner, NH US //]]> BarDraw('3086670',['Patent applications by F. Anthony Romero, Westfield, NJ US'],[[1,3,1]],['2010','2011','2013'],0); // <script type=\"text/javascript\"> </div> <div id=\"legend3086670\" align=\"center\"></div> </div> <canvas id=\"bg3086670\" style=\"max-width: 500px; width: 100%;\"></canvas> <div> <p align=\"center\">Patent applications by F. Anthony Romero, Westfield, NJ US</p> <div class=\"bar3086670\" style=\"max-width: 500px; width: 100%; float:left; \"> <div align=\"left\" style=\"padding-top:20px;\"> </table> </tbody> </tr> <td>02-14-2013</td> <td><a href=\"/patents/app/20130040978\">SPIRO ISOXAZOLINE COMPOUNDS AS SSTR5 ANTAGONISTS</a> - Substituted spirocyclic amines of structural formula (I) are selective antagonists of the somatostatin subtype receptor 5 (SSTR5) and are useful for the treatment, control or prevention of disorders responsive to antagonism of SSTR5, such as Type 2 diabetes, insulin resistance, lipid disorders, obesity,",
    "textAfterTable": "Patent applications by Gabriel L. Romero, Colorado Springs, CO US Gabriel Leandro Romero, Colorado Springs, CO US Patent application number Description Published 20120119789 Peak Detector Extension System - The different illustrative embodiments provide a method and apparatus for managing peak detector circuits. A first number of voltages for a first number of signals detected by a peak detector circuit connected to a wire in a bus system is identified. The first number of signals is used to send data over the wire. The first number of voltages is for a first number of transmission speeds for the first number of signals. A second number of voltages for a second number of signals detected by the peak detector circuit is identified. The second number of signals is present in the wire in an absence of the data being sent over the wire. The second number of voltages is for a second number of transmission speeds for the second number of signals. A number of settings are selected for the peak detector circuit based on the first number of voltages and the second number of voltages. 05-17-2012 Guillermo L. Romero, Phoenix, AZ US",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}