{
    "relation": [
        [
            "PLAYER",
            "Hudson, Tim",
            "Jones, Chipper",
            "Maholm, Paul",
            "McCann, Brian",
            "",
            "Blanco, Henry",
            "Lindstrom, Matthew",
            "",
            "Ayala, Luis",
            "",
            "Ludwick, Ryan",
            "Madson, Ryan",
            "",
            "Hafner, Travis",
            "Hernandez, Roberto",
            "Jimenez, Ulbaldo",
            "",
            "De La Rosa, Jorge",
            "",
            "Floyd, Gavin",
            "Myers, Brett",
            "Peavy, Jacob",
            "Youkilis, Kevin",
            "",
            "Dotel, Octavio E.",
            "Peralta, Jhonny",
            "",
            "Snyder, Chris",
            "",
            "Soria, Joakim",
            "",
            "Haren, Danny",
            "Santana, Ervin",
            "",
            "Coffey, Todd",
            "Rivera, Juan",
            "Treanor, Matt",
            "",
            "Baker, Scott",
            "",
            "Wright, David",
            "Dickey, R.A.",
            "",
            "Aardsma, David",
            "Cano, Robinson",
            "Granderson, Curtis",
            "Soriano, Rafael",
            "",
            "Balfour, Grant",
            "Drew, Stephen",
            "",
            "Contreras, Jose",
            "Polanco, Placido",
            "Ruiz, Carlos",
            "Wigginton, Ty",
            "",
            "Barajas, Rod",
            "Alvarez, Pedro",
            "",
            "Huff, Aubrey",
            "",
            "Molina, Jose",
            "Rodney, Fernando",
            "Scott, Luke",
            "Shields, James",
            "",
            "Feldman, Scott",
            "",
            "Oliver, Darren",
            "",
            "Burnett, Sean",
            "LaRoche, Adam"
        ],
        [
            "TEAM",
            "AT",
            "AT",
            "AT",
            "AT",
            "",
            "AZ",
            "AZ",
            "",
            "BA",
            "",
            "CI",
            "CI",
            "",
            "CL",
            "CL",
            "CL",
            "",
            "CO",
            "",
            "CWS",
            "CWS",
            "CWS",
            "CWS",
            "",
            "DE",
            "DE",
            "",
            "HO",
            "",
            "KC",
            "",
            "LAA",
            "LAA",
            "",
            "LAD",
            "LAD",
            "LAD",
            "",
            "MN",
            "",
            "NYM",
            "NYM",
            "",
            "NYY",
            "NYY",
            "NYY",
            "NYY",
            "",
            "OA",
            "OA",
            "",
            "PH",
            "PH",
            "PH",
            "PH",
            "",
            "PI",
            "PI",
            "",
            "SF",
            "",
            "TB",
            "TB",
            "TB",
            "TB",
            "",
            "TE",
            "",
            "TO",
            "",
            "WA",
            "WA"
        ],
        [
            "Exercised",
            "1/$9M",
            "Retiring",
            "1/$6.5M",
            "1/$12M",
            "",
            "",
            "",
            "",
            "1/$1M",
            "",
            "",
            "",
            "",
            "Club Declined, FA",
            "Club Declined, FA",
            "1/$5.75M",
            "",
            "Player exercises option, $11M",
            "",
            "",
            "",
            "2/$29M",
            "",
            "",
            "1/$3.5M",
            "1/$6M",
            "",
            "Club declined, $500K buyout, FA",
            "",
            "Club Decline, $750K Buyout, FA",
            "",
            "LAA unable to trade with CHC for Marmol, $3.5M buyout, FA",
            "1/$13M, then trade with cash to Royals for minor leaguer LHP Brandon Sisk on 12/31",
            "",
            "Club Decline, FA",
            "Club Decline, FA",
            "Club Decline, FA",
            "",
            "Club Decline, FA",
            "",
            "1/$16M",
            "1/$5M",
            "",
            "1/$500K",
            "1/$15M",
            "1/$15M",
            "Player Decline, FA",
            "",
            "1/$4.5M",
            "Club Decline, FA",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "1/$700K",
            "",
            "Club Decline, $2M buyout, FA",
            "",
            "",
            "",
            "",
            "",
            "",
            "Club Decline, FA",
            "",
            "1/$3M",
            "",
            "Player declines mutual option, FA",
            "Player declines mutual option, FA"
        ]
    ],
    "pageTitle": "The Biz of Baseball :: Part of the Business of Sports Network",
    "title": "",
    "url": "http://www.bizofbaseball.com/index.php?limitstart=160",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042992543.60/warc/CC-MAIN-20150728002312-00052-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 333326959,
    "recordOffset": 333284332,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{210132=7:30/8:07 p.m., 190586=When Davis works Game One, he will set a new record for the most Postseason games umpired in Major League history.  After handling five games in the 2012 Division Series, Davis has worked 111 Postseason games, matching retired umpires Jerry Crawford and Bruce Froemming for the most ever., 58647=So, you have to ask yourself when was “lack of clarity” fully consumed in the Marlins front office? Was it when they spent foolishly at the Winter Meetings in Dallas last December, or was it Tuesday night when they went with (another) fire sale?, 190887=Each of the six World Series umpires was assigned to a 2012 Division Series, for which Davis, Gorman and West were series crew chiefs.  The rotation for the 2012 Fall Classic, which will be covered by FOX Sports and ESPN Radio, follows:, 58433=\"This should be a positive change,” said Larry Beinfest. \"After a disappointing 2012 this gives us clarity as we begin our offseason roster improvement.\", 39810=The new video screen replaces the scoreboard that was built in 1999, the inaugural season of Safeco Field. Measuring 56.7-feet high by 201.5-feet wide and covering 11,425 square feet, the new video screen fills the same location and space as the old scoreboard, but because the entire thing is a high definition screen, the video space itself is nearly 10 times the size of the current video screen., 212711=Nov. 1st, 43005=The video screen and production upgrades are part of an estimated $15 million maintenance and capital improvement plan for Safeco Field to be completed before the 2013 season. The Mariners, who are responsible for maintenance, capital improvements and operations of Safeco Field, have invested over $80 million in the ballpark since 1999. All current improvements to Safeco Field are scheduled to be completed in time for the home opener on April 8 vs. the Houston Astros., 91903=Each year, I’ve written about the Baseball Winter Meetings, what they are and aren’t about, and with it, provided a sidebar to a career conference that takes place during them (read Inside the 2011 Baseball Winter Meetings in Dallas). This year, the meetings are in Nashville,TN from December 3-6 at the Gaylord Opryland Resort and Convention Center. Instead of getting into the ins and outs of the Meetings, this year I want to focus on an aspect that is going on at the meetings, but isn’t a part of them., 83026=So let’s say it happens. Let’s say Hamilton lands a seven-year, $175 million deal. How would he stack up compared to the highest-paid players in the league? Based on total contract dollars, $175 million would rank Hamilton ninth, moving CC Sabathia down to 10th. Mark Teixeira, who would sit just ahead of Hamilton with his eight-year, $180 million deal that he reached with the Yankees for the 2009-16, is the only player beside Sabathia to have a lower WARP in his platform year leading up to their high-dollar contracts., 54237=\"The reality is, if you don't have a competitive team, the big stadium that's built publicly and privately becomes another disaster,\" Samson said in 2008., 205405=Oct. 24th, 28903=The club had begun dismantling the team that had won the 2003 World Series—yet again—citing the need for a new ballpark to allow them to retain players. Unable to sign Ugueth Urbina and Iván Rodríguez, they left in free agency. They traded Derrek Lee to the Cubs for Hee-Seop Choi and pitcher Mike Nannini. They did sign Mike Lowell to a four-year deal, but it had a provision within it where Lowell could opt out of the final two years of the deal if no new ballpark was built for the Marlins. As I walked over to Samson, who was sporting his gaudy new World Series ring, I mentioned (naively, it seems in retrospect given recent moves by the club) how the retention of talent must be difficult without their own ballpark. It was also here that I realized just how scary the Marlins’ brain-trust really was (and still is). Samson broadsided me, not by speaking of the Marlins directly but by disparaging a fellow club., 189668=Gerry Davis, a 29-year Major League Umpire, will serve as the chief for the 108th World Series and will be behind the plate for Wednesday’s Game One of the 2012 Fall Classic between the American League Champion Detroit Tigers and the National League Champion San Francisco Giants at AT&T Park, when play gets underway, today., 211748=Oct. 31st, 211947=7:30/8:07 p.m., 209933=Oct. 29th, 206323=Oct. 25th, 190165=This is the fifth World Series assignment for both Davis, who was a Fall Classic Umpire in 1996, 1999 and 2004 before being appointed crew chief for the 2009 World Series, and 35-year Major League Umpire West, who worked the World Series in 1992, 1997, 2005 and 2009.   This marks the third World Series for Gorman (2004, 2009), the second for Culbreth (2008) and the first for both Iassogna and O’Nora., 43485=Current CF Scoreboard ProStar Video Display 26'x46' SunSpot incandescent matrix board 34'x76' Total scoreboard dimensions 56'x200' New Centerfield Video Screen Specifications Dimension: 56.7' high x 201.5' wide Total Viewing Area: 11,425 sq. ft. Resolution: 1080 x 3840 Total Pixels: 4,147,200 Manufacturer: Panasonic Operating System: ANC Sports VisionSOFT Comparison to MLB Video Screens, 39286=The escalation of video display sizes has grown over the last few years, and with Safeco Field’s display falling behind since opening in July of 1999, it’s time for a change… a BIG change., 205595=7:30/8:07 p.m., 92614=As part of work that I do for Sports Management Worldwide, I’ve been privileged to help with lining up speakers for their Baseball Career Conference. Over the past few years, the likes of Dodgers GM Ned Colletti, Stan Kasten (now part owner, CEO and President of the Dodgers), and John Mozeliak, the Vice President and General Manager of the St. Louis Cardinals have been keynote speakers. The conference, which runs this year on Dec. 2-3, has also featured Jayson Stark and Jerry Crasnick of ESPN.com, Rob Neyer with SBNation, Cory Schwartz with MLB Advanced Media, Harold Reynolds of MLB Network, Tracy Ringolsby of FOX Sports and Baseball America, Craig Calcaterra of NBCSports.com, and yes, yours truly from Baseball Prospectus, Forbes, and here at The Biz of Baseball along with a host of others. While I’m somewhat biased, it’s becoming clear that the conference is becoming of the go-to places for the Winter Meetings each year., 30879=I was stunned. First off, Brewers owner Mark Attanasio was doing something positive for the fans after not being above .500 for years under Selig’s tenure. It was a smart move that, as we’ve seen, has endeared him to the community, which in turn has allowed the Brewers to draw attendance totals over 3 million more than once now (2008: 3,068,458; 2009: 3,037,451; 2011: 3,071,373) and has helped them be competitive. In terms of the tearing down and building back up of the Marlins’ roster, it was then that I realized that only quick fixes would ever do for the organization. That the ballpark was not going to really be part of it. That what Wayne Huizenga had done with his fire sale after the 1997 World Series was not limited to just Wayne Huizenga. This was something that seemed to be embraced by Loria and Samson as well. But that was 2003. It was possible that if and when a new stadium did come about, things might change., 28129=Loria was the luckiest guy on the planet shortly after this situation unfolded. Following the purchase, the Marlins won the 2003 World Series. Prior to Loria—and really before Henry, when Wayne Huizenga had owned the club—the cries for a new, baseball-only ballpark had been sought. In 2005, Samson began what some called the “Great Relocation Tour,” going to places like San Antonio and Portland where there had been interest in relocating the Expos when they were up for relocation. I was part of Portland’s effort to land a team, and on a cold, rainy winter day, baseball boosters in the city and I hosted Samson in early January of 2006., 82411=Of all the free agents this off-season, maybe Josh Hamilton is the most intriguing. He’s won an AL MVP, and been a powerhouse. He’s been on MLB’s restricted list for drug use, landed on the DL often, and was lackluster in the second half of 2012. Which Hamilton you’re going to get is where the debate starts., 39482=The Mariners today announced on Thursday that a new high definition video display system will be installed at Safeco Field for the 2013 baseball season, replacing the main scoreboard in centerfield. When completed (at least for now) it will be the largest in Major League Baseball and among the largest in all of sports., 208280=7:30/8:07 p.m., 111708=UPDATED: 11/03/12 (8:10pm ET - Ortiz and Boston reach 2-year deal, Haren FA, Colon and A's reach 1-yr deal) The World Series had barely ended when baseball’s “third season”. Below 137 players became free agents pursuant to Article XX B (2) of the Basic Agreement.  Free agent players are eligible to negotiate and sign with any Club beginning 12:01 AM EST Saturday, November 3. We’ll be tracking the signings. Below this table of 137 are players that have club, player, or mutual options. See whether those are being picked up or declined, along with contract details., 54617=Yes, while the Marlins took on more than $200 million in total player payroll less than a year ago at the Baseball Winter Meetings, they ended the season moving Anibal Sanchez, Omar Infante (Tigers), and Hanley Ramirez (Dodgers). On Tuesday evening they made that look like child’s play by moving Jose Reyes (2013:$10M, 2014:$16M, 2015:$22M, 2016:$22M, 2017:$22M, 2018:$22M club option - $4M buyout), Josh Johnson (2013:$13.75M), Mark Buehrle (2013:$11M, 2014:$18M, 2015:$19M, plus a $4M deferred signing bonus), John Buck (2013:$6M), and Emilio Bonifacio who is arbitration eligible this year and (get this) $4 million in cash to the Blue Jays for Yunel Escobar, Henderson Alvarez, Adeiny Hechavarria, Jeff Mathis, minor league pitchers Justin Nicolino and Anthony Desclafani and minor league outfielder Jake Marisnick. All told, the Marlins stripped $163.75 million off the books and that doesn’t include the option year or buyout on for Reyes, plus what Bonifacio will get in salary arbitration this year., 209197=8:00/8:15 p.m., 207254=Oct. 26th, 102482=Oct 31, 3:37pm ET - Rays update Oct 31, 3:15pm ET: With the Hot Stove already in full swing, clubs and players are engaged in exercising contract options. Here’s an update, 210902=Oct. 30th, 42649=This is the third of three steps to replace the old scoreboard system at Safeco Field. The LED Out-of-Town scoreboard was installed in left field before the 2010 season, and in 2011, LED ribbon boards were installed on the Terrace Club fascia. The in-house production, broadcast and entertainment systems are also being upgraded to high definition., 209007=Oct. 28th, 83594=Hamilton would also be the second-oldest player to command a deal in the top 13 highest-paid contracts, behind only Alex Rodriguez, who signed a 10-year, $275 million deal with the Yankees (the highest in the history of the game). In 2007, the year before the deal kicked in, A-Rod posted an 8.3 WARP., 208090=Oct. 27th}",
    "lastModified": "Tue, 04 Aug 2015 23:56:54 GMT",
    "textBeforeTable": "You could say these players batted 1.000. A new system where clubs offer a “qualifying offer” of $13.3 million for the upcoming season to potential free agents got its first test, and with it, all nine players that were made the offers rejected them. In doing so, the clubs will now get a compensatory pick in the upcoming Rule 4 draft, and the players that rejected the offers are now free agents. This doesn’t mean a player can’t re-sign with their former club, it simply means that the player is now a free agent. Of the nine, one has already re-signed with their former club. Designated hitter, David Ortiz rejected the one-year, $13.3 million offer as he and the Red Sox reached a two-year, $26 million deal that with incentives, could push to $30 million. The following are the nine players that rejected the qualifying offers, thus becoming free agents: Friday, 09 November 2012 19:32 Written by Maury Brown    MLB News PoorBest ",
    "textAfterTable": "Ross, Cody BO Hudson, Orlando CWS Camp, Shawn CC Broxton, Jonathan CI Cairo, Miguel J. CI Navarro, Dioner CI Rolen, Scott CI Kotchman, Casey CL Sizemore, Grady CL Francis, Jeff CO Giambi, Jason CO Sanchez, Jonathan CO Bruney, Brian CWS Liriano, Francisco CWS Lopez, Jose CWS Pierzynski, A.J. CWS",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}