{
    "relation": [
        [
            "Day",
            "Mon",
            "Tue",
            "Wed",
            "Thu",
            "Fri",
            "Sat",
            "Sun"
        ],
        [
            "Drink Special",
            "--",
            "--",
            "--",
            "--",
            "--",
            "--",
            "--"
        ],
        [
            "Food Special",
            "--",
            "--",
            "--",
            "--",
            "--",
            "--",
            "--"
        ]
    ],
    "pageTitle": "The Union: Chicago Bar Project",
    "title": "",
    "url": "http://www.chibarproject.com/Reviews/Union/Union.htm",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989891.18/warc/CC-MAIN-20150728002309-00136-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 369739991,
    "recordOffset": 369726420,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{29610=The right side of the room used to house several tables, where having a bit of a chat was as easy as Pamela Anderson. Now, conversation has been replaced by bad pick-up lines as the tables have been removed and sterile, high-backed chairs now stand in front of a wooden railing. This area could now pass as a very narrow dance floor, and the whole are seems to go well with the thumping dance music that plays loudly after 9:00 p.m., even while games are on. Just around the corner from the Golden Tee machine, beyond the bar, is a hallway that leads to the bathrooms. This frathouse-chic hallway looks like it was constructed by someone that only read half of the Time Life book on interior design with its uneven tile, unframed Skyy Vodka posters tacked to the wall and the unfinished bit across from the women's at the back. At the extreme west end of the room is a glass door entrance to the beer garden. The beer garden sports its own bar and offers plenty of seating and sightlines to the foot traffic on George. In my book, the Union's beer garden rivals that of the more popular Sheffield's, Justin's and John Barleycorn's., 19516=The Union 2858 N. Halsted St. (2900N, 800W) Chicago, IL 60657 (773) 755-9870, 33276=\"Missing the old college days when the most important things were getting drunk, getting laid and getting into the old school spirit? Well, welcome back! The fresh, right-out-of-college crowd holds what seem like nightly alumni meetings here at this Lakeview bar that was formerly The Gaslight. The Big Ten was never so big as it is at this sports bar where the menu is inspired by collegiate courses such as Wisconsin cheese sticks, Purdue's Cajun chicken sandwich and the house specialty, the half-pound burger brought all the way from Michigan State. While the clientele still pelts rival teams with said cheese sticks, the staff is seasoned and the bar is well run by owners who baby-sit regularly. With 10 beers on tap and live music Thursdays and Saturdays, the is place is as popular a pickup spot as the library was back in the day. So, if you're a recent grad (or if you're looking to meet one) give this bar the old college try.\", 34346=\u0096 Shecky's Bar, Club & Lounge Guide 2002, 30934=If you're a college football or basketball fan, the Union is the place for you \u0096 particularly on Fridays when its all-you-can-drink for $10 from 6-9pm. You can take in almost any game playing while basking in the glory of exposed brick walls, worn wooden floors, and several posts supporting a green-painted tin ceiling. While focusing on the Big 10, the Union supports all college sports. Even local alumni of Virginia Tech come to the Union to watch all Hokie games (while the rest of us laugh at their mascot: a turkey). Buckeyes fans may appreciate the 1924-25 Ohio State plaque commemorating the Buckeye men's (no women's back then) championship basketball season. That season, not one Ohio State victory was achieved by scoring more than 40 points. Televisions located throughout the south end of the room ensure that even if your loyalty is divided between two teams playing separate games, you'll be able to watch each of them simultaneously. Jerseys, photographs and pennants round out the décor. Unfortunately, NFL fans will be chagrined to find out that the Union charges $3 cover for Monday Night Football. My recommendation: head to Buffalo Wild Wings for some QB1 instead on Mondays during the season. On the other hand, the Union was a good place to take in some of the 2003 Cubs post-season, especially after Game 1 of the NLCS when they played a recording of Harry Carry singing Take Me Out to the Ballgame when the game was over. Everyone in the bar belted it out and, even though the Cubbies dropped that game, it was a nice touch.}",
    "lastModified": "Mon, 15 Nov 2010 20:36:37 GMT",
    "textBeforeTable": "\"Chicago's Home of the Big 10\" The Union 2858 N. Halsted St. (2900N, 800W) Chicago, IL 60657 (773) 755-9870 Written by Sean Parnell   © The Chicago Bar Project  ",
    "textAfterTable": "The Union is an interesting study in how people desperately try to change the feel of a bar, expend lots of effort and money, and don't quite get there. Known formerly as Gaslight Corner, the bar used to be a good neighborhood joint that was somewhat dive-ish and could never attract a steady crowd \u0096 even with its laid-back atmosphere, burger menu and stellar beer garden. The new incarnation known as the Union, has been successful in turning the place into a sports bar. However, loud dance music and a meat-market atmosphere contradict the sports theme and even the beer garden seems to be an afterthought for the owner and patrons. The Union, with it's bright red, cinder block façade and dark striped awnings is located at the corner of Halsted and George, across the street from from Crush. Although the Gaslight has moved on, the old sign depicting a gaslight is still mounted upon the red-brick exterior above the wooden door. The hanging wooden \"Union\" sign is more visible from Halsted, as well as the giant yellow \"U\" that replaced the old Gaslight logo. Inside lies a long \"L\"-shaped bar (with circling Clydesdales above it) that serves two main areas. The bar and other intricate woodworking around the bar was crafted from the former Gaslight owner's grandfather. The section on the left side of the room features two big screens",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}