{
    "relation": [
        [
            "type",
            "FR Doc.",
            "RIN",
            "WT Docket No.",
            "FCC"
        ],
        [
            "regulations.gov",
            "2014-26062",
            "",
            "10-4",
            "14-138"
        ]
    ],
    "pageTitle": "47 CFR Part 20 - COMMERCIAL MOBILE SERVICES | US Law | LII / Legal Information Institute",
    "title": "",
    "url": "https://www.law.cornell.edu/cfr/text/47/part-20?qt-cfr_tabs=0",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989891.18/warc/CC-MAIN-20150728002309-00165-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 916927965,
    "recordOffset": 916912016,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{988=Title 47 published on 2014-10-01.}",
    "TableContextTimeStampAfterTable": "{27479=Title 47 published on 2014-10-01, 52347=On December 23, 2014, the Wireless Telecommunications Bureau and the Consumer and Governmental Affairs Bureau published a document seeking updated input to better understand the current consumer experience with hearing aid compatible wireless handsets, to explore technical or other barriers to the provision of hearing aid compatible devices on new wireless technologies, and to consider changes to its rules that may be necessary to ensure that wireless handsets used with advanced communications services are accessible in light of directives contained in the Twenty-First Century Communications and Video Accessibility Act (CVAA). The comment date was erroneously published as an effective date and neither the comment nor the comment-reply date was provided. We also failed to provide an address for submission of comments. This document corrects those errors and extends the time within which to file comments and reply comments., 26805=§ 302 - Repealed. June 5, 1936, ch. 511,, 23995=This Order on Remand responds to the court's directive, and specifically examines the interplay between the T-Mobile Order and the rural exemption rule. The Ninth Circuit found that the Commission's T-Mobile Order did not adequately analyze the order's affects upon the rural exemption rule in of the Communications Act of 1934, remanding the order to the Commission for “for further consideration.”}",
    "lastModified": "Mon, 01 Jun 2015 23:37:11 GMT",
    "textBeforeTable": "Additional Documents GPO FDSys XML | Text 80 FR 19738 - Protecting and Promoting the Open Internet 2015-04-13; vol. 80 # 70 - Monday, April 13, 2015 For a complete list of all Rules, Proposed Rules, and Notices view the Rulemaking tab. The following are only the Rules published in the Federal Register after the published date of Title 47. Title 47 published on 2014-10-01. 47 U.S.C. 130220.12316303301251-25420116047 U.S.C. 154 59 FR 18495, Apr. 19, 1994, unless otherwise noted. Source: . is also issued under , and 332 unless otherwise noted. Section , , , , , , Authority:",
    "textAfterTable": "FEDERAL COMMUNICATIONS COMMISSION Final rule. This rule is effective June 12, 2015. The modified information collection requirements in paragraphs 164, 166, 167, 169, 173, 174, 179, 180, and 181 of this document are not applicable until approved by the Office of Management and Budget (OMB). The Federal Communications Commission will publish a separate document in the Federal Register announcing such approval and the relevant effective date(s). 47 CFR Parts 1, 8, and 20 Summary In this document, the Federal Communications Commission (Commission) establishes rules to protect and promote the open Internet. Specifically, the Open Internet Order adopts bright-line rules that prohibit blocking, throttling, and paid prioritization; a rule preventing broadband providers from unreasonably interfering or disadvantaging consumers or edge providers from reaching one another on the Internet; and provides for enhanced transparency into network management practices, network performance, and commercial terms of broadband Internet access service. These rules apply to both fixed and mobile broadband Internet access services. The Order reclassifies broadband Internet access service as a telecommunications service subject to Title II of the Communications Act. Finally, the Order forbears from the majority of Title II provisions, leaving in place a framework that will support regulatory action while simultaneously encouraging broadband investment, innovation, and deployment. 2015-03-04; vol.",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}