{
    "relation": [
        [
            "Name",
            "lineColor",
            "lineWidth",
            "rendered"
        ],
        [
            "Type",
            "colorElType",
            "integerElType",
            "booleanElType"
        ],
        [
            "Required?",
            "No",
            "No",
            "No"
        ],
        [
            "Supports EL?",
            "Yes",
            "Yes",
            "Yes"
        ],
        [
            "Description",
            "Axis line color.",
            "Axis line width.",
            "Determines if the axis line should be rendered."
        ]
    ],
    "pageTitle": "ADF Mobile Framework Tag Library",
    "title": "",
    "url": "http://docs.oracle.com/cd/E37975_01/apirefs.111240/e26230/toc.htm",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 225,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042992543.60/warc/CC-MAIN-20150728002312-00226-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 71876207,
    "recordOffset": 71823853,
    "tableOrientation": "HORIZONTAL",
    "lastModified": "Tue, 11 Nov 2014 21:13:25 GMT",
    "textBeforeTable": "Attributes Definition for the amx page. <adfmf:amx> Tag name: Validates the generic type with the predefined definition. <config:validated> The skin-version element is used to pick a skin during render. A skin is picked by matching the skin-id (required), and if specified here, the skin-version. <config:skin-version> The skin-family element is used to pick a skin during render. You can optionally add the skin-version to pick a particular version of a skin with the same skin-family. <config:skin-family> Generic type is a hierarchical name value pair. <config:generic-type> Conversion is a process associated with the transformation of generic types and java beans/soap messages/json/... <config:conversion> The adfmf-config element is the root element of all adfmf-config.xml files. <config:adfmf-config> Description Name Config Components The version of the skin, if any. <skin:version> The name of the style sheet which defines the styles for this skin addition. <skin:style-sheet-name> A",
    "textAfterTable": "<adfmf:application> Definition for the application. The application is the container that surfaces the included features. Attributes: id - unique id for the application name - human-readable name for the application (should be a RB token) vendor - company/team name of the implementing application version - version of the application Elements: description - a short but detailed description of the application and its purpose. error - deprecated. featureReference - since many features can be bundled with application or Feature Archive the feature reference is used to denote which features are relevant (or can be exposed) by this application. preferences - preferences exposed by the application. navigation - navigation settings for the application. login - login page settings for the application. Attributes Name Type Required? Supports EL? Description id adfmfComponentId Yes No A unique identifier for the application. This is usually a Java package style identifier, for example: com.company.application. name string Yes No The name of the application. vendor string No No An optional field identifying the maker of the application. version string No No An optional field identifying a version for the application.",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}