{
    "relation": [
        [
            "Patent application number",
            "20090078626",
            "20110100898",
            "20120168359",
            "20130043181",
            "20140190880",
            "20140208705",
            "20140250843"
        ],
        [
            "Description",
            "Filter Cartridge Housing Attachment Systems - The present disclosure pertains to a fluid filter having integral attachment means which may take the form of a threaded portion of a filter cartridge. The threaded portion threadably interacts with a complementary threaded portion of a filter mounting to retain the filter cartridge to the filter mounting. The disclosure also pertains to a fluid filter having a cartridge made from two plastic shells welded together. The disclosure also pertains to a fluid filter with filter media positioned within a filter cartridge by an end cap with extending ribs welded to one of the two shells which compose the filter cartridge.",
            "Fluid Filter - A fluid filter includes a base plate, a canister, and filtering media contained in the canister for filtering fluid from an inlet port to an outlet port. Notches are formed into an outer periphery of the base plate. An annular bead of the canister side wall is partially formed into the notches to provide a torque locking mechanism between the base plate and the canister. The terminating lip portion of the canister is wrapped around the outer face of the base plate and formed into an annular trough to directly secure the base plate to the canister. The annular trough includes a diverging outer wall that provides a narrow contact interface between the terminating lip portion and the retention corner of the base plate to thereby reduce moment loads induced therebetween as a result of high fluid pressures in the filter.",
            "VENTED LIQUID FILTER VENTED THROUGH MEDIA - A filter apparatus and filter element therefore are provided. The filter apparatus includes a filter head including an inlet port, a main flow outlet port and a drain flow outlet port. The filter element includes a ring of filter media defining an internal cavity. The filter element defines a main flow passage and a drain flow passage through the internal cavity. Each flow passage has an inlet on a clean side of the filter media directly fluidly communicating with the internal cavity. The main flow passage is fluidly coupled to the main flow outlet port. The drain flow passage is fluidly coupled to the drain flow outlet port. The filter media separates the inlet port from the main flow and drain flow outlet ports.",
            "HYDRAULIC SPIN-ON FILTER CARTRIDGE HAVING BASE PLATE SUPPORTING RADIALLY DIRECTED SEAL - A filter element is provided. The filter element is removably engaged with a filter head having an inlet and an outlet. The filter element includes an outer housing, a filter cartridge, and a baseplate. The filter element further includes a plurality of seals adapted to seal between the baseplate and the filter head, and between the baseplate and the filter cartridge.",
            "Three-Part End Cap and Filter Element Including Same - A multi-component end cap is provided. The multiple components combine to form one or more seal carriers where each seal carrier is formed in part by at least two different ones of the components. Methods of manufacturing an end cap having multiple components are also provided.",
            "Mutli-Pass Fluted Filter - Filter media, filter elements, and method of forming filter media and filter elements are provided. The filter media and filter elements require filtered fluid to pass through filter media twice. The filter media and filter elements generally relate to fluted or similar style filter media. The filter media is formed from convoluted sheets coupled to face sheets to form first and second sets of flutes. At least one of the flute sets includes inlet and outlet seals and the other one of the flutes includes an intermediate seal interposed between the inlet and outlet seals of the other flute set. This forces the fluid to pass through the filter media at least twice.",
            "Side Entry Filter - A filter assembly, filter element, and methods associated therewith are provided. The filter assembly includes a housing and a primary element situated within the housing. The primary filter element is insertable into the housing along a first direction. The primary filter element includes a biasing arrangement for biasing the primary filter element in a second direction transverse to the first direction to form a seal within the housing."
        ],
        [
            "Published",
            "03-26-2009",
            "05-05-2011",
            "07-05-2012",
            "02-21-2013",
            "07-10-2014",
            "07-31-2014",
            "09-11-2014"
        ]
    ],
    "pageTitle": "Krull, US - Patent applications",
    "title": "",
    "url": "http://www.faqs.org/patents/inventor/krull-us-5/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042992543.60/warc/CC-MAIN-20150728002312-00335-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 444458207,
    "recordOffset": 444437773,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Timothy L. Krull, Kearney, NE US 05-03-2012 THERMAL MANAGEMENT MATRIX - A thermal management matrix for an electrochemical cell array including a plurality of electrochemical cell elements, the thermal management matrix at least in part enveloping the electrochemical cell array and being in thermal contact therewith. The thermal management matrix includes mainly expanded graphite, wherein the expanded graphite is arranged in the form of a block-like structure and the block includes at least one layer of expanded graphite having a higher in-plane thermal conductivity than the layers neighboring the layer with higher in-plane thermal conductivity. The thermal management matrix may also include phase change materials as a latent heat storage material. 20120107662 Published Description Patent application number Tim Krull, Kersey, PA US //]]> BarDraw('3357180',['Patent applications by Steven Krull, East Meadow, NY US'],[[1,1,1]],['2006','2009','2015'],0); // <script type=\"text/javascript\"> </div> <div id=\"legend3357180\" align=\"center\"></div> </div> <canvas id=\"bg3357180\" style=\"max-width: 500px; width: 100%;\"></canvas> <div> <p align=\"center\">Patent applications by Steven Krull, East Meadow, NY US</p> <div class=\"bar3357180\" style=\"max-width: 500px; width: 100%; float:left; \"> <div align=\"left\" style=\"padding-top:20px;\"> </table> </tbody> </tr> <td>01-08-2015</td> <td><a href=\"/patents/app/20150012460\">METHOD AND SYSTEM FOR GENERATING A VALUATION METRIC BASED ON GROWTH DATA FACTORS</a> - The present invention relates to a system, method and apparatus for evaluating a variety of financial information, determining a valuation metric, and distributing the valuation metric to system users. The valuation metric distribution may be configured by an administrator for automatic distribution of the valuation metric to",
    "textAfterTable": "Patent applications by Timothy L. Krull, Kearney, NE US Wade A. Krull, Marblehead, MA US Patent application number Description Published 20080200020 Semiconductor device and method of fabricating a semiconductor device - A method is proposed for the fabrication of the gate electrode of a semiconductor device such that the effects of gate depletion are minimized. The method is comprised of a dual deposition process wherein the first step is a very thin layer that is doped very heavily by ion implantation. The second deposition, with an associated ion implant for doping, completes the gate electrode. With the two-deposition process, it is possible to maximize the doping at the gate electrode/gate dielectric interface while minimizing risk of boron penetration of the gate dielectric. A further development of this method includes the patterning of both gate electrode layers with the advantage of utilizing the drain extension and source/drain implants as the gate doping implants and the option of offsetting the two patterns to create an asymmetric device. A method is also provided for the formation of shallow junctions in a semiconductor substrate by diffusion of dopant from an implanted layer contained within a dielectric layer into the semiconductor surface. Further, the",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}