{
    "relation": [
        [
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            ""
        ],
        [
            "Forum",
            "GTA V PC, Gameplay, Guides & Strategies, Help & Support This forum is dedicated to discussion about the latest installment in the series, Grand Theft Auto V.",
            "GTA IV PC, Gameplay, Episodes from Liberty City, Multiplayer, Guides & Strategies, Help & Support This section is dedicated to Grand Theft Auto IV - the ninth title in the series, released in 2008.",
            "GTA Chinatown Wars This forum is dedicated to GTA: Chinatown Wars - the tenth game in the series, and the first to be developed for Nintendo DS.",
            "GTA Vice City Stories This forum is dedicated to GTA: Vice City Stories - a prequel to GTA: Vice City, released in 2006.",
            "GTA Liberty City Stories This forum is dedicated to GTA: Liberty City Stories - the first 3D portable Grand Theft Auto title, released in 2005.",
            "GTA San Andreas Gameplay, Mission Help, Guides & Strategies, Help & Support, PC Modding This forum is dedicated to GTA: San Andreas - the fifth title in the series, released in 2004.",
            "GTA Vice City Gameplay, Guides & Strategies, Help & Support, PC Modding This forum is dedicated to GTA: Vice City - the fourth title in the series, released in 2002.",
            "GTA III Gameplay, Guides & Strategies, Help & Support, PC Modding This section is dedicated to Grand Theft Auto III - the first 3D title in the series, released in 2001.",
            "Top Down Games GTA Advance, GTA 2, GTA This section is dedicated to the 2D Grand Theft Auto titles, including the original, GTA 2, and GTA Advance.",
            "GTA Series GTA Concepts General chat related to the series. This section can also be used to post concept threads for new GTAs."
        ],
        [
            "Stats",
            "85,057 topics 2,123,036 replies",
            "85,545 topics 1,153,472 replies",
            "1,071 topics 11,069 replies",
            "4,218 topics 64,755 replies",
            "5,996 topics 75,804 replies",
            "50,535 topics 466,107 replies",
            "22,767 topics 196,270 replies",
            "4,269 topics 60,411 replies",
            "1,128 topics 8,213 replies",
            "3,595 topics 115,057 replies"
        ],
        [
            "Last Post Info",
            "Is there something we can d... By SuperGTFan 2 minutes ago",
            "Complete Edition vs. Indivi... By Militia 11 minutes ago",
            "The Ultimate 100% Save File... By Militia 2 hours ago",
            "The Most Underrated GTA Ever By DragonpokeZ 14 minutes ago",
            "Why LCS is better than V By DragonpokeZ 7 minutes ago",
            "PROOFED & RARE vehicle... By Militia 25 minutes ago",
            "Reasons why Vice City is be... By DragonpokeZ 27 minutes ago",
            "Grand Theft Auto III Pre-Re... By thehambone 23 minutes ago",
            "v 11.44, where is the radio? By Cerium 19 hours ago",
            "F*ck ,Marry,Kill By TheUnholy 8 minutes ago"
        ]
    ],
    "pageTitle": "GTAForums",
    "title": "",
    "url": "http://gtaforums.com/index.php?act=Post&CODE=06&f=226&t=548939&p=1062316394",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 1,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042981921.1/warc/CC-MAIN-20150728002301-00302-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 112156531,
    "recordOffset": 112132744,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{21196=This section is dedicated to Grand Theft Auto III - the first 3D title in the series, released in 2001., 16810=This forum is dedicated to GTA: San Andreas - the fifth title in the series, released in 2004., 9540=This section is dedicated to Grand Theft Auto IV - the ninth title in the series, released in 2008., 127846=© 2001-2015 GTANet.com | Cookies and Privacy Policy | Copyright Statement, 48062=Google, frodzet, ClaudX, MIGta, Yahoo, Pentalarc, Bing, ssalil, Matomat, Michael5074, OverdrivePedal, iNero, Pavle, SilverRST, Jenna_Taylier, Stafish, SalvatoreCJ1903, Death Anghell, ermaccer, hotline.n.w.refn, Failure, Mockingbae, Zulxer, DragonpokeZ, obv23, MikeyDLuffy, Whoop woop, Lowi, Ryan_Codebreaker, BigStu4q, Kennycal434, Tomasak, NikkoCharger, Hello7734, 12thmanfirefighter, Cornphlake, Jeansowaty, babai0077, jacka, DANIEL3GS, jiggaman1, SuperGTFan, Martins Matraze, Jonnyb41, PoeticWhisper, Geralt of Rivia, gajrajgchouhan, dragoon371, Dondara, RedDagger, lpgunit, Talabick, Semaj 2JZ♢, *Lola, Sigurd, _CP_, SilkySkillz85, Fuzzknuckles, elooto524, Jon3s, Nattyiyaman, GTAKid667, NadoVargas, Hockeynator, xX 5yndicat3 Xx, CarlitoDorito, Big_Boy_Bmw760Li, Niobium, deadx23, Dante9231, fiebru787, Juicyfer, The Mysterious One, A Siente, bossofzeeland, longhurstgb, oCrapaCreeper, Voit Turyv, kBlaise, moBEttablUesz, lh1, CheckOutMyMixtape666, adub, HeavyDuke, whywontyoulisten, Mr. Fahrenheit, Deadman1996, Nightmare3883, r.lorenzo13, BlackMilk, almico, Cover2blitz0, MASTER GABE 202, VideoGameJames, MSFT, ryanhunter_rfc, Searchy, Pharaoh19, ThatGamerChick, GalaxyKane, Megasware128, L00NEY, killstreakmx, BatmanZero1, Quarthon, Ak47clower, Ämpäri, chainsoar, Zondar, Pappkasse, TheMcSame, Scuba 21, miclin, A8ul99, EvilDog77, Svip, B Dawg, AcidRunner, TalkingPear, Cognoscenti, Smale45, Intstringeger, Th3MaN1, ChrissyBoi87, kcchief1981, BigJoe_1, allinclusive, fastman92, Andreas, x_FRoe__, TWERKSCOPEZ, psymin, paperbagdude, Starpaul20, U.N.K.N.O.W.N, toxluv, ancellim, Royal22, trevorjc2511, Walter175, CMCSAVAGE, 8up local, VizionExile, 7 day survivor, Sveittjpong, .JokeR, joshua969, gobbo25, PhillBellic, marhex, Jon Snow, size_m, Rytherik, Max Payne, JRC99, JoeFury1997, SolidUSP, diamond-optic, CaptianBackwoods, Sparky McWonderpants, Lay, Zmey20009, dkluin, blueyez, MGgames100, Friskey x, Anotic, PANiC ATTACK3R, Madhan Amudhan, qiangqiang101, rafaelfiorindo, silentkiller44, sasuke78200, gecko_sniper, MyName'sJeff, TJGM, em1b16a2, CriminaL277, FlacidJack, Stephan90, Eneveon, Chaera, CBH, fullxthrottle94, cruncheee, Sangers, Trevor Philips Inc, StangOne50, kaasje, Doran22, mentalgen, Wesser, Gunslinger_GK, Chang, MKKJ, dyspoid, Gigs84, jdwarfer, Turbocharger, OfficialRedNinja, JayJay77, BWSFxTango, silenthunterdgm, craigdyid, Rented, Terroryaki, ImBurkalicious, thehambone, Carrythxd, el capito, TheUnholy, shiv gujjar, Google Mobile, GreenOnions, Chekoloco, ice_phoenix_66, Tilley, Nyraider77, Majestic81, ImFromSweden1, Kendrick Lamar, enix, RageJenB, Above Omnipotence, zSaintX, ballen205, chomi30, GamerAudio, Marty McFly, Chao§pawN, Stoneman420, scania970, A_Glorious_Spoon, AaronMcG95, RafaelSousaSam, Finn 7 five 11, SmokesWithCigs, KatyPerry, DaBOSS54320, theminted, lolznc, M4k3, Xoonia, KillrZombie, TreFacTor, Bob_Dole, Saint_Jackie, Ben Lahyene, m3tal z_DKI, beretta-gt88, WalterS_LV, aka_senior_84, GamingBunny84, chef_archie, Slasherr, RolfStarGames, Ocelot., ashbashbluesfan, one55, GTA SIX, Retired Mafia, FowardElement, iiConTr0v3rSYx, Tuff Luv Capo, Wybo76, smokingndriving, Peiva's Laahdin, Johnix1, hunk41, sheepy111, ParadoxRusher, Seemly, aleex96, TheJez0r, cheen, VeraVanderpump, SatournFan, idonknowhow, Blade Kratos, Sky_Light12, CataniaTiger, Ivan1997GTA, _F_, Nicinator16, josephene123, Wscratch, machine4578, Dan McChill, bobo_lave, Fox2Quick, bigjpc777, ZakeBudek, NikaFM, Bugglass, Quakex64, blah265, Scorpiomobile, ShadowCola, ZANTHERA, TaazR, Honker1944, 12998=This forum is dedicated to GTA: Vice City Stories - a prequel to GTA: Vice City, released in 2006., 14546=This forum is dedicated to GTA: Liberty City Stories - the first 3D portable Grand Theft Auto title, released in 2005., 19051=This forum is dedicated to GTA: Vice City - the fourth title in the series, released in 2002.}",
    "textBeforeTable": "Toggle Grand Theft Auto Grand Theft Auto (adsbygoogle = window.adsbygoogle || []).push({}); A minute ago By longhurstgb The Paleto Bay Mayors Offic... 613,143 replies 15,170 topics Social lounge for multiplayer crews & forum gangs. Recruitment Crews & Gangs A minute ago By Mockingbae Do You Strem Your Gameplay? 2,276,543 replies 113,067 topics This is a general discussion forum for Grand Theft Auto Online.",
    "textAfterTable": "Toggle GTA Mods GTA Mods   Forum Stats Last Post Info GTA Modding GTA V, GTA IV, GTA III, VC & SA, Tutorials, Art Support General discussion and support. 48,430 topics 416,494 replies [C#] Does anybody have a li... By frodzet 18 minutes ago Mod Showroom Scripts & Plugins, Maps, Total Conversions,",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}