{
    "relation": [
        [
            "Forum",
            "Woodworking Skill Share Your woodworking skills are displayed for several lifetimes in each project. Have you had to compromise your project...",
            "Woodturning On the lathe, by the lathe: do you have questions? frustrations? tips? This forum is for all the woodturners out there.",
            "Woodcarving Relief, 3D, chip-carving, whittling; carving knives, chisels, pocket-knives, power tools. If you are a carver or want...",
            "Scrollsawing Intarsia, fretwork, intricate design cutting and more! This forum is for scrollsawers: share your tips, ask questions...",
            "Joinery Have a question? a tip/strategy to share? a challenge, perhaps? Share your \"joinery\" discussion here.",
            "Finishing The finish, whether paint, wax, stain, or something else, can make or break a project. What are your tips and questio...",
            "Designing Woodworking Projects Looking for information on designing your projects? Having difficulties reading project plans? Looking for help with ...",
            "Power Tools, Hardware and Accessories Are you unsure of which tools, or hardware, you need, or which brands to buy? Investing in tools and hardware can be ...",
            "CNC Woodworking Questions and answers about CNC machines, tooling, best practices, and projects.",
            "Hand Tools Wood, your hand tools, you and a little know-how. Share your questions, tips and strategies for the use and maintenan...",
            "Jigs & Fixtures Using a jig is like having a couple extra hands helping out. Show us your jigs, share your tips, strategies and, of c...",
            "Wood & Lumber Different wood requires different woodworking strategies - from cutting to finishing. Share your tips and challenges ...",
            "Safety in the Woodworking Shop Before you pick up those woodworking tools, take the time to ensure your safety in the shop! Eyes, ears, fingers, and...",
            "Focus on the Workspace Are you looking for or do you have tips to share regarding the workshop? Storage, equipment placement, efficiency, an...",
            "Sweating for Bucks Through Woodworking If you are selling your work, then you have entered a woodworking dimension with added complexity and stress. If you...",
            "Woodworking Trade & Swap All of us are holding onto treasure in our shops, that we either don't need, don't want, or could part with if presen...",
            "LumberJocks.com Site Feedback Connect with the Website Gurus and tell us what you are thinking, suggestions, problems, functionality issues, and so...",
            "Coffee Lounge Need a break from all the standing and wood dust? Chat with your Forum Friends about their projects, their life, thei..."
        ],
        [
            "Topics",
            "10485",
            "1085",
            "222",
            "204",
            "691",
            "3224",
            "5099",
            "21940",
            "71",
            "3851",
            "999",
            "4652",
            "1118",
            "1563",
            "1036",
            "3790",
            "1951",
            "7766"
        ]
    ],
    "pageTitle": "Best wood to use for lathe practice ? - by SuburbanDon @ LumberJocks.com ~ woodworking community",
    "title": "",
    "url": "http://lumberjocks.com/topics/41086",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 5,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988305.14/warc/CC-MAIN-20150728002308-00107-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 140334858,
    "recordOffset": 140318882,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{22419=#11 posted 08-29-2012 01:30 AM, 10257=1043 posts in 1086 days, 28950=#15 posted 08-29-2012 02:35 PM, 23914=#12 posted 08-29-2012 01:47 AM, 3730=#1 posted 08-28-2012 06:11 PM, 20991=#10 posted 08-29-2012 01:28 AM, 13755=-- Unplugged Woodworkers - https://www.facebook.com/groups/213418935481974/, 15616=But, In my opinion it doesn’t have to be a $1000 setup to learn on and see if you like turning., 12399=2880 posts in 1217 days, 12873=I have the HF chisels and did a review on them http://lumberjocks.com/reviews/product/2897. I really like them. I have not been turning for too long, but I learned an important lesson already: If you cannot sharpen your turning tools, you are going to have a bad time. Do some research on keeping your tools sharp. You will need to sharpen them a lot more often than you think. I had a lot of maple scraps that I practiced on. I think that turns quite well. I’m glad I didn’t learn on pine. As Terry mentioned it catches really easy. I wanted to play with some other lathe tools (skews, parting tools) so I chucked up a 2×4 scrap. It actually looked really cool when I was done with it. I found it was a lot more difficult to turn than hardwood though. Your results my vary., 2008=08-28-2012 05:59 PM, 50139=©2015 Verticalscope Inc. All Rights Reserved. | Terms of Service | Privacy Policy, 27557=#14 posted 08-29-2012 02:22 PM, 25525=#13 posted 08-29-2012 06:37 AM, 10409=#5 posted 08-28-2012 10:26 PM, 12551=#6 posted 08-28-2012 10:46 PM, 14923=#7 posted 08-28-2012 10:51 PM, 8795=#4 posted 08-28-2012 10:15 PM, 5379=#2 posted 08-28-2012 07:02 PM, 18714=1567 posts in 1805 days, 18866=#9 posted 08-29-2012 01:27 AM, 6970=#3 posted 08-28-2012 07:02 PM, 17284=#8 posted 08-29-2012 01:19 AM}",
    "textBeforeTable": "Show all forums View all topics Start new topic signed in to reply. You must be Have your say...show last 8 replies showing 1 through 15 of 23 replies View all replies » Pine is good because it’s soft. It requires sharp tools to cut well, plus it’s cheap/free. I also use branches from trees in the yard that I trim, firewood, storm cleanup debris, and like someone mentioned, make friends with a tree service, and you’ll never be wanting. Most times, people want them to clear the debris, and the less they have to haul away, the better. That being said, make sure you don’t get in their way or keep them waiting on you (They won’t). Don’t hesitate to walk right up when you see some working and ask if you could have a few slices from the tree…the worst they can say is no. #",
    "textAfterTable": "All Posts RSS Projects RSS Blog Entries RSS Reviews RSS Forum Topics RSS Site Blog Entries RSS Go to Pulse page » LumberJocks Pulse   Author Latest activity New comments or replies",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}