{
    "relation": [
        [
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            ""
        ],
        [
            "Forum",
            "GTA V PC, Gameplay, Guides & Strategies, Help & Support This forum is dedicated to discussion about the latest installment in the series, Grand Theft Auto V.",
            "GTA IV PC, Gameplay, Episodes from Liberty City, Multiplayer, Guides & Strategies, Help & Support This section is dedicated to Grand Theft Auto IV - the ninth title in the series, released in 2008.",
            "GTA Chinatown Wars This forum is dedicated to GTA: Chinatown Wars - the tenth game in the series, and the first to be developed for Nintendo DS.",
            "GTA Vice City Stories This forum is dedicated to GTA: Vice City Stories - a prequel to GTA: Vice City, released in 2006.",
            "GTA Liberty City Stories This forum is dedicated to GTA: Liberty City Stories - the first 3D portable Grand Theft Auto title, released in 2005.",
            "GTA San Andreas Gameplay, Mission Help, Guides & Strategies, Help & Support, PC Modding This forum is dedicated to GTA: San Andreas - the fifth title in the series, released in 2004.",
            "GTA Vice City Gameplay, Guides & Strategies, Help & Support, PC Modding This forum is dedicated to GTA: Vice City - the fourth title in the series, released in 2002.",
            "GTA III Gameplay, Guides & Strategies, Help & Support, PC Modding This section is dedicated to Grand Theft Auto III - the first 3D title in the series, released in 2001.",
            "Top Down Games GTA Advance, GTA 2, GTA This section is dedicated to the 2D Grand Theft Auto titles, including the original, GTA 2, and GTA Advance.",
            "GTA Series GTA Concepts General chat related to the series. This section can also be used to post concept threads for new GTAs."
        ],
        [
            "Stats",
            "85,057 topics 2,123,043 replies",
            "85,545 topics 1,153,472 replies",
            "1,071 topics 11,069 replies",
            "4,218 topics 64,755 replies",
            "5,996 topics 75,806 replies",
            "50,535 topics 466,111 replies",
            "22,767 topics 196,270 replies",
            "4,269 topics 60,411 replies",
            "1,128 topics 8,213 replies",
            "3,595 topics 115,057 replies"
        ],
        [
            "Last Post Info",
            "Is Michael Townley the best... By SuperGTFan 7 minutes ago",
            "Complete Edition vs. Indivi... By Militia 32 minutes ago",
            "The Ultimate 100% Save File... By Militia 3 hours ago",
            "The Most Underrated GTA Ever By DragonpokeZ 35 minutes ago",
            "Why LCS is better than V By Militia A minute ago",
            "PROOFED & RARE vehicle... By Militia A minute ago",
            "Reasons why Vice City is be... By DragonpokeZ 48 minutes ago",
            "Grand Theft Auto III Pre-Re... By thehambone 44 minutes ago",
            "v 11.44, where is the radio? By Cerium 19 hours ago",
            "F*ck ,Marry,Kill By TheUnholy 29 minutes ago"
        ]
    ],
    "pageTitle": "GTAForums",
    "title": "",
    "url": "http://gtaforums.com/index.php?act=Post&CODE=06&f=1&t=550515&p=1062357969",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 1,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042981921.1/warc/CC-MAIN-20150728002301-00158-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 113860267,
    "recordOffset": 113834366,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{47706=Google, Bing, CaptianBackwoods, Yahoo, Majesticnug420, //XP//, sewersss, WinkingSkeever6, GTAKid667, killstreakmx, VikDarkbomb, Charmlessrogue, Chaera, Failure, Cornerstone, nWoMember, clevertrev, SuperGTFan, whywontyoulisten, size_m, Rytherik, Big_Boy_Bmw760Li, JRC99, OfficialRedNinja, arziben, JenzXD, m3tal z_DKI, sasuke78200, TheIceWarrior, ur step dad, ashank975, joe grizzly, B3RTY B0Y, Jenna_Taylier, silentkiller44, TyphoonJames, Moryachok, MyName'sJeff, missanthropy, RedDagger, CMCSAVAGE, Juicyfer, tsouryavong13, fazedevil, SuperHolySheep, _F_, arewenotmen, DuPz0r, Shamone, DeaconBlues, jonty_pearcey, MovingTarget268, x_FRoe__, Jonnyb41, PANiC ATTACK3R, Rapid-Wizard, Andreas, miclin, Edmachine, rotnude, toxluv, DentureDynamite, s2n vaniish, -Velox, synn8773, Summertime, Jon3s, Gigs84, Martins Matraze, Mr. Jago, Doran22, Retired Mafia, ApexReclaimer, oleg_aka_djmeg, Wheelo, DeltaEliteKing9, Max Payne, Between3and20chars, ESClassic, Ajvallejo12, Scuba 21, Z5_Zeus, ndyerger, DragonSpade, sweller, fullxthrottle94, gtaguy95, Shadowfennekin, TheRegisterYouRob, Nutduster, BlackMilk, Otter, NoSignal666, shadowkill98, TalkingPear, psymin, Eram, goldadderXD, Samutz, Fuzzknuckles, GTA717, VideoGameJames, pggosbee, BeastRz, Hello7734, MikeyDLuffy, LordRaijin, TheN00ster, L00NEY, deadx23, Above Omnipotence, Dellers, cj2000, _Douglas_, Tank, Rented, Alvarez, Met-Hörnchen, Dern Sure, SwaGGer_1337, 7 day survivor, HunterGatherer, Rangerlump, Itzreality, Twang., gunziness, Th3MaN1, joshua969, DaBOSS54320, CoCkPuNcH, COYBIG88, ChrissyBoi87, leftas, Black_MiD, lolznc, Sentinel Driver, Deceptix, tails_prower_2040, Flight180Victm, SolidUSP, XB36Hazard, bossofzeeland, onoudint, Google Mobile, Azrul_Hafiy, sherip008, p-s-3x, CamxxCore, Dillono, UltimateAntic, poddy2009, PhilosophicalZebra, unknown modder, Lowi, fastman92, M4k3, Dondara, ImBurkalicious, StefcioPL, jackmap, coach_wargo, El-Gaddafii, Gamer Rachel, kulomet333, Katabasis, CataniaTiger, TDWP_Adam, Stephan90, hitman774, Modojo, Michael5074, Dante9231, VizionExile, Schnutzzz, WhyDoINeedAName, Alexa, The Duke35, MF Modding, Bosnian Studios, Kendrick Lamar, DANIEL3GS, idonknowhow, 85 Diplomat, Dylricho, frodzet, chinchin007, Holo fenix, Heisenberg_GR, Megasware128, Daniel MCH, ShrewdSpirit, xoutlaww, MrRyanMcCall, kBlaise, xXepicjasaXx, trevorjc2511, elfoam, Matomat, Karlitoz-E, Eqaulo, Cross93, paperbagdude, 12thmanfirefighter, Phthalate, FlacidJack, diamond-optic, Mockingbae, Stolen_X, NotTodayyJunior, _Shark, Dbzk1999, Cornphlake, Judicious 7, ExDe707, gtaforums2, Kampioen, Hockeynator, obv23, TwisterVictor1, Jawz_cod, ThatCarGuy, Yungclaygod, Bender.ㅤ, RJSanModder, Djeli, Lebowski_RS, SalvatoreCJ1903, DragonpokeZ, CarlitoDorito, iNero, nickyburst, Zoolock, sheepy111, GTAandStuff, Share Sharqi, lolya, Mustangs1753, Zibulaatio, CarimboHanky, LibertyViceSantos555, chef_archie, Ray, Alfred Packer, xX 5yndicat3 Xx, scania970, gtuned, Wscratch, Khumaro, saintsrow, Ryan_Codebreaker, vladicorp, CML99, SILENCOM, Squirrel__Army, Bob_Dole, B Dawg, Anotic, Majestic81, jerryinohio78, PaidToGetHigh, Matttheking2015, svanderman, Beastly40, wingoose, JimmyFantastic, Brabham, ClaudX, LukeyDukey1988, RageFaceMax, dakotabiscan, AzR_MaNiiAkixS, REXX93, FabianWalker, ItsThatGuy!, TreFacTor, TheUnholy, eimaj1779, Quebahombre, ballen205, akil12, Jsk2003, 12864=This forum is dedicated to GTA: Vice City Stories - a prequel to GTA: Vice City, released in 2006., 21151=This section is dedicated to Grand Theft Auto III - the first 3D title in the series, released in 2001., 14412=This forum is dedicated to GTA: Liberty City Stories - the first 3D portable Grand Theft Auto title, released in 2005., 121399=© 2001-2015 GTANet.com | Cookies and Privacy Policy | Copyright Statement, 19006=This forum is dedicated to GTA: Vice City - the fourth title in the series, released in 2002., 9406=This section is dedicated to Grand Theft Auto IV - the ninth title in the series, released in 2008., 16767=This forum is dedicated to GTA: San Andreas - the fifth title in the series, released in 2004.}",
    "textBeforeTable": "Toggle Grand Theft Auto Grand Theft Auto (adsbygoogle = window.adsbygoogle || []).push({}); 11 minutes ago By Maxxi Roman Bellic Enterprises 613,146 replies 15,170 topics Social lounge for multiplayer crews & forum gangs. Recruitment Crews & Gangs A minute ago By LordRaijin Freeroam Co-op Missions 2,276,576 replies 113,068 topics This is a general discussion forum for Grand Theft Auto Online. Help & Support Guides & Strategies,",
    "textAfterTable": "Toggle GTA Mods GTA Mods   Forum Stats Last Post Info GTA Modding GTA V, GTA IV, GTA III, VC & SA, Tutorials, Art Support General discussion and support. 48,430 topics 416,502 replies Weird crash By MF Modding A minute ago Mod Showroom Scripts & Plugins, Maps, Total Conversions, Vehicles, Textures, Characters,",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}