{
    "relation": [
        [
            "Cited Patent",
            "US1082532 *",
            "US1894273 *",
            "US2193406 *",
            "US2419863 *",
            "US2903610 *",
            "US3409788 *",
            "US3465184 *",
            "US3465186 *"
        ],
        [
            "Filing date",
            "Feb 21, 1911",
            "Dec 2, 1931",
            "Aug 28, 1937",
            "May 11, 1944",
            "Jul 22, 1957",
            "May 18, 1965",
            "Apr 27, 1967",
            "Apr 27, 1967"
        ],
        [
            "Publication date",
            "Dec 30, 1913",
            "Jan 17, 1933",
            "Mar 12, 1940",
            "Apr 29, 1947",
            "Sep 8, 1959",
            "Nov 5, 1968",
            "Sep 2, 1969",
            "Sep 2, 1969"
        ],
        [
            "Applicant",
            "Westinghouse Electric & Mfg Co",
            "Bbc Brown Boveri & Cie",
            "Gen Electric",
            "Gen Electric",
            "Labinal Sa Ets",
            "Ass Elect Ind",
            "Gen Electric",
            "Gen Electric"
        ],
        [
            "Title",
            "Dynamo-electric machine.",
            "Electric machine rotor",
            "Dynamo-electric machine",
            "Laminated rotor for dynamoelectric machines",
            "Dynamo-electric machine field magnet construction with split poles",
            "Spark suppressor for commutating electrical machines",
            "Fluid cooled electric motor having a speed indicating arrangement",
            "Dynamoelectric machine and methods of manufacturing armature assemblies therefor"
        ]
    ],
    "pageTitle": "Patent US3562568 - High performance dynamoelectric machine with permanent magnet stator - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US3562568?ie=ISO-8859-1",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 5,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990114.79/warc/CC-MAIN-20150728002310-00199-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 474493059,
    "recordOffset": 474470590,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{9099=[52] U.S. Cl 310/154, 310/225, 310/216, 310/182 [51] Int. Cl H02h 21/26 [50] Field of Search... 310/220- 3,465,184 9/1969 Armstrong et a1. 310/66 3,465,186 9/1969 Susdorfet 310/158 2,419,863 4/1949 Ware 310/211 Primary Examiner-D. F. Duggan Att0rneys.lohn M. Stoudt, Radford M. Reams, Frank L., 31544=Even though in the illustrated exemplification the rotor is shown as having two stub shafts, each supported in one of the bearing assemblies 27, only the stub shaft 62 is required when the motor is of the type disclosed in US Pat. No. 2.522.985, issued to H. C. Bradley on Sept. 19, 1950 and assigned to the assignee of the present invention. That patent illustrates a rotor supporting structure in which the rotor is supported for rotation solely by means of a single bearing assembly which rotatably supports the rotor shaft on only one side of the rotor core, thereby eliminating the necessity of the second stub shaft 65 and its associated bearing assembly., 29415=Referring now to FIG. 6, there is shown a side elevational view partly broken away of a complete rotor 1 1. In FIG. 6, the outer surface of magnetic core 57 is covered with a relatively thin, hardened layer 68 of adherent insulating material. The layer 68 also extends over the outer surfaces of stub shafts 62 and 65 in the vicinity of magnetic core 57 as shown in FIG. 6. Layer 68 may comprise, for instance, synthetic polyester resins of the type disclosed in US. Pat. No. 2,936,296 issued to Frank M. Precopio and Daniel W. Fox on May 10, l960, and assigned to the assignee of the present invention. Layer 68 serves to insulate magnetic core 57 and stub shafts 62 and 65 Layers on the order of 0.003 inches (3 mils) in radial thickness have been found quite adequate in actual practice for this purpose.}",
    "textBeforeTable": "Patent Citations 18. A rotor for a dynamoelectric machine including a magnetic core comprised of a plurality of laminations secured together by an interlaminate adhesive, at least one stub shaft having a surface shaped for mating with a surface on an associated end of said core, said stub shaft being adhesively secured to said core, a commutator mounted on said stub 1 shaft, and a plurality of armature coils wound on said core and j connected to said commutator; said laminations, said surface shaped for mating, and said surface on an associated end of said core being cone-shaped. l7. dynamoelectric machine comprising a stator including a shell and at least two magnetic poles defining a bore; a rotor mounted in the bore for rotation relative to said stator, said rotor including a magnetic core comprised of a plurality of laminations secured together by an interlaminate adhesive, at leastone stub shaft having a surface shaped for mating with a surface on an associated end of said core, said stub shaft being adhesively secured to said core, a commutator mounted onsaid stub shaft, a plurality of armature coils wound on said core and connected to said commutator, and a second stub shaft having a surface shaped for mating with a surface on the other end of said core; said surface of said at least one stub shaft and said surface of said second stub shaft being complementary, the",
    "textAfterTable": "* Cited by examiner Referenced by Citing Patent Filing date Publication date Applicant Title US4088177 * Jan 7, 1976 May 9, 1978 General Electric Company Permanent magnet D.C. dynamoelectric machine and method of making same US4210836 * Apr 10, 1978 Jul 1, 1980 Westinghouse Electric Corp. Permanent magnet generator US4329609 * Jun 25, 1980 May 11, 1982 Alsthom Atlantique Rotor with a damper screen for an alternator with projecting poles US4392073 * Sep 15, 1978 Jul 5, 1983 General Electric Company Dynamoelectric machine stator having concentric amorphous metal laminations and method of making same US6819016 Jul 18, 2002 Nov 16, 2004 Tm4 Inc. Liquid cooling arrangement for electric machines US6992411 Nov 12, 2004 Jan 31, 2006 Tm4, Inc. Liquid cooling arrangement for electric machines",
    "hasKeyColumn": true,
    "keyColumnIndex": 4,
    "headerRowIndex": 0
}