{
    "relation": [
        [
            "Citing Patent",
            "US6315901 *",
            "US6544476 *",
            "US7225079",
            "US20020004896 *",
            "EP1168122A2 *"
        ],
        [
            "Filing date",
            "Mar 17, 2000",
            "Apr 20, 1999",
            "Dec 2, 2002",
            "Jun 28, 2001",
            "Jun 27, 2001"
        ],
        [
            "Publication date",
            "Nov 13, 2001",
            "Apr 8, 2003",
            "May 29, 2007",
            "Jan 10, 2002",
            "Jan 2, 2002"
        ],
        [
            "Applicant",
            "Shimadzu Corporation",
            "Hitachi, Ltd.",
            "Transgenomic, Inc.",
            "Rintaro Nakatani",
            "Seiko Instruments Inc."
        ],
        [
            "Title",
            "Liquid chromatography",
            "Automatic analyzer capable of restricting usable operation functions",
            "System and method for automated matched ion polynucleotide chromatography",
            "Analyzer system",
            "Analyzer system"
        ]
    ],
    "pageTitle": "Patent US6036856 - Liquid chromatograph and method of outputting an analysis result of the same - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US6036856?dq=6246862",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 6,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042981460.12/warc/CC-MAIN-20150728002301-00309-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 477540255,
    "recordOffset": 477519115,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Patent Citations Further, since a new item name can be added to an output format of the analysis result when the item name to be output does not exist in the database, it is possible to easily customize the analysis system by the analyst and to flexibly generate the output format. Since an analyst can easily edit and output an output format of an analysis result in a desired output format using a pre-provided database, it is possible to easily cope with request of analysts in various fields using one analysis system and to improve the analysis efficiency. The following effects can be attained by the present invention. Step 110: After completion of all analyses, the analyst logs off to the data processing unit 306. Step 109: In a case where the re-calculation is not necessary and an analysis of another sample is performed, the processing is returned to Step 102 to reset the system configuration. Step 108: In a case where the analysis data is tried to be performed once more after checking the analysis result, that is, where the data processing condition is changed or where the item name output to the analysis result is changed, the processing is returned to Step 104 to reset the data processing condition again. Step 107: The analyst outputs the analysis result in a form of report using the output unit 307. After measurement, the chromatographic data measured according to",
    "textAfterTable": "US5755559 * Jun 26, 1996 May 26, 1998 Isco, Inc. Apparatus and method for pumping supercritical fluid and measuring flow thereof US5804142 * Nov 26, 1996 Sep 8, 1998 Hitachi, Ltd. Chromatograph system and method for maintaining system suitability thereof US5830353 * Apr 4, 1997 Nov 3, 1998 Hewlett-Packard Company Oven safety feature US5938931 * Oct 28, 1997 Aug 17, 1999 Hitachi, Ltd. Method for processing liquid chromatographic data * Cited by examiner Referenced by Citing Patent Filing date Publication date Applicant Title US6315901 * Mar 17, 2000 Nov 13, 2001 Shimadzu Corporation Liquid chromatography US6544476 * Apr 20, 1999 Apr 8, 2003 Hitachi, Ltd. Automatic analyzer capable of restricting usable operation functions US7225079",
    "hasKeyColumn": true,
    "keyColumnIndex": 3,
    "headerRowIndex": 0
}