{
    "relation": [
        [
            "Categories",
            "Greek Life",
            "Clubs and Activities",
            "Great for these types of students",
            "Bang for the buck",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "I have not experienced Greek Life.",
            "I haven't experiences any clubs or activities but I have heard great things!",
            "Students who want to make a difference and who enjoy being a part of a big family. Indiana University Southeast makes every student feel like they belong and that they are valued.",
            "To attend Indiana University Southeast, it is much cheaper and a great school.",
            "Relax on campus, attend cultural events and musicals, and shop the bookstore!",
            "The food is acceptable at times, it just all depends on what you like. The area to dine is outstanding. Always clean and tidy.",
            "I do not live in the dorms but I have friends who live in them and I have visited frequently and they are fantastic!",
            "Do not procrastinate your duties to be an outstanding college student. Go above and beyond, it is worth it!",
            "Extremely helpful and caring! The administrators go above and beyond to help in anyway they can if it's an email or a phone call. They make sure you're on the path to success."
        ]
    ],
    "pageTitle": "Indiana University-Southeast Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Indiana-University-Southeast/reviews",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042985140.15/warc/CC-MAIN-20150728002305-00127-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 893218663,
    "recordOffset": 893184551,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{152905=© 2015, Cappex.com, LLC, 145560=During 1130-130 the wait to get food is at its longest. The food I have had is about the same as fast food quality; not so nutritious but pleasant to the tastebuds. Along with the longer wait during 1130-130 the lunch room is also more crowded. The chairs are regular plastic chairs unless you are lucky enough to catch a seat in the few sofas that surround a T.V. Some chairs sit higher up so the view outside into the campus's pond and wildlife (squirrels, geese, etc.) is visible., 59742=I have not gone to school there yet. i start in august., 60773=I have not gone to school there yet. i start in august., 61260=I have not gone to school there yet. i start in august., 60088=I have not gone to school there yet. i start in august., 61022=I have not gone to school there yet. i start in august., 60428=I have not gone to school there yet. i start in august., 59394=I have not gone to school there yet. i start in august., 59044=I have not gone to school there yet. i start in august., 22689=Living on campus is pricey, but worth it!! The book are expensive (but that is everywhere! Unless you know how to work the system), but I'm only spending about $12000 a year, including all other expenses. It may seem like a ton of money, but compared to surrounding colleges this is nothing!}",
    "textBeforeTable": "10/12/2010 Reviewer is A current student here. 5 out of 5 people found this review useful. 1 of 39 Allison from Seymour, IN Check out reviews left by other students or leave your own review. You could win a free scholarship. Indiana University-Southeast Reviews Indiana University-Southeast › Indiana › By State › Colleges › } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.create', -->",
    "textAfterTable": "Bang for the buck I am from Hillview (Bullitt County, KY) and I still pay the in-state tuition charge for IN! It's a great value and a whole lot cheaper than the Louisville schools. It takes about 25 minutes to get to class, and parking isn't too bad if you hit it just right. Am enjoying being here I have been generally accepted by all - teachers, classmates, school staff. I am a 42 yr old returning student and fit in just like I was 22. Am learning a lot I have been challenged by the teachers and professors. The classes are very interesting and a lot more fun than 15 yrs ago!! Login to rate or flag the reviews Christopher from New Albany, IN 07/20/2011 Reviewer is A past student here. 1 out of 1 people found this review useful. 3 of 39 Categories Comments Bang for the",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}