{
    "relation": [
        [
            "Categories",
            "Campus Safety",
            "Greek Life",
            "Clubs and Activities",
            "Great for these types of students",
            "Share any unusual traditions or locations on campus",
            "Bang for the buck",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "I feel very safe on campus.",
            "I don't think there's any Greek life.",
            "There's a wide variety of clubs and sports to join.",
            "Great for film students and anyone willing to learn.",
            "There's a fiesta every year held by the Latino club.",
            "I'd advise everyone to join a club and get involved in the student life because you can miss out on a lot of fun if you don't.",
            "There's a lot of clubs you can be a part of.",
            "Not a greasy selection.",
            "There are no dorms.",
            "Be open minded and ready to learn because the teachers are very wise and can teach you a lot.",
            "This school is very clean and pretty. The advisors are very helpful. The teachers are really nice and I've learned a lot from them."
        ]
    ],
    "pageTitle": "Scottsdale Community College Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Scottsdale-Community-College/reviews?_escaped_fragment_=/show/2679",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438044160065.87/warc/CC-MAIN-20150728004240-00001-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 899208815,
    "recordOffset": 899166531,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{170630=Come on in. Take a tour. See the grounds. Talk to the students. Scottsdale offers a fantastic honors scholarship program that I took advantage of as soon as I started. Either by high school rankings or by testing high enough in the placement exams, you can be eligible for the President's scholarship. Study for the placement tests if your high school grades are not indicative of your work ethic. The $1200 two year scholarship can really help you focus your studies., 187587=© 2015, Cappex.com, LLC, 117058=There is a story about the mascot and school colors that can be told by a few of the professors. Also, traffic is the worse between 10:30-1:30, going and leaving, so if you have a class that ends at 1:15, hang around for a while to avoid traffic., 4758=Try to score high on the placement test so you can apply for the honors program. The honors program gives you a two year scholarship at $1080 a semester for this school. I ended up paying very little for school.}",
    "textBeforeTable": "12/14/2009 Reviewer is A current student here. 3 out of 3 people found this review useful. 1 of 43 Allison from Phoenix, AZ Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5",
    "textAfterTable": "Am enjoying being here Except for a few problems with registration my time at this college has been enjoyable. Am learning a lot So far all of my teachers have been very knowledgeable and helpful. The subjects are taught effectively and interestingly. I especially enjoyed Anthropology with Lisa Cole and Honors Forum with Suzanne Schlapkohl. Login to rate or flag the reviews Imran from Phoenix, AZ 01/18/2012 Reviewer is A current student here. 1 out of 1 people found this review useful. 3 of 43 Categories Comments Share any unusual traditions or locations on campus Every 2-3 weeks there is an event set up by the Language/Communication building which allows students to perform any skills which they may have. This can be something as simple as reciting one of your favorite poems or one you have created, to playing guitar or beatboxing for an audience that cheers you on. In addition, there is always free pizza, drinks, and",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}