{
    "relation": [
        [
            "Part number",
            "70F0 / 70F1",
            "610012X",
            "610024X"
        ],
        [
            "Description",
            "Lenovo ThinkServer SA120",
            "EXP2512 Storage Enclosure",
            "EXP2524 Storage Enclosure"
        ],
        [
            "Maximum quantity supported per one controller",
            "8",
            "17",
            "9"
        ]
    ],
    "pageTitle": "IBM Redbooks | System x3850 X5",
    "title": "",
    "url": "http://www.redbooks.ibm.com/Redbooks.nsf/RedbookAbstracts/tips0817.html?Open",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042985140.15/warc/CC-MAIN-20150728002305-00286-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 666690159,
    "recordOffset": 666657390,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{18567=Changes in the March 18 update: * Added support for the ThinkServer SA120 Storage Array * Added the Lenovo Financial Services section, 20219=This document is being moved! In September 2015, this document will be moved to lenovopress.com and will no longer be available on the IBM Redbooks site. Please bookmark the URL http://lenovopress.com/TIPS0817 to access this specific document both today and after the migration in September.}",
    "TableContextTimeStampAfterTable": "{197792=Publish Date 06 April 2011, 197847=Last Update 18 March 2015, 35804=All H models include either 256 GB, 512 GB or 1024 GB of RAM, SAS disk drives, and a high IOPS solid-state storage PCIe adapter.}",
    "lastModified": "Wed, 29 Jul 2015 00:38:58 GMT",
    "textBeforeTable": "Standard specifications The following table lists the standard specifications. Table 1. Standard specifications Back to top Locations of key components Figure 2 shows the front of the server with the front bezel removed. Figure 2. Front view of the System x3850 X5 Figure 3 shows the rear of the server. Figure 3. Rear view of the System x3850 X5 Figure 4 shows the locations of key components inside the server. Figure 4. Inside view of the System x3850 X5 The x3850 X5 supports the addition of the MAX5 memory expansion unit. This 1U device is cabled directly to the server and provides an additional 512 GB of memory capacity for applications that can benefit from the extra RAM. Figure 5 shows the MAX5 optional memory expansion unit. Figure 5. Inside view of the MAX5 optional memory expansion unit for the System x3850 X5",
    "textAfterTable": "One server with MAX5 memory expansion unit (5U rack-mounted complex) Two servers with two MAX5 memory expansion units (10U rack-mounted complex) Processor type Machine type 7143: Intel Xeon E7-8800 and E7-4800 families, up to 10 cores. Number of processors Most models: 2 standard (some 4 standard); 4 maximum. Cache (max) Up to 30 MB L3 cache Memory DIMM sockets Up to eight memory cards, each with eight DIMM sockets (64 DIMM sockets total). MAX5 adds 32 DIMM sockets. Memory maximums 2.0 TB using 32 GB DIMMs. Up to 3.0 TB with the addition of MAX5. With two x3850 X5 servers and two MAX5 units, total capacity up to 6.0 TB Expansion slots Eight slots total: Seven PCIe 2.0 slots (one used by 10 Gb Ethernet card, if included). One PCIe 2.0 slot for supported RAID card. Disk bays Eight 2.5\" hot-swap SAS or sixteen 1.8\" solid-state drives (SSD). Maximum internal storage Using NL SAS HDDs: 8 TB per chassis with eight 1 TB drives Using 2. 5-inch SSDs: 12.8",
    "hasKeyColumn": true,
    "keyColumnIndex": 1,
    "headerRowIndex": 0
}