{
    "relation": [
        [
            "First Name",
            "Steven E.",
            "David H.",
            "Philip E."
        ],
        [
            "Last Name",
            "Bachmann",
            "Morrison",
            "Ruter"
        ],
        [
            "Suffix",
            "",
            "",
            ""
        ],
        [
            "Covered Official Position (if applicable)",
            "",
            "",
            ""
        ],
        [
            "New",
            "",
            "",
            ""
        ]
    ],
    "pageTitle": "LD-2 Disclosure Form",
    "title": "",
    "url": "http://soprweb.senate.gov/index.cfm?event=getFilingDetails&filingID=BB259285-6DAC-464B-B40E-5A1B3D86A8EB&filingTypeID=60",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042985140.15/warc/CC-MAIN-20150728002305-00210-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 226043703,
    "recordOffset": 226030177,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{29458=H.R. XXXX and S. XXXX, Department of Defense Appropriations Act, 2011, Defense and Intelligence Appropriations Programs. H.R. 5136 and S. 3454, National Defense Authorization Act for Fiscal Year 2011, Defense Authorization Programs. H.R. 5298 and S. 3361, The Fair Defense Competition Act, Defense and Trade Issues. Foreign Military Sales. Export Controls. Airborne Tanker. Air Mobility Programs. Defense Aviation Logistics Services and Maintenance Support. Unmanned Systems. Navy and Air Force Tactical Aviation Shortfall. Defense Cooperation Treaties. Military Satellites Communications Programs. Communications Science and Technology. Manufacturing Research and Development. Cyber Security / Cyber Command. Missile Defense Programs., 1019=Lobbying Disclosure Act of 1995 (Section 5) - All Filers Are Required to Complete This Page, 23154=H.R. XXXX and S. XXXX, The Department of State, Foreign Operations and Related Programs Appropriations Act, 2011, Export Issues. Export - Import Bank Issues. 150 International Affairs Budget., 62225=H.R. 1409 and S. 560, Employee Free Choice Act of 2009, Immigration. H.R. 4072, American Manufacturing Efficiency & Retraining Investment Collaboration (AMERICA) Act, Workforce Issues. Senators Lieberman and Collins Acquisition Workforce Improvement Acts. Protecting America's Workers Act., 43335=H.R. 2454, American Clean Energy and Security Act of 2009, Clean Fuel. S. 1733, Clean Energy Jobs and American Power Act, Clean Fuel. Climate Change / Environmental Issues / Bio-Fuels. Renewable Energy Production Tax Credit Expansion., 58924=H.R. XXXX and S. XXXX, Intelligence Authorization Act for 2010, Intelligence Community Issues., 66315=H.R. 422 and S. 1203, Amend the Internal Revenue Code of 1986 on Alternative Simplified Research Credit, R&D Tax Credit. H.R. 2438, Amend the Internal Revenue Code of 1986 on Temporary Bonus Research Credit for Energy-related Research, Tax Issue. H.R. 4213, The Tax Extenders Act of 2009, Tax Issue. H.R. 4213, The American Jobs and Closing Tax Loopholes Act of 2010, Tax Code. Derivatives Tax. Renewable Energy Production Tax Credit. Exercise Tax on Self Funded Health Plans. Domestic Manufacturing Deduction. Med Part D Prescription Drug Deduction Denial. Bank Tax. 48C and R&D Credit., 54522=H.R. XXXX, S. XXXX, Department of Homeland Security Appropriations Act for 2011, Homeland Security Appropriations Programs. H.R. 4842, Homeland Security Science and Technology Act of 2010, Technology. S. 773, Cybersecurity Act of 2009, Cyber Issues. S. 3538, National Cyber Infrastructure Protection Act of 2010, Cyber Operations. H.R. 5548, S. 3840, Protecting Cyberspace as a National Asset Act of 2010, Cyber Security. Border Security. Homeland Security Technology. Maritime Security. Container Security. Aviation Security. Cyber Security. Bioterrorism., 74338=H.R. 2710, Enhancing Science, Technology, Engineering, and Mathematics (STEM) Education Act of 2009, Workforce Education. Workforce Investment Act. America COMPETES Reauthorization and Elementary Secondary Education Act. H. Res. 1341, Reauthorization of the Elementary and Secondary Education Act (ESEA), Education Support. S. 2901, Acquisition Workforce Improvement Act of 2009, Federal Workforce Education. S. 2902, Federal Acquisition Institute Improvement Act of 2009, Federal Workforce Education., 18601=H.R. 1586, FAA Air Transportation Modernization & Safety Improvement Act, FAA Funding. H.R. 4714, National Transportation Safety Board (NTSB) Reauthorization Act of 2010, FAA Funding., 12248=H.R. 1586, FAA Air Transportation Modernization & Safety Improvement Act, FAA Funding. H.R. 5611, FAA Extension Act of 2010, FAA Funding. H.R. XXXX, Commerce, Justice, Science, and Related Agencies Appropriations Act, 2011, NASA Funding. H.R. 4714, National Transportation Safety Board (NTSB) Reauthorization Act of 2010, FAA Funding. H.R. 3819, To extend the commercial space transportation liability regime, Space exploration. International Space Station Funding and Safety. Aeronautics. Commercial Space Launch. Science Education. Space Exploration. Science Programs - NASA. Science Programs - NOAA. Space Shuttle. Space Station. Constellation Program. Next Generation Air Traffic Management. Pilot Training Issues. Aviation Safety., 46207=S. 3217, Restoring American Financial Stability Act of 2010, Financial Institutions. Systemic Risk / Resolution Authority. H.R. 4173, Wall Street Reform and Consumer Protection Act, Financial Activities., 48472=H.R. 2194, Iran Refined Petroleum Sanctions Act of 2009, Financing Issues. S. 2799, Comprehensive Iran Sanctions, Accountability, and Divestment Act of 2009, Financing Issues. H.R. 2410, Foreign Relations Authorization Act, FY2010 and 2011, State Department funding. H.R. 3642 and S. 1707, Enhanced Partnership with Pakistan Act of 2009, International Trade. Export Administration Act. US - Turkey Relations. US - Russia Relations. US - Saudi Relations. US - India Relations. US - China Relations. US - Denmark Relations. US - Libya Relations. US - Thai Relations. US - Greece Relations. US - New Zealand Relations. US - Azerbaijan Relations. US - Turkmenistan Relations. US - Japan Relations. US - Qatar Relations. US - Brazil Relations. US - Algeria Relations. US - Ethiopia Relations. US - Nepal Relations. US - Taiwan Relations. US - Egypt Relations. US - UK Treaty. US - Australia Treaty. US - Central Asia Relations. US - Vietnam Relations. US - Ukraine Relations. Congressional Export Working Group., 52264=H.R. 3590, The Patient Protection and Affordable Care Act, Heath Care. H.R. 4872, The Health Care & Education Affordability Reconciliation Act of 2010, Heath Care. IRC 152(f)(1). Annual Limits., 69005=H.R. 4128 and S. 891, Conflict Minerals Trade Act, Trade Issues. Support for Commercial Aircraft Sales in Pakistan, Turkey, Turkmenistan, Thailand, New Zealand, Russia, Ethiopia, Trinidad, Mexico, Azerbaijan, Bangladesh, Qatar, Saudi, Vietnam, Poland, India, Ukraine, Nepal, and Japan. Support for Free Trade Agreements with Panama, Colombia, and Korea. S. 1631, Customs Facilitation and Trade Enforcement Reauthorization Act of 2009, Trade. H.R. 4866, Rare Earths Supply Chain Technology and Resources Transformation Act of 2010 (RESTART), Trade Issues. Support for U.S. case at World Trade Organization against EU subsides to Airbus. Export Controls on Commercial Satellites and Civil Aviation. Trade related aspects of climate change. China Trade Issues. Support for Arms Sales Overseas. Customs / Trade Facilitation Issues. Russia Trade Issues. Trade and Export Finance Issues with Canada.}",
    "textBeforeTable": "",
    "textAfterTable": "State VA Zip Code 22209 Country USA 3. Principal place of business (if different than line 2) City  Chicago State  IL Zip Code  60606 Country  USA 4a. Contact Name b. Telephone Number c. E-mail  Mr.  RICHARD F. SCHWAB  7034653686  richard.f.schwab@boeing.com 5. Senate ID#  6597-12 7. Client Name Self Check if client is a state or local government or",
    "hasKeyColumn": true,
    "keyColumnIndex": 1,
    "headerRowIndex": 0
}