{
    "relation": [
        [
            "Pos",
            "1",
            "2",
            "3",
            "4",
            "5",
            "6",
            "7",
            "8",
            "9",
            "10",
            "11",
            "12",
            "13",
            "14",
            "15"
        ],
        [
            "Car Number",
            "72",
            "47",
            "38",
            "56",
            "89",
            "10",
            "3",
            "17",
            "730",
            "33",
            "63",
            "31.",
            "5",
            "97",
            "66"
        ],
        [
            "Name",
            "Jimmy Scavarda",
            "John Ward",
            "Mark Garland",
            "Jason Brunn",
            "Ashly Waddington",
            "Russel Potter III",
            "George Wyers",
            "Keith Holden",
            "Patrick McNamara",
            "Tina Anderson",
            "Joe Bates",
            "Randy Kretzinger Jr",
            "Richard Roberts",
            "Jacob Newman",
            "John Conroy"
        ],
        [
            "Behind Leader",
            "",
            "2.388",
            "2.823",
            "6.659",
            "11.645",
            "11.758",
            "12.522",
            "13.882",
            "--1 Lap--",
            "0.001",
            "1.155",
            "15.854",
            "--2 Laps--",
            "--6 Laps--",
            "--19 Laps--"
        ],
        [
            "Gap",
            "",
            "2.388",
            "0.435",
            "3.836",
            "4.986",
            "0.113",
            "0.764",
            "1.360",
            "--1 Lap--",
            "0.001",
            "1.154",
            "14.699",
            "--1 Lap--",
            "--4 Laps--",
            "--13 Laps--"
        ]
    ],
    "pageTitle": "Spartan Speedway Recap May 5, 2006",
    "title": "",
    "url": "http://www.spartanspeedway.com/numbers/archives/2006/recap0505.php",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988650.6/warc/CC-MAIN-20150728002308-00082-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 731445219,
    "recordOffset": 731433128,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{1298=Bill Butler scored his first WMMQ Classic Rock 94.9 MI Modified win of the 2006 racing season, at Spartan Speedway. It was Beacon Sales ?Dodge Night?, with Butler and Dick LaPratt on the front row for their feature. On the start, Butler took the lead over LaPratt, Chris Ozanich, Nyle Weiler, and Perry Davenport. Davenport got around LaPratt and went after Ozanich and Butler. Jason Parish jumped into the mix and by lap five, was sitting in the fifth spot. Caution sent LaPratt to the rear. On the restart, Parish jumped out of line looking for a way around Weiler, but thought better of it on lap 10. Weiler and Parish got together, sending Parish into the front stretch wall and Weiler to the rear of the field. By lap fifteen, Butler was still leading the way, as second through fifth continued to battle for position. Dan Loughan and Bud Perry advanced into the top five and were going to work on Davenport. Loughan looked to the outside of Davenport and Ozanich moved up the track to stop Loughan?s charge. Davenport ducked to the inside of Ozanich, effectively grabbing the second spot. Davenport used the high groove to his advantage and went to work on Butler, the leader. As they battled for first, Ozanich charged back on the inside of Davenport to regain the second position on lap 20. Lap 25 saw Perry and Larry Wallace sitting just outside the top five when Davenport spun on the backstretch. Ozanich took a look to the outside of Butler for first coming out of turn three on lap 31. Loughan stuck his nose under Ozanich on lap 35, and by lap 38, they were door handle to door handle. At the stripe, it was Butler showing the way, followed by Loughan, Ozanich, Perry, and Wallace. Tim Easey and Stan Perry scored heat wins. The Performance Automotive Northwest Street Stocks had a very light turnout, as drivers are scrambling to finish their cars, but the racing was anything but boring. Nate Moon and Scott Sigman sat on the front row as they came down for the green flag. Moon came off turn four too hot and spun wildly, coming to rest at the front stretch wall. Jamie Feguer had no place to go and tagged him in the rear. Feguer was able to continue, with Moon retiring to the pit. On the restart, Flotka and Feguer locked bumpers, bringing out caution again. On the final restart, Sigman jumped out to take the early lead, with Feguer and Flotka running side by side for second, as Dane Long made his move to the front. Feguer made the challenge for second on lap three, while Long ran the high line to move into second by lap five. Long was going for the lead when Sigman cut a tire, spinning himself and Long on lap six. On the restart, Long began to run away from the field, as Damon Place and Feguer duked it out for second. Place settled into second on lap 11, followed by Feguer and Sigman. At the completion of 25 laps, it was Long, Place, Feguer, Sigman, and Wayne Beckner Jr. Scott Sigman grabbed the heat win. The Holiday Powersports Pony Stocks just get wilder by the week. At the start, it was cars three-, four-, and, attempting the unthinkable, five-wide racing. There was so much slicing and dicing going on that no one knew who the leader was until it flashed up on the leader board! Joe Bates came out on top before a three-car pile up coming out of turn four brought out the caution. Things began to settle down a bit with Russ Potter III, John Ward, and Jimmy Scavarda making up the top three spots by lap three. Scavarda made his way around Ward for second by lap five. Caution on lap seven allowed Scavarda the opportunity to get a great run on Potter, bringing Ward along with him on the restart. Potter got into Ward on lap nine, bringing out another caution as Potter was relegated to the rear. Lap 10 saw Scavarda, Ward, Mark Garland, Jason Brunn, and Ashley Waddington all in the top five. Scavarda opened up a huge chunk of real estate between himself and the rest of the pack, while Ward and Garland diced it up for second by lap 13. With the leaders into lapped traffic, by lap 15, cautious driving was the name of the game until the checker on lap 20. At the stripe, it was Scavarda, Ward, Garland, Brunn, and Waddington. Ashley Waddington won her heat and it was her first time ever in a racecar, while Scavarda scored the second heat win. The wild and wooly Pony Stock Figure 8?s have turned into quite the crowd pleaser. Trent Jenson jumped out to the early lead but was soon run down by the wily veteran, John Ward. Randy Kretzinger Jr., Keith Holden, Jason Brunn, and Jenson had all they could do to keep Ward in their sights. Brunn and Tina Anderson played chicken at the intersection on lap 9, with neither one wanting to back off, then both deciding to take the same path to avoid disaster. The result? It didn?t work! They collided and both headed for the front stretch wall. The red flag came out and both drivers were fine. I wish the same could be said for their cars. On the restart, it was still Ward in the lead, followed by Joe Bates, Keith Holden, Jacob Newman, and Trent Jenson. This win was the second in two nights of Figure 8?s for John Ward. Congrats and thanks for putting on a whale of a show guys and gals! Please join us May 12th, for a special that will include the Andrews Chevrolet Super Late Models, WMMQ Classic Rock 94.9 MI Modifieds, Performance Automotive Northwest Street Stocks, and the Holiday Powersports Pony Stocks. Special show admission prices will be charged on Friday, May 12th. Check out the Spartan Speedway website at www.spartanspeedway.com for special gate prices and times. We?ll see you at the races!}",
    "textBeforeTable": "WMMQ MMA Modifieds Qualifying Results By: Michelle Sprague Bill Butler scored his first WMMQ Classic Rock 94.9 MI Modified win of the 2006 racing season, at Spartan Speedway. It was Beacon Sales ?Dodge Night?, with Butler and Dick LaPratt on the front row for their feature. On the start, Butler took the lead over LaPratt, Chris Ozanich, Nyle Weiler, and Perry Davenport. Davenport got around LaPratt and went after Ozanich and Butler. Jason Parish jumped into the mix and by lap five, was sitting in the fifth spot. Caution sent LaPratt to the rear. On the restart, Parish jumped out of line looking for a way around Weiler, but thought better of it on lap 10. Weiler and Parish got together, sending Parish into the front stretch wall and Weiler to the rear of the field. By lap fifteen, Butler was still leading the way, as second through fifth continued to battle for position. Dan Loughan and Bud Perry advanced into the top five and were going to work on Davenport. Loughan looked to the outside of Davenport and Ozanich moved up the track to stop Loughan?s charge. Davenport ducked to the inside of Ozanich, effectively grabbing the second spot. Davenport used the high groove to his advantage and went to work on Butler, the leader. As they battled for first, Ozanich charged back on",
    "textAfterTable": "14 13 Ken Buchner 14.125 0.416 14.284 15 36 Tom Williams 14.205 0.496 14.222 16 911 Richard Maurer 14.226 0.517 14.286 17 96 Dan Frazier 14.228 0.519 14.332 18 25 Nick Fleury 14.233 0.524 14.243 19 24 Dusty Carl 14.242 0.533 14.274 20 31D Trei Deubel 14.344 0.635 15.373 Performance Automotive Northwest Street Stocks Pos Car Number Name Best Time Behind Leader 2nd Best Time 1 7L Dane Long 14.191",
    "hasKeyColumn": true,
    "keyColumnIndex": 2,
    "headerRowIndex": 0
}