{
    "relation": [
        [
            "Categories",
            "Campus Safety",
            "Great for these types of students",
            "Bang for the buck",
            "What to do for fun",
            "Food and Dining",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "Campus safety is awesome at McNeese. There are cops everywhere for your protection.",
            "McNeese is a school for very involved students.",
            "McNeese is not an expensive school. It is very worth attending.",
            "There are many sporting events to attend and frats to join.",
            "Food is well obtained and nicely handed out. The dining area is also very clean.",
            "McNeese takes their academics very seriously.",
            "Make sure you buckle down and do your work. There are many distractions, but you must push forward to make your dreams come true.",
            "McNeese State University is a great college. This college offers many degrees and it has a large social network. McNeese State is very involved with their students and I give McNeese a 10 on a 1-10 scale."
        ]
    ],
    "pageTitle": "McNeese State University Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/McNeese-State-University/reviews",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988650.6/warc/CC-MAIN-20150728002308-00079-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 918836847,
    "recordOffset": 918797707,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{2424=McNeese has such a broad spectrum of academics to appeal to everyone. You can receive a great education and a great reputation by attending McNeese. 86% of pre-medicine students were accepted into medical schools in 2006, which is a great number., 176318=© 2015, Cappex.com, LLC}",
    "textBeforeTable": "07/06/2009 Reviewer is A current student here. 15 out of 15 people found this review useful. 1 of 47 Matthew from Lake Charles, LA Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6,",
    "textAfterTable": "Great for these types of students Mcneese is great for students who want to be in active in organizations, as well as have good interractions with teachers. There are many different clubs to join, and there is always some type of activity going on. Mcneese has a very upbeat environment and is great for any person who is optimistic about their future. Tips for prospective students It is important to schedule classes around times that you will be able to attend regularly and on time. If youre not a morning person, then schedule classes in the afternoon. Its ok to have gaps in between classes, and your advisors are always willing to listen to you in case you have any questions about the school . Dont be afraid to ask questions. Bang for the buck You definately get bang for the buck here, there are computer labs that are open all throughout the days that let you print anything that you need, and use their computers for as long as neccessary. They also stay open at night in case you need to get some work done. there are study rooms, and many other different facillities that you may use and there are two student unions halls, that students use for socializing and relaxing. Am enjoying being here",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}