{
    "relation": [
        [
            "Series",
            "\"A\"",
            "\"D\"",
            ""
        ],
        [
            "Number",
            "3,817,500",
            "20,752,500",
            "24,570,000"
        ],
        [
            "Price",
            "$ 0.50",
            "$ 0.15",
            ""
        ],
        [
            "Expiry Date",
            "February 15, 2013",
            "February 15, 2013",
            ""
        ]
    ],
    "pageTitle": "Sterling Group Ventures, Inc. - Form 10-Q",
    "title": "",
    "url": "http://www.sec.gov/Archives/edgar/data/1175416/000117541613000001/0001175416-13-000001.txt",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988650.6/warc/CC-MAIN-20150728002308-00223-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 696847543,
    "recordOffset": 696757581,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{358099=During the year ended May 31, 2011, 801,666 Series \"C\" Share Purchase Warrants with an exercise price of $0.18 per share were exercised for gross proceeds of approximately $144,300. On February 16, 2011, the remaining Series \"C\" Share Purchase Warrants expired unexercised., 414443=Certification of Chief Financial Officer Pursuant to 18 U.S.C. Sec. 1350 as adopted pursuant to Section 906 of the Sarbanes-Oxley Act of 2002. Filed herewith., 405442=Pursuant to the requirements of the Securities Exchange Act of 1934, the registrant has duly caused this report to be signed on its behalf by the undersigned thereunto duly authorized., 357259=On February 12, 2010, the Company re-extended the expiry date of 2,873,990 the Series \"C\" share purchase Warrants from February 26, 2010 to February 16, 2011. The exercise price of the warrants remains unchanged at $0.18 per share. The additional fair value of the 2,873,990 extended life Series \u0093C\u0094 Share Purchase Warrants was estimated at $47,421 using the Black-Scholes Option Pricing Model with the following weighted average assumptions: dividend yield of 0%, expected volatility of 244%, risk-free interest rates of 0.56% and expected life of one year., 378550=Management reviews the carrying value of mineral properties at least annually and will recognize impairment in value based upon current exploration results, and any impairment or subsequent losses are charged to operations at the time of impairment. If a property is abandoned or sold, its capitalized costs are charged to operations. Mineral property exploration costs are expensed as incurred. Exploration activities conducted jointly with others are reflected at the Company's proportionate interest in such activities. As of November 30, 2012, the Company did not have proven or probable ore reserves., 397932=The Company's Common Stock is currently quoted on the NASD OTC QB under the ticker symbol SGGV and is listed on Berlin Bremen Stock Exchange under the symbol GD7. As of November 30, 2012, there were 75,730,341 shares of common stock outstanding. There can be no assurance that a trading market will be sustained in the future., 325315=The construction in progress represents the cost incurred for the extension of electric power line to the mining site which was reclassified to machinery in 2013., 89942=STERLING GROUP VENTURES, INC. (An Exploration Stage Company) INTERIM CONSOLIDATED STATEMENT OF CHANGES IN STOCKHOLDERS' EQUITY (CAPITAL DEFICIT) For the period from July 27, 1994 (date of inception) to November 30, 2012 (Unaudited), 384797=General and administrative decreased by $3,509 for the three months ended November 30, 2012 when compared to the same period in 2011, and General and administrative decreased by $4,449 for the six months ended November 30, 2012 when compared to the same period in 2011., 331160=During the year ended May 31, 2008, the Company issued 324,685 common shares at $0.06 per share to settle accounts payable of $19,480., 2185=Commission file number: 000-51775, 362017=The following discussion and analysis of our financial condition and results of operations should be read in conjunction with our consolidated financial statements and related notes for the year ended May 31, 2012, the financial statements and related notes in this Quarterly Report for the period ended November 30, 2012, the risk factors in our 10K for the year ended May 31, 2012, and all of the other information contained elsewhere in this report. ., 409855=Joint Venture Contract between Micro Express Ltd. .(the Company\u0092s wholly subsidiary) and Sichuan Province Mining Ltd., dated April 5, 2005 (Filed as Exhibit 10.1 to the Company's current report on Form 8-K filed on April 11, 2005, and incorporated herein by reference)., 309684=The Company received verbal termination of the Agreement with Zhong Chuan in July 2009, as advised by third party legal counsel, at a meeting in Beijing, China. The Agreement, in effect, allows Zhong Chuan to terminate the Agreement if it pays the Company double the amount of funds paid by the Company to date to secure and develop the DXC Project. Zhong Chuan has not paid the required amount anticipated by the Agreement to date. The delay in payment has delayed the termination process. At this point, the termination was incomplete., 18162=STERLING GROUP VENTURES, INC. (An Exploration Stage Company) INTERIM CONSOLIDATED BALANCE SHEETS November 30, 2012 and May 31, 2012, 384052=Consulting fees decreased by $39,779 for the three months ended November 30, 2012 when compared to the same period in 2011, and Consulting fees decreased by $40,365 for the six months ended November 30, 2012 when compared to the same period in 2011 because of the increased Stock-based compensation of $40,000, a non-cash item in 2011., 383582=The operating loss increased to $237,703 for the quarter ended November 30, 2012, as compared to $165,041 for the quarter ended November 30, 2011 mainly due to the increase of mineral property costs. The operating income is $1,023,428 for the six months ended November 30, 2012, as compared to operating loss of $308,143 for the six months ended November 30, 2011 mainly due to the income of $1,461,588 from sale of DXC lithium project., 412505=Agreement for Termination of Joint Venture between the Company, Micro Express Holdings Inc. and Beijing Mianping Salt Lake Research Institute, dated October 31, 2011 (Filed as Exhibit 10.1 to the Company's current report on Form 8-K filed on November 3, 2011, and incorporated herein by reference)., 363670=On October 18, 2010, Sterling signed two agreements (the \"Agreements\") with Chenxi County Hongyu Mining Co. Ltd. (\"Hongyu\") and its shareholders (\"Hongyu Shareholders\") regarding the Gaoping phosphate mine (the \"GP Property\") located in Tanjiachang village, Chenxi County, Hunan Province, China and other phosphate resources in Hunan Province. Hongyu holds a business license and a mining permit in the GP Property which is in effect until November 10, 2014 and covers 42.5 hectares., 410813=Agreement for Termination of Joint Venture between Micro Express Ltd. and Sichuan Province Mining Ltd., dated March 3, 2006 (Filed as Exhibit 10.1 to the Company's current report on Form 8- K filed on March 6, 2006, and incorporated herein by reference)., 39356=STERLING GROUP VENTURES, INC. (An Exploration Stage Company) INTERIM CONSOLIDATED STATEMENTS OF OPERATIONS For the three months and six months ended November 30, 2012 and for the period from July 27, 1994 (date of inception) to November 30, 2012 (Unaudited), 352056=On February 12, 2010, the Company re-extended the expiry date of 3,817,500 Series \"A\" Share Purchase Warrants from February 16, 2010 to February 16, 2011. The exercise price of the warrants remains unchanged at $0.50 per share. The additional fair value of the 3,817,500 extended life Series \u0093A\u0094 Share Purchase Warrants was estimated at $44,283 using the Black-Scholes Option Pricing Model with the following weighted average assumptions: dividend yield of 0%, expected volatility of 244%, risk free interest rates of 0.56% and expected life of one year., 310493=As Zhong Chuan did not fulfill the terms of the Agreement, DXC Salt Lake project was delayed again. The Company renegotiated with Mianping which still holds DXC Salt Lake project. On October 31, 2011, the Company and its wholly owned subsidiary, Micro Express Holdings Inc. (collectively \"Micro Express\"), signed an agreement (the \"Termination Agreement\") with Beijing Mianping Salt Lake Research Institute and Tibet Sunrise Mining Development Ltd. which is the actual control person of Beijing Mianping Salt Lake Research Institute (collectively \"Sunrise\") regarding amending and terminating the agreement dated September 16, 2005 between Micro Express Holdings Inc. and Beijing Mianping Salt Lake Research Institute for the development of the Dangxiongcuo (DXC) Salt Lake Project located in Nima County, Tibet, China ( the \"Mianping Agreement\")., 379259=On June 1, 2006, the Company accounts for stock-based compensation in accordance with ASC Topic 718-10, Compensation - Stock Compensation - Overall., 335800=On April 27, 2011, the Company granted 4,700,000 stock options to employees and consultants at an exercise price of $0.25 each expiring on February 3, 2019. The options were vested immediately., 350824=On February 7, 2008, the Company extended the expiry date of the 3,817,500 Series \u0093A\u0094 Share Purchase Warrants from February 16, 2008 to February 16, 2009. The exercise price of the warrants remains unchanged at $0.50 per share. The additional fair value of the 3,817,500 extended life Series \u0093A\u0094 Share Purchase Warrants was estimated at $252,989 using the Black-Scholes Option Pricing Model with the following weighted average assumptions: dividend yield of 0%, expected volatility of 218.52%, risk free interest rates of 2.08% and expected life of one year., 352679=On February 14, 2011, the Company re-extended the expiry date of 3,817,500 Series \"A\" Share Purchase Warrants from February 16, 2011 to February 16, 2012. The exercise price of the warrants remains unchanged at $0.50 per share. The additional fair value of the 3,817,500 extended life Series \u0093A\u0094 Share Purchase Warrants was estimated at $517,526 using the Black-Scholes Option Pricing Model with the following weighted average assumptions: dividend yield of 0%, expected volatility of 201%, risk free interest rates of 0.29% and expected life of one year., 360310=         Cash and cash equivalent $1,786,584 (May 31, 2012 - $10,924), 312988=On June 21, 2012, the Company received the full payment of RMB 10,000,000 from Sunrise, and had quitclaimed all of its interest in and to the DXC lithium project and the Mianping Agreement and amendments thereto, if any, were null and void. RMB700,000 was incurred as expenses for the collection of the refund. The net amount, RMB9,300,000 ($1,461,588) was recorded as other income in the consolidated statement of operations., 332660=On July 5, 2011, Sterling issued 10,000,000 shares to the Hongyu Shareholders with the closing market price of the shares at $0.22 for acquiring the remaining 20% equity interest in Silver Castle from the Hongyu Shareholders (Note 3)., 334588=During the year ended May 31, 2004 the Company also granted 1,536,000 fully vested stock options to consultants at an exercise price of $0.50 per share. These stock option expired February 3, 2009. The fair value of options granted to non-employees and non-directors was $368,641 and had been recorded as stock-based compensation expense., 358664=On January 26, 2012, the Company extended the expiry date of the 20,752,500 Series \"D\" Share Purchase Warrants (the \"D\" Warrants) to the earlier of February 15, 2013 or the close of business on the 30th day after a takeover bid for the Company's issued and outstanding share capital has been made by a third party and approved by the shareholders of the Company. The exercise price of the \"D\" Warrants remains unchanged at $0.15 per share. The additional fair value of the 20,752,500 extended life Series \u0093D\u0094 Share Purchase Warrants was estimated at $358,647 using the Black-Scholes Option Pricing Model with the following weighted average assumptions: dividend yield of 0%, expected volatility of 157.29%, risk-free interest rates of 0.12% and expected life of 1.05 years., 329010=On December 18, 2004, the Company issued 100,000 shares with a fair value of $42,000 to a consultant for investor relations services for a period of one year., 248924=A summary of mineral properties costs for the cumulative period from date of inception (July 27, 1994) to November 30, 2012 were incurred and accounted for in the consolidated statement of operations as follows:, 355442=On February 7, 2008, the Company extended the expiry date of the 2,873,990 Series \u0093C\u0094 Share Purchase Warrants from February 29, 2008 to February 27, 2009. The exercise price of the warrants remained unchanged at $0.18 per share. The additional fair value of the 2,873,990 extended life Series \u0093C\u0094 Share Purchase Warrants was estimated at $156,536 using the Black-Scholes Option Pricing Model with the following weighted average assumptions: dividend yield of 0%, expected volatility of 222.09%, risk-free interest rates of 2.08% and expected life of one year., 437183=CERTIFICATION OF CHIEF FINANCIAL OFFICER PURSUANT TO 18 U.S.C. SECTION 1350, AS ADOPTED PURSUANT TO SECTION 906 OF THE SARBANES-OXLEY ACT OF 2002, 241626=These consolidated financial statements have been prepared in accordance with generally accepted accounting principles applicable to a going concern, which assumes that the Company will be able to meet its obligations and continue its operations for its next fiscal year. Realization values may be substantially different from carrying values as shown as these financial statements do not give effect to adjustments that would be necessary to the carrying values and classification of assets and liabilities should the Company be unable to continue as a going concern. At November 30, 2012, the Company generated a net income of $1,023,428 during the six months ended November 30, 2012 and the cumulative loss of $5,319,522 since its inception and expects to incur further losses in the development of its business, all of which casts substantial doubt about the Company\u0092s ability to continue as a going concern. The Company\u0092s ability to continue as a going concern is dependent upon its ability to generate future profitable operations and/or to obtain the necessary financing to meet its obligations and repay its liabilities arising from normal business operations when they come due. Management has no formal plan in place to address this concern but considers that the Company will be able to obtain additional funds by equity financing and/or related party advances; however there is no assurance of additional funding being available., 239777=Sterling Group Ventures, Inc. was incorporated in the State of Nevada on September 13, 2001 and its fiscal year-end is May 31. On January 20, 2004, the Company acquired all of the issued and outstanding shares of Micro Express Ltd. (\u0093Micro\u0094), which was incorporated on July 27, 1994. The business combination was accounted for as a reverse acquisition whereby the purchase method of accounting was used with Micro being the accounting acquirer and the Company being the accounting subsidiary. The cumulative figures are shown on a reverse acquisition basis with respect to the accounting acquirer\u0092s date of inception, July 27, 1994., 411700=Agreement between the Company, Hongyu Mining Co., Ltd. , and shareholders of Hongyu Mining Co., Ltd., dated October 18, 2010 (Filed as Exhibit 10.1 to the Company's current report on Form 8-K filed on October 21, 2010, and incorporated herein by reference)., 349911=February 16, 2008; or, 247203=On June 1, 2012, the Company adopted the FASB ASU 2011-05, \u0093Comprehensive Income (Topic 220): Presentation of Comprehensive Income\u0094. This ASU requires companies to present the components of net income and other comprehensive income either as one continuous statement or as two consecutive statements. It eliminates the option to present components of other comprehensive income as part of the statement of changes in stockholders' equity. The standard does not change the items which must be reported in other comprehensive income, how such items are measured or when they must be reclassified to net income. The adoption of this ASU did not have a material impact on the Company\u0092s financial statements., 295722=The Agreements required an investment company to be incorporated in Hong Kong (the \u0093Investment Company\u0094) which was to be owned 20% by the Hongyu Shareholders and 80% by the Company. On October 13, 2010, the Investment Company was incorporated in Hong Kong under the name Silver Castle Investments Ltd. (\u0093Silver Castle\u0094). Silver Castle acquired 90% of Hongyu with the other 10% of Hongyu transferred to the nominees of the Company. During the acquisition phase, the Company ensured that Hongyu\u0092s net assets retained a minimum value of RMB 5,000,000 ($771,545). Upon completion of this acquisition, Hongyu became a Hong Kong / China joint venture company. The Company received all required approvals from Chinese authorities for the completion of its acquisition of Hongyu pursuant to the Agreements dated October 18, 2010. The Company paid RMB 200,000 ($30,934) to the Hongyu shareholders as a down payment on December 14, 2010, the Company also deferred $25,083 of legal fees related to the acquisition of Hongyu which was recorded as Advance on Investment as at May 31, 2011. The remaining RMB1,800,000 ($279,504) was paid on July 8, 2011, to complete the transaction, for a total of RMB 2,000,000 ($310,438)., 367014=Hongyu is currently working on putting its phosphate deposit into production. As mining license was obtained for the Gaoping Phosphate Property and a Chinese engineering report was completed, Hongyu moved into the development stage of this property in the early of 2012. On February 13, 2012, Hongyu received approval for installing the power line for the Gaoping Phosphate Property. Hongyu also reached understanding for land rental with local village committee on March 17, 2012. Hongyu signed and completed land rental agreement with each family in the mining area on March 27, 2012. On April 1, 2012, Hongyu also received conditional safety approval from Supervision and Management Bureau for Safety Operation of Chenxi County and the project is essentially ready to begin production on a small scale basis to be further ramped up as the development and production plan takes effect. The conditional safety approval is expected to become final after inspection when the mine construction is completed. On April 22, 2012, Hongyu signed a mining agreement with the mining contractor, Yichang Rongchang Mining Co. Ltd., to be the operator of the mining and production activities on the project. On June 16, 2012, Hongyu completed power line construction. On July 19, 2012, Hongyu received the explosive operation permit. Currently, accommodation for mining people has been built and our mining contractor has started excavation works. An onsite office and accommodation for workers and mining management are now complete and Hongyu's management is currently working onsite. The water supply for the mining operation and living quarters is connected to the site. Since late August, Hongyu has started driving in the No. 2 adit. So far it has been developed for a length of 190 meters. Then an adit arc lane is being developed for No. 2 adit. About 50 meters have been developed. No. 1 adit has been developed for a length of 50 meters. The road to the mining site is being constructed and at maintenance stage., 298730=When requested by the Company, the Hongyu Shareholders agreed to sell their 20% interest in the Investment Company to the Company for the issuance of 10,000,000 common shares of the Company\u0092s capital stock. On July 5, 2011, the Company issued 10,000,000 shares to the Hongyu Shareholders with the closing market price of the shares at $0.22 for acquiring the remaining 20% equity interest in Silver Castle from the Hongyu Shareholders. As a result of this transaction, the Company effectively controls 100% of Hongyu through its wholly owned subsidiary, Silver Castle Investments Ltd. which holds 90% of Hongyu with the other 10% held by the nominees of the Company., 379448=In accordance with ASC Topic 718-10 compensation expenses is amortized on a straight-line basis over the requisite service period which approximates the vesting period rather than as a reduction of taxes paid. The Company has elected to use the Black-Scholes option pricing model to determine the fair value of options and the extension of the expiry date of share purchase warrants previously granted. The Company has estimated the fair value of share purchase warrants and options for the period ended November 30, 2012 and the year ended May 31, 2012 using the assumptions more fully described in Note 6(b) & (c) to the financial statements., 385502=Investor relations costs decreased by $2,384 for the three months ended November 30, 2012 when compared to the same period in 2011. Investor relations costs decreased by $78,548 for the six months ended November 30, 2012 when compared to the same period in 2011 because $73,500 were paid by shares to a consultant for the investor relation services in the six months ended November 30, 2011., 5650=Indicate the number of shares outstanding of each of the issuer's classes of common stock as of January 10, 2013., 361551=         Cash $448 (May 31, 2012 - $538), 308034=Pursuant to the Mianping Agreement, the parties agreed to set up a Cooperative Company, (the \u0093Cooperative\u0094) to develop the DXC Salt Lake. The objective of the Cooperative was to use the funds provided by the Company and the skills and technology provided by the other party to produce lithium carbonate and borate from brine. The Company, through Micro, was to own 65% of the Cooperative. It was anticipated that the total investment in the Cooperative would be approximately 240 million RMB (or approximately US$35 million). The Cooperative Company was never set up. On July 3, 2007, Micro received a letter from the other party to the Mianping Agreement stating that the agreement between Micro and the other party should be deemed terminated as a result of lack of progress in the approval for the establishment of the joint venture company and was considering a lawsuit against the Company and Micro. Micro has responded that the other party\u0092s claim has no legal grounds as the lack of progress was not caused by Micro. There has been no legal action to date and none is expected. By letter dated August 25, 2008, Mianping has confirmed that the agreement dated September 16, 2005 was terminated effective July 8, 2008. This agreement was replaced by the agreement with Zhong Chuan International Mining Holdings Co. Ltd. (\u0093Zhong Chuan\u0094) dated July 8, 2008 (\u0093the Agreement\u0094)., 408759=Bylaws of the Company (filed as Exhibit 3.2 to the Company's Registration Statement on Form SB-2 filed on July 26, 2002, and incorporated herein by reference)., 410284=Agreement for Development of DXC Salt Lake Property between Micro Express Holdings Inc. .(the Company\u0092s wholly subsidiary) and Beijing Mianping Salt Lake Research Institute, dated September 16, 2005 (Filed as Exhibit 10.1 to the Company's current report on Form 8-K filed on September 21, 2005, and incorporated herein by reference)., 370915=In July 2009, the Company received verbal termination of the Agreement with Zhong Chuan as advised by third party legal counsel at a meeting in Beijing, China. The Agreement, in effect, allows Zhong Chuan to terminate the Agreement if it pays the Company double the amount of funds paid by the Company to date to secure and develop the DXC Project. Zhong Chuan has not paid the required amount anticipated by the Agreement to date. The delay in payment has delayed the termination process. At this point, the termination is incomplete., 364228=The Agreements required an investment company to be incorporated in Hong Kong (the \"Investment Company\") which was to be owned 20% by the Hongyu Shareholders and 80% by Sterling. On October 13, 2010, the Investment Company was incorporated in Hong Kong under the name Silver Castle Investments Ltd. (\"Silver Castle\"). Silver Castle acquired 90% of Hongyu with the other 10% of Hongyu transferred to the nominees of Sterling. During the acquisition phase, Sterling ensured that Hongyu's net assets retained a minimum value of RMB 5,000,000 ($771,545). Upon completion of this acquisition, Hongyu became a Hong Kong / China joint venture company. Sterling received all required approvals from Chinese authorities for the completion of its acquisition of Hongyu pursuant to the Agreements dated October 18, 2010. Sterling paid a total RMB 2,000,000 ($310,438) to the Hongyu Shareholders with RMB 200,000 (US$30,934) paid as down payment on December 14, 2010 and the remaining RMB1,800,000 ($279,504) paid on July 8, 2011 for completion of the transaction., 391777=Factors That May Affect Future Results and Market Price of Stock, 369476=Pursuant to the Mianping Agreement, the parties agreed to set up a Cooperative Company (the \"Cooperative\") to develop the DXC Salt Lake. The objective of the Cooperative was to use the funds provided by the Company and the skills and technology provided by the other party to produce lithium carbonate and borate from brine. The Company, through Micro, was to own 65% of the Cooperative. It was anticipated that the total investment in the Cooperative would be approximately RMB 240 million (or approximately US$35 million). The Cooperative Company was never set up. On July 3, 2007, Micro received a letter from the other party to the Mianping Agreement stating that the agreement between Micro and the other party should be deemed terminated as a result of lack of progress in the approval for the establishment of the joint venture company and is considering a lawsuit against the Company and Micro. Micro has responded that the other party's claim has no legal grounds as the lack of progress is not caused by Micro. There has been no legal action to date and none is expected. By letter dated August 25, 2008, Mianping has confirmed that the agreement dated September 16, 2005 was terminated effective July 8, 2008. This agreement was replaced by the agreement with Zhong Chuan International Mining Holdings Co. Ltd. (\"Zhong Chuan\") dated July 8, 2008(\"the Agreement\")., 412998=Code of Ethics. ( Filed as Exhibit 14.1 to the Company's Annual report on Form 10-K filed on August 28, 2009, and incorporated herein by reference), 386229=As of November 30, 2012, the Company had total current assets of $2,341,977 and total liabilities of $510,239. As of November 30, 2012, the Company had cash totaling $2,313,698, and a working capital surplus of $1,831,738., 437386=In connection with the Quarterly Report of Sterling Group Ventures, Inc. (the \"Company\") on Form 10-Q for the quarter ended November 30, 2012, as filed with the Securities and Exchange Commission on the date hereof (the \" Report\"), I, Richard (Xuxin) Shao, as Chief Financial Officer of the Company, certify, pursuant to 18 U.S.C. Section 1350, as adopted pursuant to Section 906 of the Sarbanes-Oxley Act of 2002, to the best of my knowledge, that:, 340315=Changes in share purchase warrants for the six months ended November 30, 2012 and the year ended May 31, 2012 are summarized as follows:, 305868=As of November 30, 2012, the Company has incurred mineral property costs of $504,476 on this property which have been expensed to the statement of operations as disclosed in the table above., 386484=During the six months ended November 30, 2012, the Company received the other income of $1,461,588 from the sale of its DXC lithium project and its working capital increased accordingly., 332265=On May 25, 2011, the Company issued 350,000 shares at a quoted market price of $0.23 each to a consultant for its services., 413335=Certification of Chief Executive Officer under Section 302 of the Sarbanes-Oxley Act of 2002. Filed herewith., 339836=At November 30, 2012, there were 5,200,000 stock options (May 31, 2012: 5,200,000) outstanding and exercisable with an exercise price at $0.25 each expiring on February 3, 2019, an aggregate intrinsic value of $nil (May 31, 2012: $1,300,000) and a weighted average remaining contractual term of 6.18 years (May 31, 2012: 6.82) ., 336265=On November 3, 2011, the Company granted 500,000 stock options to a consultant at an exercise price of $0.25 each expiring on February 3, 2019. The options were vested immediately., 326059=The Company was charged consulting fees for administrative, corporate, financial, engineering, and management services during the three-month and six-month periods ended November 30, 2012 totaling $6,050 (2011: $5,856) and $12,024 (2011: $11,486) by companies controlled by a director of the Company., 312601=As of November 30, 2012, the Company had incurred a total of $1,042,167 in mineral property costs on this property., 333468=During the year ended May 31, 2004, the Company granted 2,100,000 fully vested stock options to directors and officers of the Company at an exercise price of $0.50 per share. These stock options expired on February 3, 2009., 403755=During the year ended May 31, 2011, the Company completed a private placement of 20,000,000 units at $0.10 per unit for total proceeds of $2,000,000. Each unit consists of one common share and one share purchase warrant entitling the holder the right to purchase one common share at $0.15 per share expiring on January 31, 2012 (the Series \"D\" Share Purchase Warrants). An additional 752,500 units were issued as finders' fees. The proceeds from this private placement will be used for the phosphate projects in Hunan, China and general working capital., 1779=[X]  Quarterly report pursuant to Section 13 or 15(d) of the Securities Exchange Act of 1934 for the quarterly period ended November 30, 2012., 382471=At November 30, 2012, the Company had not yet achieved profitable operations and has accumulated losses of $5,319,522 since its inception and expects to incur further losses in the development of its business, all of which casts substantial doubt about the Company's ability to continue as a going concern. The Company's ability to continue as a going concern is dependent upon its ability to generate future profitable operations and/or to obtain the necessary financing to meet its obligations and repay its liabilities arising from normal business operations when they come due. Management has no formal plan in place to address this concern but considers that the Company will be able to obtain additional funds by equity financing and/or related party advances; however there is no assurance of additional funding being available., 377178=Operating results for the six months ended November 30, 2012 are not necessarily indicative of the results that can be expected for the year ending May 31, 2013., 331566=During the year ended May 31, 2011, the Company completed a private placement of 20,000,000 units at $0.10 per unit for total proceeds of $2,000,000. Each unit consists of one common share and one share purchase warrant entitling the holder the right to purchase one common share at $0.15 per share expiring on January 31, 2012 (the Series \u0093D\u0094 Share Purchase Warrants). An additional 752,500 units were issued as finders\u0092 fees., 414029=Certification of Chief Executive Officer Pursuant to 18 U.S.C. Sec. 1350 as adopted pursuant to Section 906 of the Sarbanes-Oxley Act of 2002. Filed herewith., 384421=Foreign exchange gain increased by $9,417 for the three months ended November 30, 2012 when compared to the same period in 2011, and foreign exchange gain decreased by $9,717 for the six months ended November 30, 2012 when compared to the same period in 2011 because of the exchange rate fluctuation among US dollar, Canadian dollar and RMB., 433983=In connection with the Quarterly Report of Sterling Group Ventures, Inc. (the \"Company\") on Form 10-Q for the quarter ended November 30, 2012, as filed with the Securities and Exchange Commission on the date hereof (the \" Report\"), I, Raoul Tsakok, as Chief Executive Officer of the Company, certify, pursuant to 18 U.S.C. Section 1350, as adopted pursuant to Section 906 of the Sarbanes-Oxley Act of 2002, to the best of my knowledge, that:, 373127=On June 21, 2012, the Company received the full payment of RMB10,000,000 from Sunrise. The termination of the DXC Lithium Project was completed., 369058=On September 16, 2005, the Company, through its wholly owned subsidiary, Micro Express Holdings Inc. (\"Micro\"), signed an agreement (the \"Mianping Agreement\") with Beijing Mianping Salt Lake Research Institute (\"Mianping\") for the development of Dangxiongcuo salt lake property (\"DXC Salt Lake\") in Nima county of Naqu district in Tibet, China., 403170=Since October 2008, a severe general downturn in the U. S. economy and global economy slowdown which already affected the securities markets took place. Such a deleterious turn of events has made it much more difficult for the Company to access financing should it be required to do so. The outlook remains uncertain as growth in the US and Europe experienced another downturn such that another recession is now possible in the US and Europe., 371485=As Zhong Chuan did not fulfill the terms of the Agreement, DXC Salt Lake project was delayed again. The Company renegotiated with Mianping which still holds DXC Salt Lake project. On October 31, 2011, the Company and its wholly owned subsidiary, Micro Express Holdings Inc. (collectively \"Micro Express\"), signed an agreement (the \"Termination Agreement\") with Beijing Mianping Salt Lake Research Institute and Tibet Sunrise Mining Development Ltd. which is actual control person of Beijing Mianping Salt Lake Research Institute (collectively \"Sunrise\") regarding amending and terminating the Mainping Agreement dated September 16, 2005 between Micro Express Holdings Inc. and Beijing Mianping Salt Lake Research Institute for the development of the Dangxiongcuo (DXC) Salt Lake Project located in Nima County, Tibet, China., 203264=STERLING GROUP VENTURES, INC. (An Exploration Stage Company) INTERIM CONSOLIDATED STATEMENTS OF CASH FLOWS For the six months ended November 30, 2012 and 2011 and for the period from July 27, 1994 (date of inception) to November 30, 2012 (Unaudited), 324959=The depreciation for the six months ended November 30, 2012 was $11,655 (2011: $378)., 360941=         Cash $8,695 (May 31, 2012 - $50,850), 238980=Sterling Group Ventures, Inc. (An Exploration Stage Company) Notes to Interim Consolidated Financial Statements November 30, 2012 (Stated in US Dollars) (Unaudited), 1987=[   ] Transition report pursuant to Section 13 or 15(d) of the Securities Exchange Act of 1934 for the transition period from _________ to _______ ., 387974=In addition to the U.S. Dollar, we conduct our business in Chinese Yuan (RMB) and Canadian Dollar and, therefore, are subject to foreign currency exchange risk on cash flows related to expenses and investing transactions. In July 2005, the Chinese government began to permit the Chinese Yuan to float against the U.S. Dollar. All of our costs to operate our Chinese project are paid in Chinese Yuan and all of our costs to operate our principal executive office in Canada are paid in Canadian dollar. Our mining costs in China may be incurred under contracts denominated in Chinese Yuan or U.S. Dollars. If the Chinese Yuan continues to appreciate with respect to the U.S. Dollar, our costs in China may increase. If the Canadian Dollar continues to appreciate with respect to the U.S. Dollar, our costs in Canada may increase. To date we have not engaged in hedging activities to hedge our foreign currency exposure. In the future, we may enter into hedging instruments to manage our foreign currency exchange risk or continue to be subject to exchange rate risk., 409437=Acquisition Agreement between the Company and Micro Express Ltd., dated January 20, 2004. (Filed as Exhibit 10.1 to the Company's current report on Form 8-K filed on January 29, 2004, and incorporated herein by reference)., 398999=The Company believes it has sufficient capital to meet its short-term cash needs, including the costs of compliance with the continuing reporting requirements of the Securities Exchange Act of 1934. However, if losses continue, it may have to seek loans or equity placements to cover longer-term cash needs to continue operations and expansion., 245264=On June 1, 2012, the Company adopted the FASB ASU 2011-04, \u0093Fair Value Measurement (Topic 820): Amendments to Achieve Common Fair Value Measurement and Disclosure Requirements in U.S. GAAP and IFRSs\u0094. This ASU is intended to result in convergence between U.S. GAAP and International Financial Reporting Standards (\u0093IFRS\u0094) requirements for measurement of and disclosures about fair value. The amendments are not expected to have a significant impact on companies applying U.S. GAAP. Key provisions of the amendment include: a prohibition on grouping financial instruments for purposes of determining fair value, except when an entity manages market and credit risks on the basis of the entity\u0092s net exposure to the group; an extension of the prohibition against the use of a blockage factor to all fair value measurements (that prohibition currently applies only to financial instruments with quoted prices in active markets); and a requirement that for recurring Level 3 fair value measurements, entities disclose quantitative information about unobservable inputs, a description of the valuation process used and qualitative details about the sensitivity of the measurements. In addition, for items not carried at fair value but for which fair value is disclosed, entities will be required to disclose the level within the fair value hierarchy that applies to the fair value measurement disclosed. The adoption of this ASU did not have a significant impact on the Company\u0092s fair value measurements, financial condition, results of operations or cash flows as the company\u0092s financial instruments\u0092 carrying values approximate fair value due to their short term nature., 3176=308 - 1228 Marinaside Cr., Vancouver, B.C. V6Z 2W4 (Address of principal executive offices) (Zip Code), 295162=On October 18, 2010, the Company signed two agreements (the \"Agreements\") with Chenxi County Hongyu Mining Co. Ltd. (\"Hongyu\") and its shareholders (\"Hongyu Shareholders\") regarding the Gaoping phosphate mine (the \"GP Property\") located in Tanjiachang village, Chenxi County, Hunan Province, China and other phosphate resources in Hunan Province. Hongyu holds a business license and a mining permit in the GP Property which is in effect until November 10, 2014., 412117=Letter of Intent between the Company and Shimen County Merchants Bureau, dated November 10, 2010 (Filed as Exhibit 10.1 to the Company's current report on Form 8-K filed on November 16, 2010, and incorporated herein by reference)., 401796=Additionally, the uncertain economic environment may cause farmers to use less fertilizer to cut costs, which will adversely affect the demand for phosphate. A similar situation occurred in 2008 leading to a sharp decline in phosphate prices., 376443=These statements reflect all adjustments, which are, in the opinion of management, necessary to present fairly the financial position, results of operations and cash flows for the interim periods presented in accordance with accounting principles generally accepted in the United States of America. Except where noted, the interim consolidated financial statements follow the same accounting policies and methods of their application as our May 31, 2012 annual consolidated financial statements. All adjustments are of a normal recurring nature. It is suggested that these interim consolidated financial statements be read in conjunction with our May 31, 2012 annual consolidated financial statements., 408421=Articles of Incorporation of the Company, (filed as Exhibit 3.1 to the Company's Registration Statement on Form SB-2 filed on July 26, 2002, and incorporated herein by reference)., 433780=CERTIFICATION OF CHIEF EXECUTIVE OFFICER PURSUANT TO 18 U.S.C. SECTION 1350, AS ADOPTED PURSUANT TO SECTION 906 OF THE SARBANES-OXLEY ACT OF 2002, 356273=On February 6, 2009, the Company re-extended the expiry date of 2,873,990 Series \"C\" share purchase Warrants from February 27, 2009 to February 26, 2010. The exercise price of the warrants remains unchanged at $0.18 per share. The Series \"C\" Share Purchase Warrants were originally issued in September 2006 pursuant to a private placement commenced in August 2006. The additional fair value of the 2,873,990 extended life Series \u0093C\u0094 Share Purchase Warrants was estimated at $48,259 using the Black-Scholes Option Pricing Model with the following weighted average assumptions: dividend yield of 0%, expected volatility of 244.01%, risk-free interest rates of 0.82% and expected life of one year., 414792=Audit Committee Charter. (Filed as Exhibit 99.1 to the Company's Annual report on Form 10-K filed on August 28, 2009, and incorporated herein by reference), 413700=Certification of Chief Financial Officer under Section 302 of the Sarbanes-Oxley Act of 2002. Filed herewith., 365821=When requested by Sterling, the Hongyu Shareholders agreed to sell their 20% interest in the Investment Company to Sterling for the issuance of 10,000,000 common shares of Sterling's capital stock. On July 5, 2011, Sterling issued 10,000,000 shares to the Hongyu Shareholders with the closing market price of the shares at $0.22 for acquiring the remaining 20% equity interest in Silver Castle from the Hongyu Shareholders. As a result of this transaction, Sterling effectively controls 100% of Hongyu through its wholly owned subsidiary, Silver Castle Investments Ltd. which holds 90% of Hongyu with the other 10% held by the nominees of Sterling., 353303=On January 26, 2012, the Company re-extended the expiry date of 3,817,500 Series \"A\" share purchase warrants from February 16, 2012 to the earlier of February 15, 2013 or the close of business on the 30th day after a takeover bid for the Company's issued and outstanding share capital has been made by a third party and approved by the shareholders of the Company. The exercise price of the warrants remained unchanged at $0.50 per share. The additional fair value of the 3,817,500 extended life Series \u0093A\u0094 Share Purchase Warrants was estimated at $25,832 using the Black-Scholes Option Pricing Model with the following weighted average assumptions: dividend yield of 0%, expected volatility of 155.80%, risk-free interest rates of 0.12% and expected life of 1.05 years., 411227=Agreement between the Company, Zhong Chuan International Mining Holding Co., Ltd. , and shareholders of Monte Sea Holdings Ltd., dated July 8, 2008 (Filed as Exhibit 10.1 to the Company's current report on Form 8-K filed on July 15, 2008, and incorporated herein by reference)., 385101=Mineral property costs increased by $121,755 for the three months ended November 30, 2012 when compared to the same period in 2011, and mineral property costs increased by $252,593 for the six months ended November 30, 2012 when compared to the same period in 2011, because the Company has started to develop the Gaoping phosphate property and build mining facility., 339518=During the year ended May 31, 2012, the weighted average fair value of options granted was $0.08 per share. The Company recognized a total stock based compensation expense of $40,000 for options granted and vested using the Black-Scholes option pricing model., 404509=On July 5, 2011, Sterling issued 10,000,000 shares to the Hongyu Shareholders with the closing market price of the shares at $0.22 for acquiring the remaining 20% equity interest in Silver Castle from the Hongyu Shareholders., 409113=Specimen stock certificate (filed as Exhibit 4.1 to the Company's Registration Statement on Form SB-2 filed on July 26, 2002, and incorporated herein by reference)., 328110=During the years ended May 31, 2004 and 2005, the Company completed a private placement of 3,716,000 units at $0.50 per unit for total proceeds of $1,858,000. Each unit consists of one common share and one share purchase warrant entitling the holder the right to purchase one common share at $0.75 per share, expiring on February 16, 2006 (the Series \u0093A\u0094 Share Purchase Warrants). Upon exercise of the \u0093A\u0094 share purchase warrant, an additional share purchase warrant will be granted at $1.00 per share, expiring February 16, 2007 (the Series \u0093B\u0094 Share Purchase Warrants). An additional 101,500 units were issued as finders\u0092 fees., 326630=Included in accounts payable and accrued liabilities is $475,810 (May 31, 2012: $463,971) which was due to companies controlled by the directors of the Company for their services provided., 335198=The fair value of each option grant was $0.24 and was estimated on the date of grant using the Black-Scholes option pricing model with the following assumptions used for the options granted on February 3, 2004: dividend yield of 0%, expected volatility of 51.15%, risk-free interest rate of 3.26%, and an expected life of 5 years., 346274=Share purchase warrants outstanding at November 30, 2012:, 350339=Upon exercise of the Series \"A\" Share Purchase Warrant at $0.50 each, the holder will receive one Common Share of the Company and a Series \"B\" Share Purchase Warrant exercisable at $1.00 expiring one year after the occurrence of either (1) or (2) as described above. The Series \"A\" Share Purchase Warrants were originally issued in 2004 pursuant to a private placement commenced in February 2004., 329439=During the year ended May 31, 2007, the Company completed a private placement of 2,750,300 units at $0.15 per unit for total proceeds of $412,545. Each unit consists of one common share and one share purchase warrant entitling the holder the right to purchase one common share at $0.18 per share expiring on December 29, 2006 (the Series \u0093C\u0094 Share Purchase Warrants). An additional 123,690 units were issued as finders\u0092 fees., 3598=Indicate by check mark whether the registrant: (1) has filed all reports required to be filed by Section 13 or 15(d) of the Securities Exchange Act of 1934 during the preceding 12 months (or for such shorter period that the registrant was required to file such reports), and (2) has been subject to such filing requirements for the past 90 days. Yes [X]    No [   ], 351441=On February 6, 2009, the Company re-extended the expiry date of 3,817,500 Series \u0093A\u0094 Share Purchase Warrants from February 16, 2009 to February 16, 2010. The exercise price of the warrants remains unchanged at $0.50 per share. The additional fair value of the 3,817,500 extended life Series \u0093A\u0094 Share Purchase Warrants was estimated at $35,593 using the Black-Scholes Option Pricing Model with the following weighted average assumptions: dividend yield of 0%, expected volatility of 223.36%, risk free interest rates of 0.82% and expected life of one year., 307418=On September 16, 2005, the Company, through its wholly owned subsidiary, Micro Express Holdings Inc. (\u0093Micro\u0094), signed an agreement (the \u0093Mianping Agreement\u0094) with Beijing Mianping Salt Lake Research Institute (\u0093Mianping\u0094) for the development of Dangxiongcuo salt lake property (\u0093DXC Salt Lake\u0094) in Nima county of Naqu district in Tibet, China., 404351=On May 25, 2011, the Company issued 350,000 shares at a quoted market price of $0.23 each to a consultant for its services., 294842=Not included in the table above was a total of $222,227 of costs incurred on other properties which were abandoned during the years ended May 31, 2006, 2007 and 2009.}",
    "lastModified": "Thu, 10 Jan 2013 19:53:42 GMT",
    "textBeforeTable": "Share purchase warrants outstanding at November 30, 2012:    0.204 $   24,570,000   Balance, May 31, 2012 and November 30, 2012   -     -   Expired   -     -   Exercised   -     -   Granted    0.204 $   24,570,000   Balance, May 31, 2011              ",
    "textAfterTable": "16 Sterling Group Ventures, Inc. (An Exploration Stage Company) Notes to Interim Consolidated Financial Statements November 30, 2012 (Stated in US Dollars) (Unaudited) Note 6 Capital Stock - (cont\u0092d)       c) Share Purchase Warrants - (cont\u0092d)     Each Series \u0093A\u0094 warrant entitles the holder thereof the right to purchase one common share at $0.50 per share expiring on the earlier of:   1) February 16, 2008; or   2) The 30th day after the day on which the weighted average trading price of the Company's shares exceeds $0.80 per share for 20 consecutive trading days. Upon exercise of the Series \"A\" Share Purchase Warrant at $0.50 each, the holder will receive one Common Share of the Company and a Series \"B\" Share Purchase Warrant exercisable at $1.00 expiring one year after the occurrence of either (1)",
    "hasKeyColumn": true,
    "keyColumnIndex": 3,
    "headerRowIndex": 0
}