{
    "relation": [
        [
            "Categories",
            "Campus Safety",
            "Greek Life",
            "Clubs and Activities",
            "Great for these types of students",
            "Share any unusual traditions or locations on campus",
            "Bang for the buck",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "We have our own police department with 26 sworn in officers. Two officers in SUV's patrol the campus 24/7. All resident halls facing towards the outside of campus are locked at all times. The rest of the resident halls lock after 9pm and every student that comes in, must show their id to check in.",
            "We have a campus dr that is given to a majority of the Greek life. Not all Greeks have their houses located there but we also encompass all of the NPHC.",
            "stated earlier too many to count.",
            "Dreamers, Goal-oriented and High Achievers.",
            "This campus is almost at the point where it produces its own energy. Pretty soon the majority of the campus will be renewable.",
            "Western really wants each student to grow no matter how advanced that student is when they come to its campus. The universities job is not finished until you are a better person than when you first entered.",
            "This campus has 400+ organizations all with different constitutions and pillars. There are gaming groups, capoeira groups, Entertainment groups funded by fortune 500 companies, so many different this to do. Not to mentions events put on by each group and the campus itself!",
            "All of the dining halls are slowly going under reconstruction. They ask students why types of cuisine they would to eat and around what times. The university is big on sustainability so the cafeterias are usually clean.",
            "Our residential department called residence life does a good job in bringing the right living style students together. They do not basse compatibility on what students like but rather how they live. Early riser, late studier, cleaner, athletic, etc. There are also specialty housing for certain majors on the campus to help with academics, easily.",
            "Some people complain about *weed out* courses in certain majors. The university has a lot of students with many distractions and the course work for complicated majors do not allow for dilly-dallying.",
            "Be open, try your hardest to ask for help if you have a hard time. There will always be an answer or outlet, but just like in the professional world; it is your job to find it.",
            "Western Michigan University is a diverse campus looking forward to expanding their horizons and cultivating unity. The University is based on pillars and always listens to the students needs. Finally WMU is an accredited research based university so education and determination is stressed within these pillars."
        ]
    ],
    "pageTitle": "Western Michigan University (WMU) Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Western-Michigan-University/reviews",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 125,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988650.6/warc/CC-MAIN-20150728002308-00099-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 893657671,
    "recordOffset": 893503147,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{716653=Pretty amazing! I met so many new friends who live on the same floor as me. It makes my college experience that much better. May be a little hot when you first get here. NO AC., 484718=There is so much. Go to sporting events is one way or participate in some of the Student Organizations. There are also numerous events that the Campus Activities Board puts together each year, including several a month. These events range from concerts to movies. Miller Auditorium also has great shows and concerts every year in which students get 50% of tickets. Students can exercise at the Rec Center or Ice Skate and Swim at Lawson. There is also always Bronco BASH in September., 28857=WMU has been name one of the top schools in 2011 already! You can look up facts about the school and they are all true. We have a great College of Aviation and also Business College. WMU is for someone that is sociable and if not you will turn into one. It's for a student that loves to be interactive. This is a place for someone that will represent their university with pride. If you have great heart and spirit come to WMU because it's always a great day to be a BRONCO!, 268577=There are vehicles starting at 9:00 that you can call to pick you up where ever you may be on campus and take you to the location you desire around the campus for your safety. Also there are 911 stands everywhere so that if you get in trouble you can always push the button and get help where ever you may need it., 4860=I'm a physics student, but I've found philosophy and chemistry to be strong areas in this college. I haven't experienced much in my one semester here, but Chem 1100, 1110, Philosophy of Science (honors), and music appreciation to be well worth while., 564162=One big tradition that we have here at Western is called Bronco Bash!! this happens every year during like the first week of September where all different types of school clubs/organizations as well as businesses , restaurants etc. comes on campus to promote their business and/or organizations and gives away a lot of FREE stuff!!, 52248=The overall tuition ranks fairly low compared to the rest of the public University's in Michigan. Last I checked it was 13th out of 15th in terms of the highest priced as of 2008 (1st being the most expensive). Also, it is ranked as one of the top public University's year after year according to US News. So, it really is a great deal, but my only complaint is that although tuition is low, living on campus is expensive with a lot of nickel and dime fees that can annoy you (parking passes, Wired internet fees, mini fridge rentals, etc.), however as a freshmen you don't have to live on campus, and is something to consider based on your financial situation., 900558=© 2015, Cappex.com, LLC}",
    "textBeforeTable": "12/07/2009 Reviewer is A current student here. 14 out of 15 people found this review useful. 1 of 201 Tim from Kalamazoo, MI Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5",
    "textAfterTable": "Am learning a lot I have to say, I thought Gen. Ed's would be boring, but I have found one in each area that has kept my interest. I must say though if ever you get a chance to be in a class by Prof. Tim McGrew, do not pass up the opportunity. McGrew has been one of the best instructors I've had, ever. Login to rate or flag the reviews Sharndeep from Canton, MI 08/13/2009 Reviewer is A past student here. 8 out of 10 people found this review useful. 3 of 201 Categories Comments Great for these types of students Western is great for students who would like a excellent learning experience while experiencing the WMU community. All the classes on campus are very near and make traveling easy. Tips for prospective students For new and prospective students, I would highly recommend living on campus for at least a year. You will be part of an extraordinary community where you will meet",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}