{
    "relation": [
        [
            "Patent application number",
            "20080205176",
            "20100074032",
            "20100232202"
        ],
        [
            "Description",
            "MEMORY HAVING A DUMMY BITLINE FOR TIMING CONTROL - A memory having at least one memory array block, the at least one memory array block comprising N wordlines, wherein N is greater than one, is provided. The memory comprises a plurality of sense amplifiers coupled to the at least one memory array block. The memory further comprises at least one dummy bitline, wherein the at least one dummy bitline comprises M dummy bitcells, wherein M is equal to N. The memory further comprises a timing circuit coupled to the at least one dummy bitline, wherein the timing circuit comprises at least one stack of pull-down transistors coupled to a sense circuit for generating a latch control output signal used for timing control of memory accesses. Timing control may include generating a sense trigger signal to enable the plurality of sense amplifiers for read operations and/or generating a local reset signal for terminating memory accesses, such as disabling the plurality of write drivers for write operations.",
            "MEMORY HAVING SELF-TIMED BIT LINE BOOST CIRCUIT AND METHOD THEREFOR - A memory has an array of memory cells, column logic, a write driver, a voltage detector, and a bootstrap circuit. The array of memory cells is coupled to pairs of bit lines and word lines. The column logic is coupled to the array and is for coupling a selected pair of bit lines to a pair of data lines. The write driver is coupled to the pair of data lines. The voltage detector provides an initiate boost signal when a voltage of a first data line of the pair of data lines drops below a first level during the writing of the pair of data lines by the write driver. The bootstrap circuit reduces the voltage of the first data line in response to the boost enable signal. This is particularly beneficial when the number of memory cells on a bit line can vary significantly as in a compiler.",
            "DUAL PORT MEMORY DEVICE - A multi-port memory device having a storage node, a precharge node, a first, second, third, and fourth transistor, and a control module. The first transistor includes a current electrode connected to the storage node, another current electrode connected to a first bit line, and a gate connected to a first wordline. The second transistor includes a current electrode connected to the storage node, another current electrode connected to a second bit line, and a gate connected to a second wordline. The third transistor includes a current electrode connected to the reference node, another current electrode connected to the first bit line, and a gate. The fourth transistor includes a current electrode connected to the precharge node, another current electrode connected to the second bit line, and a gate. The control module deactivates the fourth transistor in response to a dummy access of the first storage module at the second transistor."
        ],
        [
            "Published",
            "08-28-2008",
            "03-25-2010",
            "09-16-2010"
        ]
    ],
    "pageTitle": "Lu, TX - Patent applications",
    "title": "",
    "url": "http://www.faqs.org/patents/inventor/lu-tx-3/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438044160065.87/warc/CC-MAIN-20150728004240-00336-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 438419055,
    "recordOffset": 438385186,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Olga R. Lu, Austin, TX US 12-27-2012 Wireless Power Transmission - A system for wireless power transmission may include one or more charging panels and one or more powered devices. The charging panel may include a pilot analysis circuitry, processor and power transmitter. The pilot analysis circuitry may be configured to analyze the magnitude and phase of a pilot signal from the powered device, based on which the processor may be configured to determine a complex conjugate of the pilot signal. And the power transmitter may be configured to cause radiation of a focused wireless power beam to the powered device in accordance with the complex conjugate of the pilot signal and via one or more antenna elements. The charging panel may be one of a plurality of spatially-distributed charging panels each of which includes respective antenna elements that may form an array of antenna elements configured to collaboratively radiate wireless power as a distributed, retro-reflective beamformer. 20120326660 Published Description Patent application number Mingyu Lu, Arlington, TX US 07-11-2013 BOOM MOUNTED COILED TUBING GUIDE AND METHOD FOR RUNNING COILED TUBING - A coiled tubing support guide for maintaining an arch in a length of coiled tubing as it is unwound from a storage reel and feed into a coiled tubing injector connected with a wellhead is mounted to an elongated support structure rather than to the coiled tubing injector. The elongated support structure bears a",
    "textAfterTable": "Pengbo Lu, Sugar Land, TX US Patent application number Description Published 20120130696 Optimizing Well Management Policy - A field operating policy for a subsurface region is optimized by setting initial policy parameters for the subsurface region. Fluid flow within a subsurface region is simulated, wherein the simulation includes optimizing an objective function for field operating policy, the objective function corresponding simultaneously to the modeled fluid flow characteristics of one or more wellbores within the subsurface region and relating to at least one production system performance parameter. Optimizing the objective function for field operating policy may include optimizing the initial policy parameters for the subsurface region with an over time optimization technique, wherein the policy parameters are optimized for a predetermined policy period. An enhanced value of the objective function is determined at each timestep within the predetermined policy period. The optimized policy parameters for the predetermined policy period may serve as constraints in the determination of an enhanced value of the objective function at each timestep within the predetermined policy period. 05-24-2012 20120232861 Adaptive Newton's Method For Reservoir Simulation - A method of performing a simulation of a subsurface hydrocarbon reservoir. The reservoir is approximated by a reservoir model having a plurality of cells. Each cell has an equation set representing a reservoir property. An initial guess is provided to a solution for a system of equations formed using the equation set for each of the cells. An",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}