{
    "relation": [
        [
            "Method",
            "containerResize(parentId,childId)",
            "createNode(type,id)",
            "appendNode(parent,child)"
        ],
        [
            "Description",
            "Parameters: parentId - HTML element id of anchor object childId - HTML element id of child object Constructor: YUtility.containerResize(parentId,childId);",
            "Convenience method encapsulates document.createNode with internally used property Parameters: type - valid HTML element type (\"div\", \"img\") id - HTML element id",
            "Convenience method encapsulates document.appendChild with internally used property Parameters: parent - Parent HTML element object child - Child HTML element object"
        ]
    ],
    "pageTitle": "Yahoo! Maps Ajax Web Services",
    "title": "",
    "url": "https://developer.yahoo.com/maps/ajax/V3.8/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438044160065.87/warc/CC-MAIN-20150728004240-00276-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 868744364,
    "recordOffset": 868728757,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Methods The pixel position from the top, left corner of the map on the y axis. y The pixel position from the top, left corner of the map on the x axis. x Description Property Properties An integer representing the pixel position from the top, left corner of the map on the y axis. y An integer representing the pixel position from the top, left corner of the map on the x axis. x Description Parameter Constructor: YCoordPoint(x, y) YCoordPoint creates an object with x, y coordinate properties. The coordinates are in pixels with coordinate (0,0) as the upper left hand corner of the map. YCoordPoint(x, y) Customized map overlay HTML object HTMLobject Position object of type YGeoPoint (location position) or YCoordPoint (container coordinate position) YGeoPoint or YCoordPoint Description Parameter Constructor: YCustomOverlay(YGeoPoint|YCoordPoint, HTML object) YCustomOverlay enables overlay of custom objects YCustomOverlay(YGeoPoint,HTMLobject?) Optional transparency level of the line segment alpha Optional width in pixels width Optional line segment color color Array of YGeoPoint objects describing line segments, requires two or more points points Description Parameter",
    "textAfterTable": "Parameter Description lat A float representing geographic latitude lon A float representing geographic longitude Properties Property Description Lat latitude property Lon Longitude property Methods Method Description distance(point) Return distance between coordinate points Parameters: point YGeoPoint type object Return value: distance object with properties: kilometers, miles, nautical, pixels middle(point) Return middle point between two coordinate points Parameters: point YGeoPoint type object Return value: YGeoPoint equal(point) Check two coordinate points Parameters: point YGeoPoint type object Return value: boolean YMarker(YGeoPoint, YImage?, ID?) The YMarker class instantiates map marker objects. Constructor: YMarker( YGeoPoint ) Parameter Description YGeoPoint An object that holds a latitude/longitude pair YImage Optional - An object that holds custom marker definitions ID Optional - A string which identifies the marker as a DOM object (its CSS id attribute). The string should be comprised of digits (0-9) and/or lowercase letters (a-z). An ID will be automatically generated if this parameter is not provided. It's recommended to let API handle ID assignment. Methods",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}