{
    "relation": [
        [
            "AQI",
            "0 - 50",
            "51 -100",
            "101-150",
            "151-200",
            "201-300",
            "300+"
        ],
        [
            "Air Pollution Level",
            "Good",
            "Moderate",
            "Unhealthy for Sensitive Groups",
            "Unhealthy",
            "Very Unhealthy",
            "Hazardous"
        ],
        [
            "Health Implications",
            "Air quality is considered satisfactory, and air pollution poses little or no risk",
            "Air quality is acceptable; however, for some pollutants there may be a moderate health concern for a very small number of people who are unusually sensitive to air pollution.",
            "Members of sensitive groups may experience health effects. The general public is not likely to be affected.",
            "Everyone may begin to experience health effects; members of sensitive groups may experience more serious health effects",
            "Health warnings of emergency conditions. The entire population is more likely to be affected.",
            "Health alert: everyone may experience more serious health effects"
        ]
    ],
    "pageTitle": "Yashio, Shinagawa, Tokyo, Japan Air Pollution: Real-time PM2.5 Air Quality Index (AQI)",
    "title": "",
    "url": "http://aqicn.org/city/japan/shinagawaku/shinagawakuyashio/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988650.6/warc/CC-MAIN-20150728002308-00292-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 10385559,
    "recordOffset": 10306834,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "wikipedia. AirNow and explained in The pollution indices and color codes available on this web site follow the EPA graduation, as defined by About the Air Quality and Pollution Measurement: APK文件) (如果不能访问 Google应用商店，你也可以从我们的网站上直接下载 apk file. In case the Android app store can not be accessed, you can also directly download the signed Google商店下载此应用). (你可以从 the google app store. Yashio, Shinagawa, Tokyo Air Quality Widget on your Android Device directly from You can download the",
    "textAfterTable": "To know more about Air Quality and Pollution, check the wikipedia Air Quality topic or the airnow guide to Air Quality and Your Health. For very useful health advices of Beijing Doctor Richard Saint Cyr MD, check www.myhealthbeijing.com blog.",
    "hasKeyColumn": true,
    "keyColumnIndex": 1,
    "headerRowIndex": 0
}