{
    "relation": [
        [
            "Patent application number",
            "20080224671",
            "20140198537",
            "20140198538",
            "20140204617"
        ],
        [
            "Description",
            "Electric power generation control apparatus for vehicle alternator - An electric power generation control apparatus for a vehicle alternator mounted on a motor vehicle performs one of a constant output voltage control a constant torque control and a constant exciting current control in order to suppress a hunting phenomenon of the vehicle alternator. First of all, the electric power generation control apparatus performs the constant output voltage control when a rotation speed is within an idling rotation speed range or a periodic change of the rotation speed is not less than a predetermined value. After completion of the constant output voltage control, when judging that the idle hunting phenomenon is not adequately suppressed, the electric power generation control apparatus performs one of the constant torque control and the constant exciting current control.",
            "POWER CONVERSION APPARATUS - A power conversion apparatus includes a switch circuit which activates switching elements on the basis of a control signal, a feedback means which performs feedback control, a signal output means which outputs the control signal on the basis of a control variable of the feedback control, and a mode switching means which controls switching operation of the switch circuit by switching an operation mode between a normal mode and an intermittent mode in which the number of operations is less than that in the normal mode. The mode switching means changes timing of switching from the normal mode to the intermittent mode, on the basis of either or both of a first detection value which is an input value inputted to the switch circuit and a second detection value which is an output value outputted from the switch circuit.",
            "POWER CONVERTER WITH CURRENT FEEDBACK LOOP - In a power converter, a driver drives a switching element using a manipulated variable therefor to convert input power into output power. A first measuring unit measures a value of a first electric parameter depending on the input power. A first determiner determines, from the measured value of the first electric parameter, a first feedback controlled variable. A second measuring unit measures a value of a second electric parameter indicative of the output power, and a calculator calculates, based on the measured value of the second electric parameter and a command value for the second electric parameter, a second feedback controlled variable. A selector selects, based on the measured value of the first electric parameter, one of the first feedback controlled variable and the second feedback controlled variable. A second determiner determines the manipulated variable using the selected one of the first and second feedback controlled variables.",
            "POWER CONVERTER WITH CURRENT FEEDBACK LOOP - In a power converter, a deviation calculator calculates, in each cycle, a deviation between a value of an input electrical parameter of a switch circuit and a target value selected by a selector in a previous cycle. The input electrical parameter depends on the input power to the switch circuit. A second calculator calculates, in each cycle, a value of a second feedback controlled variable such that the value of the second feedback variable approaches the value of the input electrical parameter. A controller controls, in each cycle, the selector to select one of the value of the first feedback controlled variable and the value of the second feedback controlled variable as the target value for the next cycle according to the deviation calculated by the deviation calculator."
        ],
        [
            "Published",
            "09-18-2008",
            "07-17-2014",
            "07-17-2014",
            "07-24-2014"
        ]
    ],
    "pageTitle": "Norihito - Patent applications",
    "title": "",
    "url": "http://www.faqs.org/patents/inventor/norihito-7/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042985140.15/warc/CC-MAIN-20150728002305-00166-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 443933019,
    "recordOffset": 443898517,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Norihito Kimura, Hekinan-Shi JP 07-10-2014 VIBRATION-DAMPING RUBBER COMPOSITION, AND LIQUID-FILLED VIBRATION-DAMPING RUBBER DEVICE - A vibration-damping rubber composition is provided, which is used as a material for a rubber member of a liquid-filled vibration-damping rubber device in which a glycol liquid is sealingly contained. The rubber composition comprises: (A) a chloroprene rubber as a major component; and (B) an aromatic hydrocarbon plasticizer. The rubber composition makes it possible to suppress increase in the hardness of the rubber member (chamber wall) after thermal aging and reduction in durability. 20140191453 07-25-2013 FLUID-FILLED VIBRATION DAMPING RUBBER DEVICE - Provided is a fluid-filled vibration damping rubber device, including enclosed spaces (primary fluid chamber and auxiliary fluid chamber) formed by chamber walls (vibration damping rubber body and rubber membrane) which deform in accordance with vibration input, the enclosed spaces being filled with a fluid, in which: the chamber walls each include a diene-based rubber; and the fluid includes a glycol-based solution containing a benzotriazole-based compound having an amine group. The fluid-filled vibration damping rubber device is capable of eliminating the degradation of the chamber walls (rubber bodies) and the deterioration of its durability due to the dissolution of components in the rubber bodies into the filling fluid. 20130187317 Published Description Patent application number Norihito Kimura, Komaki-Shi JP 11-11-2010 Dehumidifier - [PROBLEMS] To improve efficiency in heat exchange to improve dehumidifying efficiency of the air to be dehumidified",
    "textAfterTable": "Norihito Kimura, Kasugai-Shi JP Patent application number Description Published 20080242792 ANTIVIBRATION RUBBER COMPOSITION - An antivibration rubber composition containing diene rubber (Component A) and silica (Component B). The amount of the Component B contained is set to a range from 10 to 100 parts by weight with respect to 100 parts by weight of the Component A. The Component B has the following properties, i.e., a surface silanol-group density of not less than 3.0 groups/nm 10-02-2008 20090093580 RUBBER COMPOSITION AND VIBRATION-PROOF MATERIAL - There is provided a rubber composition containing the following components: (A): an ethylene-α-olefin-nonconjugated polyene copolymer rubber, (B): a natural rubber, (C): an organic peroxide, (D): an aromatic amine compound, and (E): an aluminum-based inorganic compound. 04-09-2009 20120302692 VIBRATION-PROOF RUBBER COMPOSITION AND VIBRATION-PROOF RUBBER USING THE SAME - A vibration-proof rubber composition excellent in both characteristics of durability and compression set characteristic is provided. A vibration-proof rubber composition includes components (A) to (C) below, wherein an amount of reacted silane coupling agent in the component (B) is 6.5% by weight or more, and an amount of unreacted silane coupling agent is in a range of 0.5 to 2.5% by weight: (A) diene rubber; (B) pre-treated silica prepared by surface-treating, with a silane coupling agent, silica having a BET specific surface area in a range of 180 to 230 m 11-29-2012",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}