{
    "relation": [
        [
            "Days",
            "30",
            "50",
            "150",
            "200"
        ],
        [
            "BSE",
            "578.03",
            "562.68",
            "477.62",
            "453.87"
        ],
        [
            "NSE",
            "577.86",
            "562.55",
            "477.66",
            "453.87"
        ]
    ],
    "pageTitle": "Axis Bank Stock Price, Share Price, Live BSE/NSE, Axis Bank Bids Offers. Buy/Sell Axis Bank news & tips, & F&O Quotes",
    "title": "",
    "url": "http://www.moneycontrol.com/india/stockpricequote/banks-private-sector/axisbank/AB16?sc_did=AB16",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042985140.15/warc/CC-MAIN-20150728002305-00242-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 601256435,
    "recordOffset": 601200725,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{136549=JSWSteel Jul Fut, 135331=28 July 2015, 135842=UnitedBrewerie Jul Fut, 210230=Astec LifeSciences Recommended on Mar 31st 2015, 211535=Axis Bank is in the Banks - Private Sector sector. The current market capitalisation stands at Rs 133,292.26 crore. The bank management includes Sanjiv Misra - Chairman, Shikha Sharma - Managing Director & CEO, V Srinivasan - Executive Director & Head (Corporate Banking), K N Prithviraj - Director, V R Kaundinya - Director, Prasad R Menon - Director, Samir K Barua - Director, Som Mittal - Director, Ireena Vittal - Director, Rohit Bhagat - Director, Usha Sangwan - Director, Sanjeev Kumar Gupta - Executive Director, Srinivasan Vishvanathan - Additional Director. It is listed on the BSE with a BSE Code of 532215 and the NSE with an NSE Code of AXISBANK. Its Registered office is at ''Trishul', 3rd Floor, Opp. Samartheshw , Ahmedabad,Gujarat - 380006. Their Registrars are Karvy Computershare Private Ltd.}",
    "textBeforeTable": "Edit Watchlist Have you invested in these stocks? You can track them better in your Portfolio close[x] Add to Watchist Account Optional Optional Optional Optional Add to Portfolio OR Add to watchlist } $('#mcpcp_addprof_info').hide(); { function close_info()",
    "textAfterTable": "Keep me signed in Forgot Password? New to Moneycontrol - Sign up now Its easy and FREE! Username Username should be atleast 4 characters Password Password should be 6 to 10 characters Confirm Password Email OR connect with LIVE",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}