{
    "relation": [
        [
            "type",
            "FR Doc.",
            "RIN"
        ],
        [
            "regulations.gov",
            "2014-29724",
            "0750-AI47"
        ]
    ],
    "pageTitle": "48 CFR 252.244-7001 - Contractor purchasing system administration. | US Law | LII / Legal Information Institute",
    "title": "",
    "url": "https://www.law.cornell.edu/cfr/text/48/252.244-7001",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042985140.15/warc/CC-MAIN-20150728002305-00272-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 927336567,
    "recordOffset": 927311322,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{1012=Title 48 published on 2014-10-01.}",
    "TableContextTimeStampAfterTable": "{83515=DoD is issuing an interim rule amending the Defense Federal Acquisition Regulation Supplement (DFARS) to remove language based on 10 U.S.C. 2323. This action is necessary because the statute has expired., 119612=DoD is proposing to amend the Defense Federal Acquisition Regulation Supplement (DFARS) to implement a section of the National Defense Authorization Act for Fiscal Year 2015 that revises the restrictions relating to utilization of domestic photovoltaic devices., 181552=DoD is proposing to amend the Defense Federal Acquisition Regulation Supplement (DFARS) to further implement the U.S.C. statute on inflation adjustment of acquisition-related dollar thresholds. This statute requires an adjustment every five years of acquisition-related thresholds for inflation using the Consumer Price Index for all urban consumers, except for the Construction Wage Rate Requirements statute (Davis-Bacon Act), Service Contract Labor Standards statute, and trade agreements thresholds. DoD is also proposing to use the same methodology to adjust some nonstatutory DFARS acquisition-related thresholds in 2015., 89367=Title 48 published on 2014-10-01, 48513=This document contains corrections to DFARS final rule 2015-D001, Elimination of Quarterly Reporting of Actual Performance Outside the United States, which was published Thursday, December 11, 2014 (79 FR 73499). The rule that is the subject of this correction eliminates the requirement for quarterly reporting of actual contract performance outside the United States contained at DFARS clause 252.225-7006., 131436=DoD is proposing to amend the Defense Federal Acquisition Regulation Supplement (DFARS) to implement sections of the Department of Defense Appropriations Acts for Fiscal Year (FY) 2014 and FY 2015 that prohibit use of funds made available under the acts for the purchase or manufacture of a flag of the United States, unless such flag is manufactured in the United States., 60241=DoD has adopted as final, with minor editorial changes, an interim rule that amended the Defense Federal Acquisition Regulation Supplement (DFARS) to implement a section of the National Defense Authorization Act (NDAA) for Fiscal Year (FY) 2014 that prohibits acquisition of commercial satellite services from certain foreign entities., 88999=§ 1303 - Functions and authority, 6295=DoD has adopted as final, without change, an interim rule that amended the Defense Federal Acquisition Regulation Supplement (DFARS) to implement a section of the National Defense Authorization Act for Fiscal Year 2013 that addresses the allowability of legal costs incurred by a contractor related to whistleblower proceedings.}",
    "lastModified": "Fri, 17 Jul 2015 05:17:55 GMT",
    "textBeforeTable": "Additional Documents GPO FDSys XML | Text 80 FR 36718 - Defense Federal Acquisition Regulation Supplement; Technical Amendments 2015-06-26; vol. 80 # 123 - Friday, June 26, 2015 For a complete list of all Rules, Proposed Rules, and Notices view the Rulemaking tab. The following are only the Rules published in the Federal Register after the published date of Title 48. Title 48 published on 2014-10-01. 77 FR 35882, June 15, 2012] 76 FR 28877, May 18, 2011, as amended at [ (End of clause) Withholding payments. If the Contracting Officer makes a final determination to disapprove the Contractor's purchasing system, and the contract includes the clause at 252.242-7005, Contractor Business Systems, the Contracting Officer will withhold payments in accordance with that clause. (f) (e) If the Contractor receives the Contracting Officer's final determination of significant deficiencies, the Contractor shall, within 45 days of receipt of",
    "textAfterTable": "DEPARTMENT OF DEFENSE, Defense Acquisition Regulations System Final rule. Effective June 26, 2015. 48 CFR Parts 201, 213, 217, 225, and 252 Summary DoD is making technical amendments to the Defense Federal Acquisition Regulation Supplement (DFARS) to provide needed editorial changes. 80 FR 36719 - Defense Federal Acquisition Regulation Supplement: Allowability of Legal Costs for Whistleblower Proceedings (DFARS Case 2013-D022) GPO FDSys XML | Text Additional Documents type regulations.gov FR Doc. 2015-15665 RIN 0750-AI04 DEPARTMENT OF DEFENSE, Defense Acquisition Regulations System Final rule. Effective June 26, 2015. 48 CFR Parts 216 and 252 Summary DoD has adopted as final, without change, an interim rule that amended the Defense Federal Acquisition Regulation Supplement",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}