{
    "relation": [
        [
            "Categories",
            "Campus Safety",
            "Clubs and Activities",
            "Great for these types of students",
            "Share any unusual traditions or locations on campus",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "Very safe and if you don't feel comfortable walking alone in the dark you can call campus police and they will take you to your dorm. No major crimes happen in the town.",
            "Soccer Clubs, Student Government Association, Kinesiology Club, Gaming and Technology Club and many more.",
            "Like the quiet like to be surrounded by great people and a friendly community.",
            "The DESK an all time tradition here at Sul Ross you are not really considered a true SRSU students until you find the hidden desk up in the Mountain behind the Lobo Villages.",
            "There's the gym which is open to the students. The gym has a basketball court, weight room, sauna racquetball court, aerobic classes, and also a conditioning room which has treadmills, and elliptical machines. Every month on the first Monday the movie theater Rangra has free showings for the Sul Ross students. There is always football, volleyball, basketball, baseball, and softball games that you can attend to which are free to the students. There is also a game room in the University Center and you could check out games in the library.",
            "Food is always good you get to choose your meal plan which is great. Breakfast is always good you get to see the early birds (students) who have morning classes. Also breakfast lunch and diner are like an all you can eat buffet which is great because you don't have to only eat one plate and still be hungry.",
            "The dorms are great you get your own privacy, its like living in a small apartment you have a living room two bedrooms, and two sinks and one bathroom. You get to choose your roommate and its fun in general because if you don't end up with your friend you can apply for a roommate change. You could also go for the traditional dorms which is one big room with two beds and a bathroom joining two rooms which is used by four people including yourself.",
            "Its pretty decent seeing that the professors are always willing to help you out in your classes. Stress levels are fairly low because you don't always get pop quizzes or anything too difficult actually. Think of it as high school your teacher wont let you fail they want to see you succeed.",
            "Apply early and make sure that you visit the campus when you have time because that will be the best way for you to see how it really is. Don't just take my word for it also make sure that you don't become hung up with the idea of taking afternoon classes instead of morning trust me morning classes are better because it will free up your afternoons and give you time to get a job if you want to.",
            "Sul Ross is a really great school to attend you get to meet a lot of new and exciting people. Everybody is friendly all the teacher look out for you wanting to see the best of you. If you do end up deciding to come to Sul Ross you wont regret it because the atmosphere here is always fun and friendly."
        ]
    ],
    "pageTitle": "Sul Ross State University Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Sul-Ross-State-University/reviews?_escaped_fragment_=/show/50969",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988650.6/warc/CC-MAIN-20150728002308-00212-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 909044903,
    "recordOffset": 909011385,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{13663=Sul Ross provides the community with museum of Big Bend located on campus. The older dorm room hall known as Fletcher Hall is said to house a ghost named Beverly who died in the late 1970's or 80's by either suicide or a professor trying to cover his tracks of a murder. The show A Haunting filmed in Fletcher hall this past summer(2012) and the show on Fletcher hall's ghost Beverly should be airing this November., 112245=© 2015, Cappex.com, LLC, 35320=Incredible! Dorms built in 2006 and fairly new. The main thing to do in Alpine is hang out with friends and enjoy the dorm life.}",
    "textBeforeTable": "07/17/2009 Reviewer is A current student here. 11 out of 11 people found this review useful. 1 of 25 Jose from Presidio, TX Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for",
    "textAfterTable": "Tips for prospective students Register early In three sentences Small classes make it easier for one-on-one learning. Cheaper costs than most other universities. Great professors, its easy to follow the lecture Login to rate or flag the reviews Javier from Marfa, TX 06/30/2012 Reviewer is A current student here. 4 out of 4 people found this review useful. 3 of 25 Categories Comments Share any unusual traditions or locations on campus The fletcher hall where students gather to see the ghost of Beverly who had died in the late 1970's or 80's by either suicide or someone moved her body to look like an accident not sure how it happened but students get interested to know the truth about Beverly. What to do for fun Go to the mall to hang out with friends when you want to sit outside. Also go to the University Center to play games such as pool, ping pong, and xbox 360 Tips for prospective students",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}