{
    "relation": [
        [
            "Categories",
            "Campus Safety",
            "Clubs and Activities",
            "Great for these types of students",
            "Bang for the buck",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "small campus, seems safe always see school security around.",
            "Very fun playing baseball, very good teammates and coaching staff!",
            "Seems to be a very diverse student body which I like. More liberal and thinking out of the box!",
            "I am getting a very good education and a chance to play varsity sports. It has really helped me mature and take responsibility.",
            "very close to downtown Minneapolis and the U of M so always something to do if you want. light rail close by too.",
            "Different meals daily and lots of it.",
            "rooms are nice and everyone friendly, seems very safe.",
            "just have to use down time to do your homework and study. More reading and writing papers than high school.",
            "Great area small school in a big city lots to do. Able to play sports and balance school load.",
            "I really enjoy the small campus and the family feel to the school. I can get to any of my classes in 5 mins and its easy to get to know classmates and make friends!Professors take personal time with me to go over things I dont fully understand."
        ]
    ],
    "pageTitle": "Augsburg College Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Augsburg-College/reviews?_escaped_fragment_=/show/108519",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438044160065.87/warc/CC-MAIN-20150728004240-00041-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 900205783,
    "recordOffset": 900155254,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{102527=If you like small class sizes. We have a great science and religion department. Our wrestling team is really good. We will have a varsity D-3 Women's Lacrosse team in 2014., 25348=velkommen jul, a scandinavian welcome to the holiday season, is one of augsburg’s most popular traditions. alumni and friends look forward each year to the splendid banquet of sweets and treats provided by the augsburg associates. another tradition would be advent vespers, which celebrates the beginning of the christmas season with traditional and contemporary hymns, anthems, and carols. the augsburg college advent vespers celebration is one of the largest holiday music events in the twin cities with over 10,000 worshipers participating annually. held in the beautifully renovated central lutheran church in downtown minneapolis, this celebration combines more than 300 participants including choirs, instrumentalists, readers, and a full liturgical party., 30943=augsburg college is extremely welcoming and friendly. we are a part of the super competitive minnesota intercollegiate athletic conference and do well in the majority of our sports (go auggies!). we are dedicated to community service, shown through our winning the 2010 presidential award for community service., 159863=I enjoyed visiting the campus from the very first. The professors were amazingly nice and have great deal of wisdom to teach. I'm very excited to be joining this campus in the fall of 2013., 67661=This college has about a 17:1 ratio. It's amazing because you are known by your first and last name, not a number. People care here., 221465=© 2015, Cappex.com, LLC}",
    "textBeforeTable": "01/09/2011 Reviewer is A current student here. 6 out of 6 people found this review useful. 1 of 50 Nou from Coon Rapids, MN Check out reviews left by other students or leave your own review. You could win a free scholarship. Augsburg College Reviews Augsburg College › Minnesota › By State › Colleges › } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.create', -->",
    "textAfterTable": "Login to rate or flag the reviews Chue from Coon Rapids, MN 02/10/2011 Reviewer is A current student here. 2 out of 2 people found this review useful. 3 of 50 Categories Comments Great for these types of students Augsburg College is great for students of low income, wealthy students, LGBTQIA (lesbian, gay, bisexual, transgenders, questioning, inter sexual, asexual) students, straight, as well as a wide range of student. Augsburg College support diversity so it is great for a large range of students. Tips for prospective students Get involved with the community and seek the opportunities offered at Augsburg College. The more opportunities you seek, the more opportunities you will find. Bang for the buck Augsburg College cost a lot. Am enjoying being here Augsburg College offers a lot of opportunities as well as supports for students. I enjoy being at Augsburg College because there are always something happening on campus. The",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}