{
    "relation": [
        [
            "Categories",
            "Great for these types of students",
            "Bang for the buck",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "This school is great for the types of students who don't follow concepts as easily as other people, or who need more time to fully understand things gone over in courses because I felt as if each of my courses proceeded at a slower rate that should have been.",
            "You definitely get what you pay for; which isn't much considering the low-cost of tuition for this school. Don't expect a grade A education when you aren't dishing out the dough.",
            "Since on-campus residency isn't offered, there isn't really much at all on campus to do for fun.",
            "It isn't a requirement to buy a meal plan for this school as it is with other schools (I believe mainly due to the fact that on-campus living isn't offered), but once again I wouldn't be in the place to make remarks on food and dining because I never ventured to the cafeteria.",
            "I don't believe CCAC offers student residence, but even if it did I wouldn't be in the place to make a remark about it because I lived off-campus.",
            "I guess it all depends on what kind of student you are, as stated above, but this school has eerily similar degrees of difficulty as my high school courses did. I wasn't challenged at all, and a lot of times could receive high grades on exams with little to no effort as far as studying. To put it in the most plain terms, this school is a joke compared to other 4-year B.A. universities that I've attended or have heard about.",
            "As usual, make sure to attend all of your classes. Become familiar with your professors so that if some difficulty in your coursework arises, you won't have a hard time going to them to ask for help. If you're assigned homework or reading that is NOT required, do it anyway; it will only help you out in the end, take an extra hour out of your day to understand the material your professor has or will go over to the utmost degree.",
            "This school is nearly as difficult as high school was for me; which is not at all. I guess it depends on what kind of student you are, but if you yourself know that you can succeed at a more challenging school, CCAC isn't for you because you won't be challenged. I enjoyed my time at this school, but it was just too easy for me and I didn't feel like I would be taking the information that I've learned there with me in the future to help me with anything."
        ]
    ],
    "pageTitle": "Community College of Allegheny County Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Community-College-of-Allegheny-County/reviews?_escaped_fragment_=/show/25623",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438044160065.87/warc/CC-MAIN-20150728004240-00256-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 925225583,
    "recordOffset": 925168737,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{308837=© 2015, Cappex.com, LLC}",
    "textBeforeTable": "06/30/2011 Reviewer is Researching this school. Reviewer has not been to campus. 5 out of 5 people found this review useful. 1 of 74 Kerrie from New Eagle, PA Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464",
    "textAfterTable": "Did learn a lot I attended CCAC after a year at an expensive private 4-year college. If it was an option I would still be at CCAC. The Community College stereotype is one that needs to be re-written. The classes at CCAC were the exact same quality as anywhere else. The classes had challenge, the teachers cared, and I left feeling enriched. I took classes over the entire spectrum and I was happy with every one. I ended with all of my expectations fulfilled. I would suggest Community College to anyone and everyone. Login to rate or flag the reviews Alana from Gibsonia, PA 10/10/2009 Reviewer is A current student here. 3 out of 4 people found this review useful. 3 of 74 Categories Comments Great for these types of students *Student who don't exactly know their major * students who have struggled in high school(supportive services staff is excellent) Tips for prospective students * get involved * if you go through a financial issue",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}