{
    "relation": [
        [
            "Part #",
            "CR-5200-2250",
            "CR-5100-2230",
            "CR-5050-4258"
        ],
        [
            "Distributor",
            "ASAP Semiconductor",
            "ASAP Semiconductor",
            "ASAP Semiconductor"
        ],
        [
            "Manufacturer",
            "RADWIN",
            "RADWIN",
            "RADWIN"
        ],
        [
            "Product Category",
            "Not Provided",
            "Not Provided",
            "Not Provided"
        ],
        [
            "Description",
            "FibeAir 2500 HBS 5200 Series, Base Station Radio Connectorized f",
            "FA2500-HBS-100 Base Station Radio Connectorized for external ant",
            "FA2500 HBS 5050 Series, Base Station Radio Connectorized for ext"
        ]
    ],
    "pageTitle": "Base Radio Station | Products & Suppliers | IHS Engineering360",
    "title": "",
    "url": "http://www.globalspec.com/industrial-directory/base_radio_station",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988650.6/warc/CC-MAIN-20150728002308-00023-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 463286787,
    "recordOffset": 463251664,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{66307=Description: The TriQuint TGA2904-FL is a compact 2 Watt packaged high power amplifier MMIC for Ku band applications. The part provides 33 dB nominal gain. This part is ideally suited for low cost emerging markets such as base station transmitters for satellite ground terminals and point-to-point radio, 104946=Description: The CC-3000 is our next generation data logger and computer interface. Connectivity, storage capacity and features have all been enhanced. The CC-3000 replaces the CC-2000 and MKIIICC interface. Please be sure to select the model that matches your weather station. Long range versions support LR, 124271=Description: The Avago ACFF-1025 is a miniaturized LTE Band 41 (2496 - 2690 MHz) bandpass filter combined with a WLAN/WiFi band-reject filter. The device is a highly selective bandpass filter designed for use in cellular base station and indoor small cell applications. The ACFF-1025 is designed to operate, 115721=Description: The Racal Instruments Wireless Solutions (RIWS) 6113 Digital Radio Test Set provides a wide range of test and measurement functions to enable fast manual or automatic testing of GSM850, GSM900, GSM1800 or GSM1900 Base Transceiver Stations (BTSs). Applications includes installation and commissioning, 43150=Description: useful for a variety of base-station and other wireless applications, including automatic gain control (AGC), transmitter power measurements, and received signal-strength indication (RSSI) for terminal devices. The MAX2014 can also be operated in a controller mode where it measures, compares}",
    "textBeforeTable": "Parts by Number Top",
    "textAfterTable": "Conduct Research Top Creating cloud base stations with TI's KeyStone multicore architecture issues ranging from site acquisition, to coverage and capacity enhancement, to environmental stewardship (green base sta¬tions). This paper explores how TI is scaling its KeyStone multicore architecture for the emerging paradigm of C-RAN base stations, enabling the creation of device pools Radio Frequency Interference in Hospitals Hospitals are replete with sources of interference and many applications that require the ultimate in reliability to assure patient safety. Patient telemetry systems, cellular telephones, bluetooth devices, security radio systems, police and paramedic radios, Wi-Fi, microwave ovens, cordless Wired 8.03: Must Read to consumers as the heartbeat of the Apple AirPort. On the PC side, Wireless Ethernet options include Aironet, which makes the 4800B family of base stations ($1,495) and radio cards ($295) pictured here. To share files wirelessly with a small business team, only the radio Medical Device Link . First Wireless Chip Designed for In-Body Communication Systems Debuts ) has introduced the world 's first transceiver chip designed exclusively for wireless communication systems that link implanted medical devices and base stations. The ZL70100 ultra-low-power transceiver chip fully meets the MICS",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}