{
    "relation": [
        [
            "Patent application number",
            "20100250274",
            "20130073594",
            "20140379310"
        ],
        [
            "Description",
            "MATHEMATICAL INDEX BASED HEALTH MANAGEMENT SYSTEM - A process for health management of participants includes gathering data on health attributes of the participants. The Kanri index value for each of the participants is then calculated by performing Gram-Schmidt orthogonalization and Mahalanobis distance for each of the participants from a mean of the Gram-Schmidt variables. The participant is then provided with a high impact prescription from the health attributes to improve participant health.",
            "Methods and Systems for Assessing Data Quality - Methods and systems for assessing data involve, collecting samples of data elements from a database storing a population of data elements representing attributes of each numerous different financial transactions. Critical data elements from the collected samples are determined. Data quality rules are built and data dimensions are calculated for the critical data elements. A quality of data within the critical data elements for different data quality dimensions is monitored. Critical data elements that produce a high number of outliers are identified and causes for the outliers are identified. Thereafter, a corrective action plan to address a solution for the causes for the outliers may be developed and executed.",
            "Methods and Systems for Evaluating Predictive Models - Multidimensional methods and systems for evaluating and comparing predictive models involve, for example, receiving data related to predictions produced by each of a plurality of different predictive models and determining a score for each of a plurality of dimensions for each of the predictive models. A composite score may be calculated for each of the predictive models based at least partly on the dimension scores, and a recommendation may be generated based on comparing the composite scores."
        ],
        [
            "Published",
            "09-30-2010",
            "03-21-2013",
            "12-25-2014"
        ]
    ],
    "pageTitle": "Rajesh - Patent applications",
    "title": "",
    "url": "http://www.faqs.org/patents/inventor/rajesh-7/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042985140.15/warc/CC-MAIN-20150728002305-00173-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 446901947,
    "recordOffset": 446859370,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Rajesh Jugulum, Franklin, MA US 05-26-2011 SCREENING FOR COMPOUNDS HAVING IMMUNOSUPPRESSANT ACTIVITY BY TESTING IMPACT ON LEUKOCYTE-SPECIFIC CALCIUM FLUXES - The invention relates to an assay for the identification of a compound having immunosuppressant activity, wherein a candidate compound is analyzed whether it blocks the Ca 20110123994 Published Description Patent application number Rajesh Jayac Han Dran, Basel CH 05-12-2011 System for Automated Generation of Computer Test Procedures - A system automatically generates a workflow report for computerized system testing and other uses. The system comprises at least one processing device including at least one log file including records identifying time stamped actions performed by a user of a computerized processing system and actions performed by the system. A repository includes stored predetermined data patterns associated with workflow tasks performed in a workflow by a user and a system. A parser automatically parses records of the at least one log file to identify workflow tasks performed during a time period using the predetermined data patterns. A report generator automatically generates a workflow report comprising the identified workflow tasks and associated time stamps indicating workflow tasks performed by the system and user during the time period. An output processor provides the generated workflow report to a destination device for access by a user. 20110113287 Published Description Patent application number Rajesh Gururaj, Schaumburg, IL US 11-20-2008 COMPUTER",
    "textAfterTable": "Patent applications by Rajesh Jugulum, Franklin, MA US Rajesh Juluri, San Jose, CA US Patent application number Description Published 20100031123 UNIFIED MEMORY ARCHITECTURE FOR RECORDING APPLICATIONS - An apparatus comprising a first circuit, a second circuit and a disc. The first circuit may be configured to (i) extract video data as data blocks from an input signal and (ii) perform error correction on the data blocks with a delta syndrome based iterative Reed-Solomon decoding. The second circuit may be configured (i) to decode corrected video data into a video format in a first state, (ii) encode the corrected video data in a second state and (iii) share an external memory between the first circuit and the second circuit. The disc may be configured to store encoded video data in the second state. 02-04-2010 Patent applications by Rajesh Juluri, San Jose, CA US Rajesh Kadikar, Windsor CA Patent application number Description",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}