{
    "relation": [
        [
            "First Name",
            "Steven E.",
            "David H."
        ],
        [
            "Last Name",
            "Bachmann",
            "Morrison"
        ],
        [
            "Suffix",
            "",
            ""
        ],
        [
            "Covered Official Position (if applicable)",
            "",
            ""
        ],
        [
            "New",
            "",
            ""
        ]
    ],
    "pageTitle": "LD-2 Disclosure Form",
    "title": "",
    "url": "http://soprweb.senate.gov/index.cfm?event=getFilingDetails&filingID=231E707A-B29F-40DE-8674-B2326588635A&filingTypeID=51",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042985140.15/warc/CC-MAIN-20150728002305-00330-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 233542839,
    "recordOffset": 233534102,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{93098=S. 761, Acquisition Workforce Improvement Act, Improvements in Industry Workforce. H.R. 3012, Fairness for High-Skilled Immigrants Act of 2011, Employment Education. H.R. 2161, Immigration Driving Entrepreneurship in America Act of 2011, Workforce Education. H.R. 1424, Federal Acquisition Improvement Act of 2011., 26689=S. 365, Budget Control Act of 2011, Sequestration Impacts. H. Con. Res. 112., 1019=Lobbying Disclosure Act of 1995 (Section 5) - All Filers Are Required to Complete This Page, 85136=R&D Tax Credit. Bonus Depreciation - H.R. 4196 and S. 2240, Long Term Contracts Technical Corrections. 2% Excise Tax on Certain Foreign Contracts. 3% Withholding. Tax Reform. Statutory Corporate Tax Rate. R&D Audit Procedures., 52832=H.R. 2072, Securing American Jobs Through Exports Act of 2011, US Export - Import Bank Issues. S. 1547, Export-Import Bank Reauthorization Act of 2011, US Export-Import Bank Issues. H.R. 2682, Business Risk Mitigation and Price Stabilization Act of 2011, Securities. Derivatives H.R. 3606, Jumpstart Our Business Startups Act Corporate Governance. Business Conduct Standards., 68698=US - Turkey Relations. US - Azerbaijan Relations. US - Sri Lanka Relations. US - Pakistan Relations. H.R. 1905, Iran Threat Reduction Act, Flight Safety Issues. S. 2101 Iran Sanctions, Accountability and Human Rights Act of 2012, Flight Safety Issues. H.R. 2105 Iran, North Korea, and Syria Nonproliferation Reform and Modernization Act 0f 2011, Flight Safety Issues. Arms Sales Overseas., 80570=S. 2808, Employ America Act, Employment Issues. Protecting America's Workers Act. Pension Funding. Labor Laws. PBGC Premium Increase. NLRB Case Description - Litigation Briefings., 19908=H.R. 658 and S. 223, FAA Air Transportation Modernization & Safety Improvement Act, FAA Funding. H.R. 2594, European Union Emissions Trading Scheme Prohibition Act of 2011, Commercial Aviation. H.R. 2179, Passenger and Cargo Aviation Security. S. 2233, Jobs Originated Through Launching Travel Act. H.R. 3855, S. 2046 Visa Waiver Program Enhanced Security and Reform Act. Aviation Safety. Next Generation Air Traffic Management. Spectrum. Foreign Repair Stations. Certification. Lithium Batteries Unmanned Aerial Vehicles, 73346=H.R. 3674, The Promoting and Enhancing Cybersecurity and information Sharing Effectiveness Act of 2011. H.R. 3523, Cyber Intelligence Sharing and Protection Act of 2011; S 2105 Cybersecurity Act of 2012; S. 2151, Strengthening and Enhancing Cybersecurity by Using Research, Education, Information and Technology (SECURE IT). H.R. 174, Homeland Security, Cyber, and Physical Infrastructure Protection Act of 2011, Cybersecurity Requirements. Border Security. Homeland Security Technology. Maritime Security. Container Security. Aviation Security. Cyber Security. Bioterrorism. Foreign Repair Stations., 77782=H.R. 3523, Cyber Intelligence Sharing and Protection Act of 2011, Cyber threat information sharing with the Intelligence Community. Intelligence Programs., 34694=H.R. XXXX and S. XXXX, Department of Defense Appropriations Act, 2013, Defense and Intelligence Appropriations Programs. H.R. XXXX and S. XXXX, National Defense Authorization Act for Fiscal Year 2013, Defense Authorization Programs. H.R. XXXX and S. XXXX Military Construction and Veterans Affairs Appropriations Act. Navy and Air Force Tactical Aviation. Airborne Tanker. Air Mobility Programs. Unmanned Systems. Military Aircraft Applications from Commercial Derivatives. Defense Energy. Military Satellite Communication Programs. Communications Science and Technology. Manufacturing Research and Development. Cyber Security / Cyber Command. Performance Based Logistics. Missile Defense Programs. Prompt Global Strike. Global Positioning Systems. Space Launch Vehicles. Intelligence, Surveillance, and Reconnaissance Satellite Systems. High Altitude Long Endurance UAVs. Micro Grids. CH-47/V-22 Multi-Year Procurement. Defense Policy Provisions., 12239=H.R. 658 and S. 223, FAA Air Transportation Modernization & Safety Improvement Act, FAA Funding. H.R. XXXX and S. XXXX, Commerce, Justice, Science, and Related Agencies Appropriations Act, 2012, NASA Funding. H.R. XXXX and S. XXXX NASA Reauthorization. H.R. XXXX and S. XXXX Transportation, HUD and Related Agencies Appropriations Bill. FAA Funding. International Space Station, Funding and Safety. Aeronautics. Commercial Space Launch. Science Education. Space Exploration. Science Programs - NASA. Science Programs - NOAA. Space Shuttle Constellation Program / Space Launch System Next Generation Air Traffic Management. Aviation Safety. Foreign Repair Stations. Lithium Batteries Certification Unmanned Aerial Vehicles STEM Research and Funding Aeronautics Research}",
    "textBeforeTable": "",
    "textAfterTable": "City ARLINGTON State VA Zip Code 22209 Country USA 3. Principal place of business (if different than line 2) City  Chicago State  IL Zip Code  60606 Country  USA 4a. Contact Name b. Telephone Number c. E-mail  Mr.  Paul Heilig  7034653666  paul.t.heilig@boeing.com 5. Senate ID#  6597-12",
    "hasKeyColumn": true,
    "keyColumnIndex": 1,
    "headerRowIndex": 0
}