{
    "relation": [
        [
            "Patent application number",
            "20110052130",
            "20110292661",
            "20120020609"
        ],
        [
            "Description",
            "ORGANIC DEVICE AND METHOD FOR MANUFACTURING ORGANIC DEVICE - An organic device has a substrate made of polymer, and a polymer layer adhered on the substrate. A crystallization degree of an adhesive surface with the polymer layer in the substrate is smaller than a crystallization degree of an interior of the substrate. In a manufacturing method for manufacturing an organic device including a substrate made of polymer; and having a polymer layer adhered on the substrate, the manufacturing method includes performing a low crystallization process on an adhesive surface with the polymer layer in the substrate to have a crystallization degree lower than a crystallization degree of an interior of the substrate.",
            "OPTICAL WAVEGUIDE, OPTICAL TRANSMISSION MODULE, ELECTRONIC DEVICE AND METHOD FOR MANUFACTURING OPTICAL WAVEGUIDE - A light guide includes a core made of material having translucency and an optical path conversion mirror for reflecting the signal light from the optical element and converting the optical path of the signal light formed on at least the core. The signal light is transmitted through the core by the reflection at the optical path conversion mirror. The optical path conversion mirror surface has an inclination angle α formed with a bottom surface of the core changing in the X-direction in a cross-sectional shape in which the core is cut at a YZ plane, the Y-direction being an optical axis direction of the optical element, the Z-direction being an advancing direction of the signal light of the light guide, and the X-direction being a direction perpendicular to both the Y-direction and the Z-direction.",
            "OPTICAL WIRING ARRANGEMENT AND OPTICAL TRANSMISSION MODULE - An optical wiring mounted on an electronic device has a light transmission path for transmitting an optical signal. A function layer that reduces friction generated when coming in contact with a structural body in the electronic device to lower than when the light transmission path comes in contact with the structural body, and that bends according to deformation of the light transmission path, is arranged."
        ],
        [
            "Published",
            "03-03-2011",
            "12-01-2011",
            "01-26-2012"
        ]
    ],
    "pageTitle": "Yoshitake, JP - Patent applications",
    "title": "",
    "url": "http://www.faqs.org/patents/inventor/yoshitake-jp-5/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988650.6/warc/CC-MAIN-20150728002308-00325-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 433102743,
    "recordOffset": 433074711,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Naoki Yoshitake, Nara JP 02-06-2014 SWITCH AND METHOD FOR MANUFACTURING THE SAME, AND RELAY - A switch and a relay include a contact with a smooth contacting surface. A side surface of a fixed contact faces a side surface of a movable contact. The fixed contact has an insulating layer and a base layer stacked on a fixed contact substrate, and a first conductive layer formed thereon through electrolytic plating. The side surface of the first conductive layer that faces the movable contact becomes the fixed contact (contacting surface). The movable contact has an insulating layer and a base layer stacked on the movable contact substrate, and a movable contact formed thereon through electrolytic plating. A side surface of a second conductive layer that faces the fixed contact becomes the movable contact (contacting surface). The fixed contact and the movable contact have surfaces that contact the side surfaces of the mold portion when growing the first and second conductive layers through electrolytic plating. 20140034465 Published Description Patent application number Naoki Yoshitake, Shiga JP 10-22-2009 Screen display control device - A screen display control device includes: a compression unit which compresses input image data in a line unit; a rewritable image memory to which the compressed data compressed in the line unit by the compression unit is written in non-synchronization with a reading process; a decompression unit which decompresses the compressed data periodically read from the",
    "textAfterTable": "Naoki Yoshitake, Otsu-Shi JP Patent application number Description Published 20110209970 SWITCH AND METHOD FOR MANUFACTURING THE SAME, AND RELAY - A switch and a relay include a contact with a smooth contacting surface. A side surface of a fixed contact faces a side surface of a movable contact. The fixed contact has an insulating layer and a base layer stacked on a fixed contact substrate, and a first conductive layer formed thereon through electrolytic plating. The side surface of the first conductive layer that faces the movable contact becomes the fixed contact (contacting surface). The movable contact has an insulating layer and a base layer stacked on the movable contact substrate, and a movable contact formed thereon through electrolytic plating. A side surface of a second conductive layer that faces the fixed contact becomes the movable contact (contacting surface). The fixed contact and the movable contact have surfaces that contact the side surfaces of the mold portion when growing the first and second conductive layers through electrolytic plating. 09-01-2011 20110220473 SWITCH, METHOD OF MANUFACTURING THE SAME, AND RELAY - A switch has a first contact portion in which a plurality of conductive layers is stacked on an upper side of a first substrate, and a second contact portion in which a plurality of conductive layers is stacked on an upper side of a second substrate. Respective end faces of the conductive layers at the first contact portion are",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}