{
    "relation": [
        [
            "Alert Type",
            "Watch",
            "Warning"
        ],
        [
            "Location",
            "National, including all coastal and inland regions",
            "National, including all coastal and inland regions"
        ],
        [
            "Threshold Criteria",
            "When, within the following 36 hours, a tropical storm or a developing tropical storm is expected to pose a possible threat, with the risk of tropical-storm force winds (average sustained winds of 63-117 km/h) threatening the area. This watch could be issued for: A tropical storm; or A hurricane that might approach an area but be far enough away that it is expected to bring gales that are less than hurricane force (118 km/h or higher).",
            "When coastal and/or coastal winds of 63 to 117 km/h caused by a tropical cyclone are expected to occur."
        ]
    ],
    "pageTitle": "Public Alerting Criteria - Weather and Meteorology - Environment Canada",
    "title": "Table 23. Alerting parameters Environment Canada uses for issuing a Tropical Storm Watch and/or Warning",
    "url": "http://www.ec.gc.ca/meteo-weather/default.asp?lang=En&n=D9553AB5-1",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042985140.15/warc/CC-MAIN-20150728002305-00216-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 419901775,
    "recordOffset": 419883728,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{296=In April 2014, Environment Canada changed its list of alert types, to more accurately describe the severity of different weather hazards. They include some name changes, type changes and two new Advisory bulletins, as described below.}",
    "textBeforeTable": "In April 2014, Environment Canada changed its list of alert types, to more accurately describe the severity of different weather hazards. They include some name changes, type changes and two new Advisory bulletins, as described below. Changes to Environment Canada's Alerting System - Effective April 8th, 2014 Public Alerting Criteria Public Alerting Criteria Public Forecasts How to Use Our Forecasts Weather and Meteorology Home Breadcrumb trail   Funding Environmental Indicators Publications (A – Z) Resources   Acts and Regulations – Main Page Species at Risk Public Registry Canadian Environmental Protection Act (CEPA) Environmental Registry Regulations Permits Agreements Acts Acts and Regulations   More about Science and Technology Environmental Science Centres Environmental Science News Science and Technology More about Weather Hazardous Weather Weather Forecast Weather More about Pollution and Waste Managing and Reducing Waste",
    "textAfterTable": "Additions NEW - as of April 8th, 2014 Fog Advisory Weather Advisory Alert Criteria for the New Advisories Alert Type Basic Criteria Blowing Snow Advisory Low visibilities in blowing snow expected for a significant duration. (this alert is not issued for Nunavik, or areas north of the treeline) Fog Advisory Low visibilities in fog expected for a significant duration. Newfoundland and Labrador, New Brunswick, Nova Scotia and Prince Edward Island have different criteria from the rest of Canada (this alert is not issued for Nunavik). Freezing Drizzle Advisory Freezing Drizzle is expected for a significant duration. (this alert is not issued for Nunavik) Frost Advisory Frost is expected (this alert is not issued for Nunavik). Weather Advisory An alert that can be used for any situation for which there is no other alert that effectively describes the conditions expected. Introduction to Heat and Extreme Cold Warnings Heat and Extreme Cold Warnings have also been introduced in conjunction with Health Canada. The Heat Warning replaces a series of regional heat, Humidex or heat and humidity alerts while the Extreme Cold Warning replaces the Wind Chill Warning.",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}