{
    "relation": [
        [
            "Item:",
            "DIFT12",
            "",
            "",
            ""
        ],
        [
            "Type: Adena Blade",
            "A gorgeous light blue with white speckles Flint Ridge flint Adena Blade which appears",
            "to be a first-stage specimen. It's well flaked on both faces, mostly by percussion",
            "flaking, and has just the slightest nibble from the very tip. An exceptional artifact!",
            "Era: Archaic to Woodland period - 1,200 to 3,000 years old"
        ],
        [
            "Provenance:",
            "Recovered from",
            "Licking County, Ohio",
            "",
            "Rogers COA"
        ],
        [
            "Price",
            "950.00",
            "",
            "",
            ""
        ]
    ],
    "pageTitle": "Ancient Native American Indian Artifacts, Relics and Arrowheads - Flint Tools Page 2",
    "title": "",
    "url": "http://westernartifacts.com/flinttools2.htm",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988650.6/warc/CC-MAIN-20150728002308-00252-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 274313839,
    "recordOffset": 274289559,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{114471=Era: Archaic period - est. 2300 to 3400 years old (at least, as this territory}",
    "lastModified": "Sat, 11 Jul 2015 00:56:57 GMT",
    "textBeforeTable": "Click on the Photo set above for an enlarged photo 4/9 ON-HOLD ms Era: Paleo Period - 9,000 to 11,000 years old 75.00 Oregon during the 1920's was salvaged and re-worked from an early period Cougar Mountain stemmed point. 125.00 Recovered from Prineville in Crook County, A most interesting, bi facially worked red, tan and green jasper Hafted Scraper which DFFT19 Price Provenance: Type: Cougar Mountain Scraper Item: Click on the Photo set above for an enlarged photo Era: Early Archaic Period - 4,000 to 8,000 years old percussion style with secondary pressure flaking to it's edges. 175.00 Oregon during the 1920's Cascade Knife Blade which is roughly flaked on both faces",
    "textAfterTable": "Click on the Photo set above for an enlarged photo   Item: Type: Knife River Flint Archaic Knife Provenance: Price DIFT13 A VERY long, sturdy and well made semi-translucent, honey colored Knife River flint Archaic Recovered in Wisconsin SOLD 4/30 Knife blade which shows little signs of ancient resharpening(s). It's well flaked on both faces, mostly by percussion flaking with secondary pressure flaking around it's edges, as part of the resharpening process. It has a very slight ancient nick to the tip which was most likely caused by use, but is otherwise \"all there\" as it was anciently made and used. Quite a striking piece! Era: Early Archaic Period - 5,000 to 8,000 years old Rogers COA dlbb",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}