{
    "relation": [
        [
            "Poster",
            "vintagedetroitiron30567",
            "Just popping in Joined: 2004/2/8 From: Posts: 1",
            ""
        ],
        [
            "Thread",
            "Posted: 2005/12/7 9:58 Updated: 2005/12/7 9:58",
            "Re: Liberty CRD One of the Most Disappointing? I went to check on the availabilty of a diesel Liberty in the fall of 2004. I wanted better mileage than the 16-18 I was getting from my Scrambler. I drive 800-1000 miles a week for work here in Vermont. The diesels were not available yet, and I don't think they will be sold in this Blue State because they are \"too dirty\", anyway I bought a left over Liberty Renegade with the 5 speed, I have 55000 miles on it now and get 22-24 mpg constantly. I am very happy with the mileage and the vehicle. I've had over a dozen CJs, a YJ and currently have a TJ over the last 33 years.",
            ""
        ]
    ],
    "pageTitle": "mike's totally free jeep news now - News",
    "title": "",
    "url": "http://www.jeepnewsnow.com/modules/news/article.php?storyid=883",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042985140.15/warc/CC-MAIN-20150728002305-00047-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 532124651,
    "recordOffset": 532107179,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{2812=MSN Autos has an article about the hits and misses of the 2005 auto year - surprisingly, the Liberty CRD is one of the most disappointing:}",
    "textBeforeTable": "Note that the average consumer mileage was pretty much on par with the EPA estimates. Both were considerably above the laughable Consumer Reports estimate. These reports give the Liberty 102 miles greater in range per tank of gas than the Consumer Reports estimate. http://www.fueleconomy.gov/mpg/MPG.do?action=mpgData&vehicleID=21596&details=on&browser=true True Consumer Mileage: http://www.fueleconomy.gov/feg/2001cartablef.jsp?id=22529 EPA Fuel Estimates:  Re: Liberty CRD One of the Most Disappointing? Posts: 377 From: Joined: 2005/7/13 Home away from home Updated: 2005/11/9 8:35 Posted: 2005/11/9 8:35   RUBICON Thread Poster they don't know what they are talking about. my friend has a CRD and won't stop talking about it  Re: Liberty CRD One of the",
    "textAfterTable": "Much peppier than any other diesel I have ever driven...small lag at standstill, not bad when moving. Definitely takes off when the turbo kicks in. Will be happier when biodiesel prices come down and its more readily available, also the low sulphur diesel will be available mid-next year, even further reducing emissions. Take care all. Drop me a line if you have any other questions about my CRD! Poster Thread myhotwheels22981 Posted: 2005/11/9 0:30   Updated: 2005/11/9 0:33 Home away from home Joined: 2002/3/22 From: Posts: 247  Re: Liberty CRD One of the Most Disappointing? I'd be willing to bet OOJ's pristine, heritage YJ that the guy who wrote this review didn't even step foot in the CRD to take a road test, and is probably some suck-up greenie trying in some flailing attempt to sway buyers away from buying a CRD...",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}