{
    "relation": [
        [
            "Name",
            "MusicPlasma",
            "Grokker2",
            "Kartoo",
            "TYPO3",
            "Blinkx",
            "Mooter"
        ],
        [
            "Kind",
            "Great! Try with your favorite musician!",
            "Information",
            "\"...is a metasearch engine with visual display interfaces...\"",
            "Content Management",
            "Also Video and personal files search",
            "Probably not available now..."
        ],
        [
            "Free?",
            "Yes",
            "No, license",
            "Yes",
            "Yes *You need to install",
            "Beta",
            "Yes"
        ]
    ],
    "pageTitle": "María Jordano: Web 2.0 & Languages teaching",
    "title": "",
    "url": "http://www.mariajordano.com/cmc_research/cmc.htm",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042985140.15/warc/CC-MAIN-20150728002305-00248-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 573592755,
    "recordOffset": 573566018,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{24643=November 2003: \"Online Discussion\", Side Bars, 28474=Gonzalez, Dafne TEACHING AND LEARNING THROUGH CHAT: A TAXONOMY OF EDUCATIONAL CHAT FOR EFL/ESL IATEFL Poland Computer Special Interest Group, Vol. 3, Issue 4 (October 2003), 50316=Markus, K. (2003) Negotiation Of Meaning And Code switching in Online Tandems, Language & Learning Technology (Vol. 7, No.2, May 2003, pp. 145-172), 76627=\"Creating and using weblogs in ESL/EFL\" (2004) Ev2004 Session on Blogs for EFL, 77611=Suzuki,R (2004) Diaries as introspective research tools: From Ashton-Warner to Blogs, TESJ, Vol. 8. No. 1 INT June 2004, 80045=Robert E. Raygan, Internet Collaboration, UAB ECE Special Topics with David G. Green Fall 2001, 28220=Almeida d'Eça, T. The Use of chat in EFL/ESL, T-esl-tj, Vol. 7. No. 1 Int June 2003, 79756=Educational Wikis: features and selection criteria, International Review of Research in Open and Distance Learning, (April - 2004), 121084=Conferencia Ibero-Americana www/Internet 2005}",
    "lastModified": "Sun, 04 Nov 2012 21:35:31 GMT",
    "textBeforeTable": "Articles and Bibliography on mapping for developing ideas Banxia explorer Bibliography (Very complete one) Concept Mapping by Greg Freeman   Visual Search Engines One of the best in Open software Free Mind Open source application Map It! In other languages too. (view example) Concept Map Developed by Buzan Mind Genius From Banxia, it seems to be good, but pay. :( Decision Explorer / Viewer An on-line shop to find all the programs here shown. Mind mapping shop It is also also offers a trial, since it is not free...",
    "textAfterTable": "  CoP Websites Nodos en la red A very good quality blog on communities and knowledge management (Spanish) APQC's KM blog \"...is a non-profit association that has been researching knowledge management initiatives for the past 10 years...\" Community Intelligence \"...is an organisational transformation agency, committed to augment the capability of people and organisations to learn, work and evolve together...\" CpSquare \"...the community of practice on communities of practice\". Reframing the future A site of research papers, theories on communities, professional development, etc... KM CoP Sig A KM community dealing only with CoP. They also admit articles and papers.",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}