{
    "relation": [
        [
            "",
            "Tests",
            "ODIs",
            "T20Is",
            "First-class",
            "List A",
            "Twenty20"
        ],
        [
            "Mat",
            "36",
            "157",
            "31",
            "54",
            "197",
            "75"
        ],
        [
            "Inns",
            "51",
            "157",
            "31",
            "",
            "",
            "75"
        ],
        [
            "Balls",
            "5990",
            "7813",
            "687",
            "8673",
            "9726",
            "1627"
        ],
        [
            "Runs",
            "3239",
            "6177",
            "946",
            "4540",
            "7615",
            "2170"
        ],
        [
            "Wkts",
            "78",
            "200",
            "26",
            "129",
            "263",
            "67"
        ],
        [
            "BBI",
            "4/60",
            "6/26",
            "4/19",
            "4/27",
            "6/26",
            "4/19"
        ],
        [
            "BBM",
            "5/88",
            "6/26",
            "4/19",
            "",
            "6/26",
            "4/19"
        ],
        [
            "Ave",
            "41.52",
            "30.88",
            "36.38",
            "35.19",
            "28.95",
            "32.38"
        ],
        [
            "Econ",
            "3.24",
            "4.74",
            "8.26",
            "3.14",
            "4.69",
            "8.00"
        ],
        [
            "SR",
            "76.7",
            "39.0",
            "26.4",
            "67.2",
            "36.9",
            "24.2"
        ],
        [
            "4w",
            "4",
            "5",
            "1",
            "7",
            "8",
            "1"
        ],
        [
            "5w",
            "0",
            "1",
            "0",
            "0",
            "2",
            "0"
        ],
        [
            "10",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0"
        ]
    ],
    "pageTitle": "Mashrafe Mortaza | Bangladesh Cricket | Cricket Players and Officials | ESPN Cricinfo",
    "title": "",
    "url": "http://www.espncricinfo.com/county-cricket-2013/content/player/56007.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988650.6/warc/CC-MAIN-20150728002308-00325-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 422536087,
    "recordOffset": 422498424,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{71393=Jul 7, 2015, 72174=Jul 5, 2015, 64991=Mashrafe's entry also sparked plenty of enthusiasm because he was the first genuine fast bowler to emerge from Bangladesh since their entry into Test cricket in 2000. He was sent to a camp conducted by West Indian great Andy Roberts, who proclaimed that Mashrafe had a great future. The selectors fast-tracked his growth and within a few months, during which he played four games for Bangladesh A in India, the young man from far-off Narail took the new-ball against visiting Zimbabwe. Soon it was clear that he had what it takes: Mashrafe was making the likes of Grant Flower jump around due to his pace, a first for a Bangladeshi fast bowler., 65678=But another thing was also clear to those who observed him - his rickety bowling action. Feet and arms landed in the wrong arcs, and soon the injuries set in. And that has been the story of his career. Mashrafe has missed more games for Bangladesh than he has played ever since his 2001 debut. He has had seven operations on his legs, knees and ankles, which have taking a beating - first due to poor handling by captains who gave him long and ill-adviced bowling spells, and then due to freakish accidents., 34663=Born October 5, 1983, Norail, Jessore, 64619=The quintessential country boy, Mashrafe Bin Mortaza epitomised the term \"bursting onto the scene\". He first came into attention during an under-17 regional tournament in 2001 when he bowled fast, slammed sixes and dived around without a care in the world., 66228=After many missed games in between the odd fiery spell, Mashrafe rose to prominence in 2004, when he helped Bangladesh beat India for the first time. He was ever-present when Bangladesh pushed Australia but dropped the crucial catch of Ricky Ponting that cost the home side a win. But he made up the following year when his four-wicket haul destroyed India in the 2007 World Cup game at Port-of-Spain. Mashrafe's early strikes have always helped Bangladesh, none more so than in the 2009 tri-series final when he and Nazmul Hossain sunk Sri Lanka to a new low - six runs for five wickets. Bangladesh lost the game but Mashrafe was tremendous in his ten overs., 70495=Jul 10, 2015, 86720=4391 runs after 35, and 2354 outside top five, 66930=He was made captain in mid-2009 but in his first Test in charge, fell over and injured his knee. When he returned the next year, he led Bangladesh to a win against England in the summer of 2010 before falling over once again in his home debut as captain, against New Zealand. He missed the 2011 World Cup after yet another knee injury, but has since made a successful return in the 2012 Asia Cup. Mohammad Isam}",
    "textBeforeTable": "Batting and fielding averages }); } } window.setTimeout(fixIframe,1300); if($('.FB_ElementReady iframe').height()>38 || $('.FB_ElementReady iframe').height()==0 || $('.FB_ElementReady iframe').height()== null){ $('.FB_ElementReady iframe').css({'height':'30px','width':'300px'}); function fixIframe(){ fixIframe(); jQuery(document).ready(function($){",
    "textAfterTable": "0 32 28 16 0 Bowling averages Mat Inns Balls Runs Wkts BBI BBM Ave Econ SR 4w 5w 10 Tests 36 51 5990 3239 78 4/60 5/88 41.52 3.24 76.7 4 0 0 ODIs 157 157 7813 6177 200 6/26 6/26 30.88 4.74 39.0 5 1 0 T20Is 31 31 687 946 26 4/19 4/19 36.38 8.26 26.4 1 0 0 First-class 54 8673 4540 129 4/27 35.19 3.14 67.2 7 0 0",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}