{
    "relation": [
        [
            "Course Requirements",
            "English(Comp I & II, speech, & lit)",
            "Human Anatomy & Physiology",
            "Social Sciences",
            "Statistics",
            "Principles of Management",
            "Personnel Administration/ Human Resources",
            "Medical Terminology",
            "Information Systems",
            "System Analysis and Design",
            "Database Management",
            "Electives",
            "Total"
        ],
        [
            "Hours",
            "12",
            "8",
            "6",
            "3",
            "3",
            "3",
            "3",
            "3",
            "3",
            "3",
            "45",
            "92**"
        ],
        [
            "Equivalent Courses",
            "ENGL 1010, 1020, 2110, etc. SPCH 103*",
            "BIOL 2010 & BIOL 2020",
            "Sociology, Economics, History, Psychology",
            "MATH 1530",
            "Not offered; must be taken at another college or university",
            "MGT 264",
            "AHC 115",
            "INFS 1010",
            "Not offered; must be taken at another college or university",
            "Appropriate level course not offered; must be taken at another college or university",
            "Suggested electives include accounting, business law, organizational behavior and theory, management information systems, business communications. Courses taken in health information technology will also count as electives.",
            ""
        ]
    ],
    "pageTitle": "UTHSC | Allied Health | Health Informatics and Information Management | BS Prerequisite Courses",
    "title": "",
    "url": "https://www.uthsc.edu/health-professions/him/graduate/pre-reqs.php",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042985140.15/warc/CC-MAIN-20150728002305-00077-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 934963423,
    "recordOffset": 934949681,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{43494=ENG 1113 & 1123 and two of the following: ENG 2223, 2233, 2323, or SPT 1113, 87356=© 2007-2013 The University of Tennessee Health Science Center, 44896=IST 1163, 45032=Suggested electives: ACC 1213 Principles of Accounting I ACC 1223 Principles of Accounting II BAD 2413 Legal Environment of Business I, 53882=Suggested electives ISDS 2755 Intro to Management Information Systems MGMT 1000 Introduction to Business MGMT 1200 Introduction to Quality MGMT 2000 Project Management MGMT 2040 Strategic Planning MGMT 2300 Managing for Quality MGMT 2506 Organizational Behavior ACCT 1003 Accounting for Managers ACCT 1010 Principles of Accounting I ACCT 1020 Principles of Accounting II, 52273=ENGL 1010 and 1020, and two of the following: ENGL 2110/2120/ 2130,etc. SPCH 1110*, 50754=Suggested electives: ACCT 1010 Principles of Accounting I BUS 215 Business Ethics BUS 251 Legal Environment for Business BUS 281 Management and Supervision Courses from the health information technology program will be counted as electives., 24863=Suggested electives: ACC 1010 Principles of Accounting I CIT 165 Spreadsheet Applications Courses from the health information technology program will be counted as electives., 84286=Suggested electives: ACCT 1010 Principles of Accounting I ACCT 1020 Principles of Accounting II BUSN 1010 Introduction to Business BUSN 2510 Legal Environment of Business CPSC 1240 Microsoft Excel CPSC 1280 Database Applications MGMT 1110 Electronic Spreadsheet and Database Applications Courses taken in health information technology will also count as electives., 74433=Classics 273 will not fulfill this requirement. Course may be taken in TN Regents Online Degree Program (RODP) HIT 1010 or at a community college;, 84144=CPSC 2770/2771}",
    "textBeforeTable": "Equivalent courses at Volunteer State Community College Volunteer State Community College ** 12 hours of prerequisite courses must be at the upper division level. 09/13 *Speech will count as one term of literature. Strong English written and oral communication skills are required.   92** Total Suggested electives include accounting, business law, organizational behavior and theory, management information systems, business communications. 45 Electives CSCI 410 3 Database Management CSCI 351 3 Systems Analysis and Design CSCI 201 3 Information Systems If not offered, course may be taken in TN Regents Degree Online (RODP) HIT 1010 or at a community college 3 Medical Terminology MGT 350 3 Personnel Administration/ Human Resources MGT 301 3 Principles of Management MATH 210 or 210H 3 Statistics Sociology, Economics, History, Psychology 6 Social Sciences ZOOL 251 & 352 8 Human Anatomy & Physiology ENGL 111, 112, 250, etc COMM 230* 12 English(Comp I & II, speech, & lit) Equivalent Courses Hours Course Requirements Equivalent courses at University of Tennessee - Martin",
    "textAfterTable": "*Speech will count as one term of literature. Strong English written, and oral communication skills are required. ** 12 hours of prerequisite courses must be at the upper division level and cannot be taken at Volunteer State Community College.. 09/13 Walters State Community College Equivalent courses at Walters State Community College Course Requirements Hours Equivalent Courses English(Comp I & II, speech, & lit) 12 ENGL 1010, 1020, 2110, etc. SPCH 1010* Human Anatomy & Physiology 8 BIOL 2010/2011 lab BIOL 2020/2021 lab Social Sciences 6 Sociology, Economics, History, Psychology Statistics 3 MATH 1530 Principles of Management 3 MGT 2210 Personnel Administration/ Human Resources 3 MGMT 2570 Medical Terminology 3 MDTR 1010 Information Systems 3 MGMT 1100 Systems Analysis and Design 3 Not offered; must be taken at another college or university Database Management 3 CPSC 2770/2771 Electives 45 Suggested electives: ACCT 1010 Principles of Accounting I ACCT 1020 Principles of Accounting II BUSN 1010 Introduction to Business BUSN 2510 Legal Environment of Business CPSC 1240 Microsoft Excel",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}