{
    "relation": [
        [
            "type",
            "FR Doc.",
            "RIN",
            "Release No.",
            "File No."
        ],
        [
            "regulations.gov",
            "2014-15337",
            "3235-AL25",
            "34-72472",
            "S7-02-13"
        ]
    ],
    "pageTitle": "17 CFR 240.13d-102 - Schedule 13G—Information to be included in statements filed pursuant to § 240.13d-1(b), (c), and (d) and amendments thereto filed pursuant to § 240.13d-2. | US Law | LII / Legal Information Institute",
    "title": "",
    "url": "https://www.law.cornell.edu/cfr/text/17/240.13d-102",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988650.6/warc/CC-MAIN-20150728002308-00060-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 911238431,
    "recordOffset": 911193808,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{330749=The Securities and Exchange Commission (“Commission”) is proposing to amend Rule 15b9-1 (“Rule”) under the Securities Exchange Act of 1934 (“Act” or “Exchange Act”), which exempts certain brokers or dealers from membership in a registered national securities association (“Association”). The proposed amendments would replace the current gross income allowance in the Rule with a narrower exemption from Association membership for a broker or dealer that carries no customer accounts and effects transactions on a national securities exchange. The proposed amendments would create an exemption for a dealer that effects transactions off the exchange of which it is a member solely for the purpose of hedging the risks of its floor-based activity, or a broker or dealer that effects transactions off the exchange resulting from orders that are routed by a national securities exchange of which it is a member, to prevent trade-throughs consistent with the provisions of Rule 611 of Regulation NMS., 181898=We are adopting amendments to the expiration dates in our interim final rules that provide exemptions under the Securities Act of 1933, the Securities Exchange Act of 1934, and the Trust Indenture Act of 1939 for those security-based swaps that prior to July 16, 2011 were security-based swap agreements and are defined as “securities” under the Securities Act and the Exchange Act as of July 16, 2011 due solely to the provisions of Title VII of the Dodd-Frank Wall Street Reform and Consumer Protection Act. Under the amendments, the expiration dates in the interim final rules will be extended to February 11, 2014., 186818=The Securities and Exchange Commission (“Commission”) is adopting amendments to Rule 17Ad-17 to implement the requirements of Section 929W of the Dodd-Frank Wall Street Reform and Consumer Protection Act (“Dodd-Frank Act”). That Section added to Section 17A of the Securities Exchange Act of 1934 (“Exchange Act”) subsection (g), “Due Diligence for the Delivery of Dividends, Interest, and Other Valuable Property Rights,” which directs the Commission to revise Exchange Act Rule 17Ad-17, “Transfer Agents' Obligation to Search for Lost Securityholders” to: extend the requirements of Rule 17Ad-17 to search for lost securityholders from only recordkeeping transfer agents to brokers and dealers as well; add a requirement that “paying agents” notify “unresponsive payees” that a paying agent has sent a securityholder a check that has not yet been negotiated; and add certain other provisions. The Commission also is adopting a proposed conforming amendment to Rule 17Ad-7(i) and new Rule 15b1-6, a technical rule to help ensure that brokers and dealers have notice of their new obligations with respect to lost securityholders and unresponsive payees., 207017=The Securities and Exchange Commission (“SEC” or “Commission”) is adopting a new rule in accordance with the Securities Exchange Act of 1934 (“Exchange Act”), and the Dodd-Frank Wall Street Reform and Consumer Protection Act of 2010 (“Dodd-Frank Act”). The new rule establishes minimum requirements regarding how registered clearing agencies must maintain effective risk management procedures and controls as well as meet the statutory requirements under the Exchange Act on an ongoing basis., 141084=The Securities and Exchange Commission (the “Commission”) is adopting amendments that remove references to credit ratings in certain rules and one form under the Securities Exchange Act of 1934 (the “Exchange Act”) relating to broker-dealer financial responsibility and confirmations of securities transactions. This action implements a provision of the Dodd-Frank Wall Street Reform and Consumer Protection Act (the “Dodd-Frank Act”)., 79028=Pursuant to Section 763(i) of Title VII (“Title VII”) of the Dodd-Frank Wall Street Reform and Consumer Protection Act of 2010 (“Dodd-Frank Act”), the Securities and Exchange Commission (“Commission”) is adopting new rules under the Securities Exchange Act of 1934 (“Exchange Act”) governing the security-based swap data repository (“SDR”) registration process, duties, and core principles. The Commission is also adopting a new registration form. Additionally, the Commission is amending several of its existing rules and regulations in order to accommodate SDRs. First, the Commission is amending Regulation S-T and Exchange Act Rule 24b-2 to clarify that all filings by SDRs, including any confidential portion, and their requests for confidential treatment must be filed electronically. Second, the Commission is amending Regulation S-T by, among other things, adding a new rule that specifically applies to the electronic filing of SDRs' financial reports., 211981=The Securities and Exchange Commission (“Commission”) is amending interim final temporary Rule 15Ba2-6T, which provides for the temporary registration of municipal advisors under the Securities Exchange Act of 1934 (“Exchange Act”), as amended by the Dodd-Frank Wall Street Reform and Consumer Protection Act (“Dodd-Frank Act”), to extend the date on which Rule 15Ba2-6T (and consequently Form MA-T) will sunset from September 30, 2012, to September 30, 2013. Under the amendment, all temporary registrations submitted pursuant to Rule 15Ba2-6T also will expire no later than September 30, 2013., 176078=The Securities and Exchange Commission (“SEC” or “Commission”) is affirming recent amendments to Rule 19b-4 under the Securities Exchange Act of 1934 (“Exchange Act”) in connection with filings of proposed rule changes by certain registered clearing agencies and is expanding on those amendments in response to comments received (collectively, “Final Rule”). The Commission also is making corresponding technical modifications to the General Instructions for Form 19b-4 under the Exchange Act. The amendments to Rule 19b-4 and the instructions to Form 19b-4 are intended to streamline the rule filing process in areas involving certain activities concerning non-security products that may be subject to duplicative or inconsistent regulation as a result of, in part, certain provisions under Section 763(b) of the Dodd-Frank Wall Street Reform and Consumer Protection Act of 2010 (“Dodd-Frank Act”)., 265908=We are adopting a new rule and amendments to our proxy disclosure rules to implement Section 952 of the Dodd-Frank Wall Street Reform and Consumer Protection Act of 2010, which added Section 10C to the Securities Exchange Act of 1934. Section 10C requires the Commission to adopt rules directing the national securities exchanges and national securities associations to prohibit the listing of any equity security of an issuer that is not in compliance with Section 10C's compensation committee and compensation adviser requirements. In accordance with the statute, new Rule 10C-1 directs the national securities exchanges to establish listing standards that, among other things, require each member of a listed issuer's compensation committee to be a member of the board of directors and to be “independent,” as defined in the listing standards of the national securities exchanges adopted in accordance with the final rule. In addition, pursuant to Section 10C(c)(2), we are adopting amendments to our proxy disclosure rules concerning issuers' use of compensation consultants and related conflicts of interest., 69013=This document corrects an instruction for the authority to part 200 in a final rule published in the Federal Register of April 20, 2015 regarding the Amendments for Small and Additional Issues Exemptions under the Securities Act (Regulation A)., 272179=In accordance with the Dodd-Frank Wall Street Reform and Consumer Protection Act of 2010 (“Dodd-Frank Act”), the Commodity Futures Trading Commission (“CFTC”) and the Securities and Exchange Commission (“SEC”) (collectively, the “Commissions”), in consultation with the Board of Governors of the Federal Reserve System (“Board”), are adopting new rules and interpretive guidance under the Commodity Exchange Act (“CEA”), and the Securities Exchange Act of 1934 (“Exchange Act”), to further define the terms “swap dealer,” “security-based swap dealer,” “major swap participant,” “major security-based swap participant,” and “eligible contract participant.”, 314208=The Securities and Exchange Commission (“SEC” or “Commission”) is publishing for comment proposed amendments and a re-proposed rule to address the application of certain provisions of the Securities Exchange Act of 1934 (“Exchange Act”) that were added by Subtitle B of Title VII of the Dodd-Frank Wall Street Reform and Consumer Protection Act (“Dodd-Frank Act”) to cross-border security-based swap activities. The Commission is proposing amendments to Exchange Act rules 3a71-3 and 3a71-5 that would address the application of the de minimis exception to security-based swap transactions connected with a non-U.S. person's security-based swap dealing activity that are arranged, negotiated, or executed by personnel of such person located in a U.S. branch or office, or by personnel of such person's agent, located in a U.S. branch or office. The Commission is also re-proposing Exchange Act rule 3a71-3(c) and proposing certain amendments to Exchange Act rule 3a71-3(a) to address the applicability of external business conduct requirements to the U.S. business and foreign business of registered security-based swap dealers. The Commission also is proposing amendments to Regulation SBSR to apply the regulatory reporting and public dissemination requirements to transactions that are arranged, negotiated, or executed by personnel of non-U.S. persons, or personnel of such non-U.S. persons' agents, that are located in the United States and to transactions effected by or through a registered broker-dealer (including a registered security-based swap execution facility), along with certain related issues, including requiring registered broker-dealers (including registered security-based swap execution facilities) to report certain transactions that are effected by or through the registered broker-dealer., 292077=§ 1350 - Failure of corporate officers to certify financial reports, 283056=We are making a technical amendment to Regulation D and conforming changes to certain other rules. Regulation D was last amended in Release No. 33-9287 (December 21, 2011), which was published in the Federal Register on December 29, 2011. Those amendments became effective on February 27, 2012. Due to a typographical error in that release, the Preliminary Notes to Regulation D were inadvertently deleted from Regulation D. We are restoring the deleted text as new Rule 500. The deleted text is not being restored as Preliminary Notes in order to comply with current Federal Register codification standards., 135846=The Securities and Exchange Commission (“Commission”) is staying temporarily Rules 15Ba1-1 through 15Ba1-8 and Rule 15Bc4-1 (“Rules”) under the Securities Exchange Act of 1934 and Forms MA, MA-I, MA-W, and MA-NR (“Forms”) until July 1, 2014 and making conforming, non-substantive amendments to Rule 15Ba1-8 regarding recordkeeping requirements to conform the dates referenced in certain provisions of that rule to the July 1, 2014 date (the “Amendment”). The effective date for the Rules and Forms was January 13, 2014. This stay of the Rules and Forms means that persons are not required to comply with the Rules and Forms until July 1, 2014. The Amendment is the only action the Commission is taking in this release with respect to the Rules and Forms. Therefore, the phased-in compliance period that begins on July 1, 2014, for the requirement to use the Forms to register as municipal advisors under the Rules remains unchanged., 125402=The Securities and Exchange Commission published a document in the Federal Register of January 8, 2014 that contained an incorrect instruction. This correction is being published to correct instruction 5.b in that document., 156508=The Securities and Exchange Commission (“Commission”) is adopting amendments to the net capital, customer protection, books and records, and notification rules for broker-dealers promulgated under the Securities Exchange Act of 1934 (“Exchange Act”). These amendments are designed to address several areas of concern regarding the financial responsibility requirements for broker-dealers. The amendments also update certain financial responsibility requirements and make certain technical amendments., 166312=The Securities and Exchange Commission (the “Commission”) is rescinding rules under the Securities Exchange Act of 1934 (the “Exchange Act”) that established the Commission's program for supervising investment bank holding companies. The Commission is taking this action pursuant to the Dodd-Frank Wall Street Reform and Consumer Protection Act (the “Dodd-Frank Act”), which eliminated the applicable section effective July 21, 2011. The Commission also is rescinding certain exemptive provisions in its broker-dealer risk assessment rules and delegation of authority rules that pertain to the supervised investment bank holding company program rules that are being rescinded., 286603=15 U.S. Code § 32, 33 - Repealed. Pub. L. 91–452 , title II , §§ 209, 210 , Oct. 15, 1970, 84 Stat. 929, 239437=On July 13, 2012, the Securities and Exchange Commission (“Commission”) published a document in the Federal Register (77 FR 41602), concerning, among other things, the process for submissions for review of security-based swaps for mandatory clearing and notice filing requirements for clearing agencies. The document contained typographical errors in the preamble and in the general authority for Part 240. The Commission is publishing corrections to the preamble and the general authority as well as a clarification concerning the Office of Management and Budget (“OMB”) control number for Rule 3Ca-1 under the Securities Exchange Act of 1934 (“Exchange Act”)., 130548=We are adopting amendments to the expiration dates in our interim final rules that provide exemptions under the Securities Act of 1933, the Securities Exchange Act of 1934, and the Trust Indenture Act of 1939 for those security-based swaps that prior to July 16, 2011 were security-based swap agreements and are defined as “securities” under the Securities Act and the Exchange Act as of July 16, 2011 due solely to the provisions of Title VII of the Dodd-Frank Wall Street Reform and Consumer Protection Act. Under the amendments, the expiration dates in the interim final rules will be extended to February 11, 2017. If we adopt further rules relating to issues raised by the application of the Securities Act or the other federal securities laws to security-based swaps before February 11, 2017, we may determine to alter the expiration dates in the interim final rules as part of that rulemaking., 89324=The Securities and Exchange Commission (“Commission”) is correcting a final rule that appeared in the Federal Register of September 15, 2014 (79 FR 55078). The rule applies to credit rating agencies registered with the Commission as nationally recognized statistical rating organizations (“NRSROs”), providers of third-party due diligence services for asset-backed securities, and issuers and underwriters of asset-backed securities. 1 1 See Nationally Recognized Statistical Rating Organizations, Exchange Act Release No. 72936 (Aug. 27, 2014), 79 FR 55078 (Sep. 15, 2014)., 249668=In accordance with Section 763(a) of the Dodd-Frank Wall Street Reform and Consumer Protection Act of 2010 (“Dodd-Frank Act”), the Securities and Exchange Commission (“Commission”) is adopting rules under the Securities Exchange Act of 1934 (“Exchange Act”) to specify the process for a registered clearing agency's submission for review of any security-based swap, or any group, category, type or class of security-based swaps, that the clearing agency plans to accept for clearing, the manner of notice the clearing agency must provide to its members of such submission and the procedure by which the Commission may stay the requirement that a security-based swap is subject to mandatory clearing while the clearing of the security-based swap is reviewed. The Commission also is adopting a rule to specify that when a security-based swap is required to be cleared, the submission of the security-based swap for clearing must be for central clearing to a clearing agency that functions as a central counterparty. In addition, the Commission is adopting rules to define and describe when notices of proposed changes to rules, procedures or operations are required to be filed by designated financial market utilities in accordance with Section 806(e) of Title VIII of the Dodd-Frank Act and to set forth the process for filing such notices with the Commission. Finally, the Commission is adopting rules to make conforming changes as required by the amendments to Section 19(b) of the Exchange Act contained in Section 916 of the Dodd-Frank Act., 197393=The Commission is amending its regulations under the Securities Exchange Act of 1934 (“Exchange Act”) to extend the dates for certain requirements therein and amending the General Instructions to Form 19b-4 to clarify the process for submitting advance notices and security-based swap submissions to the Commission. The Commission is extending the dates with respect to the requirements that designated clearing agencies for which the Commission is the supervisory agency file advance notices and clearing agencies file security-based swap submissions with the Commission in an electronic format to dedicated email addresses to December 10, 2013 in order to prevent the scenario that such filings are required to be filed with the Commission through a system that is not yet technologically able to accept them., 161028=The Securities and Exchange Commission (“Commission”), under the Securities Exchange Act of 1934 (“Exchange Act”), is amending certain broker-dealer annual reporting, audit, and notification requirements. The amendments include a requirement that broker-dealer audits be conducted in accordance with standards of the Public Company Accounting Oversight Board (“PCAOB”) in light of explicit oversight authority provided to the PCAOB by the Dodd-Frank Wall Street Reform and Consumer Protection Act (“Dodd-Frank Act”) to oversee these audits. The amendments further require a broker-dealer that clears transactions or carries customer accounts to agree to allow representatives of the Commission or the broker-dealer's designated examining authority (“DEA”) to review the documentation associated with certain reports of the broker-dealer's independent public accountant and to allow the accountant to discuss the findings relating to the reports of the accountant with those representatives when requested in connection with a regulatory examination of the broker-dealer. Finally, the amendments require a broker-dealer to file a new form with its DEA that elicits information about the broker-dealer's practices with respect to the custody of securities and funds of customers and non-customers., 202476=This release makes a technical correction to Release No. 34-67717 (August 22, 2012), which adopted disclosure rules for resource extraction issuers and was published in the Federal Register on September 12, 2012 (77 FR 56365). We are correcting the release to include the text of a footnote that was omitted when published., 74135=We are adopting amendments to Regulation A and other rules and forms to implement Section 401 of the Jumpstart Our Business Startups (JOBS) Act. Section 401 of the JOBS Act added Section 3(b)(2) to the Securities Act of 1933, which directs the Commission to adopt rules exempting from the registration requirements of the Securities Act offerings of up to $50 million of securities annually. The final rules include issuer eligibility requirements, content and filing requirements for offering statements, and ongoing reporting requirements for issuers in Regulation A offerings., 255674=The Commodity Futures Trading Commission and Securities and Exchange Commission are correcting final rules that appeared in the Federal Register of May 23, 2012 (77 FR 30596). The rules further defined the terms “swap dealer,” “security-based swap dealer,” “major swap participant,” “major security-based swap participant” and “eligible contract participant.” Only the rules of the Commodity Futures Trading Commission are subject to this correction. This document also corrects a footnote in the Supplementary Information accompanying the final rules., 244509=The Securities and Exchange Commission (“Commission”) is amending interim final temporary Rule 15b12-1T under the Securities Exchange Act of 1934 (“Exchange Act”) to extend the date on which the rule will expire from July 16, 2012 to July 16, 2013., 99513=We are adopting significant revisions to Regulation AB and other rules governing the offering process, disclosure, and reporting for asset-backed securities (“ABS”). The final rules require that, with some exceptions, prospectuses for public offerings under the Securities Act of 1933 (“Securities Act”) and ongoing reports under the Securities Exchange Act of 1934 (“Exchange Act”) of asset-backed securities backed by real estate related assets, auto related assets, or backed by debt securities, including resecuritizations, contain specified asset-level information about each of the assets in the pool. The asset-level information is required to be provided according to specified standards and in a tagged data format using eXtensible Markup Language (“XML”). We also are adopting rules to revise filing deadlines for ABS offerings to provide investors with more time to consider transaction-specific information, including information about the pool assets. We are also adopting new registration forms tailored to ABS offerings. The final rules also repeal the credit ratings references in shelf eligibility criteria for ABS issuers and establish new shelf eligibility criteria., 63878=This document corrects the designation of a paragraph in Item 6 of Part I to Form 1-A in a final rule published in the Federal Register of April 20, 2015, regarding the Amendments for Small and Additional Issues Exemptions under the Securities Act (Regulation A)., 192292=On December 10, 2012, the Securities and Exchange Commission (“Commission”) published a document in the Federal Register to amend its regulations under the Securities Exchange Act of 1934 (“Exchange Act”) to extend the dates with respect to the requirements that designated clearing agencies for which the Commission is the supervisory agency file advance notices and clearing agencies file security-based swap submissions with the Commission in an electronic format to dedicated email addresses to December 10, 2013, and amend the General Instructions to Form 19b-4 to clarify the process for submitting advance notices and security-based swap submissions to the Commission. The document contained an error with respect to the placement and numbering of a footnote., 277660=We are adopting exemptions under the Securities Act of 1933, the Securities Exchange Act of 1934, and the Trust Indenture Act of 1939 for security-based swaps issued by certain clearing agencies satisfying certain conditions. The final rules exempt transactions by clearing agencies in these security-based swaps from all provisions of the Securities Act, other than the Section 17(a) anti-fraud provisions, as well as exempt these security-based swaps from Exchange Act registration requirements and from the provisions of the Trust Indenture Act, provided certain conditions are met., 216944=We are adopting a new form and rule pursuant to Section 1502 of the Dodd-Frank Wall Street Reform and Consumer Protection Act relating to the use of conflict minerals. Section 1502 added Section 13(p) to the Securities Exchange Act of 1934, which requires the Commission to promulgate rules requiring issuers with conflict minerals that are necessary to the functionality or production of a product manufactured by such person to disclose annually whether any of those minerals originated in the Democratic Republic of the Congo or an adjoining country. If an issuer's conflict minerals originated in those countries, Section 13(p) requires the issuer to submit a report to the Commission that includes a description of the measures it took to exercise due diligence on the conflict minerals' source and chain of custody. The measures taken to exercise due diligence must include an independent private sector audit of the report that is conducted in accordance with standards established by the Comptroller General of the United States. Section 13(p) also requires the issuer submitting the report to identify the auditor and to certify the audit. In addition, Section 13(p) requires the report to include a description of the products manufactured or contracted to be manufactured that are not “DRC conflict free,” the facilities used to process the conflict minerals, the country of origin of the conflict minerals, and the efforts to determine the mine or location of origin. Section 13(p) requires the information disclosed by the issuer to be available to the public on its Internet Web site., 228655=On July 16, 2012, the Securities and Exchange Commission (“Commission”) published an interim final temporary Rule 15b12-1T to extend the date on which the rule will expire. That rule omitted a comment date and an addresses section in its preamble. This correction adds the comment date and address information in the following captions., 171247=The Commission is adopting a rule to permit a registered broker-dealer to engage in a retail forex business, provided that the broker-dealer complies with the Securities Exchange Act of 1934, the rules and regulations thereunder, and the rules of the self-regulatory organization(s) of which the broker-dealer is a member insofar as they are applicable to retail forex transactions. The Commission is adopting Rule 15b12-1 substantially in the form previously adopted as an interim final temporary rule and is providing that the rule will expire on July 31, 2016., 115001=The Securities and Exchange Commission (“SEC” or “Commission”) is adopting rules and providing guidance to address the application of certain provisions of the Securities Exchange Act of 1934 (“Exchange Act”) that were added by Subtitle B of Title VII of the Dodd-Frank Wall Street Reform and Consumer Protection Act (“Dodd-Frank Act”), to cross-border security-based swap activities. These rules and guidance in large part focus on the application of the Title VII definitions of “security-based swap dealer” and “major security-based swap participant” in the cross-border context. The Commission also is adopting a procedural rule related to the submission of applications for substituted compliance. In addition, the Commission is adopting a rule addressing the scope of our authority, with respect to enforcement proceedings, under section 929P of the Dodd-Frank Act., 320267=We are proposing amendments to Item 402 of Regulation S-K to implement Section 14(i) of the Securities Exchange Act of 1934 (the “Exchange Act”), as added by Section 953(a) of the Dodd-Frank Wall Street Reform and Consumer Protection Act (the “Dodd-Frank Act”). Section 14(i) directs the Commission to adopt rules requiring registrants to disclose in a clear manner the relationship between executive compensation actually paid and the financial performance of the registrant. The proposed disclosure would be required in proxy or information statements in which executive compensation disclosure pursuant to Item 402 of Regulation S-K is required. The proposed disclosure requirements would not apply to emerging growth companies or foreign private issuers., 233982=In accordance with section 712(a)(8), section 712(d)(1), sections 712(d)(2)(B) and (C), sections 721(b) and (c), and section 761(b) of the Dodd-Frank Wall Street Reform and Consumer Protection Act (“Dodd-Frank Act”), the Commodity Futures Trading Commission (“CFTC”) and the Securities and Exchange Commission (“SEC”) (collectively, “Commissions”), in consultation with the Board of Governors of the Federal Reserve System (“Board”), are jointly adopting new rules and interpretations under the Commodity Exchange Act (“CEA”) and the Securities Exchange Act of 1934 (“Exchange Act”) to further define the terms “swap,” “security-based swap,” and “security-based swap agreement” (collectively, “Product Definitions”); regarding “mixed swaps;” and governing books and records with respect to “security-based swap agreements.” The CFTC requests comment on its interpretation concerning forwards with embedded volumetric optionality, contained in Section II.B.2.(b)(ii) of this release., 84389=The Securities and Exchange Commission (“Commission”) is adopting new Regulation Systems Compliance and Integrity (“Regulation SCI”) under the Securities Exchange Act of 1934 (“Exchange Act”) and conforming amendments to Regulation ATS under the Exchange Act. Regulation SCI will apply to certain self-regulatory organizations (including registered clearing agencies), alternative trading systems (“ATSs”), plan processors, and exempt clearing agencies (collectively, “SCI entities”), and will require these SCI entities to comply with requirements with respect to the automated systems central to the performance of their regulated activities., 151675=The Securities and Exchange Commission (“Commission”) is amending interim final temporary Rule 15Ba2-6T, which provides for the temporary registration of municipal advisors under the Securities Exchange Act of 1934 (“Exchange Act”), as amended by the Dodd-Frank Wall Street Reform and Consumer Protection Act (“Dodd-Frank Act”), to extend the date on which Rule 15Ba2-6T (and consequently Form MA-T) will sunset from September 30, 2013, to December 31, 2014. Under the amendment, all temporary registrations submitted pursuant to Rule 15Ba2-6T also will expire no later than December 31, 2014., 223029=We are adopting new rules and an amendment to a new form pursuant to Section 1504 of the Dodd-Frank Wall Street Reform and Consumer Protection Act relating to disclosure of payments by resource extraction issuers. Section 1504 added Section 13(q) to the Securities Exchange Act of 1934, which requires the Commission to issue rules requiring resource extraction issuers to include in an annual report information relating to any payment made by the issuer, a subsidiary of the issuer, or an entity under the control of the issuer, to a foreign government or the Federal Government for the purpose of the commercial development of oil, natural gas, or minerals. Section 13(q) requires a resource extraction issuer to provide information about the type and total amount of such payments made for each project related to the commercial development of oil, natural gas, or minerals, and the type and total amount of payments made to each government. In addition, Section 13(q) requires a resource extraction issuer to provide information regarding those payments in an interactive data format., 292469=124 Stat. 1376, 292877=Title 17 published on 2015-04-01, 145999=Section 975 of Title IX of the Dodd-Frank Wall Street Reform and Consumer Protection Act (“Dodd-Frank Act”) amended Section 15B of the Securities Exchange Act of 1934 (“Exchange Act”) to require municipal advisors, as defined below, to register with the Securities and Exchange Commission (“Commission” or “SEC”), effective October 1, 2010. To enable municipal advisors to temporarily satisfy this requirement, the Commission adopted an interim final temporary rule, Exchange Act Rule 15Ba2-6T, and form, Form MA-T, effective October 1, 2010. To enable municipal advisors to continue to register under the temporary registration regime until the applicable compliance date for permanent registration, the Commission is extending Rule 15Ba2-6T, in a separate release, to December 31, 2014. The Commission is today adopting new Rules 15Ba1-1 through 15Ba1-8, new Rule 15Bc4-1, and new Forms MA, MA-I, MA-W, and MA-NR under the Exchange Act. These rules and forms are designed to give effect to provisions of Title IX of the Dodd-Frank Act that, among other things, require the Commission to establish a registration regime for municipal advisors and impose certain record-keeping requirements on such advisors.}",
    "lastModified": "Mon, 06 Jul 2015 18:34:50 GMT",
    "textBeforeTable": "Additional Documents GPO FDSys XML | Text 80 FR 35207 - Amendments for Small and Additional Issues Exemptions Under the Securities Act (Regulation A) 2015-06-19; vol. 80 # 118 - Friday, June 19, 2015 For a complete list of all Rules, Proposed Rules, and Notices view the Rulemaking tab. The following are only the Rules published in the Federal Register after the published date of Title 17. Title 17 published on . 75 FR 56780, Sept. 16, 2010] 73 FR 60089, Oct. 9, 2008; 73 FR 17813, Apr. 1, 2008; 72 FR 45112, Aug. 10, 2007; 63 FR 15287, Mar. 31, 1998; 63 FR 2867, Jan. 16, 1998; 62 FR 35340, July 1, 1997; 61 FR 49959, Sept. 24, 1996; [43 FR 18499, Apr. 28, 1978, as amended at 43 FR 55756, Nov. 29,",
    "textAfterTable": "34-74578B 39-2501B SECURITIES AND EXCHANGE COMMISSION Final rule; correction. This correction is effective June 19, 2015. 17 CFR Parts 200, 230, 232, 239, 240, 249 and 260 Summary This document corrects the designation of a paragraph in Item 6 of Part I to Form 1-A in a final rule published in the Federal Register of April 20, 2015, regarding the Amendments for Small and Additional Issues Exemptions under the Securities Act (Regulation A). 2015-06-04; vol. 80 # 107 - Thursday, June 4, 2015 80 FR 31836 - Amendments for Small and Additional Issues Exemptions Under the Securities Act (Regulation A) GPO FDSys XML | Text Additional Documents type regulations.gov FR Doc. 2015-13627 RIN",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}