{
    "relation": [
        [
            "Days",
            "30",
            "50",
            "150",
            "200"
        ],
        [
            "BSE",
            "320.64",
            "322.75",
            "343.93",
            "340.79"
        ],
        [
            "NSE",
            "321.58",
            "323.36",
            "344.11",
            "341.04"
        ]
    ],
    "pageTitle": "Religare Enterprises Stock Price, Share Price, Live BSE/NSE, Religare Enterprises Bids Offers. Buy/Sell Religare Enterprises news & tips, & F&O Quotes",
    "title": "",
    "url": "http://www.moneycontrol.com/india/stockpricequote/finance-investments/religareenterprises/RE09",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042985140.15/warc/CC-MAIN-20150728002305-00158-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 607013735,
    "recordOffset": 606967119,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{133027=UnitedBrewerie Jul Fut, 133734=JSWSteel Jul Fut, 206392=Religare Enterp is in the Finance - Investments sector. The current market capitalisation stands at Rs 5,523.77 crore. The company management includes Sunil Godhwani - Chairman & Managing Director, Harpal Singh - Director, Ravi Mehrotra - Director, Virendra Kumar Madan - Director, Monish K Dutt - Nominee Director, Arun Ramanathan - Independent Director, A C Mahajan - Independent Director, Padam Bahl - Independent Director, R K Shetty - Independent Director, Deepak Ramchand Sabnani - Independent Director, Sangeeta Talwar - Independent Director. It is listed on the BSE with a BSE Code of 532915 and the NSE with an NSE Code of RELIGARE. Its Registered office is at D3, P3B, District Centre, Saket, New Delhi,Delhi - 110017. Their Registrars are Karvy Computershare Private Ltd., 132516=28 July 2015, 205081=Astec LifeSciences Recommended on Mar 31st 2015}",
    "textBeforeTable": "Edit Watchlist Have you invested in these stocks? You can track them better in your Portfolio close[x] Add to Watchist Account Optional Optional Optional Optional Add to Portfolio OR Add to watchlist } $('#mcpcp_addprof_info').hide(); { function close_info()",
    "textAfterTable": "Keep me signed in Forgot Password? New to Moneycontrol - Sign up now Its easy and FREE! Username Username should be atleast 4 characters Password Password should be 6 to 10 characters Confirm Password Email OR connect with LIVE",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}