{
    "relation": [
        [
            "Religion",
            "Evangelical Protestant",
            "Mainline Protestant",
            "Catholic",
            "Black Protestant",
            "Other",
            "None"
        ],
        [
            "Adherents",
            "16,830",
            "3,176",
            "800",
            "555",
            "238",
            "16,736"
        ],
        [
            "Congregations",
            "78",
            "16",
            "1",
            "7",
            "2",
            "-"
        ]
    ],
    "pageTitle": "Newbern, Tennessee (TN 38059) profile: population, maps, real estate, averages, homes, statistics, relocation, travel, jobs, hospitals, schools, crime, moving, houses, news, sex offenders",
    "title": "",
    "url": "http://www.city-data.com/city/Newbern-Tennessee.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042985140.15/warc/CC-MAIN-20150728002305-00036-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 366036603,
    "recordOffset": 365909899,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{6790=According to our research of Tennessee and other state lists there were 12 registered sex offenders living in Newbern, Tennessee as of July 28, 2015. The ratio of number of residents in Newbern to the number of sex offenders is 277 to 1., 25570=Incorporated in 1858}",
    "TableContextTimeStampAfterTable": "{45525=2000 Presidential Elections Results, 32312=Air Quality Index (AQI) level in 2012 was 40.2. This is significantly better than average., 56143=5.29% of this county's 2011 resident taxpayers lived in other counties in 2010 ($30,962 average adjusted gross income), 57967=6.06% of this county's 2010 resident taxpayers moved to other counties in 2011 ($32,446 average adjusted gross income), 16826=On 3/1/1997, a category F4 tornado 4.9 miles away from the town center injured 15 people and caused $2 million in damages., 46667=Graphs represent county-level data. Detailed 2008 Election Results, 34471=Ozone [ppb] level in 2003 was 34.2. This is about average. Closest monitor was 0.5 miles away from the city center., 33725=Sulfur Dioxide (SO2) [ppb] level in 2003 was 1.35. This is significantly better than average. Closest monitor was 16.1 miles away from the city center., 16516=On 3/21/1952, a category F4 (max. wind speeds 207-260 mph) tornado 1.1 miles away from the Newbern town center killed 4 people and injured 5 people and caused between $50,000 and $500,000 in damages., 35170=Particulate Matter (PM2.5) [µg/m3] level in 2012 was 8.83. This is about average. Closest monitor was 7.8 miles away from the city center., 83499=Recent home sales, price trends, and home value evaluator powered by Onboard Informatics © 2015 Onboard Informatics. Information is deemed reliable but not guaranteed.   City-data.com does not guarantee the accuracy or timeliness of any information on this site.  Use at your own risk. Website © 2015 Advameg, Inc., 45811=2004 Presidential Elections Results, 46097=2008 Presidential Elections Results, 32978=Nitrogen Dioxide (NO2) [ppb] level in 2003 was 3.30. This is significantly better than average. Closest monitor was 16.1 miles away from the city center., 45239=1996 Presidential Elections Results, 42471=School Enrollment by Level of School (%) in 2013, 63242=Fatal road traffic accident statistics for 1975 - 2013 (per 100,000 population), 46383=2012 Presidential Elections Results, 42073=Educational Attainment (%) in 2013}",
    "textBeforeTable": "Religion statistics for Newbern town (based on Dyer County data) Graphs represent county-level data. Detailed 2008 Election Results 2012 Presidential Elections Results 2008 Presidential Elections Results 2004 Presidential Elections Results 2000 Presidential Elections Results 1996 Presidential Elections Results 2012 2008 2004 2000 1996 Presidential Elections Results Utility gas (46%) Electricity (54%) Most commonly used house heating fuel:",
    "textAfterTable": "Source: Clifford Grammich, Kirk Hadaway, Richard Houseal, Dale E.Jones, Alexei Krindatch, Richie Stanley and Richard H.Taylor. 2012. 2010 U.S.Religion Census: Religious Congregations & Membership Study. Association of Statisticians of American Religious Bodies. Jones, Dale E., et al. 2002. Congregations and Membership in the United States 2000. Nashville, TN: Glenmary Research Center. Graphs represent county-level data Food Environment Statistics: Number of grocery stores: 9 Dyer County: 2.39 / 10,000 pop. Tennessee: 1.99 / 10,000 pop. Number of supercenters and club stores: 1 This county: 0.27 / 10,000 pop. State: 0.17 / 10,000 pop. Number of convenience stores (no gas): 1 Dyer County: 0.27 / 10,000 pop. Tennessee: 0.65 / 10,000 pop. Number of convenience stores (with gas): 25 Dyer County: 6.64 / 10,000 pop. State: 5.16 / 10,000 pop. Number of full-service restaurants: 23 Here: 6.11 / 10,000 pop. State: 6.56 / 10,000 pop. Adult diabetes rate: This county:",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}