{
    "relation": [
        [
            "Citing Patent",
            "US7013305 *",
            "US7516291",
            "US8065422 *",
            "US8321638",
            "US8341368",
            "US8838910",
            "US20050004887 *"
        ],
        [
            "Filing date",
            "1 Oct 2001",
            "21 Nov 2005",
            "26 Nov 2008",
            "6 Mar 2009",
            "7 Jun 2010",
            "7 Jun 2010",
            "1 Jul 2004"
        ],
        [
            "Publication date",
            "14 Mar 2006",
            "7 Apr 2009",
            "22 Nov 2011",
            "27 Nov 2012",
            "25 Dec 2012",
            "16 Sep 2014",
            "6 Jan 2005"
        ],
        [
            "Applicant",
            "International Business Machines Corporation",
            "Red Hat, Inc.",
            "Netapp, Inc.",
            "Red Hat, Inc.",
            "International Business Machines Corporation",
            "International Business Machines Corporation",
            "Nec Corporation"
        ],
        [
            "Title",
            "Managing the state of coupling facility structures, detecting by one or more systems coupled to the coupling facility, the suspended state of the duplexed command, detecting being independent of message exchange",
            "Cooperative mechanism for efficient application memory allocation",
            "Method and/or apparatus for certifying an in-band management application of an external storage array",
            "Cooperative mechanism for efficient application memory allocation",
            "Automatic reallocation of structured external storage structures",
            "Multi-part aggregated variable in structured external storage",
            "Policy processing system and method"
        ]
    ],
    "pageTitle": "Patent US6584554 - Directed allocation of coupling facility structures - Google Patents",
    "title": "",
    "url": "http://www.google.com.au/patents/US6584554",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042985140.15/warc/CC-MAIN-20150728002305-00150-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 475611759,
    "recordOffset": 475516113,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{320439=One embodiment of the logic associated with the attach copy processing phase is described with reference to FIG. 28. Initially, the local cache identifier vector for the old structure is obtained, STEP 2800. In one example, a Read Cache Structure Information (RCSI) command is used to retrieve the LCID vector., 494275=However, if the number of locks is greater than the threshold, then processing transitions into a lock cleanup phase, STEP 3918. In one embodiment, the lock cleanup phase of processing copies, for instance, the first 32 locks (numbered 0-31) from the old structure to the new structure. As an example, the Read Lock Table Range (RTLR) and Store LTEs commands are used to perform the copying. In particular, the lock range is set to 0:31 and the Copy Lock Range procedure is called., 63388=“Method, System And Program Products For Copying Coupling Facility Structures,” Dahlen et al., Ser. No. 09/379,054, filed Aug. 23, 1999;, 287672=In one example, a determination is made as to whether there has been a model-dependent timeout, INQUIRY 2471 (FIG. 24g). If so, then the ECR checkpoint is set, STEP 2472. Additionally, the.structure size, target structure size, MXSS, MRSS, MASS, maximum counts, target maximum counts, reapportionment in progress indicator(s) and structure size change in progress indicator are copied into the MRB, which is returned with an indicative response code, STEP 2473., 202883=Similarly, located within CPC 1800 b is hardware 1808 b, which includes, for instance, I/S channels 1810 b to connect coupling facility 1802 to CPC 1800 b via a bus 1812 b, and I/O channels(not shown) to couple CPC 1800 b via a link 1814 b to couple data set 1804 and function data set 1806., 284569=Returning to INQUIRIES 2456 and 2458, if the user structure control indicator is not equal to one or if any other allocation type request operand bit is active, then processing continues with initiate, continue, resume or terminate an expand/contract/reapportion (ECR) operation, STEP 2460., 274726=Subsequently, or if the request operand is to be an approximation, a determination is made as to whether a target counts priority indicator is equal to one, INQUIRY 2413 (FIG. 24c). If the target counts priority indicator is not equal to one, then a further determination is made as to whether there is sufficient storage to achieve the marginal structure size (MRSS), INQUIRY 2414. If there is insufficient storage, then an indicative response code is returned, STEP 2415. However, if there is sufficient storage, then processing continues as described herein., 67736=“System And Method For Management Of Object Transitions And An External Storage Facility Accessed By One Or More Processors,” Dahlen et al., U.S. Pat. No. 5,887,135, Issued Mar. 23, 1999., 63865=“Method, System And Program Products For Copying Coupling Facility Lock Structures,” Dahlen et al., Ser. No. 09/379,053, filed Aug. 23, 1999;, 233486=Returning to INQUIRY 2306, if a new system is not to be selected (e.g., since the predetermined number of times to select a new system has been exceeded), then the rebuild processing stops, since the structure cannot be allocated, STEP 2312., 433150=In one example, in order to process the returned entries, each entry is written to the tail of the list in the new structure using, for instance, a Write List Entry command. One example of a Write List Entry command is described in “Method And Apparatus For Coupling Data Processing Systems,” Elko et al., U.S. Pat. No. 5,317,739, Issued May 31, 1994, which is hereby incorporated herein by reference in its entirety., 213907=When XES intercepts the event, the event exit quiesces access to the structure, STEP 2204. Thus, any requests of the structure are queued until the structure is unquiesced. As one example, to quiesce access to the structure XES sets an indicator so that any future coupling facility operations to the structure from the system will not be started. Any requests that have already been received from the user by XES and which are queued awaiting processing, are moved to a delay queue from which they will not be started until the structure is subsequently unquiesced. Any new requests received from the user after this point are similarly placed on the delay queue from which they will not be started until the structure is subsequently unquiesced. The user who submitted the request either receives a response code indicating that the request will be processed, and request results returned, asychronously, or alternatively, the user's unit of work may be suspended for the duration of the system-managed rebuild quiesce, and then resumed after the request is driven to completion after the structure is unquiesced. Any currently active coupling facility requests that are actively executing against the structure are completed and the results are scheduled for return to the requester., 289055=Returning to INQUIRY 2461 (FIG. 24f), if the directed ECR indicator is not equal to one, then a further determination is made as to whether the ECR operation is to be stopped, INQUIRY 2479 (FIG. 24h). In particular, if the allocation type request operand is equal to zero, then stop processing is indicated. Thus, any currently active ECR operation is terminated, STEP 2480. Thereafter, processing continues with STEP 2476 (FIG. 24g)., 215581=Once the quiesce is complete, XES responds to the Rebuild Quiesce Event indicating completion, STEP 2206. CFRM waits for the responses from each XES confirming completion, STEP 2208. When all of the responses have been received, then the next phase of processing is initiated, STEP 2210., 294998=Returning to FIG. 19, subsequent to performing the allocate phase, CFRM transitions into the next phase, STEP 1908. In one example, the next phase is the attach phase., 66311=“Shared Access Serialization Featuring Second Process Lock Steal And Subsequent Write Access Denial To First Process” Insalaco et al, U.S. Pat. No. 5,305,448, Issued on Apr. 19, 1994;, 465401=In one embodiment, if the number of locks exceeds some threshold, e.g., 1024, then the segment of the locks (out of the total locks) that corresponds to the list header that has been claimed for processing (out of the total list headers) is copied. That is, the lock range that is copied for a given list number (LN) is given by the following formula:, 315151=An initial phase of the copy process is the entry phase, which is a multiple phase, STEP 2600. Thus, one or more systems participate in the entry phase. In particular, CFRM creates copy processor tasks on a subset of the systems, which then cooperate to copy the structure. All participating instances of the copy task are indicated as workers in the worker string of the structure copy controls., 233761=Returning to INQUIRY 2304, if the allocation process is successful, then a further determination is made as to whether there are active connectors to the new structure, INQUIRY 2314. If there are active connectors, then the next phase of processing is the attach phase, STEP 2316. However, if there are no active connectors, then the next phase of processing is the copy phase, STEP 2318., 317521=Returning to INQUIRY 2700, when the structure authority object matches the comparative structure authority operand, a further determination is made as to whether the structure copy control version number object is equal to the structure copy control version number operand, INQUIRY 2706. If these values are not equal, then the structure copy control version number object is placed in the structure copy control version number operand, STEP 2708, and the structure copy control version number operand and an indicative response code are returned, STEP 2704., 297456=The results of the attachment process are indicated in the system confirm string, which is provided to CFRM, STEP 2506., 298159=Returning to FIG. 19, after the attach phase is successfully completed, then the next phase of processing is the copy phase, STEP 1910., 204737=A beginning phase of system-managed rebuild is the initiation phase, STEP 1900. During this phase a determination is made as to the type of rebuild being requested. One embodiment of the logic associated with the initiation phase is described with reference to FIG. 20., 289558=Returning to INQUIRY 2479 (FIG. 24h), if the allocation type request operand is not equal to zero, then the nature of the ECR operation is determined, STEP 2481. Specifically, the ratio indicator(s) and structure size indicator of the allocation type request operand are examined to determine the nature of the requested ECR operation. In particular, a determination is made as to whether this is a size change without ratio change; a ratio change without size change; or a combined size and ratio change., 285980=Subsequently, a determination is made as to whether the request operand values were intended to be an approximation, INQUIRY 2464. Specifically, a check is made to see.if the bounded counts priority indicator is equal to one and one or more of the computed actual target maximum counts is greater than the corresponding request operand value. If the request operand values are not intended to be an approximation, then any computed target maximum count object value that is greater than the corresponding request operand value is reduced to the value of the corresponding request operand, STEP 2465., 64372=“Multiple Processor System Having Software For Selecting Shared Cache Entries Of An Associated Castout Class For Transfer To A DASD With One I/O Operation,” Elko et al., U.S. Pat. No. 5,493,668, Issued on Feb. 20, 1996;, 206640=Regardless of how the rebuild process is initiated, once it is initiated, a determination is made as to whether user-managed rebuild is allowed, INQUIRY 2002. If there is at least one active connector to the structure and all active connectors support user-managed rebuild (ALLOWREBLD=YES is specified when the user connects to the structure), then a user-managed rebuild process is started, STEP 2004. The user-managed rebuild process enables a structure to be rebuilt under user control. One example of a user-managed rebuild process is described in “Method And System For Reconfiguring A Storage Structure Within A Structure Processing Facility,” Allen et al., U.S. Pat. No. 5,515,499, Issued May 7, 1996, which is hereby incorporated herein by reference in its entirety., 202311=Each CPC includes hardware for connecting the respective CPC to the coupling facility and the couple and function data sets. In particular, located within CPC 1800 a is hardware 1808 a which includes, for instance, intersystem(I/S) channels 1810 a to connect coupling facility 1802 via a bus 1812 a to CPC 1800 a, and I/O channels (not shown) to couple CPC 1800 a via a link 1814 a to couple data set 1804 and function data set 1806., 278768=Returning to INQUIRY 2427, if a timeout has not been reached, then a determination is made as to whether allocation is complete, INQUIRY 2431. If allocation is not complete, then an increment of work is performed to advance progress of the initial allocation, STEP 2432. For example, control and data areas needed by the structure are created. Thereafter, processing continues with INQUIRY 2427., 64026=“Method, System And Program Products For Browsing Fully-Associative Collections Of Items,” Elko et al., U.S. Pat. No. 6,317,744, Issued Nov. 13, 2001;, 232890=If a new system is to be selected, then the particular system is chosen, STEP 2308. In one example, the new system selected is based on the following criteria: whether it is capable of performing the allocate (e.g., appropriate CFLEVEL); it has connectivity to the coupling facility of the old structure; and it has the best connectivity to other coupling facilities into which the structure can be rebuilt. Thereafter, the allocation request is sent to the selected system, STEP 2310, and processing continues with STEP 2300 to build an eligibility list., 65109=“Castout Processing For Duplexed Cache Structures”, Elko et al., Ser. No. 09/255,383, Filed on Feb. 22, 1999;, 279211=If allocation is complete, then the structure state is set equal to allocation complete, STEP 2433, and the target maximum counts are recomputed to force them into agreement with the pending ratio(s), STEP 2434. Thereafter, the structure size, target structure size, MXSS, MRSS, MASS, maximum counts and target maximum counts are copied into the MRB, which is returned with an indicative response code, STEP 2435., 63544=“Method, System And Program Products For Copying Coupling Facility Cache Structures,” Elko et al., Ser. No. 09/378,839, filed Aug. 23, 1999;, 281931=However, if a model-dependent timeout has not been reached, then a determination is made as to whether the allocation is complete, INQUIRY 2449. If allocation is incomplete, then an increment of work is performed to advance progress of the allocation, STEP 2450. That is, control and data areas needed by the structure are created. Thereafter, processing continues with INQUIRY, 65357=“Method And Apparatus For Coupling Data Processing Systems,” Elko et al., U.S. Pat. No. 5,317,739, Issued May 31, 1994;, 275765=However, if there is sufficient storage to achieve either the marginal structure size or the target structure size, as the case may be, then processing continues, as described herein. In particular, a determination is made as to whether the achieved structure size is less than the specified or computed structure size (which is possible if TSS is greater than zero or TCPI is equal to zero), INQUIRY 2418. If the achieved structure size is less than the specified or computed structure size, then the target structure geometry and maximum counts are recomputed using the achieved structure size as input, STEP 2419. The target maximum counts, MRSS, MASS, TSS and MXSS remain unchanged., 271362=In performing the initial allocation, a determination is made as to whether the comparative structure authority operand is equal to zero, INQUIRY 2402 (FIG. 24b). Should the authority comparison fail, then an indicative response code is returned, STEP 2403. However, if the authority comparison is successful, then a further determination is made as to whether the target structure size (TSS) is equal to zero, INQUIRY 2404., 278172=Subsequent to updating the structure controls, a determination is made as to whether there has been a model-dependent timeout, INQUIRY 2427 (FIG. 24d). If a timeout has occurred, then an allocation checkpoint is set, STEP 2428, and the structure state is set equal to allocation incomplete, STEP 2429. Additionally, the SS, TSS, MXSS, MRSS, MASS, maximum counts and target maximum counts are copied into the message response block, which is returned along with an indicative response code, STEP 2430. This ends initial allocation processing., 64611=“Software Cache Management Of A Shared Electronic Store In a Supplex,” Elko et al., U.S. Pat. No. 5,457,793, Issued Oct. 10, 1995;, 273400=However, if the maximum structure size is greater than the target structure size, then MXSS is set equal to the MXSS request operand, STEP 2409. Additionally, the target structure geometry, the actual target maximum counts, MRSS, and MASS are recomputed as described above, but this time, the MXSS value supplied as a request operand is used in the computation. No change is made to the target ratio(s)., 67377=“Method And Apparatus For Expansion, Contraction, And Reapportionment Of Structured External Storage Structures”, Dahlen et al., U.S. Pat. No. 5,581,737, Issued Dec. 3, 1996; and, 495555=Initially, a determination is made as to whether there are any active connectors to the new structure, INQUIRY 5000. If there are no active connectors, then the physical structure version number of the new structure is updated to equal that of the old structure, STEP 5001, and the old structure is deallocated STEP 5002. (In one example, deallocation is described in “Method And Apparatus For Coupling Data Processing Systems,” Elko et al., U.S. Pat. No. 5,317,739, Issued May 31, 1994, which is hereby incorporated herein by reference in its entirety.) Thereafter, CFRM transitions into the complete phase, STEP 5004., 273830=Returning to INQUIRY 2406, if MXSS is not greater than zero, then MXSS is set equal to the computed target structure size, STEP 2410., 280534=In order to continue allocation, a determination is made as to whether the comparative structure authority is equal to the structure authority, INQUIRY 2442 (FIG. 24e). If the comparative structure authority is not equal to the structure authority, then an indicative response code is returned, STEP 2443. However, if the comparative structure authority is equal to the structure authority, then the structure authority request operand from the MCB is copied into the structure authority controls, STEP 2444. Thereafter, the user structure controls and extended user structure controls are updated, STEP 2445. In particular, the value in the user structure controls request operand in the MCB is copied into the user structure controls object, and the value in the extended user structure controls request operand in the MCB is copied into the extended user structure controls object., 210281=If system-managed rebuild is not allowed, then the rebuild request is failed, STEP 2008. However, if system-managed rebuild is allowed, then a further determination is made as to whether there are any active connectors that exist on the structure to be rebuilt, STEP 2010. If there are no active connectors, then the next phase of processing is the allocate phase, which is described in detail below, STEP 2012. However, if there are active connectors, then the next phase of processing is the startup phase, STEP 2014., 329306=If, however, the LCID is unassigned, then a determination is made as to whether the comparative local cache authority is equal to zero, INQUIRY 2906. If the comparative local cache authority comparison fails, then once again an error is indicated and various information including, for instance, the local cache authority and the attachment information are returned in the response operands, STEP 2908., 288181=However, if there was no timeout, a determination is made as to whether the ECR operation is complete, INQUIRY 2474. If the ECR operation is incomplete, then an increment of work is performed to advance progress of the ECR operation, STEP 2475. Thereafter, processing continues with INQUIRY 2471., 328818=Continuing with the attachment in a failed-persistent state, a determination is made as to whether the local cache identifier (LCID) is unassigned, INQUIRY 2902. If the LCID is assigned, then the LCID state is incompatible with the attachment request type. Thus, an error is indicated and various information is returned in the response operands including, for instance, the local cache authority, attachment information and attachment status, STEP 2904., 66142=“A Method And System For Managing Data and Users of Data in a Data Processing System,” Allen et al., U.S. Pat. No. 5,465,359, Issued on Nov. 7, 1995;, 272868=Thereafter, a determination is made as to whether the maximum structure size (MXSS) request operand is greater than zero, INQUIRY 2406. If the MXSS request operand is greater than zero, then a further determination is made as to whether the maximum structure size request operand is greater than the target structure size, INQUIRY 2407. Should the MXSS operand be less than or equal to TSS, then an indicative error code is returned, STEP 2408, and processing of the allocate structure ends., 341006=Subsequent to reading the data (if any), the entry, and data/adjunct are propagated to the new structure, STEP 3214. In one example, a Write and Register (WAR) command is used to write the entry and its associated data/adjunct to the new structure. One embodiment of the WAR command is described below. (A further example is described in U.S. Pat. No. 5,537,574 entitled “Sysplex Shared Data Coherency Method,” Elko et al., Issued on Jul. 16, 1996, which is hereby incorporated herein by reference in its entirety.), 65908=“Coupling Facility For Receiving Commands From Plurality Of Hosts For Activating Selected Connection Paths To I/O Devices And Maintaining Status Thereof”, Elko et al., U.S. Pat. No. 5,463,736, Issued Oct. 31, 1995;, 422142=One embodiment of the Attach List Structure User command is described below with reference to FIG. 41. (A further example of the ALSU command is described in “Method And Apparatus For Coupling Data Processing Systems,” Elko et al., U.S. Pat. No. 5,317,739, Issued May 31, 1994, which is hereby incorporated herein by reference in its entirety.) The Attach List Structure User command attaches the list structure user, when the user authority comparison succeeds and the UID state is compatible with the attachment request type., 106536=As mentioned above, the entries of cache directory 128 (FIG. 1) are partitioned into storage classes. As one example, storage classes are described in U.S. Pat. No. 5,457,793 entitled “Software Cache Management of a Shared Electronic Store In A Supplex,” by Elko et al., issued on Oct. 10, 1995, which is hereby incorporated herein by reference in its entirety. Each storage class includes, for instance, a set of storage class controls 133. In on embodiment, these controls include the following (FIG. 6):, 215909=Returning to FIG. 19, after the structure is quiesced, CFRM transitions into the next phase of processing, STEP 1906. In one example, the next phase of system-managed rebuild is the allocate phase., 290104=Subsequently, a determination is made as to whether this is a redrive of an ECR operation, INQUIRY 2482. In particular, a check is performed to see whether an ECR operation is already in progress and whether the target structure size and/or target ratio request operand(s) specify that ECR operation. If this is a redrive operation, then processing continues with INQUIRY 2471 (FIG. 24g)., 297602=Once all attachment processes that were dispatched to run on the systems with active connectors have indicated that they are complete, the syncpoint for the attach phase is reached, STEP 2508. Thus, a determination is made as to whether all of the attaches were successful, STEP 2510. If one or more of the attaches was unsuccessful, then the rebuild is stopped, STEP 2512., 495051=Returning to FIG. 19, subsequent to processing the copy phase, CFRM transitions into the next phase of processing, the cleanup phase, STEP 1912., 63230=“Method, System And Program Products For Modifying Coupling Facility Structures,” Dahlen et al., Ser. No. 09/379,435, filed Aug. 23, 1999;, 234536=One embodiment of an Allocate Cache Structure (ACS) command is described below. (A further example of ACS is described in “Method And Apparatus For Coupling Data Processing Systems,” Elko et al., U.S. Pat. No. 5,317,739, Issued May 31, 1994, which is hereby incorporated herein by reference in its entirety.) In one example, the Allocate Cache Structure command includes a message command block, having, for instance, the following operands: a message header; a command code (CC); a structure identifier (SID); an adjunct assignment indicator (AAI); an apportionment priority indicator (API); a UDF order queue indicator (UDFOQI); an allocation type (AT); a maximum data area size (MDAS); a data toleration factor (DTF); a directory toleration factor (DITF); a target structure size (TSS); a maximum structure size (MXSS); a user structure control (USC); a structure authority (SAU); a comparative structure authority (CSAU); a data area element characteristic (DAEX); a maximum storage class (MSC); a maximum castout class (MCC); a target directory to data ratio (TDTDR); a target directory entry count (TGDEC); a target data area element count (TGDAEC); a target counts priority indicator (TCPI); a target ratio validity indicator (TRVI); a name class mask (NCM); and an extended user structure control (EUSC)., 326909=After retrieving the attachment information from the old structure that is associated with the LCID that is assigned in the old structure, but unassigned in the new structure, the user identified by that LCID is attached to the new structure in the failed-persistent state, STEP 2808. In one embodiment, an Attach Local Cache Command is used to attach the user in the failed-persistent state., 324705=After obtaining the LCID vectors for the old and new structures, processing continues for any of the local cache identifiers that are assigned in the old structure, but unassigned in the new structure. In particular, an LCID to be processed is selected, STEP 2803. Then, a determination is made as to whether the LCID is assigned in the old structure, INQUIRY 2804. In one example, this determination is made by examining the LCID vector for the old structure. In particular, the bit corresponding to that LCID is examined. If it is equal to one, then the LCID is assigned. If the LCID is assigned in the old structure, then a determination is made as to whether the LCID-is unassigned in the new structure, INQUIRY 2805., 482029=In particular, when there is no allocated list set, the next phase is a lock table copy processing phase, STEP 3914. It may be a multiple or a single phase depending on the number of allocated locks for the structure. For example, if the lock table has 1024 locks (an arbitrary number) or fewer, one system is selected to copy all of the locks. Otherwise, multiple systems (up to, for instance, 32) are indicated as workers, and the lock table copy process is parallelized among them., 210848=Returning to FIG. 19, subsequent to completing the initiation phase, CFRM transitions into the next phase of processing, STEP 1902. In one example, the next phase of system-managed rebuild is the startup phase, assuming there are active connectors to the structure being rebuilt., 364075=However, if the assignment was successful, or if no assignment needed to be made, then a further determination is made as to whether a data area assignment is to be made, INQUIRY 3306. In one example, this determination is made by checking the data area size operand. If the DAS operand is greater than zero, then such an assignment is to be made, STEP 3308. Thus, a data area assignment is processed for the specified name, storage class and data area size by obtaining an ordered collection of available data area elements, attaching them to the directory entry, setting the data bit to one and setting the data area size object to the value of the DAS operand. Data area assignment is further described in U.S. Pat. No. 5,537,574 entitled “Sysplex Shared Data Coherency Method,” Elko et al., Issued on Jul. 16, 1996, which is hereby incorporated herein by reference in its entirety., 271834=When the target structure size is equal to zero, then directed allocation is being performed. Directed allocation enables the specification of target maximum counts, and thus, allows an application to allocate a new structure that has the same characteristics as another structure (even when the coupling facility architecture level or implementation may be different). When directed allocation is specified, the target structure geometry (i.e., the distribution of structure resources) and actual target maximum counts are computed using supplied approximate target maximum counts as input, STEP 2405. The actual target maximum counts that are computed using the approximate target maximum counts supplied as request operands are greater than or equal to the approximate values. Additionally, the target ratio(s), the marginal structure size (MRSS) and the minimum apportionable structure size (MASS) are computed. Further, the maximum structure size (MXSS) is assumed to be the same as the calculated TSS., 325467=If the LCID bit position in the vector of the new structure is equal to zero indicating that the LCID is unassigned in the new structure, then processing continues with STEP 2806. Specifically, attachment information is retrieved from the old structure. In one example, the information is retrieved using a Read Local Cache Information command., 381761=As each copy task completes the castout class queue processing, it turns off its bit in the worker string. Then, when the syncpoint is reached (all participants' bits off), a transition into the next phase occurs by setting the phase to the next phase. In this embodiment, the next phase is a write-with-castout (WWCO) queue copy phase, STEP 2606 (FIG. 26)., 295928=Each system with active connectors attaches the connectors to the new structure, STEP 2504. As one example, the attachment process is passed a structure name and physical structure version number for the new structure. This identifies the instance of the structure that the connectors should be attached to. The attachment processing reads the CFRM policy and attempts to attach all active connectors to the system on which it is running to the new structure. The attachment process should attach the connectors with the same user attachment authority and local hardware vector token as used as attachment to the old structure., 217051=One embodiment of the logic associated with the allocate phase is described with reference to FIG. 23. Initially, a list of eligible coupling facilities is built on the selected system, STEP 2300. This list includes one or more coupling facilities in which the structure may be allocated. The determination of the eligibility list is, in one example, based on various considerations. These considerations include, for instance, the following:, 285398=If this is not a redrive of an ECR operation, then a new ECR operation is being initiated, STEP 2463. Thus, any currently active ECR operation is terminated. Additionally, the target structure geometry and actual target maximum counts are computed using supplied approximate target maximum counts as input. Further, the reapportionment in progress indicator(s) and/or the structure size change in progress indicator, as appropriate, is set. The computed target structure size and the target maximum counts are then stored in the target structure controls., 205040=The system-managed rebuild process can be started or stopped using either an operator command (2000)(e.g., SETXCF) or a programming interface (2001) (e.g., IXLREBLD). One example of IXLREBLD is described in U.S. Pat. No. 5,515,499 entitled “Method and System for Reconfiguring A Storage Structure within a Structure Processing Facility”, Allen et al, Issued on May 7, 1996, which is hereby incorporated herein by reference in its entirety., 116875=Referring back to FIG.1, as previously mentioned, the subset of changed directory entries is also partitioned into castout classes. As one example, castout classes are described in U.S. Pat. No. 5,493,668 entitled “Multiple Processor System Having Software for Selecting Shared Cache Entries of An Associated Castout Class for Transfer To A DASD with One I/O Operation”, Elko et al., Issued on Feb. 20, 1996; and in “Method, System And Program Products For Managing Changed Data Of Castout Classes,” Elko et al., Ser. No. 09/251,888, filed Feb. 19, 1999, each of which is hereby incorporated herein by reference in its entirety. Each castout class has associated therewith a set of castout class control blocks 134. In one embodiment, these controls include the following (FIG. 8):, 286613=Subsequent to performing the recomputation or if the request operands are intended to be an approximation, then a further determination is made as to whether the target ratio validity indicator is equal to one, INQUIRY 2466. If the indicator is not equal to one, then the ratio(s) is computed using target maximum count request operand value(s) as input, STEP 2467. The results are stored in pending ratio object(s) in the structure controls., 64196=“Method And System For Reconfiguring A Storage Structure Within A Structure Processing Facility,” Allen et al., U.S. Pat. No. 5,515,499, Issued May 7, 1996;, 290533=However, if this is not a redrive operation, then a new ECR operation is initiated, STEP 2483. Thus, any currently active ECR operation is terminated. Additionally, the target structure geometry and target maximum counts are computed using the target structure size and/or target or pending ratio(s) as input. Further, the reapportionment in progress indicator(s) and/or the structure size change in progress indicator, as appropriate, is set. The target structure size, if the ECR operation includes a size change, and the target maximum counts are stored in the structure controls., 203313=In one embodiment, each CPC further includes an operating system 1816 a, 1816 b, respectively. Each operating system includes, as a part of XES services (see FIG. 1), a Coupling Facility Resource Manager (CFRM) 1818 a, 1818 b, respectively, which governs the coupling facility resource use in a sysplex. CFRM provides services to the installation to manage the coupling facility resources usage based on the customer environment. These services include, for instance, managing the gain/loss of function data set 1806, which contains CFRM data; gain/loss of coupling facility 1802 access; cleanup of coupling facility resources for system failure; and controlling various aspects of the system-managed rebuild process of the present invention., 120183=Returning to FIG.1, in one embodiment, cache structure 122 also includes changed data management facility 132. Changed data management facility 132 includes at least a portion of the logic used during castout processing. Changed data management facility 132 is further described in U.S. patent application Ser. No. 09/251,888, Elko et al., entitled “Method, System And Program Products For Managing Changed Data Of Castout Classes”, filed Feb. 19, 1999, which is hereby incorporated herein by reference in its entirety., 67575=“Method And Apparatus For Previewing The Results Of a Data Structure Allocation,” Dahlen et al., Ser. No. 09/071,555, Filed: May 1, 1998; and, 66764=“Partial Page Write Detection For A Shared Cache Using A Bit Pattern Written At The Beginning And End Of Each Page”, Narang et al., U.S. Pat. No. 5,455,942, Issued Oct. 3, 1995;, 207448=Returning to INQUIRY 2002, if user-managed rebuild is not allowed, then a further determination is made as to whether system-managed rebuild is allowed, INQUIRY 2006. In one example, this determination is made, as follows:, 324356=Continuing with FIG. 28, in addition to obtaining the LCID vector for the old structure, the LCID vector for the new structure is also obtained, STEP 2802. Similar to obtaining the vector for the old structure, the vector for the new structure is obtained using, for instance, the Read Cache Structure Information command., 284900=Referring to FIG. 24f, initially, a determination is made as to whether the directed ECR indicator is equal to one, INQUIRY 2461. If the directed ECR indicator is equal to one, then a determination is made as to whether this is a redrive of an ECR operation, INQUIRY 2462. In particular, a determination is made as to whether an ECR operation is already in progress and whether the target maximum count request operands specify precisely that ECR operation., 271029=For example, a determination is made as to whether the created bit (i.e., the bit indicating that the structure has been created) for the SID is equal to one, INQUIRY 2400 (FIG. 24a). If the created bit for the SID is not equal to one, then structure allocation is being initiated, STEP 2401., 280113=Returning to FIG. 24a, if the created bit for the structure identifier is equal to one, indicating that structure allocation has, at least, been initiated, then a further determination is made as to whether the structure state is allocation complete., INQUIRY 2440. If the structure state is not allocation complete, then processing continues to allocate the structure, STEP 2441., 275335=Returning to INQUIRY 2413, if the target counts priority indicator is equal to one, then a further determination is made as to whether there is sufficient storage to satisfy the specified target maximum counts to achieve the target structure size, INQUIRY 2416. If there is insufficient storage to achieve the target structure size, then an indicative response code is returned, STEP 2417., 408698=Returning to FIG. 26, after completion of this processing, the next phase is transitioned into by setting the phase to Done and by setting the worker string equal to the participant string, STEP 2612., 316961=One embodiment of the logic associated with the Write Cache Copy Controls command is described with reference to FIG. 27. Initially, the structure authority object is compared to the comparative structure authority operand, INQUIRY 2700. If these values are not equal, then the structure authority object is placed in the structure authority response operand, STEP 2702, and the structure authority operand and an indicative response code are returned, STEP 2704. This ends the Write Cache Copy Controls command., 63704=“Method, System And Program Products For Copying Coupling Facility List Structures,” Dahlen et al., Ser. No. 09/379,097, filed Aug. 23, 1999;, 362597=One embodiment of the logic associated with a Write and Register command is described with reference to FIG. 33. In this example, the WAR command is used to write data that is not cached in the new structure. Initially, a determination is made as to whether a name has been assigned to the directory, INQUIRY 3300. This determination is made by using the name operand in the message command block and performing a directory lookup in the cache directory to see if the name exists (i.e., a directory entry exists with the same name field). If a name has not been assigned, then name assignment is performed, STEP 3302. A name assignment is processed for the specified name and storage class by obtaining an invalid directory entry, marking it valid, initializing the name, setting the castout parity bits to the null value, and attaching the directory entry to the directory. The count of directory entries in the storage class is incremented. Name assignment is further described in U.S. Pat. No. 5,457,793 entitled “Software Cache Management Of A Shared Electronic Store In a Supplex,” Elko et al., Issued Oct. 10, 1995, which is hereby incorporated herein by reference in its entirety., 339794=Continuing with FIG. 32, after retrieving a set of directory entries, the returned restart token is saved for further use, STEP 3206. Thereafter, a determination is made as to whether any directory entries were retrieved, INQUIRY 3208. If a directory entry was retrieved, that directory entry is selected, STEP 3210, and the entry, data and adjunct data (if present) are read from the old structure. In particular, if the DEIB indicates the entry has data, a read command is used to read the data/adjunct from the old structure. As one example, this read command is a Read and Register (RAR) command, which is described in detail in U.S. Pat. No. 5,537,574 entitled “Sysplex Shared Data Coherency Method,” Elko et al., Issued on Jul. 16, 1996, which is hereby incorporated herein by reference in its entirety. In this particular embodiment, this command is invoked with suppress-registration requested, assignment not requested, and name-replacement not requested, so that no structure objects in the old structure are updated., 231970=Once the list of eligible coupling facilities is built, the system selects a coupling facility from the list to be used in allocating the structure, STEP 2301. In one example, the first coupling facility on the eligibility list is selected., 296582=In one example, the attach is performed using an Attach Local Cache (ALC) command for cache structures and an Attach List Structure User (ALSU) command for list structures. Since this is a new attachment to the new structure, the comparative user attachment authority value is initially zero. Embodiments of the ALC and ALSU commands are described herein. Further examples are described in “Method And Apparatus For Coupling Data Processing Systems,” Elko et al., U.S. Pat. No. 5,317,739, Issued May 31, 1994, which is hereby incorporated herein by reference in its entirety., 85707=Each central processing complex 102 is also coupled to coupling facility 106 (a.k.a., a structured external storage (SES) processor). (In one embodiment, each central processing complex is coupled to a plurality of coupling facilities 106.) Coupling facility 106 contains storage accessible by the central processing complexes and performs operations requested by programs in the CPCs. Aspects of the operation of a coupling facility are described in detail in such references as Elko et al., U.S. Pat. No. 5,317,739 entitled “Method And Apparatus For Coupling Data Processing Systems”, issued May 31, 1994; Elko et al., U.S. Pat. No. 5,561,809, entitled “In A Multiprocessing System Having A Coupling Facility Communicating Messages Between The Processors And The Coupling Facility In Either A Synchronous Operation Or An Asynchronous Operation”, issued on Oct. 1, 1996; Elko et al., U.S. Pat. No. 5,706,432, entitled “Mechanism For Receiving Messages At A Coupling Facility”, issued Jan. 6, 1998, and the patents and applications referred to therein, all of which are hereby incorporated herein by reference in their entirety., 276485=However, if the achieved structure size is not less than the specified or computed structure size, then the structure size is set equal to the target structure size and the maximum counts are set equal to the target maximum counts, STEP 2420., 232237=Thereafter, an attempt is made to allocate the new structure within the selected coupling facility, STEP 2302. If this allocation attempt is unsuccessful, INQUIRY 2304, then a determination is made as to whether the end of the eligibility list has been reached, INQUIRY 2305. If the end has not been reached, then the next coupling facility on the list is selected, STEP 2301. However, if the end of the list has been reached, then a further determination is made as to whether a new system is to be selected to run the allocate process, INQUIRY 2306. In one example, a new system is selected once., 273997=After updating the maximum structure size, STEPS 2409, 2410, a determination is made as to whether the target-maximum count request operand values are in fact intended to serve only as approximations, INQUIRY 2411. Specifically, if the target counts priority indicator is equal to one or the bounded counts priority indicator is equal to one, then the target maximum count request operand values are not intended to be approximations—they are instead the exact values desired by the requester; in this case, any computed target maximum count value that is greater than the corresponding request operand value is reduced to the value of the corresponding request operand, STEP 2412., 276754=After recomputing the target structure geometry and the maximum counts or setting the structure size and maximum counts, the global controls are updated, STEP 2421. In one example, this includes setting the created bit for the structure identifier equal to one and associating storage frames with the SID., 298016=However, if all of the attaches were successful, then CFRM transitions into the next phase of processing, STEP 2514., 213007=Returning to FIG. 19, subsequent to performing the startup phase, CFRM transitions into the next phase of processing, STEP 1904. In one example, the next phase of rebuild processing is the quiesce phase, assuming there are active connectors to the structure., 336515=Returning to INQUIRY 3002, if the function was successful, then a castout class number is returned. Thus, the copy process continues by copying changed entries of the claimed castout class, STEP 3006. One embodiment of the logic associated with copying changed entries is described with reference to FIG. 32. Initially, a restart token is initialized to zero, STEP 3200. Thereafter, it is assumed that there is data in the castout class to be processed, INQUIRY 3202, and thus, a command is issued to attempt to retrieve a set of directory entries, STEP 3204. As one example, a Read Castout Class (RCC) command is used to read in a portion of the changed/castout locked directory entries from the claimed castout class. Full directory entry information block (DEIB) information for each of the directory entries is retrieved using this command. One example of a Read Castout Class command is described below. (A further example of RCC is described in U.S. Pat. No. 5,493,668 entitled “Multiple Processor System Having Software For Selecting Shared Cache Entries Of An Associated Castout Class For Transfer To A DASD With One I/O Operation,” Elko et al, Issued on Feb. 20, 1996, which is hereby incorporated herein by reference in its entirety.), 64919=“Method, System and Program Products For Providing User-Managed Duplexing of Coupling Facility Cache Structures,” Elko et al, Ser. No. 09/255,382, Filed on Feb. 22, 1999;, 212502=The operating system waits for the responses from the connectors, STEP 2106. Once all of the connectors respond to the Structure Temporarily Unavailable Event, then a determination is made as to whether any active connectors remain, INQUIRY 2108. If there are no active connectors, then the next phase of processing is the allocate phase, STEP 2110. However, if active connectors do remain, then the next phase of processing is the quiesce phase, STEP 2112., 331975=When the attach copy processing is complete, a transition into the next phase of processing is performed. As described above, transitioning employs the Write Cache Copy Controls command to perform a compare and swap of the structure copy controls. In this example, transitioning switches the processing to a castout class copy processing phase, as shown in FIG. 26, STEP 2604. The castout class copy phase is a multiple phase, in this example, and thus, the worker string of the structure copy controls is set equal to the participant string., 64761=“Method, System And Program Products For Managing Changed Data Of Castout Classes,” Elko et al., Ser. No. 09/251,888, Filed Feb. 19, 1999;, 277086=Subsequently, various structure controls are updated, STEP 2422. For example, the structure size, target structure size, MXSS, MRSS, MASS, maximum counts, target maximum counts, SAU, USC, EUSC, etc. are updated., 102893=(e) A Castout-Parity Indicator (CP): A field which indicates the current assignment of the castout parity. Three possible values are: castout parity is zero; castout parity is one; the castout parity is unknown. One example of the castout parity bits indicator is described in U.S. Pat. No. 5,455,942, entitled “Partial Page Write Detection For A Shared Cache Using A Bit Pattern Written At The Beginning And End of Each Page”, Narang et al., issued Oct. 3, 1995, which is hereby incorporated herein by reference in its entirety., 277324=Next, a determination is made as to whether the target structure size request operand is equal to zero, INQUIRY 2423. If it is equal to zero, then a further determination is made as to whether the target ratio validity indicator (TRVI) request operand is equal to one, INQUIRY 2424. Should the target structure size be equal to zero and the TRVI operand be equal to one or if the target structure size is not equal to zero, then structure controls are updated using request operand values, STEP 2425. In particular, the target ratio request operand value(s) are stored in the pending ratio(s). However, if the target structure size is equal to zero and the TRVI is not equal to one, then the structure controls are updated by storing the computed target ratio(s) into the pending ratio(s), STEP 2426., 65238=“Sysplex Shared Data Coherency Method,” Elko et al., U.S. Pat. No. 5,537,574, Issued Jul. 16, 1996;, 295593=The attachment process runs on each system in the sysplex that has active connectors to the structure. (Note that failed-persistent connectors are handled by the copy process, not the attachment process.) Thus, CFRM presents an attach signal to each system with active connectors, STEP 2500 (FIG. 25)., 392624=Subsequent to completing the storage class browse controls cleanup, a transition to the next phase takes place, STEP 2608 (FIG. 26). In particular, the Write Cache Copy Controls command is used to set the phase to the storage class registration copy processing phase (STC reg) and to set the worker string equal to the participant string, since the STC reg phase is a multiple phase. (If registrations are not to be copied, then the STC reg phase is skipped.), 329742=When the attachment request type is equal to the specified value, the LCID is unassigned, and the comparative local cache authority comparison succeeds, the local cache becomes assigned but remains in the detached state. The local cache authority and the attachment information request operands are stored in the corresponding local cache controls, STEP 2910. Additionally, the local cache token, the system identifier, and the detachment restart token within the local cache controls are set to zero. Further, the appropriate bit in the LCID vector of the cache structure controls is set to one indicating that the local cache is assigned, STEP 2912. Thereafter, a response code indicating completion is returned, STEP .2914., 101238=(a) A User-Data Field (UDF): The user-data field contains a value that is associated with the data when it is initially changed in the coupling facility cache and is maintained until the data area is re-used. The user-data field is valid when the data is cached as changed. The user data field contains a time value or timestamp, which represents the oldest point in time when the data element is changed and that change has not yet been migrated to DASD. (UDF is further described in a U.S. patent application Ser. No. 09/251,888, Elko et al., entitled “Method, System And Program Products For Managing Changed Data Of Castout Classes”, filed Feb. 19, 1999, which is hereby incorporated herein by reference in its entirety.), 99310=(f) System Identifier (SYID): A value specified by the program when a message path, used to communicate commands and messages (as described in U.S. Pat. No. 5,561,809 entitled, “In A Multiprocessing System Having A Coupling Facility, Communicating Messages Between The Processors And The Coupling Facility In Either A Synchronous Operation Or An Asynchronous Operation,” by Elko et al., issued Oct. 1, 1996; and “Coupling Facility For Receiving Commands From Plurality Of Hosts For Activating Selected Connection Paths To I/O Devices And Maintaining Status Thereof,” by Elko et al., U.S. Pat. No. 5,463,736, issued Oct. 31, 1995, each of which is hereby incorporated herein by reference in its entirety) is activated. The system identifier is maintained in a message-path status vector and copied into the local cache controls when an attach-local-cache command is communicated over the message path., 213356=During the quiesce phase, activity to the old structure is halted. One embodiment of the processing associated with the quiesce phase is described with reference to FIG. 22. Initially, a Rebuild Quiesce Event is presented to each connector of the structure, STEP 2200. However, before the event reaches the connectors, it is intercepted by XES and thus, is never received by the connectors (2202). In one example, the events are intercepted as close as possible to where the user's exit would have been called., 222313=The structure allocation process reads the structure attributes of the old structure and, for each coupling facility currently in the eligibility list, it uses the appropriate compute structure parameters command, providing these structure attributes as input, to determine what the target structure size (TSS) and minimum required control space (MRCS) would be for a structure which preserves the total object counts that are present in the old structure, with the maximum structure size (MXSS) value set equal to either the SIZE value from the structure's policy (after the pending policy size change, if any, is allowed to take effect) or to the computed actual structure size given the required counts, whichever is larger. One embodiment of the above computing is described in “Method And Apparatus For Previewing The Results Of A Data Structure Allocation,” Dahlen et al., Ser. No. 09/071,555, filed May 1, 1998; and in “Method And Apparatus For Expansion, Contraction, And Reapportionment Of Structured External Storage Structures”, Dahlen et al., U.S. Pat. No. 5,581,737, Issued Dec. 3, 1996, each of which is hereby incorporated herein by reference in its entirety., 66961=“Method For Managing Database Recovery From Failure Of A Shared Store In a System Including A Plurality Of Transaction-Based Systems Of The Write-Ahead Logging Type”, Narang et al., U.S. Pat. No. 5,280,611, Issued Jan. 18, 1994;, 462429=Subsequent to setting up for the Write List Controls command, the list controls are set, STEP 4610. In particular, a Write List Controls command is invoked on the new structure's list header to set the list controls. An LCT on the WLC command is specified that requests updating of all of the objects as described above. Operands on the WLC command are used to be able to set the list cursor value explicitly to its value in the old structure's list cursor object. One example of a Write List Controls command is described below and in “Method And Apparatus For Coupling Data Processing Systems,” Elko et al., U.S. Pat. No. 5,317,739, Issued May 31, 1994;, which is hereby incorporated herein by reference in its entirety., 282342=Returning to INQUIRY 2449, if allocation is complete, then the structure's state is set to allocation complete, STEP 2451. Additionally, the target maximum counts are recomputed to place them into agreement with the pending ratio(s), STEP 2452. Further, the structure size, target structure size, MXSS, MRSS, MASS, maximum counts and target maximum counts are copied into the MRB, which is returned along with an indicative response code, STEP 2448. Thereafter, processing of the continue structure allocation process is complete., 65496=“In A Multiprocessing System Having A Coupling Facility, Communicating Messages Between The Processors And The Coupling Facility In Either A Synchronous Operation Or An Asynchronous Operation”, Elko et al., U.S. Pat. No. 5,561,809, Issued on Oct. 1, 1996;, 82802=One embodiment of a computing environment incorporating and using the capabilities of the present invention is depicted in FIG. 1. Computing environment 100 is based, for instance, on the Enterprise Systems Architecture (ESA)/390 offered by International Business Machines Corporation, Armonk, N.Y. ESA/390 is described in an IBM Publication entitled Enterprise Systems Architecture/390 Principles Of Operation, IBM Publication No. SA22-7201-04, June 1997, which is hereby incorporated herein by reference in its entirety. One example of a computing environment based on ESA/390 is the 9672 Parallel Enterprise Server offered by International Business Machines Corporation., 287354=Thereafter, a determination is made as to whether there is a new ratio, INQUIRY 2469. If there is a new ratio, then the MASS is recomputed, STEP 2470. Thereafter, or if there is no new ratio, or if this is a redrive, INQUIRY 2462, then processing continues as described herein., 491193=When the Copy Lock Range procedure has run to completion, the lock table copy process for the case in which the number of lock table entries is less than or equal to 1024 locks is complete, STEP 4830 (FIG. 48a)., 283173=As one example, a determination is made as to whether the structure authority is equal to the comparative structure authority, INQUIRY 2453. If the structure authority is not equal to the comparative structure authority, then an indicative response code is returned, STEP 2454. However, if the structure authority is equal to the comparative structure authority, then the structure authority request operand from the MCB is copied into the structure authority object in the structure controls, STEP 2455., 252131=One embodiment of an Allocate List Structure (ALST) command is described below. (A further example of ALST is described in “Method And Apparatus For Coupling Data Processing Systems,” Elko et al., U.S. Pat. No. 5,317,739, Issued May 31, 1994, which is hereby incorporated herein by reference in its entirety.) In one example, an Allocate List Structure command includes a message command block having, for instance, the following operands: a message header; a command code (CC); a structure identifier (SID); a target counts priority indicator (TCPI); an apportionment priority indicator (API); a target ratio validity indicator (TRVI); a list structure type (LST); a lock table entry characteristic (LTEX); a list element characteristic (LELX); a maximum data list entry size (MDLES); an allocation type (AT); an element toleration factor (ELTF); an entry toleration factor (ETF); a target entry to element ratio (TETELR); a lock table entry count (LTEC); a list count (LC); a target structure size (TSS); a maximum structure size (MXSS); a target monitor to entry storage ratio (TMTESR); a comparative structure authority (CSAU); a structure authority (SAU); a user structure control (USC); an event monitor toleration factor (EMTF); a target maximum element count (TMELC); a target maximum entry count (TMEC); a target maximum event monitor count (TMEMC); and an extended user structure control (EUSC)., 287089=However, if the target ratio validity indicator is equal to one, then the structure controls are updated, STEP 2468. In particular, the target ratio request operand(s) are copied into the pending ratio object(s) in the structure controls., 497611=Returning to FIG. 19, subsequent to processing the cleanup phase, CFRM transitions into the next phase of processing, the completion phase, STEP 1914., 201911=Referring to FIG. 18, two CPC's (CPC 1800 a and CPC 1800 b) exist. Each CPC is coupled to a coupling facility 1802; a couple data set 1804, which includes the status for CPC 1800 a and CPC 1800 b; and a function data set 1806, which includes an active policy 1807 for coupling facility resources., 484918=One embodiment of the logic associated with the lock table copy processing is described with reference to FIG. 48a. Initially, a determination is made as to whether the number of locks is less than or equal to a predefined threshold (e.g., 1024), INQUIRY 4800. If there are 1024 locks or fewer, then a lock range is set, STEP 4802. In one example, the lock range is set to 0:LTEC-1. Thereafter, a Copy Lock Range procedure is called, STEP 4804., 406700=In this phase of processing, the storage class counters (e.g., the event counters) for each of the defined storage classes in the structure are copied, STEP 2610. The copy process reads the storage class counters for each defined storage class from the old structure (using, for instance, a Read Storage Class Information (RSCI) command) and writes them to the new structure using, for instance, a Write Storage Class Information (WSCI) command. The format of the command block for the Write Storage Class Information command matches, in one example, the format of the Read Storage Class Information response block. However, the write command only sets, in this example, a subset of the counts (the event counts)., 143202=As depicted in FIG. 15, each event queue 1500 includes a sequence of zero or more event monitor controls objects 1502. There is at least one event queue for each user (UID). Associated with each event queue are event-queue controls. One example of such controls is described with reference to FIG. 16:, 283718=Subsequently, a determination is made as to whether the user structure control indicator of the allocation type request operand is equal to one, INQUIRY 2456. If the indicator is equal to one, then the user structure controls and extended user structure controls are updated, STEP 2457. Thereafter, a determination is made as to whether any other allocation type request operand bit is active (i.e., check if the operation was to update USC and EUSC, only), INQUIRY 2458. If no other allocation type request operand bits are active, then the structure size, TSS, MXSS, MRSS, MASS, maximum counts, target maximum counts, reapportionment in progress indicator(s), and structure size change in progress indicator are copied into the MRB, which is returned along with an indicative response code, STEP 2459., 491919=However, if there are more locks to be processed, a compare and swap of the global lock manager takes place, STEP 4834. In one example, a Write Lock Table Entry command is used to perform the compare and swap from zero to the COPYID. One example of the Write Lock Table entry command is described in detail in “Method And Apparatus For Coupling Data Processing Systems,” Elko et al., U.S. Pat. No. 5,317,739, Issued May 31, 1994, which is hereby incorporated herein by reference in its entirety., 281473=Next, a determination is made as to whether the allocate structure command has ended with a model-dependent timeout, INQUIRY 2446. If a timeout has occurred, then the allocation checkpoint is set, STEP 2447. Additionally, the structure size, target structure size, MXSS, MRSS, MASS, maximum counts and target maximum counts are copied into the MRB, which is returned along with an indicative response code, STEP.2448., 211467=Initially, a system-managed rebuild checkpoint is created, STEP 2100, and connectors to the structure are notified of the impending rebuild, STEP 2101. For example, a Structure Temporarily Unavailable Event is presented to the user's event exit (2102). This allows the connectors to prepare for the structure to be unavailable during the system-managed rebuild process, if they so chose. For example, since mainline requests are being internally queued during the rebuild process and will not be processed until rebuild is complete, the connectors could limit activity to the structure. Further, they could switch to alternative processing during the rebuild process, so that their application is not affected by the fact that requests are not being processed., 63092=“System-Managed Rebuild Of Coupling Facility Structures,” Allen et al., U.S. Pat. No. 6,266,783, Issued Jul. 24, 2001;, 291143=Thereafter, a determination is made as to whether this ECR operation involves a ratio change, with or without a size change, INQUIRY 2484. If this is not a ratio change, then processing continues with STEP 2471 (FIG. 24g). However, if this is a ratio change, then the target ratio request operand(s) is copied into pending ratio object(s) in the structure controls. Additionally, the MASS is recomputed, STEP 2486. Thereafter, processing continues with INQUIRY 2471 (FIG. 24g)., 319215=As depicted in FIG. 26, the next phase of the cache copy process is an attach phase, which is a single phase, in this embodiment, STEP 2602. During this phase, zero or more users are attached to the new structure in a failed-persistent state (i.e., an assigned but not attached state)., 65771=“Mechanism For Receiving Messages At A Coupling Facility”, Elko et al., U.S. Pat. No. 5,706,432, Issued Jan. 6, 1998;, 318127=However, when both comparisons result in matching values, INQUIRY 2706, then the structure copy control request operand is stored in the structure copy control object, STEP 2710. Thereafter, the structure copy control version number object is incremented, STEP 2712, and a successful response code is returned, STEP 2704., 66514=“Method Of Managing Resources In One Or More Coupling Facilities Coupled To One Or More Operating Systems In One Or More Central Programming Complexes Using A Policy,” Allen et al., U.S. Pat. No. 5,634,072, Issued On May 27, 1997;, 328322=Initially, a determination is made as to whether the attachment request type indicates that the user is to be attached in the failed-persistent state, INQUIRY 2900. Specifically, if the attachment request type is equal to a specified value (e.g., binary ‘10’), then attachment in the failed-persistent state is indicated, and processing of the Attach Local Cache command continues. However, if such an attachment is not indicated, then processing ends, in this example., 288518=However, if the ECR operation is complete, then the reapportionment in progress indicator(s) and the structure size change in progress indicator are reset, STEP 2476. Additionally, the target maximum counts are recomputed to place them into agreement with the pending ratio(s), STEP 2477. Subsequently, the structure size, target structure size, MXSS, MRSS, MASS, maximum counts and target maximum counts are copied into the MRB, which is returned along with an indicative return code, STEP 2478., 67209=“Method And Apparatus Of Distributed Locking For Shared Data, Employing A Central Coupling Facility”, U.S. Pat. No. 5,339,427, Issued Aug. 16, 1994;, 279665=Returning to INQUIRY 2404 (FIG. 24b), if the target structure size is not equal to zero, then directed allocation is not being performed. Thus, the target structure geometry and target maximum counts are computed using the target structure size and target ratio(s) as input, STEP 2436. Additionally, MRSS and MASS are computed. Thereafter, processing continues with INQUIRY 2414 of FIG. 24c., 330509=Returning to FIG. 28, after the user is attached in the failed persistent state, or if the LCID was not assigned in the old structure or not unassigned in the new structure, a determination is made as to whether any other LCIDs are to.be processed, INQUIRY 2810. If so, processing continues with STEP 2803. If there are no additional LCIDs assigned in the old structure, but unassigned in the new structure, then processing of the attach copy processing ends.}",
    "textBeforeTable": "Patent Citations Although preferred embodiments have been depicted and described in detail herein, it will be apparent to those skilled in the relevant art that various modifications, additions, substitutions and the like can be made without departing from the spirit of the invention and these are therefore considered to be within the scope of the invention as defined in the following claims. Further, the objects, operands and controls described herein are only exemplary. Additional or differing objects, operands and/or controls may be used in other embodiments. The flow diagrams depicted herein are just exemplary. There may be many variations to these diagrams or the steps (or operations) described therein without departing from the spirit of the invention. For instance, the steps may be performed in a differing order, or steps may be added, deleted or modified. All of these variations are considered a part of the claimed invention. Additionally, at least one program storage device readable by a machine, tangibly embodying at least one program of instructions executable by the machine to perform the capabilities of the present invention can be provided. The present invention can be included in an article of manufacture (e.g., one or more computer program products) having, for instance, computer usable media. The media has embodied therein, for instance, computer readable program code means for providing and facilitating the capabilities of the present invention. The article of manufacture can be included as a part",
    "textAfterTable": "US5465359 1 Nov 1993 7 Nov 1995 International Business Machines Corporation Method and system for managing data and users of data in a data processing system US5493668 30 Mar 1992 20 Feb 1996 International Business Machines Corporation Multiple processor system having software for selecting shared cache entries of an associated castout class for transfer to a DASD with one I/O operation US5515499 18 Oct 1995 7 May 1996 International Business Machines Corporation Method and system for reconfiguring a storage structure within a structure processing facility US5537574 30 Mar 1992 16 Jul 1996 International Business Machines Corporation Sysplex shared data coherency method US5561809 11 Apr 1995 1 Oct 1996 International Business Machines Corporation In a multiprocessing system having a coupling facility, communicating messages between the processors and the coupling facility in either a synchronous operation or an asynchronous operation US5581737 12 Sep 1994 3 Dec 1996 International Business Machines Corporation Method and apparatus for expansion, contraction, and reapportionment of structured external storage structures US5634072 26 Feb 1996",
    "hasKeyColumn": true,
    "keyColumnIndex": 3,
    "headerRowIndex": 0
}