{
    "relation": [
        [
            "Project Details",
            "Translation Volume: 8648 words Completed: Jan 2008 Languages: French to Italian",
            "Translation Volume: 83908 words Completed: Sep 2007 Languages: French to Italian",
            "Translation Volume: 14872 words Duration: Sep 2007 Languages: French to Italian",
            "Translation Volume: 8 pages Completed: May 2007 Languages: French to Italian"
        ],
        [
            "Project Summary",
            "Traduction brochure touristique Tourism & Travel",
            "Descriptions of hotels for a tourism web site Tourism & Travel",
            "Tour Operator's brochure Tourism & Travel",
            "Traduction site web Tourism & Travel"
        ],
        [
            "Corroboration",
            "positive Unlisted : No comment. Loredana Vicario: Thanks for your feedback, I hope to work with you again!",
            "positive Blue Board outsourcer (5 to 10 entries): No comment. Loredana Vicario: Grazie per il feedback! Spero di poter collaborare ancora con voi",
            "positive Unlisted : Le travail à été effectué correctement en temps et en heure Loredana Vicario: Merci!",
            "positive Unlisted : No comment. Loredana Vicario: Merci!"
        ]
    ],
    "pageTitle": "Traduction français italien",
    "title": "",
    "url": "http://www.proz.com/translator/137844",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438044160065.87/warc/CC-MAIN-20150728004240-00197-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 659948500,
    "recordOffset": 659932106,
    "tableOrientation": "VERTICAL",
    "textBeforeTable": "4 projects entered    4 positive feedback from outsourcers Project History PRO-level points: 165, Questions answered: 97, Questions asked: 24 KudoZ activity (PRO) EUR Preferred currency Less More Wine / Oenology / Viticulture Transport / Transportation / Shipping Telecom(munications) Sports / Fitness / Recreation Ships, Sailing, Maritime Science (general) Law: Patents, Trademarks, Copyright Internet, e-Commerce Food & Drink Cooking / Culinary Biology (-tech,-chem,micro-) Manufacturing",
    "textAfterTable": "More Less Payment methods accepted Wire transfer, Visa, MasterCard, American Express, Check, PayPal Glossaries COMMERCIALE, COSMETICA, ECOLOGIA, ECONOMIA/FINANZA, EDILIZIA, LESSICO GASTRONOMICO, METALLURGIA/SIDERURGIA, SEGNALAZIONI STRADALI, VARIE Translation education Other - II Istituto Professionale per il Turismo Experience Years of translation experience: 11. Registered at ProZ.com: Mar 2006. ProZ.com Certified PRO certificate(s) N/A Credentials N/A Memberships N/A Teams Traducendo team Software Adobe Acrobat, Adobe Photoshop, Microsoft Excel, Microsoft Word, ABBYY FineReader 7.0 Professional Edition, Trados 7 Freelance, Powerpoint, SDL TRADOS Website http://traduzionifranceseitaliano.blogspot.com CV/Resume CV available upon request Professional practices Loredana Vicario endorses ProZ.com's Professional Guidelines. About me",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}