{
    "relation": [
        [
            "Categories",
            "Campus Safety",
            "Clubs and Activities",
            "Great for these types of students",
            "Share any unusual traditions or locations on campus",
            "Bang for the buck",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "Top notch!",
            "Cooking, Chem Club, Outdoor Adventures!",
            "Vegetarians! Outdoors people! Christian students!",
            "There's all kinds of hiking areas and a cool cave - if you don't mind getting a little dirty!",
            "I've been fortunate to be raised around mission minded people. I've been to at least a dozen different countries on mission trips lasting from 2 wks to about 11 months! When I graduate from college I hope to devote a large part of my time to mission work!",
            "I'm an officer in the cooking club! My friends and I love going hiking & camping and this summer I'm working at a youth camp where I am helping with adventure camp. We'll be repelling, white water rafting and caving to just name a few things.",
            "Excellent food if you're a vegetarian! I love the food here - it's delicious and affordable!",
            "Love it! Now I'm an RA in a campus condo! Everyone is great here.",
            "You definitely need to study but that would be at any school! Whatever your goals are - go out there an get here!",
            "Plug into resources! Attend your worship services! Attend your classes! Study hard and get your assignments done quickly. Take advantage of the extracurricular activiities - they're fun and you get to know lots of people! I took a year off to be a student missionary in Africa! What an incredible experience!",
            "If you are looking for a small town college in a park-like setting; this is the place for you. Small class sizes lend to getting to know the students and the instructors! Emphasis on a personal relationship with Jesus is a plus for students who want to make Him a part of their life."
        ]
    ],
    "pageTitle": "Southern Adventist University Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Southern-Adventist-University/reviews?_escaped_fragment_=/show/16834",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438044160065.87/warc/CC-MAIN-20150728004240-00124-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 903865511,
    "recordOffset": 903818810,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{209066=I will post something later once I start classes in 2015, 209977=I will post something later once I start classes in 2015. You can look at their website www.southern.edu and their Facebook Page to see the latest events., 208713=I will post something later once I start classes in 2015. You can look at their website www.southern.edu and their Facebook Page to see the latest events., 132276=Every year they put up a huge Christmas tree! And people like to go inside it. They light it up at the Christmas program in the beginning of December and it is simply beautiful!, 214229=© 2015, Cappex.com, LLC, 211176=I will post something later once I start classes in 2015, 143831=Three people were hit by cars during Fall 2012 semester., 208128=I will post something later once I start classes in 2015, 208360=I will post something later once I start classes in 2015}",
    "textBeforeTable": "06/30/2009 Reviewer is A current student here. 11 out of 13 people found this review useful. 3 people found this inaccurate. 1 of 51 Kimetha from Loxahatchee, FL Check out reviews left by other students or leave your own review. You could win a free scholarship. Southern Adventist University Reviews Southern Adventist University › Tennessee › By State › Colleges › } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.create', -->",
    "textAfterTable": "Categories Comments Campus Safety They are called Veggie Cops What to do for fun Southern Adventist University, has many different places to explore. They have a forest preserve with different trails for a person to visit. They also have a baseball field, tennis courts, basketball courts, and a gymnasium to get the stress off of school. Food and Dining The food at Southern Adventist University is delicious, because there are multiple places on it's campus to eat. Dorm Life The Dorms are okay. There are not any co-ed dorms. However, there are different positive lessons that a person can learn in each individual dorm. Academic Rigor Southern Advenist University has a very strong Nursing program, as well as a business, art, medical, and social work program. Tips for prospective students Be open-minded Be willing to try new things Come with an open heart In three sentences Southern Adventist University is school for people who want to learn more about themselves as well as Christ. Southern Adventist University",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}