{
    "relation": [
        [
            "Categories",
            "Clubs and Activities",
            "What to do for fun",
            "In three sentences"
        ],
        [
            "Comments",
            "Rotary Club of Northwest Dhaka Community Sevice for NGO",
            "Dance Music Painting",
            "I am Shamila. I'm a Sophomore at Wesleyan College in Georgia, U.S.A. My intended Majors are Economics and Business and my GPA is 4.0"
        ]
    ],
    "pageTitle": "Wesleyan College Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Wesleyan-College/reviews?_escaped_fragment_=/show/79173",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042985140.15/warc/CC-MAIN-20150728002305-00035-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 892432947,
    "recordOffset": 892399887,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{19339=The entire campus is essentially a sorority. Wesleyan College is the birthplace of the first sororities: the Adelphean Society in 1851, now known as Alpha Delta Pi and the Philomathean Society in 1852, now known as Phi Mu, 62287=Wesleyan College is a women's college founded in 1836. It has a pretty campus. The school is usually very quite which is good for concentrating on school., 126362=© 2015, Cappex.com, LLC}",
    "textBeforeTable": "02/07/2011 Reviewer is A current student here. 13 out of 14 people found this review useful. 1 of 28 Francesca from Macon, GA Check out reviews left by other students or leave your own review. You could win a free scholarship. Wesleyan College Reviews Wesleyan College › Georgia › By State › Colleges › } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.create', -->",
    "textAfterTable": "Am enjoying being here Wesleyan students are not only highly intelligent, but also possess a genuine bond which is rarely found in any other college environment. Upon starting the first few weeks of school my freshman year, I felt as though I had known some of my classmates for years. Although this school has a wide variety of clubs, organizations, and sports teams, it is the women who attend the school which uphold the pioneering spirit it is famous for. Am learning a lot Each class offers its own, unique challenge for students. With a 10 to 1 student to professor ratio, the discussions are dynamic and intellectually stimulating. Faculty offer the best quality of education possible, and are determined to see you succeed. Login to rate or flag the reviews Alex from Macon, GA 02/06/2013 Reviewer is A past student here. 10 out of 13 people found this review useful. 1 person found it offensive. 2 of 28 Categories Comments Share any unusual traditions",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}