{
    "relation": [
        [
            "Final art",
            "Final art for cover, pen and ink on paper",
            "Final art for page 1, pen and ink on paper",
            "Final art for page 32, pen and ink on paper"
        ],
        [
            "Box",
            "13",
            "13",
            "13"
        ],
        [
            "Folder",
            "36",
            "37",
            "38"
        ]
    ],
    "pageTitle": "FLP - Tomi Ungerer papers",
    "title": "",
    "url": "http://libwww.freelibrary.org/ead/view.cfm?name=Ungerer",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042985140.15/warc/CC-MAIN-20150728002305-00255-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 147179399,
    "recordOffset": 147156931,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{13212=“Biography,” on Tomi Ungerer's official website, accessed May 12, 2010, http://www.tomiungerer.com/biography/#biography., 10425=Promotional materials appear to have been collected by Carolyn W. Field, coordinator of the Office of Work with Children for the Free Library of Philadelphia from 1953 to 1983. Ms. Field was a well-regarded and energetic children’s librarian as well as an author and editor of children’s books. She was instrumental in arranging for the donation of this collection, and likely continued to add promotional materials related to Tomi Ungerer to the collection as opportunity allowed. Promotional materials include a mobile for The Sorcerer’s Apprentice, written by Barbara Hazen and illustrated by Ungerer; a Classic Tales Illustrated calendar from 1971; Children’s Book Council materials promoting summer reading; and a small amount of assorted ephemera., 14777=Ungerer returned to the world of children’s literature in 1998 with the publication of Flix, the story of a cat family that unexpectedly gives birth to a dog, Flix, who grows up to bridge the two cultures and becomes mayor of both Cattown and Dogtown. Ungerer received numerous prizes for his work, including the New York Times Best Illustrated Children’s Books of the Year for The Three Robbers (1962), The Beast of Monsieur Racine (1971), and A Storybook from Tomi Ungerer (1974); the Society of Illustrators gold medal (1969); and the Hans Christian Andersen Medal for lifetime achievement (1998). The French government honored him several times, making him a Commandeur des Arts et des Lettres in 1985, a Chevalier de la Legion d’Honneur in 1990, and awarding him the Grand Prix National des Arts Graphiques in 1995. In 2003, he was named Goodwill Ambassador for Childhood and Education by the European Council, and in 2007, the Musée Tomi Ungerer opened in Strasbourg with over 8,000 drawings and 1,500 published volumes donated from the artist’s personal collection., 3196=University of Minnesota: Tomi Ungerer papers, CLRC-1645., 13356=\"Tomi Ungerer,\" Wikipedia, accessed May 12, 2010, http://en.wikipedia.org/wiki/Tomi_Ungerer., 4286=The artwork and writings were the gift of Tomi Ungerer, 1968. Promotional materials were collected by Carolyn W. Field, coordinator of children's services at the Free Library of Philadelphia., 12326=This collection contains the literary papers of author, illustrator, and cartoonist Tomi Ungerer. Ungerer’s illustrations for children’s books, both his own and those of other authors, make up the bulk of the collection. The papers consist of notes, drafts, dummies, sketches, illustrations, color separations, mockups, proofs, and promotional materials for published and unpublished works written between 1955 and 1974. Thirty-eight titles are represented in the artworks and writings series. Coverage per title varies from just a few items for Mr. Tall and Mr. Small, to extensive sketches, illustrations, dummies, color separations and proofs for the Mellops series, Crictor, and Emile. Books written by other authors and illustrated by Ungerer include the classic Flat Stanley by Jeff Brown and Warwick’s Three Bottles by André Hodeir. Unpublished works include Ungerer’s first children’s book, Der Sonntag der Saufamilie Schmutz, written before he came to the United States and featuring a family of pigs who would evolve into the Mellops. Other unpublished works in this collection include Alfaro the Wheeled Pirate (also called Melchior the One-Legged Pirate and Kakahdoo the One-Legged Pirate), Garby, The Mellops Against the Kidnappers, The Mellops Got a Car, and Gundolf, the Heartless Boy. Pigs are a popular theme, appearing not just in the Mellops series but also in two unpublished collections, Pigs Art and Pigfolio. While artwork is sometimes accompanied by a short note from a publisher, this collection contains virtually no correspondence. Some materials have been annotated with short notes by Ungerer explaining their origin, date of creation, or eventual fate., 15430=In addition to his own distinctive tales, Ungerer illustrated many works for children by other authors, including the classic Flat Stanley by Jeff Brown. He also worked in advertising and the commercial arts and began publishing satirical works for adults. In the 1960s, he became increasingly involved in the civil rights and anti-Vietnam movements. In 1970, he and his third wife Yvonne Wright moved to Canada. After the publication of Allumette and A Storybook in 1974, Ungerer stopped writing children’s literature for twenty-five years. In 1976, he and his family moved to Ireland., 17047=Tomi (Jean-Thomas) Ungerer was born in Strasbourg, France, on November 28, 1931. The Nazi occupation of Alsace during Ungerer’s childhood affected him deeply, leaving him with a strong aversion to war and fascism and a habit of questioning authority. After dropping out of school, Ungerer hitchhiked across Europe and briefly joined the Méharistes, or French Camel Corps, in Algeria. He then attended the École des Arts Decoratifs from 1953-1954 before resuming his travels, arriving in New York in 1956 with just $60 and a trunk full of manuscripts and drawings. Ungerer quickly found success, publishing his first children’s book, The Mellops Go Flying, in 1957. The Mellops are an indomitable family of adventurous pigs whose stories Ungerer continued in The Mellops Go Diving for Treasure (1957), The Mellops Strike Oil (1958), Christmas Eve at the Mellops (1960), and The Mellops Go Spelunking (1963). His books Crictor (1958) and Emile (1960), about a helpful boa constrictor and octopus, respectively, display Ungerer’s fondness for depicting unlikely heroes. In The Three Robbers (1962), a trio of menacing kidnappers are reformed by their contact with a plucky orphan and use all of their ill-gotten gains to found an orphanage. The subversive streak in Ungerer’s books is obvious in works like Moon Man (1967), in which the man in the moon journeys to earth only to be persecuted by intolerant humans and must escape back to the moon in a rocket ship.}",
    "textBeforeTable": "Collection Inventory+ Return to top Illustration of books--20th century Illustrated children's books--20th century Children's literature--20th century Children's authors--20th century Subject(s) Ungerer, Tomi, 1931- Ungerer, Miriam Showalter, Jean B. Lear, Edward, 1812-188 Hodeir, André, 1921- Hazen, Barbara Shook Cole, William, 1919-2000 Canfield, Kenneth F. Brown, Jeff, 1926-2003 Brenner, Barbara Beatty, Jerome Personal Name(s) Sketches Mechanicals (camera-ready copy) Manuscripts Illustrations Dummies (printed matter) Drawings (visual works) Color separation positives Bluelines (proofs) Form/Genre(s) Controlled Access Headings+ Return to top University of Minnesota: Tomi Ungerer papers, CLRC-1645. Musée Tomi Ungerer, Strasbourg, France. Related Materials+ Return to top The artwork and writings were the gift of Tomi Ungerer, 1968. Promotional materials were collected by Carolyn W. Field, coordinator of children's services at the Free Library of Philadelphia. Immediate Source of Acquisition: Some of the materials in this collection may be too fragile",
    "textAfterTable": "Final art Box Folder Final art for cover and title page, pen and ink on paper, with blue and red color separations, 3 sheets 2 1 Final art for page 3, pen and ink on paper, with red color separation, 2 sheets 2 2 Final art for page 4, pen and ink on paper, 1 sheet 2 3 Final art for page 5, pen and ink on paper, 1 sheet 2 3 Final art for page 6, pen and ink on paper, with red color separation, 2 sheets 2 4 Final art for page 7, pen and ink on paper, with red color separation, 2 sheets 2 5 Final art for page 8, pen and ink on paper, 1 sheet",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}