{
    "relation": [
        [
            "Categories",
            "Campus Safety",
            "Greek Life",
            "Clubs and Activities",
            "Great for these types of students",
            "Share any unusual traditions or locations on campus",
            "Bang for the buck",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "Campus safety at Loyola is incredible. One thing you should take advantage of is the 8ride, which is a van that is sponsored by the school to pick you up if you do not have a ride back to campus. There are many secure measure taken for dorm life and there are a variety of ways to contact security in case of an emergency. Campus safety also makes sure that students and parents know about crimes occurring on or around campus.",
            "Although I have never been a part of the Greek life at Loyola, I have only heard of great things. I encourage all students to at least learn about the different sororities and fraternities around campus. It is a great way to learn about the university, and to make long time friendships and relationships for the future.",
            "Loyola offers many clubs and activities to its students. There are various options including those more for recreation and those more career-oriented. One thing you must attend is the Clubs and Organizations fair toward the beginning of the fall semester. Students get to walk around booths to sign up for different things they are interested in, whether it is a sports team, greek life, or something simple just to pass time, like a photography club.",
            "The third floor of the Information Commons is a great place for students who are trying to study, or who are trying to get their work done quickly. This floor is completely silent, which is convenient during finals weeks.",
            "Zip's Lounge is located in the basement of the CFSU building on the Lake Shore Campus. At first, I was a little nervous about going there because it was in the basement of the building, but it turns out that it is a great place to hang out, have fun, or eat. There are couches, televisions, and pool tables.",
            "Loyola University Chicago is an expensive school, but the school makes sure that it is money well-spent. For example, the class sizes are small, making it possible for the professors to develop a relationship with their students. Loyola also offers student tutoring centers for almost any course. Finally, Loyola provides a comfortable environment around campus and in each building for students to relax and to enjoy.",
            "At Loyola University, you will never get bored. There is always some sort of activity going on somewhere on campus. Sign up for different events like the dodge ball tournament, or capture the flag. These are great ways to make friends and spend time while on campus. Loyola is also near the lake, so it is easy to find transportation to the beach. Or, instead, you could head towards the back of the school to relax near the lake and read a book.",
            "Each and every dorm provides various options for food for each meal of the day. Some students do get tired of eating the food in their dorms, which leaves them with many options around each campus for them to choose. At the Lake Shore Campus, you can choose from Chipotle, Subway, Feliches, Five Guys, and many, many more. The Water Tower Campus also has many options considering it is very close to the Water Tower Shopping Center.",
            "I will be living in Baumhart next year, located at the Water Tower Campus. So far from what I have seen, the location is great and the rooms are even greater. I have met many people along this process of choosing where to live, and each and every person has been very helpful. The university makes sure that you are happy with where you are and what you have.",
            "The academic setting of Loyola University Chicago is a bit challenging and difficult. But this should be looked at as a positive of the school. The courses and its professors push you out of your comfort zone and encourage you to provide excellent work. Do not let this scare you off; use it as a challenge and a goal to pursue greater things.",
            "Although it might be intimidating at first, do not be afraid to ask questions. The professors are there to help you understand the class and are more than willing to. Also, take advantage of all the resources that Loyola provides. You will be surprised by how easy it is to access information on any topic, and how easy it is to receive help in any academic area from other students.",
            "Loyola University Chicago is a diverse school welcoming of all different types of students. The atmosphere is warm and relaxing all-year-round. And the teachers are determined to provide the best education possible."
        ]
    ],
    "pageTitle": "Loyola University Chicago Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Loyola-University-Chicago/reviews?_escaped_fragment_=/show/90034",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438044160065.87/warc/CC-MAIN-20150728004240-00031-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 904057436,
    "recordOffset": 903912566,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{261396=loyola university-chicago offers students a challenging and diverse educational experience. loyola students have access to three campuses throughout the chicago metropolitan area as well as study abroad opportunities at campuses in rome and beijing. with its rich jesuit traditions, its fabulous location, and a 15:1 student/faculty ratio, students are nurtured and challenged to make a meaningful difference in the world., 571924=All of the dining here is pretty good. The best place to eat is (currently) Simpson Dining. I would advise not eating at Lakeshore Dining, except come April we won't even have Lakeshore Dining. They are opening up a brand new student center where I'm sure there will be exceptional food., 690229=Well there are the rocks by the lake that everyone loves, and the beach on warmer days to just sit and relax. An unusual tradition would be christmas on campus or the new years party that is held almost every year. The christmas on campus is self explanatory, you basically have christmas on campus! It's wonderful because everything is decorated! The new years party is in early september and its a small celebration for all the students and staff to welcome the new academic school and wish everyone good luck in their endeavors!, 102840=Wolf and Kettle day is in March every year when we celebrate the donors of our education and those who help pay for tuition. FUN, 803517=© 2015, Cappex.com, LLC, 18578=Do not take a class at 8:30 offered at the Water Tower Campus!One of the classes I would highly recommend is Human Values in Literature with Mr. Fruhauff. Overall, try to have an open mind about courses and balance out your schedule so that it fits your needs. Do not try to do too much in one semester but do try to get involved in extra curriculars. You will not regret it.}",
    "textBeforeTable": "08/07/2009 Reviewer is A current student here. 36 out of 37 people found this review useful. 1 of 171 Zachary from Chicago, IL Check out reviews left by other students or leave your own review. You could win a free scholarship. Loyola University Chicago Reviews Loyola University Chicago › Illinois › By State › Colleges › } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.create', -->",
    "textAfterTable": "Am learning a lot As a nursing student at Loyola University I was immediately enrolled in classes directly related to my major. The teachers for my nursing classes encouraged me to take initiative in getting involved early within the nursing field. They taught me that nursing is not just taking care of sick patients but taking on the incredible role of helping someone with their spiritual, mental, and physical health. Since I came to Loyola I have become extremely passionate about my chosen career due to the compassion and encouragement of faculty members and fellow students. I am truly excited to take on another year at Loyola. Login to rate or flag the reviews Joel from IL 07/08/2009 Reviewer is A current student here. 15 out of 15 people found this review useful. 3 of 171 Categories Comments Great for these types of students There are all kinds of students at Loyola. It's a very welcoming place. Rest assured you will fit in. And there are plenty of clubs/organizations to choose from.",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}