{
    "relation": [
        [
            "Channel",
            "ABC1 NSW",
            "SBS ONE Sydney",
            "Channel Seven Sydney",
            "Channel Nine Sydney",
            "Network TEN Sydney"
        ],
        [
            "TV show",
            "Eggheads",
            "Japanese News",
            "Seven Early News",
            "Today",
            "CBS This Morning"
        ],
        [
            "Time",
            "5:30 am - 6 am",
            "5:40 am - 6:15 am",
            "5:30 am - 6 am",
            "5:30 am - 9 am",
            "5:30 am - 6 am"
        ]
    ],
    "pageTitle": "Sydney Morning Herald - Business & World News Australia | smh.com.au",
    "title": "Summary of what TV shows are on tonight",
    "url": "http://www.smh.com.au/am/2013/01/29/index.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042985140.15/warc/CC-MAIN-20150728002305-00035-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 713879091,
    "recordOffset": 713808444,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{5202=PADDY MANNING Heavy rains are threatening to disrupt Queensland's coal industry, although the impact on supply is expected to be less severe than in 2011.}",
    "TableContextTimeStampAfterTable": "{242908=1562 views, 237290=Total votes: 12579., 184632=The Sapphires' march to dominance at the AACTA Awards., 225740=Brisbane Live: Monday, January 28, 248327=BarryJS, Jan 28, 2013, 11:01PM, 261162=January 27 2013, 247330=WK, Jan 29, 2013, 3:43AM, 15016=JOHN COLLETT If the fearless forecasts of economists and analysts for 2013 prove correct, our sharemarket will hit 5000 points, interest rates will slide, and the Australian dollar will finally lose some heat., 100535=Start your training for Run Melbourne 2013, to be held on Sunday, July 21., 124619=March 8 - 25 Over 70 sculptures will transform Perth's most popular beach into a sculptural wonderland., 243802=1010 views, 230479=Free-to-air TV: Thursday, January 31, 267423=Residents of the Connecticut town, where a shooter killed 20 elementary school students last month, join a march in Washington D.C. (01:32), 242033=1684 views}",
    "textBeforeTable": "7am 6:30am 6am 5:30am 5am 4:30am Skip to: The Rafters - the TV family and the show named after them - are stuck in a deep rut. Packed to the Rafters What's on TV Tonight Queenslanders share their thoughts on big issues. Gathering of the minds Our local experts give you the advice you ask for. Good Advice Opinion Book your tickets now and win an art adventure in Paris. Line up your laughs Brisbane Comedy Festival No, says Yeasayer guitarist ahead of Brisbane gig.",
    "textAfterTable": "Summary of what TV shows are on tonight Channel TV show Time ABC1 QLD The General 4:13 am - 5:30 am SBS ONE Queensland Korean News 5:05 am - 5:40 am Channel Seven Brisbane Sunrise Extra 5 am - 5:30 am Channel Nine Brisbane Nine's Early Morning News 5 am - 5:30 am Network TEN Brisbane Life Today with James Robison 5 am - 5:30 am Summary of what TV shows are on tonight Channel TV show Time ABC1 QLD Eggheads 5:30 am - 6 am SBS ONE Queensland Japanese News 5:40 am - 6:15 am Channel Seven Brisbane Seven Early News 5:30 am - 6 am Channel Nine Brisbane Today",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}