{
    "relation": [
        [
            "Model",
            "Aspire V5-122P-61454G50NSS",
            "ATIV Book 9 Lite 905S3G-K01DE"
        ],
        [
            "GPU",
            "Radeon HD 8250",
            "Radeon HD 8250"
        ],
        [
            "Memory",
            "4096 MB",
            "4096 MB"
        ],
        [
            "Core / Memory",
            "300 - 400 / 533 MHz",
            "400 / MHz"
        ],
        [
            "GPU Memory",
            "Shared Memory 12.102.1.1000",
            "Shared Memory 12.102.1.1200"
        ],
        [
            "Value",
            "1031",
            "1097"
        ]
    ],
    "pageTitle": "AMD A-Series A6-1450 Notebook Processor - NotebookCheck.net Tech",
    "title": "",
    "url": "http://www.notebookcheck.net/AMD-A-Series-A6-1450-Notebook-Processor.92120.0.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988650.6/warc/CC-MAIN-20150728002308-00104-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 628336287,
    "recordOffset": 628282017,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{7256=The AMD A6-1450 is a mobile quad-core SoC for compact subnotebooks and tablets introduced in mid-2013. In addition to having 4 CPU cores with a base clock speed of 1.0 GHz (turbo up to 1.4 GHz), the 28nm chip also integrates a Radeon HD 8250 GPU, a single-channel DDR3L-1066 memory controller and a Southbridge with various I/O- ports., 6102=Due to the low base clock speed of 1.0 GHz, the performance is modest in applications with poor parellization support. Even in Turbo-Dock mode (1.4 GHz) the A6-1450 will hardly surpass the old E-350. However, if all 4 cores are utilized effectively, performance becomes similar to the Arrandale-based Core i3-380UM. For basic office and multimedia tasks, the A6-1450 has sufficient power; however, it will quickly reach its limits in more demanding software., 5355=The SoC integrates a Radeon HD 8250 GPU with 128 shaders based on the GCN architecture. The clock rate of 300 MHz can be raised up to 400 MHz in Turbo mode. At this clock, the HD 8250 matches a Radeon HD 6450M or Intel HD Graphics (Ivy Bridge). Recent games as of 2013 are therefore hardly playable. However, older and less demanding games will run fluently., 4635=The power consumption of the entire SoC is rated at 8 Watts or up to 15 Watts in Turbo Dock mode. Thus, the A6-1450 is suitable for slim subnotebooks or larger tablets.}",
    "lastModified": "Fri, 31 Jul 2015 12:52:02 GMT",
    "textBeforeTable": "Hide comparison chart Show comparison chart 2 benchmarks and specifications    2 benchmarks and specifications 1428 (9%)     max: 1546 Points min: 1310      avg: 1428 (9%)     median: 100% 0% 3DMark (2013) - Fire Strike Standard Physics 1920x1080 Benchmarks googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414573626553-2'); });",
    "textAfterTable": "Intel Core M-5Y10c -62% ... Intel Celeron N3050 -34% AMD A6-4455M -33% Intel Celeron N2810 -32%",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}