{
    "relation": [
        [
            "Domain Created On",
            "unknown",
            "unknown old"
        ],
        [
            "Last Modified On",
            "2013-06-04",
            "2 years, 58 days ago"
        ],
        [
            "Expires On",
            "unknown",
            "unknown from today"
        ]
    ],
    "pageTitle": "getter-tools.de Desktop - ts2.travian.de - Getter-Tools 2.0 | SEOCert",
    "title": "",
    "url": "http://www.seocert.net/analyzer.getter-tools.de",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438044160065.87/warc/CC-MAIN-20150728004240-00313-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 698834087,
    "recordOffset": 698817275,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{4013=IP address of getter-tools.de is : 148.251.139.202. The domain getter-tools.de was created on unknown and it is 45 years, 212 days old. It will expire on unknown which is -46 years, -213 days from today. The homepage of website getter-tools.de has a size of 348090 bytes, and a text size of 13951 bytes, its Text to Code Ratio is 4.18% Homepage of getter-tools.de has 1615 links, 181 link to internal pages, while 1434 link to pages on other websites. It takes 0.75 s ( 464.90 Kb/s ) to load the website getter-tools.de.}",
    "textBeforeTable": "Desktop - ts2.travian.de - Getter-Tools 2.0 Words count: 7    Unique Words: 6    Length: 43 characters [ To optimize the page title, Use this SEO Title Optimizer ] : Title Content Analysis Register To View All >> the 1632 recommended tasks to improve your SEO performance. ... Add more high page-rank back-links to your site. Reduce number of links to other pages. Configure the server so that your site IP http://148.251.139.202 is redirected to the site domain name getter-tools.de. Move the 93 inline css components to an external style sheet file. Add in more high quality text content and make the text to code ration to be within 15%-70%. Create a XML sitemap for your site. Write more in-depth content on the topics of your page. Create one H1 element for your page, put the most important keywords in. Set meta keywords. Set meta description for your page. Recommended (adsbygoogle = window.adsbygoogle || []).push({});",
    "textAfterTable": "Tips: 1. ideally, the title should contain 10 to 70 characters, including spaces. (Google displays up to 70 characters in the title, and takes into account only the first 12 words.) 2. put the most important and relevant keywords in the title, try not to repeat any word. 3. each individual page should have a unique title. Description : Words count: 0    Length: 0 characters [ To optimize the page description, Use this SEO Meta Description Optimizer ] Meta Description is not set. Meta Descriptions provide concise explanations of the contents of web pages, that are commonly used by search engines on search result pages to display preview snippets for a given page. Tips: 1. it is best to keep meta descriptions between 70-160 characters. 2. a readable, compelling description using important keywords can draw a much higher click-through rate of searchers to the given web page. 3. avoid keyword stuffing, ensure each page has its own unique description. Google SERP Preview : Desktop - ts2.travian.de - Getter-Tools 2.0 www.getter-tools.de/ [ To optimize this Google SERP preview, Use this Google SERP Optimizer ] Page description",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}