{
    "relation": [
        [
            "Availability",
            "Pay per hour",
            "Monday",
            "Tuesday",
            "Wednesday",
            "Thursday",
            "Friday",
            "Saturday",
            "Sunday"
        ],
        [
            "Day",
            "$25",
            "unavailable",
            "unavailable",
            "unavailable",
            "available",
            "available",
            "available",
            "available"
        ],
        [
            "After School",
            "$25",
            "unavailable",
            "unavailable",
            "unavailable",
            "available",
            "unavailable",
            "available",
            "available"
        ],
        [
            "Evening",
            "$30",
            "unavailable",
            "unavailable",
            "unavailable",
            "unavailable",
            "available",
            "available",
            "unavailable"
        ]
    ],
    "pageTitle": "Nanny & Babysitting in leichhardt, NSW",
    "title": "Availability",
    "url": "http://www.findababysitter.com.au/Browse/Babysitter/NSW/Leichhardt",
    "hasHeader": true,
    "headerPosition": "MIXED",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438044160065.87/warc/CC-MAIN-20150728004240-00327-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 445260411,
    "recordOffset": 445232666,
    "tableOrientation": "VERTICAL",
    "TableContextTimeStampAfterTable": "{67873=Residency status: Temporary until December 2015, 127397=Hi, my name is Leanne I live in Leichhardt in the Inner West of Sydney, with my teenage daughter and our dog. I am a mature, responsible, reliable and cheerful person with excellent childcare and interpersonal skills. I have experience as both a live-in and live-out nanny. I enjoy working with children and love caring for them . A snap shot of me is I have worked in the community sector for more than ten years. My work involved providing direct support to people with mental illness or those who have a disability within the community. In 1980, I was a full time nanny to a 3 year old and a 18 month year old baby in London, UK. 2012-2014 a casual nanny to 6, 4, and 3 year old children in the Inner West of Sydney when required. From October 2014-April 2015, I was Nannying three afternoons per week for a lovely family in Haberfield , whom I still Nanny for on Friday afternoons. I'm Now Nanny for a lovely family in Concord Monday - Wednesday mornings and after school care. I'm also a Nanny to a 19 month old girl every Saturday morning. I would like to concentrate solely on being a nanny and doing what I know I have the time and patience for. I have a warm personality and have enjoyed being a role model to my own daughter. I am honest and reliable, strong morals and have the ability to undertake tasks responsibly. I Understand the need to remain flexible to support last-minute demands and changes. I am Comfortable in changing environments and situations, ensuring ability to remain flexible and adaptable at all times. As I have raised my own daughter I have on the job knowledge and experience of caring for children. I understand the complexities of raising children and trying to create the balance that comes with it, routines, play, homework, after school activities and so on., 24883=Residency status: Temporary until January 2016, 71519=I have worked as an afterschool nanny during 2 years with the same family: 1 and 3 years old children when I started. Since January 2014, I have been working with 2 families keeping 1-3 kids aged 18months - 4year old 3 days a week. I love kids and I am willing to help families educate their kids in a nice environment., 76544=My name is Anna and I am 20 years old. I am currently studying Primary Education and have completed my Certificate III in Children's Services in 2013. I am energetic, reliable and flexible and love children. I have extensive babysitting experience for children from 6 months - 12 years and would love to look after your child., 116134=NEED A RELIABLE CASUAL BABYSITTER? Trained and worked as a PAEDIATRIC NURSE. Currently studying Vet medicine at Sydney Uni (Camperdown). On uni holidays for all of July 2015 so I'll be available on weekdays. My Bachelor's Degree in Nursing at UTS taught me the fundamentals of health, pathophysiology, pharmacology and emotional well-being of children. I majored in Paediatric Nursing and also undertook studies in Family Centred Care. After I graduated I was offered a nursing job Sydney Children's Hospital. I loved working with children, but i didn't enjoy the hospital lifestyle and heartache when patients passed away. I had a change of heart and decided to apply to uni to become a Vet. While studying my Nursing Degree I regularly nannied for a number of different families, in particular 2 young boys (6 months and 3 years) who I had a very strong bond with. I took them on outings, prepared their meals, organised activites, and got along really well with their parents. Everyday I would document the activities the children did, what they ate, nap times etc, so that the parents had a good understanding of what their kids were doing with me each day. I am great with cooking, feeding, playing, settling, nappies and bottles. I am a confident, professional, reliable and cheerful person who loves being creative and active. I am highly competent in caring for children with special needs or disabilities. I have a particular passion for caring for infants. I don't believe in smacking children. My approach to nannying is to care for your children in the most nurturing and warm-hearted way possible, while providing them with stimulating activities, vigilant supervision, and loyal companionship. -I have a great sense of humor. -I love pets. -Non-smoker. -Flexible with start and finish times. I have an 8 year old sister who I regularly look after, so I'm pretty in touch with activities that young children love doing., 87292=AVAILABLE FOR HOLIDAY BABYSITTING. I am off uni most of July so at the moment daytime is also mostly available. I am a friendly, enthusiastic and creative individual who loves to care for and interact with children. I have completed my Bachelor of Music (Hon) and am currently working towards my Masters of Teaching. My experience: - Music teacher as part of a school's afterschool program, children aged 5-12. - I have cared for friends and families children between the age of 3-15 since my early teens. - Work experience at Castle Hill Preschool. -Practicum placement at Sydney Secondary College. I am willing to adapt to any activities or schedule you may have planned for you children. I am additionally willing to do housework and cooking where needed during my working hours. I look forward to meeting you and your children soon! :), 118512=Other Skills: Paediatric first aid and CPR. I regularly volunteer my nursing skills for Unimed First Aid at sporting events and large music festivals. I have completed over 1000 hours of community service in the past 7 years providing first aid. I own my own car (Volkswagon Golf) and have an excellent driving record., 145452=Residency status: Temporary until June 2017}",
    "textBeforeTable": "Non-Smoker Permanent Resident Willing to do House Keeping First Aid Training References Available Working With Children / Police Check Available Glossary Last updated today To contact Erin you'll need to Join now or Login Provide criteria Residency status: Permanent Other Skills: -Reads Music -Cooking- cater to dietary requirements/ nut free, gluten etc -Confident in out-of home activities -Confident swimmer Education Status: Currently Studying - Nutrition at Advanced Diploma Looking for: Casual Evening Babysitting, Casual Weekend Babysitting, Part-time Afterschool Care, Part-time Daytime Work Hi there! My name is Erin Collins and I am currently studying an Advanced Diploma of Nutrition at ACNT. I also am a qualified Learn to Swim Instructor working 2 days at Leichhardt Aquatic Centre. Current qualifications include: -AUSTSWIM Teacher of Swimming and Water Safety -Working With Children Check Clearance -Current CPR HLTAID003 Provider of First Aid. I have worked directly with children for years now and have found it a fulfilling job- one which complies best with my social and friendly nature. In this time I have worked with newborns to pre-teens, allowing me to develop skills flexible to their individual needs. I am looking for casual/part",
    "textAfterTable": "Comfortable caring for ages: 0-1 years 1-2 years 2-3 years 3-5 years 5+ years Jodie ~ Leichhardt 32 year old Female babysitter and nanny I am a caring and fun loving Early Childhood Teacher, looking to branch out from preschools and long day care centres, to focus on what's really important in early childhood, the children! I've been working with children and families for over 10 years, in a variety of early childhood settings and cultural backgrounds. I am comfortable with and have experience caring for children aged 6 weeks to 8 years of age, including children who speak English as a second language (or not at all) and children with additional needs. I am looking for day part time or day full time employment as a Nanny, or evening/weekend work as a babysitter/nanny. I am flexible about days, hours and pay, though I expect my pay to reflect my duties, qualifications and experience. Looking for: Casual Evening Babysitting, Casual Weekend Babysitting, Overnight Stays Education Status: Course Complete - Bachelor Education (Early Childhood) at Macquarie University Other Skills: I have a great love of singing and acting, fortunately I have a measure of skill in both. Im a keen boarder/skier and an amateur photographer.",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}