{
    "relation": [
        [
            "Code or Value",
            "0.181 to 43.512",
            "."
        ],
        [
            "Value Description",
            "Range of Values",
            "Missing"
        ],
        [
            "Count",
            "6890",
            "555"
        ],
        [
            "Cumulative",
            "6890",
            "7445"
        ],
        [
            "Skip to Item",
            "",
            ""
        ]
    ],
    "pageTitle": "NHANES 2001 - 2002: Standard Biochemistry Profile Data Documentation, Codebook, and Frequencies",
    "title": "",
    "url": "http://www.cdc.gov/nchs/nhanes/nhanes2001-2002/L40_B.htm",
    "hasHeader": true,
    "headerPosition": "MIXED",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438044160065.87/warc/CC-MAIN-20150728004240-00078-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 356627839,
    "recordOffset": 356600984,
    "tableOrientation": "VERTICAL",
    "TableContextTimeStampBeforeTable": "{47543=Title: Standard Biochemistry Profile (L40_B ) Contact Number: 1-866-441-NCHS Years of Content: 2001 - 2002 First Published: September, 2006 Revised: NA Access Constraints: None Use Constraints: None Geographic Coverage: National Subject:Standard Biochemistry Profile, Follicle Stimulating Hormone, and Luteinizing Hormone Record Source: NHANES 2001 - 2002 Survey Methodology: NHANES 2001 - 2002 is a stratified multistage probability sample of the civilian non-institutionalized population of the U.S. Medium: NHANES Web site; SAS transport files, 36939=The 21 analytes described in this method constitute the routine biochemistry profile. The analyses are performed with a Hitachi Model 704 multichannel analyzer (Boehringer Mannheim Diagnostics, Indianapolis, IN). Each analyte is described separately within each pertinent section of this document. NOTE: Glucose, cholesterol, and triglycerides were analyzed as part of this profile, but the results do not replace the formalized reference methods data from NHANES 1999-2000 samples analyzed at other institutions., 33578=O-Cresolphthalein complexone offers a rapid, specific, and sensitive method for the quantitative determination of calcium in serum. This method and other compleximetric methods for the determination of calcium, which are derived from the work of Schwarzenbach, are less tedious than the classic permanganate reference procedures. In 1966, Connerty and Briggs devised a manual photometric method using o-cresolphthalein complexone with protein precipitation to release bound calcium and 8-hydroxyquinoline to mask the interference by magnesium. Sarkar and Chauhan introduced a direct determination of serum calcium in 1967 and modified by Baginski et al in 1973. Others have adapted this method for use with automated analyzers., 24155=The 21 analytes described in this method constitute the routine biochemistry profile. The analyses are performed with a Beckman Synchron LX20. Each analyte is described separately within each pertinent section of this document. NOTE: Glucose, cholesterol, and triglycerides were analyzed as part of this profile, but the results do not replace the formalized reference methods data from NHANES 1999-2000 samples analyzed at other institutions., 7001=The NHANES quality control and quality assurance protocols (QA/QC) meet the 1988 Clinical Laboratory Improvement Act mandates. Detailed quality control and quality assurance instructions are discussed in the NHANES Laboratory/Medical Technologists Procedures Manual (LPM). Read the LABDOC file for detailed QA/QC protocols., 6611=The analysis of NHANES 2001-2002 laboratory data must be conducted with the key survey design and basic demographic variables. The NHANES 2001-2002 Household Questionnaire Data Files contain demographic data, health indicators, and other related information collected during household interviews. They also contain all survey design variables and sample weights for these age groups. The phlebotomy file includes auxiliary information such as the conditions precluding venipuncture. The household questionnaire and phlebotomy files may be linked to the laboratory data file using the unique survey participant identifier SEQN., 4338=The distributions of sample person results were compared between the Coulston Foundation Laboratory (2001) and the Collaborative Laboratory Services (2002). The means of the sample person distributions for the two labs were compared using a weighted t-test. Five tests including Alkaline Phosphatase, Creatinine, Lactate Dehydrogenase, Phosphorus, and Total Bilirubin had significantly (p<0.05) different means. A cross-over study between the two labs was performed to establish linear regression equations to convert Coulston Foundation Laboratory values to the Collaborative Laboratory Services values. The regression equations were applied to the five tests and a weighted t-test was done after regression. The weighted t-test revealed that no significant differences (p<0.05) between the two labs after regression. 10.6 Correction for Serum Creatinine for NHANES 2001-2002 is not necessary: Serum creatinine is not standardized in many laboratories. The National Kidney Disease Education Program is attempting to have all laboratories standardize serum creatinine to reference methods (Myers, GL, et al. Recommendations for Improving Serum Creatinine Measurement: A Report from the Laboratory Working Group of the National Kidney Disease Education Program. Clin. Chem. 2006; 5-18). Equations for estimating glomerular filtration rate (GFR) from standardized creatinine have been published (Stevens LA, et al. N Engl J Med. 2006 Jun 8;354(23):2473-83). Serum creatinine assays on 194 stored specimens from NHANES 2001-2002 were used to determine if serum creatinine needed to be adjusted when compared to a method traceable to a “gold” standard reference method. The Cleveland Clinic Foundation (CCF) laboratory analyzed the serum creatinine specimens using a Roche coupled enzymatic assay (creatininase, creatinase, sarcosine oxidase, kits # 1775677 and 1775766) performed on a Roche P Module instrument. The Roche method calibrators were traceable to an isotope dilution mass spectrometric method for serum creatinine using standard references methods (NIST SRM 967) and confirmed by analysis of CAP LN-24 linearity set based on NIST assigned values. Serum creatinine by the Roche method was then compared to the original NHANES 2001-2002 measurements which used the Jaffe kinetic alkaline picrate method performed on a Beckman LX-20 analyzer and a Roche Hitachi 917 analyzer. There were no significant differences in results between these two measurements. The comparison of values revealed the mean (SD) serum creatinine at NHANES, CCF, and their difference were 0.982 (0.316), 0.987 (0.325), and 0.005 (0.060) mg/dL, respectively (paired t-test, p=0.28). The regression of CCF (Y) on NHANES (X) had an intercept and slope of -0.005 (0.014) and 1.010 (0.013) mg/dL and a correlation of 0.983. The difference between the methods was within the analytical error of the NHANES method (CV of 4.4% at 0.68 mg/dL or 0.030 mg/dL and a CV of 2.9% at 1.26 mg/dL or 0.037 mg/dL). Thus, no correction is necessary for serum creatinine values in NHANES 2001-2002., 28619=For sodium, potassium, and chloride, which all carry a single charge, R, T, n, and F are combined into a single value referred to as the slope (S). For determinations on the Roche/Hitachi ISE Modules where the sample is diluted 1:31, the ionic strength, and therefore, the activity coefficient are essentially constant. (For the Roche/Hitachi 736 ISE Module the sample is diluted 1:16). The concentration of the test ion in the internal filling solution is also constant. These constants may be combined into the Eo term. The value of Eo is also specific for the type of reference electrode used. Equation (1) can be rewritten to reflect these conditions:, 5972=Coulston Foundation at Alamagordo, New Mexico performed testing in 2001 and Collaborative Laboratory Services at Ottumwa, Iowa performed testing in 2002.}",
    "lastModified": "Fri, 09 May 2014 20:26:38 GMT",
    "textBeforeTable": "Both males and females 12 YEARS - 150 YEARS Target: Albumin (g/dL) English Text: Albumin (g/dL) SAS Label: LBXSAL Variable Name: LBXSAL - Albumin (g/dL) Both males and females 12 YEARS - 150 YEARS Target: Respondent sequence number. English Text: Respondent sequence number SAS Label: SEQN Variable Name: SEQN - Respondent sequence number Codebook and Frequencies N/A. References The distributions of sample person results were compared between the Coulston Foundation Laboratory (2001) and the Collaborative Laboratory Services (2002). The means of the sample person distributions for the two labs were compared using a weighted t-test. Five tests including Alkaline Phosphatase, Creatinine, Lactate Dehydrogenase, Phosphorus, and Total Bilirubin had significantly (p<0.05) different means. A cross-over study between the two labs was performed to establish linear regression equations to convert Coulston Foundation Laboratory values to the Collaborative Laboratory Services values. The regression equations were applied to the five tests and a weighted t-test was done after regression. The weighted t-test revealed that no significant differences (p<0.05) between the two labs after regression. 10.6 Correction for Serum Creatinine for NHANES 2001-2002 is not necessary: Serum creatinine is not standardized in many laboratories.",
    "textAfterTable": "LBDSALSI - Albumin (g/L) Variable Name: LBDSALSI SAS Label: Albumin (g/L) English Text: Albumin (g/L) Target: Both males and females 12 YEARS - 150 YEARS Code or Value Value Description Count Cumulative Skip to Item 21 to 55 Range of Values 6891 6891 . Missing 554 7445 LBXSATSI - ALT: SI (U/L) Variable Name: LBXSATSI SAS Label: ALT: SI (U/L) English Text: ALT: SI (U/L) Target: Both males and females 12 YEARS - 150 YEARS Code or Value Value Description Count Cumulative Skip to Item 3 to 1925 Range of Values 6891 6891 . Missing 554 7445 LBXSASSI - AST: SI (U/L) Variable Name: LBXSASSI SAS Label: AST: SI (U/L) English Text:",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}