{
    "relation": [
        [
            "Job Title",
            "Account Executive / Sales Executive – Advertising Technology",
            "Flexo Printing Press Operator",
            "Summer Intern",
            "Certified Massage Therapist - $500 Signing Bonus",
            "PT Grocery Associate - Food Lion"
        ],
        [
            "Location",
            "New York, NY",
            "South Easton, MA",
            "Dallas, TX",
            "Broomfield, CO",
            "Palmyra, VA"
        ]
    ],
    "pageTitle": "Apparel - Entry Level Jobs, Internships, and Career Overview",
    "title": "",
    "url": "http://www.onedayonejob.com/jobs-internships/apparel/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042985140.15/warc/CC-MAIN-20150728002305-00126-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 640341187,
    "recordOffset": 640215164,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{295895=Copyright © 2007-2013 One Day, One Job. All rights reserved., 168036=J. Crew - J. Crew is a New York, NY based apparel retailer that started with a catalog in 1983 and is known for its preppiness, but that may be changing.}",
    "textBeforeTable": "social media online marketing New York marketing humor fashion e-commerce design community management apparel all employers See the complete BustedTees profile BustedTees - BustedTees is a New York, NY based t-shirt company that was started by the same team as CollegeHumor. Companies with Entry Level Jobs and Internships in Apparel Most of these positions require a college degree. While you don’t technically need a degree to become a fashion designer, you do need a portfolio. You can also work with a company that designs or sells clothing. Depending on whether you choose to work with a clothing company with a physical presence or an online company, you could work in finance, human resources, software development, customer support, or marketing. Marketing or advertising Clothing sales Fashion design Apparel deals with every stage of the clothing creation process: design, creation, and selling. Depending on your interests within apparel, you could work in any of the following areas: Photo Credit: Flickr user miss.libertine",
    "textAfterTable": "all employers apparel design fashion Illinois India international retail shoes social entrepreneurship social venture user experience web development Job Title Location Director of Visual Design Boston, MA Hair Stylist Ocala, FL Maintenace Technician Schuyler, NE Lead Dental Assistant Watsonville, CA Benchman Cabinet Maker (Eagle, CO) Eagle, CO See all 1,664 job postings Vince - Vince is a New York, NY based fashion brand that offers a “collection of iconic essentials that women and men would want to wear every day.” See the complete Vince profile all employers apparel buyer copywriting fashion merchandising New York",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}