{
    "relation": [
        [
            "Activity",
            "Wander through the atmospheric Muslim Quarter and visit the Xi'an Great Mosque, the first mosque constructed in China",
            "Learn about the fascinating history of the ancient Chinese capital of Chang'an at the Shaanxi History Museum, without doubt one of the finest museums in China",
            "Explore the world-famous site of the Terracotta Warriors, an army of 8000 life-size figures built to protect the Emporer Qin Shi Huang in the afterlife",
            "Visit the impressive Big Wild Goose Pagoda, Xi'an's most famous landmark dating from the Tang and Ming Dynasties",
            "Walk or cycle around the Ming Dynasty Xi'an City Wall, the largest city wall in the world",
            "Visit the ornate 14th-century Bell and Drum towers, which originally marked the sunrise and sunset",
            "Visit the mind-blowing Tomb of Emporer Jingdi of the Han Dynasty, containing 50,000 doll-sized terracotta figures",
            "Visit the Forest of Stelae Museum, a collection of 3000 stone tablets of Chinese calligraphy that has been collected here since 1057",
            "Visit the huge former Tang Dynasty royal palace of Daming, and explore its vast parks and gardens"
        ],
        [
            "Approximate Cost",
            "CNY 30",
            "CNY 30",
            "Included in Kitty",
            "CNY 80",
            "CNY 80",
            "CNY 40",
            "CNY 90",
            "CNY 50",
            "CNY"
        ]
    ],
    "pageTitle": "Trip Notes for Bangkok - Xi'an via Laos",
    "title": "",
    "url": "http://www.dragoman.com/holidays/trip-notes/south-east-asia-between-xian-and-bangkok?format=dossier&vid=6281&did=70227",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988650.6/warc/CC-MAIN-20150728002308-00280-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 398842831,
    "recordOffset": 398788895,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{58017=Tel: +856 71 25 2775, 66737=Xishuangbanna in China's deep south is a remot region characterised by it's lush, tropical landscape of virgin rainforest, plantations and paddy fields. The area takes it’s name from the Chinese approximation of the original Thai \"Sip Sawng Pann\" which means \"12 rice growing districts\". Passing through the small villages and tropical forests you'll realise just how far removed from the rest of provincial China you are, Banna has a real laid-back, Southeast Asian feel, more akin to it's close neighbours Laos and Myanmar. The area is also home to a large number of indigenous minority groups like the Dai people, with their distinctive colourful dress and customs., 184636=These trip notes were printed on 01/08/2015, 71502=Kunming, the capital of Yunnan province is known in China as \"the city of eternal spring\" due to its temperate climate. It's a thoroughly modern city, home to a population of about 6 million - but despite its size it's actually pretty laid-back and is an enjoyable place to while away an afternoon. The Yuantong temple is definitely worth a visit, at over 1000 years old it is the largest Buddhist temple complex in Kunming, or treat yourself to a hair cut from one of the outdoor barbers who offer their services around the Tang Pagodas., 90470=See the brand new New Century Global Centre, a monstrous modern events centre which became the world's largest building in 2014, 144428=United States. http://travel.state.gov/travel/travel_1744.html, 125434=Citizens of other countries should check with the relevant consulates as to whether a visa is required. Please note that certain Eastern European nationalities (whether members if the EU or not) will need a visa, but some nationalities can obtain the visa on arrival while others will need to obtain it in advance – please check carefully what the situation is for your nationality. If you are travelling on our Yangon-Bangkok section and you do need a visa, you will have to obtain it in advance, as they don’t yet issue visas on arrival at the Htee Khee border with Myanmar that we use., 94472=The nearby town of Leshan is a 1300-year-old market town. The most impressive thing to see here is Dafo (the Great Buddha), which at 71m tall is the world's largest Buddha. It is beautifully situated on the banks of the Min River and the best way to see it is to take a boat trip. The Buddha took over 90 years to build and incorporated ingenious water ducting canals to reduce weathering and water erosion. It's a truly impressive sight, peering out over the river through half-lidded eyes with its vast bulk towering over the small boats., 93761=South of Chengdu in Sichaun province lies Emei Shan, one of the holiest mountains in all of China. At just over 3000m high, this mountain has been a centre of pilgrimage for over 1800 years. It has some irresistible treks. Although it would take three days to do the mountain full justice, the lower slopes have some great hiking trails through dense lush green vegetation. These treks follow the route of the pilgrims to a variety of beautiful Buddhist temples. While you trek, a constant stream of pilgrims will pass you by on their way up or down the mountain. For those determined to get to the summit, you can do it in one day, by taking a minibus up a road and then climbing the last section., 178940=For mobile phones, please note that most countries in the Americas operate at 850MHz and 1900 MHz which is not the same frequencies used in Europe, Africa, Asia and Australia. Most modern tri-band and quad-band mobile phones will be able to operate on these frequencies but please check your mobile phone specifications before travelling to ensure that you'll be able to use your phone in the Americas., 108841=The imperial centre of China for 2,000 years, Xi'an is now a vibrant, modern city dotted with many interesting  historical sites. A monument pays homage to the fact that this was the start of the famous ancient trading route of the Silk Road and the city is still surrounded by city walls which you can climb and walk or cycle along, a unique way to experience the city. For a different view, haul yourself to the top of the Bell or Drum Towers in the centre of the city. Thanks to Xi'an's long and colourful history, the city is full of beautiful temples and museums and interesting cultural and historic sites, the most famous of which are probably the 2000 year old Terracotta warriors. Home to many Hui people, an ethnic Muslim minority, the city also has a unique Islamic flavour, particularly in the streets surrounding the Great Mosque, best explored by foot. Once you've worn yourself out with a hard days sightseeing, you can head out to the night markets to try some of the many tantalising local specialties on offer. Pao mo is a lamb broth that you break flat bread into, or try hand pulled noodles or hot pot. Later on, try your luck at karaoke, hugely popular here, or head down to the South Park to live it up with the locals as they dance, practice martial arts, play games, fly kites and watch the world go by., 3893=Vehicle in Cambodia - 2013 departures, 101323=Harnessing the power of the mighty Yangtze River, The Three Gorges Dam is the largest hydroelectric project ever undertaken. The Chinese initially started work on the dam  back in 1994, and once complete it will change the face of this region forever. The two primary purposes of the dam are to generate hydroelectric power and prevent major flooding.  On completion, it's estimated that the average power generated over the course of a year will be 84.68 billion kilowatt hours (KWH). Then there's the constant threat of flooding, the Yangtze has always posed a real threat to life and habitation to those living in its flood plains, and the building of the dam will finally remove that threat. On the other hand, the environmental damage, human displacement and cultural impact caused by the rising water must not be underestimated., 4975=Beijiing is the hub of political and international focus. With the 2008 Olympic games providing funds to modernise huge ares of the city, it is a truly modern city. However most visitors are most struck by it's old elements from celebrated site such as the Forbidden Palace to simple, traditional hutongs.}",
    "lastModified": "Sat, 01 Aug 2015 11:49:52 GMT",
    "textBeforeTable": "Tel: +66 (0) 22813088 THAILAND 10100 Bangkok Pomprab 269 Larn Luang Road Royal Princess Larn Luang Hotel  Hotel for the night: Royal Princess Larn Luang   In Bangkok we will stay in a centrally-located hotel with good facilities. Today will be a free day to explore the incredible city of Bangkok until the evening. There will be a group meeting today at 6:00pm - please look out for a note from your tour leader on arrival at the joining hotel with more information about this important meeting. Border Information: If joining in Bangkok, you will most likey enter Thailand at Bangkok Suvarnabhumi Airport. ( Tue 24 Mar ) Day 1: Bangkok ZenDate Object ( [tz:protected] => DateTimeZone Object ( ) [date] => 2015-03-24 00:00:00.000000 [timezone_type] => 3 [timezone] => UTC ) ZenDate Object ( [tz:protected] => DateTimeZone Object ( ) [date] => 2015-03-24 00:00:00.000000 [timezone_type] => 3 [timezone] => UTC ) ZenDate Object ( [tz:protected] => DateTimeZone Object ( ) [date] => 2015-03-24 00:00:00.000000 [timezone_type] => 3 [timezone] => UTC )",
    "textAfterTable": "The chaotic headlong pace of Bangkok doesn't match up with many people's idealised vision of the exotic capital of Siam. Scattered with high-rise buildings of concrete and glass, the city is a sprawling plain that's home to a population of at least nine million, and it often feels even bigger. But under the shadow of the skyscrapers you'll find a heady mix of frenetic markets, noisy traffic, hushed golden temples and early-morning alms-giving ceremonies. One way or another, the place will probably get under your skin - and if you don't enjoy the challenge of slogging through jams of buses and tuk-tuks, which fill the air with a chainsaw drone and clouds of pollution, you can spend time exploring the impressive temples and museums or shopping 'til you drop. ZenDate Object ( [tz:protected] => DateTimeZone Object ( ) [date] => 2015-03-24 00:00:00.000000 [timezone_type] => 3 [timezone] => UTC ) ZenDate Object ( [tz:protected] => DateTimeZone Object ( ) [date] => 2015-03-25 00:00:00.000000 [timezone_type] => 3 [timezone] => UTC ) ZenDate Object ( [tz:protected] => DateTimeZone Object ( ) [date] => 2015-03-25 00:00:00.000000 [timezone_type] => 3 [timezone] => UTC ) Day 2: Aranyaprathet ( Wed 25 Mar ) Today we start our journey with a drive out of the capital and through the Thai countryside to the border town of Aranyaprathet. There is a large border",
    "hasKeyColumn": true,
    "keyColumnIndex": 1,
    "headerRowIndex": 0
}