{
    "relation": [
        [
            "Categories",
            "Campus Safety",
            "Greek Life",
            "Clubs and Activities",
            "Great for these types of students",
            "Share any unusual traditions or locations on campus",
            "Bang for the buck",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "They have a great 24hour telephone and transportation service all across the campus!",
            "I plan to pledge Kappa Alpha Psi!",
            "Like any great university, there are endless opportunities and an overwhelming amount of clubs to join. And, if you don't find one you connect with--virtually impossible--then you can begin to start your own!!",
            "Those who are eager to learn, open to diversity, ready to time-manage and work on being a balanced student, prepared to work in both an individuality, and especially team-work oriented setting!",
            "None that I know of YET!!",
            "Brown's tuition is super high, which is probably subject to increase as a parallel of our current economic state. However, they do give scholarship money and provide an excellent curriculum, state-of-the-art facilities, world-class staff and friendly campus worthy of those hard-earned dollars!",
            "Other than explore the awesome east-coast culture of the diverse city of Providence, one can find much enjoyment in visiting nearby cities, like Boston or New York.",
            "According to my friends!",
            "According to my friends!",
            "According to my friends!",
            "Avoid the notion of having PERFECT ACT/SAT scores; instead, focus on being active in the community, maintaining a high GPA and balanced set of extra-curriculars that reflect your respective passion!",
            "Brown is an awesome and super-friendly, liberal institution! It has been my dream school for years based on it happiness ratio, unique curriculum and awesome student/staff relationship status and tenure!"
        ]
    ],
    "pageTitle": "Brown University Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Brown-University/reviews?_escaped_fragment_=/show/43069",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988650.6/warc/CC-MAIN-20150728002308-00023-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 893960707,
    "recordOffset": 893906876,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{249203=© 2015, Cappex.com, LLC, 107065=The food is good but it gets repetitive in the dining halls. The key is to use meal credits at other places like Joe's or the Blue Room. But you'll learn more about that when you arrive in September ;).}",
    "textBeforeTable": "07/12/2009 Reviewer is A current student here. 86 out of 87 people found this review useful. 1 of 57 Rachel from Redondo Beach, CA Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5",
    "textAfterTable": "Am learning a lot Brown University really emphasizes the learning experience for undergraduate students. With no core curriculum, students have the opportunity to explore courses in fields they would not have the opportunity to at other colleges. As a result, a student can obtain as specific or as broad an education as he or she chooses. Additionally, with the option to take courses for a grade, or pass/fail, Brown takes off the competitive pressure and simply encourages its students to try different things and put themselves out of their comfort zone without running the risk of damaging one's transcript and resume for graduate school education. But learning at Brown goes well beyond the classroom - almost all of which are taught directly by professors as opposed to teaching assistants, and which vary in size to accommodate all modes of learning. The extracurricular opportunities at Brown are incredible. There are a lot of service programs through the Swearer Center or other organizations, as well as many opportunities to learn about new subjects - whether that be through attending a guest lecture or debate, or just walking through the main green to see the displays. Login to rate or flag the reviews Matthew from Ludlow, MA 08/30/2009 Reviewer is",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}