{
    "relation": [
        [
            "Categories",
            "Campus Safety",
            "Greek Life",
            "Great for these types of students",
            "Bang for the buck",
            "What to do for fun",
            "Food and Dining",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "Many crimes have happened since I started attending.",
            "Nothing that I have seen.",
            "Students who need more personal help",
            "A lot of classes I needed for my degree were cancelled at the last limit & I could not take any alternatives.",
            "There is a rec room with table tennis, pool, TV to hook up your console",
            "Only three restaurants on campus. (Domino's, Subways, & La Fantina)",
            "Most of the teachers are caring & are willing to help you.",
            "If you want to get your AA in two years, go to classes full time & take some classes in the summer.",
            "Santa Fe is a typical community college. There are many things that can be frustrating about the place, but overall it is a good school."
        ]
    ],
    "pageTitle": "Santa Fe College Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Santa-Fe-College/reviews?_escaped_fragment_=/show/17168",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988650.6/warc/CC-MAIN-20150728002308-00252-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 920585839,
    "recordOffset": 920503653,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{471769=© 2015, Cappex.com, LLC, 456296=Santa Fe College is an excellent school to attend. Not only was Santa Fe College ranked 7th in 2013 for Top Colleges in the Nation, but it also has numerous associate and bachelor programs. Many professors and facility members at Santa Fe College are nice and willing to help students., 394750=Santa Fe College is a wonderful choice for students of all backgrounds and interests. There is an abundance of clubs to join and resources to use. Whether your heart is set on transferring to UF or you're going back to school for the first time since 1985, Santa Fe is a great way to get an education without putting a dent in your wallet., 213548=This school looks amazing. I will be attending Summer of 2013. Its conveniently located right outside of UF. Can't wait for tailgating during football season.}",
    "textBeforeTable": "07/09/2009 Reviewer is A current student here. 16 out of 18 people found this review useful. 1 of 113 Crystal from Florahome, FL Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5",
    "textAfterTable": "Tips for prospective students I am currently working at the Financial Aid office here,so the biggest advice I can give you is to keep up with your Financial Aid and scholarships make sure everything is set. Another thing is to have a good attitude, people are more willing to help you if you are kind to them. Bang for the buck Although it is not a University, there are programs here where you can earn a Bachelor's degree, and of course it's much cheaper. There is a food bank that gives food out every Wed. there is also a vegetable garden where they provide the products for you all you have to do is take care of your garden. Every so often there are events where they have free food and all you have to do is fill out a small survey. So there are MANY opportunites where you can save on food. Am enjoying being here I love the atmosphere here. There are many clubs that you can join. People are very nice, there are places that have couches and I've seen many people sleeping and no one bothers them, I've even sat on one of the couches and slept before my class starts. It's great!! If you're not one of those people that",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}