{
    "relation": [
        [
            "Patent application number",
            "20080207819",
            "20110065860",
            "20110077342",
            "20120077937"
        ],
        [
            "Description",
            "COMPOSITIONS BASED ON POLYVINYLIDENE FLUORIDE - The following composition is useful for the manufacture of pipes for conveying hydrocarbons extracted from off-shore or on-shore oil deposits:",
            "METHOD FOR PREPARING A BLEND OF HALOGENATED POLYMER AND OF COPOLYMER BEARING ASSOCIATIVE GROUPS - The present invention relates to a method of preparing a polymer resin based on a halogenated vinyl polymer and a copolymer bearing associative groups, comprising the steps that consist in forming a latex of each of these polymers, blending said latices, then isolating and drying the polymers contained in said latices in order to form a pulverulent resin. The present invention also relates to said resin, to a pulverulent composition containing said resin, and also to the use of this composition for manufacturing rigid or plasticized materials.",
            "METHOD FOR THE MULTI-STEP PREPARATION OF HALOGEN-CONTAINING COMPOSITE LATEX HAVING ASSOCIATIVE GROUPS - “The invention relates to a method for preparing a composite latex, including",
            "Method For Preparing A Suspension Of PVC Grafted Onto An Elastomer - The invention pertains to the field of PVC production. More particularly, the invention relates to a method for preparing a polymer including vinyl chloride monomers that are polymerized and grafted onto acrylic, styrene, and/or ethylene monomers polymerized in the form of an elastomer."
        ],
        [
            "Published",
            "08-28-2008",
            "03-17-2011",
            "03-31-2011",
            "03-29-2012"
        ]
    ],
    "pageTitle": "Pascal, FR - Patent applications",
    "title": "",
    "url": "http://www.faqs.org/patents/inventor/pascal-fr-5/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042985140.15/warc/CC-MAIN-20150728002305-00000-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 446333594,
    "recordOffset": 446317629,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Thierry Pascal, Charly FR 05-15-2014 PROPULSION DEVICE HAVING UNDUCTED COUNTER-ROTATING AND COAXIAL ROTORS - A propulsion device including an unducted upstream propeller and a counter-rotating and coaxial downstream propeller. At least one blade of the upstream propeller is configured to generate a corotating secondary vortex for acting upstream of the downstream propeller to destabilize a blade tip vortex of the same at least one blade. 20140133982 04-24-2014 BLADE, PARTICULARLY VARIABLE-PITCH BLADE, PROPELLOR COMPRISING SUCH BLADES AND CORRESPONDING TURBOMACHINE - A blade, configured to be mounted on a hub of a turbomachine propeller so that an empty space is defined between a base of the blade and a face of the hub facing the base. The blade includes a retractable blanking mechanism configured to reversibly occupy at least one of following two positions: a deployed position in which the retractable blanking mechanism at least partially closes off the empty space; and an extreme retracted position in which the retractable mechanism is kept out of the empty space. 20140112784 Published Description Patent application number Sebastien Pascal, Epouville FR 12-11-2008 Device for continuously mixing a food dough provided with two types of superimposed mixing tools and a side discharge - The invention relates to a device for continuously mixing ingredients of a flour-and-water-based food dough comprising two mixing tools rotatably mounted one above the other about an axis of rotation, wherein the top tools is",
    "textAfterTable": "Patent applications by Thierry Pascal, Charly FR Thierry Pascal, Oullins FR Patent application number Description Published 20150038659 PROCESS FOR PREPARING HALOGENATED POLYMERS - The invention concerns a process for the aqueous suspension, micro-suspension, emulsion or micro-emulsion polymerization of at least one halogenated monomer, in particular chlorinated, for example vinyl chloride, by itself or with one or more other vinyl monomers, preferably less than 50% by weight of one or more other vinyl monomers, in which at least one shortstopper and at least one perhalogenate, acting as a whitening agent, are added. 02-05-2015 Website © 2015 Advameg, Inc.",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}