{
    "relation": [
        [
            "Payment method",
            "",
            "Money Order/Bank cheque",
            "Personal cheque",
            "Other - See seller's payment instructions"
        ],
        [
            "Preferred/Accepted",
            "PayPal Preferred",
            "Accepted",
            "Accepted",
            "Accepted"
        ],
        [
            "",
            "",
            "",
            "",
            ""
        ]
    ],
    "pageTitle": "BV112 THE Very END Mercy Misery 2011 Sealed CD | eBay",
    "title": "",
    "url": "http://www.ebay.com.au/itm/BV112-The-Very-End-Mercy-Misery-2011-sealed-CD-/360419063291",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438044160065.87/warc/CC-MAIN-20150728004240-00073-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 417164251,
    "recordOffset": 417114027,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Payment details receiving cleared payment - opens in a new window or tab. Will usually post within 1 business day of Domestic handling time cleared payment- opens in a new window or tabEstimated delivery dates- opens in a new window or tab . Delivery times may vary, especially during peak periods. include seller's handling time, origin ZIP Code, destination ZIP Code and time of acceptance and will depend on shipping service selected and receipt of * Seller ships within 1 day after receiving cleared payment - opens in a new window or tab. Thu. 13 Aug. and Fri. 21 Aug. Estimated between Royal Mail International Standard (Small Packets) United",
    "textAfterTable": "Seller's payment instructions Hi, Thanks very much for buying. Paypal is preferred, but please go through check-out as soon as possible with your preferred payment method. I will also accept Sterling Cheques or Postal Orders in the post. Payment must be received within 7 days of purchase. Cheers Tony Current bid amount + + import charges (shown at checkout) time left ##2## left | Bid Count",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}