{
    "relation": [
        [
            "Patent application number",
            "20100330338",
            "20110059291"
        ],
        [
            "Description",
            "STRUCTURED MATERIAL SUBSTRATES FOR FLEXIBLE, STRETCHABLE ELECTRONICS - A flexible and stretchable patterned substrate is provided having a strain-permitting material comprising a patterned conformation that allows the flexible patterned substrate to experience local strain or local strain domains lower than the macroscopic strain of the flexible and stretchable patterned substrate.",
            "STRUCTURED MATERIALS WITH TAILORED ISOTROPIC AND ANISOTROPIC POISSON'S RATIOS INCLUDING NEGATIVE AND ZERO POISSON'S RATIOS - The invention described herein relates to structured porous materials, where the porous structure provides a tailored Poisson's ratio behavior. In particular, the structures of this invention are tailored to provide a range in Poisson's ratio ranging from a negative Poisson's ratio to a zero Poisson's. Two exemplar structures, each consisting of a pattern of elliptical or elliptical-like voids in an elastomeric sheet, are presented. The Poisson's ratios are imparted to the substrate via the mechanics of the deformation of the voids (stretching, opening, and closing) and the mechanics of the material (rotation, translation, bending, and stretching). The geometry of the voids and the remaining substrate are not limited to those presented in the models and experiments of the exemplars, but can vary over a wide range of sizes and shapes. The invention applies to both two-dimensional structured materials as well as three dimensionally structured materials."
        ],
        [
            "Published",
            "12-30-2010",
            "03-10-2011"
        ]
    ],
    "pageTitle": "Brian P. - Patent applications",
    "title": "",
    "url": "http://www.faqs.org/patents/inventor/brian-p-7/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042985140.15/warc/CC-MAIN-20150728002305-00013-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 441900655,
    "recordOffset": 441869502,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Brian P. Greviskes, Boston, MA US 11-12-2009 HEAT EXCHANGER SUPPORT AND METHOD OF ASSEMBLING A HEAT EXCHANGER - A heat exchanger that includes a heat exchanger core including a plurality of stacked tubes defining a fluid flow path, a housing substantially surrounding the heat exchanger core, and an elastomeric member positioned between the heat exchanger housing and the heat exchanger core and deformable to allow movement of one of the heat exchanger core and the housing relative to an other of the heat exchanger core and the housing in at least two substantially perpendicular directions. 20090277606 Published Description Patent application number Brian P. Gilner, Racine, WI US 11-13-2014 ANALYSIS AND DETECTION FOR ARHYTHMIA DRIVERS - Systems and methods are provided to detect and analyze arrhythmia drivers. In one example, a system can include a wave front analyzer programmed to compute wave front lines extending over a surface for each of the plurality of time samples based on phase information computed from electrical data at nodes distributed across the surface. A trajectory detector can be programmed to compute wave break points for each of the wave front lines and to determine a trajectory of at least one rotor core across the surface. A stability detector can be programmed to identify at least one stable rotor portion corresponding to subtrajectories of the determined trajectory. 20140336520 07-17-2014 FOCAL POINT IDENTIFICATION AND MAPPING - A method",
    "textAfterTable": "Brian P. Head, Calgary CA Patent application number Description Published 20140083694 Methods and Systems for Providing Steam - A system is provided for improved steam generation. The system includes at least two steam systems, wherein a wet steam output from a first steam system is passed through a first separator. The first separator configured to separate dry steam from condensate, and a piping connection is configured to blend the condensate with a boiler feed water stream at the inlet of a second steam system. 03-27-2014 20140083706 Methods and Systems for Providing Steam - A steam system is provided that includes a steam generator including boiler tubes that are modified to form a number of intermediate take-offs for removing water and steam from the boiler tubes. A number of intermediate separators are provided to separate the water and steam at each of the intermediate take-offs. Intermediate couplings are used to inject the water back into the boiler tubes downstream of each of the plurality of intermediate take-offs. 03-27-2014 Brian P. Henesey, Lansdale, PA US Patent application number Description Published 20120220432 SQUAT EXERCISE APPARATUS - A squat exercise apparatus for use with a hip belt comprising an elevated platform with a hole, a weight holder and a guide rod or other guide, as disclosed herein. The weight holder may be designed to hold free weights and to attach onto",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}