{
    "relation": [
        [
            "Cat No.",
            "POLY-70601",
            "POLY-70602",
            "POLY-70603",
            "POLY-70604"
        ],
        [
            "Description",
            "1LB Kit (approx. 1 Pint)",
            "2LB Kit (approx. 1 Quart)",
            "8.4LB Kit (approx. 1 Gallon)",
            "42LB Kit (approx. 4-1/2 gallons)"
        ],
        [
            "Price",
            "$ 28.00",
            "$ 43.00",
            "$ 123.00",
            "$ 449.00"
        ]
    ],
    "pageTitle": "Molding Rubbers",
    "title": "",
    "url": "http://uscomposites.com/moldmaking.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438044160065.87/warc/CC-MAIN-20150728004240-00262-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 254401542,
    "recordOffset": 254393340,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{5065=Mold Release Info: For releasing this rubber from a smooth non-porous original/plug an aerosol such as Poly-2300 or Stoner is suitable. Porous objects such as plaster, concrete or wood should first be sealed to create a smooth surface from which to apply the mold release., 59656=This fast setting casting resin creates a hard yet strong plastic for many uses. It can be tinted with any of our colored pigments, however color will be offset by the natural white color of the product. Extremely fluid for all types of casting. Favorable strength and low-brittleness. No Mold release is necessary for casting into silicone molds. Pol-Ease 2300 should be used as a release from polyurethane molds., 54314=DESCRIPTION: Hydrogel® is a dry white powder which when mixed with water at a 3 parts water to 1 part Hydrogel® weight ratio (approximately 1 water to 1 1/4 Hydrogel® by volume) yields a creamy mix with a 5 minute working time. Demolding can be done, with care, several minutes after mix can no longer be worked. Mold Release: Use petroleum jelly for skin contact or Poly-2300 aerosol spray for industrial parts.}",
    "lastModified": "Thu, 02 Jul 2015 18:23:07 GMT",
    "textBeforeTable": "Available in 2 Part Kits Info: A very soft and stretchable silicone rubber. No mold release is required, however when making a mold from a porous surface such as wood the surface should be sealed or painted to avoid possible sticking. Mixed 10 parts B to 1 part A Hardness, Shore A: 25 Pour Time: 60 min. Demold Time: 24 Hours Cured Color: Light Blue 70-25 Tin-Sil RTV Silicone Mold Rubber Consists of a liquid Part B base and Part A accelerator which after mixing at the proper ratio by weight, cure at room temperature to a flexible high tear strength RTV silicone rubber. All TinSil 70 Series mold rubbers are tin-catalyzed, condensation-cure systems. They are ideal for molds where easy release or high temperature resistance is needed. They are recommended for evaluation as mold materials for polyester, epoxy and polyurethane resins and waxes. Mold release is not required for casting parts in silicone molds. A mold release wax may be needed when pouring the liquid silicone rubber onto a porous substrate such as wood or plaster. Should not be used with silicone based",
    "textAfterTable": "Product Data Sheets 70-25 Product Bulletin Tinsil 70 Series -- MSDS 70-60 Tin-Sil RTV Silicone Mold Rubber Mixed 20 parts B to 1 part A Hardness, Shore A: 60 Pour Time: 30 min. Demold Time: 24 Hours Cured Color: Red This mold rubber is well suited for casting low-temperature melting metals such as pewter. This rubber has a lower tear strength compared to the 70-25 but can withstand higher temperatures upto 400 degrees. Info: A more rigid silicone rubber similar to the hardness of a pencil eraser. No mold release is required, however when making a mold from a porous surface such as wood the surface should be sealed or painted to avoid possible sticking.",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}