{
    "relation": [
        [
            "Property name",
            "cssText",
            "length",
            "parentRule"
        ],
        [
            "Type",
            "DOMString",
            "int",
            "CSSRule"
        ],
        [
            "Description",
            "Specifies the name of the CSS selector for the rule set.",
            "Returns the number of properties that have been explicitly set.",
            "Returns the CSSRule that contains this declaration block."
        ],
        [
            "Status",
            "writable",
            "read only",
            "read only"
        ],
        [
            "Support level",
            "DOM 2 Style",
            "DOM 2 Style",
            "DOM 2 Style"
        ],
        [
            "Availability",
            "4.6 or later",
            "4.6 or later",
            "4.6 or later"
        ]
    ],
    "pageTitle": "CSS and stylesheets API - JavaScript Reference - BlackBerry Browser - 7.0",
    "title": "",
    "url": "http://docs.blackberry.com/fr-fr/developers/deliverables/27297/DOM_Style_Objects_1180980_11.jsp",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438044160065.87/warc/CC-MAIN-20150728004240-00317-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 70663219,
    "recordOffset": 70634529,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{173349=Copyright ©  2013 BlackBerry, sauf mention contraire.}",
    "lastModified": "Thu, 16 Jan 2014 01:40:04 GMT",
    "textBeforeTable": "CSSStyleDeclaration properties Back To Top This object also provides access to the computed values of an element. It does not provide access to the specified or actual values of the CSS cascade. The CSSStyleDeclaration object represents a CSS declaration block consisting of CSS properties and their values. This object enables you to determine the style properties currently set in a block or to set style properties explicitly within the block. BlackBerry Device Software version 4.6 or later Availability Object: CSSStyleDeclaration Back To Top 4.6 or later DOM 2 Style read only Returns the type of rule, represented using a CSSRule constant. unsigned short type",
    "textAfterTable": "Back To Top CSSStyleDeclaration methods Method name Description Support level Availability getPropertyCSSValue() Returns the value of a CSS property as an object, if the property has been explicitly set. DOM 2 Style 4.6 or later getPropertyPriority() Returns the priority of a CSS property. DOM 2 Style 4.6 or later getPropertyValue() Returns the value of a CSS property as a string, if the property has been explicitly set. DOM 2 Style 4.6 or later",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}