{
    "relation": [
        [
            "Patent application number",
            "20080284502",
            "20090207109",
            "20090230881"
        ],
        [
            "Description",
            "CURRENT BIASING CIRCUIT - A current biasing circuit is provided, which is designed to suppress reference current drift caused by temperature variation with a low overall temperature coefficient of a constant-voltage circuit and at least one resistor. The constant-voltage circuit comprises a diode and/or a diode-connected transistor. This current biasing circuit is based on a current mirror architecture, is easy to implement, and is a relatively temperature-independent current source.",
            "CIRCUIT AND METHOD FOR DRIVING LIGHT EMITTING DIODES - A circuit and a method for driving light emitting diodes (LEDs) are provided. First, an input voltage is converted into an output voltage and the output voltage is transmitted to the anode terminals of LED strings. The output voltage is reduced when the output voltage is greater than a first threshold voltage and the output voltage is reduced when the lowest level among the cathode terminal voltages of all the LED strings is greater than a second threshold voltage. Thus, the output voltage can be maintained at a lower level for driving all the LED strings to reduce unnecessary power wastage.",
            "LED DRIVER AND CIRCUIT FOR CONTROLLING A POWER SWITCH TO PROVIDE A DRIVING VOLTAGE TO AT LEAST ONE LED - An LED driver circuit and its control circuit for controlling its power switch are provided. The LED driver includes a switch, a PWM controller, a current source and a signal controller. The switch has a first end outputting a driving voltage to at least one LED. The PWM controller provides a PWM signal. The current source provides a driving current flowing through the LED when a dimming control signal is asserted. The signal controller turns off the switch when the dimming control signal is de-asserted and relays the PWM signal from the PWM controller to the switch so that the switch is controlled by the PWM signal when the dimming control signal is asserted."
        ],
        [
            "Published",
            "11-20-2008",
            "08-20-2009",
            "09-17-2009"
        ]
    ],
    "pageTitle": "Chen, Tainan County - Patent applications",
    "title": "",
    "url": "http://www.faqs.org/patents/inventor/chen-tainan-county-4/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042985140.15/warc/CC-MAIN-20150728002305-00137-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 443275659,
    "recordOffset": 443246136,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Kai-Ji Chen, Tainan County TW 04-29-2010 WRITING INSTRUMENT - The writing instrument comprises a first hollow tube body, a second hollow tube body and a refill. The first hollow tube body comprises a passing hole. The second hollow tube body comprises a protrusion end to correspondingly, tightly fit with the first hollow tube body, and an air inlet at the other end. The first hollow tube body comprises scale holes, at least two semitone holes near the passing hole, first air outlets, the first air outlets being between the two semitone holes. The second hollow tube body further comprises a second air outlet. Via combination of the first hollow tube body and the second hollow tube body, different tones are generated by covering the scale holes and the semitone holes. The refill can be disposed into the writing instrument, and a nib of the refill can protrude outside of the writing instrument from the passing hole. 20100104351 Published Description Patent application number Jung-Kuang Chen, Tainan County TW 03-04-2010 VARIABLE DISPLACEMENT PUMP - A variable displacement pump includes a pump body defining first and second pools for introducing fuel/lubricant oil, and internal and external rotary members rotatably mounted on the pump body and cooperatively defining a space such that, during counterclockwise revolution, the fuel/lubricant oil is taken up from the first pool by sweeping of the space over the first pool, and is delivered to the",
    "textAfterTable": "Kuan-Hung Chen, Tainan County TW Patent application number Description Published 20100225822 DIGITAL RECEIVER AND METHOD THEREOF - A digital receiver includes an analog front-end circuit, an automatic-gain controller, a compensation circuit, and a demodulator. The analog front-end circuit receives an input signal, adjusts an average amplitude of the input signal, and converts the adjusted input signal to generate a digital signal according to a control signal. The automatic-gain controller is coupled to the analog front-end circuit for generating the control signal feedback to the analog front-end circuit according to the digital signal. The compensation circuit is coupled to the analog front-end circuit for detecting an average amplitude of the digital signal to generate a detecting result and for determining whether to compensate the average amplitude of the digital signal to generate a compensated digital signal according to the detecting result. The demodulator is coupled to the compensation circuit for demodulating the compensated digital signal to generate an output signal. 09-09-2010 Kuei-Hsiang Chen, Tainan County TW Patent application number Description Published 20080266469 LIQUIID CRYSTAL ON SILICON (LCOS) DISPLAY AND PACKAGE THEREOF - The present invention provides a LCOS display. The display comprises a first PCB, an interface module, a first silicon chip, and a flat cable. The interface module is disposed on the first PCB and used to receive an audio and video signal. The first silicon chip comprises a display",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}