{
    "relation": [
        [
            "Days",
            "30",
            "50",
            "150",
            "200"
        ],
        [
            "BSE",
            "6.62",
            "6.54",
            "7.43",
            "7.80"
        ],
        [
            "NSE",
            "6.65",
            "6.56",
            "7.42",
            "7.80"
        ]
    ],
    "pageTitle": "Rohit Ferro Tech Stock Price, Share Price, Live BSE/NSE, Rohit Ferro Tech Bids Offers. Buy/Sell Rohit Ferro Tech news & tips, & F&O Quotes",
    "title": "",
    "url": "http://www.moneycontrol.com/india/stockpricequote/mining-minerals/rohitferrotech/RFT",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042985140.15/warc/CC-MAIN-20150728002305-00272-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 601441399,
    "recordOffset": 601390652,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{204259=Rohit Ferro Tec is in the Mining & Minerals sector. The current market capitalisation stands at Rs 75.21 crore. The company management includes Suresh Kumar Patni - Non Executive Chairman, Rohit Patni - Managing Director, Dinesh Biyanee - Executive Director - Works, Jatindra Nath Rudra - Ind. Non-Executive Director, Ankit Rungta - Additional Director, Sujata Agarwal - Additional Director. It is listed on the BSE with a BSE Code of 532731 and the NSE with an NSE Code of ROHITFERRO. Its Registered office is at 35, Chittaranjan Avenue , Kolkata,West Bengal - 700012. Their Registrars are Maheshwari Datamatics (P) Ltd., 132277=JSWSteel Jul Fut, 202948=Astec LifeSciences Recommended on Mar 31st 2015, 131570=UnitedBrewerie Jul Fut, 131059=28 July 2015}",
    "textBeforeTable": "Edit Watchlist Have you invested in these stocks? You can track them better in your Portfolio close[x] Add to Watchist Account Optional Optional Optional Optional Add to Portfolio OR Add to watchlist } $('#mcpcp_addprof_info').hide(); { function close_info()",
    "textAfterTable": "Keep me signed in Forgot Password? New to Moneycontrol - Sign up now Its easy and FREE! Username Username should be atleast 4 characters Password Password should be 6 to 10 characters Confirm Password Email OR connect with LIVE",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}