{
    "relation": [
        [
            "U.S. Federal Penitentiary Atlanta",
            "Detained from 5/8/2002 - 10/24/2002",
            "601 McDonough Blvd. S.E. Atlanta, GA 30315-0182 (404) 331-2137"
        ],
        [
            "Clayton County Sheriff Department",
            "Detained from 10/25/2002-12/13/2002",
            "Overseer Sheriff Stanley Tuggle 9157 Tara Boulevard, Jonesboro, GA 30236 (770) 471-1122"
        ],
        [
            "Putnam County Sheriff Department",
            "Detained from: 12/13/2002 - 1/24/2003",
            "Solitary Confinement Overseer Sheriff Howard R. Sills 111 Ridley Drive, Eatonton, GA 31024"
        ],
        [
            "Jones County Jail",
            "Detained from: 1/24/2003 to 7/29/2003",
            "Solitary Confinement Overseer Sheriff Robert \"Butch\" Reece 123 Holmes Hawkins Drive, Gray, GA 30132 (478) 986-3489"
        ],
        [
            "Metropolitan Correction Center",
            "Detailed from: 8/14/2003 - 10/17/2003",
            "Overseer Warden R.M. Reish 150 Park Row, New York, NY 10007 (212) 417-7673"
        ],
        [
            "Glynn County Detention Center",
            "Detained from: 1/04/2004 to 1/25/2004",
            "Overseer Sheriff Wayne V. Rennett 1812 New Castle Street, Brunswick, GA 31520"
        ],
        [
            "FTC Oklahoma City Federal Penitentiary",
            "Detained from: 9/2004 to 10/2004",
            "Solitary Confinement Segregated Housing Unit (SHU) P.O. Box 88802, 7420 S. Mac Arthur, Oklahoma, OK 73189-8802 (405) 682-4075"
        ],
        [
            "U.S. Federal Penitentiary Leavenworth",
            "Detained from 10/2004 11/2004",
            "Solitary Confinement Segregated Housing unit (SHU) 1300 Metropolitan St, Leavenworth, Kansas 66048-125 (913) 682-8700"
        ],
        [
            "U.S. Federal SuperMax Penintentiary Marion, III",
            "Detained from 11/20/2004 - 03/02/2006",
            "Solitary Confinement Super Max Segregated Housing Unit (SHU) P.O. Box 2000, Marion, Illinois 62295 (618) 964-1441 (719) 784-9454"
        ],
        [
            "United States Penitentiary Florence ADMAX",
            "Detained from: 03/02/2006 to present",
            "Supermax Segregated Housing Unit (SHU) P.O. Box 8500, Florence, Colorado 81226-8500 (719) 784-9454"
        ]
    ],
    "pageTitle": "The United Nuwaubian Nation of Moors of the Creek and Washitaw Mound Builders, offering Facts about the Dr. Malachi Z. York illegal case, the Chief of the Yamassee Nuwaubian Native American Moors of the Creek Nation",
    "title": "",
    "url": "http://nuwaubianfacts.com/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438044160065.87/warc/CC-MAIN-20150728004240-00157-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 174411575,
    "recordOffset": 174274129,
    "tableOrientation": "VERTICAL",
    "TableContextTimeStampAfterTable": "{507354=Detailed from: 8/14/2003 - 10/17/2003  , 272254=WHY is Judge Royal so concern about Malachi York's legal rights when Dr. York filed a Pro-se motion but in the New Trial hearing Judge Royal helped Attn. Jonathan Marks take away the New Trial and Judgment of Acquittal Motions and they both didn't state way these 2 Motions should be withdrawn a blatant sabotage from Judge Royal to clean the errors of the court and the prosecution read this court transcript on page 22 you will see defense attorney Jonathan Marks say when the judge asked do he have anything further an Mr. Marks said NO  now here comes the cleaning up the errors of the judges and the prosecution with the sabotage of the Judgment For Acquittal, we want you to pay close attention to judge Royal introducing this sabotage of this motion, for one he acts like he didn't know who filed the motion and what was the status of the motion, then the prosecutor Mr. Moultrie cleared it up and said the motion was filed by Adrian Patrick, if the judge didn't know the status of the motion which is right in front of him and he didn't hear no arguments on the motion why play the mind game he knew, that's why he introduce it on the record. Let's continue on page 23 the prosecutor Mr. Moultrie add in on the sabotage when he said that he BELIEVE that both of the motions that attorney Adrian Patrick filed which were ( Motion for new Trial and Motion for judgment of Acquittal) were withdrawn by Mr. Marks again Mr. Moultrie say I BELIEVE what is this courtroom setup for? with all these I think so-s where is the facts, we will tell you in one word (suppressed) by the judges. This hearing was suppose to be about a New Trial Motion that Mr. Marks filed because of New Evidence ( a recanting witness Ms. Abigail Washington lead witness for the government came forth to tell the truth and that was she lied at trial and so did the other alleged victims) not to withdraw Trial Error Motions this hearing had nothing to do with the errors the court and prosecution made at the trial. Judge Royal introduced this sabotage in this post-trial hearing to help keep the Chief of the Yamassee locked up with these lies, we want you to notice that Mr. Marks didn't officially take back the motion for judgment of acquittal he just answered the judge on line 7 is a typo or it was done deliberately by court stenographer after the Yes Sir, the judge ask Mr. Marks ( did you hear what I said?) There's a motion for judgment of acquittal that apparently was filed by Mr. Patrick. I know you withdraw his motion for new trial. I ASS U Me (QUES: WHY IS THE JUDGE ASSUMING A MAN LIFE IS ON THE LINE HERE?) that you're withdrawing that one too, but I mean I'm--. Mr. Marks then answer the judge yes Sir, what for? (did you hear what I said? or withdrawing the judgment of acquittal motion) this is not the proper way to withdraw a motion on the record (yes Sir) the judge withdrew the motion himself. A judge suppose to be there to help protect the Constitutional Rights of the accused not aid in illegally withdrawing motions so the accused can't win on appeal we see your action C. Ashley Royal and they don't display the role of a judge, but an accomplice in this miscarriage of justice. read the transcript  Download .                                                                                                                                  On August 31st 2004, Judge Royal issued his order on the Pro-Se motion with errors. Judge Royal never cited law, rule or procedure to back his ruling. Judge Royal stated that the defendant was in error by filing pro-se motions. This was addressed by Adrian Patrick on November 9th 2004 below. Download Judge Royal's order on Malachi York's Pro-Se motion Download       , 40190=Her testimony on the Montel Williams show shows that she is (Disgruntle) wrote letters according to Sheriff Sills about children being molested but, according to Pauline on the Montel Williams show she did not see no one being molested, she said, \"that she saw children coming out of his house and she was getting this weird feeling in the pit of her stomach an according to her these pit feelings was her reason for writing the letters  (She's Disgruntle) pay close attention to her statements on the show, now keep in mind that according to Pauline she was put out and sent to spring valley in 1991 and that is upstate New York not  on the Yamassee property in Georgia you do the math on when she wrote the anonymous letter to sheriff Sills of Putnam County. Anonymous what is it? ANONYMOUS   a·non·y·mous/əˈnänəməs/Adjective: 1.(of a person) Not identified by name; of unknown name. 2.Having no outstanding, individual, or unusual features; unremarkable or impersonal.  Why hide if children was being harmed, keep in mind that Pauline have children by Malachi York and was put out and sent away from his presence so she became disgruntle look at her expressions. Pauline did not live on the Yamassee property in Georgia, she followed behind Dr. York out of anger these are the facts.   view the show, 405783=GEORGIA INFORMER - November 2003 Issue, 479994=Judge Royal then ruled on the motion for a psychological evaluation to make sure the defendant was competent to stand trial.  This motion was put in on July 7, 2003 A.D.  by Attorney Edward Garland and Attorney Manny Arora to have  their client evaluated due to Dr. Malachi Z. York's claim of sovereignty and being a secured party. , 450347=Did Malachi Z York ever use the name Dwight? Yes as a mockery to the author of that book seek out the book an find the facts, In a book that Dr. York wrote in 1988 THE ANSAAR CULT Rebuttal to the Slanders. We have it and explains the whole family tree on his father's side., 508394=Detained from: 9/2004 to 10/2004  , 139244= FROM 9:30 AM - 5:30 PM, 123880=Your Honor, with all due respects to your government, your nation, and your court, we the indigenous people of this land have our own rights, accepted sovereign, our own governments. We are a sovereign people, Yamassee, Native American Creeks, Seminole, Washitaw Mound Builders. And all I’m asking is that the Court recognize that I am an indigenous person. Your court does not have jurisdiction over me. I should be transferred to the Moors Cherokee Council Court in which I will get a trial by juries of my peers. I cannot get a fair trial, Your Honor, if I’m being tried by the settlers or the confederates. I have to be tried by Native Americans as a Native American. That's my inalienable rights, and it’s on record.\" Malachi York stated on June 30th 2003 in front of federal judge Hugh Lawson. read more of the June Transcripts and see the prejudice of the court against the Indigenous peoples rights click here, 204797=ASK YOURSELF WHY THE SO-CALLED ADMINISTRATION DIDN'T ASK THE SO-CALLED ATTORNEYS TO PUT IN A MOTION FOR AN APPEAL FOR THE 2255 MOTION ?, 433567=Maku Black Thunderbird Eagle is the true Chief of our tribe and the government knows this to be the FACTS, this is why the government agents inside of our tribe is trying to lead the tribe off the true path read our constitution declared 1992 this is real, 335507=Case 5:02-cr-00027-CAR Document 382 Filed 06/27/2007 Page 3 of 12 learning that on 41 separate occasions, multiple deposits totaling more than $10,000 were made to one or more of the Petitioner’s bank accounts. At trial, the government presented evidence designed to prove that deposits made on September 29 and 30, 1999; October 6 and 8, 1999; and April 5 and 11, 2000 were designed to evade currency reporting requirements. read moor, 200160=DFACS takes custody of 5 Nuwaubian children Macon Telegraph May 10, 2002 By Rob Peecher read moor  , 288772=U.S. District Judge Duross Fitzpatrick of the Middle District of Georgia signed a dismissal order last week with the agreement of the plaintiffs and the Putnam County Board of Registrars in 04-11-2001. The judges in the Middle District of Georgia all know about the Nuwaubians., 127680=WE LIKE TO LET THE WORLD KNOW WE TOOK OUR CHILDREN TO A MEDICAL DOCTOR IN MACON GEORGIA WHEN WE HEARD THESE FALSE ALLEGATIONS OF CHILD MOLESTATION AGAINST MALACHI YORK, KATHY JOHNSON, KHADIJAH MERRIT AND CHAUNDRA LAMPKIN AN ALL OF OUR CHILDREN RECEIVED A CLEAN BILL OF HEALTH, THE PHYSICIAN ALSO SAID, \"THESE WERE THE HEALTHIEST CHILDREN THAT SHE HAS EVER HAD THE PLEASURE TOO EXAMINE\", DON'T BELIEVE US CHECK IT OUT FOR YOURSELF Patrice Sapp, MD Family Medicine Macon, GA Physician 777 Hemlock St Macon, GA 31201 Phone: (478) 745-6575, 136820=THE COINTELPRO AGENTS AND THE EVILONES' AGENTS EXPOSED BY OUR CHIEF BLACK THUNDERBIRD EAGLE A/K/A DR. MALACHI Z YORK EL, ON MARCH 6 2004 IN THIS AUDIO BELOW OUR CHIEF SAID, \" THAT HE IS A CITIZEN OF CLARK COUNTY GEORGIA, HE VOTED IN CLARK COUNTY GEORGIA, HIS SOCIAL SECURITY IS REGISTERED IN CLARK COUNTY GEORGIA, HIS CAR REGISTERED IN CLARK COUNTY GEORGIA, HE BROUGHT A HOUSE IN CLARK COUNTY., 507874=Detained from: 1/04/2004 to 1/25/2004  , 485107=Articles that were passed out in 2004, 178423=AND OUR CONSTITUTION IN 1992 TO PRESENT TO THE WORLD. THIS IS INTERNATIONAL NOT JUST NATIONAL AND 1999 DATES SHOWS THE ACTIONS IN OUR MAKU'S MIND SO DON'T LET THE GOVERNMENT AGENTS OR THE EVIL-ONES AGENTS TRICK YOU, 263689=ANS: Dr. Malachi Z. York was held at the Metropolitan Correctional Center in New York, New York , for this psychological evaluation for over 60 days , from August 14, 2003 - October 20, 2003 A.D. and let us remind you this is not a Federal facility for a psychological evaluation, this goes to show the world that this was another, 459796=Order of Garwalolu Entry of Appearence 8-28-08.pdf, 508909=Detained from 10/2004 11/2004  , 44473=Dr. York for child support back in May 23, 2000 A.D. before this conspiracy and according to the prosecution lead witness Abigail Washington this CONSPIRACY started in the middle of 2001 A.D., view her RECANTMENT VIDEO and read the timeline of events [read this], 423154=Atlanta Journal-Constitutuion/May 14, 2002 By Bill Osinski, 523378=Did the government really want Dr. Malachi Z. York arrested for child molestation?  According to an article, \"In 1998 Sills and other Putnam county officials received letters that York was molesting children.\"  But why did they wait four years to arrest him?  Was DFCS (Department of Family & Children Services) informed of these allegations? Ans: NO, and why wait 4 years?, 140857=Order of Garwalolu Entry of Appearence 8-28-08.pdf, 206374=THESE KIND OF ACTIONS BY THE CONFEDERATE SETTLERS IS NOT NEW WE RECALL 1921, 113641=Judge Royal then ruled on the motion for a psychological evaluation to make sure the defendant was competent to stand trial.  This motion was put in on July 7, 2003 A.D.  by Attorney Edward Garland and Attorney Manny Arora to have  their client evaluated due to Dr. Malachi Z. York's telling his supposed attorneys of his sovereignty and being a secured party., 249707=When you read Abigail Washington's' recantment testimony on 08/13/2004 she admits that she knew she had perjured herself and the judge at the closing of her testimony said thank you, when the judge is the prosecutor there is no fair trial read the new trial transcript Downloads/newtrialhearing.pdf, 149481=07-22-2001, the Yamassee have been doing good things all over the U.S. this is not new but, it shows that the media like to pick on the Dr. Malachi Z York and the Nuwaubians and that we were in 2001 trying to purchase the Shriners temple in Macon Ga. read the article below., 515373=P.O. Box 8500, Florence, Colorado 81226-8500, 292980=MAY 8,2002 KIDNAPPED TO NOV,21 2003 SUPERSEDING INDICTMENT, 462534=Yamassee letters of intent idc-001625.pdf, 356605=1992 With Dr. York teaching of the coming of the Holy Tablets, which is the scroll of eyes read the Holy Tablets chapter 19 tab.6:279, 175835=WHEN YOU MIX THE TRUTH WITH LIES YOU PRODUCE LIES SO WHEN READING THE ARTICLES WITH 215/1993 WE WANT YOU TO REMEMBER THE COINTELPRO AGENTS HAD TO MIX THE TRUTH IN WITH THEIR LIES TO FOOL THE FAMILY TRIBAL MEMBERS AND THIS ALSO GOES FOR THE LIBERIAN DIPLOMAT ISSUE, WE REITERATE CHIEF BLACK EAGLE IS NOT A LIBERIAN CITIZEN OR A LIBERIAN DIPLOMAT THESE ARE LIES FABRICATED BY GOVERNMENT AGENTS HERE IS WHAT OUR CHIEF SAID ABOUT GOING BACK TO AFRICA LISTEN FOR YOURSELF., 301953=Pauline Rogers and Sakina Parham in 2000 A.D. was meeting with Bill Osinski to help setup Dr. Malachi York the Chief of the Yamassee, 509421=Detained from 11/20/2004 - 03/02/2006  , 383769=Malik Shabazz 1250 Connecticut avenue, N.W. Washington, D.C. 20036 (202) 408-7021, 223753=Attorney claims bias by judge in York case Macon Telegraph/January 9, 2004 By Wayne Crenshaw, 480717=Upon Judge Royal's order, Dr. York was moved all the way to New York city to be evaluated by a Dr. William J. Ryan.  Prior to this, while Judge Lawson was still presiding, Dr. York had already been evaluated by a Dr. Sachy.  The order stated that Dr. York was only to be in New York for at least 30 days and at most 45 days.  However, Dr. York was transferred to New York on August 14, 2003 A.D. and was not returned to Jones County, Georgia until October 20, 2003 A.D.  This is way beyond 45 days; in fact it is 68 days.  It is important to point out that this is the reason Dr. York sought further representation from Attorney Frank Rubino, who upon hiring, put in motion on July 15, 2003 A.D. to withdraw the motion for psychological evaluation. , 189339=In many of the statements given to the FBI, the alleged victims graphically illustrate that they were injured and bleeding after the alleged abuse. Common reasons for individuals, seeking medical attention are pain and bleeding. The alleged victims state they were being sexually abused every day, all day, night and day, by an adult male. Now with that being said, they would have had injuries that would have lead to emergency medical treatment. When these alleged victims were examined by the GOVERNMENT'S OWN DOCTORS, they had no signs of scars from any anal or vaginal penetration. They had no signs of anal sexual intercourse at all. NO SCARS! NO INJURIES!, NO SUPPORTING MEDICAL EVIDENCE! And the Prosecutors knew this back as early as August 2002 of last year when all the test results came back. MEDICAL RECORDS DON'T LIE! This is the evidence that Prosecutors were wanting to block. They didn't want the public to know that: 1. They have no physical evidence to support the charges; No video tapes, No pictures; 2. They have no medical evidence to support the charges 3. All they have is triple hearsay., 266222=Only the tactics changed not the faces... Today we are still oppressed by people who are inescapably linked genetically to their murdering ancestors, searching endlessly worldwide to find any excuse to kill, or hunt just for sport. 1916, Anthony Crawford of Abbeville, S.C., a black cotton farmer who owned 427 acres of prime land and started a black school in the area and a union for Nubians (blacks). He was stabbed in the back, beaten by over 200 white men (Amorites) , who placed a noose around his neck, dragged him 3 blocks to the fairgrounds , where they lynched and then shot him over 200 times, because a white man (Amorite) did not want to pay his price for his cotton. His family was vanished, his land was stolen divided or sold. The associated Press has documented over 60 violent land takings by whites (Amorites), 458002=PRESS RELEASE APRIL 25, 2004, 450147=On May 8, 2002 an arrest warrant was issued for Dwight D. York on 404 Shady Dale Rd. , 171965=Flier July 9, 2003 What do 215/1993 mean? read moor, 78609=Did the government really want Dr. Malachi Z. York arrested for child molestation?  According to an article, \"In 1998 Sheriff Sills and other Putnam county officials received letters that York was molesting children.\"  But why did they wait four years to arrest him?  Was DFCS (Department of Family & Children Services) informed of these allegations? Ans: NO, and why wait 4 years?, 460156=photos outside the court house 12-30-2003, 173654=THE NUMBER 215/1993 DO NOT REPRESENT OUR TRIBE THE YAMASSEE MOORS AS A WHOLE, YES WE ARE MARRIED INTO THE WASHITA AND DID HAVE AGREEMENTS AND TREATIES WITH THEM SO, WHEN YOU SEE ARTICLES ON THIS WEBSITE WITH THE NUMBER 215/1993 IT IS TOO POINT OUT THE COINTELPRO MOVES TO HELP THE GOVERNMENT LIKE SHERIFF SILLS AND THE MEDIA MAKE STATEMENTS THAT THE NUWAUBIANS IS PUTTING OUT FALSE DOCUMENTS TO TRY TO GET DR. YORK OUT OF JAIL. THE BROTHER DERRICK SANDERS AND HIS GROUP MT. ARAFAT IS ALL IN THE NEWS GOING AGAINST THE GOVERNMENT WHICH IS NOT WHAT THE REAL YAMASSEE ARE ABOUT, WHEN YOU READ THIS WEBSITE YOU WILL SEE THE U.S. GOVERNMENT IS AGAINST THE YAMASSEE NUWAUBIAN MOORS OF THE CREEK NATION AN IT IS OUR JOB TO SHOW THE WORLD THE UNJUST TREATMENT THAT WE'RE GOING THROUGH WITH THESE FACTS., 171684=Wahee, Nuwaubia, Altamaha -The Real Petition #208/1999, 239176=ANS: TO HIDE THE FACTS, On December 16, 2003 A.D. Judge C. Ashley Royal stated in a public hearing that he would seek to have the court room closed to the public during the trial, yet he would allow only the media to be present in the court room, which is a violation of Dr. Malachi Z. York’s 6th Amendment right granted by the Constitution of the United States of America and a violation of the drafted Declaration of Human Rights for the United Nations., 506314=Detained from: 12/13/2002 - 1/24/2003  , 141472= ON MAY 8TH 2002 A.D. AN NEITHER OF THIS SISTERS SAID DR. YORK STATED THAT HE WAS A LIBERIAN DIPLOMAT OR PRESENTED A DIPLOMATIC PASSPORT TO THE GOVERNMENT AGENTS MORE PROOF OF THE LIES EXPOSED, 280554= DON'T INCLUDE PAULINE ROGERS SHE DID NOT TESTIFY AGAINST MR. YORK, SHE'S THE ANONYMOUS LETTER WRITER ACCORDING TO WHAT WAS SAID ON THE MONTEL WILLIAMS SHOW, PLEASE GO VIEW THE MONTEL WILLIAMS VIDEO PAULINE ROGERS SAID SHE DIDN'T SEE NO CHILDREN BEING ABUSED, SHE SAID SHE SAW CHILDREN COMING OUT OF MALACHI YORK'S HOUSE THEN SHE SAID, \"SHE HAD A WEIRD FEELING IN THE PIT OF HER STOMACH\" SO, SHE WROTE AN ANONYMOUS LETTER THAT STARTED THE LIES IN THIS CASE, AS FOR THE REST NICOLE LOPEZ AND DAVID NOEL ARE BROTHER AND SISTER THEY WERE RAISED IN THE COMMUNITY THEY WERE NEVER MOLESTED, THEIR MOTHER BARBRA NOEL HAVE CHILDREN BY MALACHI YORK AND WAS PUT OUT BY THE SISTERS IN THE COMMUNITY SO, YES SHE BECAME DISGRUNTLE AND WAS UP ON CRIMINAL CHARGES FOR WELFARE FRAUD SO THE CHILDREN WERE USED TO GET HER OUT OF TROUBLE, SAKINA PARHAM WAS NOT RAPED SHE TOLD THE WORLD SHE WAS MALACHI YORK'S RIGHT HAND AND SHE HAVE A SON BY MALACHI THAT HER AND PAULINE WERE SEEK CHILD SUPPORT IN 2000 A.D. READ THE TIME LINE,, 19731=CLICK THE PICTURES ABOVE FOR OUR CONSTITUTION THAT HAVE BEEN IN EFFECT SINCE 1992 A.D., 303084=1992 Our Constitution and Laws was drafted and the United States Government has broken the Yamassee Constitution and Laws and the Treaties., 435071=Medical Evidence Don't Lie, Dr. Malachi Z York was tested on 10/15/2002 No Diseases, 172313=THE NUMBER 215/1993, 380485=Ques: If Dr. Malachi Z York was a Liberian Diplomat since 1999, why was he still paying Federal Income Tax? read moor, 506834=Detained from: 1/24/2003 to 7/29/2003  , 364809=SEVEN DAYS EVICTION  - The Nuwaubians have lived on 476 acres of land they purchased back in 1992. But in 2004 The Federal government seized the land and the Nuwaubians were forced to moved out. They were given only seven days notice to vacate their property. Macon Telegraph photographer Nick Oza visited the land after their eviction and took several photos. According to Oza, Nuwaubians moved in such a hurry that many of the children's bikes and toys were left behind. [read moor], 406567=There is one very important aspect the Prosecutors in the unjust case against Dr. Malachi Z. York would like to stay hidden from the public, it is the fact the the Medical Evidence Supports the Innocence of Dr. Malachi Z. York. Child molestation cases involve accusations made by the alleged victim and or guardians, which lead to an investigation and collection of supporting data to either confirm or refute the alleged claims. Putnam County Sheriff Howard Richard Sills stated in court that he received an anonymous letter allegedly accusing Dr. Malachi Z. York of child molestation in 1998. In the Union Recorder dated 5/16/2002. Sheriff Sills is quoted as saying: \"The reason York was not arrested in 1998 when letters were first sent is simple, Sills said. There was not enough evidence to bring a conviction, he said\"., 324736=Trial Nears For Sect Leader Facing Child Sex, Racketeering Charges Rob Peecher, MaconTelegraph.com, Dec. 29, 2003 read moor, 75941=John 8:32 \"And ye shall know the truth, and the truth shall make you free.\", 150379=Can Maku Get A Fair Trial July 2003 Article, 144134=THEY SAY MALACHI SAY GO TO LIBERIA OR GHANA (DON'T BELIEVE THEM) THEY SAY ITS ABOUT THE BLUE LODGE AND THE SHRINERS (DON'T BELIEVE THEM) MALACHI WROTE BOOKS CALLED SECRET SOCIETIES UNMASKED, LEVIATHAN 666, THE YEAR 2000 AND WHAT TO EXPECT AND THE MILLENNIUM SCROLLS TALKING ALL ABOUT THESE DAYS AND TIMES AND ITS IN THE SCRIPTURES OUR CHIEF HAS ALWAYS GUIDED AND PREPARED US WITH RIGHT KNOWLEDGE. 27 For as the lightning cometh out of the east, and shineth even unto the west; so shall also the coming of the Son of man be., 369229=Before pleading guilty, York was in custody at the Putnam County Sheriff's Office where he received fewer letters but still more than average, according to administrative assistant Teresa Slade. York was in the Putnam County jail Jan. 6-24 when he pleaded guilty and was transferred to Jones County. In those 18 days, York received money from three or four visitors totaling $230. This is where they deprived Dr. York to make a guilty plea under DURESS., 186474=This is an excerpt from a news article in the Macon Telegraph in 07-22-2001, the Yamassee have been doing good things all over the U.S. this is not new but, it shows that the media like to pick on Dr. Malachi Z York and the Nuwaubians read the article, 26566=For all who think that the Yamassee tribe is something new, this emblem was being worn in 1993 by tribal members, giving honor to MAKU, 18310=KIDNAPPED MAY 8, 2002 A.D. BY THE, 107901=The 2255 Motion submitted  June 26, 2007 the government is up to its TRICKS again, read the initial filing of the 2255 and you will see the motion that was denied don't address these issues... [read moor], 509941=Detained from:  03/02/2006 to present, 446109=http://www.talkshoe.com/tc/112845, 323897=Excerpt taken from an article written in the Eatonton Messenger on 9/30/1999, 65176=Ans: Saul, shaool, Paul was an FBI agent who infiltrated Yashu'a, Isa, Jesus' followers just like they do today. They infiltrate the organization and if they can't topple the leader physically, then they get into the organization, pretend to be members and destroy it from the inside like they did many groups and leaders of this day and time. Some examples are Marcus Garvey, Noble Drew Ali, Clarence 13X, Elijah Muhammad, Yahweh ben Yahweh, ect. (refer to Are there Black Devils Scroll #358 by Dr. Malachi Z. York 33/720 degrees). You know the tactic: people join the organization and pretend to be devotees, work their way up under the leader, get the confidence of his people and then pervert the doctrine, change things around, cause confusion, diversion, and conflicts amongst the followers until the original teachings become all but lost in lies. This is Saul, Shaool, Paul's tactic, to fool the elect just as Yashu'a, Isa, Jesus mentioned in Matthew 24:24, \"For there shall arise false Christs, and false prophets, and shall show great signs and wonders; insomuch that, if it were possible, they shall deceive the very elect.\" You have been fooled. Saul, Shaool, Paul even has Negroids thinking that they are Gentiles. The letter P comes from B in Semetic language as in Saul became Paul., 228754=ANS: IN THIS VIDEO in JAN. 24,2003 YOU WILL HEAR THE STATE JUDGE EXCEPT THE PLEA AGREEMENT BETWEEN THE PROSECUTION AND MALACHI Z YORK SO FOR ALL THE PEOPLE THAT IS LYING TO THE WORLD ABOUT MALACHI YORK'S NAME IT IS (MALACHI YORK) UP UNTIL THIS HEARING MALACHI YORK AND KATHY JOHNSON MAINTAINED THEIR INNOCENCE the plea was made under duress, THE FEDERAL GOVERNMENT ALLOWED THE STATE GOVERNMENT TO MOVE MALACHI YORK INTO SHERIFF SILLS CUSTODY FROM 12/13/2002 TO 1/24/2003 SO MALACHI CAN BE TORTURED INTO THE BOGUS PLEA AGREEMENT and as soon as this agreement was made the state government aired this video on youtube.com DO YOU SEE THE TACTICS THE CONFEDERATES WERE USING TO DEFAME THE NATIVE AMERICAN CHIEF BLACK EAGLE., 196796=HERE IS DAVID NOEL THE BROTHER OF NICOLE LOPEZ WHO TESTIFIED AGAINST MALACHI YORK AT TRIAL AND WENT ON THE DR. PHIL SHOW ATTENDING THE 2009 NUWAUBU BALL HUGGING DR. YORK'S DAUGHTER HAGAR YORK AND APOLOGIZED FOR LYING ON HER FATHER AN AS YOU KNOW OUR PEACEFUL NATURE WE FORGAVE HIM. DAVID WAS RAISED AS OUR LITTLE BROTHER, IF DR. YORK MOLESTED HIM HE WOULD NOT FEEL SAFE AROUND THE FAMILY THIS GOES TO SHOW THE WORLD THAT THIS CASE IS ABOUT DISGRUNTLE EX-MEMBERS THAT WERE BROUGHT TOGETHER TO BRING THIS ILLEGAL CASE AGAINST, 52675=2255 motion [read], 383960=Gregory L. Lattimer Law Offices of Gregory L. Lattimer 1100 H Street, N.W.Suite 920 Washington, D.C. 20005 (202) 638-0095  (202) 638-0091 (Fax) lattlaw@aol.com, 377883=A Letter From Consulate in Atlanta, Dr. Walter Young Honorary Consul General April 2005 look in 2004 they was dealing with Washington D.C. the top Liberian contact in the U.S. Why go back to Atlanta without proper Documents  (Cointelpro) we see your plots., 533364=everyone can see that this government violated all their own laws that they had set up in 1776 A. D. and continue to do so at the expense of the people that was here before their laws, 98179=look in Aug. 2004 they was dealing with Washington D.C. the top Liberian contact in the U.S. Why go back to Atlanta without proper Documents  (Cointelpro)  WAKEUP, 468193=august_19_2004.pdf, 267208=[ of coarse hundreds were not documented] against Nubians (blacks). 2002 in the dairy farm land of Putnam County Ga. there is a secret order of confederate judges, lawyers, building inspectors, and especially the sheriff. Sheriff Howard Richard Sills plotted to steal the Yamassee Nuwaubian Sovereign land. Leading Brutal ambush, kidnapping, torture, and the most inhumane imprisonment and abuse ever of a Native American Chief (Black Thunderbird Eagle) A/K/A Dr. Malachi Z York EL in this country. This indigenous tribal leader was sentence to 135 years on only hearsay allegations of sexual abuse. Started by the hate filled and racist sheriff Sills, who aligned himself with over 300 to 400 hundred heavily armed federal and state agents and deputies. He used these allegations as an excuse to justify invading the beautiful 476 acres of the Yamassee Sovereign land , with 3 lakes, hills, and a stream. Finding no evidence of anything illegal and was well aware that Dr. Malachi Z York EL resided in Athens Ga. 50 miles away and had no legal ties to the property at 404 Shady Dale Rd in Eatonton Ga. What was the purpose? It only confirms their evil intentions was always too steal the Yamassee land. Leaving the children homeless, hundreds of women, elders and children totally abandon. No services or support offered, get out of Eatonton was always the cry from sheriff Sills. All this is justified because of never proven allegations of child abuse.. No bail from the start, No adequate counsel, they changed his name to Dwight D York sealed all the documents like, search warrants, affidavits, alleged victims statements you name it and then bounced Dr. York around to over 10 prisons, until finally sent him to the worst prison in the United States of America the Super Max Prison in Florence Colorado. This is the true story from Ocmulgee Court systems of middle Georgia to a secret guarded court down the road in Brunswick Ga., 208649=Articles that was pass out in 2004 please read, 337646=May 23, 2000 - Pauline Rogers become the second of two women to file child support actions claiming York is the father of her son and daughter.  Though a summons was issued, York never appeared in court, and Rogers later dropped the action.  The other woman, Sakina Parham, filed her action through the state Department of Human Resources' child support recovery office.  Her action claims York is the father of her son.  Parham still has an action pending., 360652= Join us every Friday, Saturday and Sunday @11:00 pm eastern time 646-716-4678, we will be discussing the Federal pretrial and post trial transcripts, what we ask everyone to do is study the legal documents and come on the show with your question and we will present the facts from the transcripts and our personal experiences with being around from the beginning of this case and knowing Dr. Malachi Z York for 30 plus years and knowing all the alleged victims., 466178=does-the-zoning-ordinance-of-1997.pdf, 383170=These 3 Attorneys helped sabotage the 2255 when they added Liberia in this case, 415025=After reading the court transcripts dated Dec. 16, 2003 guest what, another investigative lawyer found that the government charge Mr. York with (RICO), why? Because of SIX money deposits., 505796=Detained from 10/25/2002-12/13/2002  , 296842=SEVEN DAYS EVICTION  - The Nuwaubians Yamassee have lived on 476 acres of land they purchased back in 1992. But in 2004 The Federal government seized the land and the Yamassees were forced to moved out. They were given only seven days notice to vacate their property. Macon Telegraph photographer Nick Oza visited the land after their eviction and took several photos. According to Oza, The Yamassee moved in such a hurry that many of the children's bikes and toys were left behind, we are not stupid we know the Sheriff Sills is a Racist Bigot and wanted to kill our children so, yes we left before our children was harmed because this case is not about molestation or money structuring., 27812=9 property owners read this article back in 2000 A.D., 163985=THE SO-CALLED DEFENSE ATTORNEYS ED GARLAND, SAMUEL AND LOEB LAW FIRM OUT OF ATLANTA, JONATHAN MARKS OUT OF NEW YORK, MALIK SHABAZZ, GREGORY LATTIMER OUT OF WASHINGTON D.C. WITH REGINALD GREENE OUT OF ATLANTA GA. (THESE 3 ATTORNEYS PERJURED THEMSELVES WHEN THEY FILED THE 2255 MOTION BY ADDING THAT MALACHI YORK WAS A LIBERIAN DIPLOMAT) THIS IS PERJURY FOR FILING FALSE INFORMATION ON A LEGAL DOCUMENT. THESE ATTORNEYS DIDN'T GO TO SEE MALACHI YORK TO GET HIS APPROVAL THAT'S WHY MALACHI YORK'S SISTER DALE YORK BROWN SIGNATURE IS ON THE 2255 MOTION. ATTORNEY ADRIAN PATRICK WHO SAID OUT OF HIS OWN MOUTH ON COURT RECORDS THAT HE WILL BE INEFFECTIVE DUE TO THE FACT HE WILL HAVE ONLY 6 DAYS TO GET PREPARED FOR A \"RICO CASE\" ALL THESE DEFENSE ATTORNEYS WERE (INEFFECTIVE ASSISTANCE) MALACHI YORK DID NOT HIRE ANY OF THESE ATTORNEYS THEY WERE ALL HANDED TO HIM WHILE KIDNAPPED BEHIND PRISON BARS, BUT ON JUNE 30, 2003 (MAKU) BLACK \"THUNDERBIRD\" EAGLE ADDRESSED THE COURT AND PUT ON RECORD HIS INDIGENOUS STATUS READ IT FOR YOURSELF Download, 381274=Attorneys working against Maku \"Chief Black Thunderbird Eagle\" deceptions (Cointelpro at work) 2255 cost 100,000.00 dollars to file and when you read this document you see how the Ancient Ones are helping us to expose these injustices, the attorneys that filed this document put one of the reasons to release Dr. York is that he is a Diplomat from Liberia ( THIS WOULD BE CALLED NEW EVIDENCE) because in the trial transcripts attorney Adrian Patrick never brought up that Dr. York was a Liberian Diplomat, now where is the proof of this claim, Maku never once in the public forum said that he was a Diplomat from Liberia and wrote a book called \"Who is Marcus Garvey?\", and in this book Dr. York points out that Liberia's government crossed Marcus Garvey, but lets stay on point Maku Black Thunderbird Eagle addressed the nation on multiple audio cd's before and after the trial and never once did he mention being a citizen of Liberia,, 142889=OUR CHIEF TOLD US YEARS AGO THAT THIS DAY WOULD COME, LISTEN TO THE AUDIO PLAYING, THAT RECORDING WAS IN 1988 A.D. NOT THE PART WITH FARRAKHAN THAT WAS AFTER THE KIDNAPPING AND IN MANY CLASSES HE TOLD US THAT THE EVIL ONE WANT TO STOP WHAT HE TEACH AND THAT THEY WILL TAKE HIS PICTURES OUT AND REPLACE IT WITH EUROPEANIZED IMAGES AND THAT'S ONE REASON YOU HAVE A PAINTED PICTURE IN THOSE OTHER BOOKS TODAY YES THE CHANGE OUR CHIEF TALKED ABOUT IS NOW HAPPENING SO, BEWARE. BEWARE!!! THIS IS A WAKEUP CALL AND A REMINDER TO YAMASSEE NUWAUBIAN MOORS, 69774= this young attorney took on a whole U.S. District Attorney office team of counselors and 1 judge that showed his biasness against Dr. Malachi Z York-El. The government had almost 2 years of planning out their strategies and Attorney Patrick  was hired in December 16th of 2003 and made lead attorney 1 week before the trial date, the Trial started Jan. 5, 2004 not enough time to be properly be prepared..., 316257=August 19 2004 these 4 documents the Liberian Government was asking for and look at the date the Consulate in Atlanta letter to Richelle Davis April 2005 Why? Because she works for the Government., 261070=There was a motion put in by Defense Attorney Frank Rubino for dismissal due to lack of Jurisdiction.  Judge Royal mentioned that he did not want to hear any argument on the motion, but he did have a few questions.  Before his questions were addressed, Prosecutor Richard Moultrie informed the court that he has not had a chance to argue the motion on jurisdiction and that he would like to have that chance.  Judge Royal reminded Moultrie that both parties argued this motion on June 30th and that he even read Dr. Malachi Z. York's statement.  Moultrie then informed the court that this particular motion had not been filed at that time.  Judge Royal said that he did not need to hear any further argument on the matter.  He then asked Rubino did this motion have any \"factual basis,\" and Rubino says \"YES\", that he felt it did.  Rubino also stated that the defendant is an Indigenous Native American.  Judge Royal agreed and stated that he would rule on this motion in brief, using what he has already read. , 454301=07-22-2001, the Yamassee have been doing good things all over the U.S. this is not new but, it shows that the media like to pick on the Dr. Malachi Z York and the Nuwaubians read the article, 170313=06/07/2002 TO 11/21/2003 SUPERSEDING INDICTMENT, 21058=Brunswick is outside of the land that belongs to the Creeks based on the Treaty of 1790. [read moor], 436342=Anu's Spiritual Gifts Descend Into And Around Me. Guide Me In All I Do, Help Me That I May Help All Human Beings. Let Me Speak From Your Heads And Not My Own. Let Me Care From Your Hearts And Not My Own. Let Me See From Your Eyes And Not My Own. I Am To Serve Not Rule. Make Me Of The Best Of Your Servants. Oh Head Of All Eloheem, Anu; You Are Of The Light Of Lights, The Truth Of All Truths, The Creator Of All Creators. This Is The Prayer Of Murdoq To Anu., 178184=BIA 208 1999.pdf THIS NOTICE WAS PUT IN APRIL 27,1999, 356261=Notice the brother behind Maku facing in the same direction with the glasses on, that's right it's the real (Dwight York) in 1992 this is upstate before we moved to Georgia. Look at the attire of the brothers Cowboy cloths before we made our move, proof that we acknowledged our tribal culture, 467450=April 27 the Rev Jesse Jackson.pdf, 218656= In trial of defendant members of a drug-trafficking organization for \"murder of certain government witnesses\" as well as for \"numerous ... narcotics and firearms-related offenses,\" an anonymous jury was appropriate for both capital and non-capital defendants because \"disclosure of identifying information about the venire members may jeopardize their lives or safety,\" as well as that the \"'interests of justice'” are served by anonymity, in United States v. Dinkins, __ F.3d __ (4th Cir. Aug. 14, 2012) (Nos. 09-4668, 09-4669, 09-4755), 212053=OUR MAKU INFORMED THE BUREAU OF INDIAN AFFAIRS OF THE RETURN OF THE YAMASSEE TRIBE IN THE STATE OF GEORGIA THE HOME OF OUR ANCESTORS IN APRIL,27,1999 A.D. AND THEY MADE NOTICE OF RECEIPT ON DECEMBER,2,1999 A.D.  BIA 208 1999.pdf, 304818=VIEW ALL THE VIDEOS ON THE YAMASSEE LAND BACK IN 1997 A.D. TALKING ABOUT OUR SOVEREIGNTY, 457723=PRESS RELEASE APRIL 17, 2004, 460014=BIA 208 1999.pdf, 206542=  1921, Black Wall Street, Tulsa Oklahoma, 214280=WHY DID IT TAKE THE FEDERAL GOVERNMENT ALMOST 2 YEAR ( MAY 8 2002 TO JANUARY 5 2004) TO PROSECUTE THIS CASE?, 520311=Get the Facts on how did it all began!  See the history of Nuwaubians prior to Dr. Malachi Z. York's arrest on May 8th 2002.  Were the Nuwaubians targeted by Putnam county officials?  Were the Nuwaubians considered a political threat as their number grows in Putnam county, Eatonton and Middle Georgia area?  Get the facts and moor., 432180=Please read these documents in 2003 A.D. about the real Consul General of the Yamassee Government and not for Liberia, a Deception of the Cointelpro agents amongst us., 327862=Rochelle Davis is the one that feed the family the Liberian Lies, now our Maku told Rochelle to fire Jonathan Marks months before the the hearing for new evidence with Abigail (Habiyba) Washington on Aug. 13, 2004  she waited until the day of the court hearing to put a motion to fire Marks, this is how they work and all this was done without the consent of Dr. York., 151465=John 8:32, 303341=At the same time over 5,600 members of the Yamassee Native American Moors of the Creek Nation (U.N.N.M.) BIA “Bureau of Indian Affairs” Registry No. 208/1999 across the world signed petitions recognizing me as their Chief and Head of State of the Yamassee Native American Moors of the Creek Nation (U.N.N.M.) BIA “Bureau of Indian Affairs” registry No. 208/1999. Also over 12,000 members from across the world sent letters to Yamassee Native American Moors Of the Creek Nation P.O. Box 1845, Milledgeville, Georgia 31059 recognizing me as the Chief and Head of State of the Yamassee Native American Moors of the Creek Nation (U.N.N.M.) B.I.A. “Bureau of Indian Affairs” Registry No. 208/1999. Furthermore, in December 2003 A.D. the Brunswick Downtown Development Authority sent a letter to me thanking me as the Chief of the Yamassee Native American Moors of the Creek Nation (U.N.N.M.) BIA “Bureau of Indian Affairs” registry No. 208/1999 for the tribe’s participation in the Brunswick, Georgia Annual Christmas Parade. Additionally, when I made these declarations they were substantiated by my tribe’s (Yamassee Native American Moors of the Creek Nation (U.N.N.M.) BIA “Bureau of Indian Affairs” registry No. 208/1999) constitution, language and land., 306718=GENESIS 6:5, 191689=Judge Spivey in Juvenile Court in Jones County of the Ocmulgee Circuit stated in court on July 17, 2002 A.D., that none of these particular children, 505278=Detained from 5/8/2002 - 10/24/2002  , 181098=IT IS AGAINST THE LAW TO SIT AROUND AN CONSPIRE TO SET SOMEONE UP AN ABIGAIL \"HABIYBAH\" WASHINGTON'S RECANTMENT VIDEO PROVES THAT SOME DISGRUNTLE EX-MEMBERS GOT TOGETHER TO BRING THIS ILLEGAL CASE AGAINST MALACHI YORK AND HERE IS WHAT ABIGAIL WASHINGTON SAID ON COURT RECORD ON PAGE 20 & 21 READ PLEASE IT FOR YOURSELF Download  ABIGAIL CONFIRMED ON OPEN COURT RECORD THAT THEY PASSED OUT PRINT OUTS OF WHAT THEY ALL SAID THIS IS ILLEGAL AND MALACHI YORK SHOULD BE FREED NOW. WE ALSO WANT TO POINT OUT THAT FBI SPECIAL AGENT JULAINE WARD ALSO CONFIRMED THIS CONSPIRACY ON THE COURT RECORD HERE IS WHAT SHE SAID ON PAGE 68 AT THE BOND HEARING MAY 14 2002 AS SHE WAS QUESTIONED BY ATTORNEY ED GARLAND. WE WANT YOU TO NOTICE HOW MRS. WARD TRY TO COVER-UP HER FIRST ANSWER BECAUSE SHE KNOWS THAT IT IS ILLEGAL FOR ALLEGED VICTIMS TO SIT AROUND AN PLOT WHAT THEY ARE GOING TO SAY., 376076= FROM 9:30 AM - 5:30 PM, 187557=AFTER THE ORAL ARGUMENT IN ATLANTA GA., MR. PATRICK SAID THE FEDERAL GOVERNMENT DON'T HAVE JURISDICTION AND THAT MALACHI YORK SHOULD BE FREE FROM MARION FEDERAL PENITENTIARY IN 2005 IT'S NOW 2014 AMERICA IS STILL RAN BY RACIST AND THIS CASE PROVES IT TO US, YOU BE THE JUDGE, 171320=Bureau of Indian Affairs Petition #208/1999, 549771=©  Copyright 2009 Nuwaubian Facts.  All Rights Reserved.   www.nuwaubianfacts.com, 35397=Excerpt from May 14, 2002 Transcript page 68, 148739=The Nuwaubian Moors of the Yamassee Creek Nation were blocked by Racism in Macon Georgia from purchasing a Shriners Temple, a Church/School and a Medical facility before this illegal kidnapping of the Chief of the Yamassee Moors, these buildings are still unoccupied to this very day and the Nuwaubians were trying to purchase these buildings in 2000-2001 click here, 283434= 1921, Black Wall Street, Tulsa Oklahoma}",
    "lastModified": "Tue, 02 Jun 2015 15:56:36 GMT",
    "textBeforeTable": "              THE GOVERNMENT KNOW THIS IS ABOUT THE YAMASSEE JURISDICTION So ask yourself why? do this government have Malachi York locked up under the misnomer Dwight D York, more proof of the governments' role in this conspiracy to mislead the public and incarcerate an innocent man. FROM SCANT EVIDENCE TO RICO TO DESTROYING THE YAMASSEE PROPERTY TO A DEATH SENTENCE 135 YEARS MORE COMING.    Ques: Where is RICO in this case?   The government charged Dr. Malachi Z York as Dwight D, York (Misnomer) with Racketeering (Rico) and Child Molestation, OK, they said at the trial that Mr. York was trying",
    "textAfterTable": "  HOW CAN YOU HELP IN YOUR DEFENSE WHEN THE GOVERNMENT KEEP MOVING YOU AROUND FROM PRISON TO PRISON   The Above Photo was a peaceful protest by the Yamassee Nuwaubian Moors in front of the Federal Courthouse in Macon Ga. before the Trial, asking for the trial to be open to the public, because we knew that the government was trying to hide the FACTS that there was NO Evidence to convict our Maku Black Eagle and this is why we wanted to keep the trial open to the public, Maku Black Eagle  A/K/A Dr. Malachi Z York-EL  was requesting to keep the trial open to the public this request don't sound like our Maku was trying to hide the FACTS of this BOGUS CASE, but it should make the public really want to know the TRUTH ASK TO OPEN THE TRIAL TRANSCRIPTS Let the Truth be Told [click here]   ",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}