{
    "relation": [
        [
            "Item #",
            "PDP90A",
            "PDQ80A"
        ],
        [
            "% Weight Reduction",
            "51%",
            "51%"
        ],
        [
            "% CO2 Reduction",
            "61%",
            "61%"
        ]
    ],
    "pageTitle": "Position Sensing Detectors",
    "title": "",
    "url": "http://www.thorlabs.com/NewGroupPage9.cfm?objectgroup_id=4400",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988650.6/warc/CC-MAIN-20150728002308-00032-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 767985631,
    "recordOffset": 767933114,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{98895=The PDQ80A and PDQ30C detectors are segmented, position-sensing, quadrant detectors for precise path alignment of light in the 400 to 1050 nm or 1000 to 1700 nm range, respectively. A 6-pin Hirose connector on each detector outputs signals proportional to the incident beam's power distribution (and thus position). For best results, quadrant detectors should be used with powers under 1 mW (linear regime of sensor) and beam diameters within their specified range.}",
    "textBeforeTable": "CFC-2X-C P1-SMF28E-FC-2 TPS101 1550 nm, 1.5 mW Fiber-Coupled T-Cube Laser TLS001-1550 Collimator Fiber (2 m Length) Power Supply Description Laser Max Incident Power (for Linear Response): 1 mW Input Beam Diameter: 0.2 - 0.5 mm Wavelength Range: 1000 - 1700 nm PDQ30C Compatible CFC-11X-A P1-630A-FC-2 TPS101 635 nm, 2.5 mW Fiber-Coupled T-Cube Laser TLS001-635 Collimator Fiber (2 m Length) Power Supply Laser Description Laser Max Incident Power (for Linear Response): 1 mW Input Beam Diameter: 1 - 3.9 mm Wavelength Range: 400 -",
    "textAfterTable": "Smart Pack Minimize CO2 Footprint Reduce Non-Recyclable Packing Materials Improve Packaging Integrity Saves on Shipping Costs Thorlabs' Green Initiative is aimed at reducing waste. To that end, we have begun to re-engineer our product packaging. Products listed above are now shipped in re-engineered packaging that minimizes the use of non-recyclable materials. Over the course of a year, the re-engineered packaging across our product line is projected to reduce our CO2 footprint by more than 16,184 kg and reduce packaging by over 13,893 pounds! As we move through our product line, we will label re-engineered packages with our green Smart Pack sticker (above). Documents Tab to be Discontinued... Please note that this tab will be removed at the end of 2015. The same information displayed here can be found by clicking on the red Docs Icon ( ) next to the item of interest in the pricing area below. Click the document icon or Part Number below to view the available support documentation",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}