{
    "relation": [
        [
            "",
            "Output (billions of 1994 dollars)",
            "Employment (thousands)"
        ],
        [
            "WITHOUT SIP",
            "1,667",
            "16,197"
        ],
        [
            "WITH SIP",
            "1,665",
            "16,177"
        ],
        [
            "DIFFERENCE",
            "2.0",
            "20"
        ],
        [
            "%TOTAL",
            "0.1",
            "0.1"
        ]
    ],
    "pageTitle": "Planning: 1994 State Implementation Plan - Volume 2",
    "title": "",
    "url": "http://www.arb.ca.gov/planning/sip/94sip/sipvol2.htm",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438044160065.87/warc/CC-MAIN-20150728004240-00022-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 300423823,
    "recordOffset": 300344136,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{194218=THE SIP'S EFFECTS ON THE CALIFORNIA ECONOMY IN THE YEAR 2010, 277386=Total emission reductions from these three measures of 5 tpd ROG and 73 tpd NOx are expected by 2010, with substantially greater reductions occurring post-2010., 359190=To realize additional emission reductions from aerosol paints, technologies that are not currently available will need to be developed and deployed. For example, aerosol paints may eventually be able to be formulated with VOC contents at or near zero, if major breakthroughs in resin technology, non-VOC solvent and propellant systems, and valve design occur. Currently, some \"brush-on\" paints already have reached VOC levels at or near zero VOC. However, formulating zero VOC aerosol spray paints may pose unique challenges different from those encountered in the development of near-zero VOC \"brush- on\" paints. Market incentive approaches may also be explored as a vehicle to spur the development of low-and zero-VOC aerosol paints. Market incentive approaches may also be explored as a vehicle to spur the development of low-and zero-VOC aerosol paints. Options for market incentive programs were outlined in the section for consumer products. Provided that there are innovative technological breakthroughs and that these measures are implemented, an estimated additional 25 percent reduction or about 3 tons per day relative to uncontrolled 2010 emissions may be realized. Overall, if the short and long term measures are implemented, the emissions from aerosol paints will be reduced by approximately 85 percent relative to 2010 uncontrolled emissions. While the cost effectiveness of these measures is not currently known, it is expected that the cost effectiveness will be similar to other measures adopted around the turn of the century. As the measures are developed, the ARB staff will analyze the potential cost impact and provide the information as it becomes available., 322346=Consumer products are chemically formulated products which are used by household, commercial, and industrial consumers. These include personal care, household care, automobile care, and non-agricultural pesticide products. Many of these products contain volatile organic compounds (VOCs, note: VOCs are equivalent to ROGs), in quantities ranging from a few percent by weight up to 100 percent by weight. The VOCs serve as solvents, propellants, carriers, or active ingredients. When the product is used, the VOCs usually evaporate and then contribute to the formation of urban smog. Collectively these emissions are very significant. In 1990, for example, consumer products contributed about 15 percent of the statewide non-vehicular VOC emissions. The ARB has adopted consumer products regulations to control the VOC contents for many of these products., 160223=Emission reductions, shown for each measure, are relative to 1990 Baseline Emissions and are therefore additive. Numbers are rounded., 275222=The emission control strategy for on-road heavy-duty vehicles includes the following elements designed to provide emission reductions in areas subject to the 2005 and 2010 attainment deadlines., 13616=2010, 66640=2004, 226698=CFCs are methane or ethane compounds in which all of the hydrogen atoms have been replaced with chlorine and fluorine. Nearly all uses of CFCs in aerosol products in the U.S. have been banned or eliminated since 1978. Because of this, we anticipate no significant global warming to occur due to the use of CFCs in products subject to the existing regulations or to be regulated under the proposed SIP measures., 309434=Most importantly for the California SIP, the ARB assumes that by 2010 locomotive fleets in the SCAB will be required to emit on average no more than the U.S. EPA-established 2005 emission level for new locomotives. This compliance requirement would be met by the use of only the cleanest engines within the SCAB non-attainment area by an aggressive phase-in of these engines over five years. In essence, this fleet average requirement represents the most aggressive scrappage and replacement program of any transportation source in the SCAB (in effect, 100 percent scrappage/replacement with the latest, low-emitting locomotives over 5 years from 2005-2010). It would lead to an overall emission reduction of 67 percent by 2010., 124862=The implementation of the improved control technology measures identified herein does not reduce emissions sufficiently to provide all of the mobile source emission reductions contained in the year 2010 ozone attainment demonstration for the South Coast Air Basin. The additional emission reductions needed will be achieved through the implementation of additional innovative market-based and technology-based measures. Likely measures include market incentive measures to encourage the introduction of even cleaner technologies, and their rapid introduction into the fleet. Also likely are transportation control measures aimed at reducing vehicle miles travelled. These measures would be pursued jointly by the ARB, the local air pollution control districts, and other local agencies. A discussion of some of the measures currently under consideration follows., 9235=The State's element of the SIP is designed to obtain benefits statewide, but the targeted final level of control is based primarily on the emission reductions needed for the SCAB. Because the measures to be adopted will apply statewide, other areas of the state will also realize significant emission reductions from the mobile source and consumer products control program. The measures are essential in those areas to achieve state air quality standards and will help maintain federal standards in the face of growth. To reach attainment in the SCAB and elsewhere in California, significant additional emission reductions are needed. Air quality modeling shows that the existing emissions of ROG in the six areas that required SIP revisions by November 15,1994, must be reduced between 25 percent and 80 percent to attain the federal ozone standards. For NOx the reductions range from 20 to 60 percent. The needed reductions and the targeted date by when the reductions need to be obtained are listed in Table 2., 34665=1990 NOx INVENTORY SUMMARY FOR AFFECTED NONATTAINMENT AREAS, 85099=-- Introduction in fleets of ultra-low emitting heavy-duty trucks, post-2003, 329962=The ARB staff intend to submit the ACP as part of the SIP in 1995. Over the past 2 years during the development of the regulation, ARB staff have worked closely with U.S. EPA staff to ensure consistency with U.S. EPA's Economic Incentive Program guidance. The U.S. EPA supported the ARB adoption of the ACP at its September 1994 hearing., 340777=March 1995, 313235=This category includes military, commercial, and general aviation. The ARB is preempted from setting emission standards for aircraft. The U.S. EPA currently has hydrocarbon emission standards for new commercial aircraft engines and the International Civil Aviation Organization has hydrocarbon, NOx, and CO standards for new engines. The federal hydrocarbon emission standards do not apply to military aircraft. Military aircraft are also exempted from any future controls. The baseline ROG and NOx emissions for the SCAB from these sources are shown below. The 2010 baseline emissions represent 19 percent and 38 percent increases of ROG and NOx emissions, respectively, from the 1990 baseline emission inventory., 148156=ARB staff has identified several strategies that will be explored to reach the emissions target for consumer products. Very substantial additional reductions can be anticipated due to a combination of new technological breakthroughs in currently-regulated products, regulating additional product categories, developing market incentive programs to encourage additional emission reductions from the universe of consumer products, developing pollution prevention programs, implementing public education programs, and developing special recognition programs (e.g., environmental labels or awards) for very low VOC- emitting products. Section 182(e)(5) allows such commitments for the bulk of these post-2000 emission reductions. The ARB will develop appropriate technologically and commercially feasible control strategies based on continuing evaluation of new technologies and compliance options., 350531=December 2005, 350130=December 2003, 64527=1998- 2002, 170639=The United States Clean Air Act Amendments of 1990 require California to submit a comprehensive attainment plan for ozone to the United States Environmental Protection Agency (U.S. EPA) no later than November 15, 1994. The State Implementation Plan (SIP) must cover all nonattainment regions of the state that are classified as serious, severe or extreme for ground-level ozone. These regions include the South Coast, Sacramento, San Diego, Ventura, San Joaquin Valley, and Mojave Desert Air Basins., 88056=Medium-Duty Vehicles/Heavy-Duty Gasoline Trucks: include large pick-up trucks, vans, and delivery vehicles. Emission reductions for the medium-duty vehicle category will occur as a result of more stringent emission standards adopted for 1990 and newer vehicles, including the low-emission and ultra-low emission vehicle requirements starting in 1998. Further reductions would be realized through acceleration of the required fraction of ULEVs. For heavy-duty gasoline trucks, more stringent standards will be proposed., 354375=Based on the AQMP adopted, to reach attainment, the 2010 emission inventory for this category needs to be reduced to about 5 tons per day of ROG. To reach this target will require the investigation of innovative strategies that promote the development of low VOC technologies and foster these developments through the use of market incentives. The strategies that are envisioned for aerosol paints are summarized below and categorized into \"short term measures\" and \"new technology measures.\" The short term measures rely on available control technologies and are proposed to be implemented between 1995 and 2005. These measures are based on the traditional command and control approach and also on alternative approaches to achieve emission reductions. The new technology measures depend on the advancement of technologies and market incentive methods that can be fostered and developed between 1994 and 2010. Further development and refinement of new low- and zero- VOC technologies in addition to innovative technological breakthroughs is critical to the successful implementation of these new technology measures. The ARB staff intend to use section 182(e)(5) commitments for these emission reduction strategies., 315234=The U.S. EPA needs to strengthen its existing nationwide hydrocarbon emission standard for aircraft engines as well as adopt a stringent national emission standard for NOx. Specifically, the U.S. EPA needs to adopt standards to effect a 30 percent reduction in ROG and NOx emissions beginning in 2000. Because emissions from military aircraft comprise a significant fraction of emissions from aviation activities, the exempt status of these aircraft should be reconsidered., 152017=As is shown in Figure 3, without additional measures for consumer products in the SIP, the emissions for consumer products will, after an initial decline due to the existing regulations, continue to grow. Without the SIP control measures for consumer products, the projected emissions in 2010 for consumer products are about 35 percent of the attainment ROG emissions in the SCAB. With full implementation of the SIP component for consumer products, the emissions from consumer products will decrease to the attainment level of approximately 20 tons per day., 204858=The ARB's program involving our adoption or approval of standards, rules, regulations, and plans has been certified by the Secretary of Resources as meeting certain environmental standards set forth in CEQA (see Public Resources Code section 21080.5). Hence, the ARB need only prepare abbreviated, \"functionally equivalent,\" environmental documents instead of negative declarations and ElRs. This environmental document must contain a description of the proposed activity with either alternatives to the activity and mitigation measures to minimize any significant adverse environmental impacts, or a statement supported by documentation that the plan as approved will not produce any such impacts. The ARB encourages public consideration of this plan and its environmental documentation, and will respond in writing to all significant environmental points raised by the public, either in writing during the public review period or at the public hearing. Notice of the ARB proposal to adopt this portion of the SIP, including notice of the availability for review and comment of this evaluation of environmental impacts, has been posted, published, and mailed to interested persons. In addition, the staff report will be circulated by the State Clearinghouse to state agencies for review; although no state agency is \"responsible agency\" for this activity as defined by CEQA, the ARB is the lead agency for this portion of the SIP, and the plan is of statewide, areawide, and regional significance because the measures therein will ultimately affect the type and composition of certain consumer products, motor vehicles, and other mobile sources available in the State of California., 213718=0.009-0.01, 142586=In the near term, the SIP will rely on the existing consumer product regulations and the aerosol paints regulation currently under development to reduce ROG emissions from consumer products and aerosol paints. The ARB's existing consumer products regulations are expected to achieve reductions of approximately 70 tons per day of ROG statewide and about 30 tons per day of ROG in the SCAB. This represents a 30 percent reduction relative to uncontrolled 1990 baseline emissions. These regulations set volatile organic compound (VOC) limits for 27 categories of consumer products, mostly in terms of percent VOC by weight (Note: VOC is equivalent to ROG for consumer products). Some of the products subject to these standards are antiperspirants and deodorants, hairsprays, general purpose cleaners, aerosol cooking sprays, automotive brake cleaners, and charcoal lighter material products (Note: state law specifically excludes architectural coatings from the definition of consumer products, even though the bulk of these products are used by consumers). The regulations are found in Title 17, California Code of Regulations, Division 3, Chapter 1, Subchapter 8.5, Articles 1 and 2., 54918=Another challenge is overcoming the effects of growth on mobile source emissions. Both the number of vehicles and the total number of vehicle miles travelled are projected to continue to increase very substantially. The impacts of growth on on-road mobile source emissions for the SCAB are illustrated in Figures 11 and 12. These two figures show on-road NOx and ROG emissions for 1990, projected emissions for 2010 with growth, and projected emissions for 2010 without growth. Of the estimated on-road mobile source emissions, more than 40 percent of NOx and more than 20 percent of ROG emissions are attributable to growth., 269813=EARLY INTRODUCTION OF 2.0 G/BHP-HR NOx ENGINES - MEASURE M4 ADDITIONAL NOx REDUCTIONS IN CALIFORNIA IN 2002 - MEASURE M5 2.0 G/BHP-HR NOx FEDERAL STANDARD IN 2004 - MEASURE M6, 58828=Federal standards have been proposed for pleasure craft for implementation starting in 1998. Substantial ROG emission reductions will be achieved primarily by controlling 2-stroke engines used in outboards and personal watercraft, although emissions from 4-stroke engines will also be reduced., 272589=Current emission standards apply to the engine rather than the vehicle. The applicable NOx standard for 1991 and later engines is 5.0 grams per brake horsepower hour (g/bhp-hr). The baseline emission inventory for 2010 presented above includes the effects of a 4.0 g/bhp-hr NOx standard to be implemented nationwide in 1998. The reduction in ROG emissions results from the technologies used to meet the lower PM emission standards beginning in 1994., 63192=1996- 2010, 330428=To help reach attainment in the SCAB, the 2010 emission inventory for consumer products needs to be reduced by about 85 percent or to approximately 15 tons per day. To achieve this goal, a number of strategies will need to be implemented, many of which require significant advances in the development of low-VOC technologies and cooperation between the Federal Government, ARB, California consumers and industry. The control strategies for consumer products are summarized below and categorized under near term, mid term, and long term measures according to the three components of the consumer products control strategy. The near term measures rely on submittal of the existing consumer products regulations as part of the SIP. The mid term measures rely on available control technologies and are proposed to be implemented between 1995 and 2005. These measures are based on the traditional command and control and alternative approaches to achieve emission reductions. The long term measures depend on the advancement of technologies and market incentive methods that can be fostered and developed between now and 2010. Further development and refinement of new low- and zero-VOC emitting technologies in addition to innovative technological breakthroughs is critical to the successful implementation of these new technology measures. The ARB staff intend to use section 182(e)(5) commitments for these emission reduction strategies. We will not rely on section 182(e)(5) measures to achieve year 2000 needed emission reductions., 154492=% Control of 1990 Baseline, 13071=2007, 353417=The only existing regulation in California limiting VOC emissions from aerosol paint is the Bay Area AQMD Rule 8-49. The estimated reduction in emissions from this regulation is 1 ton per day (all in the Bay Area). There are no regulations currently in effect in the SCAB. Recently, amendments to the California Clean Air Act designated the ARB as the agency responsible for reducing VOC emissions from aerosol paints and established specific reduction requirements. Under these amendments, the ARB is required to: adopt a statewide regulation by January 1, 1995, which is designed to achieve a 60 percent emission reduction by December 31, 1999; hold a hearing on or before December 31, 1998, to review the technological and commercial feasibility of the 12/31/99 standards; and establish interim standards prior to 12/31/99., 33145=Total mobile plus stationary source emissions in the six non-attainment areas for the baseline year 1990 are 2,800 tons per day of oxides of nitrogen (NOx) and 2,800 tons per day of reactive organic gas (ROG). On-road and off-road mobile sources make up the majority of these emissions, as shown in Figures 1 and 2. Mobile sources accounted for 73 percent of total 1990 NOx emissions, and 55 percent of total 1990 ROG emissions. Tables 1 and 2 present this information for each of the six areas., 276942=M6 - 2.0 g/bhp-hr NOx Federal Emission Standard in 2004, 53446=Achieving the necessary emission reductions presents a number of challenges. The first challenge in providing the needed reductions on time is the amount of emissions generated from vehicles and engines equipped with \"old\" technology. The large contribution of old technology emissions is illustrated with examples from two source categories: heavy-duty diesel trucks, and light-duty vehicles. Figure 9 shows that in 2010, about one-third the heavy-duty diesel truck emissions will be from pre-2003 model-year vehicles. Figure 10 shows that in 2010, more than half of passenger vehicle emissions will be from pre-2003 model-year cars. The contribution of older technology to total emissions is also important in other mobile source categories as well, including off-road sources such as locomotives, marine vessels, and industrial equipment. The reduction of emissions from older vehicles must be addressed., 276275=Attainment of the federal ozone standard in Sacramento and Ventura depends on achieving additional reductions in NOx prior to the 2005 attainment deadline. This will be achieved by adoption by the ARB of a 2.0 g/bhp-hr NOx emission standard for new engines sold in California beginning in 2002, or by implementation of alternative measures which achieve equivalent or greater reductions. Alternatives that will be considered include expanded introduction of alternative-fueled and low-emission diesel engines through demand-side programs and incentives, retrofit of aerodynamic devices, reduced idling, and speed reduction., 243292=MODIFIED BASELINE 2010 EMISSION INVENTORIES FOR A NUMBER OF MOBILE EMISSIONS SOURCES, 256823=In the South Coast Air Basin in 2010, light-duty vehicles eight years and older account for 62 tons per day ROG, which is 60 percent of all light-duty vehicle ROG emissions. This occurs because the newer model vehicles are increasingly emitting at LEV levels, but the remaining older vehicles emit at rates many times higher., 341816=January 2000-2005, 289838=The 2010 levels represent a 19 percent reduction in NOx emissions from 1990 levels, due to existing control programs., 134819=Outlined in this chapter is the consumer products element of California's SIP. This element is designed to obtain benefits statewide, but the targeted level of control is based primarily on the emission reductions needed for the SCAB. Because the measures to be adopted will apply statewide, other areas of the state will also realize significant emission reductions from the consumer products control program. These will help those areas achieve state air quality standards and will help maintain federal standards in the face of growth. There are several goals in preparing this element of the SIP. First, this element of the SIP will provide for the needed reductions in consumer product emissions that, in combination with other measures, will provide for ozone attainment in Southern California and other areas of California. Our second goal is to obtain these emission reductions by developing programs to foster the innovative technologies that will be the foundation of future control measures. Third, we hope to develop regulations that continue to provide flexibility to the regulated community. While some of the measures for consumer products rely on traditional control methods, such as product-specific limits on ROG content, many of the future emission reductions will be realized through the use of innovative technologies and market incentives. In adopting measures to fulfill our SIP goals, the ARB will ensure that any regulations adopted will meet the requirements of Health and Safety Code Section 41712., 270322=This category of vehicles includes both California and federal larger trucks designed for on- highway operation, inter-city and urban buses, and larger school buses. The heavy-duty emission inventory category includes vehicles with gross vehicle weight ratings of more than 8,500 pounds. Beginning with the 1995 model year, the heavy-duty vehicle category includes only those vehicles with gross vehicle weight ratings greater than 14,000 pounds. For consistency, the emissions from vehicles with gross vehicle weight ratings of 8,501 to 14,000 pounds, which are subject to medium- duty vehicle requirements in 1995, are included in the medium-duty source category for all years., 133870=Obtaining emission reductions from consumer products was only recently made a part of this clean air challenge through the enactment of the California Clean Air Act (CCAA). The CCAA added Section 41712 to the Health and Safety Code which stated that the ARB will adopt regulations to achieve the maximum feasible reductions in reactive organic compounds emitted by consumer products provided that adequate data exists for it to adopt the regulations, and that the regulations are technologically and commercially feasible, and necessary. This law resulted in regulations adopted by the ARB in the early 1 990s that will provide significant statewide emission reductions from consumer products. Achieving additional emission reductions from consumer products is an important component of the 1994 California State Implementation Plan (SIP). These products contain ROGs which are emitted when they are used., 108375=1999, 86482=Because of the innovative and developmental nature of these control measures, they do not have the degree of specificity of the measures in Table 4, nor are the reductions for individual measures in Table 5 quantified. The measures will be further defined and quantified, and adopted by 2006 for implementation by 2009. Altogether, the new control technologies and techniques will achieve emission reductions of 60 tons per day of NOx and 79 tons per day of ROG in the SCAB in 2009 and 2010., 223263=The primary environmental impact, and, indeed, the purpose of the existing regulations and the proposed SIP measures is a decrease in VOC emissions to the atmosphere from consumer products. Since VOCs are precursors to ground-level ozone, a decrease in VOC emissions will result in a net decrease in tropospheric ozone. A decrease in PM10 will also result from the measures contained in the SIP, since VOCs are also precursors to PM10 formation. Therefore, the existing regulations and the proposed SIP measures are projected to result in an 85 percent reduction in VOC emissions by the year 2010, with concomitant reductions in ozone and PM10., 96527=BASELINE 2010 EMISSIONS (tons per day), 12799=2005, 220624=As part of our legally-required rulemaking process, we conducted an environmental impacts analysis for each of the existing consumer products regulations (antiperspirant/deodorants, Phase l-ll); the recently-approved market-based Alternative Control Plan (ACP) regulation; and the aerosol paints regulation currently under development for the Board's consideration in early 1995. These analyses show that no significant adverse environmental impacts on air quality, water quality, and landfill loading would result from the implementation of these regulations (California Air Resources Board, Stationary Source Division, A Proposed Regulation to Reduce Volatile Organic Compound Emissions from Antiperspirants and Deodorants-Technical Support Document, Sacramento, CA, September, 1989; California Air Resources Board, Stationary Source Division, Proposed Regulation to Reduce Volatile Organic Compound Emissions from Consumer Products - Technical Support Document, Sacramento, CA, August, 1990; California Air Resources Board, Stationary Source Division, Proposed Amendments to the Statewide Regulation to Reduce Volatile Organic Compound Emissions From Consumer Products. Phase II - Technical Support Document, Sacramento, CA, October, 1991; California Air Resources Board, Stationary Source Division, Proposed Alternative Control Plan Regulation for Consumer Products - Staff Report, Sacramento, CA, August, 1994; California Air Resources Board, Stationary Source Division, Proposed Regulation to Reduce Volatile Organic Compound Emissions from Aerosol Coating Products - Technical Support Document, Sacramento, CA, in preparation). Because future regulatory developments will generally involve additional or expanded applications of the control concepts employed by the existing regulations and the ACP, we do not anticipate any significant adverse impacts from the control measures contained in the SIP. However, as we further develop the SIP proposals, we will continue to analyze potential adverse impacts so as to ensure that negative environmental impacts will not occur due to adoption of the SIP measures. At the time of the rulemaking more specific details will be provided., 296893=Many engines in the category are similar to, or derived from, early 1980s automobile engines. Emission standards for new engines not primarily used in construction or farm equipment will be phased-in beginning in 2000, based on use of closed-loop three-way catalyst systems. The catalyst systems are expected to reduce ROG by 75 percent, and NOx by at least 50 percent., 174442=Because the majority of the planned control measures will go into effect between the years 2000 and 2010, most of the control cost will occur after the turn of the century. The costs associated with implementation of the actual control measures are likely to be lower than the costs estimated in this analysis. This is because we expect, based upon decades of experience, that costs for new advanced technologies and market-based emission control strategies will be lower than originally estimated. Much of this plan relies on these strategies to achieve the reductions needed for the year 2010., 310392=The national Section 213 emission standards for new locomotives and new engines used in locomotives will lead to significant emission reductions throughout the state as newer and lower emitting locomotive engines are purchased and as in-use locomotives are remanufactured. Accordingly, the ARB intends to take credit for a near-term 42 percent NOx reduction by 2005. This reduction level is consistent with the U.S. EPA's published estimates of the emission reduction impact of the phase-in of locomotives meeting the national emission standards to be adopted by the U.S. EPA under its Section 213 standard setting authority. The ARB will also consider operational controls, such as reduced idling and use of California diesel fuel, if, based on the U.S. EPA final rule, additional emission reductions are needed., 49429=In addition to the LEV program, the measures adopted in 1988 or later that will have the most significant emission reductions include: reformulated gasoline and diesel fuel, emission standards for diesel farm and construction equipment over 175 horsepower, a revised evaporative emission test procedure, a Phase 2 on-board diagnostic system (OBD II) requirement, revised emission standards for medium-duty and light-heavy duty vehicles, and requirements for utility engines and off-highway recreational vehicles/engines., 350704=January 2006-2010, 108475=2002, 341982=As stated previously, the long term measures include strategies that depend on significant advancement of technologies and market incentive methods that can be fostered and developed between 1994 and 2010. The consumer products working group that was discussed under the mid-term measures, will play an important role in assisting the ARB staff with prioritizing the long term efforts, coordinating with U.S. EPA and further refining of the control measures. The long term measures encompass three major elements - advanced technology and market incentives, consumer education, and increased cooperation with U.S. EPA. These long term measures will be pursued as a SIP measure under the provisions of CAA section 182(e)(5). These elements, in combination with the near and mid-term measures, will assure the success of the overall effort to achieve further emission reductions from consumer products., 143813=The ARB staff is also currently developing a regulation to reduce ROG emissions from aerosol paints in the near term. This regulation is mandated by California legislation which requires a 60 percent reduction in aerosol paint emissions by December 31, 1999 calculated from the 1989 baseline year (see Health and Safety Code section 4171 2(f). We plan on proposing an aerosol paint regulation to achieve this level of reduction in early 1995 for the Air Resources Board's consideration and approval., 140478=As shown in Figure 2, the baseline 2010 consumer product emissions need to be reduced to roughly 15 percent of what they are projected to be under the existing control programs. The near-term, mid-term, and long-term control strategies outlined in this chapter are important and necessary to demonstrate attainment in the SCAB. A more detailed description of these measures is provided in Appendix C., 171629=Staff has estimated the direct costs of state level control strategies (See chapters I and II) designed to achieve the federal ambient air quality standard for ozone. The costs associated with emission reductions, as well as the cost-effectiveness for various mobile and stationary source categories were estimated for the year 2010. This analysis does not include the costs of control measures that will be adopted by the air quality management districts., 164270=2008, 49959=The LEV program, together with the other measures in ARB's existing control program and Enhanced Inspection and Maintenance, will reduce mobile source emissions in the SCAB to 794 tons per day of NOx and 300 tons per day of ROG by 2010. These reductions are projected to occur despite an increase of nearly 50 percent in vehicle miles travelled (VMT) by light-duty vehicles over the period., 126865=California has become the leader in demonstration of alternative-fueled vehicles, and thousands of alternative-fueled vehicles are in daily operation. A statewide refueling infrastructure for CNG and methanol is in place and growing. New federal requirements, such the National Energy Policy Act, provide additional stimulus for the use of alternative-fueled vehicles. The SIP includes one measure M4, to increase the number of new low-emission heavy- duty trucks purchased from 1995 until the broader state and national 2.0 g/bhp-hr or lower standards go into effect. These trucks will likely be alternatively fueled, and reduce NOx emissions in the South Coast Air Basin by 1 ton per day in 2010. The ARB and districts will also work together to further increase the number of cleaner, alternative-fueled heavy-duty and light- duty vehicles in use., 304025=Further reductions can be achieved through locally adopted/enforced measures which encourage the use of cleaner/newer engines in nonattainment areas, or provide incentives to reduce emissions at the ports. The degree to which these and other similar approaches can contribute to lower emissions by 2010 has not yet been assessed., 232247=We evaluated this concern during the ACP rulemaking process (California Air Resources Board, Stationary Source Division, Proposed Alternative Control Plan Regulation for Consumer Products - Staff Report, Sacramento, CA, August, 1994) and determined that no significant adverse impacts would likely result from the implementation of the ACP regulation. For the reasons described in the following discussion, we believe it is highly unlikely for high-VOC products to be distributed to the same location in sufficient quantities and used at the same time to form localized hot spots. More importantly, the regional nature of VOC emissions from consumer products precludes the likelihood of hot spots formation., 358802=January 1996- December 1998, 308990=The 1994 SIP assumes that the U.S. EPA will adopt a two-tiered national NOx standard for new locomotives, which will decrease the standard on average by 58 percent effective in 2000, and by 67 percent effective in 2005. In addition, the ARB anticipates that the U.S. EPA will propose a national emission standard for remanufactured engines which reduces emissions on average by 33 percent for this class of engines, beginning in 2000., 267241=The staff expects that gasoline-technology will be able to meet the requirements in the proposed timeframe. The heaviest medium-duty vehicles may have problems meeting the ULEV standard. However, it may be possible to compensate for this situation through flexible standards which allow credits to be generated by the more populous lighter medium-duty vehicles, In addition, other mixes of vehicles and technologies could provide equivalent emission reductions. Emission reductions of 4 tpd ROG and 32 tpd NOx are expected by 2010, with more reductions occurring post-2010., 92887=Market-based measures and local demand-side requirements will be used to increase the use of currently available low-emission engines, primarily those using CNG as fuel. As low- emission diesel technology becomes available shortly after the turn of the century, emission standards for new engines will be implemented. Diesel engines meeting a 2.0 g/bhp-hr NOx standard will become available by 2002. Emission reductions from these low-emission engines beginning in 2002 are necessary to attainment in the Sacramento and Ventura areas. In addition, nationwide applicability of this low-emission standard is essential to attainment of the ozone standard in California because of the significant impact of out-of-state registered trucks within our borders. However, nationwide implementation of a NOx emission standard below 4.0 g/bhp-hr before the year 2004 is prohibited by the federal Clean Air Act. Therefore, a nationwide standard will be introduced in 2004, and the needed reductions in 2002 and 2003 will either be achieved through implementation of a statewide standard in 2002, or through a combination of operational, retrofit, advanced technology, and local market-based programs. In the long-term, as new, advanced ultra-low emitting engine technologies are developed, they will be evaluated for use in fleet applications., 279605=Previously adopted emission standards, and new emissions standards identified elsewhere in this plan, will cause heavy-duty diesel vehicle emissions to continue to decrease. However, in 2010, eight year and older trucks will still contribute 70 tons per day NOx, which is 35 percent of all on- road diesel truck emissions., 254292=The light-duty vehicle category consists of all passenger cars and light-duty trucks (rated at 6,000 pounds gross vehicle weight or less). Emissions from these sources are combustion emissions (ROG, NOx, CO, and PM) and evaporative emissions (ROG). Due to programs that have been adopted by the ARB, emissions from these sources are expected to be reduced significantly by 2010 even though growth in vehicle population and vehicle miles travelled (VMT) is projected to temper the emission reductions expected. The baseline ROG and NOx emissions for the SCAB from these sources are shown below. The 2010 baseline emissions represent 82 percent and 65 percent reductions of ROG and NOx emissions, respectively, from the 1990 baseline emission inventory., 74425=1998- 2001, 15718=The ARB's mobile source element will have a dramatic effect on ozone precursor emissions in California. With the joint efforts of the ARB, the U.S. EPA, and the local districts, mobile source emissions of NOx and ROG will drop to the levels needed to achieve attainment of the federal ozone standard in the SCAB by 2010 and in the other areas by 1999 or 2005. The control measures and strategies identified in this element will, for the most part, be implemented statewide, and the entire state will realize emission reductions. These reductions will move the state closer to meeting state air quality standards and help maintain attainment of federal standards in areas which attain before 2010., 29469=The Mobile Source Element is statewide in scope and will provide needed emission reductions in each non-attainment area. The control strategies, however, are primarily driven by emission reduction requirements for the SCAB. The SCAB is the only area in the state, and in fact the only area in the United States, that is designated a federal extreme ozone non-attainment area, with an attainment deadline of 2010. In addition, the SCAB accounts for almost half of the mobile source ozone-forming emissions in the state. Therefore, the SCAB emissions are used to illustrate the emissions contribution from each source category, and the magnitude of reductions needed to reach attainment., 255347=1990, 129212=The ARB will also work with other local districts, such as those in the Sacramento area, that need near-term, market-based measures to attain the ozone standard prior to 2010. Because the attainment deadlines for these other areas are sooner than that for the South Coast Air Basin, some areas need additional measures beyond those presented in this Mobile Source Element. The ARB will work hand-in-hand with the districts to implement the near term control measures and incentive programs needed to meet these earlier attainment dates., 261328=With these technologies, a fleet average non-methane organic gases (NMOG) emission level lower than existing requirements is achievable for year 2005 models through market forces and incentives to purchase lower emitting vehicles, through the application of market forces to achieve cleaner motor vehicles, as well as adoption of complementing emission standards. Emission reductions of 10 tpd ROG and 15 tpd NOx are expected by 2010, with substantially greater reductions occurring post-2010., 283405=This category of vehicles consists of the smaller classes of heavy-duty trucks that burn gasoline. Emissions from these sources are combustion emissions (ROG, NOx, CO, and PM) and evaporative emissions (ROG). Heavy-duty gasoline trucks include those trucks greater than 8,500 pounds gross vehicle weight rating (GVWR) until 1994. Beginning in 1995, the smaller trucks in this category, those less than 14,000 pounds GVWR, will be subject to the emission requirements for medium- duty vehicles. For consistency, the emissions from these smaller trucks are included in the emission inventory for medium-duty vehicles. The emissions shown below include all gasoline vehicles with gross vehicle weight ratings of 14,001 pounds or more. The baseline ROG and NOx emissions for the SCAB from these sources are shown below. The 2010 baseline emissions represent a 75 percent reduction in ROG emissions and no change in NOx emissions from the 1990 baseline emission inventory., 141838=Aerosol Paint: includes paint, varnish, and related products dispensed from disposable aerosol containers. Statewide, uncontrolled emissions from aerosol paint are projected to increase from about 30 tons per day in 1990 to about 38 tons per day in 2010, if no control measures were adopted. Uncontrolled emissions from aerosol paints in the SCAB are projected to increase from 14 tons per day in 1990 to 16 tons per day in 2010., 211248=The ARB staff has analyzed emissions associated with electric vehicles (EVs). Because electricity used in California is generated from very clean sources, as illustrated below, the power plant emissions associated with electric vehicles are negligible when compared to emissions from conventional vehicles. In fact, a significant percentage of the electricity used in California is generated from clean, renewable sources such as hydroelectric power, solar, and wind. Electric vehicles also avoid all fuel-related emissions, such as the evaporation of gasoline from storage and marketing operations. As shown in Table 1, in the South Coast Air Basin (SCAB), the power plant emissions of reactive organic gases (ROG), nitrogen oxides (NOx), and carbon monoxide (CO) associated with an electric vehicle are at least 97 percent lower than the ROG, NOx, and CO emissions from a gasoline-powered ultra-low-vehicle (ULEV), the cleanest vehicle of the future. In addition, most electric vehicle charging is expected to take place during off-peak hours when electricity rates are low and utilities have excess capacity. A complete discussion of emissions associated with electric vehicles is contained in the staff report for the 1994 Low-Emission Vehicle and Zero-Emission Vehicle Program Review and the technical support document for the Zero-Emission Vehicle Update, both dated April 1994., 291154=Transfer of cost-effective on-road diesel engine control technology to new off-road engines will allow most engines to meet more stringent standards in the 2005 and later timeframe. That control technology includes improved engine design (especially in fuel/air management and delivery), exhaust gas recirculation, and exhaust gas aftertreatment., 248816=Modified Baseline 2010 Inventory for NOx Compared to Official Baseline (South Coast Air Basin), 271045=In spite of the programs that have been adopted by the ARB and the U.S. EPA, growth in vehicle population and VMT is projected to largely offset the per-vehicle NOx emission reductions achieved. The baseline ROG and NOx emissions for the SCAB from these sources are shown below. The 2010 baseline emissions represent 42 percent and 5 percent reductions of ROG and NOx emissions, respectively, from the 1990 baseline emission inventory., 27286=An environmental analysis of the mobile source and consumer products elements for inclusion in the 1994 SIP was conducted. The environmental review concludes that no significant environmental impacts are expected to occur as a result of the adoption of these SIP elements. Consistent with CEQA requirements, the environmental analysis is necessarily general because specific regulatory language is not included in these SIP elements; for those existing regulatory measures that are part of the planned SIP submission, environmental assessments were prepared and provided for comment at the time of the measures' adoption. Additional, more specific environmental analysis will be conducted in the future as part of the regulatory adoption process for each regulation which implements the SIP elements., 43805=PERCENT REDUCTION FROM 1990, 341398=March - December 1996, 65258=1996- 2002, 63097=1996, 340977=November 1995, 332858=To facilitate the development and implementation of future consumer products control measures, the ARB staff will establish a consumer products working group. This working group will be advisory in nature and will be comprised of representatives from the ARB, industry, environmental groups, the local districts, and U.S. EPA. This working group will provide a forum for on-going communication, cooperation, and coordination in the development of consumer product control measures. We are planning to conduct the first meeting of the workgroup in Spring 1995., 349370=January 1996, 347957=The development and implementation of the long term measures will occur between 1995 and 2010. As a first step, the consumer products working group will assist the ARB staff in further refining the potential measures and prioritizing them for implementation. It is envisioned that the strategies will be prioritized into 3 groups with implementation in 3 phases. In this manner, the implementation of these strategies can proceed in an orderly fashion. Of the 85% overall reduction target, the goal is to achieve a 30 percent reduction from the long term measures by the year 2010. The implementation of the control strategies will occur in 3 phases according to the time table presented in Table 4 below., 159937=Emission Reductions = [Percent Control] X [1990 Baseline Emissions] X [Consumer Products or Aerosol Paints fraction of 2010 Emissions], where consumer products fraction ~ 90%, aerosol paints fraction ~10% of 2010 Uncontrolled Emissions, 182326=ESTIMATES OF THE COSTS FOR NOx EMISSION REDUCTIONS FOR 2010 BY MOBILE SOURCE CATEGORIES (MILLIONS OF 1994 DOLLARS), 350315=January 2004-2010, 20669=Obtaining emission reductions from consumer products was only recently made a part of the clean air challenge through the enactment of the California Clean Air Act of 1988. This law resulted in regulations adopted by the ARB in the early 1990s that will provide significant statewide emission reductions from consumer products. Achieving additional emission reductions from consumer products is an important component of the 1994 California SIP. These products contain ROG, emitted during product use., 307978=Section 213 of the federal Clean Air Act directs the U.S. EPA to adopt emission standards applicable to new locomotives and new engines used in locomotives by 1995, and a proposed rulemaking is expected to be published early next year. The ARB plans to take credit for the locomotive emission reductions that will result due to the promulgation of the Section 213 rules by the U.S. EPA., 63868=2004- 2005, 257559=It is expected that 1,000 dollars per car will be sufficient to secure older cars for retirement, and to pay for administration of the program. To put this into perspective, the cost of this program could be financed by a seven dollars increase in the annual registration fee of each vehicle, or by a 100 dollars fee on the sale of each new vehicle. A broad coalition of business interests, who are supporting the need for a program to retire vehicles, has agreed to pursue legislation, if needed, to finance the program. The financing mechanism will be secured by the end of 1995., 88601=Heavy-Duty Diesel Vehicles: include urban buses and other on-road heavy-duty diesel-fueled vehicles, both those registered in California and those base-plated elsewhere. Beginning with the 1995 model year, some of the lightest heavy-duty vehicles will be changed to the medium-duty classification. Emissions from these vehicles will be reduced under the medium-duty vehicle/engine requirements. The ARB plans to adopt the 1998 federal NOx standard of 4.0 g/bhp-hr, which would provide emission reductions from heavy-duty trucks., 106435=Tables 7 and 8 show the impact of the proposed improved control technology measures on NOx and ROG emissions, respectively. Tables 7 and 8 show baseline 1990 and 2010 emissions, as well as 2010 emissions with improved control technology measures. Tables 9 and 10 show the impact of the proposed control measures on SCAB mobile source NOx and ROG emissions, respectively, in the intermediate years from 1990 through 2010. Mobile source NOx emissions will be reduced to 513 tons per day, and mobile source ROG emissions will be reduced to 195 tons per day. The effect of the existing control program and the improved control technology measures is illustrated graphically in Figures 13 and 14, which show baseline 1990 and 2010 emissions, as well as 2010 emissions with the improved control technology measures. Figures 13 and 14 also show the mobile source attainment emissions targets: 453 tons per day of NOx, and 116 tons per day of ROG. The figures show that the proposed improved control technology measures will ensure substantial progress towards attainment of the ambient air quality standards. Overall, the improved control technology measures will reduce NOx and ROG about 35 percent., 96379=BASELINE 1990 EMISSIONS (tons per day), 275571=Increased use of existing low-emission engines, primarily CNG-fueled, would be achieved through locally implemented demand-side programs and market incentives. This would result in a 5 percent sales penetration of 2.0 g/bhp-hr NOx engines throughout the period 1996 to 1999, and a 10 percent sales penetration of 2.0 g/bhp-hr NOx engines over the period 2000 to 2002. Other combinations of penetration and emissions levels that provide equivalent emission reductions, while minimizing any competitive impacts on urban fleets, could be implemented., 310172=If the U.S. EPA adopts a different 2005 emission standard than the standard on which the ARB has based its 1994 SIP revisions, the fleet average requirement and reduction assumptions would have to be revisited., 260423=The emission reductions due to the measure described here may be achievable in a variety of ways - including market measures as well as the traditional technology forcing standards. Development of cost-effective gasoline engine control technology that will allow most models to meet or exceed ultra-low emission vehicle (ULEV) standards in the post-2003 timeframe is expected. In addition, public acceptance of electric vehicles, coupled with anticipated advancements in battery technology and full implementation of supporting infrastructure, may result in zero-emission vehicle (ZEV) sales exceeding mandated levels post-2003. Advanced hybrid electric vehicles, with emission substantially less that ULEVs, also are expected to be available, allowing further penetration of electric vehicle technology with sub-ULEV emission levels into the light-duty market., 72900=2000- 2004, 108775=2010, 292583=Emission reductions of 8 tpd ROG and 78 tpd NOx beyond those due to the existing program are expected by 2010, with substantially greater reductions occurring post-2010, as more of the fleet is replaced through attrition., 131902=In 1990, total mobile plus stationary source emissions in the six non-attainment areas were 2,800 tons per day of NOx and 2,800 tons per day of ROG. Through implementation of this Mobile Source Element and the mobile source control measures that the ARB has already adopted, these emissions will be brought down about 60 percent for NOx and more than 80 percent for ROG. The significance of this decline cannot be understated -- nowhere in the world has such an aggressive approach to air pollution been taken. The ARB is obligated to see that the public health is protected to the extent required by the federal Clean Air Act, and this Mobile Source Element is our answer to the Act's requirements. Close cooperation from the U.S. EPA and the local districts is essential in implementing these programs. The ARB is committed to doing its part, in conjunction with the U.S. EPA, the districts, and the regulated industries, to bring about these necessary emission reductions and to thus assure the protection of public health in California., 243471=The following tables show some modifications made to the official baseline emissions inventory for a number of mobile emissions sources. These modifications were made either following recent regulatory action or as a result of re-evaluation of some emission data. The major modifications that were made were 1) accounting for the impact of California's enhanced inspection and maintenance (I/M) program; 2) adjusting for reduced emission rates of reactive organic gases from 1994 and later on-road heavy-duty diesel engines and off-road diesel engines subject to the ARB's 5.8 gram per brake-horsepower oxides of nitrogen standard; 3) accounting for the impact of the upcoming standards for on- and off-road diesel engines of 4.0 and 6.9 grams of nitrogen oxides per brake-horsepower-hour; 4) accounting for reduced emissions from in-port operations from ocean-going marine vessels. The tables present the baseline emissions values and the \"modified\" emission values of the modified baseline. This modified baseline is used as the baseline value throughout this document., 19209=In 1990, mobile source emissions in California's six serious, severe or extreme ozone areas were over 2,000 tons per day of NOx and 1,500 tons per day of ROG. These emissions are 73 percent of the total NOx emissions and 55 percent of the total ROG emissions in those areas. Figures 1 and 2 show the emission reductions that will be obtained over the next 15 years from mobile sources in the SCAB, the area with the most severe ozone problem, and the one that drives the emissions reductions sought in the mobile source element. Through implementation of the mobile source element and the mobile source control measures that the ARB has already adopted, these SCAB emissions will be reduced to 450 tons per day of NOx and 115 tons per day of ROG. This is a reduction of 60 percent for NOx and 86 percent for ROG. The significance of this decline cannot be understated -- nowhere in the world has such an aggressive approach to air pollution been taken. The past benefit of the state's program has been a 50 percent reduction in exposure to ozone in little more than a decade. Future progress must be equally dramatic., 319273=The U.S. EPA has proposed nationwide regulations that would reduce ROG emissions of new outboard and personal watercraft gasoline equipment in this category by 75 percent, with an emission cap for all other watercraft to be phased-in beginning in 1998. In addition, standards of 8.0 g ROG/kw-hr and 6.5 g NOx/kw-hr are being considered by the U.S. EPA with a five year phase-in beginning in 1998 for inboard and stern-drive gasoline engines. Emission reductions will be obtained using carburetor modifications, fuel injection, improved calibration and fueling systems, and possibly aftertreatment. In addition, since 4-stroke engines are significantly cleaner than 2-stroke engine configurations, a usage shift, which is expected, would result in substantial ROG emission reductions. Additional reductions of ROG emissions from current 4-stroke gasoline equipment are expected as well due to advancement in technology., 279971=This measure involves the annual retirement (scrapping or removal) of about 1,600 of the oldest, high emitting trucks in the South Coast Air Basin, beginning in 1999. A smaller number of trucks would be scrapped in 1996 to 1998 in order to gain experience with the program, and determine the impacts on the used truck market., 358417=October 1994, 71273=2001, 173619=The costs of control are estimated for both mobile and stationary sources for the year 2010 by multiplying the necessary emission reductions associated with the planned control strategies for 2010 by the cost-effectiveness estimate for each control measure. The average cost- effectiveness used for all consumer product categories was $2,100 per ton of ROG emission reduced. The cost-effectiveness for on-road mobile source categories ranged from a high of $16,000 to a low of $1,300 per ton of NOx and ROG reduced. For off-road mobile source categories, the cost-effectiveness varied from a low of $2,000 per ton of NOx and $390 per ton NOx and ROG reduced to a high of $4,000 per ton of NOx and $2,000 per ton NOx and ROG reduced. All costs are stated in constant 1994 dollars., 341609=June 1997, 100533=1116, 21180=Statewide, the emissions from consumer products (including aerosol paints) are projected to grow, if uncontrolled, from about 265 tons per day in 1990 to about 370 tons per day in 2010. As shown in Figure 3, consumer products comprise 15 percent of the nonvehicular ROG emissions in 1990. For the SCAB, emissions from consumer products and aerosol paint are projected to increase, if uncontrolled, from about 115 tons per day of ROG in 1990 to about 150 tons per day in 2010. While the existing consumer products regulatory program will result in emissions decreasing through the year 2005, this reduction will be overtaken by the increase in emissions due to projected population increases by the year 2010. This same upward trend in consumer product emissions will occur statewide., 47583=The existing control program will achieve significant reductions in total emissions in every non-attainment area mentioned. The specific estimates for the SCAB for 2010 are shown in Figures 3 and 4. The emission values in this report are based on modifications to the inventory produced by EMFAC7F, the ARB's model for estimating on-road mobile source emissions, and adjustments to the baseline emission inventory for some off-road sources. A summary of these modifications is shown in Appendix A. As Figures 3 and 4 clearly show, however, the existing control program must be greatly expanded to provide the emission reductions needed for attainment of the federal ambient air quality standard for ozone. Total SCAB baseline emissions in 2010 under the existing program would be 932 tpd NOx and 1054 tpd ROG. These baseline emissions would be in excess of estimated attainment emissions by 379 tons per day NOx and 731 tons per day ROG., 291510=With these technologies, an emission standard for new engines not primarily used in construction or farm equipment of 2.5 g/bhp-hr NOx will be adopted for year 2005 models. This would be a reduction of 64 percent from the new engine emission standard for engines 50 to 175 horsepower, which is being phased-in nationally beginning in 1997. The reduction would be 57 percent from the California 2001 new engine emission standard for engines 175 horsepower or greater. The technology used to meet these standards will also further reduce ROG emissions from post-2005 new engines., 48530=Focusing specifically on mobile source emissions in the SCAB, Figures 5 and 6 present mobile source emission estimates of NOx and ROG from 1990 to 2010 under the existing control program. The existing control program includes all regulations adopted by the ARB and the U.S. EPA. The dramatic reductions in the baseline mobile source ROG emissions over the period, as shown in Figure 6, are almost entirely the result of reductions in emissions from the fleet of light-duty vehicles as the ARB's Low-Emission Vehicle/Clean Fuels (LEV) program is implemented. The reductions in NOx emissions, shown in Figure 5, while significant, are of a lesser magnitude. Mobile source NOx emissions are dominated by off-road mobile sources and on-road heavy-duty vehicles, and the emission requirements that have been adopted to date for these classes of vehicles are not as effective as the LEV program., 108675=2007, 26880=The ARB's environmental review program has been certified by the Secretary of Resources pursuant to Public Resources Code section 21080.5, and Title 14, California Code of Regulations, section 15251. Pursuant to the terms of this certified regulatory program, the functional equivalent of an environmental impact report is provided by the ARB in adopting standards, rules, regulations, and plans., 290050=The ARB has adopted HC, NOx and PM standards for equipment 175 horsepower and above. By 1996, these sources will have to comply with a NOx standard of 6.9 g/bhp-hr. Effective in 2001, the NOx standard for engines 175 to 750 horsepower will be reduced to 5.8 g/bhp-hr. Engine technology used to meet the NOx standard of 5.8 g/bhp-hr will also reduce ROG emissions from post-2001 new engines by 50 percent. The U.S. EPA has sole authority to control new farm and construction equipment less than 175 horsepower, which accounts for 68 percent of the 2010 baseline NOx emissions of the under 175 hp subcategory. The U.S. EPA has adopted a nationwide NOx emission standard of 6.9 g/bhp-hr for compression-ignition (diesel) engines 50 horsepower and greater, to be phased-in beginning in 1997. The measure affects all equipment in this category, including the preempted farm and construction equipment., 195913=ECONOMIC IMPACTS OF THE SIP MEASURES FOR 2010 (MILLIONS OF 1994 DOLLARS), 349915=January 2002-2010, 210006=In addition, it may be possible to develop new markets for some retired vehicle components. For example, one accelerated vehicle retirement program has discovered a potential market for old tires in Vietnam where the tires will be shredded and used for roadbase. Original equipment manufacturers are also showing increased interest in recycled materials. Ford Motor Company is working with a thermoplastic rubber supplier to facilitate the recycling of old tires into new vehicle parts, such as brake-pedal pads, carpet backing, splash guards and weather seals. Ford is also using material from salvaged plastic Ford bumpers to mold new taillamp housings, and fabricating the plastic splash shields on 1994-model Ford Thunderbirds, Mercury Cougars, and Lincoln Continentals entirely from recycled battery casings. Ford research shows that vehicle parts made from recycled battery casings can be shredded, pelletized, and remolded into new parts up to 12 times., 303712=Technology being developed to meet more stringent standards for on-road diesel trucks and locomotives would be used. Assuming a life expectancy of 16 years for the captive fleet, the proposed measure would result in an overall NOx emission reduction of approximately 50 percent (3 tons per day) in 2010., 178574=Tables 3 and 4 provide the cost estimates for NOx and ROG for 2010 by different mobile source categories for the SCAB and the state as a whole. Although the SCAB accounts for about 40 percent of the required mobile source emission reductions in the state, it would bear about half of the statewide control costs of the SIP. This is because much of the scrappage program will occur in the SCAB., 358988=June 1998, 30757=Since the other non-attainment areas have a less severe problem than the SCAB, they each have earlier attainment dates than the SCAB's deadline of 2010. Because many of the proposed measures in the Mobile Source Element will not achieve their full effectiveness until the longer-term, special efforts will need to be made in these other areas to adopt near-term measures and incentive programs (such as encouragement to produce/procure cleaner technologies and retire higher-polluting vehicles and equipment faster). Quantification of the emission reductions that will be realized in other non-attainment areas of the state is discussed later in this document., 75101=1995, 76712=1998, 24965=(Note: This figure has been revised from the October 7, 1994 draft version of the SIP), 26060=Based upon estimates made by DRI/McGraw-Hill, in the year 2010 the California economy is expected to employ over 16 million people and produce goods and services valued at about $1.7 trillion. The direct and indirect costs associated with implementation of this plan is projected to reduce output by about 0.1 percent of the gross state product. Similarly, the plan is expected to reduce job opportunities by about 0.1 percent of the state employment in the year 2010. Putting this into perspective, with the SIP in place, employment is still expected to be over 16 million people in the year 2010 which represents 99.9 percent of the projected employment in 2010 that would be expected in the absence of these elements of the SIP., 314988=The U.S. EPA implemented a nationwide hydrocarbon emission standard for new commercial aircraft engines in 1984., 128500=While the specific benefits associated with each measure cannot be precisely estimated at this time, the ARB will ensure the additional needed emission reductions of 60 and 79 tons per day of NOx and ROG, respectively, are achieved. These reductions amount to an additional 7 percent reduction of NOx and 26 percent reduction of ROG in the South Coast Air Basin in 2010. The ARB will work in cooperation with the South Coast Air Quality Management District, as well as the regulated community, to determine the most appropriate mix of additional measures. These measures will be adopted no later than 2006 to ensure the needed emission reductions are achieved by 2009., 264035=The medium-duty vehicle designation consists of large pick-up trucks and vans (rated as having a gross vehicle weight rating of 6,001 to 14,000 pounds for 1995 and later model year and 6,001 to 8,500 pounds for pre-1995 model years). Emissions from these sources are combustion emissions (ROG, NOx, CO, and PM) and evaporative emissions (ROG). For simplicity, the emissions from all vehicles, gasoline and diesel, with gross vehicle weight ratings of 8,501 to 14,000 pounds, in addition to those with gross vehicle weight ratings between 6,001 pounds and 8,500 pounds, are included in the medium-duty source category for all years. The baseline ROG and NOx emissions for the SCAB from these sources are shown below. The 2010 baseline emissions represent 73 percent and 28 percent reductions of ROG and NOx emissions, respectively, from the 1990 baseline emission inventory., 141177=Consumer Products: includes personal care, household care, automobile care, and non-agricultural pesticide products, but excludes household use of architectural coatings. They contain volatile organic compounds, in quantities ranging from a few percent by weight up to 100 percent by weight. Statewide, uncontrolled emissions from consumer products are projected to increase from about 235 tons per day in 1990 to about 330 tons per day in 2010. Uncontrolled emissions from consumer products in the SCAB are projected to increase from about 100 tons per day in 1990 to about 135 tons per day in 2010., 266789=By applying expected advancements in emission control technologies developed for light- duty vehicles, the fraction of ULEVs that become part of the new medium-duty vehicle fleet will be increased beginning in 1998. The measure described here assumes that technological advancement will enable an increase in medium-duty ULEV's from 10 percent in 1998 model year to 100 percent in 2002 and later model years., 11744=1999, 224055=Stratospheric ozone depletion is included as a possible adverse environmental impact because of the possibility that, in an effort to comply with the proposed VOC regulations for consumer products, manufacturers may resort to use of solvents that are not considered VOCs (also known as \"exempt\" solvents in the regulations), some of which are ozone-depleting chemicals. We have determined that stratospheric ozone depletion will not occur as a result of adoption of these measures. We reached this conclusion because Title Vl of the federal Clean Air Act amendments of 1990 (CAAA) codifies and expands upon the revised Montreal Protocol to address the depletion of the stratospheric ozone layer. The law requires a complete phaseout of chlorofluorocarbons and haloes, along with interim reductions. Ozone-depleting substances have been grouped into two classes. Class I compounds (chlorofluorocarbons, haloes, carbon tetrachloride, and methyl chloroform) are scheduled to be phased out by the year 2000. All Class II compounds (hydrochlorofluorocarbons) will be phased out by 2030. Regulations have been adopted by the U.S. EPA to limit and phaseout the production of these substances and mandate or induce recycling programs for these substances., 69535=*The emission reductions associated with these measures are needed in Sacramento and Ventura to ensure attainment in 2005., 152748=Table 1 presents the emission reductions, relative to uncontrolled 1990 baseline emissions, resulting from the consumer product control strategy on non-attainment air basin ROG emissions. Table 2 shows the expected decrease in the combined emissions from consumer products and aerosol paint products from 1999 through 2010 as the consumer products control strategy is implemented. Table 3 shows the attainment year baseline forecasted emissions for each nonattainment air basin, the combined emission reductions to be achieved by the mid- and long-term measures (i.e., the emission reductions beyond the existing consumer product regulations), and the projected emissions from consumer products remaining after the emission reductions have been achieved from the new control measures. Statewide, upon full implementation of all control measures, the consumer products ROG emissions (including aerosol paints) will be reduced to about 50 tons per day in the year 2010. In the SCAB, the consumer product ROG emissions (including aerosol paints) in the year 2010 will be reduced to 20 tons per day, consistent with the AQMP., 6356=The Clean Air Act, as amended in 1990, requires a comprehensive attainment plan from every ozone nonattainment area classified as serious, severe or extreme. There are six of these areas in California, containing 11 separate air pollution control districts (see Table 1). The ozone plans were submitted to the United States Environmental Protection Agency (U.S. EPA) by November 15, 1994, as a revision to the California State Implementation Plan (SIP)., 154204=(Combined 1990 Emissions Baseline) and Emissions Reductions Claimed for Each Control Measure Relative to 1990 Baseline (Tons/Day), 294946=The category consists of off-road gasoline and LPG equipment greater than 25 horsepower and less than 175 horsepower, including forklifts, pumps, compressors, farm equipment, and construction equipment. The U.S. EPA has the sole authority to control new farm and construction equipment less than 175 horsepower, whose 2010 baseline emissions account for approximately 43 percent of ROG and NOx from this category. The baseline ROG and NOx emissions for the SCAB from these sources are shown below. The 2010 levels represent an increase of 50 percent in ROG and 56 percent in NOx from 1990 levels. The increase is due to growth., 59924=A list of these proposed new measures, including the estimated percent reduction from baseline 2010 emission levels, is given in Table 4. The measures presented in Table 4 are described in Appendix B., 63773=2000, 50359=The 2010 baseline emissions in the SCAB can be compared to the mobile source share of the attainment level: 453 tons per day of NOx and 116 tons per day of ROG. As shown in Figures 5 and 6, baseline 2010 mobile source emissions would need to be about half of what they are projected to be under the existing control program., 10673=PERCENT REDUCTION FROM 1990, 355799=The ARB staff is currently developing a regulation that is scheduled to be considered by the ARB in January 1995. The regulation will fulfill the state law requirement to implement a regulation that is designed to achieve a 60 percent emission reduction by December 31,1999, relative to the 1989 baseline year. The proposed regulation would establish VOC content limits specified for 35 different categories of aerosol paint. There are two tiers of standards proposed. The first tier of standards is proposed for January 1, 1996, and the second for December 31, 1999. Assuming no growth or decline in sales between 1990 and 2000, the currently proposed draft aerosol paint regulation would achieve emissions reductions in the SCAB of approximately 2 tons per day by 1996 and a cumulative total reduction of about 10 tons per day by December 31, 1999. The enabling legislation for this measure, requires the ARB to conduct a hearing on or before December 31, 1998 to determine the commercial and technological feasibility of achieving full compliance with the final limits. If appropriate, the ARB may grant an extension of time, not to exceed 5 years. During any such extension of time, the most stringent interim limits shall be applicable. A special recognition program which would recognize low-VOC aerosol paints is also being explored as a voluntary program that would augment the aerosol paint regulation. Such a program would be used to reward aerosol paints which achieve early compliance or lower their VOC content below the requirements in the aerosol paint regulation. The ARB staff intend to submit the aerosol paint regulation to the SIP in 1995, after approval by the Office of Administrative Law. Based on the current draft of the regulation, the ARB staff estimate that the cost effectiveness of the proposed regulation is $3 to $5 dollars per pound of VOC reduced. It is expected that when the second tier of standards is finally established, the cost effectiveness will be comparable to other VOC regulations adopted during the late 1990s., 276162=M5 - Additional NOx Reductions in California in 2002, 159623=CP-1 = Existing consumer products regulation only CP-2 = Mid-Term consumer products measure only CP-3 = Aerosol paints regulation in development for adoption in 1995 only CP-4 = Long-Term measures for both consumer products and aerosol paints, 24275=As shown in Figure 4, without additional measures for consumer products in the SIP, the emissions for consumer products will, after an initial decline due to existing regulations, continue to grow. Without the SIP control measures for consumer products, the projected emissions in 2010 for consumer products are about 35 percent of the attainment ROG emissions in the SCAB. With full implementation of the SIP component for consumer products, the emissions from consumer products will decrease to the attainment level of approximately 20 tons per day., 57420=Technology development in many of the off-road mobile source categories is expected to track on-road technology development, with the need for additional lead times for special applications. For off-road diesel equipment, technology transferred from on-road diesel engines is expected to be able to meet a 2.5 g/bhp-hr standard by 2005 through NOx aftertreatment, engine redesign, and EGR. In addition to these reductions in NOx emissions, technology advances should result in a 50 percent reduction in ROG for new on-road engines. For off-road gasoline and LPG equipment, emission reductions of 75 percent of ROG and 50 percent of NOx are projected by 2000 based on the use of closed-loop three-way catalysts., 257192=This measure involves the annual retirement (scrap or removal) of up to 75, 000 older, high- emitting vehicles in the South Coast Air Basin, beginning in 1999. A smaller number of vehicles will be retired in 1996 to 1998 in order to gain experience with the program, and to gain insight into effects on the used car market., 62299=Reduction in 2010 (tons/day), 266016=The reductions of emissions from this category of vehicles are the result of the implementation of more stringent new vehicle emission standards, including the low-emission vehicle (LEV) and ultra-low emission vehicle (ULEV) requirements starting in 1998., 89323=EMISSION REDUCTIONS FROM IMPROVED CONTROL TECHNOLOGY MEASURES (SCAB, from 2010 baseline), 332017=The near term measures for consumer products will consist of submitting the existing consumer products regulation and the recently adopted alternative control plan regulation to the U.S. EPA as a SIP revision. The existing regulations (Title 17, California Code of Regulations, Division 3, Chapter 1, Subchapter 8.5, Articles 1 and 2, Sections 94500-94517), which will achieve a 30% reduction in VOC emissions upon full implementation, will be submitted to U.S. EPA by November 15, 1994. The ACP will be submitted as part of the SIP in 1995. In addition, as part of the Near- Term Measures, the ARB will adopt a statewide regulation to achieve a 60% emission reduction from aerosol paints as required by the CCAA., 82741=The emergence of new, advanced emission control technologies has been a key factor in reducing emissions from motor vehicles over the past 30 years. The SIP continues to rely on further advances, as evidenced by the control measures listed in Table 4. It is believed that additional advances in emission control technology, beyond those identified in Table 4, will emerge, allowing further reductions in emissions. An example of a new advanced control technology measure (see Table 5) is the post-2003 introduction in fleets of ultra-low emitting heavy-duty trucks., 39230=1990 ROG INVENTORY SUMMARY FOR AFFECTED NONATTAINMENT AREAS, 165587=Controlled Emissions (Cont.) remaining after emission reductions are calculated as: [Uncontrolled Emissions in Year Given] X [1 - (Combined Cumulative Percent Emission Reductions in year given)] Example: For SCAB in 2005, Remaining Emissions = 135 (Uncontrolled) X [1 - (0.897 x 0.55 + 0.103 x 0.60)] (Combined Cumulative Reductions) = 60 Tons/Day Numbers are rounded., 193380=According to DRI/McGraw-Hill, in the year 2010 the California economy is expected to employ approximately 16.2 million people and produce goods and services valued at about $1.7 trillion in constant 1994 dollars. In comparison, the costs associated with implementation of the SIP are expected to reduce the growth of output of goods and services by about $2.0 billion in California, accounting for about 0.1 percent of the gross state product. The SIP is also expected to reduce job opportunities by about 20,000, or about 0.1 percent of employment level in California in the year 2010. Tables 5 and 6 show the impacts of the SIP's measures on the California output and employment in the year 2010., 22102=In the SCAB, an overall 85 percent reduction in consumer product emissions is needed in order to attain the federal ozone standard by 2010. This would reduce emissions from consumer products in the Basin to about 20 tons per day. Consumer products are not alone in this effort to maximize emission reductions from ROG sources. The South Coast Air Quality Management Plan requires several solvent source categories to achieve emission reductions ranging from 75 to 95 percent., 31427=This document consists of six sections: an introduction, a description of the existing control program, a discussion and schedule of planned control strategies, the estimated emissions impact of the improved technology controls, an explanation of how the additional new control technologies and techniques will be used to obtain additional emission reductions, and an assessment of the benefits of the Mobile Source Element. The section on the existing program describes baseline mobile source emissions (meaning the projected 2010 level of emissions, based on the existing control program). It shows that the existing control program, while very effective, will not reduce emissions sufficiently to achieve attainment of the federal ozone air quality standard in the SCAB. The improved control strategies section describes the mix of improved control technology measures and market-based technology measures that the ARB will pursue to achieve the additional emission reductions needed. Considerable technological challenges are associated with these measures. The section on the impact of planned measures based on expected improvements in technology shows the total emission reductions associated with the planned technology measures in comparison with the targeted attainment emission levels. The additional measures section of this document describes possible additional measures the ARB will need to employ to provide the additional emission reductions needed for attainment. This document concludes with a summary of the benefits of the Mobile Source Element, 352543=Volatile organic compound emissions from aerosol paint in California are estimated to be about 30 tons per day in 1990. In the SCAB, the 1990 baseline VOC emissions are estimated to be about 14 tons per day. However, VOC emissions from aerosol paints may have decreased since 1990 in California due to aerosol paint \"lockup laws\" designed to discourage graffiti, the adoption of the Bay Area's aerosol paint regulation, and the state of the economy in California. While the sales of aerosol paint are currently rising nationally, it is difficult to predict whether sales will rise or fall in California in the next decade. Assuming that sales remain flat overall from 1990 to 2000, then grow with population growth in the next decade, the emissions would be about 16 tons per day in 2010 in the SCAB., 65964=2002, 301924=Many ocean-going vessels are registered in foreign countries, and most use engines produced outside the U.S. Emissions from new engines used in these vessels can be most effectively reduced by establishing international emission standards, and the U.S. EPA and the International Maritime Organization have begun to address appropriate requirements. The proposed control measure would reduce NOx emissions from new diesel engines used in ocean- going vessels by 30 percent. Assuming a 30 year life expectancy for ocean-going ships, the proposed international standards would result in an overall NOx emission reduction of 10 percent for ocean-going ships in 2010., 280340=Incentives will be provided to operators of older trucks in return for retirement, and purchase of a newer, lower emitting model. The incentives may take the form of guaranteed low interest loans, or subsidies, or both. The lower maintenance and operating costs of newer diesel engines provide savings to help offset the repayment of the loan. A broad coalition of business interests has agreed to pursue legislation, if needed, to finance the retirement program. The financing mechanism will be secured by the end of 1995., 349744=December 2001, 341184=March 1996, 203293=Finally, this chapter cannot and does not contain a detailed, quantitative impact analysis. Because the ARB activity which is subject to discussion is a plan for future action which commits the agency to consideration of measures which will yield specified emission reductions but for which specific regulatory language has not been developed, this analysis is necessarily general and qualitative. If the plan is adopted, the measures will be developed over time and proposed in regulatory (rule) format with full public participation. Each measure will undergo a detailed environmental analysis as required by the California Environmental Quality Act (CEQA), will be aired at public workshops, and will be shepherded through the public hearing process required by law (see the Administrative Procedure Act, Gov. Code section 11340 et seq.). When specific regulatory language is developed, it will be possible to analyze potential environmental impacts in detail and with reference to numerical data. Here, potential negative impacts are explored to the extent currently feasible without engaging in conjecture and speculation. (As noted in the Executive Summary, the ARB portion of the SIP is comprised of both proposed measures and regulatory controls already adopted; the latter have already gone through an environmental analysis at the time they were adopted. Persons wishing to review these analyses may obtain copies of prior ARB staff reports associated with the adopted rules from our Public Information Office.), 273181=Heavy-duty bus engines that use alternative fuels can achieve an emission level of 2.0 g/bhp-hr NOx now. In the near future, additional alternatively-fueled truck engines that emit at 2.0 g/bhp-hr NOx or less are expected to be put in service although, practically, they may be limited to urban fleets. Diesel engine control technology is expected to be able to meet a 2.0 g/bhp-hr NOx emission standard by 2002 by using improved engine design (especially in fuel/air management and delivery), exhaust gas recirculation, and exhaust gas aftertreatment. This emission level is a 50 percent reduction from the current federal standard applicable to 1998 and later model year engines. Use of this technology will also reduce ROG emissions by 50 percent compared to 1994 model engines. Other technologies (electric, hybrid-electric, fuel cells) are projected to be able to achieve NOx emissions of less than 1.0 g/bhp-hr in a future timeframe that is less certain., 75196=2000- 2010, 333525=Many consumer products are not regulated under California's consumer product regulation. According to a recent survey conducted by the U.S. EPA, there are over 200 consumer product categories that would be considered as \"consumer products\" according to the definition in California Health and Safety Code Section 41712. Currently only 27 consumer product categories are subject to ARB regulations. The ARB staff intend to develop and implement by the year 2005 regulations for additional product categories not currently subject to existing regulations. These regulations, which are referred to as Phase IIl, would be developed over the next two years with the ARB adoption scheduled for July 1997 with full implementation of all standards by 2005. To determine the appropriate categories for control, the ARB staff will evaluate those product categories identified in the U.S. EPA survey that are not subject to current ARB regulations. These product categories are identified in Table 2. Examples include lubricants, aerosol tire inflators, specialty cleaners, nail polish, and numerous other categories. Since the additional products have never been regulated with respect to the VOC content, and are responsible for about half of the consumer products inventory, we are projecting an additional reduction of 25 percent or about 65 tons per day statewide and about 30 tons per day in the SCAB from the 1990 baseline emissions. This 25% reduction is slightly less than the emission reductions achieved from the existing regulations, in part due to the fact that the larger consumer product categories, most notably hair sprays and automotive windshield washer fluid, were regulated in the existing regulations and were responsible for a significant portion of the emission reductions achieved by these regulations. During the Phase III development process, we will also work to further our understanding of photochemical reactivity of consumer product VOCs and evaluate the applicability of incorporating reactivity considerations. The proposed implementation schedule for these regulations is presented below. Although it is impossible to fully estimate the cost of such measures at this time, we expect that the overall cost effectiveness (in terms of \"dollars per ton of pollutant reduced\" will be comparable to that of other VOC measures being adopted in the late 1990's timeframe. The actual cost impacts of the regulations will be quantified and evaluated during the regulatory development process., 469=Adopted: November 15, 1994, 301372=The emissions inventory for 1990 represents 24 tons per day of NOx from ocean-going marine vessels and 6 tons per day of NOx from non-ocean going vessels., 175683=ESTIMATES OF TOTAL ANNUAL COSTS FOR THE YEAR 2010 OF THE PLANNED CONTROL MEASURES (MILLIONS OF 1994 DOLLARS), 179541=ESTIMATES OF THE COSTS FOR ROG EMISSION REDUCTIONS FOR 2010 BY CONSUMER PRODUCTS CATEGORIES (MILLIONS OF 1994 DOLLARS), 277058=The U.S. EPA must adopt a 2.0 g/bhp-hr NOx emission standard for new engines applicable nationwide in 2004. Earlier introduction of this standard on a nationwide basis, although feasible, is prohibited by the federal Clean Air Act. This restriction should be reconsidered by Congress., 108575=2005, 345433=With innovative technological breakthroughs, the new technology control measures along with the market incentive measures can achieve an additional 30 percent reduction or 80 tons per day statewide and 35 tons per day in the SCAB from the 1990 baseline emissions. All combined, the existing consumer products regulations and the mid-term measures, along with the proposed Long Term Measures, are designed to achieve approximately a 85 percent reduction from 1990 baseline emission levels. It is very difficult to project the cost of the new control measures that will rely on technology not yet available. However, we expect the cost effectiveness of these future control strategies to be similar to the cost of other VOC control measures being adopted around the 2010 timeframe., 138789=To reach attainment in the SCAB and elsewhere in California, significant additional emission reductions are needed. Air quality modeling shows that the existing emissions of ROGs from ail sources in the six areas that require SIP revisions by November 15, 1994, must be reduced between 25% and 80% to attain the federal ozone standard. In the SCAB, an overall 85% reduction in consumer product emissions is needed by 2010. This would reduce emissions from consumer products in the Basin to about 20 tons per day. Consumer products are not alone in this effort to maximize emission reductions from ROG sources. The SCAB Air Quality Management Plan (AQMP) requires several solvent source categories to achieve emission reductions ranging from 75 to 95 percent, in most cases these emission reductions are in addition to significant emission reductions achieved by rules adopted prior to January 1, 1994., 302941=Emission reductions achieved by the proposed ocean-going ship control measures are dependent upon actual ship operations and associated emissions. Uncertainty remains regarding the actual emissions of this previously unregulated source and the emission inventory is under review. It is, however, estimated that the proposed ocean-going ship international engine standards and ship traffic control measures combined could reduce emissions by approximately 6 tons of NOx per day in the year 2010., 145148=To achieve even further emission reductions in the mid-term, the ARB will adopt additional regulations to reduce ROG emissions from product categories not currently regulated. Based on a recent U.S. EPA survey of consumer products, there are over 200 different types of consumer products. The existing ARB consumer products regulations regulate 27 categories, leaving over 150 product categories as potential candidates for control under the mid-term program. To help guide the development and implementation of the mid-term and long-term programs, a consumer products working group will be established. This working group, that will include representation from U.S. EPA, ARB, industry, the local districts, and environmental groups, will provide a forum for communication, cooperation, and coordination during the development of consumer products control measures. It is expected that the mid- term regulations will be adopted by July 1, 1997 and will be designed to produce at least an additional 25 percent reduction relative to the uncontrolled consumer product emissions in the year 2005. These mid- term emission reductions are also necessary in the Sacramento Metropolitan Area and Ventura to demonstrate attainment by 2005., 274185=Heavy-duty vehicles that are registered in other states and participate in interstate commerce are substantial contributors to the total emissions from heavy-duty diesel vehicles (emissions from out-of-state vehicles are projected to account for about 25 percent of emissions from this category in 2010 if the existing similar state and federal emission standards remained in place). State regulations cannot effectively achieve emission reductions from these trucks. In addition, if state requirements become substantially different and more stringent than the U.S. EPA requirements, California-based purchasers of new trucks would have an incentive to buy their vehicles in the other states in which they operate. This would increase the number of federally-certified heavy-duty trucks operating in California. For these reasons, attainment of air quality standards in California is absolutely dependent on the U.S. EPA adopting a more stringent NOx emission standard, applicable nationwide., 137808=Statewide, the emissions from consumer products (including aerosol paints) if uncontrolled are projected to grow from about 265 tons per day in 1990 to about 370 tons per day in 2010. As shown in Figure 1, based on the 1990 summer operational inventory, consumer products comprise 15 percent of the non vehicular emissions in 1990. For the SCAB, emissions from consumer products and aerosol paint are projected to increase from about 115 tons per day of ROG in 1990 to about 150 tons per day in 2010. While the existing consumer products regulatory program will result in emissions decreasing through the year 2005, this reduction will be overtaken by the increase in emissions due to projected population increases by the year 2010. This same upward trend in consumer product emissions will occur statewide., 94228=Off-Road Equipment: includes a variety of off-road mobile sources, including farm and construction equipment, generators, refrigeration units, utility service vehicles, and airport ground support equipment, much of which is diesel-powered. A nationwide 2.5 g/bhp-hr NOx standard for all new diesel engines in this category beginning in 2005 would achieve reductions of about 60 percent over adopted new engine standards. Nationwide ROG standards could also reduce new diesel engine emissions by about 50 percent. A nationwide standard for preempted gasoline and LPG equipment could yield a 50 percent reduction in NOx and a 75 percent reduction in ROG emissions from new engines. The ARB plans more stringent emission standards for some of the non-preempted equipment in this category, including equipment fueled with liquefied petroleum gas, gasoline, and diesel fuel., 323930=The ARB has primary authority over consumer products and has taken several regulatory actions over the past 5 years to reduce the VOC emissions from consumer products. The existing ARB regulations cover 27 product categories which are identified in Table 1. (Title 17, California Code of Regulations, Division 3, Chapter 1, Subchapter 8.5, Articles 1 and 2, sections 94500-94517) These regulations were adopted in accordance with the California Clean Air Act requirements for reducing VOC emissions from consumer products and reduce VOC emissions primarily through \"command-and-control\" methods. Under this approach, the regulations specify maximum allowable VOC content limits (by weight percent) for individual product categories. The existing regulations provide additional flexibility through the Innovative Products provision. This provision allows the sale of a product which exceeds the limits but, through special formulation or packaging, emits less VOCs than a representative product which meets the applicable limit. The existing regulations will result in approximately a 30 percent reduction in the VOC emissions from consumer products relative to the 1990 emissions baseline. While these regulations are not currently part of the SIP, the ARB staff is currently preparing the regulations for SIP submittal by November 15, 1994, to ensure that these measures which are needed for progress and attainment in the SCAB and other non-attainment districts are recognized by U.S. EPA., 358599=January 1995, 146545=The near and mid-term reduction measures rely on available technology and will be adopted within the next 2-1/2 years and fully implemented by 2005. The reductions to be realized from the longer term measures will rely on new and innovative technologies that are not currently available, but that can reasonably be expected provided efforts are made to foster and promote research and development into new technologies. The federal CM recognizes the need that extreme areas may have to rely on these evolving technologies to meet attainment goals and specifically authorized the inclusion of such measures in the SIP under Section 182(e)(5), provided such measures are not needed to achieve emission reductions before 2000., 187349=ESTIMATES OF THE COSTS FOR ROG EMISSION REDUCTIONS FOR 2010 BY MOBILE SOURCE CATEGORIES (MILLIONS OF 1994 DOLLARS), 64432=1997, 323210=The 1990 ARB emissions inventory shows about 235 tons per day statewide and 100 tons per day in the SCAB of consumer product VOC emissions, not including approximately 30 tons per day statewide and 14 tons per day in the SCAB from aerosol paints. The SCAB consumer products baseline controlled emissions are projected to be approximately 80 and 95 tons per day in the years 2000 and 2010, respectively, based on an estimated overall control efficiency of 30 percent. Without these regulations, the baseline uncontrolled emissions for consumer products in the SCAB are projected to be about 117 and 135 tons per day in the years 2000 and 2010, respectively., 56729=The largest amount of additional emission reductions will be from on-road and off-road diesel engines, with technology development spearheaded by on-road heavy-duty diesel truck standards. In the near-term, the existing 4.0-gram per brake horsepower-hour (g/bhp-hr) federal NOx standard is expected to be met with improved fuel/air management and combustion modifications. By 2002, technology is projected to be able to meet a 2.0 g/bhp-hr NOx standard through further improved fuel/air management, additional combustion modifications, exhaust gas recirculation (EGR), and NOx after treatment. Urban buses and heavy-duty gasoline vehicles are expected to meet equivalent standards., 198576=Overall, the mobile source and consumer products elements of the SIP are estimated to result in direct costs on the order of $1 billion per year by 2010. Taking into account indirect costs, the measures in the plan are expected to reduce total economic output by approximately $2.0 billion. Not included in this assessment is the fact that the measures proposed in the SIP will also result in many benefits that we were not able to quantify. Nonetheless, the impacts of the increased costs to the California economy is small on a percentage basis. Changes in employment and output will account for a small fraction of one percent of total employment and output in California in the year 2010.}",
    "textBeforeTable": "THE SIP'S EFFECTS ON THE CALIFORNIA ECONOMY IN THE YEAR 2010 TABLE 5 According to DRI/McGraw-Hill, in the year 2010 the California economy is expected to employ approximately 16.2 million people and produce goods and services valued at about $1.7 trillion in constant 1994 dollars. In comparison, the costs associated with implementation of the SIP are expected to reduce the growth of output of goods and services by about $2.0 billion in California, accounting for about 0.1 percent of the gross state product. The SIP is also expected to reduce job opportunities by about 20,000, or about 0.1 percent of employment level in California in the year 2010. Tables 5 and 6 show the impacts of the SIP's measures on the California output and employment in the year 2010. Increased costs of the planned control measures will affect the California economy through many complex interactions. The end results of these complex interactions can be summarized by estimating their effects on state output (gross state product) and employment. Our impact evaluation assumes that the planned control measures may increase the cost of doing business in California for firms located in the state. This evaluation does not account for the enormous benefits to California businesses that the development of new technologies will bring. We expect that our industries will benefit economically from not only technological advancement, but also new product opportunities and healthier, more productive labor force. These benefits in many instances may more than offset the costs",
    "textAfterTable": "TABLE 6 ECONOMIC IMPACTS OF THE SIP MEASURES FOR 2010 (MILLIONS OF 1994 DOLLARS)   OUTPUT CHANGES JOB CHANGES SCAB STATEWIDE SCAB STATEWIDE Stationary Sources 150 372 1,618 4,022 On-Road Mobile Sources 525 962 4,587 8,397 Off-Road Mobile Sources 268 707 2,719 7,163 TOTAL 943 2,041 8,924 19,582 IV. CONCLUSION Overall, the mobile source and consumer products elements of the SIP are estimated to result in direct costs on the order of $1 billion per year by 2010. Taking into account indirect costs, the measures in the plan are expected to reduce total economic output by",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}