{
    "relation": [
        [
            "Condition:",
            "Time Period, War:",
            "MPN:",
            "Other:"
        ],
        [
            "New: A brand-new, unused, unopened, undamaged item (including handmade items). See the seller's listing for full details. See all condition definitions- opens in a new window or tab ... Read moreabout the condition",
            "1990-NOW",
            "LBT-6094A",
            "NSW Navy Seal DevGru AOR1 AOR2 Mas Grey"
        ],
        [
            "Brand:",
            "Color:",
            "Type:",
            "Country:"
        ],
        [
            "London Bridge Trading Company",
            "MAS GREY",
            "Military",
            "USA"
        ]
    ],
    "pageTitle": "",
    "title": "",
    "url": "http://www.ebay.ca/itm/LBT-6094A-MAS-GREY-Modular-Medium-Plate-Carrier-/231220145793?pt=LH_DefaultDomain_0&hash=item35d5cb6e81",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042985140.15/warc/CC-MAIN-20150728002305-00081-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 417381999,
    "recordOffset": 417284818,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Item specifics View all revisions Last updated on  Oct 21, 2014 20:35:28 EDT  Seller assumes all responsibility for this listing. 231220145793 eBay item number: Shipping and payments Description current Report item - opens in a new window or tab Covers your purchase price and original shipping. Get the item you ordered or get your money back. Money Back Guarantee  | See details - opens in a new window",
    "textAfterTable": "London Bridge Trading Co. has long been recognized as one of the top manufacturers of tactical nylon gear and accessories.  All of the LBT gear is 100% made in the USA and Berry Compliant. Be sure to visit our eBay store which will soon be filled with LBT items at fantastic deals!  Thank you for viewing our auctions and happy bidding! *EBAY THIS AUCTION IS FOR NYLON GEAR. THERE IS NO ARMOR INCLUDED* I WILL DO DISCOUNTS FOR LOT PURCHASES!!! You are Bidding on a New London Bridge Trading Company LBT-6094A MAS GREY Modular Medium Plate Carrier General Features The ultimate in plate carrier performance MODULAR web attachment points on entire vest profile provide maximum versatility Front, back, and side plate compatible Quick release tabs for front and back plate removal Concealable rear adjustment in cummerbund style side panels constructed with elastic for comfort and ease of movement Padded shoulder straps with additional removable wrap around pads offer extra comfort and support Wire, antenna or hydration hose guides Spine plate sleeve Reinforced drag handle Centered front pouch provides easy access to maps, magazines, or utility gear Interior loop attachment points for shoulder or collar soft armor Interior side radio",
    "hasKeyColumn": true,
    "keyColumnIndex": 1,
    "headerRowIndex": 0
}