{
    "relation": [
        [
            "Religion",
            "Catholic",
            "Evangelical Protestant",
            "Mainline Protestant",
            "None"
        ],
        [
            "Adherents",
            "939",
            "764",
            "144",
            "2,576"
        ],
        [
            "Congregations",
            "3",
            "4",
            "2",
            "-"
        ]
    ],
    "pageTitle": "Fence, Wisconsin (WI 54120) profile: population, maps, real estate, averages, homes, statistics, relocation, travel, jobs, hospitals, schools, crime, moving, houses, news, sex offenders",
    "title": "",
    "url": "http://www.city-data.com/city/Fence-Wisconsin.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042985140.15/warc/CC-MAIN-20150728002305-00071-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 375280220,
    "recordOffset": 375180364,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{609=Graphs represent county-level data. Detailed 2008 Election Results, 2037=1996 Presidential Elections Results, 1465=2004 Presidential Elections Results, 11589=Ozone [ppb] level in 2012 was 34.0. This is about average. Closest monitor was 6.0 miles away from the city center., 893=2012 Presidential Elections Results, 23908=On 6/25/1950, a category F4 (max. wind speeds 207-260 mph) tornado 39.9 miles away from the Fence town center killed 2 people and injured 12 people and caused between $50,000 and $500,000 in damages., 13082=Nitrogen Dioxide (NO2) [ppb] level in 2012 was 1.16. This is significantly better than average. Closest monitor was 19.6 miles away from the city center., 13727=Air Quality Index (AQI) level in 2012 was 65.9. This is about average., 12337=Sulfur Dioxide (SO2) [ppb] level in 2012 was 0.692. This is significantly better than average. Closest monitor was 19.6 miles away from the city center., 23598=On 7/4/1986, a category F3 (max. wind speeds 158-206 mph) tornado 24.8 miles away from the town center injured 12 people and caused between $50,000 and $500,000 in damages., 4856=Educational Attainment (%) in 2000, 10890=Particulate Matter (PM10) [µg/m3] level in 2011 was 5.00. This is significantly better than average. Closest monitor was 19.6 miles away from the city center., 73669=We are giving away $1200 in prizes - enter simply by sending us your own city pictures!, 1751=2000 Presidential Elections Results, 1179=2008 Presidential Elections Results, 10120=Particulate Matter (PM2.5) [µg/m3] level in 2012 was 4.97. This is significantly better than average. Closest monitor was 19.6 miles away from the city center., 53842=Elevation: 1548 feet, 4458=School Enrollment by Level of School (%) in 2000}",
    "TableContextTimeStampAfterTable": "{4490=6.82% of this county's 2011 resident taxpayers lived in other counties in 2010 ($32,508 average adjusted gross income), 6318=6.16% of this county's 2010 resident taxpayers moved to other counties in 2011 ($31,726 average adjusted gross income), 27512=Recent home sales, price trends, and home value evaluator powered by Onboard Informatics © 2015 Onboard Informatics. Information is deemed reliable but not guaranteed.   City-data.com does not guarantee the accuracy or timeliness of any information on this site.  Use at your own risk. Website © 2015 Advameg, Inc.}",
    "textBeforeTable": "Religion statistics for Fence town (based on Florence County data) Graphs represent county-level data. Detailed 2008 Election Results 2012 Presidential Elections Results 2008 Presidential Elections Results 2004 Presidential Elections Results 2000 Presidential Elections Results 1996 Presidential Elections Results 2012 2008 2004 2000 1996 Presidential Elections Results Fuel oil, kerosene, etc. (4%) Utility gas (7%) Wood (38%) Bottled, tank, or LP gas (51%) Most commonly used house heating fuel:",
    "textAfterTable": "Source: Clifford Grammich, Kirk Hadaway, Richard Houseal, Dale E.Jones, Alexei Krindatch, Richie Stanley and Richard H.Taylor. 2012. 2010 U.S.Religion Census: Religious Congregations & Membership Study. Association of Statisticians of American Religious Bodies. Jones, Dale E., et al. 2002. Congregations and Membership in the United States 2000. Nashville, TN: Glenmary Research Center. Graphs represent county-level data Food Environment Statistics: Number of grocery stores: 2 Florence County: 4.22 / 10,000 pop. Wisconsin: 1.86 / 10,000 pop. Number of convenience stores (no gas): 1 Florence County: 2.11 / 10,000 pop. Wisconsin: 0.38 / 10,000 pop. Number of convenience stores (with gas): 4 Florence County: 8.43 / 10,000 pop. State: 4.12 / 10,000 pop. Number of full-service restaurants: 7 Here: 14.76 / 10,000 pop. State: 8.64 / 10,000 pop. Adult diabetes rate: This county: 8.3% Wisconsin: 7.6% Adult obesity rate: Florence County: 27.9% Wisconsin: 27.5%",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}