{
    "relation": [
        [
            "Categories",
            "Campus Safety",
            "Clubs and Activities",
            "Great for these types of students",
            "Bang for the buck",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "A bunch of people who look like they easily got the job.",
            "Intramuals, Campus minisrty, theres many many many clubs here",
            "Students who have no intentions on a social life or having fun.",
            "Save your money and go somewhere for cheaper !",
            "Its what you make it. Majority of students go home on the weekend so it basically a ghost town. New York is about fifteen minutes away by train. Jersey City really doesn't have much. Threes also the rec and pool I guess.",
            "This is college not a five star restaurant. The food is pretty decent but can get tiring after a while because they do serve somethings every single day. For instance there are french fries, burgers, hot dogs, grilled cheese, make your own snadwhich, salad, etc. every single day. Some days the food is good other days its not. I guess it depends, but its reasonable. There are also other surrounding fast food places in the neighborhood. Burger King, Subway, Popeyes, chinease, Golden Crust just to name a few.",
            "There are three dorms for freshmen that are co-ed female on one floor, men are the other, etc. they aren't bad its really up to students on how they will keep the enviornment clean. There is no curfew set, you can have over night guess as long as it is okay with your roommate and they have to be of same sex. Down the hill there are apartments for upperclassmen. I have only been in one and there are about 2-6 people in a room. They have total freedom basically its like living on your own. But I think the dorms are way better. Including the fact that they have single dorms.",
            "I am a criminal justice major and it is quite good, most students here are Bio majors I hear that the program is one of the college's best. Here as a freshmen it is mandatory to take an english, math, Art Visual class and music class. Which are an hour and fifteen minutes. I am not pleased that it is mandatory because this is not high school you might as well squeeze in gym class.",
            "If you want a full, fun college experience don't come here. Its overpriced and I think if you spend money you should be happy where you are receiving an education. Mostly all students say this was not their first choice school, including mine and they only came here because of the amount of scholarship money they've received because it is indeed a generous amount.",
            "This school is really dull/ boring, even if you don't want a party school you will be very unhappy here as I currently am. There is not much to do here besides eat, sleep, and go to New York that's as good as it gets. Although the classes are taught by some well educated professors some better than others."
        ]
    ],
    "pageTitle": "Saint Peter's University Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Saint-Peters-University/reviews?_escaped_fragment_=/show/56586",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042985140.15/warc/CC-MAIN-20150728002305-00316-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 892828959,
    "recordOffset": 892788808,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{63648=Peacock Palooza is our early May event (pre-Finals week), It is so much fun and there are lots of activities: we have everything from live bands to games and lots (LOTSSSS) of free giveaways., 183999=© 2015, Cappex.com, LLC, 43815=i suggest that you keep your things close. i had my wallet stolen on halloween 2011. campus safety and jcpd were quick to respond but it was too late. also, there are several robbery, theft, and a few intruder reports.}",
    "textBeforeTable": "01/05/2010 Reviewer is A current student here. 7 out of 7 people found this review useful. 1 of 43 Erica from Newark, NJ Check out reviews left by other students or leave your own review. You could win a free scholarship. Saint Peter's University Reviews Saint Peter's University › New Jersey › By State › Colleges › } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.create', -->",
    "textAfterTable": "Am learning a lot I am learning different things at Saint Peter's College. Saint Peter's College is a great college that has professors that understand you and know when you are in need they are always making time. Login to rate or flag the reviews Imani from Trenton, NJ 11/16/2010 Reviewer is A current student here. 1 out of 1 people found this review useful. 3 of 43 Categories Comments Great for these types of students It is great for all students that have good study habits. If you study like three times a week, you will be good. Tips for prospective students Pick your classes and professors wisely. There are some professors here that are hard core and others that are very lenient. Visit the college and talk to some current students to see which professor that will fit you best. Bang for the buck This school has a",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}