{
    "relation": [
        [
            "Published Date",
            "Nov 16, 2012",
            "Sep 14, 2012",
            "Aug 31, 2012",
            "Jan 23, 2012",
            "Dec 7, 2011",
            "Aug 11, 2010",
            "Nov 20, 2009",
            "Mar 1, 2007",
            "Nov 17, 2006"
        ],
        [
            "Version",
            "14 (current)",
            "13",
            "12",
            "11",
            "10",
            "9",
            "6",
            "2",
            "1"
        ],
        [
            "Files",
            "download",
            "download",
            "download",
            "download",
            "download",
            "download",
            "download",
            "download",
            "download"
        ]
    ],
    "pageTitle": "DailyMed - PULMICORT RESPULES- budesonide suspension",
    "title": "",
    "url": "http://dailymed.nlm.nih.gov/dailymed/drugInfo.cfm?id=81925&dictionary=on",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438044160065.87/warc/CC-MAIN-20150728004240-00197-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 58419835,
    "recordOffset": 58372724,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{65620=The therapeutic effects of conventional doses of orally inhaled budesonide are largely explained by its direct local action on the respiratory tract. To confirm that systemic absorption is not a significant factor in the clinical efficacy of inhaled budesonide, a clinical study in adult patients with asthma was performed comparing 400 mcg budesonide administered via a pressurized metered dose inhaler with a tube spacer to 1400 mcg of oral budesonide and placebo. The study demonstrated the efficacy of inhaled budesonide but not orally administered budesonide, even though systemic budesonide exposure was comparable for both treatments, indicating that the inhaled treatment is working locally in the lung. Thus, the therapeutic effect of conventional doses of orally inhaled budesonide are largely explained by its direct action on the respiratory tract., 45131=The efficacy of PULMICORT RESPULES at doses of 0.25 mg and 0.5 mg twice daily was evaluated in 133 pediatric asthma patients, 4 to 8 years of age, previously maintained on inhaled corticosteroids (mean FEV1 79.5% predicted; mean baseline nighttime asthma symptom scores of the treatment groups ranged from 1.04 to 1.18; mean baseline dose of beclomethasone dipropionate of 265 mcg/day, ranging between 42 to 1008 mcg/day; mean baseline dose of triamcinolone acetonide of 572 mcg/day, ranging between 200 to 1200 mcg/day). The changes from baseline to Weeks 0-12 in nighttime asthma symptom scores are shown in Figure 2. Nighttime asthma symptom scores showed statistically significantly decrease in patients treated with PULMICORT RESPULES compared to placebo. Similar decreases were also observed for daytime asthma symptom scores., 49981=Three double-blind, placebo-controlled, parallel group, randomized U.S. clinical trials of 12-weeks duration each were conducted in 1018 pediatric patients, 6 months to 8 years of age, 657 males and 361 females (798 Caucasians, 140 Blacks, 56 Hispanics, 3 Asians, 21 Others) with persistent asthma of varying disease duration (2 to 107 months) and severity. Doses of 0.25 mg, 0.5 mg, and 1 mg administered either once or twice daily were compared to placebo to provide information about appropriate dosing to cover a range of asthma severity. A Pari-LC-Jet Plus Nebulizer (with a face mask or mouthpiece) connected to a Pari Master compressor was used to deliver PULMICORT RESPULES to patients in the 3 U.S. controlled clinical trials. The co-primary endpoints were nighttime and daytime asthma symptom scores (0-3 scale). Improvements were addressed in terms of the primary efficacy variables of changes from baseline to the double-blind treatment period in nighttime and daytime asthma symptom scores (scale 0-3) as recorded in the patient diaries. Baseline was defined as the mean of the last seven days prior to randomization). The double-blind treatment period was defined as the mean over 12 week treatment period. Each of the five doses discussed below were studied in one or two, but not all three of the U.S. studies., 4258=NDC 0186-1988-04, 4984=©AstraZeneca 2007, 2010, 68017=Budesonide is an anti-inflammatory corticosteroid that exhibits potent glucocorticoid activity and weak mineralocorticoid activity. In standard in vitro and animal models, budesonide has approximately a 200-fold higher affinity for the glucocorticoid receptor and a 1000-fold higher topical anti-inflammatory potency than cortisol (rat croton oil ear edema assay). As a measure of systemic activity, budesonide is 40 times more potent than cortisol when administered subcutaneously and 25 times more potent when administered orally in the rat thymus involution assay. The clinical significance of these findings is unknown., 64185=Pre-treatment with budesonide administered as 1600 mcg daily (800 mcg twice daily) via a dry powder inhaler for 2 weeks reduced the acute (early-phase reaction) and delayed (late-phase reaction) decrease in FEV1 following inhaled allergen challenge., 11694=Call your healthcare provider for medical advice about side effects. You may report side effects to AstraZeneca at 1-800-236-9933 or the FDA at 1-800-FDA-1088 or www.fda.gov/medwatch., 135660=To report SUSPECTED ADVERSE REACTIONS, contact AstraZeneca at 1–800–236–9933 or FDA at 1-800-FDA-1088 or www.fda.gov/medwatch (6), 82224=These same data were utilized in a second study bringing the total to 2534 infants whose mothers were exposed to inhaled budesonide. In this study, the rate of congenital malformations among infants whose mothers were exposed to inhaled budesonide during early pregnancy was not different from the rate for all newborn babies during the same period (3.6%)., 83451=Teratogenic Effects: Pregnancy Category B – Studies of pregnant women, have not shown that inhaled budesonide increases the risk of abnormalities when administered during pregnancy. The results from a large population-based prospective cohort epidemiological study reviewing data from three Swedish registries covering approximately 99% of the pregnancies from 1995-1997 (ie, Swedish Medical Birth Registry; Registry of Congenital Malformations; Child Cardiology Registry) indicate no increased risk for congenital malformations from the use of inhaled budesonide during early pregnancy. Congenital malformations were studied in 2014 infants born to mothers reporting the use of inhaled budesonide for asthma in early pregnancy (usually 10-12 weeks after the last menstrual period), the period when most major organ malformations occur. The rate of recorded congenital malformations was similar compared to the general population rate (3.8% vs. 3.5%, respectively). In addition, after exposure to inhaled budesonide, the number of infants born with orofacial clefts was similar to the expected number in the normal population (4 children vs. 3.3, respectively)., 2791=NDC 0186-1986-04, 133914=Revised: 7/2010}",
    "textBeforeTable": "Number of versions: 9 PULMICORT RESPULES- budesonide suspension View Label Archives for this drug View Label Archives, RxNorm, Get Label RSS Feed More Info on this Drug Medline Plus, Clinical Trials, PubMed, Biochemical Data Summary Related Resources Report Adverse Events, FDA Safety Recalls, Presence in Breast Milk Safety (also available in the left menu) Find additional resources Close All Sections View All Sections Close MANUFACTURE(0186-1988, 0186-1989, 0186-1990) , RELABEL(0186-1988, 0186-1989, 0186-1990) , REPACK(0186-1988, 0186-1989, 0186-1990) 176650158 AstraZeneca LP Business Operations ID/FEI Address Name Establishment Registrant - AstraZeneca PLC (230790719) Labeler - AstraZeneca LP (176650158) 09/17/2007 NDA020929 NDA",
    "textAfterTable": "RxNorm PULMICORT RESPULES- budesonide suspension RxCUI RxNorm NAME RxTTY 1 252559 Budesonide 0.5 MG/ML Inhalant Solution SCD 2 252559 budesonide 1 MG per 2 ML Inhalant Suspension SY 3 349094 Budesonide 0.125 MG/ML Inhalant Solution SCD 4 349094 budesonide 0.25 MG per 2 ML Inhalant Suspension SY 5 351109 Budesonide 0.25 MG/ML Inhalant Solution SCD 6 351109 budesonide 0.5 MG per 2 ML Inhalant Suspension SY 7 616817 Budesonide 0.25 MG/ML Inhalant Solution [Pulmicort] SBD 8 616817 Pulmicort Respules 0.25 MG/ML Inhalant Solution SY 9 616817 Pulmicort Respules 0.5 MG per 2 ML Inhalant Suspension SY 10 616819 Budesonide 0.5 MG/ML Inhalant Solution [Pulmicort] SBD 11 616819 Pulmicort Respules 0.5 MG/ML Inhalant Suspension SY 12 616819 Pulmicort Respules 1 MG per 2 ML Inhalant Solution SY 13 616830 Budesonide 0.125 MG/ML Inhalant Solution [Pulmicort] SBD 14 616830 Pulmicort Respules 0.125 MG/ACTUAT Inhalant Solution SY 15 616830 Pulmicort Respules 0.25 MG per 2 ML Inhalant Suspension SY Get Label RSS Feed",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}