{
    "relation": [
        [
            "Categories",
            "What to do for fun",
            "Dorm Life",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "Plenty of neighboring restaurants and stores for shopping!",
            "No dorms",
            "Meet with advisers to discuss academic plans. Take advantage of all resources available to students.",
            "Located in the heart of downtown. Very easy to commute via public transportation. Nice learning environment and diverse setting."
        ]
    ],
    "pageTitle": "City Colleges of Chicago-Harold Washington College Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/City-Colleges-of-Chicago-Harold-Washington-College/reviews?_escaped_fragment_=/show/36593",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042985140.15/warc/CC-MAIN-20150728002305-00316-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 892672287,
    "recordOffset": 892627451,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{78099=I would rate Harold Washington College of Chicago as a 6 out of 10 on the scale. When I started at the school in 2009, I found that the qualifications and rigor of classes could be compared to that of any prestigious institution on the first year level. The reason that I would rate this college as a 6 currently is because I found that, with the instatement of the new chancellor of the Chicago City Colleges School system, certain changes to the rigor of the curriculum has been made. Class that had high levels of pre-qualifications have been lowered to allow for a higher expected graduation rates for the circle of institutions. What I can say after two semesters of this new tactic is that it was in poor judgement. Classes that are expected to be at the 200 level are now filled with students that can barely spell the basics of the English language, let alone write in complete sentences. This problem is so drastic that sometimes the teachers have to take extra time during the lecture to explain the fundamentals of the English. This decision has proven to be a failure on the current administration and I hope that it can be corrected to hope for a higher caliber student, rather than a higher graduation rate of mediocrity., 207934=© 2015, Cappex.com, LLC, 69628=Great school, I wise I had applied to HWC before going to Minnesota in 1993. I didn't know that I would've saved $30,000 in student loan debt. My time and the students have been might nice to me!}",
    "textBeforeTable": "06/03/2009 Reviewer is A current student here. 8 out of 8 people found this review useful. 1 of 49 Lewis from Chicago, IL Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\");",
    "textAfterTable": "Categories Comments Great for these types of students Any student that is willing to make the best of the two year college. Especially those in financial crisis. Tips for prospective students Don't be discourage by the title of City College. The college has many great professors that teach at four universities, therefore the work load is the same. Your saving a lot of money for the same credit that many students are getting into debt. Bang for the buck Financially it is very affortable during this time of crisis in our country. The best part is that most of the classes offer at Harold are trasferable to a four year university. Am enjoying being here The urban area of the school's location brings people from many backgrounds and nationalities into one classroom for the purpose of continuing an education. It is something that I enjoyed the most during my second semester at Harold. The experience of many of my classmates during a lecture in philosophy class made the class come life. Am learning a lot Harold maybe a city college but the professors are passionate about their teaching and interaction",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}