{
    "relation": [
        [
            "TERM",
            "value domain",
            "verb",
            "version",
            "version identifier",
            "view",
            "vulnerability"
        ],
        [
            "ACRONYM",
            "",
            "",
            "",
            "",
            "",
            ""
        ],
        [
            "DEFINITION",
            "A set of permissible values. NOTE 1: The value domain provides representation, but has no implication as to what data element concept the values may be associated with nor what the values mean. NOTE 2: The permissible values may either be enumerated or expressed via a description. (ISO/IEC 11179-3:2003, 3.3.140)",
            "(1) word used to indicate a action, a state, or an occurrence (POD) (2) A Verb may indicate the action to be performed on the information (e.g. add/change/delete), the intention of the sender (e.g. propose/accept/decline), a service indication (e.g. get/query/response/list) or the activity the receiver is supposed to perform (e.g. produce/pick up/pay). (CCMA 0.6)",
            "An indication of the evolution over time of an instance of a Core Component, Data Type, Business Context, or Business Information Entity. (CCTS 2.01)",
            "The identification of an issue of a data element specification in a series of evolving data element specifications within a Registration Authority. (ISO/IEC 11179-5 1st edition)",
            "(1) A simplified description (an abstraction) of a model, which is seen from a given perspective or vantage point and omits entities that are not relevant to this perspective. See also architectural view. (RUP) (2) A projection of a model, which is seen from a given perspective or vantage point and omits entities that are not relevant to this perspective. (OMG)",
            "A flaw or weakness in a system's design, implementation, or operation and management that could be exploited to violate the system's security policy. (IETF RFC 2828)"
        ]
    ],
    "pageTitle": "Glossary - Confluence",
    "title": "",
    "url": "http://www1.unece.org/cefact/platform/display/public/Glossary",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042985140.15/warc/CC-MAIN-20150728002305-00229-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 847221787,
    "recordOffset": 847170186,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "//--> customizeMacroTable('TBL1437398333176', columnTypes, 1, 'lightgoldenrodyellow', true, 'Click to sort', '', false, false, false, true, 0, false, '' ); var columnAttributes = ''; var columnTypes = ['S'];",
    "textAfterTable": "TERM ACRONYM DEFINITION Web service   A set of standards for how systems connect to each other and communicate information. Using open standards such as XML, SOAP and UDDI. Commercial services that provide software/hardware/personnel to companies for data integration purposes. (www.techdictionary.com) Web Service Description Language WSDL The Web Services Description Language (WSDL) is an XML-based language used to describe the services a business offers and to provide a way for individuals and other businesses to access those services electronically. WSDL is the cornerstone of the Universal Description, Discovery, and Integration (UDDI) initiative spearheaded by Microsoft, IBM, and Ariba. UDDI is an XML-based registry for businesses worldwide, which enables businesses to list themselves and their services on the Internet. WSDL is the language used to do this. (http://searchwebservices.techtarget.com/Definition) WSDL is derived from Microsoft's Simple Object Access Protocol (SOAP) and IBM's Network Accessible Service Specification Language (NASSL). WSDL replaces both NASSL and SOAP as the means of expressing business services in the UDDI registry. well-formedness rule   The rules and constraints on valid models are defined. The rules are expressed in English prose and in a precise",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}