{
    "relation": [
        [
            "Categories",
            "Campus Safety",
            "Greek Life",
            "Clubs and Activities",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "They are always around to check 24/7 and if anything happens they help to their abilities to protect the students.",
            "None",
            "There is a club fr any type of major offered it seems.",
            "Not a lot to do in Cheyenne, WY it is not a college town but a day trip to Ft. Collins or Laramie is always fun to do shopping and cool places to eat.",
            "Prices are good, quality of food is bad.",
            "Way expensive for a community college and the athletes are loud and noisy with no respect to others.",
            "There needs to be more fairness spread out to students from the administration in so when students are struggling with a teacher who is difficult there are fewer problems and happier students.",
            "The biggest tip is if something seems unfit or wrong with a grade or account charges with the school take it up and stand for what is right. The second tip is to maintain communication with all instructors so you know where you stand in grades so that finals your are not blindsided.",
            "Great Agriculture department! All the instructors in the Ag department and well rounded and respected in their fields , while willing to work with students that travel with teams a lot. Over charge for an internship off campus and where the internship providers saw none of the money."
        ]
    ],
    "pageTitle": "Laramie County Community College Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Laramie-County-Community-College/reviews",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042985140.15/warc/CC-MAIN-20150728002305-00213-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 904875631,
    "recordOffset": 904840292,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{129795=© 2015, Cappex.com, LLC}",
    "textBeforeTable": "12/08/2009 Reviewer is Researching this school. Reviewer has not been to campus. 3 out of 4 people found this review useful. 1 of 32 Sirena from Clearmont, WY Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp",
    "textAfterTable": "Am enjoying being here I love being at this school do to the helpfulness of the teachers and the openness of the students. My fellow students are very helpful and make school easier do to making new friends. Also they are very helpful when you are either to nervous to ask the teacher. Am learning a lot I learn a lot here. The teachers are great at helping you understand the material. The teachers also try to fit to every one's learning styles by having different styles of projects. Login to rate or flag the reviews Kaitlyn from Cheyenne, WY 03/08/2012 Reviewer is A current student here. 2 out of 2 people found this review useful. 3 of 32 Categories Comments Bang for the buck tuition fees are very low, and are worth every dollar you spend. even the out of state tuition is very affordable, What to do",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}