{
    "relation": [
        [
            "Name",
            "01 - Scoundrel Days.flac",
            "02 - Oranges On Appletrees.flac",
            "03 - Cry Wolf.flac",
            "04 - Dragonfly.flac",
            "05 - Time And Again.flac",
            "06 - Sycamore Leaves.flac"
        ],
        [
            "Size",
            "38 425 571",
            "33 186 044",
            "27 163 249",
            "24 412 472",
            "36 072 136",
            "30 250 379"
        ],
        [
            "Length",
            "05:15",
            "04:26",
            "03:35",
            "03:36",
            "05:19",
            "04:00"
        ],
        [
            "Bitrate",
            "970",
            "990",
            "1 000",
            "900",
            "900",
            "1 000"
        ]
    ],
    "pageTitle": "A-ha. Discography. Music. Albums. Tracks.",
    "title": "",
    "url": "http://www.moodbook.com/music/a-ha.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988650.6/warc/CC-MAIN-20150728002308-00230-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 593022680,
    "recordOffset": 593006709,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{633=A-ha is a Norwegian band who were most popular in the UK and the USA during the 1980s, but continued to be globally successful in the 1990s and 2000s. The trio, composed of lead vocalist Morten Harket, guitarist Paul Waaktaar-Savoy (known as Pal Waaktaar until 1994) and keyboardist Magne Furuholmen, formed in 1982 and left Norway for London in order to make a career in the music business. The origin of the name A-ha comes from the title of an early song. Today, A-ha are recognized by their peers as a serious band with impressive songwriting capabilities. Fans include: Pet Shop Boys, Adam Clayton, Leonard Cohen, Robbie Williams, U2, and more. Many artists around the world have done covers of A-ha songs, ranging from pop, rock, reggae to dance, techno, jazz and instrumental versions., 1539=A-ha's most successful album is Hunting High and Low. As of 2005, Hunting High and Low has sold 8 million copies worldwide. In the late 80s and early 90s, A-ha were very popular in South America, especially Brazil. They sold out some of the largest stadiums in the world. At the Rock in Rio festival in 1991, A-ha shocked the international entertainment press by gathering a paying audience of 198,000 people at Maracana Stadium. A world record for paying audiences. George Michael, Prince and Guns N' Roses only managed to gather 60,000 each. Over their career, A-ha have officially released 32 singles. 13 of these became top ten singles in the UK, and 14 singles have been number one on the radio lists over the world.}",
    "lastModified": "Tue, 09 Apr 2013 16:54:21 GMT",
    "textBeforeTable": "Hunting High And Low (1985) 2006, Cosy Prisons (CD5) 2005, Celice (CD5) 2005, Analogue (All I Want) (CD5) 2005, Analogue 2003, How Can I Sleep With Your Voice In My Head (CD2) (Live) 2003, How Can I Sleep With Your Voice In My Head (CD1) (Live) 2002, The Antology - Remixes 2002, Lifelines (CD2) (CD5) 2002, Lifelines (CD1) (CD5) 2002, Lifelines 2002, Forever Not Yours (CD5) 2002, Did Anyone Approach You (CD5) 2001, The Sun Never Shone That Day (CD5) 2001, Homecoming - Live At Vallhall (Live) 2000, Velvet (CD5) 2000, Summer Moved On (CD5) 2000, Minor Earth, Major Sky (CD5) 2000, Minor Earth, Major Sky 1994, Shapes That Go Together (CD5) 1993, Memorial Beach 1992, The Blood That Moves The Body (CD5) 1991, Headlines And Deadlines 1991, East Of The Sun, West Of The Moon 1990, Early Morning (CD5) 1990, Crying In The Rain (CD5) 1988, Twelve Inch Club (EP) 1988, Stay On These Roads (CD5) 1986, Stay On These Roads 1986, Scoundrel Days 1985, Hunting High And Low ♪ Discography //--> google_ad_height = 90; google_ad_width =",
    "textAfterTable": "07 - And You Tell Me.flac 10 703 243 01:52 760 08 - Love Is Reason.flac 22 443 161 03:07 950 09 - I Dream Myself Alive.flac 20 469 585 03:10 860 10 - Here I Stand And Face The Rain.flac 31 802 278 04:30 940 Scoundrel Days (1986) Name Size Length Bitrate 01 - Scoundrel Days.flac 24 957 035 04:02 820 02 - The Swing Of Things.flac 28 295 090 04:14 880 03 - I've Been Losing You.flac 29 227 825 04:24 880 04 - October.flac 23 633 972 03:55 800 05 - Manhattan Skyline.flac 31 373 250 04:52 850 06 - Cry Wolf.flac 26 455 368 04:06 850 07 - We're Looking For The Whales.flac 24 328 165 03:43 870 08 - The Weight Of The Wind.flac 26 982 922 03:59 890 09 - Maybe, Maybe.flac 18 044 153 02:36 920 10 - Soft Rains Of April.flac 21 135 102 03:12 870 Stay On These Roads (1986) Name Size Length Bitrate 01 - Stay On These Roads.flac 31 628 916 04:46 880 02 - The Blood That Moves The Body.flac 26 929 578 04:06 870 03 - Touchy!.flac 31 974 305 04:33",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}