{
    "relation": [
        [
            "Patent application number",
            "20100196918",
            "20130274442"
        ],
        [
            "Description",
            "ANALYTE SENSORS, METHODS FOR PREPARING AND USING SUCH SENSORS, AND METHODS OF DETECTING ANALYTE ACTIVITY - Embodiments of the present disclosure provide for analyte sensors, methods for producing and using the analyte sensors, methods of detecting and/or measuring analyte activity, methods for characterizing analyte cellular activity, methods of detecting pH change in a system, method of controlling the concentration of an analyte in a system, fusion proteins, polynucleotides, and vectors corresponding to the analyte sensors, kits, and the like.",
            "Analyte Sensors, Methods for Preparing and Using Such Sensors, and Methods of Detecting Analyte Activity - Embodiments of the present disclosure provide for analyte sensors, methods for producing and using the analyte sensors, methods of detecting and/or measuring analyte activity, methods for characterizing analyte cellular activity, methods of detecting pH change in a system, method of controlling the concentration of an analyte in a system, fusion proteins, polynucleotides, and vectors corresponding to the analyte sensors, kits, and the like."
        ],
        [
            "Published",
            "08-05-2010",
            "10-17-2013"
        ]
    ],
    "pageTitle": "Huang, GA - Patent applications",
    "title": "",
    "url": "http://www.faqs.org/patents/inventor/huang-ga-3/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042985140.15/warc/CC-MAIN-20150728002305-00339-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 450172523,
    "recordOffset": 450148666,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Yun Huang, Decatur, GA US 06-19-2014 AUTOMATIC GARAGE DOOR AUTOMATIC MONITORING AND CONTROLLING SYSTEM BASED ON THE INTERNET OF THINGS CONCEPT AND NEAR FIELD COMMUNICATION (NFC) TECHNOLOGY - A method and system are provided for remotely monitoring the open and close status of a garage door via the internet based on the internet of things concept and NFC (Near Field Communication) technology. The system includes a Door Monitoring & Controlling Device (DMCD) and a web based Advanced Door Management System. The DMCD contains a NFC module, and one or more NFC close/open status tags which work together to monitor the status of the garage door. The NFC tag in this system not only provides status signal but also provides network configure data that eliminates the need to make standalone device configurable for network connectability. The use of NFC technology here will reduce manufacturing cost significantly, and make the configuration easy. The method and system also enable users to remotely open and close the garage door via the internet. 20140171032 01-31-2013 SYSTEMS, METHODS, AND APPARATUS FOR UTILITY METER CONFIGURATION - Systems, methods, and apparatus for configuring utility meters are provided. A meter configuration application may be executed by a device that includes one or more computers and that facilitates utility meter configuration. A plug-in module associated with a utility meter type may be received by the device. Based at least in part upon providing the plug-in module to the meter configuration application, a configuration",
    "textAfterTable": "Zhen Huang, Atlanta, GA US Patent application number Description Published 20120065387 SYNTHESIS OF SELENIUM-DERIVATIZED NUCLEOSIDES, NUCLEOTIDES, PHOSPHORAMIDITES, TRIPHOSPHATES AND NUCLEIC ACIDS - The present invention provides selenium derivatives of nucleosides, nucleoside phosphoramidites, nucleotides, nucleotide triphosphates, oligonucleotides, polynucleotides, and larger nucleic acids and methods for their synthesis. Selenium derivatives of both ribonucleic acids and deoxyribonucleic acids, as well as methods for their synthesis, crystallization and uses in structural determinations, particularly by X-ray crystallographic techniques are disclosed. The selenium derivatives of the present invention are also useful as food supplements. 03-15-2012 Zhen Huang, Marietta, GA US Patent application number Description Published 20100137573 SYNTHESIS OF SELENIUM-DERIVATIZED NUCLEOSIDES, NUCLEOTIDES, PHOSPHORAMIDITES, TRIPHOSPHATES AND NUCLEIC ACIDS - The present invention provides selenium derivatives of nucleosides, nucleoside phosphoramidites, nucleotides, nucleotide triphosphates, oligonucleotides, polynucleotides, and larger nucleic acids and methods for their synthesis. Selenium derivatives of both ribonucleic acids and deoxyribonucleic acids, as well as methods for their synthesis, crystallization and uses in structural determinations, particularly by X-ray crystallographic techniques are disclosed. The selenium derivatives of the present invention are also useful as food supplements. 06-03-2010 20110105743 IMPROVED METHOD AND PROCESS FOR SYNTHESIS OF 2',3'-DIDEHYDRO-2',3'-DIDEOXYNUCLEOSIDES - A method is disclosed for synthesizing 2′,3′-didehydro-2′,3′-dideoxynucleosides (d4Ns) from a nucleophile-mediated elimination, such as a telluride-mediated elimination reaction. After substitution of 2,2′-anhydronucleosides with a nucleophile, such as a telluride monoanion, a telluride intermediate is formed, and its elimination leads",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}