{
    "relation": [
        [
            "Categories",
            "Campus Safety",
            "Clubs and Activities",
            "Great for these types of students",
            "Share any unusual traditions or locations on campus",
            "Bang for the buck",
            "What to do for fun",
            "Food and Dining",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "seems pretty safe to me. there's always police officers and security workers around campus and most areas are well lit or well in the open for other people to see if something bad were to happen.",
            "they are out there but you have to look a little harder here than you would at other colleges.",
            "tcc doesn't have a whole lot of options for majors but they are good at allowing you to get your basics done before transferring to another school.",
            "i can't really think of any.",
            "tcc is good about helping out where they can for paying for school. there's multiple scholarship opportunities and if you're a tulsa resident and have lived in tulsa county for at least a year you can go for free, except for having to pay for books, with this volunteering deal called tulsa achieves.",
            "intramural sports are great! i'm playing volleyball and it gets pretty competitive yet its still really fun!",
            "there's a subway on one of the campuses but other than that it's just local food restaurants.",
            "some classes are challenging but others aren't as much. the teachers do expect you to study ourside of class and to do your homework on time if there's any.",
            "use ratemyprofessor.com! it's very helpful for which professors to choose from because while most are great, you occasionally get one that's not so great. and study a little each day, it'll help in the long run!",
            "good student to teacher ratio. every teacher i've had has always been willing to help out in whatever way they can to help you make the grade you want to in his/her class."
        ]
    ],
    "pageTitle": "Tulsa Community College Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Tulsa-Community-College/reviews?_escaped_fragment_=/show/50640",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438044160065.87/warc/CC-MAIN-20150728004240-00066-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 911601631,
    "recordOffset": 911528096,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{413000=Ever since I started school there in the Fall of 2014 there have not been any disturbances during school. It's a small, safe, and great place to be!, 66696=there have been no issues since i have been there, and i began in july of 2011., 392558=Tulsa Community College provides a comfortable, but stimulating, college environment that truly promotes learning. I'm glad I attended TCC before transferring to a larger university because I feel that the professors and instructors really help students (either returning or fresh out of high school) transition into a higher level learning environment. I'll be transferring after the spring of 2014 and I really feel prepared for the university learning experience., 203686=Staff has been very helpful with getting me started and going. Enrolled at the beginning of September and started classes one week later. When ordering online from the bookstore, you can expect to receive your books the same day to two days, depending what time you placed order and how close you live to Tulsa., 233799=I have enjoyed my time at Tulsa Community College. I will be finished in December with my Associates degree and I have learned so much since being here. All of the teachers are fabulous!, 84856=the cafeteria is very basic and hours are not helpful for evening students; 11:00 a.m. to 6:00 p.m., 418838=© 2015, Cappex.com, LLC, 152796=overall I'm very pleased with my experience at TCC thus far. I've been out of high school since 1996 and was worried about reentering an academic setting but everything has been easy I can't complain.}",
    "textBeforeTable": "12/03/2009 Reviewer is A current student here. 10 out of 11 people found this review useful. 1 of 107 Erin from Owasso, OK Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5",
    "textAfterTable": "Food and Dining There is only one restaurant. It is expensive for what it is. There are tons of vending machines and many of them have credit/debit card readers. Dorm Life There are no on-campus living options. Academic Rigor Much of the course material is fairly easy. The only thing that is important is turning assignments in on time and showing up to class to take notes. Studying is also important for tests and quizzes, but it is not too time consuming. Tips for prospective students Be sure to attend class regularly because many of the instructors give out class participation grades that reflect attendance; not all instructors will let you make up work that was done in-class, so be weary. Make sure you check online to see what your instructor has posted. Most of the professors use the BlackBoard system to communicate with students and post important announcements, such as class cancellations and temporary or permanent room changes. This also includes using your TCC email frequently because that is the instructors' other form of communication. Be sure to keep on top of when financial aid deadlines are. Turn in any documents that are requested through the financial aid office before",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}