{
    "relation": [
        [
            "Domain Created On",
            "2011-03-18",
            "4 years, 133 days old"
        ],
        [
            "Last Modified On",
            "2015-03-31",
            "0 years, 120 days ago"
        ],
        [
            "Expires On",
            "2017-03-18",
            "1 year, 232 days from today"
        ]
    ],
    "pageTitle": "altapressaoonline.com || Alta Pressão Online :: Portal de notícias de Alagoinhas e região | SEOCert",
    "title": "",
    "url": "http://www.seocert.net/analyzer.altapressaoonline.com",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042985140.15/warc/CC-MAIN-20150728002305-00207-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 703431695,
    "recordOffset": 703413141,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{4177=IP address of altapressaoonline.com is : 188.93.231.189. The domain altapressaoonline.com was created on 2011-03-18 and it is 4 years, 133 days old. It will expire on 2017-03-18 which is 1 year, 232 days from today. The homepage of website altapressaoonline.com has a size of 37064 bytes, and a text size of 3296 bytes, its Text to Code Ratio is 9.76% Homepage of altapressaoonline.com has 90 links, 69 link to internal pages, while 21 link to pages on other websites. It takes 0.66 s ( 55.75 Kb/s ) to load the website altapressaoonline.com.}",
    "textBeforeTable": "|| Alta Pressão Online :: Portal de notícias de Alagoinhas e região Words count: 13    Unique Words: 11    Length: 70 characters [ To optimize the page title, Use this SEO Title Optimizer ] : Title Content Analysis Register To View All >> the 81 recommended tasks to improve your SEO performance. ... Configure the server so that your site IP http://188.93.231.189 is redirected to the site domain name altapressaoonline.com. Move the 67 inline css components to an external style sheet file. Remove flash component from your site. Add in more high quality text content and make the text to code ration to be within 15%-70%. Use more straight forward terms, avoid using too much jargon in the page content. Use HTML headings(H1 - H6) and inline emphasis tags (<EM><B><I><EM><STRONG>). Create one H1 element for your page, put the most important keywords in. Set meta keywords. Set meta description for your page. Edit the title tag, ensure (adsbygoogle = window.adsbygoogle || []).push({});",
    "textAfterTable": "The title will be displayed in search engine results in the form of a direct link to the site. Tips: 1. ideally, the title should contain 10 to 70 characters, including spaces. (Google displays up to 70 characters in the title, and takes into account only the first 12 words.) 2. put the most important and relevant keywords in the title, try not to repeat any word. 3. each individual page should have a unique title. Description : Words count: 0    Length: 0 characters [ To optimize the page description, Use this SEO Meta Description Optimizer ] Meta Description is not set. Meta Descriptions provide concise explanations of the contents of web pages, that are commonly used by search engines on search result pages to display preview snippets for a given page. Tips: 1. it is best to keep meta descriptions between 70-160 characters. 2. a readable, compelling description using important keywords can draw a much higher click-through rate of searchers to the given web page. 3. avoid keyword stuffing, ensure each page has its own unique description. Google SERP Preview : || Alta Pressão Online :: Portal de notícias de ... www.altapressaoonline.com/",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}