{
    "relation": [
        [
            "Count",
            "1",
            "1",
            "1",
            "1",
            "1"
        ],
        [
            "Component",
            "",
            "",
            "",
            "",
            ""
        ],
        [
            "DateTime",
            "",
            "",
            "2012-08-01T00:00:00",
            "2014-01-09T00:00:00",
            "2014-03-14T00:00:00"
        ],
        [
            "Description",
            "Bathymetry: These data were collected using the SHOALS-1000T system. It is owned by Fugro Pelagos Inc. and operated through contract. The system collects bathymetric lidar at 1 kHz and RGB imagery at 1Hz. A CASI-2 hyperspectral line scanner is integrated with the system as well. Aircraft position, velocity, and acceleration information are collected through a combination of Novatel and POS A/V 410 equipment. All raw data streams are transferred to the office for downloading and processing in SHOALS GCS software. Aircraft position data are processed using POSPac software and the results are combined with the lidar data to produce 3-D positions for each lidar shot. Upon inspection and QA/QC in the software package Fledermaus, anomalous data are flagged as invalid. FPI Workbench then converts all valid data from ellipsoid to orthometric heights based on the NGS' GEOID09 model and exports data as a series of bathymetry (H) ASCII files. The bathymetry files contain all of the returns form the bathymetric sensor which includes returns both above and below the water. Process date for this is unknown. Topography: These data were collected using the ALS60 lidar system. It is owned by Fugro EarthData and operated through contract. The system collects topographic lidar data at maximum pulse rate of 200 kHz in a wavelength of 1064 nm. A CASI-1500 hyperspectral line scanner integrated with the system. Aircraft position, velocity and acceleration information are collected by the onboard GPS/IMU system. Raw data were transferred to the office and processed in IPAS software. Aircraft position data are processed using POSPac software and the results are combined with the lidar data to produce 3-D positions for each lidar shot. Upon processing, validation and QA/QC in the software packages GeoCue and TerraScan, anomalous data are flagged as invalid and necessary reflights are called. Fugro's proprietary software converts all valid data from ellipsoid to orthometric heights based on the NGS GEOID09 model and exports topographic data as a series of LAS files with a single file per flightline per 5 km box. Process date for this is unknown.",
            "Topographic lidar had an additional process step. Outlined below is a representative description for all the topo data sets. 1. The raw lidar data was processed with Leica ALS Post Processor software to LAS format. 2. The processed flightlines were boresighted and block adjustment was performed to ensure flightlines match each other vertically and to the control points using TerraMatch and Fugro EarthData proprietary software. 3. The boresighted data was cut to work tiles in GeoCue and TerraScan classification macros were developed and applied to classify bare-earth points automatically. 4. Then the auto-filtered tiles were manually edited in TerraSolid software packages to correct misclassification errors. Editors used a combination of intensity data, profiles, and color shaded TIN surface to assist the manual editing. 5. All edited tiles were reviewed by the QC team to ensure consistency and accuracy of point classification. 6. Water body polygons were digitized based on the lidar data. The water body polygons were then used to classify the lidar points fall in water to Class 9 - Water using Fugro EarthData proprietary software. 7. Using GeoCue and Fugro EarthData proprietary software the work tiles were then re-cut and re-projected to delivery tiling scheme and projection/datum. 8. These tiles are then re-formatted to two delivery data sets ? Classified and Un-classified Point Cloud that meet the project specification. 9. The Un-classified lidar point cloud data were delivered tiled in LAS 1.2 format; Class 1 - Default.",
            "The NOAA Coastal Services Center (CSC) received the topo files in LAS v1.2 format and the hydro files in ascii format. The files contained lidar elevation and intensity measurements. The topo data were received in geographic coordinates (NAD83) and vertically referenced to NAVD88 using the Geoid09 model. The vertical units of data were meters. The hydro files were received in geographic coordinates (NAD83) and vertically referenced to NAVD88. CSC performed the following processing for data storage and Digital Coast provisioning purposes: 1. Both topo and hydro files were filtered for elevation outliers. 2. The topo las files were converted from orthometric (NAVD88) heights to ellipsoidal heights using Geoid09. 3. The hydro files were converted from orthometric (NAVD88) heights to ellipsoidal heights using Geoid09 and points were classified as 11 (Bathymetry).",
            "Times for the hydro files had originally been stored as POSIX seconds when converted to LAS. This was switched to adjusted GPS time (GPS seconds - 1e9) to conform to the LAS 1.2 standard.",
            "The NOAA National Geophysical Data Center (NGDC) received lidar data files via ftp transfer from the NOAA Coastal Services Center. The data are currently being served via NOAA CSC Digital Coast at http://www.csc.noaa.gov/digitalcoast/. The data can be used to re-populate the system. The data are archived in LAS or LAZ format. The LAS format is an industry standard for LiDAR data developed by the American Society of Photogrammetry and Remote Sensing (ASPRS); LAZ is a loseless compressed version of LAS developed by Martin Isenburg (http://www.laszip.org/). The data are exclusively in geographic coordinates (either NAD83 or ITRF94). The data are referenced vertically to the ellipsoid (either GRS80 or ITRF94), allowing for the ability to apply the most up to date geoid model when transforming to orthometric heights."
        ]
    ],
    "pageTitle": "Docucomp ISO19115Components-HTMLTable",
    "title": "",
    "url": "http://www.ngdc.noaa.gov/docucomp/page?xml=NOAA/NESDIS/NGDC/MGG/Lidar/iso/xml/2009_11_USACE_OR_WA_m1381.xml&view=ISO19115Components-HTMLTable&altview=none",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988650.6/warc/CC-MAIN-20150728002308-00168-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 616631892,
    "recordOffset": 616615498,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "MD_DataIdentification Aggregation Info | Bands | Citations | Constraints | Coverage Descriptions | Dimensions | Extents | Formats | Geographic Bounding Box Georectified Information | Georeferenceable Information | Identifiers | Instruments | Mediums | OnlineResources | Operations Platforms | Process Steps | Range Elements | Reference Systems | Responsible Parties | Series | Sources | Spatial Grids | Temporal Extents Metadata Identifier: gov.noaa.csc.maps:file:2009_11_USACE_OR_WA_m1381Get DataFAQHTML, 19139 XML Assess Metadata For: Completeness, DOI Readiness, CSW Readiness, Components ISO Table ViewBack to Collection NOAA/NESDIS/NGDC/MGG/Lidar View Metadata As: , , } background-color:#F0F0F0; th{ } empty-cells:show; table{",
    "textAfterTable": "3 None 1 North American Datum 1983 2007-01-19 Top CI_Series none found Top CI_ResponsibleParty Count Component Individual Organization Position Email Role Linkage 1 resourceProvider http://www.epsg-registry.org/export.htm?gml=urn:ogc:def:crs:EPSG::4269 1 NOAA CSC (originator) DOC/NOAA/NOS/OCM > Office for Coastal Management, National Ocean Service, National Oceanic and Atmospheric Administration, U.S. Department of Commerce coastal.info@noaa.gov originator http://coast.noaa.gov 1 NOAA CSC (publisher) DOC/NOAA/NOS/OCM > Office for Coastal Management, National Ocean Service, National Oceanic and Atmospheric Administration, U.S. Department of Commerce coastal.info@noaa.gov publisher http://coast.noaa.gov 1 NOAA CSC(distributor) DOC/NOAA/NOS/OCM > Office for Coastal Management, National Ocean Service, National Oceanic",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}