{
    "relation": [
        [
            "Categories",
            "Campus Safety",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "Campus safety is very good. Never had any problem and campus security is always available.",
            "There are intramurals and even a game room.",
            "The food is not that great as well as the times the dining hall is open to eat. We recently just went tray less that would save money, etc.",
            "I do not live on campus due to the fact that it costs so much. The freshman dorms are too small is what I have heard and you can even end up in quads.",
            "The standards for students to maintain is very high. The professors require you to spend large amounts of time outside of the class room.",
            "Think about what program you want to do as well as how much you are willing to pay. Cannot exceed $1,000 in school balance which can lead into not being able to schedule classes.",
            "It is a beautiful campus with plenty of available intramurals and varsity sports. The costs is high and the school food is not that great. There are plenty of things to do on campus that help pass time."
        ]
    ],
    "pageTitle": "Walsh University Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Walsh-University/reviews?_escaped_fragment_=/show/16566",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438044160065.87/warc/CC-MAIN-20150728004240-00083-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 908424859,
    "recordOffset": 908388535,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{101580=The food at Walsh is not the best and considering that they even remodeled you would think the food would be better, but it sucks. The dining is only open for a few hours, so if you can't go because your in class until 7:30 good luck eating dinner. They have now opened the grill until later and allowed students to use their swipes for meals instead of their cash., 33949=It is quite expensive to go here. For the fall 2012 semester, it is about $17,000. During the spring of 2012, it was about $16,000, so tuition is rising, but so is everything else in the economy. There is financial assistance for those who need it., 127297=© 2015, Cappex.com, LLC}",
    "textBeforeTable": "07/08/2009 Reviewer is A current student here. 2 out of 2 people found this review useful. 1 of 27 Abby from Chagrin Falls, OH Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 }",
    "textAfterTable": "Great for these types of students walsh is great for every type of student. Share any unusual traditions or locations on campus we have a great chapel, new buildings, and everything is within walking distance. Bang for the buck walsh, though a little pricey, is worth every dollar in my opinion. What to do for fun belden village is a few minutes away, leading to much fun. Food and Dining there are many places to get food on campus, and it is all tasty. Dorm Life the dorms are super nice. Academic Rigor walsh classes are challenging, but the teachers are willing to stay as long as needed. also, many tutors and help is available. Tips for prospective students keep grades up and study hard. In three sentences walsh university is a great learning environment. the staff, faculty, and students alike have every person's best interests in mind. walsh is truly concerned with furthering both education",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}