{
    "relation": [
        [
            "City",
            "Boardman",
            "Boardman",
            "Boardman",
            "Boardman",
            "Heppner",
            "Heppner",
            "Heppner",
            "Heppner",
            "Ione",
            "Ione",
            "Irrigon",
            "Irrigon",
            "Irrigon",
            "Irrigon",
            "Lexington",
            ""
        ],
        [
            "Facility Type",
            "School",
            "School",
            "School",
            "Fire - RFPD",
            "School",
            "School",
            "Hospital",
            "Fire - City",
            "School",
            "Fire - RFPD",
            "School",
            "School",
            "School",
            "County Sheriff-EOC-Public Safety Answering Point",
            "Fire - City",
            "County Sheriff-EOC-Confidential Location"
        ],
        [
            "Facility Name",
            "Riverside Junior/Senior High School",
            "Sam Boardman Elementary School",
            "Windy River Elementary School",
            "Boardman RFPD",
            "Heppner Elementary School",
            "Heppner Junior/Senior High School",
            "Pioneer Memorial Hospital - Heppner",
            "City Of Heppner Fire",
            "Ione School",
            "Ione RFPD",
            "A C Houghton Elementary School",
            "Irrigon Elementary School",
            "Irrigon Junior/Senior High School",
            "Morrow County Emergency Management",
            "Lexington VFD",
            "Morrow County Emergency Operations Center"
        ],
        [
            "Site ID",
            "Morr_sch01",
            "Morr_sch04",
            "Morr_sch02",
            "Morr_fir02",
            "Morr_sch08",
            "Morr_sch09",
            "Morr_hos01",
            "Morr_fir01",
            "Morr_sch05",
            "Morr_fir03",
            "Morr_sch06",
            "Morr_sch03",
            "Morr_sch07",
            "Morr_pol01",
            "Morr_fir04",
            "Morr_eoc01"
        ]
    ],
    "pageTitle": "DOGAMI | Statewide Hazards Viewer - More Resources",
    "title": "",
    "url": "http://www.oregongeology.org/sub/hazvu/rvs-buildings.htm",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438044160065.87/warc/CC-MAIN-20150728004240-00179-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 640861531,
    "recordOffset": 640810332,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{2949=This list shows which Oregon facilities have Statewide Seismic Needs Assessment Using Rapid Visual Screening (RVS) reports. Oregon Senate Bill 2 (2005) directed DOGAMI, in consultation with project partners, to develop a statewide seismic needs assessment that includes seismic safety surveys of K-12 public school buildings and community college buildings that have a capacity of 250 or more persons, hospital buildings with acute inpatient care facilities, fire stations, police stations, sheriffs' offices and other law enforcement agency buildings. The buildings shown represent schools and critical facilities that were evaluated in 2006 to assess their earthquake vulnerability. This is not a comprehensive data layer of schools or critical facilities in the State. (Final results from this study were published by DOGAMI in 2007. See DOGAMI Open-File Report O-07-02.), 1605=Information aids for understanding RVS Site Summary Reports — • Data field definitions 24 KB PDF for spreadsheets and site summary reports (Appendix I of Open-File Report O-07-02) • Building Irregularity Matrix 88 KB PDF (Appendix J of Open-File Report O-07-02) • Protocol for Rapid Visual Screening Fieldwork 968 KB PDF (Appendix K of Open-File Report O-07-02) • FEMA-154, 2002 Edition (web link) | FEMA 154, 2002 Edition 16 MB PDF (Appendix L of Open-File Report O-07-02)}",
    "lastModified": "Wed, 25 Feb 2015 20:37:48 GMT",
    "textBeforeTable": "Click on a county to view a list of all screened sites for that county and link to individual site summary PDFs. RVS Site Summary Reports Information aids for understanding RVS Site Summary Reports — • Data field definitions 24 KB PDF for spreadsheets and site summary reports (Appendix I of Open-File Report O-07-02) • Building Irregularity Matrix 88 KB PDF (Appendix J of Open-File Report O-07-02) • Protocol for Rapid Visual Screening Fieldwork 968 KB PDF (Appendix K of Open-File Report O-07-02) • FEMA-154, 2002 Edition (web link) | FEMA 154, 2002 Edition 16 MB PDF (Appendix L of Open-File Report O-07-02) Buildings in the lists below are grouped by county. Within each county, buildings are listed by city, then facility type, then facility name. You can access RVS site summary reports directly from this page, or you can look up a facility name here and locate the building on the HazVu map using the \"Select a Public Building\" tool. This list shows which Oregon facilities have Statewide Seismic Needs Assessment Using Rapid Visual Screening (RVS) reports. Oregon Senate Bill 2 (2005) directed DOGAMI, in consultation with project partners, to develop a statewide seismic needs assessment that includes seismic safety surveys of K-12 public school buildings and community college buildings that have a capacity of 250 or more persons, hospital buildings with acute inpatient",
    "textAfterTable": "Bake_pol01 Baker City Hospital St. Elizabeth Hospital - Baker City Bake_hos01 Baker City Fire - City Baker City Fire Bake_fir02 Baker City Fire - City Baker City Police Dept Bake_pol03 Baker City County Sheriff-EOC-Public Safety Answering Point Baker County Sheriff's Office Bake_pol02 Haines School Haines Elementary School Bake_sch08 Halfway School Halfway Elementary School Bake_sch04 Halfway School Pine Eagle High School Bake_sch05 Halfway Fire - RFPD Pine Valley RFPD Bake_fir03 Huntington Fire - City Huntington VFD Bake_fir06 Richland Fire - RFPD Eagle Valley Fire Dept Bake_fir12 Sumpter Fire - RFPD Mosquito Flat North RFPD Bake_fir14 Sumpter Fire - City Sumpter FD Bake_fir13 Unity School Burnt River School Bake_sch09 Unity Fire - City Unity Fire Department Bake_fir01 ^ TOP Benton County City Facility Type Facility Name",
    "hasKeyColumn": true,
    "keyColumnIndex": 2,
    "headerRowIndex": 0
}