{
    "relation": [
        [
            "First Name",
            "Laird",
            "Fish"
        ],
        [
            "Last Name",
            "Burnett",
            "Brown"
        ],
        [
            "Suffix",
            "",
            ""
        ],
        [
            "Covered Official Position (if applicable)",
            "",
            ""
        ],
        [
            "New",
            "",
            ""
        ]
    ],
    "pageTitle": "LD-2 Disclosure Form",
    "title": "",
    "url": "http://soprweb.senate.gov/index.cfm?event=getFilingDetails&filingID=73573658-3326-4B32-BB32-DD21472A8B47&filingTypeID=69",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042985140.15/warc/CC-MAIN-20150728002305-00057-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 231312482,
    "recordOffset": 231304280,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{26547=HR 2190 - Medicare Drug Savings Act of 2011: To amend title XVIII of the Social Security Act to require drug manufacturers to provide drug rebates for drugs dispensed to low-income individuals under the Medicare prescription drug benefit program. Sponsor:Waxman (D-CA), 46183=S1049 - Small Business Health Relief Act of 2011: A bill to lower health premiums and increase choice for small business. Sponsor: Kyl (R-AZ), 65827=S.1880 - Jobs and Premium Protection Act: To repeal the annual fee on health insurance providers enacted by the Patient Protection and Affordable Care Act. Sponsor: Barrasso (R-WY), 1019=Lobbying Disclosure Act of 1995 (Section 5) - All Filers Are Required to Complete This Page, 68605=S 2002 - Online Pharmacy Safety Act: To amend the Federal Food, Drug, and Cosmetic Act to improve the safety of Internet pharmacies. Sponsor: Feinstein (D-CA), 35056=HR 2770 - Medicare Cost Contract Extension Act of 2011: A bill to amend title XVII of the Social Security Act to extend for three years reasonable cost contracts under Medicare. Sponsor: Paulsen (R-MN), 23634=HR 1580 - Medicare Beneficiary Preservation of Choice Act of 2011: To preserve Medicare beneficiary choice by restoring and expanding the Medicare open enrollment and disenrollment opportunities repealed by section 3204(a) of the Patient Protection and Affordable Care Act. Sponsor:Gonzalez (D-TX), 74265=H Con Res 112 - House budget resolution establishing the budget for the United States Government for fiscal year 2013 and setting forth appropriate budgetary levels for fiscal years 2014 through 2022. Sponsor: Ryan (R- WI), 62964=S 1813/HR 4348 - Moving Ahead for Progress in the 21st Century Act (or Map 21): An act to authorize funds for federal-aid highways, highway safety programs and transit programs, and for other purposes. Sponsor:Boxer (D-CA) Mica (R-FL), 54595=S 1479 - Medicare Beneficiary Preservation of Choice Act of 2011: A bill to preserve Medicare beneficiary choice by restoring and expanding Medicare open enrollment and disenrollment opportunities. Sponsor: Casey (D-Pa), 57405=S 1497 - Medicare Cost Contract Extension Act of 2011: A bill to preserve Medicare beneficiary choice by restoring the expanding Medicare open enrollment and disenrollment opportunities. Sponsor: Klobuchar (D-MN), 12278=HR 2 - Repealing the Job-Killing Health Care Law Act: To repeal the job-killing health care law and health care related provisions in the Health Care and Education Reconciliation Act of 2010 Sponsor: Cantor (R-VA), 51787=S 1370 - Health Insurance Rate Review Act: To amend the Public Health Service Act to provide protections for consumers against excessive, unjustified, or unfairly discriminatory premium rates. Sponsor:Feinstein (D-CA), 29431=HR 2577 - SAFE Data Act: A bill to protect consumers by requiring reasonable security policies and procedures to protect data containing personal information and to provide for nationwide notice in the event of a security breach. Sponsor: Bono Mack (R-CA), 20869=HR 1370 - To repeal the annual fee on health insurance providers enacted by the Patient Protection and Affordable Care Act. Sponsor: Boustany (R- LA), 60215=S 1789 - 21st Century Postal Service Act of 2011: To improve, sustain, and transform the United States Postal Service. Sponsor: Lieberman (I-CT), 48922=S 1206 - Medicare Drug Savings Act of 2011: To amend title XVIII of the Social Security Act to require drug manufacturers to provide drug rebates for drugs dispensed to low-income individuals under the Medicare prescriptions drug benefit program. Sponsor: Rockefeller (D-WV), 32295=HR 2676 - Small Business Health Relief Act of 2011: To lower health premiums and increase choice for small businesses. Sponsor: Schweikert (R-AZ)}",
    "textBeforeTable": "",
    "textAfterTable": "City OAKLAND State CA Zip Code 94612 Country USA 3. Principal place of business (if different than line 2) City   State   Zip Code   Country   4a. Contact Name b. Telephone Number c. E-mail  Mr.  ANTHONY BARRUETA  5102716835  anthony.barrueta@kp.org 5. Senate ID#  21027-12",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}