{
    "relation": [
        [
            "Value",
            "grammar:",
            "false (default):",
            "spelling:",
            "true:"
        ],
        [
            "Description",
            "A grammatical error was detected.",
            "There are no detected errors in the value.",
            "A spelling error was detected.",
            "The value entered by the user has failed validation."
        ]
    ],
    "pageTitle": "Supported States and Properties | Accessible Rich Internet Applications (WAI-ARIA) 1.0",
    "title": "Values of aria-invalid",
    "url": "http://www.w3.org/WAI/PF/aria/states_and_properties",
    "hasHeader": true,
    "headerPosition": "MIXED",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042985140.15/warc/CC-MAIN-20150728002305-00285-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 821736463,
    "recordOffset": 821708492,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{134211=Copyright © 2009 - 2014 W3C® (MIT, ERCIM, Keio), All Rights Reserved. W3C liability, trademark and document use rules apply.}",
    "lastModified": "Mon, 03 Feb 2014 16:06:29 GMT",
    "textBeforeTable": "true/false Value: All elements of the base markup Used in Roles: Value Characteristic Characteristics of aria-atomic When aria-atomic is true, assistive technologies MAY choose to combine several changes and present the entire changed region at once. If aria-atomic is explicitly set to true, assistive technologies will present the entire contents of the element. If aria-atomic is explicitly set to false, assistive technologies will stop searching up the ancestor chain and present only the changed node to the user. If none of the ancestors have explicitly set aria-atomic, the default is that aria-atomic is false, and assistive technologies will only present the changed node to the user. When the content of a live region changes, user agents SHOULD examine the changed element and traverse the ancestors to find the first element with aria-atomic set, and apply the appropriate behavior for the cases below. Both accessibility APIs and the Document Object Model [DOM] provide events to allow the assistive technologies to determine changed areas of the document. Indicates whether assistive technologies will present all, or only parts of, the changed region based on the change notifications defined by the aria-relevant attribute. See related aria-relevant. # aria-atomic",
    "textAfterTable": "For a textbox with the aria-autocomplete attribute set to either inline or both, authors SHOULD ensure that any auto-completed text is selected, so the user can type over it. Characteristics of aria-autocomplete Characteristic Value Related Concepts: XForms selection attribute in select Used in Roles: combobox textbox Value: token Values of aria-autocomplete Value Description inline: The system provides text after the caret as a suggestion for how to complete the field. list: A list of choices appears from which the user can choose. both: A list of choices appears and the currently selected suggestion also appears inline. none (default): No input completion suggestions are provided. aria-busy (state) # Indicates whether an element, and its subtree, are currently being updated. The default is that aria-busy is false. If authors know that multiple parts of the same element need to be loaded or modified, they can set aria-busy to true when the first part is loaded, and then set",
    "hasKeyColumn": true,
    "keyColumnIndex": 1,
    "headerRowIndex": 0
}