{
    "relation": [
        [
            "County",
            "Orange",
            "San Diego",
            "Kern",
            "Fresno",
            "San Bernardino",
            "Riverside",
            "Placer",
            "Stanislaus",
            "Ventura",
            "Shasta",
            "Tulare",
            "El Dorado"
        ],
        [
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            ""
        ],
        [
            "Total",
            "683,073",
            "639,695",
            "116,811",
            "127,070",
            "341,011",
            "427,254",
            "107,703",
            "110,462",
            "209,561",
            "47,590",
            "61,150",
            "51,608"
        ],
        [
            "Harris",
            "208,780",
            "246,542",
            "31,861",
            "45,013",
            "127,276",
            "155,953",
            "31,998",
            "41,587",
            "81,543",
            "12,778",
            "18,200",
            "15,335"
        ],
        [
            "Cooley",
            "416,466",
            "335,071",
            "73,293",
            "72,289",
            "179,477",
            "236,923",
            "66,112",
            "59,205",
            "112,402",
            "29,737",
            "38,109",
            "31,061"
        ],
        [
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            ""
        ],
        [
            "Unproc",
            "233,196",
            "240,000",
            "65,200",
            "79,748",
            "99,000",
            "78,100",
            "28,056",
            "40,430",
            "40,279",
            "16,200",
            "17,204",
            "17,400"
        ],
        [
            "Harris",
            "71,276",
            "92,497",
            "17,784",
            "28,250",
            "36,950",
            "28,507",
            "8,335",
            "15,221",
            "15,673",
            "4,350",
            "5,120",
            "5,170"
        ],
        [
            "Cooley",
            "142,178",
            "125,712",
            "40,910",
            "45,368",
            "52,105",
            "43,308",
            "17,222",
            "21,670",
            "21,604",
            "10,123",
            "10,722",
            "10,472"
        ],
        [
            "Margin",
            "-70,902",
            "-33,214",
            "-23,126",
            "-17,118",
            "-15,155",
            "-14,801",
            "-8,886",
            "-6,448",
            "-5,931",
            "-5,773",
            "-5,601",
            "-5,302"
        ]
    ],
    "pageTitle": "Swing State Project",
    "title": "",
    "url": "http://www.swingstateproject.com/tag/CA-AG",
    "hasHeader": true,
    "headerPosition": "MIXED",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988650.6/warc/CC-MAIN-20150728002308-00112-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 730293059,
    "recordOffset": 730240950,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{12798=• NY-Sen: Kirsten Gillibrand has to do it all over again in 2012 (this one was just a special election), and rumors are that former Bush administration official Dan Senor, who spurned a run this time, is interested in a run next time. It's hard to imagine, if Gillibrand could top 60% in a year as bad as this, that Senor could somehow overperform that in a presidential year., 21395=• Demographics: Here's some interesting demographic slice-and-dice from the Washington Post: Dems increased their vote share in big counties (500K+) from 49% in 1994 to 54% this year, but lost even further in smaller counties, from 43% in 1994 to 39% this year. The districts the GOP won were disproportionately older, whiter, and less educated. And on a related note, check out these maps and the interesting ways they represent population density around the U.S. Note any similarities between these maps and where Democratic votes are concentrated?, 4895=• PA-Sen: The first announced GOP candidate in Pennsylvania has also surfaced, and he's also on the cusp between Some Dude and whatever's one step higher than that. Marc Scaringi was a legislative aide to Rick Santorum back in the 1990s, and is currently a lawyer in Harrisburg. (The article also cites one other potential GOP challenger in addition to the usual Jim Gerlach/Charlie Dent suspects: incoming state House majority leader Mike Turzai, whom you might remember weighing and deciding against a PA-04 run in 2010.) As for Bob Casey Jr., he's running again, although his main concern for the next year seems to be upping his low-key profile., 14943=• CT-05: Random rich guy Mark Greenberg, who finished third in the GOP primary in the 5th this year (although with nearly 30% of the vote), says he'll be running again in 2012. Added incentive: he says he expects this to be an open seat as Chris Murphy runs for Senate., 139176=• WA-Sen: Patty Murray seems to be taking a page from the John Hickenlooper campaign in Colorado, dropping a huge amount of money right now on advertising reservations, all the way through November, while they're still cheap. She spent $3.4 million, nearly half her CoH, on ad buys in July. She can count on her coffers being replenished, though, as Barack Obama will be hosting a fundraiser for her later this month., 154175=• AZ-Gov: Ain't that a kick in the head? State Treasurer Dean Martin, who was regarded as something of a frontrunner when he jumped into the GOP primary earlier this year, is suspending his campaign, ostensibly because he didn't want to be a distraction to Gov. Jan Brewer as she fights lawsuits over SB 1070. In reality, Martin never really caught fire, first when rich self-funder Owen Buz Mills grabbed the not-Brewer mantle and then, mostly, when Brewer suddenly became belle of the right-wing ball when she signed SB 1070., 6448=• KY-AG: Here's a surprise: after a few weeks of hype concerning a 2011 battle royale between Jack Conway and Trey Grayson for Attorney General, Grayson suddenly reversed course. Rather than run again for SoS, where GOPers were already lining up, he apparently won't run for anything, other than the sweet embrace of the private sector., 51606=Perhaps most significantly, Harris is performing better in the Abs/Prov/VBMs that have been added. Based on her performance as of our November 8th county-by-county canvass and and the origin of the 1,042,711 tabulated since then, we would have expected Kamala to outperform Cooley by 0.84%, for a margin of 8,707. But instead, she's actually outperformed Cooley by 2.28%, improving her margin by 23,754., 145479=• WV-01: As heartburn-inducing Mike Oliverio will probably be in terms of his voting record, here's some confirmation that we at least got an electoral upgrade here from the guy he defeated in the Dem primary, Rep. Alan Mollohan, who had ethical clouds following him and seemed to be phoning in his campaign. Oliverio is out with a new internal from Hamilton Campaigns that gives him a 52-36 lead over GOP opponent David McKinley. With Joe Manchin at the top of the ticket in a November special election, now, too, here's one Tossup seat where our odds seem to be getting noticeably better. (As a bonus, they find Manchin leading John Raese 62-30 in the district, which is West Virginia's reddest.), 6860=• Chicago mayor: One more poll gives Rahm Emanuel a sizable edge in the Chicago mayoral race. He has 39% support in a Chicago Retail Merchants Association poll, followed by Carol Mosely Braun at 12, Gerry Chico at 9, Danny Davis at 7, and His Accidency, Roland Burris, at 2. The real question here seems to be whether Emanuel can win on Feb. 22 without a runoff (which would be Apr. 5)., 13261=• MN-Gov: The recount is officially on. The State Canvassing Board, whom you all got to know really well in early 2009, ruled that the 8,770 vote lead for Mark Dayton is less than one-half of a percentage point and that an automatic recount is triggered. The count starts on Monday and should end in mid-December, allowing time for swearing in on Jan. 3 (unless things really go haywire). This comes after a variety of legal maneuvering from both sides, including a fast Minnesota Supreme Court ruling against Tom Emmer, in response to his desire to force counties to comb through voter rolls and eliminate votes that were \"excessively cast.\" No word yet on whether the Board will honor Dayton's request for ways to streamline the process (and minimize Emmer's chances for challenges)., 147711=• Redistricting: Ohio, unfortunately, won't be having a referendum on a constitutional amendment on the ballot in November, that would limit parties' ability to gerrymander by requiring bipartisan support for new maps. The problem? The parties in the state legislature couldn't agree on the exact framework for the plan. At least there's good news on the better-districts front in New York, where the state Senate just passed legislation that will make sure that incarcerated persons are counted in their home communities, when legislative lines are redrawn next year., 143317=• AZ-01: Rogue dentist Paul Gosar has a lead in the Republican primary in AZ-01 for the right to take on freshman Rep. Ann Kirkpatrick, if his own internal is to be believed. The poll from Moore Info puts him at 30, with '08 candidate Sydney Hay at 10, Some Dude Bradley Beauchamp at 7, and, surprisingly, former state Sen. majority leader Rusty Bowers back at 6. Gosar seems to have consolidated many big-name movement conservatives behind him, ranging from Sarah Palin to Joe Arpaio. My main question, though, is: Sydney Hay is running again?!? Why weren't we informed? (You may remember her legacy of fail from her 2008 run.), 43349=• IN-Sen: Richard Lugar made it official; he's running for re-election one more time. Lugar, who'll be 80 in 2012, probably has more to worry about in the Republican primary than he does in the general election, where aspiring Democrats would probably be more interested in the open gubernatorial seat., 7380=• AR-St. House: Here's an interesting situation in Arkansas, where Dems still control the state House (albeit with reduced numbers) but an unusual special election is already on tap. Democratic State Rep. Rick Saunders was apparently going to be given a pass to serve another two years despite being term-limited out, because the guy who won the seat in November, GOPer Keith Crass, did so despite being dead. He beat Dem Larry Williams despite dying during the early voting period. Now Saunders says he'll resign in early January so a special election can be held (in April at the earliest)., 153437=• WV-Sen: Rep. Shelly Capito Moore is at least honest about being scared about running for Senate (almost certainly against highly popular Gov. Joe Manchin), although she isn't couching it in terms of being afraid of Manchin per se, instead saying \"I'm afraid to lose momentum that I think I provide for the state.\" At any rate, she says she'll make her (seeming unlikely) decision whether to run in the next few days, probably coinciding with the clarification on the election's when and how, to be decided in a July 15 legislative special session., 140084=• CO-Gov: Is there blood here in the water, or what? Colorado Ethics Watch just filed a complaint with the state bar, which could lead to disciplinary action against Scott McInnis's license to practice law in Colorado, over his plagiarism scandal. McInnis's former campaign manager (until last December, so he was out long before the scandal) also just asked McInnis for a refund of all the contributions he's given him. The DGA is also starting to pour money into this race, striking while the iron is hot; they've plowed $100K into a new third-party group airing a new anti-McInnis attack ad. And if you were thinking that Dan Maes might turn out to be a reasonable alternative to McInnis, guess again. He ventured not just into Michele Bachmann territory (about how we'll all have to live in tenements and take mass transit to work) but clear into UN-black-helicopters-are-fluoridating-my-water territory. And what's the nerve center of the one-world-government's scurrilous plot against Coloradan sovereignty? Denver's program for public bike shares and more showers for bike-riding commuters!!!!1!, 163113=• VA-05: Finally, here's the delicious cherry on top of the shit sundae of fundraising reports: Tom Perriello announces that he raised $660K last quarter, giving him $1.7 million CoH. No word yet from Robert Hurt, but with $121K on hand in his May 19 pre-primary report, I can imagine it's not in Perriello's ballpark. The Richmond Times-Dispatch has an interesting compare-and-contrast enterprise in how Perriello and fellow vulnerable freshman Dem Glenn Nye are approaching their re-elections (Perriello emphasizing his base, Nye emphasizing his independence); clearly, based on these numbers, playing to the base can pay off, at least at the bank., 45728=• MN-Gov: Minnesota's SoS (a Dem, Mark Ritchie) has laid out the timeline for the recount process. The race will be canvassed starting Nov. 23, and presuming a recount is necessary (which it will be unless something weird happens with the canvass, as Dem Mark Dayton leads Tom Emmer by less than one-half of a percent, triggering the automatic recount provision), the recounting will begin on Nov. 29., 15821=• MD-01: Recently-defeated Frank Kratovil seems like one of the likeliest losses to run again in 2012, especially since the Dem-controlled Maryland legislature is likely to serve him up a much Dem-friendlier district (as many of our in-house mapmakers have suggested). He isn't saying yes yet, but says he will \"consider\" it., 9585=• History: Here's a great look back from Greg Giroux at Senate cycles where one party was defending more than 10 seats than the other party (as the Dems will in 2012). While the last three times this happened ( 2006 2008, 1986, and 1980), the defending party got hammered, many of the prior examples showed little movement one way or the other, including 1976, where a number of incumbents of both parties lost (in the post-Watergate environment) but it all balanced out to zero., 42090=• FL-Sen: George LeMieux, whose year-and-a-half in the Senate is about to expire, is leaving with more of a whimper than a bang, if PPP is to be believed: his approvals are 11/28 (with 61% with no opinion), including 14/24 among Republicans. He's not looking like he'd have much impact in a challenge to Bill Nelson in 2012, which he's threatened (which isn't to say that Nelson is out of the woods, as a stronger Republican will no doubt come along). Among all the appointed Senators, he's still faring better than Roland Burris (18/57) but worse than Carte Goodwin (17/22) and Ted Kaufman (38/33). (Oh, and if you're still feeling like we lost out by not having Charlie Crist win the Senate race, guess again: Bob Dole! is reporting that Crist promised him he'd caucus with the GOP if he won the 3-way race. This comes after leaks in the waning days of the race that he'd caucus with the Democrats. Somehow, I expect any day now that Ralph Nader will reveal that Crist promised him that he'd caucus with the Green Party if he won the race.), 26083=As with last time, the ballots reporting have been more friendly to Kamala than before; she's doing 0.36% better than we expected her to based on the November 13 canvass and 0.65% better than expected based on the November 8 canvass. Here are the relative swings in each county since the November 13th and 8th updates., 8915=• Money: The Dems, after getting outgunned on the dark money front in 2010 by a wide margin, aren't going to be caught napping this time (and this time, unlike 2008, they seem to have Barack Obama's tacit approval). David Brock (in his quest to become the left's answer to Karl Rove) is busy revving up his own 527/501(c)(4) type-thing for corraling large donations from undisclosed donors. The good news: they've already lined up $4 million in commitments. The bad news: they're being led by Kathleen Kennedy Townsend (although maybe she's better behind the scenes than she is as a campaigner)., 3727=• FL-Sen: The first announced Republican candidate for the Senate in 2012 is both a Some Dude and a familiar face: college instructor Mike McCalister. If the name rings a bell, he got 10% in this year's gubernatorial primary by virtue of not being either Rick Scott or Bill McCollum. As for temp Sen. George LeMieux, a reported possible candidate, his current status is still \"no decisions yet,\" albeit \"I do feel a calling to serve.\", 18182=• Odds and ends: The Fix has a massive list of people considering rematches in 2012, most of which we've already dealt with before (including Kuster and Kratovil, above). Other names that we haven't listed include Brad Ellsworth (either for Gov, Senate, or his old IN-08), Christine O'Donnell in Delaware (not unexpected, since she runs every 2 years anyway), Glenn Nye, and Allen Boyd (despite his losing very thoroughly to Steve Southerland)., 44895=• PA-Sen: The GOP feels like they have a shot against Bob Casey (who won by a near-overwhelming margin in 2006), given the state's turn toward the red this year. The big question, though, is who? If Tom Ridge didn't do it this year when it would have been a gimmee, he certainly isn't any likelier to do it in 2012. Hotline mentions a couple current suburban Reps., Jim Gerlach and Charlie Dent, both of whom have tenaciously held down Dem-leaning districts that would be prime open seat battles if they left. Failing that, the bench looks pretty empty; they cite state Sen. Jake Corman as interested, as well as talk radio host and behind-the-scenes player Glen Meakem, who cited interest in running for 2010 but decided against it.}",
    "textBeforeTable": "Therefore, we estimate 428,179 ballots left unprocessed (compared to the SoS' 671,594.) The remaining territory is pretty much a wash, with our estimates having Harris gaining 47 votes to pad her margin. As with last time, the ballots reporting have been more friendly to Kamala than before; she's doing 0.36% better than we expected her to based on the November 13 canvass and 0.65% better than expected based on the November 8 canvass. Here are the relative swings in each county since the November 13th and 8th updates. Yolo: -9,791; the county reports 0 ballots unprocessed. Ventura: -6,142 for votes added since November 11. Tehama: -1,976 for votes added since November 10. Santa Clara: -18,100; the county estimated 18,100 outstanding on November 10 but has added 18,174 votes since then. San Mateo: -26,812; this is the county's \"final unofficial results.\" San Luis Obispo: -826 for votes added since November 12. San Francisco: -18,892 for votes added since November 8. San Diego: -44,970; the county reports 27,000 ballots left. Riverside: -11,300; the county reports 18,400 ballots left. Placer: +27,956; vote counts have not been updated since November 3. Orange: -53,404; the county reports 912 ballots left. Nevada: -4,730; the county estimated 4,730 outstanding on November 8 but has added 6,692 votes since then. Mariposa: -267; this is the county's \"final update.\" Marin: -19,108",
    "textAfterTable": "0.28% Santa Barbara 0.28% 0.00% 0.28% Santa Clara 0.03% 0.23% 0.26% San Bernardino 0.24% 0.00% 0.24% Mariposa 0.00% 0.24% 0.24% Marin 0.18% 0.00% 0.18% Shasta 0.10% 0.00% 0.10% Tuolumne 0.00% -0.08% -0.08% Yolo -0.15% 0.00% -0.15% Los Angeles -0.33% 0.18% -0.15% Siskiyou -0.16% 0.00% -0.16% San Joaquin -0.15% -0.02% -0.16% Imperial 0.14% -0.30% -0.17% Solano -0.29% 0.00% -0.29% Yuba -0.35% 0.00% -0.35% Tehama -0.64% 0.27% -0.37% Santa Cruz -0.43% 0.00% -0.43% Amador -0.58% 0.00% -0.58%",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}