{
    "relation": [
        [
            "Categories",
            "Campus Safety",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "I never saw any safety issues on campus. They are very vigilant when it comes to ensure students safety.",
            "Many clubs and actives to get involved in as a student. The student actives office offers many trips and discount on movie tickets and theater tickets. A very inclusive campus.",
            "Great food with many places to choice from in different buildings. Also many vending machines in almost every building. Near fast food places as well.",
            "No dorms but very social campus.",
            "It all depend on the classes your taking and the professors. They have honor programs and teachers who will give you so much academic challenges but be worth it in the end. I never came across a teacher who didn't seem to know what they were doing.",
            "Always go in person when you need to know something about anything on campus. The staff their want to help you, they enjoy helping you. Always go on rate my professor when picking classes to see how you might be professor ranks up according to past students.",
            "I loved this school. I've been their part time for four years and I don't regret going to STCC before my 4 year college. One of the easiest college campus to figure out."
        ]
    ],
    "pageTitle": "Springfield Technical Community College Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Springfield-Technical-Community-College/reviews?_escaped_fragment_=/show/67519",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042985140.15/warc/CC-MAIN-20150728002305-00046-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 894426003,
    "recordOffset": 894393442,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{102348=© 2015, Cappex.com, LLC}",
    "textBeforeTable": "07/22/2010 Reviewer is Accepted here and planning to attend soon. Reviewer has been to campus. 2 out of 4 people found this review useful. 1 of 25 Abigail from Springfield, MA Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464",
    "textAfterTable": "Tips for prospective students Stay organized and turn in your work! Bang for the buck Worth every dollar! Am learning a lot In the field I am currently in, Energy systems for HVAC, I am learning a lot and the professors actually know what they are talking about. You get a lot of hands on assignments which helps me learn directly versus just being told in a classroom what to do. Login to rate or flag the reviews Elisa from Springfield, MA 04/26/2012 Reviewer is A current student here. 2 out of 2 people found this review useful. 3 of 25 Categories Comments Campus Safety Very safe no safety issues Clubs and Activities Clubs for everything Great for these types of students",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}