{
    "relation": [
        [
            "Categories",
            "Campus Safety",
            "Greek Life",
            "Clubs and Activities",
            "Great for these types of students",
            "Share any unusual traditions or locations on campus",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "Any issues the camus police are on it. There are also emergincy boxes all around the school. Plus the buildings have cameras throughoput the buildings.",
            "For honor students there is PKA. They do a lot activities with in the community and for all students. They also do a lot of charity work too.",
            "Worcester has a great night life. Just head down town and the clubs are all over. Plus if you go about a mile in a half down the road and there is two gameing clubs. Go less then a mile the other direction and the is a multiplex with 20 screens.",
            "This campus is benifialfor any student. The disability office, tutoring services and the different clubs are very active. Then for veterans, we are starting a Veterans Affairs office to assist veterans and dependents receiving VA benifits.",
            "There is a memorial dedicated to the victums of the 1954 tornado on campus. There is a robatics department that is very active with compations. Then for tradition, they are changing traditions by make campus smoke free.",
            "The student life center offers deals on discounted movie tickets and trips all over the place. I personaly have takened trips to Hampton Beach, Red Sox games, and local hockey teams. On Veterans Day we will be marching in the Veterans Parade.",
            "There are too many to mention in the general area. Just an example, across the street is Papa Ginos pizza. Then you go down the street and there are all kinds of different pups and grills.",
            "There is no dorms however the school is in a highly residental area. The local area is very rural. There are always places for rent.",
            "This school has done a lot to build a good and strong reputation for academic excalence. The professors here will make sure there is a plan and path for your success in school and after graduation.",
            "Take advantege of everything there is in this school. The more you take advantege the more events will happen. Plus if there is any issues just ask for the serveces are plentiful.",
            "I am a retired veteran with disabilities that effect me in many different ways. First of all, this school has been depermental for me transition from full time Army to full time student. Then with my disabilities, they have tutoring centers for free plus a disability services with many ways to help."
        ]
    ],
    "pageTitle": "Quinsigamond Community College Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Quinsigamond-Community-College/reviews?_escaped_fragment_=/show/30113",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438044160065.87/warc/CC-MAIN-20150728004240-00307-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 895597519,
    "recordOffset": 895561871,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{117650=© 2015, Cappex.com, LLC, 96387=There is a memorial dedicated to the victums of the 1954 tornado on campus. There is a robatics department that is very active with compations. Then for tradition, they are changing traditions by make campus smoke free.}",
    "textBeforeTable": "06/02/2011 Reviewer is A current student here. 1 out of 1 people found this review useful. 1 of 29 Timothy from Auburn, MA Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5",
    "textAfterTable": "Since this my first year, it's not too bad, the life of a college student is challenging but there are lots of support if you need it. The staff are really supportive and helpful. They make you feel comfortable and help you developed into a good person. For me there's a lot to learn and they already got me enthusiastic and ready take on any challenges. What to do for fun Well you can start by hitting the books, hanging out with clubs members and socializing. Food and Dining The cafeteria isn't that big but that's what makes it special is you get to meet new people all the time. Dorm Life No dorm, it's a community college you come and go as you please. :-( Academic Rigor The advisors works hard making sure that you're where you want to be. They provide great understanding and support for the sudents. Tips for prospective students You want to come here because it's affordable with many other benefits as well. If you're a first year generation and aren't sure about college quinsgamond is the best place to for you. You",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}