{
    "relation": [
        [
            "Field Name",
            "Version",
            "Count",
            "System Uptime",
            "UNIX Seconds",
            "UNIX NanoSeconds"
        ],
        [
            "Description",
            "Flow export format version number. In this case 1.",
            "Number of export records in the datagram.",
            "Number of milliseconds since the router last booted.",
            "Number of seconds since 0000 UTC 1970.",
            "Number of residual nanoseconds since 0000 UTC 1970."
        ]
    ],
    "pageTitle": "Configuring NetFlow and NetFlow Data Export  [Cisco IOS 15.2S] - Cisco Systems",
    "title": "",
    "url": "http://www.cisco.com/en/US/docs/ios-xml/ios/netflow/configuration/15-2s/cfg-nflow-data-expt.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042985140.15/warc/CC-MAIN-20150728002305-00210-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 371679031,
    "recordOffset": 371638218,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{26497=Seconds since 0000 Coordinated Universal Time (UTC) 1970., 130560=Router(config)# ip flow-export destination 172.16.10.2 99, 161815=After you enable NetFlow on an interface, NetFlow reserves memory to accommodate a number of entries in the NetFlow cache. Normally, the size of the NetFlow cache meets the needs of your NetFlow traffic rates. The cache default size is 64K flow cache entries. Each cache entry requires 64 bytes of storage. About 4 MB of DRAM are required for a cache with the default number of entries. You can increase or decrease the number of entries maintained in the cache, if required. For environments with a large amount of flow traffic (such as an Internet core router), Cisco recommends a larger value such as 131072 (128K). To obtain information on your flow traffic, use the show ip cache flow command., 176426=Router(config)# ip flow-cache entries 131072, 136268=Entering this command on a Cisco 12000 series Internet router causes packet forwarding to stop for a few seconds while NetFlow reloads the RP and LC Cisco Express Forwarding tables. To avoid interruption of service to a live network, apply this command during a change window, or include it in the startup-config file to be executed during a router reboot., 68911=Number of residual nanoseconds since 0000 UTC 1970., 68624=Number of seconds since 0000 UTC 1970., 49063=For all export versions, you can specify a destination where NetFlow data export packets are sent, such as the workstation running NetFlow Collection Engine, when the number of recently expired flows reaches a predetermined maximum, or every second--whichever occurs first. For a Version 1 datagram, up to 24 flows can be sent in a single UDP datagram of approximately 1200 bytes; for a Version 5 datagram, up to 30 flows can be sent in a single UDP datagram of approximately 1500 bytes., 162689=A NetFlow cache can be resized depending on the platform and the amount of DRAM on a line card. For example, the NetFlow cache size is configurable for software-based platforms such as Cisco 75xx and 72xx series routers. The amount of memory on a Cisco 12000 line card determines how many flows are possible in the cache., 163034=Using the ip flow-cache entries command, configure the size of your NetFlow cache from 1024 entries to 524,288 entries. Use the cache entries command (after you configure NetFlow aggregation) to configure the size of the NetFlow aggregation cache from 1024 entries to 524,288 entries., 216628=BGP --Border Gateway Protocol. An interdomain routing protocol that replaces Exterior Gateway Protocol (EGP). A BGP system exchanges reachability information with other BGP systems. BGP is defined by RFC 1163.}",
    "textBeforeTable": "NetFlow Version 1 Packet Header Field Names and Descriptions Table 8 The table below lists the NetFlow Version 1 export packet header field names and descriptions. Version 1 Export Packet Header Format Figure 8 The figure below shows the NetFlow Version 1 export packet header format. The NetFlow Version 1 data export format was the format supported in the initial Cisco IOS software releases containing the NetFlow functionality. It is rarely used today. Do not use the Version 1 export format unless the legacy collection system you are using requires it. Use either the Version 9 export format or the Version 5 export format. NetFlow Version 1 Data Export Format Reserved. Reserved 22 to 23 Slot number of the NetFlow engine. Engine ID 21",
    "textAfterTable": "Egress NetFlow Accounting Benefits NetFlow Accounting Simplified The Egress NetFlow Accounting feature can simplify the NetFlow configuration. The following example shows how. In the two figures below, both incoming and outgoing (ingress and egress) flow statistics are required for the server. The server is attached to Router B. The \"cloud\" in the figure represents the core of the network and includes MPLS VPNs. All traffic denoted by the arrows must be accounted for. The solid arrows represent IP traffic and the dotted arrows represent MPLS VPNs. The first figure below shows how the flow traffic was tracked before the introduction of the Egress NetFlow Accounting feature. The second figure below shows how the flow traffic is tracked after the introduction of the Egress NetFlow Accounting feature. The Egress NetFlow Accounting feature simplifies configuration tasks and facilitates collection and tracking of incoming and outgoing flow statistics for the server in this example. Because only ingress flows could be tracked before the Egress NetFlow Accounting feature was introduced, the following NetFlow configurations had to be implemented for the tracking of ingress and egress flows from Router B: Enable NetFlow on an interface on Router B to track ingress IP traffic from Router A to Router B.",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}