{
    "relation": [
        [
            "Categories",
            "Great for these types of students",
            "Tips for prospective students",
            "Bang for the buck",
            "Am enjoying being here",
            "Am learning a lot"
        ],
        [
            "Comments",
            "Well-rounded students with As and Bs and good SAT/ACT scores should get in. This college is a social one and likes to put on lots of activities so be prepared to meet lots of people at these events! Anyone who has a good attitude and is motivated to keep working and showing up to class will do well here. If you love to walk then this is definitely your school, and if you love architecture and hanging out outside then you will love it here. Anyone really can go to this school, because it is diverse and there's something for everybody here.",
            "Apply early, preferrably during the beginning of the school year because less students apply and you'll have a bigger chance of getting accepted. Once you get in and plan to live on campus, don't wait to apply for housing, because it is very limited and you'll want to get into a good dorm. For students going to any college, apply for scholarships early and for as many as you can. College is expensive and all the financial help you get will definitely help. Also have fun getting ready. It can be stressful between getting accepted and so is move-in day, so have fun being stressed and you'll be well off.",
            "What college is not expensive? But with your tuition you can get free tickets to almost every sporting home game. There are many meal plans to choose from that come with Flex bucks or Garnet bucks, which you can spend at any restaurant on campus. There is a Student Alumni Association you can join that'll get you discounts at the book stores on campus and there is always some sort of event going on on campus for free or a low price. For example, there is a movie showing at the Student Life Center every week, there are concerts to go to, and there are other fun events that get posted on Facebook all the time that all the students are invited to.",
            "This is such as beautiful campus and the weather varies so some days it may be very hot and great to go out on Landis to sun tan or play ultimate frisbee, and there are cool days where the sun is still out where we can feel warm when we're walking to classes. There are also many rainy days so if you do plan on coming, buy yourself a cute pair of rain boots and you'll fit right in to the rainy day trends! There are so many things to do on campus also. There's a theater where you can get in for free with your FSU card and watch some great movies, and there are many Christian organizations of all denominations if you want to get connected with a group of people there. You can walk anywhere on campus and view many beautiful buildings and pieces of architecture on your way to your destination.",
            "There are many professors that want us to learn so they teach well and are willing to help us when we need it. A lot of them are young and students as well, but they are very well knowledged in the subjects that they teach and it's nice to have them because they speak more like us and understand what we're going through becauase they have gone through the same recently. We have a good learning environment at this school."
        ]
    ],
    "pageTitle": "Florida State University (FSU) Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Florida-State-University/reviews?_escaped_fragment_=/show/20155",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042985140.15/warc/CC-MAIN-20150728002305-00172-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 892060519,
    "recordOffset": 891856977,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{825856=May be challenging depending on courses chosen and study habits. Getting to know your professors always gives you an advantage., 468346=For many students like myself, this is your top, or one of your top choice universities in which you want to attend. I recommend you to study for the SAT/ACT until you feel confident that you can get a solid 1750 on it between all three sections or a 25/26 for the ACT for freshman applicants. Also, build up your GPA and take sequential courses in a specific field of study for example; if you want to take Spanish, they like to see that you took Spanish I, II, AP Spanish Lang, AP Spanish Lit. It truly shows rigor in your high school career and knowledge in a specific subject. Also, if you are a Florida student ONLY you should look into the CARE Summer Bridge Program. Its a program in which all your costs for the summer are covered for your first summer semester and they truly help you transition to college life and how to succeed up at Florida State and anywhere else you wish to attend afterwards. The requirements are a bit more lenient but they truly look for the top of the top in leadership, academics, community service, and overall quality of the person., 571952=Apply for the first deadline. You’ll find out if you got into FSU before you find out about all of your other potential colleges if you apply for the October deadline. This gives you more time to explore opportunities that you want to take advantage of at FSU before you get there! Apply for a living learning community! These communities allow you to live with and take classes with other people in your major or area of interest. There’s many to choose from and they help you find friends and study buddies as soon as you start school! Plus, many of them offer extra opportunities outside of academics, like leadership in an affiliated society or research/career experience opportunities. Once you get to FSU, plan your time wisely. Most assignments are assigned weeks ahead of their deadlines, so start them early and leave yourself plenty of time to edit papers and projects as the deadline approaches. In classes like mathematics, the sciences, and lab classes, you will have smaller, regular homework assignments that you are expected to complete. Make sure that you don’t fall behind on these smaller assignments while working on big projects for other classes. Join an organization that addresses something you are passionate about, like a career-based society, a service organization, or a campus ministry. This will help you meet other like-minded students and develop friendships early on. Having a group of friends with whom you can relate will help you adjust to living away from home., 133174=Come to campus. A lot of students are wary about coming, saying that it may be too far from home, but once you see campus you may change your mind. I would also try to get the highest score possible on your SAT/ACT, so then you can qualify for Bright Futures as well as the FSU scholarships available. I get $1200 a semester from FSU because of my scores. Look around, and if you aren't sure what major you want to take just yet, be an undeclared major for a semester or two until you decide. You can do most of your liberal study requirements then so that you'll still be on track for graduation., 1013101=On your birthday it is tradition to get thrown into a fountain on campus. Another fountain tradition is when the seniors get their class rings they dip them in the fountain at 6:51 pm, because in military time it is 18:51, which is the university's founding year. One more tradition is the one before football games, where Chief Osceola rides in on his horse with a flame-tipped spear, 7044=There are many different programs at FSU so you will be surrounded with experienced and helpful faculty. The university is strong in the liberal arts and hard sciences, but they also have a number of other outstanding programs including criminology, sociology, psychology, law, and business. Orientation at FSU was very informative for both my parents and myself. It was a 2-day learning experience that consisted mainly of talks by various campus reps/student leaders. It was a great start where you can meet people from different backgrounds and experiences. I was drawn to find out more about FSU’s medical program. In 2005, the FSU College of Medicine received full accreditation from the Liaison Committee on Medical Education. The FSU College of Medicine is now ranked among the top 5 in nation for turning out doctors who choose to specialize in family medicine. Medical students will complete their clinical rotations in the third or fourth year at one of these regional campuses in Orlando, Pensacola, Sarasota, Tallahassee, Daytona Beach, and Fort Pierce. This is extremely important to me since my educational goal is to one day become a medical doctor. This may seem like a daunting task, but I believe that if I work hard and set the right goals for myself I can do it. Also, FSU provides enormous research opportunities that are supported by the school of Computational Science and Informational Technology and the famous the National High Magnetic Field Laboratory. The National High Magnetic Field Laboratory is the world’s largest magnetic of it’s kind. FSU is an excellent university, but you will need to work very hard., 935208=Campus is very safe. We have safety poles covering the entire campus and the night noel will take you anywhere and pick you up anywhere until 3 o'clock in the morning., 724161=FSU has three dining halls: Suwannee, Fresh Foods, and The Figg. Suwannee is located on the east side of campus, by most of the nicer suite-style dorms. Fresh Foods is located on the west side of campus. The Figg is located in the stadium, and though it is primarily the atheletes' dining hall, all students can eat there between 11 am and 1:30 pm. The Figg has the best food, but Suwannee and Fresh Foods also have a wide variety of selections. In addition to the dining halls, FSU has restaurants on campus. These include Salad creations, Einstein Bagels, Chilli's, Papa Johns, and a few more. There are also many restaurants off campus that are within walking distance., 520528=FSU really gets you to think. Most classes, even at the 2000 level, require a good deal of thought and effort. Sometimes you can get by without actually learning too much, but then what are you really paying for? You get what you give. If you put in the effort to learn, you will. The faculty and staff are extremely welcoming for the most part. They want you to come to office hours; they want you to ask questions. FSU is a friendly, extremely educational environment.}",
    "textBeforeTable": "06/10/2009 Reviewer is Accepted here and planning to attend soon. Reviewer has been to campus. 102 out of 111 people found this review useful. 1 of 529 Ashley from Deerfield Beach, FL Check out reviews left by other students or leave your own review. You could win a free scholarship. Florida State University Reviews Florida State University › Florida › By State › Colleges › } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.create',",
    "textAfterTable": "Great for these types of students If you are looking for an all around college experience than The Florida State University is for you. I think that any student who believes in the traditions that Florida State University represents would be proud to attend this university. I believe that any student can relate to the Florida State University's motto, which is Vires, Artes, and Mores. These are Latin words that signify strength, skill and character. These words have formed the very foundation that has been driving force behind my continued success at Florida State University. Any student that embodies these same traditions and is passionate about pursing excellent education will be an excellent addition to the Seminole family. Tips for prospective students My words of advice to prospective students would be to develop better study habits and management of my finances. When I was in high school I could study the night before a test and do very well on it. Those days are definitively over now that I’m in college. Now it’s all about communicating more with my professors, study groups, and tutoring services if needed. Also looking back I realized how nice I had it at home such as free food/rent, money to buy clothes, and I didn’t have to pay for classes nor books. Again, those days are definitively over now that I’m in college. Now it’s all about managing my own finances and",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}