{
    "relation": [
        [
            "Year",
            "1968",
            "1969",
            "1970",
            "1971",
            "1972",
            "1973",
            "1974",
            "1975",
            "1976",
            "1977",
            "1978",
            "1979",
            "Career"
        ],
        [
            "G",
            "14",
            "14",
            "14",
            "14",
            "14",
            "14",
            "14",
            "14",
            "14",
            "14",
            "16",
            "16",
            "172"
        ],
        [
            "BLK",
            "2",
            "2",
            "1",
            "1",
            "-",
            "-",
            "1",
            "-",
            "-",
            "-",
            "1",
            "-",
            "8"
        ],
        [
            "L",
            "64",
            "63",
            "66",
            "59",
            "62",
            "61",
            "57",
            "63",
            "56",
            "56",
            "56",
            "74",
            "74"
        ],
        [
            "P",
            "76",
            "70",
            "61",
            "58",
            "59",
            "64",
            "74",
            "72",
            "90",
            "91",
            "103",
            "78",
            "896"
        ],
        [
            "PY",
            "3288",
            "2957",
            "2493",
            "2348",
            "2273",
            "2581",
            "2823",
            "2924",
            "3503",
            "3502",
            "4056",
            "2998",
            "35746"
        ],
        [
            "YPP",
            "43.3",
            "42.2",
            "40.9",
            "40.5",
            "38.5",
            "40.3",
            "38.1",
            "40.6",
            "38.9",
            "38.5",
            "39.4",
            "38.4",
            "479.6"
        ]
    ],
    "pageTitle": "The official site for the Redskins 80th anniversary | Redskins 80th",
    "title": "",
    "url": "http://www.redskins80th.com/players/",
    "hasHeader": true,
    "headerPosition": "MIXED",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042985140.15/warc/CC-MAIN-20150728002305-00063-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 679742583,
    "recordOffset": 679702755,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{280229=A shifty runner and sure-handed receiver, Washington played 43 games with the Redskins. He scored 16 touchdowns for the team and was part of the 1982 Super Bowl championship team. When playing at the University of Oklahoma, coach Barry Switzer called Washington his greatest player., 329089=A two-time All-American at the University of Florida, Marshall began his career with the Bears and came to the Redskins after the 1987 season. He led the Redskins’ defensive charge during the 1991–92 seasons and in Super Bowl XXVI versus Buffalo. He was a Pro Bowl selection in 1986, 1987 and 1992., 257193=Bostic signed with the Redskins as a free agent out of Clemson in 1980 and became a mainstay on the famed “Hogs” offensive line. He was a Pro Bowler in 1983 and made four Super Bowl appearances with the Redskins, winning three championships., 4258=Nicknamed “Red,” Flaherty led the Redskins to the 1937 and 1942 NFL championships. He coached his team into the NFL title game in his rookie season. In his career, he compiled an 80-37-5 coaching record—capturing four Eastern division titles with the Redskins. He is known for introducing the team to the two-platoon system with one rushing and one passing unit., 68944=Bosseler, nicknamed “Bull,” earned a starting job in 1957 as a rookie and finished third in the NFL in rushing. During his eight seasons with the Redskins, he led the team in rushing twice, was a Pro Bowl selection in 1959, and finished his career as the team’s all-time leading rusher., 129387=Bragg grew up in Virginia as a huge Redskins fan and left his stamp on the team as a player. He holds team records for most punts in a career with 896 and most punts in a season with 103. An extremely accurate punter, he landed a team record 29 punts inside the 20-yard line during the 1976 season., 48569=Known as “Bullet Bill,” Dudley was the league’s Most Valuable Player while playing for the Steelers in 1946. He won the “triple crown” that season, leading the NFL in rushing yards, punt returns and interceptions. While growing up, the Redskins were the first team he ever saw, and to play for them was a “dream come true.”, 98590=Acquired in a 1964 trade that sent QB Norm Snead to the Eagles, Jurgensen would go on to win three NFL passing titles and help lead the Redskins to the 1972 championship game. He was elected to the Pro Bowl four times, and usually ate a bologna sandwich before each game as a pre-game ritual. Jurgensen was elected to the Pro Football Hall of Fame in 1983., 228331=“Murph” was the co-captain of the Super Bowl XVII champion team. He was selected to play in the 1982 and ’83 Pro Bowls. Among his most memorable moments with the Redskins were winning the Super Bowl in Pasadena against the Dolphins and the NFC title game victory over the Cowboys, when RFK Stadium was literally shaking., 87543=Charley Taylor played his entire professional career with the Redskins. He helped lead the 1972 team to the Super Bowl and holds the team record for most career touchdowns with 90. Second on the Redskins’ all-time receptions list, Taylor finished his career with 9,110 receiving yards and 79 touchdown catches., 175146=Known by teammates as “Talby,” Diron was a key member of the 1972 NFC Championship team. He played a total of 186 games over 14 NFL seasons. The victory over Dallas to win the NFC Championship and reach the Super Bowl is his most memorable Redskins moment., 168853=A durable and reliable defensive presence, Brundige played his entire career of 107 games with the Redskins. Brundige was a key part of the defense that helped lead the team to the 1972 Super Bowl and he blocked the FG attempt that led to the Redskins’ only TD of the game., 359620=A 13-year NFL veteran, Allen overcame reconstructive surgery on both knees to become a standout performer for Washington. He surpassed 1,300 yards rushing in a season twice while playing for the Redskins and led the league with 21 TDs in 1996., 93711=Huff, who was one of the league’s most feared tacklers, played with the motto, “Never forgive and never forget,” foremost in his mind. He counted the Redskins' demolishing of his former team, the New York Giants (72 to 41) in 1966, as one of his greatest playing moments. He was elected to the Pro Football Hall of Fame in 1982., 108425=Smith was a key member of the Redskins’ Super Bowl team in 1972. A sure-handed receiver who played for Otto Graham, Vince Lombardi, and George Allen, Smith is fourth all-time on the Redskins’ list for career receptions with 421 and sixth all-time in Redskins receiving yards with 5,496., 233062=“Olky” played 150 NFL games—all with the Redskins. He finished his career with six interceptions for 76 yards, one touchdown, and 12 sacks. He won two Super Bowl championships with victories over Miami (1982) and Denver (1987). He was named the Redskins’ Defensive MVP in 1988., 324806=“Ryp” (as his teammates called him) passed for more than 15,000 yards during his career. He was the MVP of Super Bowl XXVI and selected to play in the 1989 and ’91 Pro Bowls. His proudest accomplishments during his playing days were being a part of two Super Bowl championship teams., 162395=Nicknamed “The King” for his special teams mastery, Tillman played seven different special teams positions and served as special teams captain from 1974–77. He was a member of Washington’s 1972 NFC Championship squad. His most memorable moments with the Redskins were winning the 1972 NFC title and playing in the Super Bowl., 316983=“Big Ed,” a member of the famed “Hogs” offensive line, played on two of Washington’s Super Bowl Championship teams, XXII and XXVI. A durable, dependable performer, Simmons put together one of the benchmark performances for Redskins offensive linemen in 1995, playing 1,039 of a possible 1,042 offensive downs during the season., 276448=May was an All-American at Pittsburgh, winning the Outland Trophy, given to the nation’s most outstanding interior lineman, in 1980. He played in 123 games with Washington, was an original member of the famed “Hogs” offensive line, and was part of two Super Bowl championship teams in 1982 and 1987., 10957=A two-way player who starred on four divisional title teams, Millner holds the distinction of being the first Redskins player to record a 100-yard receiving game. He served as player/coach during his final season in 1945 and, upon his retirement, he was the team’s all-time leading receiver with 124 catches., 78562=Mitchell came to Washington in 1962 as part of a trade with the Cleveland Browns. He was a dangerous offensive weapon and led the NFL in receiving yards in 1962 and 1963. A four-time Pro Bowl selection, he retired with 14,078 total yards, standing third in NFL history., 155474=George Allen compiled a 116-47-5 regular season record as the head coach for over 12 seasons with the Redskins. He joined Washington in 1971 to lead a team that had registered one winning season in 15 years. Allen coached the Redskins to the 1972 Super Bowl., 135230=Fischer signed with Washington as a free agent in 1968, made the Pro Bowl in 1969, and helped lead the Redskins to Super Bowl VII in 1972. He ranks seventh all-time in Redskins career interceptions with 27, and fourth all-time with 412 career interception return yards., 252679=One of the most prolific kick returners in NFL history, Nelms was named to the Pro Bowl in three consecutive seasons from 1980–82. He was also selected as an All-NFL player in 1983. Nelms finished his career with more than 6,000 career return yards., 52244=The favorite player of Presidents John F. Kennedy and Richard Nixon because of his high level of play, Brito served in WWII before entering the NFL draft at age 25. He was selected to five Pro Bowls, 4 of which were consecutive between 1955 and 1958., 25399=Farkas, nicknamed “Anvil Andy” because he played without a helmet, was a two-way player who made his mark as a fullback but lined up at defensive back as well. He led the Redskins in rushing and scoring in 1938–39 and 1942–43, and was a key contributor to the Redskins’ 1942 NFL Championship., 272308=After making the team as a free agent, Jacoby would go on to play 13 seasons in the NFL, all with the Redskins. A member of the famed “Hogs” offensive line, he played on three Super Bowl championship teams and was named to the Pro Bowl four consecutive years from 1983 to 1986., 341775=Considered a driving force behind the Washington defensive unit, Coleman was a member of three Super Bowl championship teams in 1982, 1987 and 1991. His tenure with the team of 215 games is second only to Sammy Baugh. Coleman finished his 16-year Redskins’ career with 1,006 tackles and 56.5 sacks (including playoffs)., 56610=Known as the “Lil’ General,” the 5' 9\" LeBaron served as a platoon leader in Korea and was awarded the Purple Heart prior to joining the Redskins. During his playing days, LeBaron was a Pro Bowl selection in 1956, 1957, 1959 and 1963. He was inducted into the College Football Hall of Fame in 1980, 30423=Al played nine seasons with the Redskins and was an important member of the 1945 NFL East Championship squad. He was a fan favorite and, in 1952, the Redskins celebrated “Al DeMao Day” against the Steelers, where he was presented with a brand new Pontiac automobile during an emotional halftime ceremony., 214929=An extremely durable performer, Butz played 14 seasons with the Redskins and is third all-time on the team’s sack list. He was the team’s Defensive Player of the Year in 1978 and 1981, the league’s Defensive Player of the Year in 1983, and captained Washington’s Super Bowl championship teams in 1982 and 1987., 209307=Theismann holds a number of team records including most career pass attempts (3,602); most career pass completions (2,044); and most consecutive passes without an interception (162). He is the Redskins’ all-time passing leader with 25,206 total yards. He also led the Redskins to a Super Bowl (XVII) win, and a return visit to the championship in 1983., 6517=A Phi Beta Kappa running back from West Virginia Wesleyan College, he joined the Boston Braves in 1932, a year before they became the Redskins. He led the league in rushing his rookie year and, in 1933, became the first NFL player to rush for 200 yards in a game., 42848=Chuck played 10 seasons for the Redskins and made the Pro Bowl every season from 1955 through 1958. He was the Redskins MVP in 1957 and recorded 15 career interceptions and recovered 7 fumbles during his tenure with the team., 83079=A stalwart along the offensive line for over a decade, Hauss started 192 consecutive games for the Redskins between 1964 and 1977. He was named to the Pro Bowl each year between 1967 and 1972 and helped lead the team to Super Bowl VII., 122758=Owens played a significant role in leading the 1972 squad to the Super Bowl. He holds the record for most interception return yards in Redskins history (686) and is second all-time for the Redskins in career interceptions (36). On being traded in 1966 from the Dallas Cowboys to the Redskins, Owens said, “It was the best thing that ever happened to me—it allowed for a new beginning.”, 103742=Krause set the tone for his career by intercepting two passes in his first career game. He would go on to rack up 28 interceptions in four seasons with the Redskins and would end his 16-year NFL career as the league’s all-time interception leader with 81. Krause was elected to the Pro Football Hall of Fame in 1998., 354943=Signed as a free agent prior to the 1994 season, Harvey quickly displayed his pass rushing prowess by becoming the first Redskins player to lead the NFC in sacks (tied for 13.5 with Minnesota’s John Randle). Harvey finished with 89 career sacks and was named to four consecutive Pro Bowls between 1994–97., 203263=Moseley signed with the Redskins as a free agent in 1974, played 13 years for Washington, and ranks number one on the team’s all-time scoring list with 1,207 points. He made two Pro Bowl appearances while he was a Redskin and set the then NFL record for consecutive field goals during a snowy win over the Giants on the way to Super Bowl XVII., 15814=Nicknamed “Slinging Sammy,” Baugh ranks third all-time in Redskins passing yards with 21,886, is first in TD passes with 187, and first in single season quarterback rating at 109.7. He was the league’s passing, punting, interception leader in 1943 and won two world championships with the Redskins. He is a charter member of the NFL Hall of Fame., 147399=McLinton spent his entire 10-year career with the Redskins, playing in 127 games. A solid, dependable player who was both good in coverage and a sure tackler, he was a key contributor on the 1972 NFC championship team. He finished his career with 4 interceptions and one touchdown., 313311=Williams was the MVP of Super Bowl XXII. In 1987, he posted an impressive 94.0 quarterback rating. He was the first African-American quarterback to lead a team to a Super Bowl championship., 34316=Known as \"Bones,\" Taylor played his whole career with Washington. He was best known as one of Sammy Baugh’s favorite receivers with the Redskins—leading the team in receptions every year between 1949 and 1954. He scored 12 touchdowns in 1952 and appeared in the 1953 and 1955 All-Star games., 299552=A consistent force on the Redskins offensive line, McKenzie played in 144 games for Washington during his 10 years with the team. He was a key member of two Super Bowl championship teams in 1987 and 1991, and was named to the All-NFL team in 1991., 74266=A tough, standout offensive lineman who was a part of some of the team's most explosive offenses, Vince Promuto played 130 games in his career—all with Washington. He was selected to play in the 1963 and ’64 Pro Bowls. Promuto is one of the 44 members of the Redskins’ Ring of Fame at FedExField., 265471=Manley is the Redskins’ career sack leader with 97.5. He was named to the Pro Bowl in 1986, registering 18.5 sacks that year, and his pass rush helped lead the Redskins to a Super Bowl championship in the 1987–88 season. Manley’s performance during the 1982 NFC championship game, where he knocked Dallas QB Danny White out of the game, was a career highlight., 261503=An original member of the famed “Hogs” offensive line, Grimm played with the Redskins his entire career. He was a member of the 1982, 1987 and 1991 Super Bowl championship teams, and was named to the NFL’s 1980s All Decade Team as a first team choice at guard., 337428=Obtained from the Browns via a draft day trade in 1989, Byner became a key contributor to the 1991 Super Bowl championship. He appeared in the 1990 and 1991 Pro Bowls and is the Redskins’ fifth leading all-time leading rusher with 3,550 yards., 64191=At 5' 9\", James was one of the smallest players in the NFL. He was a skilled runner and playmaker and set the Redskins team mark for TDs in a game with four during a 34–24 win against Dallas in 1961. He scored 34 TDs during his 10-year NFL career., 187566=A part of the team’s most storied QB controversy along with Sonny Jurgensen, Kilmer passed for more than 20,000 yards during his 16-year NFL career and ranks fifth on the Redskins all-time list for most passing yards with 12,352. He led the Redskins to the Super Bowl in 1972 and was an All-Pro during that season as well., 291578=One of the fastest players in NFL history, Green recorded six interceptions for TDs over his career. He is the Redskins all-time interception leader with 54 and enjoyed the longest career in franchise history. A favorite of Redskins fans and popular league-wide, he was elected to the Pro Football Hall of Fame in 2008., 157696=An extremely tough and determined runner, Brown appeared in four consecutive Pro Bowls between 1969 and 1972. He was named the Most Valuable Player of the 1972–73 season and shares the Redskins’ all-time record single game record with four TDs in a game. He is the team’s second leading rusher of all-time, with 5,875 yards., 22199=Turk was an All-American tackle at Washington State and, at 6-2 and 260 pounds, was considered a “giant of his era.” Upon graduation, he received three offers from NFL teams. He chose the highest offer––the Boston Braves for $150. He was named to the All-NFL team in four of his first six seasons and was elected to the Pro Football Hall of Fame in 1969., 284098=Mann’s outstanding defensive play helped lead the Redskins to three Super Bowls, winning two. He played 11 years for the Redskins and is second all-time in sacks on the team with 82. He was elected to the Pro Bowl four times, 1988 through 1990, and in 1992., 333690=Lachey, acquired in 1988 through a trade with the Los Angeles Raiders, was a key member of the Redskins 1991 Super Bowl championship team. He was a selected to the Pro Bowl twice during his tenure with the Redskins and was named to the NFL’s “Stars of the ‘90s” team., 197227=During his 14-year NFL career, Houston was named to 12 straight Pro Bowls between 1968 and 1979. His most iconic Redskins moment was his game-saving tackle of the Cowboy’s Walt Garrison at the one-yard line on Monday Night Football in 1973. He was elected to the Pro Football hall of Fame in 1986.}",
    "textBeforeTable": "A Phi Beta Kappa running back from West Virginia Wesleyan College, he joined the Boston Braves in 1932, a year before they became the Redskins. He led the league in rushing his rookie year and, in 1933, became the first NFL player to rush for 200 yards in a game. College: West Virginia Wesleyan 1932-37 B | Cliff Battles Close this card ►  Cliff Battles  ◄ Nicknamed “Red,” Flaherty led the Redskins to the 1937 and 1942 NFL championships. He coached his team into the NFL title game in his rookie season. In his career, he compiled an 80-37-5 coaching record—capturing four Eastern division titles with the Redskins. He is known for introducing the team to the two-platoon system with one rushing and one passing unit. College: Washington State, Gonzaga 1936–42 Head Coach | Ray Flaherty",
    "textAfterTable": "1936 12 - 18 - 11.7 211 1937 11 - 14 2 15.4 216 1938 11 - 18 1 12.9 232 1939 11 - 19 4 15.5 294 1940 10 - 22 3 10.6 233 1941 11 8 20 - 13.1 262 1945 10 - 13 2 10 130 Career 76 8 124 12 89.2 1578 ►  Sammy Baugh  ◄ Close this card Sammy Baugh QB | 1937-52 College: TCU Drafted: 1st round of",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}