{
    "relation": [
        [
            "type",
            "FR Doc.",
            "RIN",
            "Docket No."
        ],
        [
            "regulations.gov",
            "2014-10684",
            "1904-AC70",
            "EERE-2012-BT-TP-0003"
        ]
    ],
    "pageTitle": "10 CFR 431.95 - Materials incorporated by reference. | US Law | LII / Legal Information Institute",
    "title": "",
    "url": "https://www.law.cornell.edu/cfr/text/10/431.95",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438044160065.87/warc/CC-MAIN-20150728004240-00337-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 922611559,
    "recordOffset": 922576246,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{151255=On April 14, 2015, the U.S. Department of Energy (DOE) published in the Federal Register a notice of proposed rulemaking (NOPR) that proposes mathematical conversion factors for converting from the current efficiency metrics ( i.e., energy factor for residential water heaters, and thermal efficiency and standby loss for commercial water heaters) to the uniform efficiency descriptor ( i.e., uniform energy factor metric). The comment period for the NOPR pertaining to the test procedures for water heaters was scheduled to end May 14, 2015. After receiving a request for additional time to comment for stakeholders, DOE is reopening the comment period for the NOPR for the Conversion Factor for Test Procedures for Consumer and Certain Commercial Water Heaters to June 15, 2015. Additionally, at the request of stakeholders, DOE is announcing a public meeting to discuss the conversion factors for consumer and commercial water heaters., 106640=The Energy Policy and Conservation Act of 1975 (EPCA), as amended, prescribes energy conservation standards for various consumer products and certain commercial and industrial equipment, including distribution transformers. EPCA also requires the U.S. Department of Energy (DOE) to determine whether more-stringent standards would be technologically feasible and economically justified, and would save a significant amount of energy. In this final rule, DOE is adopting more-stringent energy conservation standards for distribution transformers. It has determined that the amended energy conservation standards for this equipment would result in significant conservation of energy, and are technologically feasible and economically justified., 96766=On May 30, 2012, the U.S. Department of Energy (DOE) issued a notice of proposed rulemaking (NOPR) to amend the test procedures for showerheads, faucets, water closets, urinals, and prerinse spray valves. Following consideration of comments received in response to the NOPR, DOE issued a supplemental notice of proposed rulemaking (SNOPR) on April 8, 2013. The SNOPR included revisions to the definitions of showerhead and hand-held showerhead; removal of body sprays from the proposed showerhead definition; requirements pertaining to testing of showerheads that are components of shower towers; a standardized test method to be used when verifying the mechanical retention of a showerhead flow control insert when subject to 8 pounds force (lbf); clarification of permissible trim adjustments for tank-type water closets; amendments to the required static test pressures to be used when testing flushometer valve siphonic and blowout water closets; and clarifications of the definition of basic model with respect to flushometer valve water closets and urinals, as well as associated changes to certification reporting requirements for both of these products. These proposed rulemakings serve as the basis for this action., 3101=On June 3, 2014, the U.S. Department of Energy (DOE) issued a final rule adopting conservation standards for some classes of walk-in cooler and walk-in freezer components. The final rule was published with typographical errors to some of the reported values. DOE is providing corrections to address these errors. Neither the errors nor the corrections in this document affect the substance of the rulemaking or any of the conclusions reached in support of the final rule., 62356=In this final rule, DOE amends portions of its regulations governing petitions for waiver and interim waiver from DOE test procedures to restore, with minor amendments, text inadvertently omitted in the March 7, 2011 certification, compliance, and enforcement final rule. Additionally, the rule adopts a process by which other manufacturers of a product employing a specific technology or characteristic, for which DOE has granted a waiver to another manufacturer for a product employing that particular technology, would be required to petition for a waiver. The rule also sets forth a process for manufacturers to request rescission or modification of a waiver if they determine that the waiver is no longer needed, or for other appropriate reasons; adopts other minor modifications to the waiver provisions for both consumer products and industrial equipment; and clarifies certain aspects related to the submission and processing of a waiver petition., 12462=The Energy Policy and Conservation Act of 1975 (EPCA), as amended, prescribes that the U.S. Department of Justice (DOJ) make a determination on the impact, if any, on the lessening of competition likely to result from a U.S. Department of Energy (DOE) proposed rule for energy conservation standards and that DOE publish the determination in the Federal Register . DOE published its final rule for energy conservation standards for walk-in coolers and freezers on June 3, 2014, and is today publishing DOJ's determination on such proposed rule., 160637=The U.S. Department of Energy (DOE) is requesting information to inform a potential rulemaking to consider new energy conservation standards for dedicated-purpose pool pumps. Pumps, which are already covered equipment under the Energy Policy and Conservation Act of 1975, as amended (EPCA), come in a variety of forms—including dedicated-purpose pool pumps. This RFI seeks to solicit information to help DOE determine the feasibility of developing energy conservation standards and an appropriate test procedure for this equipment. This RFI outlines the potential scope that could be involved in regulating dedicated-purpose pool pumps, possible industry-based testing methods that could be used to evaluate the efficiency of this equipment, and the types of information that would be needed in analyzing the potential for setting standards for this equipment. This RFI also solicits the public for information to help inform DOE's efforts in evaluating the prospect of regulating this equipment., 111500=The U.S. Department of Energy (DOE or the “Department”) is adopting amendments to the compliance dates for manufacturers to submit certification reports for certain commercial and industrial equipment covered under the Energy Policy and Conservation Act of 1975, as amended (EPCA or the “Act”). Specifically, DOE is extending the compliance date for the certification provisions for commercial refrigeration equipment; commercial heating, ventilating, air-conditioning (HVAC) equipment; and commercial water heating (WH) equipment to December 31, 2013. DOE is extending the certification date for automatic commercial ice makers to August 1, 2013. Lastly, DOE is adopting a correction to the packaged terminal equipment standards table, which would impact standard-size packaged terminal air conditioners and packaged terminal heat pumps with a cooling capacity of 15,000 Btu/h., 52317=The Energy Policy and Conservation Act of 1975 (EPCA), as amended, prescribes energy conservation standards for various consumer products and certain commercial and industrial equipment, including commercial and industrial electric motors. EPCA also requires the U.S. Department of Energy (DOE) to determine whether more-stringent, amended standards would be technologically feasible and economically justified, and would save a significant amount of energy. In this final rule, DOE establishes energy conservation standards for a number of different groups of electric motors that DOE has not previously regulated. For those groups of electric motors currently regulated, today's rulemaking would maintain the current energy conservation standards for some electric motor types and amend the energy conservation standards for other electric motor types. DOE has determined that the new and amended energy conservation standards for this equipment would result in significant conservation of energy, and are technologically feasible and economically justified., 116528=On August 18, 2011, the U.S. Department of Energy (DOE) announced its intention to use full-fuel-cycle (FFC) measures of energy use and greenhouse gas and other emissions in the national impact analyses and environmental assessments included in future energy conservation standards rulemakings. While DOE stated in that notice that it intended to use the Greenhouse Gases, Regulated Emissions, and Energy Use in Transportation (GREET) model to conduct the analyses, the Department also said that it would review alternative methods, including the use of the National Energy Modeling System (NEMS) developed by DOE's Energy Information Administration (EIA). After evaluating both NEMS and GREET, DOE has determined that NEMS is ultimately a more appropriate tool to calculate FFC measures of energy use and greenhouse gas and other emissions. Therefore, DOE intends to use the NEMS model, rather than the GREET model, as the basis for deriving the energy and emission multipliers used to conduct FFC analyses in support of future energy conservation standards rulemakings. The public is free to send in comments on this policy amendment at any time. DOE will address comments on this policy amendment in the first notice of proposed rulemaking (NOPR) to utilize the NEMS-based approach for the FFC., 129385=On January 5, 2011, the U.S. Department of Energy (DOE) issued a supplemental notice of proposed rulemaking to amend the test procedures for electric motors and small electric motors. That supplemental proposal, along with an earlier proposal from December 22, 2008, form the basis for today's action to amend the current test procedures used to measure the energy efficiency of electric and small electric motors. These changes will be mandatory to demonstrate compliance with the current energy efficiency standards starting 180 days after publication. The final rule clarifies the scope of regulatory coverage for electric motors and ensures the accurate and consistent measurement of electric motor and small electric motor energy efficiency through changes to the current test procedures. These changes also clarify certain regulatory terms and language related to electric motors and small electric motors, clarify the scope of energy conservation standards for electric motors, update references to several industry and testing standards for electric motors, incorporate by reference and update alternative test methods that manufacturers may use when certifying polyphase and single-phase small electric motors as compliant, and specify the determination of efficiency requirements for small electric motors., 146565=Title 10 published on 2015-01-01, 203927=The U.S. Department of Energy (DOE or the Department) is giving notice that it intends to establish a negotiated rulemaking working group under the Appliance Standards and Rulemaking Federal Advisory Committee (ASRAC) in accordance with the Federal Advisory Committee Act (FACA) and the Negotiated Rulemaking Act (NRA) to negotiate regarding energy conservation standards for small, large, and very large, air-cooled commercial package air conditioners and heat pumps as well as commercial warm air furnaces. The purpose of the working group will be to discuss and, if possible, reach consensus regarding the development of energy conservation standards for small, large, and very large, air-cooled commercial package air conditioners and heat pumps as well as commercial warm air furnaces, as authorized by the Energy Policy and Conservation Act (EPCA) of 1975, as amended. The working group will consist of representatives of parties having a defined stake in the outcome of the energy conservation standards, and will consult as appropriate with a range of experts on technical issues. The working group is expected to negotiate a final term sheet regarding energy conservation standards for the aforementioned equipment by Monday, June 15, 2015. The final term sheet will be presented to ASRAC at an open meeting for their deliberation and decision on whether to pass it on as a formal recommendation to DOE., 42005=On November 4, 2013, the U.S. Department of Energy (DOE) issued a notice of proposed rulemaking (NOPR) to amend its test procedures established under the Energy Policy and Conservation Act for residential water heaters and certain commercial water heaters, which serves as the basis for today's action. This rulemaking fulfills DOE's statutory obligation for residential and certain commercial water heaters to review its test procedure for covered products and equipment at least once every seven years. In addition, this rulemaking satisfies DOE's statutory obligation to develop a uniform efficiency descriptor for residential and commercial water heaters. The test method applies the same efficiency descriptor to all residential and certain commercial water heaters, and extends coverage to eliminate certain gaps in the current residential test procedure, updates the simulated-use-test draw pattern, and updates the outlet water temperature requirement., 209514=The U.S. Department of Energy (DOE) proposes to establish a new test procedure for pumps. Specifically, DOE is proposing a test method for measuring the hydraulic power, shaft power, and electric input power of pumps, inclusive of electric motors and any continuous or non-continuous controls. The proposal, if adopted, would incorporate by reference the test procedure from the Hydraulic Institute (HI)—Standard 40.6-2014, “Methods for Rotodynamic Pump Efficiency Testing.” The proposed test procedure would be used to determine the constant load pump energy index (PEI CL ) for pumps sold without continuous or non-continuous controls or the variable load pump energy index (PEI VL ) for pumps sold with continuous or non-continuous controls. The PEI CL and PEI VL describe the power consumption of the rated pump, inclusive of an electric motor and, if applicable, any integrated continuous or non-continuous controls, normalized with respect to the performance of a minimally compliant pump for each pump basic model. The proposal reflects certain recommendations made by a stakeholder Working Group for pumps established under the Appliance Standards Rulemaking Federal Advisory Committee (ASRAC). DOE is also announcing a public meeting to discuss and receive comments on issues presented in this notice of proposed rulemaking (NOPR)., 170459=The U.S. Department of Energy (DOE) has completed a provisional analysis of the potential economic impacts and energy savings that could result from promulgating an energy conservation standard for commercial and industrial fans and blowers. This analysis incorporates information and comments received after the completion of an analysis presented in a notice of data availability (NODA) published in December 2014. At this time, DOE is not proposing an energy conservation standard for commercial and industrial fans and blowers. This analysis may be used in support of the Appliance Standards Federal Rulemaking Advisory Committee (ASRAC) commercial and industrial fans working group negotiations to develop a recommendation for regulating commercial and industrial fans. DOE encourages stakeholders to provide any additional data or information that may improve the analysis and to present comments submitted to this NODA and to the NODA published in December 2014 to the working group., 191991=As required by the Energy Policy and Conservation Act of 1975 (EPCA), as amended, the U.S. Department of Energy (DOE) proposes to establish a mathematical conversion factor for the purpose of translating efficiency ratings for water heaters under the test method currently in effect to the ratings under the amended test method promulgated by DOE in a final rule published on July 11, 2014 (hereinafter referred to as the “the July 2014 final rule”). Compliance with the amended test procedure is required beginning on the later of: one year after the publication of a final rule that establishes a mathematical conversion factor, or December 31, 2015. This rulemaking document proposes a mathematical conversion factor which may be used to convert the existing efficiency ratings under the current Federal test procedure to efficiency ratings under the test procedure adopted in the July 2014 final rule for water heater basic models manufactured, tested and certified prior to the compliance date of the amended test procedure. The amended test procedure applies to all covered consumer water heaters and the covered commercial water heating equipment with residential applications defined in the July 2014 final rule as a “residential-duty commercial water heater.” In addition, this document proposes amendments to the minimum energy conservation standards for consumer water heaters and residential-duty commercial water heaters to account for the impact of the new metric, but does not alter the stringency of the existing energy conservation standards. While DOE has not planned a public meeting to discuss this proposal, DOE is willing to consider a request to hold a meeting., 72525=The Energy Policy and Conservation Act of 1975 (EPCA), as amended, prescribes energy conservation standards for various consumer products and certain commercial and industrial equipment, including commercial refrigeration equipment (CRE). EPCA also requires the U.S. Department of Energy (DOE) to determine whether more-stringent standards would be technologically feasible and economically justified, and would save a significant amount of energy. In this final rule, DOE is adopting more-stringent energy conservation standards for some classes of commercial refrigeration equipment. It has determined that the amended energy conservation standards for these products would result in significant conservation of energy, and are technologically feasible and economically justified., 135474=In this final rule, the U.S. Department of Energy (DOE) is amending its test procedure for commercial refrigeration equipment (CRE), incorporating changes that will take effect 30 days after the final rule is published in the Federal Register . These changes will be mandatory for equipment testing to demonstrate compliance with the amended energy standards (Docket No. EERE-2010-BT-STD-0003). The amendments to the test procedure adopted in this final rule include updating references to industry test procedures to their current versions, incorporating methods to evaluate the energy impacts resulting from the use of night curtains and lighting occupancy sensors and controls, and allowing testing of certain commercial refrigeration equipment at the lowest temperature at which it is able to operate, referred to as its lowest application product temperature. In response to comments received in response to the relevant November 2010 Notice of Proposed Rulemaking (NOPR), and to minimize the testing burden on manufacturers, DOE is also incorporating provisions to allow manufacturers to test at the rating temperatures and ambient conditions required by NSF International (founded in 1944 as the National Sanitation Foundation, now referred to simply as NSF) for food safety testing., 31835=On February 11, 2014, the U.S. Department of Energy (DOE) issued a notice of proposed rulemaking (NOPR) to amend the test procedures for commercial clothes washers (CCWs). That proposed rulemaking serves as the basis for today's action. DOE is issuing a final rule making a technical correction to the certification reporting requirements for CCWs established under the Energy Policy and Conservation Act (EPCA), adopting a new test procedure to be used to determine compliance with any revised energy conservation standards for CCWs, and clarifying the dates for which the current and new test procedures must be used to determine compliance with existing energy conservation standards and any future revised energy conservation standards for CCWs., 77660=The Energy Policy and Conservation Act of 1975 (EPCA), as amended, prescribes energy conservation standards for various consumer products and certain commercial and industrial equipment, including metal halide lamp fixtures (MHLFs). EPCA also requires the U.S. Department of Energy (DOE) to determine whether more-stringent standards would be technologically feasible and economically justified, and would save a significant amount of energy. In this final rule, DOE is adopting more-stringent energy conservation standards for MHLFs. It has determined that the new and amended energy conservation standards for this equipment would result in significant conservation of energy, and are technologically feasible and economically justified., 17234=The Energy Policy and Conservation Act of 1975 (EPCA), as amended, prescribes energy conservation standards for various consumer products and certain commercial and industrial equipment, including automatic commercial icemakers (ACIM). EPCA also requires the U.S. Department of Energy (DOE) to determine whether more-stringent standards would be technologically feasible and economically justified, and would save a significant amount of energy. In this final rule, DOE is adopting more-stringent energy conservation standards for some classes of automatic commercial ice makers as well as establishing energy conservation standards for other classes of automatic commercial ice makers. It has determined that the amended energy conservation standards for these products would result in significant conservation of energy, and are technologically feasible and economically justified., 253978=On December 10, 2014, the Department of Energy (DOE) published a notice of data availability (NODA) which presented a provisional analysis that estimates the potential economic impacts and energy savings that could result from promulgating a regulatory energy conservation standard for commercial and industrial fans and blowers. DOE did not propose any energy conservation standard for commercial and industrial fans and blowers. However, DOE published its analysis and the underlying assumptions and calculations, which may ultimately support a proposed standard, for stakeholder review. In response to requests by stakeholders, the comment period for the NODA is being extended to February 25, 2015., 47192=The Energy Policy and Conservation Act of 1975 (EPCA), as amended, prescribes energy conservation standards for various consumer products and certain commercial and industrial equipment, including walk-in coolers and walk-in freezers. EPCA also requires the U.S. Department of Energy (DOE) to determine whether more-stringent standards would be technologically feasible and economically justified, and would save a significant amount of energy. In this final rule, DOE is adopting more-stringent energy conservation standards for some classes of walk-in cooler and walk-in freezer components and has determined that these standards are technologically feasible and economically justified and would result in the significant conservation of energy., 22184=The Energy Policy and Conservation Act of 1975 (EPCA), as amended, prescribes that the U.S. Department of Justice (DOJ) make a determination on the impact, if any, on the lessening of competition likely to result from a U.S. Department of Energy's (DOE) proposed rule for energy conservation standards and that DOE publish the determination in the Federal Register . DOE published its final rule for energy conservation standards for commercial clothes washers on December 15, 2014, and is publishing the determination that DOJ made on the proposed rule., 233897=On October 21, 2014, the U.S. Department of Energy (DOE) published a notice of proposed determination (NOPD) regarding energy conservation standards for high-intensity discharge (HID) lamps in the Federal Register . This notice tentatively determined that potential standards for three subcategories of HID lamps are either not technologically feasible or not economically justified. On December 22, 2014, DOE received a joint comment from the Appliance Standards Awareness Project (ASAP), Northwest Energy Efficiency Alliance (NEEA), the American Council for an Energy-Efficient Economy (ACEEE), and the Natural Resources Defense Council (NRDC) (Joint Comment), opposing DOE's proposed determination. This document announces a reopening of the public comment period for submitting comments and data in response to the Joint Comment. The comment period is extended to March 6, 2015., 175552=On April 2, 2015, the U.S. Department of Energy (DOE) published in the Federal Register a notice of proposed rulemaking (NOPR) and public meeting for Energy Conservation Program: Energy Conservation Standards for Pumps. This document corrects the terms in one of the equations., 122419=The U.S. Department of Energy (DOE) is amending its energy conservation standards for small, large, and very large water-cooled and evaporatively-cooled commercial package air conditioners, and variable refrigerant flow (VRF) water-source heat pumps less than 17,000 Btu/h. DOE is adopting new energy conservation standards for computer room air conditioners and VRF water-source heat pumps with a cooling capacity at or greater than 135,000 Btu/h and less than 760,000 Btu/h. Pursuant to the Energy Policy and Conservation Act of 1975 (EPCA), as amended, DOE must assess whether the uniform national standards for these covered equipment need to be updated each time the corresponding industry standard—the American National Standards Institute (ANSI)/American Society of Heating, Refrigerating, and Air-Conditioning Engineers (ASHRAE)/Illuminating Engineering Society of North America (IESNA) Standard 90.1 (ASHRAE Standard 90.1)—is amended, which most recently occurred on October 29, 2010. The levels DOE is adopting are the same as the efficiency levels specified in ASHRAE Standard 90.1-2010. DOE has determined that the ASHRAE Standard 90.1-2010 efficiency levels for the equipment types listed above are more stringent than existing Federal energy conservation standards and will result in economic and energy savings compared existing energy conservation standards. Furthermore, DOE has concluded that clear and convincing evidence does not exist, as would justify more-stringent standard levels than the efficiency levels in ASHRAE Standard 90.1-2010 for any of the equipment classes. DOE is also updating the current Federal test procedures or, for certain equipment, adopting new test procedures to incorporate by reference the most current versions of the relevant industry test procedures specified in ASHRAE Standard 90.1-2010. Furthermore, DOE is adopting additional test procedure provisions to include with modification certain instructions from Air-Conditioning, Heating, and Refrigeration Institute (AHRI) operations manuals in that organization's test procedures that would clarify the application of the DOE test procedures and harmonize DOE testing with the testing performed by industry., 198311=The Energy Policy and Conservation Act of 1975 (EPCA), as amended, sets forth a variety of provisions designed to improve energy efficiency. Part C of Title III, which for editorial reasons was re-designated as Part A-1 upon incorporation into the U.S. Code, establishes the “Energy Conservation Program for Certain Industrial Equipment.” The covered equipment includes pumps. In this document, DOE proposes to establish new energy conservation standards for pumps and announces a public meeting to receive comment on these proposed standards and associated analyses and results., 82153=The Department of Energy (“DOE”) today publishes this final rule to adjust DOE's civil monetary penalties (“CMPs”) for inflation as mandated by the Debt Collection Improvement Act of 1996. This rule adjusts CMPs within the jurisdiction of DOE to the maximum extent allowed by the Federal Civil Penalties Inflation Adjustment Act of 1990, as amended by the Debt Collection Improvement Act of 1996., 141315=On April 4, 2011, the U.S. Department of Energy (DOE or the Department) issued a notice of proposed rulemaking (NOPR) to amend the test procedure for automatic commercial ice makers (ACIM). That NOPR serves as the basis for today's action. This final rule amends the current test procedure for automatic commercial ice makers. The changes include updating the incorporation by reference of industry test procedures to the most current published versions, expanding coverage of the test procedure to all batch type and continuous type ice makers with capacities between 50 and 4,000 pounds of ice per 24 hours, standardizing test results based on ice hardness for continuous type ice makers, clarifying the test methods and reporting requirements for automatic ice makers designed to be connected to a remote compressor rack, and discontinuing the use of a clarified energy use equation., 7908=On May 16, 2012, the U.S. Department of Energy (DOE) published a final rule in the Federal Register that amended the energy conservation standards and test procedures for certain commercial heating, air-conditioning, and water-heating equipment. Due to a drafting error, there was a typographical error ( i.e., an incorrect symbol) for one equipment class of computer room air conditioners in a table to the applicable test procedure provision. This final rule rectifies this error., 214964=The U.S. Department of Energy (DOE) is initiating an effort to determine whether to amend the current energy conservation standards for residential clothes dryers. According to the Energy Policy and Conservation Act's 6-year review requirement, DOE must publish a notice of proposed rulemaking to propose amended standards for residential clothes dryers or a notice of determination that the existing standards do not need to be amended by August 24, 2017. This notice seeks to solicit information from the public to help DOE determine whether amended standards for residential clothes dryers would result in a significant amount of additional energy savings and whether those standards would be technologically feasible and economically justified., 179513=On April 1, 2015, the U.S. Department of Energy (DOE) published in the Federal Register a notice of proposed rulemaking and public meeting for Energy Conservation Program: Test Procedure for Pumps. This document corrects terms in four equations., 26941=The Energy Policy and Conservation Act of 1975 (EPCA), as amended, prescribes energy conservation standards for various consumer products and certain commercial and industrial equipment, including commercial clothes washers (CCWs). EPCA also requires that any new or amended energy conservation standard must be designed to achieve the maximum improvement in energy efficiency that would be technologically feasible and economically justified, and would save a significant amount of energy. In this final rule, the U.S. Department of Energy (DOE) is adopting more stringent energy conservation standards for CCWs because DOE has determined that the amended energy conservation standards for CCWs would result in significant conservation of energy, and are technologically feasible and economically justified., 259452=The Energy Policy and Conservation Act of 1975 (EPCA), as amended, prescribes energy conservation standards for various consumer products and certain commercial and industrial equipment, including several classes of commercial heating, air-conditioning, and water-heating equipment. EPCA also requires that each time the American Society of Heating, Refrigerating and Air-Conditioning Engineers (ASHRAE) Standard 90.1 is amended with respect to the standard levels or design requirements applicable to that equipment, the U.S. Department of Energy (DOE) must adopt amended uniform national standards for this equipment equivalent to those in ASHRAE Standard 90.1, unless DOE determines that there is clear and convincing evidence showing that more-stringent, amended standards would be technologically feasible and economically justified, and would save a significant additional amount of energy. ASHRAE most recently amended Standard 90.1 on October 9, 2013. Based upon its analysis of the energy savings potential of amended energy conservation standards and the lack of clear and convincing evidence to support more-stringent standards, DOE is proposing to adopt the amended standards in ASHRAE Standard 90.1 for: Small three-phase commercial air-cooled air conditioners (single package only) and heat pumps (single package and split system) less than 65,000 Btu/h; water-source heat pumps; and commercial oil-fired storage water heaters. DOE is also making a proposed determination that the standards for small three-phase commercial air-cooled air conditioners (split system) do not need to be amended. Finally, DOE is proposing updates to the current Federal test procedures to incorporate by reference the most current version of the American National Standards Institute (ANSI) Z21.47, Gas-fired central furnaces, specified in ASHRAE Standard 90.1 applicable to commercial warm-air furnaces, and to the most current version of ASHRAE 103, Method of Testing for Annual Fuel Utilization Efficiency of Residential Central Furnaces and Boilers. This document also announces a public meeting to receive comment on these proposed standards and associated analyses and results, as well as the proposed test procedure provisions., 36823=The Department of Energy (DOE) received a petition from the Air-Conditioning, Heating, and Refrigeration Institute (AHRI), requesting that DOE reconsider its June 3, 2014 final rule setting energy conservation standards for walk-in coolers and freezers. AHRI sought reconsideration of the final rule based on its view that errors purportedly committed by DOE led to the adoption of standards that were neither technologically feasible nor economically justified. DOE is denying the petition., 239057=The Energy Policy and Conservation Act of 1975 (EPCA), as amended, prescribes energy conservation standards for various consumer products and certain commercial and industrial equipment, including commercial warm air furnaces (CWAF). EPCA also requires that every six years, the U.S. Department of Energy (DOE) must consider amending its standards for specified types of commercial heating, air-conditioning, and water-heating equipment in order to determine whether more-stringent, amended standards would be technologically feasible and economically justified, and would save a significant additional amount of energy. DOE has tentatively concluded that there is sufficient record evidence to support more-stringent standards, so DOE is proposing to amend the current energy conservation standards for CWAF. DOE also announces a public meeting to receive comment on these proposed standards and associated analyses and results.}",
    "lastModified": "Fri, 29 May 2015 22:56:25 GMT",
    "textBeforeTable": "Additional Documents GPO FDSys XML | Text 80 FR 12078 - Energy Conservation Program: Energy Conservation Standards for Walk-In Coolers and Freezers; Correction 2015-03-06; vol. 80 # 44 - Friday, March 6, 2015 For a complete list of all Rules, Proposed Rules, and Notices view the Rulemaking tab. The following are only the Rules published in the Federal Register after the published date of Title 10. Title 10 published on . 77 FR 28989, May 16, 2012] [ [Reserved] (2) ISO Standard 13256-1, “Water-source heat pumps—Testing and rating for performance—Part 1: Water-to-air and brine-to-air heat pumps,” approved 1998, IBR approved for § 431.96. (1) International Organization for Standardization, 1, ch. De la Voie-Creuse, Case Postale 56, CH-1211 Geneva 20, Switzerland, 41 22 749 01 11 or go to: http://www.iso.ch/.",
    "textAfterTable": "DEPARTMENT OF ENERGY, Office of Energy Efficiency and Renewable Energy Final rule; correction. This correction is effective March 6, 2015. 10 CFR Part 431 Summary On June 3, 2014, the U.S. Department of Energy (DOE) issued a final rule adopting conservation standards for some classes of walk-in cooler and walk-in freezer components. The final rule was published with typographical errors to some of the reported values. DOE is providing corrections to address these errors. Neither the errors nor the corrections in this document affect the substance of the rulemaking or any of the conclusions reached in support of the final rule. 2015-03-05; vol. 80 # 43 - Thursday, March 5, 2015 80 FR 11857 - Energy Conservation Program for Certain Industrial Equipment: Energy Conservation Standards and Test Procedures for Commercial Heating, Air-Conditioning, and Water-Heating Equipment; Correction GPO FDSys XML | Text Additional Documents",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}