{
    "relation": [
        [
            "Location Number",
            "1",
            "2",
            "3",
            "4",
            "5"
        ],
        [
            "Location Name",
            "Happy Pig Motel",
            "Shock Fossil Cavern",
            "The Frostsprings",
            "Split Skull Bay",
            "Bloodshot Slums"
        ],
        [
            "Description",
            "This is located on the main road just north of the entrance to The Fridge",
            "You will head here during the Medical Mystery Side Mission",
            "If you head to Three Horns Valley from the entrance near the Dry Docks in Three Horns Divide, once you enter the area, head to the left to reach this location",
            "You will head here during Neither Rain, Nor Sleet, Nor Skag Side Mission",
            "You will head through this area on the way to rescue Roland for the main story"
        ]
    ],
    "pageTitle": "Borderlands 2 Trophy Guide - PS3 Trophies Forum",
    "title": "",
    "url": "http://ps3trophies.com/forums/showwiki.php?title=PS3-Trophy-Guides:Borderlands-2-Trophy-Guide",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042985140.15/warc/CC-MAIN-20150728002305-00075-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 202523827,
    "recordOffset": 202421247,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Loot can be found EVERYWHERE on Pandora. It falls from defeated enemies, is hidden in boxes, chests, lockers, safes and even toilets, can be bought from vending machines, and is given you you for completing quests. You can only carry so much loot in your backpack at one time, so always be mindful of how much space you have and what you need, then grab the best loot to sell for extra income. I recommend spending some Eridium to upgrade both your Backpack and your Bank Safe capacities at the Black Market Dealer to maximize the amount of loot you can carry and hold. The most difficult enemies will yield you the best equipment, also the more players that you are playing with will increase the chance at better loot items. Below is a breakdown of the Loot for new players to learn about the game. [hide][top]Loot That is all, and good luck! =3 This worked for me and my two friends; 4 loot loaders from 4 cardboard chests each single time. The most important thing to keep in mind is the time condition, as mentioned in Step 5 above! *** 8) Repeat Steps 3 to 7, until every player in your party has killed a Jenkins each.",
    "textAfterTable": "Orange Legendary Currently this is the top of the pyramid in terms of weaponry. These will always have increased perks you can't find in other weapons as well as fantastic bonuses. Pink Seraph Crystal After you complete the game you will gain access to Hyperius the Invincible. When you defeat him, he will drop a random number of Pink Seraph Crystals. These Crystals can be traded in at the Crystal Dealer in Oasis for weapons that are more rare than the Orange Legendary Weapons. That being said, you can only fight them once a day, unless you keep changing the clock, and the weapons don't look any more impressive than what you probably already have for Legendary Weapons. [hide][top]Elemental Weapons Elemental Weapons can be found on all weapons that you find with the exception of the White weapons. Having a good mix of elemental weapons can mean the difference between a grueling difficult battle and a nice easy battle. The key to elemental weaponry is to know what elements work best against what enemies and their enhancements. Below is a breakdown of the weapons and their specialties. Elemental Type Specialties Explosive",
    "hasKeyColumn": true,
    "keyColumnIndex": 1,
    "headerRowIndex": 0
}