{
    "relation": [
        [
            "AP Score",
            "3",
            "4",
            "5"
        ],
        [
            "Credit Hours",
            "6",
            "9",
            "12"
        ],
        [
            "Walters State Course Equivalent*",
            "SPAN 1010 & 1020",
            "SPAN 1010, 1020 & 2010",
            "SPAN 1010, 1020, 2010 & 2020"
        ]
    ],
    "pageTitle": "Prior Learning Assessment (AP) -- Exams",
    "title": "Spanish Language",
    "url": "http://www.ws.edu/admissions/prior-learning/exams/ap/default.shtm",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438044160065.87/warc/CC-MAIN-20150728004240-00247-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 834636695,
    "recordOffset": 834612303,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{129719=Walters State Community College 500 South Davy Crockett Parkway Morristown, TN 37813-6899 phone: 423.585.2600 toll free: 800.225.4770}",
    "textBeforeTable": "Advanced Placement Examinations To receive credit for prior learning, students must show satisfactory achievement on the Advanced Placement Test of the College Entrance Examination Board for Advanced Placement (AP) courses taken while in high school. Advanced Placement satisfactory scores, credit hours awarded, and the Walters State course equivalents are listed below. When credit is awarded for satisfactory scores on Advanced Placement exams, the grade will show as \"P\" on the student transcript and will not affect the student's quality point average. CollegeBoard Advanced Placement (AP) Resources Exams + Tests Advanced Placement (AP) Division of Public Safety Resources Faculty + Staff Apply Now Fee Schedule Registration + Orientation Materials List Regional Law Enforcement Academy Division of Technical Education Resources Faculty + Staff Computer Competency Division of",
    "textAfterTable": "3 4 BIOL 1010/1011 OR BIOL 1110/1111 4, 5 8 BIOL 1010/1110 & 1020/1021 OR BIOL 1110/1111 & BIOL 1120/1121 Calculus AB AP Score Credit Hours Walters State Course Equivalent* 3 3 MATH 1830 4, 5 3 MATH 1830 OR MATH 1910 Calculus BC AP Score Credit Hours Walters State Course Equivalent* 3, 4, 5 8 MATH 1910 & MATH 1920 Chemistry AP Score Credit Hours Walters State Course Equivalent* 3 4 CHEM 1110/1111 4, 5 8 CHEM 1110/111 & CHEM 1120/1121 Chinese Language & Culture AP Score Credit Hours Walters State Course Equivalent* 3 6 Foreign Language Elective Hours 4 9 5 12 Computer Science A AP Score Credit Hours Walters State Course Equivalent* 3, 4, 5 3 INFS 1010 Macroeconomics AP Score Credit Hours Walters State Course Equivalent* 3, 4, 5 3 ECON 2010 Microeconomics AP Score Credit Hours Walters State Course Equivalent*",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}