{
    "relation": [
        [
            "Date",
            "Thurs., Nov. 7",
            "Sat., Nov. 9",
            "Sat., Nov. 9",
            "Sat., Nov. 9",
            "Sat., Nov. 9"
        ],
        [
            "Time",
            "7:30 p.m.",
            "2 p.m.",
            "2 p.m.",
            "2 p.m.",
            "3:30 p.m."
        ],
        [
            "Game",
            "Prairie View A&M at Alcorn State",
            "Jackson State at Alabama A&M",
            "Southern at Alabama State",
            "Texas Southern at Mississippi Valley State",
            "Grambling State at Arkansas-Pine Bluff"
        ],
        [
            "Network (Talent)",
            "None",
            "None",
            "Hornet Vision (Jonathan Spells, Robb Taylor, Jay Holcey)",
            "None",
            "None"
        ]
    ],
    "pageTitle": "Mcall.com: Groller's Corner Blog",
    "title": "",
    "url": "http://blogs.mcall.com/groller/lafayette/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438044160065.87/warc/CC-MAIN-20150728004240-00190-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 31725167,
    "recordOffset": 31646277,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{284292=Even though John Loose has moved on from Lafayette to become the linebackers coach at Army, the widely successful Lauren's First and Goal Camp will continue at Lafayette on Sunday, June 1., 6574=C-Gavin McCarney 10 run (Andrew Burgess kick) 1:07 (Drive: 6 plays, 53 yds, 2:30), 236201=After the season-ending injury to Brandon Bialkowski at Bucknell on Oct. 26, both junior Matt McHale and freshman Nick Shafnisky have started games., 227404=The show can be seen at 8 p.m. Monday on Service Electric TV2 and is shown twice on RCN-4 at 6 p.m. Tuesday and at 5:30 on Thursday., 153054=Nov., Nov. 7, 82872=Sunday, Feb 24 -           Lehigh Menâ\u0080\u0099s Basketball @ Lafayette â\u0080\u0093 airs 11:30am, 114816=7:30 p.m., 37401=FCS Coaches Poll - Week 11 - November 12, 2012, 303130=2014 Patriot League Football Preseason All-League Team Preseason Offensive Player of the Year: Mike Nebrich, QB, Fordham (Sr.) Preseason Defensive Player of the Year: Stephen Hodge, LB, Fordham (Sr.), 232698=Thursday, Nov 21 -          NFL: New Orleans @ Atlanta â\u0080\u0093 airs 8:00pm, 50387=LAFAYETTE -- Ross 27 pass from Zach Zweizig (Gralish kick) 0:11 (Drive: 7 plays, 75 yards, 3:38), 104638=Georgetown at Lehigh, 12:30, 96322=2013 Patriot League Football Preseason Poll 1. Colgate 58 points (8 first-place votes) 2. Lehigh 56 (6) 3. Holy Cross 35 4. Lafayette 32 5. Georgetown 26 6. Bucknell 15, 296452=\"We went from 1-9 in 2012 to winning the district championship last year,\" Lonardo said. \"I am beyond thrilled about the coming season and really anxious to play football again. We have a significant number of starters coming back on both sides of the ball. The majority of our team is coming back., 135954=9:05 p.m., 245386=LA -- Justin Adams 4 pass from Reed (Gralish kick) 12:22 (Drive: 6 plays, 65 yds, 1:45), 136564=3:10 p.m., 79414=As mentioned in a previous post, one of the biggest nights in area football is always the Lehigh Valley Chapter of the National Football Foundation and College Hall of Fame Scholar-Athete Dinner that is now one month away, on March 3 at the Northampton Community Center., 75521=A 5â\u0080\u009910â\u0080\u009d 180 lb. wide receiver and kick returner, he has a 3.164 GPA with a double major in Economics and Finance.  He is a three year varsity letter winner, who had 43 punt returns for 349 yards and 15 kickoff returns for 318 yards in his career.  He was selected as the Palisades High School Scholar Athlete for the 2009 Lehigh Valley Chapter of the National Football Foundation and College Football Hall of Fame banquet., 76001=A 6â\u0080\u0099 215 lb. linebacker and defensive end, he has a 3.57 GPA majoring in Business Management.  He was named to the Centennial Conference Fall Academic Honor Roll in 2012, a season in which he had 52 tackles, 6 for a loss, 3 sacks, and 3 passes defended.  For the 2011 season he recorded 35 tackles, with 4 tackles for a loss.  His hobbies include outdoor sports, fitness, and rafting., 260946=A 5â\u0080\u009910â\u0080\u009d 210 lb. linebacker, he has a 3.43 GPA majoring in Leisure and Sport Studies.  He is a Deanâ\u0080\u0099s List member, a three time PSAC Scholar Athlete selection, a three year Student Athlete Advisory Committee Representative, and Newman Council Representative.  He is a 4 year letter winner and member of the four year class with the most wins (32) in school history. He has volunteered with the Kutztown Special Olympics for three years and will serve on the 2014 Special Olympics Management Committee.  He enjoys reading, traveling, coaching, and spending time with his family and friends.  , 283636=The 11th annual Lauren's First and Goal football camp will be held Sunday June 1 from 9AM to 3PM (registration 7:30-8:30) at the Lafayette College Metzgar Field complex in Easton, Pa. , 6830=L-Keith Sherman 1 run (Peery kick) 13:47 (Drive: 7 plays, 53 yds, 2:01), 50667=LEHIGH -- Jake Peery 23 FG 8:02 (Drive: 13 plays, 56 yards, 5:02), 83648=Here's the schedule from ESPN of the Lehigh Valley, AM-1320 and 1230:, 83445=Friday, Feb 22 -             Lehigh Wrestling @ Bucknell â\u0080\u0093 airs 6:45pm, 87511=Here's the upcoming schedule for ESPN of the Lehigh Valley radio (AM 1320 and 1230),  which will broadcast the Patriot League men's basketball game whether Lehigh or Lafayette are in it, or not:, 145636=10:30 p.m., 51136=They must sweat out the decision by the NCAA FCS playoff committee, which will be released at 1:30 today on ESPNU., 90817=We'll also talk about the impact scholarships have had on recruiting in the Patriot League and even get into the 2014 Lehigh-Lafayette football game, the 150th in college football's most-played rivalry, being held at Yankee Stadium, 158464=4:30 p.m., 77270=A 5â\u0080\u009911â\u0080\u009d 195 lb. punter, he has a 3.34 GPA majoring in Mechanical Engineering.  He is a three time Patriot League Academic Honor Roll selection and has been the teamâ\u0080\u0099s punter for the last two seasons during which he did not have a punt blocked.  He averaged over 39 yards per punt both seasons, and combined he pinned opponents inside their 20 yard line 30 times.  For the 2011 season he was named to the All Patriot League First Team and was selected Special Teams MVP.  , 50589=LAFAYETTE -- Jamel Smith 18 pass from Shoop (Gralish kick) 4:01 (Drive: 9 plays, 75 yards, 4:01), 245487=LE -- Tyler Coyle 10 pass from McHale (Randy Pandy kick) 14:07 (Drive: 3 plays, 10 yds, 1:22), 56368=Lehigh will not lose out on a true home game. The 2013 and 2015 games will be at Goodman Stadium. But Lafayette will lose out on a game at Fisher. I'm not sure how Leopards fans feel about that., 232892=This is what's coming up on ESPN radio of the Lehigh Valley (AM 1230 and 1320):, 148436=Tue., Nov. 12, 254617=2013 All-Patriot League Football Team, 90502=RCN will re-air it at  5:30 on Thursday night., 246255=It's the first time the Leopards have won an outright Patriot League title since 1994 and the first time they scored 50 points against Lehigh since 1994., 264887=A 6â\u0080\u0099 210 lb. center and defensive tackle, he ranks 34 out of 147 students.  He is an Honor Roll student and member of the National Honor Society.  He is a member of the Model United Nations.  He participates in Competitive Horseback Riding where he was a 14 â\u0080\u0093 17 Year Old Division 2013 National Champion.  He is active in the community., 150105=3:45 p.m., 232384=Saturday, Nov 23 -           Lehigh Football v. Lafayette â\u0080\u0093 airs 11:30am, 133629=12:30 p.m., 87005=Saturday, March 9 -             Lehigh Men's Basketball @ PL Semifinal - airs TBA, 292265=BETHLEHEM, Pa. â\u0080\u0093 The 150th meeting of college football's most-played rivalry is now just 150 days away and on Wednesday, Lehigh Athletics has announced it is sold out of its ticket allotment for the highly anticipated clash with rival Lafayette November 22 at Yankee Stadium in New York.   Ticket sales began last November with the excitement and anticipation surrounding this game leading to extraordinary response from season ticket holders, Asa Packer level donors, alumni, students and faculty/staff. As a result all of the nearly 28,000 tickets allocated to Lehigh from November through Monday, June 23 have been sold or allotted. There are no more tickets available for purchase through Lehigh.   \"The response to this milestone game is a real tribute to the Lehigh and Lafayette communities,\" explained Lehigh Goodman Dean of Athletics Joe Sterrett '76. \"Both institutions graduate students who are passionate about their experiences and friendships and who appreciate the tradition of this annual game as a time to come together and celebrate the value of their education and the relationships they developed.  We look forward to sharing the special character of this game, our schools and our scholar-athletes with the broader audience generated by playing the game in New York at an iconic sports site.\"   As of Wednesday morning, Lehigh has sold or allotted 27,870 tickets to the game. Initial sales in November were so strong that Lehigh opened a waiting list, which resulted in online requests for nearly 15,000 tickets â\u0080\u0093 enough to fill the permanent seating in Lehigh's Goodman Stadium.   After exhausting its initial allotment for season ticket holders, alumni, faculty and staff last November, Lehigh opened up sales to undergraduate and graduate students (including the incoming class of 2018) in the spring, with more than 4,000 students set to be in Yankee Stadium on game day.   People who completed Lehigh's survey between November 22 and June 20 were placed on a waiting list and had an opportunity to purchase the remainder of Lehigh's allotment on June 23. The final 3,000 tickets were sold or allocated in a mere 24 minutes.   The seating capacity for Yankee Stadium for football is projected to be 48,100. In addition to the ticket allocations for Lehigh and Lafayette, the Yankees organization has also allocated tickets to corporate affiliates and staff associated with the stadium and team operations.     Lafayette also does not have any tickets available for public sale.   Kickoff for the 150th Lehigh-Lafayette game is set for just after 3:30 p.m. on November 22. For fans that were unable to obtain tickets, national television coverage plans will be unveiled in the near future.   Fans are encouraged to continue to visit Lehighsports.com/Rivalry150 in the weeks leading up to the game for information on the contest plus new exclusive Lehigh content on the rivalry.   New rivalry-related content includes:  , 56581=This is Lafayette's home game and their call. Lehigh people probably don't care that they won't have to visit College Hill again until after the next presidential election in 2016, but Leopards fans might., 158811=Sat., Nov. 9, 50133=LEHIGH -- Keith Sherman 14 pass from Colvin (Peery kick) 6:48 (Drive: 11 plays, 80 yards, 3:50), 43190=The 150th football meeting between Lehigh and Lafayette will be played at Yankee Stadium on Saturday, Nov. 22, 2014., 304162=And remember, too, that if Lehigh and Lafayette have their way, the league championship will be decided in the Bronx on Nov. 22 and won't necessarily go to the team located in the Bronx, Fordham., 303959=In case you're not aware -- Lehigh and Lafayette will be playing at Yankee Stadium on Nov. 22. It's the 150th meeting in college football's most-played rivalry. , 244964=LE -- Tyler Coyle 7 pass from Nick Shafnisky (Pandy kick) 14:56 (Drive: 12 plays, 85 yds, 3:26), 129026=1:30 p.m., 303711=2014 Patriot League Football Preseason Poll 1. Fordham, 72 points (12 first-place votes) 2. Lehigh, 54 3. Lafayette, 51 (2) 4. Bucknell, 43 5. Colgate, 33 6. Holy Cross, 29 7. Georgetown, 12, 279199=Bios of the area's scholar-athletes to be honored on March 2 at the annual National Football Foundation and College Hall of Fame Lehigh Valley Chapter Dinner, which will feature Lehigh coach Andy Coen as the main speaker and will be held at the Northampton Community Center:, 159070=8:30 p.m., 108726=Other than Fordham, which is off to a 7-0 start for the first time since 1930, and Lehigh, which is 5-1 and ranked in the national FCS polls (16th and 18th) for the 39th straight week, no one has a winning record., 76683=A 5â\u0080\u00999â\u0080\u009d 195 lb. running back, he has a 3.46 GPA majoring in Accounting.  He is a Deanâ\u0080\u0099s List student,  a two time All Patriot League Academic Team selection, an FCS ADA Academic All Star, a 2011 CoSIDA Academic All District selection, a 2012 Capital One Academic All American second team selection, and has received the Lehigh Faculty Athletics Council Academic Award.  He participates in the C.O.A.C.H. and Reading Rocks programs, enjoys hunting and fishing, and has accepted a full time position with KPMG in Philadelphia beginning in the fall of 2013., 245957=He is the first Lafayette freshman to win the MVP since running back Tom Costello won the honor in 1988. , 245698=LA -- Ross Scheurman 1 run (Ryan Gralish kick) 12:33 (Drive: 3 plays, 32 yds, 1:27), 147909=Wed., Nov. 13, 136247=5:05 p.m., 153001=7:30 p.m., 230894=Tuesday, Nov 26 -            Lehigh Basketball v. Howard or South Dakota State â\u0080\u0093 airs 6 or 9 pm, 87165=Thursday, March 7 -            Lehigh Women's Basketball @ Holy Cross - airs 6:45pm, 83571=Thursday, Feb 21 -         NBA: Miami @ Chicago â\u0080\u0093 airs 7:15pm, 245291=LE -- Lee Kurfis 9 pass from McHale (Pandy kick) 1:11 (Drive: 5 plays, 32 yds, 1:53), 83290=Saturday, Feb 23 -         Lehigh Womenâ\u0080\u0099s Hoops v. Lafayette â\u0080\u0093 airs 7:15pm, 6934=L-Zach Barket 2 run (Jake Peery kick) 12:09 (Drive: 2 plays, 54 yds, 0:39), 6663=L-Tyler Coyle 4 pass from Colvin (Peery kick) 3:39 (Drive: 4 plays, 75 yds, 2:08), 232805=Wednesday, Nov 20 -     Lehigh Basketball @ Pitt â\u0080\u0093 airs 7:00pm, 58221=The field will be announced at 1:30 today and I really wouldn't be surprised by anything the committee does., 50261=LEHIGH -- Ryan Spadola 16 pass from Colvin (Peery kick) 11:41 (Drive: 9 plays, 68 yards, 3:30), 232560=Friday, Nov 22 -                 Lehigh Wrestling v. Pitt â\u0080\u0093 airs 6:45pm, 156729=3:30 p.m., 57973=Besides Lehigh's win, the other big news to come out of Saturday was the announcement that the 150th Lehigh-Lafayette game in 2014 will be held at Yankee Stadium in New York City., 144779=Thurs., Nov. 7, 236045=McHale was injured against Holy Cross on Nov. 9., 258650=A 5â\u0080\u00998â\u0080\u009d 173 lb. wide receiver and long snapper, he has a 3.76 GPA majoring in Accounting with a minor in Business Administration.  He is a four year varsity letter winner, three time Centennial Conference Academic Honor Roll selection, and was named Muhlenbergâ\u0080\u0099s 2013 Football Scholar Athlete., 231395=Monday, Nov 25 -            Lehigh Basketball v. Texas Southern â\u0080\u0093 airs 6:00pm, 244776=LA -- Demetrius Dixon 68 pass from Reed (Gralish kick) 8:29 (Drive: 1 play, 68 yards, 0:15), 90958=Paul talks about his major heart surgery in January and Frank talks about the just-completed spring practice season for the Leopards., 100661=The 222 receiving yards set a Goodman Stadium record and was the fifth-best single-game total in school history. The yardage total was the highest for a Patriot League player since 2009 and the 12th-best in league history. Kurfis was also named the Wide Receiver of the Week by College Football Performance Awards., 239709= I have two more buses set up for the November 22, 2014 Lehigh-Lafayette football game at Yankee Stadium., 159124=Fri., Nov. 8, 232237=Sunday, Nov 24 -              NFL: San Diego @ Kansas City â\u0080\u0093 airs 12:30pm, 41212=The series will return to Lehigh in 2015 with the next game to be held at Lafayette now set for 2016., 50781=LAFAYETTE -- Mark Ross 9 pass from Andrew Shoop (Ryan Gralish kick) 13:04 (Drive: 3 plays, 15 yards, 1:09), 86842=Sunday, March 10 -             NBA: Boston @ Oklahoma City - airs 12:00pm, 49926=LEHIGH -- Tyler Coyle 5 pass from Colvin (Peery kick) 4:45 (Drive: 10 plays, 56 yards, 5:35), 71566=A total of 169 Patriot League football student-athletes were named to the Academic Honor Roll, including 13 members of the Academic All-Patriot League football team. Colgate wide receiver Chris Looney was voted the leagueâ\u0080\u0099s Scholar-Athlete of the Year for football last November., 245085=LA -- Scheuerman 1 run (Blake Searfoss run) 3:28 (Drive: 11 plays,  41 yds, 6:09), 141849=12:21 p.m., 168959=Shafnisky led Lehigh to a second straight critical win by completing 11-of-21 passes for 134 yards and two touchdowns and rushing for 26 yards in the Mountain Hawksâ\u0080\u0099 31-14 victory at Colgate on Saturday. He threw both of his touchdown passes to Lee Kurfis, putting Lehigh up 14-7 in the second quarter and 24-7 in the third as the Mountain Hawks rallied from an early deficit. Shafnisky was 5-of-7 for 105 yards and a touchdown in the second half as Lehigh preserved the lead. He became the first freshman to start at quarterback for Lehigh since Phil Stambaugh in 1996, and earns a second straight Rookie of the Week award., 6751=C-Jordan McCord 1 run (Andrew Burgess kick) 5:53 (Drive: 14 plays, 75 yds, 7:53), 42451=The game at Yankee Stadium will be the first game in the series to be held at a neutral site since Nov. 25, 1891 when the teams played at West Side Park in Wilkes-Barre. Begun in 1884, Lehigh-Lafayette is not only the nation's most-played rivalry, but it has been played since 1897 without interruption, reaching 116 consecutive years with Saturday's game in Easton., 50030=LEHIGH -- Colvin 11 run (Peery kick) 1:57 (Drive: 9 plays, 89 yards, 3:10), 86388=Monday, March 11 -            Lehigh Women's Basketball @ PL Semifinal - airs 6:45pm, 157038=12:30 p.m., 245607=LA -- Mark Ross 31 pass from Drew Reed (Gralish kick) 6:39 (Drive; 12 plays, 83 yds, 5:22), 293091=The 150th meeting between the Lehigh and Lafayette football teams, set for 3:30 p.m. on Nov. 22 at Yankee Stadium, has drawn an incredible amount of interest and will attract what will easily be the biggest crowd in the history of college football's most-played rivalry., 50485=LEHIGH -- Lee Kurfis 75 pass from Colvin (Peery kick) 3:49 (Drive: 1 play, 75 yards, 0:12), 87304=Wednesday, March 6 -         Lehigh Men's Basketball v. Colgate - airs 6:30pm, 116225=Lamar at Northwestern State, 240724=Scheduled for November 22nd of 2014 at Yankee Stadium., 126926=3:30 p.m., 72547=This came out yesterday, but I wanted to salute Josh Parris (Palisades), Noah Robb (Central Catholic), Billy Boyko (Northampton) and the rest of the members of the Lehigh football program who made the Patriot League Academic Honor Roll for the 2012 season. There were 24 Mountain Hawks in all and Capital One Academic All-American Zach Barket headed the list., 6485=L-FG, Peery 43 FG 0:00 (Drive: 7 plays, 47 yds, 1:01), 287555=In addition to the football game on November 22, Lehigh University is promoting a number of shoulder events in New York City surrounding the game and is encouraging all fans who will be attending the game to take full advantage of the various events planned for the weekend beginning Thursday November 20 and running through Saturday's game.   Additionally, alumni and fans without game tickets are beginning to organize gatherings at several New York City locations for television viewing parties.   Complete information on all the weekend events surrounding the game, including the Lehigh-sponsored telecast parties in New York City can be found HERE.     , 145932=10:15 p.m., 283439=This is a non-contact camp for players entering 9th through 12th grade in the fall of 2014.  For a minimum donation of $40 ($45 after May 15) players are coached all day by college coaches who come from far and near and donate their time and travel to help make this event a success.  The event raises money for the research into the cause and potential cures for pediatric brain tumors and for cancer services which help cancer stricken families.  The all volunteer organization is named for Lauren Loose of Easton, Pa. who is a 17 year old survivor of inoperable brain tumors.   Since 2004 this organization has raised over 1.5 million dollars for the causes they support.  Walk ups on camp day are permitted.   Camp day registration is $50, cash only. To register, check out www.lfgf.org or call John or Marianne Loose at 610-250-6981 ., 244861=LE -- Keith Sherman 13 run (Pandy kick) 8:49 (Drive: 9 plays, 53 yards, 3:27), 250920=DL Alec May, Georgetown Jr.}",
    "TableContextTimeStampAfterTable": "{68271=12:53 p.m., 96010=LB: Greg Manusky, Colgate, 1986-87, Ian Eason, Lehigh 1996-99, Andy Romans, Lafayette, 2005-08 and Matt Cohen Lehigh, 2006-09., 94325=QB: Ryan Vena, Colgate, 1996-99, 88853=Tight end, Adam Bergen, 2001-04, 64692=2:59 p.m., 73554=Lots of football talk on today's \"Calling All Sports\" radio show, heard 9-11 on AM 1470, the Fox., 77211=In both polls, Montana State, Georgia Southern, Sam Houston State, Northern Iowa and North Dakota State were ranked ahead of the Mountain Hawks who will play Lafayette at 12:30 Saturday at Goodman Stadium in the 147th edition of college football's most-played rivalry., 64321=3:19 p.m., 23431=While Fordham will remain ineligible for the Patriot League title, its student-athletes will be eligible for all Patriot League awards beginning with the upcoming 2012 season. This includes All-Patriot League, Academic All-Patriot League and weekly award honors as well as the inaugural Preseason All-Patriot League Team in the summer., 50111=Starting with the class entering school in the fall of 2013, each school will be permitted to award, 68136=1:01 p.m., 67017=1:39 p.m., 23779=The Council of Presidents also acted on recommendations from the athletic directors related to football program management and roster size. The maximum team roster size for preseason camp and regular season will be set at 95 student-athletes in 2013, 92 for 2014 and 2015 and 90 beginning with the 2016 season., 92924=The list of honorees includes some pretty impressive names going back to the league's early days in the 1980s. Gordie Lockbaum and Kenny Gamble go back to 1986 and 1987 when Lehigh was still playing its games at Taylor Stadium., 22839=Most notably, Fordham, which has been ineligible for the league championship and automatic NCAA FCS playoff berth the past two seasons because it began offering scholarships --which was against league policy --  will have its eligibility reinstated beginning with the 2014 season. That will give the rest of the league two recruiting classes with scholarships to catch up with the Rams., 65677=2:37 p.m., 65035=2:49 p.m., 67851=Keith Sherman broke through the right side for a 52-yard touchdown and Lehigh has taken the lead here at Goodman Stadium 7-0 with 1:55 left in the first quarter. 6 plays, 74 yards, 2:52 on the TD drive.  That was the longest run of the Lehigh season.  , 65427=2:46 p.m., 38132=Lehigh has been supportive of scholarships for many years, and Andy Coen said the possibilities of going to scholarships was one of the reasons he came to Lehigh in 2006., 67034=Lehigh convered the good field position into three points. Tim Divers just kicked a 30-yard field goal and the Mountain Hawks now lead Lafayette 10-0 with 9:13 left in the half. That's a 6-play, 28-yard drive., 102374=In addition to his NFL experience, Pasqualoni finished his 14-year tenure at Syracuse as the programâ\u0080\u0099s second-winningest coach with 107 victories. He guided the Orange to four Big East conference titles, including a share of one in 2004 - his final year at SU., 102664=The link between UConn and Laurenâ\u0080\u0099s First and Goal has been growing over the years as former head coach Randy Edsall spoke at the 2009 camp and now sits on the honorary board. Additionally, assistant head coach Hank Hughes, a former Lafayette assistant coach in the 1980s, has volunteered at the camp every year., 30647=Colgate and Lehigh will have their matchup shown on CBS Sports Network for the second year in a row. The Mountain Hawks went to Hamilton and defeated the Raiders 45-25 on Oct. 29 of last season. Two-time defending Patriot League champion Lehigh has won 14 consecutive League contests entering the 2012 campaign, and advanced to the FCS quarterfinals while finishing with an 11-2 record last season. Colgate finished with a 5-6 record in 2011., 54199=I've been told they wanted to wait until the 2012 recruiting class was announced before they made this announcement. Lehigh made their list available just last week., 8773=It probably would have been more appropriate to run in early November, but the Lehigh-Lafayette football rivalry is the cover story in the Sept. 16-22 edition of American Profile, the Parade-like supplement that is included with several weekly newspapers., 67620=1:13 p.m., 95391=PK: Jason McLaughlin, Lafayette, 1991-94, 89425= Linebacker, Matt Cohen, 2006-09, 94417= WR: Javarus Dudley, Fordham, 2000-03, 9160=It's good publicity for \"The Rivalry\" which will have its 148th edition on Nov. 17 at Lafayette., 37130=The move to begin giving scholarships in 2013 is a good one for just about everyone who cares about the quality of football being played in the league, and it's especially good for the Lehigh Valley schools -- Lehigh and Lafayette., 97549= RB: Gordie Lockbaum, Holy Cross, 1986-87, 57200=One of the great events every June is the Lauren's First and Goal Football Clinic at Lafayette College., 60585=Towson's defensive coordinator Matt Hachmann (pictured at right) coached at Lafayette from 2000-2008, serving as Frank Tavani's linebackers coach for eight seasons., 92413=Linebacker, B.J. Gallis, 1993-96, 67268=Lehigh gets the ball at the Lafayette 40 with 10:33 to go in the half. This game has been all about the Lehigh defense to this point., 48809=football, which has been in effect since the founding of the League in 1986, comes after, 89180= Defensive lineman, Nick Martucci, 1995-98, 96718=  RB: Kenny Gamble, Colgate, 1986-87, 68489=12:50 p.m., 48256=CENTER VALLEY, Pa. (February 13, 2012), 67409=1:25 p.m., 63695=3:59 p.m., 65863=2:31 p.m., 66160=2:04 p.m., 97868= WR: Corey Hill, Colgate, 1995-98, 66824=1:46 p.m., 67251=1:31 p.m., 69161=11:30 a.m. The officiating crew here at Goodman Stadium today:, 48615=class entering school in the fall of 2013, it was announced Monday., 65986=2:09 p.m., 66581=1:51 p.m, 64262=3:31 p.m., 89867=ï»¿Defensive back, Abdul Byron 1998-01, 53975=The whole discussion on scholarships was tabled for up to two years back in December of 2010, but it has taken less than two years for the league presidents to get together and find consensus on this important issue., 94653=TE: Adam Bergen, Lehigh 2001-04, 94856= OL: Will Rackley (Lehigh, 2007-10), Paul Clasby (Colgate, 1996-99), Luke George (Colgate, 1995-98), Nick Hennessey (Colgate, 2005-08) and Mariusz Misiec (Bucknell, 1994-97), 95729=DL: Nick Martucci (Lehigh, 1995-98) Corey Vincent (Holy Cross, 1988-91), Andrew Hollingsworth (Towson, 1997-00) and Hunter Adams (Bucknell, 1995-98)., 23238=In February, the Council of Presidents approved a chance in polcy that allows merit aid (scholarships) for football student-athletes, beginning with the class entering the fall of 2013., 47888=The teleconference is about to begin, but here's the release from the Patriot League announcing that the league will begin allowing schools the opportunity to give out 15 scholarships per year beginning in 2013., 92305=Placekicker, Jason McLaughlin, 1991-94, 64058=The outcome has been decided and the stands on the Lafayette side have really cleared out, but the Leopards have added a second TD, a one-yardrun by Alan Elder. It's now 37-13 with 3:28 remaining., 83608=And right now, I feel very badly that I missed the passing of Ray Gregorek on July 23 and did not get to pay my respects to the family. Ray died at age 68 after a brief battle with cancer. I just learned about this from my former Morning Call colleague Ted Meixell at a Blue Mountain League game on Monday night., 96268=DB: Dave Murphy (Holy Cross, 1986-89), Tad Kornegay (Fordham, 2001-04), B.J. Gallis (Lafayette, 1993-96) and Abdul Byron (Lehigh, 1998-01., 102022=Pasqualoni was named UConnâ\u0080\u0099s head coach in January after spending the past six years in the NFL. He had two coaching stints over four seasons with the Dallas Cowboys, including this past season as defensive coordinator. In between his time in Dallas, Pasqualoni spent two years as the Miami Dolphins defensive coordinator., 84553=Here's a picture of the whole family at the 140th Lehigh-Lafayette game in 2004 at Fisher Stadium in Easton. Ray's wife Marilyn and daughter Allison are also in the photo (below):, 95558=All-purpose: A.J. Kizekai, Bucknell, 2006-09, 96538=Punter: Barry Cantrell, Fordham, 1994-97, 64041=3:52 p.m., 92588=Linebacker, Andy Romans, 2005-08, 64582=3:08 p.m., 50845=1986, Patriot League football was considered a separate entity and had maintained a need-limited, 68671=12:15 p.m., 67834=1:05 p.m., 89660=Linebacker, Ian Eason, 1996-99, 30154=CBS will do the Lafayette game at Bucknell at noon on Sept 22 and the Colgate game at Lehigh at 12:30 p.m. on Nov. 10., 66393=All of Lafayette's offense coming off Lehigh penalties. No matter. Lehigh defense has been spectacular. Mountain Hawks have ball at own 20 with 1:36 left in the half, leading 17-0., 64447=3:17 p.m., 88937= Offensive lineman, Will Rackley 2007-10, 66597=Lehigh has taken control. Zach Hayden grabs a 3-yard touchdown pass from Chris Lum to cap a 7-play, 56-yard drive that took 3:27. Lum and Hayden connected on back-to-back plays, covering 17 yards. Lehigh is now up 17-0., 100950= Laurenâ\u0080\u0099s First and Goal Foundation today announced that University of Connecticut football coach Paul Pasqualoni will be the featured guest speaker at its annual Laurenâ\u0080\u0099s First and Goal Football Camp on Sunday, June 5 at Lafayette College., 64709=Spadola now owns the Patriot League single-season record for receiving yards with 1,462 yards. Previous record was set by Fordham's Javarus Dudley in 2003 with 1,439 yards }",
    "textBeforeTable": "Courtesy of the National Football Foundation: Television Lehigh, Lafayette, Categories: Total People in Discussion: 0 Complete NCAA football television schedule for this weekend November 7, 2013 Digg It Add to del.icio.us | Linking Blogs | Trackbacks | Comment | Permalink | The Lehigh football team is now one win away from its goal of a championship and a playoff berth. That win won't come easily, of course, since Lafayette is Saturday's opponent at Goodman Stadium and after losing five straight in this series, you can bet the Leopards are breathing fire and desperately want the title and postseason slot for themselves. If Lehigh is going to win the game, it will need contributions across the board like it received on Saturday in a most impressive 31-14 win over Colgate in Hamilton, N.Y. And many of those contributions came from Lehigh Valley products starting with Whitehal graduate Nick Shafnisky,",
    "textAfterTable": "12 p.m. (2) Florida State at Wake Forest ABC (Mike Patrick, Ed Cunningham, Jeannine Edwards) Sat., Nov. 9 12:30 p.m. Virginia  at North Carolina ACC Network (Tim Brant, Dave Archer, Rachel Baribeau) Sat., Nov. 9 3:30 p.m. Syracuse at Maryland RSN (Wes Durham, Brian Stann, Jenn Hildreth) Sat., Nov. 9 4 p.m. N.C. State at Duke ESPNU (Anish Shroff, Kelly Stouffer) Sat., Nov. 9 7 p.m. Virginia Tech at (11) Miami (Fla.) ESPN (Brad Nessler, Todd Blackledge, Holly Rowe) Sat., Nov. 9 8 p.m. (23) Notre Dame at Pittsburgh ABC (Brent Musberger3, Kirk Herbstreit3, Heather Cox) Big Ten Date Time Game Network (Talent) Sat., Nov. 9 12 p.m. Penn State at Minnesota ESPN2 (Beth Mowins, Joey Galloway2, Paul Carcaterra) Sat., Nov. 9",
    "hasKeyColumn": true,
    "keyColumnIndex": 2,
    "headerRowIndex": 0
}