{
    "relation": [
        [
            "Categories",
            "What to do for fun",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "Never something not to do, you will always be active.",
            "Be prepared to work hard.",
            "Very prestigious business program."
        ]
    ],
    "pageTitle": "John Carroll University Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/John-Carroll-University/reviews?_escaped_fragment_=/show/120484",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042985140.15/warc/CC-MAIN-20150728002305-00049-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 876652891,
    "recordOffset": 876619124,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{94199=The dorms are small and kind of old but workable. The community bathrooms aren't the most appealing for people with high standards. A brand new residence hall will be opening in the 2014 school year., 111585=© 2015, Cappex.com, LLC}",
    "textBeforeTable": "03/19/2012 Reviewer is A current student here. 2 out of 2 people found this review useful. 1 of 25 Molly from Toledo, OH Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5",
    "textAfterTable": "What to do for fun There is always something happening on campus. The Student Union plans events every weekend that all students can participate in. In the hot months, a bus will take students to a football or baseball game in the city and spend the night downtown. Other off campus events are seeing plays and musicals, going to the surrounding malls, shopping and dinner or a movie. Recently, a group of my friends and I went to a train station to celebrate St. Patrick's Day with a murder mystery put on by our school's theater group. If one does not want to go off campus, having a movie night in the dorm with friends and tons of popcorn is just as fun! Food and Dining Nothing will be better then mom's home cooked meals, but the food at JCU is great compared to other caferitia food! At JCU, there are five different stations that change everyday with food from different cultures. One day there will be tacos and pizza, and the next, momma's home-made mashed potatoes and roasted beef and steamed vegetables. There is food for everyone! And some days one must get creative; take some chicken from the grill and go over to the deli to make a wrap is the perfect lunch. O and one cannot forget dessert! Everyday there is an ice cream machine and fresh",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}