{
    "relation": [
        [
            "",
            "1",
            "2",
            "3",
            "4",
            "5",
            "6",
            "7",
            "8",
            "9"
        ],
        [
            "RxCUI",
            "197443",
            "197443",
            "197443",
            "197444",
            "197444",
            "197444",
            "197445",
            "197445",
            "197445"
        ],
        [
            "RxNorm NAME",
            "carbidopa 10 MG / levodopa 100 MG Oral Tablet",
            "Carbidopa 10 MG / Levodopa 100 MG Oral Tablet",
            "Carbidopa 10 MG / L-DOPA 100 MG Oral Tablet",
            "carbidopa 25 MG / levodopa 100 MG Oral Tablet",
            "Carbidopa 25 MG / Levodopa 100 MG Oral Tablet",
            "Carbidopa 25 MG / L-DOPA 100 MG Oral Tablet",
            "carbidopa 25 MG / levodopa 250 MG Oral Tablet",
            "Carbidopa 25 MG / Levodopa 250 MG Oral Tablet",
            "Carbidopa 25 MG / L-DOPA 250 MG Oral Tablet"
        ],
        [
            "RxTTY",
            "PSN",
            "SCD",
            "SY",
            "PSN",
            "SCD",
            "SY",
            "PSN",
            "SCD",
            "SY"
        ]
    ],
    "pageTitle": "DailyMed - CARBIDOPA AND LEVODOPA- carbidopa and levodopa tablet",
    "title": "",
    "url": "http://dailymed.nlm.nih.gov/dailymed/drugInfo.cfm?setid=a355d5f2-407d-40fa-a374-b3632261ea4a",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438044160065.87/warc/CC-MAIN-20150728004240-00091-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 60002487,
    "recordOffset": 59973651,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{7981=The optimum daily dosage of carbidopa and levodopa must be determined by careful titration in each patient. Carbidopa and levodopa tablets are available in a 1:4 ratio of carbidopa to levodopa (25 mg/100 mg) as well as 1:10 ratio (25 mg/250 mg and 10 mg/100 mg). Tablets of the two ratios may be given separately or combined as needed to provide the optimum dosage., 6587=How To Transfer Patients From Levodopa: Levodopa must be discontinued at least twelve hours before starting this combination product. A daily dosage of carbidopa and levodopa should be chosen that will provide approximately 25% of the previous levodopa dosage. Patients who are taking less than 1500 mg of levodopa a day should be started on one tablet of carbidopa and levodopa 25 mg/100 mg three or four times a day. The suggested starting dosage for most patients taking more than 1500 mg of levodopa is one tablet of carbidopa and levodopa 25 mg/250 mg three or four times a day., 2249=25 mg/250 mg — Each light blue, mottled, round tablet imprinted with on one side and 540 and bisect on the other contains 25 mg of Carbidopa and 250 mg of Levodopa and is supplied in bottles of 100 (NDC 0228-2540-10), 500 (NDC 0228-2540-50) and 1000 (NDC 0228-2540-96)., 51938=0228-2540-10, 2714=25 mg/100 mg — Each yellow, mottled, round tablet imprinted with on one side and 539 and bisect on the other contains 25 mg of Carbidopa and 100 mg of Levodopa and is supplied in bottles of 100 (NDC 0228-2539-10), 500 (NDC 0228-2539-50) and 1000 (NDC 0228-2539-96)., 3157=10 mg/100 mg — Each dark blue, mottled, round tablet imprinted with on one side and 538 and bisect on the other contains 10 mg of Carbidopa and 100 mg of Levodopa and is supplied in bottles of 100 (NDC 0228-2538-10) and 500 (NDC 0228-2538-50)., 44534=Revised — September 2011, 51105=0228-2539-50, 8932=Based on studies in which high doses of levodopa and/or carbidopa were administered, a significant proportion of rats and mice given single oral doses of levodopa of approximately 1500-2000 mg/kg are expected to die. A significant proportion of infant rats of both sexes are expected to die at a dose of 800 mg/kg. A significant proportion of rats are expected to die after treatment with similar doses of carbidopa. The addition of carbidopa in a 1:10 ratio with levodopa increases the dose at which a significant proportion of mice are expected to die to 3360 mg/kg.}",
    "textBeforeTable": "Number of versions: 2 CARBIDOPA AND LEVODOPA- carbidopa and levodopa tablet View Label Archives for this drug View Label Archives, RxNorm, Get Label RSS Feed More Info on this Drug Medline Plus, Clinical Trials, PubMed, Biochemical Data Summary Related Resources Report Adverse Events, FDA Safety Recalls, Presence in Breast Milk Safety (also available in the left menu) Find additional resources Close All Sections View All Sections Close PACK(0228-2538, 0228-2539, 0228-2540) 017665256 Actavis Inc. Business Operations ID/FEI Address Name Establishment ANALYSIS(0228-2538, 0228-2539, 0228-2540) , MANUFACTURE(0228-2538, 0228-2539, 0228-2540) , PACK(0228-2538, 0228-2539, 0228-2540) 623114928 Actavis Elizabeth LLC Business Operations ID/FEI Address Name Establishment Labeler - Actavis Elizabeth",
    "textAfterTable": "5 197444 Carbidopa 25 MG / Levodopa 100 MG Oral Tablet SCD 6 197444 Carbidopa 25 MG / L-DOPA 100 MG Oral Tablet SY 7 197445 carbidopa 25 MG / levodopa 250 MG Oral Tablet PSN 8 197445 Carbidopa 25 MG / Levodopa 250 MG Oral Tablet SCD 9 197445 Carbidopa 25 MG / L-DOPA 250 MG Oral Tablet SY Get Label RSS Feed for this Drug CARBIDOPA AND LEVODOPA- carbidopa and levodopa tablet To receive this label RSS feed Copy the URL below and paste it into your RSS Reader application. https://dailymed.nlm.nih.gov/dailymed/labelrss.cfm?setid=a355d5f2-407d-40fa-a374-b3632261ea4a To receive all DailyMed Updates for the last seven days Copy the URL below and paste it into your RSS Reader application. https://dailymed.nlm.nih.gov/dailymed/rss.cfm What will I get with the DailyMed RSS feed? DailyMed will deliver notification of updates and additions to Drug Label information currently shown on this site through its RSS feed. DailyMed will deliver this notification to your desktop, Web browser, or e-mail depending on the RSS Reader you select to use. To view updated drug label links, paste the RSS feed address (URL) shown below into a RSS reader, or use a browser which supports RSS feeds, such as Safari for Mac OS X. How to discontinue the",
    "hasKeyColumn": true,
    "keyColumnIndex": 2,
    "headerRowIndex": 0
}