{
    "relation": [
        [
            "Release",
            "12.4(11)XJ",
            "12.4(15)T"
        ],
        [
            "Modification",
            "This command was introduced.",
            "This command was integrated into Cisco IOS Release 12.4(15)T."
        ]
    ],
    "pageTitle": "Cisco Unified Communications Manager Express Command Reference - Cisco Unified CME Commands: D [Cisco Unified Communications Manager Express] - Cisco",
    "title": "",
    "url": "http://www.cisco.com/c/en/us/td/docs/voice_ip_comm/cucme/command/reference/cme_cr/cme_d1ht.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042985140.15/warc/CC-MAIN-20150728002305-00207-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 371356687,
    "recordOffset": 371272826,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{54412=When the called extension, 1514, goes back on-hook, the following debug output is displayed:, 118614=This command was introduced on the following platforms: Cisco 2600 series and Cisco 3600 series multiservice routers, and Cisco IAD2420 series Integrated Access Devices (IADs)., 49070=Indicates that there is no codec conflict between the two calls on either side of the loopback-dn., 207835=The following example shows how to set the date format so that a date such as December 3, 2007 is represented as 2007-12-03. By using the default configuration, this same date appears as 12/03/07., 145599=This command was implemented on the Cisco 2600-XM and Cisco 2691 routers., 145279=This command was implemented on the Cisco 1760 routers., 213112=The following example sets the date format to day, month, and year, so that December 17, 2004 is represented as 17-12-04., 56976=When extension 1514 answers the call, the following debug output is displayed:, 167937=Start TLS Handshake 1 10.5.43.174 4374, 59651=A loopback call is started. An incoming call to 1911514 (ephone-dn 43) uses the loopback pair of ephone-dns to become an outgoing call to extension 1514. The number in the outgoing call has only four digits because the loopback-dn command specifies forwarding of four digits. The outgoing call uses ephone-dn 42, which is also specified in the loopback-dn command under ephone-dn 43. When the extension at 1514 rings, the following debug output is displayed:, 13095=This command was introduced for Cisco IOS Telephony Services (now known as Cisco CallManager Express) Version 2.0 and Cisco Survivable Remote Site Telephony (SRST) Version 2.0 on the Cisco 1750, Cisco 1751, Cisco 2600 series, Cisco 3600 series, and Cisco IAD2420 series., 140587=Provides voice packet level debugging and prints the contents of one voice packet in every 1024 voice packets., 118191=This command was implemented on the Cisco 1750 and Cisco 1751 multiservice routers., 29403=Provides voice packet level debugging and displays the contents of one voice packet in every 1024 voice packets., 49178=codec match, 146362=This command was introduced on the following platforms: Cisco 1750, Cisco 1751, Cisco 2600 series and Cisco 3600 series multiservice routers; and Cisco IAD2420 series Integrated Access Devices (IADs)., 167802=Indicates the beginning of the TLS handshake between the secure Cisco Unified SRST router and Cisco Unified CallManager. In this example, 1 indicates the socket, 10.5.43.174 is the IP address, and 4374 is the port of Cisco Unified CallManager., 62377=This command was implemented on the Cisco 2600-XM and Cisco 2691., 63187=This command was introduced for Cisco IOS Telephony Services (now known as Cisco CallManager Express) Version 2.0 on the Cisco 1750, Cisco 1751, Cisco 2600 series, Cisco 3600 series, and Cisco IAD2420 series.}",
    "TableContextTimeStampAfterTable": "{17874=The debug ephone pak command provides voice packet level debugging and prints the contents of one voice packet in every 1024 voice packets., 86953=This command was implemented on Cisco 1760 routers., 180456=A dynamic VoIP dial peer has been created for entry 91021. The dial peer can be verified using the show voice register dial-peers and show sip-ua status registrar commands., 306446=Ephone-dn numbers for the Cisco IP phones must match the number in the extension-length argument; otherwise, the extension number cannot be expanded. For example, the following command maps all 3-digit extension numbers to the telephone number 40855501xx, so that extension 111 is expanded but the 4-digit extension 1011 is not., 305073=When you define a dial-plan pattern that 1001 will match, such as 40855510.., a second dial peer is created so that calls to both the 1001 and 4085551001 numbers will be completed. In our example, the additional dial peer that is automatically created looks like the following:, 340903=If the extension number (1001) also matches a dial-plan pattern that is configured using the dialplan-pattern command, such as 40855510.., a second dial peer is dynamically created so that calls to both the 1001 and 4085551001 numbers can be completed. Based on the dial-plan pattern to be matched, the following additional POTS dial peer is created:, 319859=This command was introduced on the Cisco 2600 series and Cisco 3600 series multiservice routers and on the Cisco IAD2420 series., 407848=Abbreviated month. The following abbreviations are valid: jan, feb, mar, apr, may, jun, jul, aug, sep, oct, nov, dec., 410992=Default start time is first week of April, Sunday, 2:00 a.m and default stop time is last week of October, Sunday 2:00 a.m., 260820=SCCP signaling between a device and Cisco Unified CME through the secure TLS connection on TCP port 2443, and the media uses Secure Real-Time Transport Protocol (SRTP)., 260187=SCCP signaling between a device and Cisco Unified CME through the secure TLS connection on TCP port 2443., 304657=The dialplan-pattern command builds additional dial peers for the expanded numbers it creates. For example, when the ephone-dn with the number 1001 was defined, the following POTS dial peer was automatically created for it:, 342273=The value of the extension-length argument must be equal to the length of extension number to be matched, otherwise, the extension number cannot be expanded. For example, the following command maps all 3-digit extension numbers to the telephone number 40855501.., so that extension 111 is expanded but 4-digit extension number 1111 is not., 323512=and a dial-plan pattern is created, such as 40855510.., then an additional dial peer will be created that allows calls to both the 1001 and 4085551001 numbers. For example:, 321704=This command was integrated into Cisco IOS Release 12.2(11)T and implemented on the Cisco 1760 routers., 340608=For example, the following POTS dial peer is automatically created for extension number 1001 when the associated SIP phone registers in Cisco Unified CME:, 12924=To provide voice packet level debugging and to print the contents of one voice packet in every 1024 voice packets, use the debug ephone pak command in privileged EXEC mode. To disable debugging output, use the no form of this command., 179637=The phone number 91011 registered successfully, and type 1 is reported in the debug, which means that there is a preexisting VoIP dial peer., 410446=Beginning and ending time for daylight saving time, in HH:MM format using a 24-hour clock. The stop time must be greater than the start time. The value 24:00 is not valid. If you enter 00:00for both start time and stop time, daylight saving time is enabled for the entire 24-hour period on the specified date.}",
    "textBeforeTable": "Syntax Description date-format no { dd-mm-yy | mm-dd-yy | yy-dd-mm | yy-mm-dd } date-format To set the date display format on the Cisco IP phones in a Cisco CallManager Express (Cisco CME) system, use the dateformat command in telephony-service configuration mode. To display the date in the default format, use the no form of this command. date-format (telephony-service) dtmf-relay (voice register pool) dst auto-adjust (voice register global) dst (voice register global) dn-webedit dnd-control (voice register template) dnd feature-ring dnd (voice register pool) display-logout directory entry directory direct-inward-dial isdn digit collect kpml dialplan-pattern (voice register) dialplan-pattern (call-manager-fallback) dialplan-pattern dialplan dial-peer no-match isdn disconnect-cause device-type device-security-mode device-name device-id (ephone-type) description (voice register pool-type)description (voice register pool-type) description (voice register pool) description (voice moh-group) description (voice hunt-group) description (ephone-hunt) description (ephone-dn and ephone-dn-template) description (ephone) default (voice hunt-group) debug voice register events debug voice register errors debug shared-line",
    "textAfterTable": "Default is mm-dd-yy. Command Modes Telephony-service configuration (config-telephony) Command History Cisco IOS Release Cisco Product Modification 12.2(2)XT Cisco ITS 2.0 This command was introduced 12.2(8)T Cisco ITS 2.0 This command was integrated into Cisco IOS Release 12.2(8)T. Examples The following example sets the date format to day, month, and year, so that December 17, 2004 is represented as 17-12-04.  Router(config)# telephony-service Router(config-telephony)# date-format dd-mm-yy date-format (voice register global) To set the date display format on SIP phones directly connected in Cisco Unified CME, use the dateformat command in voice register global configuration mode. To display the date in the default format, use the no form of this command.",
    "hasKeyColumn": true,
    "keyColumnIndex": 1,
    "headerRowIndex": 0
}