{
    "relation": [
        [
            "Play Type",
            "Single",
            "Substitution",
            "Out",
            "Single",
            "Error-wild-pitch",
            "Walk",
            "Out",
            "Out"
        ],
        [
            "Play",
            "Gerardo Parra singled to left. Runner on first with none out and Sam Demel due up.",
            "Barry Enright is pinch-hitting for Sam Demel.",
            "Pinch-Hitter Barry Enright struck out on a foul bunt. Runner on first with one out and Willie Bloomquist due up.",
            "Willie Bloomquist singled to right. Runners on first and third with one out and Kelly Johnson due up.",
            "Matt Lindstrom wild pitch scored Gerardo Parra with one out. Willie Bloomquist advanced to second. Runner on second and Kelly Johnson at the plate.",
            "Kelly Johnson intentionally walked. Runners on first and second with one out and Justin Upton due up.",
            "Justin Upton struck out swinging. Runners on first and second with two outs and Chris Young due up.",
            "Chris Young struck out swinging to end the inning."
        ]
    ],
    "pageTitle": "Friday, April 1, 2011 Arizona Diamondbacks - Colorado Rockies Box Scores, Game Results & Summary - USATODAY.com",
    "title": "",
    "url": "http://content.usatoday.com/sportsdata/baseball/mlb/game/diamondbacks_rockies/2011/04/01",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042985140.15/warc/CC-MAIN-20150728002305-00200-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 52118633,
    "recordOffset": 52102239,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{2362=View all MLB box scores for 4/1/2011}",
    "TableContextTimeStampAfterTable": "{48068=Jose Lopez went 2-for-5 with a homer and two RBI for the Rockies, who finished 83-79 last season. It was largely a disappointing result for a Colorado club that went 92-70 and made the playoffs in 2009., 47121=Arizona is coming off a season in which it went 65-97 and finished in last place in the NL West. But the Diamondbacks got 2011 off to a good start Friday with the late rally and a superb effort against Colorado ace Ubaldo Jimenez, who went 19-8 with a 2.88 ERA in 2010 and finished third in the NL Cy Young voting.}",
    "textBeforeTable": "Top of the 1st Bill Welke  3B Marty Foster  2B Jeff Nelson  1B Tim Tschida  H Umpires 0.00 11 18 3 1 0 0 1 1 Matt Lindstrom  27.00 4 7 1 0 1 1 1 0.1 Matt Reynolds (L, 0-1) 0.00 7 9 0 0 0 0 2 0.2 Matt Belisle  0.00 12 18 1 1 0 0 1 1 Huston Street  0.00 7 10 1 0 0 0 1 1 Rafael Betancourt  0.00 7 11 0 0 0 0 2 1 Felipe Paulino  7.50 63 98 1 1 5 6 7 6 Ubaldo Jimenez  ERA Strikes Pitches SO BB ER R H IP Name 0.00 \" xmlns:fo=\"http://www.w3.org/1999/XSL/Format\" />Rockies pitching http://i.usatoday.net/_common/_images/_sports/logos/mlb/rockies_22t.png 9 13 2 0 0 0 0 1 J.J. Putz (S, 1) 0.00 7 11 0 0 0 0 1 1 Sam Demel (W, 1-0) 0.00 11 18 0 1 0 0 1 1 David Hernandez  0.00 15 27 3 0 0 0 2 1 Aaron Heilman  0.00 18 27 3 0 0 2 3 1 Juan Gutierrez (BS, 1) 4.50 63 108 3 3 3 4 6 6 Ian Kennedy ",
    "textAfterTable": "Double Seth Smith doubled to right scoring Dexter Fowler with none out. Runner on second and Carlos Gonzalez due up. Out Carlos Gonzalez grounded out second to first. Runner on third with one out and Troy Tulowitzki due up. Walk Troy Tulowitzki walked. Runners on first and third with one out and Todd Helton due up. Out Todd Helton sacrifice fly to left scored Seth Smith with two out. Runner on first and Ty Wigginton due up. Out Ty Wigginton grounded into a fielder's choice, third to second to end the inning. Troy Tulowitzki out at second. Top of the 2nd Play Type Play Out Juan Miranda flied out to center. None on with one out and Melvin Mora due up. Out Melvin Mora grounded out short to first. None on with two outs and Miguel Montero due up. Double Miguel Montero doubled to right. Runner on second with two outs and Gerardo Parra due up. Double Gerardo Parra doubled to center scoring Miguel Montero with two out. Runner on second and Ian Kennedy due up. Out Ian Kennedy grounded out first to pitcher to end the inning. Bottom of the 2nd",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}