{
    "relation": [
        [
            "Sock size",
            "Small",
            "Medium",
            "Large",
            "X-Large"
        ],
        [
            "Men's US Shoe size",
            "3.5-5.5",
            "6.0-8.0",
            "8.5-10.5",
            "11.0-13.0"
        ],
        [
            "Women's US Shoe Size",
            "5.0-7.0",
            "7.5-9.5",
            "10.0-12.0",
            ""
        ]
    ],
    "pageTitle": "Drymax Hot Weather Running Socks, Mini-crew",
    "title": "",
    "url": "http://www.zombierunner.com/store/brands/drymax/product1644.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042985140.15/warc/CC-MAIN-20150728002305-00184-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 848003695,
    "recordOffset": 847986075,
    "tableOrientation": "VERTICAL",
    "textBeforeTable": "To keep feet cooler while running in hot weather many people like to run in the thinnest sock possible. Thin socks unfortunately provide little protection from hot spots and blisters. Running in hot weather feet quickly get hot and perspire, causing socks to become wet. Moisture significantly increases friction (stickiness) between socks and skin. The higher the friction, the hotter the feet and the greater the chance of getting blisters. Higher friction limits skin surface movement, but still allows inner tissue movement. This shearing effect physically separates the two layers which fill with fluid forming a blister. Sizing Click to watch a Drymax sock demonstration We cannot ship Drymax products internationally. -->",
    "textAfterTable": "3D Advanced Fit Drymax's five sock sizes fit because they were developed on special 3D shaped foot models. Each size sock includes a (S, M, L, XL) color size mark for easy match-up after laundering. Cooler Feet Drymax Hot Weather Running socks keep feet dry and prevent hot spots and blisters because they are made using the patented Blister Guard® system. This system incorporates Friction Free® Profilen® fibers throughout the entire foot area of the sock. Profilen's chemical name is Polytetrafluoroethylene (PTFE). PTFE has the lowest Coefficient of Friction of any solid material. This scientific approach keeps feet dry and the friction between the skin and sock low. Runners wearing our Hot Weather Running socks will have cooler, drier, more comfortable feet with far less chance of getting blisters. Hot Weather Running socks also have top mesh panels and bottom air vents designed to keep feet drier & cooler by working with the built-in vent systems in the new generation of breathable running shoes made by Adidas (Clima Cool), Asics, Diadora (Power Flow), Fila, Mizuno (Intercool), New Balance (N-Vent), Nike, and Reebok. Socks are not the only cause of blisters; therefore no sock can prevent all blisters. Active Odor Control The MicroZap® antimicrobial in the Drymax® Fibers is a silver - zirconium phosphate ceramic ion-exchange resin. It fights odor-causing bacteria, helping",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}