{
    "relation": [
        [
            "Patent application number",
            "20100329369",
            "20120127870",
            "20120127923",
            "20120263164",
            "20130266097",
            "20140036698",
            "20140053049",
            "20140112267",
            "20140133319"
        ],
        [
            "Description",
            "METHOD AND APPARATUS FOR FACILITATING MULTI-USER JOINT TRANSMIT-RECEIVE BEAMFORMING - A method of wireless communication is disclosed that includes receiving detected channel information from a plurality of access terminals; selecting a set of access terminals from the plurality of access terminals based on the received channel information; creating a beamforming vector for each access terminal in the set of selected access terminals; and transmitting a signal using at least one of the created beamforming vectors. An apparatus for performing the method is also disclosed herein.",
            "Method and Apparatus for Enabling an Enhanced Frequency Domain Equalizer - A method and apparatus for enabling an enhanced FDE in a TD-SCDMA system is provided. The method may comprise receiving one or more signals from one or more cells over one or more channels where each channel is described using a channel vector and a spreading vector, and where each signal includes one or more data blocks each including a number of symbols, converting the one or more received signals from a time domain into a frequency domain using a block FFT, inverting a covariance matrix, wherein the covariance matrix is derived from a linear convolution of the one or more channel vectors and the one or more spreading vectors, and determining one or more MMSE signals by manipulating the frequency domain one or more received signals by applying the inverted equivalent channel matrix.",
            "Method and Apparatus for Enabling a Low Complexity Receiver - A method and apparatus for enabling a low complexity DL receiver in a TD-SCDMA system is provided. The method may comprise receiving two or more signals from two or more cells, determining at least one of the two or more cells does not comprise colored noise, applying a white noise matrix approximation to each of the at least one of the two or more cells that does not comprise colored noise, applying a channel matrix approximation to the two or more received signals, and generating a MMSE coordination matrix using the white noise matrix approximation and the channel matrix approximation.",
            "METHODS AND APPARATUS FOR ADJUSTING FORWARD LINK SIGNAL TO INTERFERENCE AND NOISE RATIO ESTIMATES - Methods and systems for adjusting a forward link (FL) signal to interference and noise ratio (SINR) are provided. In an example, a FL SINR is estimated for each user in a plurality of users, on at least one of each user's respective data rate control (DRC) message or each user's respective prior FL SINR value. The respective estimated FL SINR for a user in the plurality of users is increased, if, based on a reverse link acknowledge message, the user has decoded a packet before all symbols in the packet have been transmitted. Remaining control channel power is determined. The estimated FL SINR for all users in the plurality of users is increased if remaining control channel power is less than a low threshold. The estimated FL SINR for all users in the plurality of users is increased if the remaining control channel power is greater than a high threshold.",
            "Early Termination Schemes for Turbo Decoding in a Wireless Communication System - Certain embodiments provide methods that may allow for improvements in performance and power consumption by terminating the turbo decoding process early when one of at least two test criterion is satisfied in communications systems, including UMTS, WCDMA, and TD-DCMA.",
            "ITERATIVE COVARIANCE INVERSION BASED ON LINEAR RECEIVER DESIGNS - A method of wireless communication includes receiving a wireless signal at a linear receiver, and iteratively computing an inverted covariance matrix in frequency domain, one channel code at a time. The method also includes computing receiver demodulation coefficients based on the inverted covariance matrix and the frequency domain channel estimate or time domain channel estimate. The method further includes deriving a transmitter symbol based on a received signal vector and the coefficients.",
            "METHODS AND APPARATUSES FOR SAVING POWER DURING TRANSPORT BLOCK DECODING IN UMTS SYSTEMS - The present disclosure describes methods and apparatuses for improved transport block decoding in devices capable of wireless communication, which may include user equipment and network entities. For example, the present disclosure presents methods and apparatuses for decoding a code block from a plurality of code blocks corresponding to a transport block, obtaining a reliability indicator that identifies a reliability of the decoding of the code block, comparing the reliability indicator to a reliability threshold, and determining whether to decode a subsequent code block from the plurality of code blocks based on the comparing. Furthermore, these methods and apparatuses may include determining not to decode at least one subsequent code block of the transport block where the comparing indicates that the reliability indicator is less than the reliability threshold. As such, device power is not unnecessarily consumed by decoding likely superfluous code blocks.",
            "RECEIVE DIVERSITY CONTROL IN TD-SCDMA - In a TD-SCDMA user equipment (UE) with multiple receive chains, receive diversity may be implemented where multiple receive chains may simultaneously activate to receive downlink signals. Receive diversity may be enabled when single chain reception provides undesired results and when receive diversity will not impact power consumption too much. A state machine controls receive diversity operation based on operating conditions such as control channel activity, successful control channel decoding, signal-to-interference ratio, and other factors.",
            "RECEIVE DIVERSITY CONTROL IN TD-SCDMA - In a TD-SCDMA user equipment (UE) with multiple receive chains, receive diversity may be implemented where multiple receive chains may simultaneously activate to perform reception on downlink signals. Receive diversity may be enabled when single chain reception provides undesired results and when receive diversity will not impact power consumption too much. A state machine may be implemented to control receive diversity operation based on operating conditions such as an error rate, signal-to-interference ratio, and other factors."
        ],
        [
            "Published",
            "12-30-2010",
            "05-24-2012",
            "05-24-2012",
            "10-18-2012",
            "10-10-2013",
            "02-06-2014",
            "02-20-2014",
            "04-24-2014",
            "05-15-2014"
        ]
    ],
    "pageTitle": "Chen, San Diego - Patent applications",
    "title": "",
    "url": "http://www.faqs.org/patents/inventor/chen-san-diego-4/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438044160065.87/warc/CC-MAIN-20150728004240-00156-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 433982951,
    "recordOffset": 433940023,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Jinghu Chen, San Diego, CA US 01-05-2012 Room Temperature Silicon-Compatible LED/Laser with Electrically Pumped Field Emission Device - A light source includes a hot electron source comprising a cathode that generates an electron beam and an anode comprising a germanium containing material positioned adjacent to the cathode. The anode is biased so that the electron beam accelerates towards the anode where some electrons are absorbed and then relax to both direct energy bands and indirect energy bands causing stimulation of low energy electrons from the indirect energy band to the direct energy band, thereby creating electroluminescence. 20120001543 Published Description Patent application number Jianxiao Chen, San Diego, CA US //]]> BarDraw('2917205',['Patent applications by Jen M. Chen, San Diego, CA US'],[[1,1,1,1,1]],['2009','2010','2011','2012','2014'],0); // <script type=\"text/javascript\"> </div> <div id=\"legend2917205\" align=\"center\"></div> </div> <canvas id=\"bg2917205\" style=\"max-width: 500px; width: 100%;\"></canvas> <div> <p align=\"center\">Patent applications by Jen M. Chen, San Diego, CA US</p> <div class=\"bar2917205\" style=\"max-width: 500px; width: 100%; float:left; \"> <div align=\"left\" style=\"padding-top:20px;\"> </table> </tbody> </tr> <td>05-15-2014</td> <td><a href=\"/patents/app/20140135021\">SYSTEMS, METHODS AND APPARATUS CONFIGURED TO MANAGE NEIGHBOR CELL LISTS</a> - According to some wireless network standards the size of a neighbor cell list is restricted to a maximum size. The limited size of a neighbor cell list may not reflect the realities of a wireless network deployment, especially for deployments including numerous femto cells clustered in close proximity. Accordingly, as the concentration of macro cells and/or femto cells in an area increases,",
    "textAfterTable": "Patent applications by Jinghu Chen, San Diego, CA US Jing Yang Chen, San Diego, CA US Patent application number Description Published 20090016451 Method and Apparatus for Performing Motion Compensated Temporal Filtering in Video Encoding 01-15-2009 20100329340 METHOD AND APPARATUS FOR ELIMINATING ENCODING DELAY WHEN A TELECINE SOURCE MATERIAL IS DETECTED - A video encoder includes an inverse telecine detector for receiving video frames and generating a telecine detection signal identifying repeated frames and an encoder pipeline buffer for storing unrepeated video frames received from the inverse telecine detector. The video encoder also includes an encoder engine for encoding the unrepeated video frames received from the encoder pipeline buffer, a pre-encoded frame storage medium for storing pre-encoded frames, and a processor. The processor is configured to cause the encoder engine to replace selected frames that have been identified as repeating frames by the inverse telecine detector with a pre-encoded frame accessed from the pre-encoded frame storage medium. 12-30-2010 20110119064 AUDIO DATA BIT RATE DETECTOR - A detector for determining an audio data bit rate of a pre-compressed audio elementary stream (AES), in which the pre-compressed AES includes a plurality of preamble length fields is",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}