{
    "relation": [
        [
            "Feature Name",
            "SCTP, Release 1",
            "SCTP Release 2",
            "SCTP Show/Clear CLI Enhancements",
            "SCTP Release 4, Phase 1",
            "SCTP Release 4, Phase 2"
        ],
        [
            "Releases",
            "12.2(4)T",
            "12.2(8)T",
            "12.4(11)T",
            "12.4(15)T",
            "12.4(20)T"
        ],
        [
            "Feature Information",
            "Stream Control Transmission Protocol (SCTP) is a reliable datagram-oriented IP transport protocol specified by RFC 2960. In 12.2(4)T, this feature was introduced. The following commands were introduced or modified by this feature: clear ip sctp statistics, debug ip sctp api, debug ip sctp congestion, debug ip sctp init, debug ip sctp multihome, debug ip sctp performance, debug ip sctp rcvchunks,debug ip sctp rto, debug ip sctp segments, debug ip sctp segmentv, debug ip sctp signal, debug ip sctp sndchunks,debug ip sctp state,debug ip sctp timer, debug ip sctp warnings, show ip sctp association list, show ip sctp association parameters, show ip sctp association statistics, show ip sctp errors, show ip sctp instances, show ip sctp statistics.",
            "SCTP Release 2 introduced updated output for SCTP commands. The following commands were modified by this feature: show ip sctp association paramters, show ip sctp association statistics.",
            "The SCTP Show/Clear CLI Enhancements feature provides access to additional SCTP information that can help with troubleshooting potential problems. These enhancements also make the updated SCTP show and clear commands consistent with the CLI of other transport protocols. The following commands were replaced by this feature: clear ip sctp statistics, show ip sctp association list, show ip sctp association parameters, show ip sctp association statistics, show ip sctp errors, show ip sctp instances, show ip sctp statistics. The following commands were introduced by this feature: clear sctp statistics, show sctp association, show sctp association list, show sctp association parameters, show sctp association statistics, show sctp errors, show sctp instance,show sctp instances,show sctp instances, show sctp statistics.",
            "SCTP Release 4 introduced the SCTP Stream Reset and Authentication features. SCTP Release 4 introduced the SCTP Stream Reset and Authentication features. SCTP stream reset feature enables SCTP to reset stream transport sequence numbers and all stream sequence numbers. SCTP stream reset enables SCTP to: Dynamically reset a peer's outbound streams Dynamically reset a local host's outbound stream Dynamically reset specific numbered streams SCTP Authentication enables SCTP to: Set up a dynamic shared association key with no shared secret Allow a shared secret to be combined with an association key Use the shared association secret to authenticate chunks Negotiate which chunk types must be authenticated",
            "As of Cisco IOS Release 12.4(20)T, SCTP Release 4 introduced the SCTP Add-IP feature. The SCTP Add-IP feature enables the ability to add or delete an IP address for an endpoint of an existing SCTP association and to communicate this change to the remote end. An ADD-IP chunk is sent to the remote end adding or removing the redundant server addresses of the association. The ADD-IP chunk also deletes all addresses of a failed host from an association. The SCTP Add-IP feature also enables an application to programmatically set the primary address for an SCTP association. The following commands are new or modified in this release: ip sctp authenticate, ip sctp asconf."
        ]
    ],
    "pageTitle": "IP Application Services Configuration Guide, Cisco IOS Release 12.4 - Stream Control Transmission Protocol [Cisco IOS Software Releases 12.4 Mainline] - Cisco",
    "title": "",
    "url": "http://www.cisco.com/c/en/us/td/docs/ios-xml/ios/ipapp/configuration/12-4/iap-12-4-book/iap-sctp.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042985140.15/warc/CC-MAIN-20150728002305-00318-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 385050755,
    "recordOffset": 385023533,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{16995=Stream Control Transmission Protocol (SCTP) is a reliable datagram-oriented IP transport protocol specified by RFC 2960. It provides the layer between an SCTP user application and an unreliable end-to-end datagram service such as IP. The basic service offered by SCTP is the reliable transfer of user datagrams between peer SCTP users. It performs this service within the context of an association between two SCTP hosts. SCTP is connection-oriented, but SCTP association is a broader concept than the Transmission Control Protocol (TCP) connection, for example.}",
    "TableContextTimeStampAfterTable": "{106930=RFC 2960, 112297=Stream Control Transmission Protocol (SCTP) is a reliable datagram-oriented IP transport protocol specified by RFC 2960., 31256=The following sample output displays information for SCTP instance 0. In this example, instance 0 is using local port 1000 and has three current associations., 66518=In the following example, a segmented datagram is received in two chunks, for stream 0 and sequence number 0. The length of the first chunk is1452, and the second is 1 byte. The first chunk indicates that it is for a new datagram, but the second chunk indicates that it is part of an existing datagram that is already being reassembled. When the first chunk is processed, it is noted to be in sequence, but is not complete and so cannot be delivered yet. When the second chunk is received, the datagram is both in sequence and complete. The application receives the datagram, and a SACK is shown to acknowledge that both chunks were received with no missing chunks indicated (that is, with no fragments).}",
    "textBeforeTable": "Feature Information for SCTP Table 2 Use Cisco Feature Navigator to find information about platform support and Cisco software image support. To access Cisco Feature Navigator, go to www.cisco.com/go/cfn. An account on Cisco.com is not required. The following table provides release information about the feature or features described in this module. This table lists only the software release that introduced support for a given feature in a given software release train. Unless noted otherwise, subsequent releases of that software release train also support that feature. Feature Information for SCTP http://www.cisco.com/cisco/web/support/index.html The Cisco Support and Documentation website provides extensive online resources, including documentation and tools for troubleshooting and resolving technical issues with Cisco products and technologies. To receive security and technical information about your products, you can subscribe to various services, such as the Product Alert Tool (accessed from Field Notices), the Cisco Technical Services Newsletter, and Really Simple Syndication (RSS) Feeds. Access to most tools on the Cisco Support and Documentation website requires a Cisco.com user ID and password.",
    "textAfterTable": "Cisco and the Cisco logo are trademarks or registered trademarks of Cisco and/or its affiliates in the U.S. and other countries. To view a list of Cisco trademarks, go to this URL: www.cisco.com/go/trademarks. Third-party trademarks mentioned are the property of their respective owners. The use of the word partner does not imply a partnership relationship between Cisco and any other company. (1110R) Any Internet Protocol (IP) addresses and phone numbers used in this document are not intended to be actual addresses and phone numbers. Any examples, command display output, network topology diagrams, and other figures included in the document are shown for illustrative purposes only. Any use of actual IP addresses or phone numbers in illustrative content is unintentional and coincidental. © 2011 Cisco Systems, Inc. All rights reserved. Contacts | Feedback | Help | Site Map |",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}