{
    "relation": [
        [
            "Date",
            "2010-04-05 09:30:00",
            "2008-09-29 10:30:00"
        ],
        [
            "Roundtable Name",
            "Season Opener Roundtable",
            "Tigers/White Sox Play-In Game"
        ],
        [
            "Comment",
            "White Sox announcers and staff's pick to click today: Teahan, Rios, Kotsay. Um, I'll take the field. That said, Carlos Quentin laces a double in the first and while it might be opening day optimism, that's as comfortable and free as I've seen his swing since 08. (Kevin Goldstein)",
            "nschaef (Atlanta): When did the White Sox offense become this awful? About the time Carlos Quentin's .287/.394/.571 went on the shelf. That .400 OBP was in the 3-hole and replaced by Dye, and then you started seeing a lot of d-wise's sub-.300 OBP in the 2-hole a lot. (William Burke)"
        ]
    ],
    "pageTitle": "Carlos Quentin | Baseball Prospectus",
    "title": "",
    "url": "http://www.baseballprospectus.com/pecota/QUENTIN19820828A.php",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042985140.15/warc/CC-MAIN-20150728002305-00109-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 311732847,
    "recordOffset": 311690387,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{43538=Last Update: 12/31/2014 23:59 ET}",
    "lastModified": "Wed, 29 Jul 2015 00:40:26 GMT",
    "textBeforeTable": "BP Roundtables Quentin, even if he's going to have the benefit of hitting to that short corner in left in the Cell. Just as in real life, it's always better to have a piece of Pie. (Christina Kahrl) In my strat league, I have Felix Pie and Carlos Quentin in reserve. Looking long term, if you had to move one of these 2, who would it be? (Strat Weenie Lou from Cape Cod) 2008-01-17 14:00:00 (link to chat) It's real. Quentin can rake, and only some injury problems have stood in his way. That was an excellent trade by Kenny Williams, one of the best of his tenure. I confess that I thought, initially, that it was the other Sox picking him up, just because it was a nice buy-low play. Williams has developed into a good GM--erratic, but on the whole, good. (Joe Sheehan) I realize that Carlos Quentin probably won't hit like an MVP candidate for the rest of the year, but how much of this is real as I seem to remember as being a pretty decent prospect with the D Backs? Also with Josh Fields continuing to have major issues with strikeouts even in AAA. might",
    "textAfterTable": "  PITCHf/x Hitter Profile A Collaboration between BrooksBaseball.net and Baseball Prospectus - Pitch classifications provided by Pitch Info LLC   Baseball Prospectus Analysis Blog Radio Events Newsletter Search News Player Cards Player Search Team Audit Statistics Fantasy Player Forecast Manager Depth Charts Team Tracker Hacking Mass Team Health Reports BP.com Terms of Service Customer Service Privacy Policy Contact Us Glossary AMERICAN LEAGUE Baltimore Orioles Boston Red Sox New York Yankees Tampa Bay Rays Toronto Blue Jays Chicago White Sox Cleveland Indians Detroit Tigers Kansas City Royals Minnesota Twins",
    "hasKeyColumn": true,
    "keyColumnIndex": 1,
    "headerRowIndex": 0
}