{
    "relation": [
        [
            "Days",
            "30",
            "50",
            "150",
            "200"
        ],
        [
            "BSE",
            "13.87",
            "13.55",
            "14.95",
            "14.87"
        ],
        [
            "NSE",
            "13.86",
            "13.54",
            "14.94",
            "14.85"
        ]
    ],
    "pageTitle": "Orient Green Power Company Stock Price, Share Price, Live BSE/NSE, Orient Green Power Company Bids Offers. Buy/Sell Orient Green Power Company news & tips, & F&O Quotes",
    "title": "",
    "url": "http://www.moneycontrol.com/india/stockpricequote/power-generation-distribution/orientgreenpowercompany/OGP",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042985140.15/warc/CC-MAIN-20150728002305-00138-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 595394543,
    "recordOffset": 595340129,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{205756=Orient Green is in the Power - Generation & Distribution sector. The current market capitalisation stands at Rs 791.33 crore. The company management includes N Rangachary - Chairman, T Shivaraman - Vice Chairman, S Venkatachalam - Managing Director, P Krishnakumar - Director, A L Suri - Director, R Ganapathi - Director, R Sundararajan - Director, S Venkat Ram - Director, S Srinivasan - Director, Vishal Vijay Gupta - Director, Himraj Dang - Director, Savita Mahajan - Director. It is listed on the BSE with a BSE Code of 533263 and the NSE with an NSE Code of GREENPOWER. Its Registered office is at 4th Floor, Sigappi Achi Building, 18/3 Rukmini Lakshmipathi Road,,Egmore Chennai (Madras),Tamil Nadu - 600008. Their Registrars are Link Intime India Pvt. Ltd., 204448=Astec LifeSciences Recommended on Mar 31st 2015, 133578=UnitedBrewerie Jul Fut, 133067=28 July 2015, 134285=JSWSteel Jul Fut}",
    "textBeforeTable": "Edit Watchlist Have you invested in these stocks? You can track them better in your Portfolio close[x] Add to Watchist Account Optional Optional Optional Optional Add to Portfolio OR Add to watchlist } $('#mcpcp_addprof_info').hide(); { function close_info()",
    "textAfterTable": "Keep me signed in Forgot Password? New to Moneycontrol - Sign up now Its easy and FREE! Username Username should be atleast 4 characters Password Password should be 6 to 10 characters Confirm Password Email OR connect with LIVE",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}