{
    "relation": [
        [
            "S. No.",
            "12",
            "13"
        ],
        [
            "New Item",
            "Chapter – 8 Annexure – 8.1",
            "Chapter – 8 Annexure – 8.1"
        ],
        [
            "Page No",
            "202",
            "202"
        ],
        [
            "Name of Machine",
            "Utility Vehicle (self Propelled)",
            "Rail Vacuum Excavating Machine (VM-170)"
        ],
        [
            "Asst Foreman cum Sr.Operator",
            "1",
            "1"
        ],
        [
            "Charge man Cum operator",
            "1",
            "2"
        ],
        [
            "Highly Skilled",
            "1",
            "2"
        ],
        [
            "Skilled Fitter",
            "1",
            "1"
        ],
        [
            "Khalasi/ Khalasi Helper",
            "3",
            "4"
        ],
        [
            "Total",
            "7",
            "10"
        ]
    ],
    "pageTitle": "Institution of Permanent way Engineers (India)",
    "title": "",
    "url": "http://www.ipweindia.com/design/html/correctionslip.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042985140.15/warc/CC-MAIN-20150728002305-00317-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 531530871,
    "recordOffset": 531483623,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{27692=ADVANCE CORRECTION SLIP No. 65 Dated 01-03-2001 (Ref. Railway Board's letter No. NO.99/CE-II/TK/Misc. dated. 01.03.2001)., 31232=INDIAN RAILWAYS PERMANENT WAY MANUAL 1986 (EDITION), 29596=The para 901 of chapter IX of IRPWM - 1986 modified vide correction slip No.35 dated 19.08.99 be re-modified to read as under: -, 31144=Advance Correction Slip No.63 dated 27.1.2000. (Ref. Railway Board's letter No.98/CE-II/CS/1 dated 27.11.2000)., 7931=ADVANCE CORRECTION SLIP No. 67 Dated 24.4.2001 (Ref. Railway Board's letter no. 98/CE-II/TK/Misc./3 dated 24.04.2001), 29779=ADVANCE CORRECTION SLIP No. 64 Dated 05-01-2001 (Ref. Railway Board's letter No. 99/CE-I/LX/80dated 05.01.2001)., 9541=INDIAN RAILWAYS PERMANENT WAY MANUAL 1986 - (EDITION), 9434=Advance Correction Slip No. 66 Dated 30.3.2001 (Ref. Railway Board's letter No.2000/CE-II/PRA/1 dated 30.03.2001), 27887=INDIAN RAILWAYS PERMANENT WAY MANUAL 1986 - (EDITION), 30038=INDIAN RAILWAYS PERMANENT WAY MANUAL 1986 - (EDITION)}",
    "TableContextTimeStampAfterTable": "{171335=(B) The following corrections/amendments may also be made at page 202, Annexure 8.1, Para (B) of Chapter 8 of IRTMM – March 2000. Scale of Staff for field operation. Scale of field operation staff for each type of machine are as under-:, 90743=Existing para 1411 (5) (b) may be replaced as under:, 173366=The above machines were procured after issue of manual hence not included at the time of issue of IRTMM. Authority: Board`s office letter No. 2000/Track-III/TK/18 dt. 11.7.2002, 181354=Authority: Board `s office letter No. 2000/Track-III/TK/18 dt 15.9.2003., 91534=A new para 1411 (5) (c) be added to read as under:, 15473=ADVANCE CORRECTION SLIP No. 69 Dated 23.05.2001, 90804=(b) Lubrication of ERCs - Grease Graphite to the specification 15-408- 1981 Gr. O should be used for this purpose. This work should not be carried out during extreme of summer and heavy rainfall. At a time ERCs should not be removed from more than one sleeper. If for any reasons mass lubrication of ERCs is taken up, at least 15 sleepers shall be kept intact between any two sleepers taken up for lubrication of ERCs at the same time. The ERCs should be cleaned by wire brush and emery paper. The eye of the insert shall also be cleaned by suitable brush. After cleaning., grease graphite shall be applied to the inside surface of eye of insert and leg of ERC. Inside/Outside ERCs should be interchanged and fixed again., 126409=The amendments to existing Para 701-E may be carried out as given below: (i) The figures \"Rs.I0,OOO/- appearing in Vth line of sub-para 'b' may be substituted by Rs.50,OOO/-. (ii) The figures \"Rs.50,OOO/- appearing in Vth line of sub-para 'b' may be. substituted by Rs.2 lakhs, (iii) The figures \"R.s.50,OOO/- appearing in IInd line ofs~b-para 'd' may be substituted by Rs.l lakh. (iv) The figures 'Rs.5,OOO appearing in 1st line of Note-I. may be substituted by Rs.50,OOO/- (v) The figures 'Rs.50,OOO appearing in IInd line of Note-I. may be substituted by Rs.2 lakhs. (vi)The figures 'Rs.50,OOO appearing in IlIrd line of Note-I. substituted by Rs.l lakh . (Authority Railway Board's file No.2001/CE.I/CT/17(Pt) dated:4.03.2003), 205865=The following New Paragraph No.5.1.3 is added under Para No.5.1 at page 132 of Chapter 5 of IRTMM-2000 as under: 5.1.3: Following track structure and track geometry standards shall be ensured before deployment of track machines on construction projects. (a) Track laying standards in respect of gauge, joints, expansion gaps and spacing of sleepers for the track as specified in Para 316 of IRPWM may be followed. (b) The pre-tamping and post tamping operations as specified in Chapter 3 of IRTMM should be followed. (c) A minimum cushion of 150 mm of clean ballast alongwith adequate ballast on shoulders and cribs should be ensured before deploying the tamping machines. (d) The track geometry prior to deployment of track machines for new works of new line, doubling, gauge conversion etc. should be as under:    Peak value of Unevenness : 15 mm on 3.6m Chord    Peak value of Twist           : 15 mm on 3.6m Chord    Peak value of Alignment    : 15 mm on 7.2m Chord The above track geometry standards are not safety/slow down tolerances but are only a prerequisite for deployment of track tamping for better machine productivity and their optimum utilization. (e) For achieving the track geometry parameters as above, suitable small track machines such as off-track tampers etc. may be used. (f) Dy.CE(Construction)/DEN(Construction) should certify the track geometry as mentioned above before deploying the track machines., 187593=The Manual for Ultrasonic testing of Rails and Welds( 1998) was circulated to all Zonal Railways vide this office D.O. letter referred above. Correction slip no.14 of May 2004 to the above manual is enclosed herewith for information and further necessary action. This has approval of Railway Board. This correction slip covers the following aspects. i) Defining size/shape of probes ( Para 8.1 (vi)): The issue of use of large size probes has been re-examined in the light of various probe characteristics required for rail flaw detection and the following has been observed:     a) The maximum dimension of the web is not beyond 20mm and therefore use of larger size probe is not advantageous.     b) Large sized probes have less divergence and therefore there is no distinct advantage by their usage. 20mm diameter probes are expected to provide increased divergence.     c) Higher diameter probes are also associated with acoustic coupling difficulties since the rail surfaces are not excepted to be even through out. Therefore reduction in the crystal size of probes has been prescribed. (ii) Change in the frequency of 700 probe for flange testing of welds from 1.25 MHz to 2 MHz: The considerations behind use of higher frequency probes are as under:     a) Higher frequency probes are considered to be more sensitive since the wavelength is smaller. Therefore, possibility of detecting finer crack is more with 2MHz probes.     b) Higher frequency probes provide narrow pulse width resulting in sharper signals received from the flaws. Therefore, usage of higher frequency probes is considered superior.     c) Higher frequency probes have superior resolution and therefore recommended for finer flaw detection.     d) Higher frequency probes are associated with higher attenuation which is not desirable. However, considering the smaller zone of the weldment, no appreciable attenuation is expected. Therefore, considering all aspects mentioned above, use of 2 MHz probes has been prescribed for examination of foot portion of AT welds. iii) Corrections in Annexure-VI para2(I) regarding test free period of rails. iv) Revision to para 4.4: Modification has been prescribed in para4.4 to include spares for 450, 2 MHz probe and 700 ,2 MHz probe ( 8mm x 8mm ) for detection of half moon crack defect in web foot junction. Further, in order to ensure compatibility of spares with machine to achieve consistent and assured quality of testing , it has been prescribed that the spares of the USFD machines shall be procured from original equipment manufacturers (OEMs) only along with the stipulation that trolley spares and battery can be procured from open market also. v) Corrections in the Annexure VII: Correction in the following have been made     (a) Description of oscillograph pattern of Normal probe 4 MHz within fishplated area and out side fishplated area for rail defects.     (b) Description of nature of defects of 700 probe for rail defect.     (c) Description of oscillograph pattern of 700 probe for rail defect.     (d) Description of oscillograph pattern of Normal probe 4 MHz within fishplated area and out side fishplated area for weld defect ( AT + FBW )     (e) Description of nature of defects of 700 probe for Weld defect ( AT+ FBW )     (f) Description of oscillograph pattern of 700 probe for Weld defect (AT + FBW )., 166949=The requirement of a cook for BRM and DTS shall be met with out of the provision made for the machine to which these machines are attached. The posts shall be operated ex-cadre. No separate provision for Khallasi or Helper is to be granted along with one cook.\" Authority: Board`s office letter No. 89/Track-III/TK/77 dated 16.8.99. (C) New Para 8.4.7 may be added at Page 200 as below: 8.4.7 Rest Roster. \"Staff working on Track Machines may be rostered to work for a period of 3 weeks at a stretch followed by continuous rest for a period of one week at headquarters. The three weeks continuous roster will in include the actual period of journey undertaken from headquarters to the place of work and the back. The individuals shall not be employed for more than 12 hours on any day. In respect to overtime, the staff will be governed by extant instructions under HOER in regard to the principle of averaging. The actual duty hours (timings) for staff working on various track machines shall be decided by the Zonal Railways, keeping in view the timings of the nominated corridor blocks over the sections where the machines are deployed, within the above provisions. The above instructions will be valid for a period of three years (from July,2000 ). This is a temporary exemption from the Provision of Railway Act1989.\" Authority: Board`s Office letter No. E(LL) 98-HER/9 dated 06.7.2000., 178519=Authority: Board `s office letter No. 2000/Track-III/TK/18 dt 26.5.2003., 184158=Authority: Board `s office letter No. 2000/Track-III/TK/18 dt 13.1.2004., 128163=The amendments to existing Para 1102-E may be carried out as given below:- (i) The figures \"Rs.5,0001- appearing in 1102-(i) may be substituted by Rs.50,0001- (ii) The figures \"Rs.l0,.0001- appearing in 1102-(ii) may be substituted by Rs. 50,0001- (iii) The figures \"Rs.I0,0001- appearing in 1102-(iii) may be substituted by Rs. 50,0001-. (iv) The figures \"Rs.50,0001- appearing in 1102-(iv) may be substituted by Rs.2 lakhs. (v) The figures \"Rs.50,0001- appearing in 1102-(v) may be substituted by Rs.l lakh. (Authority Railway Board's file No.2001/CE.I/CT/17(Pt) dated:4.03.2003), 165006=(A) The following may be added at the end of Preface to IRTMM, March 2000 (Page prefixing Page i) : \"This manual has been issued in consultation with Finance and Traffic Directorates of Railway Board.\" Authority: Noting pp4/n and 12/n of the Board`s office case file No. 96/Track-III/TK44 Vol.II and Board`s Office letter No. 96/Track-III/TK44 Vol.II dated 11.7.2000. (B) The following may be added at Page 202, Annexure 8.1, Para (B), below the table : \"In addition to the above, cooks shall be provided as below:, 160459=Para 502 – Alumino Thermit Welding of rails: Alumino Thermit Welding of rails may be carried out in accordance with the detailed procedure laid down in the “Manual for Fusion Welding of Rails by Alumino Thermit Process, September, 1996”. A thermit weld done in situ shall be joggle fish plated with two clamps till tested as good by USFD., 169937=(A) The following correction/amendments may be made at page 201, Annexure 8.1 Para (A) of Chapter 8 of IRTMM – March 2000. Weightage factors (Units) for Track Machines. Weightage factors for different types of Machines are as under:-, 176296=Necessary action may be taken for issue of correction slip under advise to all concern. Authority: Board`s office letter No. 2000/Track-III/TK/18 dt. 14.5.2003, 90171=170 (6) (b) - Where the beat of a keyman consists of PRC sleepers - The Keyman should ensure that, in addition to his normal duty of inspection and tightening of fittings, he should also carry out in a systematic manner from one end, greasing of the ERC and eyes of inserts at the rate of 20 sleepers per day. Greasing shall be done as per the procedure laid down in para 1411 (5) (b) of IRPWM., 185699=The Paragraph number 4.3.1 under Para 4.3 – “ Competency of Operator” of chapter 4 of IRTMM – 2000 may be modified to read as under: 4.3.1: The operator shall be fit in A-3 medical category. If wearing spectacles, he shall carry on extra pair while on duty. Technicians and helpers working on Track Machines shall be fit in B-1 medical category., 182895=A. The Paragraph number 4.3.3 under Para 4.3 – “ Competency of Operator” of Chapter 4 of IRTMM-2000 may be revised to read as under: 4.3.3: \"The operator shall apply to the Dy.Chief Engineer incharge of the machines well in advance of the date of expiry for renewal of the competency certificate. The officer shall review the certificate for further period of three years at a time after holding a test. The operator shall, however, be required to go for a Refresher Course in Zonal Training Centre/IRTMTC, Allhabad, within a period of 3 (three) years. B. The Paragraph number 8.3.2 under para 8.3 – ‘Training of Track Machine Personnel” of Chapter 8 of IRTMM – 2000 may be revised and corrected as under: 8.3.2: \"All technical staff working on track machines shall undergo regular courses framed for different categories at IRTMTC/Allhabad. They shall also undergo various refresher courses at IRTMTC once in 5 years. However, the staff performing the duties of driving the track machines shall undergo refresher courses at IRTMTC once in 3 years. Training facilities with manufacturers may also be availed\"., 194941=4. Para 4.4 of USFD Manual –1998 may be revised as under : Para 4.4 Spares The recommended spares for normal maintenance of the equipment are given below:, 30031=(b) In Service Maintenance : Lubrication of ERCs in track should normally be carried out be keyman in a systematic manner from one end to other at the rate of 20 sleepers (80 ERC) per day. This work should not be carried out during extreme of summer and heavy rainfall. Grease graphite to the specification IS-408-1981 Gr. O should be used for this purpose. At a time, keyman should not remove ERCs on more than one sleeper. If for any reason mass lubrication of ERCs is taken up then between any two sleepers taken up for lubrication of ERCs at the same time, at least 15 sleepers shall be kept intact. The ERCs should be cleaned by wier brush and emery paper. The eye of the insert shall also be cleaned by suitable brush. After cleaning, grease graphite shall be applied to the inside surface of eye of insert and leg of ERC. Inside/Outside ERCs should be interchanged and fixed again. The lubrication of ERCs and inserts at the time of initial laying should preferably be done in base depot and thereafter should be done once in a year in corrosion prone areas and platform lines and once in two years in other areas., 157902=Reconditioned sleepers Nos. 1000, January 1980 Km. 72/0 – km. 72/12, 177934=The following New Paragraph No. 4.6.8 (iv) is added under Para 4.6 – “Precautions” of Chapter 4 of IRTMM – 2000 – Rules for movement and working of Track Machines as under: 4.6.8(iv): \"The vertical and lateral clearance for OHE, Signal post and any other structure should be checked and adjusted before clearing the Block. It shall be ensured by supervisor working with track machine that there should be no infringement to Signal post, OHE and any other Structure as per schedule of Dimensions\"., 180060=The following Paragraphs are added under Para 5.6 – \"Special Precautions While Working Machines in Ghat Section\" of Chapter 5 of IRTMM-2000 as under: 5.6(xi): No run through movement shall be done in convoy while moving in Ghat Section. Only one machine shall be allowed to move for run through movement in Ghat Section at a time. 5.6(xii): (a) Normally machines shall not work in convoy while visibility of track is restricted due to sharp curves and steep gradients. Where the working of track machines in convoy is indispensable i.e. like deep screening, track relaying site etc., the necessary block protection shall be done as per para 806 of IRPWM and special precaution shall be taken as per para 811 of IRPWM for the first machine facing the direction of traffic in double line section and for the front and rear most machines in single line section. (b) The minimum distance between the machines when working in convoy shall be 50 m to avoid collision between machines and danger to life of machine and P.Way staff working with machines. (c) It shall be ensured that there is no infringement to the adjacent track due to any part of the machine working on the track., 11912=ADVANCE CORRECTION SLIP No. 68 Dated 25.4.2001}",
    "lastModified": "Tue, 22 Jul 2008 08:50:23 GMT",
    "textBeforeTable": "(A) The following may be added at the end of Preface to IRTMM, March 2000 (Page prefixing Page i) : \"This manual has been issued in consultation with Finance and Traffic Directorates of Railway Board.\" Authority: Noting pp4/n and 12/n of the Board`s office case file No. 96/Track-III/TK44 Vol.II and Board`s Office letter No. 96/Track-III/TK44 Vol.II dated 11.7.2000. (B) The following may be added at Page 202, Annexure 8.1, Para (B), below the table : \"In addition to the above, cooks shall be provided as below:     Correction Slip No. 1 to Indian Railways track Machines Manual (IRTMM– March 2000)   A copy of the Correction Slip No.1 to Indian Railways Track Machines Manual-March’2000 is enclosed for information and necessary action.   Sub: Indian Railway Track Machines Manual – March,2000. Reg: Correction Slip No.1.   BACK   (6)Enclosed Annexure 2/19 may be added to chapter 2 of IRPWM Manual, after Annexure 2/18.",
    "textAfterTable": "  BACK   Sub: Indian Railway Track Machines Manual – March,2000. Reg: Correction Slip No.2.   A copy of the Correction Slip No.2 to Indian Railways Track Machines Manual-March’2000 is enclosed for information and necessary action.   Correction Slip No. 2 to Indian Railways track Machines Manual (IRTMM - March 2000     (A) The following correction/amendments may be made at page 201, Annexure 8.1 Para (A) of Chapter 8 of IRTMM – March 2000. Weightage factors (Units) for Track Machines. Weightage factors for different types of Machines are as under:- S. No. New Item Page No Type of Machine Weightage factors 2 Chapter – 8 Annexure – 8.1 201 Ballast Regulator/Utility vehicle (Self Propelled) 0.8 3 Chapter – 8 Annexure – 8.1 201 Ballast Cleaning Machines, Shoulder Ballast Cleaning Machines",
    "hasKeyColumn": true,
    "keyColumnIndex": 3,
    "headerRowIndex": 0
}