{
    "relation": [
        [
            "English Names",
            "Anthony | Tony",
            "Tony",
            "Arnold | Art",
            "Bartholomew",
            "Bert | Burt",
            "Cornelis | Cornelius",
            "Dennis",
            "Harmon",
            "Jacob",
            "John",
            "Matthew | Matt",
            "Nicholas | Nickolas",
            "Peter",
            "William"
        ],
        [
            "Dutch Equivalent Names",
            "Anthonius | Antonis",
            "Theunis | Teunis",
            "Arnoldus",
            "Bartolomeus | Bartholomeus",
            "Bertus | Berthold",
            "Cornelis",
            "Denys | Dionijs",
            "Hermannus | Harmannus",
            "Jacobus | Jakobus",
            "Johannus | Joannus",
            "Mathias | Mattias",
            "Nicolaes | Nikolaas",
            "Petrus",
            "Wilhelmus | Willem"
        ],
        [
            "Shortened Dutch Names",
            "Anton | Antoon | Toon | Tonnis | Antonus",
            "Teun | Toni",
            "Arnold",
            "Bartol | Bart | Meese | Meus",
            "Bert | Mart",
            "Krelis | Nelis | Kees | Cees | Cor",
            "Nys | Nijs",
            "Herman | Mannus (see note)",
            "Jacob | Jokob | Jaap | Jakob",
            "Johan | Jan | Hans | Hannus /Johannes",
            "Thys | Thijs | Tijs | Tice * see note",
            "Claes | Klaas | Niek | Nico | Niekolaas",
            "Piet | Peter | Pieter",
            "Wilm | Wim"
        ]
    ],
    "pageTitle": "Dutch Names and Nicknames & English Equivalent",
    "title": "",
    "url": "http://www.olivetreegenealogy.com/nn/names.shtml",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042985140.15/warc/CC-MAIN-20150728002305-00206-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 628454011,
    "recordOffset": 628437003,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{49214=URL: http://olivetreegenealogy.com/           All rights reserved          Copyright © 1996-present These pages may be freely linked to but not duplicated in any fashion without my written consent., 37204=*Note: Thank you to Arjen Ronhaar for sharing his knowledge of Dutch names and providing The Olive Tree Genealogy with more names and explanations. Arjen, his great grandfather, and uncle all are \"Arend Jan Ronhaar\". His great grandfather was called \"Arend\", his uncle was called \"Jan\" and he is called \"Arjen\". Also thanks to Henk Koopmans for his corrections and additions to Dutch names.}",
    "textBeforeTable": "Dutch Names & Nicknames and their English Equivalent Dutch names can be very difficult to figure out. There are two kinds of Dutch diminuitives: the sh ortened Dutch name and the endearing Dutch name. The shortened name was used by the Dutch for both males and females. The endearing diminuitive was used exclusively for female names. This diminuitive form attached to female names as an expression of endearment was formed by adding the suffix -je or -tje. As well, -je, -tje, -ie and -ke are also additions to a child's name. A boy with the Dutch name \"Jan\" will in his childhood very often be named \"Jantje\". It is also used to show an age difference in place of Senior [Sr.] and Junior [Jr]. the father will be called \"Jan\" and the son \"Jantje\". Female names are slightly different. If a grandmother is named for example \"Sien\" or \"Sina\" the girls Dutch name very often is \"Sientje\" meaning small/younger Sien, and this will be the name given on the Birth certificate. Thus Sientje is her registered name, not just the diminuitive. As well, the suffixes -je and -tje, while normally used as a diminuitive, are also used to create the female form of the name (especially in Friesland). For example, \"Eelke\" is the male name and \"Eelkje\" is the female form. \"Hendrik\" is the full male name, \"Henk\" the short form and \"Hendrikje\" or \"Hendrickje\" the female form.",
    "textAfterTable": "*Note: Thank you to Arjen Ronhaar for sharing his knowledge of Dutch names and providing The Olive Tree Genealogy with more names and explanations. Arjen, his great grandfather, and uncle all are \"Arend Jan Ronhaar\". His great grandfather was called \"Arend\", his uncle was called \"Jan\" and he is called \"Arjen\". Also thanks to Henk Koopmans for his corrections and additions to Dutch names. He has also explained Harmanus vs. Hermanus: Harmannus = Harman = Mannus. (can be Harmannes, Mannes) Hermannus = Herman. (can be Hermannes) Herman is a common Dutch name which could be changed to Helmar or even Harrie. But Harrie also can come from Harman. Dutch Female Names and Nicknames English Names Dutch Equivalent Names Diminuitive & Shortened Dutch Names Alita Aleida Leida Anthonia - Teuntje Catherine Catharina Katrintje | Trintje | Trijntje",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}