{
    "relation": [
        [
            "Categories",
            "Campus Safety",
            "Great for these types of students",
            "Bang for the buck",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "In three sentences"
        ],
        [
            "Comments",
            "24-7 Security is available. Their number is posted all around campus in case of emergency. They also have buttons available to push on campus if you need their assistance.",
            "Medical/Healthcare Students, Business Students, Gaming/Simulation Students, Art Students, Education Students",
            "When considering the price, I do not think I could attend a better college. There are many different degree's offered and with every class you take you receive the education expected. Many academic scholarships are awarded at this institution. With the increase in admissions, I think this is becoming apparent to students.",
            "Every month a calender is posted with the daily events for that month. Very seldom is there a day where an event is not taking place. They do a great job of offering on campus activities and clubs/organizations for current students. There are also three dances held during the academic school year, which attracts many students. Along with these activities, they also encourage students to attend Shawnee sporting events to support our student athletes.",
            "Recently, Shawnee just opened a new dining area referred to as the Bear's Den. In my opinion they have lots of options to offer to the students. The meal plan prices are a little high, but I'm sure you'll find this at every college you go to. In addition to the great food they have, they are always holding special events for the students. For example, every month they have international food day where they pick a different country and make food from this origin. For on campus events, they are also available to cater.",
            "Shawnee State University has some of the best dorms I have ever visited. Although there are four different types, all have the layout similar to an apartment. In my opinion this makes life easier for students when it comes to studying and doing school work. There are always activities for students living on campus. They make living in a dorm a great experience you'll never forget.",
            "This college is very hands on and interactive with the students. I have not had a professor yet who does not go above and beyond to meet the requirements each student deserves. The classes are geared towards introducing and teaching material with modern technology, making it easy for students to obtain the information online.",
            "Shawnee State University is a great college to attend. The professors are very interactive with each student. This college has many degree's to offer students."
        ]
    ],
    "pageTitle": "Shawnee State University Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Shawnee-State-University/reviews?_escaped_fragment_=/show/26064",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988650.6/warc/CC-MAIN-20150728002308-00206-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 896502747,
    "recordOffset": 896457147,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{185969=© 2015, Cappex.com, LLC, 5175=Shawnee State University encourages students to use their financial aid office. They are open from 9:00 am-5:00 pm.}",
    "textBeforeTable": "12/21/2009 Reviewer is A current student here. 15 out of 16 people found this review useful. 1 of 42 Nicole from Hamilton, OH Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5",
    "textAfterTable": "Great for these types of students This is a great University for students that like to learn quickly but still have fun. Also, this is a great college for students that like small classes, with one-on-one opportunities with proffessors. Tips for prospective students The only thing I would like to tell students is that you really should stick to you classes. Try not to get caught up in partying and things like that, there are plenty of clubs and activities to keep yourself busy. Bang for the buck Shawnee State University encourages students to use their financial aid office. They are open from 9:00 am-5:00 pm. Did enjoy being here I enjoyed attending Shawnee State University very much. The campus is absolutely beautiful, and there are many activitities to keep yourself occupied. Did learn a lot I did learn many new thing's while attending Shawnee State University. This University has a wide variety of majors to choose from and also a wide variety of recreational activities. Login to rate or flag the reviews Courtney",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}