{
    "relation": [
        [
            "type",
            "FR Doc.",
            "RIN",
            "Notice No.",
            "Docket No."
        ],
        [
            "regulations.gov",
            "2015-14818",
            "2120-AK51",
            "15-05",
            "FAA-2015-2147"
        ]
    ],
    "pageTitle": "14 CFR Part 91, Subpart L - Continued Airworthiness and Safety Improvements | US Law | LII / Legal Information Institute",
    "title": "",
    "url": "https://www.law.cornell.edu/cfr/text/14/part-91/subpart-L?quicktabs_7=3",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988650.6/warc/CC-MAIN-20150728002308-00187-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 920954019,
    "recordOffset": 920931688,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{1170=Title 14 published on 2015-01-01.}",
    "TableContextTimeStampAfterTable": "{17528=This action amends Special Federal Aviation Regulation (SFAR) No. 77, “Prohibition Against Certain Flights Within the Territory and Airspace of Iraq,” which prohibits certain flight operations in the territory and airspace of Iraq by all United States (U.S.) air carriers; U.S. commercial operators; persons exercising the privileges of a U.S. airman certificate, except when such persons are operating a U.S.-registered civil aircraft for a foreign air carrier; and operators of U.S.-registered civil aircraft, except when such operators are foreign air carriers. On August 8, 2014, the FAA issued a Notice to Airmen (NOTAM) prohibiting flight operations in the ORBB FIR at all altitudes, subject to certain limited exceptions, due to the armed conflict in Iraq. This amendment to SFAR No. 77 incorporates the flight prohibition set forth in the August 8, 2014, NOTAM into the rule. The FAA is also revising the approval process for this SFAR for other U.S. Government departments, agencies, and instrumentalities, to align with the approval process established for other recently published flight prohibition SFARs. This final rule will remain in effect for two years., 7466=The Federal Aviation Administration is reminding operators of jet airplanes weighing 75,000 pounds or less that after December 31, 2015, operations in the contiguous United States may be conducted only with airplanes that comply with at least Stage 3 noise levels. Operators that fail to meet this requirement may be subject to civil penalties. Certain operations of airplanes not meeting Stage 3 may be conducted under special flight authorizations granted by the FAA on a case by case basis., 34341=The FAA is correcting a final rule technical amendment published on February 9, 2015 (80 FR 6899). In that final rule, which became effective on the date of publication, the FAA corrected errors in regulatory provisions addressing Automatic Dependent Surveillance-Broadcast Out equipment and use. The FAA inadvertently listed an incorrect Amendment Number for that final rule. This document corrects that error., 55836=Title 14 published on 2015-01-01, 28506=This action extends the prohibition of flight operations within the Tripoli (HLLL) Flight Information Region (FIR) by all: U.S. air carriers; U.S. commercial operators; persons exercising the privileges of an airman certificate issued by the FAA, except when such persons are operating a U.S.-registered aircraft for a foreign air carrier; and operators of U.S.-registered civil aircraft, except operators of such aircraft that are foreign air carriers. The extension of the expiration date is necessary to address a potential hazard to persons and aircraft engaged in such flight operations. Additionally, the FAA is amending the prohibition to make clear that operations by sub-contractors under a U.S. Government department, agency, or instrumentality's contract, grant, or cooperative agreement may be included in an approval request and to remove an obsolete reference to paragraph 8 of United Nations Security Council Resolution (UNSCR) 1973. The FAA is also revising the approval conditions that will apply to operations authorized by other U.S. Government departments, agencies, and instrumentalities that are approved by the FAA, and the information about requests for exemption, to reflect the termination of statutory authorization for the FAA premium war risk insurance program., 51688=§ 1155 - Aviation penalties, 43830=The FAA is correcting a final rule published on May 28, 2010. In that rule, the FAA amended its regulations by adding equipage requirements and performance standards for Automatic Dependent Surveillance—Broadcast (ADS-B) Out avionics on aircraft operating in Classes A, B, and C airspace, as well as other specified classes of airspace within the U.S. National Airspace System (NAS). This document corrects errors in regulatory provisions addressing ADS-B Out equipment and use., 55434=61 Stat. 1180}",
    "lastModified": "Sat, 01 Aug 2015 02:15:50 GMT",
    "textBeforeTable": "Additional Documents GPO FDSys XML | Text 80 FR 43012 - Policy Regarding Living History Flight Experience Exemptions for Passenger Carrying Operations Conducted for Compensation and Hire in Other Than Standard Category Aircraft 2015-07-21; vol. 80 # 139 - Tuesday, July 21, 2015 For a complete list of all Rules, Proposed Rules, and Notices view the Rulemaking tab. The following are only the Rules published in the Federal Register after the published date of Title 14. Title 14 published on 2015-01-01. 72 FR 63410, Nov. 8, 2007, unless otherwise noted. Amdt. 91-297, Source: § 91.1507 — Fuel tank system inspection program. § 91.1505 — Repairs assessment for pressurized fuselages. § 91.1503 — [Reserved]",
    "textAfterTable": "DEPARTMENT OF TRANSPORTATION, Federal Aviation Administration Notice of policy statement. The moratorium will end on July 21, 2015. 14 CFR Parts 91 and 119 Summary With this document, the Federal Aviation Administration (FAA) cancels all previous agency policies pertaining to the carriage of passengers for compensation on Living History Flight Experience (LHFE) flights. This policy statement announces the end of FAA moratorium on new petitions for exemption, or amendments to exemptions from certain sections of Title 14, Code of Federal Regulations (14 CFR) for the purpose of carrying passengers for compensation or hire on LHFE Flights. 2015-07-16; vol. 80 # 136 - Thursday, July 16, 2015 80 FR 42021 - Stage 3 Compliance for Jets Weighing 75,000 Pounds or Less After December 31, 2015 GPO FDSys XML | Text Additional Documents type regulations.gov FR Doc.",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}