{
    "relation": [
        [
            "Categories",
            "Campus Safety",
            "Greek Life",
            "Clubs and Activities",
            "Great for these types of students",
            "Bang for the buck",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "I feel safe here. There are police on campus, and more active ones at night.",
            "There is a Greek Life, but it's not active. Most people look down upon sororities or fraternities. It's not worth it.",
            "Not very appealing clubs.",
            "Great for people who are more focused on school, rather than a social life. People that do not care for meeting people will be able to tolerate this university.",
            "Inexpensive because there's a reason to it.",
            "There's really not much to do around here for fun, unfortunately. The only good thing about Sacramento is its selection of sushi, and the beautiful view of the American River bike trail.",
            "There is a selection of fast food, but not enough healthy choices to make on campus.",
            "(never experienced living in the dorms) but I often visited some friends that lived in dorms. They are old, and they have a strange smell.",
            "Great professors, and great academic programs.",
            "Go here if you're interested in a major that Sacramento State's main focus is in. (Nursing, criminal justice, business)",
            "It's a very diverse school, and the campus has a lot of trees. Not the ideal campus for a true college experience if you're living at home, because there are mainly commuters."
        ]
    ],
    "pageTitle": "California State University-Sacramento Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/California-State-University-Sacramento/reviews?_escaped_fragment_=/show/47581",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 125,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988650.6/warc/CC-MAIN-20150728002308-00042-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 905865535,
    "recordOffset": 905696461,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{596077=Sacramento State was voted #1 Tree Campus USA in 2012 which is a cool fact and honor. The campus is filled with various beautiful trees and scenery., 992495=The dorm life is amazing!I had several friends that attended Sac State in 2008 so when I'd visit them I got to experience some of that life and it was extremely fun., 77556=The grass wasn't grass but mud, even in May. It smelled awful. It felt like a high school campus with lockers everywhere., 1001993=© 2015, Cappex.com, LLC, 668851=A nice campus that has a ton of resources for students to use. There's friendly staff and students. The food there are so good and during the start of Fall 2013 Sac State will be opening a Starbucks!, 858485=I really like the food that we are provided with. Many times the school will give us the same type of food but I go trying out all the food there is and it is actually really good. There are hamburgers, pizza, beans, rice, lasagna, pasta, steak, and many more. What I do not like about our Dining is that they close pretty early. During the weekdays it closes at 8:00PM and in the weekends around 6:00PM., 633998=I know that there is a lot of things offered, from the aquatic center to things at the WELL (the gym on campus) if you are into that type of stuff. Some clubs like the ballroom dancing club offer things as well. Then there is Unique and they bring different things on campus so the students can enjoy, like this March they had a Taiko group performing., 663458=If you stay in the dorms, you have a meal plan. The courtyard market has some good sandwiches and pizza. The dining commons has good food but you get tired of it easily. It's buffet style so it's easy to gain Freshman 15. Starbucks will be opening Fall 2013., 61903=I haven't experienced dorm life yet, but will be experiencing in 2013}",
    "textBeforeTable": "06/05/2009 Reviewer is Researching this school. Reviewer has been to campus. 16 out of 18 people found this review useful. 1 of 239 John from Los Gatos, CA Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new",
    "textAfterTable": "Tips for prospective students California State University-Sacramento is known for it's prestigious educational value and ability to bring out natural-born leaders in every student. From educational studies to extracurricular activities to clubs of every ethnicity and interest, Sac State has a little bit of something for everyone in attendance to create a welcoming and comfortable place to be when away from home. Am enjoying being here It is a very free and fun environment which makes it a comfortable environment to learn in. Am learning a lot Each professor takes the time out to ensure that you understand the concepts of what they are teahing you and will work with you until you do understand. Login to rate or flag the reviews Kristina from Sacramento, CA 01/20/2010 Reviewer is A current student here. 13 out of 15 people found this review useful. 4 of 239 Categories Comments Great for these types of students",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}