{
    "relation": [
        [
            "Options in-the-money",
            "Options requirements",
            "Cash covered put reserve",
            "Cash spread reserve"
        ],
        [
            "Options that have intrinsic value. A call option is considered “in-the-money” if the price of the underlying security is higher than the strike price of the call. A put option is considered “in-the-money” if the price of the security is lower than the strike price.",
            "Margin requirements for single or multi-leg option positions. Your positions, whenever possible, will be paired or grouped as strategies, which can reduce your margin requirements.",
            "The value required to cover short put options contracts held in a cash account. Cash covered put reserve is equal to the options strike price multiplied by the number of contracts purchased, multiplied by the number of shares per contract (usually 100). Cash available to buy securities, cash available to withdraw, and available to withdraw values will be reduced by this value.",
            "The requirement for spread positions held in a retirement account. For debit spreads, the requirement is full payment of the debit. For credit spreads, it’s the difference between the strike prices or maximum loss. A $2,000 minimum equity deposit is required in addition to the debit requirement, but can be counted toward the credit requirement."
        ],
        [
            "Real-time",
            "Intraday",
            "Intraday",
            "Overnight"
        ]
    ],
    "pageTitle": "Trading FAQs: Margin - Fidelity",
    "title": "",
    "url": "https://www.fidelity.com/trading/faqs-margin",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042985140.15/warc/CC-MAIN-20150728002305-00275-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 889439471,
    "recordOffset": 889407419,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Example of How Leverage Can Improve Your Return If you didn’t take advantage of the margin loan, you would have paid $10,000 in cash for the stock. Not only would you have tied up an additional $5,000, but you would have realized only a 10% return on your investment. The 10% difference in the return is the result of leveraging your assets.1 Example: Suppose you use $5,000 in cash and borrow $5,000 on margin to purchase a total of $10,000 in stock. If the stock rises in value to $11,000 and you sell it, you would pay back the $5,000 borrowed on margin and realize a profit of $1,000. That’s a 20% return on your $5,000 investment. Margin borrowing lets you leverage securities you already own to purchase additional securities. By leveraging your assets, you can potentially realize greater investment returns. How does margin work? UGMA/UTMA or retirement accounts CDs, money market funds, annuities, options, precious metals, and offshore mutual funds The following are not eligible for margin borrowing: Treasury, corporate, municipal, and government agency bonds Most mutual funds that have been held for at least 30 days Equities and ETFs trading over $3 a share (special requirements exist for certain securities and accounts) The following securities can be used as collateral for margin borrowing: What securities are eligible for margin?",
    "textAfterTable": "Sales proceeds $11,000 $11,000 Gain $1,000 $1,000 Cash provided $10,000 $5,000 Return on investment 10% 20% What are the risks associated with margin? Margin investing carries greater risks and may not be appropriate for every investor. Before you use margin, carefully review your investment objectives, financial resources, and risk tolerance to determine whether margin borrowing is appropriate for you. Leverage risk Leverage works as dramatically when stock prices fall as when they rise. For example, let’s say you use $5,000 in cash and borrow $5,000 on margin to purchase a total of $10,000 in stock. Suppose the market value of the stock you’ve purchased for $10,000 drops to $9,000. Your equity would fall to $4,000, which is the market value minus the loan balance of $5,000. In this instance, you could suffer a loss of 20% due to a 10% decrease in market value.1 Maintenance call risk If the securities you hold fall below the minimum maintenance requirement, your account may incur a margin call. Margin calls are due immediately. It’s smart to leave a cash cushion in your account to help reduce the likelihood of a margin call. Sometimes you may face higher maintenance minimums, especially when the securities you’re holding carry additional risks, such as concentration risk.",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}