{
    "relation": [
        [
            "Categories",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "In three sentences"
        ],
        [
            "Comments",
            "even just the few days i have spent with a few friends on the weekends, i found the food to be very good and with good variety. there are many food areas in the alumni center, including coffee, sushi, and salad bars. overall, food was very good, but the distance from dorms to the alumni center was more than i had hoped for.",
            "the dorms were the only unappealing aspect of marquette's campus life. they were small and didn't have air conditioning, which makes things very stuffy in the warmer months.",
            "as far as i can see, this university has a high academic rigor. the classes seem to be the perfect amount of challenging, something that will push you and improve academic abilities, while still being manageable.",
            "i thought that marquette university had a beautiful atmosphere, both environmental and communal. marquette has an incredible mission statement that should ensure academic success in any prospective student. overall, i found marquette to be a profound university to attend."
        ]
    ],
    "pageTitle": "Marquette University Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Marquette-University/reviews?_escaped_fragment_=/show/14967",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988650.6/warc/CC-MAIN-20150728002308-00082-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 908966523,
    "recordOffset": 908873162,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{263588=Food at MU is by far one if it's best aspects. There are no meal plans here, everyone can eat as much as they want! There are three regular dining halls: Straz, McCormmick, and Cobeen. Mashuda is a '50's diner themed hall and Schroeder is an Italian themed hall. The Union has a bunch of different things like a coffee shop, subs, sushi, Mexican, burgers, salad bar, and a bagel place. The only down side to the food is that McCormmick and Schroeder are the only dorms open past 6:30 PM., 464963=© 2015, Cappex.com, LLC, 238067=If you are thinking about Marquette, apply early, before Dec. 1st. If you are worried about paying for this school, work over the summer during high school, apply for private scholarships, and do well in high school (for a incoming freshman, 4-year scholarship offer from Marquette). If you did not attain a high GPA in high school, but do while during your first semester at Marquette, you may be able to ask them to increase your incoming freshman scholarship/grants. It will take time and effort to pay for this school (without any help from your parents) if you come from a low-income background, but if you are dedicated to working hard here, your efforts will be rewarded (trust me, I know)., 74434=The classes are tough but they are really informative. They challenge you to think critically as well as look past the basic information given and how you would apply that to your job. There are classes that everyone has to take like English 1001, Theology, Philosophy, and a science elective, but they are extremely helpful. Also, the teachers know that you would rather be anywhere but in class so they make their classes as interesting as possible and talk about current things that could relate to the topics you are talking about., 430330=Watch application dates and be patient. Very competetive selection process. When I applied, I was one of 22,000 students competing for 2000 spots. I had a 3.8 GPA and a 37 ACT and was weight-listed for the nursing program. I was eventually accepted., 371162=Tons of different choices and types of dining halls. You have traditional buffet styles, an Italian restaurant style, 50's dinner, 4 coffee shops, and a healthy dining hall. With the meal plan you have unlimited swipes for certain halls so you will never go hungry. The downsides would be that most halls close by 6 or 6:30 which is a bit early for the busy college kid.}",
    "textBeforeTable": "07/23/2009 Reviewer is A current student here. 26 out of 28 people found this review useful. 1 of 95 Allison from Ballwin, MO Check out reviews left by other students or leave your own review. You could win a free scholarship. Marquette University Reviews Marquette University › Wisconsin › By State › Colleges › } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.create', -->",
    "textAfterTable": "The quality of the education and professors at Marquette University is excellent. All of my professors last year were extremely knowledgeable and besides teaching the curriculum, they also taught life lessons and gave advice. Login to rate or flag the reviews Meaghan from Radcliff, KY 07/24/2009 Reviewer is A current student here. 11 out of 12 people found this review useful. 2 of 95 Categories Comments Great for these types of students Marquette is great for all types of students. Students who are social will certainly florish here, but so will students who normally keep to themselves. There are many opportunities for students who enjoy community service work as well because of the city setting. Marquette is not for a student wanting a closed campus, because we are in the middle of Milwaukee spreading from 10th down to about 19th Street. And even though the undergraduate level can be considered large, the class sizes are small and you are not just a number. Tips for prospective students",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}