{
    "relation": [
        [
            "Citing Patent",
            "US5200653 *",
            "US5270587 *",
            "US5294846 *",
            "US5399925 *",
            "US5424655 *",
            "US5469109 *",
            "US5477167 *",
            "US5654649 *",
            "US5682106 *",
            "US5886541 *",
            "US5892684 *",
            "US6084437 *",
            "US6191607 *",
            "US6194914",
            "US7075976",
            "WO1995004403A1 *",
            "WO1998006177A1 *"
        ],
        [
            "Filing date",
            "Jun 21, 1991",
            "Jan 6, 1992",
            "Aug 17, 1992",
            "Aug 2, 1993",
            "May 20, 1994",
            "Feb 9, 1995",
            "Jan 27, 1995",
            "Jul 12, 1995",
            "Sep 18, 1996",
            "Aug 5, 1996",
            "Jul 14, 1997",
            "Apr 27, 1998",
            "Sep 16, 1998",
            "Mar 12, 1999",
            "Mar 19, 2001",
            "Aug 2, 1994",
            "Aug 5, 1997"
        ],
        [
            "Publication date",
            "Apr 6, 1993",
            "Dec 14, 1993",
            "Mar 15, 1994",
            "Mar 21, 1995",
            "Jun 13, 1995",
            "Nov 21, 1995",
            "Dec 19, 1995",
            "Aug 5, 1997",
            "Oct 28, 1997",
            "Mar 23, 1999",
            "Apr 6, 1999",
            "Jul 4, 2000",
            "Feb 20, 2001",
            "Feb 27, 2001",
            "Jul 11, 2006",
            "Feb 9, 1995",
            "Feb 12, 1998"
        ],
        [
            "Applicant",
            "Sgs-Thomson Microelectronics S.R.L.",
            "Micron Technology, Inc.",
            "Paivinen John O",
            "Xilinx, Inc.",
            "Quicklogic Corporation",
            "Quicklogic Corporation",
            "Quicklogic Corporation",
            "Quicklogic Corporation",
            "Quicklogic Corporation",
            "Fujitsu Limited",
            "Quicklogic Corporation",
            "Kawasaki Steel Corporation",
            "Cypress Semiconductor Corporation",
            "Kawasaki Steel Corporation",
            "Cisco Technology, Inc.",
            "Xilinx Inc",
            "Hal Computer Systems Inc"
        ],
        [
            "Title",
            "Tristate output gate structure particularly for cmos integrated circuits",
            "CMOS logic cell for high-speed, zero-power programmable array logic devices",
            "Method and apparatus for programming anti-fuse devices",
            "High-speed tristate inverter",
            "Programmable application specific integrated circuit employing antifuses and methods therefor",
            "Method and apparatus for programming anti-fuse devices",
            "Programmable application specific integrated circuit using logic circuits to program antifuses therein",
            "Programmable application specific integrated circuit employing antifuses and methods therefor",
            "Logic module for field programmable gate array",
            "Combined logic gate and latch",
            "Programmable application specific integrated circuit employing antifuses and methods therefor",
            "Logic circuit utilizing pass transistors and logic gate",
            "Programmable bus hold circuit and method of using the same",
            "Semiconductor integrated circuit capable of realizing logic functions",
            "Tri-state transmitter",
            "High-speed tristate inverter",
            "Combined logic gate and latch"
        ]
    ],
    "pageTitle": "Patent US5027012 - Programmable logic circuit using wired-or tristate gates - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US5027012?dq=7,094,863",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 7,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988458.74/warc/CC-MAIN-20150728002308-00061-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 485986591,
    "recordOffset": 485961797,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Patent Citations Additional advantages and modifications will readily occur to those skilled in the art. Therefore, the invention in its broader aspects is not limited to the specific details and representative devices shown and described herein. Accordingly, various modifications may be made without departing from the spirit or scope of the general inventive concept as defined by the appended claims and their equivalents. Therefore, the user is only required to store the least number of types of logic ICs and the maker can simplify the production control. Further, according to this invention, a desired logic circuit having a large degree of symmetry can be realized by using a logic circuit having a 3-state output as a smallest unit and connecting the smallest units in a tree structure. Also, a multi-input logic gate complicated in construction can be easily obtained. Further, since it is only necessary to select one of the \"1\" level signal, \"0\" level signal, signal A, and signal A in order to program the input, the circuit programming can be easily effected and the programming implement can be made simple in construction. When memory cells are used to effect the programming operation, the number of memory cells can be significantly reduced and an easily programmable IC can be realized. As described above, according to this invention, a programmable logic circuit which is simple in construction and programming operation and in which the gate can be easily",
    "textAfterTable": "Van, T. et al., A General Modified Universal Logic Module, Proceedings of the IEEE, pp. 646 648, published May, 1974. * Cited by examiner Referenced by Citing Patent Filing date Publication date Applicant Title US5200653 * Jun 21, 1991 Apr 6, 1993 Sgs-Thomson Microelectronics S.R.L. Tristate output gate structure particularly for cmos integrated circuits US5270587 * Jan 6, 1992 Dec 14, 1993 Micron Technology, Inc. CMOS logic cell for high-speed, zero-power programmable array logic devices US5294846 * Aug 17, 1992 Mar 15, 1994 Paivinen John O Method and apparatus for programming anti-fuse devices US5399925 * Aug 2, 1993 Mar 21, 1995 Xilinx, Inc. High-speed tristate inverter US5424655 * May 20, 1994 Jun 13, 1995 Quicklogic Corporation Programmable application specific integrated circuit employing antifuses and methods therefor US5469109",
    "hasKeyColumn": true,
    "keyColumnIndex": 3,
    "headerRowIndex": 0
}