{
    "relation": [
        [
            "Date",
            "Jul 28, 1995",
            "Dec 2, 1997",
            "Jun 2, 2000",
            "Feb 13, 2001",
            "Mar 26, 2001",
            "Apr 27, 2004",
            "Jul 29, 2004",
            "May 17, 2006",
            "May 5, 2008",
            "Nov 20, 2009"
        ],
        [
            "Code",
            "AS",
            "CC",
            "FPAY",
            "AS",
            "AS",
            "FPAY",
            "AS",
            "AS",
            "FPAY",
            "AS"
        ],
        [
            "Event",
            "Assignment",
            "Certificate of correction",
            "Fee payment",
            "Assignment",
            "Assignment",
            "Fee payment",
            "Assignment",
            "Assignment",
            "Fee payment",
            "Assignment"
        ],
        [
            "Description",
            "Owner name: IMARX PHARMACEUTICAL CORP., ARIZONA Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNORS:UNGER, EVAN C.;FRITZ, THOMAS A.;MATSUNAGA, TERRY;AND OTHERS;REEL/FRAME:007569/0038 Effective date: 19950710",
            "",
            "Year of fee payment: 4",
            "",
            "",
            "Year of fee payment: 8",
            "",
            "Owner name: IMARX THERAPEUTICS, INC., ARIZONA Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNOR:IMARX PHARMACEUTICAL CORPORATION;REEL/FRAME:017626/0618 Effective date: 20060517",
            "Year of fee payment: 12",
            "Owner name: CEREVAST THERAPEUTICS, INC., WASHINGTON Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNOR:IMARX THERAPEUTICS, INC.;REEL/FRAME:023546/0614 Effective date: 20091120"
        ]
    ],
    "pageTitle": "Patent US5580575 - Therapeutic drug delivery systems - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US5580575?dq=%235,519,867",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 9,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988061.16/warc/CC-MAIN-20150728002308-00033-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 491894967,
    "recordOffset": 491809827,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{66536=Similarly, prodrugs may be encapsulated in the microspheres, and are included within the ambit of the term therapeutic, as used herein. Prodrugs are well known in the art and include inactive drug precursors which, when exposed to high temperature, metabolizing enzymes, cavitation and/or pressure, in the presence of oxygen or otherwise, or when released from the microspheres, will form active drugs. Such prodrugs can be activated in the method of the invention, upon the application of ultrasound to the prodrug-containing microspheres with the resultant cavitation, heating, pressure, and/or release from the microspheres. Suitable prodrugs will be apparent to those skilled in the art, and are described, for example, in Sinkula et al., J. Pharm. Sci. 1975 64, 181-210, the disclosure of which are hereby incorporated herein by reference in its entirety., 108222=The foregoing preferred method of the invention is preferably carried out at a temperature below the gel to liquid crystalline phase transition temperature of the lipid employed. By \"gel to liquid crystalline phase transition temperature\", it is meant the temperature at which a lipid bilayer will convert from a gel state to a liquid crystalline state. See, for example, Chap man et al., J. Biol. Chem. 1974 249, 2512-2521. The gel state to liquid crystalline state phase transition temperatures of various lipids will be readily apparent to those skilled in the art and are described, for example, in Gregoriadis, ed., Liposome Technology, Vol. I, 1-18 (CRC Press, 1984) and Derek Marsh, CRC Handbook of Lipid Bilayers (CRC Press, Boca Raton, Fla. 1990), at p. 139. See also Table I, above. Where the gel state to liquid crystalline state phase transition temperature of the lipid employed is higher than room temperature, the temperature of the container may be regulated, for example, by providing a cooling mechanism to cool the container holding the lipid solution., 161290=A cationic lipid, such as DOTMA is mixed as a 1:3 molar ratio with DPPC. The mixed material is dissolved in chloroform and the chloroform is removed by rotary evaporation. Water is added to the dried material and this mixture is then extruded through a 2 μm filter using an Extruder Device (Lipex Biomembranes, Inc., Vancouver, BC). Then positively charged gas-filled liposomes are prepared according to the procedure provided in U.S. Ser. No. 717,084, filed Jun. 18, 1991, which is hereby incorporated by reference in its entirety., 76492=Where the therapeutic encapsulated by the microspheres is negatively charged, such as genetic material, cationic lipids or perfluoroalkylated groups bearing cationic groups may be utilized to bind the negatively charged therapeutic. For example, cationic analogs of amphiphilic perfluoroalkylated bipyridines, as described in Garelli and Vierling, Biochim. Biophys Acta, 1992 1127, 41-48, the disclosures of which are hereby incorporated herein by reference in their entirety, may be used., 44731=At least in part, the gas impermeability of gas-filled liposomes has been found to be related to the gel state to liquid crystalline state phase transition temperature. By \"gel state to liquid crystalline state phase transition temperature\", it is meant the temperature at which a lipid bilayer will convert from a gel state to a liquid crystalline state. See, for example, Chapman et al., J. Biol. Chem. 1974 249, 2512-2521. It is believed that, generally, the higher gel state to liquid crystalline state phase transition temperature, the more gas impermeable the liposomes are at a given temperature. See Table I below and Derek Marsh, CRC Handbook of Lipid Bilayers (CRC Press, Boca Raton, Fla. 1990), at p. 139 for main chain melting transitions of saturated diacyl-sn-glycero-3-phosphocholines. However, it should also be noted that a lesser degree of energy can generally be used to release a therapeutic compound from gas-filled liposomes composed of lipids with a lower gel state to liquid crystalline state phase transition temperature., 163910=Liposomes composed of a 1:2 molar ratio of DOTMA and DPPC are prepared and coated with DNA encoding an HLA (major histocompatibility complex) gene, HLA-B7. The DNA-coated liposomes are injected intravenously into a patient with metastatic melanoma involving the soft tissues. Continuous wave 1.0 megahertz ultrasound energy is applied to the soft tissues so that the HLA-B7 DNA accumulates in the tumor. It is believed that some of the tumor cells would then transfected by the HLA-B7 gene, resulting in an immune response which may stimulate the patient's T cells to reject the tumor., 54170=If desired, a variety of cationic lipids such as DOTMA, N-[1-(2,3-dioleoyloxy)propyl]-N,N,N-trimethylammoium chloride; DOTAP, 1,2-dioleoyloxy-3-(trimethylammonio)propane; and DOTB, 1,2-dioleoyl-3-(4'-trimethyl-ammonio)butanoyl-sn-glycerol may be used. In general the molar ratio of cationic lipid to non-cationic lipid in the liposome may be, for example, 1:1000, 1:100, preferably, between 2:1 to 1:10, more preferably in the range between 1:1 to 1:2.5 and most preferably 1:1 (ratio of mole amount cationic lipid to mole amount non-cationic lipid, e.g., DPPC). A wide variety of lipids may comprise the non-cationic lipid when cationic lipid is used to construct the microsphere. Preferably, this non-cationic lipid is dipalmitoylphosphatidylcholine, dipalmitoylphosphatidylethanolamine or dioleoylphosphatidylethanolamine. In lieu of cationic lipids as described above, lipids bearing cationic polymers such as polylysine or polyarginine may also be used to construct the microspheres and afford binding of a negatively charged therapeutic, such as genetic material, to the outside of the microspheres., 96423=Table II shows the ranges of energies transmitted to tissues from diagnostic ultrasound on commonly used instruments such as the Piconics Inc. (Tyngsboro, Md.) Portascan general purpose scanner with receiver pulser 1966 Model 661; the Picker (Cleveland, Ohio) Echoview 8L Scanner including 80C System or the Medisonics (Mountain View, Calif.) Model D-9 Versatone Bidirectional Doppler. In general, these ranges of energies employed in pulse repetition are useful for monitoring the gas-filled microspheres but are insufficient to rupture the gas-filled microspheres of the present invention., 136879=For lipophilic drugs which are sparingly soluble in aqueous media, such drugs may be mixed with the lipids themselves prior to forming the liposomes. For example, amphotericin may be suspended with the dried lipids (e.g., 8:2 molar ratio of egg phosphatidylcholine and cholesterol in chloroform and mixed with the lipids). The chloroform is then evaporated (note that other suitable organic solvents may also be used, such as ethanol or ether) and the dried lipids containing a mixture of the lipophilic drug are then resuspended in aqueous media, e.g., sterile water or physiologic saline. This process may be used for a variety of lipophilic drugs such as corticosteroids to incorporate lipophilic drugs into the liposome membranes. The resulting liposomes are then dried, subjected to the vacuum gas instillation method as described above., 132915=Also unexpected is the ability of the liposomes during the vacuum drying gas instillation process to fill with gas and resume their original circular shape, rather than collapse into a cup-shaped structure, as the prior art would cause one to expect. See, e.g., Crowe et al., Archives of Biochemistry and Biophysics, Vol. 242, pp. 240-247 (1985); Crowe et al., Archives of Biochemistry and Biophysics, Vol. 220, pp. 477-484 (1983); Fukuda et al., J. Am. Chem. Soc., Vol. 108, pp. 2321-2327 (1986); Regen et al., J. Am. Chem. Soc., Vol. 102, pp. 6638-6640 (1980)., 148581=There are various other applications for liposomes of the invention, beyond those described in detail herein. Such additional uses, for example, include such applications as hyperthermia potentiators for ultrasound and as contrast agents for ultrasonic imaging. Such additional uses and other related subject matter are described and claimed in Applicant's patent applications, U.S. Ser. No. 716,793 and U.S. Ser. No. 717,084, both of which were filed Jun. 18, 1991, the disclosures of each of which are incorporated herein by reference in their entirety., 102558=Thus, a preferred method of the present invention provides for shaking an aqueous solution comprising a lipid and a therapeutic compound in the presence of a gas. Shaking, as used herein, is defined as a motion that agitates an aqueous solution such that gas is introduced from the local ambient environment into the aqueous solution. Any type of motion that agitates the aqueous solution and results in the introduction of gas may be used for the shaking. The shaking must be of sufficient force to allow the formation of foam after a period of time. Preferably, the shaking is of sufficient force such that foam is formed within a short period of time, such as 30 minutes, and preferably within 20 minutes, and more preferably, within 10 minutes. The shaking may be by swirling (such as by vortexing), side-to-side, or up and down motion. Further, different types of motion may be combined. Also, the shaking may occur by shaking the container holding the aqueous lipid solution, or by shaking the aqueous solution within the container without shaking the container itself. Further, the shaking may occur manually or by machine. Mechanical shakers that may be used include, for example, a shaker table such as a VWR Scientific (Cerritos, Calif.) shaker table and a mechanical paint mixer, as well as other known machines. Another means for producing shaking includes the action of gas emitted under high velocity or pressure. It will also be understood that preferably, with a larger volume of aqueous solution, the total amount of force will be correspondingly increased. Vigorous shaking is defined as at least about 60 shaking motions per minute, and is preferred. Vortexing at at least 1000 revolutions per minute, an example of vigorous shaking, is more preferred. Vortexing at 1800 revolutions per minute is most preferred., 134425=Liposomes may be prepared prior to gas installation using any one of a variety of conventional liposome preparatory techniques which will be apparent to those skilled in the art. These techniques include freeze-thaw, as well as techniques such as sonication, chelate dialysis, homogenization, solvent infusion, microemulsification, spontaneous formation, solvent vaporization, French pressure cell technique, controlled detergent dialysis, and others, each involving preparing the liposomes in various fashions in a solution containing the desired therapeutic so that the therapeutic is encapsulated in, enmeshed in, or attached the resultant liposome. Alternatively, therapeutics may be loaded into the liposomes using pH gradient techniques which, as those skilled in the art will recognize, is particularly applicable to therapeutics which either proteinate or deproteinate at a particular pH. See, e.g., Madden et al., Chemistry and Physics of Lipids, 1990 53, 37-46, the disclosures of which are hereby incorporated herein by reference in their entirety., 150934=Gas-filled liposomes were synthesized as follows: Pure dipalmitoylphosphatidylcholine (DPPC), Avanti Polar Lipids, Alabaster, Ala., was suspended in normal saline and then Extruded five times through 2 micron polycarbonate filters (Nuclepore, Costar, Pleasanton, Calif.) using an Extruder Device (Lipex Biomembranes, Vancouver, Canada) at 800 p.s.i. The resulting liposomes were then dried under reduced pressure as described in U.S. Ser. No. 716,899, filed Jun. 18, 1991, which is hereby incorporated by reference in its entirety. After thorough drying the dried liposomes were then slowly filled with nitrogen gas, as described in U.S. Ser. No. 716,899. After equilibration with ambient pressure, the resulting liposomes were suspended in saline solution (0.9% NaCl) and shaken vigorously., 26477=This application is a continuation-in-part of applications U.S. Ser. Nos. 716,899, now abandoned and 717,084, now U.S. Pat. No. 5,228,446 each filed Jun. 18, 1991, which in turn are continuation-in-parts of U.S. Serial No. 569,828, filed Aug. 20, 1990, now U.S. Pat. No. 5,888,099 which in turn is a continuation-in-part of application U.S. Ser. No. 455,707, filed Dec. 22, 1989, now abandoned the disclosures of each of which are hereby incorporated herein by reference in their entirety., 109323=Conventional, aqueous-filled liposomes are routinely formed at a temperature above the gel to liquid crystalline phase transition temperature of the lipid, since they are more flexible and thus useful in biological systems in the liquid crystalline state. See, for example, Szoka and Papahadjopoulos, Proc. Natl. Acad. Sci. 1978 75, 4194-4198. In contrast, the liposomes made according to preferred embodiments of the methods of the present invention are gas-filled, which imparts greater flexibility since gas is more compressible and compliant than an aqueous solution. Thus, the gas-filled liposomes may be utilized in biological systems when formed at a temperature below the phase transition temperature of the lipid, even though the gel phase is more rigid., 155027=Solutions of gas-filled liposomes were also subjected to continuous wave ultrasound energy (Table IV) applied with a Rich-Mar Therapeutic ultrasound apparatus model RM-25 (Rich-Mar Corp., Inola, Okla.). Table IV demonstrates the power produced using continuous wave ultrasound. It was found that continuous wave energy of sound caused the gas inside the gas-filled liposomes to escape from the liposomes, thus rupturing the liposomes. It took approximately 20-30 minutes to completely destroy the gas-filled liposomes in a solution of saline at 5 watts of power and at 1 MHz. It took approximately 5 minutes to destroy the gas-filled liposomes at 10 watts and at 1 MHz. When the gas-filled liposomes were examined by light microscopy before and after application of high energy ultrasound the spherical shape of the gas-filled liposomes disappeared after exposure., 184775=This example determined whether sonication could be used to create gas-filled liposomes. 50 mg of lipid, 1,2-Dipalmitoyl-Sn-Glycero-3-Phosphocholine (Avanti-Polar Lipids, Alabaster, Ala.), was weighed out and hydrated with 5 ml of 0.9% NaCl. Instead of vortexing, the aqueous solution was sonicated using a Heat Systems Sonicator Ultrasonic Processor XL (Heat Systems, Inc., Farmingdale, N.Y.) Model XL 2020. The sonicator, with a frequency of 20 KHz, was set to continuous wave, at position 4 on the knob of the sonicator. A micro tip was used to sonicate for 10 minutes. Following sonication, the solution was viewed under an optical microscope. There was no evidence of gas-filled liposomes having been produced., 165529=The CFTR (Cystic Fibrosis transmembrane conductance regulator) gene on a YAC expression vector is entrapped within a micellar formulation of microspheres entrapping argon gas bearing cationic lipids in a 1:1 molar composition with DPPC. The microspheres are injected i.v. into a patient with Cystic Fibrosis and sonic energy is applied to the affected tissues (e.g., lungs, pancreas, etc.). Patients may show a reduction in mucus accumulation in the lungs and improved functioning of the other affected organs., 31842=The gas-filled liposomes are particularly useful as drug carriers. Unlike liposomes of the prior art that have a liquid interior suitable only for encapsulating drugs that are water soluble, the gas-filled liposomes made according to the present invention are particularly useful for encapsulating lipophilic drugs. Furthermore, lipophilic derivatives of drugs may be incorporated into the lipid layer readily, such as alkylated derivatives of metallocene dihalides. Kuo et al., J. Am. Chem. Soc. 1991 113, 9027-9045.}",
    "textBeforeTable": "Patent Citations Various modifications of the invention in addition to those shown and described herein will be apparent to those skilled in the art from the foregoing description. Such modifications are also intended to fall within the scope of the appended claims. The resultant gas-filled liposomes were sized by four different methods to determine their size distribution. Sizing was performed on a Particle Sizing Systems (Santa Barbara, Calif.) Model 770 Optical Sizing unit, and a Zeiss (Oberkochen, Germany) Axioplan optical microscope interfaced to image processing software (Universal Imaging, West Chester, Pa.) and a Coulter Counter (Coulter Electronics Limited, Luton, Beds., England). As illustrated in FIG. 18A and 18B, the size of the gas-filled liposomes was more uniformly distributed around 8-10 μm as compared to the unfiltered gas-filled liposomes. Gas-filled liposomes were produced from DPPC as described in Example 32. The resultant unfiltered liposomes were drawn into a 50 ml syringe and passed through a cascade filter system consisting of a \"NUCLEPORE\" (Costar, Pleasanton, Calif.) 10 μm filter followed by an 8 μm filter spaced a minimum of 150 μm apart. In addition, on a separate sample, a stacked 10 μm and 8 μm filtration assembly was used, with the two filters adjacent to one another. Gas-filled liposomes were passed through the filters at a pressure such that they were filtered a rate of 2.0 ml/min. The filtered gas-filled liposomes yielded a volume of 80-90% of the unfiltered volume.",
    "textAfterTable": "Apr 17, 1984 Schering, Ag Microbubble precursors and methods for their production and use US4466442 * Oct 13, 1982 Aug 21, 1984 Schering Aktiengesellschaft Carrier liquid solutions for the production of gas microbubbles, preparation thereof, and use thereof as contrast medium for ultrasonic diagnostics US4533254 * Feb 21, 1984 Aug 6, 1985 Biotechnology Development Corporation Apparatus for forming emulsions US4534899 * Mar 7, 1983 Aug 13, 1985 Lipid Specialties, Inc. Synthetic phospholipid compounds US4544545 * Jun 20, 1983 Oct 1, 1985 Trustees University Of Massachusetts Liposomes containing modified cholesterol for organ targeting US4569836 * May 24, 1983 Feb 11, 1986 Gordon Robert T Cancer treatment by intracellular hyperthermia US4572203 * Jan 27, 1983 Feb 25, 1986 Feinstein Steven B Contact agents for ultrasonic imaging US4586512 * Mar 27, 1985",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}