{
    "relation": [
        [
            "Date",
            "Sep 9, 1992",
            "Mar 4, 1997",
            "Apr 12, 2001",
            "Nov 4, 2003",
            "May 18, 2005",
            "Oct 19, 2005",
            "Nov 2, 2005",
            "Dec 27, 2005"
        ],
        [
            "Code",
            "AS",
            "FPAY",
            "FPAY",
            "AS",
            "REMI",
            "AS",
            "LAPS",
            "FP"
        ],
        [
            "Event",
            "Assignment",
            "Fee payment",
            "Fee payment",
            "Assignment",
            "Maintenance fee reminder mailed",
            "Assignment",
            "Lapse for failure to pay maintenance fees",
            "Expired due to failure to pay maintenance fee"
        ],
        [
            "Description",
            "Owner name: NEC CORPORATION, JAPAN Free format text: ASSIGNMENT OF ASSIGNORS INTEREST.;ASSIGNORS:FURUI, SEIJI;MANIWA, RYO;ISHIDO, KIMINORI;AND OTHERS;REEL/FRAME:006265/0596 Effective date: 19920903",
            "Year of fee payment: 4",
            "Year of fee payment: 8",
            "",
            "",
            "Owner name: NEC TOPPAN CIRCUIT SOLUTIONS, INC., JAPAN Free format text: RE-RECORD TO CORRECT THE ADDRESS OF THE ASSIGNEE, PREVIOUSLY RECORDED ON REEL 014653 FRAME 0206.;ASSIGNOR:NEC CORPORATION;REEL/FRAME:016902/0876 Effective date: 20021001",
            "",
            "Effective date: 20051102"
        ]
    ],
    "pageTitle": "Patent US5258094 - Method for producing multilayer printed wiring boards - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US5258094?dq=inventor:%22Arthur+R.+Hair%22&ei=VAy0Tsa4NYTl0QGQiqWiBA",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 8,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988458.74/warc/CC-MAIN-20150728002308-00048-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 474984831,
    "recordOffset": 474956275,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{37234=(4) The entire surface of the 6th conductive layer 66 and desired portions for forming circuit patterns on the 5th conductive layer 65 are covered with a photosensitive dry film resist 7 (FIG. 10A), for instance, RISTON (trade mark) dry film ™1220 (solvent type) or ™4220 (aqueous type) available from Dupont Company (25 μm to 50 μm in thickness) according to the known tenting method, followed by development with a developer such as 1,1,1-trichloroethane (for solvent type) or sodium carbonate (for aqueous type), etching and peeling off or delaminating of the resist to form circuit patterns on the 5th conductive layer 65 and copper foil layer 25 (FIG. 10B).}",
    "textBeforeTable": "Patent Citations As has been discussed above in detail, in the method of the present invention, electrical connections between the conductive layer of the upper-most layer and the inner conductive layers, between the inner conductive layers and between the lower-most conductive layer and the inner conductive layers can be achieved through the use of photoviaholes and a conductive paste. Therefore, it is not necessary to form through-holes for the electrical connection therebetween. Thus, the present invention makes it possible to increase the degree of freedom in designing the arrangement of the circuit patterns for the inner conductive layers and accordingly multilayer printed wiring boards can be substantially improved in the degree of lamination and wiring density as compared with the conventional multilayer printed wiring boards. (3) Multilayered boards 14 and 15 are assembled through a prepeg layer 52, firmly adhered to one another through application of heat and pressure and the upper-most and lower-most layers are electrically connected to complete a multilayer printed wiring board of the second embodiment. (2) Another multilayered board 14 is separately prepared in the similar manner used in the above (1). (1) Photoviaholes 42 are formed on lands 6 of via holes 41 in the similar manner used in the first embodiment to give a multilayered board 15. Then a conductive paste 5 is applied onto positions corresponding to photoviaholes 42. A second embodiment of the present invention will now be explained in",
    "textAfterTable": "US6175087 Dec 2, 1998 Jan 16, 2001 International Business Machines Corporation Composite laminate circuit structure and method of forming the same US6274927 Jun 3, 1999 Aug 14, 2001 Amkor Technology, Inc. Plastic package for an optical integrated circuit device and method of making US6281568 Oct 21, 1998 Aug 28, 2001 Amkor Technology, Inc. Plastic integrated circuit device package and leadframe having partially undercut leads and die pad US6291778 Jun 6, 1996 Sep 18, 2001 Ibiden, Co., Ltd. Printed circuit boards US6303880 Sep 11, 1998 Oct 16, 2001 Ibiden Co., Ltd. Printed circuit boards US6320251 Jan 18, 2000 Nov 20, 2001 Amkor Technology, Inc. Stackable package for an integrated circuit US6404046 Feb 3, 2000 Jun 11, 2002 Amkor Technology, Inc. Module of stacked integrated circuit packages including an interposer US6420204 Apr 20, 2001 Jul 16, 2002 Amkor Technology, Inc. Method of making a plastic package for an",
    "hasKeyColumn": true,
    "keyColumnIndex": 2,
    "headerRowIndex": 0
}