{
    "relation": [
        [
            "Date",
            "Dec 2, 2010",
            "Dec 16, 2010",
            "Dec 21, 2010",
            "Jan 19, 2011",
            "Aug 29, 2014",
            "Aug 29, 2014"
        ],
        [
            "Code",
            "AS",
            "AS",
            "AS",
            "AS",
            "SULP",
            "FPAY"
        ],
        [
            "Event",
            "Assignment",
            "Assignment",
            "Assignment",
            "Assignment",
            "Surcharge for late payment",
            "Fee payment"
        ],
        [
            "Description",
            "Owner name: FRANANO, F. NICHOLAS, MISSOURI Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNOR:JOHNS HOPKINS UNIVERSITY;REEL/FRAME:025438/0870 Effective date: 20030825 Effective date: 20010416 Owner name: JOHNS HOPKINS UNIVERSITY, MARYLAND Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNOR:FRANANO, NICHOLAS;REEL/FRAME:025438/0832 Effective date: 20060327 Free format text: MERGER;ASSIGNOR:PROTEON THERAPEUTICS LLC;REEL/FRAME:025445/0408 Owner name: PROTEON THERAPEUTICS, INC., MISSOURI Effective date: 20090918 Owner name: FRANANO, F. NICHOLAS, MD, MISSOURI Free format text: INVENTOR WAIVER REQUEST DECISION;ASSIGNOR:NATIONAL INSTITUTES OF HEALTH;REEL/FRAME:025438/0084 Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNOR:FRANANO, F. NICHOLAS;REEL/FRAME:025445/0254 Effective date: 20030919 Owner name: PROTEON THERAPEUTICS LLC, MISSOURI",
            "Owner name: PROTEON THERAPEUTICS INC., MASSACHUSETTS Effective date: 20101001 Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNOR:NATIONAL INSTITUTES OF HEALTH;REEL/FRAME:025783/0143",
            "Owner name: NATIONAL INSTITUTES OF HEALTH (NIH), U.S. DEPT. OF Free format text: CONFIRMATORY LICENSE;ASSIGNOR:PROTEON THERAPEUTICS, INC.;REEL/FRAME:025528/0617 Effective date: 20101217",
            "Free format text: QUITCLAIM DEED;ASSIGNOR:FRANANO, F. NICHOLAS;REEL/FRAME:025663/0217 Owner name: PROTEON THERAPEUTICS, INC., MASSACHUSETTS Effective date: 20110117",
            "",
            "Year of fee payment: 4"
        ]
    ],
    "pageTitle": "Patent US7883699 - Methods for enlarging the lumen of an obstructed biological conduit - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US7883699?dq=4316055",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 9,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438043062723.96/warc/CC-MAIN-20150728002422-00186-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 472534567,
    "recordOffset": 472497983,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{23041=This application is a continuation of U.S. application Ser. No. 12/082,517, filed Apr. 10, 2008, now U.S. Pat. No. 7,632,494 which is a continuation of U.S. application Ser. No. 11/454,405, filed Jun. 16, 2006 (U.S. Pat. No. 7,361,335), which is a continuation of U.S. application Ser. No. 09/669,051, filed Sep. 24, 2000 (U.S. Pat. No. 7,063,838), which claims the benefit of U.S. Provisional Application Ser. No. 60/155,938, filed Sep. 24, 1999, each of which is incorporated by reference herein in its entirety., 32014=During normal tissue growth and remodeling, existing collagen matrices must be removed or modified. This collagen remodeling is carried out by macrophages and fibroblasts, two cell types which secrete a distinct class of proteases called “collagenases” (Swedberg, Circulation (1989) 80:1726-36; Trerotola, J. Vascular and Interventional Radiology (1995) 6:387-96; Hirai, ACTA Radiologica (1996) 37:229-33). These collagenases rapidly degrade insoluble collagen fibrils to small, soluble peptide fragments, which are carried away from the site by the flow of blood and lymph., 29790=The most frequent cause of hemodialysis graft failure is thrombosis, which is often due to development of a stenosis in the vein just downstream from the graft-vein anastomosis (Safa, Radiology (1996) 199:653-7. Histologic analysis of the stenosis reveals a firm, pale, relatively homogeneous lesion interposed between the intimal and medial layers of the vein which thickens the vessel wall and narrows the lumen (Swedberg, Circulation (1989) 80:1726-36). This lesion, which has been given the name intimal hyperplasia is composed of vascular smooth muscle cells surrounded by an extensive extracellular collagen matrix (Swedberg, Circulation (1989) 80:1726-36; Trerotola, J. Vascular and Interventional Radiology (1995) 6:387-96). Balloon angioplasty is the most common initial treatment for stenosis of hemodialysis grafts and yields excellent initial patency results (Safa, Radiology (1996) 199:653-7). However, this purely mechanical method of stretching open the stenosis causes an injury which induces another round of cell proliferation, cell migration toward the lumen and synthesis of more extracellular matrix. Consequently, balloon angioplasty is associated with restenosis in nearly all patients (Safa, Radiology (1996) 199:653-7). There is currently no treatment which can sustain the patency of synthetic arteriovenous hemodialysis grafts over the long term., 52341=Preferable doses and concentrations of enzyme solution are between 1000 and 20000 ABC units, more preferable are between 2500 and 10000 ABC units and enzyme doses of 5,000 ABC units in 0.5 ml of buffer are most preferred., 29076=Nearly all hemodialysis grafts fail, usually within two years, and a new graft must be created surgically to maintain hemodialysis. These patients face repeated interruption of hemodialysis, and multiple hospitalizations for radiological and surgical procedures. Since each surgical graft revision consumes more available vein, eventually they are at risk for mortality from lack of sites for hemodialysis access. One estimate placed the cost of graft placement, hemodialysis, treatment of complications, placement of venous catheters, hospitalization costs, and time away from work at as much as $500 million, in 1990 alone (Windus, Am. J Kidney Diseases (1993) 21:457-71)., 28245=Patients with chronic, end-stage renal failure may require replacement of their kidney function in order to survive. In the United States, long-term hemodialysis is the most common treatment method for end stage chronic renal failure. In 1993, more than 130,000 patients underwent long term hemodialysis (Gaylord, J. Vascular and Interventional Radiology (1993) 4:103-7); more than 80% of these patients implement hemodialysis through the use of a synthetic arteriovenous graft (Windus, Am. J. Kidney Diseases (1993) 21:457-71). In a majority of these patients, the graft consists of a 6 mm Gore-Tex tube that is surgically implanted between an artery and a vein, usually in the forearm or upper arm. This high flow conduit can then be accessed with needles for hemodialysis sessions.}",
    "textBeforeTable": "Patent Citations The invention has been described in detail with reference to preferred embodiments thereof. However, it will be appreciated that those skilled in the art, upon consideration of this disclosure, may make modifications and improvements within the spirit and scope of the invention as set forth in the following claims. Four dogs are used for a controlled study of collagenase treatment. Bilateral grafts are created as described previously and standard, cut-film angiography is performed one week after surgery to access the arterial inflow, the artery-graft anastomosis, the vein-graft anastomosis, and the venous outflow. After this, routine physical examination of the grafts is carried out to screen for patency. Then, twenty weeks after surgery, standard, cut-film angiography is performed to assess the lumenal diameter of the grafts and their venous outflow. An obvious stenosis due to intimal hyperplasia is usually seen in the venous outflow with an associated pressure gradient (Trerotola, J. Vascular and Interventional Radiology (1995) 6:387-96). The Infiltrator catheter is then deployed within the lesion and the selected dose of collagenase is infiltrated into the wall of the lesion. The contralateral, control graft is treated in an identical manner, except that saline is delivered instead of collagenase. Three days after treatment, the grafts are restudied with angiography and invasive pressure measurements to determine the acute effects of collagenase treatment. Changes in lumenal diameter and pressure gradients are calculated for both the collagenase-treated group and",
    "textAfterTable": "Apr 22, 2008 Proteon Therapeutics, Inc. Methods for using an elastase US7632494 * Apr 10, 2008 Dec 15, 2009 Proteon Therapeutics, Inc. Methods for enlarging the diameter of a biological conduit in a human subject WO1996018725A1 Dec 13, 1994 Jun 20, 1996 John M Greene Human tissue inhibitor of metalloproteinase-4 * Cited by examiner Non-Patent Citations Reference 1 Abbruzzese, T. et al., Surgery, 124:328-335 (1998). 2 * Al-Haik et al. 1984. Neutral protease, collagenase and elastase activities in synovial fluids from arthritic patients. Agents and Actions, vol. 15, Nos. 3-4, pp. 436-442. 3 Altes et al., AJR. 174:349-354 (Feb. 2000). 4 Anidjar, S. et al., Ann. Vase. Surg., 8(2):127-136 (1994). 5 Anidjar, S. et al., Circulation 82(3):973-981 (1990). 6 Anidjar, S. et al., Journal of Vascular Surgery, 16(2):139-147 (1992).",
    "hasKeyColumn": true,
    "keyColumnIndex": 2,
    "headerRowIndex": 0
}