{
    "relation": [
        [
            "Citing Patent",
            "US7154094 *",
            "US8686542",
            "US8791530",
            "US8805136 *",
            "US8817267",
            "US8945968",
            "US9000566",
            "US9030743 *",
            "US20110222157 *",
            "US20110228397 *",
            "US20110255166 *",
            "WO2013169545A1 *"
        ],
        [
            "Filing date",
            "Dec 9, 2004",
            "Mar 14, 2013",
            "Sep 6, 2012",
            "May 8, 2006",
            "Aug 17, 2011",
            "Jun 23, 2014",
            "Feb 5, 2014",
            "Mar 2, 2011",
            "",
            "",
            "",
            "May 1, 2013"
        ],
        [
            "Publication date",
            "Dec 26, 2006",
            "Apr 1, 2014",
            "Jul 29, 2014",
            "Aug 12, 2014",
            "Aug 26, 2014",
            "Feb 3, 2015",
            "Apr 7, 2015",
            "May 12, 2015",
            "Sep 15, 2011",
            "Sep 22, 2011",
            "Oct 20, 2011",
            "Nov 14, 2013"
        ],
        [
            "Applicant",
            "Denso Corporation",
            "LuxVue Technology Corporation",
            "LuxVue Technology Corporation",
            "Photonics On-Fiber Devices, Inc.",
            "Seiko Epson Corporation",
            "LuxVue Technology Corporation",
            "LuxVue Technology Corporation",
            "Seiko Epson Corporation",
            "Seiko Epson Corporation",
            "Seiko Epson Corporation",
            "Seiko Epson Corporation",
            "LuxVue Technology Corporation"
        ],
        [
            "Title",
            "Fabri-Perot filter",
            "Compliant monopolar micro device transfer head with silicon electrode",
            "Compliant micro device transfer head with integrated electrode leads",
            "On-fiber tunable Bragg gratings for DWDM applications",
            "Optical filter, optical filter module, spectrometric instrument, and optical instrument",
            "Compliant micro device transfer head with integrated electrode leads",
            "Compliant micro device transfer head",
            "Optical filter including ring-shaped electrode having a slit",
            "Optical filter, optical filter module, analytical instrument, and optical apparatus",
            "Light filter and analytical instrument and optical equipment using the same",
            "Optical filter device, optical filter module and analysis apparatus",
            "Compliant micro device transfer head"
        ]
    ],
    "pageTitle": "Patent US6813291 - Tunable fabry-perot filter and tunable vertical cavity surface emitting laser - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US6813291?dq=5497704",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 7,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042981969.11/warc/CC-MAIN-20150728002301-00292-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 472712815,
    "recordOffset": 472692832,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{28164=This is a continuation-in-part of pending prior U.S. patent application Ser. No. 09/750,434, filed Dec. 28, 2000 by Peidong Wang et al. for TUNABLE FABRY-PEROT FILTER AND TUNABLE VERTICAL CAVITY SURFACE EMITTING LASER, which is in turn a continuation-in-part of U.S. patent application Ser. No. 09/105,399, filed Jun. 26, 1998, now U.S. Pat. No. 6,438,149, by Parviz Tayebati et al. for MICROELECTROMECHANICALLY TUNABLE, CONFOCAL, VERTICAL CAVITY SURFACE EMITTING LASER AND FABRY-PEROT FILTER.}",
    "textBeforeTable": "Patent Citations It will be understood that the foregoing detailed description of the preferred embodiments of the invention has been presented by way of illustration and not limitation. Various modifications, variations, changes, adaptations and the like will occur to those skilled in the art in view of the foregoing specification. Accordingly, the present invention should be understood as being limited only by the terms of the claims. Looking next at FIGS. 14 and 15, there is shown another alternative construction for increasing the tuning range of a tunable Fabry-Perot filter and tunable VCSEL. In essence, this construction modifies the geometry of the bias electrodes while maintaining the spacing between the functional optical elements. More particularly, the geometries of top electrode 30 and bottom electrode 20 are modified so as to comprise interdigitized fingers while keeping the spacing between top mirror 40 and bottom mirror 15 substantially the same. This construction means that the pulling force is effectively independent of the tuning distance so long as the degree of finger interdigitation is reasonable. Electrode fingers can be created by forming top electrode 30 and bottom electrode 20 so as a series of concentric circles in the manner shown in FIGS. 14 and 15, or as a series of parallel plates in the manner shown in FIGS. 16 and 17, or as a plurality of interspaced posts in the manner shown in FIGS. 18 and 19, etc. With the alternative",
    "textAfterTable": "US5629951 Oct 13, 1995 May 13, 1997 Chang-Hasnain; Constance J. Electrostatically-controlled cantilever apparatus for continuous tuning of the resonance wavelength of a fabry-perot cavity US5646729 Dec 18, 1995 Jul 8, 1997 Vaisala Oy Single-channel gas concentration measurement method and apparatus using a short-resonator Fabry-Perot interferometer US5739945 * Sep 27, 1996 Apr 14, 1998 Tayebati; Parviz Electrically tunable optical filter utilizing a deformable multi-layer mirror US5771253 Jan 29, 1997 Jun 23, 1998 The Board Of Trustees Of The Leland Stanford Junior University High performance micromechanical tunable verticle cavity surface emitting laser US5818862 Dec 26, 1996 Oct 6, 1998 Alcatel Alsthom Compagnie Generale D'electricite Surface emitting semiconductor laser US5825796 Sep 25, 1996 Oct 20, 1998 Picolight Incorporated Extended wavelength strained layer lasers having strain compensated layers US5879961 Jun 25, 1996 Mar 9, 1999 Optical Concepts, Inc. Method for increasing laser efficiency in a vertical-cavity surface emitting laser US5949801 Jul 22, 1998",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}