{
    "relation": [
        [
            "Date",
            "Feb 23, 1998",
            "Mar 27, 1998",
            "Oct 19, 2000",
            "Jan 18, 2002",
            "Feb 23, 2006",
            "May 23, 2006",
            "Nov 10, 2010",
            "Nov 30, 2010",
            "Nov 1, 2013"
        ],
        [
            "Code",
            "FPAY",
            "AS",
            "AS",
            "FPAY",
            "FPAY",
            "AS",
            "AS",
            "AS",
            "AS"
        ],
        [
            "Event",
            "Fee payment",
            "Assignment",
            "Assignment",
            "Fee payment",
            "Fee payment",
            "Assignment",
            "Assignment",
            "Assignment",
            "Assignment"
        ],
        [
            "Description",
            "Year of fee payment: 4",
            "Owner name: CABLETRON SYSTEMS, INC., NEW HAMPSHIRE Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNOR:DIGITAL EQUIPMENT CORPORATION;REEL/FRAME:009046/0792 Effective date: 19980206",
            "",
            "Year of fee payment: 8",
            "Year of fee payment: 12",
            "Owner name: OBSIDIAN, LLC, CALIFORNIA Free format text: SECURITY AGREEMENT;ASSIGNOR:ENTERASYS NETWORKS, INC.;REEL/FRAME:017656/0552 Effective date: 20060516 Owner name: WELLS FARGO FOOTHILL, INC., CALIFORNIA Free format text: SECURITY AGREEMENT;ASSIGNOR:ENTERASYS NETWORKS, INC.;REEL/FRAME:017656/0552 Effective date: 20060516",
            "Owner name: WELLS FARGO TRUST CORPORATION LIMITED, AS SECURITY Free format text: GRANT OF SECURITY INTEREST IN U.S. PATENTS;ASSIGNOR:ENTERASYS NETWORKS INC.;REEL/FRAME:025339/0875 Effective date: 20101109",
            "Owner name: ENTERASYS NETWORKS, INC., MASSACHUSETTS Free format text: RELEASE AND REASSIGNMENT OF PATENTS AND PATENT APPLICATIONS AT REEL/FRAME NO. 17656/0552;ASSIGNORS:WELLS FARGO CAPITAL FINANCE, INC. (FORMERLY KNOWN AS WELLS FARGO FOOTHILL, INC.);ENTERPRISE COMMUNICATIONS FUNDING GMBH, AS SUCCESSOR IN INTEREST TO OBSIDIAN, LLC;REEL/FRAME:025406/0769 Effective date: 20101110",
            "Owner name: ENTERASYS NETWORKS INC., MASSACHUSETTS Free format text: TERMINATION AND RELEASE OF SECURITY INTEREST IN PATENTS AT REEL/FRAME NO. 25339/0875;ASSIGNOR:WELLSFARGO TRUST CORPORATION LIMITED;REEL/FRAME:031558/0677 Effective date: 20131031"
        ]
    ],
    "pageTitle": "Patent US5341405 - Data recovery apparatus and methods - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US5341405?dq=7245279",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 9,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042991019.80/warc/CC-MAIN-20150728002311-00022-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 469629931,
    "recordOffset": 469599785,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{21361=This application is a continuation of application Ser. No. 07/713,320, filed Jun. 11, 1991, which is abandoned.}",
    "textBeforeTable": "Patent Citations The foregoing description of the preferred embodiments and examples of the invention have been presented for purposes of illustration and description. It is not intended to be exhaustive or to limit the invention to the precise form disclosed, and modifications and variations are possible in light of the above teachings or may be acquired from practice of the invention. The embodiments were chosen and described in order to explain the principles of the invention and its practical application to enable one skilled in the art to utilize the invention in various embodiments and with various modifications as are suited to the particular use contemplated. It is intended that the scope of the invention be defined by the claims appended hereto, and their equivalents. While the adjustment of the phase of the clock signal VCO-CLK has been described herein as being effected by the adjustment of the magnitude of the control signal VCO-CS, other means are known in the art for effecting such phase adjustment of a clock signal and the present invention can be successfully practiced with such other means. While embodiments have been illustrated and described for the recovery of data from two-conductor transmission lines, the present invention is readily applicable to the recovery of data received on other forms of transmission paths such as radio propagation paths or paths in an integrated or optical circuit. While a particular construction of a phase comparator circuit",
    "textAfterTable": "Quotient phase-shift processor for digital phase-locked-loops US4932073 * Jan 19, 1989 Jun 5, 1990 Nec Corporation Transmitter having PLL circuit US5097489 * May 19, 1989 Mar 17, 1992 Tucci Patrick A Method for incorporating window strobe in a data synchronizer EP0213641A2 * Sep 4, 1986 Mar 11, 1987 Fujitsu Limited Delay time adjusting method, circuit, and system * Cited by examiner Non-Patent Citations Reference 1 \"A 100 Mb/s Clock Recovery and Data Retiming Chip Set\" by Kolluri et al. 2 \"Special Report-FDDI,\" Lightwave, Feb. 1991, pp. 32-34, 36, 37, 40, and 42-45. 3 * A 100 Mb/s Clock Recovery and Data Retiming Chip Set by Kolluri et al. 4 * Product Specification for NE/SA5068 Circuit, Philips Components, 1989. 5",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}