{
    "relation": [
        [
            "Cited Patent",
            "US2445796 *",
            "US2451879 *",
            "US2461570 *",
            "US2467803 *",
            "US2489451 *",
            "US2534853 *"
        ],
        [
            "Filing date",
            "Feb 26, 1946",
            "Apr 25, 1945",
            "May 3, 1947",
            "Aug 14, 1947",
            "Jun 20, 1946",
            "Nov 29, 1947"
        ],
        [
            "Publication date",
            "Jul 27, 1948",
            "Oct 19, 1948",
            "Feb 15, 1949",
            "Apr 19, 1949",
            "Nov 29, 1949",
            "Dec 19, 1950"
        ],
        [
            "Applicant",
            "Texas Co",
            "Standard Oil Dev Co",
            "Standard Oil Co",
            "Standard Oil Dev Co",
            "Standard Oil Dev Co",
            "The Texas Company"
        ],
        [
            "Title",
            "Process for the catalytic hydrogenation of carbon oxides",
            "Hydrocarbon synthesis",
            "Synthesis of liquids from carbon monoxide and hydrogen",
            "Synthesis of hydrocarbons",
            "Hydrocarbon synthesis process",
            "Cascade catalyst system"
        ]
    ],
    "pageTitle": "Patent US2704293 - Preparation of highly active hydrocarbon synthesis catalyst - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US2704293?dq=6322901",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 5,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438043062723.96/warc/CC-MAIN-20150728002422-00172-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 473462615,
    "recordOffset": 473446110,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{7693=e H a r v K.a 4m n n r m w M m Y B United States Patent PREPARATION OF HIGHLY ACTIVE HYDRO- CARBON SYNTHESIS CATALYST Myron B. Kratzer, Tulsa, Okla., assignor to Stanolind Oil and Gas Company, Tulsa, Okla., a corporation of Delaware Application October 28, 1949, Serial No. 124,087, 33894=References Cited in the file of this patent UNITED STATES PATENTS 2,445,796 Millendorf July 27, 1948 2,451,879 Scharmann Oct. 19, 1948 2,461,570 Roberts Feb. 15, 1949 2,467,803 Herbst Apr. 19, 1949 2,489,451 Dart et a1. Nov. 29, 1949 2,534,853 Carkeek Dec. 19, 1950, 17872=. 7.2-21.2 s.'c. r. u. (:0 (total teed)/lh., 19531=Linear ve10city 0.10-0.70 ft./sec., 19686=Fresh feed composltlon 5.0-12.0 volume percent 00., 28308=I claim: 1. In a process for the synthesis of valuable organic products by reacting carbon monoxide with hydrogen in the presence of a finely divided fluidized iron catalyst in a reaction zone, the improvement which comprises contacting catalyst with a synthesis gas (total feed) having a HzzCO ratio not substantially in excess of 3:1 at temperatures of from about 550 to about 700 F., and at reactor pressures below about 250 p. s. i., continuing synthesis in said reaction zone under the aforesaid conditions until substantially the entire quantity of the original catalyst charged to said zone has substantially completely disintegrated into a product of much smaller particle size having deposited thereon from about to about per cent of carbon, conveying the resulting low density highly active catalyst to a second reaction zone, charging fresh high density iron catalyst to said first reaction zone and effecting synthesis therein by contacting said catalyst with synthesis gas (fresh feed) having a H2:CO ratio of from about 1.8:1 to about 2.6:1 at synthesis temperatures, at a reactor pressure of from about 350 to about 550 p. s. i. at a space velocity suflicient to convert not more than about of the total feed CO, and withdrawing tail gas from said first reaction zone and introducing said tail gas into said second reaction zone where it contacts a fluidized bed of said finely divided highly active low density catalyst at temperatures of from about 560 to about 680 F. and under other normal synthesis conditions to convert essentially all the carbon monoxide present in said tail gas to useful organic products., 20295=Thereafter the fresh feed HzzCO ratio was lowered to 1.9. The superficial linear velocity was lowered to 0.63 ft./sec. by reducing the fresh feed rate. The following conditions were then maintained for the duration of the 32.8-34.6 volume percent 00' By operating under the above specified conditions, the results obtained are indicated in the table below., 18929=a recycle gas containing hydrogen and carbon monoxide EXAMPLE II in a ratio of from about 4:1 to about 25:1, a linear velocity of from about 0.5 to about 2.0 ft./sec., a space velocity of from about 13 to 20 S. C. F. H. CO/lb. Fe, and a pressure of from about 350 to about 550 p. s. i. g. Catalyst for reactor 12 is withdrawn from temporary catalyst storage unit 11 and sent through line 10 to line 14 where it is mixed with tail gas from separator 20 and synthesis effected in reactor 12 under the following approximate conditions:, 30361=at reactor pressures of from about to about p. s. i., continuing synthesis in said reaction zone under the aforesaid conditions until substantially the entire quantity of the original catalyst charged to said zone has substantially completely disintegrated into a product of much smaller particle size having deposited thereon from about 25 to about 70 per cent of carbon, conveying the resulting low density highly active catalyst to a second reaction zone, charging fresh high density iron catalyst to said first reaction zone and effecting synthesis therein by contacting said catalyst with synthesis gas (fresh feed) having a HzzCO ratio of from about 1.8:1 to about 2.6:1 at synthesis temperatures, at a reactor pressure of from about 350 to about 550 p. s. i. and at a hydrogen partial pressure of at least about 100 p. s. i. at a space velocity of from about 13 to about 20 S. C. F. H. CO/lb. iron whereby only from about 50 to about 75 of the total feed CO is converted, and withdrawing tail gas from said first reaction zone and introducing said tail gas into said second reaction zone where it contacts a fluidized bed of said finely divided highly active low density catalyst at temperatures of from about 560 to about 680 F. and under other normal synthesis conditions to convert essentially all the carbon monoxide present in said tail gas to useful organic products., 29959=2. In a process for the synthesis of valuable organic products by reacting carbon monoxide with hydrogen in the presence of a finely divided fluidized iron catalyst in a reaction zone, the improvement which comprises contacting catalyst with a synthesis gas (total feed) having a HzzCO ratio not substantially in excess of 3:1 at temperatures of from about 550 to about 700 F. and, 31762=3. In a process for the synthesis of valuable organic products by reacting carbon monoxide with hydrogen in the presence of a finely divided fluidized iron catalyst in a reaction zone, the improvement which comprises contacting said catalyst with a synthesis gas (total feed) having a HzzCO ratio not substantially in excess of 3:1 at temperatures of from about 550 to about 700 and at reactor pressures below about 250 p. s. i., continuing synthesis in said reaction zone under the aforesaid conditions until substantially the entire quantity of the original catalyst charged to said zone has substantially completely disintegrated into a product comprised of particles at least about 30 weight per cent of which have an average particle size of from about 0-20 microns and having deposited thereon from about 25 to about 60 weight per cent of carbon, conveying the resulting low-density highly-active catalyst to a second reaction zone, charging fresh high density iron catalyst to said first reaction zone and effecting synthesis therein by contacting said catalyst with synthesis gas (fresh feed) having a H2:CO ratio of from about 1.811 to about 2.6:1 at synthesis temperatures, at a reactor pressure of from about 350 to about 550 p. s. i. and at a hydrogen partial pressure of at least about 100 p. s. i. at a space velocity of from about 13 to about 20 S. C. F. H. CO/lb. iron whereby only from about 50 to 75 of the total feed CO is converted, and withdrawing tail gas from said first reaction zone and introducing said tail gas into said second reaction zone where it contacts a fluidized bed of said finely divided highly active low density catalyst a temperature of from about 560 to about 680 F. and under other normal synthesis conditions to convert essentially all the carbon monoxide present in said tail gas to useful organic prodnets., 15383=The process of my invention may be further illustrated by reference to the accompanying flow diagram wherein fresh hydrocarbon synthesis catalyst is first charged to primary reactor 2 after which catalyst in the form of a fiuid bed is contacted with fresh synthesis gas introduced through line 4. The conditions employed initially in this reactor are those which are known to be favorable to high wax and carbon deposition and have been noted above. Product gases emanate from the top of primary reactor 2 through line 6 are sent to cyclone separator 8 together with entrained catalyst fragments which are withdrawn through line 10 to catalyst storage 11 and later sent to secondary reactor 12 via line 14. The efiiuent gases are withdrawn from separator 8 through line 16 and cooler 18 and thereafter introduced into separator 20 where the resulting condensate separates into two layers, the organic and water layers being withdrawn through lines 22 and 24, respectively, for further processing outside the scope of this invention. The uncondensed gases during this period of preparing catalyst for reactor 12 are withdrawn from separator 20 through line 26 and returned to primary reactor 2 via line 4 until substantially all of the catalyst initially charged is converted into a finely divided material of high carbon content. After the latter has been removed from primary reactor 2, fresh high density catalyst is charged thereto and hydrocarbon synthesis is effected therein under conditions favorable to long catalyst life and high fluid bed density, i. e., temperatures in the neighborhood of about 600 F., a fresh feed containing hydrogen and carbon monoxide in a ratio of from about 1.8:1 to about 2.6:1,, 7520=9 R mw E n a m K mm o B mm M March 15, 1955 PREPARATION OF HIGHLY ACTIVE HYDROCARBON moBfiE E3283 -Wuter Layer CATALYST STORAGE Synthesis Gas INVENTOR.}",
    "textBeforeTable": "Patent Citations References Cited in the file of this patent UNITED STATES PATENTS 2,445,796 Millendorf July 27, 1948 2,451,879 Scharmann Oct. 19, 1948 2,461,570 Roberts Feb. 15, 1949 2,467,803 Herbst Apr. 19, 1949 2,489,451 Dart et a1. Nov. 29, 1949 2,534,853 Carkeek Dec. 19, 1950 5. The process of claim 3 in which the hydrocarbon synthesis catalyst employed is prepared from mill scale. 4. The process of claim 1 in which the hydrocarbon synthesis catalyst employed is prepared from mill scale. 3. In a process for the synthesis of valuable organic products by reacting carbon monoxide with hydrogen in the presence of a finely divided fluidized iron catalyst in a reaction zone, the improvement which comprises contacting said catalyst with a synthesis gas (total feed) having a HzzCO ratio not substantially in excess of 3:1 at temperatures of from about 550 to about 700 and at reactor pressures below about 250 p. s. i., continuing synthesis in said reaction zone under the aforesaid conditions until substantially the entire quantity of the original catalyst charged to said zone has substantially completely disintegrated into a product comprised of particles at least about 30 weight per cent of which have an average particle size of from about 0-20 microns and having deposited thereon from about 25 to about 60 weight per cent of carbon, conveying the resulting low-density highly-active catalyst to a second reaction zone,",
    "textAfterTable": "* Cited by examiner Referenced by Citing Patent Filing date Publication date Applicant Title US4642125 * Nov 30, 1983 Feb 10, 1987 Trw Inc. Carbonaceous material and methods for making hydrogen and light hydrocarbons from such materials US4650657 * Jun 15, 1984 Mar 17, 1987 Trw Inc. Method for making carbonaceous materials US4689161 * May 24, 1985 Aug 25, 1987 Trw Inc. Viscosifier, its uses, and its manufacture US4735733 * Jun 3, 1987 Apr 5, 1988 Trw Inc. Viscosifier, its uses, and its manufacture US4767737 * Jul 21, 1986 Aug 30, 1988 Trw Inc. Method for making carbonaceous materials * Cited by examiner Classifications",
    "hasKeyColumn": true,
    "keyColumnIndex": 4,
    "headerRowIndex": 0
}