{
    "relation": [
        [
            "Date",
            "Aug 14, 2000",
            "Sep 30, 2003",
            "Aug 14, 2009",
            "Sep 27, 2013",
            "Feb 14, 2014",
            "Apr 8, 2014"
        ],
        [
            "Code",
            "AS",
            "AS",
            "FPAY",
            "REMI",
            "LAPS",
            "FP"
        ],
        [
            "Event",
            "Assignment",
            "Assignment",
            "Fee payment",
            "Maintenance fee reminder mailed",
            "Lapse for failure to pay maintenance fees",
            "Expired due to failure to pay maintenance fee"
        ],
        [
            "Description",
            "Owner name: HEWLETT-PACKARD COMPANY, COLORADO Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNORS:KAWAMURA, NAOTO;HARMON, JOHN PAUL;REEL/FRAME:011174/0448;SIGNING DATES FROM 20000424 TO 20000511",
            "Owner name: HEWLETT-PACKARD DEVELOPMENT COMPANY L.P.,TEXAS Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNOR:HEWLETT-PACKARD COMPANY;REEL/FRAME:014061/0492 Effective date: 20030926",
            "Year of fee payment: 4",
            "",
            "",
            "Effective date: 20140214"
        ]
    ],
    "pageTitle": "Patent US6997538 - Inkjet printing with air current disruption - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US6997538?ie=ISO-8859-1&dq=inassignee:doubleclick",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 9,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042982013.25/warc/CC-MAIN-20150728002302-00315-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 467234007,
    "recordOffset": 467208183,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Patent Citations Although specific embodiments have been illustrated and described herein for purposes of description of the preferred embodiment, it will be appreciated by those of ordinary skill in the art that a wide variety of alternate and/or equivalent implementations calculated to achieve the same purposes may be substituted for the specific embodiments shown and described without departing from the scope of the present invention. Those with skill in the chemical, mechanical, electromechanical, electrical, and computer arts will readily appreciate that the present invention may be implemented in a very wide variety of embodiments. This application is intended to cover any adaptations or variations of the preferred embodiments discussed herein. Therefore, it is manifestly intended that this invention be limited only by the claims and the equivalents thereof. By directing air stream 42 through the print zone 15 as ink drops 38 are ejected during printing, air current disruption system 40 disrupts air currents acting on ink drops 38 during printing, but does not disrupt the intended trajectory of ink drops 38 during printing. As such, undesirable print defects 51, such as “worms,” are avoided without compromising image resolution, printing speed, and/or accommodation of various thickness of print medium. . Thus, image quality is enhanced with the air current disruption system according to the present invention. FIG. 6 , enlarged image portion 52 does not include print defects 51 identifiable in FIG. 7",
    "textAfterTable": "US5771050 * Jun 28, 1995 Jun 23, 1998 Oce-Nederland, B.V. Printer with movable print head US5774141 Oct 26, 1995 Jun 30, 1998 Hewlett-Packard Company Carriage-mounted inkjet aerosol reduction system US5877788 * May 9, 1995 Mar 2, 1999 Moore Business Forms, Inc. Cleaning fluid apparatus and method for continuous printing ink-jet nozzle US6203152 Sep 16, 1999 Mar 20, 2001 Hewlett-Packard Company Ink aerosol control for large format printer US6220693 Sep 29, 1997 Apr 24, 2001 Colorspan Corporation Overspray adaptation method and apparatus for an ink jet print engine US6318854 * Sep 29, 1998 Nov 20, 2001 Hewlett-Packard Company Inkjet printing media handling system with advancing guide shim US6340225 Jan 19, 1999 Jan 22, 2002 Xerox Corporation Cross flow air system for ink jet printer EP0916509A2 Nov 13, 1998 May 19, 1999 Canon Kabushiki Kaisha Ink jet recording",
    "hasKeyColumn": true,
    "keyColumnIndex": 2,
    "headerRowIndex": 0
}