{
    "relation": [
        [
            "Date",
            "Feb 5, 1990",
            "Feb 15, 1996",
            "May 16, 2000",
            "Oct 22, 2000",
            "Dec 26, 2000"
        ],
        [
            "Code",
            "AS",
            "FPAY",
            "REMI",
            "LAPS",
            "FP"
        ],
        [
            "Event",
            "Assignment",
            "Fee payment",
            "Maintenance fee reminder mailed",
            "Lapse for failure to pay maintenance fees",
            "Expired due to failure to pay maintenance fee"
        ],
        [
            "Description",
            "Owner name: BECTON, DICKINSON AND COMPANY, A CORP. OF NJ Free format text: ASSIGNMENT OF ASSIGNORS INTEREST.;ASSIGNORS:HAYNES, JOHN L.;TITUS, GEORGE R.;REEL/FRAME:005227/0559 Effective date: 19900116",
            "Year of fee payment: 4",
            "",
            "",
            "Effective date: 20001020"
        ]
    ],
    "pageTitle": "Patent US5156611 - Blood microsampling site preparation method - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US5156611?dq=5579430",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 8,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988598.68/warc/CC-MAIN-20150728002308-00192-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 473739963,
    "recordOffset": 473724002,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Patent Citations Although illustrative embodiments of the present invention have been described herein, it is to be understood that the invention is not limited to those precise embodiments, and that various other changes and modifications may be effected therein by one skilled in the art without departing from the scope or spirit of the invention. The patch or tape used in accordance with the invention may be made from any suitable material, and preferably an inert, pliable polymeric film material having a thickness not exceeding several mils. Polyethylene, polyvinylchloride and other non-absorptive films can be employed. An adhesive may be provided on the layer which contacts the skin to insure proper blood flow through the film. It is important that the tape be non-absorbent and hydrophobic in all areas where it would be contacted by blood. It is also important that the tape be positioned in close, adjoining position to the skin so that the blood tends to accumulate on the outer surface of the tape and not beneath it. Alcohol may be wiped upon the outer surface of the tape to insure it is free from contaminants. As an alternative to the in situ film formation as described above, the protective layer applied to the skin may be in the form of a patch or tape. A tape, for example, is adhered to the skin prior to the lancing operation. Upon lancing, the blood flows through the",
    "textAfterTable": "US4589421 * Mar 14, 1984 May 20, 1986 Syntex (U.S.A.) Inc. Sampling device US4613544 * Dec 4, 1984 Sep 23, 1986 Minnesota Mining And Manufacturing Co. Waterproof, moisture-vapor permeable sheet material and method of making the same US5014718 * Sep 22, 1989 May 14, 1991 Safety Diagnostics, Inc. Blood collection and testing method DE2909349A1 * Mar 9, 1979 Sep 11, 1980 Baumgartner Erich R Human skin testing instrument - has lance attached to test substance vessel and puncturing skin via vessel walls * Cited by examiner Referenced by Citing Patent Filing date Publication date Applicant Title US5843112 * Feb 3, 1997 Dec 1, 1998 Bio Plas Inc. Self-contained blood withdrawal apparatus and method US8286561 Sep 18, 2009 Oct 16, 2012 Ssw Holding Company, Inc. Spill",
    "hasKeyColumn": true,
    "keyColumnIndex": 2,
    "headerRowIndex": 0
}