{
    "relation": [
        [
            "Date",
            "Dec 30, 1999",
            "Feb 18, 2003",
            "May 1, 2006",
            "Mar 23, 2010",
            "Mar 26, 2014"
        ],
        [
            "Code",
            "AS",
            "CC",
            "FPAY",
            "FPAY",
            "FPAY"
        ],
        [
            "Event",
            "Assignment",
            "Certificate of correction",
            "Fee payment",
            "Fee payment",
            "Fee payment"
        ],
        [
            "Description",
            "",
            "",
            "Year of fee payment: 4",
            "Year of fee payment: 8",
            "Year of fee payment: 12"
        ]
    ],
    "pageTitle": "Patent US6471721 - Vascular stent having increased radiopacity and method for making same - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US6471721?dq=ininventor:oliver+ininventor:steele",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 9,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042981969.11/warc/CC-MAIN-20150728002301-00288-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 471260123,
    "recordOffset": 471223874,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Patent Citations While a particular form of the invention has been illustrated and described, it will also be apparent to those skilled in the art that various modifications can be made without departing from the spirit and scope of the invention. More specifically, it should be clear that the present invention is not limited to tubular type stents nor is it limited to any particular method of forming the underlying stent structure. Additionally, the invention is not limited to the use of any particular materials in either the core, radiopaque coating or encapsulating layer nor is it intended to be limited to any particular coating or application method. Accordingly, it is not intended that the invention be limited except by the appended claims. An advantage of the stent, and the method for manufacture described above, lies in the resolution of the stent under fluoroscopy. As previously mentioned, the high resolution is due to the strategically placed radiopaque strips inserted into grooves formed in the stent. The benefits of the stent are immediately apparent in practice where a physician, who views the stent under fluoroscopy, will clearly see the size and location of the stent in the vessel of the patient. The clear view of the stent enables the physician to perform his function efficiently and safely without the worry of incorrectly approximating the size or location of the stent. It should be appreciated that the radiopaque material may",
    "textAfterTable": "US4387952 Mar 27, 1981 Jun 14, 1983 Spectra-Physics, Inc. Single axis beam scanner US4503569 Mar 3, 1983 Mar 12, 1985 Dotter Charles T Transluminally placed expandable graft prosthesis US4504354 Jul 2, 1982 Mar 12, 1985 Gravure Research Institute, Inc. Method and apparatus for forming gravure cells in a gravure cylinder US4512338 Jan 25, 1983 Apr 23, 1985 Balko Alexander B Process for restoring patency to body vessels US4531933 Dec 7, 1982 Jul 30, 1985 C. R. Bard, Inc. Helical ureteral stent US4553545 Sep 15, 1982 Nov 19, 1985 Medinvent S.A. Device for application in blood vessels or other difficultly accessible locations and its use US4580568 Oct 1, 1984 Apr 8, 1986 Cook, Incorporated Percutaneous endovascular stent and method for insertion thereof US4619246 May 20, 1985 Oct 28, 1986 William Cook, Europe A/S Collapsible filter basket US4649922 Jan 23, 1986",
    "hasKeyColumn": true,
    "keyColumnIndex": 2,
    "headerRowIndex": 0
}