{
    "relation": [
        [
            "Date",
            "2 Oct 2000",
            "29 Mar 2001",
            "29 Mar 2005",
            "29 Nov 2006",
            "19 Jan 2007",
            "5 Feb 2007",
            "20 Mar 2009",
            "28 Apr 2011",
            "28 Dec 2011"
        ],
        [
            "Code",
            "AS",
            "FPAY",
            "FPAY",
            "AS",
            "AS",
            "AS",
            "FPAY",
            "AS",
            "AS"
        ],
        [
            "Event",
            "Assignment",
            "Fee payment",
            "Fee payment",
            "Assignment",
            "Assignment",
            "Assignment",
            "Fee payment",
            "Assignment",
            "Assignment"
        ],
        [
            "Description",
            "",
            "Year of fee payment: 4",
            "Year of fee payment: 8",
            "Owner name: CITICORP TRUSTEE COMPANY LIMITED, AS SECURITY AGEN Free format text: SECURITY AGREEMENT;ASSIGNOR:GAMBRO, INC.;REEL/FRAME:018552/0717 Effective date: 20061117",
            "Owner name: GAMBRO RENAL PRODUCTS, INC., COLORADO Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNOR:GAMBRO, INC.;REEL/FRAME:018787/0246 Effective date: 20061218",
            "Owner name: CITICORP TRUSTEE COMPANY LIMITED, AS SECURITY AGEN Free format text: SECURITY AGREEMENT;ASSIGNOR:GAMBRO RENAL PRODUCTS, INC.;REEL/FRAME:018855/0084 Effective date: 20061228",
            "Year of fee payment: 12",
            "Owner name: GAMBRO, INC., COLORADO Free format text: RELEASE BY SECURED PARTY;ASSIGNOR:CITICORP TRUSTEE COMPANY LIMITED, AS SECURITY AGENT;REEL/FRAME:026209/0914 Effective date: 20110413",
            "Owner name: GAMBRO RENAL PRODUCTS, INC., COLORADO Free format text: RELEASE OF SECURITY INTEREST IN PATENTS;ASSIGNOR:CITICORP TRUSTEE COMPANY LIMITED, AS SECURITY AGENT;REEL/FRAME:027455/0318 Effective date: 20111207"
        ]
    ],
    "pageTitle": "Patent US5679245 - Retention device for extracorporeal treatment apparatus - Google Patents",
    "title": "",
    "url": "http://www.google.com.au/patents/US5679245",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 9,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042991019.80/warc/CC-MAIN-20150728002311-00216-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 473257295,
    "recordOffset": 473217167,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{27413=This application is a continuation application of copending U.S. patent application Ser. No. 08/017,571 FOR TECHNIQUE FOR EXTRACORPOREAL TREATMENT OF BLOOD, filed Feb. 12, 1993, which application is related to U.S. patent application Ser. No. 07/942,466, filed concurrently therewith, for Integrated Blood Treatment Fluid Module, which is assigned to the assignee hereof. The disclosure of this related application is incorporated herein by this reference.}",
    "textBeforeTable": "Patent Citations Presently preferred embodiments of the present invention and many of its improvements have been described with a degree of particularity. It should be understood that the present invention is defined by the spirit and scope of the following claims. As mentioned previously, the monitor processor 140 can evaluate the integrity of the pressure sensors 51, 53, 54 and 83 when the pressure sensors are of a conventional design having a membrane centrally located in a disposable chamber. If there is a slow leak in the air compartment, the membrane may lock in a position on either side of the middle of the disposable chamber, in which case the pressure sensor is typically unresponsive. To determine the integrity of the air chamber, the flow rate of the liquid being measured may be instantly changed at regular intervals. Simultaneously, the change in pressure is measured by the pressure sensor over a predetermined period of time is calculated (dp/dt). If the change in pressure is less than a predetermined value, malfunction of the pressure sensor is indicated, which is treated by the monitor processor 140 as an alarm condition and an alarm is emitted and/or displayed. In addition to detecting alarm conditions as described above, the monitor processor 140 evaluates pressure measurements in the primary circuit 38 and determines if conditions are indicative of a pinched access line 34 or return line 35, in which case the control processor",
    "textAfterTable": "US4844810 * 7 Aug 1987 4 Jul 1989 Hospal Industrie Installation with multiple functions for replacement of the natural filtration of the blood US4889635 * 24 Apr 1987 26 Dec 1989 Hospal Industrie Method and apparatus for controlling the quantities of liquid circulating in the dialysis liquid circuit of an artificial kidney US4923598 * 21 Jun 1988 8 May 1990 Fresenius Ag Apparatus for the treatment of blood in particular for hemodialysis and hemofiltration US4980054 * 30 Dec 1987 25 Dec 1990 Lavender Ardis R System and method for mass transfer between fluids US5211849 * 11 Oct 1991 18 May 1993 Children's Hospital Medical Center Hemofiltration system and method DE2703188A1 * 27 Jan 1977 3 Aug 1978 Heiner Oelrichs Control system for kidney dialysis - using disposable hoses and balancing pump for substitute soln. feed equal to blood filtrate extn.; minimising infection risk EP0189561A1",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}