{
    "relation": [
        [
            "Citing Patent",
            "US6281807 *",
            "US6282486",
            "US6317684 *",
            "US6349246",
            "US6353797",
            "US6385531",
            "US6401034 *",
            "US6411895 *",
            "US6574552 *",
            "US6600982",
            "US6708110 *",
            "US6909968 *",
            "US6915204",
            "US6928364 *",
            "US7233863",
            "US7317449 *",
            "US7571050 *",
            "US8024116 *",
            "US8131467 *",
            "US8150616 *",
            "US8566028 *",
            "US8600664 *",
            "US8670922 *",
            "US8700320",
            "US8756000",
            "US20040107048 *",
            "US20050033510 *",
            "US20080125968 *",
            "US20080177462 *",
            "US20120122487 *",
            "US20120253659 *",
            "US20130103300 *",
            "CN100507814C",
            "CN100567900C",
            "CN102027325B",
            "WO2002055963A1 *",
            "WO2014073141A1 *"
        ],
        [
            "Filing date",
            "16 Jul 1998",
            "3 Apr 2000",
            "22 Dec 1999",
            "24 Apr 2000",
            "1 Jun 2000",
            "11 May 2001",
            "2 Sep 1999",
            "13 Jul 2000",
            "19 Sep 2001",
            "23 Aug 2000",
            "1 Nov 2001",
            "30 Nov 2002",
            "1 Jun 2000",
            "13 Nov 2002",
            "12 Mar 2004",
            "2 Mar 2004",
            "27 Mar 2006",
            "20 Dec 2007",
            "13 Mar 2008",
            "23 Sep 2008",
            "27 Nov 2006",
            "10 Jun 2012",
            "18 Jan 2006",
            "5 Jan 2013",
            "9 Oct 2008",
            "30 Nov 2002",
            "22 Jul 2004",
            "27 Nov 2006",
            "13 Mar 2008",
            "",
            "10 Jun 2012",
            "25 Oct 2011",
            "2 Mar 2005",
            "6 Aug 2004",
            "9 Oct 2008",
            "9 Jan 2002",
            "24 Sep 2013"
        ],
        [
            "Publication date",
            "28 Aug 2001",
            "28 Aug 2001",
            "13 Nov 2001",
            "19 Feb 2002",
            "5 Mar 2002",
            "7 May 2002",
            "4 Jun 2002",
            "25 Jun 2002",
            "3 Jun 2003",
            "29 Jul 2003",
            "16 Mar 2004",
            "21 Jun 2005",
            "5 Jul 2005",
            "9 Aug 2005",
            "19 Jun 2007",
            "8 Jan 2008",
            "4 Aug 2009",
            "20 Sep 2011",
            "6 Mar 2012",
            "3 Apr 2012",
            "22 Oct 2013",
            "3 Dec 2013",
            "11 Mar 2014",
            "15 Apr 2014",
            "17 Jun 2014",
            "3 Jun 2004",
            "10 Feb 2005",
            "29 May 2008",
            "24 Jul 2008",
            "17 May 2012",
            "4 Oct 2012",
            "25 Apr 2013",
            "1 Jul 2009",
            "9 Dec 2009",
            "6 Aug 2014",
            "18 Jul 2002",
            "15 May 2014"
        ],
        [
            "Applicant",
            "Robert Bosch Gmbh",
            "International Business Machines Corporation",
            "At&T Wireless Services Inc.",
            "International Business Machines Corporation",
            "Airflash",
            "International Business Machines Corporation",
            "Navigation Technologies Corp.",
            "Robert Bosch Gmbh",
            "Poineer Corporation",
            "International Business Machines Corporation",
            "General Motors Corporation",
            "Alpine Electronics, Inc.",
            "Webraska, Inc.",
            "Toshio Tsuyuki",
            "Albert Rodriguez",
            "Microsoft Corporation",
            "Microsoft Corporation",
            "Denso Corporation",
            "Panasonic Corporation",
            "Denso Corporation",
            "International Business Machines Corporation",
            "Infogation Corporation",
            "Kabushiki Kaisha Kenwood",
            "Mordechai Teicher",
            "Tomtom International B.V.",
            "Tatsuo Yokota",
            "Mitsubishi Denki Kabushiki Kaisha",
            "Thomas Michael Bradicich",
            "Mototaka Yoshioka",
            "Qualcomm Incorporated",
            "Qing Kent Pu",
            "Nokia Corporation",
            "微软公司",
            "三菱电机株式会社",
            "通腾科技股份有限公司",
            "Georg Hoever",
            "Toyota Jidosha Kabushiki Kaisha"
        ],
        [
            "Title",
            "Method for selecting digital traffic messages",
            "Distributed system and method for detecting traffic patterns",
            "Method and apparatus for navigation using a portable communication device",
            "Preemptive control of a vehicle computer system based on local and environmental sensing",
            "Database minimizing by wireless input of location related information",
            "Distributed system and method for detecting traffic patterns",
            "Method and system for finding intermediate destinations with a navigation system",
            "Navigation method for computing a travel route considering parking place location and occupancy",
            "Navigation system and computer-readable information recorded medium in which navigation control program is recorded",
            "System, method and article of manufacture to provide output according to trip information",
            "Method of providing vehicle instructions to a non-navigable point of interest",
            "Arrival detection method for navigation system",
            "Method, system, and article of manufacture for minimizing travel time to a user selected location",
            "Navigation apparatus and method",
            "GPS location finding device",
            "Key-based advanced navigation techniques",
            "Transit-coordinated local search",
            "Vehicle stray determination apparatus and destination guide apparatus",
            "Route information display device and route information display method",
            "Navigation apparatus and program storage medium",
            "Apparatus, system, and method for autonomously determining a set of destinations",
            "Method and apparatus for GPS services based on client and server architecture",
            "Guiding route generation device and guiding route generation method",
            "Emphasizing featured locations during a journey",
            "Navigation apparatus and method of detection that a parking facility is sought",
            "Arrival detection method for navigation system",
            "Vehicle-mounted information apparatus",
            "Apparatus, system, and method for autonomously determining a set of destinations",
            "Route information display device and route information display method",
            "Method for discovery of indoor lci based on approximate location",
            "Mobile navigation system",
            "Method and apparatus for predicting a travel time and destination before traveling",
            "Key-based advanced navigation techniques",
            "Vehicle-mounted information device",
            "Navigation apparatus and method of detection that a parking facility is sought",
            "Navigation method with dynamic destination selection and navigation device",
            "Navigation system"
        ]
    ],
    "pageTitle": "Patent US5906654 - Route guidance for vehicle navigation apparatus to find alternate destination - Google Patents",
    "title": "",
    "url": "http://www.google.com.au/patents/US5906654",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 6,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042981969.11/warc/CC-MAIN-20150728002301-00251-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 460861035,
    "recordOffset": 460840383,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{27862=Map data stored in the map data storage device, e.g. a CD-ROM, is sectioned by suitable longitude and latitude widths at reduced scales, for example, 1/12500, 1/25000, 1/50000 and 1/100000. In the map data, data pertaining to roads is stored as sets of coordinates representing vertices (nodes) in terms of longitude and latitude. Each road is defined by two or more nodes connected to each other; a connection of two nodes is called a \"link\". The map data is (1) a road layer for map matching and route search, including a road list, a node table, an intersection forming node list and an intersection network list, (2) a background layer for displaying roads, buildings, facilities, parks, rivers and so on in map pictures, and (3) a letter/symbol layer for displaying letters representing names of entities such as cities, towns and villages, roads, intersections, and buildings as well as map symbols.}",
    "textBeforeTable": "Patent Citations This disclosure is illustrative and not limiting; further modifications will be apparent to one skilled in the art in light of this disclosure, and are intended to fall within the scope of the appended claims. In particular, in a case where a guide route is searched for by inputting traffic information from the ATIS or the like, a guide route search is performed by avoiding roads under traffic control and congested roads. It is therefore possible to reach the desired destination in the shortest time by driving along the guide route set by the navigation apparatus. Further, if a parking area is searched for as a destination, pertinent parking availability information is input from the above-described traffic information, thus making it possible to search out a parking area where space is available. According to the present invention, as described above, if the vehicle is within a certain range of a destination and if it then travels out of the range of the destination without stopping within the range longer than a certain time, this destination is canceled and another destination in the same category of places is then automatically searched for. In this manner, a guide route to another destination in the same category of places can be indicated even if the user's original purpose cannot be achieved, e.g. because the guide destination store is closed or for other reasons, thereby eliminating the need for the",
    "textAfterTable": "US20120122487 * 17 May 2012 Qualcomm Incorporated Method for discovery of indoor lci based on approximate location US20120253659 * 10 Jun 2012 4 Oct 2012 Qing Kent Pu Mobile navigation system US20130103300 * 25 Oct 2011 25 Apr 2013 Nokia Corporation Method and apparatus for predicting a travel time and destination before traveling CN100507814C 2 Mar 2005 1 Jul 2009 微软公司 Key-based advanced navigation techniques CN100567900C 6 Aug 2004 9 Dec 2009 三菱电机株式会社 Vehicle-mounted information device CN102027325B 9 Oct 2008 6 Aug 2014 通腾科技股份有限公司 Navigation apparatus and method of detection that a parking facility is sought WO2002055963A1 * 9 Jan 2002 18 Jul 2002 Georg Hoever Navigation method with dynamic destination selection and navigation device WO2014073141A1 * 24 Sep 2013 15 May 2014 Toyota Jidosha Kabushiki Kaisha",
    "hasKeyColumn": true,
    "keyColumnIndex": 3,
    "headerRowIndex": 0
}