{
    "relation": [
        [
            "Date",
            "Mar 30, 2005",
            "Mar 15, 2010",
            "Aug 8, 2010",
            "Sep 13, 2010",
            "Sep 16, 2010",
            "Sep 16, 2010",
            "Sep 28, 2010",
            "Jan 28, 2014"
        ],
        [
            "Code",
            "AS",
            "REMI",
            "REIN",
            "PRDP",
            "SULP",
            "FPAY",
            "FP",
            "FPAY"
        ],
        [
            "Event",
            "Assignment",
            "Maintenance fee reminder mailed",
            "Reinstatement after maintenance fee payment confirmed",
            "Patent reinstated due to the acceptance of a late maintenance fee",
            "Surcharge for late payment",
            "Fee payment",
            "Expired due to failure to pay maintenance fee",
            "Fee payment"
        ],
        [
            "Description",
            "Owner name: APPLIED MATERIALS, INC., CALIFORNIA Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNOR:BOXER CROSS INC.;REEL/FRAME:015976/0325 Effective date: 20050105",
            "",
            "",
            "Effective date: 20100917",
            "",
            "Year of fee payment: 4",
            "Effective date: 20100808",
            "Year of fee payment: 8"
        ]
    ],
    "pageTitle": "Patent US20050112788 - Evaluating a multi-layered structure for voids - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US20050112788?dq=6317900",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 9,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438043062723.96/warc/CC-MAIN-20150728002422-00188-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 480295843,
    "recordOffset": 480252667,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{6375=Relatively speaking, small perturbations in the trenches are more easily detected with small beams, as compared to large beams. After evaluation by apparatus 125, a reference wafer is normally evaluated by a conventional apparatus such as a scanning electron microscope (SEM). SEM photos 1701-1704 shown in FIG. 13B are representative of voids discovered in the measurement areas.}",
    "TableContextTimeStampAfterTable": "{93335=The predetermined frequency of modulation of heating beam 19 is selected to be sufficiently small to cause a majority of the heat to transfer by diffusion from region ii. Under such diffusive heat transfer conditions, the temperature of traces 11A-11N is approximately equal to (e.g., within 90% of) the temperature of these same traces 11A-11N when heated by an unmodulated beam (i.e., a beam having constant power, equal to the instantaneous power of the modulated beam). For example, the modulation can be sinusoidal between 0 and 50 milliwatts, i.e., P=50 sin (2 π ft), where f is the modulation frequency. In such an example, at the time when the modulated power has an instantaneous value of 25 mW, the temperature under heating beam 19 approximately equals (e.g., is no less than 90% of) the temperature obtained with a heating beam having constant power, e.g., 25 mW. In one example, heating beam 19 has a wavelength of 0.83 microns, has an average power of 10 milliwatts, a diameter of 2 microns and is modulated at 2000 Hertz., 89355=Instead of the just-described nonpolarized probe beam 12, a circularly or elliptically polarized probe beam can also be used as described herein for a nonpolarized beam (except that separate calibration is required for an elliptically polarized beam; specifically, in the case of elliptically polarized light, the intensities in the two directions are different: for example, if the ratio of intensity in the two directions is 2:1 (parallel:perpendicular), then the parallel signal will be twice as strong for the same reflectivity, and reflection in the parallel direction must be divided by 2 to compare to the reflection in the perpendicular direction)., 149709=Moreover, voids in a via chain may also be detected as discussed in the related U.S. patent application No. ______ , Attorney Docket No. M-12169 U.S., entitled “1 IDENTIFYING DEFECTS IN VIAS OF A WAFER, BASED ON HEAT TRANSFER THERETHROUGH” filed concurrently herewith, by Peter G. Borden and Ji-Ping Li. One or more acts of the type described therein may be used with one or more acts described herein, depending on the embodiment. Moreover, any acts of the type described herein may be performed in any order relative to one another, although depending on the embodiment, some acts may be performed in a specified order, for use in certain applications., 62584=FIGS. 13B-1-13B-3 illustrate in cross-sectional views structures that generates signals 1711-1713 respectively., 110529=Trench voids and patterning defects result in higher base lines for the curves 1701-1703 which are for the corresponding structures in the cross-sections 1711 (Large Voids), 1712 (Medium Voids), and 1713 (No Voids Litho). The increased signal magnitude for these curves 1701-1703 suggests a smaller cross-sectional copper area, thus higher resistance. These curves 1701-1703 also indicate non-uniformity across the array, or variation in cross-sectional copper area from trench to trench. Cross-section FIB-SEMs 1711-1713 reveal voids and/or patterning defects in the areas measured on these samples, both of which account for higher and non-uniform line resistance., 55671=An article at the website http://www.micromagazine.com/archive/00/01/prods.html published in January 2000 describes a “Wafer Inspection System” available from Schlumberger of San Jose, Calif., as follows “The Odyssey 3000 uses an E-beam-based voltage-contrast technology to identify yield-killing electrical defects that are difficult to detect using optical systems. Designed for use in sub-0.15-μm processes, the system detects electrical, submicron particle, and pattern defects. Metal stringers, poly gate shorts, and copper damascene voids are also detectable. Real-time off-line defect review with simultaneous inspection eliminates the need to buy off-line inspection tools. The system accommodates 300-mm wafers and features an advanced graphical user interface to simplify recipe setup. Die-to-die comparisons also enable users to carry out rapid defect review.”}",
    "textBeforeTable": "Patent Citations Numerous modifications and adaptations of the above-described embodiments, implementations, and examples are encompassed by the attached claims. ), then simply a change dS1 can be used to identify a deviation from baseline. FIG. 3 Furthermore, voids can be detected by measuring the dame property at different locations, followed by comparison of the measurements from the different locations. For example, if signal S1 is being measured 9 see Moreover, voids in a via chain may also be detected as discussed in the related U.S. patent application No. ______ , Attorney Docket No. M-12169 U.S., entitled “1 IDENTIFYING DEFECTS IN VIAS OF A WAFER, BASED ON HEAT TRANSFER THERETHROUGH” filed concurrently herewith, by Peter G. Borden and Ji-Ping Li. One or more acts of the type described therein may be used with one or more acts described herein, depending on the embodiment. Moreover, any acts of the type described herein may be performed in any order relative to one another, although depending on the embodiment, some acts may be performed in a specified order, for use in certain applications. , certain embodiments measure signals from a trace which is separated from other traces by at least the diameter of the beams, and interpret changes in the reflection properties as indicating the presence of voids under the trace. In these embodiments, the measurements are not",
    "textAfterTable": "Void formation monitoring in a damascene process US7402444 * Sep 13, 2006 Jul 22, 2008 Kabushiki Kaisha Toshiba Method and apparatus for manufacturing a semiconductor device US8344510 * Mar 8, 2011 Jan 1, 2013 Spansion Llc Semiconductor device with void detection monitor US8753904 * Jun 7, 2012 Jun 17, 2014 Taiwan Semiconductor Manufacturing Company, Ltd. Method and system for semiconductor device pattern loading effect characterization US8883522 Apr 28, 2014 Nov 11, 2014 Taiwan Semiconductor Manufacturing Company, Ltd. System for semiconductor device characterization using reflectivity measurement US20090296073 * Dec 3, 2009 Lam Research Corporation Method to create three-dimensional images of semiconductor structures using a focused ion beam device and a scanning electron microscope US20110156036 * Jun 30, 2011 Takayuki Enda Method for detecting a void * Cited by examiner Classifications",
    "hasKeyColumn": true,
    "keyColumnIndex": 2,
    "headerRowIndex": 0
}