{
    "relation": [
        [
            "Date",
            "Apr 22, 1999",
            "Feb 14, 2000",
            "Jun 16, 2004",
            "Feb 9, 2005",
            "Feb 24, 2009",
            "Feb 25, 2013",
            "Jun 23, 2015"
        ],
        [
            "Code",
            "AS",
            "AS",
            "AS",
            "FPAY",
            "FPAY",
            "FPAY",
            "AS"
        ],
        [
            "Event",
            "Assignment",
            "Assignment",
            "Assignment",
            "Fee payment",
            "Fee payment",
            "Fee payment",
            "Assignment"
        ],
        [
            "Description",
            "Owner name: MERCURY DIAGNOSTICS, INC., CALIFORNIA Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNORS:DOUGLAS, JOEL S.;ROE, JEFFREY N.;PRIEST, JOHN H.;AND OTHERS;REEL/FRAME:009909/0865;SIGNING DATES FROM 19990406 TO 19990414",
            "",
            "",
            "Year of fee payment: 4",
            "Year of fee payment: 8",
            "Year of fee payment: 12",
            "Owner name: ROCHE DIABETES CARE, INC., INDIANA Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNOR:ROCHE DIAGNOSTICS OPERATIONS, INC.;REEL/FRAME:036008/0670 Effective date: 20150302"
        ]
    ],
    "pageTitle": "Patent US6285454 - Optics alignment and calibration system - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US6285454?dq=PCT/US01/05609",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 9,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042981969.11/warc/CC-MAIN-20150728002301-00095-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 484889767,
    "recordOffset": 484863532,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{45778=Following activation, measurement of the reaction of the sample with the reagent on the test strip 1 is effected using the detector 60. The microprocessor 80 derives an electrical signal from the electro-optical devices the LED 50, and the detector 60, and processes it to generate a detection signal indicative of analyte concentration in the tested sample. An ASIC 185 (application-specific integrated circuit) and a memory, such as RAM (random access memory) 195 or a ROM (read only memory) may be used in conjunction with the microprocessor 80, while the results of the measurement may then be displayed using LCD display 200. The results may alternatively be stored in RAM 195 for subsequent viewing or processing. The subsequent processing may be performed using the measuring instrument 151 itself, or using other devices to which the measurement results can be downloaded. One possibility in accordance with the invention is a modem link with a remote processing unit, using, e.g., telephone lines. The information may also be downloaded for storage at an internet location or electronic bulletin board for subsequent retrieval and processing or review by medical professionals. See application Ser. No. 09/190,301 filed Nov. 13, 1998, incorporated herein by reference in its entirety., 26183=This invention provides a multi-use digital electronic instrument that is entirely self-contained. The device consist of a low cost optics system and the optics/lightpiping to provide adequate concentration of emitted and reflected light to perform a reflectance test. The system of this invention is useful in connection with the synchronized test kit and system disclosed in application Ser. No. 08/960,866 filed Oct. 30, 1997, the optics system disclosed in application Ser. No. 08/990,084 filed Dec. 12, 1997, and/or the test system disclosed in application Ser. No. 09/104,749 filed Jun. 25, 1998. The disclosures of the above patent applications are incorporated herein by reference in their entirety.}",
    "textBeforeTable": "Patent Citations The above are exemplary modes of carrying out the invention and are not intended to be limiting. It will be apparent to those skilled in the art that modifications thereto can be made without departure from the spirit and scope of the invention as set forth by the following claims. An important feature in accordance with the invention is the manufacture and calibration of the testing instrument 151 for use with a specific quantity of test strips 1 which have been matched at the factory. This limits the need for calibration codes, and minimizes the maintenance required by the patient in the form of cleaning, battery replacement and calibration code changes. It also improves the system's ability to provide long term accurate results because a testing instrument is synchronized with only certain test strips. Once they have been used, a complete new kit is acquired with a testing instrument calibrated specifically for those test strips. This eliminates much of the compromise in system performance found in current products which have to work with strips made over a wide range of production conditions and input states. The subject invention provides improvements over existing technology in use today in several ways. The preferred embodiment of the invention eliminates the need for a patient to purchase a costly system to conduct routine testing of body fluids. It also eliminates the existing dependence on the customer to maintain the testing",
    "textAfterTable": "X-Rite, Inc. Automated strip reader densitometer WO1992015861A1 Feb 27, 1992 Sep 17, 1992 Boehringer Mannheim Corp Test strip holding and reading meter WO1997046868A1 Jun 6, 1997 Dec 11, 1997 Metrika Lab Inc Electronic assay device and method * Cited by examiner Referenced by Citing Patent Filing date Publication date Applicant Title US6750962 * Apr 10, 2001 Jun 15, 2004 Amira Medical Optics alignment and calibration system US7460222 Nov 14, 2003 Dec 2, 2008 Roche Diagnostics Operations, Inc. Measuring device for the optical analysis of a test strip US7763454 Jul 9, 2004 Jul 27, 2010 Church & Dwight Co., Inc. Electronic analyte assaying device US8142722 * Aug 8, 2007 Mar 27, 2012 Hach Company Test element and tester for analyzing solutions US8623635 Jun 3, 2010",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}