{
    "relation": [
        [
            "BERTH",
            "No.1",
            "No.2",
            "No.3",
            "No.4",
            "No.5",
            "No.6"
        ],
        [
            "LENGTH (m)",
            "81",
            "77.50",
            "120",
            "130",
            "180",
            "20"
        ],
        [
            "DEPTH (m)",
            "- 6",
            "- 6",
            "- 6",
            "- 6",
            "- 10",
            "- 10"
        ],
        [
            "CONDITION",
            "Gen. Cargo",
            "Gen. Cargo",
            "Gen. Cargo",
            "Gen. Cargo",
            "Gen. Cargo",
            "Ro-Ro"
        ]
    ],
    "pageTitle": "Selim Shipping Agency",
    "title": "",
    "url": "http://www.selimshipping.com/eng/pages/medi.htm",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988399.65/warc/CC-MAIN-20150728002308-00143-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 697247723,
    "recordOffset": 697213509,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{43561=*Piers No 2-3-9-10-11-17-18-19 Are Combined with Rail. **Piers No:14-15 Fitted with 2 Conveyor Lines Combined to SILO,with daily loading rate of total 20.000 mtons for bulk wheat and daily discharging rate of 10.000 mtons bulk wheat. PORT WORKING HOURS: Administrative: 08.30-17.30 Operational: Service is provided to vessels everyday of the week 24 hours a day with a rotation of three shifts. First Shifts: 08.00-16.30 Second Shift: 16.30-00.30 Third Shift: 00.30-08.00  , 87527=B-DORTYOL BOTAS TERMINAL OPERATED BY: Botas Petroleum Pipeline Corporation ADDRESS: Botas Limani, P.O.Box 73, 01944 Ceyhan-Adana, Turkey TELEPHONE: (326) 744 55 77 / 4 lines FAX: (326) 744 55 84 LOCATION: 36° 51' 42 N, 36° 08' 28\" E (see Iskenderun Bay) PORT DESCRIPTION: in the Botas (Ceyhan) Terminal. All other items same as Botas Ceyhan Terminal. BERTHING: There is one berth for tankers. Vessels moor with anchors forward and lines aft. BALLAST: capacity max. 15.000 ton., 153049=CARGO HANDLING RATES: Average rates (per hour) G.Cargo 100 tons to 125 tons, bagged 125 tons to 150 tons, cotton 100 tons. STORAGE: open storage area of 374.630sqm. and covered storage area of 19.076 sqm. WORKING HOURS: Administrative: 08.30-17.00 Operational: Service is provided to vessels every day of week 24 hours with a rotation of there shifts. First Shift: 08.00-16.30 Second Shift: 16.30-00.30 Third Shift: 00.30-08.00 FRESH WATER: available alongside at 20 tons/hour and from one barge of 200 tons capacity. BUNKERS: Available by road tankers though private suppliers. AIRPORT: At Adana .Approximately 147 km from the port. GARBAGE DISPOSAL: service is compulsory. WASTE OIL DISPOSAL: collection service is available. The waste oil is collected by 5 cu.m. mobile tanks. There is another tank 80 cu.m. Capacity inside the port. An oil-water separator system is available at the capacity of 7.500 cu.m./year is also available. PORT DEVELOPMENT: In order meet the container handling requirements which will arise from the Southeast Anatolian project (GAP), a container terminal is planned to be constructed at the port. The feasibility study, which will constitute a basis for the construction of a container terminal, has been completed., 87154=LOADING: Two grades of oil are loaded in BOTAS; 1-Kirkuk blend Crude Oil (API 36.95-35.98 and temp. 80F-105F) 2-Basrah Light Crude Oil (API 34.97-33.05 and temp. 80F-150F) Loading rates requested by the vessel or quoted by the terminal will be the peak or max.rate at any time during the loading period., 44297=ATAS REFINERY TERMINAL: is available for tankers, one finger pier berths two tankers at one time. The depth at the entrance channel and the pier is 14 m. Maximum length is 299 m., 10 in. - 20 in. connections to 26 in. pipeline at shore line. Loading rate 1.000 cu.m/h, discharging rate 1.500 cu.m/h. Tankers in ballast up to 15,000 d.w.t. may berth/unberth at any time, day or night. Other vessels manoeuvre in daylight hours only. NATURE OF SEA BOTTOM: Sand and mud. DENSITY: salt water 1025. FRESH WATER: available alongside at 15 tons/hour and from one barge of 100 tons capacity. BUNKERS: Most types of marine fuel and lubricants available for delivery to ships. AIRPORT: At Adana distance 60 km from the port. GARBAGE DISPOSAL: service is compulsory. WASTE OIL DISPOSAL: collection service is available. An oily-water separator system is available at the capacity of 30.000 cu.m./year. Necessary Telephone numbers of Mersin Port; Harbour master : 90-324-237 74 62 / Port Managenment : 90-324-233 32 72 Pilot Station : 90-324-233 32 72 / Custom Control office :90-324-231 38 48 Sanitary office : 90-324-238 04 09 / Immigration :90-324-231 59 10 Weather Forecast Station:90-324-237 19 19 OTHER INFORMATIONS: The worst conditions at the port are created by strong southwest to west winds in winter. Normally occurring 2 to 3 times a month, each event lasts about one to two days. The winds can be strong enough to close the port so that ships can neither enter nor leave the inner harbor until the winds abate. The winds are usually reliably forecast 24 hours in advance of onset by Turkish marine forecasters at Incirlik Air Base near Adana. Local authorities state that berths 3, 4 and 5 are known to be susceptible to swell during periods of strong southwest wind conditions, and should be avoided during such periods. Boating for all shipping is cancelled under storm or gale conditions., 128901=CARGO HANDLED: Scrap, log iron, construction iron. STORAGE AREA: Open stocking area 38.000 sq.m. including 365 sq.m. custom bonded area,and open area 100.000 sq.m. closed 15.000sq.m., grain silo 60.000 cb.m. DISTANCE BETWEEN BOLLARDS: 22.0 m. HANDLING EQUIPMENTS: 10 T SWL shore crane, 4 forklifts. Lashing/Unlashing gangs available. DISCHARGING RATES: Scrap: 6.000 mt/day Ore: 5.000 mt/day Cargoes in bag: 3.500 mt/day Logs: 5.000 mt/day Loading rates; Steel bars: 8.000 mt/day NATURE OF SEA BOTTOM: Sand. FIRE FIGHTING: By server pomp from sea side. DENSITY: 1028 WORKING HOURS: operates 24 hours a day year round, FRESH WATER: available. BUNKER: available. AIRPORT: At Adana distance 110 km from the port. GARBAGE DISPOSAL: service is available. WASTE OIL DISPOSAL: service is available., 60850=ISKENDERUN BAY. 36 37' N 036 07' E Iskenderun Bay is located on the North-East end of the Eastern Mediterranean, accommodating governmental and private berths and installations. Due to their geographical proximity, these facilities include oil terminals and dry cargo ports, also serving as gateways to the Middle Eastern countries. A number of these ports and jetties were built to serve specific purposes, such as importing minerals, ores, fertilizers, and scrap and exporting iron and steel oil exports piped from Iraq and probably from Middle Asia in the near future. Iskenderun bay is now busy commercial centers and an important ports of Turkey. FORECAST: port officials at Iskenderun state that there are two weather scenarios that pose the greatest threat to operations at the port. The first, and most hazardous, is a southeasterly wind locally called \"Yarikkaya\". The winds funnel though the valley that intersects the Nur Mountains southeast of the port. The southeast winds occasionally reach 64 kt or greater. During an average year, the wind will occur about seven times during the September to April period. The effect of the strong wind is to cause ships in the anchorage to drag anchor and, in some cases, even part the anchor chain. Ships in the inner harbor must be carefully secured during such events, using tugs if necessary to keep ships at their berths. It is suggested that ships in the anchorage move southwestward about 10 nmi to a location away from the funneling and better sheltered from the strong southeasterly winds. Areas closer to shore offer better protection than those farther out. Small boating is usually canceled during Yorikkaya events. The southeasterly winds also affect the NATO fuel pier located about 3.5 nmi north of the main port. During one event, a ship securely moored to the pier was in danger of pulling the pier down as the ship was forced away from its moorings. Two tugs were required to restrain the ship before it was feasible to move it to a safe anchorage. The second most trouble some phenomenon is a northerly wind which can reach 40 to 50 kt, and be accompanied by 6.5 to 10 ft swell at the anchorage. The effect is also felt at pier 1, because it is exposed to northerly winds and waves that pass through the harbor entrance. Ships moored to pier 1 are moved in order to avoid potential damage resulting from being forced onto the pier. According to port authorities, shelter from the northerly winds can be found across the bay about 5 nmi east of Yumurtalik. Forecasts of these and other meteorological events are broadcast in Turkish on VHF channels 16 and 67 and updated every three hours. . (You can receive the broadcast in English on VHF if you required) PILOTAGE : is compulsory for vessels entering or leaving the ports. , Call Pilots on VHF channels 16, or their self channels three hours before arrival at the ports. There are four pilot stations at Iskenderun bay., 72251=TOWAGE: is provided by the Medmarine , TCDD, Sanmar, Isdemir & Botas and mooring boat arranged by pilot., 138754=STORAGE AREAS: Open 6.000 sq.m closed 18.184 sq.m, 12 chemical tanks total 61.000 cb.m.; (5xPhosacid Tanks, 5xSulphacid Tanks, 2xJet Oil Tanks - Naphtha). NATURE OF SEA BOTTOM: Sand. DENSITY: 1028 WORKING HOURS: operates 24 hours a day year round, FRESH WATER: available. BUNKER: available. AIRPORT: At Adana distance 125 km from the port. GARBAGE DISPOSAL: service is available WASTE OIL DISPOSAL: service is not available., 57877=CARGO HANDING EQUIPMENT: 3 shore cranes of 5 to 10 tones cap. 2 Mobile cranes of 15 to 35 tones cap. CARGO HANDLING RATES: by grab, shore and vessels' cranes; 2.000 tons/day for bulk, 500 tons/day for paper. CONTAINER FACILITIES: Unavailable BULK HANDING FACILITIES: Shore cranes and grabs are used STORAGE AREA: open 210.000 sq.m., covered 9.000 sq.m. DENSITY: 1026 WORKING HOURS: operates 24 hours a day year round, FRESH WATER: available. BUNKER: service is not available. AIRPORT: At Adana distance apprx. 200 km from the port. GARBAGE DISPOSAL: service is not available}",
    "lastModified": "Sat, 18 Dec 2010 13:29:33 GMT",
    "textBeforeTable": "OPERATED BY: Seka Mediterranean Paper Mill TELEPHONE: (324) 741 25 91 FAX: (324) 741 49 97 LOCATION: Lat: 36 18 N Long: 33 53 E PILOTAGE: Compulsory. Provided by the Seka Paper Mill Administration TOWAGE: there are three tugboats compulsory for the vessels more by the Seka Paper Mill BERTHING: The port is protected by two breakwaters 1420m. and 440 m. long       MERSIN SEKA PAPER PIER               OPERATED BY: Tasucu Municipality LOCATION: Lat. 36 18 N Long: 33 53 E DESCRIPTION OF THE PORT: The pier is",
    "textAfterTable": "CARGO HANDING EQUIPMENT: 3 shore cranes of 5 to 10 tones cap. 2 Mobile cranes of 15 to 35 tones cap. CARGO HANDLING RATES: by grab, shore and vessels' cranes; 2.000 tons/day for bulk, 500 tons/day for paper. CONTAINER FACILITIES: Unavailable BULK HANDING FACILITIES: Shore cranes and grabs are used STORAGE AREA: open 210.000 sq.m., covered 9.000 sq.m. DENSITY: 1026 WORKING HOURS: operates 24 hours a day year round, FRESH WATER: available. BUNKER: service is not available. AIRPORT: At Adana distance apprx. 200 km from the port. GARBAGE DISPOSAL: service is not available               ISKENDERUN BAY    ",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}