{
    "relation": [
        [
            "Patent application number",
            "20130074009",
            "20150058378"
        ],
        [
            "Description",
            "METHOD AND SYSTEM FOR MATCHING APPROPRIATE CONTENT WITH USERS BY MATCHING CONTENT TAGS AND PROFILES - A method and system is provided for classifying and labeling information content and also for profiling a user for accessing the information content, both using a coordinated labeling technique so that content from multiple sources may be searched, identified and/or presented to the user according to the user's profile. This technique provides an ongoing update of information content and sources while filtering out unnecessary information that is irrelevant to the user's profile, resulting in focused availability of information to the user. The user profile is matched with content of interest and matching content information may automatically be updated and made available to a user, in conformity with the user's profile. Content providers may now jointly use a common labeling scheme to improve the experience of their users and to provide content providers a technique to associate users with common facets of classification.",
            "METHOD AND SYSTEM FOR MATCHING APPROPRIATE CONTENT WITH USERS BY MATCHING CONTENT TAGS AND PROFILES - A method and system is provided for classifying and labeling information content and also for profiling a user for accessing the information content, both using a coordinated labeling technique so that content from multiple sources may be searched, identified and/or presented to the user according to the user's profile. This technique provides an ongoing update of information content and sources while filtering out unnecessary information that is irrelevant to the user's profile, resulting in focused availability of information to the user. The user profile is matched with content of interest and matching content information may automatically be updated and made available to a user, in conformity with the user's profile. Content providers may now jointly use a common labeling scheme to improve the experience of their users and to provide content providers a technique to associate users with common facets of classification."
        ],
        [
            "Published",
            "03-21-2013",
            "02-26-2015"
        ]
    ],
    "pageTitle": "Jones, PA - Patent applications",
    "title": "",
    "url": "http://www.faqs.org/patents/inventor/jones-pa-3/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989042.37/warc/CC-MAIN-20150728002309-00043-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 441322627,
    "recordOffset": 441293226,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Gregory L. Jones, Warren Center, PA US //]]> BarDraw('4119122',['Patent applications by Graham Jones, Blue Bell, PA US'],[[1,1,1]],['2012','2014','2015'],0); // <script type=\"text/javascript\"> </div> <div id=\"legend4119122\" align=\"center\"></div> </div> <canvas id=\"bg4119122\" style=\"max-width: 500px; width: 100%;\"></canvas> <div> <p align=\"center\">Patent applications by Graham Jones, Blue Bell, PA US</p> <div class=\"bar4119122\" style=\"max-width: 500px; width: 100%; float:left; \"> <div align=\"left\" style=\"padding-top:20px;\"> </table> </tbody> </tr> <td>05-21-2015</td> <td><a href=\"/patents/app/20150141381\">TETRACYCLINE COMPOUNDS HAVING TARGET THERAPEUTIC ACTIVITIES</a> - Methods and compounds for treating diseases with tetracycline compounds having a target therapeutic activity are described.</td> <td>20150141381</td> <tr> </tr> <td>11-20-2014</td> <td><a href=\"/patents/app/20140343020\">METHODS OF USING SUBSTITUTED TETRACYCLINE COMPOUNDS TO MODULATE RNA</a> - A method for modulating RNA with tetracycline compounds is described.</td> <td>20140343020</td> <tr> </tr> <td>09-27-2012</td> <td><a href=\"/patents/app/20120245130\">Methods of Using Substituted Tetracycline Compounds to Modulate RNA</a> - A method for modulating RNA with tetracycline compounds is described.</td> <td>20120245130</td> <tr> </tr> <th>Published</th> <th>Description</th> <th>Patent application number</th> <tr> <tbody> <table class=\"preltab\" id=\"inv_tab_4119122\"> <h2>Graham Jones, Blue Bell, PA US</h2> </table> </tbody> </tr> <td>06-07-2012</td> <td><a href=\"/patents/app/20120137861\">BANDOLIER WITH LATERALLY OFFSET AND SPACED WORK PIECE</a> - A method of operating a progressive die wherein the progressive die acts on a work piece having an elongated body with a blank at one end. The work piece is supported by a bandolier which is also formed in the progressive die. The progressive die acts on each blank.</td> <td>20120137861</td> <tr> </tr> <td>07-08-2010</td> <td><a href=\"/patents/app/20100170321\">BANDOLIER WITH LATERALLY OFFSET AND SPACED WORK PIECE</a> - A method of operating a progressive die wherein the progressive die acts on a work piece having an",
    "textAfterTable": "Gregory Scott Jones, Langhorne, PA US Patent application number Description Published 20090054303 CRYSTAL FORMS OF SAXAGLIPTIN AND PROCESSES FOR PREPARING SAME - Physical crystal structures of a compound of the formula I: 02-26-2009 Howard Jones, Schwencksville, PA US Patent application number Description Published 20090077922 Removable Wallboard System - The present invention is a novel removable wallboard system. It includes a plurality of receiver strips [ 03-26-2009 Isaiah Jones, Upper Darby, PA US Patent application number Description Published 20150150374 DESK AND CHAIR COMBINATION DEVICE AND A METHOD FOR ITS USE - The present device is a chair desk combination device configured to provide a lounge chair comprising a reclined backrest and a substantially flat footrest for relaxing and a desk/chair combination configured to support an ergonomic posture and flat surface for working. The present device can comprise a cushion having a backrest, seat section, middle section and footrest, wherein the footrest can function as a desk. This cushion can be supported by a pedestal, which can conform to the shape of the cushion. 06-04-2015 James B. Jones, Lewisburg, PA US Patent application number Description Published 20150073829 METHOD AND SYSTEM FOR DISTRIBUTING PATIENT DATA AND PATIENT STATUS NOTIFICATIONS - A method for distributing patient data includes: storing patient data entries,",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}