{
    "relation": [
        [
            "Citing Patent",
            "US6371298 *",
            "US7216574",
            "US7530558",
            "US7681871",
            "US8474359 *",
            "US8757607 *",
            "US20110078906 *"
        ],
        [
            "Filing date",
            "Mar 5, 2001",
            "Apr 23, 2004",
            "Sep 11, 2006",
            "Mar 2, 2008",
            "Oct 1, 2010",
            "Jun 6, 2013",
            "Oct 1, 2010"
        ],
        [
            "Publication date",
            "Apr 16, 2002",
            "May 15, 2007",
            "May 12, 2009",
            "Mar 23, 2010",
            "Jul 2, 2013",
            "Jun 24, 2014",
            "Apr 7, 2011"
        ],
        [
            "Applicant",
            "Blain C. Bowman",
            "Woods Charles A",
            "Edison Nation, Llc",
            "Edison Nation, Llc",
            "Colleen Clinger George",
            "Abraham Benaksas",
            "George Colleen C"
        ],
        [
            "Title",
            "Adjustable cutting board apparatus",
            "Food slicing apparatus",
            "Cutting board assembly having drawer with variable volume containment space",
            "Cutting board assembly having cutting board storage recess",
            "Grape cutter",
            "Food slicer",
            "Grape cutter"
        ]
    ],
    "pageTitle": "Patent US5924352 - Adjustable slicer guide - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US5924352?ie=ISO-8859-1",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 6,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988860.4/warc/CC-MAIN-20150728002308-00122-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 482116905,
    "recordOffset": 482100511,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Patent Citations Although the present invention has been described with reference to preferred embodiments, workers skilled in the art will recognize that changes may be made in form and detail without departing from the spirit and scope of the invention. FIG. 11 shows show the pads mate with shims in the preferred embodiment to provide the configuration shown in FIG. 4A. The primary pads 300, 304, 308 mate with the tallest shims, i.e., shims 303, 307 and 311, respectively. This provides a spacing of about 0.125 inches between the cutting surface 60 and cutting guide surface 50. FIG. 10 shows how the pads 90 mate with the shims 91 in the preferred embodiment to provide the configuration shown in FIG. 4B. The primary pads 300, 304, 308 mate with shims 202, 206, and 210, respectively. This provides a spacing of about 0.25 inches between cutting surface 60 and cutting guide surface 50. FIG. 9 shows how the pads 90 mate with the shims 91 in the preferred embodiment to provide the configuration shown in FIG. 4C. Primary pads 300 and 308 mate with the smallest shims, i.e., shims 201 and 209, respectively. The intermediate pad 301 mates with shim 202. This provides spacing of about 0.5 inches between the cutting surface 60 and the cutting guide surface 50. Primary pad 304 does not mate with a shim 91 or lay on the baseplate 25. The third point in",
    "textAfterTable": "Filing date Publication date Applicant Title US6371298 * Mar 5, 2001 Apr 16, 2002 Blain C. Bowman Adjustable cutting board apparatus US7216574 Apr 23, 2004 May 15, 2007 Woods Charles A Food slicing apparatus US7530558 Sep 11, 2006 May 12, 2009 Edison Nation, Llc Cutting board assembly having drawer with variable volume containment space US7681871 Mar 2, 2008 Mar 23, 2010 Edison Nation, Llc Cutting board assembly having cutting board storage recess US8474359 * Oct 1, 2010 Jul 2, 2013 Colleen Clinger George Grape cutter US8757607 * Jun 6, 2013 Jun 24, 2014 Abraham Benaksas Food slicer US20110078906 * Oct 1, 2010 Apr 7, 2011 George Colleen C Grape cutter * Cited by examiner Classifications",
    "hasKeyColumn": true,
    "keyColumnIndex": 3,
    "headerRowIndex": 0
}