{
    "relation": [
        [
            "Date",
            "Sep 11, 2001",
            "Jan 27, 2004",
            "Jan 17, 2008",
            "Jan 27, 2012",
            "Apr 27, 2015",
            "May 21, 2015"
        ],
        [
            "Code",
            "CC",
            "FPAY",
            "FPAY",
            "FPAY",
            "AS",
            "AS"
        ],
        [
            "Event",
            "Certificate of correction",
            "Fee payment",
            "Fee payment",
            "Fee payment",
            "Assignment",
            "Assignment"
        ],
        [
            "Description",
            "",
            "Year of fee payment: 4",
            "Year of fee payment: 8",
            "Year of fee payment: 12",
            "Owner name: AMERITECH SERVICES, INC., ILLINOIS Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNOR:BENNETT, RAYMOND W.;REEL/FRAME:035505/0574 Effective date: 19961105",
            "Owner name: MICHIGAN BELL TELEPHONE COMPANY, MICHIGAN Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNOR:AMERITECH SERVICES, INC.;REEL/FRAME:035686/0949 Effective date: 20150518 Owner name: INDIANA BELL TELEPHONE COMPANY INCORPORATED, INDIA Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNOR:AMERITECH SERVICES, INC.;REEL/FRAME:035686/0949 Effective date: 20150518 Owner name: ILLINOIS BELL TELEPHONE COMPANY, ILLINOIS Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNOR:AMERITECH SERVICES, INC.;REEL/FRAME:035686/0949 Effective date: 20150518 Owner name: WISCONSIN BELL, INC., WISCONSIN Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNOR:AMERITECH SERVICES, INC.;REEL/FRAME:035686/0949 Effective date: 20150518 Owner name: THE OHIO BELL TELEPHONE COMPANY, OHIO Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNOR:AMERITECH SERVICES, INC.;REEL/FRAME:035686/0949 Effective date: 20150518"
        ]
    ],
    "pageTitle": "Patent US6112127 - Method and system of programming at least one appliance to change state upon ... - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US6112127?ie=ISO-8859-1",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 8,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042981576.7/warc/CC-MAIN-20150728002301-00299-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 463537119,
    "recordOffset": 463500277,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{36918=This application is a continuation of application Ser. No. 08/746,115, filed Nov. 6, 1996 now U.S. Pat. No. 5,877,957.}",
    "textBeforeTable": "Patent Citations It is to be understood that the forms of the invention described herewith are to be taken as preferred examples and that various changes in the shape, size and arrangement of parts may be resorted to, without departing from the spirit of the present invention or the scope of the claims. While the presently preferred embodiments have been described with reference to communication over power lines, other communications between the intelligent switches and outlets may be used. For example, an RS-485 bus, proprietary bus, RF communication, etc. may be used. The important feature is that the programmable controller, trigger device and programmable device must be able to communicate. Additional devices such as a telephone access module can be incorporated into the home automation system and appear to other system components just like a programmable device. If the user would like to play with the system without permanently changing any programming, they can accept the Explore System option from the Menu 1.0 elicited by pressing the Training button on the whole house console. The sequence starts with a few screens of information and then they are given exactly the same set of prompts as would be seen if they had simply elected to train the system. After they have \"written\" their program, they can explore its operation. When they are finished, the program is either dumped or saved. Once the user has picked a time, the \"Training",
    "textAfterTable": "US5940296 * Sep 16, 1997 Aug 17, 1999 Medar Inc. Method and system for interactively developing a graphical control-flow structure and associated application software for use in a machine vision system US5956025 * Jun 9, 1997 Sep 21, 1999 Philips Electronics North America Corporation Remote with 3D organized GUI for a home entertainment system US5963446 * Aug 21, 1997 Oct 5, 1999 Steeplechase Software, Inc. Extended relay ladder logic for programmable logic controllers US5963886 * May 29, 1997 Oct 5, 1999 Eskom Selective monitoring system * Cited by examiner Referenced by Citing Patent Filing date Publication date Applicant Title US6256378 Jul 12, 1999 Jul 3, 2001 Pointset Corporation Method and apparatus for setting programmable features of an appliance US6281820 Jul 12, 1999 Aug 28, 2001 Pointset Corporation Methods and",
    "hasKeyColumn": true,
    "keyColumnIndex": 2,
    "headerRowIndex": 0
}