{
    "relation": [
        [
            "Date",
            "May 5, 1986",
            "May 6, 1986",
            "Aug 25, 1987",
            "Feb 2, 1990",
            "Feb 9, 1990",
            "Nov 1, 1990",
            "Mar 5, 1991",
            "Nov 13, 1991",
            "Sep 26, 1994",
            "Nov 9, 1998"
        ],
        [
            "Code",
            "AS",
            "AS",
            "CC",
            "AS",
            "AS",
            "FPAY",
            "DI",
            "AS",
            "FPAY",
            "FPAY"
        ],
        [
            "Event",
            "Assignment",
            "Assignment",
            "Certificate of correction",
            "Assignment",
            "Assignment",
            "Fee payment",
            "Adverse decision in interference",
            "Assignment",
            "Fee payment",
            "Fee payment"
        ],
        [
            "Description",
            "Owner name: L ESPERANCE RESEARCH INCORPORATED, 1 EAST 71ST STR Free format text: ASSIGNMENT OF ASSIGNORS INTEREST.;ASSIGNOR:L ESPERANCE, FRANCIS A., JR.;REEL/FRAME:004541/0372 Effective date: 19851016",
            "Owner name: LRI L.P., SUITE 2101, 730 FIFTH AVENUE, NEW YORK, Free format text: ASSIGNMENT OF ASSIGNORS INTEREST.;ASSIGNOR:L ESPERANCE RESEARCH INCORPORATED A CORP. OF N.Y.;REEL/FRAME:004548/0106 Effective date: 19860303 Owner name: LRI L.P., NEW YORK Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNOR:L ESPERANCE RESEARCH INCORPORATED A CORP. OF N.Y.;REEL/FRAME:004548/0106 Effective date: 19860303",
            "",
            "Owner name: TAUNTON RESEARCH INCORPORATED Free format text: MERGER;ASSIGNORS:L ESPERANCE RESEARCH INCORPORATED (INTO);TAUNTON ACQUISITION CORPORATION (UNDER THE NAME);REEL/FRAME:005253/0639 Effective date: 19900108",
            "Owner name: L ESPERANCE RESEARCH INCORPORATED Free format text: DUE TO THE DISSOLUTION OF THE PARTNERSHIP, ALL ASSETS WERE TRANSFERRED TO SAID ASSIGNEE;ASSIGNOR:LRI L.P.;REEL/FRAME:005284/0383 Owner name: L ESPERANCE RESEARCH INCORPORATED, A CORP. OF DE Free format text: MERGER;ASSIGNORS:L ESPERANCE RESEARCH INCORPORATED, A CORP. OF NY (MERGED INTO);LRI ACQUISITION CORP., A CORP. OF DE (CHANGED TO);REEL/FRAME:005284/0916 Effective date: 19890531",
            "Year of fee payment: 4",
            "Effective date: 19910116",
            "Owner name: VISX, INCORPORATED Free format text: ASSIGNMENT OF ASSIGNORS INTEREST.;ASSIGNOR:TAUNTON RESEARCH INCORPORATED;REEL/FRAME:005913/0520 Effective date: 19911004",
            "Year of fee payment: 8",
            "Year of fee payment: 12"
        ]
    ],
    "pageTitle": "Patent US4665913 - Method for ophthalmological surgery - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US4665913?dq=5,664,133",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 9,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042981576.7/warc/CC-MAIN-20150728002301-00316-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 471695443,
    "recordOffset": 471649111,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{79435=While the invention has been descrbed in detail for various illustrative embodiments and modes, it will be understood that modifications may be made without departing from the scope of the invention. For example, what has been described above as manual means 51 to preset the angle at which astigmatic correction is to be achieved, may in fact be an automatically driven setting of the astigmatic-correction angle, wherein the angle-input data for making the automatic drive is produced by a diagnostic system or method as described in my copending patent application, Ser. No. 691,923, filed Jan. 16, 1985., 50269=This applicaton is a continuation-in-part of copending application Ser. No. 552,983, filed Nov. 17, 1983, which will be abandoned.}",
    "textBeforeTable": "Patent Citations Still further, it will be understood that the radial keratotomy described in connection with FIG. 10 is illustrative of but one of a variety of keratotomy procedures to which the invention is applicable. For example, because of the great precision with which laser scan action can be microprocessor-controlled, the keratotomy may include concentric-circle loci of ablative incision, and the circular incisions may be full-circle or in a distributed pattern of circular arcs, in angularly interlaced array, as shown in FIG. 10A, the full circles or the circular arcs being with or without connected or disconnected radial incisions, as the surgeon may deem best for his particular patient's purposes. Also, as illustrated in FIG. 10B, a radial keratotomy may be implemented, again with microprocessor control of scan action with further incisions (as at 60) transverse to, and preferably not intersecting with, a particular orientation of radial incisions 61, where the radial incisions 61 are oriented to accord with the axis for which an astigmatic correction is to be made. Also, it will be understood that, although preferred, it is not necessary to limit area-scanning to the circular perimeter P when sculpting for astigmatism correction. The circle perimeter P represents a preferred minimum area of ablative sculpture, being that maximum circular area involved for sight under dilated-pupil conditions, e.g., about 7-mm diameter. However, the corneal-area outside this perimeter P is not required for best central sight and therefore",
    "textAfterTable": "A Technique for the Selective Heating of Corneal Stroma , by Doss et al., Contact and Intraocular Lens Med. Jour., vol. 6, No. 1, 1980, pp. 13 17. 8 * Advanced Techniques in Opthalmic Microsurgery by L. Girard, published 1981, pp. 84, 107 110, 114, 116, 123, 125 133 and 143 171. 9 * An Electrothermal Technique for the Alteration of Corneal Curvature , by Doss et al., Informal Report, 2/78. 10 * Extreme Sensitivity in the Corneal Epithelium to Far UV ArF Excimer Laser Pulse by J. Taboda et al., Aerospace Medical Association 1981 Meeting, San Antonio, TX. 11 * Laser Elektrooptik, vol. 10, No. 1, Mar. 1978, The Laser Micro Beam as a Tool for Tissue Sampling in Biochemistry . 12 * Laser Focus, vol. 18, No. 1, Jan. 1982, pp. 57 58, H. T. Powell: Excimers . 13 Laser Focus, vol. 18, No. 1, Jan. 1982, pp. 57-58, H. T. Powell: \"Excimers\". 14 Laser Focus, vol. 20, No. 10, Oct., 1984,",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}