{
    "relation": [
        [
            "Citing Patent",
            "US7110917",
            "US7317962",
            "US7416142",
            "US8630944",
            "US9047652",
            "EP1861834A1 *",
            "WO2006081148A1 *",
            "WO2006081227A1 *"
        ],
        [
            "Filing date",
            "Nov 15, 2004",
            "Jan 25, 2005",
            "Jan 25, 2005",
            "Jul 28, 2011",
            "Aug 1, 2012",
            "Mar 8, 2006",
            "Jan 23, 2006",
            "Jan 23, 2006"
        ],
        [
            "Publication date",
            "Sep 19, 2006",
            "Jan 8, 2008",
            "Aug 26, 2008",
            "Jan 14, 2014",
            "Jun 2, 2015",
            "Dec 5, 2007",
            "Aug 3, 2006",
            "Aug 3, 2006"
        ],
        [
            "Applicant",
            "Ricoh Company, Ltd.",
            "Count & Crush, Llc",
            "Count & Crush Llc",
            "Count & Crush Systems, Llc",
            "Count & Crush Systems, Llc",
            "Telepant EHF",
            "Count And Crush Llc",
            "Count And Crush Llc"
        ],
        [
            "Title",
            "Abnormality determining method, and abnormality determining apparatus and image forming apparatus using same",
            "Methods and apparatus for managing information related to recyclable containers",
            "Methods and apparatus for processing recyclable containers",
            "Charitable donation of proceeds from recycling activity",
            "Methods and apparatus for managing information in connection with an account-based recycling program",
            "Method of converting deposit value of recycling empties into means of payment at a service and/or goods supplier and an apparatus for use at the exercise of the method",
            "Methods and apparatus for managing information related to recyclable containers",
            "Methods and apparatus for processing recyclable containers"
        ]
    ],
    "pageTitle": "Patent US20030215260 - Recycling apparatus, recycling method, and recycled product - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US20030215260?dq=D523,461",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 6,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987135.9/warc/CC-MAIN-20150728002307-00003-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 474871407,
    "recordOffset": 474840340,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{50893=[0036] As a conventional technique for solving the second problem, there is a recycling system of recycling waste industrial products described in Japanese Patent Application Laid-Open No. 2000-84532. According to this recycling system, an electronic tag is attached to a waste product. When a waste product is received from a user, a reader/writer is used to write basic data necessary for the processing into the electronic tag. Thereafter, the reader/writer is used to read the information written on the tag or overwrite data on the tag, thereby to decide a proper processing route for each waste product., 92241=[0120] When the service parts are the recycling items, the pre-sorting conditions for the pre-sorting and the post-sorting conditions for the post-sorting are different from the corresponding conditions when the consumables are the recycling items like in the second embodiment. In other words, as shown in FIG. 16, in the third embodiment, a machine part group 1401 a and a glass part group arise in the pre-sorting processing. Further, in the post-sorting process, a mirror lens group 1402 a and a fluorescent lamp group 1402 b arise, in addition to the iron group and the aluminum group., 88339=[0111] The recovered consumables are temporarily stored in each assembly material handling 1001. The weight of the consumables is managed for each assembly material handling 1001. The consumables are sorted into groups, each group having consumables of substantially the same size and weight. Therefore, the number of consumables accommodated in each assembly material handling 1001 is substantially constant. As a result, it is possible to obtain the total weight of the recovered consumables, based on the type of the consumables accommodated in each assembly material handling 1001 and the number of the assembly material handlings 1001. It is of course possible to accurately manage the total weight of the consumables by measuring the weight of each assembly material handling 1001., 46054=[0027] The recycling system described in Japanese Patent Application Laid-Open No. 2000-181958 is used mainly in office automation (hereinafter, “OA”) equipment such as a copying machine. It is also possible to extensively utilize this system in other products such as a home electric appliance and an automobile., 52161=[0038] When the system of recycling waste industrial products described in Japanese Patent Application Laid-Open No. 2000-84532 is applied to consumables, it is possible to efficiently manage the consumables. However, the work of writing and reading data to/from each one electronic tag attached to each consumable item is troublesome. There is relatively small difference in sizes between the electronic tag and a consumable item such as the cartridge. Therefore, at the time of recovering and transporting consumables, the electronic tags have an inconvenience of lowering the transportation efficiency of the consumables to a half., 87757=[0110] The five kinds of consumables are grouped into each pre-sorting group 1001 as shown in FIG. 10. The consumables are recovered in respective material handlings 901. FIG. 10 shows a state that the consumables are sorted into five groups, and are accommodated in respective material handlings 901 sorted in five groups. Each type of material containers is transferred the assembly material handling 1001 corresponding to each group. A palletainer may be used for the assembly material handling 1001., 46412=[0028] The recycling system described in Japanese Patent Application Laid-Open No. 2000-181958 can effectively realize a plurality of types of recycling methods in parallel. However, in some cases, it is difficult to implement the recycling unless the system is concretized to the characteristics of the item to be recycled such as consumable goods, for example., 89276=[0113] The assembly material handlings 1001 are transported from the recovery center to the recycling center. In this case, the assembly material handlings 1001 are stacked on the transporting unit such as a truck, as shown in FIG. 11, which can improve the load efficiency of a transportation container 1101., 103233=[0147] The present document incorporates by reference the entire contents of Japanese priority document, 2002-060956 filed in Japan on Mar. 6, 2002., 41464=[0021] There is a recycling system described in Japanese Patent Application Laid-Open No. 2000-181958 as a conventional system that can effectively carry out the above recycling processing. FIG. 17 explains about the recycling system described in Japanese Patent Application Laid-Open No. 2000-181958. This recycling system has a plurality of stages as denoted by reference numerals 1 to 20. The stage 1 shows a production of a raw material. In general, a raw material supplier produces and supplies this raw material. The stage 2 shows a production of a raw material that uses a new raw material or a reproduced raw material. In general, a material manufacturer produces and supplies this material.}",
    "textBeforeTable": "Patent Citations [0148] Although the invention has been described with respect to a specific embodiment for a complete and clear disclosure, the appended claims are not to be thus limited but are to be construed as embodying all modifications and alternative constructions that may occur to one skilled in the art which fairly fall within the basic teaching herein set forth. [0147] The present document incorporates by reference the entire contents of Japanese priority document, 2002-060956 filed in Japan on Mar. 6, 2002. [0146] According to a twenty-sixth aspect of the present invention, there is an effect that it is possible to provide a recycled product manufactured based on a method of manufacturing a recycling product that can prevent powder from flying in all directions in the air during a sorting work, and prevent powder or liquid from staining other parts during a recycling processing thereby lowering the values of these other parts as recycling items. [0145] According to a twenty-fifth aspect of the present invention, there is an effect that it is possible to provide a recycled product manufactured based on a method of manufacturing a recycling product that can increase the efficiency of the recycling processing, by grouping powder and efficiently recycling the group of powder at one position. [0144] According to a twenty-fourth aspect of the present invention, there is an",
    "textAfterTable": "US7110917 Nov 15, 2004 Sep 19, 2006 Ricoh Company, Ltd. Abnormality determining method, and abnormality determining apparatus and image forming apparatus using same US7317962 Jan 25, 2005 Jan 8, 2008 Count & Crush, Llc Methods and apparatus for managing information related to recyclable containers US7416142 Jan 25, 2005 Aug 26, 2008 Count & Crush Llc Methods and apparatus for processing recyclable containers US8630944 Jul 28, 2011 Jan 14, 2014 Count & Crush Systems, Llc Charitable donation of proceeds from recycling activity US9047652 Aug 1, 2012 Jun 2, 2015 Count & Crush Systems, Llc Methods and apparatus for managing information in connection with an account-based recycling program EP1861834A1 * Mar 8, 2006 Dec 5, 2007 Telepant EHF Method of converting deposit value of recycling empties into means of payment at a service and/or goods supplier and an apparatus for use at the exercise of the method WO2006081148A1 * Jan 23, 2006 Aug 3, 2006 Count",
    "hasKeyColumn": true,
    "keyColumnIndex": 3,
    "headerRowIndex": 0
}