{
    "relation": [
        [
            "Citing Patent",
            "US7601180",
            "US7717964",
            "US7727287",
            "US7736631 *",
            "US7744657",
            "US7744658",
            "US7780743",
            "US8038731",
            "US8038732",
            "US8070830",
            "US8562693",
            "US8685114",
            "US20050031563 *"
        ],
        [
            "Filing date",
            "Jan 11, 2007",
            "Sep 19, 2008",
            "Sep 19, 2008",
            "Apr 1, 2004",
            "Sep 19, 2008",
            "Sep 19, 2008",
            "Mar 23, 2007",
            "Mar 23, 2007",
            "Mar 23, 2007",
            "Mar 23, 2007",
            "Nov 19, 2012",
            "Oct 10, 2013",
            "Apr 1, 2004"
        ],
        [
            "Publication date",
            "Oct 13, 2009",
            "May 18, 2010",
            "Jun 1, 2010",
            "Jun 15, 2010",
            "Jun 29, 2010",
            "Jun 29, 2010",
            "Aug 24, 2010",
            "Oct 18, 2011",
            "Oct 18, 2011",
            "Dec 6, 2011",
            "Oct 22, 2013",
            "Apr 1, 2014",
            "Feb 10, 2005"
        ],
        [
            "Applicant",
            "L'oreal S.A.",
            "L'oreal S.A.",
            "L'oreal S.A.",
            "L'oreal S.A.",
            "L'oreal S.A.",
            "L'oreal S.A.",
            "L'oreal S.A.",
            "L'oreal S.A.",
            "L'oreal S.A.",
            "L'oreal S.A.",
            "L'oreal",
            "L'oreal",
            "Luc Gourlaouen"
        ],
        [
            "Title",
            "Use for the dyeing with lightening effect of keratin substances of a composition comprising a fluorescent cyanine dye",
            "Styryl thiol/disulfide compound with a hydroxy(cyclo)alkylamino unit, process for lightening keratin materials using same",
            "Hemicyanin styryl thiol/disulfide dye, composition comprising hemicyanin styryl thoil/disulfide dye, and method for lightening keratin materials using hemicyanin styryl thiol/disulfide dye",
            "Cosmetic dye composition with a lightening effect for human keratin materials, comprising at least one fluorescent dye and at least one aminosilicone, and process of dyeing",
            "Styrl tetrahydroquinolinium thiol/disulfide dye compound and method for lightening keratin materials using the same",
            "Indole-derived styryl dye comprising an alkylene linker, a dye composition comprising this dye, and a process for lightening keratin materials using this dye",
            "Fluorescent entity, dyeing composition containing at least one fluorescent entity, and method for lightening keratin materials using said at least one fluorescent entity",
            "Method of dyeing and lightening keratin materials in the presence of a reducing agent comprising a fluorescent disulphide dye",
            "Fluorescent entity, dyeing composition containing at least one fluorescent entity, and method for lightening keratin materials using said at least one fluorescent entity",
            "Fluorescent entity, dyeing composition containing at least one fluorescent entity comprising at least one heterocycle, with at least one internal cationic charge, and method for lightening keratin materials using said at least one fluorescent entity",
            "Method of dyeing and lightening keratin materials in the presence of a reducing agent comprising a fluorescent deisulphide dye",
            "Composition for dyeing and lightening keratin materials comprising a fluorescent deisulphide dye compound",
            "Cosmetic dye composition with a lightening effect for human keratin materials, comprising at least one fluorescent dye and at least one aminosilicone, and process of dyeing"
        ]
    ],
    "pageTitle": "Patent US7195651 - Cosmetic composition for dyeing human keratin materials, comprising at least ... - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US7195651?dq=6076065",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 8,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042981576.7/warc/CC-MAIN-20150728002301-00044-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 468552535,
    "recordOffset": 468503164,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{180720=The at least one additional direct dye may be for example, chosen from basic dyes, among which non-limiting mention may be made of, for example, the dyes known in the Color Index, 3rd edition, under the names “Basic Brown 16,” “Basic Brown 17,” “Basic Yellow 57,” “Basic Red 76,” “Basic Violet 10,” “Basic Blue 26” and “Basic Blue 99”, or chosen from acidic direct dyes, among which non-limiting mention may be made of, for example, the dyes known in the Color Index, 3rd edition, under the names “Acid Orange 7,” “Acid Orange 24,” “Acid Yellow 36,” Acid Red 33,” “Acid Red 184,” “Acid Black 2,” “Acid Violet 43” and “Acid Blue 62”, or chosen from cationic direct dyes such as those described in WO 95/01772, WO 95/15144 and EP 714,954, the content of which is incorporated herein by reference., 200015=The lightening of the hair is evaluated by the “tone height,” which characterizes the degree or level of lightening. The notion of “tone” is based on the classification of the natural shades, one tone separating each shade from the shade immediately following or preceding it. This definition and the classification of the natural shades are well known to hairstyling professionals and are published in the book Sciences des traitements capillaires [Hair treatment sciences] by Charles Zviak, 1988, published by Masson, pp. 215 and 278., 100789=This application claims benefit of U.S. Provisional Application No. 60/467,548, filed May 5, 2003.}",
    "textBeforeTable": "Patent Citations A marked lightening effect is obtained on the locks that were thus treated. The locks were then rinsed and dried under a hood for 30 minutes. Each composition was applied to a lock of natural chestnut-brown hair (tone height 4) and left on the hair for 20 minutes. Coloration (**) crosslinked methacryloyloxyethyltrimethylammonium chloride homopolymer (Ciba) (*) dimethyldiallylammonium chloride homopolymer (Nalco) qs 100% qs 100% Distilled water 1% — Salcare SC95 (**) — 1% Merquat 100 (*) 1% 1% Fluorescent compound 2 1 Composition Compositions",
    "textAfterTable": "US3227615 May 29, 1962 Jan 4, 1966 Hercules Powder Co Ltd Process and composition for the permanent waving of hair US3472840 Sep 14, 1965 Oct 14, 1969 Union Carbide Corp Quaternary nitrogen-containing cellulose ethers US3632559 Sep 30, 1968 Jan 4, 1972 Sandoz Ltd Cationically active water soluble polyamides US3639127 Jul 23, 1970 Feb 1, 1972 Eastman Kodak Co Silver halide emulsions containing a dye derived from 4,6-diaryl substituted picolinium salts as desensitizer US3658985 Jul 28, 1969 Apr 25, 1972 Colgate Palmolive Co Oil and fluorescent dye containing luster imparting liquid shampoo US3856550 Sep 12, 1973 Dec 24, 1974 Us Navy Fluorescent visual augmentation composition US3874870 Dec 18, 1973 Apr 1, 1975 Mill Master Onyx Corp Microbiocidal polymeric quarternary ammonium compounds US3910862 Aug 27, 1973 Oct 7, 1975 Gaf Corp Copolymers of vinyl pyrrolidone containing quarternary ammonium groups US3912808 Jun 29, 1972",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}