{
    "relation": [
        [
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            ""
        ],
        [
            "Forum",
            "GTA V PC, Gameplay, Guides & Strategies, Help & Support This forum is dedicated to discussion about the latest installment in the series, Grand Theft Auto V.",
            "GTA IV PC, Gameplay, Episodes from Liberty City, Multiplayer, Guides & Strategies, Help & Support This section is dedicated to Grand Theft Auto IV - the ninth title in the series, released in 2008.",
            "GTA Chinatown Wars This forum is dedicated to GTA: Chinatown Wars - the tenth game in the series, and the first to be developed for Nintendo DS.",
            "GTA Vice City Stories This forum is dedicated to GTA: Vice City Stories - a prequel to GTA: Vice City, released in 2006.",
            "GTA Liberty City Stories This forum is dedicated to GTA: Liberty City Stories - the first 3D portable Grand Theft Auto title, released in 2005.",
            "GTA San Andreas Gameplay, Mission Help, Guides & Strategies, Help & Support, PC Modding This forum is dedicated to GTA: San Andreas - the fifth title in the series, released in 2004.",
            "GTA Vice City Gameplay, Guides & Strategies, Help & Support, PC Modding This forum is dedicated to GTA: Vice City - the fourth title in the series, released in 2002.",
            "GTA III Gameplay, Guides & Strategies, Help & Support, PC Modding This section is dedicated to Grand Theft Auto III - the first 3D title in the series, released in 2001.",
            "Top Down Games GTA Advance, GTA 2, GTA This section is dedicated to the 2D Grand Theft Auto titles, including the original, GTA 2, and GTA Advance.",
            "GTA Series GTA Concepts General chat related to the series. This section can also be used to post concept threads for new GTAs."
        ],
        [
            "Stats",
            "85,071 topics 2,123,406 replies",
            "85,546 topics 1,153,522 replies",
            "1,071 topics 11,069 replies",
            "4,218 topics 64,755 replies",
            "5,996 topics 75,807 replies",
            "50,535 topics 466,138 replies",
            "22,766 topics 196,279 replies",
            "4,270 topics 60,430 replies",
            "1,128 topics 8,214 replies",
            "3,597 topics 115,123 replies"
        ],
        [
            "Last Post Info",
            "A Glitch That's So Anno... By CanOdope 12 minutes ago",
            "Reasons why GTA IV is bette... By Mr. Fahrenheit 3 minutes ago",
            "The Ultimate 100% Save File... By Militia 18 hours ago",
            "The Most Underrated GTA Ever By DragonpokeZ 16 hours ago",
            "Why LCS is better than V By GTAKid667 15 hours ago",
            "Favourite glitches By LL Cool L 2 hours ago",
            "Reasons why Vice City is be... By IIOctaneII 3 hours ago",
            "Grand Theft Auto III Pre-Re... By inadequate 11 minutes ago",
            "Anybody has a 100 % savegame? By Cerium 9 hours ago",
            "The No-hope DLC By Arachne 4 minutes ago"
        ]
    ],
    "pageTitle": "GTAForums",
    "title": "",
    "url": "http://gtaforums.com/index.php?act=Post&CODE=06&f=51&t=557229&p=1062571849",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 1,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986022.41/warc/CC-MAIN-20150728002306-00177-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 112023551,
    "recordOffset": 112000811,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{47214=Bing, JSnipe135i, Google, Yahoo, TJGM, CarimboHanky, djrockss2000, DavidTheThird, FMMZ, This Guy Is Here, frontrunner91, jdwarfer, No_Flex_zone, SuperGTFan, eli.g1026, Hyde Original, Shotty Pop, saintsrow, Lowi, Chris CJ Jakobsson, Tony_Florence, WestsideOutlaw187, tonilcs, rvmod, Bondergomme, gts., Allegri32, The Intellect, FEKYeah, RedRyder2142, Xie Deathangelz, missanthropy, A Paradox from 94, universetwisters, Flubbles, T.V. Eye, ngazi, joe grizzly, taklamaka, TarHeelJohn, Arch0n, hotrats773, Jerome, Apex., Whitedodge00, WHAT!?, monkb4skunk, rapidwiz, Dilapidation, Shaundi., crack1king, CrysisAverted, FrankLamar, ProLaps, Greasepalms, Jinx., uNiverselEgacy, Grimase, Joint SpecOps Team, harvecito, Nightmare3883, Sanchez14, Silver le Belge, gizmonomono, InfiniteXV, Giantsgiants, gfen, hotline.n.w.refn, JuZ 75, dyz, MightyMax, TreFacTor, Psoloquoise, slayso, Jason Frost, Irviding, ThaUglyCupcake, KingxGregory, Mr. Fahrenheit, jabloki, KornbreadMaf1a, Facebook, Katabasis, Roadkill01, arewenotmen, Quarthon, SpreeMurder, dyons, Edmachine, dayonefan13, Dijgheocatoru, dbthesuperstar, Th3MaN1, Corndog93, Bob_Dole, whiteskin, SatournFan, Vaymasters, Bane X01, evinaz, stew5556, Google Mobile, Brycespin2003, the_sniper_29, dice, U.N.K.N.O.W.N, Epic., Zondar, The Yokel, Ocelot., EagleStrike, AboveAndBeyoncé, Azurex, oleg_aka_djmeg, Fonshway, NikkoCharger, Sleepingmonster, Arachne, RussianCommie, Alan Eastwood, Abzinth, SPECTER II, Ivan1997GTA, .JokeR, lord tammerlain, Tuff Luv Capo, Claptrap NL, EvilDog77, Officer620, s2n vaniish, JuanG12, hornedturtle, Tycek, Tadzik, NightSpectre, MikeyDLuffy, Owl Man, CjLosSantos, MotelGuy, Payne Killer, Klicksend, timason, elhazard1790000, Bangha, buelly, Zizy, inadequate, DemSkillz2REAL, Big_Boy_Bmw760Li, dTrutha, oreank582894, S1N0D3UTSCHT3K, Gonad McDangle, ehazard750000, Viper5900, Code Haruna, 7 day survivor, B3RTY B0Y, r.lorenzo13, Poohbeartowe, DusterGoliath, Alvarez, v1p3r_eddy, Vova07, PoeticWhisper, CanOdope, Modojo, kasper_hdz, UshaB, Ezekeil2Ofive17, B-Turb0, ZEST, Girish, XxFA2EKILLERxX, pizzapuff1990, Mastapogi, 018361, SaL_Leone, OGxNINO, tossle, Mastah, R3ZA, 14171=This forum is dedicated to GTA: Liberty City Stories - the first 3D portable Grand Theft Auto title, released in 2005., 12625=This forum is dedicated to GTA: Vice City Stories - a prequel to GTA: Vice City, released in 2006., 16430=This forum is dedicated to GTA: San Andreas - the fifth title in the series, released in 2004., 18505=This forum is dedicated to GTA: Vice City - the fourth title in the series, released in 2002., 20645=This section is dedicated to Grand Theft Auto III - the first 3D title in the series, released in 2001., 94708=© 2001-2015 GTANet.com | Cookies and Privacy Policy | Copyright Statement, 9330=This section is dedicated to Grand Theft Auto IV - the ninth title in the series, released in 2008.}",
    "textBeforeTable": "Toggle Grand Theft Auto Grand Theft Auto (adsbygoogle = window.adsbygoogle || []).push({}); 18 minutes ago By Greasepalms [Y] The Yardies 613,416 replies 15,183 topics Social lounge for multiplayer crews & forum gangs. Recruitment Crews & Gangs A minute ago By CrysisAverted Online Screenshots & Sn... 2,278,093 replies 113,159 topics This is a general discussion forum for Grand Theft Auto Online. Help & Support Guides",
    "textAfterTable": "Toggle GTA Mods GTA Mods   Forum Stats Last Post Info GTA Modding GTA V, GTA IV, GTA III, VC & SA, Tutorials, Art Support General discussion and support. 48,438 topics 416,542 replies beginner to mods - where ca... By TJGM 4 minutes ago Mod Showroom Scripts & Plugins, Maps, Total Conversions,",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}