{
    "relation": [
        [
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            ""
        ],
        [
            "Forum",
            "GTA V PC, Gameplay, Guides & Strategies, Help & Support This forum is dedicated to discussion about the latest installment in the series, Grand Theft Auto V.",
            "GTA IV PC, Gameplay, Episodes from Liberty City, Multiplayer, Guides & Strategies, Help & Support This section is dedicated to Grand Theft Auto IV - the ninth title in the series, released in 2008.",
            "GTA Chinatown Wars This forum is dedicated to GTA: Chinatown Wars - the tenth game in the series, and the first to be developed for Nintendo DS.",
            "GTA Vice City Stories This forum is dedicated to GTA: Vice City Stories - a prequel to GTA: Vice City, released in 2006.",
            "GTA Liberty City Stories This forum is dedicated to GTA: Liberty City Stories - the first 3D portable Grand Theft Auto title, released in 2005.",
            "GTA San Andreas Gameplay, Mission Help, Guides & Strategies, Help & Support, PC Modding This forum is dedicated to GTA: San Andreas - the fifth title in the series, released in 2004.",
            "GTA Vice City Gameplay, Guides & Strategies, Help & Support, PC Modding This forum is dedicated to GTA: Vice City - the fourth title in the series, released in 2002.",
            "GTA III Gameplay, Guides & Strategies, Help & Support, PC Modding This section is dedicated to Grand Theft Auto III - the first 3D title in the series, released in 2001.",
            "Top Down Games GTA Advance, GTA 2, GTA This section is dedicated to the 2D Grand Theft Auto titles, including the original, GTA 2, and GTA Advance.",
            "GTA Series GTA Concepts General chat related to the series. This section can also be used to post concept threads for new GTAs."
        ],
        [
            "Stats",
            "85,132 topics 2,125,162 replies",
            "85,560 topics 1,153,902 replies",
            "1,071 topics 11,070 replies",
            "4,218 topics 64,761 replies",
            "5,996 topics 75,815 replies",
            "50,548 topics 466,240 replies",
            "22,767 topics 196,306 replies",
            "4,272 topics 60,469 replies",
            "1,127 topics 8,217 replies",
            "3,605 topics 115,506 replies"
        ],
        [
            "Last Post Info",
            "NEW Money Glitch - Unlimite... By Vinewood Villain A minute ago",
            "Reasons why GTA IV is bette... By Canadian Badass 2 minutes ago",
            "Why does this game receive... By Sayuri 21 hours ago",
            "Whats your favourite radio... By Ivan1997GTA 11 hours ago",
            "Favorite Gang By Mr. Fahrenheit 7 hours ago",
            "GTA San Andreas Remastered... By Opticork An hour ago",
            "In what order did you do th... By The Mysterious One An hour ago",
            "Cool Things You Didn't... By gts. An hour ago",
            "What do you hate of GTA 2? By Vice City criminal 3 hours ago",
            "Lets play a game of \"Wo... By Phnx. A minute ago"
        ]
    ],
    "pageTitle": "GTAForums",
    "title": "",
    "url": "http://gtaforums.com/index.php?act=Post&CODE=06&f=109&t=403594&p=1060301135",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 1,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988511.77/warc/CC-MAIN-20150728002308-00326-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 111697063,
    "recordOffset": 111669570,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{20670=This section is dedicated to Grand Theft Auto III - the first 3D title in the series, released in 2001., 95008=© 2001-2015 GTANet.com | Cookies and Privacy Policy | Copyright Statement, 47422=Bing, Google, Yahoo, DustyRider, Zello, CrysisAverted, Darrel, DiemessGTA, GTA4LIFE9000, Parikshit Singh, inadequate, Warlord., GTAVNoob, shaz7770, AgentExeider, 7 day survivor, Bane X01, undertaker fan, TexasRocks, Edmachine, Jesse.yancey320, deadx23, ZeroSafe5615, enterthekyuubi-v1, lebongjames187, XX7BLAZIN7XX, universetwisters, TheN00ster, Vinewood Villain, Smesi, AuSsIeThUnDeR36, TovarishTony, Phnx., jrl51592, aradeth, TarHeelJohn, Tchuck, Sky_Light12, Google Mobile, thafablifee46, Trevorfirdaus, Monroe585, _F_, Foxtrot64, DeucesR, Reywas1, Hyde Original, Jinx., dyz, statistic, wannaslide, Retired Mafia, arewenotmen, Azurex, DavidTheThird, UshaB, SonofLosSantos, Itsleo69, PS3KillsThe360, Strymon84, GTA3Rockstar, AcidRunner, mxrcg, Zibulaatio, Owl Man, CvrnivalxVenice, stretchx9, WhosYu, This Guy Is Here, Tycek, FertileFuZZ, thewhitehammer99, Facebook, ZEST, junox, Wombater, Killerpro5123, The Tentanator, hanumana, 55d, Pat, //XP//, Scuba 21, Irviding, Lester-The-Molester, JRC99, Z5_Zeus, Svip, WalterS_LV, PSgtaplayer1, kzstone, CoDman182, Hocko1999_fgc, Zyo, SuperGTFan, RamiV2, dreamkileer, moBEttablUesz, longhurstgb, abc999, marvinviray, NightTrainCaine, quadro09, Mika_0013, Craank_AG, TristanAnderson, TG_Stig, DeeDotJaiDot, ire1987, StarFyer, NBAKingzFan10, TheRegisterYouRob, Rysir, S1N0D3UTSCHT3K, TheSkullmasher, gfen, 78 lil red express, nixion, PeppersGhost08, FrixelBoy, alex1369, M.K.N., Blackhailer, Legend2871, Giovas-570-4, Unknown_Modder, Ed_Rich, Stoakzee, HorrA1985, Shrreder2017, Flesh-n-Bone, C64fanatic, Carlover325, KlIIUMlNATl, catmandoza, Raul Passos, HipsterHillbilly, highwayking, Pandassaurus, Kronner, Policce-Car112, Corndog93, CyberGhost101, Tony_Florence, tdavies457, coachcolbert, Lowi, MadeBrazen, yojc, Osho, XxFA2EKILLERxX, Terroryaki, Ivan1997GTA, BeckermannDewitt, Lone Marine, Whiteeey, Presidential, SkittyM, adrilp, NcShane, hamzahk, DANIEL3GS, hornedturtle, Cripto136, SomeDBKid, Biira99, Nikobellic23, mikezilla2, Randy93, GTAGuy1995, Joint SpecOps Team, joe grizzly, Mr. Fahrenheit, helresa, SSKYZX, Caleb3030, chriscarr99, Mastah, Fozzie_420, 12566=This forum is dedicated to GTA: Vice City Stories - a prequel to GTA: Vice City, released in 2006., 9402=This section is dedicated to Grand Theft Auto IV - the ninth title in the series, released in 2008., 14133=This forum is dedicated to GTA: Liberty City Stories - the first 3D portable Grand Theft Auto title, released in 2005., 16346=This forum is dedicated to GTA: San Andreas - the fifth title in the series, released in 2004., 18522=This forum is dedicated to GTA: Vice City - the fourth title in the series, released in 2002.}",
    "textBeforeTable": "Toggle Grand Theft Auto Grand Theft Auto (adsbygoogle = window.adsbygoogle || []).push({}); 10 minutes ago By Jinx. Facade Corporation 613,544 replies 15,210 topics Social lounge for multiplayer crews & forum gangs. Recruitment Crews & Gangs 2 minutes ago By CrysisAverted What cars are you dying to... 2,284,766 replies 113,453 topics This is a general discussion forum for Grand Theft Auto Online.",
    "textAfterTable": "Toggle GTA Mods GTA Mods   Forum Stats Last Post Info GTA Modding GTA V, GTA IV, GTA III, VC & SA, Tutorials, Art Support General discussion and support. 48,468 topics 416,640 replies Get accelerate key. (Diefin... By Unknown_Modder 7 minutes ago Mod Showroom Scripts & Plugins, Maps, Total Conversions, Vehicles,",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}