{
    "relation": [
        [
            "Date",
            "Nov 2, 2001",
            "Apr 29, 2002",
            "Feb 11, 2008",
            "May 29, 2009",
            "Jun 4, 2009",
            "Feb 24, 2012"
        ],
        [
            "Code",
            "AS",
            "AS",
            "FPAY",
            "AS",
            "AS",
            "FPAY"
        ],
        [
            "Event",
            "Assignment",
            "Assignment",
            "Fee payment",
            "Assignment",
            "Assignment",
            "Fee payment"
        ],
        [
            "Description",
            "",
            "",
            "Year of fee payment: 4",
            "Owner name: MEDTRONIC SOFAMOR DANEK, INC., TENNESSEE Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNOR:THIRD MILLENNIUM ENGINEERING, LLC;REEL/FRAME:022746/0383 Effective date: 20080928",
            "Owner name: WARSAW ORTHOPEDIC, INC., INDIANA Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNOR:MEDTRONIC SOFAMOR DANEK, INC.;REEL/FRAME:022773/0631 Effective date: 20090529",
            "Year of fee payment: 8"
        ]
    ],
    "pageTitle": "Patent US6780186 - Anterior cervical plate having polyaxial locking screws and sliding coupling ... - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US6780186?dq=6,249,7726,249,772",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 8,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042982502.13/warc/CC-MAIN-20150728002302-00270-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 468318051,
    "recordOffset": 468296633,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{24989=One screw plate design which has been offered to provide physicians and patients with a reduced risk of pull-out or damage to proximal tissues is the Orion (Reg. Trademark) Anterior Cervical Plate System of Sofamor Danek USA, 1800 Pyramid Place, Memphis, Tenn. 38132. The Orion™ system teaches a plate having two pair of guide holes through which the screws are inserted to fix the plate to the vertebral body. The plate further includes external annular recessions about each of the guide holes which are radially non-symmetric in depth. More particularly, the annular recessions serve as specific angle guides for the screws so that they may be inserted non-perpendicularly with respect to the overall curvature of the plate. In addition, the Orion™ plate includes an additional threaded hole disposed between each of the pairs of guide holes so that a corresponding set screw may be inserted to lock the bone screws to the plate., 18693=The present application is a continuation-in-part of applications U.S. Ser. No. 08/624,110 filed Mar. 29, 1996, Ser. No. 08/632,560 filed Apr. 15, 1996, and Ser. No. 08/788,804, filed Jan. 23, 1997, entitled, “Anterior Spinal Polyaxial Locking ScrewPlate Assembly Having Recessed Retaining Rings”, “Acetabular Cup Having Polyaxial Locking Screws”, and “A Polyaxial Locking Screw And Rod Coupling Element”, respectively, which are now issued as U.S. Pat. Nos. 5,876,402; 5,725,588; and 5,817,094, respectively. Each of said applications was in turn a continuation-in-part of U.S. Ser. No. 08/421,087 filed Apr. 13, 1995 now issued U.S. Pat. No. 5,520,690, entitled “A Posterior Spinal Polyaxial Locking Screw Plate Assembly”. The present application is also a continuation-in-part of co-pending reissue application U.S. Ser. No. 09/774,915, filed Jan. 30, 2001 now U.S. Pat. No. RE37,655 entitled “Polyaxial Pedicle Screw Having a Threaded and Tapered Compression Locking Mechanism”.}",
    "textBeforeTable": "Patent Citations While there has been described and illustrated a cervical implantation device for stabilizing and immobilizing regions of the cervical spine by affixing a polyaxial locking screw plate to the anterior portion of adjacent bones, it will be apparent to those skilled in the art that variations and modifications are possible without deviating from the broad spirit and principle of the present invention which shall be limited solely by the scope of the claims appended hereto. Referring now to FIGS. 4a and 4 b, the pre-assembled and fully assembled screw 120, elongate coupling element 132, and plate 100 are shown, respectively, in cross-section views. As stated previously, the coupling element 132 is snapped into the corresponding elongated tapered through hole 110 of the plate 100. In this initial position, the coupling elements 132 are free to be independently and selectively moved by the surgeon, within the through holes, into the ideal position relative to the vertebral bone to which the assembly is to be affixed. The lower outer lip 137 of the coupling element 132 prevents the coupling element from falling out of the plate 110 in this initial position. Once properly positioned, the surgeon drills holes into the bone in order to prepare the sites for the screws 120 to be advanced thereinto. The screws 120 are then advanced through the interior 140 of the coupling element 132 until the head 122 thereof seats into the",
    "textAfterTable": "Aesculap Implant Systems, Inc. Polyaxial locking screw plate assembly US7419499 Mar 8, 2005 Sep 2, 2008 Aesculap Inc. Spinal stabilization implant and method of application US7476239 May 10, 2005 Jan 13, 2009 Jackson Roger P Polyaxial bone screw with compound articulation US7727266 Jun 17, 2004 Jun 1, 2010 Warsaw Orthopedic, Inc. Method and apparatus for retaining screws in a plate US7763057 Nov 30, 2006 Jul 27, 2010 Custom Spine, Inc. Biased angle polyaxial pedicle screw assembly US7819902 Feb 1, 2005 Oct 26, 2010 Custom Spine, Inc. Medialised rod pedicle screw assembly US7850735 Feb 6, 2004 Dec 14, 2010 Warsaw Orthopedic, Inc. Articular disc prosthesis and method for treating spondylolisthesis US7857838 Sep 17, 2003 Dec 28, 2010 Depuy Products, Inc. Anatomical distal radius fracture fixation plate US7862594 Jan 28, 2005 Jan 4, 2011 Custom Spine, Inc. Polyaxial pedicle screw assembly",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}