{
    "relation": [
        [
            "Citing Patent",
            "US5884773 *",
            "US6827229",
            "US20050029257 *",
            "US20110278188 *",
            "US20120160723 *"
        ],
        [
            "Filing date",
            "Mar 20, 1998",
            "May 16, 2002",
            "Sep 14, 2004",
            "",
            "Mar 31, 2010"
        ],
        [
            "Publication date",
            "Mar 23, 1999",
            "Dec 7, 2004",
            "Feb 10, 2005",
            "Nov 17, 2011",
            "Jun 28, 2012"
        ],
        [
            "Applicant",
            "Unimet Gmbh",
            "Thomas & Betts International, Inc.",
            "Dinh Cong T.",
            "Uwe Steinhardt",
            "Sanofi-Aventis Deutschland Gmbh"
        ],
        [
            "Title",
            "Carrier strip and method of its manufacturing",
            "Electrical box for ceiling fans",
            "Electrical box for ceiling fans",
            "Transport device comprising device for ensuring safe transport of ossicular prosthesis",
            "Fixing Means"
        ]
    ],
    "pageTitle": "Patent US4871062 - Pin carrier - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US4871062?dq=5,687,325",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 6,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042982502.13/warc/CC-MAIN-20150728002302-00143-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 475562874,
    "recordOffset": 475547230,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Patent Citations While I have illustrated and described a preferred embodiment of my invention, it is understood that this is capable of modification, and I therefore do not wish to be limited to the precise details set forth, but desire to avail myself of such changes and alterations as fall within the purview of the following claims. The pin carrier 10 forms a physical connection with pins 12 to orient and hold the pins perpendicularly to the strip in very accurately spaced regular intervals along the length of the strip. The members also form a biased electrical connection between the carrier and the pins so that the carrier may be fed through a plating bath to plate a metal coating on the pins through use of the electrical connections between the pins and strip. The spring beams 34 are elastically deformed during insertion and withdrawal of the pins from the slots 26 providing a relatively constant per pin insertion force and withdrawal force. The force is relatively independent of accumulated dimensional manufacturing tolerances in the retention member and pin, thereby facilitating uniform production insertion and withdrawal of pins from the carrier. The pin carrier may be used to carry relatively small pins having a diameter of about 0.018 inch. Pins are located on a length of carrier 10 with each pin in a desired location within a tolerance of plus or minus 0.001 inch for each pin. The",
    "textAfterTable": "US4002388 * Nov 20, 1975 Jan 11, 1977 I-T-E Imperial Corporation Stab arrangement for busbars US4037915 * Apr 29, 1976 Jul 26, 1977 Comatel - Comptoir Europeen De Materiel Electronique Electrical connector strips US4369572 * Aug 25, 1980 Jan 25, 1983 Plessey Overseas Limited Methods of making electrical connectors US4411361 * May 4, 1982 Oct 25, 1983 L.C.C.-C.I.C.E.-Compagnie Europeenne De Composants Electroniques Supporting strip for capacitor connections, strip provided with such connections and its use for the production of capacitors US4548459 * Aug 31, 1984 Oct 22, 1985 Amp Incorporated Electrical terminal for wires of different gauges US4573569 * Jun 25, 1984 Mar 4, 1986 Parker Dolores V Storage and display case US4749365 * Jan 9, 1987 Jun 7, 1988 George Magnifico Insulation displacement terminal * Cited by",
    "hasKeyColumn": true,
    "keyColumnIndex": 3,
    "headerRowIndex": 0
}