{
    "relation": [
        [
            "Date",
            "Jul 2, 1999",
            "Mar 12, 2001",
            "Apr 6, 2005",
            "Sep 16, 2005",
            "Nov 15, 2005"
        ],
        [
            "Code",
            "AS",
            "FPAY",
            "REMI",
            "LAPS",
            "FP"
        ],
        [
            "Event",
            "Assignment",
            "Fee payment",
            "Maintenance fee reminder mailed",
            "Lapse for failure to pay maintenance fees",
            "Expired due to failure to pay maintenance fee"
        ],
        [
            "Description",
            "Owner name: MICROTECH CO., LTD., KOREA, REPUBLIC OF Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNORS:YOU, DONG-OK;YOU, OK-JUNG;REEL/FRAME:010061/0509 Effective date: 19990624",
            "Year of fee payment: 4",
            "",
            "",
            "Effective date: 20050916"
        ]
    ],
    "pageTitle": "Patent US5668423 - Exciter for generating vibration in a pager - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US5668423?dq=US+6,313,853",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 8,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042982502.13/warc/CC-MAIN-20150728002302-00221-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 463578111,
    "recordOffset": 463559964,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Patent Citations The resultant exciter of this invention employs a blushless type, so that no noise is produced from the exciter. This exciter operates under AC of 1.0 to 220 V and the frequency of the vibration can be easily performed within the scope of 65 to 220 Hz. FIGS. 8A and 8B each shows an exciter having electrode terminals of plate type. This exciter is easily mounted on a main printed circuit board 27 by automatic mounting system. In these figures, reference numeral 29 is a solder. In this figure, the combination structure of the upper housing 35 and the lower housing 34 is somewhat different from that of the first embodiment, and the rotor-receiving space forms a substantially round-shape in the upper and lower housings 34 and 35. The third embodiment employs a structure that the outer guide of the lower housing is broken away and the support strength of each element is increased substantially, while having a simple structure, and simple process is available. This exciter is operated in the same manner with the above-mentioned embodiments. FIG. 7 illustrates a third embodiment of this exciter, where reference numeral 31 is a rotor guide, 32 a rotor, 33 a driving coil, 34 an upper housing, 35 a lower housing, and 36 a rugged type terminal. In the resultant exciter, the upper and lower housings 10 and 12 are made of plastic material having good heat-resistance and",
    "textAfterTable": "Filing date Publication date Applicant Title US5898364 * Aug 6, 1997 Apr 27, 1999 Nec Corporation Electronic equipment having vibration motor US6057753 * Jul 1, 1998 May 2, 2000 Projects Unlimited, Inc. Vibrational transducer US6208238 * Nov 17, 1999 Mar 27, 2001 Citizen Electronics Co., Ltd. Electromagnetic sound generating body US6268671 * Oct 19, 1998 Jul 31, 2001 Alps Electric Co. Ltd. Vibration generation apparatus US6317032 * Dec 2, 1999 Nov 13, 2001 Pioneer Corporation Apparatus for informing a user of predetermined condition by vibration US6323757 * Sep 15, 1999 Nov 27, 2001 Nec Corporation Vibration motor assembly US6342742 * Jul 26, 2000 Jan 29, 2002 Won-Ii Communics Co., Ltd. Vibrator US6465919 * Sep",
    "hasKeyColumn": true,
    "keyColumnIndex": 2,
    "headerRowIndex": 0
}