{
    "relation": [
        [
            "Citing Patent",
            "US8384002",
            "US8393733 *",
            "US8909311",
            "US8926809",
            "US8950068",
            "US8960899",
            "US8971978",
            "US8992610",
            "US9044316",
            "US9047512",
            "US9054079",
            "US9055902",
            "US9063351",
            "US9066796",
            "US9084561",
            "US20100302505 *"
        ],
        [
            "Filing date",
            "May 13, 2011",
            "May 27, 2010",
            "Sep 17, 2013",
            "Sep 20, 2013",
            "Sep 20, 2013",
            "Sep 26, 2012",
            "Aug 21, 2012",
            "Jul 25, 2011",
            "Sep 6, 2011",
            "Jun 13, 2014",
            "Sep 12, 2013",
            "Sep 19, 2013",
            "Sep 28, 2012",
            "Feb 25, 2013",
            "Jun 17, 2013",
            ""
        ],
        [
            "Publication date",
            "Feb 26, 2013",
            "Mar 12, 2013",
            "Dec 9, 2014",
            "Jan 6, 2015",
            "Feb 10, 2015",
            "Feb 24, 2015",
            "Mar 3, 2015",
            "Mar 31, 2015",
            "Jun 2, 2015",
            "Jun 2, 2015",
            "Jun 9, 2015",
            "Jun 16, 2015",
            "Jun 23, 2015",
            "Jun 30, 2015",
            "Jul 21, 2015",
            "Dec 2, 2010"
        ],
        [
            "Applicant",
            "Elenza, Inc.",
            "Johnson & Johnson Vision Care, Inc.",
            "Google Inc.",
            "Google Inc.",
            "Google Inc.",
            "Google Inc.",
            "Google Inc.",
            "Elenza, Inc.",
            "Elenza, Inc.",
            "Google Inc.",
            "Google Inc.",
            "Google Inc.",
            "Google Inc.",
            "Elenza, Inc.",
            "Google Inc.",
            "Wooley C Benjamin"
        ],
        [
            "Title",
            "Multi-focal intraocular lens system and methods",
            "Lenses for the correction of presbyopia and methods of designing the lenses",
            "Contact lens with integrated pulse oximeter",
            "Standby biasing of electrochemical sensor to reduce sensor stabilization time during measurement",
            "Systems and methods for encapsulating electronics in a mountable device",
            "Assembling thin silicon chips on a contact lens",
            "Contact lens with integrated pulse oximeter",
            "Hermetically sealed implantable ophthalmic devices and methods of making same",
            "Installation and sealing of a battery on a thin glass wafer to supply power to an intraocular implant",
            "Contact lenses",
            "Assembling thin silicon chips on a contact lens",
            "Microelectrodes in an ophthalmic electrochemical sensor",
            "Input detection system",
            "Multi-focal intraocular lens system and methods for dynamic visual environments",
            "Symmetrically arranged sensor electrodes in an ophthalmic electrochemical sensor",
            "Lenses for the correction of presbyopia and methods of designing the lenses"
        ]
    ],
    "pageTitle": "Patent US7926940 - Advanced electro-active optic device - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US7926940?dq=%22robert+sheehan%22",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 7,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042991076.30/warc/CC-MAIN-20150728002311-00319-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 472617935,
    "recordOffset": 472568023,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{6541=FIG. 8 shows an IOO 800 located in an anterior chamber of an eye and in optical communication with a healthy presbyopic crystalline lens 810. The IOO may include a dynamic aperture, a dynamic mask, or both. In configurations including a dynamic aperture, the IOO may provide for improved intermediate and near vision by increasing the depth of focus. FIG. 9 shows an IOO 900 located in an anterior chamber of an eye and in optical communication with a far and near vision IOL 910. The IOO may include a dynamic aperture, a dynamic mask, or both. An IOO including a dynamic aperture may provide for increased depth of focus. FIG. 10 shows an IOO 1000 located in an anterior chamber of an eye and in optical communication with an IOL 1010 that corrects for far distance vision only. The IOO may include a dynamic aperture, a dynamic mask, or both. The configuration shown in FIG. 10 may be useful for providing an increased depth of field for providing near distance and/or intermediate distance correction by way of a dynamic aperture. FIG. 11 shows an IOO 1100 located in an anterior chamber of an eye and in optical communication with an IOL 1110 that corrects for far distance vision and near distance vision. The IOO may include a dynamic aperture, a dynamic mask, or both. A dynamic aperture may be useful for providing an increased depth of field for providing intermediate distance correction. FIG. 12 shows an IOO 11200 ocated in a posterior chamber of an eye and in optical communication with an IOL. The IOO may include a dynamic aperture, a dynamic mask, or both. FIG. 13 shows an IOL 1310 having a dynamic aperture in the portion of the IOL closest to the eye's pupil. The IOL also may include a dynamic mask. FIG. 14 shows an IOL having a dynamic aperture in the middle portion of the IOL. The IOL also may include a dynamic mask. FIG. 15 shows an IOL having a dynamic aperture in the portion of the IOL closest to the eye's retina. The IOL also may include a dynamic mask. FIG. 16 shows a corneal inlay in optical communication with a healthy presbyopic crystalline lens. The inlay may include a dynamic aperture, a dynamic mask, or both. FIG. 17 shows a corneal inlay in optical communication with an IOL. The inlay may include a dynamic aperture, a dynamic mask, or both. It should be noted, that it is not possible to show all possible configurations, embodiments, combinations, and placements of the present invention. For example, a corneal inlay having a dynamic aperture are not shown. In addition, a static or dynamic apodization mask may be incorporated into an IOO, IOL, corneal only, coneal inlay, or other device as shown and described, with or without a dynamic aperture. However, these will be apparent to those skilled in the art.}",
    "TableContextTimeStampAfterTable": "{104647=In configurations in which electrodes 225, 2225 are a plurality of individually addressable electrodes arranged in a grid, the individual pixels may be selectively activated or deactivated. For example, such a configuration may allow for relocation of the geometric center of the aperture 260 and annulus 270 relative to the geometric center of the substrates or the eye's pupil., 143393=Two types of functional adjustments may be made within an aperture: the optical path difference caused by at a point within the aperture as a function of location (i.e., distance from the pupillary center and its azimuth), and its optical transmission. For a two dimensional aperture orthogonal to the optic axis of the eye, a description of the optical transmission is provided by a pupil apodization function, as shown in Equation 2 for α=1. More generally, this is true for a two dimensional aperture in another plane, since the aperture may be projected onto a plane orthogonal to the optic axis of the eye. Clinical benefits of this approach have been reported in, for example, Applegate R A, et al, “Aberrations and Visual performance, Part I, Optical and neural Limits to Vision”, Presented at the Wavefront Congress, 2005, which describes the MTF of the eye as a function of pupillary apertures. Application of an aperture enhances the low spatial frequency MTF at the expense of the high spatial frequency values of the MTF function of the eye. In effect, the aperture functions as a low band pass spatial frequency filter. Since the NCSF of a normal human eye typically peaks at 4-8 cycles/degree, this shift of MTF and associated OTF values of the retinal image enables the OTF to better match the NCSF of the eye. As previously mentioned, improving image quality at low spatial frequencies may enhance visual comfort and the subjective quality of vision., 78770=A controller 2250 connects to the electrodes 2220 and 2225 by electrical connections 2255 and is capable of generating an electric field between the electrodes by applying one or more voltages to each electrode. In some configurations, the controller is part of the electro-active element. The controller also may be located outside the electro-active element and connects to the electrodes using electrical contact points in the electro-active element. The controller may be connected to a power source, sensors, or any other necessary electronics. In the absence of an electric field between the electrodes, the liquid crystal molecules align in the same direction as the alignment direction. In the presence of an electric field between the electrodes, the liquid crystal molecules orient in the direction of the electric field. In an electro-active element, the electric field is perpendicular to the alignment layer. Thus, if the electric field is strong enough, the orientation of the liquid crystal molecules will be perpendicular to the alignment direction. If the electric field is not strong enough, the orientation of the liquid crystal molecules will be in a direction somewhere between the alignment direction and perpendicular to the alignment direction. It should be noted that the substrates may be as wide as or wider than the electrodes, alignment layers, and electroactive material., 93593=For example, an individual's subjective satisfaction with perceived image quality may be improved when the image quality is maximized over a low- to mid-frequency range. A subjective quality factor may be defined as SQF=∫ 10 40∫0 2r|τ(ƒ,θ)|d(log ƒ)dθ Such a function is described in further detail in E. M. Granger and K. N. Cupery, “An Optical Merif Function (SQF) which Correlates with Subjective Judgments,” Photogr. Sci. and Eng., v. 16 (3), 1972, p. 221-30. It has been found that the specific size and shape of an aperture to provide desirable improvements in subjective vision may be determined by minimizing the merit function (SQF) based on computation of a visual performance metric, such as visual strehl as a function of pupil size. Such a calculation may be performed using ray tracing of a specific eye model. Specific examples of models suitable for performing these calculations include the “Indiana Eye” model and the Liu Brennan eye model as known in the art., 76912=A dynamic apodization mask may include an electro-active element 2200 having two optical substrates 2210 or that is bound by two optical substrates. The two substrates may be substantially flat and parallel, curved and parallel, or one substrate may have a surface relief diffractive pattern and the other substrate may be substantially smooth. The substrates may provide an optical power or the substrates may have no optical power. Each substrate may have a thickness of 200 μm or less. In general, thinner substrates allows for a higher degree of flexibility for the electro-active element which may be important in optics or lenses that are inserted or implanted into the eye. A continuous optically transparent electrode 2220 that provides for an electrical ground may be disposed on one of the substrates and one or more individually addressable optically transparent electrodes 2225 may be disposed on the second substrate. Electrodes 2225 may determine the properties of the dynamic mask by altering the refractive index at various parts of the mask. The electrodes 2220, 2225 may include a transparent conductive oxide (such as ITO) or a conductive organic material (such as PEDOT:PSS or carbon nano-tubes). The thickness of the optically transparent electrodes may be, for example, less than 1 μm, but is preferred to be less than 0.1 μm. The electrodes 2220 and 2225 may be coated with an alignment layer 2230. Alternatively, only one of the electrodes is coated with the alignment layer. An electroactive material 2240 is disposed between the alignment layers. The thickness of the electro-active material may be between 1 μm and 10 μm, but is preferably less than 5 μm. The electro-active material may be a liquid crystalline material., 35515=This application is a continuation in part of U.S. application Ser. No. 12/035,779, filed Feb. 22, 2008, which claims priority from U.S. Ser. No. 60/902,866 filed on Feb. 23, 2007, U.S. Ser. No. 61/020,759 filed on Jan. 14, 2008, U.S. Ser. No. 61/025,348 filed on Feb. 1, 2008, and U.S. Ser. No. 61/029,469 filed on Feb. 18, 2008, each of which is incorporated by reference in its entirety. This application claims the benefit of U.S. Ser. No. 61/037,351 filed on Mar. 18, 2008 and U.S. Ser. No. 61/060,291 filed on Jun. 10, 2008, each of which is incorporated by reference in its entirety., 76152=In one configuration, the apodization mask may include a single layer 2210 that includes a refractive index gradient. For example, the substrate 2210 may include a layer of a transparent polymer or other material that has a refractive index gradient, preferably of at least 0.01 units/mm in at least one meridian. In such a configuration, the other elements 2200, 2250, 2255 may be omitted. This configuration may be referred to as a static mask. As a specific example, the substrate 2210 may include at least one layer of a material, such as a transparent polymer, that includes a refractive index gradient. Preferably, the gradient is at least 0.01 units/mm in at least one meridian.}",
    "textBeforeTable": "Patent Citations While illustrative and presently preferred embodiments of the invention have been described in detail herein, it is to be understood that the inventive concepts may be otherwise variously embodied and employed, and that the appended claims are intended to be construed to include such variations, except as limited by the prior art. To achieve some of the features and benefits described herein, it may be preferable to incorporate a dynamic aperture and/or apodization mask into a device that may be fixed relative to the pupil. Examples of such devices include IOOs, IOLs, corneal inlays, and corneal onlays. Otherwise the effects of the device may be reduced or eliminated, or the device may have an undesirable effect on the wearer's vision. Thus, some features described herein may be less desirable for incorporation into devices that do not remain fixed relative to the wearer's pupil, such as contact lenses and spectacle lenses. In Guyon and other astronomical work, phase amplitude variation across the pupillary aperture has been achieved by using mirrors (e.g., the PIAA technique, first proposed by Guyon and Doddier). While suitable for larger-scale applications such as telescopes, these design solutions cannot readily be adapted to clinical device such as those described herein. Guyon also investigated the effect of the distance between the center of the aperture and the optic axis of the system on the PSF of the optical system, and showed",
    "textAfterTable": "US4300818 Mar 13, 1978 Nov 17, 1981 Schachar Ronald A Multifocal ophthalmic lens US4320939 Sep 13, 1979 Mar 23, 1982 Mueller Gary E Optical filtering element including fluorescent material US4373218 Nov 17, 1980 Feb 15, 1983 Schachar Ronald A Variable power intraocular lens and method of implanting into the posterior chamber US4395736 Jul 17, 1981 Jul 26, 1983 Thomson - Csf Solid state image pickup US4418990 Jul 20, 1981 Dec 6, 1983 Gerber Scientific, Inc. Eyeglasses and other lenses of variable focal length and means and method for varying such focal length US4423929 May 23, 1980 Jan 3, 1984 Kabushiki Kaisha Suwa Seikosha Multi-layer display device US4457585 Aug 31, 1981 Jul 3, 1984 Ducorday Gerard M Magnifier reader US4461550 Apr 22, 1981 Jul 24, 1984 Essilor International Cie Generale D'optique Progressive ophthalmic lens US4466703 Mar 17, 1982 Aug 21,",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}