{
    "relation": [
        [
            "Cited Patent",
            "US1441406 *",
            "US1938052 *",
            "US2043186 *",
            "US2321236 *",
            "US2379562 *",
            "US2394722 *",
            "US2456337 *"
        ],
        [
            "Filing date",
            "Jan 18, 1921",
            "Jan 10, 1933",
            "Jan 4, 1936",
            "Nov 19, 1940",
            "Dec 5, 1944",
            "Sep 21, 1943",
            "Apr 19, 1946"
        ],
        [
            "Publication date",
            "Jan 9, 1923",
            "Dec 5, 1933",
            "Jun 2, 1936",
            "Jun 8, 1943",
            "Jul 3, 1945",
            "Feb 12, 1946",
            "Dec 14, 1948"
        ],
        [
            "Applicant",
            "William R Dales",
            "Charles H Speir",
            "O'dette William A",
            "Victer Parkin",
            "Harry Boxley Joseph",
            "Milton Sloane",
            "Soper Roy M"
        ],
        [
            "Title",
            "Infant's nursing device",
            "Nursing bottle",
            "Nursing bottle",
            "Nursing bottle valve",
            "Nursing bottle",
            "Nursing bottle",
            "Sanitary nursing bottle"
        ]
    ],
    "pageTitle": "Patent US4545491 - Feeding bottle having an air intake valve - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US4545491?dq=5,884,272",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 5,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042991076.30/warc/CC-MAIN-20150728002311-00076-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 486752744,
    "recordOffset": 486736784,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Patent Citations The invention is not restricted to the embodiment shown in the drawing. Thus, it would of course not be impossible to combine the sleeve 12 with the sealing ring 18. The valve should not necessarily be located at the bottom of the bottle 2, as it may operate even when located at an area which in use is underneath the level of the milk in the bottle. The stabilized and sensitive valve function due to the facet 16 may even be achievable in connection with a valve disc as according to the prior art, viz. when the resilient disc is stretched over a dome shaped support having a less domed facet portion at the sub area where the relevant valve holes are provided. As mentioned, it is advantageous that the sleeve 12 is disintegral with the sealing ring 18, a.o. because the frictional engagement of the ring 18 at the end of the onscrewing of the bottom cap 8 could tend to produce stresses in the sleeve making its vacuum response less accurate, according to the degree of tightening of the cap 8. On the other hand it has been observed that the vacuum response of the valve is practically the same whether the sleeve 12 is mounted on the cup member 10 by a pure axial insertion or by a concurrent screwing motion, even if this motion is eased with an active finger tip located",
    "textAfterTable": "* Cited by examiner Referenced by Citing Patent Filing date Publication date Applicant Title US4685577 * Apr 24, 1986 Aug 11, 1987 Wen Chung Chen Nursing bottle US4730744 * Jun 17, 1987 Mar 15, 1988 Vinciguerra Mark T Baby bottle with valve US4784641 * Jun 12, 1987 Nov 15, 1988 Bio-Pak Associates Article and method for the oral dosing of fluidic material to patients US4828126 * Sep 17, 1987 May 9, 1989 Vincinguerra Mark T Baby bottle having an air inlet valve US4865207 * Jun 9, 1988 Sep 12, 1989 Joyner Jack S Nursing bottle with microporous membrane US4881666 * Jan 19, 1988 Nov 21, 1989 Robert Tullman Variable volume container US5261565",
    "hasKeyColumn": true,
    "keyColumnIndex": 3,
    "headerRowIndex": 0
}