{
    "relation": [
        [
            "Airships/Dirigibles",
            "Battleships",
            "Buses",
            "Cowvalry/Cavalry",
            "Giant Mecha",
            "Jeeps",
            "Rockets",
            "Teleporters"
        ],
        [
            "APCs",
            "Bicycles",
            "Carriers",
            "Dreadnuts",
            "Gliders",
            "Jetpacks",
            "Semi Trucks",
            "Tractors/Farm Equipment"
        ],
        [
            "Armored Cars",
            "Boats",
            "Cars and Trucks",
            "Dropships",
            "Hardsuits",
            "Motorcycles",
            "Sleds",
            "Trains"
        ],
        [
            "Artillery",
            "Bombers",
            "Chariots",
            "Fighter Planes",
            "Helicopters",
            "Personnel Launchers",
            "Snowmobiles",
            "Transforming Robots"
        ],
        [
            "Atmospheric Reentry",
            "Buggies",
            "Commercial Airplanes",
            "Four Wheelers",
            "Hovercraft",
            "Portals",
            "Submarines",
            "Zeppelins"
        ]
    ],
    "pageTitle": "Teknology - BrikWars",
    "title": "",
    "url": "http://brikwars.com/wiki/index.php?title=Teknology&diff=2464&oldid=1969",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 2,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989142.82/warc/CC-MAIN-20150728002309-00334-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 37338735,
    "recordOffset": 37326746,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "In most cases, there are no real, appreciable differences between real world vehicles and their BrikVerse counterparts outside of the fact that one is made from plastic toy bricks. The same is essentially true of most fictional vehicles and machines: BrikWars counterparts are often modeled after genre tropes. The following table lists very basic vehicle and machine types, fictional and real. Some of the entries listed link to other pages. Where this is the case, most often the links are to galleries of BrikWarrior creations. However, as BrikWarriors continue to build and expand the BrikVerse canon, some of those pages might start to fill out a little more with BrikWars related fiction, images, or rules modifications. Vehicle and Machine pages that grow large and come to encompass groups of many types special to the BrikWars concept are pointed out especially, below. Vehicles and Machines 3 Teknologikal Organizations in the BrikVerse 2.3.4 Tek Level 2.3.3 ExperiMENTAL Teknology 2.3.2 Epitek 2.3.1 BLACKlist 2.3 Important Concepts 2.2 Heroic Items 2.1.2 BrikWars Artifax 2.1.1 The Nine Artifax of Pre-Creation",
    "textAfterTable": "Special Vehicles and Machines Some vehicle or machine types are expansive, detailing many categories within a similar type. BrikWarriors are especially fond of the following types of these creations and have conceived of much lore surrounding their inclusion into the BrikVerse. Space Space Vehicles and Machines are the bread and butter of some of the most prominent storylines in BrikWars canon. Tanks Tanks are a favorite death-dealing mechanical terror on many battlefields. Inspired Creations Inspired Creations are the Awesome creations of Awesome BrikWarriors. Weapons and Equipment Individual weapons and equipment (swords, shields, guns, communication devices) are extremely common in the BrikVerse. More industry is focused on creating the tools of warfare than on increasing the standard of living for minifig civilization or supplementing the advance of scientfik knowledge. There are no real, appreciable differences between BrikWars weapons and equipment and their real world counterparts, again, other than the fact that one is a plastic toy. And again, the same is true for fictional counterparts based on commonly accessible tropes. Instead of creating an exhaustive list of all the possible weapons and equipment, this section identifies those",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}