{
    "relation": [
        [
            "Name",
            "BEN BETKER",
            "GREG CHASE",
            "DARNELL NURSE",
            "JACKSON HOUCK",
            "JUJHAR KHAIRA",
            "MITCH MOROZ",
            "KYLE PLATZER",
            "",
            "MARCO ROY"
        ],
        [
            "POS",
            "d",
            "f",
            "D",
            "F",
            "f",
            "F",
            "F",
            "",
            "F"
        ],
        [
            "age",
            "19",
            "19",
            "18",
            "18",
            "19",
            "19",
            "18",
            "",
            "19"
        ],
        [
            "GP",
            "44",
            "43",
            "43",
            "42",
            "33",
            "43",
            "39",
            "2",
            "16"
        ],
        [
            "G",
            "4",
            "25",
            "10",
            "24",
            "12",
            "25",
            "9",
            "1",
            "4"
        ],
        [
            "A",
            "8",
            "24",
            "28",
            "15",
            "15",
            "18",
            "8",
            "1",
            "12"
        ],
        [
            "P",
            "12",
            "49",
            "38",
            "39",
            "27",
            "43",
            "17",
            "2",
            "16"
        ],
        [
            "+/-",
            "-6",
            "25",
            "1",
            "-1",
            "7",
            "20",
            "-4",
            "-2",
            "1"
        ],
        [
            "PIM",
            "64",
            "36",
            "70",
            "38",
            "33",
            "95",
            "14",
            "0",
            "14"
        ],
        [
            "team",
            "EVERETT SILVERTIPS (WHL)",
            "CALGARY HITMEN (WHL)",
            "SAULT STE. MARIE (OHL)",
            "VANCOUVER GIANTS (WHL)",
            "EVERETT SILVERTIPS (WHL)",
            "EDMONTON OIL KINGS (WHL)",
            "LONDON KNIGHTS (OHL)",
            "OWEN SOUND ATTACK (OHL)",
            "BLAINVILL (QMJHL)"
        ]
    ],
    "pageTitle": "FUTURE WATCH | Ben Betker - Edmonton Oilers - Future Watch",
    "title": "",
    "url": "http://oilers.nhl.com/club/news.htm?id=700610",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 4,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988650.6/warc/CC-MAIN-20150728002308-00272-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 177999399,
    "recordOffset": 177970532,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{7069=Ben Betker finds himself in a much better state of mind now than he was at this time in 2013. As the then 18 year-old defenceman patiently awaited the draft, he was uncertain as to whether or not he would be selected by a team., 4895=Betker has 12 points in 44 games with Everett in the WHL, a career-high in that league. He has four goals this season, besting his one-goal season in 2012-2013., 1228=“It’s exciting to be a part of a franchise like that, that’s trying to come out of this rebuild. I follow you guys on Twitter, I follow it on TV and stuff and everybody just wants to get over the hump of that rebuild. It’s cool to try and be a part of that. My goal is to come in, in two or three years or however long it will take me in Oklahoma, to be a part of that finishing touch on the defensive end. That’s definitely a goal of mine and something I think about.” Barons Player Stats |  AHL Standings |  Barons Schedule | Past Prospect Stats: 2012-13 | 2011-12, 6761=A late push due to increased production and physical play, at the end of his season with the Everett Silvertips, put him on the radar and gave the Edmonton Oilers reason to select him 158th overall, in the sixth round, of the 2013 NHL Entry Draft.}",
    "TableContextTimeStampAfterTable": "{61481=edmontonoilers.com is the official Web site of the Edmonton Oilers Hockey Club. The Edmonton Oilers and edmontonoilers.com are trademarks of Edmonton Oilers Hockey Corp. NHL, the NHL Shield, the word mark and image of the Stanley Cup and NHL Conference logos are registered trademarks of the National Hockey League. All NHL logos and marks and NHL team logos and marks as well as all other proprietary materials depicted herein are the property of the NHL and the respective NHL teams and may not be reproduced without the prior written consent of NHL Enterprises, L.P. Copyright © 1999-2015 Edmonton Oilers Hockey Club and the National Hockey League. All Rights Reserved.}",
    "textBeforeTable": "Oklahoma City (AHL) Stats Updated as of Tuesday, January 14, 2013 at 2:00 p.m. MST “It’s exciting to be a part of a franchise like that, that’s trying to come out of this rebuild. I follow you guys on Twitter, I follow it on TV and stuff and everybody just wants to get over the hump of that rebuild. It’s cool to try and be a part of that. My goal is to come in, in two or three years or however long it will take me in Oklahoma, to be a part of that finishing touch on the defensive end. That’s definitely a goal of mine and something I think about.” Barons Player Stats |  AHL Standings |  Barons Schedule | Past Prospect Stats: 2012-13 | 2011-12 As the Oilers look to continue developing their young talent and translating potential into winning, their draft picks will play a bigger role in the near future. It is something that a player like Betker can look forward to. “That’s something I always look forward to, testing myself. I kind of treat every game like that, as just another test. You practice all week and practice however long you can and every game is just another test. That whole Penticton (rookie tournament) experience I had, was just another eyeopener for sure. I think there",
    "textAfterTable": "brad hunt   D 25 30 3 14 17 1 14 ryan Jones   F 29 4 2 0 2 -2 2 kale kessy   F 21 32 2 4 6 -4 58 oscar klefbom   d 20 27 0 3 3 -10 6 anton lander   F 22 22 10 11 21 7 10 philip larsen   d 24 7 1 6 7 -4 4 STEVE MACINTYRE F 33 6 0 0 0 -2 30 MARTIN MARINCIN   D 21",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}