{
    "relation": [
        [
            "Player",
            "Craig Austin",
            "Gary Raimondo",
            "Heyward Dotson",
            "Sean Couch",
            "Noruwa Agho",
            "Richie Gordon"
        ],
        [
            "",
            "1998-2002",
            "1995-99",
            "1967-70",
            "1983-87",
            "2008-present",
            "1979-83"
        ],
        [
            "Points",
            "1,491",
            "1,320",
            "1,266",
            "1,208",
            "1,061",
            "1,003"
        ],
        [
            "Rebounds",
            "417",
            "542",
            "420",
            "368",
            "320",
            "384"
        ],
        [
            "Assists",
            "205",
            "236",
            "237",
            "247",
            "200",
            "211"
        ]
    ],
    "pageTitle": "Dartmouth, Harvard Visit Levien Gymnasium This Weekend in Men's Basketball Action - GoColumbiaLions.com\u0097Official Web Site of Columbia University Athletics",
    "title": "",
    "url": "http://www.gocolumbialions.com/ViewArticle.dbml?SPID=3886&DB_LANG=C&CONTENT_ID=%23temp_CONTENT_ID&DB_OEM_ID=9600&ATCLID=205097968",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 2,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989142.82/warc/CC-MAIN-20150728002309-00077-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 473136168,
    "recordOffset": 473119774,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{16521=The Lions are returning from an impressive second-half in their 75-62 win over Penn last Saturday, Feb. 12, in front of a frenzied home crowd of 2,711 fans.  Noruwa Agho had a phenomenal game with 21 points, seven rebounds and five assists, while Asenso Ampim added 15 points and nine rebounds and Brian Barbour chipped in with 14.  Columbia improved its record to 13-9 overall and 4-4 in the Ivy League with the victory., 19479=LIONS AT LEVIEN Columbia has an 8-2 record at Levien Gymnasium this season with four home games remaining this season. Columbia’s most wins at Levien Gym came in the 2006-07 season, when the Lions went 10-4. Columbia has won 11 of its last 15 games at Levien Gymnasium, dating back to last season. COLUMBIA AMONG NATIONAL LEADERS In the latest NCAA rankings, Columbia is represented several times among the top 100 in the nation, out of the 336 Division I teams ranked. Stats are through Feb. 13., 16247=NEW YORK – Looking to climb over the .500 mark in Ivy League play, Columbia will take on Dartmouth on Friday, February 18 at 7 p.m. at Levien Gymnasium with a game against Harvard presented by Connect by Hertz on Saturday, February 19, also at 7 p.m., 21792=THE HISTORY NOTE – DARTMOUTH Dartmouth was the last Ivy League team that Columbia faced in its early years as a program. The series began in the 1905-06 season, when Dartmouth defeated Columbia, 16-10. Columbia has won six of its last nine games against Dartmouth, including three of the last four in New York City. THE HISTORY NOTE – HARVARD The Columbia-Harvard series began in Columbia’s inaugural 1900-01 season, when the Crimson won, 11-9. Harvard has won each of the last four games between the two teams. At Levien Gymnasium over the last seven years, Columbia is 5-2 and has won three of the last four meetings in New York. NORUWA REACHING NEW HEIGHTS Columbia junior guard Noruwa Agho enters this weekend as the Ivy League’s leading scorer at 16.0 points per game, is fifth in assists at 4.5 per game and 12th in rebounding at 5.0 per game. Agho recently topped the 1,000 point mark for his career and currently ranks 17th on Columbia’s all-time scoring list with 1,061 career points. He has been named Ivy League Player of the Week three times already this season after earning the award three times during the 2009-10 season. Only a junior, Agho is one of six Columbia players ever to total 1,000 points, 300 rebounds and 200 assists in his career., 17259=Dartmouth enters the weekend having lost five straight after Columbia dealt the Big Green a 66-45 defeat in New Hampshire on January 29.  Dartmouth is paced by all-around guard David Rufful, who averages nine points and six rebounds in league play.}",
    "textBeforeTable": "LIONS AT LEVIEN Columbia has an 8-2 record at Levien Gymnasium this season with four home games remaining this season. Columbia’s most wins at Levien Gym came in the 2006-07 season, when the Lions went 10-4. Columbia has won 11 of its last 15 games at Levien Gymnasium, dating back to last season. COLUMBIA AMONG NATIONAL LEADERS In the latest NCAA rankings, Columbia is represented several times among the top 100 in the nation, out of the 336 Division I teams ranked. Stats are through Feb. 13. LIFE BEGINS AT 70 Columbia has scored 70 or more points 13 times this season, averaging 72.1 points per game. When Columbia has scored 70 points or more, the Lions are 10-3. When Columbia allows fewer than 70 points, the Lions are 6-0. Tickets for the game are available online, by calling 888-LIONS-11 or at the Dodge Fitness Center ticket office on game day. All Columbia undergraduate and graduate students are admitted free to Levien Gymnasium with Columbia ID. Fans who can't make it to Levien Gym can catch all the action live on gocolumbialions.com with Jerry Recco and Dalen Cuff '06 providing the call.  Friday's game can also be heard live on SIRIUS Satellite Radio Channel 130.  Fans can follow Dalen on Twitter @DCuff21 throughout the games and during the weekend. Live stats and game notes are also available. Harvard stands at 7-1 in the Ivy League after a pair of",
    "textAfterTable": "THE HISTORY NOTE – DARTMOUTH Dartmouth was the last Ivy League team that Columbia faced in its early years as a program. The series began in the 1905-06 season, when Dartmouth defeated Columbia, 16-10. Columbia has won six of its last nine games against Dartmouth, including three of the last four in New York City. THE HISTORY NOTE – HARVARD The Columbia-Harvard series began in Columbia’s inaugural 1900-01 season, when the Crimson won, 11-9. Harvard has won each of the last four games between the two teams. At Levien Gymnasium over the last seven years, Columbia is 5-2 and has won three of the last four meetings in New York. NORUWA REACHING NEW HEIGHTS Columbia junior guard Noruwa Agho enters this weekend as the Ivy League’s leading scorer at 16.0 points per game, is fifth in assists at 4.5 per game and 12th in rebounding at 5.0 per game. Agho recently topped the 1,000 point mark for his career and currently ranks 17th on Columbia’s all-time scoring list with 1,061 career points. He has been named Ivy League Player of the Week three times already this season after earning the award three times during the 2009-10 season. Only a junior, Agho is one of six Columbia players ever to total 1,000 points, 300 rebounds and 200 assists in his career. Player   Points    Rebounds    Assists    Craig Austin   1998-2002    1,491 417",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}