{
    "relation": [
        [
            "Type",
            "Ledge",
            "Stack",
            "Rubble",
            "Field Stone",
            "Tuscany",
            "River Rock",
            "Corners",
            "Cap Stone",
            "Window Sill",
            "Keystones",
            "Electrical Box",
            "Light Box",
            "Hearth Stone",
            "Trim Stone",
            "Mantels & Corbels"
        ],
        [
            "Size",
            ".75\"-2.5\" x 3\"-18\"",
            ".75”-1.75” x 3”-18”",
            ".75”-1.75” x 3”-18”",
            "5”-24” x 1”-2”",
            ".33” x 2.12” — 1” x 6”",
            "4” x 3” — 11” x 9”",
            "8” x 10” L x 2” - 4” thick",
            "SMALL 19” x 12” x 2” LARGE 20” x 16” x 2”",
            "18” x 3” x 2”",
            "SINGLE DOUBLE",
            "6.6\" x 7.5\"",
            "6.5\" x 7.5\"",
            "19\" x 19\" x 2\"",
            "8.5\" x 5\"",
            "Mantles: 6’ X 12” X 2 3/4” | 5’ X 12” X 3” Corbels: 12” X 4” X 8”"
        ],
        [
            "Ft. Per Pallet",
            "200",
            "200",
            "240",
            "160",
            "220",
            "280",
            "200",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            ""
        ],
        [
            "Box Weight",
            "100 lbs",
            "100 lbs",
            "100 lbs",
            "100 lbs",
            "100 lbs",
            "100 lbs",
            "100 lbs",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            ""
        ],
        [
            "Ft. Per Box",
            "10 sq ft",
            "10 sq ft",
            "12 sq ft",
            "8 sq ft",
            "11 sq ft",
            "14 sq ft",
            "10 sq ft*",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            ""
        ],
        [
            "Pallet Weight",
            "2,000 lbs w/pallet",
            "2,000 lbs w/pallet",
            "2,000 lbs w/pallet",
            "2,000 lbs w/pallet",
            "2,000 lbs w/pallet",
            "2,000 lbs w/pallet",
            "2,000 lbs w/pallet",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            ""
        ]
    ],
    "pageTitle": "PremierStone® - Manfacturers of Premium Artificial Stone Veneer",
    "title": "",
    "url": "http://premierstone.net/specifications.htm",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 5,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987228.91/warc/CC-MAIN-20150728002307-00063-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 187768251,
    "recordOffset": 187760049,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{4056=Composition and Materials: Natural stones in various sizes, shapes and textures are used to form molds. These stones are comprised of a mixture of Portland cements,sands, lightweight aggregates, iron oxide pigments and other materials. Our stone conforms to ASTM C150, ASTM C 330, ASTM C 144, SBCCI Section 1405.6. Types, Sizes, Weight, Footage and Colors, PremierSTONE® is available in: Bucks County, GRA, Windsor Brown, Brooklyn Brown, Champagne, Chesapeake, Chestnut, Forest Brown, Havana Gray, Oak Hill, Sierra, Smokey Mountain, Tennessee Gray and Walnut. Colors subject to change without notice. Special colors available depending on project size., 6413=Product Type: Lightweight Manufactured Stone Veneer Product Name: PremierSTONE® Manufacturer: Premier STONE® 997 Marietta Industrial Dr., Marietta, GA 30062 Contact: Office: 770-218-3553 Toll Free: 877- 97STONE (977-8663) Fax: 770- 218-1977 Email: GetInfo@premierstone.net Web Site: www.premierstone.net Product Description: Basic Use: PremierSTONE® is intended for interior and exterior nonstructural lightweight veneer facing on masonry, metal or frame construction for aesthetic purposes. The product can be used on new construction, exterior or interior walls, remodeling and redecorating existing walls, fireplace openings, chases, hearths, exterior chimney finishes, columns, backsplashes, foundations, retaining walls, planters and much more.}",
    "lastModified": "Mon, 12 Aug 2013 16:05:11 GMT",
    "textBeforeTable": "Having completed hundreds of evaluations of building products, components, methods, and materials, ICC-ES has a proven track record of excellence in product evaluations and customer service. \" border=\"0\" align=\"left\" width=\"108\" height=\"67\" /> Stone Warehouse INC which produces Premier STONE® has been certified by ICC-ES and the evaluation report states that this product meets or exceeds all standards set forth by ICC. This manufacturer is in compliance with ICC operational standards and acceptance criteria for Precast Stone. ES Report No. 3358 Having completed hundreds of evaluations of building products, components, methods, and materials, ICC-ES has a proven track record of excellence in product evaluations and customer service.\" alt=\"For decades, ICC-ES has been the industry leader in performing technical evaluations for code compliance, providing regulators and construction professionals with clear evidence that products comply with codes and standards.",
    "textAfterTable": "* Rubble is 9 Ft Per Box Limited Warranty - Premier STONE® products carry a 30 year limited warranty when used on structures that conform to local building codes and when installed according to the manufacturer’s instructions. Warranty is limited to replacement or repair of defective materials only and does not cover labor to remove and replace. Warranty does not cover damage resulting from building settlement, wall movement, contact with chemicals or paint, discoloration due to airborne contaminants, and staining or oxidation. Warranty is limited to the original purchaser. Complete warranty information is available upon request. Product colors are as accurate as current photography and printing techniques allow. Premier STONE® suggests you look at actual product samples for color selection. Rubble | Brooklyn Brown Premier Stone® 997 Marietta Industrial Dr., Marietta, GA 30062 770-218-3553 or 877-97STONE GetInfo@premierstone.net this site created by iconstructwebs.com - all rights reserved",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}