{
    "relation": [
        [
            "Date (2010)",
            "02 Jun",
            "03 Jun",
            "24 Jun",
            "18 Jul",
            "18 Jul"
        ],
        [
            "Time (local)",
            "1929",
            "1715",
            "1532",
            "2304",
            "2335"
        ],
        [
            "Mw",
            "5.8",
            "—",
            "6.2",
            "6.9",
            "7.3"
        ],
        [
            "Type",
            "Regional earthquake",
            "High-frequency volcano-tectonic earthquake",
            "Tectonic earthquake",
            "Foreshock",
            "Mainshock"
        ],
        [
            "Depth (km)",
            "80",
            "—",
            "70-80",
            "42",
            "35"
        ],
        [
            "Location and comments",
            "Offshore near Kandrian",
            "Felt by island residents with Modified Mercalli (MM) intensity up to IV",
            "In central New Britain centered~30-40 km SSE of Bialla town (70-80 km). MM Intensity of ~IV at Rabaul Town",
            "Both earthquakes occurred on the S side of West New Britain Province near Gasmata. Residents felt them very strongly near the epicenter and in Kimbe area.",
            "—"
        ]
    ],
    "pageTitle": "Global Volcanism Program | Ulawun",
    "title": "",
    "url": "http://volcano.si.edu/volcano.cfm?vn=252120&vtab=Photos",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 15,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989142.82/warc/CC-MAIN-20150728002309-00241-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 249981479,
    "recordOffset": 249901142,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{343539=People on the S and SE sides of the island heard \"low jetting\" noises during 24-25 May 2010. Weak and fluctuating incandescence was seen from the S at night during 28-29 May. Emissions became gray in color during 29-31 May, and on 30 May very fine ashfall was reported in areas to the SSW, S, and SSE. On 1 and 2 June only white vapor emissions were noted. RVO recommended a Stage 1 Alert as a result of increasing seismicity and occasional gray plumes, incandescence, and audible noises. According to a news report (Radio Australia), up to 10,000 residents live adjacent to Ulawun., 258259=07/1990 (BGVN 15:07) Weak to moderate vapor emission, 330474=RVO reported that activity at Ulawun was low during 15-21 July. Emissions from the summit crater were light gray during 15-16 July, and then changed to white vapor during 17-21 July. RSAM from volcanic tremors had increased on 14 July and reached a peak of 700 just after 0300 on 15 July. RSAM then decreased to 80 on 21 July, which also marked the cessation of volcanic tremors., 280656=A pilot reported seeing ash from Ulawun on 3 November drifting ESE of the volcano at a height of ~3 km a.s.l., 107783=Minor vapor emissions continue in early 2000, 172882=\"During most days in December, the summit crater was covered by clouds. When the weather was clear, moderate to strong white vapour emissions were observed. Seismicity was mainly characterized by bands of low-amplitude, high-frequency, harmonic tremor. The daily average of tremor bands was 8, and the mean total duration was 15 hours/day. The tremor bands were accompanied by B-type volcanic events that increased in number and amplitude during the last week of the month.\", 213640=Table 1. Rates of SO2 emission at Bagana, Langila, Manam, and Ulawun, Papua New Guinea, September 1983. Airborne COSPEC data from R. Stoiber, S. Williams, and C. McKee., 17620=RVO noted a further increase in the seismicity during 19-24 February, with overlapping tremor events and an increase in RSAM (Real-time Seismic-Amplitude Measurement). Volcano-tectonic earthquakes were recorded on 1, 3, 7, 8, 17, and 24 February, with daily totals ranging between 1 and 5. Low-frequency earthquakes were recorded almost every day, with daily totals between 201 and 646., 15312=This report discusses volcanism and seismicity at Ulawun between early 2010 through February 2011, a period when the volcano (figure 14) discharged several ash plumes to as high as 3-4 km altitude. In one case, ash plumes were seen in satellite imagery drifting for almost 200 km. Our previous reporting noted steam plumes and increased seismicity in February 2010 (BGVN 35:02), which followed a multi-year interval of comparative quiet (BGVN 33:03 and 34:10)., 251623=07/2000 (BGVN 25:07) Vapor emissions during May and June; moderate seismicity in June, 150630=\"Activity remained at a very low level in August. Emissions from the summit crater consisted of white vapour in weak to moderate amounts. Seismicity was at a very low level during the month.\", 332645=RVO reported that during 1 October-15 November activity at Ulawun was low; small volumes of white vapor and gray and gray-brown ash plumes rose 100 m above the crater and drifted S. Seismicity was low with RSAM values fluctuating between 100 and 150 units throughout the period., 221022=\"Intriguing seismicity, possibly indicating an eruption in the near future, continued in April and included periods of volcanic tremor. Amplitudes of discrete events were generally low, although a degree of cyclicity in amplitudes was apparent, with a period of about 8-11 days. Daily earthquake totals increased from about 600 to about 1,500., 8776=Highlights of behavior, August 2010 through February 2011. During 6-24 August, white and gray-to-brown plumes rose no more than 300 m above Ulawun, and fine ash fell on the NW and W flanks. Seismicity decreased compared to previous weeks., 263202=03/1988 (SEAN 13:03) Seismicity remains strong but no eruption, 204891=\"Previous Ulawun eruptions developed rapidly (within hours) to full-scale eruptions, including lava effusion and paroxysmal explosive activity culminating in the formation of pyroclastic flows. However, the 1984 eruption developed slowly from the first appearance of summit glow on 4 September, and no effusion or paroxysmal activity took place. The eruption reached a peak 6-9 September when mild, rhythmic, almost ash-free, Strombolian explosions took place every few seconds., 91322=October seismicity included tremor and numerous low-frequency earthquakes. Volcanic tremors were dominant during 1-4, 8-11, and 30-31 October. The low-frequency earthquakes can be characterized by RSAM data. On 1 October RSAM stood at ~30-40 units; steady decline brought the 7 October RSAM to ~5 units. On the 8th and 11th there followed peaks of over 20 units. After that RSAM declined steadily until it reached background levels on 20 October. On 30 October, RSAM underwent a sudden increase to ~20-30 units heralding the brief 1 November eruption., 30630=No MODIS thermal alerts were identified between March 2006 and January 2007 on the Hawai'i Institute of Geophysics and Planetology MODIS Thermal Alert System web site. The lack of thermal anomalies may indicate explosive eruptions, and not lava emissions. However, such activity has occurred at the summit in the past. One such episode, in November 1985, generated Strombolian activity and pyroclastic flows (figure 11)., 196100=\"At 2000, notification was received by radio from Ulamona Catholic Mission (figure 1) of a summit Strombolian eruption in progress, with ejections of incandescent lava fragments to heights of 300-500 m above the crater every few seconds. The eruption was reported to have begun at about 1830, following, or in association with, a rapid increase in the amplitude of the harmonic tremor., 81289=Phases of the 25-30 April eruption. Volcanism on 25 April consisted of a steady weak red glow, occasional rumbling noises, and thick ash clouds. This lasted until about 0530 on 26 April, when a small Strombolian eruption began. Glowing lava fragments ejected by frequent explosions were restricted to the summit's N and NE sides. Small pyroclastic flows occurred, but also failed to progress beyond the summit area. Ash clouds blew NW dropping very fine ash. The Strombolian activity lasted about an hour. Activity then subsided and noises became infrequent; but forceful ash-bearing emissions continued., 262266=08/1988 (SEAN 13:08) Low-level seismicity, weak vapor emission, 247796=03/2008 (BGVN 33:03) Mostly gentle emissions of white vapor; low-frequency earthquakes, 324286=RVO reported that during 1-9 May diffuse white plumes rose from Ulawun and Real-time Seismic-Amplitude Measurement (RSAM) values ranged between 70 and 100. During 9-10 May RSAM values distinctly increased, fluctuated, and peaked at 1300 units before declining back to 100 units. During this time local residents heard booming. On 10 May grey-to-brown ash plumes were observed., 119471=Activity on most days during January-March remained at a low level, with only moderate or moderate-strong thick white vapor emissions. Seismicity was low during the first week of January, the first three weeks of February, and the first three weeks of March; the seismograph was not operational at other times., 191347=\"Following the eruption of 17-28 November, seismicity at Ulawun remained at a moderately high level for the first half of December (500-1,000 events per day). By the end of the month seismicity had almost dropped back to pre-eruption levels., 327278=RVO reported that starting on 6 November through 30 November Ulawun produced pale grey and brown ash plumes that rose 200 m and drifted in multiple directions. Ashfall was reported on the N and NW flanks, in Voluvolu, Noau, Ubili (10 km NW), and Ulamona (10 km NW). Low rumbling was heard on 18 November., 302328=Based on satellite imagery, the Darwin VAAC reported that ash-and-steam plumes from Ulawun drifted SW and S on 30 August and 2 September, respectively., 339074=RVO reported that during 1-9 May 2011, diffuse white plumes rose from Ulawun and low to modest RSAM values occurred (70-100 units). During 9-10 May, RSAM values distinctly increased, fluctuated, and peaked at 1,300 units before declining back to 100 units. During this time, local residents heard booming., 260105=09/1989 (SEAN 14:09) Vapor emission and minor seismicity, 309970=RVO reported that increased seismic activity at Ulawun began on 7 June. During 18 June-2 July, mostly moderate-to-strong emissions of white vapor produced plumes that rose from Ulawun and seismometers recorded high-frequency earthquakes. On 22 June, noises heard in villages to the NE accompanied some of the earthquakes. On 28 June, an Intensity II earthquake was felt in areas nearby and accompanied by a booming noise. A team of officers from RVO and West New Britain Provincial Disaster Office informed communities on the activity status of Ulawun. On 30 June, RVO reported that the level of Alert at Ulawun was at \"Stage 2\", or that there was an increase in seismic activity above background level. During 1-2 July, roaring and jet noises were reported by people to the NE., 45577=No new activity was detected by MODVOLC as recently as mid-2004. This was the case despite reports of seismic activity and deflation during January-March 2003 (BGVN 28:03), as well as white vapor emissions and offshore effervescence (BGVN 28:09) and intermittent ash plumes during September-December 2003 (BGVN 28:11)., 261191=03/1989 (SEAN 14:03) Ash emission, seismicity, and glow follow heavy rain, 267632=04/1983 (SEAN 08:04) Increased seismicity, including volcanic tremor, 102325=An eruption during 28 September-2 October 2000 sends a plume to 10-12 km, 63174=Variable amounts of emergent vapor and minor debris flows at Ulawun were reported during January-March 2003 (BGVN 28:03). Rabaul Volcanological Observatory (RVO) reports, covering much of the period 14 April-5 October 2003, indicated the volcano remained quiet over this time, without emissions from the N-valley vent., 139791=\"There were some reports of weak night glow and sub-continuous noises on the night of 18 January. However, emissions were unchanged at 0900 on the 19th. A change had occurred when the next observation was possible, at 1300, when there were forceful emissions of dark ash clouds to 500 m above the summit. Continuous night glow and sub-continuous deep roaring sounds were reported from Nuau village and Ulamona Mission, both ~12 km from the summit, on the night of the 19th. The level of tremor increased by a factor of about two between 0300 and 0400 on 20 January. Visual activity from dawn (0530) onwards consisted of moderate volumes of grey/brown ash being forcefully emitted up to 1.5 km above the crater. The emissions varied in strength, and during an aerial inspection it was possible to see into the crater, which is elongated in an E-W direction, with its largest dimension ~100 m. No base could be seen to the crater, and the emissions were being released from very deep on the E side. Blue vapour was seen at times. Continuous rumbling and roaring noises were heard on the flanks of the volcano., 264329=05/1986 (SEAN 11:05) Tremor & low-frequency seismicity but no eruptions seen, 205931=\"Since 23 August occasional explosion sounds from the summit have been heard and occasional small ash clouds have been observed rising 400-500 m above the summit. Weak summit crater glow was reported on 25 August, and on the 28th provincial authorities were alerted to the possibility of further developments.\", 255484=09/1993 (BGVN 18:09) Vapor emissions; slight increase in seismicity, 266540=12/1983 (SEAN 08:12) Seismicity increases after M 6.4, 6.5 earthquakes, 126280=The increase in the level of venting activity . . . continued into May. Throughout the month the summit crater emitted moderate to thick white vapor, although there were occasional reports of gray and blue emissions on 17 and 18 May, and towards the end of the month. On 23 May, because of the ash cloud, pilots in the region were notified to \"exercise caution and to report any increase in activity including height and movement of the ash cloud.\" In addition, during most nights in the first three weeks of the month the crater emitted a red glow that remained weak but steady., 250607=03/2002 (BGVN 27:03) Isolated tremor episodes and slow deflation through March 2002, 265418=01/1985 (SEAN 10:01) Mild strombolian activity concludes eruptive phase, 138652=\"There was a decrease in the ash content and the volume of the emissions on 21 and 22 January, with moderate thick white vapour and occasional dark-grey ash clouds being gently released. Very light ashfall was reported from Sule and Nuau. From 23 January until the end of the month emissions were generally moderate white vapour, some blue vapour, and occasional light-grey ash clouds. At times of low winds, the vapour column rose to over 2 km above the summit. There was almost continuous weak glow from the crater at night. No sounds were heard during this time. Seismic tremor remained at moderate levels. There were some variations in the tremor level 26-27 January, producing slight 'banding' on Helicorder records., 211333=\"Reports from passing aircraft late in the day indicated that tephra emissions may have recurred in early or mid-afternoon. An aerial inspection at 1700 by an RVO volcanologist failed to confirm the presence of new ejecta on the volcano's flanks, but faint haziness possibly due to earlier ejection of fine dust was noted downwind. The emission plume at the summit was found to be white and normal in size., 60169=According to the Rabaul Volcano Observatory, the main summit crater at Ulawun released weak to moderate volumes of white-gray vapor emissions over the period 6 November-22 December 2003. The two north valley vents were quiet, with no emissions observed. The seismograph, restored on 31 October 2003; showed seismicity was low throughout this period, with small low frequency volcanic earthquakes and some high frequency volcano-tectonic events. The electronic tiltmeter, restored at the same time; recorded no significant changes., 308771=Based on observations of satellite imagery, the Darwin VAAC reported that an ash-and-steam plume from Ulawun drifted W on 25 December., 243878=An eruption commenced . . . on 4 October 1973. The first 36 hours included only quiet lava streaming down the S flank, from a small vent in the side of the south-westerly terminal cone erected during the 1970 eruption. Explosive activity followed, from 6-19 October, with a peak in ash content on 11 October, on which day three small nuees descended the SSW flank. Strombolian ejections of brightly incandescent bombs occurred throughout the explosive phase, at a rate increasing to about 20 per minute during 13-14 October, when peaks of about 600 m elevation were reached. Five explosive vents were active altogether, tending to lie NNE-SSW, colinear but offset to the south of the main alignment of 1970 vents. Lava flowed throughout the eruption. The early flows were very hot and mobile, but the final flow, which commenced at about the time of the nuees and followed the same path, was cooler and more blocky in appearance. The eruption ceased abruptly on 19 October. Volcanologists were stationed 10 km away during 6-7 and 9-22 October, and at least one aerial inspection was made almost every day. No significant tilt effects occurred before or during the eruption, and continuous volcanic tremor was already established by 6 October, when a seismograph was installed. The tremor peaked in amplitude on 11 October, coinciding with the period of nuee production and ceased altogether on 19 October., 257364=05/1991 (BGVN 16:05) Large gas plume and numerous weak earthquakes, 173943=\"Ulawun's summit crater was covered by clouds during most of November. When visible, weak-moderate white vapour emissions were observed. Vapour emission intensified during the last week of the month. November's recorded seismicity was mainly characterized by an average of 9 bands of low-amplitude, high-frequency harmonic tremor, each lasting 1-2 hours. The number and size of accompanying B-type events also increased with a maximum of 1,055 recorded on the 19th., 99137=Other notable changes in the character of the RSAM plot occurred at 2240 on the 28th, and at 0115 and 0240 on the 29th. The first two times correlated with behavior noted by the observer watching the summit crater. Specifically, at 2240 on the 28th the observer saw the first glow reflecting off an ash-cloud emission. RVO scientists mark this as the beginning of the eruption. At 0120 on the 29th, production of incandescent lava fragments intensified, indicating the onset of a Strombolian eruption., 321430=RVO reported that white and gray-to-brown plumes rose no more than 300 m above Ulawun during 6-12 August, and fine ash fell on the NW and W flanks. Seismicity decreased as compared to previous weeks., 315536=RVO reported that during 2-7 June occasional low roaring or rumbling noises from Ulawun were heard daily in areas on the ESE, SE, and S flanks. During 2-5 June white vapor plumes rose 800-900 m high. Very fine ash particles fell in Ulamona about 10 km NW on 3 June and some gray emissions rose from the volcano on 5 June. Emissions during 6-9 June were white and light gray, and continued to rise no higher than 900 m. Fluctuating incandescence from the crater was seen at night from the S side of the volcano. Ashfall was again reported in Ulamona on 8 June., 36282=During the week of 22-28 August 2005, Ulawun often remained quiet but also displayed continued restlessness. People from Tauke, on the S side of the volcano reported occasional low roaring, rumbling, and booming noises on 21-22 and 26-28 August. Emissions from the summit crater consisted of moderate volumes of thick grayish vapor released forcefully. Some traces of blue vapor were also visible, but no glow was observed. Seismicity fluctuated between low and moderate, marked by small low-frequency earthquakes and small sporadic volcanic tremors. Only one high-frequency earthquake was recorded. An earthquake was felt on 22 August by people from Tauke. Apparently the earthquake was not reported by the observer at Ulamona, NW of the volcano, suggesting it was local and focused on the S side of the volcano., 112785=Vapor plume present throughout September, 218074=\"Throughout the month, emissions from the summit crater were reported to be strong white vapours. During an aerial inspection 24 May a white emission column rose several hundred meters above the summit, but the vapours were not being emitted with any force. A plume 5-10 km long was formed by the emissions.\", 254352=07/1994 (BGVN 19:07) White vapor emissions and low-frequency tremor, 46711=Note that a 16 January 2001 VAAC report of Ulawun emitting a cloud, ashes, and 'flames' ~ 10.6 km altitude, which was not confirmed by satellite imagery or RVO, has not previously been mentioned in the Bulletin., 297395=RVO reported that activity during 1-2 March at Ulawun consisted of strong forcefully expelled \"gray-blue emissions\" from the main crater. Incandescence may have been visible at the base of the plumes. There were no emissions from the NW vent. Small felt earthquakes occurred and the sound of roaring was heard from nearby villages. According to the Darwin VAAC, RVO reported that activity increased at Ulawun during 1 and 2 March and ash reached ~3 km (10,000 ft) a.s.l. on the 1st. Ash was not visible on satellite imagery., 89890=Eruption on 30 April 2001 sends an ash cloud to a height of ~13.7 km, 268690=09/1980 (SEAN 05:09) Ash billows to 6 kilometers above crater, 171094=\"Dry tilt and EDM measurements were carried out on 2 and 12 January. Compared with the previous tilt measurements in June 1988 (SEAN 13:06), inflationary tilts of as much as 19 µrad had accumulated by 2 January. Further inflation of up to 16 µrad took place between 2 and 12 January. These tilt changes were recorded at stations within a few km of the summit. EDM measurements were inconsistent. From 11 January, mainly white vapour emissions from the summit crater were observed. On some days, emissions appeared to contain ash. The pattern of regular periods of seismic tremor disappeared and was replaced by occasional small B-type events., 244738=Information Contacts: Card 0850 (16 January 1970) Mr. Johnson, Acting Administrator, Territory of Papua and New Guinea. Card 0856 (27 January 1970) A. Renwick, Geological and Volcanological Branch, Administration of Papua and New Guinea, Port Moresby, Territory of Papua/New Guinea., 220092=\"On 17 April, 5 periods of tremor occurred. After about 3 hours of very low seismicity, the first began at 1645. A distinct lull also preceded the third period. Tremor was mostly continuous, with total duration of about 280 minutes. Individual periods lasted about 29-106 minutes, and were followed by about 5 hours of frequent discrete shocks and discontinuous tremor. Beginning 18 April a gradual decay in amplitude and frequency of occurrence of the shocks was recorded. Possible small A-type events were recorded 20-29 April., 266737=11/1983 (SEAN 08:11) Five days of strong seismicity; mild explosive activity, 124169=\"Seismic activity in June consisted mainly of sub-continuous low-frequency tremor, with an occasional larger low-frequency earthquake. The RSAM monitoring showed that the seismicity level remained fairly steady throughout the month, with a slight dip in the middle. On a number of occasions, most notably on 9, 20, and 30 June, the activity almost totally stopped for short periods of usually less than an hour. The cause of this is not known. A small number of local high-frequency earthquakes continued to be recorded, although the rate declined during the month., 320307=RVO reported that diffuse gray plumes rose 200-500 m above Ulawun during 16-21 July. Volcanic tremors continued, but overall seismicity declined slightly. Real-time Seismic-Amplitude Measurement (RSAM) values remained at a moderate level., 296338=A thin plume emitted from Ulawun was visible extending N on satellite imagery on 23 November., 286129=An ash plume from Ulawun was visible on satellite imagery on 10 October at an altitude around 3 km, extending ~75 km WNW of the summit., 191444=Seismic and eruptive activity decrease in December, 282983=During this week, aviation sources reported Ulawun ash plumes. A 30 April volcanic ash advisory detected a possible narrow low-level plume extending ~50 km from Ulawun. Satellite imagery for 2 May indicated an ash-and-steam plume rising to ~4 km and blowing W at ~30 km/hour. The plume extended 80 km W of the summit., 93332=RVO staff in Rabaul established communication links with the volcano observer based near Ulawun at 1606 on 27 September after noting increased RSAM values. Data from Ulawun were transmitted to RVO every 20 minutes. The RSAM values led to discussions with civil authorities and directions to local residents throughout the night at two-hour intervals. During the process, alert stages one and two were declared. This resulted in evacuating the local population, an effort accomplished with the help of a local timber company. Assistance was later provided by the West New Britain Provincial Government. This time-line of events is contrary to preliminary information (BGVN 25:08). that relied on local news media., 265226=10/1985 (SEAN 10:10) Eruption produces slow-moving lava flows, 241858=\"A new eruption was first observed just after 1900 on 7 May, when intermittent glow was seen at the summit. This rapidly developed into explosions of incandescent lava fragments from the summit crater, which increased in intensity until by 2100-2200 a full-scale eruption was in progress. At this stage, new ejections were visible every few seconds and explosive sounds were prominent; the intensity was probably as strong as that during the peaks of the 1970 and 1973 eruptions., 288369=On 6 June, satellite imagery of Ulawun showed a plume up to 3 km a.s.l. and extending ~75 km NW., 250403=08/2002 (BGVN 27:08) Ash eruptions during August 2002; plumes visible on satellite imagery, 223472=\"A notable seismic crisis occurred 21-23 March. From mid-January until 21 March, seismicity had been fluctuating between 400 and 1200 B-type volcanic shocks of moderate amplitude per day, in an apparently cyclic manner with a period of 16 days. On 21 March, shocks occurred at the rate of about 800/day until 1700, when their amplitude decreased sharply. At 1930 their frequency started to increase, and from 2000 they became subcontinuous (1800/day) and moderate in amplitude. This high level of seismicity continued for about 38 hours before gradually decreasing again., 25156=Similar conditions continued through the end of 2007 with only minor incidental variation. On 6 June, the elevated characteristics of the forceful emissions of 28-29 May were repeated. The daily total number of low-frequency earthquakes fluctuated between 400 and 1,042 events with the highest numbers recorded on 24 June (1,032) and 8 August (1,042). A high-frequency earthquake was recorded on 1 August. On 3 September forceful emissions were recorded sending the vapor plume ~ 1 km above the summit before being blown SE. On 25 December, based on satellite imagery observations, the Darwin VAAC reported that an ash-and-steam plume from Ulawun drifted W., 252544=09/1997 (BGVN 22:09) Vapor plume present throughout September, 312631=RVO reported that during 12-20 February Ulawun emitted white vapor that was occasionally forceful. A plume seen on satellite imagery on 14 February drifted NNE., 165335=\"For most of the month, the volcano-seismicity consisted of occasional, small, low-frequency events. Periods of low-amplitude, discontinuous and irregular tremor were recorded between 16 and 18 April. During the last week of April (perhaps correlating with a period of moderate rainfall) discrete events were more numerous, with periods of continuous and discontinuous irregular tremor of low-moderate amplitude.\", 122596=\"The level of activity . . . was slightly lower in July . . . . The summit crater continued to emit mainly white vapour, of variable volume. Faint blue vapour emissions were seen on 3, 5, 9, and 20 July. No sounds or night glow were reported., 299213=On 14 May, an ash plume from Ulawun of unknown height was visible on satellite imagery., 96712=The eruption continued into the night of 29 September, forcefully ejecting thick, dark, and ash-laden clouds. Explosive roaring and rumbling noises stopped at about 2200 on 29 September and projections of incandescent lava fragments began to subside at about the same time. By 0230 on 30 September, strong discharges had already stopped and glow at the summit had ceased. When daylight came, the summit activity was relatively quiet, involving only puffs of small dark gray ash clouds. A further decline reduced emissions to very thin white vapor by nightfall., 201626=\"Weak summit crater glow was observed on 30 December, indicating that an eruption was probably in progress. Fluctuating glow was observed on 3 January at about 0400, and occasional small dark tephra emissions from the summit crater were noted between 0800 and 0900. Seismic amplitudes began to increase at about 2300 on 3 January and steadily climbed to a peak of about 20 times normal on 8 January., 276449=The Darwin VAAC reported that on 28 August at 0732 a low-level ash cloud from an eruption at Ulawun was visible on satellite imagery. By 1532 the same day ash was no longer visible. According to a news article, ash eruptions had occurred on 26 August and during the previous week, but became larger on the 27th. As of the 28th, care centers were preparing for possible evacuations., 108900=After the mild eruption on 19 October, in November the activity at Ulawun reverted to its usual low level, gently releasing variable amounts of vapor. Seismicity was at background levels. Activity remained low in December. Visual observation reports during 1-21 December indicated that summit activity consisted of weak-to-moderate volumes of white vapor emissions. Seismicity remained low with low-frequency earthquakes through 16 December when the seismograph became unoperational., 11781=During 5-8 July RVO noted a slight increase in seismicity (above moderate levels), which included tremor. During 16-21 July, volcanic tremors continued, but overall seismicity declined slightly. Seismic amplitude (RSAM) values remained moderate., 323502=RVO reported that mild activity from Ulawun that began in May 2010 continued during 1 January-28 February. The activity was characterized by brown-to-gray ash plumes that rose less than 500 m and produced fine ashfall to the SE. Sulfur dioxide plumes drifted SE on 5 and 31 January. During 23-26 February gray ash plumes occasionally drifted NE, SW, and NW., 86853=New vent opens during April-May eruption, 162731=The quoted material is a report from RVO, with additional information on SO2 flux supplied by S. Williams. \"Throughout July, the volcano quietly released moderate, sometimes strong, white with occasional grey or brown emissions (on the 15th, 16th, 22nd, and 24th). Volcano seismicity remained at a low level with 10-30 small discrete B-type events/day.\", 212315=\"Weak discontinuous tremor began at 1900 on 3 November but showed a dramatic change at 2300 when frequent volcanic earthquakes of large amplitude started. No change was noted in the summit crater emissions. Numerous volcanic earthquakes continued over the next 2 days and a stage-1 alert warning of an increased risk of an eruption was issued on 5 November. At approximately 0200 on 6 November a new period of continuous large-amplitude earthquakes occurred and a stage-2 alert was issued, warning that an eruption was likely in the near future. A series of large events was recorded between 0800 and 1000 while observers near the base of the volcano reported dark summit emissions; one report suggested that they contained incandescent material. A stage-3 volcano alert was issued, warning of the possible development of a full-scale eruption later in the day, and the authorities stood by in case people in the most dangerous areas had to be moved., 293824=On 21 June, a small ash plume from Ulawun was visible on satellite imagery extending NW of the volcano's summit. The height of the plume was not reported., 256444=01/1993 (BGVN 18:01) Seismicity increases; eruption column to 1,000 m above summit; continued ash emissions, 102206=An eruption from Ulawun that started on 28 September continued until 2 October 2000 (BGVN 25:08). Preliminary information was based on news media reports and aviation sources. The Rabaul Volcano Observatory (RVO) has since provided more accurate and detailed reports for the August-October 2000 period., 42998=The Darwin Volcanic Ash Advisory Center posted two reports on Ulawun. The initial 22 August report noted \"thin plume to FL 100 [~ 3 km altitude] extends 60 NM [~ 110 km] to SW on NOAA 15 [image of 2038 UTC on 22 August] . . .. At 0330 UTC on 23 August ash was not identifiable from satellite data.\", 189194=\"Activity . . . remained at a low, non-eruptive level throughout February. No significant visible or audible activity was reported, and the seismicity remained [at about] 100 events/day.\", 292620=Satellite imagery on 19 May showed a small plume from Ulawun at an unknown height extending W., 69180=Satellite imagery showed eruption plumes on 22 and 28 August (news reports indicated continued activity that entire week), and 6-7 September 2002 (BGVN 27:08). The Darwin VAAC issued advisories about low-level ash plumes on 12 and 19 September, and an ash-and-steam cloud to ~3.7 km on 28 September. Low-level ash plumes were noted again on 2 and 16 October, with another higher plume (~3.6 km) on the 22nd. At 0630 on 3 November an Air Niugini pilot reported ash drifting ESE from the volcano at ~3 km altitude., 112698=A white vapor plume was present throughout September. It appeared to vary in thickness, probably as a result of atmospheric conditions. Observed seismicity was low to moderate., 344608=Seismicity ongoing with plumes during May 2010-May 2011, 263387=02/1988 (SEAN 13:02) Frequent earthquakes and tremor; heavy rain, 248777=07/2004 (BGVN 29:07) Thin white-and-blue vapor emissions but otherwise quiet during July, 105066=A Post Courier news article stated that the eruption began at 0230 on 29 September, but due to communication problems with the Rabaul Volcano Observatory's Mount Ulamona monitoring station they did not receive reports of the eruption until about 0800. The Darwin VAAC issued a volcanic ash advisory stating that volcanic activity was reported to them at 0605 through an air report from Air New Guinea airline, but there was evidence of an ash cloud in satellite imagery starting at about 0400., 255296=10/1993 (BGVN 18:10) Activity level remains low, 237061=\"The lava flow sources remained vigorously active 12-13 May. More than a dozen individual vents were present, five of them fountains. The cumulative effusion rate was probably 100-200 m3/s (provisional estimate), and the lava velocity was about 2-2.5 m/sec near the sources. During this time however, summit explosive activity weakened and eventually ceased in the late afternoon of 13 May. Although ash emission was still fairly strong on the 12th and the morning of the 13th, the ash column was no longer black but a mid-grey/brown color. During the afternoon of the 13th, intermittent periods of only white vapor emission were noted during the final stages of explosive activity., 16481=Information Contacts: Ima Itikarai, Rabaul Volcano Observatory (RVO), P.O. Box 386, Rabaul, Papua New Guinea (Email: hguria@global.net.pg); Darwin Volcanic Ash Advisory Centre (VAAC), Commonwealth Bureau of Meteorology, Northern Territory Regional Office, PO Box 40050, Casuarina, NT 0811, Australia (URL: http://www.bom.gov.au/info/vaac/, Email: darwin.vaac@bom.gov.au); Hawai'i Institute of Geophysics and Planetology (HIGP) Thermal Alerts System, School of Ocean and Earth Science and Technology (SOEST), Univ. of Hawai'i, 2525 Correa Road, Honolulu, HI 96822, USA (URL: http://hotspot.higp.hawaii.edu/)., 340429=RVO reported diffuse gray plumes that rose 200-500 m above Ulawun during 16-21 July 2010. Plumes were white to light-brown during 21-29 July. During 6-24 August, white and gray-to-brown plumes rose no more than 300 m above Ulawun, and fine ash fell on the NW and W flanks. Tremor continued, but overall seismicity declined slightly. RSAM values remained at a moderate level., 247589=10/2009 (BGVN 34:10) Earthquake swarm followed by incandescence in June 2008, 224457=\"After the 24 December increase in vapour emission, Ulawun was back to a rather low level of activity. The summit crater released a low-pressure, sulfur-laden vapour plume, and daily seismicity included fewer than 1,000 B-type recorded events. In January the seismicity steadily increased again in both amplitude and frequency, to its former moderate level of 1,000-1,300 events per day.\", 251417=08/2000 (BGVN 25:08) Eruption on 29 September causes the evacuation of nearby towns, 33279=A previous report (BGVN 31:02) described small earthquakes on 1-2 March 2006, accompanied by \"gray-blue emissions.\" Subsequent ongoing eruptions continued at Ulawun through 18 January 2007, generating almost daily aviation reports describing plumes blowing W to NW and of generally modest height (table 3). The tallest plume of the reporting interval rose to 4.6 km altitude., 249780=09/2003 (BGVN 28:09) White vapor emissions from the main crater; offshore effervescence, 39937=Ulawun remained quiet from August 2004 until March 2005. During March 2005, weak to moderate volumes of thick white vapor were released from the main crater. On 27 and 28 March light gray emissions were observed, and small continuous volcanic tremor was recorded for six hours. The N vent remained quiet. Seismic activity continued at low levels with low-frequency earthquakes recorded. A tiltmeter was installed on 15 March but no significant movements were detected., 253595=06/1995 (BGVN 20:06) Variable vapor emissions, 260279=08/1989 (SEAN 14:08) Vapor emission; minor seismicity, 259171=02/1990 (BGVN 15:02) Low-level activity; moderate white-blue summit emissions, 272016=Based on information from the Rabaul Volcanological Observatory, the Darwin VAAC stated that no eruptions of Ulawun had been reported since the 30 April event, though cloudy conditions have inhibited clear views of the volcano. Limited evacuations occurred on 3 May due to the possibility of further volcanic activity. Ulawun is at stage 2 alert., 134153=\"Activity . . . continued at the low levels reported for February. White vapour emissions usually varied from weak to moderate but were more forceful 26-27 March. Weak glow was reported on the 8th., 135658=\"An aerial inspection on 18 February gave a reasonably clear view of the base of the crater. The source of the glow, on the E side of the crater, could not be seen directly. Only the glow's reflection on the walls of a vent at the crater base was seen. It was not possible to say whether this has changed since the last observation in January, but no other features in the crater have changed., 43800=Thin white-and-blue vapor emissions but otherwise quiet during July, 209341=\"The first period of harmonic tremor, which was low in amplitude, lasted less than 2 hours. It was followed by three days (23-26 December) of high seismic activity consisting of further periods of low-amplitude, continuous and discontinuous harmonic tremor and numerous larger-than-normal B-type volcanic events. No changes to the normal white vapour emission were observed during the seismic crisis. Disturbances consisting of loud bangs and the production of vapour rings were observed from Ulamona Catholic Mission on 15-16 and 20-21 December, but were not accompanied by any events on the seismic records.\", 79313=Early in this phase, local people reported ash emissions from a site in a gully where the pyroclastic and lava flows had passed. It was later confirmed that a dike had reached the surface, resulting in a fissure where ash emissions were released. A lava lobe protruded from the new vent and extended about 20 m downslope. Figure 4 shows a mild explosion from this vent on 3 May. Dike intrusions were also observed during the 1978 eruption at Ulawun, and resulted in surface fissure activity on the higher SE slopes and farther down on the E slope, which produced a lava flow., 258086=08/1990 (BGVN 15:08) Weak vapor emission and seismicity, 225598=\"A very large white vapour cloud was emitted from the summit for several hours during the morning of 24 December, and moderate to strong vapour emission continued for three days. This coincided with a decline in seismicity which had been at a higher than usual level since mid-November. During the last week of the month seismic activity remained below the usual level of 1,000 to 1,500 B-type events per day. The vapour emission on the 24th is the most visible sign of activity since the volcano last erupted in October 1980 (05:10).\", 147286=\"Activity remained at the low, non-erupting level displayed since January 1990, gently releasing a white vapour plume and generating an average of ~200 very small low-frequency earthquakes/day., 73893=McKee, C.O., 1983, Volcanic hazards at Ulawun volcano: Geological Survey of Papua New Guinea Report 83/13, 21 p., 278231=On 19 September at 0700 a low-level ash plume from Ulawun was visible on satellite imagery., 300336=On 31 May, a thin steam-and-ash plume from Ulawun reached an altitude of below 3 km (10,000 ft) a.s.l., 253810=03/1995 (BGVN 20:03) Continued moderate vapor emissions; SO2 data from October 1994, 250789=06/2001 (BGVN 26:06) New vent opens during April-May eruption, 264652=01/1986 (SEAN 11:01) Seismicity declines, 265614=12/1984 (SEAN 09:12) Incandescent tephra from lava mound; seismicity builds, 169309=Low-level activity follows January eruption, 238651=\"Summit activity during the night of 9-10 May was reduced in comparison to that of the previous nights, with much less incandescence, and intermittent spells of inactivity up to 30 seconds long. Little activity was evident by about 0800 on 10 May; rumblings were often heard, but only a thin wispy eruption column was present., 340028=Based on analyses of satellite imagery and information from RVO, the Darwin VAAC reported that on 26 November 2010 an ash plume from Ulawun rose to an altitude of 3.7 km and drifted 55 km NE., 289578=According to the Darwin VAAC, a thin plume emitted from Ulawun was visible on satellite imagery at a height of ~3 km a.s.l. on 14 and 15 August., 153627=\"Activity remained at a very low level, with the summit crater releasing white vapour in small to moderate amounts. Seismicity was limited to a few (<=10) very small low-frequency events/day. Aerial inspection 2-4 May showed no significant change in summit morphology., 266349=03/1984 (SEAN 09:03) Explosions and January seismic crisis; 3-month summary, 142298=\"The volcano remained quiet, releasing only moderate white vapour throughout the month. After a slight increase in seismicity in December, seismic activity was back to a low level in January. Daily totals of volcanic earthquakes ranged from 5 to 35.\", 244165=Eruption during 4-19 October produces lava flows and ejecta from five vents, 261376=02/1989 (SEAN 14:02) Low-level activity follows January eruption, 84777=The high seismicity on 31 January was followed the next day by occasional deep roaring and rumbling noises. On 2 February thick dark-gray and gray-brown emissions caused ashfall to the NW around Ubili village. Poor visibility after 0800 prevented further observations. The next day weak-to-moderate thin white vapor was observed. Similar summit activity was reported on 4 February with occasional booming noises between 1300 and 1400. After the 5th, thin white vapor was present on most days in February., 252710=06/1996 (BGVN 21:06) Steam emissions continue, 22571=Aactivity at Ulawun since early 2007 has consisted primarily of low-frequency earthquakes and white vapor emissions, with ash reported on 1 May and 25 December 2007 (BGVN 33:03). No additional activity was reported by the Rabaul Volcano Observatory (RVO) until a seismic swarm preceded observations of glow on 13-14 June 2008. Incandescence was seen again in mid-May 2009., 291473=During 25-28 March, volcanic and seismic activity at Ulawun were at low levels. Gas was emitted from the main crater, and low-frequency earthquakes were recorded beneath the volcano. Small-amplitude continuous volcanic tremor was recorded during 27-28 March., 100998=During August, low-frequency earthquakes occurred as usual. On about 26 August, both amplitudes and event counts dropped by a factor of three. Also beginning in August, an electronic tiltmeter located on the flanks ~2.5 km WSW of the crater vent began to show some inflation on the NS component. By month-end about 7 µrad of inflationary tilt was recorded. The EW component (radial to the vent) lacked changes., 268508=10/1980 (SEAN 05:10) Brief, intense explosive eruption, 255128=11/1993 (BGVN 18:11) Activity level remains low, 254164=08/1994 (BGVN 19:08) Low-frequency seismicity, 16827=Reference. Arumba, J., 2009, Agenda Item 3, Coordinating Committee for Geoscience Programmes in East and Southeast Asia (CCOP), 46th CCOP Annual Session, 18-23 October 2009, Vungtau, Vietnam; Member Country Report of Papua New Guinea, October 2009, Annual member country report, 16 p., 303619=Based on satellite imagery, the Darwin VAAC reported that during 16-17 November diffuse plumes from Ulawun drifted N and NW. An ash-and-steam plume was visible on 18 November., 170408=\"There are some indications that the eruption was phreatomagmatic. Microscopic examination of ash samples indicates that the ash is very fine grained with a large proportion of accessory material. However, some fresh dark glass is also present. Secondly, the significant increase in seismicity in mid-late December coincided with a period of heavy rainfall that may have triggered the eruption. On the basis of tilt measurements, it is speculated that a magmatic eruption could still take place, although it is not considered to be imminent.\", 260469=07/1989 (SEAN 14:07) Weak emissions continue; low SO2 flux, 105401=The previous Ulawun activity report from June 2000 stated that mainly thin, white vapor was emitted from the volcano and that seismicity was moderate (BGVN 25:07). There were no reports of anomalous activity until 29 September 2000 when a moderate-sized eruption occurred., 267266=06/1983 (SEAN 08:06) Five periods of volcanic tremor, 338352=Reference. Sabretoothed69, 2010 (uploaded on 7 November 2010), YouTube (URL: http://www.youtube.com/watch?v=UnCSeky3Mes, uploaded by sabretoothed69), 248376=09/2005 (BGVN 30:09) Thick plumes and earthquakes during late August to mid-September 2005, 82847=The highest seismicity outside of the eruption took place between 31 January and 1 February. It was followed by a rapid inflation of 3-4 µrad in a few days. This was followed by deflation of about 10 times less. The September 2000 and April 2001 eruptions occurred during deflationary periods preceded by a few months of inflation. In retrospect one might speculate that the seismic swarm and inflation were signs of rapid intrusion of significant volumes of magma to a shallow depth., 32831=Table 3. A summary of key events at Ulawun observed during the reporting interval 22 March 2006-18 January 2007. Reported plumes did not attain an altitude of over 4 km except on 12 November, when they reached an altitude of 4.6 km. Information based primarily on satellite data and pilot reports from the Darwin VAAC and in a few cases, the US Air Force Weather Agency (AFWA)., 70186=During mid-March 2002 through at least early February 2003, activity from the main crater and the N valley vents of Ulawun were unchanged and generally remained low. The vent in the main crater released weak-to-moderate volumes of white and white-gray vapor. The N valley vents sometimes produced very weak traces of thin white vapor. Seismicity returned to background levels after volcanic tremors ceased on 18 March 2002. Discrete low-frequency earthquakes continued to occur in small numbers. During 15-28 April the seismicity level was low, however from 29 April seismicity increased to a moderate level following an episode of continuous volcanic tremor. The tremor ceased on 25 May. In June, RVO reported that the electronic tiltmeter continued to show long-term deflation of the summit area, but the amount of change was smaller than in the previous 1-3 months. Small continuous volcanic tremors became more prominent beginning on 21 January 2003 and ceased on 27 January., 191074=\"There were no further indications of eruptive activity except for a brief period of weak glow from the summit reported on the night of 2 December. Reports of eruptive activity from the Ulamona Mission on the 4th were probably due to a delayed debris avalanche. Unconsolidated material in the summit area became unstable and flowed down the NW flank. Loose ash was stirred up by the flow and produced an 'eruption-like' plume.\", 208268=Explosions and January seismic crisis; 3-month summary, 246487=Eruption during January produces nuee and ash emissions, 87696=Information Contacts: Darwin VAAC, Regional Director, Bureau of Meteorology, Northern Territory Regional Office, PO Box 40050, Casuarina, Northern Territory 0811, Australia (Email: darwin.vaac@bom.gov.au, URL: http://www.bom.gov.au/info/ vaac/); Simon Carn, Joint Center for Earth System Technology (NASA/UMBC), University of Maryland Baltimore County, 1000 Hilltop Circle Baltimore, MD 21250 (Email: simon@skye.gsfc.nasa.gov)., 240879=\"Similar activity continued through the night of 8-9 May, probably with a slight decline in intensity. However, beginning about 0700 on 9 May the vigor of ejections increased and the ash content built up very rapidly, until by mid-afternoon large quantities of black ash were being erupted in a column about 2.5 km high, and ashfall was accumulating rapidly at the downwind coast. A layer about 1 cm thick was deposited in a few hours 12 km WNW of the summit, and the ash plume extended tens of kilometers out to sea. An aerial inspection early 9 May revealed a weak small second vent on the SE side of the summit. This strong phase slackened off noticeably after about 1630 on 9 May., 182392=Despite strong microseismicity that began in [December] 1987, Ulawun showed no visible sign of increased activity. White vapour continued to be released in weak to moderate amounts from the summit crater. Recorded seismicity showed dramatic fluctuations in number of events (300-1800/day), amplitude, and style. Records showed periods of low background seismicity interspersed with sub-continuous low-frequency (B-type) events of small to large amplitude, or periods of non-harmonic tremor lasting 1/2-2 hours. No particular pattern could be recognized, but periods of tremor occurred virtually every day, usually 1 or 2 episodes lasting up to ~2 hours, although on some days up to 12 short periods of tremor were recorded., 258437=06/1990 (BGVN 15:06) White vapor emission; low seismicity, 68605=MODVOLC Thermal Alerts, 2001-2002. Throughout 2001 and 2002, thermal alerts for Ulawun occurred only during 26-28 April 2001. The first detected anomaly was at 2225 on 26 April and consisted of four alert-pixels with a maximum alert ratio of -0.095. By the following day the anomaly had increased in spatial dimension to eight alert-pixels although the maximum alert ratio was lower (-0.224). On 28 April at 2215 the anomaly had increased to 15 alert-pixels with a higher maximum alert ratio of -0.053. After that no more anomalies were detected., 135233=\"EDM and dry-tilt surveys were carried out from 16-19 February. The EDM surveys showed little change since the last survey in September 1992, although there was some evidence of inflation at two stations high on the flanks. Dry-tilt results from two stations (S. Ridge and NW Valley, respectively 3 and 6.2 km from the summit) showed radial inflation of 25 and 17 µrads since September. Changes at three other stations were not conclusive.\", 251809=03/2000 (BGVN 25:03) Minor vapor emissions continue in early 2000, 106518=This report covers the period from April to June 2000. There were no unusual reports from Ulawun in April. Throughout May, moderate to thick white vapor was emitted. Emissions in June consisted of thin white vapor. However, on 5 and 7 June, the emissions were thick white vapor. Seismic activity for June was at a moderate level., 110885=During the past 6.5 years, through September 1999, summit activity at Ulawun consisted of variable amounts of emissions that ranged from very thin white vapor to moderate volumes of thick white vapor. Seismic activity was generally low. Low frequency earthquakes were recorded. Their occurrence was very variable and the amplitudes of the events fluctuated, but remained near background levels. In June 1998 a number of high-frequency earthquakes began occurring, but have been very sporadic since., 25514=[On 29 May 2007, RVO reported thick white vapor; there were no audible noises or night glow.] The two N valley vents remained quiet. Seismicity was at a low to moderate level dominated by low-frequency earthquakes. Through May, between 500 and 1,265 low frequency events were recorded daily with the most recorded on 28 and 29 May., 169219=\"Activity dropped to a low level in February. Weak to moderate emissions of white vapour were released from the summit crater, and the seismicity was at a very low level.\", 43686=Ulawun remained quiet during July 2004. Emissions from the main vent consisted of white vapor being released at moderate rates. Wisps of blue vapor were reported on 4-5, 7, and 12-14 July. No noise or night-time glow was reported during the month. Emission of thin white vapor from the two N-valley vents was reported during 4-6 July. Seismic activity was at a low level. Ground deformation continued to show a steady uplift that began late last year., 58038=This issue supplements the Bulletin reports with those from the Darwin VAAC archives (table 2), which included information provided from ground, airborne, and space-based sensing. RVO reports that Ulawun remained quiet during February 2004. Emissions from the main vent consisted of white vapor being released at weak to moderate rates. No noise or night-time glow were reported during the month. No emission was reported from the two N-valley vents. Seismicity was at a low level., 91612=On 13 and 17 October small mudflows occurred, originating on the upper NW flanks and sweeping down a dry creek through Ubili village and then to the sea. At certain places the flows spread laterally. No reported damage or casualties were caused by either mudflow., 262452=07/1988 (SEAN 13:07) Seismicity subsides to inter-eruptive levels, 111941=A white vapor plume was present throughout September; it appeared to vary in thickness, probably as a result of atmospheric conditions. Observed seismicity was low to moderate. An aerial inspection on 1 October, as part of the Ulawun Decade Volcano workshop, showed the summit crater to be open, ~150-200 m in diameter, with vertical sides descending at least 50 m before being lost in thick white fume., 159599=\"The low level of activity . . . continued in October. The only visible sign of activity was the steady emission of a weak-moderate white vapour plume from the summit crater. The seismicity has been at background level with <50 small-amplitude B-type events/day.\", 294463=A short plume was visible in satellite imagery at ~3 km (9,800 ft) a.s.l. during 22-27 June and on 27 June a pilot report noted that the plume extended 37 km (20 nautical miles)., 93566=There were reports of multiple vents during past eruptions. However, aerial inspections in 1985 and 1993 only revealed evidence of Vent A. Ulawun had a flank eruption on the SE side during the 1978 eruption., 249382=02/2004 (BGVN 29:02) Tabulation of aviation reports issued during 2000-mid-2003, 76210=An eruption occurred at Ulawun during 25-30 April 2001 (BGVN 26:06). Limited evacuations occurred on 3 May due to the occurrence of relatively high seismic activity and the possibility of further volcanic activity. On 14 June the Rabaul Volcanological Observatory (RVO) recommended that the Alert Level be reduced from 2 to 1. At this stage of alert, people could move back to their homes with the approval of the local disaster committee., 40320=Frequent ash/steam plumes during March-August 2005, 162330=During airborne COSPEC measurements on the 27th from 1150 to 1240, a diffuse white plume extended 10-15 km from the crater. Four traverses yielded SO2 emission rates of 149, 66, 120, and 134 t/d. The average flux was 120 t/d, an increase from 1983 values (97, 70, 49, 66 t/d) that yielded an average of 70 t/d. When Williams flew past the volcano on 30 July, the plume remained thin, white, and wispy, but visible for 10-20 km downwind., 313393=RVO reported that during 1-20 May Ulawun emitted variable amounts of white vapor. Based on analyses of satellite imagery, the Darwin VAAC reported that during 22-25 May ash plumes drifted 35-130 km at an altitude of 3 km (10,000 ft) a.s.l., 160390=\"Ulawun remained quiet in September. Emissions from the summit crater were white and in small to moderate volumes. Seismicity remained generally low with ~20 small B-type events recorded daily. On a few days, however, several hundred events were recorded.\", 271195=According to the Darwin VAAC, a pilot reported observing a \"smoke\" cloud produced from Ulawun at 0730 on 30 April. The cloud was at an altitude of ~9 km a.s.l. and drifting to the NW and SW. Satellite imagery indicated that the cloud may have reached ~13.7 km a.s.l. and that the eruption ceased by ~1530 on 30 April. The Rabaul Volcanological Observatory stated that Ulawun is at a high alert level and further eruptions are possible., 86766=A previous report about the eruption plumes of late April-early May was based on information received from satellites (e.g., TOMS, which disclosed 5 ktons of SO2) and the Darwin VAAC (BGVN 26:05). This follow-up recounts ground-based reports from the Rabaul Volcano Observatory (RVO). It covers the new flank-vent eruption and its preceding events. Ulawun's prior eruption was about 7 months earlier (BGVN 25:11)., 62369=The period 25 June-22 July was quiet, with no audible noise or night-time glow, and weak to moderate volumes of vapor from the main summit crater. The Volcanic Ash Advisory Center in Darwin reported these plumes as being visible on weather satellite imagery. The plumes appeared white-gray on occasions and were unusually strong bluish white gray over the last three days of the period. Volcanic seismicity was low, with several strongly felt tectonic earthquakes on the night of 3-4 July. A large regional earthquake centered 45 km N of Rabaul affected the area on 16 July, leading to a large tiltmeter offset, which slowly recovered over the following days., 180184=\"The low level of visible activity continued during May, with weak emission of white vapours. There was an increase in seismicity during the second half of the month which may correlate with increased rainfall on the volcano. Periods of volcanic tremor were recorded on 15 and 29-31 May.\", 143347=\"Ulawun remained in a non-erupting state, releasing only weak to moderate white vapour. A slight increase in seismicity occurred in December after waning temporarily at the beginning of October (BGVN 16:10). Seismic activity consisted of low-frequency earthquakes, with daily counts fluctuating between 10 and 182. High-frequency volcanic earthquakes were also recorded occasionally through the month. Ground deformation continued to show no significant change.\", 334526=RVO reported that activity at Ulawun was low during 1-15 December; pale gray ash plumes rose from the crater. People between Sena Estate and Noau on the N flank reported ashfall in early December., 259582=12/1989 (SEAN 14:12) Gas emissions and seismicity remain at background, 149847=\"Activity in September remained at a very low level. Summit crater emissions consisted of white vapours released at low to moderate rates. Seismicity remained at a very low level.\", 256020=03/1993 (BGVN 18:03) Activity continues at low level, 205087=\"After several weeks of intensified seismicity and occasional small phreatic explosions, a mild Strombolian eruption began on 4 September and ended on 11 September., 13942=As an overview of this report, the Rabaul Volcano Observatory (RVO) noted that during May 2010, the volcano produced occasional gray plumes, incandescence, audible noises, and increased seismicity. Accordingly, RVO recommended that the hazard status be set at Stage 1 Alert (in their 4-stage alert system), where it stayed through the rest of the reporting interval. Large regional earthquakes took place in June and July 2010 (figure 14)., 235498=\"A short-period, vertical-component seismograph has been in use at Ulamona Catholic Mission (11 km WNW of Ulawun's summit) since December 1976. Between then and August 1977, a number of brief swarms of B-type volcanic events were recorded. During the last few days of April 1978, a number of barely discernible events, probably of the same kind, were recorded (mostly on 27-29 April) and a few were seen every day until the start of the eruption. Somewhat larger events resembling short bursts of volcanic tremor occurred on 2-3 May. During the few hours before the start of the visible eruption on 7 May, patchy, weak tremor was recorded. This tremor became strong and continuous with the commencement of visible activity, and maximum amplitudes were recorded during the first night. Tremor declined slightly after that and from mid-week, amplitudes fluctuated. Tremor ceased altogether with the end of explosive activity on 13 May. Some large and unusual events were recorded on the 9th and l0th that may be volcanic, but their interpretation is unclear at present.\", 263572=01/1988 (SEAN 13:01) Continued strong seismicity; vapor emission, 206243=\"Apart from a few minor steam blast explosions earlier in the year, the level of activity in 1984 has been low. However, in mid-August the amplitudes of volcanic earthquakes increased markedly, and by late August the frequency of occurrence of volcanic earthquakes was increasing., 70296=Intermittent ash plumes from August through early November 2002, 42663=Andrew Tupper reported that on the morning of 23 August satellite imagery showed a plume ~ 50 km long escaping from Ulawun (figure 9). He went on to comment that the light at that time and the meteorological conditions were perfect for creating and seeing plumes. Discussion with RVO suggested that Ulawun often steams in roughly the same manner, but that atmospheric conditions are only sometime advantageous for seeing the plume. Tupper noted that \"In stagnant and/or unstable air, the plume might rise higher above the volcano, but be less visible to satellites (and be obscured by convective clouds); fresh dry-season airflow is by far the best for creating and spotting plumes.\", 328678=RVO reported that dense gray-brown ash plumes that began rising from Ulawun on 6 November ceased on 11 December. During 12-16 December variable amounts of white vapor plumes rose from the crater., 306811=The Darwin VAAC reported that diffuse steam-and-ash plumes from Ulawun were visible on satellite imagery drifting SW on 4 January., 34838=Ash emission on 1 March, more than four months after last eruption, 236336=\"By 14 May, the lava flow sources were fewer in number and much weaker; sources higher up the fissure had stopped and only one fountain was still active, at the bottom end of the fissure. Lava flow ceased altogether, probably during the night of 14-15 May, just as the flow front had finished blocking the main channel of the Pandi River (about 11 km from the volcano), diverting it into an existing older channel. Lava had passed less than 50 m from Naisapuna, a hamlet of four houses and the only inhabited spot on the whole E flank, and had cut the only road on that flank (a rough track). Provisionally, the flow may contain 20 x 106 m3 of lava. The lava appears to be basalt, broadly similar to that of the 1970 and 1973 eruptions, although no analyses have yet been carried out., 284910=An ash plume from Ulawun was visible on satellite imagery on 22 September at a height of ~3.7 km a.s.l. The plume extended toward the NW., 49182=The VAAC reports contain numerous abbreviations; however, a few of the terms here are in widespread use referring to satellites, meteorology, and various related agencies (NOAA, AFWA, GOES9, MODIS, and KGWC . . . DMSP Imagery, etc.) or AIREP (atmospheric conditions reported from aircraft). \"RVO\" stands for Rabaul Volcano Observatory. Other terms may be less familiar: \"AIR NIUGINI, ANK.\" refers to a commuter plane in the fleet of the national airline based in Papua New Guinea. The stated dates and times are not local ones, but instead refer to those at the zero (prime) meridian. For example, 04/2240Z means the fourth day of the stated month at 2240 UTC (i.e. \"Z,\" spoken as Zulu, is shorthand for Coordinated Universal Time (UTC)., 199430=\"Seismicity stabilized on about 17 January at about ten times normal levels. Despite the reduced seismicity, summit crater incandescence returned on 16 January and persisted until the 25th. Ejections of incandescent tephra were more frequent than earlier in the month, occurring at rates of up to about 10 per minute, and rising to about 130 m above the crater rim. The ash content of ejections was insignificant, and the eruption plume was only 1-2 km long. Seismicity started to decline on 25 January and dropped sharply to normal levels on the 27th, marking the end of the eruption., 267443=05/1983 (SEAN 08:05) Variable seismicity, tremor episode, 244043=Card 1736 (31 October 1973) Eruption during 4-19 October produces lava flows and ejecta from five vents, 12090=According to the Darwin VAAC, during 1-5 July ash plumes drifted 55-195 km at an altitude of 3 km. RVO reported that, at times during late June and July, white-to-gray plumes rose up to 500 m above the volcano. During 27 June-9 July fine ash fell in areas to Ulawun's SW, W, and NW., 304890=Based on satellite imagery, the Darwin VAAC reported a diffuse ash-and-steam plume from Ulawun on 29 November and an ash plume on 4 December. The altitudes and drift directions were not reported., 175629=\"During most days the summit crater remained under cloud cover. When visible, the summit released mostly white vapour in weak to moderate and occasionally large amounts. Recorded seismicity was at a low level during the first four days of October (3-13 small B-type events/day), but a sudden upsurge in the number of seismic events occurred on the 5th with a total of 575 recorded. From the 6th to the 25th, daily totals of events fluctuated between 2 and 415. The average amplitude from the 1st to the 25th remained constant. On the 26th, a sudden change in seismic activity occurred and continued to the end of the month. [This] seismicity was characterized by bands of low-frequency harmonic tremor recorded for long periods (1-2 hours) with a further increase in size and number of accompanying B-type events. These events sometimes occurred in groups (1-3 events/minute) with average amplitude 8 times higher than normal. A steady increase in the number of B-type events occurred from the 26th with the highest number (820) recorded on the 31st.\", 227538=\"Since the installation of a short-period vertical component seismograph at Ulamona in December 1976, B-type volcanic earthquakes have been common, sometimes occurring in swarms. During 1980 these events often occurred at intervals of less than 2 minutes, but during the night of 6 October they became more frequent, resembling patchy volcanic tremor. Several strong local earthquakes, probably A-type volcanic events, were recorded on 3, 5, and 6 October., 318899=Based on analyses of satellite imagery, the Darwin VAAC reported that during 1 and 2-5 July ash plumes from Ulawun drifted 55-195 km at an altitude of 3 km (10,000 ft) a.s.l., 208167=\"Following increased seismicity and reports of audible explosions and vapour rings in December 1983, a phase of mild explosive activity took place in January. The eruptions were probably phreatic or phreatomagmatic as some correlation with rainfall is evident. Explosions producing tephra clouds were observed 12-14 and 19-20 January. These emissions rose as high as 2,000 m above the summit. Seismicity throughout this period was of low intensity and characterized by occasional bursts of tremor. A major seismic crisis began at about 1400 on 20 January. Tremor rapidly became strong and continuous. Large-amplitude volcanic earthquakes were discernible in the tremor by 2300. Soon afterwards tremor began to subside. It is not known whether eruptive activity accompanied this seismicity as the volcano was obscured by clouds. For the remainder of January and throughout February, no eruptive activity took place, and seismicity was low., 249572=11/2003 (BGVN 28:11) Intermittent ash plumes during September-October, 262640=06/1988 (SEAN 13:06) Seismicity declines; vapor emission; deflation, 277050=On 7 September a low-level (less than ~3.6 km a.s.l.) ash plume was visible on satellite imagery, extending to the NW., 207197=\"An explosion sound from Ulawun was reported on 4 March, and tephra emissions were observed on the 5th and 13th. The emissions on the 13th rose to about 2000 m above the summit. Seismicity was generally at a low level in March. On most days, 100-300 volcanic earthquakes were recorded, but a peak of about 750 events was reached on 9 March. Earthquake amplitudes were slightly higher 9-11 March.\", 22673=Earthquake swarm followed by incandescence in June 2008, 27584=Information Contacts: Rabaul Volcano Observatory (RVO), P. O. Box 386, Rabaul, Papua New Guinea (Email: hguria@global.net.pg); Darwin Volcanic Ash Advisory Centre (VAAC), Bureau of Meteorology, Northern Territory Regional Office, PO Box 40050, Casuarina, NT 0811, Australia (URL: http://www.bom.gov.au/info/vaac/, Email: darwin.vaac@bom.gov.au); US Air Force Weather Agency (AFWA), Satellite Applications Branch, Offutt AFB, NE 68113-4039, USA (Email:charles.holliday@afwa.af.mil); Hawai'i Institute of Geophysics and Planetology (HIGP) Thermal Alerts System, School of Ocean and Earth Science and Technology (SOEST), Univ. of Hawai'i, 2525 Correa Road, Honolulu, HI 96822, USA (URL: http://hotspot.higp.hawaii.edu/); James Mori, Disaster Prevention Research Institute, Kyoto University, Uji, Kyoto 611-0011, Japan (http://eqh.dpri.kyoto-u.ac.jp/~mori/)., 78032=The last phase of this Strombolian eruption fluctuated before it began to decline at about 1130 on 30 April; the eruption stopped at about 2400. Although the 25 April eruption was comparatively small, the development of radial fissures from dike intrusions in the upper interior of the volcanic system might contribute to weaknesses in the structure of the volcano (figure 5)., 119591=Continued moderate vapor emissions; SO2 data from October 1994, 75181=During October through March 2002 activity was generally low. The main crater produced weak-to-moderate volumes of white and white-gray vapor. The N valley vent occasionally released weak volumes of thin white vapor. RSAM data revealed conspicuous seismicity on 26 October; incandescence was observed that night. A rapid trend of deflation beneath the summit area during the previous two weeks stopped on 24 December., 190001=\"In early January, seismicity at Ulawun was still declining (100-200 events/day), following the eruption in November 1985. On 22 January seismicity increased slightly to 300-500 events/day for 4 days then returned to previous levels. No significant visible activity was reported., 311421=RVO reported that white vapor plumes from Ulawun's summit crater were emitted on 10 May and rose a maximum height of 1.5 km. During 10-12 May, occasional roaring and rumbling noises were reported by villagers on the SE and S sides of the volcano. Weak fluctuating incandescence was also seen by people on the S side., 112027=White vapor plumes throughout September, 261545=01/1989 (SEAN 14:01) Eruption ejects ash to 2 km, 257177=09/1991 (BGVN 16:09) Increased seismicity but surface activity limited to gas emission, 107692=Low-level activity continued in January with weak emissions of thin white vapor throughout the month. Slightly stronger emissions occurred on 17 and 26 January. Emissions from the summit crater during February consisted of fluctuating volumes of thin-to-thick white vapor being released gently. March emissions consisted of thin white vapor. The seismograph remained out of operational., 278880=On 28 September around 0400 an eruption occurred at Ulawun that produced an ash-and-steam cloud to ~3.7 km a.s.l. The cloud was visible on satellite imagery at 0632 drifting WSW., 247392=02/2010 (BGVN 35:02) Steam plumes (with some possible ash) in February 2010, 186802=\"Activity remained at non-eruptive levels throughout November. Seismicity was at a very low level and dry tilt measurements indicated no significant tilt between 18 and 21 November. The only reported activity was weak vapour emission from the summit.\", 204381=\"During an aerial inspection on 7 September, a pool of fluid lava was observed in the bottom of the summit crater, about 50-100 m below the rim; explosions took place from a small circular central vent. Most ejecta were contained by the crater walls, but occasional larger explosions showered the upper flanks of the volcano with incandescent tephra. Visible shock waves were generated by the stronger explosions. A white eruption plume several tens of kilometers long was formed at the peak of the eruption. Seismic amplitudes were 30-40 times normal on 7 and 8 September, and the seismicity was characterized by irregular tremor produced by the frequent explosions., 326577=RVO reported that during 1-6 and 10-26 May white plumes rose above Ulawun's summit crater, and during 7-9 and 27-31 May gray-brown ash plumes rose from the crater., 269316=01/1970 (CSLP 06-70) Eruption during January produces nuee and ash emissions, 256216=02/1993 (BGVN 18:02) Activity continues to decline; glow observed in crater, 20509=Ulawun remained quiet throughout September and October 2009. Summit activity was dominated by weak to moderate volumes of white vapor, and seismicity was generally low. During September, daily totals for high-frequency volcano-tectonic events ranged between 0 and 7, and low-frequency earthquakes were registered at a rate of 167-547. For the month of October, daily totals for high-frequency volcano-tectonic events were as high as 11, and the number of low-frequency earthquakes ranged between 74 and 404., 259391=01/1990 (BGVN 15:01) Weak vapor emission; 10-hour seismic swarm follows M 4.2 earthquake 25 km away, 234393=Further Reference. McKee, C.O., Almond, R.A., Cooke, R.J.S., and Talai, B., 1981, Basaltic pyroclastic avalanches and flank effusion from Ulawun volcano in 1978, in Johnson, R.W. (ed.), Cooke-Ravian Volume of Volcanological Papers: Geological Survey of Papua New Guinea Memoir 10, p. 153-66., 337406=2014: January 2013: July | September | November | December 2012: May | November | December 2011: February | May 2010: February | May | June | July | August | November 2009: May 2008: June | July 2007: January | April | December 2006: March | April | May | August | November | December 2005: March | April | May | June | August | November 2004: April | June | August 2003: February | April | May | June | September | October 2002: February | August | September | October 2001: January | April | May | July | September | October, 325486=RVO reported that during 19-22 May gray-to-brown ash plumes rose above Ulawun and fine ash fell on the NW and W flanks. Weak, fluctuating incandescence was observed on 22 May., 21590=Summit activity was very low and consisted of variable amounts of white vapor. Bluish vapor was observed on some days during 16-21 June. Other reported activity included low roaring noises on 1, 2, 12, and 14 June, and summit glow on the 13th and 14th. On 22 June noises heard in villages to the NE accompanied some of the earthquakes. On 28 June an earthquake accompanied by a booming noise was felt in nearby areas. White vapor plumes were emitted during 2-6 July, and occasional roaring noises were reported during 1-3 July., 129462=\"Activity remained at a low level in October. Emissions consisted of weak-to-strong white vapour and occasional blue vapour. Seismicity remained low throughout the month.\", 127270=\"Seismic monitoring was affected by telemetry problems from mid-March until 12 April. When the system was restored, daily earthquake totals were ~400-500. On 18 April there was a sharp increase to ~540 earthquakes/day. The daily totals then increased steadily through the remainder of the month to ~630 at month's end. Earthquake amplitudes showed a progressive increase after 12 April.\", 314580=RVO reported that during 22-28 May Ulawun emitted thick white vapor plumes that rose 800 m high. Some areas of the plumes were gray on 22 and 25 May. People on the S and SE sides of the island heard \"low jetting\" noises during 24-25 May. Weak and fluctuating incandescence was seen at night during 28-29 May by people on the S part of the island. The emissions changed color to gray on 29 May and continued similarly the next two days. On 30 May very fine ashfall was reported in areas to the SSW, S, and SSE. On 1 and 2 June only white vapor emissions were noted. RVO recommended to the WNB Provincial Disaster Committee to declare a Stage 1 Alert to reflect an increasing trend of seismic energy, and a recent presence of occasional gray plumes, incandescence, and audible noises from Ulawun., 329709=RVO reported that activity at Ulawun was low during 1-14 July. Emissions from the summit crater consisted of white vapor during 1-7 July, and then changed to occasionally sub-continuous, light gray ash clouds during 8 and 11-14 July. Ash clouds changed to gray-brown on 14 July. Seismic activity was low from 1 July through the early part of 13 July. RSAM increased from about 0700 on 14 July onwards with the emergence of continuous volcanic tremors until it reached a peak of 700 just after 0300 on 15 July. RVO noted that the last significant volcanic tremors at Ulawun were recorded in May and June 2012., 216989=\"A number of seismic crises took place in June in which periods of volcanic tremor were recorded. The first, on 10-11 June, lasted for about 15 hours and was followed by four more: 15 June (7 hours), 16 June (7 hours), 17-18 June (17 hours), and 30 June - 2 July (48 hours). In the last, several periods of tremor were recorded. Other periods of tremor-like signals were recorded on 14, 27, and 28 June, but these were probably the effects of rainstorms on the volcano., 283745=During 12-27 May, Ulawun's main summit crater continued to emit weak-to-moderate volumes of white vapor and the N valley vent was quiet with no emissions observed. A slight increase in seismicity occurred during 18-23 May. According to the Darwin VAAC, on 1 June at 0925 a thin, low-level plume was observed on satellite imagery. By 1325 it was no longer visible., 147061=\"An aerial inspection and ground deformation survey was carried out 14-16 May. The plume emitted by the crater, although of moderate volume, seemed rich in SO2 and could distinctly be seen stretching horizontally >40 km downwind. No significant changes were noted in summit crater morphology since the last inspection in May 1990, apart from a series of cracks on the terminal cone's upper W flank, suggesting a slight inward sagging of this side of the crater rim., 295050=During 30 June to 1 July, thin ash plumes from Ulawun were visible on satellite imagery. The plume heights were not reported., 253998=12/1994 (BGVN 19:12) White vapor emissions and low-level seismicity, 92557=Activity during October. By 3 October the volcano produced only thin white vapor with no noise or night glow. Various ancillary observations occurred in the next weeks: during 6, 8, 10, 14, 15, 16, 17, 18 October and 1 November observers noted low rumbling or banging or both; when under cover of darkness they usually saw accompanying weak, steady glows. In at least one case they smelled sulfurous odors., 74140=General References. Johnson, R.W., Davies, R.A., and White, A.J.R., 1972, Ulawun volcano, New Britain: Australia Bureau of Mineral Resources, Geology and Geophysics, Bulletin 142, 42 p., 308161=Based on satellite imagery and information from the Rabaul Volcano Observatory, the Darwin VAAC reported that diffuse plumes from Ulawun drifted N on 28 April. On 1 May, an ash plume rose to an altitude of 4 km (13,000 ft) a.s.l. and drifted W., 106629=Vapor emissions during May and June; moderate seismicity in June, 268333=01/1981 (SEAN 06:01) Vapor from summit crater, 163565=\"The level of activity has shown a continuous decrease since the mild phreatic unrest in March. Throughout the month, the terminal crater was releasing a plume of white vapour, while the seismicity was steadily decreasing . . . \", 73232=Ash eruptions during August 2002; plumes visible on satellite imagery, 197591=On 17 November, Ulawun began to erupt ash and lava, producing two slow-moving lava flows. On 21 November, one flow was moving N of the summit; the other to the NW. Officials issued evacuation warnings to the [area's] 700 inhabitants, although there was no immediate danger., 228579=\"No lava flows were produced during the eruption. Estimation of the total volume of fragmental flows awaits receipt and analysis of aerial photographs, but the volume is probably greater than that of the 1978 pyroclastic avalanche deposits (about 17 x 106 m3 of juvenile material). A preliminary estimate of the volume of airfall ash is 10-20 x 106 m3. The lava appears similar to the basaltic material produced in previous eruptions., 273217=A news report on 9 July stated that residents who were evacuated from their homes near Ulawun were permitted to return home. They were evacuated in May after the occurrence of relatively high seismic activity and an eruption in April. On 14 June, almost a month before the news report was published, the Rabaul Volcano Observatory (RVO) recommended that the Alert Level be reduced to 1. At this stage of alert people could move back to their homes with the approval of the local disaster committee, but many residents were hesitant to return and opted to stay in care centers. After the aforementioned news article was published some people returned home and RVO expects more people to return to their villages in the coming weeks., 218643=\"Seismicity continued to show interesting variations in May. Very low levels of seismicity were recorded at the beginning and end of the month, but somewhat stronger seismicity took place 5-23 May. On 19 May a new seismic crisis was recorded. Commencing at about 1000, the crisis consisted first of continuous tremor which lasted for about 7 hours. The strongest part of the crisis was in the first few hours. The tremor became discontinuous from about 1700, gradually giving way over the following few hours to frequent discrete shocks., 168446=\"Unrest appeared related to the amount of rainfall on the volcano. Heavy rainfall started 26 February and continued until 7 March. After ~6 weeks of very low-level activity (following phreatomagmatic eruptions in January; 14:01) volcanic seismicity strengthened on 28 February, with periods of irregular tremor that increased progressively in amplitude. Following the maximum daily rainfall of 142 mm on 3 March, a strong white vapour plume was observed above the summit crater the next day. On the 5th, the plume had become a large ash-laden column rising to 1,000 m, while seismicity reached 8 times 'normal' amplitude levels. A large grey plume with weak red glow was observed on the nights of 5, 6, and 9 March. Seismicity subsided 6-8 March but returned to a moderately high level during the following week, though with a change in pattern; the tremor periods being replaced with a succession of discrete, emergent events., 136361=\"Seismic activity consisted of low-level, sub-continuous tremor with almost no discrete B-type events. The CVO's RSAM (Real-time Seismic Amplitude Measurement) system was deployed at the end of January to monitor tremor levels. From 29 January until 6 February the tremor level declined markedly. The system was inoperative until 17 February, when the tremor level was about the same as on the 6th. Helicorder readings indicated that tremor level was fairly constant from the 6th until the end of the month. This level of tremor is lower, by a factor of 2-3, than that seen during the peak of activity in mid-January and is comparable to the levels seen in early January., 252895=05/1996 (BGVN 21:05) Low to moderate emission of steam continues, 89775=On 30 April 2001 a moderate-sized ash cloud from an eruption at Ulawun was visible on Geostationary Meteorological Satellite (GMS), U.S. National Oceanic and Atmospheric Administration (NOAA) weather satellite, and Total Ozone Mapping Spectrometer (TOMS) imagery. There had been no reports of anomalous volcanic activity at Ulawun since the 28 September-2 October 2000 eruption sent an ash cloud 12-15 km above the volcano (BGVN 25:11)., 246385=Card 0850 (16 January 1970) Major eruption with heavy lava flow; few details available, 264491=02/1986 (SEAN 11:02) Low-level seismicity, 65505=The main summit crater continued to release variable amounts of thin-to-thick white vapor during January-March 2003, and no activity was observed from the N valley vent that formed in May 2001. Heavy rains during February and especially on the 19th, 21st, 22nd, and 24th, caused debris flows on the NW side of Ulawun. The debris channeled into Namo creek and later swept down to the coast. Along its course it overflowed into Ubili village. Muddy water flowed into six houses built on concrete floors and left a thin sheet of dried mud a few centimeters thick., 196568=\"Seismic activity began to increase on 12 November with the occasional appearance of small discrete B-type volcanic earthquakes. These increased in size and number over the following three days, resulting in an official notification on the 15th of an increased risk of an eruption. Seismic activity continued to increase over the following two days with the appearance of low-amplitude continuous harmonic tremor on 17 November at 1600., 99973=The late-stage build-up towards the eruption began at 2200 on 27 September with an increase in low-frequency earthquakes and their amplitudes. A further increase in seismicity took place at about 0200 on the 28th. There began a series of small nonharmonic volcanic tremors with durations up to a few minutes. These increased between 1200 and 1800 on the 28th., 248568=07/2005 (BGVN 30:07) Frequent ash/steam plumes during March-August 2005, 40223=Long steam plumes during 22-23 August 2004 (BGVN 29:07) were observed on satellite imagery. Additional plumes were seen earlier that month, prompting the Darwin Volcanic Ash Advisory Center to issue advisories on four days., 267093=07/1983 (SEAN 08:07) Strong seismicity but no change in plume, 222869=\"The volcano was obscured by heavy cloud for most of this period. The first visual observations were made at 0730 on 22 March when 4-6 almost perfect smoke rings, reportedly pale-grey in colour, were ejected rapidly to about 300 m above the summit crater. Consistently strong white vapour emissions from the summit crater commenced on 25 March, contrasting with the usually weak to moderate white emission. A report on 26 March suggests a brief interval of dark grey emission, but seismic records show no changes that could indicate eruptive activity. The decline in seismicity on 23 March was followed by almost 2 weeks of exceptionally low levels interrupted only by a brief increase, 30-31 March., 114314=The low-level activity of previous months persisted through April and May. White vapor continued to be released in small to moderate volumes, but the rate decreased in May. Seismic activity remained at low levels. The seismograph became non-operational on 23 May., 128658=\"Activity remained at a low level for most of the month except for 10 and 11 November when forceful emissions of thick white vapour were observed. On the 11th, these emissions rose to ~100 m above the crater rim. Seismicity remained at a low level throughout the month.\", 245412=Card 0856 (27 January 1970) High level of activity continuing; constant ash emission, 101841=Activity during August. During August, summit activity remained low, chiefly consisting of weak releases of thin white vapor. While the summit activity remained quiet, some obvious changes were recorded in seismicity and ground deformation (electronic tiltmeter)., 8265=RVO reported that mild activity continued during 1 January through at least 28 February 2011, characterized by brown-to-gray ash plumes that rose less than 500 m. These produced fine ashfall to the SE. Sulfur dioxide plumes drifted SE on 5 and 31 January. During 23-26 February, gray ash plumes occasionally drifted NE, SW, and NW., 344004=2010. RVO reported that, according to Real-time Seismic Amplitude Measurements (RSAM), seismic activity increased on 18 May 2010. According to RVO, white vapor emitted during 1-20 May 2010 became thicker during 22-28 May. On 22 and 25 May, some plumes were partially gray. According to the Darwin VAAC, plumes on 22-28 May reached an altitude of 3 km and extended as far as 70 NM in variable directions., 61683=Reports for the period 12 September-5 October indicated that the main summit continued to release weak to moderate volumes of white vapor, with occasional white-gray emissions. Seismicity was low with no significant ground movements., 249987=03/2003 (BGVN 28:03) Variable seismicity and minor deflation; debris flows in February, 259758=11/1989 (SEAN 14:11) Vapor emission and weak seismicity, 229693=\"Observations from the flank of a neighbouring volcano indicated that strong explosive activity continued until about 1215. Until this time a violent electrical storm had prevailed in the eruption cloud. The cessation of electrical discharges coincided with the cessation of strong explosions., 285529=On 5 October a faint ash plume was visible on satellite imagery at a height of ~4.3 km a.s.l., extending 55 km WSW of the summit., 258794=04/1990 (BGVN 15:04) Vapor emission and low-frequency events, 199879=\"The eruption, characterized by generally low-intensity Strombolian activity, terminated on 27 January. At the peak of seismicity (about 20 times normal levels, on 8 January), weak ejections of incandescent tephra occurred at a rate of 1-2/minute from one or two vents in a mound of fresh lava in the summit crater. From 9 January, seismicity declined steadily, and nighttime incandescence from the crater was absent., 305572=Based on satellite imagery, the Darwin VAAC reported that diffuse plumes from Ulawun reached altitudes of 4 km (13,000 ft) a.s.l. on 9 December. Plumes on 11 December reached unreported altitudes., 38502=On 9 August a plume drifting to the S was visible on satellite imagery (figure 10). During the rest of August, the summit crater released thick white vapor. Seismicity was characterized by small low-frequency earthquakes. One high-frequency earthquake and small periodic volcanic tremors were recorded., 60705=Intermittent ash plumes during September-October, 233521=Australian radio reports that Ulawun began to erupt during the night of 6-7 October. Pilots saw ash \"billowing\" to about 6 km above the crater during the morning of the 7th. A police spokesman said ash was thought to be falling more than 30 km from the volcano. Police were considering the evacuation of Ulamona Catholic mission, the settlement closest to the volcano., 45124=Data acquisition and analysis. Reports from Diego Coppola and David A. Rothery provided analyses of MODIS thermal alerts during 2001 and 2002 (using the MODVOLC alert-detection algorithm) extracted from the MODIS Thermal Alerts website (http://modis.hgip.hawaii.edu/) maintained by the University of Hawaii HIGP MODIS Thermal Alerts team (BGVN 28:01). Rothery and Charlotte Saunders provided updates to 31 May 2004. MODVOLC data are now routinely available from the Aqua satellite (equator crossing times 0230 and 1430 local time) in addition to the original Terra satellite (equator crossing times 1030 and 2230 local time)., 295763=Volcanic activity remained at low levels at Ulawun during 15-21 August, with steam emitted from the summit crater. Seismicity was at low levels, consisting of small low-frequency earthquakes., 249182=04/2004 (BGVN 29:04) Quiet during early 2004; thin ash plumes 12-14 April, 11425=Large regional earthquakes. RVO reported that several large earthquakes occurred during June and July (table 4). The largest of those were the adjacent 18 July earthquakes, a foreshock of Mw 6.9 and a mainshock of Mw 7.3. The latter, which was destructive, was the largest in about a decade. The Provincial Disaster Office reported significant building damage near the epicenter and in the town of Kimbe (65 km NW of the mainshock's epicenter, figure 14). The mainshock's epicenter was also ~45 km S of Pago volcano and 134 km SW of Ulawun. Many damaged houses had been constructed of bush materials, but some houses also included modern building materials. At least one death was reported. Numerous aftershocks followed the main Mw 7.3 shock., 216152=\"At times other than seismic crises, daily totals of volcanic earthquakes were about 1,500, although fluctuations, from 1,000 to 2,000 per day, took place at the end of June.\", 64516=Seismic activity had been low through January-February, but an increase was evident starting on 2 March. This was shown by an increase in RSAM values on the same day. The increased activity remained at low to moderate levels between 2 and 12 March. After that, it declined gradually, reaching low levels on the 20th. Due to technical problems with the only seismograph to monitor Ulawun, no analogue waveforms were recorded, making it difficult to ascertain the type of seismicity associated with the increased RSAM values. However, it is assumed that another of the sporadic volcanic tremor episodes recorded since the September 2000 and April 2001 eruptions was the cause., 254960=04/1994 (BGVN 19:04) Sharp increase in seismicity followed by strong dark grey emissions, 345255=RVO reported that activity at Ulawun was low during 16-31 December; diffuse ash plumes rose from the crater during 51-21 December, and white vapor emissions were visible during 22-31 December., 198813=\"An aerial inspection on 30 January revealed complex topographic changes in the summit crater. The lava dome formed early in the eruption was surmounted by a small cinder cone, and the flanks of the dome were draped with a mantle of scoria and ash. Lava flows formed an almost continuous moat around the base of the dome. There was no overflow of lava onto Ulawun's flanks, but the lava had almost reached the lowest point in the crater rim, at the head of the NW valley. A small pit crater was present near the SW edge of the summit crater. The volume of new lava and tephra in the summit crater is provisionally estimated to be 105-106 m3.\", 226262=\"The volcano was very quiet throughout December with only continuous moderate emission of white vapour from the summit crater.\", 98609=At 0240 on 29 November, the RSAM peaked at 8045 units. Thus, scientists inferred this as the time when the Strombolian phase of the eruption peaked. During the cover of darkness, ash clouds were just visible, initially illuminated by the glow and gradually by incandescent fragments. The latter became common by about 1200 on the 29th when ash clouds were seen blowing NW. The ash clouds began to become voluminous from 0100 on the 29th, coinciding with the intensification of the Strombolian phase of the eruption. The ash clouds were emitted forcefully, accompanied by loud roaring and rumbling noises., 165737=\"Mild, intermittent, eruptive activity continued in April. Ash emissions occurred 6, 8, 11, 20-22, and 28 April, but their ash content was low, and no significant ashfalls were reported. A strong correlation between activity and preceding heavy rainfall (as observed in March) was not evident. When not producing ash, the volcano emitted white vapours at moderate rates., 270266=On 16 January the Darwin VAAC reported that a NOTAM from Port Moresbly stated that Ulawun was emitting a cloud, ashes, and \"flames\" up to 10.6 km a.s.l. blowing towards the SE. In contrast, an ash cloud was not detected in satellite imagery, and the Papua New Guinea Volcano Observatory stated that recent volcanic activity was limited to low-level vapor emissions., 282115=The Darwin VAAC reported that a possible low-level ash plume was visible on satellite imagery on 14 April., 260650=06/1989 (SEAN 14:06) White vapor plume; seismicity decreases, 99587=The late-stage buildup also appeared in RSAM readings. RSAM values changed at 2200 on the 27th from a background level of 2 units, rising at 1200 on the 28th to ~10 units, then by 1800 to 30 units. After 1800, RSAM values continued to rise and the instruments registered intense continuous volcanic tremor. Around this time the RSAM counts exhibited an artificial decline attributed to an overwhelmed event-counting system., 301712=The Darwin VAAC reported steam-and-ash plumes from Ulawun that were visible on satellite imagery on 25, 27, and 28 August. The plumes reached altitudes of 3.7 km (12,000 ft) a.s.l. and drifted NW, W, and SW., 256792=12/1991 (BGVN 16:12) Vapor emission and seismicity, 65617=Variable seismicity and minor deflation; debris flows in February, 214194=Gas measurements on 11 September, 161243=\"A low level of activity continued in August. Emissions released from the summit crater were mostly weak to moderate white vapours, that were occasionally moderate to strong. Seismic activity remained at a steady low level with 30-60 small B-type events daily.\", 265959=09/1984 (SEAN 09:09) Mild strombolian eruption, 95129=Scientists inspected the crater area from the air on 7 October and found two vents on the summit (labeled Vents A and B on figure 3). Comparing Vent A to its appearance during 1993, the overall depth of the crater floor appeared to have risen, becoming about 100-150 m shallower. The fill consisted of older material that collapsed from the inner crater wall and possibly new ejecta from the current eruption. A prominent breach on the N crater rim was evident and may have been created by the N pyroclastic flow. Judging by its close proximity, this flow originated from Vent B. En-echelon cracks on the E end of the crater suggested inward sagging of that side of the crater rim. At the time of the inspection, few emissions escaped the vents; however, traces of white and blue vapor wafted from other areas inside the crater., 251991=12/1999 (BGVN 24:12) White vapor emissions and low seismicity, 58820=Tabulation of aviation reports issued during 2000-mid-2003, 145814=Increased seismicity has been observed at Ulawun, but surface activity remained limited to release of small to moderate volumes of white vapor until late September. Recorded seismicity since mid-August has consisted of numerous to nearly continuous, very small, low-frequency events. Larger events began to occur in mid-September. Periods of stronger seismic activity were occasionally separated by intervals of little seismicity, producing a banded appearance on seismograms. Similar seismicity has been recorded previously at Ulawun, and at Karkar prior to its 1979 eruption. Gas emission on 29 and 30 September was stronger, and brown plumes were reported., 248165=02/2006 (BGVN 31:02) Ash emission on 1 March, more than four months after last eruption, 11509=RVO reported that on 23-24 July ash plumes were observed., 257910=09/1990 (BGVN 15:09) Weak fumarolic and seismic activity, 263759=12/1987 (SEAN 12:12) Volcanic earthquakes increase; vapor emission, 81915=This was when RSAM (Real-time Seismic Amplitude Measurement) data became useful. According to the RSAM, after 1400 tremor levels increased exponentially until about 1800 on the 25th, when it began to fluctuate. The start of the fluctuations coincided with the beginning of a steady weak glow from the summit vent. Earlier, occasional forceful emissions of weak to moderate gray ash clouds had begun at about 0600 on the 25th, and occasional low rumbling noises began at about 1600. Activation of Stage 1 of the Ulawun Volcano Stage of Alert system was recommended to authorities at 0200 on the 25th., 73116=A NNW-trending plume was visible from Ulawun on MODIS imagery on 22 August 2002 (figure 6). The Darwin VAAC reported that on 28 August at 0732 a low-level ash cloud from an eruption at Ulawun was visible on satellite imagery. By 1532 the same day ash was no longer visible. According to a Post-Courier news article, ash eruptions had occurred on 26 August and during the previous week, but became larger on the 27th. As of the 28th, care centers were preparing for possible evacuations. NASA satellite images provided by the Air Force Weather Agency showed a NW-trending plume on 6 September (figure 7). The next day the Darwin VAAC reported a low-level (less than ~3.6 km altitude) ash plume visible on satellite imagery, extending NW., 195683=\"The intensity of the eruption increased with the emission of two large, dark clouds of ash at about 2045 before settling down to a more steady pattern of Strombolian explosions every few seconds, accompanied by a fairly constant level of strong continuous harmonic tremor., 247196=03/2011 (BGVN 36:03) Modest eruptions included ash plumes to 4 km through February 2011, 264844=12/1985 (SEAN 10:12) Seismic and eruptive activity decrease in December, 209695=\"Volcano-seismic activity continued at a low level throughout most of December but increased suddenly again with the appearance of continuous harmonic tremor at 0200 on 24 December, less than 2 days after two strong regional earthquakes (ML 6.4 and 6.5, MM IV-V) about 150 km ESE of Ulawun at 0932 and 1102 on 22 December., 261727=12/1988 (SEAN 13:12) Tremor and B-type events; vapor emission, 18079=The increase in the seismicity was slight and took place during the second half of February 2010. RVO noted that during 12-27 February, Ulawun emitted steam, sometimes forcefully. There was no audible noise and no glow visible from the crater at night. According to the Darwin Volcanic Ash Advisory Centre, the plumes seen during 14-15 February 2010 may have contained ash. They reached 2.4-3.7 km altitude and drifted 45-95 km NNE., 158791=\"Activity continued at background level in November. The summit crater released white vapours in weak to moderate volume on most days. Seismicity remained at background level with <50 small-amplitude B-type events/day.\", 293211=On 3, 6, and 7 June plumes from Ulawun were visible on satellite imagery. The heights of the plumes were not reported., 184875=The increased seismicity . . . continued through January. Usually, 300-500 small events were recorded/day. A period of sub-continuous tremor began 20 January and lasted for ~27 hours. The summit crater emitted small to moderate amounts of white vapor during the few times that the summit was visible., 12790=Very fine ashfall was reported on 30 May in areas to the SSW, S, and SSE. It was again reported on 3 and 8 June, ~10 km NW (in Ulamona). During 9-25 June, fine ashfall was reported almost daily on the NW, SW, and sometimes W flanks., 340866=According to RVO, white-to-gray plumes rose less than 500 m from Ulawun during 27 June-9 July 2010, and fine ash fell in areas to the SW, W, and NW. The Darwin VAAC reported that during 1-5 July, ash plumes drifted 55-195 km at an altitude of 3 km. On 28 June and during 5-6 July the volcano omitted occasional roaring noises. A slight increase in seismicity (above moderate levels) took place during 5-8 July., 90744=The single electronic tiltmeter located on the high WSW flank showed a steady change throughout October. The behavior could possibly be related to edifice inflation., 39442=During April-July 2005 white vapor from the main vent was common, and plumes were frequently visible on satellite imagery. On 6 April, a thin plume was visible extending ~ 55 km to the SW. On 19 May a small plume to an unknown height extended W. Plumes to unknown altitudes were again released on 3 and 6 June. Plumes rising to 3 km altitude were seen on satellite imagery on 6 and 21 June. The 21 June plume contained ash, and initially extended W and WSW; imagery about six hours later showed the plume blowing NW. A short plume was visible at ~ 3 km altitude during 22-27 June, and on 27 June a pilot reported that the plume extended 37 km. During 30 June to 1 July, thin ash plumes were visible on satellite imagery, but heights were not given. No noise, night-time glow, or emissions were reported during this time. Small low-frequency earthquakes were recorded. Volcanic tremor was registered on 16-17 June., 114975=As in previous months, during March Ulawun emitted weak to moderate volumes of white vapor. The seismograph did not operate., 268167=12/1982 (SEAN 07:12) Vapor emission for three days, 219531=\"No unusual visible activity directly accompanied the seismic crisis. However, ejection of one or more smoke rings, seen to rise rapidly to about 500 m above the summit, was reported 11-18 April. Blue vapour emission was seen 14 April. Ulawun's usual white vapour emissions were moderate to strong throughout the month, but increased toward the end.\", 149081=\"Activity remained at a low level in October. Emissions from the summit crater consisted mainly of white vapour released at moderate rates. Seismic activity remained at a very low level.\", 214115=[Richard Stoiber, Stanley Williams, and Chris McKee used a COSPEC to measure the rate of SO2 emission from several volcanoes in Papua New Guinea during September (table 1). Plumes at and Manam were strong, and plume was small. Activity at Langila was weak 11 September, but had intensified during measurements the next day. The quiet-phase data were collected from the ground; all other data were acquired while flying under the plumes.], 193566=\"By early morning of the 19th the lava flow had bifurcated, with the E lobe slightly longer. Progress of the flow was slow on the 19th and 20th. At 1400 on the 20th, the nose of the E lobe was about 4 km from the summit, and was about 100 m longer than the W lobe. Their widths were 20-40 m., 256970=10/1991 (BGVN 16:10) Seismicity declines without eruption, 166673=\"The thick dark column and night glows at the beginning of the month caused some degree of alert amung the local population. An on-site inspection and survey on the 6th showed no significant ground deformation, allowing the release of an information bulletin forecasting phreatic or phreatomagmatic activity similar to early January.\", 88476=On 30 April around noon, a few hours after reports of an eruption at Ulawun, the Earth Probe TOMS detected a SO2 cloud over SW New Britain,. A gap between successive TOMS swaths over the volcano unfortunately precluded measurement of the full extent of this cloud. Elevated levels of SO2 were recorded in a region bounded approximately by longitudes 147°E and 150°E (swath edge) and by latitudes 5°S and 7°S, at a maximum distance of ~400 km WSW from Ulawun. The highest SO2 concentrations (38 milli atm cm) were recorded in a NNW-SSE trending region ~300 km WSW of the volcano. Preliminary analysis indicates that the portion of the cloud visible in TOMS imagery contained ~5 kilotons of SO2., 250999=05/2001 (BGVN 26:05) Eruption on 30 April 2001 sends an ash cloud to a height of ~13.7 km, 110360=After this period of very low activity, Ulawun produced moderate explosions at 2015 and 2049 (UT) on 19 October. The first explosion produced a thick dark ash column, visible in the moonlight, that rose several hundred meters above the summit before it was blown to the N and NW, causing ashfall on the flanks. The second explosion was smaller but also produced a dark ash column. People on Lolobau Island, ~18 km NW of Ulawun, observed very weak, dull glow on the summit. The partially working seismograph picked up tremor activity during the time of the explosions. The following morning, 20 October, summit activity consisted of thick volumes of white and occasionally gray vapor. This tapered off to moderate volumes of white vapor by the end of the month. Seismic activity also decreased to normal background levels., 260811=05/1989 (SEAN 14:05) Ash emissions cease, 220647=\"After the 21-23 March seismic crisis, Ulawun's seismicity showed a fairly steady decay, reaching a very low level in early April. One clear A-type event was recorded on 7 April. A new seismic crisis, preceded by a lull about 2 hours long, began on 10 April at about 0310. The initial, strong continuous tremor changed to discontinuous tremor within a few hours. The entire period of tremor lasted about 6 hours. After this crisis, a steady decline was evident until 17 April. Small A-type events were recorded 11-16 April., 299775=On 25 May, the Darwin VAAC reported a thin steam-and-ash plume from Ulawun that extended 30 miles WNW., 196736=\"A brief, spectacular Strombolian eruption took place 17-22 November, developing rapidly after about five days of precursory seismicity., 185948=When visible, the summit crater was releasing moderate amounts of white vapour during December. The daily totals of volcanic earthquakes increased on 2 December and averaged ~150 until the 17th. A further, but somewhat irregular, increase began on the 18th and reached a peak of ~800 events/day on 23 and 24 December. Earthquakes then decreased steadily, stabilizing at ~350 events/day after 26 December. The summit was obscured throughout most of the period of increased seismicity., 280080=The Darwin VAAC reported that on 16 October a low-level ash plume from Ulawun was visible on satellite imagery. The plume drifted to the N., 339497=2011. According to RVO, the mild activity that began in May 2010 continued during 1 January-28 February 2011. The activity was characterized by brown-to-gray ash plumes that rose less than 500 m and produced fine ashfall to the SE. Sulfur-dioxide plumes drifted SE on 5 and 31 January. During 23-26 February, gray ash plumes occasionally drifted NE, SW, and NW., 105510=Eruption on 29 September causes the evacuation of nearby towns, 307433=Based on a pilot report, the Darwin VAAC reported that an ash plume from Ulawun rose to an altitude of 2.4 km (8,000 ft) a.s.l. on 18 January and drifted SW., 58715=Activity on Ulawun occurs frequently and is monitored and reported from several sources including the Rabaul Volcano Observatory (RVO), the Darwin Volcanic Ash Advisory Center (VAAC), the U.S. Air Force Weather Agency (AFWA), and imagery from several satellites including NOAA GMS (daylight) and MODIS (infrared). The continuing activity after an eruption on 28 September 2000 (see BGVN 25:08) resulted in BGVN reports every few months since that event (BGVN reports on Ulawun have appeared in nine subsequent issues through the end of 2003)., 124781=\"The increase in activity . . . continued through June. During the first half of the month emissions from the summit crater were moderate to strong, consisting of thick white vapour. The emissions increased somewhat to strong thick white vapour in the second half of the month. Grey and blue emissions were also reported on 6, 15, and 21 June. Steady weak red summit crater glow was visible on 6 and 16 June only, compared with consistent steady glow in May until the 23rd. Weak rumbling noises were heard between 2000 and 2300 on 15 June, but these may have been distant thunder., 85135=Behavior in months prior to the 25 April eruption. Ongoing sporadic tremors followed the 28 September 2000 eruption for most of October-January. A swarm of earthquakes occurred between 31 January and 1 February 2001. The only break in activity was in February, March, and the first part of April., 181078=\"Ulawun showed a low level of activity in April, with continued weak emission of white vapours. Seismicity fluctuated in both amplitude and the daily number of events, with a maximum of 1230 recorded on the 4th. However, . . . no tremor was recorded.\", 229368=\"At about 1800 the ash had cleared sufficiently to allow observations of the summit from Ulamona. No ash emission was seen, but through the night a faint glow was present above the crater. Bursts of glow on the upper NE flank and associated clouds of ash on the same flank were observed from Ulamona., 104546=Initially the ash cloud rose to ~10.7 km, rapidly grew at the top, and spread ~55 km from the N to the SW. Starting at about 0940 satellite imagery showed that the ash cloud spread to a width of ~110 km in an arc-shape oriented counterclockwise from the ENE to the WSW. The shape and width of the ash cloud were relatively constant until about 1840 when the ash cloud became too diffuse to separate from the surrounding meteorological clouds. At 0830 on 30 September ash emissions were limited to infrequent puffs. By 1223 there was no evidence of ash clouds in the proximity of Ulawan and continual satellite surveillance did not identify any ash from the initial eruption., 258613=05/1990 (BGVN 15:05) Dry tilt suggests radial inflation, 333295=Based on analyses of satellite imagery, the Darwin VAAC reported that on 26 November an ash plume from Ulawun rose to an altitude of 3.7 km (12,000 ft) a.s.l. and drifted 30 km NW., 253084=03/1996 (BGVN 21:03) Still emitting low to moderate amounts of steam, 254751=05/1994 (BGVN 19:05) Seismically active and continuing to emit dark vapor, 262834=05/1988 (SEAN 13:05) Increased seismicity associated with higher rainfall, 34725=Ulawun remained relatively quiet from mid-September 2005, the date of our last report (BGVN 30:09), until 1-2 March 2006 when strong, forcefully expelled \"gray-blue emissions\" were observed from the main crater. There may also have been incandescence at the base of the plumes. There were no emissions from the NW vent. Small, felt earthquakes occurred and the sound of roaring was heard by nearby villagers. According to the Darwin VAAC, RVO reported that ash reached ~ 3 km (10,000 ft) altitude on 1 March. However, ash was not visible on satellite imagery., 24472=Low levels of activity continued from January through March 2008. Emissions consisted of thin to thick white vapor and with no audible noises and no glow visible at night. Seismicity continued at moderate level dominated by low frequency volcanic earthquakes. Variable amounts of white fume were emitted, sometimes forcefully. The two N valley vents continued to remain quiet., 141359=\"Seismic activity changed subtly at the end of December. Few low-frequency earthquakes were recorded, but there had been a gradual increase in low-amplitude, long-duration 'tremor events.' By the beginning of January, the increase had been such that the events had coalesced into sub-continuous very low-amplitude tremor. There was a brief return of low-frequency events 1-4 January, including some very unusual signatures. There were also indications of periodically stronger tremor at this time, although the signals could have been due to high winds. From the 5th onwards the level of tremor remained steady and there were only a few low-frequency events. Visible activity was normal, with small amounts of thin vapour being gently released., 177363=\"No significant activity occurred in July. Summit crater emissions generally consisted of small quantities of white vapours. Seismicity was at normal inter-eruptive levels of only a few tens of small events/day, decreased from the strong seismicity that began in December 1987., 288960=During 2-6 July, thin plumes from Ulawun were visible on satellite imagery at heights around 3 km a.s.l. extending as far as ~90 km., 255847=04/1993 (BGVN 18:04) Tremor level returns to background, 201195=\"Aerial inspections by volcanologists on 4 and 5 January revealed that the eruptive activity consisted of weak ejections of incandescent tephra from several vents in a mound of fresh lava within the summit crater. The ejections occurred at a rate of 1-2 per minute, and the largest rose about 100 m. The ash content of the emissions was low, and the plume was only a few kilometers long., 342911=According to RVO, during 2-12, 16-19, and 23-25 June 2010 residents heard occasional low roaring or rumbling noises daily on the ESE, SE, S, and NW flanks. During 2-19 and 23-26 June, white to gray-brown plumes rose to ~3 km altitude (figure 15). The Darwin VAAC noted that between 3-6 June, the plumes extended up to 315 km W. On 16-17 and 19-20 June, white and gray plumes rose 1 km above the summit. Very fine ash particles fell in Ulamona (~10 km NW) on 3 and 8 June, and then fell daily during 9-19 and 23-25 June on the NW, W, and SW flanks. Throughout June, fluctuating incandescence from the summit crater was seen at night from the S, SW, N, and SE flanks. RVO reported that on 18 and 19 June, seismicity increased to a high level and was dominated by volcanic tremor. Seismicity declined to moderate levels on 20 June and, based on RSAM values, declined further on 26 June 2010., 210895=\"At 0530 on 7 November, shock waves were seen radiating from the summit crater through the emissions, indicating further mild explosive activity. The plume was larger than normal (about 300 m high) and extended 5-10 km from the summit. Seismic activity and emissions remained at high levels until 8 November when they abruptly declined to normal again, allowing a return to a stage-1 alert., 320831=RVO reported that white vapor plumes rose 300 m above Ulawun during 21-29 July. Light brownish ash clouds were observed on 23 and 24 July., 312077=Based on analyses of satellite imagery, the Darwin VAAC reported that during 14-15 February ash plumes from Ulawun drifted 45-95 km at altitudes of 2.4-3.7 km (8,000-12,000 ft) a.s.l., 178222=\"Dry tilt measurements indicated summit area deflation of up to 55 µrad since the last eruption in November 1985. EDM measurements showed minor contractions of three lines radial to the flanks of the volcano since previously measured in November.\", 179296=\"Low-level activity persisted. Weak to moderate amounts of white vapour continued to be released from the summit crater. The recorded seismicity fluctuated between 1,500 and 300 small B-type events/day (relatively less numerous than during the last two months). The average amplitude of these events built up considerably (up to 8 times the norm) from early May to mid-June before decreasing again to regular non-eruptive levels. Apparent tremors were also recorded for long periods from 6-10, 15-16, and 19-29 June. It is not certain to what extent that signal was caused by the strong seasonal wind., 322046=RVO reported that white and gray-to-brown plumes rose no more than a few hundred meters above Ulawun during 12-24 August, and fine ash fell on the NW and W flanks. Seismicity continued to decrease as compared to previous weeks., 76319=Isolated tremor episodes and slow deflation through March 2002, 287795=On 14 April, the Darwin VAAC reported that Ulawun emitted an ash plume that rose to ~3 km a.s.l. and extended ~37 km NE., 265792=11/1984 (SEAN 09:11) Seismicity increases; vapor emission, 269119=10/1973 (CSLP 138-73) Eruption during 4-19 October produces lava flows and ejecta from five vents, 84246=Seismicity during 31 January-2 February was characterized by B-type volcanic events, which occurred at irregular intervals. During the last week of January, continuous background volcanic tremor was recorded. On the morning of 31 January the seismicity suddenly changed to distinct B-type events. Within a few hours the events intensified and became hard to distinguish due to signal overlap on the analog records. The intense seismic activity lasted for several hours and then declined to a low level. It remained relatively low, with distinct B-type events, until the morning of 2 February, when the B-type events intensified again. Afterwards, seismicity declined to a very low level. Distinct B-type events continued, but in very low numbers. A-type volcanic events also occurred throughout February, but the month was generally quiet., 136811=\"Activity . . . continued to decline following the brief phreatic or phreatomagmatic activity in mid-January (BGVN 18:01). However, activity is still above normal levels. Emissions throughout the month consisted of white vapour, in weak to moderate volumes. Blue vapour was seen occasionally. A steady weak night glow was seen 14-18 February. There were also unconfirmed reports of glow at other times during February., 253271=02/1996 (BGVN 21:02) Noiseless steaming and seismic quiet continue, 67997=This sequence can be related to events reported by the Rabaul Volcano Observatory (BGVN 26:06) On 26 April 2001 at 0530 a small Strombolian eruption began. This was characterized by glowing lava fragments ejected by frequent explosions followed by small pyroclastic flows. During the day activity decreased but on 27 April at 0530 another phase of Strombolian activity began. A small pyroclastic flow occurred followed by a lava flow that descended to about 500-600 m above sea-level. This is presumably the cause of the 15-pixel alert on 28 April (figure 8). A third phase of Strombolian activity began at about 0600 on 29 April. This phase was slower and more gradual, peaking at about 1800-2200 on 29 April, and did not produce a MODIS thermal alert., 157107=\"Activity was at a low level throughout January, as it has been since July 1989. The summit crater emitted white vapour in weak to moderate amounts. The seismicity was also at a very low level, with only a few volcanic (B-type) events of very small amplitude/day. On the 4th, however, an earthquake (ML 4.2) originating 25 km away provoked the onset of a 10-hour swarm of small B-type events (~150) that ended abruptly after a string of a dozen larger events.\", 252181=10/1999 (BGVN 24:10) Explosions in mid-October-the first in 6.5 years, 266153=08/1984 (SEAN 09:08) Increased seismicity, then small ash clouds and glow, 153324=\"The ground deformation network (EDM and dry tilt) was reoccupied 2-4 May. Comparison of the latest EDM measurements with all previous data shows that there have been no significant EDM changes at Ulawun during the network's operation (since November 1985). On the other hand, comparison of the latest dry tilt measurements with the previous measurements (March 1989) indicates considerable changes at stations on the upper flanks. Radial inflationary tilts of 80 and 45 µrad were recorded at stations 1.1 and 2.3 km respectively from the summit.\", 302976=Based on satellite imagery, the Darwin VAAC reported that on 12 November a diffuse plume from Ulawun reached an altitude of 4.6 km (15,000 ft) a.s.l. and drifted NW., 284298=On 19 and 20 June faint ash plumes from Ulawun were visible on satellite imagery., 82330=Behavior in the days prior to the 25 April eruption. The eruption was preceded by volcanic tremors commencing at about 0600 on 22 April. The tremors were initially small, but at about 2100 the they increased in amplitude and became sub-continuous. On 24 April at 1400 the tremors increased again, making it hard to detect patterns in the analog records., 210473=\"At the peak of the crisis, over 3,000 volcanic earthquakes per day were recorded, declining to about 1,300 per day between 8-15 November, and 700 at the end of the month. Four A-type events were recorded on 22 November.\", 257560=02/1991 (BGVN 16:02) Small earthquake swarm but no change in vapor emission, 47614=Quiet during early 2004; thin ash plumes 12-14 April, 92089=The noises at 1000 on 1 November accompanied a thick dark ash cloud that rose 100-200 m above the summit. By 1100 silent ash clouds were seen forcefully rising ~200 m above the summit. Activity then declined for a few hours until 1430-1700, an interval when observers saw thick dark gray ash clouds and occasionally heard weak rumblings. Activity quieted after that and by 2 November emissions had returned to white vapor without noise or night glow., 120310=Activity remained low from September through December 1994. Similar to previous months, white vapor emissions varied from profuse to moderately weak. Low-level seismicity continued., 263019=04/1988 (SEAN 13:04) Weak vapor emission; fluctuating seismicity, 43208=Air Niugini pilot David Innes noted on 23 August that he had flown past Uluwan early the previous week and noted what appeared to be steam and light 'smoke,' but did not note any ash., 140583=\"The first sign of any abnormal visible activity was on 12 January, when a report was received of a dark eruption column that was forcefully emitted to ~1,000 m above the summit before declining to 400 m in height and becoming lighter coloured. Many clouds form around Uluwan during the daytime, so there were no other reports to confirm this activity. There was also a report of weak glow seen that night. Aerial and ground inspections were made on 14 and 15 January, when activity consisted of sub-continuous, forceful emissions of low-moderate volumes of white vapour. There were less forceful emissions of blue vapour, and no increase in the level of tremor associated with the increase in visual activity. This type of activity persisted until 19 January., 18390=A government report written in October 2009 mentioning Ulawun (Arumba, 2009) summarized activity during 2008 as generally quiet, but noted it had changed \"with the commencement and continuation of high frequency volcano-tectonic earthquakes from about March [2008] onwards.\", 298648=A small low-level plume emitted from Ulawun was visible on satellite imagery extending W on 9 April., 256621=01/1992 (BGVN 17:01) Vapor emission; seismicity declines, 132985=\"Activity continued at the low levels reported in the previous two months. Emissions of weak-to-moderate white vapour occurred throughout April, with stronger emissions on 3 and 6 April. Seismic activity was low throughout the month. RSAM showed that the slow decline in tremor amplitude seen in March continued until 20 April. After 20 April, the tremor amplitude remained constant, indicating that tremor had effectively ceased and the natural background noise was being recorded.\", 304226=Based on satellite imagery, the Darwin VAAC reported a diffuse plume from Ulawun on 22 November and an ash-and-steam plume on 28 November., 178663=\"An aerial and field inspection was carried out on 6 and 7 June. The interior of the summit crater was mostly obscured by abundant white and blue vapours. Little morphological change was noted compared to the last inspection, in July 1987, apart from the erosion. However, a series of fissures enhanced by fumarolic encrustations were observed to run horizontally, ~100 m below the rim of the internal S wall., 80623=Activity reached a low at about 0300 on the 27th before another phase of Strombolian eruption began at about 0530. The build-up to the second phase was very rapid. Stage 2 hazard status was recommended at 1630 on the 27th. Activity was sustained at an intense level for about 30 hours from 0530 on the 27th to about 1130 on the 28th. Incandescent lava fragments (visible in the early morning) and other rock material from the intense activity rolled almost a third of the way down the slopes. Eruptive material was seen on all sides of the volcano, but most went N and NE, suggesting emissions came from near Vent B (BGVN 25:11) at 1,600-1,800 m elevation. In this interval a pyroclastic flow travelled N-NE following the path of the pyroclastic flow of 28-29 September 2000. The run-out distance of the pyroclastic flow exceeded that of the flow from the September eruption. A lava flow also followed the same path. The distal end of the lava flow reached about 500-600 m elevation., 151398=\"Activity at Ulawun remained at a low level in July. Emissions from the summit crater consisted of weak to moderate white vapour. Seismicity was at a very low level during the month.\", 255671=05/1993 (BGVN 18:05) Vapor emissions continue; seismicity very low, 131898=\"Activity continued at a low level during May with weak-to-moderate emissions of white vapour. The level of seismic activity, as shown by the RSAM tremor monitor, has been steadily declining since the period of mild eruptive activity in January and February. Seismicity seems to have stabilized at a very low level since the end of March.\", 267813=03/1983 (SEAN 08:03) Increased seismicity and vapor emission, 239143=\"A spectacular but so far unidentified phenomenon was observed by pilots of two aeroplanes at about 1045 on 9 May, although nothing unusual was noted at that time from the observation post. This had some of the characteristics of both nuées ardentes and lava flows, to judge by the descriptions, and the mountain was [reported] to have split from top to bottom. It is hoped that photographs taken from both planes will assist in interpreting this event., 263944=11/1986 (SEAN 11:11) Low levels of seismicity and steam emission, 176494=\"Ulawun showed a very low level of activity in August with continued weak-moderate emission of white vapours from its summit crater. Seismicity was also at a very low level with only a few small B-type events recorded daily. No tremor was recorded throughout the month.\", 273911=Volcanic tremor occurred at Ulawun on 24 September at 2200 through 30 September. After the tremor peaked on the 27th at about 1000 it fluctuated as it generally declined. By 30 September seismic activity was at moderate levels. During 27-30 September a very slow deflationary trend was detected., 246988=05/2011 (BGVN 36:05) Seismicity ongoing with plumes during May 2010-May 2011, 292048=On 6 April, a thin plume from Ulawun was visible extending ~55 km to the SW on satellite imagery., 290167=According to the Darwin VAAC, a thin ash plume emitted from Ulawun on 23 August rose ~3 km above the volcano and drifted SW., 202929=\"No further eruptive activity has occurred since the short-lived Strombolian eruption, 4-11 September. The only visible activity has been moderate emissions of white vapours. However, volcano seismicity started to increase again on 9 November. Beginning 14 November, daily totals of B-type events averaged about 600, a marked increase from daily totals that usually numbered less than 50, 14 September-8 November. The amplitudes of these events also increased substantially.\", 261903=11/1988 (SEAN 13:11) Vapor emission intensifies; tremor, 164400=\"Ulawun returned to normal after the mild intermittent eruptive activity in April. Moderate to occasionally strong, white-grey emissions were released from the summit crater. Volcano seismicity was low, with daily totals of 20-30 recorded events.\", 130861=\"Visual activity continued to remain at low levels during June, July, August, and September. Emissions consisted of weak-to-moderate white vapour from June through August, with occasional white/blue vapour in June, August, and September. The RSAM seismic monitor showed an increase in activity for some short periods in July. It was not possible to confirm these observations from the conventional seismograph due to severe radio interference. The few records that were readable appeared to show low-frequency events or short bursts of tremor at times consistent with the RSAM observations. Seismic activity was low in June, August, and September.\", 319684=RVO reported that white-to-gray plumes rose less than 500 m from Ulawun during 27 June-9 July, and fine ash fell in areas to the SW, W, and NW. Occasional roaring noises were heard on 28 June and during 5-6 July. A slight increase in seismicity (above moderate levels) indicated by overlapping tremors and Real-time Seismic-Amplitude Measurement (RSAM) values was noted during 5-8 July., 101516=High-frequency earthquakes had occurred sporadically since mid-1998 in very low numbers (~1/day). A brief period of recording in April 2000 registered ~ 2/day. In mid-June 2000, following the resumption of seismic recording, high-frequency earthquakes were first seen to have increased to 15-20/day. This comparatively high number of earthquakes continued through July and August. Deployment of a portable seismograph during 13-15 August indicated these earthquakes had epicenters at Ulawun., 123572=\"On 20 and 21 June there were a number of high-frequency earthquakes with longer S-P times, around 3.5 seconds. Their signals look very similar to those from the earthquake swarms located near Bamus volcano (16 km SW) in 1990 (BGVN 15:2-5).\", 155198=\"Activity remained at a low level in March. Summit crater emissions consisted of thick white vapour. Seismicity was low throughout the month.\", 279476=A low-level ash plume from Ulawun was visible on satellite imagery on 1 October. The plume drifted to the NE., 116801=During October-December emissions generally consisted of moderate-to-high amounts of white vapor. Gray emissions were also reportedly observed on three days in October and a number of days in November. Seismic activity was very low in October-November and unreported for December., 241347=\"Aerial inspections the following morning showed powerful ejections of red incandescent bombs every few seconds, feeding an eruption column 1-1.5 km high. The ash content in the ejections was fairly small, and the eruption column was relatively thin in texture. Only one source was noted and this appeared to be towards the N part of the 1973 `chasm', which had been deepened considerably by collapse sometime between May and July 1976., 8476=During 26 November 2010, based on analyses of satellite imagery and information from RVO, the Darwin VAAC reported that an ash plume rose to an altitude of 3.7 km and drifted 55 km NE., 316313=RVO reported that during 9-16 June white and gray plumes from Ulawun rose 800-900 m high. Fine ashfall was reported almost daily and affected the NW, W, and SW flanks. During 9-12 June occasional rumbling noises were reported. Fluctuating incandescence from the crater was seen at night on 9 and 10 June from observers in areas to the SW and for a brief period of time on 13 June from areas N., 100555=Eruption of 28 September-2 October. A relatively small-to-moderate eruption began on 28 September 2000. Several long-term precursors to the eruption were unambiguous. High-frequency earthquakes increased dramatically after June 2000. Electronic tiltmeter trends showed inflation beginning in early August 2000. Short-term, immediate precursors included an increase in both the number of low-frequency earthquakes and the real-time seismic amplitude measurements (RSAM). The latter began to escalate on 27 September 2000., 57494=Table 2. Dates of issue and the principal comments in Darwin VAAC reports concerning Ulawun, September 2000-July 2003. Similar or duplicate messages are not shown. In many cases ash cloud trajectory information has been omitted. On this table, the distance unit Nautical Miles (NM) has not been converted to kilometers (1 NM = 1.852 km (exactly)). Courtesy of the Darwin VAAC., 277669=On 12 September at 0700 a low-level ash plume located NNW to NNE of Ulawun was visible on satellite imagery. By 1132 the plume was no longer visible., 331201=RVO reported that activity at Ulawun was low during 22 July-4 August; emissions from the summit crater consisted of white vapor. Seismicity was also low. RSAM values decreased from 80 on 21 July to 50 on 31 July, and then began to increase on early 2 August. By 4 August RSAM values reached 600, attributed to an increase in volcanic tremor., 86243=On 25 April, Ulawun began what appeared to ground-based observers as a relatively small eruption that lasted about 6 days (ending the 30th). Activity had been low from the beginning of April until the 24th, with the summit venting mainly small, occasionally moderate volumes of steam. Seismicity consisted mainly of low-frequency earthquakes, which had been present for many months, even before the September 2000 eruption. The low-frequency earthquakes were slightly larger than the usual earthquakes recorded when Ulawun is quiet, but no particular pattern indicated that these earthquakes were forerunners to an eruption. Earthquakes such as these were rare before the build-up to the September eruption, but they have continued since then., 115847=During January and, although less closely monitored, during February, Ulawun continued to release moderate to high volumes of white vapor without any audible sounds. There were no night glows. Seismic activity was low during January; the equipment did not operate during February., 24069=Information Contacts: Herman Patia, Rabaul Volcano Observatory (RVO), P. O. Box 386, Rabaul, Papua New Guinea (Email: hguria@global.net.pg); Darwin Volcanic Ash Advisory Centre (VAAC), Commonwealth Bureau of Meteorology, Northern Territory Regional Office, PO Box 40050, Casuarina, NT 0811, Australia (URL: http://www.bom.gov.au/info/vaac/, Email: darwin.vaac@bom.gov.au); US Air Force Weather Agency (AFWA), Satellite Applications Branch, Offutt AFB, NE 68113-4039, USA (Email:charles.holliday@afwa.af.mil); Hawai'i Institute of Geophysics and Planetology (HIGP) Thermal Alerts System, School of Ocean and Earth Science and Technology (SOEST), Univ. of Hawai'i, 2525 Correa Road, Honolulu, HI 96822, USA (URL: http://hotspot.higp.hawaii.edu/); James Mori, Disaster Prevention Research Institute, Kyoto University, Uji, Kyoto 611-0011, Japan (http://eqh.dpri.kyoto-u.ac.jp/~mori/)., 310707=RVO reported that white vapor plumes from Ulawun were emitted during 2-6 July. Seismicity was low to moderate; seismometers continued to recorded high-frequency earthquakes. The Alert status remained at \"Stage 2,\" indicating that seismic levels remained above background. During 2-3 July occasional roaring noises were reported., 227050=\"At the commencement of the strong, visible activity, the seismic activity intensified dramatically, becoming continuous tremor, which persisted until about 1215 on 7 October. After that time, tremor ceased altogether, signifying cessation of the eruption.\", 200776=\"A change in visible activity was evident from 9 January when the emissions became rich in white vapour, and ash ejections were less frequent. Crater glow, which had been observed consistently from 3 January, was absent from 9 January. Despite the weaker visible activity, seismicity persisted at about the same level as that of 8 January.\", 157959=\"Activity continued at background level in December. White vapours were released in weak to moderate volume by the summit crater. Seismicity remained at background level, with only a few events/day of very small amplitude and occasional larger B-type shocks.\", 275466=During 11-24 February, activity at Ulawun's summit vent remained low, and volcanic tremor was recorded. Weak-to-moderate vapor plumes were emitted from the summit vent, and on the 21st weak roaring noises were heard and a weak red glow was briefly visible. During mid-February tremor increased to moderate levels for the first time since December 2001. After 22 February tremor returned to background levels., 317438=RVO reported that during 16-17 June white and gray plumes from Ulawun rose 1 km high. Fine ash fell on the SW, W, and NW flanks. Low rumbling noises were heard from the S and SE flanks, and weak fluctuating incandescence was observed for a brief period of time. On 18 and 19 June, white-to-gray plumes rose from the crater, and roaring noises were reported from the NW flank. Seismicity increased to a high level and was dominated by volcanic tremor. During 19-20 June continuing white and gray emissions produced plumes that rose 1 km. Fine ashfall was seen on the NW and SW flanks. Fluctuating incandescence was seen from the S and SE flanks and occasional low roaring noises were noted. Seismicity declined to moderate levels on 20 June., 121169=\"Seismic activity in August continued the pattern of previous months, with mainly sub-continuous low-frequency tremor and occasional larger low-frequency earthquakes. No high-frequency earthquakes were recorded.\", 26105=This report updates activity through March 2008. Our last overview of Ulawun (BGVN 32:02) reported little activity of note other than frequent ash plumes from March 2006 to January 2007. Typical activity at Ulawun has consisted of gentle emission of thin-to-thick white vapor from the summit Based on satellite imagery and information from the Rabaul Volcano Observatory (RVO), the Darwin VAAC reported that diffuse plumes from Ulawun drifted N on 28 April 2007. On 1 May, an ash plume rose to an altitude of 4 km and drifted W., 230430=\"By about 0735 the upper part of the eruption column was spreading out more noticeably and the clouds on the volcano's flanks had become more voluminous. The diameter of the `mushroom' top of the cloud was estimated at 50-60 km. The eruption column continued to be fed by apparently frequent explosions in the crater but only slight upward growth was evident. The volcano gradually became obscured as the eruption cloud began to dissipate. By 1000 the volcano was totally obscured down to its base, and at Ulamona the darkness was total for several hours. The ash cloud drifted slowly towards the SW and was thick enough to cause 1 hour of total darkness in mid-afternoon at Bialla, 45 km from the crater., 12302=On 18 and 19 June, seismicity increased to a high level and was dominated by volcanic tremor. The next day, seismicity declined to a moderate level and continued to do so after 26 June., 83380=Most of March was also quiet, characterized by thin white vapor emission, except on 2-4 March when occasional weak puffs of gray-brown ash were produced. Villagers on the N, NW, and SW sides of the volcano reported rumbling and booming noises associated with the ash puffs. A weak, steady glow was observed on 27 March. Low-frequency earthquakes continued throughout the month with an average of 60 per day. Some high-frequency earthquakes also occurred, but no volcanic tremors were recorded during March., 287213=RVO reported that volcanic activity was at low levels at Ulawun during 15 March to 1 April. Only white vapor was emitted from the main summit crater and there were no emissions from the north valley vent. The overall level of seismicity was low, with only small low-frequency volcanic earthquakes recorded. Electric tiltmeter measurements showed a long-term inflationary trend. According to the Darwin VAAC, on 12 and 13 April thin ash plumes from Ulawun were visible on satellite imagery at a height of ~700 m above the volcano. The plumes extended ~75 km E and NE., 222138=\"It is interesting to note that the high level of seismicity closely followed a heavy rainfall of 65 mm. It also occurred only three days after a major tectonic earthquake (ML 7.7) in the Solomon Sea, felt at MM V in the vicinity of Ulawun. It is possible that the earthquake opened microfissures in the volcanic edifice allowing ground water to penetrate and interact phreatically with shallow magma. The cyclic variations in seismicity since mid-January and increasing instability in March are believed to indicate that an eruption may occur in the near future.\", 232600=\"A brief but powerful eruption took place at Ulawun between 6 and 7 October. The visible commencement of the eruption was late at night on 6 October. At about 2300, faint glow was seen at the summit, intensifying at intervals of 1-2 minutes, presumably signifying weak ejections of incandescent lava fragments. At 0400 on the 7th the lava ejections were more frequent, occurring at intervals of 1 minute or less. No sounds of the eruption had been heard up until this time by observers at Ulamona Catholic Mission, and no significant ash emission had been observed., 344506=This report discusses Ulawun's ongoing mild seismicity, variably colored, though often white plumes, and other observations during May 2010 to late May 2011. The bulk of the reporting came from the Rabaul Volcano Observatory (RVO) with some information on plumes from the Darwin Volcanic Ash Advisory Center (VAAC) and others. Seismicity at Ulawun has generally been low since 2007, with occasional modest increases and steam emission (BGVN 33:03, 34:10, and 35:02)., 47515=The Rabaul Volcano Observatory (RVO) reported that activity at Ulawun remained quiet during February 2004. The main vent emitted white vapor at weak to moderate rates. No emissions were reported from the two north valley vents. No noise or night time glow was reported, and seismicity was at a low level. RVO reported in similar terms for the period 15 March-1 April, noting also that tiltmeter measurements recorded a long-term inflationary trend. According to Darwin VAAC, on 12 and 13 April thin ash plumes from Ulawun were visible on satellite imagery at a height of -~ 700 m above the volcano extending ~ 75 E and NE. On 14 April the ash plume rose ~ 3 km altitude and extended ~ 37 km NE. No HIGP-MODIS thermal alerts were recorded at Ulawun over the year to 11 May 2004., 318263=RVO reported that white-to-gray plumes rose from Ulawun during 23-25 June and fine ash fell on the SW and NW flanks. Low rumbling was heard and dull fluctuating incandescence was observed for a brief period of time from the SE. During 25-26 June white to gray-brown plumes rose 600 m. Seismicity, dominated by volcanic tremor, remained at a moderate level until 26 June, when Real-time Seismic-Amplitude Measurement (RSAM) values declined., 258973=03/1990 (BGVN 15:03) Thick vapor emission; weak seismicity, 254557=06/1994 (BGVN 19:06) Strong vapor emissions and steady weak red glow from the summit, 238293=\"Later that morning, ash emission again increased strongly, a thick black column of ash was present through 11 May, and additional ashfalls were recorded at the coast. During the night of 10-11 May, incandescent lava fragments were still occasionally ejected from the summit crater, but the next night, only occasional weak glow was noted., 338742=During 10, 13-14, 17, and 19-27 May, RVO reported gray-to-brown ash plumes rose above Ulawun's summit crater. On 17 May, emissions became briefly forceful and booming noises were reported. Light ashfall deposited between Ubili and Ulamona to the NW and Voluvolu to the NE, as well as on the NW and W flanks. Weak, fluctuating incandescence was observed on 22 May., 13476=Activity during May-July 2010. During 1-21 May, RVO reported variable amounts of white vapor; during late May to July, emissions were darker in color, with some specific examples highlighted below. Based on analyses of satellite imagery, the Darwin Volcanic Ash Advisory Centre (VAAC) reported ash plumes during 22-25 May that drifted 35-130 km at an altitude of 3 km. During late May through late June, RVO reported that white to gray plumes rose up to 1 km high and at times ashfall occurred. RVO noted gray plumes on 22, 25, and 29 May. People on the S part of New Britain observed fluctuating incandescence on 28-29 May., 125664=May seismic activity underwent a slight progressive decrease: Daily earthquake totals early in the month were in the range 400-600; by month's end they had dropped to 400. Since the end of April earthquake amplitudes also decreased., 17207=A check of MODVOLC thermal alerts in mid-April 2010 found no anomalies for Ulawun as far back as May 2001. Those 2001 alerts corresponded with new vents and large plumes in early 2001 (BGVN 26:05, 26:06). A few months earlier, observers had seen Strombolian eruptions (BGVN 25:11)., 212519=\"About 2 months of steady mild activity consisting of weak-moderate white vapour emission and low seismicity ended abruptly with a very intense seismic crisis 3-8 November., 113488=The low-level activity of recent months persisted through June. Emissions consisted mainly of small to moderate volumes of white vapor. Seismic recording resumed on 28 June and showed low-level seismicity., 156027=\"Activity continued at a low level in February. The summit crater emitted white and blue vapours in weak to moderate amounts. An aerial inspection on 13 February showed no change in the configuration of the summit crater or in its activity. Seismicity was very low throughout the month.\", 251213=11/2000 (BGVN 25:11) An eruption during 28 September-2 October 2000 sends a plume to 10-12 km, 10589=Table 4. Large regional earthquakes near Ulawun that occurred on the days 2, 3, and 24 June and 18 July 2010. Courtesy of RVO., 74737=During mid-February tremor increased to moderate levels for the first time since December 2001. On 21 February weak roaring noises were heard and weak incandescence was visible for a short time. After 22 February tremor returned to background levels. Seismic activity returned to background levels after volcanic tremor ceased on 18 March. Discrete low-frequency earthquakes continued to occur in small numbers. The electronic tiltmeter continued to show long-term deflation of the summit area. Based on recent observations, activity at Ulawun is expected to remain low., 75708=Volcanic tremor began at 2200 on 24 September. It peaked at about 1000 on 27 September and generally declined afterward. By 30 September seismic activity was at moderate levels. During 27-30 September a very slow deflationary trend was detected. Volcanic tremor continued to occur at moderate-to-high levels until it dropped dramatically on 11 October. After 11 October seismicity only consisted of discrete low-frequency earthquakes. On 8 and 9 October loud roaring noises emanated from the volcano., 339810=Several videos of Ulawun's plumes as posted on the web in 2010 showed them as white in color (Sabretoothed69, 2010). Other brief video by the same author take viewers to the Ulawun seismic station and its drum recorder, and to witness aspects of local culture such as villagers dancing., 12531=Between late May and early July, low roaring or rumbling noises often were reported. Fluctuating incandescence from the crater was observed at night during 28-29 May, 6-10 June, 13 June, and 16-25 June., 326017=RVO reported that during 23-27 May gray ash plumes rose above Ulawun's summit crater. Fine ash fell in Ubili and Ulamona on the NW flank on 26 May., 133924=\"Seismic activity was at a low level throughout the month; no distinct B-type earthquakes were recorded. Both RSAM and routine manual amplitude readings indicate a gradual decline in tremor levels since mid-February. However, the level of tremor is still higher than before January's brief flurry of activity.\", 122322=\"Seismic activity . . . continued the pattern of previous months, with mainly sub-continuous, low-level, low-frequency tremor, and the occasional larger low-frequency earthquake. Only two high-frequency earthquakes were recorded during the month. Amplitude measurements and RSAM monitoring were made difficult at the start of the month by storm-generated noise. However, both showed a gradual increase through the month until about 23 July when there were sharp drops; gradual increases were again seen through the end of the month.\", 290829=RVO advised the Darwin VAAC that volcanic activity was relatively low at Ulawun on 8 March, but seismicity was increasing. On 15 March a faint plume was visible on satellite imagery, 253429=12/1995 (BGVN 20:11) Modest degassing, 21036=Additional reports by RVO in February and April 2009 noted that the volcano remained quiet, only releasing white vapor, with no reports of glow at night. Seismicity was moderate to low in February until power problems disabled the instrument. The number of seismic events that month fluctuated between 400 and 950 before declining to a range of 250-300 during 20-24 February. Low-frequency events dominated the record, although some high-frequency activity was recorded at a daily rate of 1-6 events., 148284=\"Activity at Ulawun has been at a low level since January 1990, producing small amounts of white vapour and few earthquakes. A temporary increase in seismicity was recorded between 11 and 20 February 1991. The peak was on 17 February when 295 medium-frequency volcanic earthquakes occurred. All of the events in this period were of very small magnitude. There was no change to the summit crater emissions, which continued to consist of white vapour.\", 85473=Ashfall from the 25-30 April eruption blew mainly N and NW during the second and third Strombolian episodes, 27-29 April. Most ash fell along a NW-trending axis (270-300° from the summit). Nearby residents were evacuated, and as of 14 June were allowed to return home. No damage or casualties were reported., 247957=02/2007 (BGVN 32:02) Frequent ash plumes, 268901=05/1978 (SEAN 03:05) Large eruption: lava flow, ash, nuée ardente, and radial vents, 265044=11/1985 (SEAN 10:11) Increasing seismicity then tephra ejection & lava flow, 215433=\"The moderate white vapour plume released at Ulawun's summit crater was undisturbed by the volcano's continuing unstable seismicity. A seismic crisis that started on 26 June was the longest since March when this pattern of activity started. It consisted of several periods of tremor up to 13 hours long, and sub-continuous volcanic earthquakes. This activity declined progressively 2-3 July to return to a rate of 1000-1500 B-type events per day. However, the average amplitude of discrete events remained fairly high (about 3 times normal levels) until 20 July. Further seismic crises on 16, 17, and 19 July marked the end of this particular period of stronger seismicity. No significant tilt changes were evident in July.\", 22136=RVO reported that increased seismic activity at Ulawun consisting of high-frequency volcano-tectonic (VT) earthquakes began on 7 June 2008. After peaking at 22 events on 12 June, the daily totals dropped and fluctuated between one and seven events per day, although totals of 14-15 events occurred on 14, 29, and 30 June. Some of the VT earthquakes were felt, including three on 30 June. Low-frequency earthquakes continued to occur as well, but remained within background levels; daily totals were between 257 and 775., 19347=A Rabaul Volcano Observatory (RVO) report noted steam plumes (figure 13) and increased seismicity at Ulawun during February 2010. Some of the mid-February plumes may have contained ash. As late as October 2009, Ulawun was generally quiet except for modest seismicity (BGVN 34:10)., 97978=By first light on 29 September people some distance away from Ulawun were able to see a thick vertical eruption column that rose ~12-15 km above the summit (figure 2). In relatively clear morning weather, the eruption column was visible from Rabaul, ~130 km NE of Ulawun. By this time ash clouds had blown WSW to NW. Roaring and rumbling noises ceased at about 1000 and resumed again at about 1300. At about this time also, there was a slight and brief change in wind direction resulting in the eruption's ash clouds being redirected to the N and NE., 144569=\"A buildup of seismicity observed toward the end of September continued through the first week of October, but the volcano remained in a non-erupting state, releasing vapour in small to moderate volumes. The increased seismicity consisted of periods of frequent discrete, low-frequency earthquakes. The maximum daily number of recorded events was ~350. Despite their increase in number, there was no marked increase in amplitude. This activity waned after a week and by the end of the month was at a low level, with earthquake counts of <30/day. High-frequency volcanic earthquakes were recorded occasionally throughout October.\", 64918=The long-term deformation trend based on measurements from an electronic tiltmeter is slow deflation of the summit area. No significant changes were noted in January. In February there was 2 µrad of deflation, and measurements showed a very small amount (~2-3 µrad) of deflation between the beginning of March through the 25th. After that the trend became steady., 333919=RVO reported that activity at Ulawun was low during 16-30 November. Small volumes of gray to gray-brown ash plumes rose 100 m from the crater on most days and drifted S. On 21 November ashfall was reported in Navo on the SW flank., 306194=The Darwin VAAC reported that ash plumes from Ulawun were visible on satellite imagery on 21, 22, and 25 December drifting ENE, NW, and SW, respectively., 257733=10/1990 (BGVN 15:10) Vapor emission; weak seismicity, 35442=Ulawun remained quiet through mid-September 2005, with the summit crater releasing weak to moderate volumes of thick white vapor., 79577=Another period of slightly lower activity followed the second phase of the eruption. The third phase of Strombolian eruption began at about 0600 on the 29th. This phase was slower and more gradual, peaking at about 1800-2000 on the 29th., 103845=The Rabaul Volcano Observatory put Ulawun at stage two alert. Heavy ash fall from the eruption prompted government officials to evacuate 3,750 residents of areas near the volcano including Ubili town, Noau town, Voluvolu villages, and Navo plantations. As of 5 October activity had declined and was relatively stable, but the evacuation orders were still in effect. Several news articles have linked the volcanism at Ulawun to the increased level of activity at Rabaul which is ~150 km to the NE of Ulawun, but according to a Post Courier article the East New Britain Provincial Disaster Committee stated that there was no correlation between the volcanoes' activity., 331954=RVO reported that activity at Ulawun was low during 4-31 August; emissions from the summit crater consisted of white vapor until 16 August, and were gray during 17-31 August. Emissions were more energetic on 24 August, rising 200 m. A single booming noise and weak incandescence was also reported that day. RSAM values fluctuated but decreased overall., 324927=RVO reported that during 13-14 and 17 May gray-to-brown ash plumes rose above Ulawun. On 17 May the emissions were forceful for a short time and booming noises were reported. Light ashfall was reported in areas between Ubili in the NW and Voluvolu in the NE., 117890=Activity throughout April-June continued at a low level. During April and May, emissions consisted of weak to strong white vapor, with occasional gray emissions during May. Ulawun released mostly weak to moderate white vapor, occasionally high in volume during June. On 2 June low volumes of blue vapor accompanied the white vapor. Neither audible noises nor summit glow were noted. Throughout April the seismograph was not operational. Seismicity was at a low level between 16 and 27 May, after which time none was recorded., 19448=Steam plumes (with some possible ash) in February 2010, 328090=RVO reported that dense gray-brown ash plumes continued to rise 200 m from Ulawun during 1-7 December. Ashfall was reported on the NW flanks, in Ubili (10 km NW) and Ulamona (10 km NW). A small landslide scar appeared near the N valley flank vent, reportedly caused by movement of a large boulder and loose material, triggered by a M 6.1 earthquake that occurred near Pomio (55 km SSE) on 19 November., 266911=09/1983 (SEAN 08:09) Gas measurements on 11 September, 171824=\"A mild eruption took place between 1 and 10 January. Frequent ejections of dark grey ash were observed rising as much as 2 km above the summit. These produced light ashfalls on the SE side of the volcano. Bright red glow from the summit crater was observed during the ejections. During the eruption, visible activity often coincided with regular periods of low-amplitude, high-frequency tremor. Included in the tremor were discrete B-type events. This pattern of seismicity had begun on 26 October 1988. There was a slow, irregular increase in amplitude through November and early December, but a significant increase took place in mid-late December. Seismicity declined during the eruption.\", 36398=Thick plumes and earthquakes during late August to mid-September 2005, 250192=01/2003 (BGVN 28:01) Intermittent ash plumes from August through early November 2002, 267996=01/1983 (SEAN 08:01) Weak vapor emission; seismicity increases, 60610=The Darwin Volcanic Ash Advisory Centre reported that an ash plume from Ulawun was visible on satellite imagery on 22 September at an altitude of ~3.7 km extending NW. On 5 October a faint ash plume was identified on satellite imagery at ~4.3 km altitude, extending 55 km WSW of the summit. Another ash plume was seen reaching ~75 km WNW of the summit on satellite imagery on 10 October at an altitude around 3 km., 89276=The Darwin VAAC received a pilot report that a \"smoke\" cloud had been emitted from Ulawun on 30 April at 0730. The Rabaul Volcano Observatory (RVO) confirmed the report. The cloud reached an altitude of ~9 km and drifted NW and SW, expanding to 80-113 km in radius. GMS and NOAA weather satellite imagery indicated that the cloud may have reached a maximum height of ~13.7 km and that the eruption ceased by approximately 1530. By 3 May volcanic activity had decreased, but, because further ash emissions could occur, RVO placed the volcano at Stage 2 Alert. RVO reported that limited evacuations occurred. Ash was not observed on satellite imagery after the 30 April eruption, although ash clouds may have been obscured by meteorological clouds near the volcano., 281526=Volcanic and seismic activity remained at low levels during 17-26 February at Ulawun, with the emission of low-to-moderate volumes of steam. There were no emissions from the north valley vent. Heavy rain on 19, 21, 22, and 24 February led to the reactivation of mudflows on Ulawun's flanks. Residents in the affected areas were evacuated., 252362=10/1998 (BGVN 23:10) White vapor plumes throughout September, 216488=\"Amplitudes of discrete earthquakes were generally low in June, although slightly higher amplitudes were recorded 10-18 June in relation to the first 4 periods of tremor. A brief interval of low amplitudes followed the crisis of 17-18 June, but a steady rise in amplitudes was recorded beginning 20 June., 127767=\"There was an increase in the level of activity in April. At the beginning of the month, emissions consisted of moderate white vapour. However, these emissions changed through the month to strong thick white vapour and there were occasional reports of grey and blue emissions. On 19 April, very strong, thick, dark grey emissions were reported. Very fine ashfall was reported on the NW side of the volcano on 28 April, and steady weak red glow was seen on the 30th., 183985=Conditions for observing Ulawun were poor in February. The mountain was obscured on most days and received very heavy rainfall between the 9th and the end of the month. A maximum of 36 cm of rain was recorded on the 22nd at the base station, 10 km from the summit. In possible association with the rainfall, the recorded seismicity increased markedly, from 10-200 small events/day at the beginning of the month to a maximum of 1400/day on the 27th. In addition, periods of sub-continuous, non-harmonic tremor started on the 11th, becoming continuous for periods of 1-2 hours daily after the 14th. During 26-28 February, the seismic pattern consisted of alternating periods of intense non-harmonic tremor lasting 1-3 hours and periods of seismic quiet. Seismicity was still strong at the end of the month., 240163=\"One or more nuées ardentes traveled down the SE flank at the peak of this phase, starting at about 1545, but were not directly observed, being on the opposite side of the volcano to the observation post. Fallen trees were visible only at the edges of the extensive area of forest destroyed by the nuées ardentes. The devastation extended 6-7 km from the summit and exhibited several adjoining lobes (figure 1)., 301040=According to the Darwin VAAC, an ash-and-steam plume from Ulawun that was reported on 15 August by the US Air Force Weather Agency rose to an altitude of ~3.7 km (~12,000 ft.) a.s.l. The plume was also visible on satellite imagery., 274650=Volcanic tremor, which had been occurring at moderate-to-high levels during the previous 2 weeks, dropped dramatically on 11 October. After 11 October seismicity only consisted of discrete low-frequency earthquakes. On 8 and 9 October loud roaring noises emanated from the volcano. A deflationary trend continued to be detected., 248988=06/2004 (BGVN 29:06) No MODVOLC thermal anomalies detected despite other observed activity, 322733=Based on analyses of satellite imagery and information from RVO, the Darwin VAAC reported that on 26 November an ash plume from Ulawun rose to an altitude of 3.7 km (12,000 ft) a.s.l. and drifted 55 km NE., 201892=\"Seismicity, which had intensified in November, decreased to a normal level by early December. A re-intensification began on 17 December and reached a peak near the end of the month, when seismic amplitudes were about 10 times normal., 119134=On 6 October 1994 the stratovolcano was visited by Chris McKee and Rod Stewart (RVO), and Stan Williams and Steve Schaefer (ASU), because of reports that the gas plume was abnormally large. Williams suggested that the plume appeared larger in volume and visible extent than during his two other visits in 1983 and 1989. Airborne COSPEC measurements made in clear atmospheric conditions showed the SO2 flux to be 1,260 ± 100 t/d. Prior measurements in 1983 and 1989 were 71 and 120 t/d, respectively., 188440=\"On 10 May, unusual low-frequency events and harmonic tremor were recorded for ~3 hours. Smaller bursts of tremor lasting a few minutes each were also recorded on 13 and 15 May. There was no visible volcanic activity associated with the seismic activity, although the summit was not visible for much of this time.\", 260997=04/1989 (SEAN 14:04) Small ash emissions, minor seismic increases, 264128=10/1986 (SEAN 11:10) Low-level seismicity; weak vapor emissions, 62793=The main summit crater continued to release weak to moderate volumes of white (occasionally white-gray) vapor during 14-29 April, 7-27 May, and 11-18 June. Seismicity was low except for an episode of volcanic tremor between 15 and 19 April. Gas effervescence was reported close offshore of Ulamona Jetty in the second half of April. A slight increase in seismicity was noted between 18 and 23 May., 262083=10/1988 (SEAN 13:10) Earthquakes and tremor; vapor emission, 15425=Modest eruptions included ash plumes to 4 km through February 2011, 259928=10/1989 (SEAN 14:10) Weak-moderate vapor emission}",
    "TableContextTimeStampAfterTable": "{24973=Johnson R W, Davies R A, White A J R, 1972. Ulawun volcano, New Britain. Aust Bur Min Resour Geol Geophys Bull, 142: 1-42., 24310=Cooke R J S, 1981c. Notes on the activity of Ulawun volcano, 1700-1958: results of literature search. Geol Surv Papua New Guinea Mem, 10: 147-152., 1351=The symmetrical basaltic-to-andesitic Ulawun stratovolcano is the highest volcano of the Bismarck arc, and one of Papua New Guinea's most frequently active. Ulawun volcano, also known as the Father, rises above the north coast of the island of New Britain across a low saddle NE of Bamus volcano, the South Son. The upper 1000 m of the 2334-m-high Ulawun volcano is unvegetated. A prominent E-W-trending escarpment on the south may be the result of large-scale slumping. Satellitic cones occupy the NW and eastern flanks. A steep-walled valley cuts the NW side of Ulawun volcano, and a flank lava-flow complex lies to the south of this valley. Historical eruptions date back to the beginning of the 18th century. Twentieth-century eruptions were mildly explosive until 1967, but after 1970 several larger eruptions produced lava flows and basaltic pyroclastic flows, greatly modifying the summit crater., 24654=Fisher N H, 1957. Melanesia. Catalog of Active Volcanoes of the World and Solfatara Fields, Rome: IAVCEI, 5: 1-105., 24790=Johnson R W, 1987. Large-scale volcanic cone collapse: the 1888 slope failure of Ritter volcano, and other examples from Papua New Guinea. Bull Volc, 49: 669-679., 24477=Cooke R J S, Baldwin J T, Sprod T J, 1976. Recent volcanoes and mineralization in Papua New Guinea. 25th Internatl Geol Cong, Sydney, Excur Guide, 53: 1-30., 25116=Silver E, Day S, Ward S, Hoffmann G, Llanes P, Driscoll N, Appelgate B, Saunders S, 2009. Volcano collapse and tsunami generation in the Bismarck Volcanic Arc, Papua New Guinea. J Volc Geotherm Res, 186: 210-222.}",
    "textBeforeTable": "According to RVO, during 2-12, 16-19, and 23-25 June 2010 residents heard occasional low roaring or rumbling noises daily on the ESE, SE, S, and NW flanks. During 2-19 and 23-26 June, white to gray-brown plumes rose to ~3 km altitude (figure 15). The Darwin VAAC noted that between 3-6 June, the plumes extended up to 315 km W. On 16-17 and 19-20 June, white and gray plumes rose 1 km above the summit. Very fine ash particles fell in Ulamona (~10 km NW) on 3 and 8 June, and then fell daily during 9-19 and 23-25 June on the NW, W, and SW flanks. Throughout June, fluctuating incandescence from the summit crater was seen at night from the S, SW, N, and SE flanks. RVO reported that on 18 and 19 June, seismicity increased to a high level and was dominated by volcanic tremor. Seismicity declined to moderate levels on 20 June and, based on RSAM values, declined further on 26 June 2010. People on the S and SE sides of the island heard \"low jetting\" noises during 24-25 May 2010. Weak and fluctuating incandescence was seen from the S at night during 28-29 May. Emissions became gray in color during 29-31 May, and on 30 May very fine ashfall was reported in areas to the SSW, S, and SSE. On 1 and 2 June only white vapor emissions were noted. RVO recommended a Stage 1 Alert as a result of increasing seismicity and occasional",
    "textAfterTable": "RVO reported that activity at Ulawun was low during 4-31 August; emissions from the summit crater consisted of white vapor until 16 August, and were gray during 17-31 August. Emissions were more energetic on 24 August, rising 200 m. A single booming noise and weak incandescence was also reported that day. RSAM values fluctuated but decreased overall. Source: Rabaul Volcano Observatory (RVO) 31 July-6 August 2013 Cite this Report RVO reported that activity at Ulawun was low during 22 July-4 August; emissions from the summit crater consisted of white vapor. Seismicity was also low. RSAM values decreased from 80 on 21 July to 50 on 31 July, and then began to increase on early 2 August. By 4 August RSAM values reached 600, attributed to an increase in volcanic tremor. Source: Rabaul Volcano Observatory (RVO) 17 July-23 July 2013 Cite this Report RVO reported that activity at Ulawun was low during 15-21 July. Emissions from the summit crater were light gray during 15-16 July, and then changed to white vapor during 17-21 July. RSAM from volcanic tremors had increased on 14 July and reached a peak of 700 just after 0300 on 15 July. RSAM then decreased to 80 on 21 July, which also marked the cessation of volcanic tremors.",
    "hasKeyColumn": true,
    "keyColumnIndex": 3,
    "headerRowIndex": 0
}