{
    "relation": [
        [
            "Transaction Summary Metrics",
            "Items per Order9",
            "Average Order Value10",
            "Shopping Cart Conversion Rate11",
            "Shopping Cart Abandonment Rate12",
            "New Visitor Conversion Percent13"
        ],
        [
            "Black Friday 2009",
            "5.4",
            "$170.19",
            "34.60%",
            "65.40%",
            "3.71%"
        ],
        [
            "Black Friday 2008",
            "4.56",
            "$126.04",
            "33.56%",
            "66.44%",
            "2.27%"
        ],
        [
            "% Change (y/y)",
            "18.33%",
            "35.02%",
            "3.08%",
            "-1.55%",
            "63.36%"
        ],
        [
            "Friday Nov 20, 09",
            "6.19",
            "$176.92",
            "32.89%",
            "67.11%",
            "3.19%"
        ],
        [
            "% Change (w/w)",
            "-12.76%",
            "-3.80%",
            "5.19%",
            "-2.54%",
            "16.16%"
        ]
    ],
    "pageTitle": "Benchmark Report Holiday 2009",
    "title": "",
    "url": "http://www-01.ibm.com/software/marketing-solutions/benchmark-reports/index-2009.html",
    "hasHeader": true,
    "headerPosition": "MIXED",
    "tableType": "RELATION",
    "tableNum": 10,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989142.82/warc/CC-MAIN-20150728002309-00242-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 260223730,
    "recordOffset": 260215528,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{2886=Black Friday 2009 and Cyber Monday 2009 are over, and IBM Coremetrics Benchmark has the online retail data. Both shopping days delivered strong performances, outpacing 2008 levels. Retailers in general did a very good job of educating consumers about promotions and special offers, enticing more consumers to shop online than in 2008., 2447=The US online retail sector reported strong sales results on Cyber Monday, November 30, 2009, compared to the same period last year. This analysis, delivered as part of IBM Coremetrics' second annual Cyber Monday Benchmark Report, reveals the following trends and patterns as of 12 a.m. PST:, 2532=Cyber Monday Online Spending Exceeds 2008 Levels, 3802=Black Friday and Cyber Monday 2009, 1197=Retail categories compared to Cyber Monday 2008 (year/year):}",
    "TableContextTimeStampAfterTable": "{12627=The U.S. online retail sector delivered a strong comeback on Black Friday 2009 compared to the same period last year. This analysis, delivered as part of IBM Coremetrics' second annual Black Friday Benchmark Report, reveals the following trends and patterns as of 12:00 a.m. PST:, 12535=Ecommerce Activities Gain Strength on Black Friday 2009, 14837=Download the Full Benchmark Black Friday 2009 Report (1.47KB)}",
    "textBeforeTable": "1 U.S. Retail Download the Full Benchmark Cyber Monday 2009 Report (995KB) Department stores also did a good job of attracting new consumers to their sites, reporting a 33 percent increase. However, average order value was down nearly 10 percent. Sports apparel and gear retailers reported a rise of nearly 55 percent in the number of new consumers visiting their sites. But the average dollar amount consumers spent per online order declined slightly by 3.1 percent. Apparel retailers and jewelry retailers reported the biggest jumps in the average dollar amount consumers spent per online order, up 26.4 percent and 14.3 percent respectively. Retail categories compared to Cyber Monday 2008 (year/year): Consumer shopping hit its peak from 9 - 10 a.m. PST, but maintained stronger momentum throughout the day than on Cyber Monday 2008. Consumers bought nearly 10 percent more items per order on Cyber Monday 2009 compared to Black Friday 2009 and nearly 30 percent more compared to Cyber Monday 2008. The average dollar amount consumers spent per online order rose 38.2 percent from Cyber Monday 2008 ($180.03 versus $130.24), led by apparel retailers. Sales were up 13.7 percent compared to Cyber Monday 2008. Consumers spent more per online order ($180.03 versus $170.19 for an increase of 5.8 percent) compared to Black Friday 2009. Cyber Monday continued the momentum set by Black Friday. Sales were up 24.1 percent compared to Black Friday 2009.",
    "textAfterTable": "Visitor Experience Summary Metrics Cyber Monday 09 Cyber Monday 08 % Change (y/y) Black Friday 09 % Change (cm/bf) Page Views per Session6 8.8 11.59 -24.07% 8.79 0.11% Product Views Per Session7 2.14 2.63 -18.63% 2.17 -1.38% Average Session Length (in seconds)8 7:32 8:23 -10.14% 7:28 0.89% Transaction Summary Metrics Cyber Monday 09 Cyber Monday 08 % Change (y/y) Black Friday 09 % Change (cm/bf) Items per Order9 5.92 4.56 29.82% 5.4 9.63% Average Order Value10 $180.03 $130.24 38.23% $170.19 5.78% Shopping Cart Conversion Rate11 36.81% 37.99%",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}