{
    "relation": [
        [
            "Beat Name",
            "Desktop",
            "Productivity",
            "Networking",
            "Printing",
            "I18n",
            "Multimedia",
            "Entertainment",
            "Live"
        ],
        [
            "Writer",
            "Christopher Antila (talk) 17:40, 28 January 2013 (UTC) for KDE & GNOME, Sergio Cipolla for Xfce, Deepak Bhole for Java",
            "Bryan Sutherland",
            "Will Morris*",
            "Ben Cotton",
            "JensPetersen",
            "zoglesby*",
            "",
            "Emad78*"
        ],
        [
            "Developer PoC",
            "KevinKofler* (KDE) *, ChristopherAillon *",
            "Open",
            "ChristopherAillon *",
            "Tim Waugh *",
            "AkiraTagoh",
            "Open",
            "Open",
            "Open"
        ],
        [
            "Wiki good",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0"
        ],
        [
            "In Publican",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0"
        ],
        [
            "Proofread",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0"
        ]
    ],
    "pageTitle": "Category:Documentation beats - FedoraProject",
    "title": "",
    "url": "http://fedoraproject.org/w/index.php?title=Category:Documentation_beats&diff=325974&oldid=316310",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 5,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987228.91/warc/CC-MAIN-20150728002307-00229-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 86205455,
    "recordOffset": 86184063,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{117121=Copyright © 2015 Red Hat, Inc. and others. All Rights Reserved. For comments or queries, please contact us.}",
    "textBeforeTable": "Welcome to Fedora 23 - Once you've added your name, you should subscribe to the content flow mailing list. - If a beat is a lonely orphan with no writer, and you'd like to be that person (or to help), just add your name to the Writer column. - If a beat writer has an asterisk (*) next to his/her name, that writer has not yet indicated whether (s)he will write for Fedora 23. If you are that writer, and you are still willing to help, please remove the asterisk. How to take a beat or remove yourself from one Review Docs_Project_workflow_-_beat_writing for more thorough details about what you'll need to do. These beats are essentially draft sections for the release notes document. (An annotated version of the Fedora 23 schedule for Release Notes is available at Releases/23/Schedule.) You're likely to have a developer contact and will be able to use the feature pages for your beat, as well as other resources. You can even start by pasting the release notes from your feature's page. So don't be nervous--just claim a beat! Beat writing is a good place for a new contributor to start working with the Fedora project. You'll learn about the next release of Fedora, but you don't need to be highly technical. Most of the work is done in",
    "textAfterTable": "Beat Name Writer Developer PoC Wiki good In Publican Proofread Architecture Specific Content Open Open 0 0 0 x86 Specific Content Open Open 0 0 0 x86_64 Specific Content Open Open 0 0 0 ARM Specific Content Open Open 0 0 0 Changes in Fedora for Desktop users Beat Name Writer Developer PoC Wiki good In Publican Proofread Desktop Christopher Antila (talk) 17:40, 28 January 2013 (UTC) for KDE & GNOME, Sergio Cipolla for Xfce, Deepak Bhole for Java KevinKofler* (KDE) *, ChristopherAillon * 0 0",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}