{
    "relation": [
        [
            "",
            "",
            "2/1",
            "DL: 9a-11p DCA: 10a-8p SL MM",
            "2/8",
            "DL: 8a-12a DCA: 10a-10p SL MM",
            "2/15",
            "DL: 8a-12a DCA: 10a-10p SL MM"
        ],
        [
            "1/26",
            "DL: 10a-8p DCA: 10a-6p TT",
            "2/2",
            "DL: 10a-8p DCA: 10a-6p TT",
            "2/9",
            "DL: 9a-10p DCA: 10a-7p TT",
            "2/16",
            "DL: 8a-11p DCA: 10a-8p TT"
        ],
        [
            "1/27",
            "DL: 10a-8p DCA: 10a-6p MM",
            "2/3",
            "DL: 10a-8p DCA: 10a-6p MM",
            "2/10",
            "DL: 10a-8p DCA: 10a-6p MM",
            "2/17",
            "DL: 9a-9p DCA: 10a-6p MM"
        ],
        [
            "1/28",
            "DL: 10a-8p DCA: 10a-6p TT",
            "2/4",
            "DL: 10a-8p DCA: 10a-6p TT",
            "2/11",
            "DL: 10a-8p DCA: 10a-6p TT",
            "2/18",
            "DL: 9a-9p DCA: 10a-6p TT"
        ],
        [
            "1/29",
            "DL: 10a-8p DCA: 10a-6p MM",
            "2/5",
            "DL: 10a-8p DCA: 10a-6p MM",
            "2/12",
            "DL: 10a-8p DCA: 10a-6p MM",
            "2/19",
            "DL: 9a-9p DCA: 10a-6p MM"
        ],
        [
            "1/30",
            "DL: 9a-10p DCA: 10a-7p TT",
            "2/6",
            "DL: 9a-10p DCA: 10a-6p TT",
            "2/13",
            "DL: 8a-12a DCA: 10a-9p TT",
            "2/20",
            "DL: 9a-12a DCA: 10a-9p TT"
        ],
        [
            "1/31",
            "DL: 9a-11p DCA: 10a-8p SL/SC MM / TT",
            "2/7",
            "DL: 8a-12a DCA: 10a-8p SL/SC MM / TT",
            "2/14",
            "DL: 8a-12a DCA: 10a-9p SL/SC MM / TT",
            "2/21",
            "DL: 8a-12a DCA: 10a-9p SL/SC MM / TT"
        ]
    ],
    "pageTitle": "Disneyland Resort Update (Disneyland Resort Update) by MousePlanet Staff",
    "title": "",
    "url": "http://www.mouseplanet.com/8700/Disneyland__Resort_Update",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 1,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988650.6/warc/CC-MAIN-20150728002308-00173-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 593955971,
    "recordOffset": 593928246,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{53744=2009 Southern California CityPass ($259/$219) – This pass includes a 3-Day Disneyland Resort park ticket (including one early-entry day), and single-day admission to either San Diego Zoo or San Diego Wild Animal Park, as well as SeaWorld San Diego and Universal Studios Hollywood. The CityPass expires 14 days after first use at any location. Purchase CityPass through the Disneyland Web site (link) or onsite at the ticket booths of Disneyland Resort or the other theme parks included in the pass. You can also purchase directly from the CityPass Web site (link) though this has a minimum $7.50 shipping charge (no shipping charge from the Disney Web site if purchased more than 10 days in advance)., 11648=The bank’s 1955 interior, complete with hardwood teller windows, has been used primarily for Annual Passholder processing over the last 15 years. It all will be torn out, along with at least half of the Opera House’s lobby. Most of the artifacts from the lobby, including Walt’s offices, are planned to be moved to Disney’s California Adventure, as its entrance corridor and Hollywood area are gradually transformed to re-create the Southern California of Walt’s early days., 21639=...The Walt Disney Company's annual shareholder meeting will be held in Oakland, California on Tuesday, March 10 (link)., 49315=Advance Purchase 2009 Everyone Plays for the Kids' Price! 5-Day Park Hopper Ticket ($164) – This promotion is valid January 6 through April 30, 2009, and includes one one Magic Morning admission. Currently available for purchase through the Anaheim-Orange County Visitor & Convention Bureau Web site (link)., 34298=2009 \"Southern California 2Fer Ticket\" ($69 / $59) – Visitors who live in Southern California and Baja California, Mexico can now purchase the 2009 \"Southern California 2Fer Ticket.\" This special ticket offers admission to either Disneyland or Disney's California on one day and then to the other park on a second day for the price of a one-day, one-park ticket ($69 for adults and $59 for children ages 3 to 9)., 19298=Unite HERE Local 11 represents over 2,300 cast members employed as bellmen, restaurant servers and housekeeping attendants working at the three hotels of the Disneyland Resort. Cast members have been working without a contract since the union rejected an offer to extend the contract that ended in January, 2008. The negotiations have been marked by protracted disagreements over meeting venues and multiple public protests, including an incident in August when over 20 union representatives and community leaders were arrested for blocking traffic on Harbor Blvd., 19875=The main area of disagreement is health insurance for covered employees. Local 11 members are the only Disney cast members who have a separate health plan, paid for by Disney through contributions to the union's insurance trust fund. Most members who work an average of just under 18 hours per week receive \"free\" health insurance for themselves and their spouse and/or children. Under the most recent proposal by Disney, all cast members will transition to the same Disney's Signature Health Care plan that covers all other eligible Disneyland Resort cast members, but Disney will continue to pay the full weekly premium for two years. Starting in 2011, cast members will begin paying about 25% of of the weekly premium for the Disney Signature plan, and by 2013 will be paying the same weekly premium as other covered cast members., 56857=Alaska Airlines \"Kids Fly Free to the Disneyland Resort\" promotion – Valid for travel between January 7 and June 17, 2009 when you also book your hotel through the airline. Significant restrictions apply to the promotion, including blockout dates. This offer can be a good deal for some families, but make sure that you compare the total quoted package price against the same elements if purchased a la carte. You may be able to take advantage of other published airfare specials and hotel discounts to create a less expensive vacation package. Unfortunately the Alaska Airlines Web site can be sluggish, making comparison shopping time consuming, but you should definitely do your homework before you buy., 36835=The 2009 offer is slightly complicated by the \"What Will You Celebrate?\" promotion, and special options are available to eligible residents with birthdays between January 6 and June 3., 17880=Asked why the union allowed the December 31st deadline to slip past without bringing Disney's proposal to the membership for a vote, Briceno said \"They [Disney] have no right to tell us when to take an offer to our members,\" adding, \"We don't tell them when to take our offer to their shareholders.\" She said \"we don't believe we have their bottom line,\" and Local 11 wants Disney to return to the bargaining table to continue working on the provisions that were under negotiation when Disney presented their last offer., 40776=Advance Purchase 2009 Everyone Plays for the Kids' Price! 3-Day Park Hopper Ticket ($149) – This promotion is valid January 6 through April 30, 2009, and includes one one Magic Morning admission. Currently available for purchase through the Anaheim-Orange County Visitor & Convention Bureau Web site (link)., 16460=Unite HERE Local 11 doesn't think they really have Disney's \"last, best and final\" offer, and they don't appreciate Disney trying to tell them when to bring a proposal to their membership for a vote. In an interview with MousePlanet last week, Ada Briceno, Secretary Treasurer of the newly reorganized union, expressed frustration with the status of the yearlong negotiation with Disney, and denies a Disney statement that the union did not respond to a contract offer made on December 12, 2008., 45122=Advance Purchase 2009 Everyone Plays for the Kids' Price! 4-Day Park Hopper Ticket ($154) – This promotion is valid January 6 through April 30, 2009, and includes one one Magic Morning admission. Currently available for purchase through the Anaheim-Orange County Visitor & Convention Bureau Web site (link)., 45602=Costco Disneyland Resort Play 4 Days Exchange Certificate – Available through the Costco Web site (link), this $139 ticket (for ages 3 through adult) is good for four one-day admissions to Disneyland or Disney's California Adventure. The tickets are non-transferable—the same person must use all four admissions. The ticket expires once the four admissions are used, or on July 31, 2009, whichever comes first. This is not a park-hopper pass, although you could probably use one admission per day at each park, in effect using the four admissions as a two-day park-hopper. The tickets are available only to Costco members who are residents of Southern California. Tickets must be purchased at Costco, with a limit of eight tickets per member per day. It is important to note that the item you purchase at Costco is an \"Exchange Certificate,\" not a valid park passport. Members must exchange the certificate at the Disneyland Resort Ticket booth to receive the Play 4 Days ticket. Proof of California residency in zip codes 90000 through 93599 is required to exchange the certificate for a valid ticket., 41256=Disney's Armed Forces Salute 3-Day Park Hopper Ticket (Free/$94) – Through June 12, 2009, each active or retired member of the U.S. military can receive one complimentary three-day \"Disney's Armed Forces Salute\" Park Hopper ticket valid for admission to both Disneyland and Disney's California Adventure parks. During the offer period, active or retired U.S. military personnel also may make a one-time purchase of an adult or child three-day \"Disney's Armed Forces Salute Companion\" Park Hopper ticket for up to five family members (including spouse) or friends for the price of an adult 1-Day Park Hopper ticket. Disneyland Resort hotels are also offering special room rates for active or retired military personnel. For example, at Disney's Paradise Pier Hotel, active or retired members of the military and their families may find hotel rooms starting at $119 per night during value season, with great savings during other times of the offer period. This offer is available through June 12, 2009, and the number of rooms available at these special rates is limited. For information regarding \"Disney's Armed Forces Salute\" at the Disneyland Resort, or to make reservations, military personnel may call 714/956-6424. Full details of the offer, including eligibility guidelines and other restrictions, are posted on our MousePad discussion board (link)., 15256=Unfortunately, the combination of strong demand, malfunctioning computers, and Disney's unpopular new \"one registration per transaction\" policy left many couples with just one ticket. MousePlanet reader KarenW2 reported that she was able to purchase a ticket for herself, but then experienced computer problems as she completed a second reservation for her husband, and did not receive a same-day e-mail confirmation for his ticket. After several calls, faxes and an e-mail, the couple was able to confirm that both reservations had been processed. Other readers reported similar situations, and Disney briefly accepted names for a waiting list in the event additional tickets become available. Disney will also allow guests who purchased tickets to receive a refund in the event their friend/spouse was unable to purchase a ticket, and will accept name changes on existing registrations until August, 28., 16978=Briceno told MousePlanet that she felt both parties were \"making progress\" during the last negotiation session between Disney and the union in December when Disney suddenly presented the union with their \"last, best and final\" offer that included bonus payments to cast members if the agreement were ratified by the end of the year. Briceno says that the terms of this offer were a \"complete departure\" from the terms the two parties had been discussing up to that point. Briceno said that after taking a day to review the terms of the offer, she contacted Disney and asked the company to return to the bargaining table, offering potential meeting dates in late December and early January. Briceno said that she also sent an e-mail to Disney's negotiation team this past week, offering meeting dates in February, but has received no response from the company., 34759=The 2009 promotion also features a return of the \"Southern California 2-Day Park Hopper Ticket\" for $94 for adults / $84 for ages 3-10. This is $25 more than the 2Fer ticket and allows you to visit both Disneyland and DCA on the same day. The offers includes much the same fine print as previous promotions:, 22265=...We received word of a new discount code for registration for the Disneyland Resort half-marathon. Through March 31, registering with the code (RunDLRwdw09) will save you $10 off the regular $120 registration fee. However, we've also heard that the previously reported discount codes (RunDLRstg09 and RunDLR09) may still work and those get you $15 off. (registration link), 22928=...While we're on the subject, discount hotel rates for the DLR half-marathon weekend are now available through GET Travel, Disney Sports' travel provider. Reservations made by February 15 are exempt from the usual $50 deposit requirement. To get the special hotel rates, start at GET Travel's booking page (link) but instead of completing your reservation online, you will need to call 888-877-4445, extension 105. Booking forms can also be printed and faxed to 916-939-6806.}",
    "textBeforeTable": "MTT - Mickey's Trick-or-Treat Party at DCA Grad Nite TT - Toontown Morning Madness at Disneyland MM - Magic Morning at Disneyland Disneyland Resort Special Events: DX - Deluxe Annual Pass SC - Southern California Annual Pass SL - Southern California Select Annual Pass DL: Disneyland DCA: Disney's California Adventure Annual Pass blockout dates: Park Schedule/Blockout Dates Downtown Disney Patina Restuarant Discounts – Three Downtown Disney restaurants operated by the Patina Group are currently offering lunch and/or dinner specials. Check at the restaurant for menu and price details. AAA Restaurant Discounts – AAA (American Automobile Association) members can receive a 10% discount (excluding alcohol) at Plaza Inn, Wine Country Trattoria Ariel's Grotto, PCH Grill, and Goofy's Kitchen. ESPNZone MVP Club – Membership in the MVP Club does not offer any discounts on food. However, once a member you can make an online reservation for your party up to three days in advance and will get a 25% increase in points purchased when playing games in the Sports Arena (and 40 bonus points at activation). You must register online and your membership card will then be mailed to you within two weeks. The card must then be activated at any ESPNZone by the person who signed up for the card and ID will be required (link). Rainforest Cafe Safari Club",
    "textAfterTable": "Visit our Annual Passholders Blockout Dates page to see more dates. You can see future calendar schedules at Disneyland. As always, specifics are subject to change without notice (or occasionally, without us noticing) so when information conflicts between what is presented here and that presented by Disney, it is best to assume Disney's information is correct. Visit the Park Hours section of our Disneyland Park guide for additional details about Magic Morning and Toontown Morning Madness, including available attractions. Entertainment schedule: Go directly to the Disneyland Resort schedule for this week at Disneyland.com here. Talk about this article and more, on the MousePad community forums. (Send an email to MousePlanet Staff) © 2000-2015 MousePlanet Legal information and privacy policy | About/contact us | Link to us | Find us on Google+ MousePlanet® is not associated in any official way with the Walt Disney Company, its subsidiaries, or its affiliates. The official Disney site",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}