{
    "relation": [
        [
            "#",
            "5",
            "6",
            "2",
            "3",
            "4",
            "1"
        ],
        [
            "Version #",
            "Version 1",
            "Version 1",
            "Version 1",
            "Version 1",
            "Version 1",
            "Version 1"
        ],
        [
            "Sponsor(s)",
            "Blumenauer (OR)",
            "Blumenauer (OR)",
            "DeLauro (CT), Blumenauer",
            "DeLauro (CT)",
            "DeLauro (CT), Blumenauer",
            "Kind (WI), Petri (WI), Blumenauer (OR), DeLauro (CT)"
        ],
        [
            "Party",
            "Democrat",
            "Democrat",
            "Democrat",
            "Democrat",
            "Democrat",
            "Bi-Partisan"
        ],
        [
            "Summary",
            "Requires that agricultural entities who make more than $750,000 a year must purchase any premium coverage without federal subsidies. For those entities with an adjusted gross income between $250,000 and $500,000, the amendment reduces premium subsidy coverage by 10 percentage points. For those with an AGI between $500,000 and $750,000, the premium subsidy coverage is reduced by 20 percentage points. Any entities with an annual AGI of less than $250,000 will continue to receive full subsidization by the federal government.",
            "Strikes the two years of direct payments to upland cotton that H.R. 1947 continues.",
            "Sunsets permanent authority for the federal crop insurance program, keeping the program authorization in line with other farm programs authorized in H.R. 2642.",
            "Sets the government guarantee target for crop insurance company profitability at 12%, the target recommended in a study commissioned by USDA, and caps reimbursements of company administrative and operating expenses.",
            "Places an annual cap of $50,000 for the total subsidy received by a farmer who participates in the Federal Crop Insurance Program and requires the recipient to be “actively engaged” in farming in order to qualify for the subsidy. Currently the government subsidizes 62 percent of the premium amount with no limit on the total dollar amount of subsidy received.",
            "Limits premium subsidies to those producers with an AGI under $250,000 and limits per person premium subsidies to $50,000. Caps crop insurance providers’ reimbursement of administrative and operating at $900 million and reduces their rate of return to 12%. Introduces transparency into the crop insurance program."
        ],
        [
            "Status",
            "Submitted",
            "Submitted",
            "Submitted",
            "Submitted",
            "Submitted",
            "Submitted"
        ]
    ],
    "pageTitle": "H.R. 2642—Federal Agriculture Reform and Risk Management Act of 2013 | House Committee on Rules",
    "title": "",
    "url": "https://rules.house.gov/bill/113/hr-2642",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 0,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988650.6/warc/CC-MAIN-20150728002308-00248-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 881537207,
    "recordOffset": 881528882,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{5428=Wednesday, July 10, 2013 at 9:00 pm in H-313, The Capitol View Announcement », 8207=COMMITTEE ACTION: REPORTED BY RECORD VOTE of 9-4 on Wednesday, July 10, 2013., 8326=FLOOR ACTION ON H. RES. 295:  ADOPTED by record vote of 223-195, after agreeing to table the appeal of the ruling of the chair by record vote of 226-196, on Thursday, July 7, 2013.  , 6609=Federal Agriculture Reform and Risk Management Act of 2013         ::   Bill Summary (as provided by the Committee on Agriculture) PDF              Updated 07/12/2013}",
    "lastModified": "Sat, 01 Aug 2015 12:00:13 GMT",
    "textBeforeTable": "Amendments   6. Provides one motion to recommit. 5. Waives all points of order against provisions in the bill. 4. Provides that the bill shall be considered as read. 3. Waives all points of order against consideration of the bill. 2. Provides one hour of debate equally divided and controlled by the chair and ranking minority member of the Committee on Agriculture. 1. Closed rule. MANAGERS: Sessions/McGovern FLOOR ACTION ON H. RES. 295:  ADOPTED by record vote of 223-195, after agreeing to table the appeal of the ruling of the chair by record vote of 226-196, on Thursday, July 7, 2013.   COMMITTEE ACTION: REPORTED BY RECORD VOTE of 9-4 on Wednesday, July 10, 2013. Rule Information H. Rept. 113-149 PDF HTML H. Res. 295 PDF XML Rule PDF Hearing Documents Federal Agriculture Reform and Risk Management Act of 2013         ::   Bill Summary (as provided by the Committee on Agriculture) PDF              Updated 07/12/2013 Text of H.R. 2642 PDF XML Bill Text",
    "textAfterTable": "Committee Votes Rules Committee Record Vote No. 53 Motion by Ms. Slaughter to report an open rule. Defeated 4-9. Majority Member Vote Ms. Foxx Nay Mr. Bishop Nay Mr. Cole Nay Mr. Woodall Nay Mr. Nugent Nay Mr. Webster Nay Ms. Ros-Lehtinen Nay Mr. Burgess Nay Mr. Sessions, Chairman Nay Minority Member Vote Ms. Slaughter Yea Mr. McGovern Yea Mr. Hastings Yea Mr. Polis Yea Rules Committee Record Vote No. 54 Motion by Ms. Foxx to report the rule. Adopted 9-4 Majority Member Vote Ms. Foxx Yea Mr. Bishop Yea Mr. Cole Yea",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}