{
    "relation": [
        [
            "Year",
            "2004",
            "2005",
            "2006",
            "2007",
            "Career"
        ],
        [
            "GP-GS",
            "25-0",
            "32-0",
            "30-0",
            "30-30",
            "117-30"
        ],
        [
            "Shots",
            "38",
            "48",
            "36",
            "73",
            "195"
        ],
        [
            "Goals",
            "10",
            "16",
            "8",
            "25",
            "59"
        ],
        [
            "Assists",
            "5",
            "8",
            "7",
            "7",
            "27"
        ],
        [
            "Shot Pct.",
            ".263",
            ".333",
            ".222",
            ".342",
            ".303"
        ],
        [
            "Steals",
            "9",
            "6",
            "14",
            "12",
            "41"
        ],
        [
            "TO",
            "2",
            "5",
            "7",
            "13",
            "27"
        ],
        [
            "KO Against",
            "8",
            "19",
            "25",
            "15",
            "67"
        ],
        [
            "KO Drawn",
            "5",
            "8",
            "2",
            "5",
            "20"
        ]
    ],
    "pageTitle": "Santa Clara",
    "title": "",
    "url": "http://www.santaclarabroncos.com/sports/m-wpolo/2005-06/bios/kelly_tommy00.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 1,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989142.82/warc/CC-MAIN-20150728002309-00266-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 707263996,
    "recordOffset": 707248058,
    "tableOrientation": "VERTICAL",
    "TableContextTimeStampAfterTable": "{32192=AS A JUNIOR IN 2006-07: 9/2 vs. Navy - Came off the bench to notch one assist and earn a steal ... 9/2 vs. Bucknell - Came off the bench and had a goal and three assists. Surrendered a 5M ... 9/3 vs. George Washington - Came off the bench and surrendered two kickouts ... 9/3 vs. Johns Hopkins - Came off the bench and earned two steals ... 9/16 vs. USC - Came off the bench and had two attempts ... 9/16 vs. UC Santa Barbara - Came off the bench and surrendered one kickout ... 9/17 vs. Princeton - Came off the bench and had one attempt ... 9/17 vs. Long Beach State - Came off the bench and surrendered two kickouts ... 9/23 vs. Redlands - Came off the bench and made one attempt ... 9/23 vs. Claremont - Came off the bench, had a steal, drew one kickout and surrendered two ... 9/24 vs. Cal Lutheran - Came off the bench, had a steal and drew one kickout ... 9/24 vs. Whittier - Came off the bench, scored a goal in three attempts, notched an assist and drew one kickout ... 9/30 vs. Cal Baptist - Came off the bench and drew two kickouts ... 10/1 vs. UC Davis - Came off the bench and had two attempts ... 10/6 vs. Chapman - Came off the bench and had one goal with two attempts. Notched two assists, one steal, and drew one 5M ... 10/6 vs. Occidental - Came off the bench and had one steal ... 10/7 vs. La Verne - Came off the bench and scored once on four attempts. Surrendered one kickout ... 10/7 vs. Pomona-Pitzer - Came off the bench and surrendered two kickouts ... 10/14 vs. UC Santa Cruz - Came off the bench, had one steal and surrendered a kickout ... 10/21 vs. Loyola Marymount - Came off the bench, made two attempts, had a steal and surrendered three kickouts ... 10/28 vs. UC Davis - Came off the bench, scored a goal in five attempts, notched an assist and surrendered one kickout ... 10/28 vs. UC San Diego - Came off the bench and had a steal ... 10/29 vs. Air Force - Came off the bench and scored a goal in two attempts ... 11/4 vs. UC Santa Cruz - Came off the bench, drew a 5M penalty and surrendered one kickout ... 11/5 vs. California - Came off the bench and notched an assist ... 11/11 vs. Pacific - Came off the bench, recorded one attempt and surrendered one kickout ... 11/12 vs. Stanford - Came off the bench, scored a goal in two attempts and surrendered one kickout ... WWPA Championships: 11/17 vs. Air Force - Came off the bench, recorded three attempts and had a steal ... 11/18 vs. UC San Diego - Came off the bench, recorded one attempt and surrendered one kickout ... 11/19 vs. UC Davis - Came off the bench, scored a goal in two attempts, notched an assist, had a steal and surrendered two kickouts., 35235=AS A FRESHMAN IN 2004-05: Appeared in 25 contests... scored 10 goals on the season and had five assists... scored in the season-opener against top-ranked Stanford... also netted a goal against No. 5 Pepperdine... posted a season-high two goals against No. 8 Chapman...tallied two assists and a goal against LaVerne at the Slugfest Tournament in Santa Cruz... had a season-high three steals against Navy at the Nor Cal Tournament...drew two kick outs, had a steal, an assist and a goal against No. 20 Cal Bapist... had another goal and steal against UC Santa Cruz at the Nor Cal Tournament... scored against both BYU-Hawaii and Air Force at the Aggie Shootout...drew a kick out and scored another goal against No. 13 UC Davis., 34889=AS A SOPHOMORE IN 2005-06: Appeared in all 32 contests... recorded 16 goals on the season, tied for fourth-highest on the team... totaled eight assists, six steals, and drew eight kickouts during the year... scored in 11 games, including multiple-goal contests on five occasions.  , 35997=HIGH SCHOOL: A 2004 graduate of St. Francis High School in Mountain View, Calif... played under coach Terry O'Donnell... also lettered in swimming and basketball... member of the Monogram Club., 29430=AS A SENIOR IN 2007-08: Named to the 1st Team All-WWPA ... 9/7 vs. Queens - Started and scored twice on two attempts ... 9/8 vs. George Washington - Started and scored one goal on three attempts while drawing a kickout ... 9/8 vs. Navy - Started but did not attempt a shot ... 9/9 vs. Princeton - Started and attempted one shot ... 9/9 vs. Gannon - Started and scored three goals on four attempts with a steal ... 9/15 vs. UCLA - Started and attempted three shots with an assist ... 9/15 vs. UC Davis - Started and attempted three shots while surrendering two kickouts ... 9/16 vs. Air Force - Started and scored once on three attempts while surrendering a kickout ... 9/16 vs. UC Santa Cruz - Started and scored two goals on three attempts with a steal and a kickout drawn ... 9/20 vs. Fordham - Started and attempted three shots, notched an assist, and surrendered two kickouts ... 9/22 vs. La Verne - Started and scored two goals on three attempts ... 9/22 vs. Redlands - Started and scored one goal on two attempts ... 9/23 vs. Claremont - Started and attempted one shot, notched an assit, and surrendered a kickout ... 9/23 vs. Whittier - Started and scored two goals on two attempts with a steal ... 9/29 vs. UC Davis - Started and scored one goal on four attempts with two steals ... 9/30 vs. UCLA - Started and attempted three shots and notched an assist ... 9/30 vs. Fresno Pacific - Started and scored two goals on two attempts ... 10/5 vs. Whittier - Started and attempted two shots with an assist, a steal, and a kickout ... 10/5 vs. Pomona - Started and scored once on two attempts with a steal and a kickout drawn ... 10/6 vs. Brown - Started and scored once on two attempts with an assist and a kickout drawn while surrendering two kickouts ... 10/6 vs. Cal Lutheran - Started and scored once on two attempts with a kickout drawn and a kickout surrendered ... 10/14 vs. UC Santa Cruz - Started and scored two goals on three shots with two kickouts drawn and one surrendered ... 10/26 vs. LMU - Started and scored two goals on four attempts with an assist, a steal, and two kickouts ... 10/28 vs. Cal - Started and scored one goal on one attempt ... 11/3 vs. UC Santa Cruz - Started and recored a field block ... 11/4 vs. UC Davis - Started and attempted five shots, notched a steal, a field block, and a kickout drawn ... 11/11 vs. Stanford - Started and attempted two shots with an assist, two field blocks, and a kickout surrendered ... 11/16 vs. Pomona (WWPA 1st round) - Started and scored once on four attempts with a kickout drawn and one surrendered ... 11/17 vs. LMU (WWPA semifinals) - Started and surrendered one kickout ... 11/18 vs. Air Force (WWPA 3rd place game) - Started and attempted one shot.}",
    "textBeforeTable": "  Kelly's Career Statistics PERSONAL: Parents are Tom and Katy Kelly... both parents attended Santa Clara... has an older sister, Liz and younger brother, Johnny... enjoys music and playing the guitar... major is undecided HIGH SCHOOL: A 2004 graduate of St. Francis High School in Mountain View, Calif... played under coach Terry O'Donnell... also lettered in swimming and basketball... member of the Monogram Club. AS A FRESHMAN IN 2004-05: Appeared in 25 contests... scored 10 goals on the season and had five assists... scored in the season-opener against top-ranked Stanford... also netted a goal against No. 5 Pepperdine... posted a season-high two goals against No. 8 Chapman...tallied two assists and a goal against LaVerne at the Slugfest Tournament in Santa Cruz... had a season-high three steals against Navy at the Nor Cal Tournament...drew two kick outs, had a steal, an assist and a goal against No. 20 Cal Bapist... had another goal and steal against UC Santa Cruz at the Nor Cal Tournament... scored against both BYU-Hawaii and Air Force at the Aggie Shootout...drew a kick out and scored another goal against No. 13 UC Davis. AS A SOPHOMORE IN 2005-06: Appeared in all 32 contests... recorded 16 goals on the season, tied for fourth-highest on the team... totaled eight assists, six steals, and drew eight kickouts during the year... scored in 11 games, including multiple-goal contests on five occasions.   AS A JUNIOR IN 2006-07: 9/2 vs. Navy - Came off the bench to notch one assist and",
    "textAfterTable": "  All Access Team Santa Clara Shop Winter Gear Virtual Guide Coaching For Life Sports Law",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}