{
    "relation": [
        [
            "Operating System",
            "Microsoft Windows 2000 Service Pack 4",
            "Microsoft Windows 2000 Service Pack 4",
            "Windows XP Service Pack 2",
            "Windows XP Professional x64 Edition and Windows XP Professional x64 Edition Service Pack 2",
            "Windows Server 2003 Service Pack 1",
            "Windows Server 2003 Service Pack 2",
            "Windows Server 2003 x64 Edition",
            "Windows Server 2003 x64 Edition Service Pack 2",
            "Windows Server 2003 with SP1 for Itanium-based Systems",
            "Windows Server 2003 with SP2 for Itanium-based Systems",
            "Windows Vista",
            "Windows Vista x64 Edition"
        ],
        [
            "Component",
            "Outlook Express 5.5 Service Pack 2",
            "Outlook Express 6 Service Pack 1",
            "Microsoft Outlook Express 6",
            "Microsoft Outlook Express 6",
            "Microsoft Outlook Express 6",
            "Microsoft Outlook Express 6",
            "Microsoft Outlook Express 6",
            "Microsoft Outlook Express 6",
            "Microsoft Outlook Express 6",
            "Microsoft Outlook Express 6",
            "Windows Mail",
            "Windows Mail"
        ],
        [
            "Maximum Security Impact",
            "Remote Code Execution",
            "Remote Code Execution",
            "Remote Code Execution",
            "Remote Code Execution",
            "Remote Code Execution",
            "Remote Code Execution",
            "Remote Code Execution",
            "Remote Code Execution",
            "Remote Code Execution",
            "Remote Code Execution",
            "Remote Code Execution",
            "Remote Code Execution"
        ],
        [
            "Severity Rating",
            "Critical",
            "Critical",
            "Critical",
            "Critical",
            "Critical",
            "Critical",
            "Critical",
            "Critical",
            "Critical",
            "Critical",
            "Important",
            "Important"
        ],
        [
            "Bulletins Replaced by This Update",
            "MS06-076",
            "MS06-076",
            "Not Applicable",
            "Not Applicable",
            "Not Applicable",
            "Not Applicable",
            "Not Applicable",
            "Not Applicable",
            "Not Applicable",
            "Not Applicable",
            "Not Applicable",
            "Not Applicable"
        ]
    ],
    "pageTitle": "Microsoft Security Bulletin MS07-056 - Critical",
    "title": "",
    "url": "https://technet.microsoft.com/library/security/ms07-056",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 0,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989142.82/warc/CC-MAIN-20150728002309-00139-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 890456627,
    "recordOffset": 890431814,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{10516=Published: October 09, 2007 | Updated: October 10, 2007, 3076=Why did Microsoft reissue this bulletin on October 10, 2007? Windows XP Professional x64 Edition has been added to the “Affected Software” section. This change only affects the bulletin text and does not affect the security update itself. Customers who have already installed this update will not need to reapply it. When initially published, existing detection and deployment tools (EST, MBSA 2.0.1, SMS 2.0 with EST and SMS 2003) correctly offered this package for Windows XP Professional x64 Edition.}",
    "TableContextTimeStampAfterTable": "{23481=Note for Windows VistaMicrosoft Systems Management Server 2003 with Service Pack 3 includes support for Windows Vista manageability., 19149=By using Windows Server Update Services (WSUS), administrators can deploy the latest critical updates and security updates for Windows 2000 operating systems and later, Office XP and later, Exchange Server 2003, and SQL Server 2000 to Windows 2000 and later operating systems. For more information about how to deploy this security update using Windows Server Update Services, visit the Windows Server Update Services., 36114=Note You can combine these switches into one command. For backward compatibility, the security update also supports many of the setup switches that the earlier version of the Setup program uses. For more information about the supported installation switches, see Microsoft Knowledge Base Article 262841. For more information about the Package installer, visit the Microsoft TechNet Web site., 72623=For all supported x64-based editions of Windows Server 2003 Service pack 1:, 21986=SMS 2.0 and SMS 2003 Software Update Services (SUS) Feature Pack can use MBSA 1.2.1 for detection and therefore have the same limitation listed earlier relating to programs that MBSA 1.2.1 does not detect., 73597=For all supported x64-based editions of Windows Server 2003 Service pack 2:, 70194=For all supported Itanium-based editions of Windows Server 2003 Service pack 1:, 3970=To view this vulnerability as a standard entry in the Common Vulnerabilities and Exposures list, see CVE-2007-3897., 69146=For all supported 32-bit editions of Windows Server 2003 Service pack 2:, 100590=Built at 2014-04-18T13:49:36Z-07:00, 71174=For all supported Itanium-based editions of Windows Server 2003 Service pack 2:, 22857=For SMS 2003, the SMS 2003 Inventory Tool for Microsoft Updates (ITMU) can be used by SMS to detect security updates that are offered by Microsoft Update and that are supported by Windows Server Update Services. For more information about the SMS 2003 ITMU, visit SMS 2003 Inventory Tool for Microsoft Updates. SMS 2003 can also use the Microsoft Office Inventory Tool to detect required updates for Microsoft Office applications., 68567=For all supported 32-bit editions of Windows Server 2003 Service pack 1:, 50761=For Outlook Express 5.5 Service Pack 2 on Windows 2000 Service pack 4:, 46322=For Outlook Express 6.0 Service Pack 1 on Windows 2000 Service pack 4:}",
    "textBeforeTable": "Affected Software The software listed here have been tested to determine which versions or editions are affected. Other versions or editions are either past their support life cycle or are not affected. To determine the support life cycle for your software version or edition, visit Microsoft Support Lifecycle. Affected and Non-Affected Software Known Issues. None Recommendation. Microsoft recommends that customers apply the update immediately. This security update removes the vulnerability by changing the newsgroup client to handle malformed responses correctly. For more information about the vulnerabilities, see the Frequently Asked Questions (FAQ) subsection for the specific vulnerability entry under the next section, Vulnerability Information. This is a critical security update for all supported versions of Microsoft Outlook express and Microsoft Windows Mail. For more information, see the subsection, Affected and Non-Affected Software, in this section. This critical security update resolves one privately reported vulnerability. The vulnerability could allow remote code execution due to an incorrectly handled malformed NNTP response. An attacker could exploit the vulnerability by constructing a specially crafted Web page. Executive Summary General Information Version: 2.0 Published: October 09, 2007 | Updated: October 10, 2007 Security Update for Outlook Express and Windows Mail (941202) Microsoft Security Bulletin MS07-056 - Critical",
    "textAfterTable": "Frequently Asked Questions (FAQ) Related to This Security Update Why did Microsoft reissue this bulletin on October 10, 2007? Windows XP Professional x64 Edition has been added to the “Affected Software” section. This change only affects the bulletin text and does not affect the security update itself. Customers who have already installed this update will not need to reapply it. When initially published, existing detection and deployment tools (EST, MBSA 2.0.1, SMS 2.0 with EST and SMS 2003) correctly offered this package for Windows XP Professional x64 Edition. I am using an older version or edition of the software discussed in this security bulletin. What should I do?  The affected software listed in this bulletin have been tested to determine which versions or editions are affected. Other versions or editions are past their support life cycle. To determine the support life cycle for your software versions or editions, visit Microsoft Support Lifecycle. It should be a priority for customers who have older versions or editions of the software to migrate to supported versions or editions to prevent potential exposure to vulnerabilities. For more information about the Windows Product Lifecycle, visit the following Microsoft Support Lifecycle. For more information about the extended security update support period for these software versions or editions, visit the Microsoft Product Support Services Web site. Customers who",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}