{
    "relation": [
        [
            "HSI data source",
            "AHS",
            "AISA (DUAL)",
            "APEX",
            "ARES",
            "AVIRIS",
            "CASI",
            "CHRIS",
            "HYPERION",
            "HYSPEX"
        ],
        [
            "Atmosphere",
            "0.62",
            "0.56",
            "0.70",
            "0.67",
            "0.57",
            "0.58",
            "0.70",
            "0.75",
            "0.69"
        ],
        [
            "Geology",
            "0.68",
            "0.55",
            "0.74",
            "0.75",
            "0.62",
            "0.60",
            "0.71",
            "0.77",
            "0.72"
        ],
        [
            "Landuse",
            "0.66",
            "0.54",
            "0.72",
            "0.72",
            "0.59",
            "0.57",
            "0.72",
            "0.78",
            "0.68"
        ],
        [
            "Limnology",
            "0.66",
            "0.55",
            "0.78",
            "0.74",
            "0.61",
            "0.59",
            "0.74",
            "0.78",
            "0.72"
        ],
        [
            "Vegetation",
            "0.70",
            "0.56",
            "0.76",
            "0.75",
            "0.62",
            "0.60",
            "0.72",
            "0.78",
            "0.72"
        ],
        [
            "Mean",
            "0.66",
            "0.55",
            "0.74",
            "0.73",
            "0.60",
            "0.59",
            "0.72",
            "0.78",
            "0.71"
        ]
    ],
    "pageTitle": "Introduction",
    "title": "",
    "url": "http://www.mdpi.com/1424-8220/7/8/1545/xml",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 1,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989142.82/warc/CC-MAIN-20150728002309-00225-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 575145511,
    "recordOffset": 575130302,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{16066=The investigation was carried out under EC contract FP-6-2004-Infrastructure-6 No. 026194., 41409=The first HSI airborne instruments appeared in the 1980s and these instruments were particularly used in geology for the determination of minerals. A key early platform was the AVIRIS instrument, which was designed and operated at JPL/NASA starting its pathfinder function for hyperspectral applications in 1989. A decade later, around 2000/01, the first civilian high-ground-resolution spaceborne hyper spectral sensors were launched on NASA's EO-1 and ESA's PROBA platform. The HSI sensors onboard these pathfinder missions are called HYPERION and CHRIS, and are still delivering important information for scientists in many fields around the world. Since then several national and international initiatives have been proposed to allow fully operational missions for systematic measurement of spectral signatures with reasonable spectral, radiometric, spatial and temporal resolution., 45731=User-driven requirements for remote sensing data are difficult to define, especially details on geometric, spectral and radiometric parameters. Even more difficult is a decent assessment of the required degrees of processing and corresponding data quality. It is therefore a real challenge to appropriately assess data costs and services to be provided. In 2006, the HYRESSA project was initiated within the framework 6 programme of the European Commission to analyze the user needs of the hyperspectral remote sensing community. Special focus was given to finding an answer to the key question, “What are the individual user requirements for hyperspectral imagery and its related data products?”. A Value-Benefit Analysis (VBA) was performed to retrieve user needs and address open items accordingly. The VBA is an established tool for systematic problem solving by supporting the possibility of comparing competing projects or solutions. It enables evaluation on the basis of a multidimensional objective model and can be augmented with expert's preferences. After undergoing a VBA, the scaling method (e.g., Law of Comparative Judgment) was applied for achieving the desired ranking judgments. The result, which is the relative value of projects with respect to a well-defined main objective, can therefore be produced analytically using a VBA. A multidimensional objective model adhering to VBA methodology was established. Thereafter, end users and experts were requested to fill out a Questionnaire of User Needs (QUN) at the highest level of detail - the value indicator level. The end user was additionally requested to report personal preferences for his particular research field. In the end, results from the experts' evaluation and results from a sensor data survey can be compared in order to understand user needs and the drawbacks of existing data products. The investigation – focusing on the needs of the hyperspectral user community in Europe – showed that a VBA is a suitable method for analyzing the needs of hyperspectral data users and supporting the sensor/data specification-building process. The VBA has the advantage of being easy to handle, resulting in a comprehensive evaluation. The primary disadvantage is the large effort in realizing such an analysis because the level of detail is extremely high., 48958=In conclusion, the absolute values in Table 4 show that the required spectral resolution in the VNIR ranges between 0.05 and 30 nm, in the SWIR between 0.2 and 40 nm and in the MIR/TIR from 4 to 400 nm. The table also shows that the required spectral resolution for the application geology is much higher than for all other applications (except of the atmospheric group). The spatial resolution is expected to be between 4 and 20 meters in the VNIR and SWIR and between 10 and 30 meters in the MIR and TIR for all applications but atmosphere. The requirements for vegetation and geology are very similar, asking for a SNR of 400-500 in the VNIR. In contrast limnological and atmospheric applications need higher SNR values of 700 and 1500.}",
    "lastModified": "Thu, 14 May 2015 09:25:34 GMT",
    "textBeforeTable": "Specifications and key design parameters for current and future HSI instruments and programmes. Table 1. Relative importance of spectral ranges for different HSI data users. Figure 4. Researchers' country of origin presented as table or as pie chart. Figure 3. Objective model for satellite and airborne HSI data. Figure 2. The methodology of Value-Benefit Analysis (VBA) applied on hyperspectral data. Figure 1. Figures and Tables 246 239 I 1999 Ottawa, CA 4th Int. Airb. R. S. Conf. and Exh. ERIM AISA as a Tool for Timely Commercial Remote Sensing O. Weatherbee L. Watson R. Bärs 15. 163 152 1937 1993 SPIE Compact airborne spectrographic imager (CASI): a progress review C.D. Anger S.K. Babey 14. 2005 Warsaw, Poland Proceedings of the 4th EARSeL Workshop on Imaging Spectroscopy – New Quality in Environmental Studies ASI",
    "textAfterTable": "0.4-2.5 8-12 30-125 64-100 65° 2 mrad APEX [RUAG, ESA/CH/BE] from 2008 313-500 0.4 - 2.5 1000-277 28° 0.5 mrad Spaceborne HIS HYPERION [TRW, NASA] 2000 200 0.4 - 2.5 40-250 0.6° 0.04 mrad CHRIS [SIRA, ESA] 2001 19-62 0.4 - 1.0 200-90 1.2° 0.08 mrad EnMAP [Keyser Threde, GFZ, DLR, DE] from 2010 220 0.43 - 2.5 40-250 2.7° 0.04 mrad Table 2. Resulting overall relative values for different sensors and applications. HSI data source Atmosphere Geology Landuse Limnology Vegetation Mean AHS 0.62 0.68 0.66 0.66 0.70 0.66 AISA (DUAL) 0.56 0.55 0.54 0.55 0.56 0.55 APEX 0.70 0.74",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}