{
    "relation": [
        [
            "Accessories",
            "Case",
            "Screen Protector",
            "",
            "",
            "",
            "",
            ""
        ],
        [
            "Camera",
            "8.0 MP",
            "Camera Flash",
            "Video Camera",
            "",
            "",
            "",
            ""
        ],
        [
            "Connectivity",
            "Bluetooth",
            "Mobile Hotspot",
            "PC Sync",
            "USB",
            "Wifi",
            "",
            ""
        ],
        [
            "Data",
            "A-Gps",
            "Airplane Mode",
            "EVDO",
            "LBS GPS",
            "Tethering",
            "WAP",
            "WiMax"
        ],
        [
            "Display",
            "Color",
            "Touch Screen",
            "",
            "",
            "",
            "",
            ""
        ],
        [
            "General",
            "Alarm",
            "Calculator",
            "Calendar",
            "MP3 Ringtones",
            "Picture ID",
            "Ringer ID",
            "Vibrate"
        ],
        [
            "Input",
            "Side Keys",
            "",
            "",
            "",
            "",
            "",
            ""
        ]
    ],
    "pageTitle": "Motorola Photon 4G Bluetooth Android PDA Phone Sprint - Good Condition : Used Cell Phones, Cheap Sprint PCS Cell Phones, Used Sprint PCS Phones : Cellular Country",
    "title": "",
    "url": "http://www.cellularcountry.com/used-cell-phones/motorola/motorola-photon-4g-bluetooth-android-pda-phone-sprint-p-8491",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 1,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042991019.80/warc/CC-MAIN-20150728002311-00327-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 363293543,
    "recordOffset": 363277944,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{32948=Copyright @ Cellular Country 2015}",
    "textBeforeTable": "*4G LTE models may require LTE sim card, which is not included but will be provided by your carrier. Data plan may be required for use. This phone is guaranteed to work with your active Sprint PCS plan. There is no contract required. When you receive the phone, simply call your current carrier, activate this phone and start using it! 4G LTE models may require LTE sim card, which is not included but will be provided by your carrier. The Motorola PHOTON 4G is an Android 2.3 (Gingerbread) platform based smartphone, which lets you access the latest applications. Capture clear and bright images and videos with the 8-megapixel flash camera of this Motorola smartphone. Relish on-air music and get live updates with the FM radio and the Internet radio feature of this Motorola Android mobile. Stay connected with your colleagues, friends, and family, via the e-mail and IM feature of the Motorola PHOTON 4G smartphone. Surf the web from any Wi-Fi enabled spot, as this Motorola Sprint smartphone is Wi-Fi friendly. Integrated with a 1 GHz dual core processor, this Motorola Android mobile delivers optimum performance. Incorporating the Corning Gorilla glass and dual anti-reflective display, the Motorola PHOTON 4G smartphone is resistant to scratches and provides reflection-free images. Phone Specifications Read Reviews Package Contents Condition Features",
    "textAfterTable": "  Messaging Multimedia Operating System Screen Smartphone Sound Storage Card Email FM Radio Android Capacitive Smartphone 3.5 mm Headphone Slot MicroSD Instant Messaging HDMI-Out Mobile Hotspot Airplane Mode Touch Screen Hearing Aid Compatible MMS Music Player PC Sync EVDO Speakerphone Text Messaging Tv-Out USB LBS GPS Voice-Activated Dialing Video Wifi Tethering Picture ID   Technology Type CDMA Bar GSM Quad-Band Smartphone (PDA Phone)   Phone Condition Phone is 100% functional and works just like a new phone. Phone is in Good cosmetic condition Package",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}