{
    "relation": [
        [
            "Priority",
            "1",
            "2",
            "2",
            "3",
            "3"
        ],
        [
            "Deadline",
            "none",
            "none",
            "2014-01-25 (542 days ago days from now)",
            "none",
            "none"
        ],
        [
            "Task",
            "Buy this UPS: (link)",
            "create new membership application with new rules",
            "Buy all the equipment necessary for Buildfest.",
            "Design new LUG t-shirt",
            "Get another ethernet switch with >= 8 ports"
        ],
        [
            "Assigned to",
            "nobody",
            "Troy",
            "nobody",
            "nobody",
            "nobody"
        ],
        [
            "Progress",
            "none",
            "git repo",
            "none",
            "fork old shirt",
            "none"
        ]
    ],
    "pageTitle": "Difference between revisions of \"Main Page\" - Wiki | LUG@UCLA",
    "title": "",
    "url": "https://linux.ucla.edu/w/index.php?title=Main_Page&diff=1467&oldid=1465",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 2,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042982013.25/warc/CC-MAIN-20150728002302-00007-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 865792315,
    "recordOffset": 865784113,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "General Tasks:  Note: Please assign yourself to any task you are willing to pursue Tasks UCLA on OpenStreetMap Giveaway Donate TODO Logos Big Brother Tux Other External links Encryption Backups Tor (anonymity network) Off-the-Record Messaging (OTR) Pretty Good Privacy (PGP) Combating Internet Surveillance Virtual private network (VPN) Desktop Environments (DE) Which Linux? Getting started What is Linux? Linux, GNU, et al. Etherpad Pastebin ownCloud Git repositories Internet Relay Chat (IRC) Mailing lists Secure Shell (SSH)",
    "textAfterTable": "Administrative Tasks: Priority Deadline Task Assigned to Progress 1 none add LDAP support to wiki and ZNC Troy none 2 none improve database backup script to also dump postgresql Troy git repo 2 none move email address in LDAP gecos field (if it exists) to mail field nobody none 2 2014-02-06 (537 days ago days from now) setup Puppet master, manifests, mcollective Matt none 2 2014-02-06 (537 days ago days from now) upgrade ownCloud to version 6, add SSL in the process Matt none 2 2014-02-06 (537 days ago days from now) write django view that renders the upcoming events and calendar. nobody git repo 3 none migrate from gitolite 2 to gitolite 3 in wheezy-backports Troy none 3 2014-04-12 (472 days ago days from now) contact CS department to",
    "hasKeyColumn": true,
    "keyColumnIndex": 2,
    "headerRowIndex": 0
}