{
    "relation": [
        [
            "Analytes",
            "Amphetamine and/or methamphetamine",
            "Barbituates",
            "Benzodiazepins",
            "Cannabinoids",
            "Cocaine",
            "Methadone",
            "Opiates",
            "PCP",
            "Tricyclics"
        ],
        [
            "Cutoff (EMIT II)",
            "1000 ng/mL",
            "200 ng/mL 300 ng/mL",
            "200 ng/mL 300 ng/mL",
            "20 ng/mL 50 ng/mL 100 ng/mL",
            "150 ng/mL 300 ng/mL",
            "150 ng/mL 300 ng/mL",
            "300 ng/mL 2000 ng/mL",
            "25 ng/mL",
            "n/a"
        ],
        [
            "EMIT II (Syva)",
            "Ranitidine Chlorpromazine* Bupropion*",
            "",
            "Oxaprozin",
            "",
            "",
            "",
            "Ofloxacin Levofloxacin",
            "Dextromethorphan Destrophan Mesoridazine",
            ""
        ],
        [
            "Cutoff (Triage)",
            "1000 ng/mL",
            "300 ng/mL",
            "300 ng/mL",
            "50 ng/mL",
            "300 ng/mL",
            "n/a",
            "300 ng/mL",
            "25 ng/mL",
            "300 ng/mL 1000 ng/mL"
        ],
        [
            "Triage (Biosite)",
            "",
            "",
            "",
            "Pantoprazole",
            "",
            "",
            "",
            "",
            "Cyclobenzaprine"
        ]
    ],
    "pageTitle": "College of American Pathologists - False-Positive Urine Drug Screens: What Clinicians Should Know and When the Laboratory Should Be Consulted",
    "title": "",
    "url": "http://www.cap.org/apps/cap.portal?_nfpb=true&cntvwrPtlt_actionOverride=%2Fportlets%2FcontentViewer%2Fshow&_windowLabel=cntvwrPtlt&cntvwrPtlt%7BactionForm.contentReference%7D=newspath%2F0601%2F0601_NewsPath-UDS_False_Positives.htm&_state=maximized&_pageLabel=cntvwr",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 7,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042991019.80/warc/CC-MAIN-20150728002311-00111-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 349405101,
    "recordOffset": 349396899,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{13582=NewsPath® Editor: Megan J. DiFurio, MD, FCAP This newsletter is produced in cooperation with the College of American Pathologists Public Affairs Committee and may be reproduced in whole or in part as a service to the medical community. Copyright © 2006 by the College of American Pathologists. Please e-mail any comments to newspath@cap.org., 1757=   Posted January 26, 2006}",
    "textBeforeTable": "False-Positive Urine Drug Screens: What Clinicians Should Know and When the Laboratory Should Be Consulted Stacy E.F. Melanson, MD, PhD, FCAP Barbarajean Magnani , MD, PhD, FCAP College of American Pathologists Toxicology Resource Committee Urine drug screens (UDS) are frequently ordered on patients who exhibit symptoms of intoxication, experience trauma or offer a history of drug ingestion.1 Rapid and accurate results are critical to manage patients effectively; however, inconsistencies between the laboratory results and the clinical picture may be present. Consider the following scenarios: (1) A 60-year-old male tests positive for urine amphetamine, but adamantly denies amphetamine use and (2) an 80-year-old woman from a nursing home tests positive for urine opiates, but her list of medications does not include opioids. How should these scenarios be handled? Clinicians should understand what urine drug screens are designed to detect, which compounds can cross-react and when to refer to the laboratory for further testing or clarification. Immunoassays for UDS are automated and offer rapid turnaround times.1,2 The common drugs or classes of drugs in the UDS include amphetamines, barbiturates, benzodiazepines, cannabinoids, cocaine metabolite, methadone, opiates, phencyclidine and tricyclic antidepressants. Several different immunoassay techniques and platforms are available.3 Depending on the assay, an antibody is designed to detect a specific class of compounds (i.e. barbiturates), a parent drug (i.e. methadone) or a metabolite",
    "textAfterTable": "Table: Possible Interferents in Two Common Urine Drug of Abuse Assays. The calibrator cutoff options for both the EMIT II plus and the Triage are listed. Note that the medications listed above are potential interferents and will not cross-react in all patients. Results must be interpreted in conjunction with the clinical impression result and confirmatory testing results. *In some instances, a metabolite, not the parent compound, is causing interference. Scenario 1 (Answer): The 60-year-old male was taking ranitidine for his gastroesophageal reflux disease, which cross-reacts in the EMIT amphetamine assay. Scenario 2 (Answer): The 80-year-old woman was prescribed levofloxacin for pneumonia, which interferes with the EMIT opiate assay. References Hammett-Stabler CA , Pesce AJ, Cannon DJ. Urine drug screening in the medical setting. Clin Chim Acta. 2002;315:125-135. Colbert DL. Drug abuse screening with immunoassays: unexpected cross-reactivity and other pitfalls. Br J Biomed Sci. 1994;51:136-146. Magnani B. Concentrations of compounds that produce positive results. In: Shaw LM, Kwong TC, Rosano TG, Orsulak PJ, Wolf BA, Magnani B, eds. The Clinical Toxicology Laboratory: Contemporary Practice of Poisoning Evaluation. Washington , DC : AACC Press; 2001:481-498. Product Information EMIT II Assay. Syva Company, San Jose , Calif. Product Information Triage Drugs of Abuse Panel. Biosite Inc., San Diego , Calif. Smith-Kielland A, Olsen KM, Christopherson",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}