{
    "relation": [
        [
            "Date",
            "Feb 8",
            "Feb 22",
            "Feb 23",
            "Mar 1",
            "Mar 8",
            "Mar 11",
            "Mar 15",
            "Mar 22",
            "Mar 24",
            "Mar 29",
            "Apr 1",
            "Apr 5",
            "Apr 9",
            "Apr 12",
            "Apr 19",
            "Apr 25"
        ],
        [
            "Opponent",
            "Connecticut",
            "Iona",
            "Sacred Heart",
            "at Columbia",
            "Princeton",
            "at Holy Cross",
            "Central Conn. St.",
            "at Colorado",
            "at Denver",
            "Dartmouth",
            "at Bryant",
            "at Harvard",
            "Michigan",
            "Cornell",
            "at Penn",
            "at Yale"
        ],
        [
            "Score",
            "",
            "W, 17-4",
            "W, 19-6",
            "W, 9-6",
            "W, 14-13",
            "W, 9-6",
            "W, 21-9",
            "W, 11-8",
            "L, 9-8",
            "L, 10-9",
            "W, 15-7",
            "L, 10-4",
            "W, 19-10",
            "L, 11-10",
            "L, 12-6",
            "L, 9-8"
        ],
        [
            "g",
            "-",
            "2",
            "3",
            "4",
            "3",
            "3",
            "5",
            "4",
            "0",
            "3",
            "3",
            "0",
            "4",
            "2",
            "2",
            "2"
        ],
        [
            "a",
            "-",
            "1",
            "1",
            "1",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "2",
            "0",
            "0",
            "0",
            "0",
            "1"
        ],
        [
            "pts",
            "-",
            "3",
            "4",
            "5",
            "3",
            "3",
            "5",
            "4",
            "1",
            "3",
            "5",
            "0",
            "4",
            "2",
            "2",
            "3"
        ],
        [
            "fpg-fps",
            "-",
            "0-0",
            "0-0",
            "0-1",
            "0-0",
            "2-2",
            "1-1",
            "1-2",
            "0-0",
            "0-0",
            "0-2",
            "0-1",
            "0-0",
            "1-1",
            "1-3",
            "0-0"
        ],
        [
            "gb",
            "-",
            "0",
            "2",
            "3",
            "3",
            "0",
            "1",
            "2",
            "0",
            "2",
            "0",
            "1",
            "2",
            "1",
            "0",
            "2"
        ],
        [
            "dc",
            "-",
            "6",
            "3",
            "4",
            "5",
            "3",
            "8",
            "3",
            "3",
            "1",
            "4",
            "2",
            "4",
            "3",
            "3",
            "2"
        ],
        [
            "to",
            "-",
            "2",
            "2",
            "2",
            "3",
            "5",
            "0",
            "1",
            "0",
            "2",
            "0",
            "3",
            "1",
            "2",
            "3",
            "2"
        ],
        [
            "ct",
            "-",
            "0",
            "1",
            "1",
            "2",
            "0",
            "0",
            "2",
            "1",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "2"
        ],
        [
            "sh",
            "-",
            "4",
            "4",
            "7",
            "6",
            "5",
            "6",
            "6",
            "4",
            "7",
            "9",
            "3",
            "6",
            "4",
            "6",
            "2"
        ],
        [
            "sh%",
            "-",
            "50.0",
            "75.0",
            "57.1",
            "50.0",
            "60.0",
            "83.3",
            "66.7",
            "0.0",
            "42.9",
            "33.3",
            "0.0",
            "66.7",
            "50.0",
            "33.3",
            "100.0"
        ],
        [
            "sog",
            "-",
            "2",
            "3",
            "6",
            "3",
            "3",
            "5",
            "5",
            "3",
            "4",
            "5",
            "2",
            "6",
            "3",
            "4",
            "2"
        ],
        [
            "sog%",
            "-",
            "50.0",
            "75.0",
            "85.7",
            "50.0",
            "60.0",
            "83.3",
            "83.3",
            "75.0",
            "57.1",
            "55.6",
            "66.7",
            "100.0",
            "75.0",
            "66.7",
            "100.0"
        ]
    ],
    "pageTitle": "Bre Hudgins - Brown",
    "title": "",
    "url": "http://www.brownbears.com/sports/w-lacros/2013-14/bios/hudgins_bre_8ftj?view=bio",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 4,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988598.68/warc/CC-MAIN-20150728002308-00025-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 343450204,
    "recordOffset": 343431313,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{22717=Enters her senior season ranked 10th all-time at Brown with 121 career points, ninth all-time with 97 career goals, and 16th all-time with 24 career assists … She is also fourth all-time at Brown with 98 career draw controls … 2013: Named First Team All-Ivy and Second Team IWLCA Northeast All-Region … Started all 15 games … Finished as the team’s leading scorer with 49 points (37g, 12a), which ranks 10th all-time at Brown for points in a season … Her 37 goals rank sixth all-time at Brown for goals in a season, tying the mark she set as a freshman in 2011 … Was fourth in the Ivy League with three game-winning goals … Ranked sixth in the Ivy League and 68th in the nation with 2.4 goals per game … Ranked eighth in the Ivy League with 3.20 points per game and 10th in the Ivy League with 0.80 assists per game … Was also second on the team with 51 draw controls, second all-time at Brown … Ranked  37th in the nation with 3.4 draw controls per game … Scored at least one goal in all 15 games and had 11 multi-goal outings, scoring a season-high five goals in the 11-10 triple overtime win over Columbia … Also scored four goals against both George Mason and Princeton … Recorded hat tricks against Southern California, St. Mary’s, Harvard and Yale … Earned a career-high seven points and a career-high three assists against the Patriots … Had at least one draw control in every single game, winning a season-high six against both Columbia and Holy Cross, while matching her career-high, and five against Boston College … 2012: Started all 14 games … Finished second on the team in both points (29) and goals (23) … Tallied at least one point in 13 of Brown’s 14 games and scored at least one goal in 12 of 14 games … Had nine multi-point games and seven multi-goal games … Scored a season-high for goals and points (4) in win over Quinnipiac … Netted the game-winning goal at Manhattan … Had a season-high three ground balls at Columbia … Earned a season-high three draw controls against both Ohio State and Yale … 2011: Named Second Team All-Ivy at the conclusion of the season, one of just three rookies in the Ivy League to earn All-Ivy honors … Started all 15 games and finished the year ranked second on the team with 43 points and first on the team with 37 goals, 6th all-time at Brown and a Brown record for goals in a season by a freshman … Her 43 points is also second-highest point total for a Brown rookie and was the highest since 1982 … Was third on the team with 26 draw controls, including a career-high six against St. Mary’s … Also added 15 ground balls and six caused turnovers … Ranked fifth in the Ivy League in goals per game (2.47) and eighth in the League in points per game (2.87) … Scored at least one goal in 13 of 15 games, including 10 multiple-goal games … Scored a career-high six goals against both Quinnipiac and St. Mary’s … Had five against Sacred Heart and four goals and two assists against #3 Duke … Before Brown: A three-year starter for the lacrosse team at West Genesee, Hudgins helped to lead West Genesee to a NY State Championship in 2008 and three Section Championships (2008, 2009, 2010) … Team captain as a senior … An All-American in 2010, Hudgins earned Honorable Mention All-American honors in 2009 … Named First Team All-League in 2009, after earning Second Team All-League honors in 2008 … Named to the All-Central New York Team in 2009 and Central New York Player of the Year in 2010 … An Under Armor All-American in 2010, Hudgins had the assist on the game-winning goal as the North Team defeated the South Team, 17-16 … Member of National Honor Society, Class Senate, and High Honor Roll student at West Genesee … Personal: The daughter of Nelson and Debbie Hudgins, Bre has two brothers, Marcus and Nelson, and one sister, Marissa … Concentrating in Psychology., 61892=Brown University Athletics | 235 Hope St. Box 1932 | Providence, RI 02912}",
    "textBeforeTable": "Bre Hudgins 11 11 Related Bios Sarah Bell Abby Bunting Lucinda Caldwell Julia Carrellas Riley Christopher Rebecca Dahle Marissa Dale Alyssa DiBona Maeve Flaherty Whitney Flynn Natalie Fox Janie Gion Grace Healy Victoria Holland Kerianne Hunt Ali Kim Mollie Lane Arianna Lanpher Jillian Lee Danielle Mastro Sarah Nesi Meghan O'Brien Hanna Organschi Sarah Peters Kellie Roddy Erin Roos Elizabeth Saltonstall Lauren Toy Abbey Van Horne Dianne Vitkus Richael Walsh Carolyn Westphal   Live Stats Watch Listen Pinterest YouTube Twitter Facebook Archives  |  News  |  Statistics  |  Schedule  |  Coaches  |  Roster  |  Home",
    "textAfterTable": "- - - - - - - - - Feb 22 Iona W, 17-4 2 1 3 0-0 0 6 2 0 4 50.0 2 50.0 Feb 23 Sacred Heart W, 19-6 3 1 4 0-0 2 3 2 1 4 75.0 3 75.0 Mar 1 at Columbia W, 9-6 4 1 5 0-1 3 4 2 1 7 57.1 6 85.7 Mar 8 Princeton W, 14-13 3 0 3 0-0 3 5 3 2 6 50.0 3 50.0 Mar 11 at Holy Cross W, 9-6 3 0 3 2-2 0 3 5 0 5 60.0 3 60.0 Mar 15 Central Conn. St. W, 21-9 5 0 5 1-1 1 8 0 0 6 83.3 5 83.3 Mar 22 at Colorado W, 11-8 4 0 4 1-2 2 3 1 2 6 66.7 5 83.3 Mar 24 at Denver L, 9-8 0 1 1 0-0 0 3 0 1 4 0.0 3 75.0 Mar 29 Dartmouth L, 10-9 3 0",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}