{
    "relation": [
        [
            "Participant No.",
            "01 \"Suzanne\"",
            "02 \"Grace\"",
            "03 \"Tito\"",
            "04 \"Dan\"",
            "05 \"Seamus\"",
            "06 \"Saurab\"",
            "07 \"Gene\"",
            "08 \"Claudia\"",
            "09 \"Galen\"",
            "10 \"Nikki\""
        ],
        [
            "Age",
            "50 (45–54)",
            "24 (18–34)",
            "21 (18–34)",
            "41 (35–44)",
            "43 (35–44)",
            "28 (18–34)",
            "64 (55–64)",
            "64 (55–64)",
            "24 (18–34)",
            "16 (Under 18)"
        ],
        [
            "Gender",
            "Female",
            "Female",
            "Male",
            "Male",
            "Male",
            "Male",
            "Male",
            "Female",
            "Female",
            "Female"
        ],
        [
            "Wikipedia Editing History",
            "Has not contributed, but is willing to. Has account.",
            "Has not contributed, but is willing to.",
            "Has not contributed, but is willing to.",
            "Has not contributed, but is willing to. Has account.",
            "Has not contributed, but is willing to.",
            "Has not contributed, but is willing to. Has account.",
            "Has not contributed, and is NOT willing to.",
            "Had edited fewer than 5 entries. Has account.",
            "Has not contributed, but is willing to.",
            "Has not contributed to Wikipedia, but has to other Wikis."
        ],
        [
            "Wikipedia Usage",
            "Every day",
            "Every day",
            "Every day",
            "Every day",
            "More than once a week",
            "More than once a week",
            "Every day",
            "Every day",
            "More than once a week",
            "Every day"
        ],
        [
            "Occupation",
            "Paralegal.",
            "Medical Student.",
            "College Student and Video Producer.",
            "Programmer",
            "Controller for a non-profit",
            "Retail Software Developer",
            "Retired Public Transit worker",
            "Database administrator",
            "Costumer",
            "High School Student"
        ],
        [
            "Other Info",
            "Was checking a reference.",
            "Was looking up diseases.",
            "Was researching corporate videos.",
            "Was reading about DVI and HDMI interface info.",
            "Was researching for a presentation.",
            "Was reading about supply chain processes.",
            "Researching.",
            "Looking up Frank Loesser",
            "Was finding out about Americans of German descent.",
            "Was looking up a TV Series."
        ],
        [
            "Location",
            "San Francisco, CA",
            "San Francisco, CA",
            "San Francisco, CA",
            "San Francisco, CA",
            "San Francisco, CA",
            "San Francisco, CA",
            "San Francisco, CA",
            "San Francisco, CA",
            "Oakland, CA",
            "San Francisco, CA"
        ]
    ],
    "pageTitle": "Usability and Experience Study - Wikimedia Usability Initiative",
    "title": "",
    "url": "https://usability.m.wikimedia.org/w/index.php?title=Usability_and_Experience_Study&mobileaction=toggle_view_mobile",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 1,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988598.68/warc/CC-MAIN-20150728002308-00071-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 888248639,
    "recordOffset": 888227255,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{3284=The Wikimedia Usability Initiative Team partnered with Bolt Peters, a San Francisco, California, user experience consulting firm, to conduct both in-person lab and remote interviews and studies of the general Wikipedia experience, with focus on the editing experience, process, and its successes and failures. The study consisted of 15 one-on-one interviews, each lasting between 45 and 60 minutes. 10 of these interviews were conducted in person at a lab facility and 5 were conducted remotely from the Wikipedia Usability Office. The interviews were conducted in late March 2009 in San Francisco, CA.}",
    "TableContextTimeStampAfterTable": "{45580=Most users said they had ‘thought about’ editing Wikipedia, but never done it because of laziness or lack of time. The few who had edited had made only minor changes to sentences (fixing typos or grammar, etc.) Users mentioned as they tried to edit that they would need ‘more time’ to learn how to do what it was they were attempting, because they didn’t understand Wiki-markup, and it wasn’t immediately obvious what they needed to do. Users also expressed concern that the content they were adding was ‘correct’—in terms of content appropriateness, accuracy, and formatting., 38931=\"I would correct people's grammar errors, subject verb agreement\" -- Gene, 64, Retired Public Transit worker, 25992=Users' word processing skills translated to the task of editing text in Wikipedia so that all the users we spoke to, including the technically uninitiated, were able to identify and make changes to the content text (as opposed to the wiki markup syntax) on Wikipedia. The changes users were able to make included correcting typos and grammar, adding words and sentences, copying and pasting, and formatting text (with bold and italics). The ease of editing around wiki markup drastically decreased as the complexity of the article increased—most notably when articles started with large infoboxes, templates, and other syntax-heavy elements.}",
    "lastModified": "Wed, 01 Jul 2015 07:44:14 GMT",
    "textBeforeTable": "Lab Testing Study Participants Screenshot of Survey Gratitude Screenshot of Ethnio screener invitation Screenshot of Ethnio recruit survey Based on these criteria, the 2,500 users who responded to our survey were filtered down to 500 viable subjects based on their answers to these questions. The team, along with B|P, partnered with Davis Recruiting to contact, filter, and screen these 500 participants based on their Wikipedia contribution history, Wikipedia usage patterns, their given reasons for not contributing, and their talkativeness and openness to discuss their thoughts and actions. From 2,500 users, we ended up with 10 study participants and 3–5 waitlisted participants. We recruited over 2,500 San Francisco residents for the in person testing. A banner/alert was placed and displayed at the top of every 1 in 100 Wikipedia pages for the duration of 8",
    "textAfterTable": "Remote Testing Participant No. Age Gender Wikipedia Editing History Wikipedia Usage Tech Savvy Other Info Location 01 \"Lisa\" (55–64) Female Has not edited, but is willing to More than once a week 2: Uses computer to access internet and email apps. Research Eureka, CA 02 \"Shaun\" (18–24) Male Has not edited, but is willing to. Every day 3: uploads and downloads files from internet and devices Research Rexburg, ID 03 \"Jerry\" (25–34) Male Has not edited, but is willing to. Every day 2: Uses computer to access internet and email apps. Reading about the history of New York New York, NY 04 \"Bryan\" (25–34) Male Has not edited, but is willing to. More than once a week 3: uploads and downloads files from internet and devices Researching psychology concepts Apex, North Carolina 05 \"Carrie\" (18–24) Female Has edited fewer than 25 entries Every day 3: uploads and downloads files from internet and devices Looking up information Bayside, NY Scripting The moderator script was drafted by the Wikipedia Usability Team, B|P, and the Wikimedia Foundation, and an almost identical script was used for the lab subjects and the remote subjects, the discrepancies being entirely related to the difference in set up. The script aimed to see how users would attempt to and feel about a collection of tasks or objectives that first time and early",
    "hasKeyColumn": true,
    "keyColumnIndex": 5,
    "headerRowIndex": 0
}