{
    "relation": [
        [
            "S",
            "",
            "2",
            "9",
            "16",
            "23",
            "30"
        ],
        [
            "M",
            "",
            "3",
            "10",
            "17",
            "24",
            "31"
        ],
        [
            "T",
            "",
            "4",
            "11",
            "18",
            "25",
            ""
        ],
        [
            "W",
            "",
            "5",
            "12",
            "19",
            "26",
            ""
        ],
        [
            "T",
            "",
            "6",
            "13",
            "20",
            "27",
            ""
        ],
        [
            "F",
            "",
            "7",
            "14",
            "21",
            "28",
            ""
        ],
        [
            "S",
            "1",
            "8",
            "15",
            "22",
            "29",
            ""
        ]
    ],
    "pageTitle": "H&S Funding Opportunities | Graduate and Undergraduate Studies",
    "title": "",
    "url": "https://web.stanford.edu/dept/humsci/cgi-bin/gus/content/current-funding",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 1,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042991019.80/warc/CC-MAIN-20150728002311-00310-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 879748054,
    "recordOffset": 879731660,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{21433=2014-15 Information Sessions:, 13353=The Graduate Research Opportunities Fund for Research on Modern British History and Culture (GRO-MBHC) will award humanities and social sciences doctoral students performing research on modern British history and culture grants of up to $5,000 for research expenses directly related to the dissertation. Expenses eligible for GRO-MBHC funding include, for example, travel for archival or field research, purchase of data sets and special analytical software, human-subject costs, and production of surveys. There are two application submission deadlines in November and April. Eligibility guidelines and the application for GRO-MBHC funds are available above. Applicants who do not receive a GRO-MBHC award will be considered for the GRO award. For more information, contact Ayodele Thomas (ayodele.thomas@stanford.edu)., 14247=The School of Humanities and Sciences has launched the Graduate Research Opportunities (GRO) initiative to award humanities and social sciences students grants of up to $5,000 for research expenses directly related to the dissertation. Expenses eligible for GRO funding include, for example, travel for archival or field research, purchase of data sets and special analytical software, human-subject costs, and production of surveys. There are two application submission deadlines in November and April. Eligibility guidelines and the application for graduate research opportunity funds are available above. For more information, contact Ayodele Thomas (ayodele.thomas@stanford.edu)., 20386=Deadline - April 15, 2015, 3980=With both a PhD and a STEP MA, you will be poised to become a master teacher combining subject expertise with an education background. You will join teachers leading the transformation of high school education in North America. Many STEP graduates are employed in the Bay area’s most innovative schools.    STEP applications from eligible PhDs students will be considered for the H-STEP Fellowship beginning in January 2015. Please see the program guidelines for more details on the application process.}",
    "lastModified": "Tue, 04 Aug 2015 16:40:56 GMT",
    "textBeforeTable": "»   August «   GUS Calendar Stanford University has been invited to nominate 10 international doctoral students for Howard Hughes Medical Institute-International Student Reseach Fellowships.  HHMI introduced this program five years ago and they again expect to make a total of approximately 50 awards, each will consist of three years of stipend support, plus partial tuition support.    Howard Hughes Medical Institute-International Student Research For more details about the Scholarship, visit the Trudeau Foundation Website: http://www.trudeaufoundation.ca/en/programs/scholarships/applications   Citizenship requirements:    -   Be a Canadian citizen or a foreign national at a Canadian university Be nominated by a university Present a research project linked to one of the four themes of the Foundation Each year, the Pierre Elliott Trudeau Foundation rewards outstanding doctoral candidates who are enrolled or about to be enrolled in a social sciences and humanities program and who are doing research in areas related to our four themes. This award, the most prestigious of its type in Canada, has continuously",
    "textAfterTable": "",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}