{
    "relation": [
        [
            "№ п/п",
            "1",
            "2",
            "3",
            "4",
            "5",
            "6",
            "7",
            "8",
            "9",
            "10",
            "11",
            "12"
        ],
        [
            "Наименование трека",
            "Claude Nobs Intro",
            "You Send Me",
            "You Don't Know What Love Is",
            "Don't Waste Your Time",
            "My Funny Valentine",
            "I Can Explain",
            "I'm Special",
            "Bye Bye Blackbird",
            "Prayer Dance",
            "With Every Breath I Take",
            "Me Voila Seul",
            "On Se Reveillera"
        ],
        [
            "Текст",
            "",
            "",
            "T",
            "T",
            "T",
            "",
            "",
            "T",
            "",
            "T",
            "",
            ""
        ],
        [
            "Длительность",
            "0:01:09",
            "0:05:18",
            "0:05:59",
            "0:05:01",
            "0:08:30",
            "0:08:03",
            "0:05:55",
            "0:04:34",
            "0:06:31",
            "0:08:41",
            "0:07:40",
            "0:09:54"
        ],
        [
            "Комментарий",
            "",
            "Cooke, Paul, Townsend",
            "DePaul, Raye",
            "Ferrell",
            "Hart, Rodgers",
            "Ferrell",
            "-\"-",
            "Dixon, Henderson",
            "Bailey, Green",
            "Coleman, Zippel",
            "Aznaourian, Garvarentz",
            "-\"-"
        ]
    ],
    "pageTitle": "Track List by 'Rachelle Ferrell - Live In Montreaux 91-97'",
    "title": "",
    "url": "http://www.mymusicbase.ru/PPS6/sd_6451.htm",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 3,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042982013.25/warc/CC-MAIN-20150728002302-00024-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 592213534,
    "recordOffset": 592205332,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{9890=вернуться        закрыть окно Последние изменения в документе сделаны 09/12/2014 19:44:10, 2070=Sweet as the prospect of a live Rachelle Ferrell compilation is, the album's title is a bit misleading. Fans expecting selections from seven years' worth of Montreux performances will be disappointed to discover that this is, in fact, a collection of nine tracks recorded in 1991 with a trio of \"bonus\" selections from the 1997 festival. Long-time Ferrell followers will recognize that much of the '91 material is replicated on her inaugural studio album, First Instrument, which was released in the U.S. in 1995., 739=Recording Date: Jul 15, 1991-Jul 12, 1997, 2607=Truth is, though, that First Instrument was recorded in 1989 and released in Japan that same year. In other words, the \"live\" tracks are a sequel, not a prequel, to her studio debut. Confused yet? No need. All that really matters is that Live in Montreux is a fascinating counterpoint to First Instrument that showcases the dynamic, young Ferrell at her budding best., 811=Although vocalist Rachelle Ferrell is a bizarre singer whose idiosyncratic style is often at odds with her mainstream material, fans of the singer will certainly find much to enjoy on Live at Montreux. The CD collects various performances Ferrell gave at the Swiss music festival from 1991 to 1997. Primarily a jazz singer, Ferrell has also made forays into R&B and often melds the two styles. Prone to showcasing her six-octave range, she often accents songs in odd places, displays myriad vocal stylings in one phrase, and basically over-sings much of the time. Think of her as a combination of Betty Carter and Patti Labelle and you might enjoy yourself. Much of the first set on Live at Montreux features songs off her 1989 debut, First Instrument. Ending that set is \"Prayer Dance,\" which spotlights Ferrell seemingly mimicking the high, laser tones of a theremin. Special guest pianist George Duke also makes an appearance.}",
    "lastModified": "Tue, 09 Dec 2014 16:44:13 GMT",
    "textBeforeTable": "  Соисполнители : Brian Simpson (Keyboards) Doug Nally (Drums) Eddie Green (Piano) George Duke (Keyboards) Jonathan Butler (Guitar) Tyrone Brown (Bass) Recording Date: Jul 15, 1991-Jul 12, 1997 Although vocalist Rachelle Ferrell is a bizarre singer whose idiosyncratic style is often at odds with her mainstream material, fans of the singer will certainly find much to enjoy on Live at Montreux. The CD collects various performances Ferrell gave at the Swiss music festival from 1991 to 1997. Primarily a jazz singer, Ferrell has also made forays into R&B and often melds the two styles. Prone to showcasing her six-octave range, she often accents songs in odd places, displays myriad vocal stylings in one phrase, and basically over-sings much of the time. Think of her as a combination of Betty Carter and Patti Labelle and you might enjoy yourself. Much of the first set on Live at Montreux features songs off her 1989 debut, First Instrument. Ending that set is \"Prayer Dance,\" which spotlights Ferrell seemingly mimicking the high, laser tones of a theremin. Special guest pianist George Duke also makes an appearance. All Music Guide ==== Sweet as the prospect of a live",
    "textAfterTable": "      Обозначения:  T   'щелкнуть' - переход к тексту композиции. вернуться        закрыть окно Последние изменения в документе сделаны 09/12/2014 19:44:10 Главная страница коллекции Collection main page My Music Base",
    "hasKeyColumn": true,
    "keyColumnIndex": 1,
    "headerRowIndex": 0
}