{
    "relation": [
        [
            "Date",
            "2015-09-17",
            "2015-10-02",
            "2015-10-07",
            "2015-10-15",
            "2015-10-20",
            "2015-10-22",
            "2015-10-29",
            "2015-11-04",
            "2015-11-10"
        ],
        [
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            ""
        ],
        [
            "Title",
            "3rd International Indigenous social work conference (3IISWC)",
            "Webinar: 'Good practice' engagement and consultation processes: working with Aboriginal and Torres Strait Islander communities",
            "National Aboriginal and Torres Strait Islander Health Worker Association professional networking forum",
            "33rd CRANAplus conference",
            "Bridging the Gap seminar",
            "Chronic disease research translation lecture",
            "Baker IDI educational symposium: challenges in managing heart and diabetes in primary health care",
            "48th AAG National conference: Place, spirit, heart exploring experience of ageing",
            "Territory Natural Resource Management annual conference"
        ],
        [
            "Location",
            "Darwin, Northern Territory",
            "Online, National",
            "Darwin, Northern Territory",
            "Alice Springs, Northern Territory",
            "Hilton Darwin",
            "Darwin, Northern Territory",
            "Alice Springs, Northern Territory",
            "Alice Springs, Northern Territory",
            "Northern Territory, Australia"
        ],
        [
            "Content",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            ""
        ]
    ],
    "pageTitle": "Conferences, workshops and events « Workforce « Northern Territory « States and Territories « Australian Indigenous HealthInfoNet",
    "title": "",
    "url": "http://www.healthinfonet.ecu.edu.au/print/3238",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 0,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042982013.25/warc/CC-MAIN-20150728002302-00184-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 504220958,
    "recordOffset": 504212756,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Upcoming conferences, workshops and events If you have information you would like to have included on this page please contact us. When you click on one of the headings of the table, the list will be sorted according to that heading. For more information about the conference or event, click on the title.   HealthInfoNet staff will run a HealthInfoNet café at conferences and events with this logo Possibility of Indigenous content some Indigenous content Indigenous specific The conferences, workshops and events are listed by date, but you can select to list them by title, location, or content. The content of the conferences, workshops and events have been rated as follows: InfoNet does not organise conferences itself or endorse any of the events listed. It provides a comprehensive listing of events that may be relevant to those working in or studying Indigenous health. The Australian Indigenous Health This section lists upcoming and past (last 6 months) conferences, workshops and events pertinent to Indigenous Australian health in Australia. » Conferences, workshops and events » Workforce » Northern Territory » States and Territories Home",
    "textAfterTable": "When you click on one of the headings of the table, the list will be sorted according to that heading. For more information about the conference or event, click on the title. If you have information you would like to have included on this page please contact us. Past conferences, workshops and events Date Title Location Content 2015-02-17 Indigenous Allied Health Australia (IAHA) leadership workshop Alice Springs, Northern Territory 2015-04-12 18th Biennial conference of the Australian Rangeland Society Alice Springs Convention Centre, Desert Springs NT 0870 2015-04-20 Framing Indigenous health Darwin, Northern Territory 2015-04-23 Tjungu festival Ayres Rock Resort, Northern Territory 2015-05-19 Cross-cultural training Nhulunbuy, Northern Territory 2015-05-22 Garrmalang festival Darwin, Northern Territory 2015-05-24 The Improvement challenge Darwin, Northern Territory",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}