{
    "relation": [
        [
            "Order",
            "Order is currently closed",
            "Order is currently closed",
            "Order is currently closed",
            "Order is currently closed",
            "Order is currently closed",
            "Order is currently closed",
            "Order is currently closed",
            "Order is currently closed"
        ],
        [
            "ID",
            "#4749",
            "#4748",
            "#4753",
            "#4752",
            "#4751",
            "#4750",
            "#4747",
            "#4746"
        ],
        [
            "Product Name [About Producer]",
            "Milk (1%) - 1/2 Gallon 48 1/2 gallons available. Order number of 1/2 gallons. WW Homestead Dairy's cream-line milk is hormone and antibiotic free. All our milk is pasteurized, but is not homogenized. This means that the cream, which is usually mixed evenly throughout the milk, rises to the top of the jug! Make sure you give it a good shake before pouring it, or you will have delicious globs of cream floating in your glass of milk or cereal. We bottle our milk fresh every Monday.",
            "Milk (1%) - Gallon 48 gallons available. Order number of gallons. WW Homestead Dairy's cream-line milk is hormone and antibiotic free. All our milk is pasteurized, but is not homogenized. This means that the cream, which is usually mixed evenly throughout the milk, rises to the top of the jug! Make sure you give it a good shake before pouring it, or you will have delicious globs of cream floating in your glass of milk or cereal. We bottle our milk fresh every Monday.",
            "Milk (Chocolate Skim) - 1/2 Gallon 49 1/2 gallons available. Order number of 1/2 gallons. WW Homestead Dairy's cream-line milk is hormone and antibiotic free. All our milk is pasteurized, but is not homogenized. This means that the cream, which is usually mixed evenly throughout the milk, rises to the top of the jug! Make sure you give it a good shake before pouring it, or you will have delicious globs of cream floating in your glass of milk or cereal. We bottle our milk fresh every Monday.",
            "Milk (Chocolate Skim) - Gallon 48 gallons available. Order number of gallons. WW Homestead Dairy's cream-line milk is hormone and antibiotic free. All our milk is pasteurized, but is not homogenized. This means that the cream, which is usually mixed evenly throughout the milk, rises to the top of the jug! Make sure you give it a good shake before pouring it, or you will have delicious globs of cream floating in your glass of milk or cereal. We bottle our milk fresh every Monday.",
            "Milk (Skim) - 1/2 Gallon 48 1/2 gallons available. Order number of 1/2 gallons. WW Homestead Dairy's cream-line milk is hormone and antibiotic free. All our milk is pasteurized, but is not homogenized. This means that the cream, which is usually mixed evenly throughout the milk, rises to the top of the jug! Make sure you give it a good shake before pouring it, or you will have delicious globs of cream floating in your glass of milk or cereal. We bottle our milk fresh every Monday.",
            "Milk (Skim) - Gallon 35 gallons available. Order number of gallons. WW Homestead Dairy's cream-line milk is hormone and antibiotic free. All our milk is pasteurized, but is not homogenized. This means that the cream, which is usually mixed evenly throughout the milk, rises to the top of the jug! Make sure you give it a good shake before pouring it, or you will have delicious globs of cream floating in your glass of milk or cereal. We bottle our milk fresh every Monday.",
            "Milk (Whole) - 1/2 Gallon 46 1/2 gallons available. Order number of 1/2 gallons. WW Homestead Dairy's cream-line milk is hormone and antibiotic free. All our milk is pasteurized, but is not homogenized. This means that the cream, which is usually mixed evenly throughout the milk, rises to the top of the jug! Make sure you give it a good shake before pouring it, or you will have delicious globs of cream floating in your glass of milk or cereal. We bottle our milk fresh every Monday.",
            "Milk (Whole) - Gallon 34 gallons available. Order number of gallons. WW Homestead Dairy's cream-line milk is hormone and antibiotic free. All our milk is pasteurized, but is not homogenized. This means that the cream, which is usually mixed evenly throughout the milk, rises to the top of the jug! Make sure you give it a good shake before pouring it, or you will have delicious globs of cream floating in your glass of milk or cereal. We bottle our milk fresh every Monday."
        ],
        [
            "Type",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            ""
        ],
        [
            "Price",
            "$3.25/1/2 gallon",
            "$5.25/gallon",
            "$3.50/1/2 gallon",
            "$5.75/gallon",
            "$3.00/1/2 gallon",
            "$4.50/gallon",
            "$3.25/1/2 gallon",
            "$5.50/gallon"
        ]
    ],
    "pageTitle": "The Iowa Food Cooperative - Products: WW Homestead Dairy",
    "title": "",
    "url": "http://iowafood.coop/shop/product_list.php?producer_id=ww850&page=2",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 4,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042982013.25/warc/CC-MAIN-20150728002302-00205-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 129285031,
    "recordOffset": 129276829,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "WW Homestead Dairy Ice Cream Dairy and Eggs View answers to original producer questionnaire Product Types: Dairy;non-homogenized milk, salted butter, unsalted butter, cinnamon butter(seasonal), fresh cheese curds, block cheddar cheeses, & ice cream. About Us Two local dairy farm families from northeast Iowa are proud to introduce a full dairy product line with all natural ingredients that are locally produced and processed. Our dairy products have an amazing flavor and taste and are made fresh daily with the highest standard of excellence. WW Homestead Dairy is nestled in the town of Waukon, Iowa. This community is rich in history and surrounded by fertile farm land. Not only does the creamery offer its customers the freshest products with extraordinary flavors, but tours are available and the public is encouraged to watch how products are produced. A hallway with large viewing windows allows customers to see the hard work, effort, and quality that goes into making their milk, ice cream, cheese, and butter. Be sure to stop by WW Homestead Dairy the next time you're in the area and sample our hometown goodness. If you would like a tour please call ahead. Our farm fresh butter is churned weekly and is as rich and creamy as any you will find. It is also great for baking and cooking.",
    "textAfterTable": "Order is currently closed #4750 Milk (Skim) - Gallon 35 gallons available. Order number of gallons. WW Homestead Dairy's cream-line milk is hormone and antibiotic free. All our milk is pasteurized, but is not homogenized. This means that the cream, which is usually mixed evenly throughout the milk, rises to the top of the jug! Make sure you give it a good shake before pouring it, or you will have delicious globs of cream floating in your glass of milk or cereal. We bottle our milk fresh every Monday. $4.50/gallon Order is currently closed #4747 Milk (Whole) - 1/2 Gallon 46 1/2 gallons available. Order number of 1/2 gallons. WW Homestead Dairy's cream-line milk is hormone and antibiotic free. All our milk is pasteurized, but is not homogenized. This means that the cream, which is",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}