{
    "relation": [
        [
            "Modifier and Type",
            "boolean",
            "boolean",
            "boolean",
            "boolean"
        ],
        [
            "Method and Description",
            "EllipticCurve.equals(Object obj) Compares this elliptic curve for equality with the specified object.",
            "ECFieldFp.equals(Object obj) Compares this prime finite field for equality with the specified object.",
            "ECPoint.equals(Object obj) Compares this elliptic curve point for equality with the specified object.",
            "ECFieldF2m.equals(Object obj) Compares this finite field for equality with the specified object."
        ]
    ],
    "pageTitle": "Uses of Class java.lang.Object (Java Platform SE 7 )",
    "title": "Methods in java.security.spec with parameters of type Object",
    "url": "http://docs.oracle.com/javase/7/docs/api/java/lang/class-use/Object.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 125,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438043062635.98/warc/CC-MAIN-20150728002422-00033-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 76123771,
    "recordOffset": 76018312,
    "tableOrientation": "HORIZONTAL",
    "lastModified": "Sat, 04 Oct 2014 01:06:01 GMT",
    "textBeforeTable": "Toolkit.desktopProperties  protected Map<String,Object> Field and Description Modifier and Type   Fields in java.awt with type parameters of type Object Text antialiasing hint value -- text rendering is done with some form of antialiasing. RenderingHints.VALUE_TEXT_ANTIALIAS_ON static Object Text antialiasing hint value -- text rendering is done without any form of antialiasing. RenderingHints.VALUE_TEXT_ANTIALIAS_OFF static Object Text antialiasing hint value -- request that text be displayed optimised for an LCD display with subpixel organisation from display top to bottom of R,G,B such that the vertical subpixel resolution is three times that of the full pixel vertical resolution (VRGB). RenderingHints.VALUE_TEXT_ANTIALIAS_LCD_VRGB static Object Text antialiasing hint value -- request that text be displayed optimised for an LCD display with subpixel organisation from display top to bottom of B,G,R such that the vertical subpixel resolution is three times that of the full pixel vertical resolution (VBGR). RenderingHints.VALUE_TEXT_ANTIALIAS_LCD_VBGR static",
    "textAfterTable": "Creates a clone of this RenderingHints object that has the same contents as this RenderingHints object. Object JobAttributes.clone() Creates and returns a copy of this JobAttributes. Object ImageCapabilities.clone()  Object RenderingHints.get(Object key) Returns the value to which the specified key is mapped. Object BorderLayout.getConstraints(Component comp) Gets the constraints for the specified component Object Toolkit.getDesktopProperty(String propertyName) Obtains a value for the specified desktop property. Object[] MediaTracker.getErrorsAny() Returns a list of all media that have encountered an error. Object[] MediaTracker.getErrorsID(int id) Returns a list of media with the specified ID that have encountered an error. abstract Object Image.getProperty(String name, ImageObserver observer) Gets a property of this image by name. abstract Object",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}