{
    "relation": [
        [
            "Categories",
            "Clubs and Activities",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "Royal Court Black Women for Change My Natural SGA",
            "Always maintain a great GPA. Explore the limitless opportunities that this university provides. Become involved and very active on campus.",
            "Winston Salem State University is one of the top HBCU's for academics and athletics. I am a proud Spring 2012 graduate of this illustrious university. Winston Salem State University is a place where successful students are created."
        ]
    ],
    "pageTitle": "Winston-Salem State University Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Winston-Salem-State-University/reviews?_escaped_fragment_=/show/9722",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988840.31/warc/CC-MAIN-20150728002308-00324-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 897590911,
    "recordOffset": 897539391,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{146079=WSSU is home of the 2012 Rams football Division II National Championship runner-up title!. The college is growing tremendously, and provides many students with opportunities for advanced degrees at very a reasonable tuition. In the heart of Winston Salem, and close to everything, 212353=© 2015, Cappex.com, LLC, 51567=The freshman have a ceremony that officially declares them in the RAM family. An archway was built in 1930 or so that all freshman students walk under and this is their right of passage to say... Welcome!, 209245=It really depends on what dorm your in. Remember your sharing with 1000 or more people in a building so things do break., 120546=Winston Salem State University is one of the top HBCU's for academics and athletics. I am a proud Spring 2012 graduate of this illustrious university. Winston Salem State University is a place where successful students are created., 205879=Come tour the campus, you will fall in love. Make a trip to financial aid and make sure you get the help you need. Make sure you STUDY, the campus does have a lot to offer including a three story library located in the center of the campus open from 8:30 to 1 am on most nights. Also,get involved on campus with an organization it will help you with job references and graduate school!, 106637=Around May in the spring semester, probates begin. This is an exciting time to see who became apart of what organization.}",
    "textBeforeTable": "07/13/2009 Reviewer is A current student here. 18 out of 18 people found this review useful. 1 of 48 Brittany from Durham, NC Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6,",
    "textAfterTable": "Am enjoying being here I really enjoy being a student here at WSSU at. At first I was very skeptical being a new freshman. I had alot of questions running around in my head like how will i meet new people, will I fit in, or is this even the right place for me to be. By the end of my first year I had answers to all of my questions, and yes they were good ones! Am learning a lot At Winston Salem State University I have learned a ton of new things, and also I have fun while learning and that's the best part! Some of the new things I have learned are the proper ways to write persuasive essays,how to act as an adult (being responsible), and being a team player to just name a few. Not only do I learn things from the professors but also the students that I am around daily, and that helped me a lot with it being my first year there. Login to rate or flag the reviews Kendra from Greensboro, NC 08/06/2009 Reviewer is A current student here. 17 out of",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}