{
    "relation": [
        [
            "",
            "CPIC Life",
            "New policies",
            "Renewed policies",
            "Total"
        ],
        [
            "Agency",
            "channel",
            "12,976",
            "44,976",
            "57,952"
        ],
        [
            "",
            "Bancassurance",
            "15,384",
            "15,273",
            "30,657"
        ],
        [
            "Direct sales (including telemarketing and internet",
            "sales)",
            "5,579",
            "913",
            "6,492"
        ],
        [
            "",
            "Total",
            "33,939",
            "61,162",
            "95,101"
        ]
    ],
    "pageTitle": "China Pacific Insurance (Group) Co., Ltd : (2014-01-17)ANNOUNCEMENT RELATING TO PREMIUM INCOME | 4-Traders",
    "title": "",
    "url": "http://www.4-traders.com/CHINA-PACIFIC-INSURANCE-6500067/news/China-Pacific-Insurance-Group-Co-Ltd--2014-01-17ANNOUNCEMENT-RELATING-TO-PREMIUM-INCOME-17825309/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988840.31/warc/CC-MAIN-20150728002308-00216-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 275994575,
    "recordOffset": 275968930,
    "tableOrientation": "VERTICAL",
    "TableContextTimeStampAfterTable": "{74567=Hong Kong, 18 January 2014, 70343=This announcement is made by the Company pursuant to provisions regarding disclosure of inside information under Part XIVA of the Securities and Futures Ordinance (Chapter 571 of the Laws of Hong Kong) and Rule 13.09 and Rule 13.10B of the Rules Governing the Listing of Securities on The Stock Exchange of Hong Kong Limited in connection with the unaudited accumulated gross premium income of the Company to be released on the website of China Insurance Regulatory Commission. This announcement is made by China Pacific Insurance (Group) Co., Ltd. (the \"Company\") pursuant to provisions regarding disclosure of inside information under Part XIVA of the Securities and Futures Ordinance (Chapter 571 of the Laws of Hong Kong) and Rule 13.09 and Rule 13.10B of the Rules Governing the Listing of Securities on The Stock Exchange of Hong Kong Limited. Pursuant to the \"Regulations on the Accounting Treatment Relating to Insurance Contracts\" issued by the Ministry of Finance (Cai Kuai [2009] No. 15), the accumulated gross premium income of China Pacific Life Insurance Co., Ltd. (\"CPIC Life\") and China Pacific Property Insurance Co., Ltd. (\"CPIC Property\"), both of which are the subsidiaries of the Company, for the period between 1 January 2013 and 31 December 2013 were RMB95.101 billion and RMB81.613 billion, respectively. These figures will be published on the China Insurance Regulatory Commission's website (http://www.circ.gov.cn)., 71905=The details of the gross premium income for CPIC Life and CPIC Property for the period between 1 January 2013 and 31 December 2013 are set out below: Unit: in RMB million}",
    "textBeforeTable": "The details of the gross premium income for CPIC Life and CPIC Property for the period between 1 January 2013 and 31 December 2013 are set out below: Unit: in RMB million 1 This announcement is made by the Company pursuant to provisions regarding disclosure of inside information under Part XIVA of the Securities and Futures Ordinance (Chapter 571 of the Laws of Hong Kong) and Rule 13.09 and Rule 13.10B of the Rules Governing the Listing of Securities on The Stock Exchange of Hong Kong Limited in connection with the unaudited accumulated gross premium income of the Company to be released on the website of China Insurance Regulatory Commission. This announcement is made by China Pacific Insurance (Group) Co., Ltd. (the \"Company\") pursuant to provisions regarding disclosure of inside information under Part XIVA of the Securities and Futures Ordinance (Chapter 571 of the Laws of Hong Kong) and Rule 13.09 and Rule 13.10B of the Rules Governing the Listing of Securities on The Stock Exchange of Hong Kong Limited. Pursuant to the \"Regulations on the Accounting Treatment Relating to Insurance Contracts\" issued by the Ministry of Finance (Cai Kuai [2009] No. 15), the accumulated gross premium income of China Pacific Life Insurance Co., Ltd. (\"CPIC Life\") and China Pacific Property Insurance Co., Ltd. (\"CPIC Property\"), both of which are the subsidiaries of the Company, for the period between 1 January 2013 and 31 December 2013 were RMB95.101 billion and",
    "textAfterTable": "CPIC Property Auto Insurance Unit: in RMB million Non-auto Insurance Total 63,848 17,765 81,613 The accumulated gross premium income referred to above is unaudited. Investors are advised to take note. By Order of the Board China Pacific Insurance (Group) Co., Ltd. Gao Guofu Chairman Hong Kong, 18 January 2014 As of the date of this announcement, the executive directors of the Company are Mr. GAO Guofu and Mr. HUO Lianhong; the non-executive directors of the Company are Mr. WANG Chengran, Ms. SUN Xiaoning, Mr. YANG Xianghai, Mr. WU Jumin, Mr. WU Junhao and Mr. ZHENG Anguo; and the independent non-executive directors of the Company are Mr. BAI Wei, Mr. LAM Chi Kuen, Mr. ZHOU Zhonghui and Mr. FOK Kwong Man. 2 distributed by",
    "hasKeyColumn": true,
    "keyColumnIndex": 1,
    "headerRowIndex": 0
}