{
    "relation": [
        [
            "Threat",
            "infrastructure-warriors",
            "vandals",
            "hoodlums",
            "government-agencies",
            "crackers-for-hire",
            "consultants",
            "vendors",
            "information-warriors",
            "tiger-teams",
            "military-organizations",
            "cyber-gangs",
            "whistle-blowers",
            "foreign-agents-and-spies",
            "insiders",
            "industrial-espionage-experts",
            "economic-rivals",
            "nation-states",
            "professional-thieves",
            "drug-cartels",
            "maintenance-people",
            "extortionists",
            "customers",
            "global-coalition",
            "activists",
            "police",
            "crackers",
            "competitors",
            "paramilitary-groups",
            "deranged-people",
            "terrorists",
            "organized-crime",
            "private-investigators",
            "reporters",
            "club-initiates",
            "hackers"
        ],
        [
            "10%",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "2",
            "2",
            "3",
            "3",
            "4",
            "4",
            "5",
            "5",
            "5",
            "5",
            "7",
            "9",
            "12",
            "13",
            "14",
            "14",
            "18",
            "22",
            "23"
        ],
        [
            "20%",
            "0",
            "0",
            "1",
            "4",
            "5",
            "8",
            "1",
            "4",
            "4",
            "7",
            "8",
            "8",
            "9",
            "10",
            "10",
            "14",
            "7",
            "12",
            "12",
            "21",
            "17",
            "41",
            "6",
            "24",
            "36",
            "50",
            "62",
            "35",
            "54",
            "66",
            "53",
            "66",
            "87",
            "102",
            "75"
        ],
        [
            "30%",
            "0",
            "0",
            "7",
            "18",
            "9",
            "17",
            "8",
            "19",
            "11",
            "24",
            "33",
            "29",
            "25",
            "35",
            "24",
            "34",
            "27",
            "39",
            "54",
            "71",
            "63",
            "104",
            "36",
            "77",
            "87",
            "135",
            "182",
            "126",
            "164",
            "163",
            "162",
            "181",
            "197",
            "267",
            "159"
        ],
        [
            "40%",
            "0",
            "0",
            "30",
            "50",
            "24",
            "40",
            "21",
            "28",
            "52",
            "38",
            "76",
            "53",
            "47",
            "88",
            "43",
            "86",
            "63",
            "81",
            "89",
            "148",
            "103",
            "205",
            "51",
            "163",
            "242",
            "317",
            "351",
            "251",
            "333",
            "356",
            "281",
            "404",
            "411",
            "490",
            "345"
        ],
        [
            "50%",
            "0",
            "0",
            "85",
            "86",
            "60",
            "102",
            "55",
            "94",
            "104",
            "110",
            "189",
            "124",
            "94",
            "167",
            "105",
            "165",
            "145",
            "192",
            "190",
            "302",
            "253",
            "359",
            "102",
            "309",
            "367",
            "478",
            "548",
            "441",
            "544",
            "534",
            "478",
            "641",
            "657",
            "740",
            "544"
        ],
        [
            "60%",
            "0",
            "0",
            "232",
            "153",
            "111",
            "196",
            "103",
            "162",
            "156",
            "173",
            "303",
            "276",
            "181",
            "256",
            "172",
            "311",
            "232",
            "346",
            "309",
            "508",
            "402",
            "554",
            "190",
            "501",
            "574",
            "710",
            "775",
            "685",
            "745",
            "769",
            "702",
            "840",
            "821",
            "893",
            "776"
        ],
        [
            "70%",
            "0",
            "7",
            "463",
            "275",
            "245",
            "336",
            "193",
            "246",
            "289",
            "338",
            "552",
            "440",
            "293",
            "438",
            "304",
            "510",
            "369",
            "504",
            "457",
            "685",
            "619",
            "755",
            "370",
            "666",
            "744",
            "860",
            "900",
            "823",
            "912",
            "880",
            "852",
            "954",
            "949",
            "964",
            "931"
        ],
        [
            "80%",
            "0",
            "48",
            "665",
            "439",
            "399",
            "500",
            "289",
            "419",
            "436",
            "485",
            "752",
            "660",
            "460",
            "597",
            "376",
            "692",
            "512",
            "693",
            "632",
            "849",
            "761",
            "913",
            "521",
            "838",
            "880",
            "951",
            "968",
            "938",
            "973",
            "980",
            "946",
            "990",
            "985",
            "992",
            "976"
        ],
        [
            "90%",
            "0",
            "222",
            "916",
            "623",
            "600",
            "682",
            "538",
            "600",
            "643",
            "704",
            "912",
            "827",
            "675",
            "794",
            "598",
            "848",
            "722",
            "868",
            "774",
            "952",
            "908",
            "950",
            "708",
            "930",
            "962",
            "983",
            "992",
            "990",
            "995",
            "987",
            "986",
            "998",
            "998",
            "997",
            "991"
        ],
        [
            "100%",
            "0",
            "691",
            "1000",
            "858",
            "871",
            "914",
            "744",
            "864",
            "870",
            "906",
            "984",
            "963",
            "864",
            "939",
            "840",
            "968",
            "916",
            "981",
            "942",
            "989",
            "983",
            "993",
            "917",
            "974",
            "993",
            "999",
            "1000",
            "1000",
            "998",
            "997",
            "999",
            "1000",
            "1000",
            "1000",
            "999"
        ]
    ],
    "pageTitle": "Feature Article",
    "title": "",
    "url": "http://www.all.net/journal/ntb/simulate/simulate.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988840.31/warc/CC-MAIN-20150728002308-00144-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 278489743,
    "recordOffset": 278438602,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{143394=A very interesting result that combines these results with the previous results on the distribution of successful attack times, is that the effect of faster reaction time on outcomes is highly non-linear. In fact, effectiveness of defense is not even monotonically improved by decreased reaction time. This is because of the bands of time in which there are no successful attacks. If reaction time is at the end of a one of these dead bands, moving it to the other end of the dead band has no effect on the success rates of defenders. Since faster reaction generally costs more, being at the high-speed end of a dead band is typically less cost effective than being at the low-speed end of the same dead band. In fact, since decisions taken over longer times have a tendency to be better thought out, there may be advantages in terms of the quality of the outcomes to taking the extra time to make a decision when time is available. For example, in Table 9 (1000 runs of a paramilitary group attacking Frank from the Internet with defender strength at 20%) there is a large dead band between 21 and 30 days in which speed is of no import., 146783=Similarly, we can evaluate costs of consequences by assessing figures to worst case consequence, but this does not fully address the issue from a risk management perspective because all losses are not maximum valued, and no current or anticipated theory addresses the time effect of unmitigated attacks on consequences. As far as anybody seems to be able to tell today, consequences are highly dependent on a wide range of factors including but not limited to, the specifics of the information environment, the interdependencies within the organization, the ability of the systems and people to adapt to adverse circumstances, market conditions, public perceptions, the broader business environment, and on and on. To make matters even worse, in many real-world situations, the costs of consequences vary over several orders of magnitude depending on who you ask about them. The computer virus that spread through the Internet in 1988 [Rochlis89] is a good example in which after-the-fact estimates of loss ranged from hundreds of thousands of dollars to hundreds of millions of dollars., 105184=Using the same problem set discussed above, we came up with the results in Table 11 - summarized into defender wins out of 1000 runs - with colors ranging from red (better for the attacker) to green (better for the defender). The results have been sorted (roughly) from best for the attacker to worst for the attacker., 120718=Plate 3 shows the contour of the probability of successful defense, and makes it clear that there is a nonlinearity of success with defender strength. It displays different threat types along the X axis, the defender strength along the Y-axis, and the the number of successful defenses per 1000 attacks along the Z-axis. A zero grid is also shown (in green) for perspective., 153810=We can now compute an annual expected loss chart by multiplying the probability of successful attack by attack frequency and expected loss. The calculation is straight forward. For example, for Information Warriors with the defender at 90 percent strength, 953 of 1000 attacks fail. If the Mean Time to Attack (MTTA) is 10 years and 4.7 percent of the time they succeed, there is a 0.47 percent chance of a 100,000,000 dollar loss in any given year, or an expected loss of 470,000 per year. If we went to 100 percent defender strength this would change to a 90,000 dollar expected loss per year, or a 380,000 dollar change in expected loss. If we sum up the expected loss for each strength level across all threats, we get the total expected loss per year as a function of defender strength, and we can then make a prudent decision based on the tradeoff between quality and cost of defenders. The results are shown in Table 14:, 103927=In an experimental network configured for this purpose, we assigned the same port on each computer to run the simulation engine and sent simulations to be performed to each processor, taking results back as simulations were completed. The programming effort took about 15 minutes for a rough distribution system for this task and the process was reasonably effective at distributing the computation and returning results. In 140 minutes of real time, 20 400MHz PC processors running Linux performed 1000 simulations each for 35 threat profiles and 10 values of defender strength, or 350,000 simulation runs. This comes to 140 minutes for 350,000 simulations on 20 processors, or about 24 seconds per 1,000 simulation runs. This is not very good parallelism, since it comes to 480 seconds per 1000 runs per processor or about 3.4 times slower than the single processor runs done earlier. We have not spent any time to determine why the performance was so slow, but it is likely related to the shared file system used for communication between processors in this particular network and the manner in which we did program distribution. If this technique is to be used more extensively, performance bottlenecks will be worth removing.}",
    "textBeforeTable": "1yr 98d 1h 4m 16s 2yr 71d 23h 48m 53s 3 2yr 77d 15h 52m 40s 2yr 63d 5h 50m 40s 341d 14h 1m 48s 1yr 317d 22h 5m 25s 4 1yr 340d 50m 10s 1yr 291d 8h 44m 50s 189d 7h 21m 26s 1yr 232d 23h 49m 32s 10 1yr 278d 5h 38m 50s 1yr 201d 8h 48m 20s 116d 2h 34m 23s 1yr 153d 18h 53m 44s 20 1yr 195d 11h 53m 30s 1yr 122d 17h 43m 10s 75d 14h 31m 12s 1yr 75d 5h 41m 50s 34 1yr 117d 20h 38m 1yr 40d 10h 25m 50s 37d 4h 5m 23s 357d 17h 42m 24s 93 1yr 39d 15h 19m 40s 324d 11h 25m 10s 22d 12h 16m 59s 277d 12h 42m 7s 153 321d 21h 57m 20s 243d 13h 17m 12d 3h 24m 8s 199d 7h 40m 10s 273 243d 11h 43m 30s 163d 19m 30s 7d 3h 39m 18s 123d 13h 52m 56s 309 162d 17h 30m 20s 82d 12h 15m 40s",
    "textAfterTable": "Another very important consideration in this case is the lack of detection and reaction in the model. In practice, only a very subtle attack will likely use a large number of steps and go undetected by a reasonable defender. Once detected, reaction, even on human time scales, may easily defeat the attack most of the time. Even the fastest success in the hacker runs shown in Table 5 (1d 12h 55m) is within the realm of what human reaction has a chance to stop. This is not universally true, of course. Stronger attackers tend to gain entry far more quickly. For example, in a subsequent run, a simulated information warrior operating against a fully skilled defender was able to gain access to Frank in 4 minutes, 27 seconds. This is far faster than human defenders are likely to be able to react except in the rarest of circumstances. This also brings up the issue of attacker and defender quality. We characterize this as a probabilistic measure that affects the firing tables and dice rolls. On each attack and defense, you can see thresholds for success both for the attacker and defender along with the numbers actually used in the particular move. These thresholds are varied based on the attacker and defender quality provided as input to the simulation. In the case of defenders, the quality is a simulation parameter, while threats have quantitative values in the database used to drive the simulation.",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}