{
    "relation": [
        [
            "Date",
            "2010-10-06 10:00:00",
            "2010-10-06 10:00:00"
        ],
        [
            "Roundtable Name",
            "2010 Playoffs Day One",
            "2010 Playoffs Day One"
        ],
        [
            "Comment",
            "I drove up to Peoria once just to watch Mark Prior pitch two innings of rehab. I, um, own a Mark Prior jersey. I am cheering for Mark Prior more than I think any one person should, but it is what it is. (Colin Wyers)",
            "The Twins announcers of course bring up Mark Prior. I checked the minor league stats, and he only had the one game since joining the Rangers. I guess that's not too surprising. (Colin Wyers)"
        ]
    ],
    "pageTitle": "Mark Prior | Baseball Prospectus",
    "title": "",
    "url": "http://www.baseballprospectus.com/card/card.php?id=265",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988840.31/warc/CC-MAIN-20150728002308-00021-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 318039171,
    "recordOffset": 317996669,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{33782=Last Update: 12/31/2014 23:59 ET}",
    "lastModified": "Sat, 01 Aug 2015 16:22:40 GMT",
    "textBeforeTable": "BP Roundtables I think he'll have almost no impact this season. I'd expect him to spend much of the season strengthening his arm and making a couple starts towards August. How he does in those will go a long way in determining if he can ever get back to that previous level. The upside is that he's still young and still has talent somewhere in that arm. How he gels with the Padres staff is also going to be a big key in his comeback. (Will Carroll) Care to hazard a guess or prediction on Mark Prior's contributions to the Padres in 2008? I had read that several teams were scared off by his medical reports this season, all except one apparently. Thanks! (Kevin from Oak Lawn, IL) 2008-01-14 13:00:00 (link to chat) Fair point, but the day of, I'm a-betting there wasn't an attack piece questioning Mark Prior's commitment on the front page. Bringing in Barry--and doing what you can to contend, which Kenny Williams is gunning for, given the Swisher deal--would help give the Mike Norths of the world something to rail about endlessly. (Christina Kahrl) Christina, I see above Bonds would knock the",
    "textAfterTable": "    Baseball Prospectus Analysis Blog Radio Events Newsletter Search News Player Cards Player Search Team Audit Statistics Fantasy Player Forecast Manager Depth Charts Team Tracker Hacking Mass Team Health Reports BP.com Terms of Service Customer Service Privacy Policy Contact Us Glossary AMERICAN LEAGUE Baltimore Orioles Boston Red Sox New York Yankees Tampa Bay Rays Toronto Blue Jays Chicago White Sox Cleveland Indians Detroit Tigers Kansas City Royals Minnesota Twins Los Angeles Angels Oakland Athletics Seattle Mariners Texas Rangers NATIONAL LEAGUE Atlanta Braves Miami Marlins New York Mets Philadelphia Phillies",
    "hasKeyColumn": true,
    "keyColumnIndex": 1,
    "headerRowIndex": 0
}