{
    "relation": [
        [
            "FRANCE.",
            "In 1533, François' son Henri was married to Catherine de Medicis, niece to the Pope.",
            "In 1535, François revived the old claim to Milan, and claimed a sum of money for his mother from Savoy.",
            "In 1536, Charles V. anticipated him by a sudden attack on Provence, which was laid desolate before him, so that he could not remain there; but, in the meantime, the French had siezed all Savoy, excepting Nice. The war on the side of the Low Countries also resulted to the advantage of France; but in the desire of François to harass the Emperor, he actually allied himself with the Turks and Moors against him. The Constable, Anne de Montmorency, was an able leader; also the Duke de Guise, a younger son of the Duke de Lorraine. In 1537, a conference was held at Nice, where the Pope tried to reconcile the king and the emperor. They would not meet in his presence, but did so immediately after at Aigues Mortes, where a truce was made, but without ending the quarrel. All this time François cruelly persecuted the Calvinists in his own kingdom. He was a great lover of art, and patronized the great Italian painters, Leonardo da Vinci and Raffaelle.",
            "In 1540, Charles's presence being required in the Low Countries, he was invited to pass through France, and magnificently entertained. In 1542, François renewed the war by attacking Navarre, and called the Moors to attack Spain and Italy, giving them shelter at Marseilles while they ravaged the coast.",
            "In 1543, the Duke d'Enghien defeated the Imperial forces at Cerignola, and together with the Moors plundered and burnt Nice, but could not take the citadel. François came to terms, and peace between him and the emperor was signed at Crespy."
        ],
        [
            "",
            "In 1534, Clement VII. died.",
            "In 1535, Paul III. was chosen Pope, and began with Charles V. to prepare for a council of the Church.",
            "In 1537, James V. of Scotland married François's daughter. She died soon after, and he married Marie, daughter of the Duke de Guise.",
            "In 1542, Scotland was led into war with England by France.",
            "In 1543, Henry allied himself with the Emperor against François, and sent an army, which besieged and took Boulogne, and defeated the French. In 1545, the French tried to retake Boulogne, but their army wasted with sickness, and peace was made. The Council of Trent began to sit, but it consisted only of Italian and Spanish prelates."
        ],
        [
            "ENGLAND.",
            "On Archbishop Wareham's death, in 1533, Henry made Thomas Cranmer primate, and obtained a sentence from him against the marriage. He then married Anne Boleyn. Henry caused Parliament to declare him the head of the English Church instead of the Pope.",
            "In 1535, Thomas Cromwell became Secretary of State, and used his influence against the Church.",
            "In 1536, he began suppressing the lesser monasteries, which had fallen into debt and disorder. Sir Thomas More and Bishop Fisher were beheaded for denying Henry's supremacy. Henry became suspicious of Anne Boleyn, and on an accusation of unfaithfulness the marriage was declared null, and her daughter Elizabeth illegitimate. The king married Jane Seymour. The peasants of the north, together with some abbots and a few gentlemen, made a rising on behalf of the abbeys, called the Pilgrimage of Grace; but it was soon suppressed. A son was born to Henry in 1537, and Queen Jane died immediately after. In 1539, Henry passed a law, called the Six Articles, which bound persons strictly to the old faith, but denied the Pope's supremacy. He suppressed the larger monasteries, making grants of their lands to his favourites.",
            "In 1540, Henry married Anne of Cleves, but, disliking her person, divorced her immediately, and soon after disgraced and beheaded Cromwell. In 1541, he married Catherine Howard, but, discovering levity before her marriage, beheaded her in 1542. James of Scotland invaded England; but his troops were miserably routed at Solway Moss, and he died of grief, leaving an infant daughter, Mary.",
            "In 1543, Henry married Catherine Parr. His temper had become savage and distrustful, and no one was safe from him. Persecution was carried on against all who transgressed the Six Articles, whether by the doctrines of the Reformation or denial of his supremacy. The Earl of Surrey was put to death on a charge of treason."
        ]
    ],
    "pageTitle": "A Parallel History of France and England Consisting of Outlines and Dates.",
    "title": "",
    "url": "http://digital.library.upenn.edu/women/yonge/history/history.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988840.31/warc/CC-MAIN-20150728002308-00048-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 68516463,
    "recordOffset": 68420441,
    "tableOrientation": "VERTICAL",
    "TableContextTimeStampAfterTable": "{90330=In 1388, the gallant chivalrous skirmish of Otterburn was fought between English and Scots., 137919=Henry became suspicious of Anne Boleyn, and on an accusation of unfaithfulness the marriage was declared null, and her daughter Elizabeth illegitimate. The king married Jane Seymour. The peasants of the north, together with some abbots and a few gentlemen, made a rising on behalf of the abbeys, called the Pilgrimage of Grace; but it was soon suppressed. A son was born to Henry in 1537, and Queen Jane died immediately after., 241082=In 1776, Boston was evacuated. The Declaration of Independence was made by the revolted Americans., 68803=In 1258, Simon de Montfort, Earl of Leicester (in right of his mother), organized an opposition of the barons to the king's illegal proceedings. All came armed to Oxford, to what was called the Mad Parliament. It was established that no grant of, 52315=In 1136, Louis le Jeune was married to Alienor, the heiress of the great dukedom of Aquitaine., 131114=In 1525, François marched into Italy and besieged Pavia. In a battle with the Imperial forces, headed by the Marquis of Pescara and the Constable de Bourbon, he was defeated, wounded, and made prisoner. He was sent to Spain, where he fell sick, and was visited by his sister Marguerite, who negotiated for his deliverance., 179893=In 1644, Enghien and Turenne, his equal in ability, advanced into Germany, and fought a bloody but doubtful battle at Friburg., 48086=Philippe I. died in 1106, and LOUIS VI. reigned alone, and with much superior ability and vigour. He first began to obtain some influence for the French crown, and was assisted by the counsels of Suger,, 183668=In 1648, the struggle called The Fronde, between the Court and Parliament of Paris, began. The edicts for levying contributions put forth by the queen and Mazarin were so illegal, that the Parliament refused to register them. Anne endeavoured to reduce the Parliament to obediance by arresting and imprisoning two members; but the Parisians rose in tumult, and she was forced to yield the captives, but resolved on revenge. The Parliamentary party were called Frondeurs., 83997=In 1364, unable to obtain fulfilment of the treaty by the French, Jean returned to captivity, and there died the same year., 94432=In 1415, Richard Plantagenet, who had married the sister of Mortimer, plotted to obtain the crown, but Mortimer revealed the treason, and Richard suffered death, leaving a son, Richard, duke of York., 140104=In 1545, the French tried to retake Boulogne, but their army wasted with sickness, and peace was made. The Council of Trent began to sit, but it consisted only of Italian and Spanish prelates., 160497=HENRI IV. became rightful king; but the Leaguers proclaimed his uncle the Cardinal. He fought his way to the crown, reducing Normandy first, and winning the brilliant victory of Ivry, and then besieged Paris, but was called off by the invasion of the Spaniards under the Duke of Parma, and had to act on the defensive until Parma's death, in 1592. The, 176017=In 1637, the French invaded Spain and took Perpignan. The war continued in Italy and the Low Countries without striking events, but Richelieu's policy was of continual war as the best occupation for the nobles., 110924=In 1474, Louis stirred up the Swiss republic to attack Burgundy. The city of Brisach, in Alsace (which Duke Sigismund of Austria had pledged to Charles), revolted with Swiss aid, and murdered the Burgundian governor, calling back Sigismund. On this Charles invaded the electorate of Cologne, but he was routed by the Swiss at Morat, and was detained eleven months by the siege of Neuss, and was forced to give it up., 76012=In 1308, in the first year of Edward II., it became understood that a law was not valid without the assent of Parliament. EDWARD II., weak, licentious, and led by favourites, neglected the Scottish war. His first favourite, Piers Gaveston, was murdered by the barons in 1312, and he afterwards led an army to Scotland, but was utterly routed at Bannockburn in 1314., 170885=In 1624, on his way to Spain, Princes Charles saw and fell in love with Henrietta Maria, the sister of Louis XIII., and Buckingham audaciously coquetted with Anne, the young queen of France., 145661=In 1557, Bishop Gardiner died, and Mary lost her most able counsellor; all was disorganization and discontent, and she pined under disappointment and, 234853=In 1757, Clive gained the great battle of Plassey over the Rajah Dowlah, thus avenging the Black Hole, and by the conquest of Bengal establishing British power in India., 196116=In 1665, the war with Holland was resumed, but without advantage, and the Great Plague devastated London., 55870=In 1154, Stephen died, and HENRY II. continued the Norman policy of repression of the barons, and strict observance of law, showing great vigour, resolution, and astuteness., 115591=In 1484, the States-General were convoked, and relaxed the most oppressive ordinances of Louis, releasing his victims from captivity. There was a great conspiracy against the power of Anne of Beaujeu on the part of all the princes and nobility, but she repressed them with great ability, though they continued full of discontent, and continually forming plots against her. The Duke of Brittany and the Duke of Orleans (next heir to the throne) were jealous of her authority, and were resolved on striking a blow for the old influence of the great princes of France., 52582=In 1145, a second crusade was preached by St. Bernard, and the king and queen eagerly took the cross in 1147. A brilliant victory was gained in 1148 at Nicæa, and Damascus was besieged, but, 132718=In 1527, a German army of adventurers, led by Bourbon, marched to Rome. He was killed in the assault, but the city was taken and sacked, and the Pope became a captive., 45948=William I. died in 1087, leaving the crown of England to his second son, WILLIAM II. (Rufus), an able man, but impious, violent, savage, and tyrannical, and much hated both by Normans and English. After Lanfranc's death, in 1089, he kept the see of Canterbury four years vacant. At length, under terror of death from severe sickness, he appointed Anselm, abbot of Bec. MALCOLM CEAN MOHR invaded England, but was killed at Alnwick, and his kingdom fell back into its savage Keltic state., 91803=In 1398, Henry, son of the the Duke of Lancaster, accused Mowbray, duke of Norfolk, of treason, and offered to prove it by wager of battle; but Richard prevented the fight, and banished both., 134904=In 1530, Henry began to try to obtain a judgment from the universities against his marriage, and the legitimacy of his daughter Mary., 237249=In 1765, the dauphin died, leaving a young family. The king sank into the lowest and grossest licence, while the nobility were haughty and dissipated, and the old feudal rights were frightfully oppressive to the peasantry. Promotion was unnattainable without noble birth, and the corrupt state of the Church had led to infidelity and discontent among more clever men., 137044=In 1537, a conference was held at Nice, where the Pope tried to reconcile the king and the emperor. They would not meet in his presence, but did so immediately after at Aigues Mortes, where a truce was made, but without ending the quarrel. All this time François cruelly persecuted the Calvinists in his own kingdom., 195641=In 1665, on the death of Philip IV. of Spain, Louis claimed the Netherlands, because his wife was the daughter of the first wife, her brother Charles II. of Spain of the second., 287978=In 1864, the Northern States obtained the victory., 92272=In 1402, the Scots were defeated at Homildon; but HENRY IV., demanding the custody of the prisoners, offended the Percys, who turned at once against him, taking up the cause of the direct heir, Edmund Mortimer, who had been set aside., 148691=In 1561, Mary Stewart returned to Scotland from France, charming, beautiful, clever, and unprincipled., 73157=Pope Boniface VIII. interfered on behalf of Guy of Flanders, but in vain. Philippe made peace with Edward, giving him his sister Margaret as a second wife, and betrothing his daughter Isabel to Edward of Caernarvon in 1303. The treaty of Monbreuil was signed, by which Edward left Philippe almost all he claimed in France., 125774=In 1513, Julius II. died. Leo X., magnificent, expensive, and worldly, was elected. Henry VIII. crossed to Calais, and laid siege to Terouenne. He defeated the French, who tried to relieve it, at Guingatte, in what was called the Battle of the Spurs, joined Maximilian, and together took Tournai., 88867=In 1382, young Charles was conducted to put down the revolt of the Flemings, who were overthrown at the battle of Rosbecque., 197707=In 1670, Louis employed Henrietta Stewart, duchess of Orleans, to detach Charles II. from the triple alliance, and to accept French subsidies. A secret treaty was signed between them at Dover, in consequence of which France and England both declared war upon Holland on slight pretexts., 104597=In 1461, Margaret fled to Burgundy, and thence to France, with her son., 293145=SECOND SERIES. 1088-1228. Crown 8vo. 6 s., 177694=After eleven years, Charles was obliged to summon a Parliament in 1640 to obtain supplies; but he dissolved it in three weeks. The Scots entered England and occupied Newcastle, and Charles could obtain no effective support without reassembling Parliament. He did this, and brought together the LONG PARLIAMENT, which began by passing an act against its own dissolution. Having now an opportunity to, 230750=In 1748, the Peace of Aix-la-Chapelle was signed by all the sovereigns, leaving the boundaries of the kingdoms much in their old state, except that Prussia retained Silesia., 88089=There were evil influences about the king, against which the prince strove in vain till his death, in 1376., 150599=In 1567, the war broke out again, and old Montmorency was killed at the battle of St. Denys. War raged in many parts of France, but in general the, 171991=In 1626, the Parliament, instead of granting supplies for the war, impeached Buckingham, and was dissolved. Charles raised money by vexatious duties., 237905=In 1765, Grenville attempted to impose stamp duties on the colonies. The Americans vehemently resisted., 58314=In 1173, Ireland having been partially conquered by Richard, earl of Pembroke, and other Norman adventurers, was united to England, and Henry took the title of Lord of Ireland., 42054=Archbishop Ælfhæg was slaughtered in 1008. Æthelred fled to Normandy, in 1012. SWEND was owned king of England, in 1013, but died the same year. His son KNUD and EADMUND Ironside, son to Æthelred, fought until a treaty was made, and was followed by EADMUND's murder, in 1017. KNUD married Emma, ruled well and beneficently, became a Christian and went on pilgrimage to Rome. He died in 1036, and HARALD Harefoot reigned like a savage Dane till his death, in 1039, when his half-brother HARTHAKNUD succeeded, but on his death, in 1041, EADWARD, son of Æthelred, was restored by the great Earl Godwine. Having been bred in a Norman convent, he was very pious, and devoted to the Normans. He brought many to England, and hence arose fierce quarrels with Godwine and the English party. Nor near kinsman remained to Eadward, and he longed to make William of Normandy his successor, but died, in 1065, undecided between him and Harald Godwineson. HARALD was elected in 1066 by the nation, but William of Normandy, invading England, defeated and killed him at Hastings, and was crowned WILLIAM I., 174982=In 1634, the German princes offered Alsace to Louis if he would support them against the Emperor Ferdinand., 119267=In 1489, Henry VII. joined the alliance for the defence of Brittany., 88640=In 1380, Charles V. died, leaving his son, Charles VI., nine years old, to the guardianship of his uncles of Berry, Burgundy, and Anjou. Duguesclin died before the Castle of Rendom, and Clisson became Constable., 180456=In 1643, the king raised his standard at Nottingham, and the Civil War began. The party who esteemed the Church, and regarded strict loyalty to the king's person as their foremost duty, were of the Cavalier or Royalist party. Those who desired greater liberty in Church matters, and desired to bar the usurpations of the Crown upon the State, were on the Parliamentary or Roundhead side. In the battle of Edgehill, the king's best commander, Lord Lindsay, was slain, but the battle was indecisive., 154477=In 1570, Elizabeth was excommunicated by Pius V., and this placed all her Roman Catholic subjects in a hostile attitude to her., 128725=In 1520, Henry and François met to concert measures against Charles at Ardres, near Calais, each displaying such splendour that the place was called the Field of the Cloth of Gold; but Wolsey being in Charles's interest brought about a meeting between, 96296=In 1421, Scottish warriors came in large numbers to assist the French., 49898=In 1108, several cities in the rural fiefs were obtaining charters by which they were erected into communes, and obtained the right of self-government, and freedom from the interference of the court upon the payment of a fixed tax., 280607=In 1845, the potato crop universally failed; and Sir Robert Peel saw that the duty on foreign corn (the Corn Laws) could no longer be maintained. A great war; the Sikhs were defeated at Moodkee, Ferozeshah, and Aliwal., 213713=In 1700, on the death of the last child of Anne (daughter of James II.), an Act of Settlement was passed by which (members of the Church of Rome, 45095=War broke out between Philippe and William respecting the county of Le Mans. William burnt the city of Mantes, but there received a hurt which caused his death in 1087. He left the fief of Normandy to its natural heir, Robert, his eldest son., 175612=In 1635, Laud was made Archbishop, and carried on his reforms and prosecutions with great energy, embittering the Puritans to the last degree., 232384=In 1756, the French attacked and seized the Island of Minorca from the English. Admiral Sir George Byng was executed for not having exerted himself to relieve the garrison., 146902=François II., a sickly lad of fifteen, married to Mary of Scotland, was left under the tutelage of his mother, Catherine de Medicis, a subtle, unprincipled, clever woman, always striving to play off one party against the other. The heads of the Catholic party were the House of Guise; of the Huguenot, the house of Bourbon, namely Antoine (titular King of Navarre in right of his wife), and Louis, prince of Condé. The king and queen were almost entirely under the dominion of the Guises, and in 1560, the conspiracy of Amboise was formed by Condé for taking them out of their hands. It was detected, and the Bourbon princes were imprisoned, and in danger of their lives, when FRANÇOIS II. died. CHARLES IX., his next brother, was only nine, and Catherine, becoming regent, released Condé, and in 1561 caused conferences to be held at Poissy to see whether the Church could be reformed enough to reclaim the Huguenots; but these were broken up by the Catholic party, and an attack made by the attendants of the Duke of Guise on a Huguenot congregation at Vassy began the civil war. Condé, his brother, and the Admiral de Coligny led the Huguenots, and raised Normandy and Provence in their favour, laying siege to Rouen, where King Antoine was killed. Rouen was taken and plundered, and Condé advanced on Paris, but was encountered at Dreux by Guise and made prisoner., 160979=In 1590, Sixtus V. died. Clement VIII. became Pope., 103456=In 1456, the jealousy and suspicion between Charles VII. and his son became so great that Louis withdrew to Burgundy, and lived there under the protection of Duke Philippe., 155179=In 1576, Henry of Navarre, awakened from his long indolence, fled from court, returned to Calvinism, and took up arms. A peace was concluded, and Henri of Navarre returned to his hereditary states in Bearn. Alençon accepted an invitation from the insurgents in Flanders to place himself at their head. These Protestant alliances led the House of Guise and the more violent Catholics to form a league for the defence of the Church., 139312=In 1541, he married Catherine Howard, but, discovering levity before her marriage, beheaded her in 1542. James of Scotland invaded England; but his troops were miserably routed at Solway Moss, and he died of grief, leaving an infant daughter, Mary., 113062=Burgundy, as a male fief, reverted to France, but Flanders and Holland remained with Charles's daughter, Mary, who married Maximilian, heir of Austria. In 1478, Louis marched an army against her, but it was defeated by Maximilian at Terouenne., 215874=In 1705, the Earl of Peterborough, with an English army, tried to seat Charles on the throne of Spain. He gained great successes, but Charles's slackness disgusted him; he threw up the command and returned. Lord Galway was his successor, a Huguenot refugee., 281670=In 1847, the long-growing discontent in France was more and more felt; there was a general mistrust of the king and his minister Guizot., 142846=In 1550, the Prayer-book was revised and made more accordant with the taste of Dudley's Protestant advisors., 75638=In 1314, the Grand Master, Jacques de Molay, was burnt at the stake only a few months before Philippe's death., 81631=In 1349, the Order of the Garter was instituted. William of Wykeham was chancellor., 112479=Lorraine, the inheritance of the wife, and through her of the grandson, of Réné of Anjou, had been seized by Charles of Burgundy, who offered to buy off his claim; but young Réné, the true heir, leagued with the Swiss, and Charles suffered at their hands a terrible defeat at Granson in 1476. All Lorraine revolted, and the gates of Nancy were shut against him. He laid siege to the place in 1477, but there were traitors in his camp, and he was surprised in a night attack, and found lying slain by many wounds among the fugitives., 283520=In 1850, Sir Robert Peel was killed by a fall from his horse., 200109=In 1674, Parliament forced Charles into making peace with the Dutch., 99623=The Parisians opened their gates to the troops of Charles and expelled the English. The Duke of York, under Gloucester's patronage, became regent in France, but the public service was impeded by jealousies between him and the Duke of Somerset, head of the Beauforts. Cardinal Beaufort made an attempt at negotiation in 1439., 169472=In 1617, James held a parliament in Scotland, and endeavoured to restore Episcopacy there, and the use of the Liturgy; but furious tumults arose, and the clergy were ill-treated. Sir Walter Raleigh was released in the hope of his showing the way to an American gold mine; but he failed in this, and on his return was put to death on the old sentence for the plot in favour of Arabella Stewart. In truth, it was to gratify the animosity of the Spaniards., 113598=In 1482 Mary of Burgundy died from a fall from her horse, leaving two children, Philippe and Margaret., 54947=In 1165, Philippe, the son of Louis, was born., 46971=In 1095, at the Council of Clermont, Peter preached enthusiastically; hosts assumed the cross in pledge that they would free Jerusalem. Robert of Normandy pledged his dukedom to William II. to equip himself for the Crusade., 113321=In 1480, old king Réné died, having given up his right to Provence and to the kingdom of Naples to the king. A truce was concluded between Louis and Mary of Burgundy, by which his young son, Charles, was to marry her daughter, Margaret of Austria., 82641=In 1357, the dauphin Charles governed France. His third brother, Philippe, married the heiress of Burgundy, and founded a great ducal house. There was a terrible insurrection, called the Jacquerie, of the oppressed peasants against the nobles., 180969=In 1644, Charles, with his head-quarters at Oxford, met with varying success. Hampden was killed at Chalgrove Field. Oliver Cromwell rose into command in the Parliamentary army. The Royalists suffered a great defeat at Marston Moor., 212688=In 1697, worn out with the war, a peace was concluded by both nations at Ryswick, by which Louis acknowledged William as King of England, restored the cities in the Netherlands, and gave up his pretensions to the Palatinate., 152043=In 1569, Condé was killed in the battle of Jarnac, where the royalist troops were commanded by the Duke of Anjou, the king's brother., 168061=In 1616, the Abbé de Richelieu (soon Cardinal), the ablest man in France, began to gain influence. Albert de Luynes, a favourite companion of the king, engaged to free him from his thraldom. Concini was killed at the door of the Louvre, and his wife tried and put to death, while the queen-mother remained in a sort of captivity. The king was of a childish, weak nature, unable to exist without a favourite, and fell entirely under the dominion of De Luynes. The Government was showing a desire to elude the provisions of the Edict of Nantes; and the Huguenots, taking umbrage, in 1621 revolted, and garrisoned their towns. De Luynes was created Constable, and marched against them, taking the king with him. Montauban was taken and burnt; but on the march De Luynes was taken ill and died., 2286=January, 1871., 54668=In 1158, his second wife brought him only daughters, and he was weak, depressed, and unable to assert his rights, being constantly overreached by Henry, and little regarded by his other vassals, so that he was losing all that his father had gained for the crown., 212928=In 1700, Charles II. of Spain died childless. The direct heir was the Dauphin, but as, by the constitution of Spain, a foreign monarch was not eligible, he, 278179=In 1834, Lord Grey retired, and after a short ministry of Lord Melbourne, Peel and Wellington came into office., 278454=In 1838, an insurrection in Canada was quelled by Sir John Colborne., 51569=In 1125, Henry caused all his vassals to swear fealty to his daughter Maude, widow of the Emperor Henry V., and gave her in marriage to Geoffrey Plantagenet, son of Foulques of Anjou., 82900=In 1360, a treaty was signed at Bretigny ceding Aquitaine to the English princes, as vassals to the French crown. Jean was released, giving his sons as hostages., 81353=In 1348, Edward tried to marry his daughter to the Count of Flanders, but he escaped, and threw himself into the arms of France. A truce was made, partly from the exhaustion of both countries, which were alike ravaged by the terrible pestilence, the Black Death., 104907=In 1452, York claimed to be acknowledged as heir to the crown before the Beauforts. He raised an army but was made prisoner and forgiven. Henry fell into a state of imbecility, during which a son (Edward) was born to him in 1454. Meantime York acted as regent until Henry recovered in 1455, and recalled the Duke of Somerset, on which York took up arms, and fought at St. Alban's, where he obtained possession of the king's person, and held the government for a year; when Henry, recovering, tried in 1456 to bring about a reconciliation, and a festival called the Love-day was held, when York, Somerset, and all their partisans swore amity; but Nevil, earl of Warwick, brother-in-law to York, was the bitter enemy of the queen and Somerset, and the disputes broke out again. In 1459, at Blore Heath, a victory was gained by the Yorkists, and the next year at Northampton they made the king prisoner; and at a parliament held shortly after, it was determined that he should retain the crown for his life, but that York should succeed him. On this, Margaret, hotly indignant, raised an army in the north, and defeated and slew York upon Wakefield Bridge. But he was quickly revenged by his son Edward, who in 1461 defeated the Lancastrians at Mortimer's Cross, St. Alban's, and at Towton Moor, the bloodiest of English battles; threw the king into prison, and was crowned as EDWARD IV. He was a youth of great talents, but proud, licentious, and indolent. He married, secretly, Elizabeth Wydville, widow of Sir John Gray, a Lancastrian knight., 115199=In 1480, there was a short war with Scotland., 187219=In 1650, Cromwell put down the rebellion in Ireland by measures of terrible severity. Charles II., then in Holland, was invited by the Scottish Covenanters to assume the crown. He came to Scotland, and took the covenant, but his party were defeated by Cromwell at Dunbar. Nevertheless, the indignation excited by his father's death made many regard him with favour, and in 1651 he entered England; but the Scots Covenanters and English Royalists did not easily coalesce, and Cromwell defeated them, first at Preston, and afterwards at Worcester, while Montrose, making a vain attempt in Scotland, was taken and hung. Charles, after wandering in diguise, reached France in safety, and Cromwell was all-powerful in England, nominally as the general appointed by Parliament, but really as entirely by the support of the army., 39209=In 1060, PHILIPPE I., a mere child, succeeded. His minority was of less consequence because his power was almost null. The castles which rose on every hill were almost impregnable, and each baron was a little lawless prince. The only check on their violence was in the strong force of their faith. They were often not withheld from great barbarity, but they usually owned their guilt, and tried to expiate it by penances, pilgrimages, and gifts to the Church., 199445=In 1675, Turenne was killed at Saspach, on the Rhine, and was greatly lamented as one of the greatest generals and noblest men produced by France., 90437=In 1389, Richard tried to regain his power, but was too unpopular to succeed except by the support of Lancaster, who aided him against Gloucester's ambition. Gloucester stirred up the discontent of the country against the cessation of the war, and constantly browbeat his nephew the king., 171091=In 1625, Charles I. married Henrietta Maria. Buckingham, who was sent to fetch her, gave great offence at Paris by his insolent airs, and was much incensed against Richelieu., 212254=In 1695, the Duke of Savoy began to obtain some advantage., 278104=In 1833, slavery was abolished in all the English colonies., 195555=In 1664, the Pope was reduced to make peace on humiliating conditions., 65921=In 1217, the troops of Louis were defeated at Lincoln, by the barons, and his fleet bringing reinforcements by Hubert de Burgh, off Dover; whereupon he resigned his pretensions and left England. Young Henry was protected by the Pope as a Church vassal, and was under the guardianship of Hubert de Burgh, who governed well; but the country suffered much from papal exactions, and the wastefulness of the king and his court., 148580=In 1560, the Scots rose against Mary of Guise, their queen-regent, and Elizabeth assisted them., 203578=In 1679, the Act of Habeas Corpus, making it illegal to keep a person in prison without trial, was passed. In Scotland, the Covenanters murdered Archbishop Sharpe, and a bitter war broke out between Government and the Covenanters., 165846=In 1610, HENRI IV. was stabbed in his carriage by a fanatic named Ravaillac. His son, LOUIS XIII., was but eight and a half, and the regency was taken, 210079=In 1690, William defeated James and his Irish and French allies at the battle of Boyne Water., 52425=In 1137, after long feebleness, Louis VI. died. LOUIS VII. succeeded at seventeen, the affairs of the kingdom being still conducted by Suger., 248230=In 1791, Mirabeau, in whom the royal family had some hope, died. Their situation amid daily insults, imprisoned in their own palace, was intolerable, and they tried to escape; but were captured at Varennes,, 59589=In 1191, on his voyage to Acre, Richard conquered the isle of Cyprus., 47210=In 1097, Godfrey, duke of Lorraine, was chosen leader of the crusading army. Bohemund and Tancred, Apulian Normans, were the chief heroes; and after a march overland, and severe warfare, Jerusalem was taken in 1099, and Godfrey elected king of the Latin kingdom there established., 175417=In 1634, the ancient contribution of all towns and villages towards the navy was revived under the name of ship-money, and, being arbitrary, was regarded as vexatious and illegal., 231473=In 1752, the Gregorian Calendar (new style) was adopted., 179211=In 1643, Mazarin, an Italian ecclesiastic trained under Richelieu, succeeded to his post, became a cardinal, and carried out his policy, with more suavity and less harshness, but quite as much determination. He placed Louis de Bourbon, duke d'Enghien, eldest son of the Prince of Condé, at the head of the army, where he soon showed himself, though still very young, one of the greatest of French generals. Louis XIII. died. His son, LOUIS IV., was only five years old, and the regency was given to his mother, Anne of Austria, who gave all her confidence to Mazarin. Enghien won the great battle of Rocroy, and destroyed the fine old Spanish infantry., 154830=In 1574, Charles IX., a miserable prey to remorse, died, and HENRI III. came to the crown, returning from Poland. He was a strange compound of courage and indolence, cruelty and effeminacy., 143808=In 1553, Edward VI. died, and Jane was proclaimed in London; but the country would not accept her, and MARY obtained the crown. She at once restored the old Roman Catholic ritual, and Archbishop Cranmer was sent to the Tower, for having supported Jane. An insurrection on Jane's behalf by Sir Thomas Wyatt led to her being beheaded. Mary married Philip, son to Charles V., and Cardinal Pole reconciled England to Rome., 232195=In 1755, Maria Theresa, in the desire to recover Silesia, allied herself with France and Russia, and commenced the Seven Years' War, in which England took part with Prussia., 87888=In 1372, the Black Prince returned to England in broken health and spirits, to find his father prematurely aged, and his next surviving brother, John, duke of Lancaster, in great power., 103644=Charles VII. was called le bien servi, and his nobles were certainly men of distinguished courage and patriotism. The discipline he had established in his army rendered his soldiers some of the best troops, and his guard of Scottish archers rendered him able to exert his authority. The kingdom began to recover prosperity, and was in a better state than since the English wars began; but the king lived in a state of miserable suspicion, and died at length in 1461 from fear of taking food lest he should be poisoned., 138362=In 1539, Henry passed a law, called the Six Articles, which bound persons strictly to the old faith, but denied the Pope's supremacy. He suppressed the larger monasteries, making grants of their lands to his favourites., 128566=In 1518, Maximilian's death brought his grandson CHARLES V. to the Imperial throne. He was already lord of the Low Countries and king of Spain., 162757=In 1598, Philip II. died., 169941=In 1621, the Commons made a protestation of their rights, but the king scorned and tore it up., 152350=In 1570, a peace was made at St. Germain, and the Calvinists received certain cities as securities; but while they held aloof from court they grew so strong in the provinces as to keep Catherine alarmed and jealous. She resolved to cajole the heads of the party., 279362=In 1841, the English troops who had occupied Cabul were attacked by the natives, and most disastrously destroyed in the Khyber pass. The Whigs resigned. Sir. R. Peel was at the head of the cabinet., 148809=In 1562, the Huguenots asked the aid of Elizabeth, and placed the port of Havre de Grace in her hands., 119874=In 1491, Henry, on pretext of the French war, levied large contributions from his people by the name of benevolences., 61761=On Agnes' death, in 1201, he took back Ingeborg, and the censure was removed. This anxiety ended, he again supported Arthur against John, giving him a small army, but Arthur, while attacking the castle of Mirabeau, in 1202, was surprised by John, made prisoner, and put to death secretly. Philippe summoned John, as his vassal, to answer for the murder, and on his non-appearance declared his fiefs forfeit to the crown, and seized Normandy, Anjou, and Poitou, in 1203, with little endeavour on John's part to defend them. Guienne and Brittany passed to Alix, a sister of Arthur, on the mother's side., 88212=In 1377, Edward III. died, and was succeeded by his grandson, RICHARD II., at twelve years old, under the tutelage of his uncles of Lancaster, York, and Gloucester., 167807=In 1613, his daughter Elizabeth married the Elector Palatine of the Rhine., 38885=HENRI I. came to the throne in 1030, a dull and feeble king; in fact the Counts of Paris were at first far less powerful as sovereigns than as vassals. The Abbey of Bec was founded in 1031, and became a great centre of spiritual life, leading to a great increase of vigour and holiness in monasticism., 102812=In 1450, the Kentish peasants revolted under Jack Cade, complaining of the French queen's government, and of the exactions in courts of law. They sacked London, committed some murders, but soon dispersed., 171572=In 1624, Princes Charles and the Duke of Buckingham made a romantic journey to Spain to see the princess intended for Charles; but Spanish etiquette denied him all access to her, and the marriage was broken off., 97505=In 1428, the English endeavoured to extend their conquests beyond the Loire, and besieged the city of Orleans, defeating the French, who tried to cut off their supplies, at the Battle of the Herrings, in 1429. The peril of the country roused high religious enthusiasm in a peasant girl named Jeanne d'Arc. She roused such spirit in the army that she saved Orleans, and conducted Charles VII. in triumph to be crowned at Rheims; but the French king and nobles never really appreciated her, she was ill-supported, was taken by the English and Burgundians, who put her to death at Rouen as a witch in 1431., 278802=In 1841, the great Napoleon's remains were brought home from St. Helena and buried at the Hôtel des Invalides with great enthusiasm., 116515=In 1484, the Duke of Brittany, François, received and sheltered Henry Tudor., 68621=In 1257, Richard, earl of Cornwall, was elected King of the Romans by the Pope's influence in Germany. The knights of the shire and burgesses assembled in Parliament., 92010=In 1399, on his father's death, Henry returned, ostensibly to claim his inheritance; but, finding the great family of Percy and the people willing to join him, he obtained the crown, and deposed Richard, who perished in captivity, in 1400., 193069=In 1661, Mazarin died, and Louis XIV. began to govern in person, and became the great centre of everything in France. He was a man of great ability and industry, and with a majesty of demeanour that rendered him one of the most personally revered sovereigns who ever lived. His courtesy was perfect, but his pride and ambition were as overweening as his selfishness. He had no feeling for any one but himself, and his people worshipped him contentedly., 173563=In 1629, the Commons remonstrated against the enforcement of Ritual, and against the oppressive duties. Seven members were imprisoned, Parliament dissolved, and Charles endeavoured to do without one. This led to reviving all the old customs by which money could be raised, especially fines levied by the court called the Star Chamber, and the grant of monopolies, which excited great discontent. Bishop Laud's endeavours at strict discipline in the Church enraged the Puritans., 98525=In 1429, the rule was established that knights of the shire, i.e. members of Parliament, must be elected by freeholders., 138806=In 1542, François renewed the war by attacking Navarre, and called the Moors to attack Spain and Italy, giving them shelter at Marseilles while they ravaged the coast., 139045=In 1542, Scotland was led into war with England by France., 40235=A panic prevailed that the Judgment was to come in 1000. Lands were not sown, and a horrible famine ensued. The Church established that on the three sacred days of the week, and at holy seasons, fighting in private brawls was sacrilegious. This was called the Truce of God, and somewhat mitigated the savagery of war. The Normans became the most ardent of knights. Adventurers from Normandy conquered Sicily and Apulia in 1027. RICHARD II. of Normandy died in 1028, his son RICHARD III. in 1035. ROBERT, the next brother, died on pilgrimage, leaving the duchy to his young child WILLIAM, who had a most perilous minority, but by wonderful vigour and sagacity put down all his enemies, and became the greatest man in France., 45474=In 1073, Robert, William's eldest son, demanded the dukedom of Normandy, and being refused, rebelled, was defeated, and went into exile. Domesday-book, a census of the kingdom, was drawn up by the king's orders, and he did all in his power to promote order and justice. The Church, hitherto slack and ill-disciplined, was brought into closer connection with Rome, and reformed by Lanfranc, the king assisting with real faith, devotion, and conscientiousness., 141616=The Scottish queen-mother's affection for her native country induced her to send the young queen, Mary Stewart, to Paris, in 1548, as the affianced of the dauphin François., 171281=In 1626, Buckingham persuaded Charles into declaring war against France., 213361=In 1694, the Bank of England was established, in order to arrange for the loans that the war required Government to ask from individuals, thus forming the National Debt., 154620=In 1572, the Duke of Norfolk was tried, condemned, and executed., 188064=In 1652, the Navigation Act, restricting trade with the East and America to English ships, injured the commerce of Holland. Dutch ships had been searched to see whether munitions of war were being conveyed to the Royalists, and a war broke out between Holland and the Commonwealth., 272058=In 1817, Princess Charlotte, heiress to the throne, died., 56755=In 1179, Louis crowned his son PHILIPPE II. (Auguste), and soon after died (in 1180), leaving the throne to a successor of much greater abilities and stronger determination, resolute to recover the power of the crown., 155035=In 1575, his younger brother, the Duke d'Alençon, tired of the court, fled and put himself at the head of the Calvinists., 154339=In 1569, the Duke of Norfolk offered his hand to Mary. He was sent to the Tower, and her imprisonment made more stringent., 212554=In 1694, Luxemburg died, and with him much of the superior strategy of France, so that William began to regain ground., 82033=In 1355, Edward espoused the cause of Charles I. (the Bad), king of Navarre, who claimed fiefs in Normandy, as Count of Evereux, and was the bitter enemy of Jean., 110419=Quickly rallying, however, Edward returned in 1471, defeated and slew Warwick at Barnet, and at Tewkesbury made prisoner and slew Edward of Lancaster. Henry VI. was privately put to death in the Tower. The king was much swayed by the kinsmen of his wife, the Wydvilles and Grays., 222301=In 1716, the insurgent Lords Derwentwater and Kenmuir were beheaded., 162462=In 1598, Henri granted to the Huguenots equal rights and liberty of conscience by a decree which, being registered in Brittany, was known as the Edict of Nantes., 99032=In 1436, a brilliant chivalry began to grow up around Charles. The Count de Richemont was the ablest of his leaders, and many irregular enterprises were undertaken, usually to the profit of the French; but the lawlessness and insubordination were extreme, and the country was dreadfully pillaged and oppressed, until Charles, reviving from his sloth, modelled his army, brought the men under discipline, and put down the bands of marauders, in 1440., 278306=In 1837, William IV. died, and VICTORIA, his niece, came to the throne. Hanover passed to the male heir, her uncle, Ernest Augustus., 225005=In 1727, George I. died, in Hanover; his son GEORGE II. succeeded, and made peace with Spain by the treaty of Seville. Walpole continued prime minister, and, with the assistance of Queen Caroline, so ruled the king as to keep England neutral and peaceable, without interfering in the continental disturbances. Caroline was the real ruler of England, and affairs went well, except for violent quarrels with Frederick, Prince of Wales, until her death, in 1737., 56060=In 1161, Thomas à Becket was made primate, and resisted the demand of the king at the Council of Clarendon (in 1164), that the clergy should be subjected to secular law. Being driven into exile, he appealed to the Pope; and Henry, being in fear of excommunication, caused his eldest son, Henry, to be crowned in 1170, to reign jointly with himself. A partial reconciliation was effected, and Becket returned to England, but was immediately after murdered by four of Henry's knights., 81233=In 1346, David II. invaded England, but was defeated and made prisoner at Nevil's Cross, in 1347., 225823=In 1735, peace was made on Austria giving up the duchy of Lorraine to Stanislas, to revert to France upon his death. Compensation being given to the duke who had married the heiress of Austria., 115065=In 1478, George, who had never been trusted by Edward since his treason, was sent to the Tower and there put to death., 88522=In 1379, there was a great revolt of the Flemish towns, who expelled their Count, Louis le Mâle., 214840=In 1701, James II. died, and his claims passed to his son James Francis, called the Chevalièr or the Pretender., 159734=In 1588, Philip II., who had long been meditating a great attack on England, now mustered all his forces, and though delayed by the bold attacks of Drake on the ships in Cadiz and Lisbon bay, sent forth the huge armament called the Spanish Armada; but after being harassed by the English fleet the whole length of the Channel, it was destroyed by storms in the German Ocean, and all Spanish hopes of subduing England thus ended. The Earl of Leicester died the same year., 171799=In 1625, James I. died, and was succeeded by CHARLES I., who was devotedly attached to Buckingham, and much under his dominion; but the favourite was hated by the whole nation., 191411=In 1658, a plan was formed between Cromwell and Mazarin for conquering Flanders, and dividing it between France and England. Dunkirk was besieged by the French, under Turenne, with English allies. Its relief was attempted by Condé and the Spanish army, with the English princes in it. The battle of the Dunes was lost by Condé through Spanish obstinacy, and Dunkirk yielded, and was put into the hands of the English., 71760=In 1274, EDWARD I. returned home, and was crowned. He was the first to see his true strength as head of the English nation, and to heed home rather than foreign politics. He ruled well and wisely, and knew where to give way to his nobles. Good order and justice were established. After much treachery and violence from the native princes of Wales, he subdued them in 1277, and the Principality was given to his son, Edward of Caernarvon., 286711=In 1859, on fresh demands for the extension of the suffrage, the Derby Ministry resigned and Lord Palmerston came in., 152628=In 1571, Jeanne of Navarre and Coligny were invited to court, and a marriage arranged between Jeanne's son Henri and the king's sister Marguerite. Soon after her arrival, Jeanne died (in 1572); but HENRI came to Paris with an immense train of Huguenots for his wedding. Four days later, on St. Bartholomew's day (Aug. 24), Guise and his followers, with the people of Paris, rose on the Huguenots and massacred them by thousands. Coligny and all the principle nobles were killed; the same massacre took place in other cities, and the young King of Navarre abjured his faith to save his life, and remained, watched and guarded, at court. The war burnt feebly on., 199288=In 1674, at Seneff, the Prince of Condé fought his last and the Prince of Orange his first battle. It was very bloody, but indecisive., 130497=In 1522, Leo X. died, and Adrian VI., Charles V.'s tutor, was elected to the Papacy. Henry VIII. joined the league with the Emperor against the French., 203824=In 1680, the Protestant party were so strong as to prosecute the Duke of York as a Popish recusant, and force him to leave England. The Commons passed a bill to exclude him from the succession, but it was thrown out by the Lords., 54539=In 1152, Alienor's conduct was so disgraceful that Louis divorced her, though he thus lost all her huge domains., 167738=In 1612, James's eldest son, Henry, died at nineteen., 72727=In 1294, PHILIPPE IV. invaded the dominions of Guy Dampierre, count of Flanders, Edward's ally. Edward endeavoured to succour him, but his hands were tied by his Scottish war and by the refusal of his barons to serve beyond the sea or grant supplies. He gave up attention to the Continent to concentrate it on England, and after a voyage to Flanders, when want of means crippled him, he made a truce with Philippe., 87313=In 1375, Lancaster marched from Brittany to Bordeaux without once meeting an enemy, but arrived exhausted in men and money., 79049=In 1333, after Bruce's death, the Scots broke the truce, upon which Edward set up Balliol's son as King of Scotland, and, while DAVID II. (son to Bruce) fled to France, endeavoured to subdue the country.}",
    "lastModified": "Fri, 05 Jun 2009 21:16:23 GMT",
    "textBeforeTable": "PERIOD OF ROMAN CONQUEST. PARALLEL HISTORY OF FRANCE AND ENGLAND. [Page 1] [Page] January, 1871. CHARLOTTE M. YONGE. The desire of brevity has necessarily produced great dryness and some dogmatism, but I trust that this may be excused in what is necessarily more a book of reference than of study; and that at any rate young people may be assisted in grasping the mutual relation of events. Tables of succession have not been given, as these are everywhere easily to be met with, nowhere better than in the \"Synoptical History of England\" published by Messrs. Walton, which for England alone is excellent, and which has greatly assisted me in drawing up these Parallels. THIS tabular history has been drawn up to supply a want felt by many teachers of some means of making their pupils realize what events in the two neighbour countries were contemporary. Probably this never was so well done as in Stork's \"Stream of Time,\" a new edition of which I hope, with able assistance, in time to prepare and correct up to the present state of modern discovery. This, however, can consist of nothing but the briefest tabulated catalogue of names and dates; and the nations who have always been so closely intermingled, for mutual evil or good, require something more detailed. I have, therefore, tried to construct a skeleton narrative of the chief transactions in either country, placing a",
    "textAfterTable": "    The Emperor Claudius renewed the attempt to subdue Britain, A.D. 43. Colonies were established at Verulamum and Londinum; and the brave Silurian chief Caradog (Caractacus) was brought as a prisoner to Rome. The Isle of Mona was devastated by the Roman governor Suetonius in the endeavour to destroy Druidism, A.D. 59. In the meantime, Boddwy (Boadicea), widow of the chief of the Iceni, suffered insults from the Romans which roused her to revenge. The barbarous tribes under her massacred the colonists at Verulam and Camulodunum, but on Suetonius's arrival were defeated, and Boddwy committed suicide. A.D. 69.–The first revolt against Roman power took place under Civilis, a Belgian trained in the Roman army. It was put down and punished with great severity.     A.D. 77.–Christians, apparently from Asia Minor, were planting the Church in Gaul, and making numerous converts at Lyons and Vienne.   Agricola became proconsul A.D. 77, and completed the subjection and civilization of southern Britain; after which he attempted (A.D. 84) the conquest of Caledonia, the northern part, but was bravely resisted by Galgacus, and could obtain no footing farther north than the Grampian Hills.  A dreadful persecution of Christians broke out (A.D. 177) at Lyons and Vienne, in which",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}