{
    "relation": [
        [
            "Patent application number",
            "20090043727",
            "20090271246"
        ],
        [
            "Description",
            "System and Method for Stepped Loading of Web Page Content - A system and method for integrating customized content with the main content of a Web page where the customized content is generated after the main content has been loaded within a browser application of a client computer is disclosed. The system and method of the present invention maintains information relating to the main content of a Web page in a memory cache which is then used to locate offer content that is relevant to the main Web page content. The offer content may then be transmitted to the client computer where it is integrated with pre-loaded main content within a Web page.",
            "MERCHANT RECOMMENDATION SYSTEM AND METHOD - Automated generation of a merchant recommendation list is disclosed. When a financial processor obtains rich and relevant information related to consumers and merchants, collaborative filtering, profiling, clustering and predictive modeling techniques are combined to provide merchant recommendations to a consumer. The system analyzes consumer attributes which relate to target consumer attributes to create a target consumer cluster, creates associations based upon merchant attributes and the target consumer attributes and provides the feedback based on the associations."
        ],
        [
            "Published",
            "02-12-2009",
            "10-29-2009"
        ]
    ],
    "pageTitle": "Jeffrey J. - Patent applications",
    "title": "",
    "url": "http://www.faqs.org/patents/inventor/jeffrey-j-7/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988840.31/warc/CC-MAIN-20150728002308-00182-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 439079095,
    "recordOffset": 439048968,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Jeffrey J. Harouche, Great Neck, NJ US 05-16-2013 IN SITU HOLDER ASSEMBLY - An in situ optical specimen holder is disclosed which allows imaging and analysis during dynamic experimentation. This holder assembly includes a set of focusing and reflection optics along with an environmental cell. Electromagnetic radiation can be used to optically excite the specimen in the presence or absence of fluid and the source of such radiation may be located within the body of the holder itself. The spot size of the irradiation at the specimen surface can be varied, thus exciting only a specific region on the specimen. The window type cell provides a variable fluid path length ranging from the specimen thickness to 500 μm. The holder has the provision to continuously circulate fluids over the specimen. The pressure within the cell can be regulated by controlling the flow rate of the fluids and the speed of the pumps. 20130119267 01-17-2013 CRYOGENIC SPECIMEN HOLDER - An improved cryogenic specimen holder for imaging and analysis facilitates imaging at very high tilt angles with a large field of view. A retractable specimen holder tip protects the specimen during transport. An optimized Dewar design is positioned at a fixed, tilted angle with respect to the axis of the holder, providing a means of continuously cooling the specimen irrespective of the high tilt angle and amount of liquid nitrogen present in the vessel. The Dewar neck design reduces entrapment of nitrogen gas bubbles and",
    "textAfterTable": "Jeffrey J. Helline, Port Clinto, OH US Patent application number Description Published 20100162928 CLEANING TRAY - A cleaning tray for the improved cleaning of surfaces is provided. The tray is releasably engagable with a plurality of different shaped horizontal surfaces, and allows the horizontal surface to overhang at least a portion of a collecting portion, with detritus easily swept from the horizontal surface into the collecting portion, and thence into a waste container. 07-01-2010 Jeffrey J. Hendron, Elkton, MD US Patent application number Description Published 20100015895 Chemical mechanical polishing pad having electrospun polishing layer - Chemical mechanical polishing pads having an electrospun polishing layer are provided, wherein the electrospun polishing layer has a polishing surface that is adapted for polishing a semiconductor substrate. Also provided are methods of making such chemical mechanical polishing pads and for using them to polish semiconductor substrates. 01-21-2010 Jeffrey J. Hilde, Ridgecrest, CA US Patent application number Description Published 20080252874 Ladar Stream Formatting and Processing Method - A Lasar Stream format is provided which is a logical structure that encapsulates Ladar sensor data generated by a Ladar sensor. The data is packaged into message structures for transmission over a transport medium. The messages form a data stream and when the messages arrive at a destination the messages are processed and made available for use",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}