{
    "relation": [
        [
            "Patent application number",
            "20090111928",
            "20100075420"
        ],
        [
            "Description",
            "Novel Macromonomers and Hydrogels - Macromonomers capable of both physical crosslinking and chemical crosslinking. The combination of chemical crosslinking and physical crosslinking provides the ability to generate rapidly gelling hydrogels for many different applications. Moreover, the macromonomers may incorporate functional groups that allow for two different gelation mechanisms—thermal gelation and ionic gelation—further improving mechanical stability of hydrogels formed from the disclosed macromonomers.",
            "Novel Gene Delivery Vectors for Human Mesenchymal Stem Cells - Novel gene delivery vector compositions that interact with human mesenchymal stem cells are provided, as well as methods of synthesizing and using such compositions. Such compositions may comprise a plurality of hyaluronic acid hexamers covalently attached to a branched polyethylenimine. Such methods of synthesis may comprise providing a plurality of hyaluronic acid hexamers and a branched polyethylenimine, and allowing a hexamer of hyaluronic acid to covalently attach to a branched polyethylenimine to form a conjugate. Such methods of use may comprise providing a conjugate comprising a plurality of hyaluronic acid hexamers covalently attached to a branched polyethylenimine, and administering the conjugate to a cell."
        ],
        [
            "Published",
            "04-30-2009",
            "03-25-2010"
        ]
    ],
    "pageTitle": "Hacker, DE - Patent applications",
    "title": "",
    "url": "http://www.faqs.org/patents/inventor/hacker-de-5/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987174.71/warc/CC-MAIN-20150728002307-00066-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 431125683,
    "recordOffset": 431107115,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Michael C. Hacker, Leipzig DE 05-17-2012 REGULATING ELEMENT - The invention relates to a regulating element ( 20120121346 Published Description Patent application number Michael Hacker, Nuemberg DE 06-20-2013 FINE MACHINING TOOL - A reamer having a cylindrical cutter part ( 20130156520 01-03-2013 SETTING MECHANISM FOR A SETTABLE TOOL HOLDER ADAPTOR, AND TOOL ADAPTOR - A setting mechanism for a settable tool holder adapter includes a differential screw having two thread portions of differing pitch but identical direction of hand and a pressure piece having a pressure piece thread. One of the thread portions of the differential screw is screwed into the thread of the pressure piece. 20130001900 Published Description Patent application number Michael Hacker, Nurnberg DE 03-26-2015 METHOD FOR DERIVING MELANOCYTES FROM THE HAIR FOLLICLE OUTER ROOT SHEATH AND PREPARATION FOR GRAFTING - The present invention relates to the field of biology and medicine, and more specifically, to the field of stem-cell biology, involving producing or generating melanocytes from stem-cells and precursors derived from human hair root. Additionally, the present invention relates to the materials and method for producing autografts, homografts or allografts comprising melanocytes in general, as well as the materials and methods for producing autografts, homografts and allografts comprising melanocytes for the treatment of diseases related to depigmentation of the skin and for the treatment of scars. 20150086513",
    "textAfterTable": "Oliver Hacker, Horb DE Patent application number Description Published 20080286065 Undercut Anchor - The invention relates to an undercut anchor ( 11-20-2008 20080310930 Method, Anchor and Drill for Anchoring the Anchor in an Anchoring Substrate - The invention relates to a method for anchoring an anchor ( 12-18-2008 20090022568 SELF-TAPPING CONCRETE SCREW - In order to improve the holding force of a self-tapping concrete screw ( 01-22-2009 Patent applications by Oliver Hacker, Horb DE Peter Hacker, Munchen DE Patent application number Description Published 20110275747 STABILIZER SYSTEMS FOR POLYMERS CONTAINING HALOGEN - The present invention relates to a stabilizer system for polymers containing halogen, comprising an alkaline earth metal double carbonate of the formula (A) 11-10-2011 Roland Hacker, Isenbuttel DE Patent application number Description Published 20130314540 ARRANGEMENT FOR AN IMAGE RECORDING DEVICE IN A VEHICLE - An arrangement for an image recording device in a vehicle having an image recording device for recording image data. The arrangement includes a carrier part which can be positioned on the vehicle with the front side of the",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}