{
    "relation": [
        [
            "Stats",
            "2013",
            "2014"
        ],
        [
            "GS",
            "27",
            "11"
        ],
        [
            "IP",
            "186.2",
            "77.1"
        ],
        [
            "W-L",
            "10-8",
            "4-4"
        ],
        [
            "ERA",
            "3.33",
            "4.42"
        ],
        [
            "FIP",
            "3.03",
            "3.28"
        ],
        [
            "WHIP",
            "1.098",
            "1.177"
        ],
        [
            "BB/9",
            "1.3",
            "0.9"
        ],
        [
            "K/9",
            "7.3",
            "9.8"
        ],
        [
            "WAR",
            "2.8",
            "0.2"
        ]
    ],
    "pageTitle": "Grading the Top 50 MLB Players After 2 Months of Baseball | Bleacher Report",
    "title": "",
    "url": "http://bleacherreport.com/articles/2076785-grading-the-top-50-mlb-players-after-2-months-of-baseball",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987174.71/warc/CC-MAIN-20150728002307-00090-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 24974899,
    "recordOffset": 24889392,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{259154=An absolute beast since joining the Texas Rangers in 2011, Adrian Beltre has quietly put together a fantastic MLB career, and his 71.9 WAR ranks seventh all-time among third basemen and ahead of Hall of Famers like Ron Santo, Home Run Baker and George Kell., 245689=After winning the NL batting title and taking home NL MVP honors in 2012, Buster Posey took a step back at the plate last year, but he was still the most productive offensive catcher in the league outside of Yadier Molina., 277449=Just as no one expected Chris Davis to explode for 53 home runs and 138 RBI last season, few, if anyone, expected him to duplicate those numbers in 2014. That being said, his power is for real, and he was expected to be very much among the leaders in those categories once again this season., 141078=After posting the worst numbers of his career in 2012, Jon Lester bounced back with a solid regular season last year before taking his game to another level once October rolled around. He finished the postseason 4-1 with a 1.56 ERA in six starts, including 2-0 with just one run allowed in 14.4 innings during the World Series., 132328=He launched career home run No. 500 back on April 22, and he has the power strike working once again this season. The Angels are off to a great start, and with Josh Hamilton landing on the disabled list after a hot start, Pujols' production has been that much more important., 277759=A three-homer, five-RBI game on May 20 against Pittsburgh helped boost his season numbers, but for the most part he has been slow out of the gate in 2014. It's worth noting that he has improved his walk rate (10.7 to 14.3 percent) and decreased his strikeout rate (29.6 to 27.3 percent), and that should show up significantly in his on-base percentage before the season is over., 182046=He's finally been healthy this season, and the results have been staggering, as he leads the NL in home runs and RBI while hitting .318/.413/.621 in the process for the fourth-best OPS in the league at 1.034. As long as he stays healthy, he could have a monster 2014., 323381=With just one home run and seven RBI last September, and a .735 OPS and two home runs over the first month of the season this year, Miguel Cabrera was starting to look downright human heading into the month of May., 186566=He is never going to have a high on-base percentage, but a solid batting average and plus power make up for that. He is not off to the best of starts here in 2014, but a few more home runs would put his triple-slash numbers right in line with last season., 127486=The Seattle Mariners' decision to re-sign Hisashi Iwakuma to a two-year, $14 million deal after the 2012 season didn't grab many headlines, but it proved to be a brilliant decision by the front office., 309691=The reigning NL MVP, Andrew McCutchen played a huge part in leading the Pittsburgh Pirates to their first playoff appearance since 1992 last year, and he has been asked to shoulder the offensive load for the past several seasons., 168153=Last season, the Washington Nationals were 65-53 when Bryce Harper was in the lineup, compared to just 21-23 when he was sidelined with various injuries. He's been bit by the injury bug once again this season, as thumb surgery will sideline him until at least July., 241178=One of the faces of the MLB and a bona fide superstar, Evan Longoria bounced back from an injury-plagued 2012 season to play 160 games last year, and he helped lead the Tampa Bay Rays to their fourth postseason appearance in the past six seasons., 204483=Through his first eight starts in 2014, Jose Fernandez was probably the best pitcher in all of baseball, as any thoughts of a sophomore slump were thrown out the window. He had the Miami Marlins looking like legitimate contenders a year after the team lost 100 games., 122877=Manny Machado suffered a gruesome knee injury in the final weeks of the 2013 season, and he was still recovering from the subsequent surgery when Opening Day rolled around this year. It ended up costing him the first 24 games of the season, and he has yet to hit his stride at the plate since returning., 254709=Since the start of the 2008 season, Cliff Lee has gone 85-50 with a 2.89 ERA and averaged 31 starts and 222 innings per year. He is undoubtedly one of the top arms in the game today., 172708=Undoubtedly the most dominant closer in baseball since taking over the job full time in 2011, Craig Kimbrel has converted 151 of 168 save chances over that span with a 1.52 ERA and a ridiculous 377 strikeouts in 225.1 innings., 263693=Had he played a full season, Hanley Ramirez may have walked away from 2013 as the NL MVP. Thumb and hamstring injuries limited him to 86 games, but he still managed 25 doubles, 20 home runs and 5.4 WAR while sporting a hefty 1.040 OPS., 113731=After averaging 40 home runs and 113 RBI per season from 2007 to 2011, Prince Fielder saw his production dip a bit with the move to Detroit, as those averages fell to 28 home runs and 107 RBI over the past two years., 259430=A strained quad cost him 14 games at the beginning of the season, and he posted a .686 OPS with zero home runs in April, but he has turned things on this month with a .856 OPS, five home runs and 15 RBI. He is again showing why he is one of the most feared hitters in the American League., 319092=He has not posted an ERA under 3.00 since he led the league with a 2.27 mark and won AL Cy Young honors back in 2010, but he's off to a great start this year. With an AL-best 2.21 FIP, there is no reason to think he can't keep pitching like he has through his first 12 starts and once again put himself in the Cy Young conversation., 136569=The Los Angeles Dodgers signed Zack Greinke in hopes that he could provide them a second ace behind Clayton Kershaw, and after an inauspicious start that saw him sidelined for a month after fracturing his collarbone in an April brawl, he returned and gave them just that., 132022=Slowed and eventually sidelined for the year with a foot injury, Albert Pujols failed to reach the 30-home run mark for the first time in his storied career last season. He may never again be the dominant force he was in St. Louis, but he's having a nice bounce-back season here in 2014., 159115=He has not reached the 30-home run mark since his final season in San Diego back in 2010, but Adrian Gonzalez remains one of the game's most consistent run producers, and he's off to another nice start in the middle of the Los Angeles Dodgers lineup., 232104=After he missed the final month of the 2013 season following a concussion, the Twins made the decision to move Joe Mauer to first base full time this season, as they look to get the most out of the five years and $115 million remaining on his contract., 118405=Matt Carpenter was a revelation in his first full season in 2013, as he led the National League in hits, doubles and runs scored while providing the St. Louis Cardinals with a huge spark atop the lineup., 177197=Though teammate Jordan Zimmermann won an NL-best 19 games last season, Stephen Strasburg had better peripheral numbers with a 3.00 ERA, 3.21 FIP, 1.049 WHIP and 9.4 K/9. However, he finished 2013 just 8-9 in 30 starts, as he has yet to put together that truly dominant campaign everyone is waiting for., 102958=Attention: This is not a list of the 50 best players of 2014, or everyone's grade would simply be an \"A\" and this entire exercise would be pointless. Instead, this is a list grading the performance of who I viewed as the MLB's top 50 players back in March, based on an article I wrote prior to the season starting., 103492=With two months of baseball nearly in the books, we are already roughly one-third of the way through the 2014 MLB season., 145646=Edwin Encarnacion has emerged as one of the game's most productive sluggers over the past two-plus seasons. In fact, since the start of the 2012 season, only Miguel Cabrera (96) has more long balls than the 94 that Encarnacion has launched., 218277=After an up-and-down 2013 season, Justin Verlander finally seemed to figure things out over his final two regular-season starts and into the postseason. He followed that up with 20 scoreless innings in spring training, as he looked ready to again join the ranks of the game's best starters., 223313=Price has been far from an ace so far, turning in just five quality starts in 11 games, though he does lead the AL with a ridiculous 10.5 K/BB ratio. He'll still be a hot commodity if the Rays decide to make him available, and it's worth noting that he got off to a similarly slow start in 2013, but he's struggled, no matter how you slice it., 209203=It's easy to forget that David Ortiz was all but written off after he hit just .238 back in 2009, but that proved to be just a bump in the road for the slugger, who has continued to make a significant impact in the middle of the Red Sox lineup in the years since., 213743=The Milwaukee Brewers were a different team without Ryan Braun in the lineup last year, as they slipped from first in the National League in runs scored in 2012 to eighth and found themselves in fourth place in the NL Central as a result., 154585=The 2012 season looked like a breakout year for Carlos Gomez, as he hit .260 with a .768 OPS, 19 home runs and 51 RBI for a 2.3 WAR. That wound up being just the tip of the iceberg, as he took his game to another level last season., 282097=Always a promising pitcher with plus-plus stuff, Max Scherzer turned a corner at the All-Star break in 2012 and has not looked back since. After going 8-2 with a 2.69 ERA and 110 strikeouts in 90.1 innings in the second half that season, he had 13 straight wins to kick off 2013 before finally losing a game., 358269=Copyright © 2015 Bleacher Report, Inc. Turner Broadcasting System, Inc. All Rights Reserved. BleacherReport.com is part of Bleacher Report - Turner Sports Network, part of the Turner Sports and Entertainment Network. Certain photos copyright © 2015 by Getty Images. Any commercial use or distribution without the express written consent of Getty Images is strictly prohibited., 241443=He has struggled to find his power stroke in 2014, and his OPS is down 140 points as a result. Like many of the Rays, he has disappointed so far. That said, there is no reason to think he won't catch fire at some point, as his 6.3 HR/FB% is well below his 12.5 career mark entering the year., 145905=There were some concerns about his production when he ended April with a .775 OPS and just two home runs, but he has exploded for a team-record 14 home runs here in May, and he is a big reason why the Toronto Blue Jays sit atop the AL East standings.}",
    "textBeforeTable": "Leon Halip/Getty Images 50. SP Anibal Sanchez, Detroit Tigers Next » 52 of 2 « Prev Begin Slideshow » So with explanations out of the way, here are your two-month grades for the top 50 players in the game. F: Player has produced well below expectations and has no chance of improving. D: Player has produced well below expectations or has missed significant time. C: Player has produced below expectations and/or has missed some time. B: Player has produced at a star level and is in good position to be elite, or player is producing at an elite level but has missed some time. A: Player has produced at an elite level once again. The grading scale is as follows: Injuries are a part of the game, and unavoidable in many cases, but a player does not simply get a pass for being sidelined. If you simply don't show up for class, you fail. If you are",
    "textAfterTable": "More than a few people questioned the Detroit Tigers' decision to re-sign Anibal Sanchez to a big five-year, $80 million deal prior to last season. He silenced the critics by winning the AL ERA title, as he gave the Tigers another ace-caliber arm. He missed 17 games with a finger laceration earlier this season but has pitched well when he's been on the field. His injury also allowed Robbie Ray to get his feet wet with a few starts, which could be big in the second half. Grade: A- « Prev 3 of 52 Next » 49. 1B Prince Fielder, Texas Rangers Tony Gutierrez/Associated Press Stats G BA/OBP/SLG H 2B HR RBI R SB WAR 2013 162 .279/.362/.457 174 36 25 106 82",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}