{
    "relation": [
        [
            "",
            "Conservatorships",
            "Thrifts in the ARP Program",
            "Total",
            "Estimated Losses on thrift resolutions***",
            "Estimated Losses as a Percent of Total Assets"
        ],
        [
            "12/31/91",
            "$70,929",
            "$8,105",
            "$79,034",
            "$10,773",
            "13.63%"
        ],
        [
            "12/31/92",
            "$35,448",
            "$9,437",
            "$44,885",
            "$4,180",
            "9.31%"
        ],
        [
            "Percent Change",
            "-50.02%",
            "16.43%",
            "-43.21%",
            "-61.20%",
            "-31.69%"
        ]
    ],
    "pageTitle": "FDIC: Managing the Crisis: The FDIC and RTC Experience",
    "title": "",
    "url": "https://fdic.gov/bank/historical/managing/Chron/1992/index.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988840.31/warc/CC-MAIN-20150728002308-00134-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 885078135,
    "recordOffset": 885046939,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{88236=The BIF had a slight negative balance of $101 million at the end of 1992. Overall, the FDIC employed 15,044 people, which was up from 13,972 at the end of 1991. There were 3,996 Division of Supervision employees, which was up from 3,813 at the end of 1991. Division of Liquidation employees totaled 6,427, which was an increase of 330 over the previous year. The FDIC also imposed a freeze on most permanent hiring and promotions in May in anticipation of the return to the FDIC of the RTC permanent employees at the RTC’s sunset. Total staffing including 7,382 RTC employees equaled 22,426. Chart 15-2 shows the staffing levels for the past five years., 63809=In the 122 banks that failed or were assisted in 1992, deposits totaled $40 billion in 4,280,325 deposit accounts. There were two assistance agreements for banks with total deposits of $33.1 million in 6,571 deposit accounts. Payoffs accounted for 11 transactions with 74,790 deposit accounts with total deposits of $1.1 billion. Dividends paid on all active receiverships totaled $28.8 billion in 1992. Of the 2,067 insured bank resolutions 15-8 since the FDIC began operations in 1934, there were a total of 1,188 P&A transactions and 202 whole bank deals. Deposit payoff transactions accounted for 598 cases, of which there were 176 IDTs. There were also 79 OBA transactions. Total disbursements by the FDIC since January 1, 1934, amounted to $100.4 billion. Of that amount, the FDIC recovered $62.8 billion, for a net loss of $37.6 billion. Asset Disposition, 68533=Legal matters in 1992 were 11 percent higher than in 1991, with 90 percent relating to asset disposition., 50728=During 1992, the FDIC resolved 120 failed banks and provided assistance to 2 open banks in danger of failing. Those numbers were similar to those of 1991. Although total assets of failed and assisted banks decreased in 1992 to $45.4 billion from the record levels of $64.6 billion in 1991, the 1992 number was still the second highest in the FDIC’s history, primarily due to the increased number of failed savings banks. Of the 120 failed banks, 95 were purchase and assumption (P&A) transactions, including 5 whole bank deals. The FDIC used a variation of the P&A transaction in 36 of the 95 P&A transactions. That variation was called an “insured deposit purchase and assumption” in which the assuming bank received only the insured deposits rather than all deposits. The traditional insured deposit transfer (IDT) method was used in 14 resolutions, and payoffs accounted for the remaining 11 transactions. Only two institutions received open bank assistance (OBA) in 1992: the $20.9 million asset Freedom Bank, Ranger, Texas; and the $12.9 million asset Citizens State Bank, Princeton, Texas. Because of the cost savings inherent in a closed bank transaction, it was difficult to judge an open assistance proposal the least costly, particularly when the institution’s failure was imminent (that is, the possibility of a second resolution increased the proposed cost of the initial OBA.) Therefore, for an OBA proposal to be acceptable, it generally had to be submitted well before grounds existed for the institution’s closure. A recent estimate of losses per transaction type is shown in Table 15-3. Table 15-3, 20429=For the first time in the history of the FDIC, the Bank Insurance Fund (BIF) dropped below zero to a negative $7 billion. On April 30, 1991, the FDIC issued a regulation raising the deposit insurance assessment rate from 19.5 cents to 23 cents per $100 in assessable deposits. That increase in assessment revenue was designed to help offset BIF losses, which had been outpacing revenue since 1984., 89157=In April of 1992, two private banks with aggregate deposits of $203 million insured by the Pennsylvania Deposit Insurance Corporation (PDIC) were seized by the Pennsylvania Department of Banking. PDIC insured deposits to $100,000, but its $4 million in reserves was not sufficient to pay depositors. Consequently, insured deposits were transferred to two newly chartered, federally insured banks with deposits of $66 million and $116 million, respectively. Depositors, however, lost an aggregate $21 million in the process. The new banks were capitalized by stock purchased by the Pennsylvania’s State Workers’ Insurance Fund. Litigation over the appropriateness of the closure of one of the private banks was settled in 1994. The pool of settlement money was to come from a $3.2 million direct cash payment by the state and from the sale of the failed bank assets by the state banking department. That settlement made 190 uninsured depositors almost whole.15-9 The federally insured banks subsequently were merged and sold in July of 1995. The total cost to the state’s taxpayers, as stated by the Pennsylvania Auditor General, was expected to be more than $33 million. Small state insurance funds were prone to be hit hard with failure of just one or two institutions. PDIC never had more than four members and ultimately did not have sufficient funds to cover the losses from the two failed institutions., 61288=On January 24, CrossLand Savings Bank, F.S.B., Brooklyn, New York, with total assets of $7.4 billion was closed. The FDIC established a full service savings bank (an FDIC conservatorship) that assumed the assets, deposits, and certain liabilities of CrossLand Savings., 31054=The U.S. economy began to turn around in 1992 with Gross Domestic Product (GDP) growing at a modest 2.7 percent, which was a substantial improvement over the previous year’s GDP growth rate of -0.97 percent.15-1 Despite the increase in GDP growth, the unemployment rate continued to rise from 6.8 percent in 1991 to 7.5 percent in 1992.15-2 The spur to the economy can be attributed in part to a resurgence in the housing sector brought about by a decline in interest rates and the inflation rate. The discount rate fell from 5.5 percent to 3.3 percent, and the 30-year mortgage rate fell from 9.3 percent to 8.4 percent. The inflation rate also declined from 4 percent to 2.8 percent.15-3 Housing sales and housing starts showed dramatic improvements, going from no growth in 1991 to 10.8 percent and 18.3 percent in 1992, respectively. The office vacancy rate also stabilized at 18.5 percent.15-4 The Southwest banking industry continued to have problems, even though the number of failures continued to decrease and was down from 41 in 1991 to 36. Gross State Product (GSP) growth in the Southwest was consistent with GDP for the nation at 2.7 percent.15-5 Total lending, relative to assets, continued to decline while total real estate lending increased slightly to 27.7 percent of assets, though still well below the national median of 49.9 percent. Nonperforming assets relative to total assets continued to decline, as did net charge-offs on loans and leases for the region. There were 43 failures in the Northeast in 1992, many of which were attributed to huge losses from nonperforming real estate loans. Those failures accounted for 79 percent of all U.S. resolution costs in that year. The Northeast banking industry was beginning to recover, however, with increases in return on assets and asset growth and decreases in nonperforming assets and net charge-offs on loans and leases. But none of those trends could measure up to the levels of the rest of the U.S. banking industry. Lending continued to tighten with continuing decreases in Commercial and Industrial (C&I) loans and steady levels of total real estate and commercial real estate loans. The Northeast was coming out of its recession, but the region still under-performed the U.S. in overall production growth.15-6 California experienced negative GSP growth for the second year in a row.15-7 While the U.S. was bouncing back from the recession, California was not. By September, the state’s unemployment rate reached 9.5 percent, 2 percent higher than the national level. Many of California’s banks were not healthy. Commercial banks in the state reported $22 million in losses. Recently chartered banks, especially those in the southern part of the state, were vulnerable due to their poor earnings going into the recession. In Southern California, nonperforming assets peaked at around 5.5 percent of total assets. There were 12 bank failures in the state, including Independence Bank, Encino, California, the largest ($564 million in assets) and costliest ($140 million estimated loss) California bank failure ever. More than 26 percent of all of the banks in the state were considered problem banks. First Interstate resumed marginally profitable operations in 1992, with a return on assets of 0.07 percent. Bank of America also reported net income on California operations of $1.3 billion, and Wells Fargo reported net income of $306 million. The diversification of those “Big Four” banks helped them to withstand the pressures of the recession while smaller regional banks could not. Lending in the state began to tighten with total real estate loans holding steady at 40.5 percent of assets and commercial real estate loans remaining unchanged at 25 percent. C&I loans continued their gradual decline from 15.7 percent in 1991 to 13.5 percent in 1992. The number of new charters granted declined from 110 to 74. During 1992, the FDIC did not have an operating loss for the first time in five years and the profitability and solvency of commercial banks improved significantly. As a result, the FDIC viewed 1992 as a year in which the commercial banking industry began to get stronger overall. In 1992, although a large number of banks failed, many banks benefited from favorable interest rates and improved asset quality, and they showed record profits. The number of commercial banks on the FDIC’s problem bank list declined by 227 institutions in 1992, to 863, which was the lowest number on the list since 1983. Although savings banks insured by the Bank Insurance Fund (BIF) also reported their first profit in four years, there were still some problems. Problem savings banks accounted for more than 26 percent of savings banks’ assets, and 22 BIF insured savings banks failed in 1992. In addition, there were 207 Savings Association Insurance Fund (SAIF) insured savings banks with combined assets of $128 billion on the FDIC’s problem list by the end of 1992. The number of newly chartered banks fell slightly to 110. Despite the enormous volume of problem bank assets removed from the system through FDIC resolutions and supervision activity in 1991, and some signs that the condition of the banking industry was improving, underlying difficulties continued to trouble the industry. At the end of 1991, about $600 billion in assets were held by problem banks, compared with about $400 billion one year earlier. Moreover, bank exposure to weakened real estate markets in several regions of the country remained substantial. The number of banks on the FDIC’s problem bank list increased slightly to 1,090 at the end of 1991 from 1,046 at the end of 1990. In addition, there were 337 Savings Association Insurance Fund insured savings banks with combined assets of $209 billion on the FDIC’s problem list by the end of 1991. Table 14-2 shows the number and total assets of FDIC insured institutions, as well as their profitability as of the end of 1991., 108638=At the beginning of 1992, the RTC was managing 91 conservatorships with total assets of $47.3 billion. During the year, another 50 thrifts with assets of about $35.5 billion were placed into conservatorship. By the end of the year, the RTC had resolved 69 failed thrifts with total assets of $35.5 billion. Of the 69 resolutions in 1992, 60 were conservatorships, and the remaining 9 thrifts were resolved through the Accelerated Resolution Program (ARP). The nine thrifts that were resolved under ARP had total deposits of $8.5 billion, and the deposit premiums paid by acquirers totaled $131 million, or about 1.8 percent of the transferred core deposits. The largest conservatorship resolution in 1992 was Sunbelt Federal Savings, F.S.B., Irving, Texas, with $3.4 billion in deposits and 112 offices. Gross conservatorship assets, which totaled $47.3 billion in January 1992, were reduced by sales, collections, and resolutions to about $40.2 billion by the end of the year. The gross RTC funding for the 69 resolutions was $24.4 billion, including conservatorship advances of $2.5 billion, for a net RTC funding cost of $21.9 billion. In 1992, 63 thrifts with total assets of $35.2 billion were resolved in P&A transactions. Two thrifts with total assets of $103.4 million were resolved through IDTs. Buyers could not be found for four thrifts with total assets of $170.3 million, and therefore, the thrift depositors were paid off. Losses per transaction type are shown in Table 15-6 and Table 15-7 shows conservatorships and receiverships at year-end 1992., 62484=On October 2, The Howard Savings Bank, Newark, New Jersey, with total assets of $3.5 billion was closed. First Fidelity Bank, N.A., of Newark, New Jersey, acquired certain assets and assumed the deposits., 64953=As of the beginning of 1992, the FDIC held $43.3 billion in failed bank assets for both BIF and the FSLIC Resolution Fund (FRF). During 1992, the FDIC handled 120 bank failures with $45.4 billion in assets. From those institutions, the FDIC acquired $19 billion in assets for liquidation. Total principal collections were $9.4 billion for BIF and $1 billion for FRF, for a total of $10.4 billion. At the end of 1992, total assets in liquidation were $38.1 billion for BIF and $5.2 billion for FRF, or a total of $43.3 billion. In 1992, responsibility for managing and monitoring the FRF assistance agreements was transferred from the RTC to the FDIC. In March 1992, months before receiving Congressional funding, the FDIC implemented an Affordable Housing Program to help low- and moderate-income homebuyers purchase single-family homes in FDIC’s inventory. Approximately 1,500 properties acquired from failed institutions were included in the program. In September, the FDIC received $5 million in funding from Congress for costs associated with this program. The FDIC held its second national real estate owned auction in Dallas and sold 218 properties from 31 states for a record $412 million. In addition, 146 properties were sold for $262 million before the auction. These efforts created a combined total sales figure of $674 million. Total real estate owned sales of 15,100 properties by the FDIC in 1992, including sales by asset managers under the FDIC’s direction, produced $2.3 billion, representing 92 percent of aggregate appraised value. During 1992, real estate owned sales included the following significant properties:, 107888=Various changes mandated by the enactment of the RTC Refinancing, Restructuring, and Improvement Act (RTCRRIA) of 1991 on November 27, 1991, were implemented in 1992. The changes included funding through April 1, 1992; extension of the time frame to accept appointment as conservator or receiver; establishment of the Thrift Depositor Protection Oversight Board; removal of the FDIC as exclusive manager of the RTC; and creation of the office of chief executive officer of the RTC. Pursuant to RTCRRIA, Albert V. Casey was named chief executive officer. S&L Resolutions, 62160=On June 12, American Savings Bank, White Plains, New York, with total assets of $3.2 billion was closed. The FDIC sold the savings bank’s insured deposits to eight different banks in New York and New Jersey., 121131=At the beginning of 1992, the RTC held $130.4 billion in assets of savings and loan associations in receivership and in conservatorship. Assets acquired during the year through conservatorships, other resolved institutions, and putbacks or repurchases totaled $60.2 billion for the year. Losses and collections totaled $86.1 billion for the year. At the end of 1992, total assets in liquidation from both receiverships and conservatorships were $104.5 billion. During 1992, the RTC asset sales and collections totaled $79.4 billion. That figure is net of assets sold and then put back or repurchased, as well as net of discounted payoffs, bulk sale discounts, and write-offs. Book value reductions for the end of the fiscal year September 30, 1992, totaled $101 billion, an 87 percent return of the book value of disposed assets. In 1992, the RTC National Sales Center was involved in a number of large sales transactions of commercial real estate and nonperforming mortgages. Two of those transactions are worthy of mention., 61702=On February 21, Dollar Dry Dock Bank, White Plains, New York, a savings bank with total assets of $4 billion was closed. Emigrant Savings Bank, New York, New York, acquired certain assets and assumed deposits and certain other liabilities. Apple Savings Bank of New York, New York, also acquired one of the failed bank’s twenty-one branches., 30360=After only ten months as chairman of the FDIC, William Taylor passed away on August 20, 1992. Chairman Taylor was praised and admired as a dedicated public servant and a man of integrity. Vice Chairman Andrew C. Hove, Jr., was appointed acting chairman, a position he would hold for two years. Prior to his appointment as vice chairman, Mr. Hove had been in banking for 30 years and was chairman and chief executive officer of the Minden Exchange Bank & Trust Company, Minden, Nebraska. Economic/Banking Conditions, 120545=In 1992, there were 69 resolutions with total deposits of $27.6 billion in 3,080,701 deposit accounts. Of that total, there were four payoff transactions with $116.6 million in total deposits in 10,477 deposit accounts. Of the 653 insured thrift failures since the RTC began operations in August of 1989, a total of 407 were P&A transactions, 88 were payoff transactions, and 158 were IDTs. Asset Disposition, 63367=On December 11, Meritor Savings Bank, Philadelphia, Pennsylvania, with total assets of $4.1 billion was closed. Mellon Bank, N.A., of Pittsburgh, Pennsylvania, acquired certain assets and assumed the deposits., 62798=On October 30, twenty bank subsidiaries of First City Bancorporation of Texas, Inc., (First City) Houston, Texas, were closed. First City, with $8.1 billion in total assets, was one of the largest failed bank transactions in the FDIC history and failed only four years after the FDIC had provided a $970 million assistance package to the affiliated banks. The FDIC established 20 new full service bridge banks, which eventually were sold to various acquirers., 137891=During 1992, the RTC was not given additional funding by Congress after April 1 to resolve failed thrifts. When the RTC was without funding, resolution activity was severely reduced. The pace of resolutions, followed the availability of funding and resolution delays, kept thrifts in conservatorship longer, which increased conservatorship operating losses. Those losses were $5.4 billion in 1989 and decreased steadily each year. In 1992, they were $669 million, but because of the reduced resolution activity from the lack of funding, in 1993, conservatorship operating losses increased to $1.3 billion. Resolution delays and conservatorship operating losses led to increased resolution costs because of the relatively high carrying cost of maintaining assets in failed thrifts. 15-10 Nonetheless, the RTC assumed control of 50 thrifts closed by the Office of Thrift Supervision during 1992, and the total number of employees declined from 8,614 to 7,382 by the end of the year.}",
    "textBeforeTable": "1991 - 1992: FDIC at a Glance ($ in Millions) Table 15-1 For the first time in the history of the FDIC, the Bank Insurance Fund (BIF) dropped below zero to a negative $7 billion. On April 30, 1991, the FDIC issued a regulation raising the deposit insurance assessment rate from 19.5 cents to 23 cents per $100 in assessable deposits. That increase in assessment revenue was designed to help offset BIF losses, which had been outpacing revenue since 1984. Chronological Overview: Chapter Fiveteen\u00971992Managing the Crisis: The FDIC and RTC Experience Home > Industry Analysis",
    "textAfterTable": "Estimated Losses as a Percent of Total Assets 9.49% 8.10% -14.65% Assets in Liquidation $43,258.3 $43,273.4 0.03% FDIC Staffing 13,972 15,044 7.67% Number of Problem Banks 1,090 863 -20.83% Bank Insurance Fund Balance -$7,027.9 $-100.6 98.57% Bank Insurance Fund Balance as a Percent of Insured Deposits -0.36% -0.01% 97.22% *Losses for all resolutions occurring in this calendar year have",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}