{
    "relation": [
        [
            "Pos",
            "1",
            "2",
            "3",
            "4",
            "5",
            "6",
            "7",
            "8",
            "9",
            "10"
        ],
        [
            "Nation",
            "Japan",
            "Germany",
            "Slovenia",
            "Norway",
            "Austria",
            "France",
            "Russia",
            "Italy",
            "United States",
            "Finland"
        ],
        [
            "Points",
            "2981",
            "2364",
            "1933",
            "1464",
            "1031",
            "1005",
            "818",
            "546",
            "542",
            "455"
        ]
    ],
    "pageTitle": "2013–14 FIS Ski Jumping World Cup - Wikipedia, the free encyclopedia",
    "title": "",
    "url": "https://en.wikipedia.org/wiki/2013%E2%80%9314_FIS_Ski_Jumping_World_Cup",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988840.31/warc/CC-MAIN-20150728002308-00339-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 874063823,
    "recordOffset": 874028883,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{9147=Kamil Stoch of Poland won the men's overall title. Stoch was leading the cup standings for most of the season and managed to secure the title in the second-to-last event in Planica. Stoch also won most events of the season (six), followed by Severin Freund of Germany (five) and Prevc (three). Stoch won his first overall title and the first title for Poland since Adam Małysz in 2006. Prevc became the first Slovenian to finish at the overall podium since Primož Peterka who won the 1996-97 and 1997-98 seasons. Freund became the first German to finish at the podium since Sven Hannawald in 2003., 6786=The 2013/14 FIS Ski Jumping World Cup was the 35th World Cup season in ski jumping for men and the 3rd for ladies. It begun on 23 November 2013 in Klingenthal, Germany and ended on 23 March 2014 in Planica, Slovenia. A break took place during the season to accommodate the ski jumping event of the 2014 Winter Olympics in Sochi. From 13 to 16 March 2014, FIS Ski Flying World Championships 2014 took place in Harrachov, Czech Republic.}",
    "lastModified": "Tue, 28 Jul 2015 14:22:56 GMT",
    "textBeforeTable": "Overall[edit] source:[52] Standings: Men[edit] ^ Originally scheduled in Ljubno, moved to Planica because of lack of snow. [51] Sara Takanashi Julia Clair Yuki Ito Sara Takanashi LH Bloudkova velikanka HS 139 Planica 22 Mar 2014 18 47 cancelled; strong wind NH Lugnet HS 98 Falun 16 Mar 2014 [50]",
    "textAfterTable": "Pos Ski Jumper Points 11 Robert Kranjec 493 12 Andreas Kofler 468 13 Jernej Damjan 457 14 Michael Hayböck 439 15 Thomas Morgenstern 438 16 Marinus Kraus 407 17 Maciej Kot 398 18",
    "hasKeyColumn": true,
    "keyColumnIndex": 1,
    "headerRowIndex": 0
}