{
    "relation": [
        [
            "Categories",
            "Campus Safety",
            "Greek Life",
            "Great for these types of students",
            "Bang for the buck",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "The police are there to make sure everyone is sae and no one gets hurt. They are there to assist you when you need help.",
            "They also have steps shows and greek informative nights.",
            "There are many organizations for people with good hearts who like to volunteer. Organizations for people who want to get involved in greek life. Or those who have a passion for dancing.",
            "The most important thing I've learned at Coppin is staying focused. Do not let anyone or anything put you down. If you be your own person you can achieve anything. There will always be someone to give you good advice, such as the RA's, president of the school, and dean. Surround yourself by good people. Do good and you shall get good. Learn from your mistakes and you will succeed.",
            "There are a lot of educational activities that are fun. Informative things on health and campus life, as well as game night, steps shows, baskeballt games, volleyball games. The is an indoor pool and open basketball court. There are also parties where you can dance. Being responsible is most important when it comes to partying.",
            "Depending on how well you like your food. Dining is great. They have all types of meals to choose from. From vegetarian food, normal pizza and fries, home cooked meals, to gourmet. Its all good.",
            "It's all what you make it. Be around people who are not only similiar to you, but want to make it through just like you do. You can enjoy dorm life and get good grade all at the same time. Do not let anyone make choices for you. Be yourself!",
            "It's all up to you. How you study, go to class, and participate all determines on whether you make it at coppin. The professors are there to help, but you have to be the one to let them motivate you to keep going. You have to motivate yourself not to give up. If you study hard and keep pushing you will see great results.",
            "Staying focused and not giving up is what you need at coppin. If you do not give up you can get through any obstacle.",
            "Coppin state university's pride is what attracted me the most. The professors are down to teach you everything you need to know and will do anything to help you. They are willing to help you through."
        ]
    ],
    "pageTitle": "Coppin State University Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Coppin-State-University/reviews?_escaped_fragment_=/show/35807",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987174.71/warc/CC-MAIN-20150728002307-00324-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 888877235,
    "recordOffset": 888846323,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{45783=They raised tuition another $2000 which is an outrage! we barely were getting what we pay for, now we are paying more for what it is worth., 122399=© 2015, Cappex.com, LLC}",
    "textBeforeTable": "01/13/2010 Reviewer is A current student here. 9 out of 10 people found this review useful. 3 people found this inaccurate. 1 of 30 JUSTINA from Windsor, CT Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else",
    "textAfterTable": "Janai from Reisterstown, MD 09/03/2010 Reviewer is A current student here. 2 out of 3 people found this review useful. 3 of 30 Categories Comments Tips for prospective students Do your research because coppin state is not for everybody. Am enjoying being here Its ok for the most part, Its not gonna be worth it if you dont make this experience your own. Am learning a lot Coppin has alot of people who are willing to help you. Login to rate or flag the reviews Christopher from Baltimore, MD 07/07/2011 Reviewer is A current student here. 2 out of 2 people found this review useful. 4 of 30 Categories Comments",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}