{
    "relation": [
        [
            "Payment method",
            "",
            "Cash On Delivery",
            "Bank Deposit"
        ],
        [
            "Preferred/Accepted",
            "PayPal Preferred",
            "Accepted",
            "Accepted"
        ],
        [
            "",
            "",
            "",
            ""
        ]
    ],
    "pageTitle": "Womens Designer Platform Wedge Shoes \"Shell\" RED Sizes 5 6 7 8 9 10 11 | eBay",
    "title": "",
    "url": "http://www.ebay.com.au/itm/WOMENS-DESIGNER-PLATFORM-WEDGE-SHOES-SHELL-RED-Sizes-5-6-7-8-9-10-11/171129423313?_trkparms=aid%3D222007%26algo%3DSIC.MBE%26ao%3D1%26asc%3D20140107090050%26meid%3D8334383414539098583%26pid%3D100011%26prg%3D20140107090050%26rk%3D7%26rkt%3D10%26sd%3D121328451909",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987174.71/warc/CC-MAIN-20150728002307-00322-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 410884431,
    "recordOffset": 410838702,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Payment details returns - opens in a new window or tab. Refunds by law: In Australia, consumers have a legal right to obtain a refund from a business for goods purchased if the goods are faulty, not fit for purpose or don't match description. More information at In the event the item you receive from us is faulty, we will of course provide you with a full refund or exchange. If an item purchased does not fit, we will exchange it for you provided we have it in stock. You pay only for the extra shipping charges. If we don't have your size available, you can choose a item of equivalent value from our range. PLEASE NOTE: All items returned to us for a refund will incur a 15% re-stocking fee to cover our Ebay/Paypay/Postage Expenses. In all instances, any item returned to us must be unworn, undamaged and unmarked and be in the box in original condition. Any items returned to us that are not in this condition will be refused and returned to you at your expense. Return policy details",
    "textAfterTable": "Current bid amount + + import charges (shown at checkout) time left ##2## left | Bid Count Current Max Bid:",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}