{
    "relation": [
        [
            "Month",
            "Jan",
            "Feb",
            "Mar",
            "Apr",
            "May",
            "Jun",
            "Jul",
            "Aug",
            "Sep",
            "Oct",
            "Nov",
            "Dec"
        ],
        [
            "Climate",
            "Moderately Cold",
            "Pleasant",
            "Moderately Hot",
            "Very Hot",
            "Very Hot",
            "Very Hot",
            "Rainy",
            "Rainy",
            "Moderately Hot",
            "Pleasant",
            "Pleasant",
            "Moderately Cold"
        ],
        [
            "Details",
            "January offers pleasant ambiance for traveling all through the city and its outskirts. It is a very good period for sightseeing, outings and carrying out other tourist activities. Make sure you carry some light warm clothes for your trip.",
            "Pleasant sunny days with mild cold nights. It is a good month for taking up tour packages for Ahemdabad and enjoying everything the city has to offer. The temperature is comfortable and is suitable for carrying out sightseeing activities and outdoor trips.",
            "Summers season begins in this month. Days are mostly dry and sunny while evenings are pleasant. The moderate weather is favorable for sightseeing, outings and exploring the city.",
            "Bright sunny days with clear sky. Generally days are hot and nights are moderately hot. The weather becomes a bit uncomfortable for outdoor tourist activities. Carry all sun protective gears if you are planning to visit during this month.",
            "The hottest month of the year, days are very hot followed by moderately hot evenings. The hot weather is a bit annoying, also making it difficult for outdoor activities. If you are visiting this month, then be sure to carry sun protective gears.",
            "Beautiful monsoon shower appears in this month, it offers some relief from scorching summer. The climate becomes a bit humid from mid-June and is not an ideal period for tourists to explore the city. If you have plans then, cotton clothes and sun protecting stuffs are a must.",
            "Intermittent rain showers make the atmosphere moderately hot. Most part of the month is accompanied by cloudy days, sometimes thunder storms also occur. It may not be an ideal month for tourist visits but recommended to rain lovers and those who like monsoon effect.",
            "Monsoon rains hit the city with all its majesty, temperature drops down to a pleasant level. Travelling will be bit difficult during this time due to rains. Most tourists don't prefer this period but monsoon lovers and those who like rainy nature can still enjoy their visit.",
            "The place experiences mild warm climate. After rains the environment and the nature gives a fresh and blooming look. It may not be the best season but tourist visits are still possible. Besides, intermittent showers add the beauty of the nature.",
            "Clear blue sky appears. High season starts with the inflow of tourists. Pleasant climate and beautiful nature welcome the travelers. This time is completely favorable for sightseeing and other tourist activities.",
            "The temperate climate makes the city suitable for tourist visits. Most days of this month is accompanied by beautiful skies. It is really a good season to enjoy sightseeing, outings and other tourist activities.",
            "Winter season appears. This is the best month for exploring the tourist attractions in Ahmedabad city. The dry and pleasant atmosphere invites travelers to the city. One can enjoy sighting and other tourist related activities. Light warm clothes will be needed during nights."
        ]
    ],
    "pageTitle": "AHMEDABAD Weather, Temperature, Best Season, Ahmedabad Weather Forecast, Climate",
    "title": "",
    "url": "http://www.mustseeindia.com/Ahmedabad-weather",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438043062635.98/warc/CC-MAIN-20150728002422-00281-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 577274472,
    "recordOffset": 577244327,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Ahmedabad Weather Home  ›  Destinations  ›  Gujarat  ›  Ahmedabad  ›  Weather   var addthis_config = {services_compact: 'facebook,print,twitter,email,google,gmail,pinterest,blogger,stumbleupon,favorites,tumblr,more'}; register_onload(function(){hide_zedo_image()}); googletag.cmd.push(function() { googletag.display('div-gpt-ad-1325834386456-188'); }); }); googletag.enableServices(); googletag.defineSlot('/1008434/season-header-1-banner', [728, 90], 'div-gpt-ad-1325834386456-188').setTargeting('NetworkId', 'season').addService(googletag.pubads()); googletag.cmd.push(function() { add_comscore(); } el.parentNode.insertBefore(s, el); s.src = (document.location.protocol == \"https:\" ? \"https://sb\" :\"http://b\") + \".scorecardresearch.com/beacon.js\"; s.async = true; el = document.getElementsByTagName(\"script\")[0]; var s = document.createElement(\"script\"); function add_comscore(){ _comscore.push({ c1: \"2\", c2: \"15366170\" }); var _comscore = _comscore || [];  ",
    "textAfterTable": "View all photos Best Season: Oct - Mar Summers 23 to 45Â°C, Winters 10 to 36Â°C. Best Season / Best time to visit Ahmedabad Ahmedabad has a warm dry climate, except for rainy seasons. The place time to visit the place is from October to March. Winters (November to February) offer a mild windy cool climate. It is very pleasant and good time for Ahemdabad tourism. In winter the average temperature ranges in thirties. Summers (March to May) are extremely hot with an average mercury level of 36°C with extreme sometimes touching up to 45°C and tourists seldom go out for sightseeing in April and May. Monsoons (June to October) are rainy seasons with medium to heavy showers. The season gives relief from the hot summer. Monsoon period is not an ideal time for tourists. October to March months is cool with pleasant atmosphere and perfect time for tourism in Gujarat. Outings, sightseeing and other tourist activities are enjoyable in these months. June to September is usually avoided by visitors, due to uncertainty in heavy rains. April to June months",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}