{
    "relation": [
        [
            "Property",
            "action",
            "bubbles",
            "cancelable",
            "currentTarget",
            "dragInitiator",
            "dragSource",
            "target"
        ],
        [
            "Value",
            "The action that caused the event: DragManager.COPY, DragManager.LINK, DragManager.MOVE, or DragManager.NONE.",
            "false",
            "false",
            "The Object that defines the event listener that handles the event. For example, if you use myButton.addEventListener() to register an event listener, myButton is the value of the currentTarget.",
            "The component that initiated the drag.",
            "The DragSource object containing the data being dragged.",
            "The Object that dispatched the event; it is not always the Object listening for the event. Use the currentTarget property to always access the Object listening for the event."
        ]
    ],
    "pageTitle": "UIComponent - Adobe ActionScript® 3 (AS3 Flex) API Reference",
    "title": "",
    "url": "http://help.adobe.com/en_US/FlashPlatform/reference/actionscript/3/mx/core/UIComponent.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 1125,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988840.31/warc/CC-MAIN-20150728002308-00064-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 113011311,
    "recordOffset": 112914481,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "The properties of the event object have the following values: This event will only be dispatched when there are one or more relevant listeners attached to the dispatching object. add event. type property of the event object for an FlexEvent.ADD constant defines the value of the The This event is only dispatched when there are one or more relevant listeners attached to the dispatching object. Dispatched when the component is added to a container as a content child by using the addChild(), addChildAt(), addElement(), or addElementAt() method. If the component is added to the container as a noncontent child by using the rawChildren.addChild() or rawChildren.addChildAt() method, the event is not dispatched. Flash Player 9, AIR 1.1 Runtime Versions:  Flex 3 Product Version:  ActionScript 3.0 Language Version:  mx.events.FlexEvent.ADDproperty FlexEvent.type = mx.events.FlexEventEvent Object Type: Event add Event Detail Matrix — The Matrix for the vertical gradient. Returns height:Number — The height of the gradient, in",
    "textAfterTable": "Event Object Type: mx.events.FlexEvent property FlexEvent.type = mx.events.FlexEvent.CREATION_COMPLETE Language Version:  ActionScript 3.0 Product Version:  Flex 3 Runtime Versions:  Flash Player 9, AIR 1.1 Dispatched when the component has finished its construction, property processing, measuring, layout, and drawing. At this point, depending on its visible property, the component is not visible even though it has been drawn. The FlexEvent.CREATION_COMPLETE constant defines the value of the type property of the event object for a creationComplete event. The properties of the event object have the following values: Property Value bubbles false cancelable false currentTarget The Object that defines the event listener that handles the event. For example, if you use myButton.addEventListener() to register an event listener, myButton is the value of the currentTarget. target The Object that dispatched the event; it is not always the Object listening for the event. Use the currentTarget property to always access the Object listening for the event. currentStateChange Event   Event Object Type: mx.events.StateChangeEvent",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}