{
    "relation": [
        [
            "Categories",
            "Campus Safety",
            "Greek Life",
            "Clubs and Activities",
            "Great for these types of students",
            "Share any unusual traditions or locations on campus",
            "Bang for the buck",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "I always, ALWAYS feel safe on campus. I've heard of no problems otherwise.",
            "No Greek life!!",
            "Juniata has HUNDREDS of clubs to choose from and many different activities you can be involved in--it's you who choose to have fun or be bored.",
            "Great for people who like smaller class sizes, one-on-one time with professors, don't mind living in a small town, and in general love learning.",
            "There are a lot of multicultural events that you might not have been exposed to, but they are all very interesting and worth going to.",
            "Juniata is very expensive, but the financial aid office WILL work with you to figure out payment plans if you are struggling. I'm an independent student, and I talked with Diane in the office and she helped figure out everything to me. There's always something that can be done!",
            "Numerous events on campus, movies, bowling, go to Altoona/State College (45 min car ride away)",
            "The food is basic school food--sometimes good, sometimes bad. You can get really sick of the food after a while, but I've had worse.",
            "Some dorms are better than others, but I've had all good experiences with where I've lived. You just have to know how to play your cards.",
            "Classes get a bit overwhelming, especially at the end of the semester, but it's do-able.",
            "Ask questions! The tour guides are not afraid to answer anything for you! They know all the facts about Juniata.",
            "It's worth it!"
        ]
    ],
    "pageTitle": "Juniata College Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Juniata-College/reviews?_escaped_fragment_=/show/89513",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988840.31/warc/CC-MAIN-20150728002308-00276-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 900712415,
    "recordOffset": 900662607,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{45852=the classes for the natural sciences are definitely competitive. i interned at a research position at another school during the 2011 summer and they definitely want more students from juniata college now., 190346=© 2015, Cappex.com, LLC, 86881=Coming in as a freshman they have a program that is called inbound. I cannot wait for August 18th., 184949=Mountain Day is when you are woken up at 4am by airhorns in September or October on an unknown day, to tell you there is no class. The entire school then goes up to Raystown Lake where there are a variety of activities that happen. Lobsterfest, Storming the Arch, Mr. Juniata, and Madrigal are also a traditions that make Juniata unique., 149331=The food at Juniata is a little disappointed but it is better than cooking canned food every night. They tend to put all the good food in one meal during one day of the week but there are different dining options available so you probably will not get tired of a certain food. And after all, they are renovation the cafeteria and changing the way the food is going to be served for the 2013 school year!}",
    "textBeforeTable": "03/02/2011 Reviewer is Accepted here and planning to attend soon. Reviewer has been to campus. 6 out of 6 people found this review useful. 1 of 39 Megan from New Market, MD Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp",
    "textAfterTable": "Academic Rigor Because Juniata is a Liberal Arts school, students are exposed to many different subject areas than just their intended major. Classes are usually small and professors are always willing to help. You do have to apply yourself though, slacking won't get you very far. Login to rate or flag the reviews Ashley 11/08/2011 Reviewer is A current student here. 2 out of 2 people found this review useful. 3 of 39 Categories Comments Great for these types of students Great for students who wish to have an education that can make a difference in their life. Tips for prospective students Take advantage at what Juniata College has to offer. The college gives so many opportunities to be active and to make a difference. Bang for the buck The education here is worth every penny. The professors are top quality teachers and will not disappoint anyone.",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}