{
    "relation": [
        [
            "Reel",
            "1151",
            "1152",
            "1153",
            "1154",
            "1155",
            "1156",
            "1157",
            "1158",
            "1159",
            "1160",
            "1161",
            "1162",
            "1163",
            "1164",
            "1165",
            "1166",
            "1167",
            "1168",
            "1169",
            "1170",
            "1171",
            "1172",
            "1173",
            "1174",
            "1175",
            "1176",
            "1177",
            "1178"
        ],
        [
            "Case Numbers",
            "23600 - 23600(R)",
            "23600(S) - 23640",
            "23641 - 23710",
            "23711 - 23800",
            "23801 - 23895",
            "23896 - 23970",
            "23971 - 24070",
            "24071 - 24100",
            "24101 - 24195",
            "24196 - 24282",
            "24283 - 24365",
            "24366 - 24470",
            "24471 - 24600",
            "24601 - 24727",
            "24728 - 24840",
            "24841 - 24960",
            "24961 - 25100",
            "25101 - 25240",
            "25241 - 25410",
            "25411 - 25550",
            "25551 - 25725",
            "25726 - 25982 Petitions to President Roosevelt to prevent extradition of Jan Janoff Pouren to Russia, enclosure to document 40 of case 10901, dated Oct. 7, 1908.",
            "Alabama-Illinois",
            "Indiana-Montana",
            "New York City",
            "New York City-New York State",
            "North Dakota-Wisconsin",
            "Miscellaneous"
        ],
        [
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            ""
        ]
    ],
    "pageTitle": "VMG-BSB 453, 454",
    "title": "",
    "url": "http://www.bsb-muenchen.de/mikro/litup453.htm",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987174.71/warc/CC-MAIN-20150728002307-00192-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 342749303,
    "recordOffset": 342723489,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{3453=In den Fällen allerdings, in denen dort keine Informationen zu finden sind, oder man noch spezifischer suchen will, muß folgendes Verfahren gewählt werden, das am Beispiel \"München\" präsentiert werden soll: Zuerst muß der gesuchte Begriff (üblicherweise ein geographischer, Institutions- oder Personenname) auf den Karteikarten der Verfilmung Film R 2005.43-rn gesucht werden, die einen Index zu den \"Numerical and Minor Files\" bilden. Da die Verfilmung dieser Karteikarten allein bereits 86 Filmrollen umfaßt, findet man in Tabelle 1 eine Übersicht über Anfangs- und Endbegriffe auf jeder Filmrolle. \"Munich\" befindet sich also auf Filmrolle 56 der Index Cards (= Film R 2005.43-56). Auf den Karteikarten, die noch in \"Munich, To\" und \"Munich, From\" unterteilt sind, findet man zu jedem Dokument eine Kurzbeschreibung. Rechts oben auf der Karteikarte befindet sich die Fallnummer. Z.B. hat eine Anfrage an den Konsul in München wegen der Sterilisation von Apfelsaft die Fallnummer 8474. Mit dieser Fallnummer sucht man in Tabelle 2 die Filmrollennummer, in diesem Fall 611, also lautet die Signatur: Film R 2005.42-611. Auf diesem Film findet man dann die entsprechende Korrespondenz., 715=Hinweise zu Inhalt und Benutzung: 1906 änderte das amerikanische Außenministerium (State Department) sein Registratursystem. Hatte man vorher die Unterlagen nach groben Typen (z.B. Sendungen aus Botschaften, Anweisungen an Konsulate usw.) und Herkunft abgelegt, wurde jetzt jedem Dokument zu einem neuen \"Thema\" eine neue laufende Fallnummer (case number), z.B. 637 für den Panamakanal, zugeordnet. Weitere Dokumente zu diesem \"Thema\" erhielten durch einen Schrägstrich abgetrennte Nummern, also 637/1, 637/2 usw. Allerdings konnte auch eine neue Fallnummer vergeben werden: beim Panamakanal etwa 1502 und 14858. Dieses System der \"Numerical File\" erwies sich relativ bald als unpraktisch und wurde 1910 durch die Dezimalklassifikation abgelöst. Daneben hatte man alltägliche Korrespondenz in der sog. \"Minor File\" abgelegt, die ebenfalls auf der Verfilmung in der BSB vorhanden ist (ab reel number 1179) und ebenso durch die Umstellung 1910 beendet wurde., 546=454 Index Cards of the Numerical and Minor Files, 1906-1910. 86 Filmrollen. NARA (M1889). Sign.: Film R 2005.43-rn [rn von 1 bis 86], 338=453 Numerical and Minor Files of the Department of State, 1906-1910. 1241 Filmrollen. NARA (M862). Sign.: Film R 2005.42-rn [rn von 1 bis 1018, 1019, 1019A, 1020 bis 1240], 2445=Eine weitere Möglichkeit ist der Blick in eine Übersicht der National Archives, die gleichzeitig auf den Filmrollen der \"Numerical and Minor Files\" enthalten ist. Hier gibt es neben einer ausführlicheren Erläuterung eine \"Select List of Numerical File Cases\", die bestimmten Themen, vor allem den Beziehungen zwischen den USA und verschiedenen Ländern, zwischen verschiedenen Ländern untereinander sowie zu inneren Angelegenheiten einzelner Länder gleich die entsprechenden Filmrollennummern zuordnet. Hier kann man z.B. leicht eruieren, daß die Unterlagen zu Marokko nach der Konferenz von Algeciras 1906 und dem Ende der ersten Marokko-Krise unter der case number 295 auf den Rollen 43 bis 46 (= Film R 2005.42-43, Film R 2005.42-44, usw.), aber auch unter der case number 2151 auf den Rollen 223 bis 225 (= Film R 2005.42-223 usw.) zu finden sind., 4838=Auch die \"Minor File\" ist über diese Karteikarten erschlossen, allerdings nur mit dem allgemeinen Hinweis auf die \"Minor File\". Einen auf einer Karteikarte des Film R 2005.43-56 erwähnten Bericht des Konsulats in München vom 28.8.1906 über Alkoholismus in München etwa findet man, indem man in der Übersicht der \"Minor File\" die Filmrolle heraussucht, auf der \"Munich\" zu erwarten ist (nicht weil das Thema München ist, sondern weil es sich um Korrespondenz zwischen dem State Department und dem Konsulat in München handelt, wie aus der Karteikarte ersichtlich ist), also Filmrolle 1219 (= Film R 2005.42-1219). Dort findet man den Bericht basierend auf einem Vortrag zum Thema von Emil Kraepelin., 1758=Dieses System hat für den Benutzer die Folge, daß Dokumente beispielsweise zu einzelnen Ländern nicht ohne weiteres aus den insgesamt über 25000 Fallnummern herausgelöst werden können. Außerdem vermischt sich konsularische Routinekorrespondenz mit Berichten über politische Ereignisse oder wirtschaftliche Fragen in etwas ermüdender Weise. Am einfachsten ist die Benutzung, wenn die Filmrollennummer bereits bekannt ist, da diese nur an die Signatur angehängt werden muß: etwa Film R 2005.42-741. Ist die Fallnummer bekannt, kann über Tabelle 2 die Filmrollennummer ermittelt werden.}",
    "lastModified": "Mon, 09 Sep 2013 08:38:18 GMT",
    "textBeforeTable": "Numerical File 42 (Dokumente) TABELLE 2 zu Film R 2005. Winona Copper Company - Zwickey, W. F. 86 Warsaw, From: July 10, 1908 - Winnepeg Development and Industrial Bureau 85 Wallis, H. C. - Warsaw, From: July 9, 1908 84 Venezuela, From: Mar. 26, 1907 - Wallis, E.W, 83 Turkey, Taxes - Venezuela, From: Mar. 23, 1907 82 Tripoli, From: Mar. 14, 1910 - Turkey, Diseases 81 Treasury Dept., To: May 26, 1909 - Tripoli-in-Barbary, From: Mar. 3, 1910 80 Treasury Dept., From: June 23, 1908 - Treasury Dept., To: May 25, 1909 79 Terry, Robert John - Treasury Dept., From: June 22, 1908 78 Tahiti, From: July 17, 1909 - Terry, Marion S. 77 Supreme Court of Cuba - Tahiti, From: July 2, 1909 76 State Dept. Solicitor, From: Apr. 9, 1910 - Supply Ships, Consular 75 Spain, From: Mar. 22, 1907 - State Dept. Solicitor, From: Apr. 7, 1910 74 Siam, From: Oct. 9, 1908 - Spain, From: Mar. 21, 1907 73 Seoul, From: Aug. 8, 1908 - Siam, From: Oct. 2, 1908 72 San Salvador, Misc. - Seoul, From: Aug. 7, 1908 71 St. Petersburg, To: Oct. 24, 1907 - San Salvador, To: Mar.",
    "textAfterTable": "36 230 - 244/52 37 244/53 - 244/349 38 244/350 - 249/151 39 249/152 - 252 40 253 - 269 41 270 - 283/49 42 283/50 - 290 43 291 - 295/115 44 295/116 - 295/270 45 295/271 - 295/341 46 295/342 - 295/F.W. 47 296 - 312/50 48 312/51 - 321/86 49 321/87-88 50 321/87-88 (cont.) - 323/75 Reel Case Numbers 51 323/76 - 332/20 52 332/21 - 345 53 346-360 54 361 - 378 55 379 - 395 56 396 - 406/121 57 406/122 - 410 58 411 - 425/47 59 425/48 - 426/70 60 426/71 - 426/73 (and annexes) 61 Annexes to case 426 62 dito 63 dito 64 dito 65 427 - 450 66 451 - 468/47 67 468/48 - 478 68 479-509 69 510 - 525 70 526 - 533 71 534 72 Annex I to case 534/143 73 Annex II to case 534/143 74 Annex III to case 534/143 75 535 - 538/100 76",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}