{
    "relation": [
        [
            "Published Date",
            "Jul 10, 2015",
            "May 6, 2015",
            "Sep 8, 2014",
            "May 8, 2014",
            "Dec 12, 2013",
            "Jun 14, 2012",
            "May 3, 2012",
            "Dec 27, 2010",
            "Feb 2, 2010",
            "Feb 5, 2009"
        ],
        [
            "Version",
            "14 (current)",
            "13",
            "12",
            "11",
            "10",
            "8",
            "6",
            "5",
            "4",
            "1"
        ],
        [
            "Files",
            "download",
            "download",
            "download",
            "download",
            "download",
            "download",
            "download",
            "download",
            "download",
            "download"
        ]
    ],
    "pageTitle": "DailyMed - LEVETIRACETAM - levetiracetam solution",
    "title": "",
    "url": "http://dailymed.nlm.nih.gov/dailymed/drugInfo.cfm?setid=F65EC19D-B90E-452E-B761-C68B1CF2C892",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438043062635.98/warc/CC-MAIN-20150728002422-00083-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 61344379,
    "recordOffset": 61295862,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{146413=Adults 16 Years and Older Initiate treatment with a dose of 1000 mg/day, given as twice-daily dosing (500 mg twice daily). Increase dosage by 1000 mg/day every 2 weeks to the recommended daily dose of 3000 mg. The effectiveness of doses lower than 3000 mg/day has not been adequately studied.   Pediatric Patients Ages 6 to <16 Years  Initiate treatment with a daily dose of 20 mg/kg in 2 divided doses (10 mg/kg twice daily). Increase the daily dose every 2 weeks by increments of 20 mg/kg to the recommended daily dose of 60 mg/kg (30 mg/kg twice daily). The effectiveness of doses lower than 60 mg/kg/day has not been adequately studied. Patients with body weight ≤20 kg should be dosed with oral solution. Patients with body weight above 20 kg can be dosed with either tablets or oral solution [see Dosage and Administration (2.1)]., 57931=Absorption and Distribution Absorption of levetiracetam is rapid, with peak plasma concentrations occurring in about an hour following oral administration in fasted subjects. The oral bioavailability of levetiracetam tablets is 100% and the tablets and oral solution are bioequivalent in rate and extent of absorption. Food does not affect the extent of absorption of levetiracetam but it decreases Cmax by 20% and delays Tmax by 1.5 hours. The pharmacokinetics of levetiracetam are linear over the dose range of 500 to 5000 mg. Steady state is achieved after 2 days of multiple twice-daily dosing. Levetiracetam and its major metabolite are less than 10% bound to plasma proteins; clinically significant interactions with other drugs through competition for protein binding sites are therefore unlikely. Metabolism Levetiracetam is not extensively metabolized in humans. The major metabolic pathway is the enzymatic hydrolysis of the acetamide group, which produces the carboxylic acid metabolite, ucb L057 (24% of dose) and is not dependent on any liver cytochrome P450 isoenzymes. The major metabolite is inactive in animal seizure models. Two minor metabolites were identified as the product of hydroxylation of the 2-oxo-pyrrolidine ring (2% of dose) and opening of the 2-oxo-pyrrolidine ring in position 5 (1% of dose). There is no enantiomeric interconversion of levetiracetam or its major metabolite. Elimination Levetiracetam plasma half-life in adults is 7 ± 1 hour and is unaffected by either dose or repeated administration. Levetiracetam is eliminated from the systemic circulation by renal excretion as unchanged drug which represents 66% of administered dose. The total body clearance is 0.96 mL/min/kg and the renal clearance is 0.6 mL/min/kg. The mechanism of excretion is glomerular filtration with subsequent partial tubular reabsorption. The metabolite ucb L057 is excreted by glomerular filtration and active tubular secretion with a renal clearance of 4 mL/min/kg. Levetiracetam elimination is correlated to creatinine clearance. Levetiracetam clearance is reduced in patients with renal impairment [see Use in Specific Populations (8.6) and  Dosage and Administration (2.5)]. Specific Populations Elderly Pharmacokinetics of levetiracetam were evaluated in 16 elderly subjects (age 61 to 88 years) with creatinine clearance ranging from 30 to 74 mL/min. Following oral administration of twice-daily dosing for 10 days, total body clearance decreased by 38% and the half-life was 2.5 hours longer in the elderly compared to healthy adults. This is most likely due to the decrease in renal function in these subjects. Pediatric Patients Pharmacokinetics of levetiracetam were evaluated in 24 pediatric patients (age 6 to 12 years) after single dose (20 mg/kg). The body weight adjusted apparent clearance of levetiracetam was approximately 40% higher than in adults. A repeat dose pharmacokinetic study was conducted in pediatric patients (age 4 to 12 years) at doses of 20 mg/kg/day, 40 mg/kg/day, and 60 mg/kg/day. The evaluation of the pharmacokinetic profile of levetiracetam and its metabolite (ucb L057) in 14 pediatric patients demonstrated rapid absorption of levetiracetam at all doses with a Tmax of about 1 hour and a t1/2 of 5 hours across the three dosing levels. The pharmacokinetics of levetiracetam in children was linear between 20 to 60 mg/kg/day. The potential interaction of levetiracetam with other AEDs was also evaluated in these patients. Levetiracetam had no significant effect on the plasma concentrations of carbamazepine, valproic acid, topiramate or lamotrigine. However, there was about a 22% increase of apparent clearance of levetiracetam when it was co-administered with an enzyme-inducing AED (e.g., carbamazepine). Following single dose administration (20 mg/kg) of a 10% oral solution to children with epilepsy (1 month to < 4 years), levetiracetam was rapidly absorbed and peak plasma concentrations were observed approximately 1 hour after dosing. The pharmacokinetic results indicated that half-life was shorter (5.3 h) than for adults (7.2 h) and apparent clearance was faster (1.5 mL/min/kg) than for adults (0.96 mL/min/kg). Population pharmacokinetic analysis showed that body weight was significantly correlated to the clearance of levetiracetam in pediatric patients; clearance increased with an increase in body weight. Pregnancy Levetiracetam levels may decrease during pregnancy. Gender   Levetiracetam Cmax and AUC were 20% higher in women (N=11) compared to men (N=12). However, clearances adjusted for body weight were comparable. Race   Formal pharmacokinetic studies of the effects of race have not been conducted. Cross-study comparisons involving Caucasians (N=12) and Asians (N=12), however, show that pharmacokinetics of levetiracetam were comparable between the two races. Because levetiracetam is primarily renally excreted and there are no important racial differences in creatinine clearance, pharmacokinetic differences due to race are not expected. Renal Impairment   The disposition of levetiracetam was studied in adult subjects with varying degrees of renal function. Total body clearance of levetiracetam is reduced in patients with impaired renal function by 40% in the mild group (CLcr = 50 to 80 mL/min), 50% in the moderate group (CLcr = 30 to 50 mL/min) and 60% in the severe renal impairment group (CLcr <30 mL/min). Clearance of levetiracetam is correlated with creatinine clearance. In anuric (end stage renal disease) patients, the total body clearance decreased 70% compared to normal subjects (CLcr >80 mL/min). Approximately 50% of the pool of levetiracetam in the body is removed during a standard 4-hour hemodialysis procedure [see Dosage and Administration (2.5)]. Hepatic Impairment   In subjects with mild (Child-Pugh A) to moderate (Child-Pugh B) hepatic impairment, the pharmacokinetics of levetiracetam were unchanged. In patients with severe hepatic impairment (Child-Pugh C), total body clearance was 50% that of normal subjects, but decreased renal clearance accounted for most of the decrease. No dose adjustment is needed for patients with hepatic impairment. Drug Interactions In vitro data on metabolic interactions indicate that levetiracetam is unlikely to produce, or be subject to, pharmacokinetic interactions. Levetiracetam and its major metabolite, at concentrations well above Cmax levels achieved within the therapeutic dose range, are neither inhibitors of, nor high affinity substrates for, human liver cytochrome P450 isoforms, epoxide hydrolase or UDP-glucuronidation enzymes. In addition, levetiracetam does not affect the in vitro glucuronidation of valproic acid.  Potential pharmacokinetic interactions of or with levetiracetam were assessed in clinical pharmacokinetic studies (phenytoin, valproate, warfarin, digoxin, oral contraceptive, probenecid) and through pharmacokinetic screening in the placebo-controlled clinical studies in epilepsy patients. Phenytoin   Levetiracetam (3000 mg daily) had no effect on the pharmacokinetic disposition of phenytoin in patients with refractory epilepsy. Pharmacokinetics of levetiracetam were also not affected by phenytoin. Valproate   Levetiracetam (1500 mg twice daily) did not alter the pharmacokinetics of valproate in healthy volunteers. Valproate 500 mg twice daily did not modify the rate or extent of levetiracetam absorption or its plasma clearance or urinary excretion. There also was no effect on exposure to and the excretion of the primary metabolite, ucb L057. Other Antiepileptic Drugs   Potential drug interactions between levetiracetam and other AEDs (carbamazepine, gabapentin, lamotrigine, phenobarbital, phenytoin, primidone and valproate) were also assessed by evaluating the serum concentrations of levetiracetam and these AEDs during placebo-controlled clinical studies. These data indicate that levetiracetam does not influence the plasma concentration of other AEDs and that these AEDs do not influence the pharmacokinetics of levetiracetam. Effect of AEDs in Pediatric Patients   There was about a 22% increase of apparent total body clearance of levetiracetam when it was co-administered with enzyme-inducing AEDs. Dose adjustment is not recommended. Levetiracetam had no effect on plasma concentrations of carbamazepine, valproate, topiramate, or lamotrigine. Oral Contraceptives   Levetiracetam (500 mg twice daily) did not influence the pharmacokinetics of an oral contraceptive containing 0.03 mg ethinyl estradiol and 0.15 mg levonorgestrel, or of the luteinizing hormone and progesterone levels, indicating that impairment of contraceptive efficacy is unlikely. Coadministration of this oral contraceptive did not influence the pharmacokinetics of levetiracetam. Digoxin   Levetiracetam (1000 mg twice daily) did not influence the pharmacokinetics and pharmacodynamics (ECG) of digoxin given as a 0.25 mg dose every day. Coadministration of digoxin did not influence the pharmacokinetics of levetiracetam. Warfarin   Levetiracetam (1000 mg twice daily) did not influence the pharmacokinetics of R and S warfarin. Prothrombin time was not affected by levetiracetam. Coadministration of warfarin did not affect the pharmacokinetics of levetiracetam. Probenecid   Probenecid, a renal tubular secretion blocking agent, administered at a dose of 500 mg four times a day, did not change the pharmacokinetics of levetiracetam 1000 mg twice daily. Cssmax of the metabolite, ucb L057, was approximately doubled in the presence of probenecid while the fraction of drug excreted unchanged in the urine remained the same. Renal clearance of ucb L057 in the presence of probenecid decreased 60%, probably related to competitive inhibition of tubular secretion of ucb L057. The effect of levetiracetam on probenecid was not studied., 75508=Levetiracetam blood levels may decrease during pregnancy [see Warnings and Precautions (5.9)]. Teratogenic Effects Pregnancy Category C There are no adequate and controlled studies in pregnant women. In animal studies, levetiracetam produced evidence of developmental toxicity, including teratogenic effects, at doses similar to or greater than human therapeutic doses. Levetiracetam should be used during pregnancy only if the potential benefit justifies the potential risk to the fetus. Oral administration of levetiracetam to female rats throughout pregnancy and lactation led to increased incidences of minor fetal skeletal abnormalities and retarded offspring growth pre- and/or postnatally at doses ≥350 mg/kg/day (equivalent to the maximum recommended human dose of 3000 mg [MRHD] on a mg/m2 basis) and with increased pup mortality and offspring behavioral alterations at a dose of 1800 mg/kg/day (6 times the MRHD on a mg/m2 basis). The developmental no effect dose was 70 mg/kg/day (0.2 times the MRHD on a mg/m2 basis). There was no overt maternal toxicity at the doses used in this study. Oral administration of levetiracetam to pregnant rabbits during the period of organogenesis resulted in increased embryofetal mortality and increased incidences of minor fetal skeletal abnormalities at doses ≥600 mg/kg/day (4 times MRHD on a mg/m2 basis) and in decreased fetal weights and increased incidences of fetal malformations at a dose of 1800 mg/kg/day (12 times the MRHD on a mg/m2 basis). The developmental no effect dose was 200 mg/kg/day (equivalent to the MRHD on a mg/m2 basis). Maternal toxicity was also observed at 1800 mg/kg/day. When levetiracetam was administered orally to pregnant rats during the period of organogenesis, fetal weights were decreased and the incidence of fetal skeletal variations was increased at a dose of 3600 mg/kg/day (12 times the MRHD). 1200 mg/kg/day (4 times the MRHD) was a developmental no effect dose. There was no evidence of maternal toxicity in this study. Treatment of rats with levetiracetam during the last third of gestation and throughout lactation produced no adverse developmental or maternal effects at doses of up to 1800 mg/kg/day (6 times the MRHD on a mg/m2 basis). Pregnancy Registry To provide information regarding the effects of in utero exposure to levetiracetam, physicians are advised to recommend that pregnant patients taking levetiracetam enroll in the North American Antiepileptic Drug (NAAED) pregnancy registry. This can be done by calling the toll free number 1-888-233-2334, and must be done by the patients themselves. Information on the registry can also be found at the website http://www.aedpregnancyregistry.org/., 15103=Advise patients to notify their healthcare provider if they become pregnant or intend to become pregnant during levetiracetam therapy. Encourage patients to enroll in the North American Antiepileptic Drug (NAAED) pregnancy registry if they become pregnant. This registry is collecting information about the safety of antiepileptic drugs during pregnancy. To enroll, patients can call the toll free number 1-888-233-2334 [see Use in Specific Populations (8.1)]., 150640=Initiate treatment with a daily dose of 1000 mg/day, given as twice-daily dosing (500 mg twice daily). Additional dosing increments may be given (1000 mg/day additional every 2 weeks) to a maximum recommended daily dose of 3000 mg. There is no evidence that doses greater than 3000 mg/day confer additional benefit. Pediatric Patients 1 Month to < 6 Months Initiate treatment with a daily dose of 14 mg/kg in 2 divided doses (7 mg/kg twice daily). Increase the daily dose every 2 weeks by increments of 14 mg/kg to the recommended daily dose of 42 mg/kg (21 mg/kg twice daily). In the clinical trial, the mean daily dose was 35 mg/kg in this age group. The effectiveness of lower doses has not been studied. 6 Months to <4 Years: Initiate treatment with a daily dose of 20 mg/kg in 2 divided doses (10 mg/kg twice daily). Increase the daily dose in 2 weeks by an increment of 20 mg/kg to the recommended daily dose of 50 mg/kg (25 mg/kg twice daily). If a patient cannot tolerate a daily dose of 50 mg/kg, the daily dose may be reduced. In the clinical trial, the mean daily dose was 47 mg/kg in this age group., 36206=The percentage of patients (y-axis) who achieved ≥50% reduction in weekly seizure rates from baseline in partial onset seizure frequency over the entire randomized treatment period (titration + evaluation period) within the three treatment groups (x-axis) is presented in Figure 2.   The comparison of levetiracetam 2000 mg/day to levetiracetam 1000 mg/day for responder rate was statistically significant (P=0.02). Analysis of the trial as a cross-over yielded similar results. Study 3 Study 3 was a double-blind, placebo-controlled, parallel-group study conducted at 47 centers in Europe comparing levetiracetam 3000 mg/day (N=180) and placebo (N=104) in patients with refractory partial onset seizures, with or without secondary generalization, receiving only one concomitant AED. Study drug was given in two divided doses. After a prospective baseline period of 12 weeks, patients were randomized to one of two treatment groups described above. The 16-week treatment period consisted of a 4-week titration period, followed by a 12-week fixed dose evaluation period, during which concomitant AED doses were held constant. The primary measure of effectiveness was a between group comparison of the percent reduction in weekly seizure frequency relative to placebo over the entire randomized treatment period (titration + evaluation period). Secondary outcome variables included the responder rate (incidence of patients with ≥50% reduction from baseline in partial onset seizure frequency). Table 12 displays the results of the analysis of Study 3., 161105=To report SUSPECTED ADVERSE REACTIONS, contact Aurobindo Pharma USA, Inc. at 1-866-850-2876 or FDA at 1-800-FDA-1088 or www.fda.gov/medwatch., 2319=You can also get information about levetiracetam oral solution by calling 1-866-850-2876. What are the ingredients of levetiracetam oral solution? Active ingredient: levetiracetam Inactive ingredients: maltitol solution, glycerin, propylene glycol, methylparaben, propylparaben, citric acid monohydrate, sodium citrate (dihydrate), acesulfame potassium, ammonium glycyrrhizinate, artificial grape flavor, and purified water. Levetiracetam oral solution does not contain lactose or gluten. Levetiracetam oral solution does contain carbohydrates. The liquid is dye-free. This Medication Guide has been approved by the U.S. Food and Drug Administration. Manufactured for: Aurobindo Pharma USA, Inc. 2400 Route 130 North Dayton, NJ 08810 Manufactured by: Aurobindo Pharma Limited Hyderabad-500 090, India Revised: 07/2015, 4171=These side effects can happen at any time but happen more often within the first 4 weeks of treatment except for infection. Tell your healthcare provider if you have any side effect that bothers you or that does not go away. These are not all the possible side effects of levetiracetam oral solution. For more information, ask your healthcare provider or pharmacist. Call your doctor for medical advice about side effects. You may report side effects to FDA at 1-800-FDA-1088. How should I store levetiracetam oral solution? , 167962=Warnings and Precautions, (5.1, 5.3, 5.7, 5.8)                    03/2015, 69632=Neurocognitive effects were measured by the Leiter-R Attention and Memory (AM) Battery, which measures various aspects of a child’s memory and attention. Although no substantive differences were observed between the placebo and drug treated groups in the median change from baseline in this battery, the study was not adequate to assess formal statistical non-inferiority of the drug and placebo. The Achenbach Child Behavior Checklist (CBCL/6 to 18), a standardized validated tool used to assess a child’s competencies and behavioral/emotional problems, was also assessed in this study. An analysis of the CBCL/6 to 18 indicated on average a worsening in levetiracetam-treated patients in aggressive behavior, one of the eight syndrome scores [see Warnings and Precautions (5.1)]. Studies of levetiracetam in juvenile rats (dosing from day 4 through day 52 of age) and dogs (dosing from week 3 through week 7 of age) at doses of up to 1800 mg/kg/day (approximately 7 and 24 times, respectively, the maximum recommended pediatric dose of 60 mg/kg/day on a mg/m2 basis) did not indicate a potential for age-specific toxicity., 45810=Carcinogenesis Rats were dosed with levetiracetam in the diet for 104 weeks at doses of 50, 300 and 1800 mg/kg/day. The highest dose is 6 times the maximum recommended daily human dose (MRHD) of 3000 mg on a mg/m2 basis and it also provided systemic exposure (AUC) approximately 6 times that achieved in humans receiving the MRHD. There was no evidence of carcinogenicity. In mice, oral administration of levetiracetam for 80 weeks (doses up to 960 mg/kg/day) or 2 years (doses up to 4000 mg/kg/day, lowered to 3000 mg/kg/day after 45 weeks due to intolerability) was not associated with an increase in tumors. The highest dose tested in mice for 2 years (3000 mg/kg/day) is approximately 5 times the MRHD on a mg/m2 basis. Mutagenesis Levetiracetam was not mutagenic in the Ames test or in mammalian cells in vitro in the Chinese hamster ovary/HGPRT locus assay. It was not clastogenic in an in vitro analysis of metaphase chromosomes obtained from Chinese hamster ovary cells or in an in vivo mouse micronucleus assay. The hydrolysis product and major human metabolite of levetiracetam (ucb L057) was not mutagenic in the Ames test or the in vitro mouse lymphoma assay. Impairment of Fertility No adverse effects on male or female fertility or reproductive performance were observed in rats at oral doses up to 1800 mg/kg/day (6 times the maximum recommended human dose on a mg/m2 or systemic exposure [AUC] basis)., 146988=Initiate treatment with a dose of 1000 mg/day, given as twice-daily dosing (500 mg twice daily). Increase the dosage by 1000 mg/day every 2 weeks to the recommended daily dose of 3000 mg. The effectiveness of doses lower than 3000 mg/day has not been studied., 14575=Manufactured for: Aurobindo Pharma USA, Inc. 2400 Route 130 North Dayton, NJ 08810 Manufactured by: Aurobindo Pharma Limited Hyderabad-500 090, India Revised: 07/2015, 39564=The percentage of patients (y-axis) who achieved ≥50% reduction in weekly seizure rates from baseline in partial onset seizure frequency over the entire randomized treatment period (titration + evaluation period) within the three treatment groups (x-axis) is presented in Figure 1. Study 2 Study 2 was a double-blind, placebo-controlled, crossover study conducted at 62 centers in Europe comparing levetiracetam 1000 mg/day (N=106), levetiracetam 2000 mg/day (N=105), and placebo (N=111) given in equally divided doses twice daily. The first period of the study (Period A) was designed to be analyzed as a parallel-group study. After a prospective baseline period of up to 12 weeks, patients were randomized to one of the three treatment groups described above. The 16-week treatment period consisted of the 4-week titration period followed by a 12-week fixed dose evaluation period, during which concomitant AED regimens were held constant. The primary measure of effectiveness was a between group comparison of the percent reduction in weekly partial seizure frequency relative to placebo over the entire randomized treatment period (titration + evaluation period). Secondary outcome variables included the responder rate (incidence of patients with ≥50% reduction from baseline in partial onset seizure frequency). The results of the analysis of Period A are displayed in Table 11., 159505=Revised: 7/2015, 58728=Effects on QTc Interval The effect of levetiracetam on QTc prolongation was evaluated in a randomized, double-blind, positive-controlled (moxifloxacin 400 mg) and placebo-controlled crossover study of levetiracetam (1000 mg or 5000 mg) in 52 healthy subjects. The upper bound of the 90% confidence interval for the largest placebo-adjusted, baseline-corrected QTc was below 10 milliseconds. Therefore, there was no evidence of significant QTc prolongation in this study., 43449=Effectiveness in Partial Onset Seizures in Adults with Epilepsy The effectiveness of levetiracetam as adjunctive therapy (added to other antiepileptic drugs) in adults was established in three multicenter, randomized, double-blind, placebo-controlled clinical studies in patients who had refractory partial onset seizures with or without secondary generalization. The tablet formulation was used in all these studies. In these studies, 904 patients were randomized to placebo, 1000 mg, 2000 mg, or 3000 mg/day. Patients enrolled in Study 1 or Study 2 had refractory partial onset seizures for at least two years and had taken two or more classical AEDs. Patients enrolled in Study 3 had refractory partial onset seizures for at least 1 year and had taken one classical AED. At the time of the study, patients were taking a stable dose regimen of at least one and could take a maximum of two AEDs. During the baseline period, patients had to have experienced at least two partial onset seizures during each 4-week period. Study 1 Study 1 was a double-blind, placebo-controlled, parallel-group study conducted at 41 sites in the United States comparing levetiracetam 1000 mg/day (N=97), levetiracetam 3000 mg/day (N=101), and placebo (N=95) given in equally divided doses twice daily. After a prospective baseline period of 12 weeks, patients were randomized to one of the three treatment groups described above. The 18-week treatment period consisted of a 6-week titration period, followed by a 12-week fixed dose evaluation period, during which concomitant AED regimens were held constant. The primary measure of effectiveness was a between group comparison of the percent reduction in weekly partial seizure frequency relative to placebo over the entire randomized treatment period (titration + evaluation period). Secondary outcome variables included the responder rate (incidence of patients with ≥50% reduction from baseline in partial onset seizure frequency). The results of the analysis of Study 1 are displayed in Table 10.}",
    "textBeforeTable": "Number of versions: 10 LEVETIRACETAM - levetiracetam solution View Label Archives for this drug View Label Archives, RxNorm, Get Label RSS Feed More Info on this Drug Medline Plus, Clinical Trials, PubMed, Biochemical Data Summary Related Resources Report Adverse Events, FDA Safety Recalls, Presence in Breast Milk Safety (also available in the left menu) Find additional resources Close All Sections View All Sections Close API MANUFACTURE(65862-250) 918917626 Aurobindo Pharma Limited Business Operations ID/FEI Address Name Establishment ANALYSIS(65862-250) , MANUFACTURE(65862-250) 918917642 Aurobindo Pharma Limited Business Operations ID/FEI Address Name Establishment Labeler - Aurobindo Pharma Limited (650082092)",
    "textAfterTable": "RxNorm LEVETIRACETAM - levetiracetam solution RxCUI RxNorm NAME RxTTY 1 403884 Levetiracetam 100 MG/ML Oral Solution SCD 2 403884 levetiracetam 500 MG per 5 ML Oral Solution SY Get Label RSS Feed for this Drug LEVETIRACETAM - levetiracetam solution To receive this label RSS feed Copy the URL below and paste it into your RSS Reader application. https://dailymed.nlm.nih.gov/dailymed/labelrss.cfm?setid=F65EC19D-B90E-452E-B761-C68B1CF2C892 To receive all DailyMed Updates for the last seven days Copy the URL below and paste it into your RSS Reader application. https://dailymed.nlm.nih.gov/dailymed/rss.cfm What will I get with the DailyMed RSS feed? DailyMed will deliver notification of updates and additions to Drug Label information currently shown on this site through its RSS feed. DailyMed will deliver this notification to your desktop, Web browser, or e-mail depending on the RSS Reader you select to use. To view updated drug label links, paste the RSS feed address (URL) shown below into a RSS reader, or use a browser which supports RSS feeds, such as Safari for Mac OS X. How to discontinue the RSS feed If you no longer wish to have this DailyMed RSS service, simply delete the",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}