{
    "relation": [
        [
            "Channel",
            "ABC1 NSW",
            "SBS ONE Sydney",
            "Channel Seven Sydney",
            "Channel Nine Sydney",
            "Network TEN Sydney"
        ],
        [
            "TV show",
            "Eggheads",
            "Japanese News",
            "Seven Early News",
            "Today",
            "CBS This Morning"
        ],
        [
            "Time",
            "5:30 am - 6 am",
            "5:40 am - 6:15 am",
            "5:30 am - 6 am",
            "5:30 am - 9 am",
            "5:30 am - 6 am"
        ]
    ],
    "pageTitle": "The Age - Business, World & Breaking News | Melbourne, Australia",
    "title": "Summary of what TV shows are on tonight",
    "url": "http://www.theage.com.au/am/2013/01/31/index.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438043062635.98/warc/CC-MAIN-20150728002422-00206-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 758071867,
    "recordOffset": 758004622,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{39770=Show to be rolled into a one-hour news bulletin from February 10., 43019=MARK RUSSELL A coroner's finding that former police officer Denis Tanner shot dead his sister-in-law in 1984 will stand despite the fact he has never been charged, a court heard today., 67917=Celebrities arrive for the 2013 AACTA Awards., 61929=CHRIS JOHNSON The Community and Public Sector Union would ramp up its campaign to protect public service jobs before the September 14 poll, national secretary Nadine Flood declared on Wednesday.}",
    "TableContextTimeStampAfterTable": "{121815=Feb 14 Dinner deals, concerts and movies for couples to choose from., 44117=New entry-level model coming in April., 241254=1160 views, 185027=Highest-grossing Australian film of 2012 doesn't rate an AACTA., 261030=January 30 2013, 122836=Feb 16, 17 Boom! Bap! Pow! will headline the South West Craft Beer Festival's 2013 line-up., 244534=PM announces election for September 14, 162215=Celebrities arrive on the red carpet for the 2013 AACTA Awards in Sydney., 100865=Start your training for Run Melbourne 2013, to be held on Sunday, July 21., 247343=seat1a, Jan 31, 2013, 1:04AM, 248300=David, Jan 30, 2013, 11:58PM, 123896=March 19 - April 17 The comedy Haute Cuisine, will launch the 24th Alliance Française Film Festival.}",
    "textBeforeTable": "7am 6:30am 6am 5:30am 5am 4:30am Skip to: Tonight's episode of Neighbours concerns the romantic prospects of single new mother, Vanessa (Alin Sumarwata). Neighbours What's on TV Tonight Queenslanders share their thoughts on big issues. Gathering of the minds Our local experts give you the advice you ask for. Good Advice Opinion Book your tickets now and win an art adventure in Paris. Line up your laughs Brisbane Comedy Festival No, says Yeasayer guitarist ahead of Brisbane gig. Local flattery? Laneway",
    "textAfterTable": "Summary of what TV shows are on tonight Channel TV show Time ABC1 QLD The Dreaming 5:23 am - 5:30 am SBS ONE Queensland Korean News 5:05 am - 5:40 am Channel Seven Brisbane Sunrise Extra 5 am - 5:30 am Channel Nine Brisbane Nine's Early Morning News 5 am - 5:30 am Network TEN Brisbane Life Today with James Robison 5 am - 5:30 am Summary of what TV shows are on tonight Channel TV show Time ABC1 QLD Eggheads 5:30 am - 6 am SBS ONE Queensland Japanese News 5:40 am - 6:15 am Channel Seven Brisbane Seven Early News 5:30 am - 6 am Channel Nine Brisbane Today",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}