{
    "relation": [
        [
            "Responder",
            "B Helena RODRIGUEZ",
            "Piotr Wiechno",
            "Dong-Young Lee",
            "Adam Abramski",
            "Michael Bodell",
            "Michael Johnston",
            "Balwinder Kaur",
            "Daniel Burnett",
            "Sheau Ng",
            "Deborah Dahl",
            "Kazuyuki Ashimura",
            "James Barnett"
        ],
        [
            "Yoshiaki Ohsumi - Panasonic",
            "Yes (as participant)",
            "Yes (as participant)",
            "Yes (as participant)",
            "Yes (as participant)",
            "Yes (as participant)",
            "Yes (as participant)",
            "Yes (as participant)",
            "Yes (as speaker)",
            "Yes (as participant)",
            "Yes (as speaker)",
            "Yes (as participant)",
            "Yes (as participant)"
        ],
        [
            "Comments",
            "",
            "Panasonic's interest in multimodal applications and their impact on customer satisfaction clearly stated.",
            "He mentioned that he doesn't need presentation.",
            "Position paper states they would just like to attend and not present anything.",
            "",
            "",
            "",
            "They say they do not need to present, but I think it would be fine if they wanted to.",
            "",
            "candidate for \"lightening use case\" session.",
            "interested in integration HTML5 and MMI for SmartTV, Smart home and advanced health care services",
            "use cases"
        ]
    ],
    "pageTitle": "Results of Questionnaire Position Paper Review Form: the W3C Workshop on Rich Multimodal Application Development - Web-Based Straw-poll and Balloting System",
    "title": "",
    "url": "http://www.w3.org/2002/09/wbs/1/mmiws2013-review/results",
    "hasHeader": true,
    "headerPosition": "MIXED",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438043062635.98/warc/CC-MAIN-20150728002422-00130-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 814912539,
    "recordOffset": 814898507,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{1593=This questionnaire was open from 2013-06-29 to 2013-07-15.}",
    "lastModified": "Wed, 29 Jul 2015 10:34:11 GMT",
    "textBeforeTable": "Details It depends (please leave a comment) No 11 Yes (as speaker) 1 Yes (as participant) Results All responders Choice Summary Position paper 1. António Teixeira - DETI/IEETA General comments Yoshiaki Kozaki - NTT Advanced Technology Corporation Wei-Yun Yau - Institute for Infocomm Research Kazuyuki Ashimura - W3C - Paper 2 Kazuyuki Ashimura - W3C - Paper 1 Yoshiaki Ohsumi - Panasonic Sheau Ng - NBCUniversal Brian Dooner - iVVi Media Ryosuke Aoki - NTT IA Institute Holger Banski - Bosch Craig Campbell - iSpeech, Inc Deborah Dahl - Conversational Technologies Louay Bassbouss - Fraunhofer FOKUS Morio Hirahara - ECHONET Consortium Masaki Umejima - JSCA and Keio University Sean M. Prell - Johnson and Wales University António Teixeira - DETI/IEETA Jump to results for question: 12 answers have been received. This questionnaire was open from 2013-06-29 to 2013-07-15. The results of this questionnaire are available to anybody. In addition, answers are sent to the following email address: team-mmi-ws-chairs@w3.org Participation\">WG Management (IPP)·Group details you are supposed to answer\">My questionnaires·",
    "textAfterTable": "2. Sean M. Prell - Johnson and Wales University Position paper Summary Choice All responders Results Yes (as participant) 3 Yes (as speaker) No 7 It depends (please leave a comment) 2 Details Responder Sean M. Prell - Johnson and Wales University Comments B Helena RODRIGUEZ No Piotr Wiechno Yes (as participant) I'm not sure about the paper, which seems to be totally off-topic. However, I don't see any harm in having the author participate in the workshop since everyone's invited, and it may be an interesting discussion. Dong-Young Lee No I don't see anything related to MMI in the paper. Maybe he submitted a wrong paper? Adam Abramski Yes (as participant) Wasn't clear how MMI would be part of this talk. Michael Bodell Yes (as participant) This didn't seem that closely related. Michael Johnston No Completely off topic. Not clear why this position paper is submitted here. Balwinder Kaur No The paper does not explain what the connection between MMI and",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}