{
    "relation": [
        [
            "Categories",
            "Campus Safety",
            "Great for these types of students",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "This is a very safe campus. For those who have children and are full time students in pierce, there is a child center. That is why campus safety is very high.",
            "People who like a friendly and peaceful atmosphere. This campus is not stressful to be in. Musicians would love this place because very often during the breaks there are people who play the guitar and sing.",
            "Pierce campus has a very big gym with a basketball court. Also, there is a ping-pong table near cafeteria. If you like to do something more peaceful, you can go to piano rooms which are located in the Olympic building.",
            "The cafeteria has very delicious french fries. There are a lot of American and Mexican food in the cafeteria. Asian food such at different kind of noodles was also brought into school's menu. Although, there is variation in food, many students prefer bringing their own lunch because the food that is provided in cafeteria is quite expensive.",
            "There is no dorm around Pierce College at Fort Steilacoom. However, there are many apartments and home stays around the campus. Many international students rent apartments nearby.",
            "Teachers at Pierce college are very strict on plagiarism so try avoid it at any cost. The knowledge of teachers is valuable and the classes are informative. The best way to learn something is to listen to the teachers' lectures.",
            "Pierce college is relatively a small campus so there is a better access to teachers and stuff. You can always find help from the librarians if you are doing a research. There is a Writing Studio where you can check your grammar with professionals without making an appointment.",
            "Pierce college is a good place for studying. It has the large library and very helpful stuff. Pierce college has a good friendly and calm environment that may help you to be focused more on the studies."
        ]
    ],
    "pageTitle": "Pierce College at Fort Steilacoom Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Pierce-College-at-Fort-Steilacoom/reviews?_escaped_fragment_=/show/86946",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988840.31/warc/CC-MAIN-20150728002308-00177-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 902741767,
    "recordOffset": 902702838,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{97851=Pierce college is relatively a small campus so there is a better access to teachers and stuff. You can always find help from the librarians if you are doing a research. There is a Writing Studio where you can check your grammar with professionals without making an appointment., 179967=© 2015, Cappex.com, LLC}",
    "textBeforeTable": "03/15/2012 Reviewer is A current student here. 3 out of 3 people found this review useful. 1 of 42 Joon from Lakewood, WA Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {//",
    "textAfterTable": "Dorm Life The dorm life is not existent. Being a community college, many of the students are commuters. There is, however, many apartments near by that are filled with Pierce College students. Academic Rigor The instructors all do a good job at making sure the classwork and homework are managed well. They demand the utmost attention to work and quality of work. However, the instructors are always willing to meet up and help you through those difficult problems. Tips for prospective students Definitely consider Pierce College as a main choice. As a community college, the staff is very friendly and are always willing to help you get to the next step in your educational career. The resources available to you are vast and wide so you'll never get stuck. In three sentences Pierce College Fort Steilacoom is a great school for anyone wanting to broaden their education. The school provides not only provides a vast variety of classes, but also the instructors truly care that you retain the information for your future career. Resources are never a shortage because the school does a great job giving back to the students. Login to rate or flag the reviews",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}