{
    "relation": [
        [
            "Choice",
            "Definitely Not",
            "Probably Not",
            "Probably Yes",
            "Definitely Yes"
        ],
        [
            "Count",
            "1",
            "8",
            "16",
            "12"
        ],
        [
            "Percentage",
            "2.7%",
            "21.6%",
            "43.2%",
            "32.4%"
        ]
    ],
    "pageTitle": "Formative Evaluation of the Trade Commissioner Service - Client Service Fund",
    "title": "",
    "url": "http://www.international.gc.ca/about-a_propos/oig-big/2005/evaluation/CSF-FSC.aspx?lang=eng",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988840.31/warc/CC-MAIN-20150728002308-00119-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 529468091,
    "recordOffset": 529397957,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{15932=As for most evaluations, there were constraints that have influenced the methodology and conduct of this evaluation. It should be noted that the methodology did not include focus group sessions with Geographic Division staff nor telephone interviews with Canadian business clients, as stipulated in the Terms of Reference. The reason for this departure is two-fold, first the findings of the 2004 Client Survey were considered highly relevant as an assessment of the CSF in terms of results achievement, obviating the need to collect additional primary data directly from clients. The second reason lies in the importance placed by the TBX/CSF Unit on the views and opinions of TPMs and a select number of other ITCan Branches and Divisions., 10772=DFAIT had the mandate to foster the expansion of Canada's international trade, as set out in the Department of Foreign Affairs and International Trade Act, RSC 1985, c. E-22. The purpose of the IBD Business Line (2) was then:, 51103=(April 2005), 12757=In 1995, the Department of Foreign Affairs and International Trade (DFAIT) established the Program for International Business Development (PIBD) through the consolidation of a variety of formerly separate trade, investment and science and technology promotion programs, such as, the Program for Export Market Development/ government-initiated activities, the World Market Trade Development Program, the Post-Initiated Promotional Projects for the US, the Access North America Program, the National Trade Strategy, Going Global, the Investment Development Program, and the Technology Inflow Program. Subsequent to a program review undertaken in FY 2001-2002, the PIBD was replaced by the newly created CSF, which was launched in April 2002., 39337=The achievement of short-term outcomes for Canadian business clients as a result of the use of these products and services has remained quite high and relatively unchanged in terms of: overall awareness and appreciation of TCS services; awareness and knowledge of market opportunities; and, expanded network of contacts. Business client satisfaction with respect to the accuracy of key contact lists and the reliability of local company information was somewhat down in 2004. A valid and reliable determination on the increased awareness for foreign contacts could not be made, similarly for enhanced guidance and support by Canadian partner clients due to a lack of available data., 25400=The primary purpose of this formative evaluation was to determine the extent to which the CSF is making progress toward meeting its strategic and operational objectives through an assessment of short- and medium-term expected outcome achievement since its inception in April 2002. In addition, it also examined evaluation issues related to program relevance and cost-effectiveness. The following definitions of these three evaluation standards are provided to ensure a common understanding among all of those concerned., 11316=Since the launch of the CSF, the DFAIT was divided into two separate departments: Foreign Affairs Canada (FAC) and International Trade Canada (ITCan). Created in December 2003, ITCan brings together specialists in trade, investment and international business development. International Business Development, including the TCS's CSF, is one of this new department's four business lines, along with Trade Policy, Investment Promotion and Corporate Services., 21532=The CSF is an integral part of the services delivered by the Trade Commissioner Services (TCS), in particular the C-E Sections at Posts, and cannot be realistically distinguished from the New Approach@Work (NA@W) six core services which is described in section 2.9 of this report. Consequently, the TCS Client Survey findings are highly relevant to the CSF, since many of the Canadian businesses and partners interviewed were involved in a CSF initiative, although they may not have been aware of the provenance of the funding which supported their particular activity. As such, the findings of the 2004 Client Survey(1) provided valid and reliable indicator data on CSF results achievement, especially at the short- and medium-term outcome levels, while the 2002 Client Survey data was used as a baseline reference., 42102=The primary purpose of this formative evaluation was to determine the extent to which the CSF is making progress toward meeting its strategic and operational objectives through an assessment of short- and medium-term expected outcome achievement since its inception in April 2002. In addition, it also examined evaluation issues related to program relevance and cost-effectiveness. The methodology involved relatively distinct data collection activities which included: the extraction and analysis of existing performance data from the IBD Planning and Reporting system; face to face interviews with individuals from TBX, and ITCan personnel representing Geographic Divisions, Investment Partnership Branch (IPB), Science and Technology (TBR) and Market Research Centre (TMR); and, on-line survey of trade program managers., 42956=The CSF was launched in April 2002 subsequent to a review of the Program for International Business Development (PIBD). It was designed to be the Department's principal fund for supporting proactive initiatives undertaken through Trade Commissioner Service (TCS) to assist Canadian business and partner clients to compete globally, and to influence foreign decision-makers to select Canada as a preferred source of goods and services. It was intended to enable Trade Program Managers (TPMs) and Commercial Officers (COs) to develop business contacts, test the market, identify agents and distributors, acquire Market Information and Intelligence (MII) and broaden the awareness of Canadian capability in foreign markets. The Fund was established to contribute to the overall objectives of the International Business Development (IBD) Branch., 22286=Since the 2002-2003 fiscal year (FY), a considerable amount of tombstone and performance data on CSF initiatives were collected from Trade Program Managers (TPMs) through an on-line reporting database available on the Horizons web site referred to as the IBD Planning and Reporting system. While some analysis was previously conducted using the 2002-2003 Reporting data, TBX/CSF Unit staff participated in the analysis of the 2003-2004 Reporting data. Much of this data was used to assess the types of CSF products and services and, particularly, TPM's perceptions of outcome achievement. The findings were triangulated with other data sources containing similar performance data (e.g., client survey and employee survey), wherever possible., 20634=The 2003 Employee Survey was also valuable secondary data source that was used to assess a number of important evaluation issues. While specific questions were asked in the survey questionnaire related to the CSF it also contained relevant data on the staff workload at Posts, thus contributing to the assessment of cost-effectiveness., 41213=The CSF has remained highly relevant to the Government of Canada (GOC) IBD objectives and priorities. Its policy guidance continues to be updated to remain current with changes in strategic priorities and key results. Nevertheless, the realignment of the Department's organisational structure and Strategic Framework warrants further articulation and emphasis of the role of 'two-way international investment' and 'science and technology linkages' as critically important IBD programming areas. Advancing this international commerce approach is a Corporate issue that requires policy guidance and emphasis in the IBD business plans. While the CSF continues to meet the needs and expectations of its Canadian business and partner clients, its allocations are not well aligned with the Canadian Commercial Interests List (CCIL) priority markets and Trade Team Canada Sectors (TTCS). In both of these cases, Corporate guidance is required on their use as policy instruments to bring about stronger alignment between IBD plans, including CSF initiatives, and priority markets and sectors. The level of CSF funding remains significant and meaningful for Commercial-Economic Sections (C-E Sections) in Posts located in relatively high priority markets (e.g., 2003-2004 CCIL top 23 markets) however, funding to small C-E Sections in lower priority markets is no longer adequate for meaningful proactive IBD programming., 38642=Medium-term outcome achievement for business clients has seen a significant improvement in almost all areas since the launch of the CSF. The perception of Canadian business clients is that the TCS/CSF services can be attributed with positively influencing or contributing to various aspects of their business. Thirty-six percent (36%) of business clients attributed their financial results averaging $7.6 million each over the past 12 months to the TCS/CSF services. On the other hand, the perception of Canadian partner clients regarding the positive contribution of the TCS/CSF to their business initiatives has continued on a downward trend since the 2002 Client Survey, especially with respect to saving time and money, market access and opportunities, making better decisions, finding the right people and business image/credibility., 22662=All available documentation related to the CSF were reviewed including: Results-Based Management Framework (RMAF); Guidelines; 2002-2003 Report Analysis; various surveys (e.g., Employee Survey and Client Survey); as well as other relevant ITCan documentation available on the Horizons web site.}",
    "TableContextTimeStampAfterTable": "{156364=The Geographic Divisions use the IBD Planning and Reporting system primarily in the same way as the C-E Sections of Posts (i.e., to fulfil the planning and reporting requirements for their CSF allocation). Depending on their level of involvement and role in the strategic planning process, they may also use the IBD system to review and comment on the Post Strategy and Action Plans. However, in most cases, the strategic planning process has been completed by the end of March, if not sooner, well before the planning templates are made available on-line, or due to be submitted. Consequently, the IBD Planning and Reporting system is not used by Geographic Divisions as a tool for coordination, sharing of planning information or quality control, but moreover as a repository of planning information which is accessed only after the Strategy and Action Plans are submitted by Posts., 57537=Canadian business and partner clients were active in targeting the following foreign markets at the time of the 2004 Client Survey: USA, China, Japan, Mexico, United Kingdom, Australia, France and India. In terms of their expectations, 79% of business clients and 57% of partner clients were targeting exports or direct sales at the time they used the TCS/CSF service. This is somewhat lower on average (76%) than the 2002 Client Survey where 80% shared this objective. Other reasons for their business activities abroad included: service or assistance to other Canadian organisations; seeking R&D or technology partnerships; licencing or franchising; foreign acquisition, equity investment or joint venture; attracting foreign investment; and, seeking international project financing. Partner clients tended to cite service or assistance to other Canadian organisations, seeking R&D or technology partnerships, and attracting foreign investment significantly more frequently than their Canadian business client counterparts., 184607=On the other hand, the perception of Canadian partner clients regarding the positive contribution of the TCS/CSF to their business initiatives has continued on a downward trend since 2002 Client Survey, especially with respect to saving time and money, market access and opportunities, making better decisions, finding the right people and business image/credibility. As mentioned above, this correlates with the perception of TPMs who rated the corresponding short-term outcome significantly lower than others., 139973=Using the 2003-2004 IBD Planning and Reporting system data on CSF initiatives by type of IBD activity, the figures are remarkedly similar for trade (33%), investment (12%) and science & technology (8%). It should be noted that the IBD activity types are not mutually exclusive, so there is some overlap between IBD Program Delivery (33%) and the aforementioned trade, investment and S&T figures. Nevertheless, in order of magnitude it is clear that C-E Section staff spend considerably more time on trade development than investment and science and technology related IBD activities., 56805=Consistent with the 2000 Client Survey, 60% of Canadian business and partner clients have used TCS/CSF services for five years or less. Large-sized business clients are more likely to have been using the TCS/CSF services for a longer period (6.9 years) compared to mid-size (6.2 years) and smaller business clients (4.5 years). Partner-clients have been using the TCS/CSF services on average nearly two years longer (7.5 years) than business clients (5.6 years). One key difference in the 2004 Client Survey is that new clients (i.e., less than one year experience with the TCS) represent less than two percent of the total population compared to 18% in 2002, otherwise the general client profile has remained the same., 178098=That ITCan reestablish the overall CSF budget to at least the same level as the 2003-2004 fiscal year expenditure level if proactive IBD programming remains a corporate priority., 187458=During the CSF first two fiscal years, there has been a year-over-year improvement in both the total amount of cost-sharing revenue, but also in the ratio of leveraged funds. In 2003-2004, for every $8 in expenditures, the CSF generated approximately $1 in cost sharing revenue. The percentage of lapsed CSF has declined over the same period from 4.82% to .29%. It is generally acknowledged that the CSF is efficiently used as \"seed money\" to leverage other revenues, and efficiently allocated and reallocated during the year to avoid unnecessary wastage of scarce resources., 90727=Since the 2002 Client Survey, the level of satisfaction with the quality of key contact and local company information has remained relatively high and steady for partner clients, while declining somewhat for business clients. The scores are approximately 15% lower for business clients in comparison to partner clients in this area., 26535=While the first strategic outcome may be relevant for the international trade policy business line, the second appears to have more relevance for the International Business Development and Investment Promotion business lines. While not substantially different from the IBD purpose statement contained in the 2001-2002 DFAIT Business Plan, which also made reference to investment and technology, this strategic outcome places considerable importance on the role of 'international commerce, two-way international investment flows, and science and technology linkages' as the means to achieving Canadian competitiveness and prosperity., 29266=The final year end total expenditures for FY 2003-2004 as at March 31, 2004 for the relevant Posts were plotted against the 53 markets on the 2003-2004 Canadian Commercial Interest List. The percentage was based on the 2003-2004 total CSF expenditure of $8,788,137. It should be noted that the CSF allocations to Geographic Divisions were calculated as a separate category. As the highest ranked market, the USA C-E Sections collectively received 25.43% of the total, while the markets ranked 2-7 collectively received 22%. Among the next group of markets ranked 8-25, the percentages of total were generally 1% or lower, however there were some notable exceptions (e.g., Italy (2.92%), Brazil (2.17%) and India (2.63%)). The rate of decline in the CSF funding allocations to markets ranked 26-53 was also gradual, remaining below 1% of total. What is of particular note however is that approximately $708,000, or 8% of total CSF expenditures, was spent in markets that did not make the CCIL in 2003-2004., 58625=Based on the 2004 Client Survey findings, the vast majority of Canadian business and partner clients would use TCS services again (92%) and would recommend TCS services to their associates (88%). A large majority (85%) of clients felt that their investment was worthwhile and that the TCS helped them advance their business interests (78%); there have been no changes in these measures since the 2002 Client Survey. Overall, more than eight out of ten (82%) clients agreed that the quality of the service provided by the TCS was impressive., 183886=The perception of Canadian business and partner clients is that the TCS/CSF services can be attributed with positively influencing or contributing to various aspects of their business. With the exception of 'projected future earning', business client responses to the 2004 Client Survey indicate a significant improvement over previous surveys in the positive contribution of the TCS/CSF to their businesses, especially in terms of market access and opportunities, finding the right people, competitiveness and financial results in the past 12 months. Thirty-six percent (36%) of business clients attributed their financial results averaging $7.6 million each over the past 12 months to the TCS/CSF services., 102840=A valuable addition to the 2004 Client Survey is the inclusion of questions regarding the achievement of financial results attributable to the TCS/CSF. Over half of all business clients (55%) claimed to have been involved in the achievement of financial results abroad. Overall, two-thirds (66%) of these clients attributed, at least in part, the financial results to the TCS/CSF services, with some variance between large companies (73%) and small companies (59%). The types of financial results achieved abroad were export sales (91%), partnership or alliance leading to revenue (28%), Canadian investment abroad leading to revenue (12%) and foreign direct investment in Canada (8%). The average value of the financial results attributable to the TCS/CSF for large companies was $21.7 million, mid-sized companies $4.2 million and small companies $.5 million, while the average for all business clients was $7.6 million. Unfortunately, the IBD Planning and Reporting system does not track business client numbers in these categories, so it was not possible to calculate the total financial results attributable to the TCS/CSF., 120399=Since the financial data for this analysis was not available from the ITCan Information Management System, the 2004-2005 IBD Planning and Reporting system was used to extract the figures for Table 11. All figures are based on the planned budgets submitted by C-E Sections as part of their IBD Strategic Plan. Assuming the accuracy of the available data and allowing for some rounding-up in the calculation, the findings show a 1:1 ratio for the first three geographic bureaus, while the Europe and North American Bureaus have a substantially higher 3:1 ratio., 199076=3 Draft reference document is dated December 3, 2004., 154967=According to the TBX/CSF Unit staff, the IBD Planning & Reporting system has evolved considerably since its launch in fiscal year 2002-2003. It was initially designed to capture the planning and reporting information for CSF initiatives, but the following year incorporated broader IBD strategic plans and non-CSF funded initiatives. In 2004-2005, action plans for non-CSF initiatives represent approximately 25% of all ongoing initiatives. While the CSF has been a catalyst for IBD planning and reporting, the emphasis has been on strategic and operational planning. The application of performance criteria has helped in ensuring systematic planning by C-E Sections, and the quality of plans has improved with each year., 6582=This Committee was to be created following the roll-out of the CSF in April 2002 and regroup the responsibilities of the PIBD Working Group, PIBD Budget Reporting and Area Management Unit System (TAMS) Committee. Its role and responsibilities remain to be determined in detail., 167977=The CSF RMAF was considered the definitive design document finalised prior to the CSF launch in April 2002. DFAIT's IBD mandate and objectives were clearly stated therein and the CSF objectives appropriately articulated to ensure policy coherence. The CSF/IBD Planning and Reporting Template for 2002-2003 included ample information and guidance to ensure that CSF initiatives were consistent with the IBD objectives and priorities. This information and guidance was subsequently updated on an annual basis as new strategic frameworks were developed, first for DFAIT and then for ITCan. A demonstration of policy coherence was required by CSF recipients at the planning and reporting stages of the management cycle. Nevertheless, changes in the Department's organisational structure and in its Strategic Framework warrant further articulation and emphasis of the role of 'two-way international investment' and 'science and technology linkages', as important IBD programming areas that are significantly under-represented in terms of the number of CSF initiatives and C-E Section staff time allocation. The integration of IBD programming in trade, investment and science and technology areas is first and foremost a Corporate issue that requires policy guidance and emphasis in the IBD business plans., 55866=Based on data extracted from the 2003-2004 IBD Planning and Reporting system, a wide variety of Canadian partner organisations are involved in TCS/CSF initiatives. The most frequently cited among the Team Canada Inc. members are: Industry Canada (23%), International Trade Centre (16%) Agriculture and Agri-Food Canada (11%), Export Development Canada (8%), National Research Council Canada (6%) and Natural Resources Canada (6%). Other government departments most frequently cited are: Investment Partnership Canada (26%), Canadian Food Inspection Agency (9%), National Defence (6%), Technology Partnerships Canada (6%) and Health Canada (6%). All of the provinces and territories were involved in varying degrees with Ontario (21%), Quebec (17%), Alberta (13%) and British Colombia (10%) being cited most frequently. Large municipalities, Canadian Associations and Institutions round out the list of TCS/CSF partner clients., 77234=Based on data extracted from the 2003-2004 IBD Planning and Reporting system, it was possible to correlate the key CSF products and services with the extent of results achievement. The frequency with which products and services were identified as having 'greatly' or 'considerably' contributed to the achievement of each short-term result determined their nominal ranking in terms of value added. Using this technique, the highest ranked on the list was viewed to have approximately eight times more value-added than the lowest ranked. It should also be noted that the data for this analysis is based on the opinions and judgement of C-E Section staff when they complete their CSF initiative reports. The following is the nominal rank order for key CSF products and services with the most value added., 99582=Two main observations can be made about the data for partner clients in Table 9. First, the relative rank order in terms of positive impact has been relatively stable across all three surveys, with only a couple of exceptions. Second, and most importantly, the 2004 Client Survey findings confirms a downward trend in positive impact on partner clients that began with the 2002 Client Survey. While there are slight improvements in a few business aspects(i.e. #6-9), there have been significant declines of 6-10% in business aspects #1-5., 189034=The general consensus is that clear guidance has been provided by the TBX/CSF Unit on what is considered eligible and ineligible expenses through a variety of communication channels. Incidents of ineligible expenses being charged to the CSF remain anecdotal, since an analysis of end-of-year financial transactions could not be accomplished within the time frame of the evaluation. However, despite appropriate policy guidance provided by the TBX/CSF Unit, it is widely recognised that TPMs/C-E Sections select priority sectors for IBD programming based on local market demands and business opportunities with little, if any, reference to the TTCS sectors and markets. Furthermore, based on a sample of 13 of the top 25 2004-2005 CCIL markets, there is little strategic focus, or sector concentration of CSF-funded initiatives. So while there are no apparent abuses or misuses of CSF funding, they are not invested in a manner that could yet be characterised as \"working with priority clients in priority sectors\"., 86410=The level of satisfaction with the quality of MII has remained relatively high since the 2002 Client Survey. However, the scores are approximately 10% lower for questions relating to decision-making support on whether or not to pursue a market and possible next steps, as well as for explaining the rationale for market assessments. Client perception regarding the provision of MII services has remained consistent since the 2002 Client Survey., 136429=The 2003 Employee Survey served as a useful source of secondary data. It asked the C-E Section staff at Posts to \"allocate the percentage of time, including overtime, receptions and official function, that you spend in a typical month, performing or supporting the following activities.\" Table 14 presents the data collected., 10361=In line with other departmental budgetary constraints and cutbacks, the annual amount set aside for the PIBD had decreased significantly, from $34 million in 1994/1995 to $9.5 million in 2000-2001. In FY 2001-2002 the allocation to geographic and functional bureaus again decreased to $8.7 million, excluding the allocation for training. At the time of its launch in April 2002, it was expected that CSF funding would stabilize at $8.7 million annually over the subsequent five years. However, the FY 2004-2005 budget allocation was again reduced to $6.3 million., 198941=2 As stated in the 2001-2002 DFAIT Business Plan., 95799=The most relevant data source for assessing progress made toward the achievement of CSF medium-term outcomes are the TCS Client Surveys, since they ask clients to assess the contribution which TCS services have had on different aspects of their business. From the other perspective, the client surveys ask clients to attribute changes in their business to TCS services they received. A comparative analysis of the findings of the 2000, 2002 and 2004 Client Surveys presented in Tables 8 and 9, provide some insight into the progress made toward the achievement of CSF medium-term outcomes., 25161=In December 2003, the former DFAIT was split into two separate organizations: International Trade Canada (ITCan) and Foreign Affairs Canada (FAC). Currently, ITCan centralizes the federal government's trade policy, investment promotion strategies and coordination of its international business development activities. Its four business lines provide the framework for the Department's managerial accountability as well as its planning and performance reports: Trade Policy, International Business Development (and Chief Trade Commissioner), Investment Promotion, and Corporate Services. Subsequent to the reorganisation, a new Strategic Framework(3) specific to ITCan emerged which represents the current policy orientation for IBD/CSF programming. Two ITCan strategic outcomes are presented as follows:, 80874=While these figures establish a useful baseline for this short-term outcome, there was no equivalent question asked in the 2004 Client Survey to draw a comparison. Since the TCS's six core services pre-date the launch of the CSF the data demonstrates that considerable progress had already been made to educate clients on their service offering., 132012=The other problem has been the lateness of the notification of the CSF allocation amounts well into the fiscal year, which hampers good financial planning. In addition, C-E Sections were notified in November whether they would actually receive the full allocation. For these reasons, financial planning and management have recently become more time consuming and administratively burdensome., 176369=The CSF and the estimated revenue that it will leverage will account for approximately 56% of all funding available to C-E Sections during FY 2004-2005. Access to sources of funding for IBD programming other than the CSF is limited to Posts in the USA, Europe and Asia-Pacific regions, while those in the Africa and Middle East and Caribbean and Latin America regions depend on relatively modest IBD travel and hospitality budgets which cannot be used in quite the same manner, especially for proactive initiatives and to leverage additional funds from clients and partners. Reductions in funding to the current fiscal year allocations are generally viewed as negatively impacting the capacity of C-E Sections to undertake proactive IBD programming, or neutral in the case of TPMs who consider their Posts to be either already severely under-funded, or well enough funded from other sources to make the necessary adjustments. Given the funding reductions to a mere fraction of its previous levels, raises the question: What is an appropriate funding level? The evidence suggests that CSF funding remains significant and meaningful for C-E Sections in Posts located in relatively high priority markets (i.e., 2003-2004 CCIL top 23 markets). However, proactive and meaningful IBD programming requires substantially more funds than what small C-E Sections in lower priority markets (i.e., 2003-2004 CCIL 24-53 markets) are currently allocated. Again, this raises the following question: If the CSF is part of the 'basic tool box' for TPMs, what are the performance expectations of those who hardly receive anything?, 67270=When asked what effect the reduction in CSF funding has had on the ability of the C-E Section to maintain the quality of services to priority clients, 38% of TPMs responded negative and 19% responded very negative for a total of approximately 57%. Somewhat surprising is that the reduction of CSF funding apparently had no effect on the quality of client services for 40% of the TPMs who responded. An analysis of TPM explanations by geographic region provided considerable insight. The Africa and Middle East and Caribbean and Latin America regions account for more than half of these \"no effect\" responses. Explanations provided by TPMs to the on-line survey and during follow-up interviews cited the already minimal CSF funding received and the negligible effect that the 2004-2005 reductions have had on client services., 81700=TSC/CSF initiatives provide market prospect and face-to-face briefings to both business clients and partners in order to improve their awareness and knowledge of opportunities for trade, investment and S&T in the foreign business environment. The performance indicators for measuring achievement of this second short-term outcome focus on the volume and quality of MII acquired, as well as level of confidence to identify and pursue opportunities(4). The 2002 and 2004 Client Surveys collected data with questions relevant to the specific attributes of these indicators. Table 5 presents a comparative analysis of this performance data., 27957=As mentioned above, the 2003-2004 IBD Planning and Reporting Template did require C-E Section staff to identify in the Action Plan departmental key results to which the CSF-funded initiative would be expected to contribute and to which it actually contributed. Based on the fourteen departmental key results, the following were identified the most frequently in the 2003-2004 CSF reports:, 191347=The IBD/CSF Planning and Reporting system has evolved considerably since its launch in April 2002. It has introduced a results-oriented management structure and standardised planning and reporting formats appreciated by Geographic Divisions and C-E Section staff. Initially, the TBX/CSF Unit priority was to strengthen the IBD strategic and operational planning processes which made considerable progress, although earlier availability in the fiscal year of the planning and reporting templates would further enhance their usefulness. Performance tracking and reporting however has not been a priority for a number of reasons previously discussed. Consequently, the current performance reporting system is dependent on only one source of data (i.e., TPMs), and serves primarily as an annual self-assessment tool. It has had limited usefulness as a performance tracking tool for C-E Sections, since the reporting templates are revised and posted only at the end of the third fiscal quarter or thereafter., 132623=While it was not possible to obtain data on the overall percentage of C-E Section staff time spent on CSF initiatives, the 2003-2004 IBD Planning and Reporting system contained data in the reporting templates on the amount of time that IBD staff spend on each CSF initiative. Table 13 presents this data by Regional Bureau., 199371=5 The 2003-2004 % of lapsed funds takes into consideration end-of-year financial adjustments., 172075=An examination of CSF expenditures by priority market and sector are also indicative of policy coherence. The CCIL and TTCS were used as indicative of government policy guidance for the identification of priority markets and sectors, respectively, for IBD programming. While CSF expenditures for FY 2003-2004 generally reflect the rank order of the 53 priority markets, approximately $708,000 (8%) of the funds were nevertheless disbursed in non-CCIL markets. This indicates a significant departure in the CSF allocation from an already long list of \"priority markets\". Also, the correlation between CSF sector coding and the TTCS priority sectors in 14 of the top 25 CCIL markets can be characterised as weak. C-E Sections are selecting sectors based on market conditions rather than priority sectors identified under the TTCS. In both of these cases, Corporate guidance is required on the use of the CCIL and TTCS as policy instruments to bring about stronger alignment between IBD plans, including CSF initiatives, and priority markets and sectors., 110886=The negative consequences of the CSF that were identified by the Geographic Division staff were articulated in terms of both the effects on working relations with C-E Sections and on their respective workload. While some Geographic Divisions provide sectoral expertise and guidance to Posts, they do not feel that they have the human resource capacity to review each Post's IBD Strategic Plan from a holistic perspective as expected by TBX and their C-E Sections. In larger more well-funded Posts, C-E Sections were not provided with more resources to handle the additional planning, administration and accounting responsibilities that have come with the delegated authority over the use of the CSF, resulting in an increased staff workload. On the other hand, the common perception among less-well funded geographic programmes with smaller Posts is that the cost of planning, administration and accounting in terms of C-E Section staff time exceeds the value of the results achieved with the CSF allocation. Many TPMs in small Posts in the Africa and Middle-East, and Caribbean and Latin America regions generally confirmed this observation in their on-line survey responses and during follow-up interviews. While they are appreciative of any amount of funding they receive, the administrative overhead has become burdensome in relation to the CSF allocations received. Due to the 2004-2005 reductions in CSF allocations, some Geographic Divisions are currently contemplating pooled funding mechanisms for their Posts/C-E Sections, or have negotiated additional \"reserve funds\" for in-Canada activities., 32859=The Trade Team Canada Sectors (TTCS) bring government and industry together to coordinate national trade development planning and activities in key industries and markets. The key role of the TTCSs, composed primarily of industry associations and private sector representatives, is to develop sectoral trade development strategies and annual action plans. Instructions to the 2003-2004 IBD Planning and Reporting Template included guidance on accessing and using the TTCSs as a source of information during the IBD strategic planning process when priority sectors were selected. A three step analysis was undertaken to determine if the guidance was effective. First, the top 23 markets on the 2003-2004 CCIL were used in the sample and then cross-referenced with the TTCS priority industries/markets list (Table 1)., 76038=Table 4 presents the types of services delivered to clients by CSF initiatives based on reporting data contained in the 2003-2004 IBD Planning and Reporting system. Percentages are based on the total number of services delivered by CSF initiatives, since any given initiative could provide clients with several types of services. The most common service is to 'identify/expand the network of key qualified contacts', which is similar to the most common product 'list of qualified contacts'. The next three are also clearly focussed on providing clients with MII services on local markets, market opportunities and local companies. A number of other services also figure in this list (e.g., making appointments with local contacts, business travel advice, group briefings and debriefings). It should be noted that there were no significant differences when the data was analysed by Regional Bureau., 17382=CSF funds were to be allocated by the RAC in February/March of each year to global and/or regional business promotion opportunities, as well as to geographic branches and the International Cultural Relations Bureau. In the past, the actual transfer of funds to geographic and functional bureaus was staggered throughout the fiscal year. Effective April 1st, 2002, CSF allocations were to be transferred by TBX directly to missions abroad in a lump sum at the beginning of the fiscal year. In subsequent years, the precise financial allocation formula was to be adjusted annually by the RAC based on mission performance. Allocations to C-E Sections in missions abroad was to be determined by geographic managers at Headquarters based on past performance., 27180=In comparison, the CSF strategic outcome presented above remains quite consistent with this policy orientation, although the CSF strategic outcome statement itself and the accompanying narrative text in other documents (e.g., RMAF, CSF Guidelines) could benefit from further articulation of the role of 'two-way international investment' and 'science and technology linkages' as important areas of IBD programming. Nevertheless, instructions for the Strategy template of the 2004-2005 IBD Planning and Reporting system has already been adjusted by requiring C-E Sections to identify key results and priorities with respect to all three IBD program areas (i.e., trade development, investment and science and technology)., 24069=In 2002-2003, the DFAIT Executive Committee developed a Strategic Planning and Priorities Framework which was to set the direction for the development of 2003-2004 Business Plans. The framework contained five strategic objectives and corresponding key results, as well as twelve Departmental priorities. An overview of this framework was included in the 'Reference' section of the IBD Business Planning and Reporting Templates for FY 2003-2004. Policy guidance was provided to C-E Sections on how to identify strategic objectives and priorities for their business plan in the instructions, stating, \"[T]he objectives and priorities should be guided primarily by the priorities for your geographic area and the departmental key results...\". The departmental key results related to IBD were extracted from the Strategic Planning and Priorities Framework and listed within the body of the instructions. To further strengthen the policy uplink, the Action Plan template also required that specific departmental key results be identified for each CSF and non-CSF initiative., 65728=Assuming the adequate accuracy of the 2004-2005 IBD Planning and Reporting financial data, the above analysis indicates that the 'Total CSF Related Funding' represents 50-57% of all funds available to C-E Sections for all Geographic Bureaus, with the exception of Europe where it represents 71%. This exception can be explained by the relatively lower IBD travel and hospitality budgets. Interestingly, if the comparison were made between just the '2004-2005 CSF Allocation' and only the IBD travel and hospitality budgets, the figures for North America and Europe Bureaus would be 70%, while the other bureaus represent < > 50%. Therefore, Europe and North America Bureaus receive similarly high CSF allocations relative to their IBD travel and hospitality budgets., 155705=Since 2004-2005, the Strategy and Action Plan templates have stabilised, while the Reporting template of the IBD Planning & Reporting system will undergo changes as it has every year depending on feedback from Posts. It was initially designed as a performance self-assessment tool for TPMs and, as such, has inherent limitations in terms of assessing overall programme performance. While data fields on the reporting template have become increasingly more focussed and detailed, the TBX/CSF Unit has had to strike a balance between collecting desirable performance data and the increased administrative burden it places on C-E Sections staff., 55384=Based on the 2004 Client Survey, the majority of the TCS/CSF Canadian business clients are relatively small companies that employ 50 or fewer people (59%) and have annual worldwide revenues of less than $5 million (54%). The mid-size business client employs between 50-500 people (27%) and has world-wide annual revenues between $5-$25 million (28%). The large sized business client employs 500 or more people (14%) and has annual revenues of $25 million or more (18%)., 80144=The 2002 Client Survey served as a useful secondary data source, since it asked Canadian business and partner clients if they were aware that the TCS offered six standardised core services. The following is a summary of the findings:, 19516=The TCS introduced the NA@W six core services in 1999-2000 to Canadian business clients and to non-private sector partner-clients around the world., 74995=Table 3 presents types of products delivered to clients by CSF initiatives based on reporting data contained in the 2003-2004 IBD Planning and Reporting system. Percentages are based on the total number of products generated by all CSF initiatives. The two most common products are a list of qualified contacts and sector market documents, which would include market information products (e.g., briefs, reports, country sector profiles) generally used in a MII approach to trade promotion. The next two most common products are marketing and promotional documents and brochures which are more characteristic of the trade promotion type activity. It should be noted that there were no significant differences when the data was analysed by Regional Bureau., 53000=A closer look at the correlation between priority sectors and the frequency against which CSF initiatives are coded suggest that CSF funds are not concentrated to any great degree on TTCS priority sectors either. For example, the China market is a priority for eight of the TTCS industries, but only three had 9% or more of CSF initiatives allocated to those sectors, while three others had less than 2% of CSF initiatives allocated to them. The Japan, Germany, Australia, Italy and Spain markets have CSF initiatives similarly dispersed across many sectors and with little in the way of concentration in the TTCS industries. In fact, several of the TTCS priority industries (i.e., Electric Power Equipment and Services, Oil & Gas Equipment and Services and Plastics) had no 2003-2004 CSF initiatives programmed in their TTC priority markets. The data suggests that TTCS priority industries/markets are not a determinant factor in IBD/CSF programming., 81232=Based on Client Survey findings, TCS clients have remained appreciative of the services they received. The overall satisfaction rating out of 5 was 4.02 in the 2002 Client Survey, unchanged from the 2000 Client Survey, and was somewhat higher at 4.06 in the 2004 Client Survey when averaging the aggregate ratings for accessibility (4.11), timeliness (4.07) and quality (4.02) of the TCS services., 140624=The 2003 Employee Survey served as a useful source of secondary data. It asked the C-E Section staff at Posts to \"allocate the percentage of time, including overtime, receptions and official function, that you spend in a typical month, supporting the following clients or groups.\" Table 15 presents the data collected on this question., 23551=In its design and planning, the CSF was closely linked to the mandate of DFAIT's IBD Business Line as stated in its 2001-2002 Business Plan. The long term performance expectations of the CSF were to be oriented by its strategic objective, as follows:, 198736=1 Since the first draft of the Final Report dated December 2, 2004 was used, the statistical data is subject to change., 99014=Three main observations can be made about the above data. First, the findings for the 2000 and 2002 Client Surveys were consistent, showing relatively little change. Second, the relative rank order in terms of positive impact has been relatively stable across all three surveys, with only a couple of exceptions. Third, and most importantly, the 2004 Client Survey findings show significant improvements in all business aspects in comparison to the two previous survey findings, with only one exception (i.e., 'financial results over the next 24 months')., 61402=Since the financial data for this analysis was not available from the ITCan Information Management System (IMS), the 2004-2005 IBD Planning and Reporting system was used to extract figures for Table 2. All figures are based on the planned budgets submitted by C-E Sections as part of their IBD Strategic Plan. The only exception is the 'Estimated 2004-2005 Revenue', representing funds leveraged from partners which is based on the previous year's actual revenue recorded in the IMS. It should be noted that, Enhanced Representation Initiative (ERI) funds are only allocated to Posts in the US, 'IBD Travel and Hospitality' funds are reserved for IBD programming and 'IBD Other Funds' include contributions from other government departments, Branding Canada, and others., 116367=The figures presented in Table 10 are based on ITCan's IMS financial data and the ratios calculated allowing for rounding-up. The Africa & Middle East Bureau has consistently generated over the two years $1 of leveraged revenue for every $4 of CSF funding it received. Asia-Pacific and Europe Bureaus have shown the most improvement, while the remaining bureaus have remained consistent in generating $1 of leveraged revenue for every $7 of CSF funding received. Although the data may suggest that less CSF funding generates proportionately more leveraged revenue, it also indicates that quite large amounts of leveraged revenue can be generated when working with a larger CSF allocation. For example, in 2002-2003 the North American Bureau generated as much leveraged revenue as the Africa and Middle East Bureau's CSF expenditures. Some TPMs are confident that the CSF has not yet reached its potential, and still see room for improvement, as reflected in this quote. \"As time goes, we could be surprised by our own ability to leverage CSF funds.\", 86907=TSC/CSF initiatives provide key contact search and local company information to both business clients and partners in order to assist them in expanding their network of qualified local contacts. The performance indicators for measuring achievement of this third short-term outcome focus on the volume of key contacts acquired and confidence in market intelligence on these local companies. The 2002 and 2004 Client Surveys collected data with questions relevant to the specific attributes of these indicators. Table 6 presents a comparative analysis of this performance data., 79322=Based on the 2003-2004 IBD Planning and Reporting system, and keeping in mind that the data for this analysis is based on the opinions and judgement of C-E Section staff, 18% of CSF initiatives were thought to have contributed 'greatly', 40% 'considerably' to the more effective delivery of TCS six core services. It should be noted that these findings correlate very strongly with the effect of the reductions in CSF funding on the quality of services to priority clients (i.e., very negative (19%) and negative (38.1%)) indicating high internal consistency in TPM responses on this issue.}",
    "textBeforeTable": "Top of page When asked if the CSF has contributed to better performance tracking and reporting, TPMs responded probably (43.2%) or definitely (32.4%) yes, however an analysis of the response explanations reveals a significant divergence of opinion with regard to performance reporting versus tracking. While the on-line web-based approach to performance reporting is problematic for some Posts due to narrow communications bandwidth, it is generally appreciated for its structured, standardised and relatively streamlined format. Fixed deadlines for report submission, regular reminders and the use of disincentives have all contributed to more regular and timely performance reporting. The reporting task itself provides COs with an opportunity to reflect on the performance of their CSF initiatives and reinforces the results-based management culture in the C-E Section at Post. Tracking performance has not been a priority for the CSF/TBX Unit, strategic planning was. While the CSF RMAF did foresee the development of on-line reporting templates for Canadian business and partner clients, these were not developed because the CSF Unit did not want to duplicate WinExports database on clients, nor any client tracking that the electronic Client Relations Management (eCRM) was to develop. The reporting template was developed simply to help TPMs document their perception of results achievement. The completion rates of reports by C-E Sections has improved over the two years, and is markedly better than the predecessor programme. The application of performance criteria has helped in terms of ensuring systematic reporting by C-E Sections, but",
    "textAfterTable": "There is also the perception however that the reporting template is very short-term and event driven with a preponderance of questions focussed on collecting data on activities, products and NA@W services provided. It does not adequately capture performance data that is useful to COs to determine if the CSF initiative has been successful, or not, since this requires medium-term follow-up tracking with Canadian business and partner clients. One respondent stated: \"It is difficult to track the success of events other than in terms of 'yes the event was held' and 'this is how many people [companies] participated.' Whether the event ultimately leads to increased sales is difficult if not impossible to track. Simply having the CSF does not really affect how we track and report on events.\" 5.4.4 Delivery of TCS Core Services The data in the IBD Planning and Reporting system has only been used sporadically by Geographic Divisions to enhance coordination of IBD activities, to avoid duplication of effort and optimise collaborative activities in the same sector throughout a region or country. For some, it also serves as a source of information for internal briefings for ministerial missions and senior managers going to the field, as well as for ideas and best practices in IBD programming. When asked if the data captured in the IBD Planning & Reporting system has been used by C-E Section to improve the delivery of Trade Commissioner Services, TPMs responded probably (27.7%) or definitely (35.1%) yes. However, an analysis of the response",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}