{
    "relation": [
        [
            "MA",
            "27",
            "3",
            "10",
            "17",
            "24",
            "31"
        ],
        [
            "TI",
            "28",
            "4",
            "11",
            "18",
            "25",
            "1"
        ],
        [
            "ON",
            "29",
            "5",
            "12",
            "19",
            "26",
            "2"
        ],
        [
            "TO",
            "30",
            "6",
            "13",
            "20",
            "27",
            "3"
        ],
        [
            "FR",
            "31",
            "7",
            "14",
            "21",
            "28",
            "4"
        ],
        [
            "LØ",
            "1",
            "8",
            "15 Dagens program 15. august 12.00 Opening of a new school year followed by review of diplom exhibtion and diploma ceremony in the evening. - BAS",
            "22",
            "29",
            "5"
        ],
        [
            "SØ",
            "2",
            "9",
            "16",
            "23",
            "30",
            "6"
        ]
    ],
    "pageTitle": "Nyheter - Bergen Arkitekthøgskole",
    "title": "",
    "url": "http://www.bergenarkitektskole.no/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987174.71/warc/CC-MAIN-20150728002307-00147-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 326194307,
    "recordOffset": 326173628,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{3552=BAS er stolte av at tidligere student Guðrún Jóna Arinbjarnardóttir er vinner av Norske Arkitektstudenters Stålkonstruksjonspris 2015 med diplomprosjektet Through the Forest of columns. Hun mottar også European Student Awards for Architectural Design. Prispremien er kr 20.000 og en reise til Istanbul for å motta den europeiske prisen i september., 4640=Saturday 15. August will be a great day at BAS. We welcome our new students and we celebrate our newly educated Masters in Architecture. Read more about the program.}",
    "textBeforeTable": "Juli 2013 neste Kalender Diploma 2014: \"SELF CITY NATION\" by Shreya Nagrath: Exploring the mutually reciprocal relationship between a human being and a city Diploma 2014: \"Battle Grounds\" by Robert Moe: Reclaiming a community from a failed attempt at urban renewal Diploma 2014: \"Transformative landscapes\" by Kim Kendel: - an intervention in the historic city centre of BergenThe historic area ‘Vågsbunnen’ in the inner city of Bergen has increasingly gained attention from developers as well as cultural Diploma 2014: \"INVERTED BEAUTY\" by Ann-Sofie Indgul and Aina Telhaug: a hidden diploma Diploma 2014: \"La Wergeland Leve\" by Viktor Svantesson: Let Wergeland live Diploma 2014: \"EX LIBRIS\" by Katrine Wang Høiem: Proposal for a New Public Library in the City Center of Grimstad",
    "textAfterTable": "29 30 31 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 Dagens program 15. august 11.00 Teachers/Student seminar on 1:1. From 1100 hrs. - BAS 16 17 Dagens program 17. august 12.00 The School year starts. Welcome new students, review of diploma exhibtion, meet with your teachers. - In the hall 13.08 Review of the diploma exhibition by two of the assessors - Hall 19.30 Opening of the new library at BAS - Library, ground floor 20.00 Diploma Ceremony 18 Dagens program 18. august 12.00 Public Diploma Exhibition 19 Dagens program 19. august 12.00 Public Diploma Exhibition 20 Dagens program 20. august 12.00 Public Diploma Exhibition 21 Dagens program 21. august 12.00 Public Diploma Exhibition 22 Dagens program 22. august 12.00 Public Diploma Exhibition",
    "hasKeyColumn": true,
    "keyColumnIndex": 5,
    "headerRowIndex": 0
}