{
    "relation": [
        [
            "Button",
            "[ < ]",
            "[ > ]",
            "[ << ]",
            "[ Up ]",
            "[ >> ]",
            "[Top]",
            "[Contents]",
            "[Index]",
            "[ ? ]"
        ],
        [
            "Name",
            "Back",
            "Forward",
            "FastBack",
            "Up",
            "FastForward",
            "Top",
            "Contents",
            "Index",
            "About"
        ],
        [
            "Go to",
            "Previous section in reading order",
            "Next section in reading order",
            "Beginning of this chapter or previous chapter",
            "Up section",
            "Next chapter",
            "Cover (top) of document",
            "Table of contents",
            "Index",
            "About (help)"
        ],
        [
            "From 1.2.3 go to",
            "1.2.2",
            "1.2.4",
            "1",
            "1.2",
            "2",
            "",
            "",
            "",
            ""
        ]
    ],
    "pageTitle": "GNU libunistring: 3. Elementary types <unitypes.h>",
    "title": "",
    "url": "http://www.ibiblio.org/pub/packages/solaris/i86pc/libunistring.0.9.3.i86pc.64bit.Solaris.11.pkg",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987174.71/warc/CC-MAIN-20150728002307-00208-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 507332943,
    "recordOffset": 507154695,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{36236=Version 1.3, 3 November 2008, 77932=No covered work shall be deemed part of an effective technological measure under any applicable law fulfilling obligations under article 11 of the WIPO copyright treaty adopted on 20 December 1996, or similar laws prohibiting or restricting circumvention of such measures., 58095=A patent license is “discriminatory” if it does not include within the scope of its coverage, prohibits the exercise of, or is conditioned on the non-exercise of one or more of the rights that are specifically granted under this License. You may not convey a covered work if you are a party to an arrangement with a third party that is in the business of distributing software, under which you make payment to the third party based on the extent of your activity of conveying the work, and under which the third party grants, to any of the parties who would receive the covered work from you, a discriminatory patent license (a) in connection with copies of the covered work conveyed by you (or copies made from those copies), or (b) primarily for and in connection with specific products or compilations that contain the covered work, unless you entered into that arrangement, or that patent license was granted, prior to 28 March 2007., 12039=An MMC is “eligible for relicensing” if it is licensed under this License, and if all works that were first published under this License somewhere other than this MMC, and subsequently incorporated in whole or in part into the MMC, (1) had no cover texts or invariant sections, and (2) were thus incorporated prior to November 1, 2008., 88909=Version 3, 29 June 2007, 11695=The operator of an MMC Site may republish an MMC contained in the site under CC-BY-SA on the same site at any time before August 1, 2009, provided the MMC is eligible for relicensing., 167332=This document was generated by Bruno Haible on March, 30 2010 using texi2html 1.78a.}",
    "TableContextTimeStampAfterTable": "{621132=May erase the contents of the memory at resultbuf., 578602=Unicode is widely used on the web. Prior to the use of Unicode, web pages were in many different encodings (ISO-8859-1 for English, French, Spanish, ISO-8859-2 for Polish, ISO-8859-7 for Greek, KOI8-R for Russian, GB2312 or BIG5 for Chinese, ISO-2022-JP-2 or EUC-JP or Shift_JIS for Japanese, and many many others). It was next to impossible to create a document that contained Chinese and Polish text in the same document. Due to the many encodings for Japanese, even the processing of pure Japanese text was error prone., 585119=Among the possible locale encodings are UTF-8 and GB18030. Both allow to represent any Unicode character as a sequence of bytes. UTF-8 is used in most of the world, whereas GB18030 is used in the People's Republic of China, because it is backward compatible with the GB2312 encoding that was used in this country earlier., 84946=This document was generated by Bruno Haible on March, 30 2010 using texi2html 1.78a.}",
    "lastModified": "Thu, 08 May 2014 04:07:15 GMT",
    "textBeforeTable": "The buttons in the navigation panels have the following meaning: This document was generated by Bruno Haible on March, 30 2010 using texi2html 1.78a. About This Document [ ? ] [Index] [Contents] [Top] Maintained by: Many creative people. and many others. Olaf Bachmann Karl Berry Written by: Lionel Cons (original author) This document was generated by Bruno Haible on March, 30 2010 using texi2html 1.78a. 070701000164b4000081a4000000000000000000000001536b0093000014c2000001120001001fffffffffffffffff0000003c00000000root/usr/local/share/doc/libunistring/libunistring_abt.html --> ul.toc {list-style: none} span.sansserif {font-family:sans-serif; font-weight:normal;} span.roman {font-family:serif; font-weight:normal;} pre.smalllisp {font-size: smaller} pre.smallformat {font-family: serif; font-size: smaller} pre.smallexample {font-size: smaller} pre.smalldisplay {font-family: serif; font-size: smaller} pre.menu-preformatted {font-family: serif} pre.menu-comment {font-family: serif} pre.format {font-family: serif} pre.display {font-family: serif} a.summary-letter {text-decoration: none} Send bugs and suggestions to [ ? ] [Index] [Contents] [Top]",
    "textAfterTable": "where the Example assumes that the current position is at Subsubsection One-Two-Three of a document of the following structure: 1. Section One 1.1 Subsection One-One ... 1.2 Subsection One-Two 1.2.1 Subsubsection One-Two-One 1.2.2 Subsubsection One-Two-Two 1.2.3 Subsubsection One-Two-Three     <== Current Position 1.2.4 Subsubsection One-Two-Four 1.3 Subsection One-Three ... 1.4 Subsection One-Four [Top] [Contents] [Index] [ ? ] This document was generated by Bruno Haible on March, 30 2010 using texi2html 1.78a. 070701000164b0000081a4000000000000000000000001536b00930000438c000001120001001fffffffffffffffff0000003a00000000root/usr/local/share/doc/libunistring/libunistring_6.html GNU libunistring: 6. Output with Unicode strings <unistdio.h>",
    "hasKeyColumn": true,
    "keyColumnIndex": 1,
    "headerRowIndex": 0
}