{
    "relation": [
        [
            "Location",
            "Pune",
            "Kolkata",
            "Delhi",
            "Chandigarh",
            "Hyderabad"
        ],
        [
            "Date",
            "16 September",
            "20 September",
            "4 October",
            "8 October",
            "11 October"
        ],
        [
            "Venue",
            "Shree Shiv Chhatrapati Sports Complex, Badminton Hall, Balewadi",
            "Rang Manch, Swabhumi, Salt Lake",
            "Delhi International Expocentre, Expo Drive, A-11, Sector-62,N.H.-24, Noida",
            "Indradhanush Auditorium, Sector 5, Panchkula",
            "Sri Sathya Sai Nigamgamam Trust No 8-3-987/2, Srinagar Colony"
        ]
    ],
    "pageTitle": "Winner, Contestants, Participants, Photos, Videos, Eliminations: MTV Roadies 9: Everything or Nothing - Wiki NewForum",
    "title": "",
    "url": "http://www.wikinewforum.com/showthread.php?t=140933",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988840.31/warc/CC-MAIN-20150728002308-00086-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 843875511,
    "recordOffset": 843792030,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Winner Vikas: We are very happy to see Vikas as the winner of MTV Roadies Season 9 winner. Roadies 9 grand finale was very tough. Becoming winner of Roadies 9 on MTV India gives an amazing feeling to be proud. Winner of MTV Roadies 9 is awarded by Hero Honda Karizma ZMR, Lenevo laptop and winning amount. Journey to become Hero Honda Roadies 9 winner on MTV has been much exciting and amazing. Finally, MTV Roadies 9 winner is announced. So, the question – who is the winner of MTV Roadies Season 9 – is now clear. We have the name of MTV Roadies Season 9 winner. Roadies 9 Winner: The task is completed by Vikas very successfully. However, Himani had also done a great job to perform the task in the grand finale of MTV Roadies 9. Now, there was another task for Vikas and Himani. They had to come out from a cage. They had to take the key of the cage from an ice cube. Finally, the task is won by Vikas and Himani. They are considered as the top 2 finalists of MTV Roadies 9 grand finale. Now, they had to compete with",
    "textAfterTable": "Taranjeet Kaur Hyderabad, Andhra Pradesh 5th Voted out Eliminated in final episode 7 Arsh Sharif Hyderabad, Andhra Pradesh 1st Voted out 12th Voted out 14 Manali Banerjee Kolkata, West Bengal 11th Voted out 9 Pratima Dagar Delhi, Haryana 10th Voted out 9 Diyali Chauhan Delhi, Uttar Pradesh 9th Voted out 8 Abhishek Shetty Pune, Maharashtra 7th Voted out 16 Khushbu Patel Hyderabad, Andhra Pradesh 6th Voted out 5 Dimpy Yadav Chandigarh, Punjab 4th Voted out 8 Anirudh Sharma Hyderabad, Andhra Pradesh 3rd Voted out 1",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}