{
    "relation": [
        [
            "(Raw)",
            "",
            "White Rice lasts for",
            "Oxygen Free White Rice* lasts",
            "Brown Rice lasts for",
            "Wild Rice lasts for",
            "Minute Rice lasts for",
            "(Cooked)",
            "White Rice lasts for",
            "Brown Rice lasts for",
            "Wild Rice lasts for"
        ],
        [
            "Pantry",
            "Past Printed Date",
            "4-5 Years",
            "25-30 Years",
            "6-8 Months",
            "6-8 Months",
            "4-5 Years",
            "Pantry",
            "–",
            "–",
            "–"
        ],
        [
            "Refrigerator",
            "Past Printed Date",
            "–",
            "–",
            "8-12 Months",
            "–",
            "–",
            "Refrigerator",
            "5-7 Days",
            "4-5 Days",
            "5-7 Days"
        ],
        [
            "Freezer",
            "Past Printed Date",
            "–",
            "30* Years",
            "–",
            "–",
            "–",
            "Freezer",
            "6-8 Months",
            "6-8 Months",
            "6-8 Months"
        ]
    ],
    "pageTitle": "Shelf Life Food & Eat by Date......a must read! - Flavor Infusion",
    "title": "",
    "url": "http://flavorinfusion.org/shelf-life-food-eat-by-date-a-must-read/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988840.31/warc/CC-MAIN-20150728002308-00077-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 93862511,
    "recordOffset": 93788555,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{4748=Posted by Jerry Jaquess on Jul 17, 2013 in Blog | 0 comments}",
    "TableContextTimeStampAfterTable": "{85921=Ocean Spray cranberry products are a popular choice in the U.S. for cranberries. The best by date on a dried cranberry package is on the back of the package near the bottom and reads like this: 13MAY12 where the 13=the 13th Day and the 12=the Year 2012. So, the best by date on Ocean Spray cranberries is DDMONTHYY., 264045=History of Sushi – Before we get to the question of how long does Sushi last, it has a rich history worth exploring.  Sushi, a favorite Japanese cuisine, has become extremely popular in the U.S. in recent years and consists of raw fish and cooked vinegared rice. The origin of sushi began in Southeast Asia, but todays version was created by Hanaya Yohei (1799-1858) as a form of fast food to be eaten soon after purchase with ones hands.  The first appearance of Sushi in America was in 1953, served at the Japanese Embassy in Washington. Sashimi, a Japanese delicacy, is fresh fish served sliced very thin without the vinegar rice that defines sushi. So now you know the history, How long does Sushi Last? Sushi, as it is prepared with fresh fish, is intended to be eaten within 24 hours of preparation., 393340=ALL CONTENTS ©2013 FLAVOR INFUSION LLC, ALL RIGHTS RESERVED.      }",
    "textBeforeTable": "How Long Does Butter Last? Shelf Life of Butter How long does butter last? The shelf life of butter depends on a variety of factors, such as the production method, its Best By Date and how it is stored. Butter is a dairy product made by churning fresh cream or milk until it reaches a solid form. It is most frequently made with cows milk but can also be manufactured from sheep, goats, buffalo and yaks. Butter comes in numerous types such cultured, uncultured, salted, preserved and whipped butter. In addition to its use as a cooking tool and being used as a tasty compliment to items such as bread orpotatoes, butter does have some nutritional benefits which include a high dose of vitamin A. So,how long does butter last? When properly stored at or below 40° F, the shelf life of butterbeyond it’s best before date is approximately…     Milk, cheese, and yogurt are nutrient-rich foods abundant in calcium, potassium, vitamins, and protein essential for human growth and development. They also happen to be extremely versatile, forming the basis for many a sauce, spread, cream, dessert, dip, and so much more. It doesn’t hurt that the majority of dairy foods also taste great just as they are. ………….How long do dairy products last?…………                          ",
    "textAfterTable": "How Long Does Hard Cheese Last? Shelf Life of Cheese How long do hard and semi-hard cheeses last? Cheese consists of the proteins and fat frommilk and is produced throughout the world in hundreds of flavors, textures, and forms. Some common hard cheeses include Parmesan, Romano, Asiago, Buffalo and Pecorino cheese. These cheeses have been cooked, pressed and aged making them good for grating. Some common semi-hard cheeses include Cheddar, Swiss, Gouda, and Provolone cheese. These cheeses have been cooked and pressed, but have not been aged so they contain more moisture.  All cheeses are valued for their high content of fat, protein, calcium, and phosphorus while hard and semi-hard varieties enjoy added value for their compacted flavor and longer shelf life. The shelf life of hard cheese is influenced by a variety of factors, such as the type of cheese, the processing method and packaging date, its exposure to heat, how the cheese is stored and the best by date or sell by date. So how long does cheese last?  When properly stored at or below 40° F, the shelf life of cheese is approximately … (Unopened) Fridge Freezer Past Printed Date Past Printed Date Hard Cheese (Parmesan, Asiago, Romano) lasts for 2-4 Months 6-8 Months Shredded Hard Cheese lasts for 1-2 Month 6-8 Months Semi-Hard Cheese Chunk (Cheddar, Swiss) lasts for 1-2 Months 6-8 Months Sliced Semi-Hard Cheese lasts for 1 Month 6-8 Months (Opened) Refrigerator Freezer",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}