{
    "relation": [
        [
            "Categories",
            "Great for these types of students",
            "Tips for prospective students",
            "Bang for the buck",
            "Am enjoying being here",
            "Am learning a lot"
        ],
        [
            "Comments",
            "great for laid back students and those who are serious about their future.",
            "You will easily make plenty of friends in the resident halls your first year. Remember to take your education seriously, there is no one up there to babysit you so if you do not pass classes than you end up paying for school just to fail, its not smart. remember to be safe and have fun, college is a great experience.",
            "The only problem are the furlough days which all CSU schools are unfortunately currently dealing with as well as raised prices. but there are scholarships and loans available for those who seek them.",
            "There are activities on campus as well as some off. The community is nice and there are buses and other free means of transportation available for csumb students. The only down side is that in order to go do things you have to drive a bit because nothing is really walking distance from the campus.",
            "The classes are a good size. Professors here are willing to help and work with students who are struggling. There are also free tutoring programs that are extremely helpful."
        ]
    ],
    "pageTitle": "California State University-Monterey Bay (CSUMB) Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/California-State-University-Monterey-Bay/reviews?_escaped_fragment_=/show/27203",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988840.31/warc/CC-MAIN-20150728002308-00114-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 904405627,
    "recordOffset": 904328506,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{54046=Do well in high school, but don’t kill yourself over it. Ask people who’ve been there and done that about hard questions you have about life. Your mind is capable of more than you know. Shoot for a school that’s in your price range, but don’t be afraid to be in debt, in 2010 students that graduated a four year university who took out loans owed on average $25,250 (New York Times, College Graduates’ Debt Burden Grew, Yet Again, in 2010) just know it’s going to carry into your life after college. Try and learn something from your G.E.’s even if they seem boring or unrelated to anything you will be doing in the future. One more thing. Be nice to everybody! You never know who you’re friends will be once you get there. Be willing to go hang with different types of people until you find that right ‘fit’ of people you really enjoy spending time with., 143940=California State University, Monterey Bay was built on the Fort Ord Army Base, which closed in 1994. Beautiful abandoned buildings surround the campus, and several of the buildings previously utilized in the Fort Ord Army Base have been refurbished into the campus as we know it today., 27414=Stay on top of your school work, because it takes a lot of self motivation to stay on track when those around you aren't. This is a great place to strive to be at the top of your class. If you got above 1800 on the SAT, that is a definite possibility if you are willing to work just a little bit harder than the other students. Also, respond to professors emails, and go to their office hours. These things will set you apart. Also, bring a car. The campus is set away from everything, which makes public transportation a hassle., 393892=© 2015, Cappex.com, LLC}",
    "textBeforeTable": "01/17/2010 Reviewer is A current student here. 26 out of 27 people found this review useful. 1 of 87 Pauline from Whittier, CA Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for",
    "textAfterTable": "Login to rate or flag the reviews Brittany from Long Beach, CA 01/07/2010 Reviewer is A current student here. 11 out of 12 people found this review useful. 2 of 87 Categories Comments Tips for prospective students Attend if you love the out doors and are not into going to a schoolstuck in the middle of a busy city Bang for the buck As with most of the colleges, we are suffering with furloughs and the rise in tuition and less class time just dont make sense Am enjoying being here I Am having a great time adjusting to being awa from home. The dorms are great and so is the capus as a whole Am learning a lot My major has already got me doing hands on activities. I am not always sitting in a classroom.",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}