{
    "relation": [
        [
            "Election Date",
            "Nov. 6, 2012",
            "Nov. 5, 2013"
        ],
        [
            "State",
            "Colorado",
            "Colorado"
        ],
        [
            "Title",
            "Amendment 64: Use and Regulation of Marijuana",
            "Proposition AA: Colorado Marijuana Excise Tax and Sales Tax"
        ],
        [
            "Outcome",
            "Passed",
            "Passed"
        ]
    ],
    "pageTitle": "2015 Colorado Ballot Measures - The Voter's Self Defense System - Vote Smart",
    "title": "",
    "url": "http://votesmart.org/elections/ballot-measures/CO",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988840.31/warc/CC-MAIN-20150728002308-00314-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 260143727,
    "recordOffset": 260124973,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{92311=All content © 1992 - 2015 Project Vote Smart unless otherwise attributed - Privacy Policy -}",
    "lastModified": "Sat, 01 Aug 2015 16:52:30 GMT",
    "textBeforeTable": "Abortion     Women Veterans Unemployed and Low-Income Transportation Trade Technology and Communication Taxes Stem Cell Research Sexual Orientation and Gender Identity Senior Citizens Science Religion Oil and Gas Natural Resources and Energy National Security Monetary Policy Minors and Children Military Personnel Marriage, Family, and Children Marriage Marijuana Legalization Legislative Branch Legal Labor Unions K-12 Education Judicial Branch Infrastructure Indigenous Peoples Immigration Housing and Property Higher Education Health Insurance Health and Health Care Guns Government Operations Government Budget and Spending Gambling and Gaming Foreign Aid Foreign Affairs Food Processing and Sales Finance and Banking Federal, State and Local Relations Executive Branch Environment Entitlements and the Safety Net Energy Employment and Affirmative Action Education Economy and Fiscal Drugs Defense Death Penalty Crime Constitution Civil Liberties and Civil Rights Campaign Finance and Elections Business and Consumers Arts, Entertainment, and History Animals and Wildlife Agriculture and Food Abortion and Reproductive Abortion All Issues Select a Category down Issue Category 2007",
    "textAfterTable": "    Abortion and Reproductive Election Date State Title Outcome Nov. 4, 2008 Colorado Amendment 48: An amendment to the Colorado constitution defining the term \"person\" to include any human being from the moment of fertilization as \"person\" is used in those provisions of the Colorado constitution relating to inalienable rights, equality of justice, and due process of law. Failed Nov. 2, 2010 Colorado Amendment 62: Application of the Term Person Failed Nov. 4, 2014 Colorado Amendment 67: An Amendment to the Colorado Constitution Protecting Pregnant Women and Unborn Children by Defining \"Person\" and \"Child\" in the Colorado Criminal Code and the Colorado Wrongful Death Act to Include Unborn Human Beings Failed     Animals and Wildlife Election Date State",
    "hasKeyColumn": true,
    "keyColumnIndex": 1,
    "headerRowIndex": 0
}