{
    "relation": [
        [
            "Name",
            "Attribute Name field",
            "Operator drop-down list",
            "Attribute Value field"
        ],
        [
            "Description",
            "The name of the attribute.",
            "The list of selectable operators.",
            "The value of the attribute."
        ]
    ],
    "pageTitle": "Cisco Virtual Network Management Center GUI Configuration Guide, Release 1.3 - Configuring Security Policies [Cisco Virtual Network Management Center] - Cisco",
    "title": "",
    "url": "http://www.cisco.com/c/en/us/td/docs/unified_computing/vnmc/sw/1-3/VNMC_GUI_Configuration/b_VNMC_GUI_Configuration_Guide_1_3/b_VNMC_GUI_Configuration_Guide_1_3_chapter_01001.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988840.31/warc/CC-MAIN-20150728002308-00231-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 367849283,
    "recordOffset": 367822627,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "In the Add Security Profile dialog box, General tab area, complete the following fields: Step 5   You can add the component at any organizational level. Note    In the Work pane, click the Add Security Profile link.In the Navigation pane, expand root > Security Profiles In the Navigation pane, click the Security Policies subtab.In the Navigation pane, click the Policy Management tab. Step 4   Step 3   Step 2   Step 1   Procedure Adding a Security Profile Configuring Security Profiles Security policies are created and then pushed to the Cisco VSG. Security Profile Dictionary—A Cisco VNMC security profile dictionary is a logical collection of security attributes. You define dictionary attributes for use in a security profile. A Zone—A zone defines a set of virtual machines based on conditions. The zone name is used in the authoring rules.",
    "textAfterTable": "Add Policy Set link A link to add a policy set. Resolved Policy Set field A link to edit the resolved policy set. Table 1 Resolved Policies Area Name Description (Un)assign Policy link The link to unassign a policy. Name column The name of the rule. Source Condition column Contains the source condition specified. Destination Condition column Contains the destination condition specified. Protocol column Contains the protocol specified. Ethertype column Contains the Ethertype specified. Action column Contains the",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}