{
    "relation": [
        [
            "Categories",
            "Great for these types of students",
            "Bang for the buck",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "Students who are looking to attend an online university.",
            "Great teacher are available who want to help you succeed. Counselor are there for your assistance to enroll in classes, setup payment plans, and develop a degree plan. Also resources such as an online library, career center, and writing center are available to help you as well.",
            "I am enrolled online.",
            "Has accelerate degree programs so you can get your degree completed faster than a normal degree program,",
            "Live, love, and learn.",
            "Bellevue has cheap tuition. Bellevue is accredited. Bellevue has great staff and resources available for students."
        ]
    ],
    "pageTitle": "Bellevue University Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Bellevue-University/reviews?_escaped_fragment_=/show/79417",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988840.31/warc/CC-MAIN-20150728002308-00047-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 897472859,
    "recordOffset": 897439095,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{128593=© 2015, Cappex.com, LLC, 120394=Everyone is very friendly. Professors respond to student emails very qurickly, which is nice when you are over 1000 miles away., 741=Bellevue University has an A+ rating with the BBB. It has been a member since 2003. The staff is very helpful and friendly.}",
    "textBeforeTable": "10/25/2009 Reviewer is Accepted here and planning to attend soon. Reviewer has not been to campus. 7 out of 7 people found this review useful. 1 of 35 Ethel from Houston, TX Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp",
    "textAfterTable": "Janice from Council Bluffs, IA 07/23/2012 Reviewer is A current student here. 3 out of 3 people found this review useful. 2 of 35 Categories Comments Campus Safety The parking is close to classrooms and well lit at night. Play it safe though and always walk out with a buddy after dark. Great for these types of students Bellevue is great for non-traditional students like me; 49 years old, 5 children, changing careers! What to do for fun No matter what your age, if you are a student at Bellevue, you can join any of the sports! There are always special events going on and others students to chat with. Food and Dining The cafeteria is conveniently located and has pretty good food. The atmosphere is nice with a beautiful fountain and is also a good place to hang out between classes. Dorm Life I live",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}