{
    "relation": [
        [
            "1.",
            "2.",
            "3.",
            "4.",
            "5.",
            "6.",
            "7.",
            "8.",
            "9.",
            "10.",
            "11.",
            "12."
        ],
        [
            "(a)",
            "(a)",
            "(a)",
            "(a)",
            "(a)",
            "(a)",
            "(a)",
            "(a)",
            "(a)",
            "(a)",
            "(a)",
            "(a)"
        ],
        [
            "on",
            "encased",
            "greets",
            "up",
            "interns",
            "vibration",
            "fired",
            "chewing",
            "showing",
            "suffice",
            "strain",
            "lowlight"
        ],
        [
            "(b)",
            "(b)",
            "(b)",
            "(b)",
            "(b)",
            "(b)",
            "(b)",
            "(b)",
            "(b)",
            "(b)",
            "(b)",
            "(b)"
        ],
        [
            "at",
            "in case",
            "sees",
            "via",
            "travails",
            "vibe",
            "founded",
            "chews",
            "shows",
            "sufficient",
            "pain",
            "highlight"
        ],
        [
            "(c)",
            "(c)",
            "(c)",
            "(c)",
            "(c)",
            "(c)",
            "(c)",
            "(c)",
            "(c)",
            "(c)",
            "(c)",
            "(c)"
        ],
        [
            "on",
            "showcased",
            "meets",
            "to",
            "traverses",
            "vibrate",
            "floundered",
            "chew",
            "showed",
            "insufficient",
            "main",
            "light up"
        ],
        [
            "(d)",
            "(d)",
            "(d)",
            "(d)",
            "(d)",
            "(d)",
            "(d)",
            "(d)",
            "(d)",
            "(d)",
            "(d)",
            "(d)"
        ],
        [
            "of",
            "cased up",
            "keeps",
            "in",
            "intervals",
            "vibrant",
            "frowned",
            "chewed",
            "shown",
            "efficiency",
            "gain",
            "enlighten"
        ]
    ],
    "pageTitle": "Breaking News English ESL Lesson Plan on HAPIfork",
    "title": "",
    "url": "http://www.breakingnewsenglish.com/1301/130110-hapifork.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988840.31/warc/CC-MAIN-20150728002308-00247-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 338454127,
    "recordOffset": 338431765,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{74857=HAPILABS was founded / floundered by former French pole vaulter Fabrice Boutain. He explained the benefits / beneficial of his new product, saying: \"What is important is you take enough time to chew the food well.\" He added: \"By chewed / chewing well, you will help the digestion / digestive. There was a study in the United States in 2006 showed / showing that people eating more slowly will eat 11 per cent fewer / smaller calories. So this is how we can help us lost / lose weight.\" HAPILABS spokesman Andrew Carton said: \"Eating too fast, and insufficient / suffice mastication has been tied to all sorts of problems, including…weight regain / gain.\" The company's website says there are many scientific studies that highlight the negative effects relation / related to eating meals too quickly., 34204=HAPILABS (7) _____________________ French pole vaulter Fabrice Boutain. He explained the benefits of his new product, saying: \"What is important is you (8) _____________________ the food well.\" He added: \"By chewing well, you (9) _____________________. There was a study in the United States in 2006 showing that people eating more slowly will eat 11 per cent fewer calories. So this is how we (10) _____________________.\" HAPILABS spokesman Andrew Carton said: \"(11) _____________________ mastication has been tied to all sorts of problems, including…weight gain.\" The company's website says there are many scientific studies that highlight the (12) _____________________ eating meals too quickly., 76710=H_P_L_BS w_s f__nd_d by f_rm_r Fr_nch p_l_ v__lt_r F_br_c_ B__t__n. H_ _xpl__n_d th_ b_n_f_ts _f h_s n_w pr_d_ct, s_y_ng: \"Wh_t _s _mp_rt_nt _s y__ t_k_ _n__gh t_m_ t_ ch_w th_ f__d w_ll.\" H_ _dd_d: \"By ch_w_ng w_ll, y__ w_ll h_lp th_ d_g_st__n. Th_r_ w_s _ st_dy _n th_ _n_t_d St_t_s _n 2006 sh_w_ng th_t p__pl_ __t_ng m_r_ sl_wly w_ll __t 11 p_r c_nt f_w_r c_l_r__s. S_ th_s _s h_w w_ c_n h_lp _s l_s_ w__ght.\" H_P_L_BS sp_k_sm_n _ndr_w C_rt_n s__d: \"__t_ng t__ f_st, _nd _ns_ff_c__nt m_st_c_t__n h_s b__n t__d t_ _ll s_rts _f pr_bl_ms, _ncl_d_ng…w__ght g__n.\" Th_ c_mp_ny's w_bs_t_ s_ys th_r_ _r_ m_ny sc__nt_f_c st_d__s th_t h_ghl_ght th_ n_g_t_v_ _ff_cts r_l_t_d t_ __t_ng m__ls t__ q__ckly., 78224=Hapilabs was founded by former french pole vaulter fabrice boutain He explained the benefits of his new product saying \"what is important is you take enough time to chew the food well\" He added \"by chewing well you will help the digestion There was a study in the united states in 2006 showing that people eating more slowly will eat 11 per cent fewer calories So this is how we can help us lose weight\" Hapilabs spokesman andrew carton said \"eating too fast and insufficient mastication has been tied to all sorts of problems including…weight gain\" the company's website says there are many scientific studies that highlight the negative effects related to eating meals too quickly, 56233=HAPILABS was (7) ____ by former French pole vaulter Fabrice Boutain. He explained the benefits of his new product, saying: \"What is important is you take enough time to chew the food well.\" He added: \"By (8) ____ well, you will help the digestion. There was a study in the United States in 2006 (9) ____ that people eating more slowly will eat 11 per cent fewer calories. So this is how we can help us lose weight.\" HAPILABS spokesman Andrew Carton said: \"Eating too fast, and (10) ____ mastication has been tied to all sorts of problems, including…weight (11) ____.\" The company's website says there are many scientific studies that (12) ____ the negative effects related to eating meals too quickly., 66365=well, you will help the digestion. There was a study in the United States in 2006 showing that people, 26484=HAPILABS was (9) ____________ by former French pole vaulter Fabrice Boutain. He explained the (10) ____________ of his new product, saying: \"What is important is you take enough time to chew the food well.\" He added: \"By (11) ____________ well, you will help the (12) ____________. There was a study in the United States in 2006 showing that people eating more slowly will eat 11 per cent (13) ____________ calories. So this is how we can help us lose weight.\" HAPILABS spokesman Andrew Carton said: \"Eating too fast, and (14) ____________ mastication has been tied to all sorts of problems, including…weight (15) ____________.\" The company's website says there are many scientific studies that highlight the negative effects (16) ____________ to eating meals too quickly., 8761=HAPILABS was founded by former French pole vaulter Fabrice Boutain. He explained the benefits of his new product, saying: \"What is important is you take enough time to chew the food well.\" He added: \"By chewing well, you will help the digestion. There was a study in the United States in 2006 showing that people eating more slowly will eat 11 per cent fewer calories. So this is how we can help us lose weight.\" HAPILABS spokesman Andrew Carton said: \"Eating too fast, and insufficient mastication has been tied to all sorts of problems, including…weight gain.\" The company's website says there are many scientific studies that highlight the negative effects related to eating meals too quickly., 93884=Copyright © 2004-2013 by Sean Banville | Links | About | Privacy Policy, 9525=Sources: http://blog.sfgate.com/techchron/2013/01/08/bluetooth-fork-toothbrush-debut-at-ces/ http://www.pcmag.com/article2/0,2817,2413988,00.asp http://www.hapilabs.com/}",
    "lastModified": "Sat, 01 Nov 2014 04:01:16 GMT",
    "textBeforeTable": "  GAP FILL google_ad_region = \"bot\" google_ad_height = 280; google_ad_width = 336; google_ad_slot = \"8994902274\"; google_ad_client = \"ca-pub-7356791340648458\";",
    "textAfterTable": "4. What intervals does the fork measure? 5. When will the fork vibrate? 6. What was the inventor's sport? 7. What does chewing well help? 8. How many fewer calories could people eat if they chew more slowly? 9. What are one of the problems of insufficient mastication? 10. What kind of studies does the company website mention? MULTIPLE CHOICE - QUIZ 1. What kind of solution is the new product? 6. What sport did the HAPIfork inventor used to do?   a) a binary one b) a digital one c) an electric one d) a heavy one   a) the pole vault b) speed hotdog eating c) marathons d) sumo 2. Where was the HAPIfork showcased? 7. What did the inventor say chewing helps?   a) at the Consumption Electronics Show b) at the Consumer Electrical Show c) at the Consumer Electricity Show d) at the Consumer Electronics Show  ",
    "hasKeyColumn": true,
    "keyColumnIndex": 2,
    "headerRowIndex": 0
}