{
    "relation": [
        [
            "First Name",
            "Frederick",
            "Janice",
            "Lisa"
        ],
        [
            "Last Name",
            "McLuckie",
            "Oliver",
            "Kinard"
        ],
        [
            "Suffix",
            "Mr.",
            "Ms.",
            "Ms."
        ],
        [
            "Covered Official Position (if applicable)",
            "",
            "",
            ""
        ],
        [
            "New",
            "",
            "",
            ""
        ]
    ],
    "pageTitle": "LD-2 Disclosure Form",
    "title": "",
    "url": "http://soprweb.senate.gov/index.cfm?event=getFilingDetails&filingID=97B00AEC-E7FF-4A91-B839-8C0C606AB430&filingTypeID=69",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988840.31/warc/CC-MAIN-20150728002308-00305-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 220135922,
    "recordOffset": 220127720,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{29147=H.R. 3200, America's Affordable Health Choices Act; S 1679, The Affordable Health Choices Act; American Healthy Future Act; taxation of employer provided health care benefits; \"insurer excise tax\"; employer mandate, \"play or pay\" proposals, public option issue; small business exemptions; multi-employer plan ERISA issues., 1019=Lobbying Disclosure Act of 1995 (Section 5) - All Filers Are Required to Complete This Page, 18931=H.R. 2454 American Clean Energy and Security Act (renewables; nuclear; David-Bacon prevailing wage coverage, targeted community hiring), 35410=H.R. 413, S. 1611; Public Safety Employer-Employee Cooperation Act of 2009, 15636=H.R. 3326, FY 2010 Department of Defense Appropriations; funding for veterans training; Helmet to Hard Hats programs; FY 2010 Appropriations for Department of Labor, Health and Human Services, Education and related agencies; funding for Department of Labor (job training and dislocated workers programs); OSHA, wage and hour; OFCCP, enforcement programs (wage and hour, workplace safety, OFCCP employee benefits) EBSA, PBWA, PBGC, National Labor Relations Board, National Mediation Board, H.R. 3288, Transportation, Housing and Urban Developmentent, and Related Agencies Appropriations Act of 2010 (cross-border trucking provisions, Maine pilot program on truck weight), 37494=Wage& Hour Enforcement; Worker misclassification & independent contractors; H.R. 1409/S. 560, Employee Free Choice Act; H.R. 921, Family Medical Leave eligibility for rail workers. Under-reporting of workplace injuries, multi-site employees; organizing rights of workers at FedEx; worker misclassification at FedEx; Anti-trust issues with solid waste industry mergers; U.S. Food Service labor practices; Nomination of Patricia Smith as DOL Solicitor;Nomination of Lorelie Boylan for DOL Wage&Hour Administrator H.R. 3408, Taxpayer Responsibility, Accountability and Consistency Act; H.R. 847/S. 1334, James Zadroga 9/11 Health & Compensation of 2009; H.R. 2067/S.1580, Protecting America's Workers Act; H.R. 2113, to require corporate wide reporting/workplace injuries and illnesses. OSHA Enhanced Enforcement Program; OSHA-enforcement and penaltly issues; family and victim rights., 45943=Hours of Service; Motor Carrier Safety issues; NAFTA Cross Border trucking, truck size and weight; H.R. 1618/S. 779, Safe Highways and Infrastructure Preservation Act; H.R. 1799, Safe and Efficient Transportation Act of 2009}",
    "textBeforeTable": "",
    "textAfterTable": "State DC Zip Code 20001 Country USA 3. Principal place of business (if different than line 2) City   State   Zip Code   Country   4a. Contact Name b. Telephone Number c. E-mail  Mr.  FREDERICK P. MCLUCKIE  2026248741  fmcluckie@teamster.org 5. Senate ID#  19855-12 7. Client Name Self Check if client is a state or local government or",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}