{
    "relation": [
        [
            "Categories",
            "Campus Safety",
            "Clubs and Activities",
            "Great for these types of students",
            "Share any unusual traditions or locations on campus",
            "Bang for the buck",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "Security is around on a 24 hour basis, and dorms are in the process of becoming key card only opening.",
            "The music program here is the highlight of the school. Over 75 percent of the student population is in the music programs.",
            "Outgoing, goal-oriented, and studious students fit well here.",
            "There are tunnels underneath the campus that connect all the buildings.",
            "You get what you pay for, it's a private college. Not only that, but if you are in a lower pay class, the school and government will pay for most of your tuition.",
            "Activities are student led so join whatever group fits you the most!",
            "Amazing food! Lots of places to eat, like Marty's Cyber Cafe and Oneota.",
            "Awesome dorms, great activities.",
            "Classes are relatively challenging and encourage you to think about what the message of the lessons are. Classes are small and well rounded and teachers are attentive and clear.",
            "Make sure you make the most of the awards given to you. Spend a lot of time in the library. Have fun!",
            "In three sentences"
        ]
    ],
    "pageTitle": "Luther College Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Luther-College/reviews",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438043062635.98/warc/CC-MAIN-20150728002422-00306-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 894895667,
    "recordOffset": 894843691,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{118546=Every September the students gather at a location determined each day and rock out to the song September by Earth, Wind, and Fire. This tradition is called Septembertime, and culminates up to the 21st night of September, when the song is played multiple times with the largest number of students possible crammed into the Choir Room., 186548=We have September Time Where we dance for a whole month, every night to September by Earth Wind and Fire. We dance like children(energetic and shamelessly.) It's great., 218577=© 2015, Cappex.com, LLC, 141011=During the month of September Luther has Septembertime. This is an event in which every night in the month of September, at a different location around campus and play the song Do you remember? Christmas on campus is also a hugely popular time., 89452=The music program is phenomenal. Roughly 1000 out of the 2500 student body participate in either band, choir, or orchestra. There are activities for every kind of person; a ballroom/swing club, Performing Arts Committee, Student Senate, Debate, diversity center, and so many more that I can't name them all., 135428=Christmas at Luther is a choir program put on in late November/early December. It's always worth it, whether you're in the choir or just watching. There are also plenty of parks and wildlife centers all throughout Decorah, and the whole town has a strong Norwegian heritage that shines through., 174783=One of my favorite traditions on campus is SeptemberTime. Every night in the month of September, we will all gather at a different location on campus and dance to the song September by Earth, Wind, and Fire. Also, there is this cute little ice cream shack in town (within walking distance from campus) called the Whippy Dip. It is definitely a campus favorite.}",
    "textBeforeTable": "08/16/2009 Reviewer is A current student here. 8 out of 8 people found this review useful. 1 of 46 matt from Rochester, MN Check out reviews left by other students or leave your own review. You could win a free scholarship. Luther College Reviews Luther College › Iowa › By State › Colleges › } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.create', -->",
    "textAfterTable": "Login to rate or flag the reviews Nathan from Decorah, IA 01/16/2010 Reviewer is A current student here. 4 out of 4 people found this review useful. 3 of 46 Categories Comments Tips for prospective students 1) Get to know your professors. Go in during their office hours and just chat with them. They will be more than willing to talk to you, and try to make life here easier. 2) Get to know your RA's (Resident Assistants). They are upperclassmen who have been through what you going through. They remember how difficult it was during their first year, and they will be able to help you get through it. 3) Get to know the people down in the Student Academic Support Center(SASC) and Student Support Services(SSS). They are located on the ground floor of the library. They will help you with whatever you need. They will help with academic help, and provide you with tutors. They can give advice for financial support and they are great people to talk to when you are having problems and you have no idea who to turn to.",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}