{
    "relation": [
        [
            "Command",
            "show trunk group",
            "trunk group"
        ],
        [
            "Description",
            "Displays the configuration of one or more trunk groups.",
            "Initiates a trunk group definition."
        ]
    ],
    "pageTitle": "Cisco IOS Voice Command Reference - K through R - map q850-cause through mgcp package-capability [Support] - Cisco",
    "title": "",
    "url": "http://www.cisco.com/c/en/us/td/docs/ios-xml/ios/voice/vcr3/vcr3-cr-book/vcr-m1.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438043062635.98/warc/CC-MAIN-20150728002422-00164-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 381808239,
    "recordOffset": 381701707,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{52076=mgcp modem passthrough { voip | voaal2 } codec { g711alaw | g711ulaw }, 12745=3 --Special-information tone (a three-tone sequence at 950, 1400, and 1800 MHz) (not supported on IP phones), 27265=mgcp codec gsmamr-nb, 27144=mgcp codec ilbc, 27376=mgcp codec, 25239=mgcp modem passthrough codec}",
    "TableContextTimeStampAfterTable": "{525655=Maximum fax transmission speed of 2400 bits per second (bps)., 529918=The values for this command apply only to the fax transmission speed and do not affect the quality of the fax itself. The higher transmission speed values (14,400 bps) provide a faster transmission speed but use a significantly large portion of the available bandwidth. A lower transmission speed value (2400 bps, for example) provides a slower transmission speed but uses a smaller portion of the available bandwidth., 505592=This command was integrated into Cisco IOS Release 12.2(2)XN and implemented on the following platforms: Cisco 2600 series, Cisco 3600 series, and Cisco Voice Gateway 200 (Cisco VG200)., 635368=When the gateway detects a modem/fax tone, it switches the codec to G.711 to allow the analog data to pass through., 405454=Call-agent UDP port: 2727 for MGCP 1.0, NCS 1.0, and TGCP 1.0 Call-agent UDP port: 2427 for MGCP 0.1 and SGCP Call-agent UDP port: 2427 for Cisco CallManager Service type and version: mgcp 0.1 Service type for Cisco CallManager: mgcp, 444037=The following example shows how to set the MGCP codec to ilbc and set the parameters:, 646863=Command: enabled Compress: both Dictionary: 1024 String length: 32, 638262=When the cisco keyword is activated and the gateway detects a modem/fax tone, the gateway switches the codec to G.711 then sends the analog data to a remote gateway. The remote gateway also switches the codec on its side of the call to G.711 to allow the analog data to pass through., 539950=This feature was implemented on the Cisco 1700 series and Cisco 2800 series., 635730=When the gateway detects a modem/fax tone, it alerts the call agent to switch the codec to G.711 to allow the analog data to pass through., 375204=mgcp codec, 71152=This command was implemented on the Cisco 1750., 409047=This command was implemented to provide enhanced MGCP voice gateway interoperability on Cisco CallManager Version 3.1 for the following platforms: Cisco 2600 series, Cisco 3600 series, and Cisco VG200., 418697=To select the codec type and its optional packetization period value, use the mgcp codec command in global configuration mode. To set the codec to its default value of G711 u-law, use the no form of this command., 422284=G711 u -law codec, 169176=This command was implemented on the Cisco 1750 access router., 638620=When the cakeyword is activated and the gateway detects a modem/fax tone, the gateway alerts the call agent to switch the codec to G.711 to allow the analog data to pass through. The call agent must send an MDCX signal to the G.711 codec for successful data pass-through., 527432=Highest possible transmission speed allowed by the voice codec. This is the default., 671928=The following example enables MGCP modem relay and specifies the following: NSE mode for upspeeding, G.711 mu-law codec, packet redundancy, and gateway-controlled for modem traffic during modem pass-through:, 525523=2400, 648253=This command was introduced on the following platforms: Cisco 2600 series, Cisco 3620, Cisco 3640, Cisco 3660, Cisco 7200 series, and Cisco AS5300., 603701=G.711 u-law codec for changing speeds during modem and fax switchover., 420958=(Optional) Packetization period. This value is useful when the preferred compression algorithm and packetization period parameter is not provided by the media gateway controller. The range depends on the type of codec selected:, 425453=The following example specifies the codec type:, 438121=To specify the internet Low Bandwidth Codec (iLBC) for an MGCP dial peer, use the mgcp codec ilbccommand in dial peer voice configuration mode. To disable the iLBC, use the no form of this command., 554935=This command was implemented on the Cisco 1751 and Cisco 1760., 506025=This command was integrated into Cisco IOS Release 12.2(11)T and Cisco CallManager Version 2.0. This command was implemented on the following platforms: Cisco AS5300, Cisco AS5400, Cisco AS5850, and Cisco IAD2420., 650189=The following example enables in-band negotiation of compression parameters on the VoIP gateway, with compression in both directions, dictionary size of 1024, and string length of 32 for the compression algorithm:, 655748=Estimated one-way delay across the IP network, in milliseconds. Range is from 100 to 1000. Default is 200., 600897=To select the codec that enables the gateway to send and receive modem and fax data in VoIP and VoATM adaptation layer 2 (VoAAL2) configurations, use the mgcp modem passthrough codeccommand in global configuration mode. To disable support for modem and fax data, use the no form of this command., 664314=(Optional) Specifies a codec to use for upspeeding:, 501081=Specifies that RTP digit events are encoded using the named telephony event (NTE) format specified in RFC 2833, Section 3.0, and are transmitted in the same RTP stream as nondigit voice samples. The payload type is negotiated by the gateways before use. The configured value for payload type is presented as the preferred choice at the beginning of the negotiation., 163257=codec (dspfarm-profile), 253295=Dial peer tag to be matched on the forked leg. The range is from 1 to 1073741823., 298631=This command was implemented on the following platforms: Cisco 3660, Cisco uBR924, and Cisco 2600 series., 527859=MGCP fax rate is set to the highest possible transmission speed allowed by the voice codec (mgcp fax rate voice)., 435652=Use the mgcp codec gsmamr-nb command to configure the GSMAMR-NB codec and its parameters on the Cisco AS5350XM and Cisco AS5400XM platforms., 728338=When the lcs-package keyword is used on the Cisco Integrated Access Device (IAD), the named telephony events (NTEs) associated with the line control signaling (LCS) package are enabled automatically. NTEs are used by a media gateway to transport telephony tones and trunk events across a packet network. See RFC 2833., 99485=This command was introduced on the following platforms: Cisco 2600 series, Cisco 3600 series, and Cisco AS5300., 530912=When the MGCP fax rate is set to the highest possible transmission speed allowed by the voice codec (mgcp fax rate voice), all MGCP endpoints limit T.38 fax calls to this speed. For example, if the voice codec is G.711, fax transmission may occur up to 14,400 bps because 14,400 bps is less than the 64-kbps voice rate. If the voice codec is G.729 (8 kbps), the fax transmission speed is limited to the nearest fax rate of 7200 bps., 427507=To specify the Global System for Mobile Adaptive Multi-Rate Narrow Band (GSMAMR-NB) codec for an MGCP dial peer, use the mgcp codec gsmamr-nbcommand in dial peer voice configuration mode. To disable the GSMAMR-NB codec, use the no form of this command., 317974=Forces the gateway not to change the codec payload type when it is dynamically changed in the incoming Session Description Protocol (SDP)., 497517=Specifies the MGCP DTMF relay codec configuration., 603377=G.711 a-law codec for changing speeds during modem and fax switchover., 620004=mgcp modem passthrough codec, 59958=Range is from 0 to 1000., 375391=Selects the default codec type and its optional packetization period value., 508430=The following example shows how to configure a low-bit-rate codec using VoIP in NSE mode:, 632278=Selects the codec for modem and fax transmissions., 581894=This command was implemented on the following platforms: Cisco 2600 series, Cisco 3660, and Cisco uBR924., 509167=The following example shows how to set the DTMF relay codec and mode to gateway:, 497384=codec, 669679=The mgcp modem relay voip mode nse command is not supported on the TI C2510 digital signal processor (DSP), formerly known as the TI C5510 DSP; only the TI C549 DSP supports negotiation of NSE parameters. If Cisco CallManager is used as the call agent, the mgcp modem relay voip mode nse command is not supported., 670369=Redundancy causes the gateway to generate duplicate (redundant) data packets for fax/modem pass-through calls as per RFC 2198. For these calls to be more reliable, redundant packets transmission is needed to make up for excessive loss of packets in VoIP networks. Even if one of the gateways is configured with redundancy, calls go through. Gateways can handle asymmetric (one-way) redundancy., 385767=This command was introduced for MGCP on the Cisco 2400 series, Cisco 2600 series, Cisco 3600 series, Cisco 3700 series, Cisco AS5300, Cisco AS5350, Cisco AS5400, Cisco AS5850, Cisco IAD2421, Cisco MC3810, and Cisco VG200., 404044=This configuration value is used to allow the router to tailor the MGCP application behavior to be compatible based on the RFC2705 or RFC3435 definitions., 506487=This command was integrated into Cisco IOS Release 12.2(15)T and implemented on the Cisco 1751 and Cisco 1760., 134798=The maximum number of participants allowed for hardware conferencing is dependent on the codec used in the DSP farm profile. Use the codec command in DSP farm profile configuration mode to specify the codecs supported by the DSP farm profile. Use the show dspfarm profilecommand to display the DSP farm profile., 604115=The g711 u-law codec for both VOIP and VOAAL2, 136895=codec (DSP Farm profile), 71443=This command was implemented on the following platforms: Cisco 1751, Cisco 2600 series, Cisco 3600 series, Cisco 3725, and Cisco 3745., 420428=Type of codec supported. Valid codecs include the following: G711alaw, G711ulaw, G723ar53, G723ar63, G723r53, G723r63, G729ar8, G729br8, and G729r8., 553630=This command was integrated into Cisco IOS Release 12.2(8)T and implemented on the following platforms: Cisco 2600 series, Cisco 3600 series, and Cisco 7200 series. Support for the Cisco AS5300, Cisco AS5350, Cisco AS5400, and Cisco AS5850 is not included in this release., 408291=New service types (ncs and tgcp) and appropriate versions were added. Version 1.0 was added for the mgcp service type. This command was implemented on Cisco 2600 series and Cisco 3600 series routers., 508689=The following example shows how to configurev a codec for VoAAL2:, 679741=(Optional) Specifies the repeat interval, in milliseconds, for initial audio SSEs used for resetting the SSE protocol state machine (clearing the call) following error recovery. Range is 500 - 3000 ms. Default is 1000 ms., 425640=The following example sets the codec type and packetization period:, 718320=This command was implemented on the following platforms: Cisco uBR924, Cisco 2600 series, and Cisco 3660. The line-package, rtp-package, and script-package keywords were added and a distinction was made between residential and trunking gateways., 81906=This command was introduced on the following platforms: Cisco 2600 series, Cisco 3600 series, and Cisco AS5300., 515175=When this command is configured, it offsets all endpoint names on the gateway. For example, an endpoint with a port number of aaln/0 is offset to aaln/1, and a DS0 group number of 0/0:0 is offset to 0/0:1., 499804=Specifies that named signaling event (NSE) RTP digit events are encoded using the format specified in RFC 2833, Section 3.0, and are transmitted in the same RTP stream as nondigit voice samples, using the payload type that is configured using the mgcp tse payload command., 393627=This command was implemented on the following platforms: Cisco 2600 series, Cisco 3660, and Cisco uBR924., 616895=Upspeed is the method used to change the codec type and speed dynamically to meet network conditions., 337427=The following example shows how to force the gateway not to change the codec payload type when it is dynamically changed in the incoming SDP for all MGCP versions:, 400017=(Optional) User Datagram Protocol (UDP) port over which the gateway sends messages to the call agent. Range is from 1025 to 65535., 531845=If the fax rate transmission speed is set higher than the codec rate in the same dial peer, the data sent over the network for fax transmission will be greater than the bandwidth reserved for Resource Reservation Protocol (RSVP). The mgcp fax rate command sets a maximum fax rate for T.30 negotiation (DIS/DCS). Fax machines can negotiate a lower rate, but not a higher rate., 432314=(Optional) The eight speech-encoding modes (bit rates between 4.75 and 12.2 kbps) available in the GSMAMR-NB codec., 296533=(Optional) User Datagram Protocol (UDP) port for the MGCP gateway. Range is from 1025 to 65535. The default is UDP port 2427., 666002=Modem relay in NSE mode is disabled. All modem calls go through as pass-through calls, which are less reliable and use more bandwidth than modem relay calls, provided that pass-through is enabled. The G.711 mu-law codec is used for upspeeding. Redundancy is disabled and no duplicate data packets are sent while the gateway is in modem/fax pass-through mode., 297001=UDP port 2427, 606925=Use this command for fax pass-through because the answer tone can come from either modem or fax transmissions. Selecting a codec dynamically changes the codec type and speed to meet network conditions., 188304=To enable the media command on a Cisco 2900 or Cisco 3900 series Unified Border Element voice gateway, you must first enter the mode border-element command. This enables the media forking and media monitoring commands. Do not configure the mode border-element command on the Cisco 2800 or Cisco 3800 series platform., 526709=12000, 409497=This command was integrated into Cisco IOS Release 12.2(11)T and Cisco CallManager Version 3.2 and implemented on the Cisco IAD2420 series and Cisco AS5850., 630153=Upspeed is the method used to dynamically change the codec type and speed to meet network conditions., 318122=By default, or when no form of this command is issued, MGCP dynamically changes the payload, if the incoming SDP has a different codec., 644916=(Optional) V.42bis parameter that specifies characteristics of the compression algorithm. Range is from 512 to 2048. Default is 1024., 436132=The following example shows how to set the codec to gsmamr-nb and set the parameters:, 620259=Selects the codec to use for modem and fax transmissions on the gateway.}",
    "textBeforeTable": "Syntax Description tone-id tone { local | remote | all } release-source code-id q850-cause map no tone-id tone { local | remote | all } release-source code-id q850-cause map To play a customized tone to PSTN callers if a call disconnects with a specific Q.850 call-disconnect cause code and release source, use the map q850-cause command in voice-service configuration mode. To disable the code-to-tone mapping, use the no form of this command. map q850-cause mgcp package-capability mgcp modem relay voip sprt v14 mgcp modem relay voip sprt retries mgcp modem relay voip mode sse mgcp modem relay voip mode mgcp modem relay voip latency mgcp modem relay voip gateway-xid mgcp modem passthru mgcp modem passthrough voip redundancy mgcp modem passthrough mode mgcp modem passthrough codec mgcp max-waiting-delay mgcp lawful-intercept mgcp ip-tos mgcp ip qos dscp mgcp fax t38 mgcp fax-relay mgcp fax rate mgcp explicit hookstate mgcp endpoint offset mgcp",
    "textAfterTable": "tone tone-id Tone to play for this cause code. Choices are the following: 1 --Busy tone 2 --Congestion tone 3 --Special-information tone (a three-tone sequence at 950, 1400, and 1800 MHz) (not supported on IP phones) Command Default No mapping occurs. Command Modes Voice-service Command History Release Modification 12.4(9)T This command was introduced. Usage Guidelines Use this command to cause a particular tone to play when a call disconnects for a particular reason. The tone plays to callers only if the call-disconnect and wait-to-release timers are set to values greater than 0 by entering the timeouts call-disconnect and timeouts wait-release commands.",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}