{
    "relation": [
        [
            "type",
            "FR Doc.",
            "RIN",
            "Docket No."
        ],
        [
            "regulations.gov",
            "2014-19348",
            "0694-AG11",
            "140221165-4621-02"
        ]
    ],
    "pageTitle": "15 CFR Part 740 - LICENSE EXCEPTIONS | US Law | LII / Legal Information Institute",
    "title": "",
    "url": "https://www.law.cornell.edu/cfr/text/15/part-740",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988840.31/warc/CC-MAIN-20150728002308-00221-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 918106063,
    "recordOffset": 918065456,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{206883=§ 1702 - Presidential authorities, 37504=This rule amends the Export Administration Regulations to create License Exception Support for the Cuban People (SCP) to authorize the export and reexport of certain items to Cuba that are intended to improve the living conditions of the Cuban people; support independent economic activity and strengthen civil society in Cuba; and improve the free flow of information to, from, and among the Cuban people. It also amends existing License Exception Consumer Communications Devices (CCD) by eliminating the donation requirement, thereby authorizing sales of certain communications items to eligible end users in Cuba. Additionally, it amends License Exception Gift Parcels and Humanitarian Donations (GFT) to authorize exports of multiple gift parcels in a single shipment. Lastly, this rule establishes a general policy of approval for exports and reexports to Cuba of items for the environmental protection of U.S. and international air quality, and waters, and coastlines. These actions are among those announced by the President on December 17, 2014, aimed at supporting the ability of the Cuban people to gain greater control over their own lives and determine their country's future., 132889=This final rule implements changes that were proposed on November 29, 2012 in a proposed rule entitled Revisions to the Export Administration Regulations (EAR) To Make the Commerce Control List (CCL) Clearer. The changes in the November 29 proposed rule were informed by public comments received in response to an advance notice of proposed rulemaking entitled Commerce Control List: Revising Descriptions of Items and Foreign Availability published as part of the President's Export Control Reform (ECR) Initiative on December 9, 2010. This final rule implements changes that can be made to the CCL without requiring changes to multilateral export control regime guidelines or lists. This final rule also makes conforming changes and minor clarifications as a result of the publication of two final rules implementing the Export Control Reform Initiative: the April 16, 2013 final rule entitled Revisions to the Export Administration Regulations: Initial Implementation of Export Control Reform; and the July 8, 2013 final rule entitled Revisions to the Export Administration Regulations: Military Vehicles; Vessels of War; Submersible Vessels, Oceanographic Equipment; Related Items; and Auxiliary and Miscellaneous Items that the President Determines No Longer Warrant Control under the United States Munitions List. Lastly, this final rule is making revisions to the EAR as a result of public comments received in response to the November 29 proposed rule and to a notice of inquiry (NOI) entitled Request for Public Comments on Shipping Tolerances for Export Licenses Issued by the Bureau of Industry and Security (BIS), that BIS published on July 5, 2012., 154594=The Bureau of Industry and Security (BIS) maintains, as part of its Export Administration Regulations (EAR), the Commerce Control List (CCL), which identifies certain of the items subject to Department of Commerce jurisdiction. This final rule revises the CCL to implement changes made to the Wassenaar Arrangement's List of Dual-Use Goods and Technologies (Wassenaar List) maintained and agreed to by governments participating in the Wassenaar Arrangement on Export Controls for Conventional Arms and Dual-Use Goods and Technologies (Wassenaar Arrangement, or WA) at the December 2012 WA Plenary Meeting (the Plenary). The Wassenaar Arrangement advocates implementation of effective export controls on strategic items with the objective of improving regional and international security and stability. This rule harmonizes the CCL with the changes made to the WA List at the Plenary by revising ECCNs controlled for national security reasons in each category of the CCL, except category 8, as well as amending the General Software Note, WA reporting requirements, and definitions section in the EAR. BIS is adding unilateral controls to the CCL for specific software and technology for aviation control systems, which the WA agreements removed from the WA List, i.e., EAR national security controls., 112153=The Bureau of Industry and Security (BIS) is correcting a final rule that appeared in the Federal Register of July 8, 2013 (78 FR 40892) (here and after referred to as the July 8 rule), which becomes effective on January 6, 2014. The July 8 rule adds to the Export Administration Regulations (EAR) controls on military vehicles and related items; vessels of war and related items; submersible vessels, oceanographic equipment and related items; and auxiliary and miscellaneous items that the President has determined no longer warrant control on the United States Munitions List (USML). The July 8 rule also adds to the EAR controls on items within the scope of the Munitions List (WAML) of the Wassenaar Arrangement on Export Controls for Conventional Arms and Dual-Use Goods and Technologies (Wassenaar Arrangement) that are not specifically identified on the USML or the Commerce Control List (CCL) but that were subject to USML jurisdiction. Finally, the July 8 rule moves certain items that were already subject to the EAR to the new Export Control Classification Numbers (ECCNs) created by this rule. The July 8 rule was published in conjunction with the publication of a Department of State, Directorate of Defense Trade Controls rule revising USML Categories VII, VI, XX, and XIII to control those articles the President has determined warrant control in those Categories of the USML. Both rules are part of the President's Export Control Reform Initiative. The revisions in the July 8 final rule are also part of Commerce's retrospective regulatory review plan under Executive Order (EO) 13563. The Department of State is also correcting today its final rule that appeared in the Federal Register of July 8, 2013 (78 FR 40922)., 207073=§ 1704 - Authority to issue regulations, 9363=The Bureau of Industry and Security (BIS) issues this final rule to amend the Export Administration Regulations (EAR) to facilitate Internet-based communications with persons in the Crimea region of Ukraine. This final rule allows exports or reexports without a license to the Crimea region of Ukraine of software that is necessary to enable the exchange of personal communications over the Internet, provided that such software is designated EAR99, or is classified as mass market software under Export Control Classification Number (ECCN) 5D992.c of the EAR, and provided further that such software is widely available to the public at no cost to the user. This final rule is being published simultaneously with the Department of the Treasury's Office of Foreign Assets Control (OFAC) issuance of General License No. 9, which authorizes the export or reexport from the United States or by U.S. persons to the Crimea region of Ukraine of certain services and software incident to the exchange of personal communications over the Internet. This action is consistent with the U.S. Government's policy to promote personal communications between the people in Crimea and the outside world. Lastly, this final rule makes clarifications to the EAR with respect to the addition of the Crimea region of Ukraine provisions in a final rule published on January, 29, 2015, to the EAR. These clarifications are in response to requests that BIS received for guidance on applying these provisions., 101462=The Bureau of Industry and Security (BIS) publishes this final rule to amend the Export Administration Regulations (EAR) to implement the understandings reached at the June 2013 plenary meeting of the Australia Group (AG) and the December 2012 AG intersessional decisions. Specifically, this rule amends the Commerce Control List (CCL) entry in the EAR that controls equipment capable of handling biological materials to reflect the 2013 AG Plenary understanding that clarifies controls on fermenters, and certain components thereof, in the AG “Control List of Dual-Use Biological Equipment and Related Technology and Software.” This rule also amends the CCL entry that controls certain animal pathogens to reflect a recommendation made at the 2013 AG Plenary meeting, which was later adopted pursuant to the AG silent approval procedure, to revise the AG “List of Animal Pathogens for Export Control” to clarify the controls on the Lyssavirus genus. In addition, this rule amends the EAR to reflect the addition of Mexico as a participating country in the AG following the 2013 AG Plenary meeting. The recommendations agreed to through the silent approval procedure included changes to the controls on Clostridium perfringens in the AG “List of Biological Agents for Export Control” and changes to the description of “genetic elements,” which are included in three of the AG common control lists. This rule also amends the CCL entry that controls chemical manufacturing facilities and equipment to reflect the AG intersessional decision to clarify the controls that apply to certain agitators for use in reaction vessels or reactors described in the CCL entry and to impellers, blades or shafts designed for such agitators. This rule also adds a License Exception STA paragraph to the CCL entry that controls human and zoonotic pathogens and toxins to clarify the scope of eligible items. Finally, this rule amends the EAR to reflect the addition of Somalia and Syria as States Parties to the Chemical Weapons Convention (CWC)., 207343=§ 1707 - Multinational economic embargoes against governments in armed conflict with the United States, 166267=As part of the Export Control Reform (ECR) Initiative, the Bureau of Industry and Security (BIS), and the Directorate of Defense Trade Controls (DDTC), Department of State, have published multiple proposed amendments to the Export Administration Regulations (EAR) and the International Traffic in Arms Regulations (ITAR), respectively, to strengthen national security by fundamentally reforming the export control system. This final rule implements the initial ECR changes by adding a structure and related provisions to control munitions items that the President has determined no longer warrant export control on the U.S. Munitions List (USML) on the Commerce Control List (CCL), specifically aircraft, gas turbine engines, and related items. This rule is being published in conjunction with a Department of State rule that revises the USML so that upon the effective date of both rules, the USML and CCL and corresponding regulatory structures will be complementary. The revisions in this final rule are also part of Commerce's retrospective regulatory review plan under EO 13563, which Commerce completed in August 2011., 144126=The Bureau of Industry and Security (BIS) is amending the Export Administration Regulations (EAR) to reflect changes to the Missile Technology Control Regime (MTCR) Annex that were agreed to by MTCR member countries at the October 2012 Plenary in Berlin, Germany, and at the MTCR Reinforced Point of Contact (RPOC) meeting in Paris, France, in December 2011. This final rule revises six Export Control Classification Numbers (ECCNs) (1C011, 1C111, 1C116, 9A101, 9B105 and 9E101) and one defined term (the definition of “payload”) to implement the changes that were agreed to at the meetings. This final rule also revises ECCNs 7E004 and 9D004 to better align the Commerce Control List (CCL) with the MTCR Annex and past MTCR agreements., 83954=The Bureau of Industry and Security (BIS) maintains, as part of its Export Administration Regulations (EAR), the Commerce Control List (CCL), which identifies certain of the items subject to Department of Commerce jurisdiction. This final rule revises the CCL to implement changes made to the Wassenaar Arrangement's List of Dual-Use Goods and Technologies (Wassenaar List) maintained and agreed to by governments participating in the Wassenaar Arrangement on Export Controls for Conventional Arms and Dual-Use Goods and Technologies (Wassenaar Arrangement, or WA) at the December 2013 WA Plenary Meeting (the Plenary). The Wassenaar Arrangement advocates implementation of effective export controls on strategic items with the objective of improving regional and international security and stability. This rule harmonizes the CCL with the changes made to the WA List at the Plenary by revising Export Control Classification Numbers (ECCNs) controlled for national security reasons in each category of the CCL, as well as amending the General Technology Note, WA reporting requirements, and definitions section in the EAR. However, BIS intends to publish a separate rule in September setting forth changes to the CCL resulting from the WA agreements for cybersecurity. These changes agreed to at the Plenary include raising the Adjusted Peak Performance (APP) for digital computers in ECCN 4A003. The President's report for High Performance Computers was sent to Congress on July 1, 2014 to set forth the new APP in accordance with the National Defense Authorization Act (NDAA) for FY1998. This rule also makes corresponding revisions to the de minimis rule, and post shipment verification reporting requirements in the Export Administration Regulations. This rule also extends the controls on specified fly-by-wire source code software and technology until June 20, 2015, as BIS continues to negotiate for multilateral controls for this software and technology. This rule also revises the license requirements for Mexico on the Commerce Country Chart, because of its recent membership in multiple multilateral export control regimes. In addition, this rule makes changes to the EAR resulting from previous rules issued as part of BIS's export control reform initiative and makes minor editorial corrections to the CCL., 52511=This final rule makes clarifications and corrections to an interim final rule that was published on May 13, 2014. The May 13 rule added controls to the Export Administration Regulations (EAR) for spacecraft and related items that the President has determined no longer warrant control under United States Munitions List (USML) Category XV—spacecraft and related items. New Export Control Classification Numbers (ECCNs) 9A515, 9B515, 9D515, and 9E515 created by the May 13 rule and existing ECCNs on the Commerce Control List (CCL) will control such items. The May 13 rule also revised various sections of the EAR to provide the proper level of control for the new ECCNs. The vast majority of the changes included in the May 13 rule have been implemented as published in the interim final rule, so those change are not republished in this final rule. A full description of those changes can be found in the Background section and the regulatory text of the May 13 rule. The changes included in this final rule are limited to corrections and clarifications to what was included in the interim final rule. These corrections and clarifications were also informed by comments received in response to the May 13 rule that included a request for comments., 184210=The Bureau of Industry and Security (BIS) maintains, as part of its Export Administration Regulations (EAR), the Commerce Control List (CCL), which identifies items subject to Department of Commerce export controls. This final rule revises the CCL to implement changes made to the Wassenaar Arrangement's List of Dual-Use Goods and Technologies (Wassenaar List) maintained and agreed to by governments participating in the Wassenaar Arrangement on Export Controls for Conventional Arms and Dual-Use Goods and Technologies (Wassenaar Arrangement, or WA) at the December 2011 WA Plenary Meeting (the Plenary). The Wassenaar Arrangement advocates implementation of effective export controls on strategic items with the objective of improving regional and international security and stability. To harmonize the CCL with the changes made to the Wassenaar List at the Plenary, this rule amends entries on the CCL that are controlled for national security reasons in Categories 1, 2, 3, 4, 5 Parts I & II, 6, 7, 8, and 9; revises reporting requirements; and adds, removes, and amends definitions in the EAR. This rule raises the Adjusted Peak Performance (APP) parameter for high performance computers. President Obama sent the report required to make this change to Congress on March 16, 2012. This rule also raises the APP eligibility level for deemed exports of computers in License Exception APP. This final rule also revises the CCL and definitions of terms used in the EAR to implement changes to the WA list that pertain to low light level (LLL) items that were agreed upon by the WA in December 2007 through 2011 at the Wassenaar Arrangement Plenary Meetings. Additionally, this rule adds Mexico as the 41st Participating State in the list of WA members in the EAR., 14927=The Bureau of Industry and Security (BIS) maintains, as part of its Export Administration Regulations (EAR), the Commerce Control List (CCL), which identifies certain of the items subject to Department of Commerce jurisdiction. This final rule revises the CCL to implement changes made to the Wassenaar Arrangement's List of Dual-Use Goods and Technologies (Wassenaar List) maintained and agreed to by governments participating in the Wassenaar Arrangement on Export Controls for Conventional Arms and Dual-Use Goods and Technologies (Wassenaar Arrangement, or WA) at the December 2014 WA Plenary Meeting (the Plenary). The twentieth Plenary meeting of the Wassenaar Arrangement was held in Vienna on 2 to 3 December 2014. The Wassenaar Arrangement advocates implementation of effective export controls on strategic items with the objective of improving regional and international security and stability. Wassenaar Participating States agreed to new export controls in a number of areas, including spacecraft equipment (Category 9) and technology for fly-by-wire/flight-by-light systems (Category 7), while texts for the control of machine tools (Category 2) and optical equipment for military utility and fiber laser components (Category 6) were substantially revised. In addition, significant reviews of several categories resulted in the deletion of obsolete controls relating to vessels (Category 8) and in refined controls on Unmanned Aerial Vehicles—UAVs (Category 9), specifically taking note of the substantial progress of technology in that area. Wassenaar Participating States modified controls in a number of other areas, such as equipment for production of electronic devices (Category 3), certain telecommunications equipment where encryption and other “information security” functionality is limited to operations, administration, or maintenance (OAM) tasks (Category 5P2), and general purpose computers or servers where standard “information security” functionality is provided by embedded mass market microprocessors (CPUs) or operating systems (also Category 5P2). This rule amends the CCL by implementing the changes agreed to by the WA at the Plenary by revising 42 Export Control Classification Numbers (ECCNs), adding one ECCN and removing one ECCN, as well as amending the General Technology Note, WA reporting requirements, adding seven (7) definitions and revising six (6) definitions in the EAR. This rule also revises 3 ECCNs to add License Exception CIV eligibility for Anisotropic plasma dry etching equipment and related software and technology for the development and production of this equipment, as a result of BIS' foreign availability assessment. Country Group A column 1, the Coordinating Committee (CoCom) member countries, is replaced with the successor national security export regime the Wassenaar Arrangement Participating States. In addition, the second national security column and the second regional stability column of the Commerce Country Chart are amended to harmonize with each other, as well as make changes based on the risk of diversion to unauthorized end user, end uses or destinations., 3079=The Bureau of Industry and Security (BIS) publishes this final rule to amend the Export Administration Regulations (EAR) to implement the recommendations presented at the November 2013 Australia Group (AG) intersessional implementation meeting and later adopted pursuant to the AG silent approval procedure. Specifically, this rule amends the Commerce Control List (CCL) entry in the EAR that controls certain human and zoonotic pathogens and toxins, and removes the CCL entry that controls certain animal pathogens to reflect the merger of two AG common control lists based on recommendations presented at the AG intersessional implementation meeting. As a result of these recommendations, the AG “List of Animal Pathogens for Export Control” was merged with the AG “List of Biological Agents for Export Control,” creating a single AG common control list for these items ( i.e., the AG “List of Human and Animal Pathogens and Toxins for Export Control”). The scope of the controls on these human and animal pathogens and toxins was not affected by the merger of the two lists into a single AG common control list. This rule also makes conforming amendments to other provisions in the EAR to reflect these changes. In addition, this rule amends the CCL entry that controls chemical manufacturing facilities and equipment to reflect changes to the AG “Control List of Dual-Use Chemical Manufacturing Facilities and Equipment and Related Technology and Software,” based on the November 2013 AG intersessional recommendation to revise controls on certain valves, casings (valve bodies) designed for such valves, and preformed casing liners designed for such valves. This rule also amends this CCL entry to add a Technical Note clarifying how the terms “multi-seal” and “seal-less” are used with respect to the controls on pumps. In a change unrelated to any revisions to the AG common control lists or guidelines, this rule also amends this CCL entry to authorize the use of License Exception LVS for specified shipments. This rule does not contain changes based on the understandings reached at the June 2014 AG Plenary meeting, because no amendments to the EAR were required as a result of these understandings., 72780=The Bureau of Industry and Security (BIS) is publishing this final rule to amend the Export Administration Regulations (EAR) to implement the understandings reached at the 2005 Nuclear Suppliers Group (NSG) Plenary meeting held in Oslo, Norway; the 2012 NSG Plenary meeting held in Seattle, Washington; and the 2013 NSG Plenary meeting held in Prague, Czech Republic. This rule also implements a decision adopted under the NSG intersessional silent approval procedures in December 2009. Accordingly, this rule amends certain entries in Category 1 (“Special Materials and Related Equipment”), Category 2 (“Materials Processing”), Category 3 (“Electronics”), and Category 6 (“Sensors and Lasers”) of the Commerce Control List (CCL) to reflect changes in the Annex to the NSG “Guidelines for the Transfer of Nuclear-Related Dual-Use Equipment, Materials, Software and Related Technology” (the NSG Annex) based on the understandings reached at the 2005, 2012, and 2013 NSG Plenary meetings and the aforementioned 2009 NSG intersessional decision. Consistent with the 2005 NSG understandings, this rule also amends the export licensing policies in the EAR that apply to items that require a license for nuclear nonproliferation (NP) reasons, or as a result of certain nuclear end-users or end-uses, by adding an additional factor that must be considered by BIS when it reviews license applications involving such items, end-users, and/or end-uses. The 2012 and 2013 NSG Plenary understandings are a continuation of the fundamental review of the NSG control lists that was launched at the 2010 NSG Plenary meeting in Christchurch, New Zealand. Finally, this rule amends the EAR to reflect the status of Croatia, Estonia, Iceland, Lithuania, Malta, Mexico, and Serbia as participating countries in the NSG, first, by adding these countries to the list of participating countries in the definition of “Nuclear Suppliers Group” and to Country Group A:4 (Nuclear Suppliers Group countries) and, second, by removing the license requirements for exports and reexports to these countries of certain items controlled for nuclear nonproliferation (NP) reasons., 207867=Notice ... Aug. 8, 2013, 175864=This rule updates the Code of Federal Regulations legal authority citations for the Export Administration Regulations (EAR) to include the citations to the President's Notice of August 15, 2012—Continuation of Emergency Regarding Export Control Regulations and the President's Notice of May 19, 2012—Continuation of the National Emergency With Respect to the Actions of the Government of Syria. It also adds a citation to Executive Order 13338 to the authority citations paragraph of part 746 of the EAR., 203329=§ 2151 note - Congressional findings and declaration of policy, 68097=The Bureau of Industry and Security (BIS) is correcting certain provisions of the Export Administration Regulations that were amended by two final rules appearing in the Federal Register on June 5, 2014 and on May 13, 2014. Both rules amended a number of the same provisions of the Export Administration Regulations, and certain language was either removed or changed inadvertently. This final rule corrects those provisions to accurately reflect the revisions made by both rules., 27456=The Bureau of Industry and Security (BIS) issues this final rule to amend the Export Administration Regulations (EAR) to impose additional sanctions that implement U.S. policy toward Russia. Specifically, in this rule BIS amends the EAR by imposing a license requirement for the export and reexport to the Crimea region of Ukraine, and the transfer within the Crimea region of Ukraine, of all items subject to the EAR, other than food and medicine designated as EAR99. The rule establishes a presumption of denial for all such exports or reexports to the Crimea region of Ukraine and transfers within the Crimea region of Ukraine, except with respect to items authorized under the Department of the Treasury's Office of Foreign Assets Control (OFAC) General License No. 4, which BIS will review on a case-by-case basis. This action is consistent with the goals and objectives of Executive Order 13685 of December 19, 2014., 58050=The Bureau of Industry and Security (BIS) published a final rule in the Federal Register on Thursday, August 7, 2014 (79 FR 46316), that amended the Export Administration Regulations (EAR) to implement the understandings reached at the 2005, 2012, and 2013 Nuclear Suppliers Group (NSG) Plenary meetings. That final rule also amended the EAR to implement a decision adopted under the NSG intersessional silent approval procedures, in December 2009, and to reflect the status of Croatia, Estonia, Iceland, Lithuania, Malta, Mexico, and Serbia as participating countries in the NSG. In that final rule, the amendatory instruction for the EAR supplement that lists “Country Groups” contained an error with respect to Mexico. In addition, the amendments to Export Control Classification Number (ECCN) 6A203 in theAugust 7, 2014, final rule inadvertently omitted the controls that apply to certain radiation-hardened TV cameras and lenses therefor. This document amends the EAR to correct these errors. Finally, the contact information in the preamble of the August 7, 2014, NSG Plenary rule contained an incorrect telephone number and the saving clause in the preamble omitted specific instructions concerning certain items newly controlled under ECCN 3A225. This document amends the preamble of the August 7, 2014, NSG Plenary rule to correct these errors., 32499=In this rule, the Bureau of Industry and Security (BIS) amends the Export Administration Regulations (EAR) to further implement the bilateral understanding between the United States and India announced by President Obama and India's Prime Minister Singh on November 8, 2010. On January 25, 2011, BIS published the first rule in a series of rules to implement the bilateral understanding between the two countries. These rules fulfill the President's and Prime Minister's commitment to work together to strengthen the global nonproliferation and export control framework and further transform our bilateral export control cooperation to realize the full potential of the strategic partnership between the two countries. Specifically, in this rule, to further implement the November 8, 2010 bilateral understanding, BIS removes license requirements for certain items controlled for crime control and regional stability reasons to India. BIS also makes conforming changes in this rule., 138735=The Bureau of Industry and Security (BIS) is correcting a final rule that appeared in the Federal Register of April 16, 2013. As part of the Export Control Reform (ECR) Initiative, the Bureau of Industry and Security (BIS), and the Directorate of Defense Trade Controls (DDTC), Department of State, have published multiple proposed amendments to the Export Administration Regulations (EAR) and the International Traffic in Arms Regulations (ITAR), respectively, to strengthen national security by fundamentally reforming the export control system. The final rule implements the initial ECR changes by adding a structure and related provisions to control munitions items that the President has determined no longer warrant export control on the U.S. Munitions List (USML) on the Commerce Control List (CCL), specifically aircraft, gas turbine engines, and related items. The final rule was published in conjunction with a Department of State document that revises the USML so that upon the effective date of both documents, the USML and CCL and corresponding regulatory structures will be complementary. The Department of State is also correcting their final rule that appeared in the Federal Register of April 16, 2013, in a document published elsewhere in this issue of the Federal Register ., 206978=§ 1703 - Consultation and reports, 90649=This final rule makes corrections and clarifications to the Export Administration Regulations (EAR) for six final rules published in 2013 and early 2014. This final rule also makes other needed technical corrections and clarifications to the EAR identified by BIS. In addition, this final rule makes two conforming changes to the EAR as a result of a final rule published by the Department of State on April 17, 2014., 207254=§ 1706 - Savings provisions, 190138=The Bureau of Industry and Security (BIS) publishes this final rule, which amends the Export Administration Regulations (EAR) by establishing a new Export Control Classification Number (ECCN) series, 0Y521, on the Commerce Control List (CCL) and makes corresponding changes to the EAR. The ECCN 0Y521 series will be used for items that warrant control on the CCL but are not yet identified in an existing ECCN. As BIS explained in the proposed rule issued on July 15, 2011 (76 FR 41958), this new temporary holding classification is equivalent to United States Munitions List (USML) Category XXI (Miscellaneous Articles), but with a limitation that while an item is temporarily classified under ECCN 0Y521, the U.S. Government works to adopt a control through the relevant multilateral regime(s); to determine an appropriate longer-term control over the item; or determines that the item does not warrant control on the CCL. Items will be added to the 0Y521 ECCNs by the Department of Commerce, with the concurrence of the Departments of Defense and State, when it identifies an item that should be controlled because it provides a significant military or intelligence advantage to the United States or because foreign policy reasons justify such control. The 0Y521 series was described in the July 15, 2011 proposed rule that identified a framework for how articles, which the President determines, as part of the Administration's Export Control Reform Initiative, no longer warrant control on the USML would be controlled under the CCL. In this rule, however, the 0Y521 provisions are being published in final form, with necessary corresponding changes, separate from the other July 15 rule proposals. Public comments on the other July 15 proposals remain under BIS review., 207174=§ 1705 - Penalties, 160038=The Bureau of Industry and Security (BIS) publishes this final rule to amend the Export Administration Regulations (EAR) to implement the understandings reached at the June 2012 plenary meeting of the Australia Group (AG) and the 2012 AG intersessional decisions. Specifically, this rule amends the Commerce Control List (CCL) entry in the EAR that controls human and zoonotic pathogens and “toxins” to reflect changes to the AG “List of Biological Agents for Export Control” that were made based on the understandings adopted at the June 2012 AG plenary meeting. These changes included the addition of three pathogens and clarifications to two other items. This rule also amends the CCL entry in the EAR that controls plant pathogens to reflect: The 2012 AG Plenary agreement to add five pathogens to the AG “List of Plant Pathogens for Export Control;” and the AG intersessional clarifications to six pathogens identified on this AG list. In addition, the CCL entry in the EAR that controls equipment capable of handling biological materials is amended to reflect the 2012 AG intersessional decision to add certain spray-drying equipment to the AG “Control List of Dual-Use Biological Equipment and Related Technology and Software.” This rule also removes the CCL entry that controls select agents not identified on any of the AG common controls lists, but identified on the CCL because they are (or were, until recently) subject to controls maintained by the Centers for Disease Control and Prevention (CDC), U.S. Department of Health and Human Services, and the Animal and Plant Health Inspection Service (APHIS), U.S. Department of Agriculture, on their possession, use, and transfer within the United States. Rather than continuing to control these select agents in a separate CCL entry, this rule adds those select agents that remain subject to the CDC/APHIS controls (as well as a recent addition to the list of select agents) to the AG-related CCL entries that control human and zoonotic pathogens and “toxins” and plant pathogens, respectively., 208142=Title 15 published on 2015-01-01, 200938=This rule imposes a license requirement on exports and reexports to all destinations other than Canada of two types of microwave and millimeter wave electronic components. The two components are packaged high electron mobility transistors and packaged microwave “monolithic integrated circuits” power amplifiers that meet certain criteria with respect to frequency range, size and output power. BIS takes this step to control exports and reexports of these components, which have uses in military radar systems as well as in civilian radar and telecommunications systems. The U.S. Government also plans to propose adding these components to the Dual List of the Wassenaar Arrangement on Export Controls for Conventional Arms and Dual-Use Goods and Technologies (Wassenaar Arrangement Dual Use List) in 2012., 196225=This correction adds a compliance date of February 9, 2012, to a final rule published on January 9, 2012 (77 FR 1017). That final rule imposed a license requirement on exports and reexports to all destinations other than Canada of two types of microwave and millimeter wave electronic components. The two components are packaged high electron mobility transistors and packaged microwave “monolithic integrated circuits” power amplifiers that meet certain criteria with respect to frequency range, size and output power. BIS is publishing this correction to make sure exporters and reexporters have sufficient time to comply with the rule., 206707=§ 1701 - Unusual and extraordinary threat; declaration of national emergency; exercise of Presidential authorities, 42762=The Bureau of Industry and Security (BIS) is correcting certain provisions of the Export Administration Regulations (EAR) that were amended in past rulemakings appearing in the Federal Register between November 5, 2007 and October 14, 2014. This final rule makes corrections to certain provisions to ensure consistency and clarity in the regulations. In addition, this final rule makes other corrections to the EAR to fix typographical errors to ensure that the regulations accurately reflect the revisions intended by these past rulemakings., 236727=The Bureau of Industry and Security (BIS) proposes to implement the agreements by the Wassenaar Arrangement (WA) at the Plenary meeting in December 2013 with regard to systems, equipment or components specially designed for the generation, operation or delivery of, or communication with, intrusion software; software specially designed or modified for the development or production of such systems, equipment or components; software specially designed for the generation, operation or delivery of, or communication with, intrusion software; technology required for the development of intrusion software; Internet Protocol (IP) network communications surveillance systems or equipment and test, inspection, production equipment, specially designed components therefor, and development and production software and technology therefor. BIS proposes a license requirement for the export, reexport, or transfer (in-country) of these cybersecurity items to all destinations, except Canada. Although these cybersecurity capabilities were not previously designated for export control, many of these items have been controlled for their “information security” functionality, including encryption and cryptanalysis. This rule thus continues applicable Encryption Items (EI) registration and review requirements, while setting forth proposed license review policies and special submission requirements to address the new cybersecurity controls, including submission of a letter of explanation with regard to the technical capabilities of the cybersecurity items. BIS also proposes to add the definition of “intrusion software” to the definition section of the EAR pursuant to the WA 2013 agreements.}",
    "lastModified": "Wed, 17 Jun 2015 22:02:23 GMT",
    "textBeforeTable": "Additional Documents GPO FDSys XML | Text 80 FR 34266 - Implementation of the Australia Group (AG) November 2013 Intersessional Decisions 2015-06-16; vol. 80 # 115 - Tuesday, June 16, 2015 For a complete list of all Rules, Proposed Rules, and Notices view the Rulemaking tab. The following are only the Rules published in the Federal Register after the published date of Title 15. Title 15 published on . 79 FR 46959 (August 11, 2014)66 FR 44025, 361 FR 58767, 3et seq.;22 U.S.C. 7201et seq.;50 U.S.C. 1701et seq.; . CFR, 2001 Comp., p. 783; Notice of August 7, 2014, CFR, 1996 Comp., p. 228; E.O. 13222, E.O. 13026, 50 U.S.C. app. 2401 Authority:",
    "textAfterTable": "DEPARTMENT OF COMMERCE, Bureau of Industry and Security Final rule. This rule is effective June 16, 2015. 15 CFR Parts 740, 742, 752 and 774 Summary The Bureau of Industry and Security (BIS) publishes this final rule to amend the Export Administration Regulations (EAR) to implement the recommendations presented at the November 2013 Australia Group (AG) intersessional implementation meeting and later adopted pursuant to the AG silent approval procedure. Specifically, this rule amends the Commerce Control List (CCL) entry in the EAR that controls certain human and zoonotic pathogens and toxins, and removes the CCL entry that controls certain animal pathogens to reflect the merger of two AG common control lists based on recommendations presented at the AG intersessional implementation meeting. As a result of these recommendations, the AG “List of Animal Pathogens for Export Control” was merged with the AG “List of Biological Agents for Export Control,” creating a single AG common control list for these items ( i.e., the AG “List of Human and Animal Pathogens and Toxins for Export Control”). The scope of the controls on these human and animal pathogens and toxins was not affected by the merger of the two lists into a single AG common control list. This rule also makes conforming amendments to other provisions in the EAR to reflect these changes. In addition, this rule",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}