{
    "relation": [
        [
            "Payment method",
            "",
            "Money Order/Bank cheque",
            "Personal cheque",
            "Other - See seller's payment instructions"
        ],
        [
            "Preferred/Accepted",
            "PayPal Preferred",
            "Accepted",
            "Accepted",
            "Accepted"
        ],
        [
            "",
            "",
            "",
            "",
            ""
        ]
    ],
    "pageTitle": "Rudgate Brewery Jorvik Blonde Pump Clip VG | eBay",
    "title": "",
    "url": "http://www.ebay.com.au/itm/RUDGATE-BREWERY-Jorvik-Blonde-Pump-Clip-VG-/150791550160?_trkparms=algo%3DCRX%26its%3DC%252BS%26itu%3DSI%252BUA%252BLM%252BLA%26otn%3D18%26ps%3D63%26clkid%3D8637455044689650349",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988840.31/warc/CC-MAIN-20150728002308-00237-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 416385371,
    "recordOffset": 416333237,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Payment details receiving cleared payment - opens in a new window or tab. Will usually post within 1 business day of Domestic handling time cleared payment- opens in a new window or tabEstimated delivery dates- opens in a new window or tab . Delivery times may vary, especially during peak periods. include seller's handling time, origin ZIP Code, destination ZIP Code and time of acceptance and will depend on shipping service selected and receipt of * Seller ships within 1 day after receiving cleared payment - opens in a new window or tab. Fri. 7 Aug. and Thu. 13 Aug. Estimated between Standard Int'l Postage United States",
    "textAfterTable": "Seller's payment instructions My prefered payment method is Paypal, however I do accept cheques and postal orders, although they must clear before any goods can be sent. Payment is expected within seven working days of the end of the auction, or buy it now. Postal discounts only apply to items that have a postal cost and not to Free postage listings. Free postage listings only apply to the UK and not foreign buyers. Please contact me for a cost for shipping abroad. Current bid amount + + import charges (shown at checkout) time left ##2## left | Bid Count",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}