{
    "relation": [
        [
            "Categories",
            "Campus Safety",
            "Great for these types of students",
            "Bang for the buck",
            "What to do for fun",
            "Food and Dining",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "Lots of security around. Crime is low on campus",
            "All types of students can apply. I am a married & a mother of seven and I found the other students of varying ages and backgrounds too.",
            "The most affordable college around",
            "HACC has alot for students to get involved in. Sports, theater, clubs, you can find something to get into the school spirit here",
            "Great choices and affordable",
            "I find the classes challenging but there is so much help on campus that you shouldn't struggle very hard unless you don't ask for assistance.",
            "Arrive to class a few minutes early or on time. It is a huge disruption to the professor and the other students when you arrive late.",
            "I love this school. The instructors are approachable, the classes are enjoyable and the students are very friendly."
        ]
    ],
    "pageTitle": "Harrisburg Area Community College-Harrisburg Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Harrisburg-Area-Community-College-Harrisburg/reviews?_escaped_fragment_=/show/86510",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988840.31/warc/CC-MAIN-20150728002308-00207-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 901611119,
    "recordOffset": 901542303,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{137152=I am a part time student who began taking classes summer 2012. I find the campus staff friendly and accommodating to the students. I also feel that the resources available at the campus are extraordinary., 370794=Shitty parking. Get there earlier than 8:30 if you want a decent spot., 387453=© 2015, Cappex.com, LLC, 98196=I am currently attending this college online and will be going to the campus in June for my next class. So far with the online classes, everybody seems friendly and eager to help you with any questions that you have. If you have a question for the teacher, she responds very quickly and gives examples if needed.}",
    "textBeforeTable": "07/11/2009 Reviewer is Accepted here and planning to attend soon. Reviewer has been to campus. 6 out of 6 people found this review useful. 1 person found it offensive. 1 of 104 Raylicia from Harrisburg, PA Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) {",
    "textAfterTable": "Great for these types of students I am a parent and have received lots of help through Hacc's Keys program, daycare- study habits- budget planning and much more. What to do for fun I use the gym in my spare time or maybe some volley ball. Food and Dining Low cost great meals and a large variety on health meals Dorm Life Extremely pleasant ,respectful, clean and safe Academic Rigor This is a first semester for me and I have used all of the academic services available for students to achieve. Try them. Classes are very well paced. Tips for prospective students There are plenty of workshops, tutoring classes and academic advisers, to assist you in achieving the best grade possible. Even if you feel the need to just speak with someone all doors at Hacc are open. They will help in any way possible. Just ask questions and you will get answers. In three sentences It has been several years since i have attended a school, i was feeling overwhelmed with the thought of returning and",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}