{
    "relation": [
        [
            "Categories",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "There are several places for students to dine at USCA. The SAC is the cafe of the campus. They have several different stations with varieties of food. When you aren't feeling the SAC then you can eat at the Station. The Station is like the Subway of the campus. Subs are EXCELLENT there. The Market is the store on campus which is kind of pricey, but okay when you don't feel like running to the store",
            "As a freshman, living in the Crossings has been one of the best experiences of my life. The RA's are always there to help you. Students are always engaging in something and the rules aren't too hard. There's always something fun going on in the Crossings.",
            "Aiken isn't a difficult school neither is it an easy school. There are some classes where you have to work harder than others. Some teachers assign more work than others then some you barely have work in. My advice is to read when your teacher tells you because if you don't then you might get left behind. Most teachers allow ample amount of time for assignments to get done.",
            "When you come to USCA, be prepared to work. Yes, they will be times where someone is throwing a party that you want to go to, but academics come first. Teachers will work with you if you have a legit reason why you missed class, but you MUST read your syllabus because everything that you will do in class is on that document. The campus has several clubs that engage in activities for the school. Overall the school is excellent.",
            "The school offers several undergraduate and graduate programs that allows students to have a variety of majors to choose from. Teachers are very helpful and will schedule meetings where the student can get extra help outside if class if they don't understand something in class. The school also aids freshmen in becoming comfortable during their first semester by planning activities for them to attend."
        ]
    ],
    "pageTitle": "University of South Carolina-Aiken Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/University-of-South-Carolina-Aiken/reviews",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988840.31/warc/CC-MAIN-20150728002308-00095-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 903408179,
    "recordOffset": 903366459,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{171234=© 2015, Cappex.com, LLC}",
    "textBeforeTable": "07/15/2009 Reviewer is A current student here. 12 out of 13 people found this review useful. 1 of 37 Jemar from Elko, SC Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code",
    "textAfterTable": "Login to rate or flag the reviews Ronniesha from Aiken, SC 01/11/2010 Reviewer is A current student here. 3 out of 4 people found this review useful. 2 of 37 Categories Comments Bang for the buck The University of South Carolina in Aiken, the last time I checked was the most inexpensive school in South Carolina. Many people may hear that and think that the quality of education is not good, but let me reassure you that you will definitely be getting your moneys worth and then some out of the University. We have top notch professor that will know you name. You will get one on one time and small classes at this University as well as great housing. Most big schools that are extremely expensive won't give you one on one time with your professors. You would be paying 13,000 in tuition only and your professor will not know your name. That is not the type of college experience you want. The University of South Carolina Aiken provides you with more than your monies worth. Am enjoying",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}