{
    "relation": [
        [
            "de",
            "Auswirkungen des Klimas Teil I",
            "Antarktis"
        ],
        [
            "en",
            "Effects of Climate Change Part I",
            "Antarctic"
        ],
        [
            "fr",
            "Conséquences du changement climatique, partie I",
            "Antarctique"
        ]
    ],
    "pageTitle": "Wärme: Entwarnung - Internet-Vademecum - A. Brandenberger",
    "title": "",
    "url": "http://vademecum.brandenberger.eu/themen/kalt/entwarnung.php",
    "hasHeader": true,
    "headerPosition": "MIXED",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438043062635.98/warc/CC-MAIN-20150728002422-00106-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 254503547,
    "recordOffset": 254474515,
    "tableOrientation": "VERTICAL",
    "TableContextTimeStampBeforeTable": "{14170=Figure 2: Average length of 169 glaciers from 1700 to 2000}",
    "TableContextTimeStampAfterTable": "{83066=Seine maximale Größe hatte der Gletscher um 1860 erreicht., 52755=For comparative purposes, they also note that \"the current decadal average surface temperature at the summit is as warm as in the 1930s-1940s, and there was another similarly warm period in the 1140s (Medieval Warm Period),\" indicating that \"the present decade is not outside the envelope of variability of the last 1000 years.\", 69163=Die Werte werden an der Forschungsstation Amundsen/Scott direkt am Südpol seit 1957 mit nur sehr wenigen Lücken erfasst, 50861=CO2 Science 2012-02-15 de A 4000-Year History of Greenland Surface Temperature, 52105=The eight researchers report that \"the temperature record starts with a colder period in 'the Bronze Age Cold Epoch',\" which they say was followed by \"a warm period in 'the Bronze Age Optimum',\" which was followed by a 1000-year cooling that began \"during 'the Iron/Roman Age Optimum',\" which was followed by \"the Dark Ages,\" which was followed by \"the Medieval Warm Period,\" which was followed by \"the Little Ice Age\" - which they describe as \"the coldest period of the past 4000 years\" - which was followed, last of all, by \"the recent warming.\", 84857=de Veränderungen zwischen 2000-2010 von mehr als zweitausend per Satellit vermessenen Himalayagletschern., 44843=In der Fernsehsendung «Larry King Live» mit Al Gore als Gast im Jahr 2007 wollte eine Frau wissen, wie sich der Klimawandel auf die Sicherheit der USA in den kommenden zehn Jahren auswirken würde., 46093=Im Wissenschaftsjournal Science lieferten der Nasa-Forscher Scott Luthcke und seine Co-Autoren im Jahr 2006 Zahlen., 115184=Von einem Höchstwert im Jahre 1993 (mit 14 Großereignissen) ist der Wert auf 0-7 Großereignisse in den Jahren 2000-2008 gefallen., 48288=Klimaskeptiker Info 2011-01-26 de Eine 4000-jährige Geschichte über Grönlands Oberflächentemperatur, 44465=Die Weltwoche / Hans Rentsch 2010-03-03 de Verzerrte Bilder, 49685=Über die nächsten 1300 Jahre hinweg folgen weitere Warm- und Kaltzeiten, wie das Klimaoptimum der Eisen/Römerzeit, dass Klimapessimum der \"dunklen\" Völkerwanderungszeit und das Klimaoptimum des Mittelalters (im 11. bis 12.Jahrhundert)., 85215=en Number of glaciers showing retreat, advance or stability during 2000-01/02 to 2010-11., 50203=Der mittlere und obere Teil der Abbildung zeigen, dass es während des Klimaoptimums des Mittelalters (1140er Jahre) und in der Zeit zwischen 1930-1950 genauso warm war, wie im letzten Jahrzehnt.}",
    "textBeforeTable": "--> /include/klima/web_en.php /include/klima/welt/ipcc.php /include/klima/welt/eis.php /include/klima/welt/extrem.php /include/klima/welt/temperatur.php /include/klima/welt/warm.php /themen/klima-2/zitate.php /include/klima/manifeste.php /include/klima/video-praesentation.php /themen/klima-2/ipcc.php /include/klima/fischlin_singer.php /include/klima/manifeste.php /include/klima/institute.php /themen/klima-1/praesentation.php /themen/klima/einfuehrung.php /include/klima/presse.php /include/index/stichwort.php in ?> include \"$punkte/include/klima/who/singer.php\"; < ?php",
    "textAfterTable": "/include/klima/welt/temperatur.php /include/klima/welt/wirkung.php /include/klima/welt/extrem.php /include/klima/welt/eis.php /include/klima/welt/ipcc.php /include/klima/welt/geschichte.php /include/klima/web_en.php --> Antony Watts Anthony Watts is a 25-year broadcast meteorology veteran and currently chief meteorologist for KPAY-AM radio. He got his start as on-air meteorologist for WLFI-TV in Lafayette, Indiana and at KHSL-TV in Chico, California. In 1987, he founded ItWorks, which supplies broadcast graphics systems to hundreds of cable television, television, and radio stations nationwide. ItWorks supplies custom weather stations, Internet servers, weather graphics content, and broadcast video equipment. In 2007, Watts founded SurfaceStations.org, a Web site devoted to photographing and documenting the quality of weather stations across the U.S. Klaus-Eckart Puls Dipl.-Meteorologe, FU Berlin de en fr Auswirkungen des Klimas Teil I, II, II1, IV Effects of Climate Change Part I, II, II1, IV Conséquences",
    "hasKeyColumn": true,
    "keyColumnIndex": 1,
    "headerRowIndex": 0
}