{
    "relation": [
        [
            "type",
            "FR Doc.",
            "RIN",
            "Docket No."
        ],
        [
            "regulations.gov",
            "2013-22059",
            "1625-AB27",
            "USCG-2008-1070"
        ]
    ],
    "pageTitle": "33 CFR Part 151, Subpart C - Ballast Water Management for Control of Nonindigenous Species in the Great Lakes and Hudson River | US Law | LII / Legal Information Institute",
    "title": "",
    "url": "https://www.law.cornell.edu/cfr/text/33/part-151/subpart-C?qt-cfr_tabs=3",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988840.31/warc/CC-MAIN-20150728002308-00080-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 915956335,
    "recordOffset": 915937356,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{975=Title 33 published on 2014-07-01.}",
    "TableContextTimeStampAfterTable": "{26707=Executive Order ... 12777, 84548=The Coast Guard is publishing an interim rule with request for comments to conform regulations to the adopted MARPOL Annex V amendments which entered into force on January 1, 2013. The International Convention for the Prevention of Pollution from Ships (MARPOL) Annex V (Garbage) amendments prohibiting the discharge of garbage from vessels unless expressly allowed were adopted by the International Maritime Organization's Marine Environmental Protection Committee in July 2011 and implemented domestically through the Act to Prevent Pollution from Ships. Under this rule, the only allowed discharges will be certain food wastes, cargo residues, cleaning agents and additives in wash waters, and animal carcasses., 60601=On September 30, 2013, the Coast Guard amended regulations on response plans for nontank vessels. The amendment triggered information collection requirements affecting an existing OMB-approved information collection requirement on vessel and facility response plans. This notice announces that the collection of information has been approved by the Office of Management and Budget (OMB) and can now be enforced. The OMB control number is 1625-0066., 114481=In this notice of proposed rulemaking (NPRM), we are proposing to update our regulations to harmonize U.S. regulations with international conventions regarding oil pollution and safety of life at sea. The Coast Guard proposes to amend our regulations covering Navigation and Navigable Waters to align with recent amendments to Annex I of the International Convention for the Prevention of Pollution from Ships, 1973, as modified by the Protocol of 1978, which were adopted by the Marine Environment Protection Committee during its 52nd, 54th, 56th, and 59th sessions. In addition, we are proposing to incorporate guidance from the Maritime Safety Committee, based on updates to the International Convention for the Safety of Life at Sea 1974, into our regulations covering shipping. Finally, we are seeking public comment on an alternative to add a requirement that some new U.S. non-oceangoing vessels be equipped with an oily bilge water storage tank., 75015=This rule makes non-substantive changes throughout Title 33 of the Code of Federal Regulations. The purpose of this rule is to make conforming amendments and technical corrections to Coast Guard navigation and navigable waters regulations. These changes will have no substantive effect on the regulated public. This rule is provided to coincide with the annual recodification of Title 33 on July 1, 2013., 89295=On June 13, 2012, the Coast Guard published in the Federal Register an announcement of effective date that announced an information collection approval for the Standards for Living Organisms in Ships' Ballast Water Discharged in U.S. Waters (BWDS) Final Rule (77 FR 35268). The rulemaking triggered new information collection requirements affecting vessel owners and their potential requests for an extension of the compliance date if they cannot practicably comply with the compliance date otherwise applicable to their vessels. The June 13, 2012, document announced that the request to revise the existing collection of information to add the new request for an extension provision was approved by the Office of Management and Budget (OMB) and may now be enforced. The OMB control number is 1625-0069. The approval for this collection of information expires on May 31, 2015. In the June 13, 2012, document, the Coast Guard inadvertently failed to indicate that we received public submissions to the BWDS Final Rule (77 FR 17254). The Coast Guard is now publishing a document to advise the public that we received four public submissions to this collection of information. As the four public submissions were not collection of information-related, we did not revise our collection of information estimates. You may view copies of the public submissions and the Coast Guard responses to them in the BWDS docket online by going to http://www.regulations.gov, inserting USCG-2001-10486 in the “Keyword” box, and then clicking “Search.” A corrected information collection request package has been submitted to OMB for their review. The current 1625-0069 approval by OMB is still effective. If OMB decides to amend the current 1625-0069 approval, a copy of that decision will be placed in the docket., 25405=§ 1903 - Administration and enforcement, 18392=The Coast Guard published a final rule in the Federal Register on July 7, 2014, that made non-substantive corrections throughout Title 33 of the Code of Federal Regulations. One of the amendatory instructions, which was intended to update a mailing stop number, contained a reference to the wrong paragraph in a section. This rule corrects that error., 25601=§ 2602 - Vessel permits and numbers, 3204=In this final rule the Coast Guard is updating our regulations to harmonize U.S. regulations with international conventions regarding oil pollution. We are amending the regulations covering Title 33: Navigation and Navigable Waters to align with recent amendments to Annex I of the International Convention for the Prevention of Pollution from Ships, 1973, as modified by the Protocol of 1978, which were adopted by the International Maritime Organization's Marine Environment Protection Committee during its 52nd, 54th, 55th, and 59th sessions. This final rule also amends sections of the Vessel Response Plan regulations to include the Safety of Life at Sea Material Safety Data Sheets as an equivalent hazardous communications standard., 13919=The Coast Guard announces that it has received approval from the Office of Management and Budget for an information collection request associated with the January 2014 final rule on the discharge of bulk dry cargo residue on the U.S. waters of the Great Lakes. With this approval, all provisions of the final rule are now fully in effect and can be enforced. The final rule promotes the Coast Guard's maritime safety and stewardship missions., 109786=The Coast Guard is correcting a final rule that appeared in the Federal Register of March 23, 2012 (77 FR 17254), entitled “Standards for Living Organisms in Ships' Ballast Water Discharged in U.S. Waters.” Six technical errors were inadvertently published in the final rule that require correction, two in the preamble and four in the regulatory text. The corrections are necessary for readability and accuracy., 25506=§ 1908 - Penalties for violations, 119432=By this final rule, the Coast Guard amends the list of special areas in effect under Annex V of the International Convention for the Prevention of Pollution from Ships, 1973, as modified by the Protocol of 1978, as amended, to include the Wider Caribbean Region special area. The current list of special areas in effect is outdated because it does not include this special area, which went into effect May 1, 2011. This rule will correct the list of special areas in effect to provide accurate information to the public., 105045=On March 23, 2012, the Coast Guard published in the Federal Register a Final Rule entitled “Standards for Living Organisms in Ships' Ballast Water Discharged in U.S. Waters”. The rulemaking triggered new information collection requirements affecting vessel owners and their potential requests for an extension of the compliance date if they cannot practicably comply with the compliance date otherwise applicable to their vessels. This document announces that the request to revise the existing collection of information to add the new request for an extension provision has been approved by the Office of Management and Budget (OMB) and may now be enforced. The OMB control number is 1625-0069., 100612=The Coast Guard is extending the comment period for the notice of proposed rulemaking (NPRM) entitled “MARPOL Annex I Amendments,” published on April 9, 2012, for 60 days. We have decided to extend the comment period at the request of industry because we omitted from the docket the accompanying Regulatory Analysis, which informs the proposal., 25297=§ 1321 - Oil and hazardous substance liability}",
    "lastModified": "Mon, 06 Jul 2015 10:01:06 GMT",
    "textBeforeTable": "Additional Documents GPO FDSys XML | Text 80 FR 5922 - MARPOL Annex I Amendments 2015-02-04; vol. 80 # 23 - Wednesday, February 4, 2015 For a complete list of all Rules, Proposed Rules, and Notices view the Rulemaking tab. The following are only the Rules published in the Federal Register after the published date of Title 33. Title 33 published on 2014-07-01. 16 U.S.C. 4711 § 151.1518 — Penalties for failure to conduct ballast water management. § 151.1516 — Compliance monitoring. § 151.1515 — Ballast water management alternatives under extraordinary conditions. CGD 91-066, 58 FR 18334, Apr. 8, 1993, unless otherwise noted. Source: ; Department of Homeland Security Delegation No. 0170.1. Authority:",
    "textAfterTable": "DEPARTMENT OF HOMELAND SECURITY, Coast Guard Final rule. This final rule is effective May 5, 2015. The incorporation by reference of certain publications listed in the rule is approved by the Director of the Federal Register on May 5, 2015. 33 CFR Parts 151, 155, 156, and 157 Summary In this final rule the Coast Guard is updating our regulations to harmonize U.S. regulations with international conventions regarding oil pollution. We are amending the regulations covering Title 33: Navigation and Navigable Waters to align with recent amendments to Annex I of the International Convention for the Prevention of Pollution from Ships, 1973, as modified by the Protocol of 1978, which were adopted by the International Maritime Organization's Marine Environment Protection Committee during its 52nd, 54th, 55th, and 59th sessions. This final rule also amends sections of the Vessel Response Plan regulations to include the Safety of Life at Sea Material Safety Data Sheets as an equivalent hazardous communications standard. 2015-01-30; vol. 80 # 20 - Friday, January 30, 2015 80 FR 5282 - Vessel Requirements for Notices of Arrival and Departure, and Automatic Identification System",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}