{
    "relation": [
        [
            "Name and Description",
            "version",
            "congress-number The number of the Congress during which the nominees were nominated",
            "state",
            "api-key"
        ],
        [
            "Value and Notes",
            "See Common Parameters.",
            "107–113",
            "Two-letter state abbreviation",
            "See Common Parameters."
        ]
    ],
    "pageTitle": "Times Developer Network - The Congress API",
    "title": "",
    "url": "http://developer.nytimes.com/docs/congress_api",
    "hasHeader": true,
    "headerPosition": "MIXED",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988840.31/warc/CC-MAIN-20150728002308-00012-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 62411087,
    "recordOffset": 62386868,
    "tableOrientation": "VERTICAL",
    "textBeforeTable": "Note: In this document, curly braces { } indicate required items. Square brackets [ ] indicate optional items or placeholders. For information about changes in the current version, see Introducing Version 3 of the Congress API and the summary of changes on this page. For a general overview and background, see Introducing the Congress API. With the Congress API, you can get summaries of roll-call votes in the U.S. Congress; get lists of members of Congress; and get vote data, floor appearances, biographical information and role data for individual House and Senate members. You can also get information about bills (summaries and bill actions), nominees, committees and schedules. The Congress API Register Log In Times Developer Network",
    "textAfterTable": "Requests | Responses | Examples | Errors | Change Log To use the Congress API, you must sign up for an API key. Usage is limited to 5000 requests per day (rate limits are subject to change). Please read and agree to the API Terms of Use, the Supplemental Terms of Use and the Attribution Guidelines before you proceed. For more information about the data returned by the Congress API, see Congressional Data. Requests The Congress service uses a RESTful style. The available request types fall into five categories: members, votes, bills, nominees and other. Members Votes Member Lists Member Bio and Roles New Members Current Members by State/District Members Leaving Office Member Vote Positions Member Vote Comparison Bills Cosponsored by a Member Member Sponsorship Comparison Member Floor Appearances Roll-Call Votes Votes by Type Votes by Date Senate Nomination Votes Bills Nominees Other Recent Bills Bills by Member Bill Details Bill Subjects/Amendments and Related Bills Bill Cosponsors Nominee Lists Nominee Details Nominees by State",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}