{
    "relation": [
        [
            "Play Type",
            "Home-run",
            "Single",
            "Out",
            "Out",
            "Error-wild-pitch",
            "Out"
        ],
        [
            "Play",
            "Anthony Recker lead-off Home Run (1) to left. Omar Quintanilla due up.",
            "Omar Quintanilla singled to right. Runner on first with none out and Eric Young due up.",
            "Eric Young sacrifice bunt to first. On the play, Omar Quintanilla advances to second. Runner on second with one out and Daniel Murphy due up.",
            "Daniel Murphy struck out swinging. Runner on second with two outs and David Wright due up.",
            "Omar Quintanilla advances to third on a wild pitch by Matt Shoemaker. Runner on third with two outs and David Wright at the plate.",
            "David Wright flied out to center to end the inning."
        ]
    ],
    "pageTitle": "Saturday, April 12, 2014 Interleague Game: New York Mets - Los Angeles Angels Box Scores, Game Results & Summary - USATODAY.com",
    "title": "",
    "url": "http://content.usatoday.com/sportsdata/baseball/mlb/game/Mets_Angels/2014/4/12",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988840.31/warc/CC-MAIN-20150728002308-00208-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 53784923,
    "recordOffset": 53769584,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{2354=View all MLB box scores for 4/12/2014}",
    "TableContextTimeStampAfterTable": "{36494=Omar Quintanilla's two-out, two-run single off Kevin Jepsen in the away ninth gave the Mets some breathing room at 6-3, and Valverde was on the verge of closing out the win after retiring retired Albert Pujols and Howie Kendrick.}",
    "textBeforeTable": "Top of the 1st Manny Gonzalez  3B Fieldin Culbreth  2B Toby Basner  1B Sean Barber  H Umpires 4.05 29 46 2 2 1 1 3 2 Matt Shoemaker (L, 0-1) 0.00 13 18 3 0 0 0 1 1 Joe Smith  3.60 10 17 1 0 0 0 0 1 Ernesto Frieri  15.00 10 18 1 1 0 0 1 0.2 Kevin Jepsen  54.00 5 12 0 1 2 2 1 0.1 Dane De La Rosa  3.18 14 23 1 0 0 0 1 1 Michael Kohn  4.76 7 10 1 0 0 0 1 0.1 Fernando Salas (BS, 1) 5.79 50 99 5 4 4 4 3 6.2 Jered Weaver  ERA Strikes Pitches SO BB ER R H IP Name 12.00 \" xmlns:fo=\"http://www.w3.org/1999/XSL/Format\" />Angels pitching http://i.usatoday.net/_common/_images/_sports/logos/mlb/angels_22t.png 21 33 0 0 0 0 0 2 John Lannan (W, 1-0) 1.23 10 17 1 0 0 0 0 1.1 Gonzalez Germen  10.80 4 8 0 0 0 0 0 0.2 Scott Rice  4.26 14 26 1 1 3 3 2 1 Jose Valverde (BS, 1) 1.50 4 4 0 0 0 0 1 0.2",
    "textAfterTable": "Single Albert Pujols single to left scored Collin Cowgill with one out. Runner on first and Howie Kendrick due up. Out Howie Kendrick grounded into a double play, short to second to first. On the play, Albert Pujols out at second, to end the inning. Top of the 2nd Play Type Play Out Curtis Granderson grounded out to first. None on with one out and Ike Davis due up. Home-run Lucas Duda two-out, solo Home Run (3) to center. Juan Lagares due up. Out Juan Lagares flied out to left to end the inning. Bottom of the 2nd Play Type Play Out David Freese grounded out short to first. None on with one out and Erick Aybar due up. Out Erick Aybar lined out to left. None on with two outs and Raul Ibanez due up. Out Raul Ibanez struck out swinging to end the inning. Top of the 3rd Play Type Play Out Anthony Recker flied out to left. None on with one out and Omar Quintanilla due up. Out Omar Quintanilla grounded",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}