{
    "relation": [
        [
            "Religion",
            "Catholic",
            "Mainline Protestant",
            "Evangelical Protestant",
            "Other",
            "Black Protestant",
            "Orthodox",
            "None"
        ],
        [
            "Adherents",
            "48,514",
            "19,057",
            "18,538",
            "2,607",
            "248",
            "40",
            "83,328"
        ],
        [
            "Congregations",
            "9",
            "48",
            "75",
            "9",
            "2",
            "1",
            "-"
        ]
    ],
    "pageTitle": "Medina, Ohio (OH 44256) profile: population, maps, real estate, averages, homes, statistics, relocation, travel, jobs, hospitals, schools, crime, moving, houses, news, sex offenders",
    "title": "",
    "url": "http://www.city-data.com/city/Medina-Ohio.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988840.31/warc/CC-MAIN-20150728002308-00058-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 361671339,
    "recordOffset": 361526975,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{28874=Sulfur Dioxide (SO2) [ppb] level in 2012 was 2.67. This is worse than average. Closest monitor was 0.2 miles away from the city center., 61083=On 5/31/1985, a category F5 (max. wind speeds 261-318 mph) tornado 37.4 miles away from the city center killed 18 people and injured 310 people and caused between $50,000,000 and $500,000,000 in damages., 96565=Incorporated in 1952, 30432=Air Quality Index (AQI) level in 2012 was 94.4. This is worse than average., 5327=School Enrollment by Level of School (%) in 2013, 1708=2008 Presidential Elections Results, 2566=1996 Presidential Elections Results, 28144=Ozone [ppb] level in 2012 was 30.4. This is about average. Closest monitor was 2.4 miles away from the city center., 36179=Tourist attractions: Clinical Apothecaries (Cultural Attractions- Events- & Facilities; 1075 South Court Street Suite 100), AAA Auto Club (Tours & Charters; 150 Northland Drive)., 5725=Educational Attainment (%) in 2013, 77731=According to our research of Ohio and other state lists there were 72 registered sex offenders living in Medina, Ohio as of August 01, 2015. The ratio of number of residents in Medina to the number of sex offenders is 369 to 1., 26695=Particulate Matter (PM2.5) [µg/m3] level in 2012 was 9.98. This is about average. Closest monitor was 3.5 miles away from the city center., 61402=On 4/11/1965, a category F4 (max. wind speeds 207-260 mph) tornado 13.5 miles away from the Medina city center killed 18 people and injured 200 people and caused between $5,000,000 and $50,000,000 in damages., 27445=Particulate Matter (PM10) [µg/m3] level in 2012 was 17.1. This is about average. Closest monitor was 14.0 miles away from the city center., 2280=2000 Presidential Elections Results, 1994=2004 Presidential Elections Results, 96465=Elevation: 1092 feet, 35949=Hotels: Best Western Medina (2875 Medina Road), Gallery of Medina's Inn (238 West Liberty Street), Hampton Inn Cleveland/Medina (3073 East Point Drive)., 1138=Graphs represent county-level data. Detailed 2008 Election Results, 1422=2012 Presidential Elections Results, 29780=Carbon Monoxide (CO) [ppm] level in 2012 was 0.129. This is significantly better than average. Closest monitor was 6.1 miles away from the city center.}",
    "TableContextTimeStampAfterTable": "{113632=Recent home sales, price trends, and home value evaluator powered by Onboard Informatics © 2015 Onboard Informatics. Information is deemed reliable but not guaranteed.   City-data.com does not guarantee the accuracy or timeliness of any information on this site.  Use at your own risk. Website © 2015 Advameg, Inc., 16517=5.45% of this county's 2011 resident taxpayers lived in other counties in 2010 ($49,706 average adjusted gross income), 18717=5.40% of this county's 2010 resident taxpayers moved to other counties in 2011 ($47,143 average adjusted gross income), 112357=Total of 637 patent applications in 2008-2015.}",
    "textBeforeTable": "Religion statistics for Medina city (based on Medina County data) River Styx (Riversticks) neighborhood Neighborhood in Medina (Medina, Ohio Neighborhood Map): Graphs represent county-level data. Detailed 2008 Election Results 2012 Presidential Elections Results 2008 Presidential Elections Results 2004 Presidential Elections Results 2000 Presidential Elections Results 1996 Presidential Elections Results 2012 2008 2004 2000 1996 Presidential Elections Results Electricity (23%) Utility gas (77%)",
    "textAfterTable": "Source: Clifford Grammich, Kirk Hadaway, Richard Houseal, Dale E.Jones, Alexei Krindatch, Richie Stanley and Richard H.Taylor. 2012. 2010 U.S.Religion Census: Religious Congregations & Membership Study. Association of Statisticians of American Religious Bodies. Jones, Dale E., et al. 2002. Congregations and Membership in the United States 2000. Nashville, TN: Glenmary Research Center. Graphs represent county-level data Food Environment Statistics: Number of grocery stores: 23 Medina County: 1.36 / 10,000 pop. Ohio: 1.89 / 10,000 pop. Number of supercenters and club stores: 1 This county: 0.06 / 10,000 pop. State: 0.13 / 10,000 pop. Number of convenience stores (no gas): 11 Medina County: 0.65 / 10,000 pop. Ohio: 1.25 / 10,000 pop. Number of convenience stores (with gas): 50 Medina County: 2.95 / 10,000 pop. State: 2.93 / 10,000 pop. Number of full-service restaurants: 101 Here: 5.97 / 10,000 pop. State: 6.25 / 10,000 pop. Adult diabetes rate: This county:",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}