{
    "relation": [
        [
            "Categories",
            "Campus Safety",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "Secure, there are campus police cars that patrol the lots routinely.",
            "There is a McDonald's and a Donatos across the street, Subway is located down the street.",
            "None",
            "I have to push myself to do tedious research ahead of time so I don't waste time researching at the last minute.",
            "Make sure you have enough money to afford the tuition.",
            "Franklin University is a school that constantly has new programs available for students. The rate is somewhat affordable but the instructors are great and the resources are wonderful."
        ]
    ],
    "pageTitle": "Franklin University Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Franklin-University/reviews?_escaped_fragment_=/show/104977",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438043062635.98/warc/CC-MAIN-20150728002422-00030-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 912983979,
    "recordOffset": 912954097,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{109014=© 2015, Cappex.com, LLC}",
    "textBeforeTable": "03/17/2012 Reviewer is A current student here. 3 out of 3 people found this review useful. 1 of 29 Aleta from Reynoldsburg, OH Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp",
    "textAfterTable": "Dorm Life There is no on-campus housing at this University. Academic Rigor The academic rigor of this University is impressive. The courses are structured well to incorporate real life experiences to prepare you for whatever field you intend to utilize your degree in. Professors are the best in their profession with solid credentials and experience. This University has great programs. Tips for prospective students If you plan on attending this University, a major tip is to have good time management skills. The course load is fierce and challenging. Professors expect for you to submit quality papers and engage in all online conversations. Make sure that you log onto your class at least twice a week to see updates from the professor and complete class participation assignments. Also find time in your schedule to properly review all material for the week and submit assignments on time. A good strategy would be to preview work for the next week to see if there are any assignments requiring additional time, and make arrangements in your schedule to accommodate the course work. In three sentences Franklin University is a wonderful school. I would give the school an A- for a rating or about 4 out of 5 stars. The University is centrally located",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}