{
    "relation": [
        [
            "First Name",
            "Catherine",
            "Nelson",
            "L. Ann"
        ],
        [
            "Last Name",
            "Boland",
            "Garcia",
            "Wilson"
        ],
        [
            "Suffix",
            "",
            "",
            ""
        ],
        [
            "Covered Official Position (if applicable)",
            "",
            "",
            ""
        ],
        [
            "New",
            "",
            "",
            ""
        ]
    ],
    "pageTitle": "LD-2 Disclosure Form",
    "title": "",
    "url": "http://soprweb.senate.gov/index.cfm?event=getFilingDetails&filingID=32CBF4FA-97BE-4C3F-8298-1C778CA185BB&filingTypeID=69",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987174.71/warc/CC-MAIN-20150728002307-00191-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 225734526,
    "recordOffset": 225726324,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{22608=Educated administration officials on energy efficiency issues specific to the automotive and heavy duty vehicle parts supplier industry. Supported providing feasible fuel economy technologies for the full range of product offerings produced and sold in the domestic and global markets. Supported H.R. 2150, which increases the authorization of loans for advanced technology vehicle manufacturing to $50 billion. Supported S. 1617 and H.R. 3083 which creates a revolving loan fund for small and medium manufacturers to retool facilities to make them more energy efficient or to manufacture energy efficient components. Supported H.R. 3246 and S. 2843 which creates a program of research, development, demonstration and commercial application in vehicle technologies at the Department of Energy. Supported changes to the Advanced Technology Vehicle Manufacturing Program at the Dept. of Energy to allow parts manufacturers to utilize the program., 15918=Lobbied administration officials and members of Congress on intellectual property rights violations relating to vehicle parts suppliers. Supported efforts to increase enforcement resources at the U.S. Dept. of Homeland Security for IP protections in S. 1631, the Customs Reauthorization bill. Monitored S. 3804, The Combating Online Infringement and Counterfeits Act., 1019=Lobbying Disclosure Act of 1995 (Section 5) - All Filers Are Required to Complete This Page, 34730=Supported H.R. 2024 and S. 1582, which would provide a tax credit for the accelerated development and deployment of advanced safety systems for commercial motor vehicles. Supported H.R. 3367, which extends and increases the medium- and heavy-duty hybrid vehicle tax credit. Supported H.R.3383, which provides a tax credit for the purchase and installation of idling reduction systems for diesel-powered on-highway vehicles Supported creation of legislation to amend the Internal Revenue Code to allow a tax credit for investment in recycled or remanufactured equipment. Supported S. 1203 and H.R. 422, which would make the R&D tax credit permanent. Supported extension of R&D tax credit and other favorable expiring business tax extensions in H.R. 4213., 47967=Supported S. 1817, The Small Business Emergency Loan Relief Act of 2009, 31808=Supported pro-manufacturing agenda including H.R. 5116 The America COMPETES Reauthorization Act of 2010. Monitored H.R. 4678, The Foreign Manufacturers Legal Accountability Act of 2010. Supported H.R. 4692, The National Manufacturing Strategy Act., 45738=Opposed H.R. 1409 and S. 560, which makes it easier for employees to join a union. Opposed S. 1374 and H.R. 3042, the ForeWARN Act which changes WARN requirements., 42072=Supported changes to the Motor Vehicle Safety Act of 2010 (H.R. 5381, S. 3302). Monitored S. 554 and H.R. 1396, which address motorcoach safety and occupant protection issues. Monitored legislation to reauthorize the surface transportation reauthorization. Monitored legislation to curb distracted driving, including H.R. 3994, S. 1938, H.R. 3829, H.R. 3535 and S. 1536.}",
    "textBeforeTable": "",
    "textAfterTable": "State DC Zip Code 20005 Country USA 3. Principal place of business (if different than line 2) City   State   Zip Code   Country   4a. Contact Name b. Telephone Number c. E-mail  Mrs.  L. Ann Wilson  2023936362  awilson@mema.org 5. Senate ID#  26023-12 7. Client Name Self Check if client is a state or local government or",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}