{
    "relation": [
        [
            "Command",
            "clear eigrp service-family",
            "show eigrp service-family external-client",
            "show eigrp service-family ipv4 topology",
            "show eigrp service-family ipv6 topology",
            "show eigrp tech-support"
        ],
        [
            "Description",
            "Clears entries from the EIGRP neighbor table.",
            "Displays information about the EIGRP service-family external clients.",
            "Displays information from the EIGRP IPv4 service-family topology table.",
            "Displays information from the EIGRP IPv6 service-family topology table.",
            "Generates a report of all EIGRP-related information."
        ]
    ],
    "pageTitle": "Cisco IOS Service Advertisement Framework Command Reference - SAF Commands: send-lifetime through username SAF [Support] - Cisco",
    "title": "",
    "url": "http://www.cisco.com/c/en/us/td/docs/ios-xml/ios/saf/command/saf-cr-book/saf-s1.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438043062635.98/warc/CC-MAIN-20150728002422-00215-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 357680983,
    "recordOffset": 357639545,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{122942=(Optional) Displays detailed information about the specified service-instance number. Service-instance numbers display as service:subservice:instance.instance.instance.instance. Service-instance numbers can range from 1:1:0.0.0.1 to 65534:65534:FFFFFFFF.FFFFFFFF.FFFFFFFF.FFFFFFFE., 136827=1:2.0.0.0.3, 3608=The default start time and the earliest acceptable date is January 1, 1993., 44900=(Optional) Specifies a TCP or UDP port number. The range is 1024 to 65536. If the port keyword is not specified, the port number defaults to 4788., 5642=Forever (the starting time is January 1, 1993, and the ending time is infinite), 138462=(46251776/46226176), 31618=The TCP port number to listen on. Port numbers range between 1024 and 65536., 216931=(Optional) Handle of a single client to display. A handle is a number assigned dynamically by XMCP. The number range is 1 to 1023, and is displayed in the Handle field of the display., 11329=The following example configures a key chain named chain1 for EIGRP address-family. The key named key1 will be accepted from 1:30 p.m. to 3:30 p.m. and be sent from 2:00 p.m. to 3:00 p.m. The key named key2 will be accepted from 2:30 p.m. to 4:30 p.m. and be sent from 3:00 p.m. to 4:00 p.m. The overlap allows for migration of keys or a discrepancy in the set time of the router. There is a 30-minute leeway on each side to handle time differences., 9846=The following example configures a key chain named chain1. The key named key1 will be accepted from 1:30 p.m. to 3:30 p.m. and be sent from 2:00 p.m. to 3:00 p.m. The key named key2 will be accepted from 2:30 p.m. to 4:30 p.m. and be sent from 3:00 p.m. to 4:00 p.m. The overlap allows for migration of keys or a discrepancy in the set time of the router. There is a 30-minute leeway on each side to handle time differences.}",
    "textBeforeTable": "Related Commands Displays the EIGRP SNMP and SNMPv2 Agent Support version. snmp-agent Displays the EIGRP IPv6 service distribution feature version. ipv6-sf Displays the EIGRP IPv6 routing protocol feature version. ipv6-af Displays the EIGRP service distribution client support feature version. external-client Displays the EIGRP IPv4 service distribution feature version. ipv4-sf Displays the EIGRP IPv4 routing protocol feature version. ipv4-af Displays the EIGRP performance routing feature version. eigrp-pfr Displays the EIGRP multitopology routing (MTR) version. mtr Displays the EIGRP-BFD feature version.",
    "textAfterTable": "show eigrp protocols To display general information about Enhanced Interior Gateway Routing Protocol (EIGRP) protocols that are currently running, use the show eigrp protocols command in user EXEC or privileged EXEC mode. show eigrp protocols [ vrf vrf-name ] Syntax Description vrf vrf-name (Optional) Displays information about the specified VRF. Command Modes User EXEC (>) Privileged EXEC (#) Command History Release Modification 15.0(1)M This command was introduced.",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}