{
    "relation": [
        [
            "Size",
            "Chest",
            "Waist",
            "Height"
        ],
        [
            "S",
            "36\"-38\"",
            "28/30\"",
            "173"
        ],
        [
            "M",
            "39\"-41\"",
            "31/33\"",
            "178"
        ],
        [
            "L",
            "42\"-44\"",
            "34/36\"",
            "183"
        ],
        [
            "XL",
            "45\"-47\"",
            "37/39\"",
            "188"
        ]
    ],
    "pageTitle": "",
    "title": "",
    "url": "http://www.ebay.co.uk/itm/Nike-Mens-Fleece-Joggers-Black-Grey-Tracksuit-Jogging-Bottoms-S-M-L-XL-Pants-/291069907666?pt=UK_Women_s_Activewear&var=&hash=item43c51e52d2",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988840.31/warc/CC-MAIN-20150728002308-00068-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 424233903,
    "recordOffset": 424181750,
    "tableOrientation": "VERTICAL",
    "TableContextTimeStampAfterTable": "{88261=Product Code: 521871}",
    "textBeforeTable": "Men's clothing size chart. Product Code: 521871 79% cotton 21% polyester MORE INFORMATION Returns Delivery Size Guide More Details 79% cotton 21% polyester Fleece lining Ribbed elasticated ankles with adjustable zip Big embroidered retro Nike logo Two back pockets, Two side pockets Drawstring at waist Nike retro heavy fleece joggers features: of RRP 38% You Save 24.99 Our Price:",
    "textAfterTable": "All UK orders will be delivered by Royal Mail Monday to Saturday. You should expect your order to be arrive within 2-3 working days after placing your order. Please allow 10 working days from dispatch of your order before notifying us of any late deliveries. If your order is received before 4:45pm on Monday, Tuesday, Thursday, Friday & 12:00pm on Wednesday we can arrange for this to be sent on a next day service, subject to stock availability. Delivery charges for this service are available when using the eBay checkout. Please note this service is only available within the UK. All International orders are shipped on a express service with Royal Mail, please allow 5-7 working days for delivery. Please allow 15 working days from dispatch of your order before notifying us of any late deliveries. We want to make sure you are always happy when shopping with us. To ensure this, we offer a 14 Day Returns Guarantee. If the item does not fit or is unsuitable you can return it for a refund or exchange subject to stock availability. please review our returns policy below for more details.",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}