{
    "relation": [
        [
            "Argument",
            "host",
            "port",
            "user",
            "password"
        ],
        [
            "Definition",
            "Hostname of the Oracle WebLogic Server (for example, myhost).",
            "Port of the Oracle WebLogic Server (for example, 7001).",
            "User name for connecting to the running server to get MBean information (for example, weblogic).",
            "Password for the user name."
        ]
    ],
    "pageTitle": "Deploying SOA Composite Applications",
    "title": "",
    "url": "https://docs.oracle.com/cd/E17904_01/dev.1111/e10224/sca_lifecycle.htm",
    "hasHeader": true,
    "headerPosition": "MIXED",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988840.31/warc/CC-MAIN-20150728002308-00190-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 860968283,
    "recordOffset": 860927707,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{67465=For information about deploying SOA composite applications with task flows to multiple partition environments, see Section 41.7.1.2, \"What You May Need to Know About Deploying Human Task Composites with Task Flows to Partitions.\"}",
    "lastModified": "Wed, 13 May 2015 05:16:43 GMT",
    "textBeforeTable": "Table 41-26 ant SOA Composite Application Deployment List Commands Table 41-26 describes the syntax. Note: After specifying the user name, enter the password when prompted. -Duser=weblogic ant -f ant-sca-mgmt.xml listDeployedComposites -Dhost=myhost -Dport=8001  Example 41-31 Listing the Deployed SOA Composite Applications  Example 41-31 provides an example of listing the deployed SOA composite applications. 41.7.5.2.16 Listing the Deployed SOA Composite Applications          Optional. The name of the partition in which the SOA composite application is located. The default value is default. If you do not specify a partition, the default partition is searched for the SOA composite application. However, no other partitions are searched.   partition     Revision of the SOA composite application.   revision     Name of the SOA composite application.   compositeName     Password for the user name.   password     User name for connecting to the running server to get MBean information (for example, weblogic).   user",
    "textAfterTable": "41.7.5.2.17 Listing All Available Partitions in the SOA Infrastructure Example 41-32 provides the syntax for listing all available partitions in the SOA Infrastructure. Example 41-32 Listing All Available Partitions in the SOA Infrastructure  ant -f ant-sca-mgmt.xml listPartitions -Dhost=host -Dport=port -Duser=user Note: After specifying the user name, enter the password when prompted. Table 41-27 describes the syntax. Table 41-27 ant SOA Infrastructure Partitioning List Commands Argument Definition host Hostname of the Oracle WebLogic Server (for example, myhost). port Port of the Oracle WebLogic Server (for example, 7001). user User name for connecting to the running server to get MBean information (for example, weblogic). password Password for the user name. Example 41-33 provides an example of listing all available partitions",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}