{
    "relation": [
        [
            "Wed, 17 Nov 2010, 7:57am",
            "Noxukau1 Conqueror Registered: Dec, 2009 Last visit: Fri, 11 Nov 2011 Posts: 133",
            "Offline"
        ],
        [
            "#25",
            "becaus they deleted they to old Chars Spoiler: Server: Capricorn Noxukau lvl 19x Fire Noxuqueen lvl 19x Water Noxuking lvl 18x Wind COMPLETE QUEST LIST",
            "Link Post Topic (x)"
        ]
    ],
    "pageTitle": "EXP POTS AND CAPSULE'S quests - Wonderland Online Database",
    "title": "",
    "url": "http://wlodb.com/topics/794",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988840.31/warc/CC-MAIN-20150728002308-00282-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 262143979,
    "recordOffset": 262125240,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{17858=Nangonchon's fellow Target: 　 Condition: You must complete the quests of Crane Hunting and Assassins Plot Process: Enter the newly added teleport point in the scenario of Chang'an. Have a talk with Nangonchon who will ask you to help him find his fellas. You will enter another realm called Vale Lake via a teleport point and will bump into Lordling Zhan who is being attacked by Liyi. Enter the fight to help Lordling Zhan out. Liyi's Pawn: Earth, Level 85, 1234 HP Liyi's Pawn: Fire, Level 85 and 1085 HP Liyi's Pawn: Water, Level 90 and 1034 HP Liyi: Water, Level 120 and 13580 HP. Rewards: 2X EXP Potion *1 5% pet EXP Capsule *1 ------------------------------------------------------------------------------------------------, 8983=Process: A Dentist in Maya at (coordinates 2300,1500) says he needs a Silvery Ore, you will get a reward after finding it., 1899=Target: Villager(1380,2335), 5830=Process: 1. The map in Village Leader's House (X: 1242 Y: 755) 2. Talk with villager and help her to find her husband Elwes 3. Go to find Elwes at the Cook's ship (at the deck) and tell him his wife's words 4. Go back to meet the villager in the Holy Village Rewards: 1.5X EXP Potion *1 Jade Grass *1 ------------------------------------------------------------------------------------------------, 16372=No ink now! Target: Picture Vendor Condition: One Prepared Chinese Ink in inventory Process: Go talk to the Picture Vendor at the coordinates X:1022, Y:855 He will tell you he needs one Prepared Chinese Ink. Give him the Prepared Chinese Ink to complete the quest. Rewards: 2X EXP Potion *1 and Big Buns*20 ------------------------------------------------------------------------------------------------, 16867=Crane Hunting Target:　 Condition:　 Process: Read the news bulletin and learn the Emperor has been seriously ill, but is looking for Crane's blood to help him recover. Anyone who can help collect Crane's blood will be rewarded. Crane's coordinate: x:2222 y:2255 Click on the Crane and make a selection between saving its life or taking its blood. Save the crane's life: Combat Soldiers Take its blood: Rewarded with Bullion*2 Rewards: 2X EXP Potion *1 Secular Bird's Blood*1 ------------------------------------------------------------------------------------------------, 21100=Last edited Mon, 20 Dec 2010, 5:18pm, 14081=Process: You will find a cave at the coordinates X4982, Y1415. Enter the cave and combat the two Clay Generals and 6 Clay Soldiers Clay General: Earth, Level 120 and 17580 HP Clay General: Fire, Level 125 and 17150 HP Clay Soldiers*4 (Water, Fire, Earth and Wind): 900 HP. You must click on a treasure chest to activate the quest., 6698=Process: Player meets Sano and Takeyoshi in the forest of Japan (Coordinates:X1022,Y495) and knows the princess is caught by monsters, Takeyoshi was heavy injured. As a result, Sano and player fight with monster together., 12498=Fight No.2 Trados Monster: Wind, Level 140 and 32450 HP Immortal Mummy: Earth, Level 87 and 5350 HP (Terrafication mastery) Immortal Mummy: Fire, Level 87 and 5350 HP (Mess Spell mastery) Immortal Mummy: Water, Level 87 and 5350 HP (Recovery mastery) Immortal Mummy: Wind, Level 88 and 5350 HP (Coma Spell mastery)}",
    "textBeforeTable": "Link Post   Topic   (x) Offline y i cant see pictures? Posts: 168 Last visit: Mon, 13 Apr 2015 Registered: Oct, 2010 Conqueror Handsome97 #24 Wed, 17 Nov 2010, 2:29am Link Post   Topic   (x) Offline 183RB(Fire Killer) w/Fred -149RB 181RB(Water Wit) w/Fred-149RB 176RB(Fire Wit) w/Niss-140RB 171RB(Fire Killer)w/Fred-133RB 161RB(Earth Priest)w/Qlaya-125RB this part just wondering if the hp is error or else you'll be doing the quest for awhile. Rewards: 800 EXP gained and 1.5X EXP Potion Process: Have a talk with a Tea House Owner and then enter combat against two earth mobs with 107589 HP each and one fire mob with 104589 HP Condition: You must complete the quest of The Lost Buffalo Target: Tea House Owner The Bully gets what he deserves http://wl.igg.com/upload/200812/200812040350362... ------------------------------------------------------------------------------------------------",
    "textAfterTable": "Page 1 of 1 This Topic is Locked Login or Register to post a reply Home » Forum Topics » WLO Gameplay » Quests Online: fockerc, jesuswlo, reyddr Newest User: iLucko Powered by http://almosteffortless.com",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}