{
    "relation": [
        [
            "Categories",
            "Campus Safety",
            "Greek Life",
            "Clubs and Activities",
            "Great for these types of students",
            "Share any unusual traditions or locations on campus",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "The campus is relatively safe for where it is situated. Like almost all colleges there are emergency stations where you can immediately call for help, though it is not recommended that you stay in the same spot. In addition to that, there is an escort service where you can call someone to escort you around campus if you do not feel safe. They even escort during the night! My friend is a part of the escort service and he does a great job.",
            "I haven't explored much of the Greek Life, but according to my friend, it's quite an experience. It is something you really need to try out during the Rush. This is one of those things where it is you, or it is not so make sure it's what you really want.",
            "The clubs are great, i've associated myself with quite the many at the beginning of the year, but it eventually whittled down to one. I've become an officer in the club and there are many things that go on from community service, to social events on campus!",
            "All types, I don't know what type of student won't have fun here. Even if you're not the social type it's hard to NOT fit in, imagine that!",
            "2011-2012 school year we burned UC Irvine's mascot, the Anteater. That was really amusing and a great experience. We had fireworks shoot out from the buildings' rooftops to give a spectacular show.",
            "There are many events going on around the campus year long. You will only have as much fun as you so choose to partake in them. Join a club, join a frat, go to the gym at the Rec Center, there are many things to do on campus. Grabbing some coffee with a date at Coffee Bean is nice too!",
            "The food is mediocre, it can be better. They are good some times but that is giving it a bit too much credit.",
            "Oh man, it is great. The perks about living on campus in the dorms your first year or two is getting to know a lot of people. You are thrown in to the social aspect of college immediately and the structure of the dorms allow it to happen. The school did a great job in building dorms where interactions is inevitable.",
            "In reality the academics will be as rigorous as you want it to be or how you consequent yourself from a lack of. Be smart about the courses you choose, know how much you can handle. Sun Tzu wrote in his Art of War, If you know your enemies and know yourself, you will not be imperiled in a hundred battles... This can be applied to your work ethic as well.",
            "Be smart about the time you use during your first year in college. It is extremely important and I stress its importance. I speak to you as a fellow student, the first year can really bring your GPA to the highest of your four years and help you maintain that average. Remember though, balance out your general ed courses with upper division courses to curb the stress.",
            "The campus provides a calm, almost serene environment for social interactions and academic studies. Students are seen every day studying outside, be it on the grass, the Bell tower, or the chairs provided by the school itself. The school has done a great job in creating the perfect environment for students to explore the campus socially and academically."
        ]
    ],
    "pageTitle": "University of California-Riverside (UC Riverside) Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/University-of-California-Riverside/reviews?_escaped_fragment_=/show/100750",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 125,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438043062635.98/warc/CC-MAIN-20150728002422-00226-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 901263527,
    "recordOffset": 901071076,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{340262=There's not much to do if you don't have a car. Most students just go out to eat because Riverside has some great food places...EVERYWHERE. The city has a diverse selection of foods from American food, to Thai food, Indian food, Vietnamese food, etc and Asahi which is one of the most delicious All-You-Can-Eat restaurants around. May I add that these places are legit and not Americanized. Since it's really hot you can go swimming all the time. Some people hike the C which is a C on the top of a mountain. You can join clubs like Surf Club (they take you surfing) or outdoor excursions (they take you on countless trips). A lot of people also spend time at the gym playing intramurals., 473889=There's not too many unusual traditions I know of besides the school priding itself of its Scottish heritage through an occasional bagpipe practice every now and then, that can be heard from the residence halls. Our concerts held every school quarter have been traditions for many years, welcoming notable artists such as J.Cole, Lupe Fiasco, Nas, Mac Miller, Karmin, The Roots, Common, Kendrick Lamar, Chiddy Bang, Dev & The Cataracs, and more who have blessed UCR with their presence at some point in time. Being that our Botanical Garden is apart of the UCR campus, its not too unusual of a place, but definitely one that's uniquely beautiful., 686211=There has been a string of robberies on and near campus since January of 2013 . Students have been targeted for technology. Lap tops, I-Pads, and Smart Phones have been taken by force. The school has been scrutinized in the local newspaper as well a TV news cast. Escort services are available 24/7. The campus appears to be safe and tranquil, but I would not suggest walking in the surrounding community after dark alone. In all fairness, I would not walk around the part of Riverside I live in after dark alone either., 932456=Taking AP classes in high school and don't get lower than a B and you will have the GPA you need. Assuming of course that you absolutely do not fail any classes. From there, take the SAT or ACT a couple times and try to get above 1750 and you will be good to go., 691643=Admissions office considers the entire package- strength of transcript, SAT and SAT subject exam scores, and extracurriuluars all play a role in the decision making process. UCR had over 40,000 students apply for admission for the fall of 2013. For many students, UCR is a first choice rather than a backup school., 657457=Some days are better than others. Sometimes they have themes such a Cajun night or Thanksgiving Dinner and those nights the food is amazing. I personally liked the Dining Halls and as a student who no longer lives on campus I miss them., 513159=Lothian resident, Nicer than A-I, Pentland Hill is really nice but expensive. People at AI are more down to earth at least when I went there. Lothian people tend to be a bit clicky. Still both are expensive because of meal plan. May find a better deal off campus., 877551=They have limited greek life and the sororities/fraternities they do have are mostly community service based. On the up side, this means they cost only about 40 to 50 dollars a year instead of $2000 a quarter., 518259=2011-2012 school year we burned UC Irvine's mascot, the Anteater. That was really amusing and a great experience. We had fireworks shoot out from the buildings' rooftops to give a spectacular show., 1088951=© 2015, Cappex.com, LLC}",
    "textBeforeTable": "12/19/2009 Reviewer is A current student here. 31 out of 31 people found this review useful. 1 of 258 Kimberley from Tracy, CA Check out reviews left by other students or leave your own review. You could win a free scholarship. University of California-Riverside Reviews University of California-Riverside › California › By State › Colleges › } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.create', -->",
    "textAfterTable": "Am enjoying being here Living in the dorms and meeting new people make it a great experience to be in UCR. I like it because you are able to interact with many people and try out different organizations. At the same time, explore new classes and meet new professors. I enjoy being in UCR, because this school has a lot of diversity and school spirit. And it is a great learning environment. And at night you can see the beautiful stars in the sky! Am learning a lot In transitioning from high school to college/university, UCR helps students to be able to learn new subjects as well new skills. At the same time, students would be able to meet new people and become more confident in their environment. You can learn a lot from people's perspectives about different things as well your surroundings. You learn to become independent and responsible over time. Login to rate or flag the reviews Matthew from Pasadena, CA 08/25/2009 Reviewer is A current student here. 14 out of 14 people found this review useful. 3 of 258",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}