{
    "relation": [
        [
            "No.",
            "EAST SIDE, WARD No. 8.",
            "2",
            "4",
            "6",
            "8",
            "10",
            "12"
        ],
        [
            "BRICK.",
            "",
            "",
            "",
            "",
            "",
            "",
            ""
        ],
        [
            "WOOD.",
            "",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1"
        ],
        [
            "OWNERS.",
            "",
            "Allen W. Muckenfuss.",
            "John McC. R. Mood.",
            "Henry Stender.",
            "James Copes.",
            "William Lloyd.",
            "John Tolle."
        ],
        [
            "OCCUPANTS.",
            "",
            "Allen W. Muckenfuss.",
            "Henry James Rane.",
            "Henry Buleken.",
            "Slaves.",
            "William Lloyd.",
            "John Tolle."
        ]
    ],
    "pageTitle": "Charleston (S.C.). City Council. Census of the City of Charleston, South Carolina, for the Year 1861. Illustrated by Statistical Tables.",
    "title": "",
    "url": "http://docsouth.unc.edu/imls/census/census.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 225,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438043062635.98/warc/CC-MAIN-20150728002422-00116-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 69591979,
    "recordOffset": 69436012,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{4647=        The electronic edition is a part of the UNC-CH digitization project, Documenting the American South.         The text has been encoded using the recommendations for Level 4 of the TEI in Libraries Guidelines.         Original grammar, punctuation, and spelling have been preserved. Encountered typographical errors have been preserved.         Any hyphens occurring in line breaks have been removed, and the trailing part of a word has been joined to the preceding line.         All quotation marks, em dashes and ampersand have been transcribed as entity references.         All double right and left quotation marks are encoded as \" and \" respectively.         All em dashes are encoded as --         Indentation in lines has not been preserved.         Running titles have not been preserved.         Spell-check and verification made against printed text using Author/Editor (SoftQuad) and Microsoft Word spell check programs., 1495703=        The calorific power of the sun, dependent upon altitude in our hemisphere, is greatest at 12 o'clock on the twenty-second of June, and least on the twenty-second of December. On the twenty-second of June, the northern hemisphere would thus, at first sight, seem to have attained its maximum heat, and the temperature of the earth might be supposed to decrease regularly toward the poles. It is found, nevertheless, that the highest heat is reached, at all latitudes, about the end of July or beginning of August, and at that time the temperature, instead of diminishing from the equator toward the pole, actually varies in the opposite direction--the pole being considerably hotter than the equator itself. This singular effect is owing to the sphericity of the earth, and is due to the accumulation of heat. If the earth suddenly ceased to turn upon its axis, a universal conflagration would soon rage upon its illuminated surface, and the ocean would be turned into solid ice upon the other, or dark one. By revolution, the earth's surface successively receives heat, and allows it, at night, to pass off into space. In summer, heat is gradually accumulated, and in winter gradually dissipated. The heat of the earth's surface is consequently determined by the duration of the sun's action, and is measured by the number of hours of sunshine in a day or season, diminished by an opposing number of hours of darkness. The hottest period of the, 1519249=days, and from the records of twenty-five successive years, 1832-1857--in days., 11900=MAY 15, 1861., 16792=Charleston, September 20, 1861., 8704=        Resolved, That the Memorial be referred to a committee of three, who shall recommend to Council proper persons to take a complete Census of the City, together with such statistical information as may be necessary to exhibit the condition and prospects of the City, to superintend the management and publication of the same, and to apportion to the several Wards their representation in Council, in conformity to the Act of the General Assembly, passed June 1st, 1838., 1522543=        August is the least cloudy month of the year; and since it is also the least fair, more rainy days occur in this month than in any other; in August, rain almost always falls upon a cloudy day. Fairness inducing a notable augmentation in the proper temperature of a month, the remarkable fairness of October, with us, explains that gentle diminution of the heat which is frequently perceptible, 1520143=        October is our fairest month; August the least fair of the summer months. We also present a table in which the moiety of the cloudy days is not added to the sum of the fair days, that their influence may be separately observed., 1523047=only in the increasing coolness of the nights. The mean fairness, it will be perceived from the foregoing tables, regularly increases, if the mean be deduced from a series of years, from July until November. The regular fall of temperature, dependent upon increased length of the nights, is thereby counterbalanced, to a certain extent, and the real temperature remains for a long time stationary, or sinks slowly. This law belongs, however, to the mean of many years, each season exhibiting a progression which varies more or less according to the power of collateral agencies. In certain years the fairness regularly increases, the season is retarded, the mean temperature sinks gradually, and frost falls late. At other times the progression is stationary, or even reverse, the season is interrupted, or may become more and more unfair, the mean temperature will fall quickly or even suddenly, and frost may be looked for early. Thus, in 1854, the number of fair days successively increased in August, September and October, and the temperature, therefore, continued above its mean., 1500143=accomplished is sooner done; the season of growth and reproduction is shorter, and, by compensation, more intense. At Bogota, 4° 35' N. L., the difference of temperature between the hottest and coldest month is only 3° Fahr.; in the City of Mexico (19° 25' N. L.) this difference is 14°; in Paris (48° 50') it is 48°; and, in St. Petersburg, 57°. As we progress northward or southward, the difference between the extreme length of the days and the extreme temperatures of summer and winter regularly increase--little such variation occurring at the equator. In the United States, about the middle of July, the temperature of the Cities of New York and Boston, and, in Canada, of Quebec and Montreal, is greater than that of Charleston or of the equator., 1491712=        On account of the ellipticity of its orbit, the earth is three millions of miles nearer the sun on the first of January, or thereabout, than on the first of July. The increased amount of heat received, due to this approach, according to Sir John Herschell, is no less than one-fifteenth of the whole mean temperature; this fraction being added to the heat of winter, in the northern hemisphere, but substracted from that of summer; and conversely for the southern, 3562=Text scanned (OCR) by Apex Data Services, Inc. Images scanned by Bryan Sinche Text encoded by Lee Ann Morawski and Jill Kuhn Sexton First edition, 2000 ca. 1.3MB Academic Affairs Library, UNC-CH University of North Carolina at Chapel Hill, 2000., 13196=        The Special Census Committee, empowered by resolution of Council, to have the census taken, and the proper representation in Council apportioned according to the Act of the General Assembly, passed June 1st, 1838, beg leave, respectfully, to report: That in obedience to the resolution referred to, your Committee engaged Frederick A. Ford, Esq., for the purpose, who immediately commenced the work, under the plan agreed upon, and having now finished his labors, has delivered the same in manuscript, ready for publication., 21280=        In the report made to the City Council of the Census taken in 1848, the population of the city, as it appears by the United States Census, is brought down to the year 1840. The population as returned for the years 1850 and 1860 (the subsequent decades) appears by the following Tables obtained from the office of the Marshal of the Confederate States for the District of South Carolina, the Census of 1850 having been taken previous to the annexation of the neck to the city, and the Census of 1860 after the annexation., 1514427=        It will be observed that the temperature begins to rise in February, reaches its highest point in July, descends slowly in the two following months, but rapidly in the latter part of October; the coldest and hottest months being those which follow the solstices. The march of the temperature is well exhibited by an iconographic table and curve based upon the preceding data. The mean temperature of the City of Charleston for the whole year, from the above table, is 65.93; that of Charleston harbor (lat. 32° 42'), (Tuomey's Geo. Rep.), 64.31; of Madeira in about the same latitude (32° 37'), 64.56; of Rome (lat. 41° 54'), 60.70; of Paris (lat. 48° 50'), 51.50; and of Augusta, in the State of Georgia (lat. 33° 28'), 65.24., 1500945=        After the summer solstice, although the days are shortening in consequence of the sun's recession, their diminution is for some time scarcely perceptible, and as the days are still much longer than the nights, more heat is imparted to the earth than is lost by night-radiation. The temperature thus continues to rise; the augmentation ceasing as soon as the quantity of heat gained is entirely given off during a longer night, when the acme of temperature is reached, and the earth soon begins to cool. Conversely, the earth does not attain its lowest temperature until a corresponding period after the winter solstice, when the sun has for some time been again advancing toward the pole. The greatest heat is reached in Charleston about the end of July, the thermometer then showing 81° as the mean for a series of years; at the same time the temperature of Jacksonville, Florida, is 88° 5'; of Philadelphia, 90° 4'; of the upper part of Newfoundland, 89° 5'; of the southernmost point of Greenland, 88° 4'; at Baffins Bay, 90° 8'; and at the pole, by calculation, 96°; while at the equator, it is as low as 72°., 4154=Source Description: (title page) Census of the City of Charleston, South Carolina, For the Year 1861. Illustrated by Statistical Tables. Prepared under the Authority of the City Council by Frederick A. Ford Frederick A. Ford 271 p. Charleston Steam-Power Presses of Evans & Cogswell 1861 Call number 2135 Conf. (Rare Book Collection, University of North Carolina at Chapel Hill), 9886=        Your committee contemplated adopting the plan of dividing the City in sections or squares, and availing themselves of the services of such of our citizens (many of whom kindly offered) who would be willing to take the census of the square or block in which they reside; and in this way it was thought an accurate result would be obtained, and at much saving of expense to the City. But we find, on reflection, that whilst this plan has its advantages, it is not certain that it may not cause delay, and in the result disappoint our expectations, as we would have necessarily to engage the services of some competent person in the end, to compile and arrange the publication of the several returns made under this plan. We have, therefore, deemed it best that this system should not be adopted, but that the work be placed under the supervision of a competent person, to prepare and compile an accurate Census of the City, with such statistical information as, we trust, will meet the wants of the community, and to apportion to the several Wards their proper representation in Council, in conformity to the Act of the General Assembly, passed June 1st, 1838. And in order to ensure this result, your committee recommend that authority be given them to engage the services of Mr. FREDERICK A. FORD, at the sum stated in his communication to the Committee, feeling assured he is fully competent to accomplish the work satisfactorily, which your committee are sanguine will result in exhibiting an increase in population, enterprise and growth, in all the essentials that make up a flourishing community., 1521409=        As by the preceding table, October is the fairest month, and August the least fair of the Summer months. We also present:, 18381=the Census taken in 1848, that Ward has become entitled to one additional Alderman, and Ward No. 2 loses one--the other Lower Wards retain their present representation; and Wards No. 5 and 6, by increase of population and taxation, have each become entitled to one additional Alderman. The number, therefore, of Aldermen for the ensuing ten years will be eighteen instead of sixteen, the present number., 1520431=        A TABLE showing the mean number of fair days in each month, computed from twenty-five successive years, 1832-1857--in days., 1524849=        While in 1853 the fair days did not increase toward the end of the season, and the temperature was lower than the serial mean.}",
    "textBeforeTable": "A TABLE, SHOWING THE CONSTRUCTION OF THE CITY.          CENSUS OF CHARLESTON. Page 7 FREDERICK A. FORD. Respectfully, etc.,         I have made out a set of Tables, shewing the construction of the city, the population, with ages and nativity of the whites, and number and ages of the slaves and free persons of color--the population of each street in the city separately, and the present owners and occupants of every house. These tables, with my calculation of the representation in Council, to which the different Wards are entitled, are herewith submitted. the Census taken in 1848, that Ward has become entitled to one additional Alderman, and Ward No. 2 loses one--the other Lower Wards retain their present representation; and Wards No. 5 and 6, by increase of population and taxation, have each become entitled to one additional Alderman. The number, therefore, of Aldermen for the ensuing ten years will be eighteen instead of sixteen, the present number. Page 6         GENTS--Having completed the taking and arrangement of the Decennial Census of the City, I beg leave to report, briefly, that I find the population to be 48,409--a considerable increase over any number heretofore returned. With a view to accuracy, before I commenced my arrangements your opinions as to the principle upon which an enumeration of the houses of the city should be had were requested. The principle prescribed by you",
    "textAfterTable": "No. 8 10 741 751 470 Total. 2,179 4,513 6,692 1,205 Page 8         In the report made to the City Council of the Census taken in 1848, the population of the city, as it appears by the United States Census, is brought down to the year 1840. The population as returned for the years 1850 and 1860 (the subsequent decades) appears by the following Tables obtained from the office of the Marshal of the Confederate States for the District of South Carolina, the Census of 1850 having been taken previous to the annexation of the neck to the city, and the Census of 1860 after the annexation.          UNITED STATES CENSUS, 1850. WARDS. WHITES. SLAVES. FREE PERSONS OF COLOR. TOTAL. Ward 1 2,807 2,446 165 5,418 Ward 2 2,750 3,209 319 6,278 Ward 3 4,386 3,241 518 8,145 Ward 4 5,499 5,796 997 12,292   15,442 14,692",
    "hasKeyColumn": true,
    "keyColumnIndex": 4,
    "headerRowIndex": 0
}