{
    "relation": [
        [
            "Site",
            "NY Botanical Garden",
            "IS 52a",
            "PS 274",
            "Queens College",
            "Madison Avenue",
            "Fresh Kills West",
            "La Tourette",
            "Troy",
            "Whiteface Base Lodge",
            "Rochestera",
            "Niagara Falls",
            "Lakawana",
            "Tonawanda II",
            "Grand Island Blvdb"
        ],
        [
            "County",
            "Bronx",
            "Bronx",
            "Kings",
            "Queens",
            "New York",
            "Richmond",
            "Richmond",
            "Rensselaer",
            "Essex",
            "Monroe",
            "Niagara",
            "Erie",
            "Erie",
            "Erie"
        ],
        [
            "MSA",
            "New York-White Plains",
            "New York-White Plains",
            "New York-White Plains",
            "New York-White Plains",
            "New York-White Plains",
            "New York-White Plains",
            "New York-White Plains",
            "Albany-Schenectady-Troy",
            "Essex County",
            "Rochester",
            "Buffalo-Niagara Falls",
            "Buffalo-Niagara Falls",
            "Buffalo-Niagara Falls",
            "Buffalo-Niagara Falls"
        ],
        [
            "Toxics",
            "x",
            "x",
            "x",
            "x",
            "",
            "x",
            "x",
            "x",
            "x",
            "x",
            "x",
            "x",
            "x",
            "x"
        ],
        [
            "Carbonyls",
            "x",
            "x",
            "",
            "x",
            "x",
            "x",
            "xxxxxxxx",
            "",
            "x",
            "x",
            "",
            "",
            "x",
            "x"
        ]
    ],
    "pageTitle": "NYS Ambient Air Monitoring Program Network Assessment (May 2010) - NYS Dept. of Environmental Conservation",
    "title": "Table 23. Site Location Listing of Toxics Monitors",
    "url": "http://www.dec.ny.gov/chemical/65574.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988840.31/warc/CC-MAIN-20150728002308-00150-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 390956887,
    "recordOffset": 390903973,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{37025=In November 2009 EPA proposed to revise the primary SO2 standard to a level of between 50 and 100 parts per billion (ppb) measured over 1-hour. The existing primary standards are 140 ppb measured over 24-hours, and 30 ppb measured over an entire year. This rule is expected to be finalized in June 2010. Monitoring and reporting requirements will be added. Prior to this rule only NCore sites are required to include SO2 monitoring. Under the proposed rule a minimum of thirteen sites will be required across the State to be operational by January 2013., 109370=Weather data, including back trajectory plots, were examined for the dates of all exceedances of the ozone NAAQS for 2007-2009. The predominant wind direction on the exceedance days was southwesterly, though there were also a small number of exceedances on days with winds from the northwest or northeast. Exceedances were somewhat more common (7 vs. 9) at Amherst than at Middleport, probably a reflection of Amherst's location just downwind of the urban core (on southwesterly winds)., 81879=Table 12 below lists each FRM site, county, and the attainment status designated by EPA based on data from 2006-2008, against the 24-hr standard of 35µg/m3, as well as the 2007-2009 design values. As mentioned above, only the FRM data are used for attainment determination. The continuous PM2.5 network complements the FRM network and provides data for AIRNow and AQI forecasting. Location maps of PM2.5 FRM and TEOM monitors are shown in Figures 11 and 12, respectively., 108286=Watertown weather data were looked at for the dates of the six ozone exceedances at the Perch River monitor between 2007 and 2009. On five of the six days, SW to WSW winds prevailed. The exception was 19 April 2008, when stations throughout western New York saw high ozone on N to NE winds., 5290=New York monitors and tests for acid deposition through the New York State Acid Deposition Monitoring Network, which was designed in 1985 to carry out requirements of the State Acid Deposition Control Act (SADCA). Measurements of acid deposition and related quantities are used to assess the effectiveness of sulfur control policy and other strategies aimed at reducing the effects of acid rain. Federal and State programs were implemented in recent years to further control emissions contributing to acid deposition. These include the NOx and SO2 Budget Trading Programs, and the Clean Air Interstate Rule (CAIR) Trading Programs. The monitoring network consists of 20 sites located throughout the state, as shown in Table 24 and Figure 33., 154168=The Division of Air Resources, New York State Department of Environmental Conservation (NYSDEC) operates 76 monitoring sites statewide for the measurement of criteria and non-criteria contaminants. A site map depicting monitor locations is shown in Figure 1 below. The continuous monitoring network comprises of 33 ozone (O3), 23 sulfur dioxide (SO2), 7 oxides of nitrogen (NOx), 9 carbon monoxide (CO), 28 continuous PM2.5 (TEOM), 3 PM10 (TEOM), 2 speciated carbon, 2 black carbon (aethalometer), 2 speciated mercury, 4 particulate sulfate, 5 total hydrocarbon monitors, 1 size distribution ultrafine particle counter, and 23 meteorological data stations. In addition, there are manual sampling networks in place for the measurement of PM2.5 (24 FRM, 8 Speciation), toxics (13 VOCs, 10 carbonyls, 2 PAHs), lead (3), PM10 metals (2), and acid deposition (20). New York's ambient air monitoring program is one of the most robust and comprehensive operations in the country. Detailed information about the monitoring networks is provided in the 2010 AMNP., 35582=The major sources of lead emissions have historically been from fuels in motor vehicles (such as cars and trucks) and industrial sources. Emissions from on-road vehicles decreased 99% between 1970 and 1995 due primarily to the use of unleaded gasoline. Use of leaded gasoline in highway vehicles was prohibited on December 31, 1995. The major sources of lead emissions to the air today are ore and metals processing and leaded aviation gasoline (lead is no longer used in motor vehicle fuel). An annual trend plot of the statewide lead levels is presented in Figure 27 below. The quarterly average standard of 1.5µg/m3, which was replaced in 2008 by the more stringent 3-month rolling average of 0.15µg/m3, is shown on the graph for historic reference., 112267=Weather data were examined for the dates of all ozone NAAQS exceedances in the NYC area for 2007-2009. The data showed the patterns that have come to be recognized over the years as being conducive to high ozone. Local wind circulation patterns, particularly those related to sea breezes, show influences on the timing and location of high ozone within the metro area. Seasonal and day-to-day differences in these circulations cause the highest ozone levels to occur in different places within the area on different days. In the spring and early summer when sea-breeze circulations are the strongest, they often push the polluted air completely out of NYC proper by late afternoon, and the highest ozone levels occur at White Plains. On midsummer days, it is common to see a sea-breeze circulation from Long Island Sound competing with one from the ocean waters, which may concentrate pollutants in various locations around the NYC area. It appears that most of the variability in ozone levels within the metro area is explained by mesoscale, rather than microscale, wind patterns. The monitoring network currently in place is deemed sufficient to give the air quality forecasters a reasonably good idea of what is happening on a mesoscale level., 116728=Based on 3 years of monitoring data ending December 2008, EPA designated 10 counties in New York State as nonattainment areas (Table 7). Figure 5 depicts the nonattainment counties and the population affected (12.2 million)., 121126=(1) Not to be exceeded more than once per year. (2) Effective 1/12/2009, replaces the previous quarterly average value of 1.5µg/m3. (3) To attain this standard, the 3-year average of the 98th percentile of the daily maximum 1-hour average at each monitor within an area must not exceed 0.100 ppm (effective January 22, 2010). (4) Not to be exceeded more than once per year on average over 3 years. (5) To attain this standard, the 3-year average of the weighted annual mean PM2.5 concentrations from single or multiple community-oriented monitors must not exceed 15.0 µg/m3. (6) To attain this standard, the 3-year average of the 98th percentile of 24-hour concentrations at each population-oriented monitor within an area must not exceed 35µg/m3 (effective December 17, 2006). (7) To attain this standard, the 3-year average of the fourth-highest daily maximum 8-hour average ozone concentrations measured at each monitor within an area over each year must not exceed 0.075 ppm (effective May 27, 2008). (8) (a) To attain this standard, the 3-year average of the fourth-highest daily maximum 8-hour average ozone concentrations measured at each monitor within an area over each year must not exceed 0.08 ppm. (b) The 1997 standard-and the implementation rules for that standard-will remain in place for implementation purposes as EPA undertakes rulemaking to address the transition from the 1997 ozone standard to the 2008 ozone standard. (c) EPA is in the process of reconsidering these standards (set in March 2008). (9) (a) The standard is attained when the expected number of days per calendar year with maximum hourly average concentrations above 0.12 ppm is < 1. (b) As of June 15, 2005 EPA revoked the 1-hour ozone standard in all areas except the 8-hour ozone nonattainment Early Action Compact (EAC) Areas., 96918=The difference between 2005 and 2002 is tabulated below., 49040=A historic trend of the statewide nitrogen dioxide annual levels is presented in Figure 21 below. The annual NAAQS for NOx is set at 0.053 ppm. This past January EPA revised the NAAQS to include an hourly standard of 0.100 ppm., 82538=A historic trend of the statewide annual PM2.5 levels is presented in Figure 10 below. The annual NAAQS for PM2.5 is set at 15µg/m3. Based on the most current three consecutive years of monitoring data 2007-2009, it appears that all areas in the State are in attainment status., 15873=All remaining monitoring requirements are scheduled to be implemented before the start date of January 2011., 36393=In November 2008 EPA revised the NAAQS for lead from the previous quarterly average of 1.5µg/m3 to the more protective 3-month rolling average of 0.15µg/m3. As part of the lead monitoring requirements, monitoring agencies are required to monitor ambient air near lead sources which are expected to or have been shown to have a potential to contribute to a 3-month average lead concentration in ambient air in excess of the level of the NAAQS. At a minimum, monitoring agencies must monitor near lead sources that emit 1.0 ton per year (tpy) or more. Monitoring is also required in each CBSA with a population equal to or greater than 500,000 people as determined by the latest available census figures. In December 2009 EPA proposed changes to these requirements., 59632=PM2.5 mass in NYC shows a seasonal trend with highest values in summer and a secondary maximum in winter as shown in the mean monthly concentrations from 2003-2009 for the South Bronx site (Figure 16). Speciation trends data which provides measurements of the components of PM2.5 can be used to understand the temporal patterns in PM2.5 mass., 110977=Weather data were examined for the dates of all exceedances of the ozone NAAQS for 2007-2009 (the NAAQS was 85 ppb in 2007, 75 ppb in 2008-2009). In almost all of the cases, winds at Albany airport were predominantly out of the south during the afternoon/early evening periods. In some of these cases the general weather pattern was conducive to southwesterly winds, but due to the local topography the surface winds in those cases usually turn out to be southerly. Morning winds were sometimes light and variable, though usually had a southerly component. In one instance a cold front passed through during the afternoon, bringing a shift to moderate NW winds, but not in time to prevent an exceedance. Back trajectory plots for many of the exceedance dates were also examined. The source areas (as indicated by back trajectory plots) were variable, but often included either parts of the NYC metro area or Connecticut. Overall, it appears that local emissions in the Albany area are the primary driver for the ozone exceedances, but emissions from the NYC and Connecticut areas often contribute as well. Since winds are predominantly from the S to SW on the warm days that are conducive to ozone formation, the highest ozone readings are often seen to the north and east of the core of the metro area, i.e. at Grafton Lakes and Stillwater. Exceedances are far less common at the Schenectady monitor, which is normally upstream of most of the metro area during high ozone events. This shows the strong influence of local emissions on ozone levels., 90466=A proposed monitoring rule is currently undergoing review by the Office of Management and Budget (OMB) that have additional monitoring requirements to ensure that the ozone network was adequate in light of the 2008 revised standards., 52472=NYSDEC first began ultrafine particulate monitoring with the deployment of a TSI Model 3031 Ultrafine Particle Monitor (UPM) at Queens College in June of 2009. This instrument provides continuous measurements of size distribution and particle number concentrations of fine particles below1 micron, in the range from to 20 to 500 nanometers. The Queens College NCore site was selected for the UPM so as to complement a suite of parameters already being measured there. Concurrently a demo UPM unit on loan for one year from the manufacturer was installed at the Eisenhower Park location in Nassau County, which is expected to have a significant impact from mobile sources. Preliminary data suggest that the ultrafine particles are to a large extent regional in nature and less impacted by local mobile sources. The particle counts and size distributions for the two sites are similar, and also track the PM2.5 profile in some cases. It is possible that the mobile signal is damped out due to the siting of the monitor, as the inlet probe height may not be optimal and there may be interference from nearby trees. In addition, a resource recovery facility located about ¼ mile west of the site, as well as other local sources (wood-fired pizza ovens, etc.) may influence the measurements. Alternate explanations may be that mobile ultrafine emissions are predominantly smaller than the 20 nanometer cut-off point or affect the measurements only on a short time scale. Data on particle size distribution and concentration will provide valuable information for the understanding of PM2.5 formation mechanisms, as well as source apportionment determination., 46693=Under the new NOx rule that became effective January 22, 2010 each MSA with population larger than 500,000 will be required to operate a near-road monitor beginning in 2013. New York State will need to establish such a site in each of the following areas: Albany-Schenectady-Troy, Buffalo-Niagara Falls, Poughkeepsie-Newburgh-Middletown, Nassau-Suffolk, New York-White Plains, Rochester and Syracuse. One urban community wide monitor will be located in each of the three MSAs with population greater than 1 million: New York, Buffalo and Rochester. Furthermore, the Regional Administrators at their discretion, have the authority to require 40 additional sites nationwide in communities where susceptible and vulnerable populations are located. Therefore, relocation of some current monitors will most likely take place in addition to the establishment of new near-road monitors., 11687=Prior to the establishment of the NATTS network, NYSDEC began a statewide toxics monitoring network back in 1990. Currently we monitor toxics (TO-15) at 13 sites and carbonyls at ten sites. Sample analysis is conducted by in-house laboratory staff, whose superb performance was well demonstrated in the recently completed School Air Toxics/Acrolein Study (see Special Purpose Monitors section below)., 150555=The 2000 Census lists the state population for New York as 18,976,457. According to Census Bureau estimates the NY state population in 2009 totaled 19,541,453, the third most populous state in the nation. The population change in the previous 5 year period indicates a net increase of 243,520 for the entire State, with a net migration loss of 508,013 individuals. A Census Bureau estimated population breakdown of major Metropolitan Statistical Areas (MSAs) is provided in Table 1 below. The State saw a modest growth overall in the 5-year period, mostly in the downstate areas at the expense of the western MSAs., 147157=A population density map by county based on the 2008 estimated data is depicted in Figure 2., 103398=Tables 8 through 10 below are compiled from EPA's National Emission Inventory database showing emissions for various pollutants in New York and upwind states. The inventory is updated every three years. The 2008 database is still under preparation. Here PMcon and VOC denote condensable particulate matter and volatile organic compounds, respectively., 155115=The U.S. Environmental Protection Agency (EPA) finalized Revisions to Ambient Air Monitoring Regulations Parts 53 and Part 58 on October 17, 2006. As required by §58.10(d), \"the State, or where applicable local, agency shall perform and submit to the EPA Regional Administrator an assessment of the air quality surveillance system every 5 years to determine, at a minimum, if the network meets the monitoring objectives defined in appendix D to this Part, whether new sites are needed, whether existing sites are no longer needed and can be terminated, and whether new technologies are appropriate for incorporation into the ambient air monitoring network.\" The first assessment is due July 1, 2010. This Network Assessment (NA) document is prepared and submitted along with the 2010 Annual Monitoring Network Plan (AMNP) to fulfill these new requirements., 70387=The NYSDEC is still committed to the goal of using continuous PM instruments in place of manual instruments to the extent possible. The benefits of the continuous instruments include the nearly instantaneous availability of the data for health messaging, the hourly frequency of the data which can be used for short term health assessments and for source apportionment and the reduced labor and costs associated with operations and maintenance. The NYSDEC is currently evaluating 3 FEMs and a candidate FEM in comparison to the filter based FRM at a location in NYC. The results of this 8 month comparison will be used to help inform the Department's decisions regarding monitor selection in the future. In the meantime, the NYSDEC has decided to utilize 1405 DFs at the three NCore monitoring locations. These FEMs were selected because they can provide the required PM2.5, PM10 and PMc data for these sites., 83368=The current network has 35 monitors sited at various locations statewide in order to meet the monitoring objectives specified in appendix D to Part 58. However, the proposed lowering of the standards due to be finalized this August will certainly require additional monitoring (see section on New and Proposed Rules). Furthermore, concerned citizen groups continue to apply political pressure and petition for the establishment of new sites, even though ozone has been demonstrated to be a regional pollutant. An example is the Rockland site, which became a permanent addition to the network in spite of three seasons of temporary measurements showing the area to experience the same air mass as surrounding counties with existing monitors., 56059=Long term measurements are also important to determine trends. For example the annual average PM2.5 mass in the South Bronx was approximately 25% lower in 2009 compared to the average from 2002-2007. Aerosol SO4 was 15% lower in 2008 and 35% lower in 2009 than the average from 2002-2007 with summer sulfate approximately 50% in 2009 than 2002-2007. However, a longer data record is required to fully evaluate the data because of the impact from meteorology (summer of 2008 and 2009 were also wetter than average)., 107941=Five dates were chosen out of the period 2007-2009 when multiple monitors in the NYC area recorded 24-hour PM2.5 levels in excess of 35µg/m3:, 89239=Table 11 below lists each monitoring site, county, and the attainment status designated by EPA based on three years' data from 2006-2008, against the former 8-hr standard of 0.08 ppm, as well as the 2007-2009 design value. Final attainment status classification against the current 8-hr standard of 0.075 ppm (effective May 2008) is still under development by EPA as of this writing. A location map of ozone sites is shown in Figure 9., 5810=The 2-month data gap was a direct consequence of very restrictive purchasing procedures implemented by State government that created unreasonable delays for supplies and material purchases, eight months in this instance. The fiscal policy that was instituted in November 2008 has affected the entire monitoring program leading to critical shortages of needed supplies/replacement parts, thereby interrupting continuity of some monitoring activities., 90219=An annual trend plot of the statewide 1-hr ozone levels is presented in Figure 7 below. The 1-hour standard, which was revoked in 2008 when the more stringent 8-hr standard became effective, is shown on the graph for historic reference., 69143=In the future, the NYSDEC would like to be able to utilize a continuous FEM for PM2.5 that meets the relevant DQOs in all seasons anywhere in New York State. The causes of the differences between the filter based FRM and the continuous instruments are due to the variable nature of the retention of semi-volatile PM components on the FRM. The EPA should consider updating the FRM method to make it more consistent rather than continue to ask the manufacturers of the continuous instruments to emulate the FRM. The following article provides further insight on this issue: \"Is it Time to Upgrade the PM2.5 Federal Reference Method?\" EM Magazine, A&WMA, February 2009., 118986=Based on 3 years of monitoring data ending December 2008, against the former 8-hr standard of 0.08 ppm EPA designated 30 counties in New York State as nonattainment areas (Table 6). Figure 4 depicts the nonattainment counties and the population affected (16.6 million)., 50777=It appears worthwhile to conduct short duration intensive studies in the future that simultaneously employ a suite of particle counting instruments including the Scanning Mobility Particle Sizer (SMPS), Fast Mobility Particle Sizer (FMPS), Condensation Particle Counter (CPC), and our UPM to further evaluate the mobile component. The new NOx rule requiring the establishment of near-roadway monitors in populated areas starting in 2013 (see below) will afford an opportunity to collocate UPMs to further investigate the mobile contribution to the overall ultrafine concentration. The recent establishment of initial regulations intended to address ultrafine particle emissions from mobile sources (LEV-3 in California, Euro V-VII in the EU) is an early indicator of more extensive regulation of ultrafine particle emissions from mobile sources expected in the future, and suggests the potential emergence of regulations for ambient ultrafine particles as well., 108837=Rochester weather data were examined for the dates of the five ozone exceedances during 2007-2009. Most of the exceedances occurred on days when the regional wind flow was from the south or southwest, but winds tended to become light and variable during the afternoon at the Rochester airport due to the lake breeze effect working counter to the southerly wind flow. Exceedances were more frequent at the Rochester monitor, close to the urban core, than at the Williamson monitor to the east-northeast.}",
    "TableContextTimeStampAfterTable": "{8802=Mount Sinai School of Medicine conducted the Children's Air Pollution Asthma Study (CAPAS) at IS 52 and CCNY. The CAPAS project is an Electric Power Research Institute (EPRI) funded, comprehensive health study to investigate the association between air pollutants and asthma. March 2008 through September 2009, 16830=Effective January 12, 2009 the lead standard was revised to a rolling 3-month average of 0.15µg/m3 with a maximum (not-to-be-exceeded) form, evaluated over a 3-year period. The current indicator of Pb in total suspended particles (Pb-TSP) was retained. The secondary standard was also set to be identical in all respects to the revised primary standard. Following promulgation of the revised lead NAAQS and monitoring requirements, several environmental groups petitioned for a reconsideration of the lead emission rate at which monitoring is required (the ''emission threshold,'' currently 1.0 tpy). On July 22, 2009, the EPA granted the petition to reconsider aspects of the monitoring requirements. In response to the petition, the EPA reviewed and reconsidered the monitoring requirements and published proposed revisions to the requirements for both source-oriented and non-source-oriented monitoring for lead December 30, 2009. The proposed changes include:, 2672=The final report of the completed study (PDF) (431 kB)was submitted to EPA in October 2009., 29772=Privacy Policy | Website Usage and Policies | Website Accessibility | Employment | Contact Us | Website Survey Copyright © 2015 New York State Department of Environmental Conservation, 18689=On November 16, 2009, EPA proposed to strengthen the NAAQS for SO2 in order to improve protection for potentially susceptible populations, such as people with asthma, children and the elderly who are especially susceptible to the health problems associated with breathing SO2. EPA is proposing to revise the primary standard of 140 ppb measured over 24-hours, and 30 ppb measured over an entire year to a level of between 50 and 100 ppb measured over 1-hour. Under a separate review, EPA is considering the need for changes to the secondary standard in conjunction with the secondary NO2 standard., 16387=New near-road monitoring sites are to be operational by January 2013. Most likely, these additional monitoring requirements will be difficult to implement by current staff as siting these roadside monitors will be a challenging task. In addition, each site will cost upwards of $100,000 placing additional strain on limited financial resources. Additional resources will be needed to achieve these goals., 12486=The new 8-hr ozone standard of 0.075 ppm went into effect March 27, 2008. After review of the new standards the incoming Administrator initiated a rule making process to reconsider the 2008 primary and secondary standards for ozone culminating in a proposed rule published on January 19, 2010. EPA proposed to set the primary standard to lower value in the range between 0.060 and 0.070 ppm, in order to provide increased protection for children and other ''at risk'' populations against an array of O3-related adverse health effects that range from decreased lung function and increased respiratory symptoms to serious indicators of respiratory morbidity including emergency department visits and hospital admissions for respiratory causes, and possibly cardiovascular-related morbidity as well as total nonaccidental and cardiopulmonary mortality. For the secondary standard, EPA proposed a new cumulative, seasonal standard expressed as an annual index of the sum of weighted hourly concentrations, cumulated over 12 hours per day (8 am to 8 pm) during the consecutive 3-month period within the O3 season with the maximum index value, set at a level within the range of 7 to 15 ppm-hours, to provide increased protection against O3-related adverse impacts on vegetation and forested ecosystems. EPA plans to issue final standards by August 31, 2010., 4015=The New York State Ambient Mercury Baseline Study funded by EPA is a two-year data collection project that will conclude this fall. Speciated (elemental, reactive gaseous and particle bound mercury) as well as MDN wet deposition mercury monitoring began in 2008 at two sites, NY Botanical Garden in the Bronx and the NCore site in Rochester. We have submitted a grant application to the Great Lakes Restoration Initiative for funding to continue operation at the Rochester site, the data from which are vital for the development of the mercury Total Maximum Daily Loads (TMDLs). In many waterbodies, mercury originates largely from air sources, such as coal-fired power plants and incinerators that deposit in waters or adjacent lands that then wash into nearby waters. Contributions of mercury also likely come from a combination of local, regional, and international sources., 14577=As of April 12, 2010 a new 1-hour standard for NO2 went into effect. The new NAAQS is set at a level of 100 ppb, based on the 3-year average of the 98th percentile of the yearly distribution of 1-hour daily maximum concentrations, to supplement the existing annual standard. EPA is also establishing requirements for an NO2 monitoring network that will include monitors at locations where maximum NO2 concentrations are expected to occur, including within 50 meters of major roadways, as well as monitors sited to measure the area-wide NO2 concentrations that occur more broadly across communities. Under a separate review, EPA is considering the need for changes to the secondary standard in conjunction with the secondary SO2 standard., 2824=Although the EPA grant period concluded in July 2008, NYSDEC continued sampling at two of the four original study sites with State monies. Measurements for PM2.5, VOCs and carbonyls are still on-going at the Tonawanda II (Brookside Terrace) and Grand Island Blvd (GIB) sites. Sampling for PAHs which started in July 2008 at GIB will conclude at the end of July this year. In addition, a continuous BTEX gas chromatograph has been in operation since late summer 2008 at GIB. NYSDEC will continue to operate these two monitors until funding/resources are exhausted, at which time GIB will be terminated. The anticipated closure date of this site is December 31, 2010., 9205=Cornell University conducted a NOx/Ammonia study at various Department air monitoring sites from July 2008 to July 2009. The Cornell study is evaluating sources of nitrogen to the Hudson River estuary and the potential impacts of nitrogen on estuary water quality as well as focusing on deposition of ammonia in the NYC metropolitan area., 25962=NYSDEC first began ultrafine particulate monitoring with the deployment of a TSI Model 3031 Ultrafine Particle Monitor (UPM) at Queens College in June of 2009. This instrument provides continuous measurements of size distribution and particle number concentrations of fine particles below 1 micron, in the range from 20 to 500 nanometers. Concurrently a demo UPM unit on loan for one year from the manufacturer was installed at the Eisenhower Park location in Nassau County, which is expected to have a significant impact from mobile sources. The recent establishment of initial regulations intended to address ultrafine particle emissions from mobile sources (LEV-3 in California, Euro V-VII in the EU) is an early indicator of more extensive regulation of ultrafine particle emissions from mobile sources expected in the future, and suggests the potential emergence of regulations for ambient ultrafine particles as well., 20198=Under this proposed rule, the minimally required network are to be operational by January 1, 2013, and the Regional Administrators has the discretion of requiring additional monitors in areas where exposures to concentrations approaching or exceeding the NAAQS may be occurring. The final rule is expected in June 2010., 8344=Multi-Ethnic Study of Atherosclerosis (MESA). This is a joint project with the University of Washington, Columbia University School of Public Health and various other institutions to examine the relationship between air pollution exposures and the progression of cardiovascular disease over time. The study involves thousands of participants, representing different areas of the United States. April 2005 through July 2009., 1838=It is apparent that there is some overlap/redundancy between the two independent networks. A closer examination is warranted to evaluate the possibility of streamlining New York's operations. In the 2010 AMNP, we have proposed to suspend operation at several sites in order to conserve limited resources., 20905=EPA is under court order with the proposed rule , due October 28, 2010, with the final rule due by May 13, 2011. There are no current monitoring requirements except for NCore sites. The near-road network required for NO2 may be a suitable and logical location for CO monitors - EPA is considering how urban canyons might be included in the network design., 14375=EPA estimates that up to 270 new ozone monitors could be needed to satisfy the new requirements. These must be operational by Jan. 1, 2012., 20570=The existing standards were last revised in 2006, and they are under review currently. A proposed rule is expected this November that will include monitoring requirements for PMcourse(fraction between PM10 and PM2.5), as well as measurements for urban visibility., 9808=Particulate sampling at PS 219 for heart disease related research. November 2009 through March 2010., 24030=The continuous PM2.5 mass monitoring instruments used in New York are the TEOM 1400ab manufactured by ThermoFisher. These instruments have received FEM designation for the measurement of PM10 only. The TEOM 1400ab with FDMS (series 8500) received designation by EPA for PM2.5 in 2009. Several of these instruments have been purchased and judiciously deployed. PM2.5 is more difficult to measure than PM10 with automated samplers because PM2.5 contains a higher fraction of volatile components. The heated inlet for the TEOM 1400ab reduces the amount of volatile mass measured as compared to filter based FRMs. Since most of continuous particulate monitors inn our network are of the older (non FDMS) design, non-linear data adjustments were utilized to make the TEOM data more comparable with the FRM data. The adjusted data are used for public reporting and forecasting PM2.5 concentrations. In addition, NYSDEC continues to evaluate the FDMS Dicot TEOMs that capture more of the volatile components of PM2.5. It is hoped that with a data adjustment, these instruments will be able to provide more accurate \"FRM-like\" data on an hourly basis until their useful life is realized or we are able to purchase more of the TEOMs with FDMS and phase out the older units., 4906=6NYCRR Part 246 mercury reduction program for coal-fired electric utility steam generating units (EGUs) went into effect in 2010. On the federal side, EPA is under a consent decree to propose Maximum Achievable Control Technology (MACT) standards for EGUs by March 16, 2011 and to finalize those standards by November 16, 2011. Therefore, it is absolutely essential to continue monitoring mercury baseline levels., 21354=This is another court ordered rulemaking with the proposal due July 12, 2011and the final rule due March 20, 2012. Current indicators (NO2 and SO2) do not take into account all contributions to N and S deposition. The structure of current NAAQS is not designed to protect against deposition impacts to ecological systems. Limited monitoring in ecologically sensitive areas suggests that these effects are occurring in areas that would meet the current standards}",
    "textBeforeTable": "Prior to the establishment of the NATTS network, NYSDEC began a statewide toxics monitoring network back in 1990. Currently we monitor toxics (TO-15) at 13 sites and carbonyls at ten sites. Sample analysis is conducted by in-house laboratory staff, whose superb performance was well demonstrated in the recently completed School Air Toxics/Acrolein Study (see Special Purpose Monitors section below). a Collocated unit 1 day in 6 --- Eastern Research Group Chromium 1 day in 6 HPLC - Ultraviolet Absorption DNPH tube Method 202 Carbonyl 1 day in 6 GC/MS Canister Method 150 Toxics Semi-Continuous Thermal Optical Sunset Laboratory Method 5040 Elemental Carbon/ Organic Carbon Continuous Optical Absorption Magee Scientific Aethalometer Method 866 Black Carbon Continuous Pulsed Florescence Thermo Scientific5020i Sulfate Particulate Sulfate Continuous --- Thermo Scientific 8400N PM2.5 - Nitrate 1 day in 6a ICPMS Method 907 PM10 - Metals 1 day in 6a Gravimetric Low volume FRM R&P 2025 Method 127 Continuous TEOM Gravimetric 50ºC R&P TEOM 1400 Method 079 PM10 1 day in 3 IMPROVE TOR URG 3000 Method 838 Carbon 1 day in 3 IMPROVE IMPROVE Sampler 1 day in 3 XRF Met One SASS Method 811 PM2.5 Speciation Daily 1 day in 3a Gravimetric Low volume FRM R&P 2025 Method 118 Continuous TEOM Gravimetric 50ºC R&P TEOM 1400 Method",
    "textAfterTable": "aNATTS site bSpecial Purpose Monitor Figure 28 shows the site location map of the toxics monitoring network. Figure 28. Site Location Map of Toxics Network The primary purpose of the NATTS network is tracking trends in ambient air toxics levels to facilitate measuring progress toward emission and risk reduction goals. The monitoring network is intended, over a six-year period, to be able to detect a 15% difference (trend) between two successive 3-year annual mean concentrations within acceptable levels of decision error. The following charts (Figures 29 and 30) illustrate the statewide annual averages for benzene and 1,3-butadiene. In Figures 31 and 32, seasonal trends for the carbonyls formaldehyde and acetaldehyde are demonstrated for the NY Botanical Garden and Grand Island Blvd (Tonawanda) sites. Figure 29. Benzene Annual Average Trends for Toxics Network Sites Figure 30. 1,3-Butadiene Annual Average Trends for Toxics Network Sites Figure 31. Seasonal Trends of Formaldehyde and Acetaldehyde at Tonawanda Figure 32. Seasonal Trends of",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}