{
    "relation": [
        [
            "Property File",
            "config.ini",
            "bundles.info",
            "java6-server.profile"
        ],
        [
            "Description",
            "Configures OSGi framework properties.",
            "Configures OSGi framework bundles.",
            "Configures the OSGi framework profile."
        ],
        [
            "Location",
            "$SERVER_HOME/configuration",
            "$SERVER_HOME/configuration/org.eclipse.equinox.simpleconfigurator",
            "$SERVER_HOME/configuration"
        ]
    ],
    "pageTitle": "Virgo User Guide",
    "title": "",
    "url": "http://www.eclipse.org/virgo/documentation/virgo-documentation-3.5.0.RELEASE/docs/virgo-user-guide/htmlsingle/virgo-user-guide.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988840.31/warc/CC-MAIN-20150728002308-00080-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 421446255,
    "recordOffset": 421373038,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{277624=[2010-10-25 16:20:49.367] Thread-3 <WE0000I> Starting web bundle 'org.eclipse.virgo.apps.admin.web' version '2.1.0.RELEASE' with context path '/admin'., 105913=Access is via ssh or telnet. The simplest way to access the shell is via telnet to port 2501 or 2401 for user region or kernel, respectively., 2819=Borislav Kapukaranov, SAP AG - Configuring framework extensions and fragments on system bundle; Added Virgo Nano references and tips, 50346=At EclipseCon 2011 there was a great introductory presentation on p2. It gives a nice overview of the whole provisioning system. You can find it recorded here(video)., 105690=If you wish to change a port, any free port can be used, but the usual defaults are, for telnet, 2501 for the user region and 2401 for the kernel, and for ssh, 2502 for the user region and 2402 for the kernel., 276808=[2008-05-15 09:09:46.940] server-dm-2 org.apache.coyote.http11.Http11Protocol I Initializing Coyote HTTP/1.1 on http-48080, 106224=Alternatively, you can ssh to port 2502 or 2402 for user region or kernel, respectively. The users and passwords for ssh are configured in configuration/org.eclipse.virgo.kernel.users.properties as described in Configuring Authentication. The default user and password are admin and springsource., 2410=Copyright © 2009, 2011 VMware Inc. and others, 366898=When you use the shutdown shell command to stop Virgo Tomcat Server, the shutdown log messages appear in the shell terminal instead of in the terminal in which Virgo runs. See Enabling Equinox Console for more information. This is covered also by bug 351533.}",
    "lastModified": "Tue, 11 Mar 2014 19:33:07 GMT",
    "textBeforeTable": "Table 13.1. OSGi Framework Configuration Files This section provides information about configuring the OSGi framework by updating the following files in the $SERVER_HOME/configuration directory: 13.1 Configuring the OSGi Framework Sections 4-6 and 8-9 does not apply for Virgo Nano. Note The config directory has always contained Virgo configuration files. When Virgo Nano and its support for p2 provisioning was introduced in Virgo 3.5.0, a configuration directory replaced the old config one. Now all Virgo configurations are assembled in that directory providing a single point of configuration. The directory name configuration in the installation's root is used by default in p2 to configure the OSGi framework during provisioning. This chapter makes it clear which configuration goes in each directory. Why is there both a config and a configuration directory? Configuring the embedded Jetty servlet container Configuring the web integration layer",
    "textAfterTable": "Configuring OSGi Framework Properties You specify the framework properties in the $SERVER_HOME/configuration/config.ini file. The properties most relevant to users are described in the following table. WARNING: We strongly recommend that you update only the properties below; updating other properties could cause Virgo to fail. Table 13.2. Framework Properties Property Description org.eclipse.virgo.kernel.startup.wait.limit Specifies the amount of time, in seconds, after which various operations time out out while trying to start the kernel. The default value is 180. org.eclipse.virgo.suppress.heap.dumps Set to 'false' by default this property will prevent heap dumps being contributed to dumps taken during a First Failure Data Capture (FFDC) event. When the heap dumps are produced they will be located along with the other dump artifacts in the $SERVER_HOME/serviceability/dump/ folder. osgi.java.profile Specifies the profile to use",
    "hasKeyColumn": true,
    "keyColumnIndex": 1,
    "headerRowIndex": 0
}