{
    "relation": [
        [
            "Parameter",
            "userid",
            "connectionListName",
            "filterPattern"
        ],
        [
            "Description",
            "The user ID for whom to return the number of connections",
            "The name of the connection list from which to obtain a count",
            "A filter to use against returned connections, such as \"co,\" which returns condoleezza as well as nicole"
        ]
    ],
    "pageTitle": "Integrating the People Connections Service",
    "title": "",
    "url": "http://docs.oracle.com/cd/E17904_01/webcenter.1111/e10148/jpsdg_people.htm",
    "hasHeader": true,
    "headerPosition": "MIXED",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438043062635.98/warc/CC-MAIN-20150728002422-00105-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 72753119,
    "recordOffset": 72697594,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{252091=Footnote 1 Data types, such as DATE and BOOLEAN, are stored in the API as STRING. The DATE data type returns a Java standard date format, for example, 2009-08-21T14:43:11.0013-0700, with 0700 representing the time zone.}",
    "lastModified": "Wed, 13 May 2015 05:17:21 GMT",
    "textBeforeTable": "Table 35-26 Parameters of the Method getNumberOfConnections Returns the number of users (int) connected to the identified user. Table 35-26 lists and describes the parameters associated with this method. 35.3.3.2.12 getNumberOfConnections(String userid, String connectionListName, String filterPattern) The connectee's Profile details connecteeUserProfile The names of connections lists of which the connection is a member connectionListsMembershipList The user ID of a connection connecteeUserId Description Attribute Table 35-25 Attributes of the Method getConnections The number of results to return (see startIndex) fetchSize The point from which to start fetching results This is used for pagination. For example, the search can return 50 matching records, and only 10 are needed, starting from 1. Set startIndex to 1 and fetchSize to 10. startIndex",
    "textAfterTable": "Table 35-27 Attributes of the Method getNumberOfConnections Attribute Description Int The number of connections to return 35.3.3.2.13 ignoreInvitation(String invitationId) Specifies that the invitation with the specified ID should be ignored. Table 35-28 lists and describes the parameters associated with this method. Table 35-28 Parameters of the Method ignoreInvitation Parameter Description invitationId The GUID of the connection invitation to ignore 35.3.3.2.14 inviteUserForConnection(String userid, String invitationMessage, Collection connectionListNames) A means of inviting the user with the specified user ID to connect. Includes the invitation message, such as, \"I would like you to be my connection.\" Also includes one or more connection list names to which to add the invitee once the invitation is accepted.",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}