{
    "relation": [
        [
            "",
            "Deus Ex Human Revolution (2011)",
            "Battlefield 3 (2011)",
            "Anno 2070 (2011)",
            "Diablo III (2012)"
        ],
        [
            "low",
            "95.1",
            "40",
            "89.5",
            "61.1"
        ],
        [
            "med.",
            "",
            "26.3",
            "34.5",
            "44.6"
        ],
        [
            "high",
            "37.2",
            "22.3",
            "21.3",
            "38.2"
        ],
        [
            "ultra",
            "",
            "",
            "",
            ""
        ],
        [
            "",
            "fps",
            "fps",
            "fps",
            "fps"
        ]
    ],
    "pageTitle": "Review HP Pavilion g7-2007sg notebook - NotebookCheck.net Reviews",
    "title": "",
    "url": "http://www.notebookcheck.net/Review-HP-Pavilion-g7-2007sg-notebook.81410.0.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988840.31/warc/CC-MAIN-20150728002308-00195-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 610826207,
    "recordOffset": 610755871,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{4643=The g7-2007sg comes with a 750 GB hard drive and 8 GB RAM (two 4 GB modules of DDR3-1600 RAM from Nanya)., 19532=One of our main points of criticism when we reviewed the Pavilion g7 before was the very disappointing display. Did HP improve the display for the expensive Intel version? The specs are identical: a 17.3-inch display with a resolution of 1600 x 900 pixels. As a result, the pixel density is fairly low at 106 dpi., 34455=After evaluating two of the less expensive models with AMD's Trinity APU (g7-2053sg with A6-4400M and g7-2051sg with A10-4600M) in the last few weeks, we decided to take a look at the most powerful member of the series - the g7-2007sg. This model retails for over 700 Euro and features a speedy Intel Core i7-3612QM, 8 GB RAM, and a 750 GB hard drive. The Radeon HD 7670M should offer enough performance for gaming, although the card might have some issues with the native resolution of the 17-inch display (1600 x 900 pixels).}",
    "TableContextTimeStampAfterTable": "{3642=Let's start with the Single-Thread performance. The A10-4600M (2806 points in the Cinebench R10 64 Bit) ranks at the very bottom of the g7 performance list. The A6-4400M features a better Turbo Boost mode and outperforms the 4600M easily (3165 points). Compared to the 5236 points the Core i7 managed to score here, both APUs systems don't stand a chance., 129687=The AMD Radeon HD 7670M is essentially a newly released version of the Radeon HD 6650M (introduced January 2011). Its processor is still based on the older 40 nanometer process and uses the VLIW5 architecture. The DirectX 11 accelerator has 480 ALUs, separated in 96 blocks, and a frequency of 600 MHz. The memory interface has a 128 bit interface to 1 GB DDR3-VRAM (900 MHz)., 130322=The performance of the 7670M makes the card a direct competitor of the GeForce GT 630M, as the results are very close. Running 3DMark 11, the Radeon card scored 1205 points - more than OK for the price bracket of this notebook. Although the less expensive Pavilion g7-2051sg seems to offer better graphics performance due to its Crossfire combination of APU and Radeon GPU (2047 points), it has to be said that it suffers from micro stutters and driver issues (these issues are not reflected in the higher score)., 156342=As far as gaming performance is concerned, the g7-2007sg delivers what we expected from the combination of Core i7-3612QM and Radeon HD 7670M. Using the maximum display resolution of 1600 x 900 pixels while playing any of the current titles, pushes the graphics card quickly to its limits. The user is then forced to either lower the details or to select a lower resolution. The particularly demanding Battlefield 3 requires the lowest quality setting and a resolution of 1024 x 768  to remain playable without any stutters., 107745=The review system with the Intel processor scores 2760 points in PCMark 7 and outscores the models with Trinity APU (it's about 50 to 80 percent faster). Running the older PCMark Vantage, the differences are even more pronounced. The g7-2007sg performs about as well as the Dell Inspiron 17R-SE, which also features a quad-core processor.}",
    "lastModified": "Thu, 30 Jul 2015 19:35:41 GMT",
    "textBeforeTable": "Those after the best game-playing experience and additional quality features (AA, AF) need a notebook with a much more powerful graphics processor - at least a GeForce GT 650M or better. As far as gaming performance is concerned, the g7-2007sg delivers what we expected from the combination of Core i7-3612QM and Radeon HD 7670M. Using the maximum display resolution of 1600 x 900 pixels while playing any of the current titles, pushes the graphics card quickly to its limits. The user is then forced to either lower the details or to select a lower resolution. The particularly demanding Battlefield 3 requires the lowest quality setting and a resolution of 1024 x 768  to remain playable without any stutters. Deus Ex: Human Revolution Gaming Performance 17081 \"> font-weight:bold; border: 1px solid #550000; color: #ffffff; text-align: right; line-height: 16px; padding-bottom:auto; padding-top:auto; padding: 3px; margin: 1px; width: 310px; height: 16px; background: #8a0101; MSI GT80-2QES32SR311BW (max)  4980HQ, GeForce GTX 980M SLI    ... 1214 \"> font-weight:bold; border: 1px",
    "textAfterTable": "Noise Level Even during idle and low ambient temperatures, the fan in the notebook is always on (albeit spinning slowly). The result is a system noise level of 33.1 to 34.2 dB(A) - definitely noticeable in quiet environments. We don't think it's necessary: other notebooks remain passively cooled when the temperature of their processor is between 30 and 40 degrees Celsius (86 to 104 degrees Fahrenheit). The hard drive of the system is barely audible. During 3D applications, noise level only increases about 3 to 4 dB and reaches 37.6 dB(A). Compared to other 17-inch systems, the g7-2007sg does well here and remains fairly unobtrusive even during longer gaming sessions. The noise level peaked at a surprisingly high 48.2 dB(A) when we ran our stress test - a value that won't be reached during normal use though. Under full load, the fan system emits fairly high frequencies, but when the load decreases, the noise level drops back down within a few seconds. Noise Level Idle 33.1 / 33.2 / 34.2 dB(A)",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}