{
    "relation": [
        [
            "Payment method",
            "",
            "Visa/MasterCard, Amex, Discover",
            "Cash on pickup"
        ],
        [
            "Preferred/Accepted",
            "Accepted",
            "Accepted",
            "Accepted"
        ],
        [
            "",
            "",
            "",
            ""
        ]
    ],
    "pageTitle": "",
    "title": "",
    "url": "http://www.ebay.ca/itm/Intel-Core-i5-SLBLC-CPU-Processor-2-66GHz-8M-09B-Socket-LGA-1156-FREE-SHIPPING-/141218839812?pt=CPUs&hash=item20e14c7d04",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987174.71/warc/CC-MAIN-20150728002307-00339-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 418600439,
    "recordOffset": 418557748,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Payment details Every item comes with a free 45 day warranty. If within this warranty period the item should fail please contact through eBay messages. In order to qualify for refund, the returned item must be: identified as our property, unaltered, physically intact, undamaged due to intent or neglect, and complete with all components and accessories originally sold with the item. Upon receipt you will receive verification of return. Please allow time needed to properly test and identify the problem. Once an item has been tested to be non-working, it will be directly replaced. If no direct replacement can be found, you will have to option to accept a similar replacement, or refund. If the item is tested, and appears to be in its original working condition, the item will be returned to the buyer and no credit or exchange will be permitted. Please note that we are not required to protect against incompatibility with any other items, or \"buyers remorse\". Return policy details The buyer is responsible for return shipping costs. Money back or item exchange (buyer's choice)",
    "textAfterTable": "time left Current bid amount + Shipping amount Bid Count time left current bid + shipping bids Approximately: Current bid amount Approximately: + Shipping amount Approximately: Import charges:",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}