{
    "relation": [
        [
            "Patent application number",
            "20120244671",
            "20120280841",
            "20130221418"
        ],
        [
            "Description",
            "Unitary Floating-Gate Electrode with Both N-Type and P-Type Gates - An analog floating-gate electrode in an integrated circuit, and method of fabricating the same, in which trapped charge can be stored for long durations. The analog floating-gate electrode is formed in a polycrystalline silicon gate level, and includes n-type and p-type doped portions serving as gate electrodes of n-channel and p-channel MOS transistors, respectively; a plate of a metal-to-poly storage capacitor; and a plate of poly-to-active tunneling capacitors. Silicide-block silicon dioxide blocks the formation of silicide cladding on the electrode, while other polysilicon structures in the integrated circuit are silicide-clad. An opening at the surface of the analog floating-gate electrode, at the location at which n-type and p-type doped portions of the floating gate electrode abut, allow formation of silicide at that location, shorting the p-n junction.",
            "Zero-power sampling SAR ADC circuit and method - A switched-capacitor circuit (",
            "Analog Floating-Gate Memory Manufacturing Process Implementing N-Channel and P-Channel MOS Transistors - An analog floating-gate electrode in an integrated circuit, and method of fabricating the same, in which trapped charge can be stored for long durations. The analog floating-gate electrode is formed in a polycrystalline silicon gate level, doped n-type throughout its length, and includes portions serving as gate electrodes of n-channel and p-channel MOS transistors; a plate of a metal-to-poly storage capacitor; and a plate of poly-to-active tunneling capacitors. The p-channel MOS transistor includes a buried channel region, formed by way of ion implantation, disposed between its source and drain regions. Silicide-block silicon dioxide blocks the formation of silicide cladding on the electrode, while other polysilicon structures in the integrated circuit are silicide-clad."
        ],
        [
            "Published",
            "09-27-2012",
            "11-08-2012",
            "08-29-2013"
        ]
    ],
    "pageTitle": "Wu, PA - Patent applications",
    "title": "",
    "url": "http://www.faqs.org/patents/inventor/wu-pa-3/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987174.71/warc/CC-MAIN-20150728002307-00206-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 425062963,
    "recordOffset": 425032725,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{30318=Patent applications by Dingjun Wu, Macungie, PA US}",
    "textBeforeTable": "Michael A. Wu, Audubon, PA US 01-13-2011 COMBINATION THERAPY FOR THE TREATMENT OF DIABETES - The present invention is directed to co-therapy and methods for the treatment and prevention of glucose-related disorders such as Type 2 diabetes mellitus and Syndrome X. The present invention is further directed to pharmaceutical compositions for the co-therapy and methods described herein. 20110009347 Published Description Patent application number Lisa Wu, Merion Station, PA US //]]> BarDraw('3409557',['Patent applications by Linda Wu, Radnor, PA US'],[[1,1,1]],['2009','2012','2013'],0); // <script type=\"text/javascript\"> </div> <div id=\"legend3409557\" align=\"center\"></div> </div> <canvas id=\"bg3409557\" style=\"max-width: 500px; width: 100%;\"></canvas> <div> <p align=\"center\">Patent applications by Linda Wu, Radnor, PA US</p> <div class=\"bar3409557\" style=\"max-width: 500px; width: 100%; float:left; \"> <div align=\"left\" style=\"padding-top:20px;\"> </table> </tbody> </tr> <td>04-11-2013</td> <td><a href=\"/patents/app/20130090457\">Toll-Like Receptor 3 Antagonists for the Treatment of Metabolic and Cardiovascular Diseases</a> - Toll Like Receptor 3 (TLR3) antibody antagonists, polynucleotides encoding TLR3 antibody antagonists or fragments thereof, and methods of making and using the foregoing are disclosed.</td> <td>20130090457</td> <tr> </tr> <td>03-15-2012</td> <td><a href=\"/patents/app/20120064095\">TOLL-LIKE RECEPTOR 3 ANTAGONISTS FOR THE TREATMENT OF METABOLIC AND CARDIOVASCULAR DISEASES</a> - Toll Like Receptor 3 (TLR3) antibody antagonists, polynucleotides encoding TLR3 antibody antagonists or fragments thereof, and methods of making and using the foregoing are disclosed.</td> <td>20120064095</td> <tr> </tr> <td>05-28-2009</td> <td><a href=\"/patents/app/20090136509\">Use of Toll-Like Receptor 4 Antagonists for the Treatment or Prevention of Osteoarthritic Conditions</a> - Methods for treating or preventing osteoarthric conditions using Toll-Like Receptor 4 (TLR4) antagonists are disclosed.</td>",
    "textAfterTable": "Nan Wu, Coraopolis, PA US Patent application number Description Published 20080263018 Method and System for Mapping Business Objects to Relational Database Tables - A method comprises receiving information from a user and passing the information to an SQL builder. The method further comprises accessing a configuration file, and based on the contents of the configuration file, determining an appropriate database type. One or more SQL statements are generated, and the one or more SQL statements are executed on the database. 10-23-2008 20090248428 Method and System for Determining Software License Compliance - According to one embodiment, a method for determining license compliance includes receiving data regarding a plurality of licenses, including at least first and second licenses. The first license has a corresponding first license count that applies to a first software product. The second license has a corresponding second license count that applies to the first software product. An instance count of the first software product is determined. A determination is made regarding whether the instance count can be apportioned to the first and second licenses, such that neither the first or second license counts are exceeded. 10-01-2009 20090249493 Method and System for Determining Software License Compliance - According to one embodiment, a method includes receiving data regarding a plurality of licenses. Each license is associated with one or more respective software products. The data is partitioned such that first and second licenses of the",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}