{
    "relation": [
        [
            "Field",
            "Trace has 1000 entries",
            "Stacktrace is disabled by default",
            "Matching all events"
        ],
        [
            "Description",
            "The size of the event logging buffer is 1000 entries.",
            "Stack trace at tracepoints is disabled.",
            "Event tracing for all events is matched."
        ]
    ],
    "pageTitle": "Cisco IOS IP Switching Command Reference - show ip mds forwarding through show monitor event-trace merged-list [Support] - Cisco",
    "title": "Table 27 show monitor event-trace cef ipv4 parameters Field Descriptions",
    "url": "http://www.cisco.com/c/en/us/td/docs/ios-xml/ios/ipswitch/command/isw-cr-book/isw-s2.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 125,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987174.71/warc/CC-MAIN-20150728002307-00105-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 365005015,
    "recordOffset": 364924717,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{78524=2000::2/128 nexthop FE80::A8BB:CCFF:FE00:2500 Ethernet0/0, 632497=This command was implemented on the Cisco ASR 1000 series routers., 498403=(0x01096A3C)--The address in memory of the switching vector, 571412=Trace has 1000 entries, 494092=*Aug 22 20:14:58.999:, 497480=(hw 3) SWvecLES <unknown> (0x01096A3C), 642116=This command was implemented on the Cisco ASR 1000 Series Aggregation Services Routers., 48783=(172.17.62.86, 224.2.170.73) [31], 522386=*Aug 13 17:38:27.999:, 546285=(hw3) SWvecLES <unknown> (0x01096A3C), 580511=Specifies an IPv6 address. This address must be specified in hexadecimals using 16-bit values between colons, as specified in RFC 2373., 568607=*Aug 22 20:14:59.075:, 571532=The size of the event logging buffer is 1000 entries., 3550=(172.17.62.86, 224.2.170.73) [31]), 472479=This command was implemented on Cisco ASR 1000 Series Aggregation Services Routers.}",
    "textBeforeTable": "Syntax Description [source-address] [group-address] forwarding mds ip show To display the Multicast Forwarding Information Base (MFIB) table and forwarding information for multicast distributed switching (MDS) on a line card, use the show ip mds forwarding command in user EXEC or privileged EXEC mode. show ip mds forwarding show monitor event-trace merged-list show monitor event-trace hw-api show monitor event-trace cpu-report show monitor event-trace continuous show monitor event-trace cef ipv6 show monitor event-trace cef ipv4 show monitor event-trace cef interface show monitor event-trace cef events show monitor event-trace cef show monitor event-trace adjacency show monitor event-trace show mls table-contention show mls ip statistics show mls ip static show mls ip routes show mls ip non-static show mls ip cef rpf-table show mls cef vrf show mls cef summary show mls cef statistics show mls cef rpf show mls cef mpls show mls cef maximum-routes show mls cef mac",
    "textAfterTable": "Release Modification 11.2(11)GS This command was introduced. 12.2(33)SRA This command was integrated into Cisco IOS Release 12.2(33)SRA. 12.2SX This command is supported in the Cisco IOS Release 12.2SX train. Support in a specific 12.2SX release of this train depends on your feature set, platform, and platform hardware. Usage Guidelines Use this command on the line card. This command displays the MFIB table, forwarding information, and related flags and counts. Note To reach the console for a line card, enter attach slot#(slot number where the line card resides). On a Gigabit Switched Router (GSR) only, line card commands can be executed from the Route Processor (RP) using the following syntax: execute [slot slot-number |",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}