{
    "relation": [
        [
            "First Name",
            "Courtney",
            "Joseph"
        ],
        [
            "Last Name",
            "Watson",
            "Zummo"
        ],
        [
            "Suffix",
            "",
            ""
        ],
        [
            "Covered Official Position (if applicable)",
            "",
            ""
        ],
        [
            "New",
            "",
            ""
        ]
    ],
    "pageTitle": "LD-2 Disclosure Form",
    "title": "",
    "url": "http://soprweb.senate.gov/index.cfm?event=getFilingDetails&filingID=146711DE-1B88-4A48-9658-0A153D4798CB&filingTypeID=51",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988840.31/warc/CC-MAIN-20150728002308-00176-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 219217283,
    "recordOffset": 219209081,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{12212=Consolidated and Further Continuing Appropriations Act, 2013 (H.R. 933), provisions relating to the funding of the Administration's budget request for air traffic control and modernization, Air Traffic Controller Optimum Training Solution program, and Wide Area Augmentation System., 52905=Consolidated and Further Continuing Appropriations Act, 2013 (H.R. 933), provisions relating to aviation, maritime, border, and cyber security., 1019=Lobbying Disclosure Act of 1995 (Section 5) - All Filers Are Required to Complete This Page, 16326=FY14 Defense Authorization and Appropriations Acts (Bills Pending); Department of Defense Appropriations Act, 2013 (H.R. 5856); and Consolidated and Further Continuing Appropriations Act, 2013 (H.R. 933); provisions relating to acquisition policy, force protection, military space and intelligence, command and control, simulation and training, self-defense systems and decoys, missile defense, sensors and radars, missiles, sequestration, munitions, and artillery, advanced technology programs, (continues) naval shipbuilding and systems and cooperative threat reduction., 35504=FY14 Defense Authorization and Appropriations Acts (Bills Pending); Department of Defense Appropriations Act, 2013 (H.R. 5856); and Consolidated and Further Continuing Appropriations Act, 2013 (H.R. 933); provisions relating to acquisition policy, force protection, military space and intelligence, command and control, simulation and training, self-defense systems and decoys, missile defense, sensors and radars, missiles, sequestration, munitions & artillery, advanced technology programs, (continues) naval shipbuilding and systems, and cooperative threat reduction., 59279=Consolidated and Further Continuing Appropriations Act, 2013 (H.R. 933), provisions relating to Joint Polar Satellite System, NPP Suomi satellite, NASA space exploration, earth science, and remote sensing. General outreach on science, technology, engineering, and math programs (STEM)., 44594=Issues associated with Congressional notifications of proposed foreign military and direct commercial sales; Export control reform; Naval Vessel Transfer Act of 2013 (S. 12), all provisions. U.S. defense cooperation with countries in Asia, Europe, the Middle East, and Africa; and FY14 International Affairs Authorization and Appropriations Acts (Bills Pending)., 65222=Greater Research Opportunities with Tax Help Act (S. 1577) and American Research and Competitiveness Act, 2011 (H.R. 942), all provisions; To amend the Internal Revenue Code of 1986 to extend the allowance for certain business assets (S. 2240 and H.R. 4196); the Small Business Jobs and Tax Relief Act (S. 2237), provisions relating to bonus depreciation; the Mobile Workforce State Income Tax Simplification Act of 2012, all provisions. American Taxpayer Relief Act of 2012(H.R. 8), provisions (continues) related to business tax extenders. Issues pertaining to comprehensive tax reform., 24983=Consolidated and Further Continuing Appropriations Act, 2013 (H.R. 933), and FY13 Disaster Assistance Supplemental (H.R. 152); provisions relating to the funding of the Administration's budget request for air traffic control modernization, Air Traffic Controller Optimum Training Solution program, NASA space exploration, earth science, remote sensing, (continues) earth observing systems, Joint Polar Satellite System, and NPP Suomi satellite. Department of Homeland Security Appropriations Act, 2013 (H.R. 5855, S. 3216), provisions for aviation, maritime, border, and cyber security. FY14 Defense Authorization and Appropriations Acts (Bills Pending); Department of Defense Appropriations Act, 2013 (H.R. 5856); FY14 Intelligence Authorization Act (Bill Pending); and Consolidated and Further Continuing Appropriations Act, 2013 (H.R. 933); provisions relating to acquisition policy, force protection, military space and intelligence, command and control, simulation and training, self-defense systems and decoys, missile defense, sensors and radars, missiles, sequestration, munitions and artillery, advanced technology programs, naval shipbuilding and systems and cooperative threat reduction.}",
    "textBeforeTable": "",
    "textAfterTable": "City WALTHAM State MA Zip Code 02451 Country USA 3. Principal place of business (if different than line 2) City   State   Zip Code   Country   4a. Contact Name b. Telephone Number c. E-mail  Mr.  MARK T. ESPER  7038415754  mark.t.esper@raytheon.com 5. Senate ID#  32828-12",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}