{
    "relation": [
        [
            "Categories",
            "Campus Safety",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "Campus safety at IUP is top notch. There are emergency buttons every so many feet, so that if a person feels threatened, they can press the button and the police will be notified. The police station is also on campus, and there are many hotlines and helplines you can call in a difficult situation.",
            "IUP is always having fun events, like picnics, dances, and sporting events. The oak grove is also always a place to go to lay out, sit and relax, and interact with students passing by. There is always something to do on campus!",
            "IUP has every kind of food imaginable, whether you are a vegan, all-organic, or just a regular meat eater. The dining hall offers festive food days where you can enjoy a Thanksgiving dinner, or make your own Christmas cookies. You can also just sit down and talk while having a nice meal with your friends.",
            "Staying in the dorms is the best place to make everlasting bonds with new friends. The dorms feel like home to me. They are equipped with everything you need and are extremely comfortable.",
            "The courses at IUP keep you occupied and involved in what you're doing. They keep you focused. You are able to take the lessons you learn in class and apply them elsewhere.",
            "Keep a calendar of assignments that are due; this is a great time management skill. Don't be afraid to make new friends. Take every extra credit opportunity you can get.",
            "IUP has a beautiful campus filled with wonderful scenery. The people are friendly and helpful. I always feel at time."
        ]
    ],
    "pageTitle": "Indiana University of Pennsylvania (IUP) Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Indiana-University-of-Pennsylvania-Main-Campus/reviews",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988840.31/warc/CC-MAIN-20150728002308-00286-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 910750331,
    "recordOffset": 910622917,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{632415=It's affordable. That said, you may have to take out loans if you do not get sufficient financial aid (this happens especially if you live in on-campus housing). My loans have averaged $1000 per semester. Also, the quality of education will depend on the department/major you are in. The Education department and Nursing programs have notable and excellent programs, while some others are very lacking in terms of instructor quality and rigor., 700862=© 2015, Cappex.com, LLC, 10966=Expect cold weather in October, but mostly expect amazing unity. The IUP campus is big and holds 14,000 students, but you feel so involved when you are here. Whether you join the paper or just play frisbee with friends in the Oak Grove, you will see how unified the students are.}",
    "textBeforeTable": "07/30/2009 Reviewer is A current student here. 16 out of 17 people found this review useful. 1 of 155 Laura from PA Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code",
    "textAfterTable": "Categories Comments Campus Safety IUP is a very safe and secure campus. The dorm building lock after 8pm every day. Each wing of the dorm building is always locked. Your dorm room door locks and so does your bedroom door. Your bedroom windows lock and will not open more than 6 inches as a safety precaution. The police are always around and there are emergency buttons located around campus. If you press that button the police will be there within 2 minutes. It's very safe. Greek Life There are tons of opportunities to go Greek at IUP. There are honor, religious, themed, and just fun fraternities and sororities to join. Don't miss out! Clubs and Activities There are infinite clubs and activites you could join. There are all kinds of religious groups, anime club, sports teams, residence hall association, everything! There's even video games club. Great for these types of students Great for all types of students, especially education majors! Bang for the buck It's cheap compared to other schools in Pennsylvania. What to do for fun You could go hang out",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}