{
    "relation": [
        [
            "Current political events",
            "Articles about political issues in the US and around the world that have been especially relevant within the past 5 years",
            "Florida Amendment 2 (2008), California Proposition 8 (2008), E.O. Green School shooting, etc."
        ],
        [
            "LGBT Media and Literature",
            "Depictions of LGBT people and issues on television, film, newspapers, magazines",
            "The Advocate, Curve (magazine), Washington Blade, Milk (film), Brokeback Mountain, etc."
        ],
        [
            "LGBT History",
            "Topics about gay rights activism and the opposition to it",
            "Moral Majority, ACT UP, Queer Nation, Mattachine Society, Jesse Helms, Jerry Falwell, Mathew Shepard, etc."
        ],
        [
            "Sex and sexuality",
            "Articles relating to sex and sexuality",
            "Gay, Lesbian, Bisexual, Transgender, sexual and gender expression, etc."
        ]
    ],
    "pageTitle": "User talk:Zlrussell - Wikipedia, the free encyclopedia",
    "title": "",
    "url": "https://en.wikipedia.org/wiki/User_talk:Zlrussell",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988840.31/warc/CC-MAIN-20150728002308-00314-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 879738479,
    "recordOffset": 879568764,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{17875=If you have uploaded other fair use media, consider checking that you have specified the fair use rationale on those pages too. You can find a list of 'image' pages you have edited by clicking on the \"my contributions\" link (it is located at the very top of any Wikipedia page when you are logged in), and then selecting \"Image\" from the dropdown box. Note that any non-free media lacking such an explanation will be deleted one week after they have been uploaded, as described on criteria for speedy deletion. If you have any questions please ask them at the Media copyright questions page. Thank you. NOTE: once you correct this, please remove the tag from the image's page. STBotI 23:47, 6 October 2007 (UTC), 16467=Noticed your improvements to the Callaway article. Good so far. Remember when uploading images that unless you provide a Fair-use rational for images you get from other web sites, they will probably be deleted by an administrator. I also fixed the image page for the picture of the school building because you didn't choose a license for it. Anyway, nice to \"meet\" other \"family\" on WP! -- ALLSTAR ECHO 01:06, 7 October 2007 (UTC), 14556=Hi, Zlrussell! Thought you might be interested in WP:LGBT. Take a look around, and if you are interested, sign up? -- SatyrTN (talk | contribs) 05:35, 8 October 2007 (UTC), 28583=Regarding myself: I'm around pretty frequently in the evening US Eastern Time (GMT-5), and often into the morning hours. University starts again in a week, and based on my schedule right now I'm likely to check things throughout the day as well; so, basically, I'll be around any time. --Sopoforic 03:39, 11 August 2007 (UTC), 3509=Good luck with your projects; let me know if there's anything I can do to help you. --Sopoforic 00:27, 9 October 2007 (UTC), 6689=I hope that this helps you out. As always, feel free to contact me if there's anything more I can do from you; I'm happy to hear from you, especially if I can help you in some way. Cheers. --Sopoforic 21:37, 8 October 2007 (UTC), 10115=-- SatyrTN (talk | contribs) 17:40, 8 October 2007 (UTC), 19632=That ought to be a pretty thorough guide to all you need to know for article creation. If you have any questions, just let me know, and I'll be glad to explain further. Happy editing. --Sopoforic 20:31, 11 August 2007 (UTC), 30804=Hi. I notice that you've requested adoption, and I'd like to offer to adopt you. If you'd like to accept, please leave me a message on my talk page. --Sopoforic 01:32, 11 August 2007 (UTC), 752=I'm going to end here without any further discussion of fair use rationales (unusual for me, since I seem to be a bit long-winded) since it's 4am and I have class tomorrow--today. Good night. --Sopoforic 08:07, 9 October 2007 (UTC), 31945=I hope you enjoy editing here and being a Wikipedian! Please sign your messages on discussion pages using four tildes (~~~~); this will automatically insert your username and the date. If you need help, check out Wikipedia:Questions, ask me on my talk page, or ask your question on this page and then place {{helpme}} before the question. Again, welcome! --Thw1309 11:35, 31 July 2007 (UTC), 2941=Much though I hate to be the bearer of bad news, non-free images are not allowed on user pages. You may link to the images (by placing a colon before the name, like Image:Wikipedia.png), but not display them. I've converted them to links in this way; you may remove them entirely if you desire. --Sopoforic 02:35, 9 October 2007 (UTC), 1893=Well, the {{WWE-photo}} template is inappropriate--it isn't an official publicity photo, it's a screenshot; I've removed that. I also modified the FUR slightly; you'll want to replace the 'source' with whatever the title of the video you took the screencap is--probably Royal Rumble 2007 or something, but I don't know. Otherwise this doesn't seem too bad. I'm not familiar with this event in particular or PPV events in general, but I am going to assume that the people attending (shown in Image:Undertaker winning the Rumble.jpg) were not allowed to bring cameras with them. If people were allowed to take photos of the event it's a little less clear, since we might hope to get free photos. Still, at present it seems to me that you just need to be a little more clear about the source of the image.}",
    "TableContextTimeStampAfterTable": "{46598=Delivered on 12:00, 1 November 2007 (UTC)., 425595=The WikiProject Professional wrestling Newsletter Issue XXXV - February 1, 2009, 1093567=The WikiProject Professional wrestling Newsletter Issue L - August 30, 2009, 825596=This section is intended to warn users about potential targets of vandalism and speculation: professional wrestling events from major promotions for the month of June., 240951=Don't go home yet, please. --Moni3 (talk) 00:10, 24 July 2008 (UTC), 227950=I say this to myself as much as I say it to all of us. I work a lot by myself or with individual editors who spend time at Featured Article Candidates. It seems on November 5 a fog was lifted off my brain that helped me realize that we have massive potential in this project to get things done. Take this allegory, for instance: On Wednesday, Nov. 5, 1980, my 10th-grade American history teacher started class by unfurling The New York Times. She pointed to its triple banner headline: “Reagan Easily Beats Carter; Republicans Gain in Congress; D’Amato and Dodd are Victors.” “Save this paper,” she told us. “This is the start of a whole new era.” Judith Warner from The New York Times, 591876=As of March 2009:, 240338=Miami, January 18, 1977 after the gay rights ordinance was passed: While Bryant and the others were creating the beginnings of the repeal effort, (gay activists) Basker, Campbell, Kunst, and the other (gay rights) ordinance supporters congratulated themselves on their success and then quickly disbanded... There was no organized recognition or celebration of the victory. As one activist remembered, \"We just went home.\" They had little idea of the battle that was before them. - Fred Fejes in Gay Rights and Moral Panic, 2008, 406863=This section is intended to warn users about potential targets of vandalism and speculation: professional wrestling events from major promotions for the month of January., 1175917=The WikiProject Professional wrestling Newsletter Issue LII - September 27, 2009, 589587=The WikiProject Professional wrestling Newsletter Issue XXXIX - March 29, 2009, 380839=The WikiProject Professional wrestling Newsletter Issue XXXIV - January 18, 2009, 45310=In the spirit of this peculiarly North American holiday, let me take a moment to thank all of our editors for their contributions to this project. It's people like you who make people like me...well, a \"people person\"! May all your Wiki days be bright, and may your Love Boat never turn into a Poseidon., 1119344=This section is intended to warn users about potential targets of vandalism and speculation: professional wrestling events from major promotions for the month of September., 894023=On June 1, President Barack Obama declared June 2009 Lesbian, Gay, Bisexual, and Transgender Pride Month, citing the riots as a reason to \"commit to achieving equal justice under law for LGBT Americans\". Excerpts at the bottom., 1003723=The WikiProject Professional wrestling Newsletter Issue XLVIII - August 2, 2009, 911531=As of July 2009:, 629832=The WikiProject Professional wrestling Newsletter Issue XXXX - April 12, 2009, 343117=Enjoy the final 2008 issue of the WP:PW newsletter and have a very happy holiday season, from WP:PW!, 1139751=As of September 2009:, 510951=The WikiProject Professional wrestling Newsletter Issue XXXVII - March 1, 2009, 889851=The LGBT studies WikiProject Newsletter! Issue XVIII: June 24, 2009, 701253=This section is intended to warn users about potential targets of vandalism and speculation: professional wrestling events from major promotions for the months of April and May., 744089=This section is intended to warn users about potential targets of vandalism and speculation: professional wrestling events from major promotions for the month of May., 632119=As of April 2009:, 1137468=The WikiProject Professional wrestling Newsletter Issue LI - September 13, 2009, 613052=This section is intended to warn users about potential targets of vandalism and speculation: professional wrestling events from major promotions for the month of April., 495098=This section is intended to warn users about potential targets of vandalism and speculation: professional wrestling events from major promotions for the month of February., 383020=As of January 2009:, 97046=This is an automated notice by FairuseBot. For assistance on the image use policy, see Wikipedia:Media copyright questions. --FairuseBot (talk) 07:26, 18 September 2008 (UTC), 802216=As of June 2009:, 840598=The WikiProject Professional wrestling Newsletter Issue XLV - June 21, 2009, 229869=Though what we do is an interesting hobby for some, we have the power to make a difference. California's ballot initiative to ban gay marriage was a fierce fight. It's being challenged right now, but just look at how Wikipedia played a role in that: in October 2008, 360,238 people read its article. On November 5, an astounding 467,000 people read it. I commend the editors who work on that article—both those who support and oppose it. A look at the talk page shows a concerted effort to keep it civil and accurate., 760820=The WikiProject Professional wrestling Newsletter Issue XLIII - May 24, 2009, 1051795=The WikiProject Professional wrestling Newsletter Issue XLIX - August 16, 2009, 799933=The WikiProject Professional wrestling Newsletter Issue XLIV - June 7, 2009, 909248=The WikiProject Professional wrestling Newsletter Issue XLVI - July 5, 2009, 549557=The WikiProject Professional wrestling Newsletter Issue XXXVIII - March 15, 2009, 784370=This section is intended to warn users about potential targets of vandalism and speculation: professional wrestling events from major promotions for the months of May and June., 1034199=This section is intended to warn users about potential targets of vandalism and speculation: professional wrestling events from major promotions for the month of August., 718981=The WikiProject Professional wrestling Newsletter Issue XLII - May 10, 2009, 888568=Special Pride 2009 Booty call edition, 721265=As of May 2009:, 226908=The LGBT studies WikiProject Newsletter! Issue XVII: November 12, 2008, 470015=The WikiProject Professional wrestling Newsletter Issue XXXVI - February 15, 2009, 532643=This section is intended to warn users about potential targets of vandalism and speculation: professional wrestling events from major promotions for the month of March., 1006011=As of August 2009:, 451440=This section is intended to warn users about potential targets of vandalism and speculation: professional wrestling events from major promotions for the months of January and February., 673053=The WikiProject Professional wrestling Newsletter Issue XLI - April 26, 2009, 24495=If you have uploaded other unlicensed media, please check whether they're used in any articles or not. You can find a list of 'image' pages you have edited by clicking on the \"my contributions\" link (it is located at the very top of any Wikipedia page when you are logged in), and then selecting \"Image\" from the dropdown box. Note that all non-free media not used in any articles will be deleted after seven days, as described on criteria for speedy deletion. Thank you. BetacommandBot 15:27, 4 November 2007 (UTC), 11374=Delivered on 17:31, 11 October 2007 (UTC)., 937709=This section is intended to warn users about potential targets of vandalism and speculation: professional wrestling events from major promotions for the month of July., 956449=The WikiProject Professional wrestling Newsletter Issue XLVII - July 19, 2009, 4731=Since our last newsletter, Fun Home and GayFest have been promoted to Good Article status. Congratulations to all editors who have worked so hard to improve them! While the T-Z list was promoted to Featured list on September 26, 2007, we have had no articles reach Featured Article status since Homer's Phobia was promoted last March. In fact, one article of our Project was delisted: Andrew Van De Kamp. Please take a look at out listed articles and see if you'd like to try to take one to Featured status (there are almost 8,000 to choose from). Additionally, Conversion therapy has been nominated for Featured status. Please read the article and give feedback at the Feartured Article Candidates page. (See also our FA-class list.), 427884=As of February 2009:, 1160645=This section is intended to warn users about potential targets of vandalism and speculation: professional wrestling events from major promotions for the months of September.}",
    "lastModified": "Sat, 01 Aug 2015 01:14:49 GMT",
    "textBeforeTable": "How do you fight ignorance? With information. That's what Wikipedia is for. This project is overwhelming with 8,576 articles in its scope. We can continue to work piecemeal as we have in the past, or we can focus on goals. These are examples of areas we can concentrate on. What can we do? Though what we do is an interesting hobby for some, we have the power to make a difference. California's ballot initiative to ban gay marriage was a fierce fight. It's being challenged right now, but just look at how Wikipedia played a role in that: in October 2008, 360,238 people read its article. On November 5, an astounding 467,000 people read it. I commend the editors who work on that article—both those who support and oppose it. A look at the talk page shows a concerted effort to keep it civil and accurate. The power of Wikipedia and California Proposition 8 (2008) I say this to myself as much as I say it to all of us. I work a lot by myself or with individual editors who spend time at Featured Article Candidates. It seems on November 5 a fog was lifted off my brain that helped me realize that we have massive potential in this project to get things done. Take this allegory, for instance: On Wednesday, Nov. 5, 1980, my 10th-grade American history",
    "textAfterTable": "There are more than 8,000 articles to work on. Can we build a list of priorities? Can we build enough enthusiasm to work on these? What if we had editors who oversaw progress in these areas and reported to the talk page or in the newsletter? Surely someone here wants to report on the progress of sex articles. Tony Perkins (irony) from the conservative Family Research Council was heartened by the recent passages of gay marriage bans. The Republican Party is without direction. What's going to take the place of a moderate voice will not be pleasant to our ears. Watching and improving articles of subjects that have opposed gay rights in the past will be of vital importance very soon, I predict. But WP:LGBT is not a very active project All we can do is start somewhere. The first step is answering this newsletter on the project talk page. Join in the discussion. More things we can do Give out more barnstars, and let each other know that what they're doing is valued. Create a guide to stave off burnout, because editors in this project get burned out faster than others. There are many hills to climb. Bring back the monthly collaboration project. Participate in LGBT Peer reviews. Get familiar with the",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}