{
    "relation": [
        [
            "Job Title",
            "Museum Outreach Ninja",
            "STEM Citizen Science Ambassador",
            "Renegade Tour Guide",
            "Maintenance Mechanic Job"
        ],
        [
            "Location",
            "New York, NY",
            "Chicago, IL",
            "San Francisco Bay Area, CA",
            "Marietta, PA"
        ]
    ],
    "pageTitle": "Research - Entry Level Jobs, Internships, and Career Overview",
    "title": "",
    "url": "http://www.onedayonejob.com/jobs-internships/research/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438043062635.98/warc/CC-MAIN-20150728002422-00308-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 614779503,
    "recordOffset": 614654614,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{287226=Copyright © 2007-2015 One Day, One Job. All rights reserved.}",
    "textBeforeTable": "software development social media sales research Pennsylvania marketing market research data customer service analytics analyst all employers See the complete ListenLogic profile ListenLogic - ListenLogic is a Conshohocken, PA based company that extracts “insights from unstructured big data to drive business outcomes.” No current job openings. web development software development sales research real estate product development New York engineering design data analyst all employers See the complete CompStak profile CompStak - CompStak is based in NYC and creating \"transparency in commercial real estate by gathering information that is hard to find, difficult to compile or otherwise unavailable.” Companies with Entry Level Jobs and Internships in Research",
    "textAfterTable": "The Wirecutter - The Wirecutter is a site that offers “a list of the best electronics and gadgetry\" that will help you make the absolute best purchasing decision. See the complete The Wirecutter profile affiliate marketing all employers blogging copywriting e-commerce editing editorial journalism product management production research science virtual writing Job Title Location Accessories Writer United States Travel Gear Writer United States Executive Assistant (LA-based) United States Researcher United States Personal Care Writer United States See all 20 job postings Noom - Noom is an NYC based company that makes",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}