{
    "relation": [
        [
            "Type of Range",
            "Interquartile range",
            "Specific point (royalty)",
            "Floor (i.e., result must be no less than x)",
            "Specific point within CPM range (not floor or ceiling)",
            "Financial products - statistical confidence interval to test against internal CUPs",
            "Ceiling (i.e., result must be no more than x)",
            "Other"
        ],
        [
            "Number",
            "31",
            "8",
            "6",
            "3",
            "2",
            "2",
            "7"
        ]
    ],
    "pageTitle": "Internal Revenue Bulletin - April 12, 2004 - Announcement 2004-26",
    "title": "",
    "url": "http://www.irs.gov/irb/2004-15_IRB/ar16.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438043062635.98/warc/CC-MAIN-20150728002422-00030-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 532410283,
    "recordOffset": 532374251,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{136127=The Cost Plus Method (tangibles only) and Resale Price Method were applied in 2003 in two and three APAs respectively. See Treas. Reg. § 1.482-3(c), (d)., 158124=At the core of most APAs are comparables. The APA program works closely with taxpayers to find the best and most reliable comparables for each covered transaction. In some cases, CUPs or CUTs can be identified. In other cases, comparable business activities of independent companies are utilized in applying the CPM or residual profit split methods. Generally, in the APA Program’s experience since 1991, CUPs and CUTs have been most often derived from the internal transactions of the taxpayer., 109707=The general descriptions of the business functions performed and risks assumed by the organizations, trades, or businesses whose results are tested in the covered transactions in the APAs executed in 2003 are set forth in Tables 13 and 14 below:, 146764=The sources of comparables, selection criteria, and rationale used in determining the selection criteria for APAs executed in 2003 are described in Tables 20 through 22 below. Various formulas for making adjustments to comparables are included as Attachment B., 199582=The statistics for the review of APA annual reports are reflected in Table 29 below. As of December 31, 2003, there were 222 pending annual reports. In 2003, there were 303 reports closed., 191124=APAs executed in 2003 required that taxpayers provide various documents with their annual reports. These documents are described in Table 28 below:, 124768=The TPMs used in APAs executed in 2003 are set forth in Tables 16-20 below:, 138941=Profit splits have also been used in a number of financial product APAs in which the primary income-producing functions are performed in more than one jurisdiction. Two APAs executed in 2003 applied such a profit split., 18362=The application is assigned to an APA team leader who is responsible for the case. The APA team leader’s first responsibility is to organize the APA team. This involves contacting the appropriate LMSB International Territory Manager to secure the assignment of an international examiner to the APA case and the LMSB Counsel’s office to secure a field counsel lawyer. In a bilateral case, the U.S. Competent Authority will assign a U.S. Competent Authority analyst to the team. In a large APA case, the international examiner may invite his or her manager and other LMSB personnel familiar with the taxpayer to join the team. When the APA may affect taxable years in Appeals, the appropriate appellate conferee will be invited to join the team. In all cases, the team leader contacts the Manager, LMSB International Technical Advisors, to determine whether to include a technical advisor on the team. The IRS APA team will generally include a technical advisor if the APA request concerns cost-sharing, intangibles or services. The APA team leader then distributes copies of the APA application to all team members and sets up an opening conference with the taxpayer. The APA office strives to hold this opening conference within 45 days of the assignment of the case to a team leader. At the opening conference, the APA team leader proposes a case plan designed to complete the recommended U.S. negotiating position for a bilateral APA within 9 months from the date the full application was filed and to complete a unilateral APA within 12 months from the application date. In 2003, the median for completing negotiating positions was 15.2 months (average 15.3), and the median for completing unilateral APAs was 9.2 months (average 20.0)., 15893=The APA team generally includes an economist, an international examiner, LMSB field counsel, and, in a bilateral case, a U.S. Competent Authority analyst who leads the discussions with the treaty partner. The economist may be from the APA Program or the IRS field organization. As of December 31, 2003, the APA Program had 7 economists. The APA team may also include an LMSB International Technical Advisor, other LMSB exam personnel, and an Appeals officer., 197881=During 2003, there were 31 tested parties that faced financial risks, including interest rate and currency risks. Three APAs provide specific approaches for dealing with currency risk, including adjustment mechanisms and critical assumptions., 138097=The CPM also was used regularly with services as the covered transactions in APAs executed in 2003. There were a total of 10 services covered transactions using the CPM method with various PLIs according to the specific facts of the taxpayers involved. Table 17 reflects the methods used to determine the arm’s length results for APAs involving services transactions., 181844=Nineteen covered transactions reflected on Table 24 specified a single, specific result, or “point.” Three of these covered transactions involved a CPM in which the taxpayer agreed to a specific result. Some APAs specify not a point or a range, but a “floor” or a “ceiling”. When a floor is used, the tested party’s result must be greater than or equal to some particular value. When a ceiling is used, the tested party’s result must be less than or equal to some particular value. Six APAs executed in 2003 used a floor and two used a ceiling., 132822=The TPMs used in APAs completed during 2003 were based on the section 482 regulations. Under Treas. Reg. § 1.482-3, the arm’s length amount for controlled transfers of tangible property may be determined using the Comparable Uncontrolled Price (CUP) method, the Resale Price Method, the Cost Plus Method, the Comparable Profits Method (CPM), or the Profit Split method. Under Treas. Reg. § 1.482-4, the arm’s length amount for controlled transfers of intangible property may be determined using the Comparable Uncontrolled Transaction (CUT) method, CPM, or the Profit Split Method. An “Unspecified Method” may be used for both tangible and intangible property if it provides a more reliable result than the enumerated methods under the best method rule of Treas. Reg. § 1.482-1(c). For transfers involving the provision of services, Treas. Reg. § 1.482-2(b) provides that services performed for the benefit of another member of a controlled group should bear an arm’s length charge, either deemed to be equal to the cost of providing the services (when non-integral, see Treas. Reg. § 1.482-2(b)(3)) or which should be an amount that would have been charged between independent parties., 11668=Since 1991, with the issuance of Rev. Proc. 91-22, 1991-1 C.B. 526, the IRS has offered taxpayers through the APA Program the opportunity to reach an agreement in advance of filing a tax return on the appropriate TPM to be applied to related party transactions. In 1996, the IRS issued internal procedures for processing APA requests. Chief Counsel Directives Manual (CCDM), ¶¶ 42.10.10 - 42.10.16 (November 15, 1996). Also in 1996, the IRS updated Rev. Proc. 91-22 with the release of Rev. Proc. 96-53, 1996-2 C.B. 375. The APA Program continues to operate under the provisions of Rev. Proc. 96-53, which provides taxpayers with instructions of how to apply for an APA, and what to expect in the processing of the case. In addition, in 1998, the IRS published Notice 98-65, 1998-2 C.B. 803, which set forth streamlined APA procedures for Small Business Taxpayers (SBTs). That Notice also expanded the availability of the lowest APA user fee in an effort to attract taxpayers who may not have the resources to do the sophisticated economic studies normally required in APA submissions., 173789=The adjustments made to comparables or tested parties in APAs executed in 2003 are reflected in Table 22 above., 15324=An IRS team headed by an APA team leader is responsible for the consideration of each APA. As of December 31, 2003, the APA program had 18 team leaders. The team leader is responsible for organizing the IRS APA team. The IRS APA team arranges meetings with the taxpayer, secures whatever information is necessary from the taxpayer to analyze the taxpayer’s related party transactions and the available facts under the arm’s length standard of IRC § 482 and the regulations thereunder (Treas. Reg.), and leads the discussions with the taxpayer., 140100=Critical Assumptions used in APAs executed in 2003 are described in Table 19 below:, 180582=Under Treas. Reg. § 1.482-1(e)(2)(i), such a range is normally derived by considering a set of more than one comparable uncontrolled transaction of similar comparability and reliability. If these comparables are of very high quality, as defined in the Regulations, then under Treas. Reg. § 1.482-1(e)(2)(iii)(A), the arm’s length range includes the results of all of the comparables (from the least to the greatest). However, the APA Program has only rarely identified cases meeting the requirements for the full range. If the comparables are of lesser quality, then under Treas. Reg. § 1.482-1(e)(2)(iii)(B), “the reliability of the analysis must be increased, when it is possible to do so, by adjusting the range through application of a valid statistical method to the results of all of the uncontrolled comparables.” One such method, the “interquartile range,” is ordinarily acceptable, although a different statistical method “may be applied if it provides a more reliable measure.” The “interquartile range” is defined as, roughly, the range from the 25th to the 75th percentile of the comparables’ results. See Treas. Reg. § 1.482-1(e)(2)(iii)(C). The interquartile range was used 31 times in 2003., 10155=Internal Revenue Code (IRC) § 482 provides that the Secretary may distribute, apportion, or allocate gross income, deductions, credits, or allowances between or among two or more commonly controlled businesses if necessary to reflect clearly the income of such businesses. Under the regulations, the standard to be applied in determining the true taxable income of a controlled business is that of a business dealing at arm’s length with an unrelated business. The arm’s length standard also has been adopted by the international community and is incorporated into the transfer pricing guidelines issued by the Organization for Economic Cooperation and Development (OECD). OECD, TRANSFER PRICING GUIDELINES FOR MULTINATIONAL ENTERPRISES AND TAX ADMINISTRATORS (1995). Transfer pricing issues by their nature are highly factual and have traditionally been one of the largest issues identified by the IRS in its audits of multinational corporations. The APA Program is designed to resolve actual or potential transfer pricing disputes in a principled, cooperative manner, as an alternative to the traditional examination process. An APA is a binding contract between the IRS and a taxpayer by which the IRS agrees not to seek a transfer pricing adjustment under IRC § 482 for a covered transaction if the taxpayer files its tax return for a covered year consistent with the agreed transfer pricing method (TPM). In 2003, the IRS and taxpayers executed 58 APAs and amended 4 APAs., 185184=The various term lengths for APAs executed in 2003 are set forth in Table 26 below:, 135611=Similar to the CUP method, for transfers of intangible property, the CUT method will generally provide the most reliable measure of an arm’s length result if sufficiently reliable comparables may be found. Treas. Reg. § 1.482-4(c)(2)(ii). It has generally been difficult to identify external comparables, and APAs using the CUT method tend to rely on internal transactions between the taxpayer and unrelated parties. In 2003, there were four covered transactions that utilized the CUT TPM., 98965=The nature of the relationships between the related organizations, trades, or businesses covered by APAs executed in 2003 is set forth in Table 10 below:, 26310=Once the IRS and the taxpayer reach agreement, the drafting of the final APA generally takes little time because the APA Program has developed standard language that is incorporated into every APA. The current version of this language is found in Attachment A. APAs are reviewed by the Branch Chief and the APA Director. In addition, the team leader prepares a summary memorandum for the Associate Chief Counsel (International) (ACC(I)). On March 1, 2001, the ACC(I) delegated to the APA Director the authority to execute APAs on behalf of the IRS. See Chief Counsel Notice CC-2001-016. The APA is executed for the taxpayer by an appropriate corporate officer., 138481=In 2003, there were two APAs involving tangible or intangible property that used the residual profit split, Treas. Reg. § 1.482-6(c)(3). In residual profit split cases, routine contributions by the controlled parties are allocated routine market returns, and the residual income is allocated among the controlled taxpayers based upon the relative value of their contributions of intangible property to the relevant business activity., 28743=As of December 31, 2003, the APA staff was as follows:, 9182=This Announcement is issued pursuant to § 521(b) of Pub. L. 106-170, the Ticket to Work and Work Incentives Improvement Act of 1999, which requires the Secretary of the Treasury to report annually to the public concerning Advance Pricing Agreements (APAs) and the APA Program. The first report covered calendar years 1991 through 1999. Subsequent reports covered calendar years 2000, 2001, and 2002. This fifth report describes the experience, structure and activities of the APA Program during calendar year 2003. It does not provide guidance regarding the application of the arm’s length standard., 205492=[8] The first eight categories of documentation listed in this table were drawn from the standard APA language used in 2003. The facts and circumstances of some APAs may eliminate the need for some standard documentation requirements., 120622=>The related organizations, trades, or businesses whose prices or results are tested to determine compliance with TPMs prescribed in APAs executed in 2003 are set forth in Table 15 below:, 101135=The controlled transactions covered by APAs executed in 2003 are set forth in Table 11 and Table 12 below:, 31757=In 2003, the APA Office continued to emphasize training as a high priority. Training sessions regarded APA-related current developments, new APA office practices and procedures, and international tax law issues. The APA New Hire Training materials were updated, as necessary, throughout the year. The updated materials are available to the public through the APA internet site on the IRS Digital Daily (www.irs.gov). These materials do not constitute guidance on the application of the arm’s length standard., 182405=Some APAs look to a tested party’s results over a period of years (multi-year averaging) to determine whether a taxpayer has complied with the APA. In 2003, rolling multi-year averaging was used for 10 covered transactions. Seven of those used three-year averages, one used a four-year average, and the other two used five-year averages. Cumulative multi-year averages were used for three covered transactions. Additionally, six covered transactions used term averages, and one covered transaction used a partial term average., 174274=The types of ranges and adjustment mechanisms used in APAs executed in 2003 are described in Table 24 and 25 below., 9153=March 30, 2004, 188632=Number of rollback years to which an APA TPM was applied in 2003 is set forth in Table 27 below:, 134695=In reviewing the TPMs applicable to transfers of tangible and intangible property reflected in Table 16, the majority of the APAs followed the specified methods. However, there are several distinguishing points that should be made. The Regulations note that for transfers of tangible property, the Comparable Uncontrolled Price (CUP) method will generally be the most direct and reliable measure of an arm’s length price for the controlled transaction if sufficiently reliable comparable transactions can be identified. Treas. Reg. § 1.482-3(b)(2)(ii)(A). It was the experience of the APA Program in 2003 that in the cases that came into the APA Program, sufficiently reliable CUP transactions were difficult to find. In APAs executed in 2003, there were two covered transactions that used the CUP method; both used internal data on transactions between the taxpayer and unrelated parties., 27956=In 2003, the APA Office consisted of four branches with Branches 1 and 3 staffed with APA team leaders and Branch 2 staffed with economists and a paralegal. Branch 4, the APA West Coast branch, is headquartered in Laguna Niguel, California, with an additional office in San Francisco, and is presently staffed with both team leaders and an economist., 159801=Comparables used in APAs can be U.S. or foreign. This depends on the relevant market, the type of transaction being evaluated, and the results of the functional and risk analyses. In general, comparables have been located by searching a variety of databases that provide data on U.S. publicly traded companies and on a combination of public and private non-U.S. companies. Table 20 shows the various databases and other sources used in selecting comparables for the APAs executed in 2003.}",
    "textBeforeTable": "As of December 31, 2003, the APA staff was as follows: Overall, the APA staff increased from 34 to 36. The APA Program hired a new APA Director and a new team leader. In addition, one team leader transferred to the APA Office from another Chief Counsel function, and one team leader transferred from the APA Office to another Chief Counsel function. The number of APA team leaders increased from 17 to 18, while the number of economists remained constant at 7. In 2003, the APA Office consisted of four branches with Branches 1 and 3 staffed with APA team leaders and Branch 2 staffed with economists and a paralegal. Branch 4, the APA West Coast branch, is headquartered in Laguna Niguel, California, with an additional office in San Francisco, and is presently staffed with both team leaders and an economist. The Current APA Office Structure, Composition, and Operation Attachment A contains the current version of the model APA language. As part of its continuing effort to improve its work product, the APA Program has revised the model language to reflect the program’s collective experience with substantive and drafting issues. Model APA at Attachment A [§ 521(b)(2)(B)] Once the IRS and the taxpayer reach agreement, the drafting of the final APA generally takes little",
    "textAfterTable": "APA Training In 2003, the APA Office continued to emphasize training as a high priority. Training sessions regarded APA-related current developments, new APA office practices and procedures, and international tax law issues. The APA New Hire Training materials were updated, as necessary, throughout the year. The updated materials are available to the public through the APA internet site on the IRS Digital Daily (www.irs.gov). These materials do not constitute guidance on the application of the arm’s length standard. APA Program Statistical Data [§ 521(b)(2)(C) and (E)] The statistical information required under § 521(b)(2)(C) is contained in Tables 1 and 9 below; the information required under § 521(b)(2)(E) is contained in Tables 2 and 3 below: TABLE 1: APA APPLICATIONS, EXECUTED APAs, AND PENDING APAs[1]   Unilateral Bilateral Multilateral",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}