{
    "relation": [
        [
            "Timestamp",
            "2013-11-22",
            "2013-11-22",
            "2011-05-08",
            "2011-05-08",
            "2009-08-06",
            "2009-08-06",
            "2009-08-06",
            "2009-08-06",
            "2009-08-06"
        ],
        [
            "Action",
            "Added",
            "Updated",
            "Deleted",
            "Added",
            "Added",
            "Added",
            "Added",
            "Added",
            "Added"
        ],
        [
            "Category",
            "SYNONYM",
            "TERM",
            "DEFINITION",
            "DEFINITION",
            "TERM",
            "DEFINITION",
            "SYNONYM",
            "RELATION",
            "RELATION"
        ],
        [
            "Detail",
            "response to epidermal growth factor stimulus",
            "response to epidermal growth factor",
            "A change in state or activity of a cell or an organism (in terms of movement, secretion, enzyme production, gene expression, etc.) as a result of an epidermal growth factor stimulus.",
            "Any process that results in a change in state or activity of a cell or an organism (in terms of movement, secretion, enzyme production, gene expression, etc.) as a result of an epidermal growth factor stimulus.",
            "response to epidermal growth factor stimulus",
            "A change in state or activity of a cell or an organism (in terms of movement, secretion, enzyme production, gene expression, etc.) as a result of an epidermal growth factor stimulus.",
            "response to EGF stimulus",
            "is a GO:0070848 (response to growth factor)",
            "is a GO:0009719 (response to endogenous stimulus)"
        ]
    ],
    "pageTitle": "GO:0070849 response to epidermal growth factor",
    "title": "",
    "url": "http://www.ebi.ac.uk/QuickGO/GTerm?id=GO:0070849",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988840.31/warc/CC-MAIN-20150728002308-00073-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 419923919,
    "recordOffset": 419900531,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{124878=Copyright (c) EMBL-EBI 2013 | EBI is an Outstation of the European Molecular Biology Laboratory | Privacy | Cookies | Terms of use, 124745=EMBL-EBI, Wellcome Trust Genome Campus, Hinxton, Cambridgeshire, CB10 1SD, UK +44 (0)1223 49 44 44}",
    "textBeforeTable": "icon for more details. Synonyms are alternative words or phrases closely related in meaning to the term name, with indication of the relationship between the name and synonym given by the synonym scope. Click on the Synonyms This term was created by the GO Consortium with support from Acknowledgements GO:0070849 Wiki Page GONUTS Any process that results in a change in state or activity of a cell or an organism (in terms of movement, secretion, enzyme production, gene expression, etc.) as a result of an epidermal growth factor stimulus. Definition Biological Process Ontology response to epidermal growth factor Name GO:0070849 ID Term Information Dataset Web Services Term Basket",
    "textAfterTable": "This chart is interactive; you can click on the term boxes and legend for more information. Display Key ShowHide GO IDs ShowHide Term box width Term box height Slim colours ShowHide Show children ShowHide Image size limit (in megapixels) Note that setting the limit too high may result in images being generated slowly; it may even cause the browser to crash. The maximum limit is 20 megapixels. Child Terms This table lists all terms that are direct descendants (child terms) of GO:0070849: Relationship To GO:0070849 Child Term Child Term Name Is a GO:0071364 cellular response to epidermal growth factor stimulus Protein Annotation",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}