{
    "relation": [
        [
            "Patent application number",
            "20100168735",
            "20140107430"
        ],
        [
            "Description",
            "SYSTEM AND METHOD FOR ASSESSING COUPLING BETWEEN AN ELECTRODE AND TISSUE - A system and method for assessing a degree of coupling between an electrode and tissue in a body is provided. Values for first and second components of a complex impedance (e.g., resistance and reactance or impedance magnitude and phase angle) between the electrode and the tissue are obtained. These values are used together with a standardization value indicative of a deviation from a reference standard by a parameter associated with at least one of the body, the electrode and another component of the system to calculate a coupling index that is indicative of a degree of coupling between the electrode and the tissue. The coupling index may be displayed to a clinician in a variety of ways to indicate the degree of coupling to the clinician. The system and method find particular application in ablation of tissue by permitting a clinician to create lesions in the tissue more effectively and safely.",
            "System and method for assessing coupling between an electrode and tissue - A system and method for assessing a degree of coupling between an electrode and tissue in a body is provided. Values for first and second components of a complex impedance (e.g., resistance and reactance or impedance magnitude and phase angle) between the electrode and the tissue are obtained. These values are used together with a standardization value indicative of a deviation from a reference standard by a parameter associated with at least one of the body, the electrode and another component of the system to calculate a coupling index that is indicative of a degree of coupling between the electrode and the tissue. The coupling index may be displayed to a clinician in a variety of ways to indicate the degree of coupling to the clinician. The system and method find particular application in ablation of tissue by permitting a clinician to create lesions in the tissue more effectively and safely."
        ],
        [
            "Published",
            "07-01-2010",
            "04-17-2014"
        ]
    ],
    "pageTitle": "Hill, MN - Patent applications",
    "title": "",
    "url": "http://www.faqs.org/patents/inventor/hill-mn-3/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987174.71/warc/CC-MAIN-20150728002307-00001-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 430313655,
    "recordOffset": 430285895,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Lewis C. Hill, Minneapolis, MN US 06-25-2015 Spooling Cable - A spool system includes a spool and a spool support. The spool includes a spool body, a shaft, and an anti-rotation feature. The spool body has a center axis of rotation. The shaft includes a first end disposed on the spool body and extends from the spool body along the center axis of rotation to a second end. The anti-rotation feature is disposed on the shaft and defines a non-circular shape. The spool support supports the spool and defines a slot sized to slidably receive the shaft and a feature receiver that has a complimentary shape of the anti-rotation feature. The spool moves along the slot between a stowed position and a deployed position. In the stowed position, the anti-rotation feature of the spool is received by the feature receiver and prevents rotation of the spool. In the deployed position, the anti-rotation feature allows rotation of the spool. 20150177473 Published Description Patent application number John Paul Hill, Andover, MN US 04-16-2009 Modular optical fiber cassettes and fiber management methods - The present invention provides modular cassettes for fiber management applications. Cassettes in accordance with the present invention comprise plural functional components that nest into a main housing portion to support various application and fiber types. In accordance with the present invention, such components can be added or removed depending on the application and configuration needs",
    "textAfterTable": "Michael J. Hill, Vadnais Heights, MN US Patent application number Description Published 20120110026 DATA TABLES ACCESSIBLE BY TWO SCRIPTS - A table may be stored in a data structure and accessed by two scripts from different platforms. For example, a table of inputs from a web form may be stored with a first script for execution on a first platform. The table may be accessible to the first script when executing on the first platform and accessible to a second script when executing on a second platform. According to one embodiment, the first script may be a business information server (BIS) script and the second script may be a JavaScript. The dual compatibility table allows the web form inputs to be accessed by multiple scripts having different requirements. 05-03-2012 20120131439 SCRIPTED DYNAMIC DOCUMENT GENERATION - A dynamic document template having static data, dynamic data, and/or procedural statements may be called by an application on a server. The dynamic document template is separate from the application program and is processed to form an interim script, which is then executed by a host computer system. The script generates document records in HTML or XML format that are output to a document. The data and procedural statements in the dynamic document template may be distinguished through interpreting mark-up language surrounding the data and procedural statements. The dynamic document templates execute in a separate namespace from the application and preserve the state",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}