{
    "relation": [
        [
            "Categories",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "Everything in Utica is about a 5 minute drive away, so it's easy to go find something to do. If you're broke, the college pretty much always has some sort of event going on whether its a performer in the pub or in the auditorium. Also, the hockey games are a huge deal and they're a good time.",
            "Sodexo could definitely be worse, and they're making improvements each semester, so it's gradually getting better. Avoid the fish always.",
            "Staying in the freshman dorms is pretty much a right of passage at Utica. Once you get through that, you move on to Tower or Bell or Boehlert which are all very nice.",
            "Depending on your major, some programs are much more difficult than others, but this is college, it's not high school any more, so it's to be expected that you're going to have to do work in order to become successful.",
            "Go see professors often. They will help you in whatever way possible is what I've found. Many of them are very committed to your success.",
            "Overall, Utica is a great college. The fact that it's a small place allows you to get to know almost everyone on campus. The Utica college community has proven to be like a big family to one another."
        ]
    ],
    "pageTitle": "Utica College Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Utica-College/reviews",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987174.71/warc/CC-MAIN-20150728002307-00151-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 915111079,
    "recordOffset": 915074391,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{125859=© 2015, Cappex.com, LLC, 57995=Campus safety is wonderful! My organization (Women in a New Direction) conducted a tribute to them Fall 2011 to express our appreciation for all that they do.}",
    "textBeforeTable": "05/03/2010 Reviewer is A current student here. 3 out of 3 people found this review useful. 1 person found it offensive. 1 of 28 Tiquella from Brockton, MA Check out reviews left by other students or leave your own review. You could win a free scholarship. Utica College Reviews Utica College › New York › By State › Colleges › } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.create', -->",
    "textAfterTable": "Categories Comments Great for these types of students This school is great for those who know what they want to do with their life. It's also pretty big into athletics. Tips for prospective students Make sure you get to class! Attendance may not be a part of your actual grade, but in the long run it will effect your course grade if you're never in class! Bang for the buck Tuition is pricey, but I know I'm in a good program. It will be all worth it when I pass my boards exam! Am enjoying being here Utica College has smaller classes and great professors. Though the city of Utica itself doesn't have much to do, the UC community has a ton of fun activities that they plan! It's up to you to get involved. Login to rate or flag the reviews Korey from Queens Village, NY 05/03/2012 Reviewer is A current student here. 1 out of 1 people found this review useful. 3 of 28",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}