{
    "relation": [
        [
            "Categories",
            "Campus Safety",
            "Greek Life",
            "Clubs and Activities",
            "Great for these types of students",
            "Share any unusual traditions or locations on campus",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "Campus safety is amazing here! hey even have classes that teach you how to defend yourselves. You feel safe wherever you go! If you need someone to walk you to your dorm at night all you have to do is call the campus security and they will be over to you in seconds. There are cameras everywhere, which is good. If you lose something you can guarantee you will get it back. Take it from someone who lost her phone 3 times and got it back every time. You have nothing to worry about at Lipscomb, because campus security has got your back.",
            "Greek life at Lipscomb is for Sophomores and up. I think that is an amazing idea since freshman are just getting use to the whole college routine. They seem really fun for people who are in it, besides the hazing, which isn't all the bad. Not all clubs even do it. If you want to be apart of something on the campus, Greek life is another great choice to think about.",
            "The clubs and activities are how you meet people! Join something at Lipscomb, whether it pertains to your major or for something that interests you! Just do it! You won't regret it.",
            "Students who want to be well rounded physically, mentally, and spiritually should come to Lipscomb! It is a wonderful place!",
            "An unusual tradition some of the students told me about is the saying, Three swings and a ring! Lipscomb has those bench swings all around campus, and it is said that if a girl and a guy swing two times together on a swing bench, then by the third swing the guy has to give the girl a ring. It is pretty crazy huh?",
            "Lipscomb has all types of events! We have Paint the Herd, social clubs, step shows, intramural sports, group fitness, running of the Bison, skate nights, pep rallies, and so much more!",
            "The food is amazing! They have different varieties of food in the cafeteria everyday! It is so much to choose from! Salads, burgers, pizza, chicken sandwiches, wraps, deserts, and so much more. I give there food an A+! Also, they have fast food downstairs like sushi, Chick-fi-lae, Papa Johns, Auntie Anne's, Zebi's and even Blue Coast Burrito. Lipscomb has great choices of food.",
            "The dorm life is fantastic! They have pretty cool dorms. Lipscomb just got through renovating most of the dorms, so they are really good looking. The bathrooms are always clean! Thanks to the custodians, and girls picking up after themselves. The rooms can be designed however you want it to be, so the style is up to you. Freshman girls and guys do have a curfew, which is midnight. I am really thankful for that, because it disciplines us to really watch our time.",
            "Lipscomb University is challenging academically. If you are willing to work hard and put in hours at the library, then I am sure you will be successful. Above all, prioritize and plan to the max!",
            "Prospective students! Get to know your faculty and staff really well. Be involved in activities to make your college experience enhanced. Also, use the Student Success center! They really help, and know what they are talking about to help you be successful while in college.",
            "Lipscomb University is an amazing school! The faculty and staff are very welcoming, and the students display a comfortable atmosphere. The campus is beautiful, the food is great, and the classrooms are a great size! What more could you want?"
        ]
    ],
    "pageTitle": "Lipscomb University Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Lipscomb-University/reviews?_escaped_fragment_=/show/128130",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987174.71/warc/CC-MAIN-20150728002307-00341-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 899468943,
    "recordOffset": 899416262,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{11359=I love Lipscomb! The people, the atmosphere, the social activities, the academics - Lipscomb is just a great place to be. I have made many friends here that I know will be friends for life. Lipscomb's Student Government Association plans 4-5 activities per semester to help students stay involved on campus. The biggest event SGA planned in the 2010 fall semester was Lipscomb's first Paint Rave. With over 600 students in attendance, the rave was a huge success! Also, Garner Goode with Lipscomb in Motion (the student life events planner), has events on the school calendar almost every night. From free food in Arlo's to a movie night in Alumni Auditorium, students are never without access to a good time. Social clubs (Lipscomb's alternative to sororities/fraternities) and athletic events also give students a chance to interact outside of the classroom and spend time together. Lipscomb's service clubs give students the chance to enjoy some of the same aspects of a social club, while finding ways to give back to the community. Lipscomb is located in Nashville, giving students total access to the famous, music city. Within minutes of the Grand Ole Opry, Opryland, Green Hills mall, Sweet CeCe's and so much more, students are able to have fun off campus without having to use up a lot of gas., 159808=If you plan to commute, plan on 8:00 classes or plan to park off-campus and hike to class. Also, consider that this is a Christian school. If you're uncomfortable with Christianity/Christians/religion in general, you may not feel comfortable, as it is very open about its stand on faith (though never shove-it-down-your-throat) and you are required to get chapel credits by attending chapel/chapel-like events., 120796=Be prepared to pay at least $2000 in hidden fees. Get used to studying a a lot. Have fun!, 59337=the dorms look amazing and I already got a roommate. I get to move into my dorm in august., 168009=The food id pretty predictable and the cafe closes at 7:30 so that's a struggle., 247965=© 2015, Cappex.com, LLC}",
    "textBeforeTable": "12/02/2009 Reviewer is A current student here. 14 out of 14 people found this review useful. 1 of 55 Erica from LA Vergne, TN Check out reviews left by other students or leave your own review. You could win a free scholarship. Lipscomb University Reviews Lipscomb University › Tennessee › By State › Colleges › } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.create', -->",
    "textAfterTable": "The courses at Lipscomb are no joke. Strenuous and fast paced, the work and the professors will keep you on your toes. Login to rate or flag the reviews Kyrsten from Kansas City, MO 12/28/2010 Reviewer is A current student here. 5 out of 5 people found this review useful. 3 of 55 Categories Comments Great for these types of students Lipscomb University is a great place for students who like to challenge themselves academically, but still want to find time to relax and chill with friends. The faith background of Lipscomb gives Christian students the chance to be open about their beliefs without feeling ridiculed. Lipscomb is considered to be a more liberal Church of Christ university than others, which can play a small part in the decision process. Tips for prospective students If you are considering Lipscomb, you're on the right track! Make sure you visit www.golipscomb.com to find out more information about admission, scholarships and financial aid. One of the things I love",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}