{
    "relation": [
        [
            "Categories",
            "Campus Safety",
            "Greek Life",
            "Clubs and Activities",
            "Great for these types of students",
            "Share any unusual traditions or locations on campus",
            "Bang for the buck",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "The campus is very safe. We have SNAP which is a driving service for students who do not want to walk by themselves at night",
            "There are a lot of greeks on our campus. They host an annual step show which is cool to attend.",
            "There are many clubs and activities. We have intramural sports which are fun. I recommend joining Residents Student Association (RSA) that way you get to meet a lot of other students that go the school.",
            "This school is good for all types of students. Especially people who want to be nurses or teachers",
            "The Bobcat Head on front campus is where you can find anyone. You can put up a hammock and just chill.",
            "Georgia College is a really great school. There are a lot of teachers at this school and they make sure that you succeed. You can go to your professor at any time for any problem and they will listen and help. It is a safe environment and I would recommend this school to anyone who wants a good learning and social environment",
            "Even though Milledgeville is a small town there is a lot to do . The wellness center has in inside pool which is heated. The DEN is a fun place to hang out. You can go to Pickle Barrel and sing Karaoke or go to Fun Zone and go skating. There is also Capital which is walking distance from campus",
            "The food is pretty good and there is a lot to choose from. The dining hall was just redone and it is amazing.",
            "The dorms are cozy and you make more friends and connections by staying in the dorms. The dorms have fun programs that make the dorm life more exciting.",
            "The classes are good and the teachers teach their subject well. The teachers share a passion for the subject that they teach and the students can tell.",
            "Make sure you become friends with your teachers and your adviser because you will need them.",
            "They have smaller classrooms. The teachers are more one on one with the students. The campus is beautiful."
        ]
    ],
    "pageTitle": "Georgia College and State University (GCSU) Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Georgia-College-State-University/reviews?_escaped_fragment_=/show/3961",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988840.31/warc/CC-MAIN-20150728002308-00032-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 902028911,
    "recordOffset": 901932687,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{42016=it is unusual that georgia college does not have a football team, but one of our traditions since we don't have a football team is to have homecoming in february with a basketball game. as far as locations, we have the west campus which is up and coming, but is a little off campus. some look at it as a good thing but others don't see it as a good thing., 4032=My favorite part about the college is that Georgia College and State University is beautiful. So many people sit outside of the dorms and play their guitars and sit around and talk even if they don't know you. As I walk to class I leave at least half an hour early so I can listen to people play music or socialize with people. When I had an hour between my Biology 1108 and lab, I would sit on front campus with a book underneath a tree with my friends that were going to class with me. You get a lot of fresh air because the wind gently breezes through, and they have lots of trees, grass, and bushes to circulate clean air. They also have a lot of intramural teams, clubs, and sports. You don't have to know how to play a sport to be on an intramural team, in fact it's more fun to get a bunch of your friends together and go play! Or if you know a lot of friends joining one and you don't want to play they allow you to stand on the field and cheer for the teams. Since I am a female I am usually cautious about my safety, but I have never questioned my safety since I have arrived. The whole campus has lighting at night and even the Grove (the apartments behind the dorms) has lighting. Some of my friends live in the Grove and I was worried about walking the extra distance to see them, until I saw how well I could see the road I had to cross. Also if you ever feel uncomfortable walking alone they have a golf cart that goes around campus at night offering to give you a ride (S.N.A.P). If you ever need the number it is posted around campus and inside Sodexo (commonly known as Saga). Also You don't have to worry about waking up really early just to get to class on time. Everything is about 10 minutes away from the furthest dorm (Foundation)., 2792=Everything will seem expensive at first dorms over $2000 a semester, freshmen requiring meal plans at $1800 a semester, then classes, student fees in the dorms, activity fees, transportation fees, and so forth. But when you add up all the benefits of what you don't have to pay for when you get to college (computer lab, study rooms, dorm pizza parties, dorm Halloween parties, computer repairs and so forth) you begin to realize you're actually not paying an outrageous price for college. Compare the prices to other schools. This college has small classes almost like a private school, but you're paying for a public college. Dorms are expensive, but the fancy apartments are about the same price. You will save more money after your freshman year, but overall you don't spend more than you estimate. The bookstore is a little sneaky and over price you, but you can always avoid the bookstore by finding them elsewhere or rent them like I did., 378253=October Fest The Pit- park near the railroad, 458340=© 2015, Cappex.com, LLC, 427923=I've been at GCSU almost 3 years and I've never had a bad roommate. Rooms are nice, well-lit, and have the basics. You also have a lot of say in decorating. You can't paint your room of course, but there are a ton of things you can do to make the space cozy. You'll either have a single (2 rooms with 1 in each) or a double (2 rooms with 2 in each). The layout, size of each room varies a little bit, so it's best to learn the general makeup of each building so you can get one that suits you best. They're all (except Bell) about 10 minutes away from Campus and the Downtown area, and there's no worries about rent or utilities. It's also an easy way to get started making friends. They're convenient, and they more than serve their purpose. A bus comes around every weekend to take you to the grocery store and the mall if you need something but don't have a ride (or don't feel like losing your parking spot). The Villages are a great option as well. They're further from campus, and more expensive of course, but you have a 12 month lease (you won't have to move out during the summer/winter breaks). I'd advise having a car though, since there have been a few times where the weather has made hopping on the bus to campus inconvenient or impossible. A word of Caution: Finding a great parking spot at GCSU is quite an experience. May the odds be ever in your favor., 246506=Our most unusual tradition is not stepping on the bobcats on front campus, it is supposedly unlucky. My favorite tradition is deep roots festival every october, it is the same weekend at family weekend. All the streets are closed off and there are vendors our and just a ton of fun., 400847=I always feel safe when I am walking around campus, even if I am by myself and it is 1:30 am. There are emergency stations everywhere as well as Milledgeville and GCSU police on every corner.}",
    "textBeforeTable": "12/15/2009 Reviewer is A current student here. 16 out of 16 people found this review useful. 1 of 90 Jennifer from Hiram, GA Check out reviews left by other students or leave your own review. You could win a free scholarship. Georgia College and State University Reviews Georgia College and State University › Georgia › By State › Colleges › } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.create', -->",
    "textAfterTable": "Am learning a lot With class sizes only 20-25 students teachers have a better chance to get to know you personally and help you with any problems you are having. Just about every class is equipped with power point and computers to help students learn. There is also a tutoring center, language labs, science labs, and a space lab where you can learn about different stars. Recently we have added a nursing and exercise science building to give students a more hands on experience. There are also several opportunities to join research teams. Login to rate or flag the reviews Caitlin from Mcdonough, GA 06/09/2009 Reviewer is Accepted here and planning to attend soon. Reviewer has been to campus. 5 out of 6 people found this review useful. 3 of 90 Categories Comments Great for these types of students This is a good school for students that want a small town. and a liberal arts college. It offers a lot of courses, and a lot of majors. The campus is",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}