{
    "relation": [
        [
            "Categories",
            "Clubs and Activities",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "I was involved with PRSSA (Public Relations Student Society of America) as a freshman. This club applied to my major as well as introduced me to upperclassmen in the major who helped me with courses they had already taken. I joined the women's rugby team my freshman having never played before. I missed being a part of a team and decided to give it a shot. Throughout the season I had allowed myself to learn a new sport I had never watched before, work toward a healthier life-style, and most importantly build strong friendships with other girls on the team. I recently put in an application to be a part of the Public Relations committee of PUDM. I really hope to be accepted as a committee member I enjoy working with others and feel like I could benefit by sharing new ideas.",
            "There is always something to do on campus. Get involved with a club or a club-sport team in order to meet more people and take some time away from studying. I joined the women's rugby team my freshman year and loved every moment of it.",
            "The dining courts at Purdue are the epitome of perfection. Purdue's dining courts prepare a variety of wholesome foods that conquer any cravings one may have. They supply a variety of meals and snacks that are healthy and easy for students to grab if they are on-the-go.",
            "Dorm life is quite an experience, but an awesome way to meet new people. I would suggest taking a random room mate to give yourself the opportunity to branch out and introduce yourself to new groups of people. I met people in my dorm that have benefited me both socially and academically.",
            "The work expected from students is not easy. In order to produce solid grades one has to have a strong sense of time management . Take advantage of review sessions and one-on-one opportunities with teacher's assistants and professors.",
            "My tips for prospective students would be to get involved in clubs and committees that apply to your field of study and personal interests. The whole campus is made up or others that are striving for the same goal; to be successful. Interacting with others will only benefit you!",
            "Purdue University is a thriving campus with a majority of academic opportunities to students. The Purdue staff is made up of highly intelligent people who supply beneficial knowledge and networking opportunities to all students. My experience so far at Purdue has been amazing, I couldn't see myself studying anywhere else."
        ]
    ],
    "pageTitle": "Purdue University Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Purdue-University-Main-Campus/reviews?_escaped_fragment_=/show/48697",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 225,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988840.31/warc/CC-MAIN-20150728002308-00340-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 909379715,
    "recordOffset": 909179842,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{83635=Everyone has to go on a fountain run at least once while they are attending purdue. Usually, after a winning home game, the student section will sprint across campus and run through the two fountains in celebration. It is especially great on hot days in august and september! Also, you have to make a stop at the discount den and buy a den pop (yes, we call it pop, not soda). A den pop allows you to mix different drinks together, all for a cheap price., 886002=There are over 1000 clubs on campus, I'm sure you can find something!, 168321=Definitely take a tour. This lets you get a feel for the dorms and how far they will be from your classes. If your from out of state, definitely ask about the weather. Several of my friends had to make emergency trips to Walmart because they didn't have any winter clothing. If you can, try leaving your winter clothes at home for the warm months, and then switching your wardrobe over a break, so that you don't bring more clothes than you have room for, because you won't need that cute turtleneck sweater in August., 1103428=When you apply, be creative and be yourself. Apply by November 1st so that you can be considered for Scholarships and Honors College., 124742=Friday night's before home football games there is a walk with the team over the bridge . The marching band plays for the crowd as they march through the campus before each home game ., 152267=Do not schedule classes before 8:30 am ever and meet as many people as possible. There are 20,000 different students at Purdue, surely there is someone that you can connect with and friends make the experience that much better!, 877891=Try and really reach out during BGR, but don't feel bad if you don't click with the people from your group! My best friends were ones that I met through my roommate. Also, if you want to get an apartment, sign in October to get the best choice! We signed early November, and we were almost too late!, 856517=I've only been there once, but it was a fun experience. I learned a lot about Purdue, and may attend this coming fall of 2013., 435076=hanging out with friends are always great, going to the union is a good option. you can bowl or play pool, or simply just have a cup of coffee and chat with friends. the new gym will be completed in the fall of 2012, so you will have a great new place to workout and play sports. joining a club is always a good idea, there's no better way to meet other people who likes what you like too., 1082302=Very safe environment. Police officers are always around. Here is Purdue 2012-2013 Annual Security Report: http://www.purdue.edu/police/pdf/YourCampus.pdf, 746097=With almost 1000 clubs to join Purdue is the place for working out and having fun. JThey also just built a new recreation center as well which boasts a ton of sporting facilities and equipment. There is always something to do at Purdue in the fun sense., 694910=I've walked around at 3:30 am and felt perfectly at home.}",
    "textBeforeTable": "07/16/2009 Reviewer is A current student here. 55 out of 55 people found this review useful. 1 of 322 Erika from Indiana Check out reviews left by other students or leave your own review. You could win a free scholarship. Purdue University-Main Campus Reviews Purdue University-Main Campus › Indiana › By State › Colleges › } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.create', -->",
    "textAfterTable": "Categories Comments Great for these types of students Students that want to learn and enjoy a big campus with lots of diversity. The campus is within the city so students who love having many things to do on the weekends will love this school. Purdue is so active during the night and this makes the campus an amazing place to be. Tips for prospective students Make sure you go to all of your classes. Many professors will give extra credit points or actual points for good attendance. Most of your classes will not have a lot of homework and only a few tests so every point you earn is important. There are rarely any easy points in college. Set aside time to study each week, that way you won't panic when the tests come around. For many of the harder classes, it is recommended to begin studying for test AT LEAST a week in advance. Don't procrastinate or you'll be very sorry when the grades come out at the end of the semester. Also, try to get involved around campus. This helps you make friends and will look good on future resumes. Also, having some good friends will help you get through your first year. Go home as little as possible. Several people I know went home to visit their boyfriends almost every weekend during the school year. These people now have",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}