{
    "relation": [
        [
            "Keyword",
            "cuseeme",
            "dhcp (Client)",
            "dhcp (Server)",
            "dns",
            "finger",
            "ftp",
            "gopher",
            "http",
            "httpssl",
            "imap",
            "irc",
            "kerberos",
            "l2tp",
            "ldap",
            "mssql",
            "nfs",
            "nntp",
            "notes",
            "ntp",
            "pcany",
            "pop3",
            "pptp",
            "simap",
            "sirc",
            "sldap",
            "smtp",
            "snntp",
            "spop3",
            "ssh",
            "telnet"
        ],
        [
            "Protocol",
            "TCP UDP",
            "UDP/TCP",
            "UDP/TCP",
            "UDP/TCP",
            "TCP",
            "TCP",
            "TCP/UDP",
            "TCP/UDP",
            "TCP",
            "TCP/UDP",
            "TCP/UDP",
            "TCP/UDP",
            "UDP",
            "TCP/UDP",
            "TCP",
            "TCP/UDP",
            "TCP/UDP",
            "TCP/UDP",
            "TCP/UDP",
            "UDP TCP",
            "TCP/UDP",
            "TCP",
            "TCP/UDP",
            "TCP/UDP",
            "TCP/UDP",
            "TCP",
            "TCP/UDP",
            "TCP/UDP",
            "TCP",
            "TCP"
        ],
        [
            "Port",
            "7648 7649 7648 7649 24032",
            "68",
            "67",
            "53",
            "79",
            "20 21",
            "70",
            "80",
            "443",
            "143 220",
            "194",
            "88 749",
            "1701",
            "389",
            "1443",
            "2049",
            "119",
            "1352",
            "123",
            "22 5632 65301 5631",
            "110",
            "17233",
            "585 993 (Preferred)",
            "994",
            "636",
            "25",
            "563",
            "123",
            "22",
            "23"
        ]
    ],
    "pageTitle": "Cisco IOS Optimized Edge Routing Command Reference - S through U [Support] - Cisco",
    "title": "",
    "url": "http://www.cisco.com/c/en/us/td/docs/ios-xml/ios/oer/command/oer-cr-book/oer-s1.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 225,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987174.71/warc/CC-MAIN-20150728002307-00299-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 365097007,
    "recordOffset": 365004367,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{580352=2049, 7976=The following example shows how to configure a TCP connection message probe with a forced target assignment within an PfR map. The 10.1.2.10 address is the forced target assignment, the target port is defined as 29, and the DSCP value is set to ef. A remote responder must be enabled on the target device. This example requires Cisco IOS Release 15.0(1)M, 12.2(33)SRE, or a later release., 1541=Codec value, must be one of the following:, 55347=Number (in milliseconds) in the range from 1 to 1000, where 1 represents the highest voice quality, and 1000 represents the lowest voice quality. The default value is 30., 74035=Sets a relative percentage of packet loss based on a comparison of short-term and long-term packet loss percentages. The range of values that can be configured for this argument is a number from 1 to 1000. Each increment represents one tenth of a percent., 658636=milliseconds : 1000, 581130=1352, 1171=(Optional) Only used with the jitter probe type. Specifies the codec value used for Mean Opinion Score (MOS) calculation., 363917=codec, 7485=The following example shows how to configure an ICMP reply (ping) message probe with a forced target assignment within an OER map. The 10.1.2.10 address is the forced target assignment. A remote responder must also be enabled on the target device., 364015=Displays the codec value configured for MOS calculation. Codec values can be one of the following: g711alaw, g711ulaw, or g729a., 1040=codec, 544332=Codec, 579190=1701, 31845=The following example creates an OER map named DELAY that sets the absolute maximum delay threshold to 2000 milliseconds for traffic from the prefix list named CUSTOMER:, 579964=1443, 26133=Sets a relative delay policy based on a comparison of short-term and long-term delay percentages. The range of values that can be configured for this argument is a number from 1 to 1000. Each increment represents one tenth of a percent., 172084=Sets a relative percentage of unreachable hosts based on a comparison of short-term and long-term percentages. The range of values that can be configured for this argument is a number from 1 to a 1000. Each increment represents one tenth of a percent.}",
    "textBeforeTable": "Static Application List Keywords Table 41 The table below displays the keywords that represent the application that can be configured with the traffic-class application command. Replace the application-name argument with the appropriate keyword from the table. The traffic-class access-list command, the traffic-class application command, the traffic-class application nbar command, and the traffic-class prefix-list commands are all mutually exclusive in an OER learn list. Only one of these commands can be specified per OER learn list. Note In Cisco IOS Release 12.4(15)T, the learn list configuration mode was introduced. Learn lists are a way to categorize learned traffic classes. In each learn list, different criteria for learning traffic classes including prefixes, application definitions, filters, and aggregation parameters can be configured. A traffic class is automatically learned by OER based on each learn list criteria, and each learn list is configured with a sequence number. The sequence number determines the order in which learn list criteria are applied. Learn lists allow different OER policies to be applied to each learn list; in previous releases, the traffic classes could not be divided, and an OER policy was applied to all the",
    "textAfterTable": "Examples The following example, starting in global configuration mode, shows how to define application traffic classes using two OER learn lists, LEARN_REMOTE_LOGIN_TC and LEARN_FILE_TRANSFER_TC. The number of traffic classes to be learned in both learn list sessions is set to 50, and the maximum number of traffic classes to be learned for all sessions of the learn list is set to 90. The remote login traffic class is configured using keywords representing Telnet and Secure Shell (SSH) traffic and the resulting prefixes are aggregated to a prefix length of 24. The file transfer traffic class is configured using a keyword that represents FTP and is also aggregated to a prefix length of 24. A prefix-list is applied to the file transfer traffic class to permit traffic from the 10.0.0.0/8 prefix. The master controller is configured to learn the top prefixes based on highest outbound throughput for the filtered traffic and the resulting traffic classes are added to the OER application database to be passively and actively monitored.  Router(config)# ip prefix-list INCLUDE_10_NET 10.0.0.0/8 Router(config)# oer master  Router(config-oer-mc)# learn  Router(config-oer-mc-learn)# list seq 10 refname LEARN_REMOTE_LOGIN_TC Router(config-oer-mc-learn-list)# count 50 max 90 Router(config-oer-mc-learn-list)# traffic-class application telnet ssh Router(config-oer-mc-learn-list)# aggregation-type prefix-length 24  Router(config-oer-mc-learn-list)# throughput  Router(config-oer-mc-learn-list)# exit Router(config-oer-mc-learn)# list seq 20 refname LEARN_FILE_TRANSFER_TC Router(config-oer-mc-learn-list)# count 50 max 90 Router(config-oer-mc-learn-list)# traffic-class application ftp filter INCLUDE_10_NET Router(config-oer-mc-learn-list)# aggregation-type prefix-length 24  Router(config-oer-mc-learn-list)# throughput Router(config-oer-mc-learn-list)# end",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}