{
    "relation": [
        [
            "Down Payment Amount",
            "Less than 5%*",
            "5% to 9.99%",
            "10% or more"
        ],
        [
            "Veteran/Active Duty",
            "2.15%",
            "1.50%",
            "1.25%"
        ],
        [
            "Reservist/National Guard",
            "2.40%",
            "1.75%",
            "1.50%"
        ]
    ],
    "pageTitle": "Kentucky VA Mortgage Home Lender | Kentucky VA Mortgage Loans.",
    "title": "",
    "url": "https://kentuckyvaloan.wordpress.com/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987174.71/warc/CC-MAIN-20150728002307-00218-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 853939719,
    "recordOffset": 853799189,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{8346=2015 Kentucky VA Mortgages Qualifying Guidelines:, 8260=620 Minimum Credit Score with most mortgage investors, though some mortgage companies will go all way down to a 530 credit score in some cases. No Bankruptcies in the last 2 years 100% Financing, Zero Down payment No monthly mortgage insurance Termite report required with a clean report Any damage noted on termite report must be fixed before closing Maximum debt to income rations are approved on AUS findings with a manual underwrite sticking at 41% on the dti. Residual Income Requirements on all VA loans with most set around $1200 a month}",
    "TableContextTimeStampAfterTable": "{289092=2013 Kentucky VA Loan Limits for counties, 11528=The funding fee for ALL subsequent use loans closed on or after October 1, 2006, and before October 1, 2007, is 3.35 percent. This applies to all purchase loans where no down payment of 5 percent or more is made as well as cash-out refinances where the fee would have been 3.3 percent. Effective October 1, 2007, the subsequent use fee reverts back to 3.3 percent., 727989=9/30/2012, 728048=FY 2013 Effective, 727507=Effective on October 1, 2012, the start of Fiscal Year (FY) 2013, Rural Development will revise the Up-Front Guarantee Fee and the monthly mortgage insurance fee structure as follows on a Kentucky USDA Mortgage loans in Kentucky for the Guaranteed Loan RHS :, 726578=Company ID #1364 | MB73346 http://mylouisvillekentuckymortgage.com/, 626274=• All IRRRLs must contain either a conforming appraisal or a 2055 exterior (at minimum). The loan amount + funding fee must be supported by the value., 756569=“Joel has always worked very hard to keep his word and to work out seasonable solutions to difficult problems. He is truly an expert in FHA and other type loans.” September 1, 2010, 109850=VA loans offer the following important features: Ensure that all veterans are given an equal opportunity to buy homes with VA assistance, without regard to their race, color, religion, sex, handicap, familial status, or national origin; No downpayment (unless required by the lender, the purchase price is more than the reasonable value of the property as determined by VA, or the loan is made with graduated payment features); A freely negotiable fixed interest rate competitive with conventional mortgage interest rates; The buyer is informed of the estimated reasonable value of the property; • Limitations on closing costs; An assumable mortgage. However, for loans closed on or after March 1, 1988, the assumption must be approved in advance by the lender or VA. Generally, this involves a review of the creditworthiness of the purchaser (ability and willingness to make the mortgage payments). Be sure to see section entitled “Loan Repayment Terms”; Long amortization (repayment) terms;, 69931=Minimum 2055 conventional appraisal is required., 133778=13. Can a veteran or active duty servicemember who is eligible for a Specially Adapted Housing (SAH) grant apply for a GI home loan from a private lender to cover the difference between the total cost of the house and the SAH grant? Yes. A veteran or active duty servicemember who is eligible for a Specially Adapted Housing (SAH) grant can apply for a GI home loan from a private lender to cover the difference between the total cost of the house and the SAH grant. SAH program eligibility requirements and points of contact information are available at http://www.benefits.va.gov/homeloans/sah.asp. 14. If private financing is not available, can VA make the veteran or active duty servicemember a direct loan to cover the difference between the total cost of the house and a Specially Adapted Housing (SAH) grant? Yes, provided the veteran or active duty servicemember has GI home loan entitlement and qualifies from a credit standpoint. The maximum direct loan is currently $33,000. ELIGIBLE LOAN PURPOSES You may use VA-guaranteed financing: • To buy a home. • To buy a townhouse or condominium unit in a project that has been approved by VA.  To build a home.  To repair, alter, or improve a home.  To simultaneously purchase and improve a home. . To improve a home through installment of a solar heating and/or cooling system or other energy efficient improvements. To buy a manufactured (mobile) home and/or lot. To buy and improve a lot on which to place a manufactured home which you already own and occupy. To refinance a manufactured home loan in order to acquire a lot. (See VA Pamphlet 26- 71-1, which is available on the internet at: http://www.benefits.va.gov/homeloans/vap26-71- 1.asp, for more information about manufactured home loans.) Questions and Answers 1. Can a veteran get a VA loan to pay off the mortgage or other liens of record on his or her home? Yes. The following refinancing loans are available under the VA-guaranteed home loan program:  To pay off the mortgage and/or other liens of record on the home. In most cases, the loan may not exceed 90 percent of the reasonable value of the property as determined by an appraisal, plus the funding fee, if required. The loan may include funds for any purpose which is acceptable to the lender, plus closing costs, including a reasonable number of discount points. A veteran must have available home loan entitlement. An existing loan on a manufactured home (except as noted below) may not be refinanced with a VA-guaranteed loan.  To refinance an existing VA loan to obtain a lower interest rate. Use of additional loan entitlement is not required. The loan amount is limited to the balance of the old loan plus the closing costs, discount points, funding fee, and up to $6,000 in energy efficient improvements. An existing VA loan on a manufactured home may be refinanced to obtain a lower interest rate. 2. Can a veteran get a VA business loan? No, but business loans may be obtained through the SBA (Small Business Administration). The SBA gives preference to veterans wishing to obtain small business assistance. For more information on this financing, consult your telephone directory for the SBA office nearest you or visit http://www.vetbiz.gov for general information on veterans in business. 3. Can a veteran get a VA farm loan? No, except for a farm on which there is a farm residence which will be personally occupied by the veteran as a home. The veteran may or may not conduct farming operations. If farming operations are to be the primary source of the borrower’s income, then it must be established that the venture has a reasonable likelihood for success. If the borrower plans to use the residence, but has a source of income other than the farm which will be the primary source of income, then the farming operations need not be considered. Other types of farm financing may be obtained through the Farmers Home Administration which gives preference to veteran applicants. Additional information can be obtained by contacting a local office of that agency, the address and telephone number of which can be found in your telephone directory. 4. Can a veteran get a VA loan to buy or construct a residential property containing more than one family unit? Yes, but the total number of separate units cannot be more than four if one veteran is buying. If more than one veteran i buying, then one additional family unit may be added to the basic four for each veteran participting; thus, one veteran could buy four units; two veterans, six units; three veterans, seven units, etc. In addition, if the veteran must depend on rental income from the property to qualify for the loan, the veteran must (a) show that he or she has the background or qualifications to be successful as a landlord, and (b) have enough cash reserves to make the loan payments for at least 6 months without help from the rental income. 5. Can a veteran get a VA loan to purchase a cooperatively-owned apartment? VA is authorized to approve loans made to purchase a unit in a cooperative (co-op); however, only a limited number of lenders have shown an interest in this type of loan. 6. Can a veteran obtain a VA loan for the purchase of property in a foreign country? No. The property must be located in the United States, its territories, or possessions. The territories and possessions are Puerto Rico, Guam, Virgin Islands, American Samoa, and Northern Mariana Islands. 7. Can a veteran obtain a loan from a private lender in one State for the purchase of property in another State? Yes. However, many lenders limit their lending operations to certain areas. 8. May a lender require security from the veteran in addition to the property being purchased? Yes. This is a matter between the veteran and the lender. While VA does not require that additional security be taken, it does not object if the veteran is willing. APPLYING FOR THE LOAN VA-guaranteed loans are obtained by making an application to private lending institutions. Lenders may be found by asking in the community in which you live what firms in the area make home loans. This information may be obtained from the local chamber of commerce, by looking in the telephone directory under “Mortgages,” or by inquiring at banks, savings and loan associations, mortgage companies, real estate brokers’ offices, and other public and private lending agencies. Most mortgage lenders will have the forms and other necessary papers to apply for a certificate of eligibility and for the loan and will help you fill them out. Any lender who does not have the forms may obtain them from VA. If you have a certificate of eligibility, you should present it to your lender when making your loan application, because the lender will want assurance that you are eligible before accepting the application. However, a lender will undoubtedly discuss the possibility of making a VA loan to you without seeing the certificate. In fact, many lenders will assist you in applying for a certificate It is most important that you not make any commitments based on an expected approval of your loan. You should not, for example, give notice to your landlord until the loan is actually approved of eligibility. So, even if you have not obtained a certificate, you should not delay making an application to a lender for a loan just for this reason. To reduce delays in the processing of the loan, you should be prepared to give the lender the complete names and addresses and your employee identification numbers for present and past employers covering a 2-year period. You should also have available the location and account numbers for savings and checking accounts and all open and recently closed debts and obligations. Questions and Answers 1. If a lender is unwilling to accept a veteran’s application for a loan, what should the veteran do? The veteran should see another lender. The fact that one lender is not interested in making the loan the veteran wants does not mean that other lenders will not make the loan. 2. How are VA loans processed? There are two ways a lender may process VA home loans: “prior approval” or “automatic.” When the loan is processed on a prior approval basis, the lender takes your application, requests VA to appraise the property, and verifies your income and credit record. All this information is put together in a loan package and sent to VA for review. If VA approves the loan, a commitment by VA to guarantee the loan is sent to the lender. The lender then closes the loan and sends a report of the closing to VA. If the loan complies with VA requirements, VA issues the lender a certificate of guaranty. In automatic processing, the lender still orders an appraisal from VA, but has the authority to make the credit decision on the loan without VA’s approval. The biggest difference between prior approval and automatic processing is the time saved by avoiding the need to await VA’s approval before loan closing. All lenders do not have the authority to process loans on the automatic basis. Banks, savings and loan associations, and certain other lenders such as mortgage companies which are approved by VA, have the privilege of processing VA-guaranteed loans using the automatic procedure. Lenders approved to participate in VA’s Lender Appraisal Processing Program (LAPP) are generally able to expedite the processing of VA appraisals. 3. What should a veteran do while waiting for loan approval? Sometimes it may take longer than you might expect for the lender or VA to process your loan application. For instance, your current or former employer may be slow in returning an employment verification form, or it may take some time to obtain a credit rating from out-of-State creditors. Occasionally, the application VA receives from the lender is incomplete in some important aspect and requires that VA ask the lender to furnish additional information before a final decision can be made. Ordinarily, you should plan on an average of 4 to 6 weeks to obtain a decision on your application. In any case, information on the progress of your application should be obtained from the lender, who will be most aware of developments as they occur. by VA (or by your lender if the automatic processing procedure is used). Generally, it is not advisable to move into the home before the loan is approved. If for some reason the loan is not obtained, you could be faced with additional expense and inconvenience. 4. What is pre-purchase counseling and why would it be helpful? Pre-purchase counseling is especially helpful to a first time homebuyer. It gives a person useful information on (1) the process of buying a home, (2) the key players in the home buying process and (3) debt management. The goal is to create a more well informed homebuyer. While VA does not require such counseling, we strongly recommend it. There is usually no charge for the housing counseling. To locate a housing counseling office, call (800) 569-4287. This is a Department of Housing and Urban Development (HUD) maintained number and referral service. LOAN REPAYMENT TERMS The maximum VA home loan term is 30 years and 32 days; however, the term may never be for more than the remaining economic life of the property as determined by the appraisal. Questions and Answers 1. May a veteran pay off a VA loan before it becomes due? Yes. A VA loan may be partially or fully paid at any time without penalty. Partial payments may not be less than 1 monthly installment or $100, whichever is less. (Consult your lender.) 2. May the maturity on a VA loan be extended to reduce the monthly payments? Yes, provided the veteran and the lender want to extend it and the extension provides for complete repayment of the loan within the maximum period permitted for loans of its type. 3. If a veteran dies before the loan is paid off, will the VA guaranty pay off the balance of the loan? No. The surviving spouse or other coborrower must continue to make the payments. If there is no coborrower, the loan becomes the obligation of the veteran’s estate. Protection against this may be obtained through mortgage life insurance, which must be purchased from private insurance sources. 4. Will the veteran’s payments always be paid to the same company? No. It is common practice in the mortgage lending industry to sell mortgages, often before the first payment is even due. If your loan is sold, you may find that you sent your first payment to the wrong place and the new holder of your loan may send you an overdue notice. Even though you know you made the payment, and it is up to the two lenders to get it straightened out, do not ignore the notice. (Most lenders will notify the veteran if the loan is sold and help straighten out any problems.) 5. Does having a VA loan limit a veteran’s right or ability to sell the property? No. A veteran may sell the property to a veteran or nonveteran at any time. However, if the loan was approved on or after March 1, 1988, and it will be assumed, the qualifications of the assumer must be reviewed and approved by the lender or VA. 6. When a veteran sells the property to someone who will assume the existing VA loan, is the veteran released automatically from personal liability for repayment of the loan? No. If the loan was approved on or after March 1, 1988, the lender or VA must be notified and It is most important that you not make any commitments based on an expected approval of your loan. You should not, for example, give notice to your landlord until the loan is actually approved requested to approve the assumer and grant the veteran release from liability. If the loan was approved prior to March 1, 1988, the loan may be assumed without approval from VA or the lender. However, the veteran is strongly urged to request a release of liability from VA. 7. If a loan closed prior to March 1, 1988 can be assumed without VA’s approval, why should a veteran be concerned about requesting and obtaining a release from personal liability? If a veteran does not obtain a release of liability, and VA suffers a loss on account of a default by the assumer or some future assumer, a debt may be established against the veteran. Also, strenuous collection efforts will be made against the veteran if a debt is established. 8. How may a veteran obtain a release of liability from VA? By having the buyer assume all of the veteran’s liabilities on the VA loan, and by having VA or the loan holder approve the buyer and the assumption agreement. If the VA loan was approved prior to March 1,1988, the application forms for a release of liability must be requested from the VA Regional Loan Center of Jurisdiction. In most cases, if the VA loan was approved on or after March 1, 1988, the application forms must be requested from the lender to whom the payments are made. 9. If a veteran obtains a release of liability, is restoration of entitlement automatic? No. Restoration requirements may be found in the above information. REPAYMENT PLANS VA will guarantee loans to purchase homes made with the following repayment plans:  Traditional Fixed-Payment Mortgage This type of mortgage loan calls for equal monthly payments for the life or term of the loan. Each monthly payment reduces a certain portion of the principal owed on the loan and pays interest accrued to date.  GPM (Graduated Payment Mortgage) This repayment plan provides for smaller-than-normal monthly payments for the first few years (usually 5 years), which gradually increase each year, and then level off after the end of the “graduation period” to larger-than-normal payments for the remaining term of the loan. The reduction in the monthly payment in the early years of the loan is accomplished by delaying a portion of the interest due on the loan each month and by adding that interest to the principal balance.  Buydowns The builder of a new home or seller of an existing home may “buy down” the veteran’s mortgage payments by making a large lump-sum payment up front at closing that will be used to supplement the monthly payments for a certain period, usually 1 to 3 years.  GEM (Growing Equity Mortgage) This repayment plan provides for a gradual annual increase in the monthly payments with all of the increase applied to the principal balance. The annual increases in the monthly payment may be fixed (for example, 3 percent per year) or tied to an appropriate index. The increases to the monthly payment result in an early payoff of the loan in about 11 to 16 years for a typical 30 year mortgage.  ARM (Adjustable Rate Mortgages) FUNDING FEE ARM loans are typically made at an initial interest rate lower than market rate; however the interest rate can be adjusted – up or down – during the life of the loan. A one year ARM allows for annual adjustments of no more than 1percent and a lifetime cap of 5 percent. Hybrid ARM loans allow for an initial fixed rate for a period of at least 3 years, followed by annual adjustments. Depending on the length of the fixed rate period, the initial adjustment can be up to 2 percent and the lifetime cap is either 5 percent or 6 percent. DOWNPAYMENT REQUIREMENTS  Traditional Fixed-Payment Mortgage, Buydown Loans, and Growing Equity Mortgage VA does not require a downpayment if the purchase price or cost is not more than the reasonable value of the property as determined by VA, but the lender may require one. If the purchase price or cost is more than the reasonable value, the difference must be paid in cash from your own resources.  Graduated Payment Mortgage The maximum loan amount may not be for more than the reasonable value of the property or the purchase price, whichever is less. Because the loan balance will be increasing during the first years of the loan, a downpayment is required to keep the loan balance from going over the reasonable value or the purchase price. INTEREST RATES The interest rate on VA loans can be negotiated based on prevailing rates in the mortgage market. Once a loan is made, the interest rate set in the note will stay the same for the life of the loan. However, if interest rates go down, and you still own and occupy (or previously occupied) the property securing a previous VA loan, you may apply for a new VA loan to refinance the previous loan at a lower interest rate without using any additional entitlement. CLOSING COSTS The cost of obtaining any mortgage can be quite a lot. VA regulates those closing costs that a veteran may be charged in connection with closing a VA loan. No commission or brokerage fees may be charged to you for obtaining a VA loan. However, you may pay reasonable closing costs to the lender in connection with a VA-guaranteed loan. Although some additional costs are unique to certain localities, the closing costs generally include VA appraisal, credit report, survey, title evidence, recording fees, a 1 percent loan origination fee, and discount points. The closing costs and origination charge may not be included in the loan, except in VA refinancing loans. In addition to negotiating the interest rate with the lender, veterans may negotiate the payment of discount points and other closing costs with the seller. Often, sellers will consider paying some or all of the discount points required by the lender in order to complete the sale. This can have a big impact on the amount of cash you must pay out of pocket in order to complete the purchase. If the seller will not consider paying points, the veteran may be able to negotiate an interest rate with the lender which is sufficient to avoid the need to include any discount points in the transaction. Therefore, if you are seeking to use your entitlement to buy a home, you may be assured that VA will protect your civil rights and equal housing opportunity. Veterans must also pay a VA funding fee at the time of loan closing. The fee may be included in the loan and paid from loan proceeds. The fee is not required from veterans in receipt of serviceconnected compensation, or who would be but for receipt of military retired pay, or surviving spouses of veterans who died in service or from service-connected causes. EQUAL HOUSING OPPORTUNITY Discrimination in the sale of housing because of race, color, religion, sex, handicap, familial status, or national origin is prohibited by Federal laws. In November 1962, Executive Order 11063 banned discrimination in all federally assisted housing. The “Fair Housing Law,” Title VIII of the Civil Rights Act of 1968, followed by amending legislation, required positive action be taken by Federal agencies to prevent discrimination in all housing. Further, Title VIII protects you from the following acts when they are based on discrimination on account of race, color, religion, sex, handicap, familial status or national origin: Refusal to deal, Discrimination in terms of sale, Discriminatory advertising, False representations that a dwelling is not available, Blockbusting, Discrimination in financing, and Discrimination in real estate services. These laws provide every person an equal opportunity to choose suitable housing. The Department of Veterans Affairs affirmatively administers the VA housing program by assuring that all veterans are given an equal opportunity to buy homes with VA assistance. All VA program participants–builders, brokers and lenders offering housing for sale with VA financing–must comply with Executive Order 11063 and the Civil Rights Act of 1968, as amended. Builders must sell newly constructed homes with VA financing to eligible veterans without regard to the race, color, religion, sex, handicap, familial status or national origin of the veteran. Brokers participating in the VA home loan program must not discriminate against a person on the basis of race, color, religion, sex, handicap, familial status or national origin by refusing to show or sell a property; by discriminating in the terms of the sale; or by representing that property as not available for inspection. Lenders participating in the VA loan program are required by the Civil Rights Act of 1968, as amended, to act on applications for VA home loans without regard to the race, color, religion, sex, handicap, familial status or national origin of the veteran. In addition, the Equal Credit Opportunity Act prohibits a lender from discriminating against an applicant on the basis of the foregoing, or on the basis of age or marital status; because an applicant’s income derives from any public assistance program; or because the applicant has exercised any right under the Consumer Credit Protection Act. Lenders are also prohibited from discouraging applications on these grounds. To ensure that each applicant is fully aware of his or her rights under the Equal Credit Opportunity Act, a lender must provide each applicant with the Equal Credit Opportunity Act Notice and a written statement of reasons when credit is denied. The following actions, when based on discrimination because of race, color, religion, sex, handicap, familial status or national origin, are recognized violations of the Federal fair housing law:  Refusal to negotiate to sell property.  Discrimination in terms or conditions of sale of real property.  Advertising indicating any racial, religious, ethnic or gender preference.  False representations that real property is not available for inspection or sale.  Blockbusting or inducing owners to sell real property by representations regarding entry into the neighborhood of persons of a particular race, color, religion, sex, handicap, familial status or national origin for profit.  Discrimination in financing, terms or conditions of a loan, or denying a loan. If you experience or suspect discrimination by a builder, broker, or lender, VA will investigate. To start a VA investigation, submit a written complaint directly to your VA Regional Loan Center. Your complaint must describe the discriminatory action, including the date it occurred, names, addresses and telephone numbers of all parties involved in the action, and the address of the property involved. VA has a form for this purpose (VA Form 26-8827, Housing Discrimination Complaint) which you may request from VA. You should note that in many localities, fair housing associations have been organized to assist you in locating and purchasing a house of your choosing. There may be such an organization in your area. When the discrimination concerns HUD/FHA (Department of Housing and Urban Development/Federal Housing Administration) home loans and other housing, complaint letters should be sent to the Department of Housing and Urban Development, Assistant Secretary for Fair Housing and Equal Opportunity, Washington, D.C. 20410. If you are unable to find new homes available for sale with VA financing in your area, or if you are unable to determine whether particular homes being built are available for sale with VA financing, we suggest you contact your VA Regional Loan Center. In addition, in many areas VA has repossessed homes which it will sell to qualified buyers. Inquiry as to the availability of any VA repossessed homes for sale in the area in which you are interested may be made by contacting local real estate brokers. Another area to be explored is the existence of State benefits. Many States offer housing programs which are independent from federal programs. The programs and benefits, as well as the qualifying criteria, may differ from one State to the next. Information on State programs may be obtained from State officials or from VA. VA Offices With Loan Activities, 544196=Surviving spouses who obtained a VA loan with the veteran before his or her death can also obtain a VA Interest Rate Reduction Refinance Loan, better known as a VA Streamline refinance. Surviving spouses who remarried upon or after turning age 57 and on or after December 16, 2003, may be eligible for a VA home loan. Surviving spouses who remarried before that date are no longer eligible to participate., 701156=via Kentucky Fannie Mae Mortgage Guideline Changes for 2015., 727925=FY 2012, 546280=You May Be Eligible for a VA Loan If Any One of the Following are True: • You served 181 days during peacetime (Active Duty) • You served 90 days during war time (Active Duty) • You served 6 years in the Reserves or National Guard • You are the spouse of a service member who died in the line of duty or because of a service-connected disability., 422825=NOTE: For all counties other than those listed below, the 2011 limit is $417,000., 757157=“When looking to purchase our new home in 2006, I had the pleasure of meeting Joel Lobb. Not only was he personable and easy to reach, he was extremely knowledgable in his field and made sure to find us the best rate and a top notch mortgage company. We were able to complete the process in less than 3 weeks with his expertise. I find Joel to have the utmost high integrity and I recommend him to anyone who say's they are need of mortgage assistance. He is also fantastic and keeping everyone up to date on the latest in the housing industry through his twitter posts. He provided great results for our family and we still communicate to this day!” August 21, 2010, 97880=You can also apply for a COE by mail–you’ll need to submit VA Form 26-1880, Request for Certificate of Eligibility  and any required additional paperwork to theDepartment of Veterans Affairs. Call them at 1-800-827-1000 to get the current mailing address for COE requests. Some applicants–surviving spouses of military members who died from a service-connected disability, for example–are required to apply by mail., 728090=10/01/ 2012, 2723=Company ID #1364 | MB73346, 756791=“I have wokred with Joel since 1998. He is a great loan professional.” August 23, 2010, 728823=Effective 10/01/2012, 447759=Louisville Kentucky VA home mortgage loans offer many benefits to qualified veterans.  Did you know that since 1944, when home loan guarantees were part of the original GI Bill, the Veterans Administration has guaranteed over 18 million home loans totaling more than $911 Billion?  Loans are available for purchasing or refinancing a home.  Here are a few of the Louisville Kentucky VA mortgages being offered to qualified veterans today., 755987=\"We contacted Joel back in July 2011 to refinance our Mortgage and he was great to work with. We contacted several lenders locally and online, and most where taking almost 60 days to close a refinance, Joel got it done in 23 days start to finish,I would definetly recommmend him. He got us 3.75% with just $900 in closing costs on our FHA Streamline loan., 729302=The FY 2013 fee structure is applicable to all Conditional Commitments (Form RD 1980-18, “Conditional Commitment for Single Family Housing Loan Guarantee”) issued by Rural Development on or after October 1, 2012.  Loan guarantee requests submitted to Rural Development by September 30, 2012, in which…, 23702=Kentucky VA IRRRL Refinance Mortgage Guidelines for 2014, 380487=entitlement available may borrow up to the 2011 VA limit shown below and VA, 607827=Veterans who served on active duty and were discharged under conditions other than dishonorable, during World War II and later periods are eligible for VA loan benefits. World War II (September 16, 1940 to July 25, 1947), Korean conflict (June 27, 1950 to January 31, 1955), and Vietnam era (August 5, 1964 to May 7, 1975) veterans must have at least 90 days’ service. Veterans with service only during peacetime periods and active duty military personnel must have had more than 180 days’ active service. Veterans of enlisted service which began after September 7, 1980, or officers with service beginning after October 16, 1981, must in most cases have served at least 2 years. VA regional office personnel may assist with additional eligibility questions, 528994=2012 Louisville, Ky BAH Rates Basic Allowance for Housing: MHA: KY109 – LOUISVILLE Make your financial plans carefully when factoring in BAH as a contributing source of income for your house payment. Remember, BAH is calculated on local rents. Mortgage amounts are not used to compute Basic Allowance for Housing. You may be able to offset some or all of your monthly mortgage payments using BAH, but it’s not designed to do so., 114877=. 1. How much is the guaranty? VA will guarantee up to 50 percent of a home loan up to $45,000. For loans between $45,000 and $144,000, the minimum guaranty amount is $22,500, with a maximum guaranty, of up to 40 percent of the loan up to $36,000, subject to the amount of entitlement a veteran has available. For loans of more than $144,000 made for the purchase or construction of a home or to purchase a residential unit in a condominium or to refinance an existing VA-guaranteed loan for interest rate reduction, the maximum guaranty is the lesser of 25% or $104,250 which is 25% of the Freddie Mac conforming loan limit for a single family residence for 2007. This figure will change yearly. (For information about entitlement see “Service Eligibility” below.) 2. Is $36,000 the biggest loan a veteran can get? No. You may generally borrow up to the reasonable value of the property or the purchase price, whichever is less, plus the funding fee, if required. For certain refinancing loans, the maximum loan is limited to 90 percent of the value of the property, plus the funding fee, if required. To determine the reasonable value, VA requires an appraisal of the property. (Also see “Downpayment Requirements” below. 3. What is the maximum VA loan? There is no maximum VA loan, except that the loan cannot exceed the lesser of the appraised value or purchase price, plus VA funding fee and energy efficient improvements, if applicable. However, lenders usually won’t make a no-downpayment loan larger than $417,000 ($625,500 in Alaska, Hawaii, Guam, and U.S. Virgin Islands) due to secondary market limitations. 4. Must the loan be repaid? Yes. A VA guaranteed loan is not a gift. It must be repaid, just as you must repay any money you borrow. The VA guaranty, which protects the lender against loss, encourages the lender to make a loan with terms favorable to the veteran. But if you fail to make the payments you agreed to make, you may lose your home through foreclosure, and you and your family would probably lose all the time and money you had invested in it. If the lender does take a loss, VA must pay the guaranty to the lender, and the amount paid by VA must be repaid by you. If your loan closed on or after January 1,1990, you will owe the Government in the event of a default only if there was fraud, misrepresentation, or bad faith on your part. 5. Does VA make any loan directly to eligible veterans? Yes, but only to Native Americans on trust land or to supplement a grant to get a specially adapted home for certain eligible veterans who have a permanent and total service-connected disability(ies). For information concerning direct loans to Native American Veterans see VA Pamphlet 26-93-1, which can be found on the internet at: http://www.benefits.va.gov/homeloans/vap26-93-1.asp. See VA Pamphlet 26-69-1 for information concerning specially adapted housing grants. SERVICE ELIGIBILITY You are eligible for VA financing if your service falls within any of the following categories: Wartime Service. If you served any time during:  World War II (September 16, 1940 to July 25, 1947),  Korean Conflict (June 27, 1950 to January 31, 1955),  Vietnam Era (August 5, 1964 to May 7, 1975), the Vietnam Era begins February 28, 1961 for individuals who served in the Republic of Vietnam.  Persian Gulf War (August 2, 1990 to present (requires service for 2 years or the full period for which called to active duty, except that exceptions applying to service between September 7, 1980 and August 1, 1990 also apply to Persian Gulf War).) See below. You must have served at least 90 days on active duty and been discharged or released under other than dishonorable conditions. If you served less than 90 days, you may be eligible if discharged because of a service-connected disability. Peacetime Service. If your service fell entirely within any one of the following periods:  July 26, 1947 to June 26, 1950,  February 1, 1955 to August 4, 1964, or  May 8, 1975 to September 7, 1980 (if enlisted) or to October 16, 1981 (if officer, you must have served at least 181 days of continuous active duty and been discharged or released under conditions other than dishonorable). If you served less than 181 days, you may be eligible if discharged because of a service-connected disability. Service between September 7, 1980 (enlisted) or October 16, 1981 (officer) and August 1, 1990. If your entire period of service was between September 7, 1980 (October 16, 1981) and August 1, 1990, you must have:  Completed 24 months of continuous active duty or the full period (at least 181 days) for which you were called or ordered to active duty, and been discharged or released under conditions other than dishonorable. You may also be determined eligible if you were discharged for a service-connected disability, or you were discharged for the convenience of the Government after completing at least 20 months of a 2-year enlistment, or you completed 181 days of active duty and: were discharged because of a hardship, or were determined to have a service-connected compensable disability, or were discharged or released from active duty for a medical condition which preexisted service and has not been determined to be service-connected, or If the certificate cannot be issued by ACE, you can request it from VA, by completing VA Form 26-1880, “Request for A Certificate of Eligibility.” The form should be submitted along with either • received an involuntary discharge or release from active duty for the convenience of the Government as a result of a reduction in force, or were discharged or released from active duty for a physical or mental condition not characterized as a disability and not the result of misconduct, but which did interfere with your performance of duty. NOTE: During the Persian Gulf War, the foregoing exceptions to the 2-year requirement apply, except that 90 days of active duty is sufficient in lieu of 181 days. Active Duty Service Personnel. If you are now on active duty, eligibility can be established after having served on continuous active duty for at least 90 days. Upon discharge or release from active duty, eligibility must be reestablished. Members of the Selected Reserve. Individuals who are not otherwise eligible and who have completed at least 6 years in the Reserves or National Guard, or been discharged because of a service-connected disability, and  have been discharged with an honorable discharge, or  have been placed on the retired list, or  have been transferred to an element of the Ready reserve other than the Selected Reserve, or  continue to serve in the Selected Reserve are eligible for a GI loan. Other Types of Service Certain United States citizens who served in the armed forces of a government allied with the United States in World War II. Unmarried surviving spouses of the above-described eligible persons who died as the result of service or service-connected injuries (Children of deceased veterans are not eligible). NOTE: Also, a surviving spouse who remarried on or after attaining age 57, and on or after December 16, 2003, may be eligible for the home loan benefit. The spouse of any member of the Armed Forces serving on active duty who is listed as missing in action, or is a prisoner of war and has been so listed for a total of more than 90 days.  Individuals with service as members in certain other organizations, services, programs and schools may also be eligible. Questions about whether this service qualifies for home loan benefits should be referred to your VA Regional Loan Center. Obtaining a Certificate of Eligibility VA determines your eligibility and, if you are qualified, a Certificate of Eligibility will be issued. ACE (automated certificate of eligibility): In some cases veterans can obtain the Certificate of Eligibility from a lender. Most lenders have access to the ACE system. This Internet based application can establish eligibility and issue an online Certificate of Eligibility in a matter of seconds. Not all cases can be processed through ACE – only those for which VA has sufficient data in our records. However, veterans are encouraged to ask their lenders about this method of obtaining a certificate. the originals or legible copies of your most recent discharge or separation papers covering active military duty since September 16, 1940, which show active duty dates and type of discharge. This form may be obtained from VA or at http://www.va.gov/vaforms/. If you were separated after January 1, 1950, you must submit DD Form 214, Certificate of Release or Discharge From Active Duty. In addition, if you are now on active duty and have not been previously discharged from active duty service, you must submit a statement of service which includes the name of the issuing authority (base or command), and is signed by or at the direction of an appropriate official. The statement must include date of entry on active duty and the duration of any time lost. Since there is no uniform document similar to the DD214 for proof of service in the Selected Reserve, a number of different forms may be accepted as documentation of service in the Selected Reserve. For those who served in the Army or Air National Guard and were discharged after at least 6 years of such service, NGB Form 22 may be sufficient. Those who served in the Army, Navy, Air Force, Marine Corps or Coast Guard Reserves may need to rely on any of a variety of forms that document at least 6 years of honorable service. Often, it will be necessary to submit a combination of documents such as an Honorable Discharge certificate together with a retirement point’s statement. It is the reservist’s responsibility to obtain and submit documentation of 6 years of honorable service. The Request for Certificate of Eligibility, VA Form 26-1880, should be mailed to the Atlanta Regional Loan Center, ATTN: COE (262), P.O. Box 100034, Decature, GA 30031. The Eligibility Center also maintains a toll free number (888-768-2132) for persons seeking information on eligibility. Questions and Answers 1. Does active duty for training in the Guard and Reserves qualify a person for home loan benefits? No. Active duty for training in the Guard and Reserves does not qualify a person for home loan benefits, unless the person completes a total of 6 years in the Guard and/or Reserves and serves under title 10, U.S.C. 2. Does this kind of service provide entitlement to any other veterans’ home loan benefit? Yes. Active-duty-for-training service may qualify you for a HUD/FHA veterans’ loan. Under the National Housing Act loan program, the Federal Housing Administration of the Department of Housing and Urban Development administers a loan program for veterans. Financing under this program is available under slightly more favorable terms than those available to nonveterans. VA’s only role in this program is to determine the eligibility of the veteran and, if qualified, issue a Certificate of Veteran Status as evidence of entitlement to HUD/FHA loan benefits for veterans. You may get a Certificate of Veteran Status by completing VA Form 26-8261a, Request for Certificate of Veteran Status, and submitting it with the attachments listed in the instructions to VA for a determination of eligibility. This form may be obtained from VA or at http://www.va.gov/vaforms/. All veterans discharged under other than dishonorable conditions from at least 90 days of service which began before September 8, 1980, are eligible. Veterans of enlisted service in a regular component of the Armed Forces, which began after September 7, 1980, or officers or reservists who entered on active duty after October 13, 1982, must have served at least 24 months of service or the full period for which called to active duty or Active Duty for Training before being discharged, unless the discharge was for hardship or disability. 3. What can a veteran do who has lost his or her original discharge papers and does not have a legible copy? The veteran should obtain a Certificate in Lieu of Lost or Destroyed Discharge. Any VA office will assist the veteran in obtaining necessary proof of military service. 4. Does a veteran’s home loan entitlement expire? No. Home loan entitlement is generally good until used. However, the eligibility of service personnel is only available so long as they remain on active duty. If they are discharged or released from active duty before using their entitlement, a new determination of their eligibility must be made, based on the length of service and the type of discharge received. 5. How much entitlement does each veteran have? Originally, the maximum entitlement available was $2,000; however, legislation enacted since that time has provided veterans with increases in entitlement up to the present maximum of $36,000 (or up to $ 89,912 for certain loans over $144,000). The $36,000 may, however, be reduced if entitlement has been used before to get a VA loan. The amount of remaining entitlement can be determined by subtracting the amount of entitlement used from the current maximum available entitlement of $36,000. (See question 8 for information on using remaining entitlement.) 6. Does VA home loan entitlement provide cash to the veteran? No. The amount of entitlement relates only to the amount VA will guarantee the lender against loss. 7. Can a veteran get used entitlement back to use again? If you have used all or part of your entitlement, you can get that entitlement back to purchase another home if the following conditions for “restoration” are met:  The property has been sold and the loan has been paid in full, or  A qualified veteran-transferee (buyer) must agree to assume the outstanding balance on the loan and agree to “substitute” his or her entitlement for the same amount of entitlement you originally used to get the loan. The buyer must also meet the occupancy and income and credit requirements of the law.  ONE TIME ONLY if you have repaid the prior VA loan in full, but have not disposed of the property securing that loan, the entitlement you used in connection with that loan may be restored. Any loss suffered by VA as a result of guaranty of the loan (for example a claim paid to a lender if a loan goes to foreclosure) must be repaid in full before the entitlement used on the loan can be restored. Restoration of entitlement is not automatic. You must apply for it by completing and returning VA Form 26-1880, “Request for a Certificate of Eligibility” to the Eligibility Center. This form may be obtained from any VA office or at http://www.va.gov/vaforms/. 8. If the requirements for restoration cannot be met, is there any other way a veteran can obtain another VA loan? Yes. Veterans who had a VA loan before may still have “remaining entitlement” to use for another VA loan. The current amount of entitlement available to each eligible veteran is $36,000 ($89,912 for certain loans over $144,000). This was much lower in years past and has been increased over time by changes in the law. For example, a veteran who obtained a $25,000 loan in 1974 would have used $12,500 guaranty entitlement, the maximum then available. Even if that loan is not paid off, the veteran could use the $23,500 difference between the $12,500 entitlement originally used and the current maximum of $36,000 to buy another home with VA financing. Most lenders require that a combination of the guaranty entitlement and any cash downpayment must equal at least 25 percent of the reasonable value or sales price of the property, whichever is less. Thus, in the example, the veteran’s $23,500 remaining entitlement would probably meet a lender’s minimum guaranty requirement for a no-downpayment loan to buy a property valued at, and selling for, $94,000. The veteran could also combine a downpayment with the remaining entitlement for a larger loan amount. 9. May several veterans use their entitlement to acquire property together? Yes. The guaranty is based on each veteran’s interest in the property, but the guaranty on the loan may not exceed the lesser of 40 percent of the loan amount or $36,000 ($89,912 for certain loans over $144,000). 10. If both a husband and wife are eligible, may they acquire property jointly and so increase the amount which may be guaranteed? They may acquire property jointly, but the amount of guaranty on the loan may not exceed the lesser of 40 percent of the loan amount or $36,000 ($89,912 for certain loans over $144,000). 11. May a veteran join with a nonveteran in obtaining a VA loan? Yes, but the guaranty is based only on the veteran’s portion of the loan. The guaranty cannot cover the nonveteran’s part of the loan. This does not apply to a loan to a veteran and spouse when the spouse is not a vteran. (Consult lenders to determine whether they would be willing to accept applications for joint loans of this type.) 12. Does the issuance of a certificate of eligibility guarantee approval of a VA loan? No. The veteran must still be found to be qualified for the loan from an income and credit standpoint., 36206=No appraisal or 2055 required, 380219=Fiscal Year 2012 county loan limits will be made available as soon as possible., 756390=“Joel is one of the best Mortgage Brokers I have ever worked with in my sixteen years in the real estate and mortgage business.” May 25, 2010, 680817=You can apply for a Certificate of Eligibility by submitting a completed VA Form 26-1880, Request For A Certificate of Eligibility , to the Winston-Salem Eligibility Center, along with proof of military service. In some cases it may be possible for VA to establish eligibility without your proof of service. However, to avoid any possible delays, it’s best to provide such evidence., 727287=August 1, 2012, 380021=apply to all loans closed January 1, 2011 through September 30, 2011, 380399=percent of the 2011 VA limit shown below. Therefore, a veteran with full, 454181=The DVA announced in February 2011 that “They are urging all veterans who may be encountering problems with making their mortgage payments to speak with their servicers as soon as possible to explore options to avoid foreclosure.  Contrary to popular belief, servicers really do not want to foreclose on the loans, due to foreclosure actions being highly costly.”, 737286=Kentucky VA Loan Cash Out Refinance Guidelines for 2014, 689717=Q: May a veteran join with a non veteran who is not his or her spouse in obtaining a VA loan?, 700959=Kentucky Fannie Mae Mortgage Guideline Changes for 2015., 757865=\"We first use Joel on our new home purchase in 2007 in St Matthews and he was great to work with. We have since refinanced our home with him in 2010 when rates got really low and he has always delivered on what he says. I could not imagine using anyone else.\", 728791=FY 2013, 379235=2011 Kentucky VA County Loan Limits, 756892=Jon ClarK “Joel Lobb is a real professional in the lending industry, with many years of experience, he is the one to go to for any mortgage lending needs.” August 22, 2010, 762051=Company ID #1364 | MB73346 http://mylouisvillekentuckymortgage.com}",
    "lastModified": "Thu, 30 Jul 2015 12:05:43 GMT",
    "textBeforeTable": "  Kentucky VA Homes for Sale  Reply by Louisville Kentucky Mortgage April 17, 2013 Posted on Featured Kentucky VA Homes for Sale Leave a reply | Tagged Business, Credit, Credit score, Down payment, Fannie Mae, fixed rate, Fort Knox, home loan, Kentucky, kentucky mortgage, kentucky va, kentucky va rates, Lenders, Loan, louisville, Louisville Kentucky, louisville va mortgage, louisvlle, Mortgage, Mortgage broker, Mortgage loan, mortgage rates louisville ky, refinance, Refinancing, United States Department of Agriculture, usda, usda mortgage, va home loan,",
    "textAfterTable": "$70,000.00 BERRY KY 41003 3.0 2.0 2130 $68,000.00 BOWLING GREEN KY 42101 4.0 1.0 1680 $64,900.00 BRANDENBURG KY 40108 4.0 3.0 1550 $114,000.00 BRANDENBURG KY 40108 3.0 4.0 1400 $89,900.00 CAMPBELLSVILLE KY 42718 3.0 2.0 1456 $34,900.00 CECILIA KY 42724 3.0 2.0 2128 $102,900.00 CRITTENDEN KY 41030 3.0 2.5 1120 $60,000.00 CYNTHIANA KY 41031 5.0 2.0 2128 $42,900.00 FRANKFORT KY 40601 3.0",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}