{
    "relation": [
        [
            "Name",
            "Chronos Tear",
            "Gold Needle",
            "Alarm Clock",
            "Handkerchief",
            "Phoenix Down",
            "Echo Herbs",
            "Antidote",
            "Eye Drops",
            "Potion"
        ],
        [
            "Cost",
            "60 gil",
            "80 gil",
            "50 gil",
            "50 gil",
            "200 gil",
            "50 gil",
            "50 gil",
            "50 gil",
            "60 gil"
        ]
    ],
    "pageTitle": "Dreadnought Leviathan - The Final Fantasy Wiki - 10 years of having more Final Fantasy information than Cid could research!",
    "title": "",
    "url": "http://finalfantasy.wikia.com/wiki/Dreadnought_Leviathan",
    "hasHeader": true,
    "headerPosition": "MIXED",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988840.31/warc/CC-MAIN-20150728002308-00080-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 87560815,
    "recordOffset": 87511485,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{94087=[view  · edit  · purge]Dreadnoughts were a type of battleship popular in the first half of the 20th century before the advent of the aircraft carrier made them obsolete. They were gigantic heavily armored ships noted for an \"all-big-gun\" design that allowed for great firing range while being well-protected. The term \"dreadnought\" comes from the first major ship of this design, the 1906 HMS Dreadnought. The word means \"fear nothing\".}",
    "lastModified": "Fri, 24 Jul 2015 23:09:40 GMT",
    "textBeforeTable": "WeaponsEdit TetranEdit ShopsEdit After the plot events in the Dreadnought Leviathan, the moogle Tetran will show up in Eruyt Village. He will show up no matter if the player let him out of the cage or not. Non-Player CharactersEdit Judge Ghis (Boss) Judge (Event Boss) Mastiff Imperial Hoplite Imperial Swordsman Imperial Magus Imperial Gunner MonstersEdit 2 - Opening this chest causes Chest #2 in the Ogir-Yensa Sandsea to disappear forever. Inversely, if Ogir-Yensa Sandsea chest #2 has been opened, this chest will disappear forever as well. However, both chests contain the same treasure. 1 - Chest does not respawn. Meteorite (A) Knot of Rust Zwill Blade",
    "textAfterTable": "Broadsword 400 gil Dagger 200 gil Shortbow 500 gil Altair 500 gil Longsword 700 gil Mage Masher 700 gil Silver Bow 1,000 gil Name Cost Zwill Blade 1,800 gil Partisan 2,300 gil Battle Bamboo 2,310 gil Vega 1,400 gil Assassin's Dagger 1,920 gil Crossbow 1,900 gil Serpent Rod 1,250 gil Iron Sword",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}