{
    "relation": [
        [
            "Patent application number",
            "20110008320",
            "20120100561",
            "20120171220",
            "20130065928"
        ],
        [
            "Description",
            "Further Use of Protein Kinase N Beta - The present invention is related to use of protein kinase N beta or a fragment or derivative thereof as a downstream target of the PI 3-kinase pathway, preferably as a downstream drug target of the PI 3-kinase pathway.",
            "A PKN3/RHOC MACROMOLECULAR COMPLEX AND METHODS OF USE THEREFOR - Disclosed are compositions comprising and methods of using a novel macromolecular assembly comprising PKN3, PDK1 and RhoC (PPRC complex). The PPRC complex was shown to have kinase activity and was found in cells of high malignancy potential, such as particularly aggressive cancers. In some aspects, the invention provides methods for screening compounds that have cancer therapeutic potential, methods for diagnosing aggressive cancer, methods for determining the prognosis of a patient suffering from cancer, methods for stratifying patients in a clinical trial or determining the effectiveness of a particular treatment regimen, polypeptides that modulate the formation of the PPRC complex, and kits comprising one or more components of the PPRC complex.",
            "FURTHER USE OF PROTEIN KINASE N BETA - The present invention is related to use of protein kinase N beta or a fragment or derivative thereof as a downstream target of the PI 3-kinase pathway, preferably as a downstream drug target of the PI 3-kinase pathway.",
            "BIOMARKERS FOR PI3K-DRIVEN CANCER - Disclosed is the discovery that the mTORC2 complex plays a role in the regulation of PKN3 phosphorylation at the turn motif threonine; and the use of the phosphorylation status of the turn motif threonine of PKN3 as a biomarker. In some embodiments, the phosphorylation status of the turn motif threonine of PKN3 is determined using an antibody that specifically binds to the turn motif threonine of a PKN3 protein, such as an anti-phosphoT860 antibody. In some embodiments, the invention relates to methods for screening compounds that have cancer therapeutic potential, methods for diagnosing cancer, methods for determining the prognosis of a patient suffering from cancer, methods for stratifying patients in a clinical trial, methods for treating a patient suffering from cancer, and methods for determining the effectiveness of a particular treatment regimen."
        ],
        [
            "Published",
            "01-13-2011",
            "04-26-2012",
            "07-05-2012",
            "03-14-2013"
        ]
    ],
    "pageTitle": "Anke - Patent applications",
    "title": "",
    "url": "http://www.faqs.org/patents/inventor/anke-7/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987174.71/warc/CC-MAIN-20150728002307-00154-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 441234767,
    "recordOffset": 441211352,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Anke Klippel-Giese, Park Ridge, NJ US 05-07-2009 PLEATABLE NONWOVEN MATERIAL AND METHOD AND APPARATUS FOR PRODUCTION THEREOF - A pleatable nonwoven material is provided, including thicker form-giving fibers and thinner fibers determining the filter effect, wherein the thinner fibers are incorporated largely homogeneously in the thicker fibers running in the direction along the surface of the nonwoven material and a distribution density gradient of the thinner fibers is established perpendicular to the surface of the nonwoven material such that the highest concentration of thinner fibers is in the region of the center or on one of the two outsides, wherein the thicker and thinner fibers are bonded together by solidification from the melted condition and are made from the same material. 20090117803 Published Description Patent application number Anke Jung, Bayreuth DE 03-05-2015 PLEATABLE NONWOVEN MATERIAL AND METHOD AND APPARATUS FOR PRODUCTION THEREOF - A pleatable nonwoven material is provided, including thicker form-giving fibers and thinner fibers determining the filter effect, wherein the thinner fibers are incorporated largely homogeneously in the thicker fibers running in the direction along the surface of the nonwoven material and a distribution density gradient of the thinner fibers is established perpendicular to the surface of the nonwoven material such that the highest concentration of thinner fibers is in the region of the center or on one of the two outsides, wherein the thicker and thinner fibers are bonded together by solidification",
    "textAfterTable": "Patent applications by Anke Klippel-Giese, Park Ridge, NJ US Anke Klippel-Giese, Berlin DE Patent application number Description Published 20090186845 INTERFERING RNA MOLECULES - The present invention is related to a ribonucleic acid comprising a double stranded structure whereby the double-stranded structure comprises a first strand and a second strand, whereby the first strand comprises a first stretch of contiguous nucleotides and whereby said first stretch is at least partially complementary to a target nucleic acid, and the second strand comprises a second stretch of contiguous nucleotides whereby said second stretch is at least partially identical to a target nucleic acid, and whereby the double stranded structure is blunt ended. 07-23-2009 20100285038 Factor Involved in Metastasis and Uses Thereof - The present invention is related to a nucleic acid coding for a factor involved in a biological process, whereby the process is a PI 3-kinase pathway regulated process, preferably a process selected from the group comprising glucose metabolism, amino acid and glucose deprivation processes, diabetes, wound healing, stress response, apoptosis, metastasis, tumorigenesis, cell migration, cell motility in extracellular matrix and cell growth in extracellular matrix, and the factor is a polypeptide comprising an amino acid sequence according",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}