{
    "relation": [
        [
            "Date",
            "May 21, 2004",
            "Sep 3, 2012",
            "Jan 17, 2013",
            "Jan 17, 2013"
        ],
        [
            "Code",
            "AS",
            "REMI",
            "SULP",
            "FPAY"
        ],
        [
            "Event",
            "Assignment",
            "Maintenance fee reminder mailed",
            "Surcharge for late payment",
            "Fee payment"
        ],
        [
            "Description",
            "Owner name: INTERNATIONAL BUSINESS MACHINES CORPORATION, NEW Y Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNORS:HASSON, LAURENT D.;GEORGE, JOBI;PONZO, JOHN J.;REEL/FRAME:015364/0057;SIGNING DATES FROM 20040330 TO 20040331",
            "",
            "",
            "Year of fee payment: 4"
        ]
    ],
    "pageTitle": "Patent US20050188353 - Method and system for retaining formal data model descriptions between ... - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US20050188353?dq=patent:+7360079",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988840.31/warc/CC-MAIN-20150728002308-00192-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 487988391,
    "recordOffset": 487955863,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Referenced by XML: Extensible markup language is an open standard for describing data in Web pages and business-to-business documents. UML: The Unified Modeling Language, a standard notation to visually represent software models. JavaScript: JavaScript is a scripting language that uses a syntax that is similar to that of Java, but it is not compiled into bytecode. It remains in source code embedded within an HTML document and must be translated a line at time into machine code by the JavaScript interpreter. JavaScript is supported by all popular Web browsers. Java: A programming language for creating applications that run on all platforms without modification. EAttribute: The EMF artifact that represents a property of a class which contains simple values (such as a number or a string). EReference: The EMF artifact that represents a property of a class which points to another class. EClass: The EMF artifact that represents a Class. Class: An Object Oriented software concept that represents a thing that exists in a software application, for example, a User, a Portfolio. ECore: An EMF term which describes the artifact that represents a software model. EMF: The Eclipse Modeling Framework is an open source project at http://www.eclipse.org/emf which pertains to create",
    "textAfterTable": "US7739267 Mar 10, 2006 Jun 15, 2010 International Business Machines Corporation Classification and sequencing of mixed data flows US7827522 Oct 28, 2004 Nov 2, 2010 International Business Machines Corporation Computer method and apparatus for implementing redefinition of model features US7861214 Nov 8, 2004 Dec 28, 2010 International Business Machines Corporation Computer method and apparatus for collapsing programming metamodels US7861218 * Oct 28, 2004 Dec 28, 2010 International Business Machines Corporation Computer method and system for enforcing derived union constraints US7917856 * Apr 18, 2006 Mar 29, 2011 Sap Ag Converting between user interface technologies US8099725 Oct 11, 2006 Jan 17, 2012 International Business Machines Corporation Method and apparatus for generating code for an extract, transform, and load (ETL) data flow US8160999 Dec 13, 2006 Apr 17, 2012 International Business Machines Corporation Method and apparatus for using set based structured query language (SQL) to implement extract, transform, and load (ETL) splitter operation",
    "hasKeyColumn": true,
    "keyColumnIndex": 2,
    "headerRowIndex": 0
}