{
    "relation": [
        [
            "Categories",
            "Campus Safety",
            "Clubs and Activities",
            "Share any unusual traditions or locations on campus",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "There are blue lights everywhere that allow for quick access to the police station on campus, the police are always out and willing to help, and there are van escort services to take you from one side of campus to the other.",
            "There are over three hundred clubs on campus with everything to do from your major to anything you may be interested in. There is always something to do or get involved in.",
            "Hiking Architecture Graveyard is a must at Cal Poly. It is a hillside full of past architecture projects that are fun to climb on and visit in general. I take all my friends and visitors there when they come to SLO. It is also mandatory that you try Woodstock's Pizza, Firestone's Tri-Tip sandwiches, and Splash Cafe's clam chowder!!",
            "You can join tons of cool clubs, like the equestrian team, water polo, lacrosse, and other sports. We have over three hundred clubs on campus to get involved in. You can also hang out at the Rec Center pool, which is really nice, go on hikes, go downtown, and spend your days however you like. It is a very free and easy campus that has a lot to do.",
            "There are really nice places that accept plus dollars, a form of food credit, but there are certain places that accept the meal credits that aren't as appetizing. However, there is a lot of variety, and we do have multiple Starbucks, a Jamba Juice, Einsteins Bagel's, and Chick-fil-a which is really nice.",
            "The food is not the best, but there is a lot of variety which is really nice. The rooms are nice, the college has an amazing atmosphere, and I have enjoyed my time in the dorms.",
            "Cal Poly accepts only the best, and they accept nothing but the best. The courses are challenging, but you can get an A as long as you put the work in. You get from the class what you put into it, so if you study, pay attention, and work to do well, you will.",
            "This school is one of the best schools to go to, whether for agriculture, engineering, or art. All the courses you take will relate to your field of study, and when you graduate a Cal Poly education will be accepted and wanted by companies. I would say to make sure you invest in campus though. Put yourself out there, get involved, and make the most of college life.",
            "A school that lives to its motto, Learn By Doing. Cal Poly, SLO is the best school I could have chosen; I get hands on experience that relate to the learning styles that work best for me. The classes are college courses, but they provide real world experience that isn't available at other schools."
        ]
    ],
    "pageTitle": "Cal Poly Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Cal-Poly/reviews?_escaped_fragment_=/show/55678",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 125,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438043062635.98/warc/CC-MAIN-20150728002422-00253-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 904111927,
    "recordOffset": 903954696,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{179338=There are many activities you can do. The rec center on campus was renovated in early 2012 and is very nice. Cal Poly subsidizes the SLO bus system, so you can travel anywhere around town for free. Beaches, outlet shopping and an interactive comedy show are a 15 minute drive away. We are halfway between LA and SF., 432310=The new recreation center just opened this January and has 9300 square feet of machinery alone! Plus, it even has filtered water dispensers!, 51142=It is the best college in the United States. It has an amazing engineering program for the relatively low cost. It is in the happiest place in the USA according to USAtoday. http://travel.usatoday.com/destinations/story/2011/04/San-Luis-Obispo-Its-the-happiest-place-in-the-USA-/45900412/1, 130651=Ever since Carson, a freshman from the class of 2012, died of alcohol poisoning campus safety has become a top priority. Since it is a small town it is tight-knit, so if something happens its spreads quickly., 830176=© 2015, Cappex.com, LLC, 620885=The residential housing communities at Cal Poly are pretty good. Freshmen stay in the Connections halls (Sierra Madre and Yosemite Halls,) the Living and Learning communities (The major specific, Red Brick halls,) and North Mountain Halls. Also, Cal Poly has a multi-class residence community located on top of the campus mountain known as Cerro Vista which features suite/apartment style living. Beginning in the 2013-14 school year, freshman students will be put into Poly Canyon Village, the student housing complex reserved for Second years and above. In the Connections halls, towers are assigned by theme and admitted students can choose the themes that they want to be placed in. In Yosemite hall, the floors are unisex, whereas in Sierra Madre the halls segregate by floor., 8089=Though it is primarily an Engineering and Agricultural school, our other majors have a lot to offer..take Liberal Arts for instance. Our Performing arts Centers...yes that's plural...and Music facilities and Band are state of the art and Best of the West as you can get. If there are any Animal Science perspective Aggie's for Cal Poly i can answer any question you may have as well. Also! Any incoming Freshmen have questions about the school or the town I am also bursting with info as a 2009 Week Of Welcome orientation Leader aka WOW! and one more thing....if your coming to Cal Poly? WOW is a must!! ~aventimi@calpoly.edu, 3578=I have just finished my first year at Cal Poly San Luis Obispo, and can honestly say I can’t possibly imagine being happier with a school. To be perfectly honest I wasn’t initially thrilled to be going to Cal Poly, but my family’s financial situation made the ultimate decision for me. Cal Poly has proven to be everything I wanted and more. With each class having around 4500 students, I find the school to be large enough as to be able to have your own identity, yet small enough to have a familial feeling about it. Classes are also well sized, especially for smaller majors like liberal arts. All of my teachers have come to know me personally, and I felt as though I had a respected voice in class. There is a general feeling of acceptance and comfort that flows throughout campus, and it is an incredible community to be a part of. The town leans towards the quaint and quiet side, but it is without a doubt a college dominated area. Cal Poly does a beautiful job of welcoming new students to the campus and the town. It’s overall a homey environment, while offering the education of a UC without the cost. Away from school, I find most of my time to be spent at the beach or downtown. Pismo, Avila, and Morrow Bay are all within 15 minutes, and all have adorable towns to spend the day in. The downtown area of SLO is even within walking distance, although bus transportation is free for all students. SLO is piled high with restaurants fit for students with everything from Thai cuisine to Italian to renown barbeque. I must throw in one last source of entertainment as it is one of the most talked of events on campus--Thursday night line dancing. A weekly affair, the downtown Graduate hosts country music and dancing for 8$ from 8:00-2:00 giving us all a chance to step out with our boots on., 729595=If you end up coming to Cal Poly, JOIN A CLUB I can't stress this enough, there is much more to Cal Poly than going to class and passing it. There are many great clubs, such as Formula SAE, Human Powered Vehicle, Design Build Fly, Cal Poly Space Systems, and many more! I learned so much from working in Supermileage, an engineering club that strives to build the most fuel-efficient car. I got to work with students from different majors, something I would never have done in class. I worked with carbon fiber, designed some parts, and saw our car achieve 1385 mpg.}",
    "textBeforeTable": "08/02/2009 Reviewer is A current student here. 51 out of 54 people found this review useful. 1 of 174 Rebecka from Carmel Valley, CA Check out reviews left by other students or leave your own review. You could win a free scholarship. Cal Poly Reviews Cal Poly › California › By State › Colleges › } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.create', -->",
    "textAfterTable": "Tips for prospective students Though it is primarily an Engineering and Agricultural school, our other majors have a lot to offer..take Liberal Arts for instance. Our Performing arts Centers...yes that's plural...and Music facilities and Band are state of the art and Best of the West as you can get. If there are any Animal Science perspective Aggie's for Cal Poly i can answer any question you may have as well. Also! Any incoming Freshmen have questions about the school or the town I am also bursting with info as a 2009 Week Of Welcome orientation Leader aka WOW! and one more thing....if your coming to Cal Poly? WOW is a must!! ~aventimi@calpoly.edu Bang for the buck As an Engineering and Agriculture school (primarily), and being dubbed The Best In The West college for years, it has its price tag, but when you get here and realize the quality or education and how much it offers opposed to other colleges...there really isn't anything better as far as a State University goes. Am enjoying being here The school itself is amazing as I said before. but the people are even better. They all want to be here, and its easy to see why. Being in such a college oriented town really makes you feel like a big part",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}