{
    "relation": [
        [
            "Categories",
            "Campus Safety",
            "Clubs and Activities",
            "Great for these types of students",
            "Bang for the buck",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "Campus police are always available for escorting to vehicles. There are well lit parking lots and walk ways.",
            "The clubs and activities cater to pretty nearly anyone. The hardest question is what to try next.",
            "All types are welcome here. There are a variety of international students, non-traditional students and traditional students.",
            "The price is right! There is so much available at WTAMU and the tuition and fees are very competitive.",
            "Fun? You need a calendar to keep up with all that is going on at WTAMU. The activity center has intramural sports and activities. There is a bowling alley, rock wall climbing, indoor swimming year round, and so much more!",
            "The dining is outstanding. The choices available are great!",
            "The dorms on campus are expanding to accommodate more students. They are newer and well equipped to handle the needs of students.",
            "Its the goal of WTAMU's professors to prepare their students as best they can. They are available for help and there are resources available for extra help.",
            "The first tip would be to make time to meet your professors during office hours. They like to get to know who they are teaching. Get plugged into organizations and start networking.",
            "WTAMU is challenging and the professors take an active interest in students. It strives to be competitive in a variety of areas. The graduates are very marketable and plugged in to industry trends."
        ]
    ],
    "pageTitle": "West Texas A & M University Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/West-Texas-A-M-University/reviews?_escaped_fragment_=/show/22455",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987174.71/warc/CC-MAIN-20150728002307-00091-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 890788995,
    "recordOffset": 890745934,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{11510=Make sure to apply for scholarships before the deadline date (February 1 of every year) or else you aren't eligible in the following years. If at all possible, live on campus and buy a bike because you won't have a spot to park your car if you don't., 190095=When applying to West Texas A&M University, it's important to note the application deadline is rolling. Scores for either the ACT or SAT test are due August 15. The application fee at West Texas A&M University is $40. It is selective, with an acceptance rate of 69.4 percent., 203795=© 2015, Cappex.com, LLC, 43073=Dorm life is really fun! WT has many dorms to choose from, some older some newer. The cheaper dorms usually don't have air conditioning but the family and community aspect of those certain dorms trumps the need for air conditioning. The dorms with air conditioning have perks like air conditioning but don't seem to be as friendly. All the dorms on campus are really nice though. Every other Wednesday all the dorms host either 9:59 or Hall Council which is a great way for residents to get to know each other, get involved on campus, and get to know their RA's. At these meetings there is always free food and fun. There is an honors dorm for the honor students and there is a quad dorm. The honors dorm has private rooms. The quad dorm which is called Buff has four rooms with a connecting living rooms, kitchen, and two bathrooms. The rest of the dorms are two person to a room and the whole floor shares a bathroom with multiple stalls and showers. Dorms are a great way to get to know people!}",
    "textBeforeTable": "12/04/2009 Reviewer is A current student here. 11 out of 11 people found this review useful. 1 of 48 Jordun from Lubbock, TX Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\");",
    "textAfterTable": "KaitlynN from Amarillo, TX 11/24/2009 Reviewer is A current student here. 5 out of 5 people found this review useful. 3 of 48 Categories Comments Tips for prospective students If you chose to apply here, know that people hold doors open for you, they smile at you (even people you don't even know!), and they actually treat you like a real person! :D Am enjoying being here I love this school. Dorm life could be a little less noisy, but it's worth it. Am learning a lot I am ALWAYS learning something new. There isn't a day that hasn't gone by that I haven't obtained newly acquired knowledge. Being an General Studies Art Major, I have found that many of my classes are very interesting and are always sparking my interest. Login to rate or flag the reviews Marisa from Canyon, TX",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}