{
    "relation": [
        [
            "First Name",
            "George",
            "Tim",
            "Sean"
        ],
        [
            "Last Name",
            "Williams",
            "Ransdell",
            "Mackay"
        ],
        [
            "Suffix",
            "",
            "",
            ""
        ],
        [
            "Covered Official Position (if applicable)",
            "",
            "",
            ""
        ],
        [
            "New",
            "",
            "",
            ""
        ]
    ],
    "pageTitle": "LD-2 Disclosure Form",
    "title": "",
    "url": "http://soprweb.senate.gov/index.cfm?event=getFilingDetails&filingID=945EDE33-2C39-4A9F-9DDE-9C59A5B3749A&filingTypeID=55",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988840.31/warc/CC-MAIN-20150728002308-00258-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 219600225,
    "recordOffset": 219592023,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{15792=General discussions re greenhouse gas regulation General discussions re ozone NAAQS reconsideration H.R. 1292: Energy Production Freedom Act re greenhouse gas regulation S. 482: Energy Tax Prevention Act of 2011 re greenhouse gas regulation S. 228: Defending America's Affordable Energy and Jobs Act re greenhouse gas regulation S. 231: EPA Stationary Source Regulations Suspension Act re greenhouse gas regulation S. 559: Securing America's Future with Energy and Sustainable Technologies Act re greenhouse gas regulation H.R.10: Regulations From the Executive in Need of Scrutiny Act of 2011 H.R. 2401: Transparency in Regulatory Analysis of Impacts on the Nation Act of 2011, 1019=Lobbying Disclosure Act of 1995 (Section 5) - All Filers Are Required to Complete This Page, 19807=General discussions re regulations constraining use of over-the-counter derivatives by end-users General discussions re legislation pertaining to over-the-counter derivatives use by end-users H.R. 1610: Business Risk Mitigation and Price Stabilization Act of 2011 re derivatives H.R. 1573: To facilitate implementation of title VII of the Dodd-Frank Wall Street Reform Act re CFTC regulatory deadlines S. 1615: Financial Regulatory Responsibility Act of 2011 re cost-benefit analyses of financial regulatory actions S. 1650: Dodd-Frank Improvement Act of 2011 re pre-introduction discussions re implementation timetable for financial regulations H.R. 3527: Protecting Main Street End-Users from Excessive Regulation Act, 23243=General discussions re loan guarantees General discussions Clean Energy Standard H.R. 2354: Making appropriations for energy and water development and related agencies for the fiscal year ending September 30, 2012, and for other purposes. re loan guarantees, efficiency, research H.R. 4273: Resolving Environmental and Grid Reliability Conflicts Act of 2012 re reliability S. 398: Implementation of National Consensus Appliance Agreements Act of 2011 re efficiency S. 1000: Energy Savings and Industrial Competitiveness Act of 2011 re efficiency S. 1737: Sensible Accounting to Value Energy (SAVE) Act re efficiency S. 559: Securing America's Future with Energy and Sustainable Technologies Act S. 1321: Practical Energy Plan of 2011 H.R. 4017: Smart Energy Act S.1914: Cut Energy Bills at Home Act General discussions re Clean Energy Standards and other energy issues General discussions re ESJ wind project General discussions re extension of renewable Production Tax Credit (PTC) and Section 1603 grant-in-lieu of tax credit, 27657=H.R. 1084: Fracturing Responsibility and Awareness of Chemicals Act of 2011 re energy supplies H.R. 10: Regulations From the Executive in Need of Scrutiny Act of 2011 re greenhouse gas regulation Interior & Environment Appropriations re EPA authority S. 587: FRAC Act re energy supplies H.R. 2681: Cement Sector Regulatory Relief Act of 2011 re EPA authority H.R. 2250: EPA Regulatory Relief Act re EPA authority H.R. 910: Energy Tax Prevention Act of 2011, 12267=H.R. 2354, Energy & Water Appropriations / H.R. 3070 and S 1599 Labor-HHS-Education Appropriations re low income home energy assistance / S. 1549 American Jobs Act of 2011 re taxes & infrastructure investment / H.R. 1 Full-Year Continuing Appropriations Act, 2011 and H.R. 4026 Energy Assistance for American Families Act, 45723=H.R. 253: Clean Vehicles for Cleaner Air Act of 2011 re alternative fuel vehicles H.R. 1380: New Alternative Transportation to Give Americans Solutions Act of 2011 (NAT GAS Act) re alternative fuel vehicles H.R. 22: Pipeline Safety and Community Empowerment Act of 2011 re pipeline safety S. 559: Securing America's Future with Energy and Sustainable Technologies Act re alternative fuel vehicles S. 734: Advanced Vehicle Technology Act of 2011 re alternative fuel vehicles S. 1001: Alternative Fuel Vehicles Competitiveness and Energy Security Act of 2011 re alternative fuel vehicles S. 573: Corps of Engineers Reform Act of 2011 re dredging S. 298: Charging America Forward Act re incentives for alternative fuel vehicles S. 275: Pipeline Transportation Safety Improvement Act of 2011 re pipeline safety S. 234: Strengthening Pipeline Safety and Enforcement Act of 2011 re pipeline safety Unnumbered Energy & Commerce draft legislation re pipeline safety General discussions re pipeline safety H.R. 1: Full-Year Continuing Appropriations Act, 2011 re alternative fuel vehicles General discussions re electric vehicle legislation General discussions re alternative fuels, fueling infrastructure, and vehicles H.R. 2937: Pipeline Infrastructure and Community Protection Act of 2011 re natural gas transmission and distribution H.R. 2845: Pipeline Safety, Regulatory Certainty, and Job Creation Act of 2011 S. 1001: Alternative Fuel Vehicles Competitiveness and Energy Security Act of 2011, 41450=General discussions re extension of production tax credits to encourage development of wind energy facilities H.R. 1380: New Alternative Transportation to Give Americans Solutions Act of 2011 re incentives for alternative fuel vehicles Proposals pertaining to Section 1603 Treasury Grant Program re renewables financing & energy development H.R. 2892: Invest in America Act of 2011 re capital gains and dividend taxes S. 1671: A bill to amend the Internal Revenue Code of 1986 to allow a temporary dividends received deduction for dividends received from a controlled foreign corporation. re pre-introduction discussions re treatment of foreign earnings H.R. 1036: Job Creation and Innovation Investment Act of 2011 re foreign earnings S. 734: Advanced Vehicle Technology Act of 2011 S. 1001: Alternative Fuel Vehicles Competitiveness and Energy Security Act of 2011 General discussion of tax reform to a territorial system, 34773=GRID Act discussion draft re cybersecurity & critical infrastructure H.R. 908: Full Implementation of the Chemical Facility Anti-Terrorism Standards Act re natural gas storage (CFATS) H.R. 901: Chemical Facility Anti-Terrorism Security Authorization Act of 2011 re natural gas storage (CFATS) S. 473: Continuing Chemical Facilities Antiterrorism Security Act of 2011 re natural gas storage (CFATS) H.R. 3674: PRECISE Act of 2011 H.R. 3523: Cyber Intelligence Sharing and Protection Act of 2011 H.R. 4263: SECURE IT Act of 2012 H.R. 901: Chemical Facility Anti-Terrorism Security Authorization Act of 2011 S. 2105: Cybersecurity Act of 2012 S. 2151: SECURE IT}",
    "textBeforeTable": "",
    "textAfterTable": "State DC Zip Code 20005 Country USA 3. Principal place of business (if different than line 2) City  San Diego State  CA Zip Code  92101 Country  USA 4a. Contact Name b. Telephone Number c. E-mail  Mr.  GEORGE P. WILLIAMS  2026611712  politicalreporting@sempra.com 5. Senate ID#  30507-12 7. Client Name Self Check if client is a state or local government",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}