{
    "relation": [
        [
            "Categories",
            "Bang for the buck",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "I would not even think about going anywhere else. The smaller class sizes are ideal. The professors all know your name even if you've never introduced yourself to them yet. Very impressive faculty! They want you to succeed and reach your goals. They really do want you to succeed!",
            "There are a lot of activities both on campus and off campus. Club Icon is a popular hangout off campus.",
            "The meal plan saves you a lot of money! 50% off on most items in The Brickstone Cafeteria with a meal plan, but you need to know how to use the meal plan only on those discounted items.",
            "There are plenty of options from dorms to suites to apartments, both on campus and off campus.",
            "Do the homework and what is expected of you and you will be fine.",
            "Find a balance between extra activities and homework. This is a very welcoming and diverse school. Huge diversity here and everyone is very friendly.",
            "One of the best universities you could ever attend. Almost zero crime rate compared to Milwaukee schools in the larger city. Beautiful location on 700 acres of amazing land."
        ]
    ],
    "pageTitle": "University of Wisconsin-Parkside (UW-Parkside) Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/University-of-Wisconsin-Parkside/reviews?_escaped_fragment_=/show/3477",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988840.31/warc/CC-MAIN-20150728002308-00326-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 907727719,
    "recordOffset": 907698741,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{55506=It is located on a prairie so there is plenty of wild life like deer, geese and a variety of birds and small animals that you can see. We have a mascot Ranger Bear that has participated in mascot competiions and took third place in the UCA MAscot Competition in 2011., 118446=© 2015, Cappex.com, LLC, 30394=This is not a very social school. If you're looking for fun 24/7, this is not the college to do it. Also, it is one of the smallest schools population wise in the UW-System. Barely 1000 people live on campus, as 70%+ live off campus. Thus the lack of partying in this school promotes a good learning environment. The professors here are good at their job. All the academic buildings are connected together, so there are plenty of places to study within the campus rather than the residence halls., 49204=People who like a lot of space, and a close group of friends. This is a small campus with only about 2000 students on campus.}",
    "textBeforeTable": "11/30/2009 Reviewer is A current student here. 4 out of 9 people found this review useful. 2 people found this inaccurate. 1 of 28 Matthew from Kenosha, WI Check out reviews left by other students or leave your own review. You could win a free scholarship. University of Wisconsin-Parkside Reviews University of Wisconsin-Parkside › Wisconsin › By State › Colleges › } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.create', -->",
    "textAfterTable": "Categories Comments Great for these types of students People who are interested in the medical field and the business field. Tips for prospective students If you are coming to UW-Parkside my tip for you is join an organization, go to the first year experience meetings, and HAVE FUN! Bang for the buck I think that you get a lot for your money, you just have to make it worth it. I am a commuter and the only complaint is that you pay all this money for a parking pass but there is never any parking. Am enjoying being here I love being on campus. I think that they have so many opportunities to join organizations. There are organizations for everyone. In the beginning of the school year they have all the organizations in one room so that you can find one that you love and join. There are so many opportunities to do things on campus, they have ice cream socials, sex fest, movies, athletic games, and much more. All of these events are free to attend. Am learning a lot I have learned so much from attending this college.",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}