{
    "relation": [
        [
            "First Name",
            "Joel",
            "Anne"
        ],
        [
            "Last Name",
            "Brandenberger",
            "Willis"
        ],
        [
            "Suffix",
            "",
            ""
        ],
        [
            "Covered Official Position (if applicable)",
            "",
            ""
        ],
        [
            "New",
            "",
            ""
        ]
    ],
    "pageTitle": "LD-2 Disclosure Form",
    "title": "",
    "url": "http://soprweb.senate.gov/index.cfm?event=getFilingDetails&filingID=908B7863-AA5A-4259-B13C-D319AFFF71D7&filingTypeID=80",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987174.71/warc/CC-MAIN-20150728002307-00118-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 222034818,
    "recordOffset": 222026616,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{45540=31 CFR Part 515 - Cuban Assets Control Regulation Avian Influenza Rules and Novel H1N1 Rules Mexican Trade Issues CODEX International Standards Revisions Russian Chlorinated Water Ban Chinese Poultry Ban EU Trade Barriers on U.S. Poultry USTR-USDA - Barriers to Trade Australian Trade Issues Mexican Truck Rule Reversal Brazil Trade Issues FY 2010 Agriculture Appropriations Bill (H.R. 2997) - Market Access Program/Foreign Market Development Program Cuba Agricultural Trade, 16705=No Docket or Bill # - Animal Welfare Audits/Human Slaughter Act Amendments Cephalosporin Ban: FDA-2008-N-0326 FDA Minor Use Minor Species - Drug Availability Issues Animal Drug Use & Availability National Animal Identification System (NAIS) Preservation of Antibiotics for Medical Treatment Act (PAMTA; H.R. 1549; S. 619) Roxarsone; Poison-Free Poultry Act (H.R. 3624) Veterinary Services Investment Act (H.R. 3519; S. 1709), 1019=Lobbying Disclosure Act of 1995 (Section 5) - All Filers Are Required to Complete This Page, 25534=Energy Bill, H.R. 6 - P.L. 110-14008 Ethanol Waiver Contained in H.R. 6 - EPA (EPA-HQ-OAR-2008-0380) Energy Bill Development in 111th Congress Climate Change/Cap & Trade (H.R. 2454; S 1733) EPA-HQ-OAR-2009-0211 Clean Air Act Waiver Application to Increase the Allowable Ethanol Content in Gasoline to 15 Percent EPA-HQ-OAR-2005-0161; FRL-8903-1 Changes to the Renewable Fuels Standard Program Affordable Food and Fuel for America Act (H.R. 3187) Mid-Level Ethanol Blends Act (S. 1666) FY2010 Interior Appropriations Bill, 12248=FY 2009/2010 Agriculture Appropriations Bill (H.R. 2997) No Docket or Bill # - Animal Welfare Audits/Humane Slaughter Act Amendments FSIS Docket - FSIS-2009-0040A; ANPR on Product Labeling APHIS-2009-0016; ANPR Wood Packaging Materials Pathogenic Avian Influenza (PAI) Risk Assessment Preservation of Antibiotics for Medical Treatment Act (PAMTA; H.R. 1549; S. 619) Roxarsone; Poison-Free Poultry Act (H.R. 3624) Agricultural Antitrust Issues; Competition Comments December 2009 FY 2009/2010 Interior Appropriations Bill (H.R. 2996), 29959=Docket No. 04-026N - \"Salmonella Verification Sample Results Reporting: Agency Policy and Use in Public Protection\" FSIS Food Safety Modernization Act (H.R. 875) Food Safety Enhancement Act (H.R. 2749) USDA Labelling Comments November 2009 FDA Food Safety Modernization Act (S. 510), 38115=No Bill or Docket # - Implementation of the Supreme Court \"Donning and Doffing\" Decision Employee Free Choice Act (H.R. 1409; S. 560) Agriculture Antitrust Issues; Competition Comments December 2009, 21022=OAR-2004-0237 - Animal Feed Operations Consent Agreement and Final Order Poultry Petition: EPA - HQ-SFUND-2005-013 Poultry Exemption Petition: EPA - HQ-SFUND-2007-0469 Cap & Trade/Climate Change (H.R. 2454; S. 1733) Clean Water Restoration Act Reauthorization (S. 787) Greenhouse Gas Emissions Reporting Rule (EPA-HQ-OAR-2008-0508) GHG Tailoring Rule: EPA HQ-OAR-20009-0517; RIN 2060-AP86 Preliminary Notice of TMLL; FRL-8955-4 FRL-8955-4; Preliminary Notice of TMDL Development for Chesapeake Bay Chesapeake Clean Water and Ecosystem Restoration Act of 2009 (S. 1816; H.R. 3852) Phosphorus Standard Revision, 34120=DHS Docket No. ICEB - 2006-0004: Safe-Harbor Procedures or Procedures for Employees who receive a No-Match Letter No Docket number - DHS - Best Hiring Practices E-Verify Reform}",
    "textBeforeTable": "",
    "textAfterTable": "City WASHINGTON State DC Zip Code 20005 Country USA 3. Principal place of business (if different than line 2) City   State   Zip Code   Country   4a. Contact Name b. Telephone Number c. E-mail  Mr.  JOEL BRANDENBERGER  2028980100  jbrandenberger@turkeyfed.org 5. Senate ID#  28732-12",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}