{
    "relation": [
        [
            "Release",
            "Release 3.2",
            "Release 3.3.0",
            "Release 3.4.0",
            "Release 3.7.0"
        ],
        [
            "Modification",
            "This command was introduced. The afi-all and safi-all keywords were added.",
            "The vrf vrf-name keyword and argument were added.",
            "The all and standby keywords were added. The afi-all keyword was removed.",
            "The topology topo-name keyword and argument were added as options from the multicast keyword."
        ]
    ],
    "pageTitle": "Cisco IOS XR Routing Command Reference for the Cisco XR 12000 Series Router, Release 4.1 - RIB Commands [Cisco IOS XR Software (End-of-Sale)] - Cisco",
    "title": "",
    "url": "http://www.cisco.com/c/en/us/td/docs/routers/xr12000/software/xr12k_r4-1/routing/command/reference/b_routing_cr41xr12k/b_routing_cr41xr12k_chapter_0110.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 125,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988840.31/warc/CC-MAIN-20150728002308-00261-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 376346839,
    "recordOffset": 376294867,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{65241=For detailed information about RIB concepts, configuration tasks, and examples, see the Implementing RIB on Cisco IOS XR Softwaremodule in Cisco IOS XR Routing Configuration Guide for the Cisco XR 12000 Series Router., 32190=count : 1000}",
    "TableContextTimeStampAfterTable": "{336416=via 10.10.34.1, 364424=00:54:05, 305298=172.29.52.70/32, 289585=00:14:36, 274159=13:43:40, 336734=00:00:01, 289269=10.10.10.1/32, 245188=10.12.12.2, 260282=10.12.12.1 Directly connected ... via ..., 320678=15:01:46, 212278=13:14:59}",
    "textBeforeTable": "Syntax Description disable dampening next-hop { ipv4 | ipv6 } address-family no disable dampening next-hop { ipv4 | ipv6 } address-family To disable Routing Information Base (RIB) next-hop dampening, use the address-family next-hop dampening disable command in router configuration mode. To enable RIB next-hop dampening, use the no form of this command. address-family next-hop dampening disable show route summary show route static show route resolving-next-hop show route quarantined show route next-hop show route longer-prefixes show route local show route connected show route best-local show route backup show route show rib vrf show rib vpn-attributes show rib trace show rib tables show rib statistics show rib recursion-depth-max show rib protocols show rib opaques show rib next-hop show rib history show rib firsthop show rib extcomms show rib clients show rib client-id show rib attributes show rib afi-all show rib show rcc",
    "textAfterTable": "Command History Release Modification Release 3.4.0 This command was introduced. Usage Guidelines Task ID Task ID Operations rib read, write Examples The following example shows how to disable RIB next-hop dampening for IPv6 address families:  RP/0/0/CPU0:router# configure  RP/0/0/CPU0:router(config)# router rib  RP/0/0/CPU0:router(config-rib)# address-family ipv6 next-hop dampening disable clear route To clear routes from the IP routing table, use the clear route command in EXEC configuration mode. clear route [ vrf { vrf-name | all } ] { ipv4 | ipv6 | safi-all } {",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}