{
    "relation": [
        [
            "SpacePac™ is self contained, absolutely no hardware to install",
            "Position at almost any location along the full length of the bed – even at the wheel wells",
            "Compliments the use of top load covering products such as netting or tarpaulin",
            "Easily removed and folded for compact storage",
            "Works well with, or without bed liners"
        ],
        [
            "Quick and easy installation",
            "Strong light weight and versatile",
            "High aesthetic value (Looks good !)",
            "Manufactured in six different sizes to fit all pickup truck beds including; Chevy, Ford, GMC, Honda, Dodge, Toyota, Nissan, and many others.",
            "Can be used with Tonneau covers"
        ]
    ],
    "pageTitle": "Truck, accessories items in Truck accessory cargo gate bed divider for pickup trucks. store on eBay!",
    "title": "",
    "url": "http://stores.ebay.com/merikortruckcargogatebeddividers/Truck-cargo-gate-bed-dividers.html",
    "hasHeader": true,
    "headerPosition": "MIXED",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987174.71/warc/CC-MAIN-20150728002307-00091-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 231319876,
    "recordOffset": 231304266,
    "tableOrientation": "VERTICAL",
    "textBeforeTable": "SpacePac™ Features SpacePac™… you’re gonna need it! Welcome to Merikor Enterprises, your online source for pickup truck cargo gate Bed Dividers.                    SpacePac™, a new product innovation from Merikor – the unique, movable, cargo gate bed divider for pickup trucks. The patented SpacePac™ cargo gate bed divider system makes it possible for you to partition your pickup truck bed, so that lightweight, household and sundry items can be placed, and contained in the partitioned area -- and, there is no hardware installation required!        When not in use, the divider can easily be removed, and folded for compact storage. The divider can be positioned at variable locations along the full length of the truck bed … even at the wheel wells. The SpacePac™ cargo bed divider can also be positioned at or near the end gate position, but is not designed to replace the traditional metal tail gate.        Manufactured in six different sizes to fit all pickup truck beds including; Chevy, Ford, GMC, Honda, Dodge, Toyota, Nissan, and many others.",
    "textAfterTable": "     There are no tools, special equipment, or hardware required for installation, positioning, or adjustment of the SpacePac ™ divider. From groceries and nursery plants, to picnics and shopping bags, plus lots of stuff in between … SpacePac™… you're gonna need it! SpacePac™ is also a great gift idea for that pickup owner; Unique, affordable and practical - and way cooler than a bungee cord!! An exclusive offer – direct from the manufacturer; SpacePac™ is patented and sold exclusively by Merikor Enterprises, and only through the Internet. We will usually process, and ship your order within 24 hours! To order, you'll need to measure the inside bed width of your truck , and distance between the wheel wells. Price $104.95 plus shipping and handling. (California residents add sales tax of 8.75 %). International customer sales subject to insurance, duty and local taxes (where applicable).",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}