{
    "relation": [
        [
            "Test",
            "Oral Toxicity (Rats)",
            "Dermal Toxicity (Rats)",
            "Inhalation Toxicity, Vapor (Rats)",
            "Eye Irritation (Rabbits)",
            "Dermal Irritation (Rabbits)"
        ],
        [
            "Results",
            "Not Classified",
            "Not Classified",
            "Not Classified",
            "Eye Irritant Category 2A",
            "Not Classified"
        ],
        [
            "Basis",
            "Based on Ingredients",
            "Product Test Data",
            "Based on Testing of Similar Materials",
            "Based on Testing of Similar Materials",
            "Product Test Data"
        ]
    ],
    "pageTitle": "Globally Harmonized System of Classification and Labelling of Chemicals - GHS",
    "title": "",
    "url": "https://www.osha.gov/dsg/hazcom/ghs.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988840.31/warc/CC-MAIN-20150728002308-00319-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 943658179,
    "recordOffset": 943588625,
    "tableOrientation": "VERTICAL",
    "TableContextTimeStampAfterTable": "{149556=GHS: Globally Harmonized System of Classification and Labelling of Chemicals, United Nations, 1st Revised Edition 2005., 155377=US EPA Label Review Manual (3rd Edition, August 2003) EPA 735-B-03-001., 204060=Chemical identity: Component A 70-80% Common name: Solvent A Numbers of identity: CAS-Nr.:111111-11-1 Impurities: None, 60805=A substance or a mixture that by chemical action will materially damage, or even destroy, metals is termed 'corrosive to metal'. These substances or mixtures are classified in a single hazard category on the basis of tests (Steel: ISO 9328 (II): 1991 - Steel type P235; Aluminum: ASTM G31-72 (1990) - non-clad types 7075-T6 or AZ5GU-T66). The GHS criteria are a corrosion rate on steel or aluminum surfaces exceeding 6.25 mm per year at a test temperature of 55°C., 105997=WARNING: May be fatal if swallowed. Wash thoroughly with soap and water after handling and before eating, drinking or using tobacco., 202055=4. U.S. DOL, OSHA, 29 CFR 1910.1200, HAZCOM., 230763=Skin Contact: may cause reddening, blistering or burns with permanent damage. Harmful if absorbed through the skin. May cause allergic skin reaction., 9086=The single most important force that drove the creation of the GHS was the international mandate (Figure 1.4) adopted in the 1992 United Nations Conference on Environment and Development (UNCED), often called the \"Earth Summit\". The harmonization of classification and labelling of chemicals was one of six program areas that were endorsed by the United Nations General Assembly to strengthen international efforts concerning the environmentally sound management of chemicals. It was recognized that an internationally harmonized approach to classification and labelling would provide the foundation for all countries to develop comprehensive national programs to ensure the safe use of chemicals., 231938=Acute Toxicity Values Oral LD50 (Rat) = 100 mg/kg Dermal LD50 (Rabbit) = 225-300 mg/kg  Inhalation LC50 (Rat) = 200 ppm/4 hr., 1100 ppm vapor/1 hr, 234035=U.S. Federal Regulations Comprehensive Environmental Response and Liability Act of 1980 (CERCLA): The reportable quantity (RQ) for this material is 1000 pounds. If appropriate, immediately report to the National Response Center (800/424-8802) as required by U.S. Federal Law. Also contact appropriate state and local regulatory agencies., 150783=OSHA HCS: U.S. DOL, OSHA, 29 CFR 1910.1200., 201859=2. ISO 11014-1:2003 DRAFT Safety Data Sheet for Chemical Products., 150425=Mexico: Dario Oficial (March 30, 1996) NORMA Oficial Mexicana NOM-114-STPS-1994., 16467=When the IOMC completed developing the GHS, the system was presented to the UN GHS Sub-Committee, which formally adopted the system at its first session in December 2002. It was subsequently endorsed by the UNCETDG/GHS. The UN Economic and Social Council endorsed the GHS in July 2003., 216727=AS 1940 Class: PGII Poisons Schedule: S5, 201742=1. Globally Harmonized System of Classification and Labelling of Chemicals (GHS), United Nations, 2005., 218513=MSDS Prepration date: July 1, 2005, 213310=Summary Comments: May cause severe eye irritation like ocular lesions, which are reversible., 153205=Directive 1999/45/EC of the European Parliament and of the Council of 31 May 1999 related to the classification, packaging and labelling of dangerous reparations., 149078=CPSC FHSA: U.S. CPSC, 16 CFR 1500, FHSA regulations., 150916=Canada Gazette, Part II, Vol. 122, No. 2, 1987., 153558=Directive 2001/58/EC (amending Directive 91/155/EEC) defining and laying down the detailed arrangements for the system of specific information relating to dangerous preparations (SDS)., 25224=\"Articles\" as defined in the OSHA Hazard Communication Standard (HCS) (29 CFR 1910.1200), or by similar definitions, are outside the scope of the GHS. Chemical inventory (e.g., TSCA, EINECS, etc.) and chemical control requirements in various countries are not harmonized by the GHS.Classification in the GHS is criteria-based, not limiting coverage to a list that can become outdated. It is not anticipated that the GHS will develop or maintain an international classification authority or international classification list. Several countries currently maintain regulatory lists. GHS classification criteria can be used to reclassify chemicals on lists, if desired. Existing lists, such as those provide by organizations that evaluate cancer hazards, could be used in conjunction with the GHS to promote harmonization., 45677=Oxidizing gas means any gas which may, generally by providing oxygen, cause or contribute to the combustion of other material more than air does. Substances and mixtures of this hazard class are assigned to a single hazard category on the basis that, generally by providing oxygen, they cause or contribute to the combustion of other material more than air does. The test method is ISO 10156:1996. Currently, several workplace hazard communication systems cover oxidizers (solids, liquids, gases) as a class of chemicals., 152957=Directive 2001/59/EC adapting to technical progress for the 28th time Council Directive 67/548/EEC., 152478=Hazardous Products Act: Controlled Products Regulations; Consumer Chemical and Container Regulations, 2001 Pest Control Products Act; Transportation of Dangerous Goods Act. Health Canada GHS Website, 237341=EU Risk (R) and Safety (S) Phrases: R11: Highly flammable. R23/24/25: Toxic by inhalation, in contact with skin and if swallowed. R37/38: Irritating to respiratory system and skin. R41: Risk of serious damage to eyes. R43: May cause sensitization by skin contact. R45: May cause cancer. R51/53: Toxic to aquatic organisms, may cause long-term adverse effects in the aquatic environment. S53: Avoid exposure - obtain special instructions before use. S16: Keep away from sources of ignition - No Smoking. S45: In case of accident or if you feel unwell, seek medical advice immediately (show the label where possible). S9: Keep container in a well-ventilated place. S36/37: Wear suitable protective clothing and gloves. S57: Use appropriate container to avoid environmental contamination., 15926=In October 1999, the United Nations Economic and Social Council decided (resolution 1999/65) to enlarge the mandate of the Committee of Experts on the Transport of Dangerous Goods by reconfiguring it into a Committee of Experts on the Transport of Dangerous Goods and on the Globally Harmonized System of Classification and labelling of Chemicals (UNCETDG/GHS). At the same time, a new Sub-Committee of Experts on the Globally Harmonized System of Classification and labelling of Chemicals (GHS Sub-Committee) was also created., 8837=\"A globally harmonized hazard classification and compatible labelling system, including material safety data sheets and easily understandable symbols, should be available, if feasible, by the year 2000.\", 132439=Flammable liquids, toxic, n.o.s. (contains XYZ) UN 1992, 210454=Physical state: Liquid Colour: Colourless, transparent Odour: Solvent, ester-like Odour threshold: Not available pH-value: Not applicable Melting point: Not available Freezing Point: Not available Initial boiling point: 56°C Flash point: - 22°C DIN 51755 Evaporation rate: Not available Flammability (solid, gas): Not applicable Explosion limits: lower limit = 1.4 Vol%; upper limit 13.0 Vol% (literature) Vapour pressure: 240 mbar (highest partial vapour pressure) at 20°C Vapour density: Not available Relative density: 0.89 g/cm3 at 20°C Solubility: Partially soluble in water at 20°C Partition coefficient: Log Kow = 3.3 Auto-ignition temperature: Not available Decomposition temperature: Not available, 155053=OSHA Hazard Communication Standard 29 CFR 1910.1200., 228033=Respiratory Protection: If exposure limits are exceeded, NIOSH approved respiratory protection should be worn. A NIOSH approved respirator for organic vapors is generally acceptable for concentrations up to 10 times the PEL. For higher concentrations, unknown concentrations and for oxygen deficient atmospheres, use a NIOSH approved air-supplied respirator. Engineering controls are the preferred means for controlling chemical exposures. Respiratory protection may be needed for non-routine or emergency situations. Respiratory protection must be provided in accordance with OSHA 29 CFR 1910.134., 155119=CPSC Consumer Product Safety Act (15 U.S.C. 2051 et seq.) and Federal Hazardous Substances Act (15 U.S.C. 1261 et seq.)., 17926=Several international bodies have proposed implementation goals. The World Summit on Sustainable Development (WSSD) and the Intergovernmental Forum for Chemical Safety (IFCS) have encouraged countries to implement the new GHS as soon as possible with a view to having the system fully operational by 2008. The Ministers of the Asia-Pacific Economic Cooperation (APEC) have also said that as many APEC economies as possible should implement, on a voluntary basis, the GHS by 2006. Under the North American Free Trade Agreement (NAFTA), the Tri-national Occupational Safety and Health Group and the NAFTA Pesticides Technical Working Group are discussing the GHS., 215989=UN-number: 1993 UN proper shipping name: Flammable Liquid, N.O.S. (Contains Component C) Transport hazard class: 3 Packing group: II Marine Pollutant: No, 154017=ISO 11014-1:2003 DRAFT Safety Data Sheet for Chemical Products., 150199=Korea: Korean Ministry of Labor Notice 1997-27 \"Preparation of MSDS and Labelling Regulation\"., 104539=Flammable liquids, toxic, n.o.s. (contains XYZ) UN 1992, 202806=Telephone no. +44 171717 555.555 5, Emergency no. +44 171717 333 333 3, 154116=Globally Harmonized System of Classification and Labelling of Chemicals (GHS) (\"The Purple Book\"), United Nations, 2005 First Revised Edition, available online or from United Nations Publications. UN GHS website, 150731=Materials Identification System, 2001., 150519=NFPA: National Fire Protection Association, 704 Standard, System for the Identification of Fire Hazards of Materials, 2001., 231140=Target Organ Effects: May cause gastrointestinal (oral), respiratory tract, nervous system and blood effects based on experimental animal data. May cause cardiovascular system and liver effects.}",
    "textBeforeTable": "Figure 1.2 While the existing laws and regulations are similar, they are different enough to require multiple labels for the same product both within the U.S. and in international trade and to require multiple safety data sheets for the same product in international trade. Several U.S. regulatory agencies and various countries have different requirements for hazard definitions as well as for information to be included on labels or material safety data sheets. The sound management of chemicals should include systems through which chemical hazards are identified and communicated to all who are potentially exposed. These groups include workers, consumers, emergency responders and the public. It is important to know what chemicals are present and/or used, their hazards to human health and the environment, and the means to control them. A number of classification and labelling systems, each addressing specific use patterns and groups of chemicals, exist at the national, regional and international levels. The existing hazard classification and labelling systems address potential exposure to chemicals in all the types of use settings listed above. Chemicals directly or indirectly affect our lives and are essential to our food, our health, and our lifestyle. The widespread use of chemicals has resulted in the development of sector-specific regulations (transport, production, workplace, agriculture, trade, and consumer products). Having readily available information on the hazardous properties of chemicals, and recommended control measures, allows the production, transport, use and disposal of chemicals to be managed safely. Thus, human health and the environment are protected.",
    "textAfterTable": "> 50 ≤ 500 Toxicity Category II > 500 < 5000 Toxic Category III > 5000 Toxicity Category IV CPSC/US/FHSA < 50 Highly Toxic > 50 ≤ 500 Toxic   GHS ≤ 5 > 5 ≤ 50 > 50 ≤ 300 > 300 ≤ 2000 > 2000 ≤ 5000 DOT/US < 5 Packing Group I > 5 < 50 Packing Group II > 50 < 200 (solid) > 50 > 500 (liquid) Packing Group III   NFPA/US ≤ 5 Hazard Category 4 > 5 ≤ 50 Hazard Category 3 > 50 ≤ 500 Hazard Category 2 > 500 ≤ 2000 Hazard Category 1 > 2000 Hazard Category 0   NPCA/US/HMIS ≤ 1 Toxicity Rating 4 > 1 ≤ 50 Toxicity Rating 3 > 50 ≤ 500 Toxicity Rating 2 > 500 ≤ 5000 Toxicity Rating 1 > 5000 Toxicity Rating 0 EU < 25 Very Toxic > 25 > 200 Toxic > 200 < 2000 Harmful   WHMIS/Canada ≤ 50 Very Toxic WHMIS Class D, Division 1, Subdivision A > 50 ≤ 500 Toxic",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}