{
    "relation": [
        [
            "Categories",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "Join clubs and teams",
            "The food is okay",
            "There are no dorms",
            "Academically it is very challenging at times but I'd rather be challenged than sail smoothly through a course",
            "I would say try to tale as many college prep classes as possible . I didn't and even though I have good grades it would've prepared me mentally for what to expect at the college level",
            "Solano Community College is good because it has program for the incoming freshman where we can go on field trips and get to know each other as well as learn"
        ]
    ],
    "pageTitle": "Solano Community College Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Solano-Community-College/reviews?_escaped_fragment_=/show/20399",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438043062635.98/warc/CC-MAIN-20150728002422-00175-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 898299431,
    "recordOffset": 898253013,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{201418=Recreational activities in Solano County are varied including movies, theaters (on and off-campus), visiting the local farmer's markets (ex. Suisun, Fairfield, Green Valley, and Vallejo), visiting the local wineries (ex. Suisun, Napa, Sonoma, and Calistoga areas), Suisun Kroc Center recreational activities, bicycling, local hiking (ex.Rush Ranch), fishing near the Suisun Marsh and Grizzly Island, Fourth of July celebrations, day trips to San Francisco and/or the Napa Valley, and an abundance of local restaurants and cultural cuisines. These are just the tip of the iceberg of fun activities available to Solano Community College students and the local community., 9082=If you are interested in attending Solano, make sure that you see a counselor as soon as possible. Also, apply for Financial Aid well in advance (as close to Jan. 1 is possible). Research your professors so that your class experience can be better. Most of all, stay on track! Try to take classes that you know will definitely transfer if you're looking to transfer. If needed, make more than one counselor appointment. Ask other students about scholarships you can apply for., 224560=© 2015, Cappex.com, LLC, 198654=Take a tour around campus. A great way to know the latest news on campus is by attending the weekly meeting of the Associated Students of Solano College (ASSC) in building 1400, every Tuesday., 27026=I'm not sure what this means? I will graduate Soalno Jr College this May with 5 AA Degrees. I studied my graduating, transfer courses, and all the classes I needed also for my high school requirements. I have attended since the 7th grade and I will receive my high school diploma this June. I am only 17 years old. I feel good.}",
    "textBeforeTable": "01/20/2011 Reviewer is A current student here. 2 out of 2 people found this review useful. 1 of 55 Anita from Vacaville, CA Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5",
    "textAfterTable": "Sage from Vallejo, CA 09/12/2011 Reviewer is A past student here. 2 out of 2 people found this review useful. 2 of 55 Categories Comments Great for these types of students Anyone who wants an education but can't attend a 4-year college should try Solano. Tips for prospective students Register as soon as possible, classes fill up quick. Make sure to do the research yourself or speak with a counselor before you register. It's easy to plan out your classes well in advance to ensure you either get your degree, make your transfer requirements, or do both within two years but it's also very easy to stay at Solano for up to five without transferring. Be careful! Bang for the buck It's a community college. It costs less than car insurance. Did enjoy being here Seeing as Solano is my only college experience thus far, it's hard to compare enjoyment of this college with others that I've never attended. Despite",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}