{
    "relation": [
        [
            "First Name",
            "Marcus",
            "Olivia"
        ],
        [
            "Last Name",
            "Faust",
            "Sanford"
        ],
        [
            "Suffix",
            "",
            ""
        ],
        [
            "Covered Official Position (if applicable)",
            "",
            ""
        ],
        [
            "New",
            "",
            ""
        ]
    ],
    "pageTitle": "LD-2 Disclosure Form",
    "title": "",
    "url": "http://soprweb.senate.gov/index.cfm?event=getFilingDetails&filingID=FACEE008-F486-4088-B0A7-EE1B22E270D5&filingTypeID=69",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988840.31/warc/CC-MAIN-20150728002308-00091-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 231050585,
    "recordOffset": 231042383,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{37570=Transmission siting and permitting issues generally; H.R. 2454, \"American Clean Energy and Security Act\", (Cease & Desist Market Manipulation Section);, 43187=H.R. 4213, \"The American Jobs and Closing Tax Loopholes Act of 2010\", (energy extenders and pension relief); H.R. 4149, To amend the Internal Revenue Code of 1986 to provide a renewable electricity integration credit for a utility that purchases or produces renewable power, (renewable integration credit); S.722, \"Taxpayer Certainty and Relief Act of 2009\", (dividend tax relief); S. 3381, A bill to amend the Clean Air Act to modify certain definitions of the term \"renewable biomass\", and for other purposes; H.R. 5297, \"Small Business Lending Fund Act\", (bonus depreciation); S. 2854, A bill to amend the Internal Revenue Code of 1986 to extend and modify the credit for new qualified hybrid motor vehicles, and for other purposes, (tax credits for EV's); S. 3442, \"The Electric Vehicle Deployment Act of 2010\", (tax credits for EV's); S.3715, \"Charging America Forward Act\", (Tax credits for EV's); S.3793, \"Job Creation and Tax Cuts Act of 2010\", (extension of tax credits for EV's and energy efficiency);, 1019=Lobbying Disclosure Act of 1995 (Section 5) - All Filers Are Required to Complete This Page, 31214=S. 773, \"Cyber Security Act of 2009\"; S. 946, \"Critical Electric Infrastructure Protection Act\"; H.R. 2195, \"Critical Electric Infrastructure Protection Act\"; H.R. 2165, \"Bulk Power System Protection Act\"; H.R. 2868, \"Chemical Facility Anti-Terrorism Act\" (reauthorizes and establishes new requirements for securing facilities); S. 2996, \"Continuing Chemical Facilities Antiterrorism Security Act\" (Extends authorization of current CFATS program); S.3480, \"Protecting Cyber Space as a National Asset Act of 2010\"; S.3538, \"National Cyber Infrastructure Protection Act of 2010\"; H.R.5548, \"Protecting Cyber Space as a National Asset Act of 2010\"; H.R.5026, \"Grid Reliability and Infrastructure Defense Act of 2010\";, 12157=H.R. 391, to amend the Clean Air Act to provide that greenhouse gases are not subject to the Act; S. 787, \"The Clean Water Restoration Act\", (clean water act jurisdictional issues); H.R. 2454, \"American Clean Energy and Security Act\"; H.R. 4396, \"Save Our Energy Jobs Act\"; H.R. 4572, to amend the Clean Air Act relating to greenhouse gases; H.R. 4753, Stationary Source Regulations Delay Act; H.R. 4934, Maintaining Agency Direction on Financial Fraud Act (SEC climate change guidance); H.J.Res. 66, resolution disapproving a rule submitted by EPA relating to endangerment and cause or contribute findings for greenhouse gases under section 202(a) of the Clean Air Act; H.J.Res. 76, resolution disapproving a rule submitted by EPA relating to the endangerment finding and the cause or contribute findings for greenhouse gases under section 202(a) of the Clean Air Act; H.J.Res. 77, resolution disapproving a rule submitted by EPA relating to the endangerment finding and the cause or contribute findings for greenhouse gases under section 202(a) of the Clean Air Act; H.Res. 974, resolution urging EPA to reevaluate the endangerment and cause or contribute findings regarding greenhouse gases signed on December 7, 2009; S. 636, to amend the Clean Air Act to conform the definition of renewable biomass to the definition given the term in the Farm Security and Rural Investment Act of 2002; S. 1733, Clean Energy Jobs and American Power Act; S. 1622, Clean Air Protection Act; S. 1933, Natural Resources Climate Adaptation Act; S. 2729, Clean Energy Partnerships Act of 2009; S. 2744, Carbon Dioxide Capture Technology Act of 2009; S. 2835, International Climate Change Investment Act of 2009; S. 2877, Carbon Limits and Energy for Americas Renewal (CLEAR) Act; S. 2995, Clean Air Act Amendments of 2010; S. 3072, Stationary Source Regulations Delay Act; S. 3032, Maintaining Agency Direction on Financial Fraud Act (SEC climate change guidance); S. 3381, to amend the Clean Air Act to modify certain definitions of the term renewable biomass; S.J.Res. 26, resolution disapproving a rule submitted by EPA relating to the endangerment finding and the cause or contribute findings for greenhouse gases under section 202(a) of the Clean Air Act; Casey-Carper draft legislation to codify EPA tailoring rule; Kerry-Lieberman draft legislation on climate change and energy policy (American Power Act) (electric utility industry issues, including cost-containment and technology development) S.1816, \"Chesapeake Clean Water and Ecosystem Restoration Act\", (reauthorizes Chesapeake Bay program and expands EPA authorities and requirements); H.R.3852, \"Chesapeake Clean Water and Ecosystem Restoration Act\", (reauthorizes Chesapeake Bay program and expands EPA authorities and requirements); S. 3464, \"Practical Energy and Climate Plan Act of 2010\"; Bingaman draft legislation on climate change policy affecting only the electric power sector. H.R. 5088, \"America's Commitment to Clean water Act\", (addresses Clean Water jurisdictional issues); H.R. 5674, Mercury Reduction and Energy Security Act S. 3655, establishing a point of order against certain climate change legislation; Climate Change legislation generally. Ocean policy generally;, 27961=S. 146, \"Railroad Antitrust Enforcement Act\"; H.R. 233, \"Railroad Antitrust Enforcement Act\"; S. 2889, \"Surface Transportation Board Reauthorization Bill\" S.3442, \"Electric Vehicle Deployment Act of 2010\"; S. 3495, \"Promoting Electric Vehicles Act of 2010\"; S. 3511, \"Promoting Electric Vehicles Act of 2010\"; S.3815 : Promoting Natural Gas and Electric Vehicles Act of 2010; S.3715 : Charging America Forward Act; S.3663, \"Clean Energy Jobs and Oil\" Company Accountability Act of 2010 (electric transportation), 18261=H.R. 2454, \"American Clean Energy and Security Act\"; H.R. 4785, \"Rural Energy Savings Program Act\"; S. 949, \"21st Century Energy Technology Deployment Act\"; S. 1175, authorizing DOE loans to electric utilities to carry out projects to comply with Federal RES; S. 1462, American Clean Energy Leadership Act of 2009; S. 3021, Support Renewable Energy Act of 2010; Graham draft clean energy standard legislation; S. 3464, Practical Energy and Climate Plan Act of 2010. H.R. 5019 \"Home Star Energy Retrofit Act of 2010\", (energy efficiency); H.R. 5883, Renewable Energy Jobs and Security Act H.R. 5899, A Roadmap for Americas Energy Future (reverse auction for renewables); S. 20, Clean Energy Standard Act S. 3576, Securing Americas Future with Energy and Sustainable Technologies Act (RES/EERS); S. 3618, Enabling the Nuclear Renaissance Act (including declaring nuclear as renewable); S. 3663, Clean Energy Jobs and Oil Company Accountability Act (electric vehicles; Home Star energy efficiency); S. 3813, Renewable Electricity Promotion Act (renewable electricity standard); S. 3923, Let the States Innovate on Sustainable Energy Act (state feed-in-tariff authority). H.R.5476, Building Star Energy Efficiency Act of 2010; S.3591, \"Carbon Capture and Sequestration Deployment Act of 2010\"; S.3590, \"Carbon Capture and Sequestration Deployment Revenue Act of 2010; S.3589, \"Carbon Capture and Sequestration Deployment Act of 2010\";, 46941=House Chairmans mark, FY 2011 Labor-HHS-Education appropriations bill; (LIHEAP funding) S. 3686 - Departments of Labor, Health and Human Services, and Education, and Related Agencies Appropriations Act, 2011, (LIHEAP funding)}",
    "textBeforeTable": "",
    "textAfterTable": "City Washington State DC Zip Code 20002 Country USA 3. Principal place of business (if different than line 2) City   State   Zip Code   Country   4a. Contact Name b. Telephone Number c. E-mail  Ms.  DESTINY IORG  2025475400  destinyiogr@msn.com 5. Senate ID#  14223-90",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}