{
    "relation": [
        [
            "Cited Patent",
            "US4661913 *",
            "US4769756 *",
            "US4839853",
            "US5283737 *",
            "US5301109",
            "US5648919 *",
            "US5721939 *",
            "US5802361 *",
            "US6018736 *",
            "US6038561 *",
            "US6167398",
            "US6189002 *",
            "US6362589 *",
            "US6523019",
            "US6662159 *",
            "US6671683",
            "US6826300 *",
            "US7016882 *",
            "US7035461 *",
            "US7062438 *",
            "US7117190 *",
            "US7177851 *",
            "US7249116 *",
            "US7274822 *"
        ],
        [
            "Filing date",
            "11 Sep 1984",
            "7 Aug 1986",
            "15 Sep 1988",
            "21 Sep 1990",
            "17 Jul 1991",
            "14 Feb 1994",
            "3 Aug 1995",
            "30 Sep 1994",
            "20 Nov 1996",
            "15 Sep 1997",
            "30 Jan 1998",
            "8 Dec 1999",
            "19 Jan 2000",
            "28 Oct 1999",
            "28 Oct 1996",
            "28 Jun 2001",
            "31 May 2002",
            "26 Apr 2004",
            "22 Aug 2002",
            "13 Mar 2003",
            "30 Nov 2000",
            "9 Nov 2001",
            "6 Apr 2003",
            "30 Jun 2003"
        ],
        [
            "Publication date",
            "28 Apr 1987",
            "6 Sep 1988",
            "13 Jun 1989",
            "1 Feb 1994",
            "5 Apr 1994",
            "15 Jul 1997",
            "24 Feb 1998",
            "1 Sep 1998",
            "25 Jan 2000",
            "14 Mar 2000",
            "26 Dec 2000",
            "13 Feb 2001",
            "26 Mar 2002",
            "18 Feb 2003",
            "9 Dec 2003",
            "30 Dec 2003",
            "30 Nov 2004",
            "21 Mar 2006",
            "25 Apr 2006",
            "13 Jun 2006",
            "3 Oct 2006",
            "13 Feb 2007",
            "24 Jul 2007",
            "25 Sep 2007"
        ],
        [
            "Applicant",
            "Becton, Dickinson And Company",
            "The United States Of America As Represented By The Department Of Health And Human Services",
            "Bell Communications Research, Inc.",
            "Prolab Software Inc.",
            "Bell Communications Research, Inc.",
            "Babcock-Hitachi Kabushiki Kaisha",
            "Xerox Corporation",
            "Apple Computer, Inc.",
            "Phonetic Systems Ltd.",
            "Manning & Napier Information Services",
            "British Telecommunications Public Limited Company",
            "Dolphin Search",
            "Sony Corporation",
            "Choicemaker Technologies, Inc.",
            "Canon Kabushiki Kaisha",
            "Matsushita Electric Industrial Co., Ltd.",
            "George Mason University",
            "Affinnova, Inc.",
            "Eastman Kodak Company",
            "Sony Corporation",
            "Sony Corporation",
            "Affinnova, Inc.",
            "Fiske Software, Llc",
            "Microsoft Corporation"
        ],
        [
            "Title",
            "Apparatus and method for the detection and classification of articles using flow cytometry techniques",
            "Systematic method for matching existing radiographic projections with radiographs to be produced from a specified region of interest in cancellous bone",
            "Computer information retrieval using latent semantic structure",
            "Mechanism for generating linguistic expressions based on synonyms and rules derived from examples",
            "Computerized cross-language document retrieval using latent semantic indexing",
            "Maintenance systems for degradation of plant component parts",
            "Method and apparatus for tokenizing text",
            "Method and system for searching graphic images and videos",
            "Word-containing database accessing system for responding to ambiguous queries, including a dictionary of database words, a dictionary searcher and a database searcher",
            "Management and analysis of document information text",
            "Information retrieval system and method that generates weighted comparison results to analyze the degree of dissimilarity between a reference corpus and a candidate document",
            "Process and system for retrieval of documents using context-relevant semantic profiles",
            "Robot apparatus",
            "Probabilistic record linkage model derived from training data",
            "Recognizing speech data using a state transition model",
            "Apparatus for retrieving similar documents and apparatus for extracting relevant keywords",
            "Feature based classification",
            "Method and apparatus for evolutionary design",
            "Method for detecting objects in digital images",
            "Speech synthesis method and apparatus, program, recording medium and robot apparatus",
            "Robot apparatus, control method thereof, and method for judging character of robot apparatus",
            "Method and apparatus for dynamic, real-time market segmentation",
            "Machine learning",
            "Face annotation for photo management"
        ]
    ],
    "pageTitle": "Patent US7421418 - Method and apparatus for fundamental operations on token sequences ... - Google Patents",
    "title": "",
    "url": "http://www.google.co.uk/patents/US7421418?dq=6,167,398",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988840.31/warc/CC-MAIN-20150728002308-00333-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 480076399,
    "recordOffset": 480012455,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{6539=FIG. 40 is a cover sheet from a overview of the business term value (BTV) extraction technology. FIG. 41 indicates the internal status of various embodiments of the invention as of Jan. 24, 2002. FIG. 42 illustrates the overall process flow of the BTV procedure. FIG. 43 shows an example of a clause that has been annotated with BTV markers (also referred to as “tags”). FIG. 44 shows a training set for BTVs that occur within the introduction clause in a contract. FIG. 45 is an example of a target clause—the goal will be to extract the BTVs contained within this clause. FIG. 46 shows the results of the BTV extraction for the “effective date.” FIG. 47 is another example of a target clause—the goal is to extract the supplier name. FIG. 48 shows the annotated clauses for the “agreement term” BTV. This is the training set. FIG. 49 shows the results of the BTV extraction for the “agreement term.” FIG. 50 lists further embodiments of the invention as of Jan. 24, 2003.}",
    "TableContextTimeStampAfterTable": "{82812=This patent application claims priority of U.S. Provisional Application Ser. No. 60/448,508 filed Feb. 19, 2003 titled “Method and Apparatus for Operations on Token Sequences: Computing Similarity, Extracting Term Values, and Searching Efficiently”, which is hereby incorporated herein by reference.}",
    "textBeforeTable": "Patent Citations Thus a method and apparatus for fundamental operations on token sequences: computing similarity, extracting term values, and searching efficiently have been described. As used in this description, “one embodiment” or “an embodiment” or similar phrases means that the feature(s) being described are included in at least one embodiment of the invention. References to “one embodiment” in this description do not necessarily refer to the same embodiment; however, neither are such embodiments mutually exclusive. Nor does “one embodiment” imply that there is but a single embodiment of the invention. For example, a feature, structure, act, etc. described in “one embodiment” may also be included in other embodiments. Thus, the invention may include a variety of combinations and/or integrations of the embodiments described herein. Temporal aspects of the present invention have not been largely discussion, however one of skill in the art will appreciate that computationally profiles are more time consuming than generation of transition probabilities. Thus, off-line or pre-generated profiles which are then compared against substantially real-time generated transition probabilities may be efficient use of compute power providing the user with a more rapid response than real-time generation of both profiles and transition probabilities. The description of the invention in the discussion has illustrated how to locate a high degree of similarity between a profile and a target, one of skill in the art will recognize that the present invention could also be",
    "textAfterTable": "* Cited by examiner Non-Patent Citations Reference 1 Aapo Hyvarinen, et al. \"Independent Component Analysis\", 2001, pp. 124-143, John Wiley & Sons, Inc., New York, US, ISBN 0-47-40540-X. 2 Alex Aiken, \"A System for Detecting Software Plagiarism\" at <http://www.cs.berkeley.edu/~aiken/moss.html> 1994. 3 Arthur Gingrande, \"Processing unstructure forms on the fly,\" KM World, Feb. 2003, 12 (2), <http://www.kmworld.com/publications/magazine/index.cfm?action=readarticle&Article<SUB>-</SUB>ID=1433&Publication<SUB>-</SUB>ID=84>. 4 Bellegarda J R : \"Exploiting Latent Semantic Information in Statistical Language Modeling\" Proceedings of the IEEE, IEEE . New York, US, vol. 88, No. 8, Aug. 2000, pp. 1279-1296, XP002219343 ISSN : 0018-9219 the whole document. 5 Bellegarda J R ed-European Speech Communication Association (IESCA): \"A Latent Semantic Analysis Framework for Large-Span Language Modeling\" 5th European Conference on Speech Communication and Technology, Eurospeech '97, Rhodes, Greeze, Sep. 22-25, 1997, European Conference on Speech Communication and Technology . (Eurospeech), Grenoble : ESCA, FR, vol. vol. 3 of 5, Sep. 22, 1997 ; pp. 1451-1454, XP001045096 the whole document. 6 Bill Yerazunis, \"CRM114-the Controllable Regez Mutilator,\" <http://crm114.sourceforge.net/> 2002.",
    "hasKeyColumn": true,
    "keyColumnIndex": 3,
    "headerRowIndex": 0
}