{
    "relation": [
        [
            "Categories",
            "Food and Dining",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "I have heard the food is gross, and there isn't too much of a variety",
            "Classes are fun!",
            "Be sure to get housing picked out ASAP",
            "Nice people. Can give you the runaround. Nice campus."
        ]
    ],
    "pageTitle": "North Dakota State University Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/North-Dakota-State-University-Main-Campus/reviews?_escaped_fragment_=/show/24722",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987174.71/warc/CC-MAIN-20150728002307-00200-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 909906555,
    "recordOffset": 909841736,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{293117=- Have an extremely warm winter coat, hat, gloves, boots, scarves, and long johns. It gets really cold in Fargo with the wind. - Do not let one teacher/professor make you rethink your major. Where there is one bad teacher there are ten great ones. - Join organizations that you find interesting and want to support or start your own organization. - Set an alarm for 7:55 am on Mondays when football tickets go on sale. Make sure you are logged on at 8 am or you may not get a ticket to the game and that is no fun., 328975=© 2015, Cappex.com, LLC, 38261=Food is really good compared to other cafeteria style dining. It has its ups and downs. I don't prefer their asian food, but man is their burger bar the best thing ever. Take advantage of the chocolate milk! And get creative with the grills. There's so much you can make on your own in the dining center! One down side I have is, all the dining centers are closed on the weekend except for The Residence Dining Center. It's a big bummer during the winter. Living in Dinan, I had to get some confidence to make the trek during -40 degrees in January., 221202=March over!!!!!!!!!!}",
    "textBeforeTable": "12/06/2010 Reviewer is A current student here. 8 out of 8 people found this review useful. 1 of 74 Bryce from Woodbury, MN Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else",
    "textAfterTable": "Am learning a lot There are plenty of majors and classes to select from. NDSU does a very good job of keeping classes interesting and very informative. I believe that the classes I take from my major are very crucial part of class and I love taking them. Login to rate or flag the reviews Sarah from Brooklyn Park, MN 08/11/2012 Reviewer is A current student here. 5 out of 5 people found this review useful. 2 of 74 Categories Comments Campus Safety Top-notch. Clubs and Activities Tons and tons and tons of clubs/activities. An activity fair is hosted each year, about twice a year just so you can get a real in-depth look at each club and see what you're most interested in. Great for these types of students Friendly, determined, hard-working, happy-go-lucky students. Bang for the buck",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}