{
    "relation": [
        [
            "Categories",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "If something is fun to you, someone else at Penn State likes it too! go find them and do it together. No matter what you are into, there are a ton of fun things to do.",
            "The food is great so try to eat and dine as much as you can!",
            "Dorm life is amazing and incredibly fun, but do not forget about school work. Balance the two.",
            "As you get into your respective major, the academic rigor increases tenfold. So buckle down and always give it your best work.",
            "Be flexible, and go in with an open mind. Its okay if you do not have a major in mind because you will definitely find one here.",
            "Penn State is a great school. It offers a multitude of areas of study, as well as a great college environment. Its staff and my fellow students are the best around."
        ]
    ],
    "pageTitle": "Pennsylvania State University Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Penn-State-University/reviews?_escaped_fragment_=/show/21223",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 125,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438043062635.98/warc/CC-MAIN-20150728002422-00248-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 894727119,
    "recordOffset": 894518424,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{981349=Go on Lantern Tours at the end of October - it's a great, fun way to learn about Penn State's history (and you get free food!)., 602204=There are 950 organizations at Penn State. I am in about 5 and overwhelmed with activities. THON is the biggest activity at Penn State. It is the biggest student run philanthropy in the world. Last year we raised 10.2 million dollars for pediatric cancer. We are very involved with the families who have kids with cancer. Almost every group on campus does something for THON, whether they raise money or represent a family. It is a huge unified event at Penn State. No other school can compare. The 48 hour dance marathon in February changed my life forever., 878823=be wary, penn state is a very numbers oriented school. i was well above the 75% of sat scores and gpa, as well as attending a private high school, yet i was denied. it is best to apply early (rolling admissions) and not before the november deadline. also, they only take a certain percentage of kids from one certain high school, prefer in staters, and also put legacies well above a more qualified student. i thought this would be an easy school to be admitted to, but it really is technical., 251442=The tuition money is reasonable when you consider how many classes and activities the school offers for you. One thing that is a bit pricey is the meal plans for on-campus students. They make you pay a base cost of over $1000 and then you add the actual dining dollars onto that. This is because everything you buy with meal points is at an extremely reduced price, but I would rather know and pay the real cost than feel like I'm being ripped off by paying thousands of real dollars for only 400 meal points., 523971=East dining hall has the worst food. I've eaten at the dining hall maybe twice, and I really don't like it. The best place to eat in East is at Roxy's. The burgers are pretty good, and it's a good place to get breakfast. There is also the Big O, which sells everything from salads to pizza, chicken nuggets and fries. I think West dining has the best food, and the best cookies, but South dining is also good place to eat too. Insomnia Cookies has amazing cookies that you can order too. I've never eaten at North dining so I don't know about that one. You do get tired of eating campus food pretty quickly, as it is the same food over and over. If that happens then there are also some good places you can order food from, such as Wings Over. It has the best wings and cajun fries for less than $20. Lionsmenu.com has a whole list of places. There are also convenient stores on campus that you can get snacks and microwaveable food. The HUB, which is in the middle of campus, is a very convenient place to eat and has different places, such as Burger King and Starbucks. The best ice cream that you will ever taste in your life is at the Berkey Creamery on campus., 11482=DO not waste your time. The worst thing you can do is not take advantage of all the opportunities schools can offer. Networking, getting involved, joining clubs, getting to know your teachers can only benefit you. DO learn how to budget your time. You need to be able to balance school work with having fun. This is probably one of the hardest things to do when you enter college. Its not like high school, teachers will not be lenient, and if you miss an exam you will get a 0. Stay on top of your work, and study in advance for test. Exams cover so much more material than they did in high school. DO know your limit. When you go out, know when you need to stop, and when its time to go home. Always go out with friends and stay with someone you know. There are buses that run till around 2 - 2:30 at night, and are the easiest ways to get back to dorms. You can have a good time, just be safe about it. DO go to your teacher and ask for help if you do not understand something. Don't let yourself get behind because if you do it is so much harder to catch up. Having to drop a class because your afraid of failing sucks! DO take online classes with your friends. Some are easy general education classes that do not require as much work/time because you do not have to go sit in a classroom. Also taking them with people you know helps, you can ask each other questions. DO stay on top of dates. It might sound stupid, but if you forget to do something, chances are your going to have problems. Housing and classes go quick. If you do not schedule when you are suppose to the class will fill and you will miss your chance to get it. There are deadlines for everything. Planners help a lot with keeping things organized., 86677=Penn State has so much to offer I feel like I'm getting a good bit for my money. The two things I have problems with are the cost of the meal plan and the fact that access to weight lifting facilities costs additional money. The meal plan has a base cost of $1250 and additional costs for how much food you want to eat. The base cost goes towards 'facilities' and not the food itself. Any of the on-campus dining commons allow you to use the meal points to buy food at 65% off, but if you just stick with the default 3rd level meal plan, the costs end up being the same as if you didn't have a meal plan and just paid the full price every meal., 555575=You can't put a price on education. Penn State's tuition increase by a little over $1000 for this upcoming 2012-2013 academic year, but values and lessons learned inside and outside of the classroom at Penn State can be and will be used throughout your adult life., 731681=Penn State Greek Life is composed of almost 90 fraternities and sororities made up of various ethnically-enriched backgrounds and individual talents. The basic principle of membership are Academic Achievement, Service and Philanthropy, Leadership, Brotherhood & Sisterhood, Social, and Alumni Involvement. With the creation of the IFC-Panhellenic Dance Marathon - a.k.a. THON - in 1973, and involvement with such ever since its induction, PSU Greeks are known for giving back to their community. Greek life is also active within community drives, IM sports, and local efforts such as recycling drives., 77523=because their are so many students who attend penn state, the dorms are rather small. i don't have any complaints though. the bathrooms are cleaned daily, each floor has several different trashcans that follow an exclusive recycling program, and the rooms each have enough room (in my opinion) for all of the essentials. their is heat in the winter because it gets really cold, just not air conditioning in the summer. i didn't find that to be a problem because it starts to get cool in september, and you can just open the windows to get fresh air. each ra has floor bonding activities planned every once and awhile, so there fun things to do. each dorm complex has its own dining hall and study area, and each building has a floor designated with rooms for studying. there are also vending machines on the first floor of every building., 216790=Lion Shrine, class gift of 1960... something :D. It's the lion everyone knows and the classic iconic photo from PSU. Mifflin Streak -- the weekend before finals, we go streaking to blow off stress. Yes, it's as awesome as it sounds., 508101=I've gone home at 2:00AM and nothing has happened. You'll be given the campus police number, make sure yo always have it on you!, 716919=Feel safe and system provided by campus police if leaving the library at 2:00 am and walking to my dorm. Have not got any problems thus far and some of my male friends have adopted me as their little sister and are there for me if i called them or feel uncomfortable., 53307=I hope you like a huge school. The first couple weeks you will be lucky to see someone you recognize. If you like football, you will love Penn State. The games are amazing. If you want to wear shorts in the middle of October however, Penn State isn't for you. I think I wore shorts through September and that was all. My first semester, it didn't rain 3 Thursdays the whole time (it would be wise to invest in an umbrella and a pair of rain boots). Make sure you don't mind walking to class in the wind and snow either. I slipped and fell right on my butt on my way back from class. I couldn't help but look at the 2 guys that saw my moment of gracefulness and laugh at myself. For the record if it happens to you, you aren’t alone! Just laugh at yourself for a second and hope someone comes over to help to you up!, 224381=I am a senior of the class of 2011. I'm about to go to PSU in the fall and I'm super pumped to go. If you are thinking about going to Penn State I would recommend visiting the college, especially when classes are in session, because it's a good way to get a feel for the campus and what it will be like when u get there. Also, it is SUPER IMPORTANT that you meet an admissions counselor and someone in the department you are looking at. It helps in making good connections and they can also help you out for different scholarships...It helped me get a full ride!!, 39049=I love my first semester at Penn State. There is so much to do on and off campus. This year was the first time I went laser tagging and it was with a whole bunch of new friends I met this year in school. I also met my current boyfriend here and in September it will have been a year. You have more freedom and more space. Friends are not hard to find and clubs are not hard to join. I'm in 8 different clubs and also the women's volleyball team captain this year. There are times where you do miss being home but that's what the phone is here for, to call the people you miss and cherish the most. It is a wonderful school and you can even talk to your own personal advisor about how to deal with things on and off campus., 728396=Don't schedule 8:00 ams everyday for your fall semester and try not to overestimate yourself. You're obviously smart, but there's more to college than just academics and the first semester is all about learning how to be independent and manage your time. As much as everyone says it, it's so worth it to get great GPA's in the beginning., 828634=THON is Penn State's annual philanthropic event. It stands for the Penn State IFC/Panhellenic Dance Marathon, and while it is a year-long effort, the actual two-day, no-sitting dance marathon occurs in February. Throughout the year, the entire Penn State community gets in involved in activities, including a 5K and a family carnival, to raise awareness and money for pediatric cancer research. This is an awesome tradition that every Penn State student will remember when he/she looks back on their college years., 215576=THON, or Dance MaraTHON is a year-long fundraiser for pediatric cancer. 3/4 times a year we go out canning as a University, so some 20k+ strong heads out in a 300 mile radius with cans in hand asking for donations. Then in february, we have a 46 hour no sitting, no sleeping dance marathon. BEST. THING. EVER. Tons of other clubs too. I also participate in Engineers w/o Borders, Student Red Cross, and the Habitat chapter here in State College., 927415=Blue and White is the big thing for Penn state students and it's a tradition to dress up in Blue & White for Football weekend game in April., 1023944=My experience as a freshman during the 2011-2012 academic school year was amazing, and I couldn't imagine myself attending another school.}",
    "textBeforeTable": "07/17/2009 Reviewer is A current student here. 62 out of 63 people found this review useful. 1 of 414 Eric from Winburne, PA Check out reviews left by other students or leave your own review. You could win a free scholarship. Penn State University Reviews Penn State University › Pennsylvania › By State › Colleges › } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.create', -->",
    "textAfterTable": "Caitlyn from State College, PA 08/11/2009 Reviewer is A current student here. 40 out of 41 people found this review useful. 2 of 414 Categories Comments Great for these types of students Determined, Responsible, Organized, Liberal, Involved, Outgoing, Social, Fun-loving, Intelligent, Party-goers Tips for prospective students Yes, Penn State is well known for its drinking and for its Greek life. But don't let that be the be-all, end-all of your college career. DON'T immediately get lost in the partying scene of Penn State - while its okay to party and have fun, learn how to do it in moderation so that you don't end up screwing up your G.P.A. (and in turn, screwing yourself over) in your first year - you'll still be paying for it two years later and its a lot easier to do than you'd think. DO go to the involvement fairs. In Alumni hall in the HUB running for a week straight at the beginning of the semesters there are booths and booths of clubs and activities across the Penn State community, with different groups every day. If a group even mildly interests you,",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}