{
    "relation": [
        [
            "",
            "World of Warcraft (2005)",
            "Half Life 2 - Lost Coast Benchmark (2005)",
            "Sims 3 (2009)",
            "Anno 1404 (2009)",
            "Metro 2033 (2010)",
            "StarCraft 2 (2010)",
            "Total War: Shogun 2 (2011)",
            "Deus Ex Human Revolution (2011)",
            "Batman: Arkham City (2011)",
            "Anno 2070 (2011)",
            "Diablo III (2012)",
            "Dirt Showdown (2012)",
            "Torchlight 2 (2012)",
            "World of Tanks v8 (2012)"
        ],
        [
            "low",
            "104",
            "",
            "341",
            "281",
            "98",
            "252",
            "224",
            "176",
            "144",
            "159",
            "185",
            "96",
            "132",
            "71"
        ],
        [
            "med.",
            "159",
            "",
            "183",
            "",
            "65",
            "75",
            "54.55",
            "",
            "124",
            "62",
            "133",
            "84",
            "92",
            "36"
        ],
        [
            "high",
            "67",
            "244",
            "130",
            "",
            "33",
            "59",
            "",
            "92",
            "80",
            "39",
            "113",
            "73",
            "",
            "28"
        ],
        [
            "ultra",
            "",
            "",
            "",
            "63",
            "10",
            "32",
            "20.3",
            "34",
            "40",
            "21",
            "72",
            "23",
            "87",
            "11"
        ],
        [
            "",
            "fps",
            "fps",
            "fps",
            "fps",
            "fps",
            "fps",
            "fps",
            "fps",
            "fps",
            "fps",
            "fps",
            "fps",
            "fps",
            "fps"
        ]
    ],
    "pageTitle": "Review Fujitsu Celsius H920 Notebook - NotebookCheck.net Reviews",
    "title": "",
    "url": "http://www.notebookcheck.net/Review-Fujitsu-Celsius-H920-Notebook.84577.0.html?id=20667",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438043062635.98/warc/CC-MAIN-20150728002422-00012-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 621590527,
    "recordOffset": 621520769,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{43973=The present test model offers a very balanced performance configuration in view of Intel's Core i7-3720QM, Nvidia's Quadro K3000M, 16 GB of RAM and a solid state drive alongside a conventional hard disk. None of the components stand out significantly or unduly lag behind in terms of performance. Even the storage capacity problems that SSD models often have is adequately solved by using an additional hard disk. The three currently available models mainly differ from the test model's performance range in terms of the installed processor, the storage devices used and RAM configuration. If you are willing to upgrade a few components yourself, we deem the entry-level model for a bit over 2000 Euros (~$2595) to be the most attractive option at the moment in terms of value for money., 62419=Intel's Centrino Wireless-N 2200 is installed as the Wi-Fi module, which sports two antennas, (theoretically) transmits up to 300 Mbps but only uses the 2.4 GHz band. Bluetooth 4.0 and a webcam are also installed and provide the necessary basic configuration in conjunction with a gigabit network socket. Beyond that, all current configurations feature a mobile Internet connector as mentioned in the introduction. Either a 3G (HSPA) or a 4G (LTE) modem is installed., 73202=Three different configurations of Fujitsu's big workstation are available in the usual online shops as well as in Fujitsu's online shop. Our test model does not comply with any of these configurations and thus the setup we are testing is presently not available. The Celsius H920 featuring Intel's Core i7-3610QM processor, Nvidia's Quadro K3000M graphics, 8 GB of RAM, UMTS and a conventional 500 GB hard disk is sold for around 2100 Euros (~$2675). For approximately 2500 Euros (~$3184), the buyer gets Intel's Core i7-3720QM CPU, 16 GB of RAM and a 640 GB hard disk + a 128 GB SSD as a storage device. The top model sports Intel's Core i7-3820QM processor, an LTE capable broadband modem, Nvidia's Quadro K4000M graphics and a 1000 GB hard disk + 256 GB SSD and costs 3400 Euros (~$4330). Compared with the competition, the prices are quite reasonable and could be one of the most important purchase points., 38064=The quad-core processor installed in the workstation belongs to the fastest CPUs that you will find in laptops and it currently occupies the 6th place (laptop CPUs only) in our extensive CPU benchmark chart. A 6 MB L3 cache, Hyperthreading (maximum 8 threads simultaneously) and clock rates of 2600 to 3600 MHz (single thread) primarily contribute to the excellent performance. Consequently, there is no reason for complaint in the benchmark results. The SuperPi 32M calculation (single-core) is achieved in 576 seconds, the wPrime 1024m calculation (multi-core) is accomplished in 272 seconds and Cinebench R10 64-bit verified 5932 points (single) and 23172 points (multi). A 51.2-fold speed is reached when converting MP3 into AAC format using iTunes music converter. In view of these excellent results, there is no need to fear limitations when dealing with computing-heavy tasks. In terms of value for money, it is only worthwhile to reach for an even speedier high-end CPU when you need the fastest possible results regardless of costs., 36851=We noticed that the CPU was throttled to 1200 MHz on battery power and, as far as we know, it cannot be changed. No temperature-related throttling was noticed in AC mode even after a long stress period via FurMark and Prime95. The PSU also has more than sufficient reserves., 54099=The Full HD screen installed in the test model is the only display available for the Celsius H920. A resolution of 1920x1080 pixels at a screen size of 17.3 inches adds up to a dot density of 127 dpi, which most users will find as a balanced ratio of desktop and content size., 67105=The Celsius H920 sports a docking port at the bottom for quickly connecting external peripherals at the workplace. The correlating port replicator (S26391-F1177-L110; approx. 190 Euros/~$242) has been slightly modified for the Celsius H920/H720 and now provides 4 USB 3.0 ports in contrast to the former model. In addition to the standard interfaces, it also features Dual-Link DVI, VGA, DisplayPort and eSATA.}",
    "TableContextTimeStampAfterTable": "{248880=We ascertained a runtime of just below 6 hours using Battery Eater's Reader's test and over 4 hours in the Wi-Fi test (brightness: 140 cd/m²; energy-saving mode; Intel HD Graphics) and almost 3.5 hours while watching a DVD (maximum brightness; Wi-Fi modules off, energy-saving mode). The runtime in Battery Eater's Classic test using full load (maximum brightness; all on; high-performance profile; Nvidia's graphics) benefits from the CPU's throttling to 1200 MHz and still achieved approximately 1.25 hours., 117189=A good score of 6831 points is achieved in Cinebench R10 Open GL Shading (32 and 64-bit). The score of 8471 points achieved by AMD's FirePro M2000 in HP's EliteBook 8470w is almost sensational; it works very efficiently with considerably less technology in this section. However, the hierarchy is restored in the other standard consumer benchmarks and the Quadro K3000M exhibits its high potential here. Thus, no performance losses need to be feared in this segment despite special professional drivers. 11902 points in 3DMark Vantage and 2725 points in 3DMark 11 are very good scores.}",
    "textBeforeTable": "This work machine is also very suitable for gaming thanks to the strong graphics unit. Depending on the game, maximum settings and resolutions have to be reduced occasionally in order for it to supply smooth frame rates. Reducing either the quality settings or the resolution usually suffices to comfortably get through the rounds. Gaming Performance Intel Core i7-2920XM, NVIDIA GeForce GTX 580M SLI, Samsung SSD 810 Series Alienware M18x (GTX 580M SLI, 2920XM)   Intel Core i7-3610QM, AMD Radeon HD 7970M, Samsung SSD PM830 64 GByte mSATA Alienware M17x R4   Intel Core i5-3360M, AMD FirePro M2000, Hitachi Travelstar 7K500 HTS727550A9E HP EliteBook 8470w B5W63AW-ABD   Intel Core i7-3820QM, NVIDIA Quadro K2000M, Hitachi Travelstar Z7K500 HTS725050A7E630 Lenovo ThinkPad W530-N1K43GE   Intel Core i7-3720QM, NVIDIA Quadro K1000M, Micron RealSSD C400-MTFDDAC256MAM Fujitsu Celsius H720 H7200WXP11DE   Intel Core i7-3720QM, NVIDIA Quadro K3000M, Micron RealSSD C400-MTFDDAC256MAM Fujitsu Celsius H920   Legend",
    "textAfterTable": "Emissions System Noise The noise development ranges from 33.6 dB(A) up to 51.4 dB(A). Due to the rather loud hard disk, the potential that Nvidia's Optimus technology would actually allow cannot be completely exploited. Using Intel's HD graphics would enable a virtually silent operating noise particularly in low load during office use. Although the fan is disabled here, the hard disk's noise of 33.6 dB(A) whirs with a similar characteristic. In medium load, so while gaming or when converting tasks are assigned, the noise increases to 40.2 dB(A) and steps clearly into the foreground. It finally gets unpleasant in the long run during full load. 51.4 dB(A) can quickly get annoying and affect concentration during work. At least we did not notice a sporadic fan management or high-pitched noises that would worsen the noise quality even more. Noise Level Idle 33.6 / 33.6 / 35.6 dB(A)",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}