{
    "relation": [
        [
            "Year",
            "2011",
            "2009",
            "2008",
            "2007"
        ],
        [
            "Videos",
            "3",
            "28",
            "7",
            "3"
        ],
        [
            "News",
            "",
            "",
            "",
            ""
        ],
        [
            "Photos",
            "",
            "1",
            "19",
            ""
        ],
        [
            "Blogs",
            "",
            "",
            "",
            "5"
        ]
    ],
    "pageTitle": "CoachJay - Videos - Myrtl Routine - Jay Johnson - insidenikerunning.nike.com",
    "title": "",
    "url": "http://www.runnerspace.com/profile.php?do=videos&pg=1&member_id=325&video_id=8190&folder_id=235&offset=2",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988840.31/warc/CC-MAIN-20150728002308-00112-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 679094103,
    "recordOffset": 679076507,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{25628=*Note - I love the Myrtl routine for the following reasons: - You can do it anywhere...even in an airport or a hotel lobby - Runners are often tight, inflexible and a-symetric in the hip girdle and this routine is a one simple step towards addressing those issues - It can do pre-run or post-run or on it's own (I often assign it on a travel day, assuming the athlete ran at home, then traveled and had to sit for several hours; they'd do this routine when they arrive at the hotel or a hour before bed). So, you'd not be surprised that I assign Myrtl all year, yet you could argue that it is most important in the months of December and January.  Why?  Indoor track and slippery running conditions.  We'll start with slippery running conditions. Running on a slippery surface - or even a surface like loose gravel on a dirt road or pavement - is a greater proprioceptive challenge and therefore a greater athletic challenge than running on pavement; the stabilizing muscles, specifically the abductors and adductors in your legs/hip girdle area, are working overtime when a runner is training on a slippery surface.  The Myrtl routine addresses these areas, helping you strengthen your abductors and your adductors (i.e. your groin muscles), as well as improving your general range of motion in the hip girdle. Indoor track - especially when you're training and racing 200m flat tracks - simply feels different then running on an outdoor track, which highlights the increased proprioceptive demand of running a curve.  When people think of proprioception they tend to think of just the foot and ankle, yet the body is brilliant at recruiting other muscles to help with a task.  This is where the abductors and adductors come into play and Myrtl is a great way to strengthen those those muscles before you attempt an indoor PR. Feel free to ask questions or to disagree with this in the comments section ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ Jay Johnson}",
    "textBeforeTable": "History for CoachJay Jun 9th 2012, 7:22pm · Reply · Like · 0 I love the quick, hard hitting tips! Just kidding. This is great stuff! Can I just take a pill to get the same results? Jay Hicks Jun 9th 2012, 7:25pm · Reply · Like · 0 The download link for the .pdf ins't working .... HELP !!! simplycorey Jun 9th 2012, 7:26pm · Reply · Like · 0 The PDF link doesn't work. Anyone know where I can get the file to download?",
    "textAfterTable": "Hashtags: #coachjay #insidenikerunning #nike #back    ",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}