{
    "relation": [
        [
            "Categories",
            "Clubs and Activities",
            "Great for these types of students",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "There is always different events and activities posted on their web site.",
            "Returning students",
            "Great prices in the cafeteria and good food always made to order.",
            "no Dorms",
            "Even though a lot of the professors are tough they are always willing to help.",
            "Use all their resources.",
            "Great place to go especially if you are returning to school after a long break. There are so many resources and tools to help a student survive college. Everybody there is so helpful especially the professors."
        ]
    ],
    "pageTitle": "Truckee Meadows Community College Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Truckee-Meadows-Community-College/reviews?_escaped_fragment_=/show/97556",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988840.31/warc/CC-MAIN-20150728002308-00293-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 913536167,
    "recordOffset": 913461009,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{465995=© 2015, Cappex.com, LLC, 138284=I don't know what the young students do for fun here but in the summer time we have the air races here, balloon races, camel races, hot august nights, just to name a few, and concerts on the river every night for free., 45240=it my first semester since high school which i graduated in 2003. i would have to update you on this, but i'm hoping its a challenge since i've been out of school since 2003., 113520=Beautiful campus with a diverse student body. Several web based classes online which is great for adult/non-traditional students. Cost of tuition per semester is very reasonable - four classes $1200., 329372=At only 1000 dollars a semester for a full load of classes plus books, this is the best deal out there. Some of our teachers even teach at the nearby university as well so you are getting the same education at a much lower rate., 366487=When I started college back in 2002, I think it was $150 for a 3 credit class. Now it is only 253.5 for a 3 credit class, which isn't bad compared to UNR., 216838=Read everything and call several times to verify that you have the correct information. On average you need to call three times to receive accurate information. If someone dies in your immediate family and you ask for a week breavement, please be aware that it is up to the teacher to excuse you, my sister died in a car accident in the middle of the 2011 Fall semester. Only one teacher let me make up the week of work I missed due to funeral services and dealing with her death. If you have received bad information, let someone know, write a letter, as often you will find the students working in the financial aid office are not informed and give out the wrong information.}",
    "textBeforeTable": "12/05/2009 Reviewer is A current student here. 5 out of 5 people found this review useful. 1 of 118 Jacob from Sparks, NV Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for",
    "textAfterTable": "Categories Comments Great for these types of students Anyone who has time, motivation, and needs a college that is not extremely expensive. Tips for prospective students Read the description of the class before you register for it. Listen to what other students say about teachers. See if you can figure out what teacher fits you type of learning because sometimes there is more than one teacher, but they teach differently. Register as early as you can to get the classes you want or need. Based on the teachers I have had so far, they are understanding and will try to help you as much as they can. Bang for the buck The pricing is not bad for a community college. I got a lot of knowledge out of it, and it is probably just as good as some other expensive colleges. Am enjoying being here I enjoy being here because I like small colleges. It is not a giant campus, but there is more than one. The only problem I face is being young in a community college can be intimidating. A lot of older people go to community colleges, so there is not a lot of young people around. I am not saying",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}