{
    "relation": [
        [
            "Condition:",
            "Shade:",
            "Material:",
            "Special Features:"
        ],
        [
            "New with box: A brand-new, unused, and unworn item (including handmade items) in the original packaging (such as the original box or bag) and/or with the original tags attached. See all condition definitions- opens in a new window or tab ... Read moreabout the condition",
            "Black",
            "Leather",
            "Composite Toe"
        ],
        [
            "Brand:",
            "Style:",
            "Color:",
            ""
        ],
        [
            "Caterpillar",
            "Work & Safety",
            "Blacks",
            ""
        ]
    ],
    "pageTitle": "",
    "title": "",
    "url": "http://www.ebay.ca/itm/Caterpillar-DAWSON-P90078-Mens-6-Black-Leather-COMPOSITE-TOE-Hiking-Work-Boot-/290666364324",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988840.31/warc/CC-MAIN-20150728002308-00223-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 410618479,
    "recordOffset": 410569956,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Item specifics View all revisions Last updated on  Mar 02, 2012 12:43:53 EST  Seller assumes all responsibility for this listing. 290666364324 eBay item number: Shipping and payments Description current Report item - opens in a new window or tab Covers your purchase price and original shipping. Get the item you ordered or get your money back. Money Back Guarantee  | See details - opens in a new window",
    "textAfterTable": "Caterpillar DAWSON Men's Leather COMPOSITE TOE Boot Retail Price: $110.00 Various Sizes and Widths Available.  See Pull Down Menu. CAT has taken the athletic styling and comfort of a hiking boot and transformed it to be just what you need it to be the workplace.  Dawson has a composite safety toe and electrical hazard protection for safety as well as best-in-class SRX extreme slip resistant outsole. To make things better, CAT designed Dawson using our Ergonomic footwear design process; meaning careful consideration was put into the stability flexibility and comfort features so that they are enhancing the natural movements of the foot for superior comfort. Product Features: Leather/Mesh upper Nylon mesh lining Removable EVA sock liner PU mold midsole PVC outsole Strobel + cement construction EH, Slip Resistant and Composite Toe Model # P90078",
    "hasKeyColumn": true,
    "keyColumnIndex": 1,
    "headerRowIndex": 0
}