{
    "relation": [
        [
            "Jewelry Type:",
            "Metal:",
            "Metal Purity:",
            "Main Stone:",
            "Material:"
        ],
        [
            "PIERCED Earrings",
            "Sterling Silver",
            "925",
            "Black Onyx",
            "BLACK ONYX STERLING SILVER"
        ],
        [
            "Brand:",
            "Country/Region of Manufacture:",
            "ITEM IS:",
            "DESIGNER SIGNED:",
            ""
        ],
        [
            "SIGNED LOS BALLESTEROS",
            "Mexico",
            "TAXCO STERLING SILVER BLACK ONYX PIERCED EARRINGS",
            "YES SEE DESCRIPTION",
            ""
        ]
    ],
    "pageTitle": "",
    "title": "",
    "url": "http://www.ebay.ca/itm/VINTAGE-TAXCO-MEXICO-TALLERES-DE-LOS-BALLESTEROS-STERLING-MODERNIST-EARRINGS-/111319602875?pt=LH_DefaultDomain_0&hash=item19eb2a56bb",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988840.31/warc/CC-MAIN-20150728002308-00004-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 429249751,
    "recordOffset": 429200685,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "“EXCELLENT VINTAGE CONDITION” Seller Notes: Item specifics Seller assumes all responsibility for this listing. Shipping and payments Description current Report item - opens in a new window or tab 111319602875 eBay item number: Covers your purchase price and original shipping. Get the item you ordered or get your money back. Money Back Guarantee  | See details - opens in a new window",
    "textAfterTable": "VINTAGE BEAUTIFUL MEXICO MEXICAN DESIGNER SIGNED TALLERES DE LOS BALLESTEROS TAXCO STERLING SILVER BEZEL SET BLACK ONYX LONG MODERNIST PIERCED EARRING MEASURING A TAD UNDER 1 3/4 INCH LONG BY 1/2 INCH WIDE AND WEIGHING 14.8 GRAMS IN TOTAL .... EARRINGS ARE SIGNED AND STAMPED 925 MM-34 AND LOS BALLESTEROS STAMP...SEE ALL MY PICTURES FOR BEST DESCRIPTION AND DIME FOR SIZE COMPARISON. THEY ARE PERFECT BUT COULD USE A GOOD POLISHING ... I ONLY HAVE 1 ORIGINAL EARRING BACK BUT WILL PUT 1 ON BACK OF OTHER...CHECK MY OTHER LISTINGS FOR MORE DESIGNER SIGNED FINE AND COSTUME JEWELRY ITEMS. THANK YOU AND HAVE A GREAT EVENING.    Questions and answers about this item No questions or answers have been posted about this item. Ask a question - opens in a new window or tab Seller assumes all responsibility for this listing.",
    "hasKeyColumn": true,
    "keyColumnIndex": 1,
    "headerRowIndex": 0
}