{
    "relation": [
        [
            "Decimal Value",
            "0",
            "5",
            "-5",
            "2767",
            "-2767",
            "100000",
            "1234567"
        ],
        [
            "Length Byte",
            "1",
            "2",
            "3",
            "3",
            "4",
            "2",
            "5"
        ],
        [
            "Exponent Byte",
            "128",
            "193",
            "62",
            "194",
            "61",
            "195",
            "196"
        ],
        [
            "Mantissa Bytes",
            "N/A",
            "6",
            "96",
            "28, 68",
            "74, 34",
            "11",
            "2, 24, 46, 68"
        ],
        [
            "Terminator Byte",
            "N/A",
            "N/A",
            "102",
            "N/A",
            "102",
            "N/A",
            "N/A"
        ]
    ],
    "pageTitle": "4 Datatypes",
    "title": "",
    "url": "http://docs.oracle.com/cd/B14117_01/appdev.101/b10778/types.htm",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988840.31/warc/CC-MAIN-20150728002308-00121-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 75688559,
    "recordOffset": 75664441,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{54176=INTERVAL '30' SECOND(2,2) maps to INTERVAL '00 00:00:30.00' DAY TO SECOND(2), 46575=For byte 2, the second and third digits of the year are calculated as the year modulo 100: 1992 % 100 = 92., 54031=INTERVAL '30:30' HOUR TO MINUTE maps to INTERVAL '00 30:30:00.00' DAY TO SECOND(2), 73852=The external datatype RAW is used for binary data or byte strings that are not to be interpreted or processed by Oracle. RAW could be used, for example, for graphics character sequences. The maximum length of a RAW column is 2000 bytes., 46091=For byte 1, the second and third digits of the century are calculated as the year (an integer) divided by 100. With integer division, the fractional portion is discarded. The following calculation is for the year 1992: 1992 / 100 = 19., 53897=INTERVAL '90' MINUTE maps to INTERVAL '00 00:90:00.00' DAY TO SECOND(2), 117756=Length must be less than or equal to 2000 characters., 46377=For byte 1, 119 represents the twentieth century, 1900 to 1999. A value of 120 would represent the twenty-first century, 2000 to 2099., 40673=The external datatype CHAR is a string of characters, with a maximum length of 2000 characters. Character strings are compared by using blank-padded comparison semantics., 46941=The year 2000 would yield 120 for byte 1 and 100 for byte 2.}",
    "lastModified": "Tue, 27 Jul 2004 16:27:00 GMT",
    "textBeforeTable": "Table 4-4 VARNUM Examples The external datatype VARNUM is similar to the external datatype NUMBER, except that the first byte contains the length of the number representation. This length value does not include the length byte itself. Reserve 22 bytes to receive the longest possible VARNUM. You must set the length byte when you send a VARNUM value to the database. VARNUM The external datatype VARCHAR2 is a variable-length string of characters up to 4000 bytes. VARCHAR2 The external datatype VARCHAR store character strings of varying length. The first two bytes contain the length of the character string, and the remaining bytes contain the actual string. The specified length of the string in a bind or a define call must include the two length bytes, meaning the largest VARCHAR string is 65533 bytes long, not 65535. For converting longer strings, use the LONG VARCHAR external datatype. VARCHAR The external datatype UNSIGNED INT is used for unsigned binary integers. The size in bytes is operating system dependent. The host system architecture determines the order of the bytes in a word. If the number being output from Oracle is not an integer, the fractional part is discarded, and no",
    "textAfterTable": "VARRAW The external datatype VARRAW is similar to the external datatype RAW, except that the first two bytes contain the length of the data. The specified length of the string in a bind or a define call must include the two length bytes. So the largest VARRAW string that can be received or sent is 65533 bytes, not 65535. For converting longer strings, use the LONG VARRAW datatype. NATIVE DOUBLE This external datatype implements the IEEE 754 standard double-precision floating point datatype. It is represented in the host system's native floating point format. The datatype is stored in the Oracle Server in a byte comparable canonical format, and requires 8 bytes for storage, including the length byte. It is an alternative to Oracle NUMBER and has the following advantages over NUMBER: Fewer bytes used in storage Matches datatypes used by RDBMS Clients Supports a wider range of values used in scientific calculations. NATIVE FLOAT This external datatype implements the IEEE 754 single-precision floating point datatype. It is represented in the host system's native floating point format. The datatype is stored in the Oracle Server in a byte comparable canonical format, and requires 4 bytes for storage, including the",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}