{
    "relation": [
        [
            "Parameter",
            "Gathering cut-off",
            "Trusted cut-off",
            "Noise cut-off"
        ],
        [
            "Sequence",
            "25.0",
            "25.5",
            "19.7"
        ],
        [
            "Domain",
            "25.0",
            "25.5",
            "24.8"
        ]
    ],
    "pageTitle": "Pfam: Family: EcoRII-N (PF09217)",
    "title": "",
    "url": "http://pfam.xfam.org/family/EcoRII-N",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988840.31/warc/CC-MAIN-20150728002308-00059-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 195947651,
    "recordOffset": 195904459,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{110424=There are four classes of restriction endonucleases: types I, II,III and IV. All types of enzymes recognise specific short DNA sequences and carry out the endonucleolytic cleavage of DNA to give specific double-stranded fragments with terminal 5'-phosphates. They differ in their recognition sequence, subunit composition, cleavage position, and cofactor requirements [PUBMED:15121719, PUBMED:12665693], as summarised below:}",
    "lastModified": "Sat, 01 Aug 2015 09:22:56 GMT",
    "textBeforeTable": "Model details: search method: hmmsearch -Z 80369284 -E 1000 --cpu 4 HMM pfamseq build method: hmmbuild -o /dev/null HMM SEED HMM build commands: HMM information 37.88 % Average coverage of the sequence by the domain: 52 % Average identity of full alignment: 144.50 aa Average length of the domain: 432 Number in full: 7 Number in seed: Sammut SJ Author: Domain Type: none Previous IDs: pdb_1na6 Seed source: Curation This section shows the detailed information about the Pfam family. You can see the definitions of many of the terms in this section in the glossary and a fuller explanation of the scoring system that we use in the scores section of the",
    "textAfterTable": "Model length: 154 Family (HMM) version: 6 Download: download the raw HMM for this family Species distribution Sunburst Tree Sunburst controls Show Weight segments by... number of sequences number of species Change the size of the sunburst Small Large Colour assignments Archea Eukaryota Bacteria Other sequences Viruses Unclassified Viroids",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}