{
    "relation": [
        [
            "Project Details",
            "Editing/proofreading Volume: 14304 words Completed: Jun 2010 Languages: English to Arabic",
            "Translation Volume: 14194 words Completed: May 2010 Languages: Arabic to English",
            "Translation Volume: 15000 words Completed: Sep 2006 Languages: English to Arabic"
        ],
        [
            "Project Summary",
            "Proofreading of 14304words on anti-corruption compliance policy & procedures The project involved editing\\proofreading of 14304 words on anti-corruption policy and procedures for a petroleum drilling company. Business/Commerce (general), Law (general), Petroleum Eng/Sci",
            "Translation of political articles Translation or a large number of articles about politics, history, economics, religion and other fields. The articles are published on Arabic well-known websites. Government / Politics",
            "Translation of news articles The project involved translating news and analytical articles to be published in the Arabic version of a website Journalism, Government / Politics"
        ],
        [
            "Corroboration",
            "No comment.",
            "No comment.",
            "No comment."
        ]
    ],
    "pageTitle": "English <> Arabic Translator, Interpreter and Subtitler",
    "title": "",
    "url": "http://www.proz.com/profile/114212?show_mode=project_history&filter=disc&fil_value=2&cor=true",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988840.31/warc/CC-MAIN-20150728002308-00323-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 667028463,
    "recordOffset": 666999895,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "3 projects entered Project History PRO-level points: 2063, Questions answered: 1144, Questions asked: 144 KudoZ activity (PRO) Less More Certificates, Diplomas, Licenses, CVs Geography Furniture / Household Appliances Food & Drink Finance (general) Engineering (general) Education / Pedagogy Economics",
    "textAfterTable": "More Less Payment methods accepted Skrill, Wire transfer Portfolio Sample translations submitted: 2 English to Arabic: Reform Source text - English The Paradigm Shift Baker (1992) provides the following definitions for paradigm shift: Thomas S. Kuhn (1970): Scientific paradigms are \"accepted examples of actual scientific practice, examples which include law, theory, application, and instrumentation together-- (that) provide models from which spring particular coherent traditions of scientific research.\" Adam Smith (1975): A shared set of assumptions. The paradigm is the way we perceive the world; water to the fish. The paradigm explains the world to us and helps us to predict its behavior.\" Smith concludes that \"when we are in the middle of the paradigm, it is hard to imagine any other paradigm.\" Willis Harmon (1970): \"The basic way of perceiving, thinking, valuing, and doing associated with a particular vision of reality. A dominant paradigm is seldom if ever stated explicitly; it exists as unquestioned, tacit understanding that is transmitted through culture and to succeeding",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}