{
    "relation": [
        [
            "type",
            "FR Doc.",
            "RIN",
            "Public Notice:"
        ],
        [
            "regulations.gov",
            "2014-15147",
            "1400-AD46",
            "8784"
        ]
    ],
    "pageTitle": "22 CFR 121.3 - Aircraft and related articles. | US Law | LII / Legal Information Institute",
    "title": "",
    "url": "https://www.law.cornell.edu/cfr/text/22/121.3",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987174.71/warc/CC-MAIN-20150728002307-00015-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 930469704,
    "recordOffset": 930453310,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{1104=Title 22 published on 2014-04-01.}",
    "TableContextTimeStampAfterTable": "{11897=In an effort to streamline, simplify and clarify the recent revisions to the International Traffic in Arms Regulations (ITAR) made pursuant to the President's Export Control Reform (ECR) initiative, the Department of State is amending the ITAR as part of the Department of State's retrospective plan under Executive Order 13563 completed on August 17, 2011., 29631=Title 22 published on 2014-04-01, 28014=§ 2752 - Coordination with foreign policy, 28117=§ 2778 - Control of arms exports and imports, 28223=§ 2797 - Licensing, 3055=The Department of State is correcting a final rule that appeared in the Federal Register of July 1, 2014 (79 FR 37536) and making other, minor changes., 25517=As part of the President's Export Control Reform (ECR) effort, the Department of State is amending the International Traffic in Arms Regulations (ITAR) to revise Category XV (Spacecraft and Related Articles) of the U.S. Munitions List (USML) to describe more precisely the articles warranting control in that category. The revisions contained in this rule are part of the Department of State's retrospective plan under Executive Order 13563 completed on August 17, 2011. This rule is published as an interim final rule because the Department believes that substantial national security benefits will flow from the changes to the controls on spacecraft and related items, but acknowledges that additional analysis of and public comment on the control thresholds for remote sensing satellites are warranted., 28566=112 Stat. 1920, 7266=On May 24, 2013, the Department of State published a rule (78 FR 31444) proposing to amend the International Traffic in Arms Regulations (ITAR) by revising Category XV of the U.S Munitions List (USML) as part of the President's Export Control Reform (ECR) effort. After review of comments to the proposed rule, on May 13, 2014, the Department published an interim final rule that allowed a final comment period until June 27, 2014. The Department is now making final the interim final rule and correcting the interim final rule that appeared in the Federal Register of May 13, 2014., 21006=The Department of State is correcting a final rule that appeared in the Federal Register of January 2, 2014 (79 FR 34). The final rule amended the International Traffic in Arms Regulations (ITAR) as part of the President's Export Control Reform (ECR) effort.}",
    "lastModified": "Mon, 01 Jun 2015 07:09:52 GMT",
    "textBeforeTable": "Additional Documents GPO FDSys XML | Text 79 FR 77884 - Amendment to the International Traffic in Arms Regulations: United States Munitions List Category XI (Military Electronics), Correction, and Other Changes 2014-12-29; vol. 79 # 248 - Monday, December 29, 2014 For a complete list of all Rules, Proposed Rules, and Notices view the Rulemaking tab. The following are only the Rules published in the Federal Register after the published date of Title 22. Title 22 published on 2014-04-01. All observation aircraft bearing “O” designations and using reciprocating engines. (e) All liaison aircraft bearing an “L” designation. (d) Utility aircraft bearing “U” designations and using reciprocating engines only. (c) Trainer aircraft bearing “T” designations and using reciprocating engines or turboprop engines with less than 600 horsepower (s.h.p.) (b) Cargo aircraft bearing “C”",
    "textAfterTable": "DEPARTMENT OF STATE Final rule; correction and correcting amendments. This rule is effective on December 30, 2014. 22 CFR Parts 121 and 126 Summary The Department of State is correcting a final rule that appeared in the Federal Register of July 1, 2014 (79 FR 37536) and making other, minor changes. 2014-11-10; vol. 79 # 217 - Monday, November 10, 2014 79 FR 66608 - Amendment to the International Traffic in Arms Regulations: Revision of U.S. Munitions List Category XV; Correction GPO FDSys XML | Text Additional Documents type regulations.gov FR Doc. 2014-26631 RIN 1400-AD33 Public Notice: 8942 DEPARTMENT OF STATE, 22 CFR Parts 121, 123, 125, and 126",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}