{
    "relation": [
        [
            "Categories",
            "Bang for the buck",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "I think that the prices are very affordable, and the opportunity for grants and loans helps me get through. I know that I will be increasing my hourly wage so I will see a payback in a very short amount of time.",
            "This experience is not applicable to me as I stayed off campus and am primarily an online student.",
            "This experience is not applicable to me as I stayed off campus and am primarily an online student.",
            "This experience is not applicable to me as I stayed off campus and am primarily an online student.",
            "Obviously, every course and every teacher has different expectations, I think that the level of comprehension required of us as students seems very appropriate. They ask for growth, but it is realistic.",
            "One of the biggest things I have realized is that it is ok to ask for help. Every person I have met here so far has had my best interests at heart, sincerely. While I know I need to do my part to study and take the courses seriously, I feel comfortable knowing that if I truly need help, I will get it.",
            "Moorhead State provides a wonderful opportunity for the online student. I work full time, and must earn my degree online. The teachers, academic advisors, financial aid advisors, and tech support people have been accomodating, helpful, and supportive throughout my entire experience thus far."
        ]
    ],
    "pageTitle": "Minnesota State University-Moorhead Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Minnesota-State-University-Moorhead/reviews",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987174.71/warc/CC-MAIN-20150728002307-00266-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 904284123,
    "recordOffset": 904232281,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{217296=© 2015, Cappex.com, LLC, 34394=Everyone I know that took part on the Greek Life at MSUM said they are a great way to have fun and to make lots of friends. There are at least three sororities and they just established a fraternity in 2012.}",
    "textBeforeTable": "08/24/2009 Reviewer is A current student here. 15 out of 15 people found this review useful. 1 of 52 LeAnn from Mounds View, MN Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6,",
    "textAfterTable": "Categories Comments Great for these types of students Laid back personalities, politically liberal mindset, these majors: art, theatre, film studies, mass communications, political science, biosciences, accounting/finance, business Tips for prospective students Live on campus the first year! It's not required, but freshman who live off campus never feel a connection to campus and make fewer friends. Also, get involved! There are so many clubs and organizations on campus, that something will interest you. Clubs are a great way to meet people, and if you graduate with nothing on your resume besides a degree, you might not get hired. Bang for the buck MSUM is one of the least expensive schools in the country, but it's still a quality education. Even if a student put their entire tuition on student loans, they'd still graduate with significantly less debt than students who go to private schools or more expensive state schools. Am enjoying being here The atmosphere on campus is great. The school is big enough to offer many options for classes and majors, but small enough that you will always recognize people in your classes. The students are very friendly and laid back, and are continually holding doors for each other. Minnesota Nice is definitely",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}