{
    "relation": [
        [
            "Date",
            "Dec 18, 2001",
            "May 28, 2002",
            "Jul 23, 2002",
            "Aug 12, 2003",
            "Aug 12, 2003",
            "Dec 1, 2003",
            "Nov 1, 2005",
            "Nov 12, 2009"
        ],
        [
            "Code",
            "REMI",
            "REIN",
            "FP",
            "FPAY",
            "SULP",
            "PRDP",
            "FPAY",
            "FPAY"
        ],
        [
            "Event",
            "Maintenance fee reminder mailed",
            "Reinstatement after maintenance fee payment confirmed",
            "Expired due to failure to pay maintenance fee",
            "Fee payment",
            "Surcharge for late payment",
            "Patent reinstated due to the acceptance of a late maintenance fee",
            "Fee payment",
            "Fee payment"
        ],
        [
            "Description",
            "",
            "",
            "Effective date: 20020526",
            "Year of fee payment: 4",
            "",
            "Effective date: 20031203",
            "Year of fee payment: 8",
            "Year of fee payment: 12"
        ]
    ],
    "pageTitle": "Patent US5756099 - Natural organic tanning sunscreen compositions and methods of treatment, to ... - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US5756099?dq=inventor:%22Arthur+R.+Hair%22&ei=VAy0Tsa4NYTl0QGQiqWiBA",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 8,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989042.37/warc/CC-MAIN-20150728002309-00283-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 481126041,
    "recordOffset": 481110123,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{15914=Most sunscreens present the user with several problems, for example, they must be on the surface of the skin at the time of sunlight exposure to be effective. One must anticipate being in the sun when using sunscreens. `Cases of skin cancer caused by sun exposure are increasing`Guy Murdoch, il v. 77 \"Consumers Research Magazine,\" July 94 p.10 (5). Other studies show that use of sunscreens in prolonged sunbathing may promote the development of skin cancer by inhibiting the body's natural immunity to abnormal skin growths' Jeffrey S. Dover and Kenneth A. Arndt, v. 271 JAMA, \"Dermatology,\"Jun. 1, 1994, p.1662 (2) 74F3905., 14579=Sunbathing for hours in the sunlight to acquire an \"appealing\" tan often results in long term hazards which are potentially dangerous to the human skin. The most common agents for sun protection are sunscreens. The increase in skin cancer over the years have caused the general public to rely heavy in the sunscreen products market. The sunscreen market has grown largely in recent years and new products are introduced annually. Sunscreen agents are commercially available to protect the skin from UVA radiation. In 1978 in writing its Sunscreen Monograph, the FDA established a list of Category I sunscreen products that were grand fathered as `generally recognized as safe and effective.` Some include titanium dioxide and zinc oxide, in addition, to a few others. These agents scatter or reflect ultraviolet radiation. However, sunscreen compositions containing these agents are opaque, generally, unattractive in color, and are viewed as unacceptable for usage on more than just the nose or tops of the ears. Furthermore, these agents are very susceptible to rub-off resulting in little or no protection. The most common agents for sun protection are sunscreens. These agents exert their effects through chemical means, i.e., they absorb ultraviolet radiation, so that it cannot penetrate the dermis.}",
    "textBeforeTable": "Patent Citations ______________________________________Nutritional Value of the Papaya:Protein 1.86 gmCarbohydrate 30 gmVitamins:A 6122 IU (Beta Carotene)B1 .082 mg (Thiamine)B2 .097 mg (Riboflavin)B6 .058 mg (Pyridoxine)C 187 mg (ascorbic acid)Niacin 1.02 mgMinerals:Calcium 72 mgCopper 049 mgIron 3 mgMagnesium 31 mgManganese 033 mgPhosphorus 16 mgPotassium 780 mgSodium 8 mgZinc .22 mgLipidsTotal lipid (fat .43 gmTotal saturated .131 gmTotal unsaturated .21 gmAmino acids:Tryptophan .024 gmThreonine .033 gmLeucine 049 gmLysine 076 gmMethionine .006 gmPhenylalanine .027 gmTyrosine .015 gmValine .03 gmArginine .03 gmHistidine .015 gmAlanine 043 gmAspartic acid .149 gmGlutamic acid .1 gmGlycine .055 gmNutritional Value of the Coconut:Vitamins:B1 .04B2 .02B6 .035Niacin .4 mgPantothenic acid .16 mgFolic acid .031 mcgC .2 mgE .8 IUMinerals:Calcium 10 mgCopper .368 mgIron 1.4 mgMagnesium 37 mgManganese 1.05 mgPhosphorus 76 mgPotassium 205 mgSodium 18 mgZinc .88 mgLipids:Total lipids (fat) 28.2 mgTotal saturated 24.3 gmTotal unsaturated 2Amino Acids:Tryptophan 031 gmThreonine 097 gmIsoleucine 105 gmLeucine 198 gmLysine .118 gmMethionine .05 gmCystine .053 gmPhenylalanine .135 gmTyrosine .082 gmValine 162 gmArginine 437 gmHistidine 062 gmAlanine .136 gmAspartic acid .26 gmGlutamic acid .609 gmGlycine .126 gmProline .11 gmSerine .138 gm______________________________________ Once the two tropical plants are mixed, a peach color is developed and mixture can be placed in the refrigerater until it forms a solid base. Refrigeration is not required after said process. The mixed substance remains visible until it is externally applied to the skin organ, whereby it instantly liquefies into an emollient moisture which penetrates the surface of",
    "textAfterTable": "Mmi Corporation Natural sunscreen compositions and processes for producing the same US20040115146 * Dec 17, 2002 Jun 17, 2004 Avon Products, Inc. Use of active extracts to lighten skin, lips, hair and/or nails * Cited by examiner Classifications U.S. Classification 424/727, 424/59 International Classification A61Q17/04, A61K8/97 Cooperative Classification A61Q17/04, A61K8/97 European Classification A61Q17/04, A61K8/97 Legal Events Date Code Event Description Dec 18, 2001 REMI Maintenance fee reminder mailed May 28, 2002 REIN Reinstatement after maintenance fee payment confirmed Jul 23, 2002 FP Expired due to failure to pay maintenance fee Effective date: 20020526",
    "hasKeyColumn": true,
    "keyColumnIndex": 1,
    "headerRowIndex": 0
}