{
    "relation": [
        [
            "Cited Patent",
            "US990269 *",
            "US1634028 *",
            "US2551710 *",
            "US2807659 *",
            "US3169654 *",
            "US3283894 *",
            "US3338390 *",
            "US3527405 *",
            "US3819081 *",
            "US3918920 *",
            "US4517851 *",
            "US4671410 *",
            "US4732850 *",
            "US4746017 *",
            "US4761379 *",
            "SU603611A1 *"
        ],
        [
            "Filing date",
            "29 Mar 1910",
            "16 Jan 1925",
            "4 May 1945",
            "30 Mar 1953",
            "24 Jun 1963",
            "9 Feb 1965",
            "12 May 1966",
            "19 Feb 1968",
            "9 Mar 1972",
            "7 Jan 1974",
            "20 May 1983",
            "26 Dec 1985",
            "5 Jul 1985",
            "18 Aug 1987",
            "9 Aug 1984",
            ""
        ],
        [
            "Publication date",
            "25 Apr 1911",
            "28 Jun 1927",
            "8 May 1951",
            "24 Sep 1957",
            "16 Feb 1965",
            "8 Nov 1966",
            "29 Aug 1967",
            "8 Sep 1970",
            "25 Jun 1974",
            "11 Nov 1975",
            "21 May 1985",
            "9 Jun 1987",
            "22 Mar 1988",
            "24 May 1988",
            "2 Aug 1988",
            ""
        ],
        [
            "Applicant",
            "Taylor Instrument Co",
            "Taylor Instrument Co",
            "Extruded Plastics Inc",
            "Internat Electric Res Corp",
            "Ver Aluminiumfabriken Ristau",
            "Tiros Plastics Corp",
            "Stelray Products Inc",
            "Big D Chem Co",
            "Harre & Co A",
            "Beckman Instruments Inc",
            "Becton Dickinson And Company",
            "Nobelpharma Aktiebolag",
            "E. R. Squibb & Sons, Inc.",
            "Bristol-Myers Company",
            "Becton, Dickinson And Company",
            ""
        ],
        [
            "Title",
            "Thermometer receptacle or case.",
            "Receptacle or case for thermometers",
            "Light diffusing thermoplastic tube to encircle an elongated lighting element",
            "Tube clamp and shield",
            "Receptacle closure comprising a resilient spacer",
            "Packaging container",
            "Thermometer case",
            "Package for vapor dispensing device",
            "Mailer for biological samples",
            "Holder for sample containers of different sizes",
            "System for controlling septum damage",
            "Package for sterile and contamination-free storage of artificial implants",
            "Frangible container with rupturing device",
            "Safety container for glass vials",
            "Biological specimen collection device",
            "Title not available"
        ]
    ],
    "pageTitle": "Patent US5316146 - Vial transporter - Google Patents",
    "title": "",
    "url": "http://www.google.com.au/patents/US5316146",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 5,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989042.37/warc/CC-MAIN-20150728002309-00221-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 479053351,
    "recordOffset": 479027499,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Patent Citations While particular embodiments have been described, it is to be understood that these embodiments are not to be construed as limiting the scope of the present invention, as other modifications are possible. The scope of the present invention is therefore to be construed in accordance with the appended claims. In use, a vial containing body fluid to be transported is inserted into the base of the vial transporter. The cap is then placed over the transporter body, urged downwardly and rotated, forming a liquid-tight seal between the cap and base of the transporter by virtue of the bayonet joint and the tapered wall sections of the cap and base. With the cap locked on to the body, the spring restrains axially upward movement of the vial and also prevents dislodging of the plug closure from the vial. At the same time, the spring urges and maintains the vial in a seated position within the vanes in the base, thus providing yieldable axial and radial positioning. When the vial is subjected to an external force or subjected to sharp impacts, for example if the transporter or package containing the transporter is dropped, or if other articles are suddenly dropped on top of the transporter, the impacts are absorbed by the transporter walls and by resilient supports in all possible directions of vial movement. The transport container of the present invention is particularly useful for transporting vials, such",
    "textAfterTable": "* Cited by examiner Referenced by Citing Patent Filing date Publication date Applicant Title US5503628 * 15 Mar 1995 2 Apr 1996 Jettek, Inc. Patient-fillable hypodermic jet injector US5590782 * 17 Apr 1995 7 Jan 1997 Habley Medical Technology Corporation Vial holder assembly US5725099 * 1 Mar 1996 10 Mar 1998 Studor Trading Ltd. Vacuum breaker vent valve packaging and installation system US6270473 15 Mar 1996 7 Aug 2001 Jettek, Inc. Hypodermic jet injector and disposable ampule US6398051 19 Jul 2000 4 Jun 2002 Owens-Illinois Closure Inc. Tablet package including a tablet hold-down device US6598474 21 Oct 2002 29 Jul 2003 Bayer Corporation Adapter for holding a sample container to facilitate sensing of liquid level in the sample container US6619494 11 Mar 2002 16",
    "hasKeyColumn": true,
    "keyColumnIndex": 4,
    "headerRowIndex": 0
}