{
    "relation": [
        [
            "Date",
            "Feb 11, 1997",
            "Apr 21, 2000",
            "Apr 22, 2004",
            "Jan 26, 2007",
            "Jun 20, 2007",
            "Apr 28, 2008",
            "Oct 22, 2008",
            "Dec 9, 2008"
        ],
        [
            "Code",
            "CC",
            "FPAY",
            "FPAY",
            "AS",
            "AS",
            "REMI",
            "LAPS",
            "FP"
        ],
        [
            "Event",
            "Certificate of correction",
            "Fee payment",
            "Fee payment",
            "Assignment",
            "Assignment",
            "Maintenance fee reminder mailed",
            "Lapse for failure to pay maintenance fees",
            "Expired due to failure to pay maintenance fee"
        ],
        [
            "Description",
            "",
            "Year of fee payment: 4",
            "Year of fee payment: 8",
            "Owner name: RELIANCE ELECTRIC TECHNOLOGIES, LLC, OHIO Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNOR:RELIIANCE ELECTRIC INDUSTRIAL COMPANY;REEL/FRAME:018806/0130 Effective date: 20000324",
            "Owner name: BNP PARIBAS, NEW YORK Free format text: SECURITY AGREEMENT;ASSIGNOR:RELIANCE ELECTRIC COMPANY (FORMERLY RELIANCE ELECTRIC INDUSTRIAL COMPANY);REEL/FRAME:019448/0602 Effective date: 20070131",
            "",
            "",
            "Effective date: 20081022"
        ]
    ],
    "pageTitle": "Patent US5567306 - Lubricant filtering system - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US5567306?ie=ISO-8859-1",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 8,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989042.37/warc/CC-MAIN-20150728002309-00217-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 488502907,
    "recordOffset": 488487107,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{18059=This is a continuation of application Ser. No. 08/052,064 filed Apr. 22, 1993, which was abandoned upon the filing hereof.}",
    "textBeforeTable": "Patent Citations These and other modifications and variations to the present invention may be practiced by those of ordinary skill in the art, without departing from the spirit and scope of the present invention, which is more particularly set forth in the appended claims. In addition, it should be understood that aspects of the various embodiments may be interchanged both in whole or in part. Furthermore, those of ordinary skill in the art will appreciate that the foregoing description is by way of example only, and is not intended to be limitative of the invention so further described in such appended claims. It should be appreciated by those skilled in the art that the bores in the housing and adapter plate can be created in any known manner. Further, although oil is referred to as illustration, other lubricants could also be utilized. In addition, although the invention has particular applicability to gear reducers, its principles could be embodied in other devices with shafts without departing from the scope of the present invention. FIG. 4 illustrates another embodiment of the present invention. In the embodiment of FIG. 4, external lubricant feeding hose 60 is replaced with a return bore 190 in housing wall to allow communication between sump 105 and filter 55. Bore 195 is located in an inner surface of adapter plate 130 so that it is aligned with sump bore 190. Transverse bore 95 operatively connects an",
    "textAfterTable": "US7717082 Oct 26, 2007 May 18, 2010 Mullin William B Prime mover with integral oil reservoir US8911620 * Nov 11, 2011 Dec 16, 2014 Vesa S. Silegren Universal spin-on oil filter adapter US8992089 * Mar 14, 2013 Mar 31, 2015 IMS Solutions Layshaft end bearing retrofit with external positive oil pressure delivery US20120132395 * May 31, 2012 Vesa Samuel Silegren Universal spin-on oil filter adapter US20120312120 * Nov 23, 2009 Dec 13, 2012 Gkn Driveline International Gmbh Venting assembly US20130174575 * Jan 11, 2012 Jul 11, 2013 Honeywell International Inc. Gas turbine engine starter-generator with integrated lube oil scavenge functionality US20140037235 * Mar 14, 2013 Feb 6, 2014 Ims Solution Layshaft end bearing retrofit with external positive oil pressure delivery EP2848111A1 * Aug",
    "hasKeyColumn": true,
    "keyColumnIndex": 2,
    "headerRowIndex": 0
}