{
    "relation": [
        [
            "Date",
            "Sep 3, 1996",
            "Apr 2, 2001",
            "Apr 27, 2005",
            "Oct 7, 2005",
            "Dec 6, 2005"
        ],
        [
            "Code",
            "AS",
            "FPAY",
            "REMI",
            "LAPS",
            "FP"
        ],
        [
            "Event",
            "Assignment",
            "Fee payment",
            "Maintenance fee reminder mailed",
            "Lapse for failure to pay maintenance fees",
            "Expired due to failure to pay maintenance fee"
        ],
        [
            "Description",
            "Owner name: PICKER INTERNATIONAL, INC., OHIO Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNOR:YOUNG, IAN ROBERT;REEL/FRAME:008121/0529 Effective date: 19960808",
            "Year of fee payment: 4",
            "",
            "",
            "Effective date: 20051007"
        ]
    ],
    "pageTitle": "Patent US5675256 - Magnetic resonance methods and apparatus - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US5675256?dq=7222078",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 8,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988399.65/warc/CC-MAIN-20150728002308-00281-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 485672156,
    "recordOffset": 485656195,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Patent Citations Similarly, to prevent z-direction remanent magnetisation resulting from the phase encoding gradient Gz the phase encoding gradient is followed by a short gradient -Gz of opposite polarity to, but the same magnitude as, the phase encoding gradient Gz. Alternatively, if the hysteresis effect is not very large, a short gradient -G'z of the opposite polarity to, but the same magnitude as, the gradient Gz may be applied before excitation, but this requires a reduction in the duration of the gradient Gz, as illustrated by dotted lines in FIG. 2. However care must be taken in this case not to distort slice selection. The gradients -G1y and G2y are required to exhibit different magnitudes and consequently can result in remnant y-direction magnetisation. To prevent this in accordance with the invention, a short initial portion 25 of the gradient G2y has the same magnitude as the -G1y gradient. After excitation but before detection, e.g. during application of gradient -Gx, a phase encoding gradient Gz is applied, and during detection, i.e. data acquisition, a frequency encoding gradient G2y is applied, as shown in FIG. 2, the detected signal comprising a gradient recalled echo signal. To obtain a full set of data for an image, the excitation and detection sequence is repeated a number of times with a different value of the phase encoding gradient Gz each time. In order to ensure, in known manner, that the detected echo signal",
    "textAfterTable": "EP0379802A2 * Dec 20, 1989 Aug 1, 1990 Picker International Limited Magnetic resonance methods EP0541872A1 * Nov 15, 1991 May 19, 1993 Sumitomo Special Metals Co., Ltd. Magnetic field generating apparatus for MRI GB2264175A * Title not available JPH02109542A * Title not available JPH02152440A * Title not available JPH04129531A * Title not available JPH06245917A * Title not available WO1991014948A1 * Mar 25, 1991 Oct 3, 1991 Fonar Corp Eddy current control in magnetic resonance imaging * Cited by examiner Referenced by",
    "hasKeyColumn": true,
    "keyColumnIndex": 2,
    "headerRowIndex": 0
}