{
    "relation": [
        [
            "Date",
            "Jun 3, 1996",
            "Sep 29, 2003",
            "Sep 17, 2007",
            "Sep 14, 2011",
            "Dec 9, 2014"
        ],
        [
            "Code",
            "AS",
            "FPAY",
            "FPAY",
            "FPAY",
            "AS"
        ],
        [
            "Event",
            "Assignment",
            "Fee payment",
            "Fee payment",
            "Fee payment",
            "Assignment"
        ],
        [
            "Description",
            "Owner name: MICROSOFT CORPORATION, WASHINGTON Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNORS:COMER, ROSS;WILLIAMS, DAVID RUSSELL, JR.;REEL/FRAME:008025/0693 Effective date: 19960528",
            "Year of fee payment: 4",
            "Year of fee payment: 8",
            "Year of fee payment: 12",
            "Owner name: MICROSOFT TECHNOLOGY LICENSING, LLC, WASHINGTON Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNOR:MICROSOFT CORPORATION;REEL/FRAME:034541/0001 Effective date: 20141014"
        ]
    ],
    "pageTitle": "Patent US6055548 - Computerized spreadsheet with auto-calculator - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US6055548?ie=ISO-8859-1&dq=U.S.+Patent+",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 8,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988399.65/warc/CC-MAIN-20150728002308-00032-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 481075179,
    "recordOffset": 481047510,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Patent Citations In compliance with the statute, the invention has been described in language more or less specific as to structure and method features. It is to be understood, however, that the invention is not limited to the specific features described, since the means herein disclosed comprise exemplary forms of putting the invention into effect. The invention is, therefore, claimed in any of its forms or modifications within the proper scope of the appended claims appropriately interpreted in accordance with the doctrine of equivalents and other applicable judicial doctrines. The preferred implementation of this invention has been described in the context of a computerized spreadsheet. It is noted that aspects of this invention can be used in other computerized applications that have spreadsheet functionality which allows selection of numbers and performs computations. For instance, some database programs and word processing programs permit construction of tables or other grid-like structures which contain numbers, and provide at least some rudimentary computations such as sum, min, and max. An auto-calculator module described above can be incorporated into such programs to perform automatic computations as the author moves about such tables or structures. In addition to these functions, the auto-calculator module can be configured to use a user-defined function (UDF). A UDF can be a formula that the author writes, a program written in a built-in macro language (e.g., Excel supports XLM and VBA as internal macro languages), or through a separate",
    "textAfterTable": "May 30, 2000 Jan 22, 2002 Outlooksoft Corporation Spreadsheet-based network information exchange with two-part cache US6430584 * Mar 14, 2000 Aug 6, 2002 Microsoft Corporation Computerized spreadsheet with auto-calculator US6640234 * Dec 31, 1998 Oct 28, 2003 Microsoft Corporation Extension of formulas and formatting in an electronic spreadsheet US6721722 * Nov 24, 1999 Apr 13, 2004 Unisys Corporation Cool ice data wizard calculation service US6742162 * Mar 28, 2001 May 25, 2004 Paul W. Bennett System and method for calculation using formulas in number fields US6754677 May 30, 2000 Jun 22, 2004 Outlooksoft Corporation Method and system for facilitating information exchange US6892193 * May 10, 2001 May 10, 2005 International Business Machines Corporation Method and apparatus for inducing classifiers for multimedia based on unified representation of features reflecting disparate modalities US6993535 Jun 18, 2001 Jan",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}