{
    "relation": [
        [
            "Date",
            "Dec 3, 2001",
            "Aug 3, 2004",
            "Apr 27, 2007",
            "Apr 27, 2011",
            "May 20, 2015"
        ],
        [
            "Code",
            "AS",
            "CC",
            "FPAY",
            "FPAY",
            "FPAY"
        ],
        [
            "Event",
            "Assignment",
            "Certificate of correction",
            "Fee payment",
            "Fee payment",
            "Fee payment"
        ],
        [
            "Description",
            "",
            "",
            "Year of fee payment: 4",
            "Year of fee payment: 8",
            "Year of fee payment: 12"
        ]
    ],
    "pageTitle": "Patent US6654567 - Process cartridge detachable from electrophotographic image forming ... - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US6654567?dq=6,606,102",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 9,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989042.37/warc/CC-MAIN-20150728002309-00107-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 470702463,
    "recordOffset": 470667566,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Patent Citations While the invention has been described with reference to the structures disclosed herein, it is not confined to the details set forth and this application is intended to cover such modifications or changes as may come within the purpose of the improvements or the scope of the following claims. Moreover, according to the present invention, there is provided an electrophotographic image forming apparatus to which a process cartridge capable of wireless communication. Furthermore, according to the present invention, there is provided an electrophotographic image forming apparatus to which a unit capable of wireless communication is detachably mountable. Additionally, according to the present invention, a process cartridge capable of wireless communication is provided. An addition, according to the present invention, a unit capable of wireless communication is provided. As described in the foregoing, according to the present invention, the gap between the memory antenna and the main assembly antenna can be maintained correctly. In the foregoing embodiments, a laser beam printer has been taken as examples of the electrophotographic image forming apparatus, but the present invention is not limited thereto, and the present invention is applicable to an electrophotographic copying machine, a facsimile machine, a facsimile machine or the like of an electrophotographic type. The process cartridge may integrally contain an electrophotographic photosensitive drum, and charging means, developing means or cleaning means, in the form of a unit or a cartridge, which is detachably mountable to a",
    "textAfterTable": "US20020025185 Aug 23, 2001 Feb 28, 2002 Yoshihiro Ito Electrophotographic image formation system, electrophotographic image forming apparatus and process cartridge JPH11348375A * Title not available * Cited by examiner Non-Patent Citations Reference 1 U.S. patent application Ser. No. 09/613,280, filed Jul. 10, 2000, allowed. 2 U.S. patent application Ser. No. 09/633,256, filed Aug. 4, 2000, pending. 3 U.S. patent application Ser. No. 09/935,176, filed Aug. 23, 2001, pending this application. 4 U.S. patent application Ser. No. 09/935,242, filed Aug. 23, 2001, pending. 5 U.S. patent application Ser. No. 09/935,246, filed Aug. 23, 2001, pending. Referenced by Citing Patent Filing date Publication date Applicant Title US6832056 * Jan",
    "hasKeyColumn": true,
    "keyColumnIndex": 2,
    "headerRowIndex": 0
}