{
    "relation": [
        [
            "Date",
            "Oct 19, 1992",
            "Nov 10, 1997",
            "Oct 7, 2001",
            "Dec 3, 2001",
            "Jun 7, 2002",
            "Nov 10, 2005"
        ],
        [
            "Code",
            "AS",
            "FPAY",
            "FPAY",
            "AS",
            "AS",
            "FPAY"
        ],
        [
            "Event",
            "Assignment",
            "Fee payment",
            "Fee payment",
            "Assignment",
            "Assignment",
            "Fee payment"
        ],
        [
            "Description",
            "Owner name: SULZER ESCHER WYSS AG, SWITZERLAND Free format text: ASSIGNMENT OF ASSIGNORS INTEREST.;ASSIGNOR:LORENZEN, HEINRICH;REEL/FRAME:006303/0784 Effective date: 19921009",
            "Year of fee payment: 4",
            "Year of fee payment: 8",
            "",
            "",
            "Year of fee payment: 12"
        ]
    ],
    "pageTitle": "Patent US5312225 - Axially thrust-compensated turbo machine - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US5312225?dq=7751826",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 8,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987174.71/warc/CC-MAIN-20150728002307-00266-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 486675419,
    "recordOffset": 486659911,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{19577=Attempts have therefore already been made to absorb the axial thrust, or at least reduce it, by means of special arrangements. Swiss Patent No. 449,659, dated Apr. 11, 1968, describes one such arrangement, in which the axial thrust is intercepted by a co-rotating pressure comb on a secondary shaft driven with gear-wheel transmission. This requires a complicated construction requiring a significant amount of space, however., 24991=In the turbo compressor reproduced in the drawing, a rotor 2 is disposed in a housing 1 and has a shaft 3, which is supported in the housing 1 on both the suction side S and the pressure side P in a low-loss manner with radial magnet bearings 5 and an axial magnet bearing 4. The shaft 3 has six impeller wheels 6 in axial succession, with impeller blades 7 that transport the pumped medium, such as the gas to be compressed, radially outwardly, where it is rerouted to the next stage through diffusers 8 in the housing. On the suction side S, the shaft 3 is sealed off from the interior of the bearing chamber of the housing 1 by means of a dry gas seal 9. Analogously, the shaft 3 is likewise sealed off from the other bearing chamber of the housing 1 on the pressure side P of the turbo machine by dry gas seals 10. Because of the high pressure on the pressure side P, it is recommended that a multiple seal, such as a triple dry gas seal, be used on the pressure side. For the construction of such seals, German Published Patent Application No. 3,925,403, published on Jan. 24, 1991, for instance, the disclosure of which is hereby expressly incorporated by reference in its entirety, and other publications may be referred to. As a rule, these seals operate between the internal pressure p1 in the housing on the pressure side, or the suction-side pressure p2, and the pressure p0 in the bearing chamber, which via a bore 13 communicates with a lower defined pressure, and they have a stationary slide ring which is pressed by seal gas against a co-rotating sealing ring, forming a gap for contactless sealing with minimum leakage., 18721=Turbo machines of the aforementioned type are known from numerous publications, such as Swiss Patent No. 663,447, dated Dec. 15, 1987, the disclosure of which is hereby expressly incorporated by reference in its entirety, and may for instance be embodied as turbo compressors of an axial, radial or combined type, or as turbo machines of some other kind, in which a pressure difference arises between the suction side and the pressure side of the rotor., 29225=This application is based upon Swiss Application No. 02 595/91-4, which was filed on Sep. 4, 1991, the priority of which is claimed., 20306=In modern turbo machines, which use especially low-loss bearings such as magnet bearings, these provisions are often inadequate, since axial thrusts can then be absorbed only to a very limited extent, because of the low thrust capacities. From U.S. Pat. No. 5,028,204, issued on Jul. 2, 1991, and European Published Patent Application No. 373,817, a turbo machine with a magnet-supported rotor is known in which seal gas is carried to the suction-side labyrinth seal, via a pipe that is flush with the shaft and is attached to the housing, and at the same time is carried to the end face of the shaft, at reduced pressure, via a dry gas seal. By throttling the outflow of seal gas, the force of the thrust on the end face can be adjusted and the axial thrust can be compensated for. Supporting the shaft on the suction side is impossible here, so that the turbo machine is embodied in an overhanging fashion. In heavy weight machines with a number of stages and a correspondingly long length, this feature is unusable, because of the lack of rotor stability. Furthermore, the labyrinth seal used does not allow a major pressure difference, or else causes undesired leakage losses.}",
    "textBeforeTable": "Patent Citations Finally, although the invention has been described with reference of particular means, materials and embodiments, it is to be understood that the invention is not limited to the particulars disclosed and extends to all equivalents within the scope of the claims. This application is based upon Swiss Application No. 02 595/91-4, which was filed on Sep. 4, 1991, the priority of which is claimed. It is especially advantageous to provide a gap measuring instrument 14, for instance on the axial magnet bearing 4 or on some other bearing, which via appropriate control, such as a closed-loop control circuit 15, regulates the impingement pressure p3 on the end face 12 of the shaft 3 in such a way that the gap width of the magnet bearing remains within the specified tolerances. In this way, the advantages of low-loss shaft bearings can be fully exploited, especially at the high rpm of the turbo machine and at high pressure differentials, without disruptive leakage occurring and without requiring complicated compensation arrangements. Using dry gas seals allows losses to be kept especially low, even at relatively high pressure drops. The use of magnetic bearings on both the suction side and the pressure side permits low-loss support of even heavy weight machines with a number of stages at high rpm. Because of the pressure difference between the suction and the pressure sides of the turbo machine, an axial thrust F0 is generated,",
    "textAfterTable": "Title not available DE3925403A1 * Aug 1, 1989 Jan 24, 1991 Escher Wyss Gmbh Dry gas seal for machine shafts - has positive radially resilient connection between shaft bush and shaft EP0361844A2 * Sep 26, 1989 Apr 4, 1990 Nova Corporation Of Alberta Gas compressor having dry gas seals EP0373817A1 * Dec 6, 1989 Jun 20, 1990 Nova Corporation Of Alberta Gas compressor having a dry gas seal on an overhung impeller shaft * Cited by examiner Referenced by Citing Patent Filing date Publication date Applicant Title US5445494 * Nov 8, 1993 Aug 29, 1995 Bw/Ip International, Inc. Multi-stage centrifugal pump with canned magnetic bearing US5658125 * Feb 28, 1995 Aug 19, 1997 Allison Engine Company, Inc. Magnetic bearings as actuation for active compressor stability control",
    "hasKeyColumn": true,
    "keyColumnIndex": 3,
    "headerRowIndex": 0
}