{
    "relation": [
        [
            "Date",
            "Oct 16, 1989",
            "May 25, 1994",
            "Jun 17, 1998",
            "Jun 17, 2002",
            "Jul 2, 2002"
        ],
        [
            "Code",
            "AS",
            "FPAY",
            "FPAY",
            "FPAY",
            "REMI"
        ],
        [
            "Event",
            "Assignment",
            "Fee payment",
            "Fee payment",
            "Fee payment",
            "Maintenance fee reminder mailed"
        ],
        [
            "Description",
            "Owner name: NATIONAL SEMICONDUCTOR CORPORATION, A CORP OF DE,C Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNOR:PATTERSON, MICHAEL W.;REEL/FRAME:005333/0013 Effective date: 19890328",
            "Year of fee payment: 4",
            "Year of fee payment: 8",
            "Year of fee payment: 12",
            ""
        ]
    ],
    "pageTitle": "Patent US4978830 - Laser trimming system for semiconductor integrated circuit chip packages - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US4978830?ie=ISO-8859-1&dq=5,966,702",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 8,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987174.71/warc/CC-MAIN-20150728002307-00104-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 483399539,
    "recordOffset": 483375132,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{20778=A considerable amount of effort has been expended developing methods of manufacturing semiconductor integrated circuit chip packages. For example, the assignee of the subject invention has developed an automated tape bonding process for fabricating such chips. This process is described in U.S. Pat. No. 4,701,781, issued Oct. 20, 1987, to Sankhagowit, the disclosure of which is incorporated herein by reference. The development of another similar type of chip package is described in U.S. Pat. No. 4,796,080, issued Jan. 3, 1989 to Phy, and incorporated herein by reference.}",
    "textBeforeTable": "Patent Citations While the subject invention has been described with reference to a preferred embodiment, various changes and modifications could be made therein by one skilled in the art without varying from the scope and spirit of the subject invention as defined by the appended claims. In summary, there has been provided a new and improved automatic laser trimming apparatus for semiconductor integrated chip packages. The system is designed for the precision removal of dambars as well as the deflashing and degating of semiconductor lead frame packages. The system combines a laser machining subsystem with a machine vision subsystem to accurately locate and process the dambars on an integrated circuit package. In accordance with the subject invention, a defocusing lens is used to attenuate the intensity of the laser beam to permit a single laser to perform both the dambar removal and deflashing operations. In addition, an improved fixture is provided to enhance the removal of smoke and debris from the processing station and to provide improved backlighting to enhance resolution. In addition to the dambar removal and deflashing operation, the subject system also performs a degating operation. In the degating operation, the connection between the gate 12 and the die 13 is broken. Since this step also consists of plastic removal, it is performed with the defocusing lens 54 in place. When all of the dambars are removed, and the deflashing and degating operations are completed, a",
    "textAfterTable": "Citing Patent Filing date Publication date Applicant Title US5444188 * Jan 12, 1993 Aug 22, 1995 Nippon Mektron, Ltd. Flexible circuit wiring board and method of producing the same US5465780 * Nov 23, 1993 Nov 14, 1995 Alliedsignal Inc. Laser machining of ceramic cores US5548890 * Oct 23, 1995 Aug 27, 1996 Hitachi Construction Machinery Co., Ltd. Lead frame processing method US5580699 * Aug 16, 1994 Dec 3, 1996 Ventritex, Inc. Method for manufacturing implantable cardiac defibrillation electrodes using a laser beam material removal process US5658709 * Nov 3, 1995 Aug 19, 1997 Ventritex, Inc. Method for manufacturing implantable cardiac defibrillation electrodes using a laser beam material removal process US5662822 * Oct 9, 1995 Sep 2, 1997 Hitachi Construction Machinery Co., Ltd. Dam bar cutting apparatus and dam bar cutting method US5961860",
    "hasKeyColumn": true,
    "keyColumnIndex": 1,
    "headerRowIndex": 0
}