{
    "relation": [
        [
            "Date",
            "Jan 23, 2004",
            "Jan 14, 2010",
            "Sep 25, 2011",
            "Sep 25, 2011",
            "Mar 28, 2014"
        ],
        [
            "Code",
            "AS",
            "AS",
            "FPAY",
            "SULP",
            "AS"
        ],
        [
            "Event",
            "Assignment",
            "Assignment",
            "Fee payment",
            "Surcharge for late payment",
            "Assignment"
        ],
        [
            "Description",
            "Owner name: FARGO ELECTRONICS, INC., MINNESOTA Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNORS:MEIER, JAMES M.;JOHNSON, CHADWICK M.;COUNTRYMAN, GARY W., JR.;AND OTHERS;REEL/FRAME:014922/0574 Effective date: 20040115",
            "Owner name: HID GLOBAL CORPORATION,CALIFORNIA Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNOR:FARGO ELECTRONICS, INC.;REEL/FRAME:023788/0399 Effective date: 20091230",
            "Year of fee payment: 4",
            "",
            "Owner name: ASSA ABLOY AB, SWEDEN Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNOR:HID GLOBAL CORPORATION;REEL/FRAME:032554/0875 Effective date: 20131217"
        ]
    ],
    "pageTitle": "Patent US20040109715 - Identification card printer and ribbon cartridge - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US20040109715?dq=552685",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 8,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988840.31/warc/CC-MAIN-20150728002308-00079-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 479519343,
    "recordOffset": 479483312,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{95439=[0001] The present application is a Continuation-in-Part of U.S. patent application Ser. No. 10/071,554, filed Feb. 8, 2002, entitled “METHOD AND APPARATUS FOR COMMUNICATING BETWEEN PRINTER AND CARD SUPPLY,” which is a Continuation-in-Part of U.S. application Ser. No. 09/489,591, filed Jan. 21, 2000, entitled “METHOD AND APPARATUS FOR COMMUNICATING BETWEEN PRINTER OR LAMINATOR AND SUPPLIES” and issued as U.S. Pat. No. 6,386,772 on May 14, 2002, which in turn claims the benefit U.S. Provisional Application Serial No. 60/117,123, filed Jan. 25, 1999; the present application also claims the benefit of Provisional Patent Application Serial No. 60/459,712, filed Apr. 2, 2003; and the present application claims the benefit of U.S. Provisional Patent Application Serial No. ______, filed Aug. 19, 2003, entitled “IDENTIFICATION CARD PRINTER RIBBON CARTRIDGE” for inventors James M. Meier, Chadwick M. Johnson, Gary Countryman, Stacy W. Lukaskawcez and Ryan Parks.}",
    "textBeforeTable": "Patent Citations [0086] Although the present invention has been described with reference to preferred embodiments, workers skilled in the art will recognize that changes may be made in form and detail without departing from the spirit and scope of the invention. [0085] In accordance with one embodiment of the above-described method, memory 502 of supply circuit 500 is divided into a plurality of memory banks. Each bank is provided with a value representing a portion of the prints remaining in ribbon 120. During use of print ribbon 120, the value stored in the banks are selectively decremented to represent the use of the print ribbon 120 as the value in each bank reaches a predetermined end value, controller 140 disables the bank of memory 502 rendering the bank unusable. Once the values in all of the banks of memory 502 reach the predetermined end value, the controller 140 can prevent further use of the print ribbon 120 with printer 100. [0084] Another embodiment of the invention is directed to a method of operating printer 100, which is illustrated in the flowchart of FIG. 20. At step 520 of the method, a value is stored in memory 502 of supply circuit 500. Preferably, the value is representative of a number of prints remaining or that can be printed by print ribbon 120. Accordingly, the value can correspond to a length of",
    "textAfterTable": "US4015839 * Nov 11, 1974 Apr 5, 1977 True Data Corporation Card feeding station US4017068 * Nov 11, 1974 Apr 12, 1977 True Data Corporation Card transport apparatus US4021032 * Mar 12, 1976 May 3, 1977 Computer Terminal Systems, Inc. Feeding device US4031578 * May 20, 1976 Jun 28, 1977 Doris Sweeney Contoured travel pillow US4068028 * Jun 9, 1971 Jan 10, 1978 Unical Corporation Apparatus and method of producing transparent labels with printing on the adhesive and product produced thereby US4083302 * Dec 1, 1976 Apr 11, 1978 Bello Ralph R Credit card verification and printing device US4102267 * Apr 20, 1977 Jul 25, 1978 Gerhard Ritzerfeld Feeding of sheets and cards in a rotary duplicator machine capable of whole-page and linewise printing US4146900",
    "hasKeyColumn": true,
    "keyColumnIndex": 2,
    "headerRowIndex": 0
}