{
    "relation": [
        [
            "Citing Patent",
            "US6906528 *",
            "US7023342",
            "US7126478 *",
            "US7225241 *",
            "US7317388 *",
            "US7362258 *",
            "US7388497",
            "US7925469 *",
            "US7986227",
            "US8106773 *",
            "US8120463",
            "US8279112",
            "US8446254",
            "US8903548 *",
            "US8917086",
            "US20010029474 *",
            "US20040093187 *",
            "US20050057368 *",
            "US20050068042 *",
            "US20100259413 *",
            "US20120153089 *",
            "CN101506824B",
            "WO2007147940A1 *"
        ],
        [
            "Filing date",
            "Sep 30, 2003",
            "Sep 17, 2003",
            "Aug 26, 2005",
            "Nov 29, 2000",
            "Mar 29, 2005",
            "Mar 25, 2005",
            "Feb 1, 2006",
            "Sep 1, 2006",
            "Sep 20, 2007",
            "Jul 3, 2006",
            "Jan 4, 2007",
            "Nov 3, 2009",
            "Nov 3, 2009",
            "Dec 15, 2011",
            "Jul 19, 2011",
            "Nov 29, 2000",
            "Jul 20, 2001",
            "Sep 17, 2003",
            "Sep 30, 2003",
            "Aug 21, 2008",
            "Dec 15, 2011",
            "Jun 15, 2007",
            "Jun 15, 2007"
        ],
        [
            "Publication date",
            "Jun 14, 2005",
            "Apr 4, 2006",
            "Oct 24, 2006",
            "May 29, 2007",
            "Jan 8, 2008",
            "Apr 22, 2008",
            "Jun 17, 2008",
            "Apr 12, 2011",
            "Jul 26, 2011",
            "Jan 31, 2012",
            "Feb 21, 2012",
            "Oct 2, 2012",
            "May 21, 2013",
            "Dec 2, 2014",
            "Dec 23, 2014",
            "Oct 11, 2001",
            "May 13, 2004",
            "Mar 17, 2005",
            "Mar 31, 2005",
            "Oct 14, 2010",
            "Jun 21, 2012",
            "Jul 13, 2011",
            "Dec 27, 2007"
        ],
        [
            "Applicant",
            "The Regents Of The University Of California",
            "The United States Of America As Represented By The Secretary Of The Navy",
            "Meto International Gmbh",
            "Fujitsu Limited",
            "Honda Motor Co., Ltd.",
            "Honda Motor Co., Ltd.",
            "The United States Of America As Represented By The Secretary Of The Navy",
            "California Institute Of Technology",
            "Cornell Research Foundation, Inc.",
            "Siemens Aktiengesellschaft",
            "Lockheed Martin Corporation",
            "Trimble Navigation Limited",
            "Thingmagic, Inc.",
            "Pepperl + Fuchs Gmbh",
            "Lawrence Livermore National Security, Llc",
            "Noriaki Yada",
            "Dames Andrew N",
            "Government Of The United States Of America As Represented By The Secretary Of The Navy.",
            "The Regents Of The University Of California",
            "Chang San It Co., Ltd.",
            "Timo Galm",
            "芬兰技术研究中心",
            "Heikki Seppae"
        ],
        [
            "Title",
            "Electronic non-contacting linear position measuring system",
            "Continuous wave (CW)—fixed multiple frequency triggered, radio frequency identification (RFID) tag and system and method employing same",
            "Method and device for the activation of large quantities of security elements for the electronic article protection",
            "Asset management system and asset management method",
            "Position detection system for mobile object",
            "Transponder detection system using radio and light wave signals",
            "Radio frequency identification tag",
            "Sensor web",
            "System and method for position matching of a patient for medical imaging",
            "System and method of identifying products enclosed in electrostatic discharge protective packaging",
            "RFID protocol for improved tag-reader communications integrity",
            "Methods and apparatuses for RFID tag range determination",
            "Methods and apparatuses for RFID tag range determination",
            "Position finding system",
            "Position sensor for linear synchronous motors employing halbach arrays",
            "Asset management system and asset management method",
            "Multiple tag interrogation system",
            "Continuous wave (CW) - fixed multiple frequency triggered, radio frequency identification (RFID) tag and system and method employing same",
            "Electronic non-contacting linear position measuring system",
            "Location management system for moving object and location management method for moving object",
            "Position finding system",
            "RFID reading device",
            "Rfid reading device"
        ]
    ],
    "pageTitle": "Patent US6452504 - System and method for communication with radio frequency identification tags ... - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US6452504?dq=6,952,563",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 8,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438043062635.98/warc/CC-MAIN-20150728002422-00294-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 472207983,
    "recordOffset": 472167047,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{69557=In the present embodiment, the transponder 520 remains dormant until either: (i) the motion sensor 1411 is activated by motion of the transponder 520 and a low frequency, e.g., 8 kHz, RF signal is detected; (ii) the tamper detector 1410 is activated (such as by someone trying to open the transponder 520 or remove it from the asset to which it is attached); or (iii) a high-intensity localized wake up field is received as described with respect to FIG. 20 herein., 72664=FIG. 16 illustrates the various states of the transponder 520 of an exemplary embodiment of the present invention during operation of the system. As illustrated in FIG. 16, the transponder(s) 520 generally operates in one of seven states, namely: (i) the “stand by” state 1602; (ii) the “reset” state 1606; (iii) the “respond” state 1610; (iv) the “active” state 1614; (v) the “inhibit” state 1618; (vi) the “renamed” state 1624; and (vii) the direction finding mode (DFM) tracking pulse state 1630. These states and their inter-relationships are described below. It is noted that while discussed in terms of logical states, the operation of the transponder 520 as described herein is achieved using one or computer algorithms running on the microprocessor 1406 of the transponder, as well as the host computer processor or other intelligence associated with the sensor system 510. Such computer algorithms are ideally stored in the volatile and non-volatile memory devices (i.e., ROM, RAM, and magnetic storage media) incorporated within the transponder and sensor system, although other arrangements and storage schemes may be used., 101515=The PTS 2002 of FIG. 20 is further capable of changing the modes or states of the transponder 520 with which it is in communication, such as from “normal” to “transport” mode or vice versa. Normal mode is a state whereby the tag behaves as previously described. Note that the tag must be moved so that the accelerometer will wake up the microprocessor. However, this state is wasteful of battery life if the tag has not yet been installed, or is in transport and is constantly being shaken. “Transport mode” is a state where the tag does not use the signal from the accelerometer and so the tag enjoys a longer battery shelf life., 78592=When this next DFM command header is detected, the transponder waits for its DFM time slot (assigned via the “rename” command), and subsequently sends the DFM directional information to the sensor system 510. The transponder then returns to the renamed state 1624 and awaits further commands form the sensor system 510., 92713=After the message processing function 1816 completes, the algorithm 1800 advances to a decision state 1818 and determines if the function 1816 yielded valid position data. If so, the algorithm moves to state 1820 to report the position of the transponder to the sensor system 510 via the transponder-to-sensor system communication 538 illustrated in FIG. 5. The algorithm 1800 then enters an end state 1822. If, however, it is determined at decision state 1818 that the position data is not valid, the algorithm 1800 moves back to the first transmit state 1804 to begin the process again so as to try to obtain valid position data., 71251=FIG. 15 is a plan view of a barrier (e.g., door 410) illustrating the characteristic sensitivity patterns 1500 of one exemplary installation of a sensor array 402 and sensor system 510 according to the present invention. Shown in FIG. 15 are (i) the maximum sensor read range 1502 (dependent on radiated frequency and power) for a three phase emitter; (ii) the maximum wake up range 1510 of the transponder 520 when the transponder antenna is parallel to the X axis (FIG. 1) of one emitter coil of the antenna array for the illustrated embodiment; and (iii) the maximum wake up range 1512 of the transponder 520 when the transponder antenna is perpendicular to the X axis (FIG. 1) of one emitter coil of antenna array 402 and only one coil is energized. The direction of movement of a hypothetical tagged asset moving through the door 410 is also shown by arrow 1508. Vector 1504 illustrates the maximum useful range achievable by the system 510, based on the overlap of the maximum wake up range and sensor array range. In the present embodiment, this range is approximately 6 m, although other distances may be used depending on the needs of the user and the specific application. Furthermore, it is contemplated that other sensitivity patterns may be created depending on such considerations., 59045=The UHF receivers (902-904) operate on a multichannel frequency and are configured so as to be capable of continuous reception. A UHF antenna 1414 (FIG. 14) of the transponder 520 is configured to transmit data to the sensor system 510 using a 434 MHz nominal amplitude modulated (AM) carrier. The data bits are biphase coded using half bits of 330 microseconds in the illustrated embodiment. Biphase coding is well known in the art, and accordingly will not be discussed further herein. Signal strength information from the UHF receivers informs the message encoder 920 of incoming RF energy from the transponders 520, such as a burst of data. The UHF receivers send the signal levels and any received data to the message encoder 920 for communication with the host computer 620 via the sensor interface 840., 87872=Referring to FIG. 18, the aforementioned two message DFM method is now described in greater detail in terms of a preferred algorithm 1800 running on the transponder and sensor system processors. Beginning at a start state 1802, the algorithm 1800 moves to a transmit state 1804 where each of the sensors in the system transmits a first DFM message with all three antenna array phases being on. For example, in a system with an “A side” sensor array and a “B side” sensor array such as illustrated in FIG. 4 herein, both sensor arrays of each sensor pair would transmit the first DFM message. Proceeding next to a decision state 1806, the algorithm determines if the transponder rejects the signal from one of the sensor arrays. If so, the algorithm continues to another state 1808 and, in one embodiment, turns off one of the three phases at each sensor. In the illustrated embodiment, a phase is turned off by sending a command to the generator circuit 930 (FIG. 9), although other ways of turning off one of the phases are contemplated. Proceeding next to a second transmit state 1810, both of the sensor arrays of each pair transmit a second DFM message with one of the three phases turned off. The phase which is turned off can be any one of the three, as previously discussed. Moving to a decision state 1812, the algorithm 1800 again determines if the transponder rejects the signal. If so, in one embodiment, there is a system error (based on the fact that both the three-phase and two-phase DFM messages can not physically be rejected by the transponder), and the algorithm 1800 advances to an error processing state 1814 for analysis of the transponder(s) 520 rejecting the second signal. This state compares the DFM position information returned from the tag from the two messages. If the position information is different, the data is discarded and two more DFM messages are sent. However, if a transponder does not reject the second “two-phase” DFM signal, as determined at the decision state 1812, the algorithm 1800 processes the content of the second DFM message per function 1816., 100554=The PTS 2002 of the embodiment of FIG. 20 comprises generally a hand held wand having an LCD screen 2019 (with back lighting) capable of displaying information relating to operation of the system 2000 and the transponder 2002. The PTS 2002 further comprises an input device 2010 such as a series of keys or pushbuttons on its outer surface which permit the operator to accomplish a variety of data input and preprogrammed functions. A variable menu structure is also optionally used, whereby individual keys of the input device 2010 may be used to perform multiple functions. It will be recognized that while the illustrated embodiment uses a key/menu arrangement and LCD screen for information display and input, other configurations such as a touch-sensitive screen (with or without stylus), cathode ray tube, or thin film transformer (TFT) or plasma display may be used with equal success., 79513=Referring now to FIG. 17, a schematic of one exemplary embodiment of the wake up circuitry 1404 of the transponder 1400 (FIG. 14) will be described. In one embodiment, the transponder 520 receives a signal at the receive antenna 1402 which is propagated to an 8 kHz input section 1710. A pair of diodes D1 1703 and D2 1705, acting as a symmetrical diode limiter, are added to stop overload of transistor Q5 1707 of the 8 kHz section 1710 due to the stronger input level of the wake up signal from a Portable Transponder Sensor. The anode of D2 1705 connects to point 1702 and the cathode connects to ground, while the cathode of D1 1703 connects to point 1702 and the anode connects to ground. In one embodiment of the transponder, the voltage induced by the wake up signal at point 1702 is about one volt. The anode of a diode D3 1704 connects to point 1702 and is used to generate a transponder wake up signal at point 1706. A capacitor C10 1711 connects between the cathode of D3 and ground 1715. In one embodiment, the voltage level of the transponder wake up signal at point 1706 is about 0.3 volts. A resistor R32 1718, having a value of 10,000 ohms in one embodiment, which is connected between the receive antenna 1402 and point 1702, is optional., 75702=In the inhibit state 1618, the transponder 520 waits for a “retry” command that offers the next chance to transmit, since the free 434 MHz channel was acquired by another transponder. The retry command returns the transponder to the respond state 1610 where the tag waits for another respond command., 64349=The four antenna coil elements 1002, 1032, 1061, 1063 are physically connected to their respective circuit phases (and to each other in the case of the end coils 1061, 1063) via plug-in connectors 1120, 1122, 1124, 1126 mounted on a printed circuit board 1100 located within the sensor array housing cover 1106. The cover 1106 forms a portion of the exterior housing of the sensor array 402, which is also comprised of two end covers 1102, 1103 and a base plate 1104. The PCB 1100 is affixed to the base plate 1104, as are the end covers 1102, 1103 and the housing cover 1106. The end covers 1102, 1103, base plate 1104, PCB 1100, and housing cover 1106 cooperate to maintain the antenna coils 1002, 1032, 1061, 1063 in the desired physical alignment (i.e., the X and Y coils orthogonal to each other as well as the two end coils) when the sensor array 402 is assembled. The housing cover, end covers, and base plate are constructed of plastic, plastic, and metal, respectively. These materials are chosen for their magnetic permeability with respect to the RF energy generated or received by the antenna coils. It will be recognized by those of ordinary skill in the mechanical arts, however, that a wide variety of housings or structures useful for maintaining the antenna coils in the desired positions, as well as materials of construction thereof, may be substituted for the arrangement of FIG. 11., 93455=It is noted that if it is determined in decision state 1806 that none of the signals are rejected by the transponder, the algorithm 1800 advances to state 1824. At state 1824, the strongest signal of the signals received at the transponder antenna is determined, and the algorithm selects the strongest signal as indicative of the sensor that the transponder is closest to in location. Alternatively, the transponder measures the relative signal strengths of those signals received and develops an estimate of the relative angular position as previously described with respect to FIG. 3., 78952=It is noted that the embodiment of the invention illustrated in FIG. 16 also includes an “emergency call” state 1646. In this state, the transponder 520 issues an emergency message to the sensor system 510 using the 434 MHz channel to alert the sensor system 510 of tampering or other predefined external digital input. The external input causes an interrupt into the tag which starts a predetermined message to be emitted at 434 MHz. This message follows the protocol used by all tags during the respond command., 94178=FIG. 19 illustrates the direction finding method of the present invention in greater detail. This method 1900 determines the position of the tag or transponder in relation to the multiple system sensor arrays 402 disposed around an access point such as a door 410 (FIG. 4). Beginning at a start state 1902, the method employs a first decision state 1604 to determine if the transponder 520 is in motion. Recall that the transponder contains a motion sensor 1411 which enables the “wake up” of the transponder processor if the transponder is both in motion (over a given time interval) and within an RF field of a predetermined intensity. If the transponder is not in motion or the field not present, the method 1900 is terminated until it is determined that foregoing conditions are met. When these conditions are satisfied, the transponder attempts to synchronize with the commands being issued by the sensor arrays 402 in state 1906. Eventually, each of the sensor arrays of the sensor system 510 issues a Direction Finding Mode (DFM) command at state 1908. In one embodiment of the invention, after the DFM command is issued, each of the sensors emits a plurality (e.g., thirty-two) cycles of an 8130 Hz signal, followed by a lesser number (e.g., nine) cycles of directional information at state 1910. It will be recognized that the sensor may emit a signal at another frequency or frequencies if desired. During the nine cycles of directional information, the “A” sensor array of the sensor pair transmits the nine cycles with a 180 degree phase shift, while the “B” sensor does not phase shift the 8130 Hz signal. For the purposes of this discussion, a phase shift is accomplished by shifting a given number of cycles of an RF signal with respect to a center or “normal” frequency. Thus, the signals from the “A” and the “B” sensor arrays are phase shifted by 180 degrees from each other during the period of the nine cycles., 77799=In the DFM tracking pulse state 1630, the transponder first waits for the next DFM tracking command header, the header being used to synchronize all the tags being in DFM to the same time base. The DFM tracking command of the present embodiment comprises generally a DFM header field, tracking opcode (four bits), and a DFM group identification code (also four bits). The header synchronizes the transponder with the sensor system's bit clock (not shown), and provides a secure indication to the transponder that a new message is commencing. The opcode provides the transponder with instructions for the direction finding mode of operation. The DFM group is used to identify the transponder in the event that a large number of transponders are in use simultaneously., 102179=In another aspect of the invention, the PTS 2002 is able to receive tamper alert messages from the transponder 520 in an unsynchronized fashion; these alert messages are generated within the transponder by the processor 1406 when the transponder is tampered with. Specifically, the tamper detector 1410 provides a signal to the processor 1406 when the detector is activated (such as by someone trying to remove the transponder from the asset). These signals may be stored by the transponder for later retrieval by the PTS 2002, or directly converted to a radio frequency message emitted by the transponder and received by the PTS when the transponder is tampered. Information received by the PTS 2002 further includes, inter alia, the ID of the tampered with transponder., 74738=In the respond state 1610, the transponder sends its ID to the system 510. First, in one embodiment, a preamble (tag activity pulse, or TAP) is sent. The TAP informs the sensor system 510 that at least one transponder 520 is responding. A random number generator within the transponder processor 1406 selects one of eight time slots for transmission of the ID. The transmission of the actual ID starts at this randomly selected time slot. While waiting for this time slot, the transponder observes the signals emitted by the sensor system 510; as soon as a “channel free” signal disappears, the transponder stops to wait for transmission back to the sensor system and enters inhibit state 1618., 76043=A transponder that has sent its ID on the available 434 MHz channel without being inhibited enters the active state 1614. All commands issued by the sensor system 510 that are appropriate and should only be executed by a single, isolated transponder, are accepted in the active state 1614 only. In the illustrated embodiment, the only such command is the “rename” command (described below), although the use of other such commands is contemplated herein. While in active state 1614, the transponder 520 also receives an acknowledgement to its ID transmission. This acknowledgement contains, inter alia, a cyclic redundancy code (CRC) of the type well known in the signal processing arts, as well as the number of a time slot it has been allocated to use in direction finding mode (DFM) by the sensor system 510. The CRC is checked, and if valid, the transponder is commanded to enter the renamed state 1624. If the CRC is not valid, the transponder enters the inhibit state 1618 and awaits a “retry” command., 66426=Referring now to FIG. 14, one embodiment of the internal hardware configuration for the asset transponder 520 of FIG. 5 is described. As previously described, a low frequency tuned loop antenna 1402 receives transmissions from the sensor system 510 (FIG. 5). In one embodiment, the low frequency used is approximately 8 kHz, although frequencies in the range of 0 to 1 GHz may also be utilized. The transmissions received by the transponder include, inter alia, the wake up field 530 generated by the sensor system 510 (FIG. 5) as well as other data such as the “rename” command 534 and request for location information (DFM) 536. The output of the loop antenna 1402 is fed to a wake up detector and receiver circuit 1404. The wake up detector portion of the circuit 1404 detects a wake up field received by the transponder loop antenna 1402 by measuring the intensity of the received signal, and the receiver portion of the circuit 1404 receives and processes the low frequency data signals received by the loop 1402. The wake up detector and receiver circuit 1404 is further described in conjunction with FIG. 17 below., 99951=The acquisition portion 2017 of the PTS 520 receives commands, and downloads data to the laptop computer 2004 via a standard RS-232 serial data link of the type well know in the data processing arts, although others (such as USB, wireless, or infrared/optical coupling, for example) may be readily used. The laptop 2004 of the illustrated embodiment has a Windows�-based interface with appropriate screens and menu structures that direct or allow the operator to perform various desired functions relating to the transponder 520 or PTS 2002., 67672=As shown in FIG. 14, the output of the circuit 1404 feeds a communications processor 1406 disposed within the transponder 520. The processor 1406 is responsible for the processing of, inter alia, portions of the anti-clash, CRC, and ID code functionality described below. The processor of the present embodiment is a Model No. 161V58 8-bit processor manufactured by Microchip, although other types of processor may be used. The system can also be encoded into a state machine and developed as an application specific integrated circuit (ASIC). A tamper detector 1410 and/or motion sensor 1411 are also interconnected with the processor 1406. The tamper detector 1410 helps determine if attempts are being made to tamper with the transponder 520, while the motion sensor 1411 assists the processor in determining if the transponder 520 is in motion. The tamper detector 1410 of the illustrated embodiment comprises a switch-type arrangement using a normally closed switch of the type well known in the electrical arts, although other types of detectors may be used. The motion sensor 1411 is, in the present embodiment, a bi-morphous accelerometer of the type well known in the art, although it will again be recognized that other types may be substituted., 66003=FIGS. 12A through 13B further illustrate the sensor antenna coil arrangement and direction of electrical current flow of each coil in the sensor array of FIG. 11. FIGS. 12A and 12B are diagrams of the end coils 1061, 1063, respectively, for the Z axis. FIGS. 13A and 13B illustrate the X-direction coil 1002 and Y-direction coil 1032 of the sensor array, respectively., 96226=In state 1912 of the method 1900, the receiving transponder waits until the aforementioned nine cycle period and compares the received signal from sensor “A” with the received signal from sensor “B”. This comparison yields an indication of which of the two sensor arrays 402 (i.e., either the “A” array or the “B” array) is closer to the transponder. In one embodiment, this comparison is performed by rationing the relative signal strengths of the signals from the two sensors arrays as previously described with respect to FIG. 3. If the relative phase difference is 80 degrees or less, the transponder believes it is closer to the “B” sensor field; that is, on the “B” side of the door 410 of FIG. 4. However, if it is determined at the decision state 1914 that the phase difference is greater than 100 degrees, then the transponder believes it is on the “A” side of the door. The transponder reports its position to the sensors system 510 accordingly in state 1916 (for the “B” side of the door 410) or state 1918 (for the “A” side of the door 410), and the process completes at an end state 1920., 29629=This patent application is related to U.S. application Ser. No. 09/406,092, entitled “SYSTEM AND METHOD FOR LOCATING RADIO FREQUENCY IDENTIFICATION TAGS”; U.S. application Ser. No. 09/405,364, entitled “SYSTEM AND METHOD FOR COMMUNICATION WITH DORMANT RADIO FREQUENCY IDENTIFICATION TAGS”, and U.S. application Ser. No. 09/406,091, entitled “SYSTEM AND METHOD FOR LOCATING RADIO FREQUENCY IDENTIFICATION TAGS USING THREE-PHASE ANTENNA”, which are being filed concurrently herewith on Sep. 24, 1999., 77377=In the renamed state 1624, the transponder 520 waits for the DFM initiation command from the sensor system 510 or, alternatively, a “reset” command. If the DFM initiation command is received, the transponder enters the DFM tracking pulse state 1630. If the “reset” command is received, the transponder is returned to the respond state 1610 as shown in FIG. 16., 64053=In a second embodiment, the antenna coils 1002, 1032, 1062 of the sensor array 402 are comprised of a ferrite loaded material wound with a plurality of turns of thin (i.e., 20 ga.) copper wire. Other antenna coil configurations may be used as well., 97830=Referring now to FIG. 20, a system and method for communicating with a dormant RFID transponder is now described. In the embodiment of FIG. 20, the dormant transponder communication system 2000 comprises a portable transponder sensor (PTS) 2002 which is advantageously attached to a laptop or other portable computer 2004. It will be recognized that other electronic computing devices, such as palmtop organizers, calculators, or even non-portable devices may be substituted for the illustrated laptop computer 2004 if desired. The system is used to associate the tagged asset to the transponder 520, and once associated, the transponder 520 can be checked on a routine or maintenance schedule without having to activate the motion detector 1411 or other sensor within the transponder., 90107=In one embodiment, the DFM message processing function 1816 is implemented as a truth table. The two responses by each transponder to the two transmissions from the sensors are compared in the following exemplary truth table:, 98684=The system 2000 of the illustrated embodiment is capable of bi-directional communication with one or more transponders 520, and allows the user to perform maintenance and inventory control functions associated therewith. The PTS 2002 includes a processor (not shown), an on-board phase shift keying (PSK) signal generator 2001, and a 434 MHz receiver section 2003, for generating commands and decoding F/2F data, such as non-return-to-zero coded data, which is received from the transponder(s) 520. The processor may alternatively or simultaneously comprise the host processor of the computer 2004. All of the transmit and receive antennas 2012, 2014 are mounted within the PTS 2002 for compactness and ease of use. The PTS 2002 is capable of generating a magnetic field of great enough intensity to allow for the dormant transponder 520 (such as a transponder having a motion sensor which is not in motion) to wake up when the PTS 2002 is placed in relative proximity to the transponder 520. In the illustrated embodiment, the PTS 2002 generates a field with intensity on the order of one Gauss, although other field intensities may be used., 62682=Referring now to FIG. 11, one embodiment of the physical configuration of the antenna transmit/receive coils 940 within the sensor arrays 402 of the present invention is described. Each sensor array 402 comprises generally three antenna elements 1002, 1032, 1062 which are electrically coupled to the output of the circuit phases 1000, 1030, 1060 as shown in FIG. 10. The antenna elements 1002, 1032, 1062 are physically comprised of loops of conductive material which are arranged so as to generate magnetic flux in three orthogonal axes (e.g., the X, Y, and Z axes in a Cartesian system) when alternating electrical current is passed there through. Specifically, the sensor array illustrated in FIG. 11 is comprised of a substantially rectangular “X” antenna coil 1002, a substantially rectangular “Y” antenna coil 1032, and a pair of semi-circular “Z” end coils 1061, 1063 electrically arranged in a Helmholz circuit of the type well known in the antenna arts. The Helmholz arrangement of the end coils 1061, 1063 provides the Z-direction with an antenna aperture similar to that of one of the larger X or Y coils 1002, 1032, thereby providing a more uniform field intensity in each of the three axes., 60994=FIG. 10 illustrates one exemplary embodiment of the three phase amplifier 932 and antenna array coils 940 of the door sensor shown in FIG. 9. As shown in FIG. 10, the amplifier 932 and antenna array 940 comprise three discrete circuit phases 1000, 1030, 1060 which are electrically coupled to corresponding antenna elements 1002, 1032, 1062. The three phases 1000, 1030, 1060 each take a respective input signal 1004, 1034, 1064 from the three phase modulator/frequency generator 930 (FIG. 9), amplify the signal, and output the amplified alternating current signal to the respective antenna element 1002, 1032, 1062. As described with reference to FIG. 2 above, the signals for each phase 1000, 1030, 1060 of the illustrated embodiment are shifted by 120 degrees of electrical phase as is well known in the electrical arts. Accordingly, the electromagnetic radiation emitted from the respective antenna elements 1002, 1032, 1062 is correspondingly shifted in phase such that magnetic and electric field intensity at a given point in space attributable to each antenna element is also shifted in phase. While the illustrated circuit phases 1000, 1030, 1060 employ, inter alia, operational amplifiers 1006, 1036, 1066 to perform the amplification function, it will be recognized that a variety of other components and arrangements well know in the art may be used to amplify the input signals 1004, 1034, 1064., 73902=In the stand by state 1602, electrical current consumption is reduced to minimum levels, and the transponder 520 waits for wake up signal. During this state, the microprocessor 1406 in the transponder is inactive. The transponder enters the reset state 1606 when the wake up signal 532 is received., 74255=In the reset state 1606, the transponder is waiting for a transmission command to be issued by the sensor system 510. The wake up receiver circuit (FIG. 17) has seen a continuous signal for the minimum predetermined wake up time and activates the microprocessor 1406. The transponder waits for a “respond”, “retry” or “reset” command before it sends its ID information to the sensor system 510 and enters the respond state 1610., 48867=Referring now to FIG. 5, the operation of one embodiment of the RFID asset management system of the present invention is described in detail. As shown in FIG. 5, the system is comprised generally of a radio frequency reader or sensor system 510 and a corresponding transponder 520 which are each in communication with one another. Initially, the transponder 520 is dormant or in an inactive state when outside the field generated by the sensor(s) 510. This dormant state reduces the power consumption of the transponder, since its internal processor 1406 (FIG. 14) and other components are inactive. The sensor system 510 generates an electromagnetic “wake up” field 130 using an alternating current (AC) signal as is well known in the art; see the discussion of FIG. 15 below for more details regarding the sensor field pattern in various applications. This wake up field is generated by the sensor system 510 in order to toggle the transponder 520 into the active state when the transponder 520 enters the wake up field (i.e., when the field detected by the internal magnetic loop antenna 1402 of the transponder as illustrated in FIG. 14 is of sufficient intensity), and the transponder is in motion. In one embodiment, the sensor system 510 communicates with the transponder 520 using an 8.13 kHz phase modulated signal, although it will be appreciated that other frequencies and/or modulation schemes may be used. It will further be recognized that broadband (i.e., “spread spectrum”) radio frequency techniques such as DSSS or FHSS may also be used, although the descriptions of the exemplary embodiments contained herein are in terms of a non-spread spectrum system. The transponder 520 then enters an “active” state and continues the communications protocol as generally illustrated in FIG. 5. Specifically, the transponder 520 next initiates an anti-clash routine 532 with the sensor system 510, after which the sensor acknowledges the transponder ID (including a cyclic redundancy code or CRC) and issues a “rename” command 534 to the transponder 520 in order to assign it to one of a plurality of time slots for the direction finding mode (DFM), explained in greater detail below with respect to FIG. 18. At this point, the sensor 510 requests information 536 as to the location of the transponder in the sensor field(s) from the transponder 520. The transponder 520 then responds with the requested location information 538, which is derived using one of a variety of techniques such as the relative signal strength method described with respect to FIG. 19 herein. Hence, the transponder 520 is used in the present invention to supply, inter alia, information regarding its position to the sensor(s) 510., 69038=The processor 1406 of the transponder 520 further connects to a transmitter circuit 1412 which in turn supplies a tuned ultra-high frequency (UHF) loop antenna 1414. The UHF loop 1414 is used for sending messages, such as the ID code, to the sensor system 510. The UHF loop of the illustrated embodiment operates at a frequency of 434 MHz, although other frequencies may be used. In one embodiment, the UHF loop does not receive any signal from the sensors.}",
    "textBeforeTable": "Patent Citations While the above detailed description has shown, described, and pointed out fundamental novel features of the invention as applied to various embodiments, it will be understood that various omissions, substitutions, permutations, and changes in the form and details of the apparatus and methods illustrated may be made by those skilled in the art without departing from the spirit of the invention. The foregoing description is not in any way meant to limit the scope of the invention; rather such scope is determined by the claims appended hereto. In another aspect of the invention, the PTS 2002 is able to receive tamper alert messages from the transponder 520 in an unsynchronized fashion; these alert messages are generated within the transponder by the processor 1406 when the transponder is tampered with. Specifically, the tamper detector 1410 provides a signal to the processor 1406 when the detector is activated (such as by someone trying to remove the transponder from the asset). These signals may be stored by the transponder for later retrieval by the PTS 2002, or directly converted to a radio frequency message emitted by the transponder and received by the PTS when the transponder is tampered. Information received by the PTS 2002 further includes, inter alia, the ID of the tampered with transponder. The PTS 2002 of FIG. 20 is further capable of changing the modes or states of the transponder 520 with which it is in",
    "textAfterTable": "US5874896 Aug 26, 1996 Feb 23, 1999 Palomar Technologies Corporation Electronic anti-shoplifting system employing an RFID tag US5923300 Apr 3, 1997 Jul 13, 1999 Destron-Fearing Corporation Multi-phase transmitter with single receive antenna for transponder interrogator US5963144 May 30, 1997 Oct 5, 1999 Single Chip Systems Corp. Cloaking circuit for use in a radiofrequency identification and method of cloaking RFID tags to increase interrogation reliability US6054935 May 3, 1995 Apr 25, 2000 Bio Medic Data Systems, Inc. System monitoring programmable implantable transponder US6069564 * Sep 8, 1998 May 30, 2000 Hatano; Richard Multi-directional RFID antenna US6147655 Nov 5, 1998 Nov 14, 2000 Single Chip Systems Corporation Flat loop antenna in a single plane for use in radio frequency identification tags US6229443 Jun 23, 2000 May 8, 2001 Single Chip Systems Apparatus and method for detuning of RFID tag to regulate voltage US6265976 Jun 23, 2000 Jul 24, 2001",
    "hasKeyColumn": true,
    "keyColumnIndex": 3,
    "headerRowIndex": 0
}