{
    "relation": [
        [
            "Citing Patent",
            "US8133121 *",
            "US8235800 *",
            "US8287386",
            "US8419535",
            "US8444489 *",
            "US8545328",
            "US8556705",
            "US8613671",
            "US8771078",
            "US8784189",
            "US9054668",
            "US20100255914 *",
            "US20110105224 *",
            "US20110124397 *",
            "US20120040753 *",
            "US20130203469 *",
            "CN102614660A *"
        ],
        [
            "Filing date",
            "Nov 3, 2009",
            "Nov 22, 2010",
            "Jun 8, 2009",
            "Jun 8, 2009",
            "Jun 15, 2010",
            "Jun 8, 2009",
            "Jul 9, 2012",
            "Jun 8, 2009",
            "Jun 8, 2009",
            "Jun 8, 2009",
            "Mar 30, 2012",
            "Jun 15, 2010",
            "",
            "",
            "Apr 21, 2011",
            "Feb 3, 2012",
            "Feb 1, 2011"
        ],
        [
            "Publication date",
            "Mar 13, 2012",
            "Aug 7, 2012",
            "Oct 16, 2012",
            "Apr 16, 2013",
            "May 21, 2013",
            "Oct 1, 2013",
            "Oct 15, 2013",
            "Dec 24, 2013",
            "Jul 8, 2014",
            "Jul 22, 2014",
            "Jun 9, 2015",
            "Oct 7, 2010",
            "May 5, 2011",
            "May 26, 2011",
            "Feb 16, 2012",
            "Aug 8, 2013",
            "Aug 1, 2012"
        ],
        [
            "Applicant",
            "Partygaming Ia Limited",
            "Gingher Robert G",
            "Cfph, Llc",
            "Cfph, Llc",
            "Weike (S) Pte Ltd",
            "Cfph, Llc",
            "Robert G. Gingher",
            "Cfph, Llc",
            "Cfph, Llc",
            "Cfph, Llc",
            "Broadcom Corporation",
            "Weike (S) Pte Ltd",
            "Partygaming Ia Limited",
            "Gingher Robert G",
            "E Ink Holdings Inc.",
            "Eunhyung Cho",
            "元太科技工业股份有限公司"
        ],
        [
            "Title",
            "System and process for stacking electronic game tables",
            "System and method for substantially removing chance from a mixed contest of chance and skill",
            "Electrical transmission among interconnected gaming systems",
            "Mobile playing card devices",
            "Virtual card gaming system",
            "Portable electronic charge device for card devices",
            "System and method for substantially removing chance from a word game comprising chance and skill",
            "Data transfer and control among multiple computer devices in a gaming environment",
            "Amusement device including means for processing electronic data in play of a game of chance",
            "Interprocess communication regarding movement of game devices",
            "Broadband absorptive-loading filter",
            "Virtual card gaming system",
            "System And Process For Stacking Electronic Game Tables",
            "System and method for substantially removing chance from a mixed contest of chance and skill",
            "Electronic game apparatus",
            "Split keyboard modification for a pull-out flexible display",
            "电子游戏装置"
        ]
    ],
    "pageTitle": "Patent US20100311488 - Amusement device including means for processing electronic data in play of a ... - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US20100311488?ie=ISO-8859-1",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 9,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988840.31/warc/CC-MAIN-20150728002308-00162-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 480544411,
    "recordOffset": 480349803,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{6319=In some implementations, advertisements may be oriented to face a player location. For example the advertisement 1201 of FIG. 12 may be oriented so that it faces towards the outside of a table on which a game is played. Card orientation, and/or location may be determined based on location data obtained from the card device, from video data of the card devices, and/or form any other source, as discussed above.}",
    "TableContextTimeStampAfterTable": "{805130=Some examples of determining locations of electronic devices and other uses of electronic devices that may be used in some embodiments are described in U.S. patent application Ser. No. 11/553,142 entitled APPARATUS, PROCESSES AND ARTICLES FOR FACILITATING MOBILE GAM1NG, which is hereby incorporated herein by reference. Various examples of video analysis that may be used to determine a location of a card device in a captured video image are described in U.S. Pat. No. 7,200,266 entitled Method and apparatus for automated video activity analysis and U.S. patent publication number 2009/0087024 entitled Context Processor for Video Analysis System, both of which are hereby incorporated herein by reference., 570411=Examples include, but are not limited to Alq3: tris(8-hydroxy-quinoline)aluminium and Tr(py)3: tris(2-phenylpyridine)iridium. More examples are described in for example Adv. Mater. 16 (2004) 1585-1595 and Appl. Phys. Lett. (2002) 1738-1740., 860557=One output of each PTC 14 ac is preferably connected to an antenna 20 ac, respectively. Each antenna 20 ac radiates power into a coverage area (or volume). A coverage area is defined by a minimum electric and/or magnetic field strength. As an example, a coverage area may be defined as an area (or space) in which the electric field strength radiated is greater than two volts per meter (2 V/m). The coverage area from a given antenna 20 a may or may not overlap other coverage areas from other antennas 20 b, 20 c. Other outputs of each PTC 14 ac may be connected to a load 16 and other transmission lines 18. When the PTCs 14 ac are implemented as directional couplers, the directional couplers may be designed to tap (or remove) a certain percentage (dB) from the transmission line 18. For example, a −20 dB coupler and a 1000 Watt(W) input result with a 10 W output to the terminating load 16. The directional couplers in the network 10 may all have the same coupling (e.g., −20 dB) or may be designed on a case-to-case basis to use standard coupling (e.g., −3, −6, −10 dB) or non-standard coupling (e.g., −3.4, −8, −9.8 dB)., 371711=Various embodiments may include date stamping of each card dealt (actual time and date defining sequence, with concept of specific identification of sequence identifier possibly being unique). The date stamping may also be replaced by specific sequence stamping or marking, such as a specific hand number, at a specific table, at a specific casino, with a specific number of players, etc. The records could indicate variations of indicators in the stored memory of the central computer of Lucky 777 Casino, Aug. 19, 1995, 8:12:17 a.m., Table 3, position 3, hand 7S/4D/9S, or simply identify something similar by alphanumeric code as L7C-819-95-3-3-073-7S/4D/9S (073 being the 73rd hand dealt). This date stamping of hands or even cards in memory can be used as an analytical search tool for security and to enhance hand identification., 327949=If the player originally bets $10 and the dealer shows an Ace, the player can buy Insurance by betting up to $5. Suppose the player makes a $5 Insurance bet and the player's hand with the two cards dealt to him totals 19. If the dealer's hole card is revealed to be a 10 after the Insurance betting period is over (the dealer checks for a “natural” before the players play their hands), the player loses his original $10 bet, but he wins the $5 Insurance bet at odds of 2:1, winning $10 and therefore breaking even. In the same situation, if the dealer's hole card is not one with a value of ten, the player immediately loses his $5 Insurance bet. But if the player chooses to stand on 19, and if the dealer's hand has a total value less than 19, at the end of the dealer's turn, the player wins his original $10 bet, making a net profit of $5. In the same situation, if the dealer's hole card is not one with a value of ten, again the player will immediately lose their $5 Insurance bet, and if the dealer's hand has a total value greater than the player's at the end of both of their turns, for example the player stood on 19 and the dealer ended his turn with 20, the player loses both his original $10 bet and his $5 Insurance bet., 965245=As illustrated, the card devices 1901 A, B, C, D, E, F includes a marker 1903 on one hand. In this example bonus game, if the hand with the marker 1903 wins, a point may be added to the point total for the table. The point total 1905 is indicated on the card devices. If the point total reaches a certain threshold, a bonus round may be started. An indicator 1907 may indicate the needed points to reach a bonus round. As indicated, 7 more points are needed to enter the bonus round in the illustrated example. In the bonus round, payouts may be higher, odds may be different, and/or any other desired action may take place. In some embodiments, a point total may increase and decrease based on loses and wins of a player with the marker 1903. In some embodiments, a marker 1903 may not be used but rather points may be based on a total of wins and/or loses of a group of players, of players at a table, etc. In some embodiments, a player may bet on the bonus game. In some embodiments, a bonus game may be reset when a player leaves and/or enters a table for play. It should be recognized that various embodiments may include any desired bonus game. Bonus games may be facilitated by an external system (e.g., monitoring play at a table, instructing card devices to display markers, determining if points should increase based on wins and loses, and so on)., 419800=2) for an LCD screen, various technologies are possible (TN, PDLC, STN, etc.); the person skilled in the art will know how to adapt the process accordingly. For the TN technology: bonding a thin plate of colored filters (for example of glass) and filling with liquid crystal (for more details see “Liquid Crystal Displays, Addressing Schemes and Electrooptical Effects”, Ernst Lueder, Wiley Editor, June 2001)., 917131=In other example implementations, a player may be dealt an initial set of card devices (e.g., 1001 and 1003) by another player, by a dealer, and/or by himself or herself (e.g., from a deck of card devices, from a deck device, etc.). In some implementations, card devices forming a hand of the player may be tracked as they are dealt to the player (e.g., by an external system such as system 503). In some implementations, for example, a location of a card device may be used by an external system to determine a hand to which a card device is to be assigned (e.g., card devices in one area are assigned to a first hand, card devices in a second area are assigned to a second hand, card devices on one side of a deck device are assigned to a first hand, card devices on another side of a deck device are assigned to a second hand, card devices that are within a distance from one another are in a same hand, etc.). As cards enter such a location, they may be assigned to a hand by an external system. In some implementations, a player may indicate that a card device should be part of a hand. For example, a player may use an interface of a card device to indicate that it should be part of a hand, may use an interface of a deck device to indicate that a next selected card device should be part of a hand, and so on. Such indication may be received by an external system and used to track and/or facilitate gaming activity. In some implementations, beginning and/or ends of rounds of game play may be tracked(e.g., by an external system). For example, a player may indicate that a round has ended and/or begun through an interface of a card device, deck device, and/or other interface. As another example, movement and/or actions occurring at card devices may be used to determine that a round of a game has ended (e.g., when all players stand in a game of blackjack)., 895594=Yet another example of wireless power is described in U.S. patent publication umber 2009/0058361, which is hereby incorporated herein by reference., 331750=Unlike some other casino games, in which one play has no influence on any subsequent play, a hand of Blackjack removes those cards from the deck. As cards are removed from the deck, the probability of each of the remaining cards being dealt is altered (and dealing the same cards becomes impossible). If the remaining cards have an elevated proportion of 10-value cards and Aces, the player is more likely to be dealt a natural, which is to the player's advantage (because the dealer wins even money when the dealer has a natural, while the player wins at odds of 3:2 when the player has a natural). If the remaining cards have an elevated proportion of low-value cards, such as 4s, 5s and 6s, the player is more likely to bust, which is to the dealer's advantage (because if the player busts, the dealer wins even if the dealer later busts)., 407889=In one embodiment, the bonding energy is controlled by operating beforehand on the microroughness of the faces to be assembled. There is deposited onto one of the glass layers before bonding a layer of one or more oxides (for example SiO.sub.2) the microroughness of which is adjusted. The person skilled in the art knows how to adjust the microroughness, by modifying the thickness of the deposited layer and/or using a specific chemical treatment (for example attack with hydrofluoric acid HF). If the oxide used is SiO.sub.2, the person skilled in the art can further opt to apply or not heat treatment to impart to the SiO.sub.2 layer the properties of thermal silica (see for example the paper “Bonding energy control: an original way to debondable substrates”; in Semiconductor Wafer Bonding: Science, Technology and Applications VII, Bengtsson ed, The Electrochemical Society 2003, p. 49, given at the Paris conference of the Electrochemical Society in May 2003)., 326013=After all players have played their hands, the dealer then reveals the dealer's hole card and plays his hand. According to house rules (the prevalent casino rules), the dealer must hit until he has a point total of at least 17, regardless of what the players have. In most casinos, the dealer must also hit on a “soft” 17 (e.g., an Ace and 6). In a casino, the Blackjack table felt is marked to indicate if the dealer hits or stands on a soft 17. If the dealer busts, all remaining players win. Bets are normally paid out at odds of 1:1., 938252=In some embodiments, a same, different, and/or no advertisement may be placed on one or more other card devices (e.g., 1001) associated with a single player as desired. In other implementations, only one advertisement may be placed on card devices associated with the player. For example, in the illustrated embodiments, only card device 1003 includes an advertisement. In some implementations, an external system may determine which of a plurality of card devices associated with a player that may match criteria for an advertisement to place the advertisement on. For example, the central system may determine that a closest card device to a player location, a highest card device, a card device displaying a highest card value, a last dealt card device, a card device determined to be most visible to one or more players, a card device displaying a particular value, and so on should display the advertisement. For example, in the illustrated example, card device 1003 is partially obscuring card device 1001. Accordingly, the system may determine that the advertisement should be displayed on card device 1003. Determining location of card devices is discussed above, and may be used to determine if one card device is obscuring another card device (e.g., determine if two cards have a similar location but one is higher than another)., 324243=A two-card hand with a point value of 21 (i.e., an Ace and a face card or a 10) is called a “Blackjack” or a “natural” and wins automatically. A player with a “natural” is conventionally paid 3:2 on his bet, although in 2003 some Las Vegas casinos began paying 6:5, typically in games with only a single deck., 330845=Other optional rules can be detrimental to a skilled player. For example: if a “natural” pays less than 3:2 (e.g., Las Vegas Strip single-deck Blackjack paying out at 6:5 for a “natural”); if a hand can only be split once (is re-splitting possible for other than aces); if doubling down is restricted to certain totals (e.g., 9 11 or 10 11); if Aces may not be re-split; if the rules are those of “no-peek” (or European) Blackjack, according to which the player loses hands that have been split or “doubled down” to a dealer who has a “natural” (because the dealer does not check for this automatically winning hand until the players had played their hands); if the player loses ties with the dealer, instead of pushing where neither the player or the dealer wins and the player retains their original bet., 866071=An advantage of a network 10 with dual (or multiple, discussed below) RF power transmitters 12 a, 12 b is that the network 10 distributes loss along the transmission line 18 rather than concentrating the loss at one end (as with a single input series network 10). Another advantage is that less power is needed for each RF power transmitter 12 a, 12 b. For example, a single transmitter 12 a could input 1000 W, or two transmitters 12 a, 12 b could input 500 W each. The two inputs of 500 W would be the cheaper network 10, in terms of power and component costs, etc. The RF power transmitters 12 a, 12 b may have different power levels if found to be advantageous., 929265=In some embodiments, an external system (e.g., 503) may determine that the card device should display an initial card value in normal play (e.g., based on a random number generator, lookup table, etc.) and control the card device to display the initial value. The external system may determine that the initial value should be changed to the replacement value regardless of the value that was determined for normal play (e.g., not based on a random number generator, not based on a predetermined card value ordering, taken out of order, etc.). The external system may control the card device to display the replacement value. The determination may be made based on characteristics of a player, an amount of a bet, a promotion, a desire of an advertiser, and so on. For example, an advertiser may desire to engage in an advertisement campaign that involves improving hands of players (e.g., players of a particular type, players of a particular game, at a particular time, etc.). The advertiser may instruct the external system to engage in such behavior (e.g., through an interface with an advertising server, by submitting a set of criteria describing when such behavior should take place). The external system may determine that the card device 1005 meets criteria for such a change and may instruct the card device 1005 to carry out the change. The advertiser may be charged for such a change., 327158=Insurance is a commonly-offered betting option in which the player can hedge his bet by wagering that the dealer will win the hand. If the dealer's “up card” is an Ace, the player is offered the option of buying Insurance before the dealer checks his “hole card.” If the player wishes to take Insurance, the player can bet an amount up to half that of his original bet. The Insurance bet is placed separately on a special portion of the table, which is usually marked with the words “Insurance Pays 2:1.” The player buying Insurance is betting that the dealer's “hole card” is one with a value of 10 (i.e., a 10, Jack, Queen or King). Because the dealer's up card is an Ace, the player who buys Insurance is betting that the dealer has a “natural.”, 974781=It should be recognized that the example interface 2303 is given as a non limiting example only and that other embodiments may include any desired interface for use with any desired game., 932200=In some embodiments, rather determining the initial card value as if it were in normal play, the external system may determine the replacement value as if it were in normal play (e.g., based on random number generator, lookup table, next card from a predetermined ordering of card values, etc.). The system may determine that the replacement value and other criteria (e.g., player profile, amount wagered, time, etc.) meet an advertiser's requirement for providing a change to a card value. Rather than displaying the replacement card value, the system may cause the card device 1005 to display an initial card that would not have otherwise been presented (e.g., not based on normal play, not based on a random number generator, etc.). In such an implementation, the system may cause an initial less favorable hand value that would not have occurred in normal play without the advertiser intervening and then cause a card value to change to the card value that would have been provided under normal circumstances. The player may not know that such a value would have occurred and therefore may still attribute any positive reaction to the change to the advertiser., 945545=It should be recognized that customization may include any element of a card device as desired in various embodiments. For example, elements to be displayed may be added, removed, and/or modified as desired. Some example customizations may include an addition of a direction indicator, an addition of a action recommendation indicator, an arrangement of card value indications as shown in card device 1301, a change in font size, a change in font, a change in colors, and so on., 566794=As used herein, the term “color-point” refers to a certain coordinate in a chromaticity diagram, for example a (x,y)-coordinate in the 1931 CIE standard diagram or (u′,v′)-coordinate in the 1976 CIE standard diagram., 973944=The illustrated example interface 2303 includes options for playing a draw poker game. As illustrated the interface 2303 includes options (e.g., buttons 2305, 2307, 2309, 2311, and 2313) for holding each of five card values which may each be displayed on respective card devices proximate to the deck device 2301. A player may select which cards to hold in a hand by operating the respective buttons. Each card device may include an identifier so that a player may know which card device corresponds to which button. As illustrated the interface 2303 includes an option to deal next cards in the game (e.g., button 2315). After selection of button 2315, replacement card values may be assigned to unheld card devices., 567053=As used herein, the term “white light” refers to light having a color point inside the area of “white” light as defined in, for example, the 1931 or 1976 CIE standard diagram. As used herein, the term “OLED” refers to all light emitting diodes (LEDs) based on organic electroluminescent compounds, such as light emitting materials based on electroluminescent small organic molecules (smOLED), polymers (polyLED), oligomers and dendrimers. Examples of suitable substrates include, but are not limited to glass and transparent plastic substrates. Plastic substrates are attractive alternatives when suitable, because they are lightweight, inexpensive and flexible, among other advantages. The anode is arranged on the substrate and may be of any suitable material known to those skilled in the art, such as indium tin oxide (ITO)., 726728=A 2 cm.times.2 cm cell was printed using a 2 cm.times.2 cm faced, smooth rubber pad into a sheet of standard office bond paper and a sheet of polyester film (each having an approximate thickness of about 0.07-0.08 mm). The impact of printing stock were negligible on cell performance, but were noticeable on drying times which were accelerated using forced hot air (e.g., from a hair dryer). Three ink suspensions were prepared. First, a conductive ink suspension was made. This suspension consisted of 79% weight of conductive carbon (particle size <0.1 .mu.) in an acrylic binder (Rohm & Haas HA-8 acrylic binder). A positive electrode (cathode) ink suspension was made. This suspension consisted of 96+% weight of manganese dioxide (particle size <0.4 .mu.) in an acrylic binder (Rohm & Haas HA-8 acrylic binder). A negative electrode (anode) ink suspension was made. This suspension consisted of 96+% weight of zinc powder (particle size <0.3 .mu.) in an acrylic binder (Rohm & Haas HA-8 acrylic binder). The cell had an overall thickness (including the base sheet) of about 0.4 mm. The cell had a ‘no load’ voltage of about 1.4 volts; a continuous current density of about 0.09 mA/cm.sup.2 (the curve is relatively linear and has a flat discharge curve); a capacity of about 2-3 nAh/cm.sup.2; a maximum capacity (not sustainable for over 2 milliseconds) of about 6 mA/cm.sup.2; an internal resistance (at near discharge) of 3.75-5 ohms/cm.sup.2; and an internal resistance (at outset, first 1 minute of use at 0.16 mA drain rate) of 4 ohms.”, 391743=Some methods of thwarting card counters include using a large number of decks. Shoes containing 6 or 8 decks are common. The more cards there are, the less variation there is in the proportions of the remaining cards and the harder it is to count them. The player's advantage can also be reduced by shuffling the cards more frequently, but this reduces the amount of time that can be devoting to actual play and therefore reduces the casino profits. Some casinos now use shuffling machines, some of which shuffle one set of cards while another is in play, while others continuously shuffle the cards. The distractions of the gaming floor environment and complimentary alcoholic beverages also act to thwart card counters. Some methods of thwarting card counters include using varied payoff structures, such Blackjack payoff of 6:5, which is more disadvantageous to the player than the standard 3:2 Blackjack payoff., 915614=In this example implementation, a player may be dealt an initial set of card devices for a hand in a round of a game (e.g., 1001 and 1003) by a dealer. In some implementations, card devices forming a hand of the player may be tracked as they are dealt to the player (e.g., by an external system such as system 503). In some implementations, as described above, a dealer at table 601 may deal card devices 1001 and 1003 to the player. In some implementations, as the card devices 1001 and 1003 enter a player area associated with the player, they may be assigned to a hand that is associated with the player by an external system (e.g., system 503). In some implementations, a dealer may assign the card devices to the hand (e.g., through a dealer interface in communication with an external system). In some implementations, rounds of game play may be tracked as they begin and/or end (e.g., by an external system such as system 503). In some implementations, a dealer may indicate that a new round of the game has begun before dealing the card devices (e.g., through a dealer interface in communication with an external system). In some implementations, an external system may determine that a new round of the game has begun based on an ending of a previous game round (e.g., all players stand in a game of blackjack) and/or movement of previously dealt card devices (e.g., a collection by the dealer)., 569033=A device of the present invention may further in some embodiments comprise an electron transporting and injecting buffer layer, located between the cathode and the light emitting layer, as such layers in some embodiments may improve the functionality of the device. Examples of suitable materials having electron injecting and/or transporting functionality includes, but are not limited to TPBI: 2,2′,2″-(1,3,5-benzenetriyl)tris[1-phenyl-1H-benzimidazole], DCP: 2,9 dimethyl-4,7-diphenyl-phenantroline, TAZ: 3-phenyl-4-(1′naphtyl)-5-phenyl-1,2,4-triazole and OXD7: 1,3-bis(N,N-t-butyl-phenyl)-1,3,4-oxadiazole. More examples of such materials are described in Adv. Mater. 16 (2004) 1585-1595 and Appl. Phys. Lett. (2002) 1738-1740., 818251=F. Example Areas at which Card Devices May Be Used, 940206=A direction indicator 1203 may identify a direction of a desired person, thing, place, etc. The direction indicator may be associated with the advertisement 1201 as illustrated and/or may be unassociated with the advertisement 1201. For example, the direction indicator 1203 may point to a box office where a player may purchase tickets for the show advertised, may point to a location where a player may purchase a product advertised, and so on. In other implementations where the direction indicator is not associated with an advertisement, the indicator may indicate, for example where a waiter is located, where a store is located, where a restaurant is located, where a another player is located, and/or where any other person, place, or thing is located. For example, a direction indicator may indicate a direction of something a player requests that it indicate (e.g., through a user interface, through a dealer, etc.), something an external system desires to indicate to the player (e.g., based on events, user information, etc.), and so on. For example, as discussed below a card device may be customizable and/or may include an interface through which a user may request certain elements (e.g., a direction indicator pointing to something). As discussed above, location and/or orientation information may be determined based on elements of a card device and/or of an external system., 799525=E. Example Table at which Card Devices May Be Used}",
    "textBeforeTable": "Patent Citations It should be understood that various examples are described herein that may be used in various embodiments in any combination. Examples are given as non-limiting examples and other embodiments may include some, all or none of the features, elements, and/or actions described. For example, other embodiments may include different sized devices (e.g., trading card sized, paper sheet sized, etc.), different games (e.g., poker games, collectible card games, etc.), and so on. 4. Miscellaneous It should be recognized that while various embodiments herein are described with respect to card devices, that other embodiments may be implemented with other devices. For example, in some embodiments, one or more cellular telephones, cordless telephones, wireless gaming devices, display screens, ebook readers, PDAs, MP3 players, and so on may be used. Such devices may be used in any number and/or combination in various embodiments. For example, such devices may be used to play games as described above with respect to card devices. 3. Various Devices It should be recognized that various examples of wagering may take place involving a card device as desired in various embodiments. In some implementations, for example, a wager on a game that is played on a card device may be made without use of the card device. For example, such a wager may be made using chips at a table. In response to determining",
    "textAfterTable": "US20110105224 * May 5, 2011 Partygaming Ia Limited System And Process For Stacking Electronic Game Tables US20110124397 * May 26, 2011 Gingher Robert G System and method for substantially removing chance from a mixed contest of chance and skill US20120040753 * Apr 21, 2011 Feb 16, 2012 E Ink Holdings Inc. Electronic game apparatus US20130203469 * Feb 3, 2012 Aug 8, 2013 Eunhyung Cho Split keyboard modification for a pull-out flexible display CN102614660A * Feb 1, 2011 Aug 1, 2012 元太科技工业股份有限公司 电子游戏装置 * Cited by examiner Classifications U.S. Classification 463/16, 463/22, 463/31 International Classification A63F13/00, A63F9/24 Cooperative Classification G07F17/3258, G07F17/3232,",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}