{
    "relation": [
        [
            "Citing Patent",
            "US6765472 *",
            "US6839622 *",
            "US7005959 *",
            "US7069119",
            "US7518489",
            "US7786892 *",
            "US8077011 *",
            "US8264324 *",
            "US20040073340 *",
            "US20040078135 *",
            "US20040183714 *",
            "US20090289759 *"
        ],
        [
            "Filing date",
            "Dec 19, 2000",
            "Sep 25, 2003",
            "May 30, 2003",
            "Oct 7, 2003",
            "Jan 19, 2006",
            "Apr 11, 2003",
            "Mar 1, 2007",
            "Jun 26, 2007",
            "Oct 7, 2003",
            "Sep 25, 2003",
            "Feb 27, 2004",
            "Jun 26, 2007"
        ],
        [
            "Publication date",
            "Jul 20, 2004",
            "Jan 4, 2005",
            "Feb 28, 2006",
            "Jun 27, 2006",
            "Apr 14, 2009",
            "Aug 31, 2010",
            "Dec 13, 2011",
            "Sep 11, 2012",
            "Apr 15, 2004",
            "Apr 22, 2004",
            "Sep 23, 2004",
            "Nov 26, 2009"
        ],
        [
            "Applicant",
            "Valeo Securite Habitacle",
            "Denso Corporation",
            "Fuji Jukogyo Kabushiki Kaisha",
            "Honda Giken Kogyo Kabushiki Kaisha",
            "Honda Motor Co., Ltd.",
            "Somfy Sas",
            "Denso International America, Inc.",
            "Calsonic Kansei Corporation",
            "Honda Giken Kogyo Kabushiki Kaisha",
            "Denso Corporation",
            "Shuji Yamashita",
            "Nobuaki Tsuchiya"
        ],
        [
            "Title",
            "Security system for a motor vehicle opening leaf equipped with switches",
            "Vehicle control system",
            "Key-less entry system for vehicle",
            "Remote control device for vehicles",
            "Method and system for remote immobilization of vehicles",
            "Method for interpretation of a radio-electrical command",
            "Apparatus for automatically initiating sequence of vehicle functions",
            "Keyless device of vehicle",
            "Remote control device for vehicles",
            "Vehicle control system",
            "Vehicular remote control system",
            "Keyless Device of Vehicle"
        ]
    ],
    "pageTitle": "Patent US6538559 - Remote control apparatus and remote control method - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US6538559?ie=ISO-8859-1&dq=4052565",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 6,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988840.31/warc/CC-MAIN-20150728002308-00079-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 479815279,
    "recordOffset": 479793937,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{20656=The disclosure of Japanese Patent Application No. HEI 10-256743 filed on Sep. 10, 1998 including the specification, drawings and abstract is incorporated herein by reference in its entirety. This invention also relates to a remote control method.}",
    "textBeforeTable": "Patent Citations While the present invention has been described with reference to what is presently considered to be a preferred embodiment thereof, it is to be understood that the present invention is not limited to the disclosed embodiment or construction. On the contrary, the present invention is intended to cover various modifications and equivalent arrangements. In addition, while the various elements of the disclosed invention are shown in various combinations and configurations, which are exemplary, other combinations and configurations, including more, less or only a single embodiment, are also within the spirit and scope of the present invention. In the aforementioned embodiment, the remote control apparatus of the present invention is applied to a motor vehicle. However, the present invention is not limited to the field of motor vehicles, but can also be applied to remote control apparatuses installed in airplanes, ships and the like. The present invention can be applied to any system equipped with a control apparatus that is capable of remotely controlling a plurality of operating machines through communication among a plurality of transmission request devices, a receiver and a mobile unit. According to the construction of the present invention, if the unlock switch of the mobile unit is pressed during the failure diagnosing mode, the operation is switched in such a manner as to transmit a request signal from another antenna (S40, S50, S60 and S70). However, the switching operation is not limited to",
    "textAfterTable": "US7005959 * May 30, 2003 Feb 28, 2006 Fuji Jukogyo Kabushiki Kaisha Key-less entry system for vehicle US7069119 Oct 7, 2003 Jun 27, 2006 Honda Giken Kogyo Kabushiki Kaisha Remote control device for vehicles US7518489 Jan 19, 2006 Apr 14, 2009 Honda Motor Co., Ltd. Method and system for remote immobilization of vehicles US7786892 * Apr 11, 2003 Aug 31, 2010 Somfy Sas Method for interpretation of a radio-electrical command US8077011 * Mar 1, 2007 Dec 13, 2011 Denso International America, Inc. Apparatus for automatically initiating sequence of vehicle functions US8264324 * Jun 26, 2007 Sep 11, 2012 Calsonic Kansei Corporation Keyless device of vehicle US20040073340 * Oct 7, 2003 Apr 15, 2004 Honda Giken Kogyo Kabushiki Kaisha Remote control device for vehicles US20040078135 * Sep 25, 2003",
    "hasKeyColumn": true,
    "keyColumnIndex": 3,
    "headerRowIndex": 0
}