{
    "relation": [
        [
            "Date",
            "Jan 15, 1997",
            "May 19, 1997",
            "Jun 5, 1998",
            "May 14, 2001",
            "Oct 23, 2001",
            "Apr 19, 2002",
            "Feb 26, 2004",
            "Mar 1, 2004",
            "Mar 8, 2004",
            "Sep 15, 2004",
            "Sep 27, 2004",
            "Jun 15, 2005",
            "Jun 17, 2005",
            "Nov 11, 2005",
            "Dec 5, 2005",
            "Sep 14, 2007",
            "Oct 9, 2007",
            "May 5, 2009",
            "Nov 12, 2009",
            "Jan 15, 2010",
            "Feb 9, 2010",
            "Feb 19, 2010"
        ],
        [
            "Code",
            "AS",
            "AS",
            "AS",
            "FPAY",
            "AS",
            "AS",
            "AS",
            "AS",
            "AS",
            "AS",
            "AS",
            "AS",
            "AS",
            "FPAY",
            "AS",
            "AS",
            "AS",
            "AS",
            "FPAY",
            "AS",
            "AS",
            "AS"
        ],
        [
            "Event",
            "Assignment",
            "Assignment",
            "Assignment",
            "Fee payment",
            "Assignment",
            "Assignment",
            "Assignment",
            "Assignment",
            "Assignment",
            "Assignment",
            "Assignment",
            "Assignment",
            "Assignment",
            "Fee payment",
            "Assignment",
            "Assignment",
            "Assignment",
            "Assignment",
            "Fee payment",
            "Assignment",
            "Assignment",
            "Assignment"
        ],
        [
            "Description",
            "Owner name: OSD ENVIZION, INC., A CORP. OF DE, MISSOURI Free format text: MERGER;ASSIGNOR:OSD ENVIZION, INC., A CALIFORNIA CORPORATION;REEL/FRAME:008222/0901 Effective date: 19961023",
            "Owner name: HELLER FINANCIAL, INC., A DE CORP., ILLINOIS Free format text: SECURITY INTEREST;ASSIGNOR:OSD ENVIZION, INC., A DE CORP.;REEL/FRAME:008503/0793 Effective date: 19961023",
            "Owner name: BANK BOSTON, N.A., AS AGENT, MASSACHUSETTS Free format text: SECURITY INTEREST;ASSIGNOR:OSD ENVIZION, INC.;REEL/FRAME:009214/0852 Effective date: 19980422",
            "Year of fee payment: 4",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "Owner name: JACKSON PRODUCTS, INC., MICHIGAN Free format text: RELEASE OF SECURITY INTEREST;ASSIGNOR:REGIMENT CAPITAL III, L.P.;REEL/FRAME:016135/0972 Effective date: 20050524",
            "Owner name: U.S. BANK NATIONAL ASSOCIATION, MINNESOTA Free format text: SECURITY INTEREST;ASSIGNOR:JACKSON SAFETY, LLC;REEL/FRAME:016360/0222 Effective date: 20050601",
            "Year of fee payment: 8",
            "Owner name: U.S. BANK NATIONAL ASSOCIATION, MINNESOTA Free format text: SECURITY AGREEMENT;ASSIGNORS:JACKSON PRODUCTS, INC.;SILENCIO/SAFETY DIRECT, INC.;AMERICAN ALLSAFE COMPANY;AND OTHERS;REEL/FRAME:017034/0921 Effective date: 20050601",
            "Owner name: MERRILL LYNCH CAPITAL, A DIVISION OF MERRILL LYNCH Free format text: SECURITY AGREEMENT;ASSIGNORS:JP SAFETY, INC.;JP SAFETY, LLC;AMERICAN ALLSAFE COMPANY;AND OTHERS;REEL/FRAME:019825/0122 Effective date: 20070907",
            "Owner name: JACKSON PRODUCTS, INC., MISSOURI Free format text: RELEASE BY SECURED PARTY;ASSIGNOR:U.S. BANK NATIONAL ASSOCIATION;REEL/FRAME:019930/0448 Effective date: 20070912 Owner name: JACKSON PRODUCTS, INC., MISSOURI Free format text: RELEASE BY SECURED PARTY;ASSIGNOR:THE CIT GROUP/BUSINESS CREDIT, INC.;REEL/FRAME:019930/0400 Effective date: 20070912",
            "Owner name: JACKSON PRODUCTS, INC., MISSOURI Free format text: RELEASE BY SECURED PARTY;ASSIGNOR:GE BUSINESS FINANCIAL SERVICES INC. (FORMERLY KNOWN AS MERRILL LYNCH BUSINESS FINANCIAL SERVICES INC.), AS ADMINISTRATIVE AGENT;REEL/FRAME:022634/0732 Effective date: 20090414 Owner name: JP SAFETY, INC., MISSOURI Free format text: RELEASE BY SECURED PARTY;ASSIGNOR:GE BUSINESS FINANCIAL SERVICES INC. (FORMERLY KNOWN AS MERRILL LYNCH BUSINESS FINANCIAL SERVICES INC.), AS ADMINISTRATIVE AGENT;REEL/FRAME:022634/0732 Effective date: 20090414 Owner name: AMERICAN ALLSAFE COMPANY, MISSOURI Free format text: RELEASE BY SECURED PARTY;ASSIGNOR:GE BUSINESS FINANCIAL SERVICES INC. (FORMERLY KNOWN AS MERRILL LYNCH BUSINESS FINANCIAL SERVICES INC.), AS ADMINISTRATIVE AGENT;REEL/FRAME:022634/0732 Effective date: 20090414 Owner name: J.P SAFETY, LLC, MISSOURI Free format text: RELEASE BY SECURED PARTY;ASSIGNOR:GE BUSINESS FINANCIAL SERVICES INC. (FORMERLY KNOWN AS MERRILL LYNCH BUSINESS FINANCIAL SERVICES INC.), AS ADMINISTRATIVE AGENT;REEL/FRAME:022634/0732 Effective date: 20090414",
            "Year of fee payment: 12",
            "Owner name: JACKSON PRODUCTS, INC., MISSOURI Free format text: MERGER;ASSIGNOR:OSD ENVIZION, INC.;REEL/FRAME:023796/0736 Effective date: 19990920",
            "Owner name: KIMBERLY-CLARK CORPORATION,TEXAS Free format text: MERGER;ASSIGNOR:JACKSON PRODUCTS, INC.;REEL/FRAME:023915/0082 Effective date: 20091231",
            "Owner name: KIMBERLY-CLARK WORLDWIDE, INC.,WISCONSIN Free format text: DECREE OF DISTRIBUTION;ASSIGNOR:KIMBERLY-CLARK CORPORATION;REEL/FRAME:023963/0123 Effective date: 20091231 Owner name: KIMBERLY-CLARK WORLDWIDE, INC., WISCONSIN Free format text: DECREE OF DISTRIBUTION;ASSIGNOR:KIMBERLY-CLARK CORPORATION;REEL/FRAME:023963/0123 Effective date: 20091231"
        ]
    ],
    "pageTitle": "Patent US5751258 - Liquid crystal lens driver electronics for eye protection, high speed ... - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US5751258?dq=5,815,488",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 9,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987174.71/warc/CC-MAIN-20150728002307-00148-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 457494659,
    "recordOffset": 457447822,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{28540=This is a continuation-in-part of copending, commonly assigned U.S. patent application Ser. No. 07/674,850, filed Mar. 25, 1991, the entire disclosure of which hereby is incorporated by reference., 31078=A shutter system which may employ such an exemplary liquid crystal shutter is disclosed in copending, commonly owned U.S. patent application Ser. No. 07/653,661 filed Feb. 8, 1991, for \"Eye Protection System For Welding Helmets And The Like\". The present invention is useful to provide electrical power and to operate such a shutter system., 28283=This application is a continuation of application Ser. No. 08/027,235 filed on Feb. 17, 1993 now abandoned which is a continuation-in-part of U.S. patent application Ser. No. 07/674,850 filed on Mar. 25, 1991 now U.S. Pat. No. 5,252,817., 107261=The sensor circuit 519 includes a pair of photosensitive or photodetector circuits which provide an input signal to integrated circuit 527 that detect incidence of welding light on the photodetector. These input signals are used to determine the state of the outputs to the liquid crystal shutter 10. The details of operation of the sensor circuit 519 are described in commonly assigned, copending U.S. patent application Ser. No. 07/814,372, filed Dec. 26, 1991, the entire disclosure of which is incorporated herein by reference. Briefly, each detector circuit 200' includes a transistor 17 for sensing the incident light. A sensitivity feedback circuit 780 controls the bias voltage provided to the phototransistor 17 and enables the shutter 10 to have a wide range of operation spanning dark and bright ambient light conditions. A threshold feedback circuit 782 controls the level of the threshold voltage provided to a comparator 786. The comparator 786 compares the output of the phototransistor 17 to the threshold voltage. When the output of the phototransistor 17 exceeds that of the threshold voltage, thereby indicating that welding has occurred, the output of the comparator 786 goes low causing the output of NAND gate 788 to go high.}",
    "textBeforeTable": "Patent Citations From the foregoing it will be appreciated that the power supply circuit 14 and the alternate power supply circuit 500 are useful in energizing a variable retarder 11 in a welding lens shutter 10 used, for example, in a welding helmet or other eye protecting or device protecting apparatus. STATEMENT OF INDUSTRIAL APPLICATION Preferably the mounting mechanism 613 for mounting the potentiometer in the opening 608 is universal; and preferably the opening 608 can be formed at virtually any convenient location in the wall 610 of the welding helmet 1. Therefore, the user of the welding helmet may decide the most convenient location in the welding helmet for her or him to mount the potentiometer 564, can drill an opening 608 there, can mount the potentiometer in the opening, and can connect the cable connector 612 between the potentiometer and the connector 603. Alternatively, the potentiometer 564 can be mounted in the welding helmet 1 during the initial manufacturing thereof. A connector 603 mounted in the case 601 provides an electrical connection to the fine tuning circuit 523 and to the lines 605, 606, 607 (FIG. 3) thereof in the power supply circuit 500. The potentiometer 564 of the fine tuning circuit 523 is mounted in an opening 608 in a wall 610 of the welding helmet 1 to permit adjustment of the potentiometer 564 from outside of the helmet, e.g., by the welder",
    "textAfterTable": "Sep 11, 1998 Jul 30, 2002 Nec Corporation Display driving apparatus having variable driving ability US6483090 Dec 17, 1999 Nov 19, 2002 Otos Co., Ltd. Glare protecting device and method of controlling thereof US6552316 Dec 17, 1999 Apr 22, 2003 Otos Co., Ltd. Glare protecting device utilizing both optical and non-optical detectors and method of controlling thereof US6614409 * Nov 22, 2000 Sep 2, 2003 Otos Co., Ltd. Glare shielding device of welding helmet and method of controlling the same US6796652 Sep 15, 2000 Sep 28, 2004 Optrel Ag Glare-protection device with a screened evaluation circuit US6815652 Sep 11, 2000 Nov 9, 2004 Jackson Products, Inc. Low power phototransistor-based welding helmet providing reduced sensitivity to low intensity light and sharp phototransistor response to high intensity light US6841772 May 3, 2002 Jan 11, 2005 Jackson Products, Inc. Eye-protection device having dual high voltage switching US6855922 * Apr 19, 2004",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}