{
    "relation": [
        [
            "Citing Patent",
            "US7298926 *",
            "US7339576 *",
            "US7471328 *",
            "US7616247 *",
            "US7714871 *",
            "US7730422 *",
            "US7814419 *",
            "US7840909 *",
            "US8365085 *",
            "US8437805 *",
            "US8497879 *",
            "US8851986 *",
            "US20040165087 *",
            "US20040211282 *",
            "US20040227745 *",
            "US20100238197 *"
        ],
        [
            "Filing date",
            "Aug 15, 2005",
            "Mar 12, 2004",
            "Mar 10, 2005",
            "Feb 13, 2004",
            "Dec 16, 2004",
            "Jan 25, 2006",
            "Nov 26, 2003",
            "Nov 20, 2006",
            "Apr 13, 2004",
            "Mar 28, 2006",
            "Mar 5, 2010",
            "Apr 24, 2007",
            "Feb 13, 2004",
            "Apr 13, 2004",
            "Mar 12, 2004",
            "Mar 5, 2010"
        ],
        [
            "Publication date",
            "Nov 20, 2007",
            "Mar 4, 2008",
            "Dec 30, 2008",
            "Nov 10, 2009",
            "May 11, 2010",
            "Jun 1, 2010",
            "Oct 12, 2010",
            "Nov 23, 2010",
            "Jan 29, 2013",
            "May 7, 2013",
            "Jul 30, 2013",
            "Oct 7, 2014",
            "Aug 26, 2004",
            "Oct 28, 2004",
            "Nov 18, 2004",
            "Sep 23, 2010"
        ],
        [
            "Applicant",
            "International Business Machines Corporation",
            "Sony Corporation",
            "Samsung Techwin Co., Ltd.",
            "Canon Kabushiki Kaisha",
            "Lg Electronics Inc.",
            "Microsoft Corporation",
            "Nokia Corporation",
            "Samsung Electronics Co., Ltd",
            "Samsung Electronics Co., Ltd.",
            "Research In Motion Limited",
            "Ricoh Company, Limited",
            "Nintendo Co., Ltd.",
            "Yasuhiro Harada",
            "Young-Kook Kim",
            "Takeshi Kuroiwa",
            "Goro Katsuyama"
        ],
        [
            "Title",
            "Image size reduction method and system",
            "Information display device and information selecting and displaying method",
            "Apparatus and method for rotating image in digital camera",
            "Reproducing apparatus, image data reproducing method, program, and storage medium",
            "System and method for controlling display of mobile terminal",
            "Smart icon placement across desktop size changes",
            "Changing an orientation of a user interface via a course of motion",
            "Portable computing apparatus and processing method using the same",
            "Method of indicating functions of buttons, an image display apparatus, and an on-screen-display menu processing method",
            "Method and apparatus for transforming images to accommodate screen orientation",
            "Information processing apparatus, display processing method, and computer program product therefor",
            "Game program and game apparatus",
            "Reproducing apparatus, image data reproducing method, program and storage medium",
            "Method of indicating functions of buttons, an image display apparatus, and an on-screen-display menu processing method",
            "Information display device and information selecting and displaying method",
            "Information processing apparatus, display processing method, and computer program product therefor"
        ]
    ],
    "pageTitle": "Patent US7002604 - Screen rotation - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US7002604?dq=5,870,513",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 6,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988840.31/warc/CC-MAIN-20150728002308-00038-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 476234075,
    "recordOffset": 476216157,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Patent Citations While this invention has been particularly shown and described with references to preferred embodiments thereof, it will be understood by those skilled in the art that various changes in form and details may be made therein without departing from the scope of the invention encompassed by the appended claims. embodiment. FIG. 7 , each mode 80, 82, 84, and 86 has a respective associated graphics library 64 which contains the functions used to draw the image 50 directly to the display screen 30 in the corresponding orientation. Each set of functions is pregenerated through the systems composite code for the associated viewing mode 80, 82, 84, 86. For a given mode 80, 82, 84, 86, its given graphics library 64 contains the code needed to draw a subject image 50 directly to the display screen 30 according to the orientation/rotation defined by that mode. The on-screen buffer manager 118, on-screen buffer 65, and graphics driver 66 operate as described in the FIG. 7 , each of the portrait mode 82, reverse landscape mode 82, and reverse portrait mode 86 (alternate viewing modes) are based relative to the landscape mode (base viewing mode) 80. However, unlike the embodiment of FIG. 9 In another embodiment of the invention as shown in Event functions are processed as data input to the system 11. An event may occur on a",
    "textAfterTable": "US7730422 * Jan 25, 2006 Jun 1, 2010 Microsoft Corporation Smart icon placement across desktop size changes US7814419 * Nov 26, 2003 Oct 12, 2010 Nokia Corporation Changing an orientation of a user interface via a course of motion US7840909 * Nov 20, 2006 Nov 23, 2010 Samsung Electronics Co., Ltd Portable computing apparatus and processing method using the same US8365085 * Apr 13, 2004 Jan 29, 2013 Samsung Electronics Co., Ltd. Method of indicating functions of buttons, an image display apparatus, and an on-screen-display menu processing method US8437805 * Mar 28, 2006 May 7, 2013 Research In Motion Limited Method and apparatus for transforming images to accommodate screen orientation US8497879 * Mar 5, 2010 Jul 30, 2013 Ricoh Company, Limited Information processing apparatus, display processing method, and computer program product therefor US8851986 * Apr 24, 2007",
    "hasKeyColumn": true,
    "keyColumnIndex": 3,
    "headerRowIndex": 0
}