{
    "relation": [
        [
            "Date",
            "Feb 11, 1983",
            "Feb 2, 1988",
            "Sep 30, 1991",
            "Jan 29, 1996",
            "Jun 22, 1998",
            "Mar 8, 1999",
            "Feb 3, 2011",
            "Feb 4, 2011"
        ],
        [
            "Code",
            "AS",
            "FPAY",
            "FPAY",
            "FPAY",
            "AS",
            "AS",
            "AS",
            "AS"
        ],
        [
            "Event",
            "Assignment",
            "Fee payment",
            "Fee payment",
            "Fee payment",
            "Assignment",
            "Assignment",
            "Assignment",
            "Assignment"
        ],
        [
            "Description",
            "Owner name: MEAD JOHNSON & COMPANY 345 PARK AVE. NEW YORK,N.Y. Free format text: ASSIGNMENT OF ASSIGNORS INTEREST.;ASSIGNORS:DAVID, STEPHEN T.;BROOKE, DANA;REEL/FRAME:004091/0284 Effective date: 19821214",
            "Year of fee payment: 4",
            "Year of fee payment: 8",
            "Year of fee payment: 12",
            "Owner name: CREDIT SUISSE FIRST BOSTON, NEW YORK Free format text: SECURITY AGREEMENT;ASSIGNOR:KING PHARMACEUTICALS, INC.;REEL/FRAME:009257/0503 Effective date: 19980227",
            "Owner name: CREDIT SUISSE FIRST BOSTON, NEW YORK Free format text: SUPPLEMENT TO SECURITY AGREEMENT;ASSIGNOR:MONARCH PHARMACEUTICALS, INC.;REEL/FRAME:009808/0183 Effective date: 19981222",
            "Owner name: KING PHARMACEUTICALS RESEARCH AND DEVELOPMENT, INC Effective date: 20110131 Free format text: RELEASE BY SECURED PARTY;ASSIGNOR:CREDIT SUISSE AG;REEL/FRAME:025741/0564",
            "Owner name: KING PHARMACEUTICALS, INC., TENNESSEE Free format text: RELEASE BY SECURED PARTY;ASSIGNOR:CREDIT SUISSE AG;REEL/FRAME:025746/0793 Effective date: 20110131"
        ]
    ],
    "pageTitle": "Patent US4465660 - Sustained release tablet containing at least 95 percent theophylline - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US4465660?dq=U.S.+Patent+%23+5,723,324",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 9,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987174.71/warc/CC-MAIN-20150728002307-00194-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 470898011,
    "recordOffset": 470867695,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{18873=A number of sustained release theophylline products have been described in the literature and are presently commercially available. They are of two types, hard gelatin capsules, and tablets. The hard gelatin capsule products contain an aggregation of tiny beadlets which are constituted of an edible core such as a non-pariel pellet which is coated with alternating layers of active ingredient and an insoluble delayed release lipid substance. Techniques have been developed for manufacturing beadlets having various drug release rates. By employing various proportions of beadlets having different release rates in a single capsule, a composite release rate of desired duration and magnitude can be obtained. This prior art is not relevant to the present invention, but is of interest as background. It is typified by U.S. Pat. No. 3,080,294 patented Mar. 5, 1963 by Shephard, and U.S. Pat. No. 3,782,993 patented Jan. 1, 1974 by Rothgang, et al.,, 56783=The subjects were then assigned to one of two equal sized groups using a randomization schedule. One group received Product A on a dosage schedule for days 1 through 4 involving taking their medication orally at 8:00 a.m., 2:00 p.m., 8:000 p.m. and 2:00 a.m. and at 8:00 a.m. on day 5. Thos receiving Product B took their medication orally at 8:00 a.m. and 8:00 p.m. on days 1 through 4 and at 8:00 a.m. only on day 5. No medication was administered on days 6 and 7 which served for wash-out of the prior medication, and then each participant was switched to the other test product which was administered according to the foregoing every six hour or every twelve hour schedule as appropriate. All doses of medication were swallowed with 100 ml of water. Blood samples were collected as shown in the following table. In each instance the 8 a.m., 2 p.m., and 8 p.m. samples were taken prior to medication., 19841=Controlled release tablets have been prepared by tableting aggregates of beadlets of the foregoing type, or by preparing a granulation of coating the individual granules with delayed release coatings of varying release rates. U.S. Pat. No. 3,344,029 patented Sept. 26, 1967 by Berger is representative of this type of sustained release product. Sustained release tablets comprising a fatty or other insoluble matrix in which the drug substance is embedded for slow release are also known. Typical of this type are Cain, et al., U.S. Pat. No. 3,402,240 (September 1968), Costello, U.S. Pat. No. 3,062,720 (November 1962), and Hotko, et al., U.S. Pat. No. 3,456,049 (July 1969)., 20907=U.S. Pat. No. 3,279,995 patented Oct. 18, 1966 by A. F. Reid refers to a shaped pellet having a bi-concave flanged configuration which remains intact during dissolution and affords a substantially uniform surface area throughout the dissolution period. While this principal is involved with the present invention, the intricate shape referred to by Reid is not., 18580=This application is a continuation of application Ser. No. 249,787 filed Apr. 1, 1981 which is a continuation-in-part of application Ser. No. 147,429 filed May 6, 1980, both now abandoned., 42164=A single dose of one of the test tablets was administered to the subject with 100 ml of water at 8:00 a.m. of the test period. For each subject a crossover test period with the immediate release theophylline reference standard was employed. Test periods were separated by periods of one week. Blood samples of sufficient volume to deliver 5 ml of plasma were drawn immediately prior to drug administration and at 1/4, 1/2, 1, 2, 3, 4, 5, 6, 7, 8, 10, 12, 16, and 24 hours thereafter. Plasmas were analyzed for theophylline by the high pressure liquid chromatographic method of Weddele and Mason, J. Pharm. Sci., 1976 65:856. A graph was prepared of plasma theophylline concentration versus time. Areas under the curves extrapolated to infinity were determined by a standard mathematical method, and were used to calculate percentage bioavailability by comparison of the area under the curve for a test tablet with that of the immediate release reference standard., 53486=Dosage was individualized for each subject in a preliminary test dose phase in which the clearance rate and half-life of theophylline in the blood plasma following a single dose was determined. A single oral 400 mg dose of Product A was taken at about 8:00 a.m. after fasting for 12 hrs. The medication was swallowed with 100 ml of water and no chocolate, tea, coffee, coca-cola or other caffiene containing food or beverage was permitted for 24 hrs before or 24 hrs after the test dose. The subjects fasted for 2 hrs after the test dose and 5 ml blood samples were collected just prior to swallowing the test dose and 0.5, 1, 2, 3, 4, 5, 7, 9, 12 and 24 hrs after the test dose. Plasma theophylline levels were measured from each of these samples and the data were used to determine the clearance rates and the plasma half-life values. The appropriate test dose for each subject to provide a mean steady state plasma concentration of 13 mcg/ml and a peak plasma concentration of 15 mcg/ml was then calculated. The following table contains clinical information for each of the 18 participants including the dosage size determined for use in the multiple dose phase of study and a notation as to adverse drug reactions observed., 41727=Subjects fasted from bedtime of the night prior to the test day until after the 4 hr blood sample had been withdrawn. A light meal without coffee, tea, chocolate, cola beverages, butter or cream was eaten after the 4 hr sample, and again between the 10 hr and 12 hr sample collections. Participants presented to the testing unit prior to 6:00 p.m. on the day before the test day for domiciling over the next 32 hours., 46307=It is significant and surprising to note that tablet 201, a rectangular tablet having opposing bisect scores on the edge walls and opposing trisect scores on the planar faces, exhibited substantially the same in vitro dissolution rate as indicated in the foregoing table whether the intact tablet, the bisected tablet, or the trisected tablet was employed for the measurement. While co-pending application Ser. No. 024,139 filed Mar. 26, 1979 and now U.S. Pat. No. 4,215,104 patented July 29, 1980 discloses rectangular tablets scored on different faces for optional bisecting, or trisecting by manual breaking, there is no suggestion in that patent that such a design would be suitable for a controlled release tablet. However, within the narrow constraints of the present invention, trisecting or bisecting of a theophylline tablet containing from 100 to 500 mg thereof, having substantially planar faces, and a thickness of from 0.08 to 0.12 inches has no practical effect on the dissolution rate. The entire disclosures of application Ser. No. 024,139 cited above, and of related application Ser. No. 121,615 filed Feb. 14, 1980 and now U.S. Pat. No. 4,258,027 patented Mar. 24, 1981 are incorporated herein by reference.}",
    "textBeforeTable": "Patent Citations The higher values at 0 time (before the 8 a.m. dose) appear to reflect a diurnal variation in the elimination of theophylline by the body. ______________________________________Mean Theophylline Plasma Conc. (mcg/ml)HoursFollowing8 a.m. Dose Day 4 Day 5______________________________________0 10.8 10.01 11.8 11.52 13.4 12.93 14.8 14.64 15.6 15.06 14.8 13.98 13.2 11.810 11.2 10.212 9.5 8.6______________________________________ Dosing with the sustained release tablet of the present invention (Product B) every 12 hours resulted in approximately the same mean steady state and maximal plasma theophylline concentrations as did dosing with the commercial immediate release preparation (Product A) at 6 hr intervals. A greater difference between the maximal and minimal plasma concentrations was observed with Product B but this difference was not deemed to be large enough to effect the clinical performance. The areas under the plasma concentration versus time curves and the maximal theophylline concentrations observed in the blood plasma for each treatment were not statistically different. The results of this study clearly show that when Product B of the present invention when administered on a 12 hr dosage schedule results in plasma theophylline concentrations comparable to those obtained with Product A, a commercial immediate release preparation when administered on a 6 hr dosage schedule. The plasma theophylline concentrations achieved are within the generally recommended therapeutic range of 10-20 mcg/ml. To further illustrate this latter point the mean theophylline plasma concentration values achieved at the various",
    "textAfterTable": "US3632778 * Jun 10, 1970 Jan 4, 1972 Hoffmann La Roche Tablets containing l-dopa US3639169 * Apr 29, 1969 Feb 1, 1972 Sucrest Corp Direct compression vehicles and method therefor US3641236 * Jul 15, 1969 Feb 8, 1972 Delandale Lab Ltd Dosage unit sustained release oral powdered lithium salt composition for manic depressive or depressive illness prophylactic therapy US3773920 * Jul 14, 1971 Nov 20, 1973 Nikken Chemicals Co Ltd Sustained release medicinal composition US3782993 * Nov 19, 1971 Jan 1, 1974 Roehm Gmbh Method for the preparation of small medicament particles US3852421 * Sep 20, 1971 Dec 3, 1974 Shinetsu Chemical Co Excipient and shaped medicaments prepared therewith US3870790 * Oct 25, 1972 Mar 11, 1975 Forest Laboratories Solid pharmaceutical formulations containing hydroxypropyl methyl cellulose US3908003",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}