{
    "relation": [
        [
            "Candidate",
            "Benoit",
            "Delabar",
            "Robertson",
            "Scheppers",
            "Uehara"
        ],
        [
            "",
            "",
            "",
            "",
            "",
            ""
        ],
        [
            "W-L",
            "2-0",
            "5-1",
            "4-1",
            "5-1",
            "2-0"
        ],
        [
            "ERA",
            "1.69",
            "1.74",
            "2.23",
            "1.84",
            "1.88"
        ],
        [
            "SO",
            "47",
            "57",
            "46",
            "29",
            "53"
        ],
        [
            "SV-HLD",
            "8-9",
            "1-4",
            "0-21",
            "0-18",
            "6-13"
        ]
    ],
    "pageTitle": "Freddie Freeman, Steve Delabar take leads into last day of All-Star Game Final Vote | tigers.com",
    "title": "",
    "url": "http://m.tigers.mlb.com/news/article/53323728",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 1,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987034.19/warc/CC-MAIN-20150728002307-00168-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 156851167,
    "recordOffset": 156825284,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{1663=Today is the last day to cast ballots in the 2013 All-Star Game Final Vote, sponsored by freecreditscore.com. Not only can you do it online, but for six hours today, from 10 a.m. until 4 p.m. ET, you can vote on Twitter, too.}",
    "TableContextTimeStampAfterTable": "{6113=Mobile voting in the U.S. and Canada is open to everyone. In the U.S., to receive the 2013 All-Star Game Final Vote sponsored by freecreditscore.com mobile ballot, text the word \"VOTE\" to 89269. To vote for a specific player, simply text message your choice using the codes below to 89269 (Example: Text \"A1\" to vote for Benoit). In Canada, fans should text their choices to 101010. Standard message and data rates may apply. To vote for your player via text message, use the codes below., 7100=The fun doesn't end there, however. Fans, having already decided the starters and final player on each team, once again will have the opportunity to participate in the official voting for the Ted Williams Most Valuable Player presented by Chevrolet via the 2013 All-Star Game MVP Vote on MLB.com during the All-Star Game., 2905=If Puig wins the voting in the NL, he will be the first player in history to appear on an All-Star roster having played in fewer than 40 Major League games. Assuming he plays in all three remaining contests leading up to the break, he'll have appeared in 38 games for the Dodgers. In a listing in the Wall Street Journal that cites Stats LLC for the information, Frankie Zak holds the record for playing the fewest career games before a first All-Star selection. Zak played in 44 games for the Pirates in 1944.}",
    "textBeforeTable": "NL Candidates BY THE NUMBERS Hunter Pence: #VotePence; Adrian Gonzalez: #VoteTitan; Ian Desmond: #VoteDesiIn13; David Robertson: #HighSocksForVotes; Koji Uehara: #HighFiveCiti; Tanner Scheppers: #TakeTanner; Joaquin Benoit: #backbenoit; Steve Delabar: #RaiseTheBar. So if you're voting for Freddie Freeman, be sure to include #VoteFreddie. For Yasiel Puig, use #votepuig. And the rest: Any tweet that includes a designated player hashtag will be tabulated as part of the overall vote total used to determine the American League and National League winners. Fans may follow @MLB on the popular social networking service for the latest standings updates in advance of the 4 p.m. ET balloting deadline. Today is the last day to cast ballots in the 2013 All-Star Game Final Vote, sponsored by freecreditscore.com. Not only can you do it online, but for six hours today, from 10 a.m. until 4 p.m. ET, you can vote on Twitter, too. It's finally here -- the stretch run of a frenetic week-long race involving 10 worthy candidates and only two spots. The winners will head to the All-Star Game, chosen by the fans, who have taken to the voting process in unprecedented ways, dominating social media with proclamations as to why their guy should go be in New York on Tuesday. Ready. Set. Tweet.",
    "textAfterTable": "8 19 5 1.061 * Stats entering July 11 The latest update, released Thursday morning, show Delabar and Freeman maintaining their leads in the AL and NL, respectively. Yankees righty David Robertson is in second place in the AL, followed by Boston's Koji Uehara, Detroit's Joaquin Benoit and the Rangers' Tanner Scheppers. In the NL, Dodgers phenom Puig maintains control of second place, where he's been all week, followed by Hunter Pence (Giants), Ian Desmond (Nationals) and Adrian Gonzalez (Dodgers). If Puig wins the voting in the NL, he will be the first player in history to appear on an All-Star roster having played in fewer than 40 Major League games. Assuming he plays in all three remaining contests leading up to the break, he'll have appeared in 38 games for the Dodgers. In a listing in the Wall Street Journal that cites Stats LLC for the information, Frankie Zak holds the record for playing the fewest career games before a first All-Star selection. Zak played in 44 games for the Pirates in 1944. AL CANDIDATES BY THE NUMBERS Candidate W-L ERA SO SV-HLD Benoit 2-0",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}