{
    "relation": [
        [
            "",
            "Name",
            "A.C. Berzin",
            "J. L. Cohon(c)",
            "G.D. Forsee",
            "P.C. Godsoe",
            "E. E. Hagenlocker(c)",
            "C.J. Horner",
            "H.W. Lichtenberger",
            "T.E. Martin",
            "O.R. Smith",
            "R.J. Swift",
            "T.L. White"
        ],
        [
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            ""
        ],
        [
            "",
            "Fees earned or paid in cash ($)(a)",
            "100,000",
            "51,667",
            "92,500",
            "92,500",
            "54,167",
            "100,000",
            "107,500",
            "102,500",
            "107,500",
            "125,000",
            "97,500"
        ],
        [
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            ""
        ],
        [
            "",
            "All Other Compensation ($)(b)",
            "95,000",
            "55,416",
            "95,000",
            "95,000",
            "55,416",
            "95,000",
            "95,000",
            "95,000",
            "95,000",
            "95,000",
            "95,000"
        ],
        [
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            ""
        ],
        [
            "",
            "Total ($)",
            "195,000",
            "107,083",
            "187,500",
            "187,500",
            "109,583",
            "195,000",
            "202,500",
            "197,500",
            "202,500",
            "220,000",
            "192,500"
        ]
    ],
    "pageTitle": "Definitive Proxy Statement",
    "title": "",
    "url": "http://www.wikinvest.com/stock/Ingersoll-Rand_Company_(IR)/Filing/DEF_14A/2009/F2690215",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 192,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986615.83/warc/CC-MAIN-20150728002306-00142-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 814894163,
    "recordOffset": 814760050,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{420=Subject to Section 9, the total number of Shares which may be issued under the Plan is 14,000,00027,500,000 and the maximum number of Shares for which ISOs may be granted is 20% of the total number of Shares which may be issued under the Plan. Of the total available Shares which may be issued under the Plan,For Awards granted prior to June 3, 2009, not more than 25% shall be in the form of Full Value Awards. With respect to Awards granted on or after June 3, 2009, to the extent any Shares are granted as Full Value Awards, each such Share shall count as 2.05 Shares for purposes of the overall limit on Shares available for further grants under the Plan. The Shares may consist, in whole or in part, of unissued Shares or treasury Shares. The actual issuance of Shares upon the exercise of an Award or in consideration of the cancellation or termination of an Award shall reduce the total number of Shares available under the Plan, as applicable. Shares which are subject to Awards that terminate or lapsenumber of Shares available for grant under the Plan (i) in the case of Awards granted on or after June 3, 2009, with a reduction of 2.05 Shares for every Share previously granted as a Full Value Award and a reduction of one Share for every Share previously granted as an Award of Options or Stock Appreciation Rights and (ii) in the case of Awards granted prior to June 3, 2009, with a reduction of one Share for every Share previously granted as an Award. In the event all or any portion of an Award is terminated or lapses without the payment of consideration may be granted again under the Plan., the number of Shares not issued that were originally deducted for such Award pursuant to this Section 3 shall be restored and may again be used for Awards under the Plan. In the event that Shares are retained or are otherwise not issued by the Company in order to satisfy tax withholding obligations in connection with Full Value Awards (i.e. Awards other than Stock Options or Stock Appreciation Rights), the number of Shares so retained or not issued that were originally deducted for such Award pursuant to this Section 3 shall be restored and may again be used for Awards under the Plan. Shares subject to an Award under the Plan may not be available again for issuance under the Plan if such Shares are retained or otherwise not issued by the Company in order to satisfy tax withholding obligations in connection with Stock Options or Stock Appreciation Rights.}",
    "TableContextTimeStampAfterTable": "{390872=The Board of Directors recommends a vote FOR this proposal to approve the Amended and Restated Incentive Stock Plan of 2007., 591883=performance period for 2009 through 2010 which will be based on the Company\u0092s EPS growth relative to the S&P 500 Industrial Index peer group and the publicly announced Trane acquisition synergy savings. In addition, the Compensation Committee determined the 2008 PSP awards by placing primary emphasis on financial objectives in light of the current economic environment. The Compensation Committee retains the authority and discretion to make downward adjustments to the calculated PSP award amounts, either as a percentage or a dollar amount, or not to grant any award regardless of actual performance against goals., 375431=The 2007 Plan permits the payment of incentive awards in Class A common shares. A stock award may, but need not, be contingent in whole or in part upon the attainment of certain pre-established performance objectives, as described below. Shares subject to an award may be issued at the time the award is granted, or at any time thereafter, or in installments and may be subject to forfeiture as the Compensation Committee may decide., 666676=On February 12, 2009, the Compensation Committee approved incentive awards (as described above) to Mr. Henkel as follows:, 326770=Patricia Nachtigal\u0097age 62, director since 2002, 383078=The 2007 Plan may be amended, altered or discontinued by the Board of Directors at any time without shareholder approval. No such amendment, alteration or discontinuation may, however, (1) increase the total number of shares that may be issued under the Plan or change the maximum number of shares for which awards may be granted to any participant or (2) diminish the rights of a participant under any outstanding award without their consent., 215566=Securities Exchange Act of 1934, 316117=Assistant to the President and Director of Presidential Personnel from 1991 to 1993., 340758=Chairman, President and Chief Executive Officer of Applied Biosystems Inc. (a developer, manufacturer and marketer of life science systems and genomic information products) from 1995 until retirement in 2008., 662866=The Management Incentive Unit Plan (the \u0093MIU Plan\u0094) was established to provide an incentive to attract and retain top performers and to focus the attention of the participants on shareholder value. The MIU Plan has since been replaced with other long-term incentive awards. Participation is frozen and no new MIU awards under this plan have been made since 1990. The MIU Plan is a non-qualified plan that provides quarterly cash payments of dividends and accruals of Class A common share equivalents to active participants based upon the number of MIU units previously awarded to a participant. When cash dividends are paid on the Company\u0092s Class A common shares, a participant is paid a cash amount equal to one-half of the dividends the participant would have received had the participant owned one share of Class A common share for each MIU unit granted to the participant. The remaining one-half of each cash dividend is credited to an account for the participant and is converted into Class A common share equivalents which also are held in the participant\u0092s MIU account. The one-half portion of the dividend that is credited as a Class A common share equivalent is included in the pension value of accumulated benefit column of the Pension Benefits table. Following retirement, distributions of the Class A common share equivalents (and not the underlying MIUs granted to the participant) are made in cash equal to the fair market value of one share of Class A common share for each Class A common share equivalent credited to the participant\u0092s account. There are 16 active participants remaining in the MIU Plan, one of whom is Ms. Nachtigal. For the current NEOs, based on the average of their age, service and compensation history, the average replacement income generated by the MIU Plan, expressed as a percentage of pre-retirement annual cash compensation, is approximately 0.14%., 841236=2/3/2014, 306104=Chairman of Visteon Automotive Systems from 1997 to 1999., 310498=Chief Operating Officer of Textron Inc. (a multi-industry company with operations in aircraft, automotive, industrial and finance) from 1998 to March 1999., 863326=1/31/2016, 495687=Each incumbent director attended 85% or more of the total number of meetings of the Board and the committees on which he or she served during the year. The Company\u0092s non-employee directors held four independent director meetings without management present during the fiscal year 2008., 336402=Chairman, President and Chief Executive Officer of Foster Wheeler Ltd. (provider of design, engineering, construction, manufacturing, management and environmental services) from 1994 until 2001., 843444=2/6/2017, 1057606=Any proposal by a shareholder intended to be presented at the 2010 annual general meeting of shareholders of the Company must be received by the Company at the offices of Ingersoll-Rand Company at One Centennial Avenue, Piscataway, New Jersey 08855, Attn: Secretary, no later than December 23, 2009, for inclusion in the proxy materials relating to that meeting. Any such proposal must meet the requirements set forth in the rules and regulations of the SEC, including Rule 14a-8, in order for such proposals to be eligible for inclusion in our 2010 proxy statement., 980095=Pursuant to the change in control agreement, each NEO would receive a lump sum equal to his or her annual salary and AIM award for the completed fiscal year for which payout has not occurred. In addition, upon his or her termination of employment within two years following a change in control, each NEO is entitled to a lump sum severance payment from the Company equal to, in the case of the Chief Executive Officer (CEO), Chief Operating Officer(COO), Chief Financial Officer (CFO) and the General Counsel, three times the sum of (a) the NEO\u0092s annual salary in effect on the termination date, or, if higher, the annual salary in effect immediately prior to the reduction of the NEO\u0092s annual salary after the change in control and (b) the NEO\u0092s target AIM award for the year of termination or, if higher, the average of the AIM award amounts beginning three years immediately preceding the change in control and ending on the termination date. In addition, each NEO is entitled to a lump sum payment equal to, in the case of the CEO, COO, CFO and the General Counsel, three times the target PSP award for the year of termination multiplied by the share price received in the change in control transaction or, if higher, the average of the three awards beginning three years immediately preceding the change in control event and ending on the termination date. For the performance period beginning in 2009, each NEO is entitled to a lump sum cash payment of the PSP award equal to either three or two and one-half times (depending on their position) of the target amount of the most recent PSP award assigned to the NEO, or if greater, the cash value of the average of the amounts of the last three PSP awards granted and paid to the NEO immediately preceding his or her termination. For Sector Presidents and Senior Vice Presidents (including Messrs. Lamach, and Bolch), the calculation to arrive at the severance and target PSP award payment is a two and one-half multiple. For all other officers, the multiple to determine the severance and target PSP award payment is two times. The officers will also be able to participate in the Company\u0092s welfare employee benefit programs for the severance period (three years for Messrs. Henkel and Shawley and Ms. Nachtigal and two and one-half years for Messrs. Lamach and Bolch). For purposes of calculating the officer\u0092s non-qualified pension benefits, three years will be added to both the officer\u0092s age and service with the Company under the EOSP Plans. For purposes of determining eligibility for post-retirement welfare benefits, the officer will be credited with any combination of additional years of service and age, not exceeding 10 years, to the extent necessary to qualify for such benefits. Subject to certain limitations, the Company would pay the excise taxes incurred by the individual as a result of the change in control payment. In February 2009, Mr. Lamach was promoted to the position of COO, and therefore his change-in-control agreement was amended at that time to reflect the three-time multiple shown above for that position. For purposes of the Post Employment Table, however, we show the value of the benefits as of December 31, 2008., 606255=The Compensation Committee also approved on October 4, 2008 the elimination of the use of the EPS factor to determine the number of stock option/RSUs that may be awarded. Stock option/RSU grants made in 2009 and thereafter will be forward-looking (based on the established market value for the job along with the individual\u0092s sustained performance measured against leadership competency-based objectives), and therefore the use of a prior year\u0092s financial metric is no longer used., 308309=Herbert L. Henkel\u0097age 61, director since 1999, 429462=The following table sets forth each shareholder which, as of April 6, 2009, is known by us to be the beneficial owner of more than 5% of the outstanding Class A common shares of the Company:, 839774=20.2657, 282119=Each director of the Company, other than Mr. Lichtenberger, is being nominated for election for a one-year term expiring at the 2010 Annual General Meeting or until their successors, if any, are elected and qualified. Mr. Lichtenberger has indicated his intention to retire from the Board of Directors, upon completion of his one-year term expiring at the start of the Annual General Meeting., 288814=Faculty member the Department of Geography and Environmental Engineering at Johns Hopkins University, where he also served as Assistant and Associate Dean of Engineering and Vice Provost for Research from 1986 to 1992., 314700=Guest Scholar at the Brookings Institution from 1993 to 2005., 538097=The continuing review and refinement of the Company\u0092s executive compensation philosophy to reflect its transformation following the acquisition of Trane Inc. in June 2008;, 849439=2/14/2018, 499450=The Director Deferral Plans are unfunded, non-qualified plans that enable non-employee directors to defer receipt of all or a part of their cash retainer and other fees. In light of the American Jobs Creation Act of 2004, a \u0093mirror plan\u0094 for the Director Deferral Plan I was created (referred to in this proxy statement as the Director Deferral Plan II). The purpose of this mirror plan is not to provide additional benefits to directors, but merely to preserve the tax treatment of the original Director Deferral Plan I, which is a plan that was in place prior to, 293233=Chairman of the Board and Chief Executive Officer of Sprint Corporation from 2003 to 2005., 283526=Chairman and Chief Executive Officer of Financial Guaranty Insurance Company (insurer of municipal bonds and structured finance obligations), a subsidiary of General Electric Capital Corporation, from 1992 to 2001., 350508=The Company\u0092s shareholders are being asked to approve the Company\u0092s Amended and Restated Incentive Stock Plan of 2007 (the \u00932007 Plan\u0094), which amends the existing plan (i) to increase the number of the Company\u0092s Class A common shares reserved for issuance under the 2007 Plan by 13,000,000 shares, (ii) to provide that net settlement shares retained by the Company in order to satisfy the tax withholding obligations of a plan participant with respect to awards other than stock options or stock appreciation rights shall not be counted against the limit set forth in Section 3 of the 2007 Plan and (iii) to provide that for all awards issued on or after June 3, 2009, each share issued in connection with awards other than stock options or stock appreciation rights shall count as the issuance of 2.05 shares for purposes of the share limit set forth in Section 3 of the 2007 Plan., 266536=You are entitled to vote if you owned the Company\u0092s Class A common shares at the close of business on April 6, 2009, which we refer to as the record date. At that time, there were 319,115,673 shares of the Company\u0092s Class A common shares outstanding and entitled to vote. Each share of the Company\u0092s Class A common share that you own entitles you to one vote on all matters to be voted upon at the Annual General Meeting., 290339=Appointed by President George W. Bush to serve on his Homeland Security Advisory Council in 2002., 592931=The 2008 PSP calculation for the other NEOs is as follows:, 379194=The 2007 Plan prohibits re-pricing of options and stock appreciation rights or the cancellation of options and stock appreciation rights in exchange for such awards with lower exercise prices. Adjustments to outstanding awards based on standard anti-dilution provisions are permitted. The amount of performance-based awards actually paid to any participant under the 2007 Plan cannot be greater than the amount determined by the applicable performance goal formula., 286570=Jared L. Cohon\u0097age 61, director since 2008, 968027=Gelly, Lamach, Shawley and Bolch and Ms. Nachtigal first became NEOs and therefore had their compensation reported in the Company\u0092s proxy statements for fiscal years 2000 (Henkel), 2007 (Gelly), 2005 (Lamach), 2007 (Shawley), 2008 (Bolch) and 2006 (Nachtigal)., 604435=On February 12, 2009, the Compensation Committee approved a change to the Company\u0092s equity grant approach whereby options would no longer be used as the primary equity vehicle for eligible participants (other than the CEO(1)), but instead a mix of options and restricted stock units (\u0093RSUs\u0094) would be utilized. The RSUs will vest ratably over 3 years and any accrued dividend equivalents will be paid in cash at the time of vesting. As a result of this change, eligible participants may receive (i) stock options, (ii) RSUs or (iii) a combination of both stock options and RSUs under the Company\u0092s Incentive Stock Plan of 2007. Those participants receiving combination grants will receive a split with 50% of the intended grant value in stock options and the balance translated into RSUs using a 1:5 conversion ratio (one RSU for every five stock options), resulting in approximately a 15% decrease in the total value of the combination grant., 840768=5/2/2010, 294690=Vice Chairman and President of BellSouth International from 2001 to 2002., 372628=Stock options and stock appreciation rights are forms of stock incentives. Neither options nor stock appreciation rights may be granted at less than the fair market value of our Class A common shares on the date of grant. The term of an option or a stock appreciation right cannot exceed ten years. The 2007 Plan prohibits amending, or canceling and re-granting, an option or a stock appreciation right to lower the exercise price., 271394=May I Revoke My Proxy?, 410303=The following table sets forth as of April 6, 2009, the beneficial ownership of our Class A common shares by (i) nominee for director of the Company, (ii) each current executive officer of the Company named in the Summary Compensation Table below, and (iii) all directors and current executive officers of the Company as a group:, 291270=President, University of Missouri System since February 2008., 269235=The internet voting procedures are designed to authenticate votes cast by use of a personal identification number. The procedures allow shareholders to appoint a proxy to vote their shares and to confirm that their instructions have been properly recorded. If you are a shareholder of record and you would like to vote by using the internet, please refer to the specific instructions contained on the enclosed proxy card. If you vote by using the internet, you do not need to return the enclosed proxy card. In order to be timely processed, an internet vote must be received by 11:59 p.m. Eastern Time on June 2, 2009., 661889=The Company established the Estate Enhancement Program in 1998 to provide a means for executive officers to accumulate estate assets through an insurance benefit. In accordance with the Estate Enhancement Program, in 1999 and 2000, Ms. Nachtigal waived her right to receive $100,000 ($200,000 in the aggregate) of distributions under the then existing PSP program. In connection with these waivers, the Company entered into an arrangement under which it purchased life insurance policies on the life of Ms. Nachtigal, the proceeds of which are payable to designees of Ms. Nachtigal. The program is designed in such a way that the cost of the life insurance policies is unlikely to exceed the cost the Company would have incurred with respect to the distributions waived by Ms. Nachtigal. Participation in this plan was frozen in 2002., 287264=President of Carnegie Mellon University since 1997 and also appointed Professor of Civil and Environmental Engineering and Professor of Engineering and Public Policy., 498282=Beginning in fiscal year 2009, non-employee directors will no longer defer compensation to the Director Deferral Plans. As such, non-employee directors who have met their share ownership requirement of 20,000 shares will receive an annual retainer of $175,000 (to be paid in either cash or Class A common shares, or a combination of both, at the option of each non-employee director). Non-employee directors who have not met their share ownership requirement of 20,000 shares will receive at least $52,500 of the $175,000 annual retainer in the form of Class A common shares and will have the option to elect to receive a higher percentage of their annual retainer in the form of Class A common shares. Director compensation relating to Committee service will remain unchanged from fiscal year 2008., 868574=standard for expensing of stock options. Therefore, options issued on or prior to December 31, 2005, were fully vested as of that date. At this same time, the terms and conditions of the stock options were changed to prohibit transfers (including sales, gifts, pledges or other transfers of any kind) of any shares acquired through the exercise of the accelerated options until the earlier of (i) the original vesting date of the option or (ii) termination of employment, retirement, death or disability., 841353=2/1/2015, 309768=President and Chief Operating Officer of the Company from April 1999 to October 1999., 831542=The Black-Scholes option pricing model, with the assumptions described above, indicated a stock option value of 27.7% ($10.79 per share) of the stock value on the date of the award ($39.00 per share). See Note 17, \u0093Share-Based Compensation\u0094, to the Company\u0092s consolidated financial statements contained in its 2008 Annual Report on Form 10-K for further assumptions made in valuing stock options., 500629=December 31, 2004. Each director is fully vested in amounts credited to the director\u0092s Deferred Compensation Account. Prior to August 1, 2007, all 2007 fiscal year distributions under the Director Deferral Plans were made in cash based on the value of the account at the time of distribution. Effective August 1, 2007, all distributions of credited amounts deemed to be invested in Class A common shares will now be settled in Class A common shares at the time of distribution rather than in cash. All distributions of credited amounts deemed to be invested in other investment options will continue to be settled in cash., 840885=1/1/2011, 928394=2008 NONQUALIFIED DEFERRED COMPENSATION, 543270=A large percentage of an executive\u0092s total compensation opportunity is contingent on, and variable with, performance. Performance is measured on: 1) actual business unit and Company financial performance against pre-established business plans (beginning in performance year 2009, part of the compensation opportunity is also based on the Company\u0092s Earnings per Share (EPS) growth relative to the S&P 500 Industrial Index) and 2) the executive\u0092s demonstrated ability to achieve Company objectives, develop and carry out strategic initiatives, contribute to both the growth and operational excellence of the Company, and demonstrate collaboration in the pursuit of a one-company culture. Total compensation can exceed the market median if performance exceeds the target. Conversely, if performance falls short of the target, total compensation can fall below the currently prevailing market median., 765356=2008 GRANTS OF PLAN-BASED AWARDS, 1157247=(E) For purposes of these guidelines the term \u0093executive officer\u0094 shall have the same meaning as the term \u0093officer\u0094 in Rule 16a-1(f) of the Securities Exchange Act of 1934., 261295=In this proxy statement, \u0093Ingersoll Rand,\u0094 the \u0093Company,\u0094 \u0093we,\u0094 \u0093us\u0094 and \u0093our\u0094 refer to Ingersoll-Rand Company Limited, a Bermuda company, or, for any information prior to January 1, 2002, to Ingersoll-Rand Company, a New Jersey corporation, which, as of that date, became an indirect, wholly-owned U.S. subsidiary of Ingersoll-Rand Company Limited., 332782=President and Chief Executive Officer of Engelhard Corporation from 1984 to 1995., 867256=Generally, options granted to all employees, including NEOs, become exercisable in three equal installments beginning one year after the date of grant. On December 7, 2005, the Compensation Committee approved the acceleration of the vesting of all outstanding and unvested stock options as a means to facilitate the implementation of a new accounting, 354470=Description of the 2007 Plan, 665128=When the Company purchased Trane in June 2008, the purchase agreement stipulated that we would maintain (for a period of no less than one year for qualified plans and two years for non-qualified plans) benefit plans that were no less favorable in the aggregate than what Trane had in place prior to the acquisition date. To honor this commitment, the Company agreed to maintain the Trane benefit plans until the end of the covenant period. No NEO is covered by a Trane plan., 501731=2008 Director Compensation, 343370=Many of our shareholders have expressed an interest in a non-binding advisory vote on the overall executive pay-for-performance compensation policies and procedures employed by the Company, as described in the Compensation Discussion and Analysis (CD&A) in this Proxy Statement. We believe that both the Company and shareholders benefit from responsive corporate governance policies and constructive and consistent dialogue. Thus, with Board of Directors\u0092 approval, the Company announced in October 2008 that the Company would provide shareholders with the right to cast an advisory vote on our compensation program at the annual meeting of shareholders in 2009., 929517=Participants can elect to defer salary that would otherwise be paid during the next calendar year and to defer the AIM and PSP program awards earned (or in the case of the PSP, awarded but unvested) in the year the deferral was made, but otherwise would have been paid or awarded in the next calendar year. Beginning with performance year 2009, participants eligible for PSP awards make their election to defer both AIM and PSP awards in the year prior to the beginning of the performance period. Participants may defer up to 50% of annual salary, up to 97% of the AIM program award and up to 100% of the PSP program award. All such deferral elections are irrevocable. Participants are offered certain investment options (approximately 90 mutual fund investments and Class A common shares), and can choose how they wish to allocate their deferrals among those investment options. Participants are 100% vested in all amounts deferred, and bear the risk of any earnings and losses on such deferred amounts., 335659=Chairman of Financial Accounting Standards Advisory Council from January 2002 until December 2006., 261779=Under our Bye-laws and Bermuda law, audited financial statements must be presented to shareholders at an annual general meeting of shareholders. To fulfill this requirement, we will present at the 2009 Annual General Meeting of Shareholders (the \u0093Annual General Meeting\u0094) our audited consolidated financial statements for the 2008 fiscal year. Copies of these consolidated financial statements are contained in our Annual Report on Form 10-K for the fiscal year ended December 31, 2008, which is being mailed to shareholders together with this proxy statement., 1069001=INCENTIVE STOCK PLAN OF 2007, 238040=Only shareholders of record as of the close of business on April 6, 2009, are entitled to receive notice of and to vote at the Annual General Meeting., 602411=For fiscal year 2008, the pre-established performance target for EPS was $3.90, while the fiscal year 2008 EPS actual performance used to calculate the PSP award was $3.34, that is, 85.6% of the enterprise business plan., 832552=OUTSTANDING EQUITY AWARDS AT DECEMBER 31, 2008, 984658=The MIU Plan follows the vesting requirements of the Pension Plan (5 years of service). Ms. Nachtigal, the only current NEO as of December 31, 2008 who participates in this plan, is vested. In addition, under the terms, 643326=The share-ownership program requires the accumulation of shares (or Class A common share equivalents) over a five-year period starting in February 2004 (or the date the person becomes subject to share-ownership requirements, if later) at the rate of 20% of the required level each year. Ownership credit is given for actual Class A common shares owned, deferred compensation that is invested in Class A common shares within the EDCP Plans, Class A common share equivalents accumulated in the qualified and non-qualified employee savings plans and RSUs that have vested as well as share equivalents awarded under the PSP Program. Neither stock options nor stock appreciation rights count towards meeting the share-ownership target. If executives fall behind their scheduled accumulation level over the five years, or they fail to maintain their required level of ownership after the five-year accumulation period, their right to exercise stock options will be limited to \u0093buy and hold\u0094 transactions until the required ownership level is achieved. As of March 31, 2009, all of the officers subject to the share-ownership guidelines were in compliance with these requirements., 592612=For fiscal year 2008, the calculation of the CEO\u0092s PSP payment is as follows:, 849557=6/3/2018, 459407=Corporate Governance Guidelines is available at our website, www.ingersollrand.com, under the heading \u0093Investor Relations\u0097Corporate Governance.\u0094 In making its determination, the Board examined relationships between directors or their affiliates with the Company and its affiliates and determined that each such relationship did not impair the director\u0092s independence. In particular, with respect to each of the most recent three completed fiscal years, the Board considered that the Company purchased products from Sprint Nextel Corporation, where Mr. Forsee served as Chairman of the Board and Chief Executive Officer until October 2007, in aggregate amounts substantially less than 1% of the revenues of each of the Company and Sprint Nextel Corporation in any such year. Consequently, the Board determined that this relationship did not affect Mr. Forsee\u0092s status as an independent director., 932314=The stock grant plan is a frozen long-term incentive plan pursuant to which participants received performance-based stock awards. Stock awards pursuant to this plan have not been awarded since fiscal year 2001. Participants had the option of electing to defer those awards until retirement. The only current NEOs in the plan are Messrs. Henkel and Shawley, who both chose to defer receipt of substantially all their stock awards. Until the time of distribution, the stock awards accrue dividends in the form of Class A common shares. These dividends are also deferred and are paid out in stock at retirement., 391897=Under Bermuda law, shareholders have the authority to appoint the independent auditors of the Company and to authorize our Board of Directors to fix the auditors\u0092 remuneration. At the Annual General Meeting, shareholders will be asked to appoint PricewaterhouseCoopers LLP (\u0093PwC\u0094) as our independent auditors for the fiscal year ending December 31, 2009, and to authorize the Board of Directors to fix the independent auditors\u0092 remuneration. PwC has been acting as our independent auditors for many years and, both by virtue of its long familiarity with the Company\u0092s affairs and its ability, is considered best qualified to perform this important function., 537347=Since the beginning of fiscal year 2008, the Compensation Committee has addressed a number of additional items, including:, 606932=2008 Stock Option Award for the CEO, 234193=NOTICE OF 2009 ANNUAL GENERAL MEETING OF SHAREHOLDERS, 1053846=The Company does not generally engage in transactions in which its executive officers, directors or nominees for directors, any of their immediate family members or any of its 5% stockholders have a material interest. Pursuant to the Company\u0092s written related person transaction policy, any such transaction must be reported to management, which will prepare a summary of the transaction and refer it to the Corporate Governance and Nominating Committee for consideration and approval by the disinterested directors. The Corporate Governance and Nominating Committee reviews the material terms of the related person transaction, including the dollar values involved, the relationships and interests of the parties to the transaction and the impact, if any, to a director\u0092s independence. The Corporate Governance and Nominating Committee only approves those transactions that are in the best interest of the Company. In addition, the Company\u0092s Code of Conduct, which sets forth standards applicable to all employees, officers and directors of the Company, generally proscribes transactions that could result in a conflict of interest for the Company. Any waiver of the Code of Conduct for any executive officer or director requires the approval of the Company\u0092s Board of Directors. Any such waiver will, to the extent required by law or the NYSE, be disclosed on the Company\u0092s website at www.ingersollrand.com or on a current report on Form 8-K. No such waivers were granted in 2008., 930649=Generally, deferred amounts may be distributed upon a termination of employment or at the time of a scheduled in-service distribution date chosen by the participant. Under the EDCP Plans, if a participant has completed 5 or more years of service at the time of termination, or is terminated due to long-term disability, death or retirement, the distribution is paid in accordance with the participant\u0092s election. If a participant terminates with less than 5 years of service and the termination is not as a result of retirement, long-term disability or death, the account balance for all plan years will be paid in a lump sum in the year following the year of termination. A participant can elect to receive distributions at termination over a period of 5, 10, or 15 annual installments, or in a single lump sum. A participant can elect to receive scheduled in-service distributions in future years that are at least 2 years after the end of the plan year for which they are deferring. In-service distributions can be received in 2 to 5 annual installments, or if no election is made, in a lump sum. For those participants who have investments in Class A common shares, the distribution of these assets will be in the form of stock, not cash. In 2008, under the transition rules of Section 409A of the Internal Revenue Code, active participants in the EDCP Plans were permitted to change the date payments of previously deferred compensation that was deferred on or after January 1, 2005 would be distributed to them., 673454=Based on our review and discussion, we recommended to the Board of Directors that the Compensation Discussion and Analysis be included in this proxy statement as well as the Company\u0092s Annual Report on Form 10-K for the year ended December 31, 2008., 882600=2008 PENSION BENEFITS, 315406=Commissioner of U.S. Commission on Civil Rights from 1993 to 1998., 660307=this benefit. In the event of death, the benefits payable to Mr. Henkel and Ms. Nachtigal would be paid to their respective estates to the extent not already paid. In the case of Mr. Henkel, the Company is a beneficiary of a life insurance policy on Mr. Henkel and, based on actuarial assumptions, the life insurance proceeds receivable by the Company will defray the costs associated with this program. Participation in the 10-Year Annuity Plan was frozen in 1999. For the current NEOs, based on the average of their age, service and compensation history, the average replacement income generated by the 10-Year Annuity Plan, expressed as a percentage of pre-retirement annual cash compensation, is approximately 1.1%., 666298=2008 Chief Executive Officer Compensation, 242929=Who May Vote?, 298351=Chairman of the Board and Chief Executive Officer of The Bank of Nova Scotia (a Canadian-based international bank) from 1995 until retirement in 2004., 603476=The Company\u0092s 2008 stock option program supports the Company\u0092s belief in the principle of pay for performance. The Company\u0092s stock option program had both a short-term and a long-term dimension. It was short term in that it is an annual plan with award size based on annual performance. It was long term in that the stock options vest one-third a year over the three years following the grant. In addition, the value created through the rising market value of our Class A common shares over the ten-year term of the options is a reflection of the effectiveness of our sustained long-term efforts. Stock options under the Company\u0092s Incentive Stock Plans are granted annually at an exercise price equal to the fair market value of Class A common shares on the date of grant and can never be issued at less than fair market value., 1077186=(k) Continuing Directors:    A director who either was a member of the Board on December 1, 2006 or who became a member of the Board subsequent to such date and whose election, or nomination for election by the Company\u0092s shareholders, was Duly Approved by the Continuing Directors on the Board at the time of such nomination or election, either by a specific vote or by approval of the proxy statement issued by the Company on behalf of the Board in which such person is named as nominee for director, without due objection to such nomination, but excluding, for this purpose, any such individual whose initial assumption of office occurs as a result of an actual or threatened election contest with respect to the election or removal of directors or other actual or threatened solicitation of proxies or consents by or on behalf of a person or entity other than the Board., 569906=The CEO\u0092s AIM opportunity for the fiscal year 2008 was based on a target award level of 175% of base salary, which for the 2008 performance period (paid in February 2009) was $2,231,250 (175% of base salary of $1,275,000). Actual awards under the program for the 2008 performance year could vary according to performance from zero to 150% of the target, in this case, up to $3,346,875. Performance is measured against pre-established objectives for three financial measures and are weighted as follows:, 353797=The following is a summary of the principal features of the 2007 Plan and is qualified in its entirety by reference to the 2007 Plan. The summary does not purport to be a complete description of all the provisions of the 2007 Plan., 840533=9/30/2009, 496899=For fiscal year 2008, non-employee directors received an annual cash retainer of $80,000. When board or committee meetings exceeded the regularly scheduled meetings (6 meetings for the Board and each Committee other than Audit, and 8 meetings for the Audit Committee) or when unscheduled planning sessions were held at the request of management, each non-employee director received an additional $2,500 for attending such meeting or session. The chair of the Audit Committee received a $30,000 annual cash retainer and the chairs of the Compensation Committee, Corporate Governance and Nominating Committee and Finance Committee each received a $10,000 annual cash retainer. Each director who served as Lead Director received, on a pro-rated basis, a $15,000 annual cash retainer and each Audit Committee member (other than the Audit Committee chair) received a $5,000 annual cash retainer. In addition, each non-employee director was credited with common share equivalents representing $95,000 in fair market value of Class A common shares for the 2008 fiscal year. The common share equivalents were credited to an account maintained for each non-employee director (a \u0093Deferred Compensation Account\u0094) in our Director Deferral Plan II (as described below)., 539680=The review and refinement of the fiscal 2009 equity award program to help manage the usage of shares, and to better align executive officer compensation with the Company\u0092s five design principles described below; and, 1070578=(a) Act:    The Securities Exchange Act of 1934, as amended, or any successor thereto., 666456=Mr. Henkel\u0092s annual salary has remained at $1,275,000 since his last increase in August 2007., 841002=1/1/2012, 316846=Deputy Secretary, U.S. Department of Health and Human Services from 1989 to 1991., 434233=The following table provides information as of December 31, 2008, with respect to the Company\u0092s Class A common shares that may be issued under equity compensation plans:, 262474=This proxy statement and the enclosed proxy card are first being mailed to you on or about April 22, 2009., 381912=The 2007 Plan has a term of ten years and is administered by the Compensation Committee which is composed of independent directors. In general, the Compensation Committee is authorized to interpret the 2007 Plan, to establish, amend and rescind any rules and regulations relating to the 2007 Plan and has full authority to establish the terms and conditions of awards consistent with the provisions of the 2007 Plan (including the authority to waive any such terms and conditions at any time). The Compensation Committee may amend the 2007 Plan as it deems necessary to permit the granting of awards to meet the requirements of the Code or other applicable law. In addition, all determinations in respect of awards to any key employee or to non-employee directors are made, based upon the recommendations of such Committee, by a committee consisting of all \u0093non-employee directors\u0094 under Rule 16b-3 under the Securities Exchange Act of 1934 and as \u0093outside directors\u0094 under Section 162(m) of the Code and the regulations promulgated thereunder., 280923=In June 2008, the company\u0092s Bye-laws were amended to change the vote standard for the election of directors from a plurality of votes cast to a majority of votes cast in uncontested elections. A majority of the votes cast means that the number of votes cast \u0093for\u0094 a director nominee must exceed the number of votes cast \u0093against\u0094 that director nominee. In contested elections, the vote standard will continue to be a plurality of the votes cast. In addition, the Bye-laws were amended to provide that if a director is not re-elected in a non-contested director election, the director shall tender his or her resignation to the Board of Directors and the Corporate Governance and Nominating Committee will make a recommendation to the Board of Directors on whether to accept or reject the resignation, or whether other action should be taken. The Board of Directors will act on the Corporate Governance and Nominating Committee\u0092s recommendation and publicly disclose its decision and the rationale behind it within 90 days from the date of the certification of the election., 1076241=(h) Code:    The Internal Revenue Code of 1986, as amended, or any successor thereto., 501890=The compensation paid or credited to our non-employee directors for the year ended December 31, 2008, is summarized in the table below:, 442575=1,850,042 shares remain available for issuance under the 2007 Incentive Stock Plan., 293968=Vice Chairman\u0097Domestic Operations of BellSouth Corporation from 2002 to 2003., 1056219=Section 16(a) of the Securities Exchange Act of 1934, as amended, requires our directors and officers, and persons who beneficially own more than ten percent of the Company\u0092s common stock, to file reports of ownership and reports of changes in ownership with the SEC and the NYSE. To the Company\u0092s knowledge, based solely on its review of such forms received by the Company and written representations that no other reports were required, all Section 16(a) filing requirements were complied with for the year 2008., 341611=Executive Vice President of Baxter International Inc. (provider of medical products and services) from 1993 to 1995., 350297=Item 3. Approval of the Amended and Restated Incentive Stock Plan of 2007, 282833=Ann C. Berzin\u0097age 57, director since 2001, 357083=The following table sets forth information with respect to grants made in fiscal year 2009 through April 6, 2009 under the 2007 Plan to each of our current Named Executive Officers, our current executive officers as a group, our current directors who are not executive officers as a group and all employees (excluding our current executive officers and directors) as a group. Restricted Stock Units (RSUs) were provided to Named Executive Officers, other than the CEO, and plan participants beginning in February 2009 to help manage the usage of shares., 854300=6/5/2018, 765516=The following table shows all plan-based awards granted to the NEOs during fiscal 2008. This table is supplemental to the Summary Compensation Table and is intended to complement the disclosure of stock option awards and grants made under non-equity incentive plans in the Summary Compensation Table., 380522=The 2007 Plan provides that in the event of a reorganization, recapitalization, split-up or consolidation of Class A common shares of, or other significant corporate transaction involving, the Company, shares subject to a stock incentive shall be equitably adjusted as to number, classification, exercise price or fair market value (in the case of stock appreciation rights) and date of exercise., 297656=Peter C. Godsoe\u0097age 70, director since 1998, 304683=Edward E. Hagenlocker\u0097age 69, director since 2008, 661153=The Senior Executive Death Benefit program was established in 1988 to provide Company officers with pre and post retirement death benefits, which had previously been provided under the Company\u0092s Group Term Life Insurance Plan. Under the Senior Executive Death Benefit program, the Company provides Mr. Henkel and Ms. Nachtigal with life insurance coverage of one times annual base salary and AIM program award (increased in certain instances to account for income tax obligations payable by the executive\u0092s estate in respect of such supplemental coverage). Participation in this plan was frozen in 1999., 244125=May I Revoke My Proxy?, 478574=The Board of Directors has determined that each member of the Compensation Committee is \u0093independent\u0094 for purposes of the applicable rules and regulations of the SEC and as defined in the NYSE listing standards. In addition, the Board has determined that each member of the Compensation Committee qualifies as a \u0093Non-Employee Director\u0094 within the meaning of Rule 16b-3 of the Securities Exchange Act of 1934 and an \u0093outside director\u0094 within the meaning of Section 162(m) of the Code., 340065=Tony L. White\u0097age 62, director since 1997, 354631=The 2007 Plan currently authorizes the issuance of up to 14,000,000 shares in connection with such stock incentives. As of April 6, 2009, the Company has made incentive awards amounting to 12,149,958 Class A common shares reserved for issuance under the 2007 Plan. As a result, 1,850,042 Class A common shares remain available for incentive awards under the 2007 Plan. This amount includes shares that have been forfeited or otherwise terminated without issuance of shares. Including the additional 13,000,000 shares that we are asking shareholders to approve for issuance under the 2007 Plan, there would be 14,850,042 shares available for issuance under the 2007 Plan, which represents approximately 4.7% of the outstanding shares as of April 6, 2009. The closing price of the Class A common shares on the NYSE composite tape on April 6, 2009 was $16.30. Shares not issued because of the termination or cancellation of individual stock incentives can be reused under the 2007 Plan., 668885=During 2008, in accordance with the policies stated above, the current NEOs named in the Summary Compensation Table, other than Mr. Henkel, were granted salary increases averaging 11.1%. Messrs. Shawley and Lamach were promoted to new positions during 2008 and therefore the increase for these NEOs is comprised of both a merit and a market increase. Annual cash incentive awards to these executives were granted based on the achievement of performance objectives of the type described above, the Company\u0092s financial performance and the contributions made by these executives. These executives were granted annual cash incentive program awards averaging approximately 51% of year-end salary. In addition, these executives were granted PSP program awards in the form of Class A common share equivalents, which will vest and be issued as Class A common shares in February 2010 (subject to continued employment if not already retirement eligible), averaging approximately 22% of year-end salary. These awards are commensurate with the extent to which the NEOs performed relative to the programs\u0092 performance objectives. We did not include Mr. Gelly in these calculations since he was only active for six months during 2008, received no salary increase and received a pro-rated PSP award for 2008., 351824=Increasing the number of the Company\u0092s Class A common shares reserved for issuance will assure that a sufficient number of shares remains available for issuance under the 2007 Plan in order to allow the Company to continue to use equity incentives to attract, retain and motivate the services of key individuals and other personnel essential to the company\u0092s long-term growth and financial success. The company relies significantly on equity incentives in the form of stock options and other stock-based awards believing that such equity incentives are necessary for the company to remain competitive in the marketplace for executive talent and other key employees. Incentive awards made to newly-hired or continuing employees are based on both competitive market conditions and individual performance. The Company has had shareholder-approved incentive compensation programs since 1959 as a means of providing long-term incentives to key executives and other key employees of the Company and its subsidiaries. The Board of Directors believes that these plans have proved to be an important means of attracting, retaining and motivating key personnel and are necessary for the Company to achieve superior performance in the future. Therefore, shareholder approval of the amendment of the 2007 Plan is vitally important., 353271=Clarifying the treatment of shares that are retained by the Company in order to satisfy the withholding obligations of a plan participant with respect to awards of other than stock options or stock appreciation rights allows the Company to conserve share usage under the 2007 Plan by counting against the share limit only those shares actually issued to plan participants in connection with such awards., 573532=For the fiscal year 2008 performance period, to a great extent influenced by the difficult economic climate facing all global companies, the actual results for EPS and ACF were below the Company\u0092s 2008 annual operating plan; however, ROE performance exceeded the annual operation plan. Based on these financial results, the Compensation Committee awarded the CEO an AIM award of $1,425,000 which was approximately 36% below the target award level established for 2008, and 53% below the actual award earned for 2007 performance., 275991=If you do not specify on the enclosed proxy card that is sent to the Company (or when giving your proxy over the internet) how you want to vote your shares, the proxy holders will vote them \u0093FOR\u0094 the election of all nominees for director as set forth under Item 1, \u0093FOR\u0094 the approval of the advisory (non-binding) proposal set forth in this proxy statement under Item 2, \u0093FOR\u0094 the approval of the Amended and Restated Incentive Stock Plan of 2007 under Item 3 and \u0093FOR\u0094 the approval of appointment of independent auditors under Item 4., 309006=Chairman of the Board (since May 2000) and President and Chief Executive Officer (since October 1999) of the Company., 331213=Orin R. Smith\u0097age 73, director since 1995, 1157542=Last Amended: February 4, 2009, 291976=Chairman of the Board (from 2006-2007) and Chief Executive Officer (from 2005-2007) of Sprint Nextel Corporation., 327468=Senior Vice President and General Counsel of the Company since 2000., 729487=The EDCP Plan II was amended in August 2, 2006 to eliminate the 20% supplemental amount. For all NEOs in prior years, the 20% supplemental amounts were included in the Restricted Stock Awards column of the Summary Compensation Table. All prior 20% supplemental amounts that had not vested as of August 2, 2006 were accelerated. The accelerated supplemental amounts consist of 20,513 shares, 3,704 shares, 10,278 shares and 7,513 shares for Messrs. Henkel, Lamach, Shawley and Ms. Nachtigal, respectively;, 569748=The CEO\u0092s 2008 AIM Award, 376210=The 2007 Plan sets forth the following performance criteria that the Compensation Committee may apply to determine the amount of performance-based awards: consolidated earnings before or after taxes (including earnings before interest, taxes, depreciation and amortization), net income, operating income, earnings per share, book value per share, return on shareholders\u0092 equity, expense management, return on invested capital, improvements in capital structure, profitability of an identifiable business unit or product, maintenance or improvement of profit margins or revenue, stock price, market share, revenues or sales, costs, available cash flow, working capital, return on assets, total shareholder return, productivity ratios and economic value added, in each case determined without regard to extraordinary items. The maximum amount of performance-based awards that may be awarded to a participant during any calendar year cannot exceed: (i) with respect to performance-based awards that are options or stock appreciation rights, 750,000 shares and (ii) with respect to performance-based awards that are not options or stock appreciation rights, $10,000,000 in value on the date of the award. In addition, the Compensation Committee can reduce, but not increase, the amount of any performance-based award payable to a participant as it deems appropriate in its discretion., 590314=As the Company previously disclosed, on October 4, 2008, the Compensation Committee approved certain changes to the Company\u0092s long-term incentive compensation programs to be implemented beginning with the 2009 performance year. Under the revised incentive compensation programs, the current one year performance period under the Company\u0092s PSP Program will be changed to three year performance periods starting with the year 2009 in order to increase the long-term nature of incentive compensation for PSP participants. In addition, PSP awards will be made based on the Company\u0092s relative EPS growth as compared to the peer group companies in the S&P 500 Industrial Index over the three year performance period. To transition between the current one year PSP program and the revised three year PSP program, there will be a one-time PSP award with a two year, 262940=We sent you this proxy statement, together with the enclosed proxy card, because our Board of Directors is soliciting your proxy to vote at the Annual General Meeting of Shareholders to be held on June 3, 2009. This proxy statement summarizes the information you need to know to vote on an informed basis., 305384=Vice-Chairman of Ford Motor Company from 1996 until his retirement in 1999., 983449=Enhanced Retirement Benefits.    An employee is vested in EOSP Plan II upon the earlier of (i) the attainment of age 55 and the completion of 5 years of service, (ii) attainment of age 62, (iii) death or (iv) change in control. A termination within two years following a change in control also triggers the payment of an enhanced benefit (as described above). Benefits under the EOSP Plans are forfeited in the event of termination for cause. In order to be eligible for an EOSP Plan benefit in the event of disability, a participant must remain disabled until age 65. An employee becomes vested in both the Pension Plan and the Supplemental Pension Plan II upon the completion of 5 years of service. To be entitled to a benefit under either the EOSP Plan I or Supplemental Pension Plan I, an employee had to have met the vesting criteria outlined above for each plan as of December 31, 2004. As of December 31, 2008, Messrs. Lamach and Bolch were not vested in the EOSP Plans, the Supplemental Pension Plans or the Pension Plan., 290576=Gary D. Forsee\u0097age 59, director since 2007, 270056=How May Employees Vote Under Our Employee Plans?, 529511=For each non-employee director at December 31, 2008, the following table reflects unexercised stock options, all of which are vested:, 354151=A marked copy of the 2007 Plan (as proposed to be amended and restated) is attached to this proxy statement as Appendix B., 257670=Appendix B\u0097Amended and Restated Incentive Stock Plan of 2007, 840651=1/2/2010, 974652=The discussion and table below describe the compensation to which each of the current NEOs would be entitled in the event of termination of such executive\u0092s employment, including termination following a change in control. The potential payments were determined under the terms of our plans and arrangements in effect on December 31, 2008. The table does not include the pension benefits or nonqualified deferred compensation amounts that would be paid to an NEO, which are set forth in the Pension Benefits table and the Nonqualified Deferred Compensation table above, except to the extent that the NEO is entitled to an additional benefit as a result of the termination., 288075=Dean of the School of Forestry and Environmental Studies at Yale University from 1992 to 1997., 966643=In the case of Messrs. Henkel and Shawley, this column also includes the value of the stock grants and accumulated dividends as of December 31, 2008, based on the average of the high and low price of the Company\u0092s Class A common shares on December 31, 2008 ($17.44). The following table reflects the amounts reported in this column that were previously reported as compensation to the NEOs in the Company\u0092s Summary Compensation Table in proxy statements for prior years. Each of Messrs. Henkel,, 247995=Item 3. Approval of the Amended and Restated Incentive Stock Plan of 2007, 496094=The Company expects all Board members to attend the annual general meeting, but from time to time other commitments prevent all directors from attending the meeting. All of the directors attended the most recent annual general meeting of shareholders, which was held on June  4, 2008., 843561=2/14/2018, 726615=the aggregate incremental cost to the Company for providing certain perquisites to the NEOs. For security and safety reasons and to maximize his availability for Company business, the Board of Directors requires Mr. Henkel to travel exclusively on Company-provided aircraft for business and personal purposes. The incremental cost to the Company of personal use of the Company aircraft is calculated based on the hourly average variable operating costs to the Company. Variable operating costs include fuel, maintenance, on-board catering and landing fees. The hourly average variable cost is multiplied by the amount of time flown for personal use to derive the incremental cost. The methodology excludes fixed costs that do not change based on usage, such as pilots\u0092 and other employees\u0092 salaries, management fees and training, hanger and insurance expenses. In 2008, the Company provided relocation benefits to Mr. Shawley, including reimbursement of household moving expenses, payment of the full appraised value of his homes and reimbursement for documented capital improvements made to his homes. In 2008, Mr. Bolch was also provided with relocation benefits, including reimbursement of household moving expenses and reimbursement of home sale and purchase closing costs. In 2007, the Company provided relocation benefits to Mr. Shawley, including reimbursement of household moving expenses, and a monthly stipend for temporary housing to Mr. Gelly. In 2006, the Company also provided relocation benefits to Mr. Henkel, including reimbursement of household moving expenses and reimbursement of home sale and purchase closing costs. The Company provides its executive officers with Company-leased cars for business and personal use. The incremental cost of the Company-leased cars is calculated based on the lease, insurance, fuel and maintenance costs to the Company. In addition, the Company provides its executive officers with (i) financial counseling services, which may include tax preparation and estate planning services, (ii) medical services through an on-site physician under the Executive Health Program and (iii) wellness reimbursement for health club memberships;, 397091=In reliance on the reviews and discussions referred to above, the Audit Committee recommended to the Board of Directors, and the Board has approved, that the audited financial statements be included in the Company\u0092s Annual Report on Form 10-K for the fiscal year ended December 31, 2008, for filing with the Securities and Exchange Commission (the \u0093SEC\u0094). The Audit Committee has selected PwC, subject to shareholder approval, as the Company\u0092s independent auditors for the fiscal year ending December 31, 2009., 841119=2/4/2013, 240230=April 22, 2009, 668716=2008 Compensation of Other Named Executive Officers, 234379=The Annual General Meeting of Shareholders of Ingersoll-Rand Company Limited will be held on Wednesday, June 3, 2009, at 2:30 p.m., local time, at Crowne Plaza Dublin\u0097Northwood located at Northwood Park, Santry Demesne, Santry, Dublin 9, Ireland, to consider and vote upon the following proposals:, 843034=43.1250, 986085=Health Benefits.    In the event of a change in control, health benefits are provided, which include the cost of both active health and welfare benefits for the severance period (three years for Messrs. Henkel and Shawley and Ms. Nachtigal and two and one-half years for Messrs. Lamach and Bolch), as well as retiree medical, if applicable. In order to qualify for retiree medical benefits, an employee must have attained age 55 and completed 15 years of service at the time of termination and must have their age and years of service as of December 31, 2002, when added together, equal 50. Pursuant to his employment agreement, Mr. Henkel is eligible for retiree medical coverage at termination. In the event of termination without cause, the NEOs who are not eligible for retiree medical coverage would receive subsidized COBRA benefits for one year. For the three retirement eligible NEOs (Messrs. Henkel and Shawley and Ms. Nachtigal) the cost of coverage under the change in control scenario is less than under the other scenarios (except death) due to the coverage under health and welfare benefits for active employees for a period of three years, which would place such NEOs at a closer point in time to eligibility for Medicare coverage, at which point Medicare becomes the primary coverage and the Company\u0092s insurance becomes secondary. In the event of death, only married, retirement eligible participants (Messrs. Henkel and Shawley) would be eligible to have health benefits extended to their beneficiaries., 388345=Restricted Stock.    Generally, a participant who receives restricted stock will recognize ordinary income at the time that the restricted stock is no longer subject to a substantial risk of forfeiture. The amount of this ordinary income will be the fair market value of the shares on that date. However a participant may elect under Section 83(b) of the Internal Revenue Code, within 30 days after the grant, to recognize ordinary income on the date of grant in an amount equal to the excess of the fair market value of the shares on that date over the amount, if any, paid for the restricted shares. By reason of such an election, the participant will have a tax basis in the restricted shares equal to the fair market value of the shares (determined without regard to the restriction imposed on the shares under the 2007 Plan) on the date of grant. If the shares are forfeited after an 83(b) election, the participant will not be entitled to a deduction, loss or credit for the ordinary income recognized or the taxes paid in respect of the election, but will generally be entitled to a capital loss for the amount, if any, paid for the restricted shares., 385070=Stock Options.    Generally, the grant of a stock option will create no tax consequences for the participant or the Company. Upon exercise of a nonqualified option (which all options granted under the 1998 and 2007 Plans have been), the participant will generally recognize ordinary income equal to the excess of the share\u0092s fair market value on the exercise date over the option exercise price. The Company generally will be entitled to a tax deduction at the same time and in the same amount. Upon exercise of an incentive stock option (as defined in the Code), no taxable income will be recognized by the participant and the Company will not be entitled to a tax deduction by reason of such exercise. However, if shares purchased pursuant to the exercise of an incentive stock, 919337=2005. The years of credited service used for calculating benefits under the EOSP Plan I and the Supplemental Pension Plan I are the years of credited service through December 31, 2004. The years of credited service used for calculating benefits under the Pension Plan, EOSP Plan II and Supplemental Pension Plan II are the years of credited service through December 31, 2008. Years of credited service is not used in the determination of the present value of benefits for the MIU Plan and the 10-Year Annuity Plan. The benefits earned under the EOSP Plan I and Supplemental Pension Plan I serve as offsets to the benefits earned under the EOSP Plan II and Supplemental Pension Plan II; that is, there is no double counting., 328181=Vice President and General Counsel of the Company from 1992 to 2000., 1078544=(m) Effective Date:    June 1, 2007., 371839=The Company intends to continue to grant equity incentives under the 2007 Plan to eligible officers and key employees. No determination has been made as to which of the persons eligible to participate in the 2007 Plan will receive awards under the 2007 Plan in the future and, therefore, the future benefits to be allocated to any individual or to various groups of eligible participants are not presently determinable., 840122=32.1825, 857680=1/1/ 2011, 399072=The following table shows the fees paid or accrued by the Company for audit and other services provided by PwC for the fiscal years ended December 31, 2008 and 2007:, 1159809=Use the Internet to transmit your voting instructions and for electronic delivery of information up until 11:59 P.M. Eastern Time the day before the meeting date. Have your proxy card in hand when you access the web site and follow the instructions to obtain your records and to create an electronic voting instruction form., 564173=companies. The program provides annual cash awards that are contingent on, and variable with, specific performance measures, associated with individual, business unit and enterprise performance. Awards can range from zero to 150% of target. As previously disclosed by the Company, the Compensation Committee in August 2008 approved a change to the AIM program under which the maximum cash incentive award was increased from 150% of the target amount to 200% of the target amount for all participants in the program, consistent with the prevailing market practices of the peer group. In addition, the financial measure weighting will change to 50% Earnings per Share (EPS) and 50% Available Cash Flow (ACF). Both these changes are applicable to AIM awards to be paid in February 2010, for performance year 2009., 266406=Who May Vote?, 311298=Vice President of Textron Inc. responsible for Textron Industrial Products Segment from 1993 to 1998., 439692=After its fiscal year end, the Company used shares available under its 2007 Incentive Stock Plan to issue annual and long-term incentive equity awards to its employees. 3,964,032 options, 921,182 restricted stock units, 1,882,482 performance stock units1 were issued. The awards reduced the number of shares currently available under the 2007 Incentive Stock Plan. As of April 6, 2009, there were:, 996897=2008 Earned But Unpaid AIM Award (a), 554235=The Compensation Committee periodically reviews and evaluates the executive officer compensation practices against the practices and pay levels of other similar companies with which we compete for executive talent. These comparisons are conducted throughout the year through a variety of methods such as: direct analysis of the proxy statements of other diversified industrial companies (see peer group below) ranging in size from approximately $11 billion to $58 billion in revenues, a review of compilations of survey data of companies of similar size in a range of industries published by several independent consulting firms, and a review of customized compensation surveys performed by independent consulting firms. No single source of information controls the decision on compensation. The Peer Group has been revised to reflect the new company makeup resulting from the two major divestitures in 2007 as well as the acquisition of Trane in June 2008. Some of the companies included in these compensation surveys are the same as those comprising the Standard & Poor\u0092s 500 Industrial Index referred to in the Company\u0092s Annual Report on Form 10-K under the caption \u0093Performance Graph.\u0094, 321086=Theodore E. Martin\u0097age 69, director since 1996, 872622=2008 OPTION EXERCISES AND STOCK VESTED, 334964=Richard J. Swift\u0097age 64, director since 1995, 243703=How May Employees Vote Under Our Employee Plans?, 501383=In December 2008, the Board determined that it would cease deferrals of compensation into its Director Deferral Plans, effective as of December 31, 2008., 314002=Constance J. Horner\u0097age 67, director since 1994, 565155=2008 Performance Targets, 356243=The 2007 Plan permits the grant of stock incentives to key employees as determined by the Compensation Committee and to all non-employee directors. Approximately 1,000 employees (approximately 2% of all employees) are currently considered eligible for the grant of stock incentives. We cannot state the value or number of shares subject to any particular stock incentive to be granted to key employees, since these matters will be determined by the Compensation Committee in the future based on the guidelines described below under the heading \u0093Compensation Discussion and Analysis\u0094. We expect, therefore, that key employees will continue to be granted stock incentives on a basis generally comparable to prior grants., 384470=Section 162(m).    Section 162(m) of the Federal income tax laws may limit our ability to deduct certain compensation payable to certain executive officers. The 2007 Plan has been designed so that we will be able to deduct the compensation payable with regard to non-qualified options as well as restricted stock or restricted stock units that will become vested upon the achievement of performance objectives, without regard to this limit., 321784=President and Chief Executive Officer of Barnes Group Inc. (manufacturer and distributor of precision springs and custom metal parts) from 1995 until retirement in 1998., 565297=For fiscal year 2008, the pre-established performance targets compared to the actual reported performance results are as follows:, 602120=As depicted above, as a result of 2008 performance being below plan, the program produced awards below their target opportunity for all current NEOS, including the CEO., 1064266=Dated: April 22, 2009, 1160409=Mark, sign and date your proxy card and return it in the postage-paid envelope we have provided or return it to Vote Processing, c/o Broadridge, 51 Mercedes Way, Edgewood, NY 11717., 552308=All equity and non-equity awards are granted at the first meeting of the Compensation Committee each year, which is usually held the first Wednesday of February. The timing of this meeting allows management to review the prior year performance and assemble all of the necessary information for the Compensation Committee\u0092s consideration. This meeting date usually follows the release of prior year earnings results. The date is not selected or changed to increase the value of stock option awards for executives. In 2009, since the Company\u0092s annual earnings release was on February 11, 2009, the Compensation Committee held a telephonic meeting on February 12, 2009 to approve the annual grant of equity awards, including stock options, which were granted and priced on February 12, 2009. This delay was intended to enable the market to assimilate the information contained in the earnings release of February 11, 2009, which is one day before the exercise price of the stock options was established., 377952=The 2007 Plan provides for equity-based awards that fall into two categories: (a) stock options and stock appreciation rights in which potential incentive compensation is based on appreciation in the value of shares (\u0093Appreciation Awards\u0094) and (b) all other stock-based awards in which the potential incentive compensation is based on the full value of shares (\u0093Full Value Awards\u0094). In recognition of the differences between these categories, the 2007 Plan limited the awards of Full Value Awards to 25% of the total number of shares authorized under the 2007 Plan. The amended 2007 Plan provides that for all awards issued on or after June 3, 2009, the 25% limit on Full Value Awards shall not apply; instead, each share issued in connection with Full Value Awards shall count as 2.05 shares for purposes of the overall share limit set forth in Section 3 of the 2007 Plan., 589680=The PSP program provides awards for the achievement of both pre-established annual financial performance (EPS) and strategic initiatives of the Company. Annual target award levels, expressed as a number of Class A common share equivalents, are established for each participant. The maximum payout opportunity is 200% of the annual target award level. The PSP awards for the 2008 performance year have a one year vesting period and the awards, once vested, are made in the form of Class A common shares., 331906=Chairman and Chief Executive Officer of Engelhard Corporation (provider of specialty chemical products, engineered materials and industrial commodities management services for various industries) from 1995 until retirement in 2000.}",
    "textBeforeTable": "  The following table shows the fees paid or accrued by the Company for audit and other services provided by PwC for the fiscal years ended December 31, 2008 and 2007: Fees of the Independent Auditors Theodore E. Martin H. William Lichtenberger Edward E. Hagenlocker Peter C. Godsoe Ann C. Berzin Richard J. Swift (Chair) AUDIT COMMITTEE In reliance on the reviews and discussions referred to above, the Audit Committee recommended to the Board of Directors, and the Board has approved, that the audited financial statements be included in the Company\u0092s Annual Report on Form 10-K for the fiscal year ended December 31, 2008, for filing with the Securities and Exchange Commission (the \u0093SEC\u0094). The Audit Committee has selected PwC, subject to shareholder approval, as the Company\u0092s independent auditors for the fiscal year ending December 31, 2009.   Table of Contents   14  ",
    "textAfterTable": "  15 Table of Contents   SECURITY OWNERSHIP OF CERTAIN BENEFICIAL OWNERS AND MANAGEMENT The following table sets forth as of April 6, 2009, the beneficial ownership of our Class A common shares by (i) nominee for director of the Company, (ii) each current executive officer of the Company named in the Summary Compensation Table below, and (iii) all directors and current executive officers of the Company as a group:   Name    Class A Common Shares(a)    ESP Shares(b)    Options Exercisable Within 60 Days(c) A.C. Berzin    4,000    \u0097      9,000 J.L. Cohon    4,240",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}