{
    "relation": [
        [
            "",
            "2011-12",
            "2012-13",
            "2013-14",
            "2014-15",
            "Total"
        ],
        [
            "gp",
            "2",
            "1",
            "2",
            "2",
            "7"
        ],
        [
            "gs",
            "0",
            "0",
            "0",
            "2",
            "2"
        ],
        [
            "min",
            "6:38",
            "2:31",
            "20:58",
            "176:23",
            "206:30"
        ],
        [
            "ga",
            "0",
            "0",
            "1",
            "1",
            "2"
        ],
        [
            "gaa",
            "0.00",
            "0.00",
            "4.29",
            "0.51",
            "0.87"
        ],
        [
            "sv",
            "0",
            "0",
            "0",
            "7",
            "7"
        ],
        [
            "sv%",
            "-",
            "-",
            ".000",
            ".875",
            ".778"
        ],
        [
            "wins",
            "0",
            "0",
            "0",
            "1",
            "1"
        ],
        [
            "losses",
            "0",
            "0",
            "0",
            "1",
            "1"
        ],
        [
            "ties",
            "0",
            "0",
            "0",
            "0",
            "0"
        ],
        [
            "shutouts",
            "0",
            "0",
            "0",
            "0",
            "0"
        ]
    ],
    "pageTitle": "Tori Graessle - Quinnipiac",
    "title": "",
    "url": "http://www.quinnipiacbobcats.com/sports/wsoc/2012-13/bios/graessle_tori_lbnu?view=splits",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 8,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986615.83/warc/CC-MAIN-20150728002306-00095-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 660018523,
    "recordOffset": 660006097,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{1969=As a Freshman in 2011: Appeared in two games with the Bobcats in a 4-2 win at Fairleigh Dickinson on Sept. 30th and a 2-0 win against Bryant on Nov. 4th., 1773=Before Quinnipiac:  Attended Millburn High School, where she was the starting goalkeeper and received four varsity letters in soccer, three varsity letters in basketball and was a member of the varsity softball team for a year… Led Millburn’s soccer team to an Essex County and Conference Championship in 2009-10… Was a State Sectional Finalist in 2009-10... Helped the varsity soccer program become Group Three State Champions as a senior... Was a member of Millburn’s basketball team who won the Conference Championship in 2010-11… Was named All-County Honorable Mention and All-Conference second team as a freshman… Was selected to the All-Conference and All-County second teams in her sophomore year… Received All-County first team honors and was selected All-Group third team as a junior… Was named All-County first team and All-Conference second team in her senior season... Received Coaches All-State honors and Star Ledger All-Essex County in 2010-11… Played for several club teams during high school, including Jersey United in 2009-11, the Millburn Magic Junior Team during the summer of 2009, the West-Windsor Plainsboro Wild in 2007-09 and the Ewing Hibernia Express in 2005-07… Was a New Jersey State Cup Semi-Finalist in 2004 and 2011… Was a US Soccer Region B Finalist in June 2009… Was a finalist in the Bethesda Tournament in November 2008 and the Donosti Cup in 2007… Also, played for the New Jersey Crusaders basketball team in 2008-10. }",
    "TableContextTimeStampAfterTable": "{36678=275 Mt. Carmel Ave. Hamden, CT 06518-1908}",
    "textBeforeTable": "Tori Graessle 0 0 Related Bios Amanda Barroca Crystal Burns Christina Cesarini Mary Rose Corrado Diana Di Muro Shauna Edwards Angela Ellison Nicole Eriksen Chrissy Fancy Natalia Grodzki Taylor Healey Casey Hutchinson Jessica Jankowski Jill Kelley Paula Kennedy Beck Kiting Shannon Larkin Jess Lavoie Aine McKeever Chacha Naito Caitlyn Shaw Jillian Strassner Ashley Wendland Kemesha Woodfine Maggie Yahn Kat Young More Quick Facts PSA Questionnaire Newsletter All-Time Records|History/Stats Archives|Coaches|News|Statistics|2015 Schedule/Results|Roster|Home IMaGinE |",
    "textAfterTable": "Year GP Goals GPG Assists APG TP PPG Graessle, Tori Fr. 2011-12 2 0 - 0 - 0 - Career Totals - - 2 0 0.00 0 0.00 0 0.00   Goalkeepers Goalies Name Class Year GP Min GA GAA Saves Shutouts Graessle, Tori Fr. 2011-12 2",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}