{
    "relation": [
        [
            "Rank",
            "1LT",
            "FO",
            "FO",
            "2LT",
            "FO",
            "TSGT",
            "SGT",
            "SSGT",
            "SGT",
            "SSGT",
            "SGT"
        ],
        [
            "Position",
            "A/C",
            "P",
            "N",
            "B",
            "Rad Ob",
            "FE",
            "RO",
            "CFC",
            "RG",
            "LG",
            "TG"
        ],
        [
            "First",
            "Paul M.",
            "Ralph M.",
            "Charles G.",
            "Charles M.",
            "Milton",
            "Harold A.",
            "Ernest E.",
            "John",
            "Madison F.",
            "Edward L.",
            "Howard H."
        ],
        [
            "Last",
            "Groves",
            "Leftwich",
            "Whippy",
            "Danek",
            "Heimer",
            "Cullen",
            "Butterfield",
            "Barnes",
            "Caldwell",
            "Cosens",
            "Olver"
        ],
        [
            "SN",
            "0-748400",
            "T-7337",
            "T-139309",
            "0-788713",
            "T-126467",
            "12004011",
            "12101658",
            "33884511",
            "14184516",
            "39618803",
            "33904961"
        ]
    ],
    "pageTitle": "The 330th Bomb Group",
    "title": "",
    "url": "http://www.rootsweb.ancestry.com/~ny330bg/crews458.htm",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 22,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987775.70/warc/CC-MAIN-20150728002307-00303-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 699247831,
    "recordOffset": 699208602,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{257498=This B-29 had a runaway prop on 16 May mission to Nagoya. Here is the recount by the A/C, Vick: \"We had a runaway prop on the #2 engine. Couldn't feather it. The vibration got so bad I lost control of the aircraft several times. Then we had an engine fire. I gave the order to bailout. All crewmembers in the rear bailed out. All chutes were seen to open. All crewmembers survived and were picked up by Navy ships except for 2LT Cohen. In an attempt to circle back to bailout those in the front of the aircraft, the reduction gears froze and the vibration stopped. The prop free rotated. We limped into Iwo Jima with an engine fire. The aircraft should have been named 'City of Iwo Jima' as we had to stop there 4 more times. Thank God for the Marines.\", 146035=Here is the same crew prior to departure for Guam. Taken in Jan 1945 at Walker, KS. Thanks to Jack Rodin (N) for the photo!, 129051=They were on what was to be their 13th Mission (Lucky Thirteen). They took off at 0210 Guam time. Their target was to be Tamashima. Minutes into flight the No. 1 engine overheated. Shortly after that the decision was made to feather and abort the mission. All bombs were salvoed in the ocean. The A/C, Carl R. Bauer asked for landing instructions at about 0315 and began to let down. The tower called for landing on the South Runway, but K-32 lined up on North Runway instead. Simultaneously, a heavy squall hit the island. About halfway down on their final approach and perhaps 100 feet above the field, the aircraft made a sudden turn left, evidently to try a go around. The aircraft never completed the full turn and stalled out above the cliff's edge near the radar antennas and went over. She crashed and burned 500 feet below. The only survivor was Lt. Wallace Howard, the 458th Squadron Gunnery Officer who replaced SGT Henry Mathis (CFC) on that one mission. Howard was riding in the TG position and was able to crawl out before the aircraft was engulfed in flames. In hind sight, the crash investigation committee recommended that in the future, any B-29 aircraft capable of remaining aloft on less than four engines should remain aloft until daylight and under no circumstances attempt a night landing. MACR # 14915. Plane was found in 1997 and the wreck was historically documented in 2002., 130701=Thought you would like to know that final IDs of all members of K-32's crew who died on 6/22/45 crash have been completed and they were interned at Arlington National Cemetery on Tuesday, May 20th, 2003., 72399=K-29's RO, SSGT Roy McLeod seen here after a mission to Gifu, July 1945., 325587=This site was last updated 07/10/2013, 279635=According to a written account from Clyde Higginson \"This plane was assigned to our crew as soon as it arrived at Guam. We flew it on about 10 of our 20 missions I flew it back to Mather Field after the war with about 25 passengers in Nov. 1945. As I recall, Vick and I shared her. It was a good Seattle built plane.\"}",
    "textBeforeTable": "Crew 810 - K-38 (44-69995) \"City of Knoxville\" aka \"Ernie Pyle\" completed 21 missions and multiple Air Medals. Here is the crew in Kansas. Front Row (L to R): FO Clinton Bailey Jr.(B), 1LT Robert Grady (Rad Ob), 2LT David Wohlgamuth (N), 2LT Donald Dubbins (P), 1LT James Walker (A/C) Back Row: SSGT Robert Reynolds (RO), TSGT Lauren McKenzie (CFC), SSGT William Millar (LG), SGT John Bauer (TG), MSGT Roy Jordan (FE), SSGT Carl Apostol (RG). Back Row L to R; SSGT John Kennedy (RG), TSGT Eugene Clark, Jr. (CFC), FO Warren Stecker (N ), 2LT Donald Olson (Rad Ob) Front L to R; SGT Charles Brown (TG), TSGT Orus Duncan (FE), SSGT Bart Pearce (RO). 37231656 Schmidt Orval Ground SGT 18039708",
    "textAfterTable": "Ground Crew SSGT Cr/Chief Vincent J. Oblocki 35303618 MSGT Ground Charles J. Chara 32005628 As promised here is the first of many photos sent by Virginia Jordan! This is 2LT Donald Dubbins (P) at his post.   Here is one of her husband MSGT Roy Jordan (FE) at his post as well. He looks about 14, but I imagine he was all of 19. Here is Crew 810 being",
    "hasKeyColumn": true,
    "keyColumnIndex": 3,
    "headerRowIndex": 0
}