{
    "relation": [
        [
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            ""
        ],
        [
            "Forum",
            "GTA V PC, Gameplay, Guides & Strategies, Help & Support This forum is dedicated to discussion about the latest installment in the series, Grand Theft Auto V.",
            "GTA IV PC, Gameplay, Episodes from Liberty City, Multiplayer, Guides & Strategies, Help & Support This section is dedicated to Grand Theft Auto IV - the ninth title in the series, released in 2008.",
            "GTA Chinatown Wars This forum is dedicated to GTA: Chinatown Wars - the tenth game in the series, and the first to be developed for Nintendo DS.",
            "GTA Vice City Stories This forum is dedicated to GTA: Vice City Stories - a prequel to GTA: Vice City, released in 2006.",
            "GTA Liberty City Stories This forum is dedicated to GTA: Liberty City Stories - the first 3D portable Grand Theft Auto title, released in 2005.",
            "GTA San Andreas Gameplay, Mission Help, Guides & Strategies, Help & Support, PC Modding This forum is dedicated to GTA: San Andreas - the fifth title in the series, released in 2004.",
            "GTA Vice City Gameplay, Guides & Strategies, Help & Support, PC Modding This forum is dedicated to GTA: Vice City - the fourth title in the series, released in 2002.",
            "GTA III Gameplay, Guides & Strategies, Help & Support, PC Modding This section is dedicated to Grand Theft Auto III - the first 3D title in the series, released in 2001.",
            "Top Down Games GTA Advance, GTA 2, GTA This section is dedicated to the 2D Grand Theft Auto titles, including the original, GTA 2, and GTA Advance.",
            "GTA Series GTA Concepts General chat related to the series. This section can also be used to post concept threads for new GTAs."
        ],
        [
            "Stats",
            "85,134 topics 2,125,253 replies",
            "85,560 topics 1,153,942 replies",
            "1,071 topics 11,070 replies",
            "4,218 topics 64,762 replies",
            "5,996 topics 75,815 replies",
            "50,548 topics 466,246 replies",
            "22,767 topics 196,313 replies",
            "4,273 topics 60,486 replies",
            "1,127 topics 8,219 replies",
            "3,605 topics 115,531 replies"
        ],
        [
            "Last Post Info",
            "GTA V and DirectX 12 By j0ffline 3 minutes ago",
            "Pixelated glass and smoke By CatsAhoy 8 minutes ago",
            "Why does this game receive... By Sayuri A day ago",
            "The Ultimate 100% Save File... By DanielH 38 minutes ago",
            "Favorite Gang By Mr. Fahrenheit 12 hours ago",
            "GTA San Andreas Remastered... By Opticork 58 minutes ago",
            "Reasons why Vice City is be... By UshaB An hour ago",
            "How Did Miguel and Catalina... By GTA_The_Series An hour ago",
            "What are the cops actually... By Cerium 3 hours ago",
            "GTA VI: Satire vs. Realism,... By thedriver111 A minute ago"
        ]
    ],
    "pageTitle": "GTAForums",
    "title": "",
    "url": "http://gtaforums.com/index.php?act=Post&CODE=06&f=226&t=509655&p=1061807154",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 1,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988650.6/warc/CC-MAIN-20150728002308-00314-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 108305207,
    "recordOffset": 108280871,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{94560=© 2001-2015 GTANet.com | Cookies and Privacy Policy | Copyright Statement, 47764=Bing, Google, ForcedFedSupra, IParadise CityI, Prywatne, Yahoo, The Hero, josephene123, Tekno_Gecko, Lay, DJ_Dribbles, Carbonox, GTA3Rockstar, Jinx., HeavyDuke, TalkingPear, Terra_S4, stratumxspb, Maddeford, Cico555, shadowski, Stoney0503, CoCkPuNcH, jrl51592, Icantthinkofonew, GTAKid667, Darrel, Starscream_910, Kiyone_Alien_Cop, SneakyPenguin91, Ethenal, Gummy14, jollythecat, emelen, Goukou, bronysplatter, Andyzoot, Gridl0k, Royal22, DVDFMerlin, fastman92, Mika_0013, autotheftgrand, Didjos, NightSpectre, AdusPL, Tycek, Masiku, dyz, TheMcSame, Sneakerhead., Met-Hörnchen, BeckermannDewitt, 533, Imnotthefiveo, crashoverride93, GTA_Matt24, XB36Hazard, raburs, silentkiller44, ZombieRambo, Tadzik, TheRealCMPUNKFan, msmel007, lulzmodder, iiConTr0v3rSYx, HulioG, B Dawg, TJGM, Outcast, Gammoudicj, DJROWIENZ, Finn 7 five 11, Excolis, Remix1994PL, kagikn, Retired Mafia, Niobium, Mona Sax, Chuck Finley, PhillBellic, Th3MaN1, REXX93, frodzet, Qazsedcftgb, joe1606, Total Failure, Jon3s, RafaelSousaSam, j0ffline, doubleg213, Google Mobile, ZEST, MagellanFall, Wscratch, The_Big_Show, Rashkovskys Shiv, U.N.K.N.O.W.N, sseebbyy, R.Rezzrax, Retrocoyote, helresa, Khaisz, Svip, Mastah, Nickyvida, Majestic81, K0ol-G-R4P, HBSanta, waters, Lester-The-Molester, Mr. Fahrenheit, MitchMaljers, xink, TwisterVictor1, novesori, BlackMilk, ten-a-penny, VeraVanderpump, Killeurdu08, custdogg, mrpringles, TargetPractice89, funmw2, CatsAhoy, CBStian, Lee., Corndog93, Facebook, BLACK DYNAM1TE, unicornace, Hello7734, Bender.ㅤ, stef_92, Street Mix, Alvarez, B-Turb0, Shaundi., swebarb, Owl Man, CrysisAverted, lol232, SuperGTFan, Jimmy_Leppard, TovarishTony, Knuckle89, Respect2, erkwang, missanthropy, GrandMaster Smith, shadowkill98, Samba., slendifiedman, schafter, Forty-Five-Auto, Mista_J42c, Terroryaki, longhurstgb, kzstone, d3ighty, m3tal z_DKI, adit999, ParsoOnFire, FutoLover, SkynetOnlineID, Nick1020, Kaito Katsumi, dwestos, Pavle, XxCrOwK3RxX, Rafli, 18479=This forum is dedicated to GTA: Vice City - the fourth title in the series, released in 2002., 12365=This forum is dedicated to GTA: Vice City Stories - a prequel to GTA: Vice City, released in 2006., 16300=This forum is dedicated to GTA: San Andreas - the fifth title in the series, released in 2004., 14086=This forum is dedicated to GTA: Liberty City Stories - the first 3D portable Grand Theft Auto title, released in 2005., 20609=This section is dedicated to Grand Theft Auto III - the first 3D title in the series, released in 2001., 9270=This section is dedicated to Grand Theft Auto IV - the ninth title in the series, released in 2008.}",
    "textBeforeTable": "Toggle Grand Theft Auto Grand Theft Auto (adsbygoogle = window.adsbygoogle || []).push({}); 2 minutes ago By Kevin3014 Facade Corporation 613,583 replies 15,212 topics Social lounge for multiplayer crews & forum gangs. Recruitment Crews & Gangs A minute ago By bronysplatter How much money will you gri... 2,285,038 replies 113,460 topics This is a general discussion forum for Grand Theft Auto Online. Help & Support",
    "textAfterTable": "Toggle GTA Mods GTA Mods   Forum Stats Last Post Info GTA Modding GTA V, GTA IV, GTA III, VC & SA, Tutorials, Art Support General discussion and support. 48,469 topics 416,645 replies GTA SA crashes when tuning... By lolpoeple 36 minutes ago Mod Showroom Scripts & Plugins, Maps, Total Conversions, Vehicles,",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}