{
    "relation": [
        [
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            ""
        ],
        [
            "Forum",
            "Website Feedback Forum for technical support, feedback and questions about the autosport.com website. Suggestions and constructive criticisms are welcome as well.",
            "Racing Comments The place for debates on the current affairs of Formula 1, rallying, MotoGP, NASCAR, V8, Indycar, and all other forms of motorsport. Be warned: arguments are welcome, personal insults are not. Subforum: RC's Bets & Games",
            "The Paddock Club Forum for FULL MEMBERS only (those with at least 30 posts on the board). The place to talk about (almost!) any non-motorsport topic, while sipping champagne and socialising with others. To gain access you have to PM the Paddock bouncer Slartibartfast and beg...",
            "Racing Simulators The place to find out which racing simulator to buy, what is the recommended set-up and how to improve your lap times",
            "The Technical Forum The place to discuss the technical aspect of F1, including driving techniques, engine statistics and aerodynamics",
            "The Nostalgia Forum A forum dedicated to the research, study, discussion, and just plain ol' talking about the history of motor sports. Questions are always welcomed; variety is encouraged. If you have an interest in the history of motor sports, this is the place to be! Subforums: Motorcycle Racing Nostalgia, Racing Collectables, Historical Research",
            "Grand Prix Travelling Going to a Grand Prix? Been there, done that -- and want to share your experience? Post your questions and comments here",
            "For Sale & Want Ads Got F1 related things to sell? Want to buy something? Post here and see what the Bulletin Board members can do."
        ],
        [
            "Stats",
            "2,589 topics 27,877 replies",
            "55,662 topics 4,046,251 replies",
            "729 topics 213,319 replies",
            "2,566 topics 49,489 replies",
            "5,961 topics 131,703 replies",
            "28,977 topics 769,284 replies",
            "1,168 topics 7,099 replies",
            "1,504 topics 2,072 replies"
        ],
        [
            "Last Post Info",
            "Any offensive/obtrusive ads... By Risil 26 Jul 2015",
            "McLaren-Honda MP4-30 V By Lemans Today, 01:24",
            "Protected Forum By 404KF2 Today, 01:16",
            "iRacing.com By ZubairjMaster123 Yesterday, 20:18",
            "NHRA requires injection in... By Lee Nicolle Yesterday, 23:47",
            "Early Holdens running in ea... By ken devine Today, 01:18",
            "Austrian GP 2015 By Jon83 20 Jul 2015",
            "Looking for mud tires By riya21 Yesterday, 07:21"
        ]
    ],
    "pageTitle": "The AUTOSPORT Forums",
    "title": "",
    "url": "http://forums.autosport.com/index.php?act=Post&CODE=02&f=2&t=177857&qpid=6038217",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 0,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042985140.15/warc/CC-MAIN-20150728002305-00218-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 94906454,
    "recordOffset": 94890852,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{14291=DerFlugplatz - Yesterday, 20:26, 15607=Bob Riebe - Yesterday, 16:55, 19030=JeePee - Yesterday, 07:28, 17808=mawerickinf1 - Yesterday, 09:02, 17068=racecarstory - Yesterday, 12:34, 18463=GMACKIE - Yesterday, 07:31, 14971=ERIC63 - Yesterday, 20:23, 16364=dierome1987 - Yesterday, 14:16}",
    "textBeforeTable": "Toggle Forums Forums You currently have javascript disabled. Several functions may not work. Please re-enable javascript to access full functionality. Javascript Disabled Detected More Forums Members View New Content Quick Navigation  Help Files Members Forums Search section:",
    "textAfterTable": "Recent Topics Where Force Indias problems in Hungary a result of its financial issues? DerFlugplatz - Yesterday, 20:26 Aberdare 25/26 July ERIC63 - Yesterday, 20:23 NHRA requires injection in Pro-Stock. Bob Riebe - Yesterday, 16:55 What was Ferrari's advantage in 2002 and 2004? dierome1987 - Yesterday, 14:16 My new site on race results racecarstory - Yesterday, 12:34",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}