{
    "relation": [
        [
            "Play Type",
            "Substitution",
            "Single",
            "Out",
            "Out",
            "Substitution",
            "Out"
        ],
        [
            "Play",
            "Pedro Feliciano starts the inning for the Mets.",
            "David Eckstein singled to center. Runner on first with none out and Chase Headley due up.",
            "Chase Headley sacrifice bunt, pitcher to second. Runner on second with one out and Adrian Gonzalez due up.",
            "Adrian Gonzalez lined out to third. Runner on second with two outs and Scott Hairston due up.",
            "Elmer Dessens enters the game for the Mets with a runner on second and two outs.",
            "Scott Hairston struck out swinging to end the inning."
        ]
    ],
    "pageTitle": "Tuesday, June 8, 2010 San Diego Padres - New York Mets Box Scores, Game Results & Summary - USATODAY.com",
    "title": "",
    "url": "http://content.usatoday.com/sportsdata/baseball/mlb/game/padres_mets/2010/06/08",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042982745.46/warc/CC-MAIN-20150728002302-00192-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 58588829,
    "recordOffset": 58572883,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{2345=View all MLB box scores for 6/8/2010}",
    "textBeforeTable": "Top of the 1st Mike DiMuro  3B Bill Welke  2B Jim Reynolds  1B Tim Welke  H Umpires 1.35 4 6 1 0 0 0 0 0.1 Elmer Dessens (W, 1-1) 2.05 5 5 0 0 0 0 1 0.2 Pedro Feliciano  2.01 9 13 2 0 0 0 0 1 Francisco Rodriguez  2.23 78 103 6 0 1 1 5 9 Mike Pelfrey  ERA Strikes Pitches SO BB ER R H IP Name 3.41 \" xmlns:fo=\"http://www.w3.org/1999/XSL/Format\" />Mets pitching http://i.usatoday.net/_common/_images/_sports/logos/mlb/mets_22t.png 12 18 1 0 1 1 2 1 Edward Mujica (L, 2-1) 1.44 9 11 3 0 0 0 0 1 Luke Gregerson  2.63 8 10 1 0 0 0 0 1 Mike Adams  2.72 66 98 6 1 1 1 7 7 Clayton Richard  ERA Strikes Pitches SO BB ER R H IP Name Errors: David Wright 1(7) Fielding: Stolen bases: Angel Pagan 1 (11) , David Wright 1 (11) Base Running: Grounded into double play: Angel Pagan  1 \" xmlns:fo=\"http://www.w3.org/1999/XSL/Format\" />Padres pitching http://i.usatoday.net/_common/_images/_sports/logos/mlb/padres_22t.png",
    "textAfterTable": "Play Type Play Out Jose Reyes grounded out pitcher to first. None on with one out and Angel Pagan due up. Error-reached-base Angel Pagan reached second on Clayton Richard's throwing error. Runner on second with one out and Jason Bay due up. Stolen-base Angel Pagan stole third. Runner on third with one out and Jason Bay at the plate. Out Jason Bay struck out looking. Runner on third with two outs and Ike Davis due up. Out Ike Davis struck out swinging to end the inning. Top of the 2nd Play Type Play Out Will Venable grounded out second to first. None on with one out and Jerry Hairston Jr. due up. Out Jerry Hairston Jr. grounded out first to pitcher. None on with two outs and Tony Gwynn Jr. due up. Out Tony Gwynn Jr. grounded out to first to end the inning. Bottom of the 2nd Play Type Play Out David Wright grounded out short to first. None on with one out and Rod Barajas due up. Out Rod Barajas flied out to right. None on with two outs and",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}