{
    "relation": [
        [
            "Patent application number",
            "20090161307",
            "20090168320",
            "20090168321"
        ],
        [
            "Description",
            "DISPLAY DEVICE - A cabinet-fixing locking nail and a locking stopper are formed at a fixing unit which is integrally attached to a button portion. The button portion is fixed to a back cabinet through the fixing unit, by locking the cabinet-fixing locking nail and the locking stopper to the back cabinet. A power circuit board is clipped to circuit board engagement slits which are guide grooves formed at the fixing unit and the button portion, and the power circuit board is locked by a first circuit board locking nail which is formed at the back cabinet to be fixed. The power circuit board and the button portion can be readily fixed only by a locking unit such as the cabinet-fixing locking nail, the locking stopper, the circuit board engagement slits the first circuit board locking nail and the like without using screw.",
            "DISPLAY DEVICE - A display panel stand holding portion for supporting the display panel in the standing position is formed at the upper end portion of the back cabinet as a part of the casing of the display device. The display panel stand holding portion includes the display panel stand mount portion, and the display panel support members. This makes it possible to support the display panel vertically when it is mounted on the display panel stand mount portion. The connector cables extending from the power supply circuit board is clamped to the temporary holding portion to be formed on the back cabinet before assembly of the display panel to be inclined at the predetermined position. The deterioration in the working efficiency caused by entanglement of the connector cables may be prevented.",
            "DISPLAY DEVICE - The present invention provides a display device that facilitates product inspection and maintenance. A button section is mounted to a back cabinet, and a power-source circuit board is fitted into a circuit-board fitting slit. Furthermore, the power-source circuit board is locked and fixed by a first circuit-board locking claw, and a main circuit board is locked and fixed by a second circuit-board locking claw. A speaker integrally assembled in a speaker holder is locked and fixed by a speaker locking claw, and thereafter a display panel is caused to be held by a display panel standing holding portion in a standing manner. The wire connection work of a display panel, each of the circuit boards, and the like is performed, the display panel is brought down and placed on a display panel placement portion, a front cabinet is mounted, and a leg portion is mounted to a leg-portion mounting portion."
        ],
        [
            "Published",
            "06-25-2009",
            "07-02-2009",
            "07-02-2009"
        ]
    ],
    "pageTitle": "Maeno, JP - Patent applications",
    "title": "",
    "url": "http://www.faqs.org/patents/inventor/maeno-jp-5/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042981856.5/warc/CC-MAIN-20150728002301-00198-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 430052319,
    "recordOffset": 430029854,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Takanori Maeno, Echizen-City JP 01-10-2013 METAL MATERIAL FOR BIOIMPLANT - A metal material for a bioimplant which is excellent in biointegration according to the present invention has a surface treated by sandblasting, and 20130013082 Published Description Patent application number Sumihiko Maeno, Osaka-Shi JP Sumihiko Maeno, Osaka JP 03-10-2011 SOFTWARE FOR ADJUSTING MAGNETIC HOMOGENEITY, METHOD FOR ADJUSTING MAGNETIC HOMOGENEITY, MAGNET DEVICE, AND MAGNETIC RESONANCE IMAGING APPARATUS - On the basis of the magnetic field intensity distribution of a magnetic field space ( 20110057655 Published Description Patent application number Shogo Maeno, Hitachi JP 05-07-2009 Noise filter - The invention can provide a miniaturized noise filter. The noise filter for reducing noise comprises a coil with a conductive wire ( 20090115551 Published Description Patent application number Seigen Maeno, Aichi-Ken JP 06-27-2013 AMPLIFIER AND AMPLIFYING METHOD - An amplifier that modulates a carrier frequency according to a digital signal and amplifies the modulated signal includes a determining portion that determines at least one of a sound quality required for the digital signal, a sound source of the digital signal, and a type of sound of the digital signal, a carrier frequency setting portion that sets a carrier frequency according to a result of the determination, and a pulse-width modulating portion that pulse-width modulates the carrier frequency according",
    "textAfterTable": "Takashi Maeno, Kyoto JP Patent application number Description Published 20120105113 DATA TRANSFER CIRCUIT AND DATA TRANSFER METHOD FOR CLOCK DOMAIN CROSSING - A circuit that transfers data between a first clock domain using a first clock and a second clock domain using a second clock synchronized with the first clock. The circuit comprises a data holding circuit operating at the first clock, an enable signal generation circuit connected to the data holding circuit. Preferably, the data transfer circuit includes an edge signal generation circuit connected to the data holding circuit, the edge signal generation circuit generating an edge signal allowing the data holding circuit to receive and send the data when edges of the first clock and the second clock align, and applying the edge signal to the data holding circuit. 05-03-2012 Takashi Maeno, Kiyosu-Shi JP Patent application number Description Published 20120060355 ACTUATOR MANUFACTURING METHOD - An actuator manufacturing method includes alternately stacking a plurality of dielectric elastomer layers and a plurality of conductive rubber layers along the direction of thickness to form a sheet, and wrapping the sheet formed about a core to form a rolled sheet. When the sheet formed in the step of alternately stacking is wrapped about the core, the sheet is formed by the dielectric elastomer layers and the conductive rubber layers. Therefore, even if the dielectric elastomer layers in the sheet are made to",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}