{
    "relation": [
        [
            "Categories",
            "Campus Safety",
            "Greek Life",
            "Clubs and Activities",
            "Share any unusual traditions or locations on campus",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "Safety is great! Always police around when needed.",
            "their is frats and sororities",
            "many clubs and intramural sports",
            "On saint pattys day its great because their is always the new haven day parade and it is crazy.",
            "For fun where can i start, in new haven its all about the club scene so that is a possibility wednesday- saturday. then their will be parties and other things to do. then their is fraternities and other groups you can join for fun.I",
            "Connecticut hall is where you will be doing most of your eating. In my opinion they always have great options and their is healthy options which is nice. Then in the student center their is about 5 more places to eat which are normally very good.",
            "The dorms are very fun and they usually hire cool people as RA's and DA's. the only thing is it is a dry campus.",
            "You are constantly being challenged which is nice. without motivation and teachers pushing you, you will get no where",
            "Make sure they have your major! Also SCSU has a liberal arts program so if you are trying to jump into your major from day one this is not the school for you. The liberal arts program has helped me become more well rounded though.",
            "It is a great school in my opinion. The classes are small so you actually are getting one-on-one time with the teacher. Most teachers are very helpful from experience."
        ]
    ],
    "pageTitle": "Southern Connecticut State University (Southern) Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Southern-Connecticut-State-University/reviews?_escaped_fragment_=/show/91193",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042981856.5/warc/CC-MAIN-20150728002301-00116-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 902029479,
    "recordOffset": 901970210,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{335487=© 2015, Cappex.com, LLC, 322188=If you commute, schools cheap and most of the programs are getting better and better, the business program is really building up it's reputation. Southern is a respected nursing school and the program's very competitive. In 2015 we will have a new library and science building, both are going to be huge and contain everything a student could need and more.}",
    "textBeforeTable": "08/06/2009 Reviewer is A current student here. 16 out of 16 people found this review useful. 1 of 84 Jessica from East Haven, CT Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code",
    "textAfterTable": "Bang for the buck Out of the four state schools, I'd have to say in my opinion Southern has the most to offer. The campus is the nicest and the activites are so often that you always see your money at use. Am enjoying being here I live on campus and love it so much! Southern is a perfect match for me and I could never imagine going anywhere else. Am learning a lot I've learned more in a year and a half here at Southern than I did all throughout high school. If you choose the right professors learning is fun as well! Login to rate or flag the reviews Max from Naugatuck, CT 10/26/2010 Reviewer is A current student here. 4 out of 4 people found this review useful. 3 of 84 Categories Comments Great for these types of students Most students can",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}