{
    "relation": [
        [
            "Entity",
            "NeoStem, Inc.",
            "NeoStem Therapies, Inc.",
            "Stem Cell Technologies, Inc.",
            "Amorcyte, LLC",
            "CBH Acquisition LLC",
            "China Biopharmaceuticals Holdings, Inc. (CBH)",
            "Suzhou Erye Pharmaceuticals Company Ltd.",
            "Progenitor Cell Therapy, LLC (PCT)",
            "NeoStem Family Storage, LLC",
            "Athelos Corporation",
            "PCT Allendale, LLC"
        ],
        [
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            ""
        ],
        [
            "Percentage of Ownership",
            "Parent Company",
            "100%",
            "100%",
            "100%",
            "100%",
            "100% owned by CBH Acquisition LLC",
            "51% owned by CBH",
            "100%",
            "100% owned by PCT",
            "80.1% owned by PCT",
            "100% owned by PCT"
        ],
        [
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            ""
        ],
        [
            "Location",
            "United States of America",
            "United States of America",
            "United States of America",
            "United States of America",
            "United States of America",
            "United States of America",
            "People’s Republic of China",
            "United States of America",
            "United States of America",
            "United States of America",
            "United States of America"
        ]
    ],
    "pageTitle": "Caladrius Biosciences, Inc. - FORM 10-Q - May 11, 2012",
    "title": "",
    "url": "http://www.getfilings.com/sec-filings/120511/NeoStem-Inc_10-Q/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042981856.5/warc/CC-MAIN-20150728002301-00067-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 461124391,
    "recordOffset": 461053797,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{585824=Any sale of our interest in Erye would be subject to a right of first refusal held by Suzhou Erye Economy & Co. Ltd. (“EET”) pursuant to the terms of the Joint Venture Agreement between a subsidiary of ours and EET. EET owns the remaining 49% interest in Erye. A number of issues have arisen between EET and NeoStem with respect to the operation and financing of Erye. For instance, while pursuant to the terms of the Joint Venture Agreement EET is required to lend back to Erye dividends received by it to finance Erye’s move to and construction of its new facilities, Erye has recently reported to us that such arrangement is no longer tax efficient in light of the ratio of Erye’s shareholder loans to its registered capital. In connection with exploring ways to remedy the additional tax burden caused by the level of shareholder loans and in preparing for a sale process, other issues have also surfaced, including the issue of us and Erye needing to obtain all Chinese regulatory approvals (and associated registrations) required to reflect the legal title of our interest in Erye as being held by the proper entity within our group which is its current beneficial owner as that term is used under U.S. law. We believe we have now determined what government approvals (and associated registrations) will need to be issued by the Suzhou Municipal Bureau of Foreign Investment and Commerce and the Suzhou Administration for Industry and Commerce to remediate these deficiencies and we have had counsel in China prepare these filings. Our management believes these regulatory deficiencies can be remediated and should not delay a sale of the Company’s interest in Erye to EET, should EET be the purchasers, though the remediation could delay a sale to a third party. However, we require the cooperation of the officers of Erye, as to which no assurance can be given, and we could be compelled to seek to replace those officers or to commence legal action to obtain the required consents or otherwise move forward with requisite filings and have begun taking such steps. In addition, even if the filings are made, no assurance can be given that any unremediated regulatory deficiencies would not have an adverse effect on the operating results and liquidity of Erye and the Company and will not impede or delay efforts to divest our interest in Erye. In addition, the remediation process is expected to trigger certain tax liabilities and penalties. At this time the Company does not expect such amounts to be material. In May 2012, Madame Zhang Jian, Erye’s current General Manager and CFO, resigned the position she holds with NeoStem as its Vice President, Pharmaceutical Operations. Since Madame Zhang Jian is also a shareholder of EET, and EET is a potential buyer of our 51% interest in Erye, her resignation may eliminate some conflicts of interest that might occur in the sale process., 624608=There have been no material changes from the risk factors previously disclosed in the Company’s Annual Report on Form 10-K for the year ended December 31, 2011. See the Company’s Annual Report on Form 10-K for the year ended December 31, 2011 under “Item 1 A – Risk Factors.”, 627954=On May 11, 2012, we consummated a private placement pursuant to which three persons and/or entities acquired an aggregate of 3,250,000 Units (the “Units”), each Unit consisting of one share of common stock and one warrant for an aggregate consideration of $1.3  million at $0.40 per Unit. The warrants have an exercise price of $0.51, expiring five years from the date of issuance and are exercisable after a period of six months. , 300823=The characteristics of the Series E Preferred Stock require that this instrument be treated as mezzanine equity. The Company bifurcated the fair value of the embedded conversion options and redemption options from the preferred stock since the conversion options and certain redemption options were determined to not be clearly and closely related to the Series E Preferred Stock and recorded the fair value of the embedded conversion and redemption options as long-term derivative liabilities. The Company also recorded the fair value of the warrants as a long-term derivative liability. The fair value of the preferred stock (net of issuance costs and discounts), the embedded derivatives, and warrant derivative were approximately $4,182,500, $315,300 and $71,900, respectively, as of March 31, 2012. The Company will report changes in the fair value of the embedded derivatives and warrant derivative in earnings within other income (expense), net. For the three months ended March 31, 2012, the Company recorded a decrease in the fair value of the embedded derivatives of approximately $76,500 and a decrease in the warrant derivative of approximately $10,800., 593509=Our “shelf” Registration Statement on Form S-3 was filed on May 2, 2011 pursuant to General Instruction I.B.1 of Form S-3, because the aggregate market value of our common equity held by non-affiliates (our “public float”) exceeded $75 million as of the relevant measuring date. Our public float is now less than $75 million, (so as of our filing of this Annual Report on Form 10-K on March 20, 2012 our Company is now subject to General Instruction I.B.6 of Form S-3) which means that as long as our public float remains below $75 million, the aggregate market value of securities sold by us or on our behalf pursuant to General Instruction I.B.6 of Form S-3 during any period of 12 calendar months may be no more than one-third of our public float measured as of a date within 60 days prior to each such sale. Our 2012 public offering applies against this limitation., 503281=Xiangbei Welman Pharmaceutical Co., Ltd. v Suzhou Erye Pharmaceutical Co., Ltd. and Hunan Weichu Pharmacy Co., Ltd. involves a patent infringement dispute with respect to a particular antibiotics complex manufactured by Erye (the \"Product\"). The Changsha Intermediate Court ruled initially in Welman's favor and Erye appealed that judgment to the Hunan High Court. The Supreme Court of PRC recently rendered a final ruling that Welman is not entitled to the disputed patent right, and on January 16, 2012 the Hunan High Court rejected Welman's suit against Erye on that claimed patent infringement. The initial judgment was rendered on May 13, 2010 in the amount of approximately 5 million RMB (approximately $778,500), which was fully accrued for previously in 2011 and reversed in the fourth quarter of 2011 based on these subsequent rulings., 3294=FOR THE QUARTERLY PERIOD ENDED MARCH 31, 2012, 298135=Dividends on the Preferred Shares accrue at a rate of 7% per annum and are payable monthly in arrears. The Company is required to redeem 1/27 of the Preferred Shares monthly. Monthly dividend and principal payments began on March 21, 2011 and continue on the 19th of each month thereafter with the final payment due on May 20, 2013. Payments can be made in cash or, upon notification to the holders, in shares of Company common stock, provided certain conditions are satisfied or holders of Preferred Shares agree to waive the conditions for that payment period. As of March 31, 2012, the Company had issued 6,388,885 shares of Company common stock in payment of monthly dividends and principal, including required advanced payments., 623839=There are no material changes to the disclosures provided in the Company’s Annual Report on Form 10-K for the year ended December 31, 2011, except as set forth in Note 17, Commitments and Contingencies, of the Notes to the financial statements included elsewhere herein., 349614=The Company’s results include share-based compensation expense of approximately $12,500 and $172,800 for the three months ended March 31, 2012 and 2011, respectively. The total fair value of shares vested for warrants issued for services during the three months ended March 31, 2012 was approximately $17,800. As of March 31, 2012, there was approximately $56,700 of total unrecognized service cost related to unvested warrants of which approximately $56,700 is related to warrants that vest over a weighted average life of 1.0 years., 290661=In October 2011, Erye obtained a bank loan of approximately $1,571,200 from the China Merchants Bank according to People’s Bank benchmark interest rates with additional rate up to 10% and is due in July 2012., 442612=The Tax Reform Act of 1986 enacted a complex set of rules limiting the utilization of net operating loss carryforwards (“NOL”) to offset future taxable income following a corporate ownership change. The Company’s ability to utilize its NOL carryforwards is limited following a change in ownership in excess of fifty percentage points during any three-year period., 608405=This Quarterly Report on Form 10-Q includes “forward-looking” statements within the meaning of the Private Securities Litigation Reform Act of 1995, as well as historical information. Such forward-looking statements involve known and unknown risks, uncertainties and other factors which may cause our actual results, performance or achievements, or industry results, to be materially different from anticipated results, performance or achievements expressed or implied by such forward-looking statements. When used in this Quarterly Report on Form 10-Q, statements that are not statements of current or historical fact may be deemed to be forward-looking statements. Without limiting the foregoing, the words “plan,” “intend,” “may,” “will,” “expect,” “believe,” “could,” “anticipate,” “estimate,” or “continue” or similar expressions or other variations or comparable terminology are intended to identify such forward-looking statements, although some forward-looking statements are expressed differently. Additionally, statements regarding our ability to successfully develop, integrate and grow the business, including with regard to our research and development efforts in cellular therapy, our adult stem cell and umbilical cord blood collection, processing and storage business, contract manufacturing and process development of cellular based medicines, and the pharmaceutical manufacturing operations conducted in China, the future of regenerative medicine and the role of stem cells in that future, the future use of stem cells as a treatment option and the role of VSEL TM Technology in that future and the potential revenue growth of such businesses, are forward-looking statements. Our future operating results are dependent upon many factors and our further development is highly dependent on future medical and research developments and market acceptance, which is outside our control., 580237=NeoStem, Inc. acquired Amorcyte, Inc. (“Amorcyte”), in October 2011. The Company expects to incur substantial additional costs in connection with its transition to a cell therapy development company. In particular, Amorcyte is currently recruiting clinical trial sites for an approximate 34 site, 160 patient, Phase 2 clinical trial for Amorcyte’s lead product candidate, AMR-001, for the treatment of AMI. The trial began enrollment in January 2012, and is expected to cost approximately $14 million over the first two years and anticipated to cost up to approximately $18 million over a five year period, inclusive of manufacturing costs., 306368=During the three months ended March 31, 2012 and 2011, the Company issued warrants for services as follows ($ in thousands, except share data):, 423371=As of March 31, 2012, there was approximately $3,837,800 of total unrecognized compensation costs related to unvested stock option awards of which approximately $3,829,400 is related to stock options that vest over a weighted average life of 1.83 years. The remaining balance of unrecognized compensation costs of $8,400 is related to stock options that vest based on the accomplishment of business milestones which expense begins to be recognized when such milestones become probable of being achieved., 545326=Other income (expense), net for the three months ended March 31, 2012 totaled approximately $166,700 of other income, compared with $250,400 of other expense for the three months ended March 31, 2011. The other income in 2012, and the other expense in 2011 is primarily due to the revaluation of derivative liabilities that have been established in connection with the Convertible Redeemable Series E Preferred Stock., 505188=In July 2011, a new copyright infringement lawsuit was brought by Welman against Erye claiming that Erye was not complying with the earlier judgment enjoining them from copying and using the package inserts for the Product. The Changsha Intermediate Court was applied to for property preservation and issued a civil decision freezing Erye's bank deposit of up to RMB 50 million (approximately US $7.9 million), or to seal up or detain Erye's other properties of equal value. As of March 31, 2012, approximately 16,808,000RMB (approximately $2,657,400) of cash had been frozen in six Erye bank accounts. Erye has contended that jurisdiction is not proper, and the case is now in review of the Hunan High Court., 429450=The weighted average estimated fair value of restricted stock issued for services in the three months ended March 31, 2011 was $0.48. The fair value of the restricted stock was determined using the Company’s closing stock price on the date of issuance. The vesting terms of restricted stock issuances are generally within one year. The Company’s results include share-based compensation expense of approximately $663,900 and $691,600 for the three months ended March 31, 2012 and 2011, respectively. As of March 31, 2012, there was approximately $88,500 of unrecognized service cost related to unvested restricted stock., 191506=The accompanying unaudited Consolidated Financial Statements have been prepared in accordance with accounting principles generally accepted in the United States of America (“generally accepted accounting principles”) for interim financial information and with the instructions to Form 10-Q and Article 8 of Regulation S-X of the Securities and Exchange Commission for interim financial information. Accordingly, they do not include all of the information and footnotes required by generally accepted accounting principles for complete financial statements. In the opinion of management, the accompanying Consolidated Financial Statements of the Company and its subsidiaries, which are unaudited, include all normal and recurring adjustments considered necessary to present fairly the Company’s financial position as of March 31, 2012 and the results of its operations and its cash flows for the periods presented. The unaudited consolidated financial statements herein should be read together with the historical consolidated financial statements of the Company for the years ended December 31, 2011 and 2010 included in our Annual Report on Form 10-K for the year ended December 31, 2011. Operating results for the three month period ended March 31, 2012 are not necessarily indicative of the results that may be expected for the year ending December 31, 2012., 507860=On April 4, 2012, the underwriter from the March 29, 2012 public offering (previously disclosed in our Form 8-K filed on March 29, 2012) of 15,000,000 units exercised its over-allotment option for an additional 2,000,000 units (previously disclosed in our Form 8-K filed on April 5, 2012). Each unit consists of one share of common stock and a warrant to purchase one share of common stock with a per share exercise price of $0.51. Additionally in April 2012, the warrants issued in connection with the offering initially exercisable beginning on September 30, 2012, were accelerated and are now exercisable immediately. The Company received additional gross proceeds of $800,000, prior to deducting underwriting discounts, for net proceeds of approximately $744,000., 248082=The changes in the carrying amount of goodwill, by reportable segment during 2012 were as follows (in thousands):, 459792=For the three months ended March 31, 2012, three major suppliers provided approximately 38.6% of Erye’s purchases of raw materials with each supplier individually accounting for approximately 14.3%, 12.6% and 11.7%, respectively. As of March 31, 2012, the total accounts payable to the three major suppliers represented 37.7% of the total accounts payable balance., 214479=Cash and cash equivalents include short-term, highly liquid, investments with maturities of ninety days or less when purchased. As of March 31, 2012, and December 31, 2011, the Company had approximately $764,700 and $791,100, respectively in bank deposits covered by the Federal Deposit Insurance Corporation. As of March 31, 2012 and December 31, 2011, cash and short-term investments held by Erye, our 51%-owned foreign subsidiary, that are not available to fund domestic operations unless repatriated were $14,766,600 and $8,707,500, respectively., 291756=As of March 31, 2012 and December 31, 2011, the Company had notes payable of approximately $305,200 and $148,100, respectively. The notes relate to certain insurance policies and equipment financings, require monthly payments, and mature within one to five years., 463919=The general reserve is used to offset extraordinary losses. Subject to approval by the relevant authorities, a subsidiary may, upon a resolution passed by the shareholders, convert the general reserve into registered capital provided that the remaining general reserve after the conversion shall be at least 25% of the registered capital of the subsidiary before the capital increase as a result of the conversion. The staff welfare and bonus reserve is used for the collective welfare of the employees of the subsidiary. The enterprise expansion reserve is for the expansion of the subsidiary’s operations and can also be converted to registered capital upon a resolution passed by the shareholders subject to approval by the relevant authorities. These reserves represent appropriations of the retained earnings determined in accordance with Chinese law, and are not distributable as cash dividends to the parent company, NeoStem. Statutory reserves are $2,478,000 and $2,488,000 as of March 31, 2012 and December 31, 2011, respectively., 471347=The operations and cash flows of the Regenerative Medicine - China business will be eliminated from ongoing operations as a result of our exit decision. The Company expects to have no continuing involvement in this business going forward. The operating results of the Regenerative Medicine – China business for the three months ended March 31, 2012 and 2011, which are included in discontinued operations, were as follows (in thousands):, 560229=In connection with accounting for the Company’s 51% interest in Erye, we account for the 49% minority shareholder share of Erye’s net income or loss with a charge to Noncontrolling Interests. For the three months ended March 31, 2012 and 2011, Erye’s minority shareholders’ share of net loss totaled approximately $243,000 and $660,500, respectively. In addition, the Company acquired rights to use patents under licenses from Becton, Dickinson and Company in March 2011, in exchange for an approximately 20% interest in PCT’s Athelos subsidiary. For the three months ended March 31, 2012 and 2011, Becton’s minority shareholder’s share of Athelos’ net loss totaled approximately $101,800 and $299,800, respectively., 219915=Basic loss per share is based on the weighted effect of all common shares issued and outstanding, and is calculated by dividing net loss attributable to common shareholders by the weighted average shares outstanding during the period. Diluted loss per share, which is calculated by dividing net loss attributable to common shareholders by the weighted average number of common shares used in the basic loss per share calculation plus the number of common shares that would be issued assuming conversion of all potentially dilutive securities outstanding, is not presented as such potentially dilutive securities are anti-dilutive in all periods presented. For the three months ended March 31, 2012 and 2011, the Company incurred net losses and therefore no common stock equivalents were utilized in the calculation of loss per share. At March 31, 2012 and 2011, the Company excluded the following potentially dilutive securities:, 302757=The Company raised an aggregate of approximately $2.25 million in a private placement consummated in February 2012 pursuant to which three entities acquired an aggregate of 3,465,404 shares of Common Stock., 326232=At March 31, 2012, the outstanding warrants by range of exercise prices were as follows:, 563558=We incurred a net loss of approximately $9,206,900 for the three months ended March 31, 2012. The following chart represents the net funds provided by or used in operating, financing and investing activities for each period indicated (in thousands):, 254614=As of March 31, 2012 and December 31, 2011, the Company’s intangible assets and related accumulated amortization consisted of the following (in thousands):, 567284=Our cash provided by operating activities in the three months ended March 31, 2012 totaled approximately $2,106,400, which is the sum of (i) our net loss of $9,206,900, adjusted for non-cash expenses totaling $6,526,600 (which includes adjustments for equity-based compensation, depreciation and amortization, and the loss on exit of the Regenerative Medicine – China business, and (ii) changes in operating assets and liabilities providing approximately $4,786,700., 543723=As part of our plan to focus on capturing the paradigm shift to cell therapies following our January 2011 acquisition of PCT, we are pursuing strategic alternatives with respect to our 51% interest in Erye and anticipate we will have monetized our interests in Erye by the close of 2012, although no assurances can be given as to whether a sale will be consummated or the amount of funding such sale will provide., 289800=In June 2011, Erye obtained a bank loan of approximately $1,571,200 from the Agricultural Bank of China according to People’s Bank benchmark interest rates and is due in June 2012., 526683=The modest increase in revenues is due to a combination of factors. In 2011, a strategic decision was taken to adjust the product mix and eliminate certain low margin pharmaceutical intermediates, which continues to impact revenue for the three months ended March 31, 2012, and has reduced sales 6% in comparison to the same period for 2011. Revenues from sales of antibiotics, cephalosporins and other therapeutic products increased approximately 3% for the three months ended March 31, 2012 compared to the same period for 2011. The unit volume of antibiotics, cephalosporins and other therapeutic products increased approximately 10% due to increased marketing efforts. The increase in product volume was offset by an approximate 7% decline in revenues as a result of price reductions in connection with specific government policies for products on China’s essential drug list. We recognize that there will be continuous price pressure on these products as over 70% of Erye’s manufactured drugs are on China’s essential drug list. Revenues for the three months ended March 31, 2012 compared to the same period for 2011 increased due to changes in foreign exchange rates between the Chinese RMB and United States dollar by approximately 4%., 529597=The cost of revenue was approximately $16,321,500 representing an increase of approximately $2,045,000 for the three months ended March 31, 2012 compared to $14,276,500 for the three months ended March 31, 2011., 190405=NeoStem, Inc. is an international biopharmaceutical company. In 2011, we operated our business in three reportable segments: (i) Cell Therapy — United States; (ii) Regenerative Medicine — China; and (iii) Pharmaceutical Manufacturing — China. Effective March 31, 2012, we committed to discontinue operations in the Regenerative Medicine – China reportable segment, which is now reported in discontinued operation (see Note 15). We also continue to pursue the divestiture of the Pharmaceutical Manufacturing - China segment and anticipate it will have been exited by the close of 2012., 576922=We recognize that there will be continuous price pressure on Erye as over 70% of Erye’s manufactured drugs are on the essential drug list. There has recently been evidence of such price pressure — i.e., on March 2, 2011 the National Development and Reform Commission issued price cuts for medical insurance drugs which substantially impacts two of Erye’drugs. We anticipate that Piperacillin Sodium and Sulbactam Sodium will experience as much as a 50% price decline while the price of Ligustrazine Phosphate may be reduced by approximately 75%. During 2011 the price reductions experienced by Erye on these products was approximately 24%. In 2011 Piperacillin Sodium and Sulbactum Sodium accounted for approximately 5% of sales and Ligustrazine Phosphate accounted for approximately 1% of sales. Recently, the Ministry of Health issued, for public comment, a draft policy “Administrative Measures on Clinical Use of Antibiotic Drugs” to curb their overuse. The proposed guidelines set forth three categories of antibiotics, which include 1) restricted, 2) non-restricted, and 3) special-use only. According to the October 12, 2011 China Healthcare report published by Deutsche Bank, AG (the “China Healthcare report”), it has been projected that the limitation of antibiotic usage in China will reduce the historical compound annual growth rate which has been approximately 20%. It has been estimated that China’s population consumes about ten times the global per capita average of antibiotics. These regulations have not been finalized but issuance of a draft policy has created uncertainty on the part of distributors and has reduced purchases by distributors and in part has contributed to sales reductions in 2011., 519988=Three Months Ended March 31, 2012 Compared to Three Months Ended March 31, 2011, 534488=Historically, to minimize our use of cash, we have used a variety of equity and equity-linked instruments to pay for services and to incentivize employees, consultants and other service providers. The use of these instruments has resulted in significant charges to the results of operations. In general, these equity and equity-linked instruments were used to pay for employee and consultant compensation, director fees, marketing services, investor relations and other activities. For the three months ended March 31, 2012 the use of equity and equity-linked instruments to pay for such expenses resulted in charges to selling, general, and administrative, and research and development expenses totaling $2,384,700 representing an increase of $485,800 compared to the three months ended March 31, 2011., 352120=The range of assumptions used in calculating the fair values of options granted during the three months ended March 31, 2012 and 2011 was as follows:, 446307=The Company operates in two reportable segments: (i) Cell Therapy — United States; and (ii) Pharmaceutical Manufacturing —China. Effective March 31, 2012, the Company no longer operated in the Regenerative Medicine – China reportable segment, which is now reported in discontinued operations (see Note 15). The Company’s operating businesses are organized based on the nature of markets and customers. The Company’s CEO, as chief operating decision maker, evaluates the results of operations along these reporting segments., 512902=NeoStem, Inc. is an international biopharmaceutical company. In 2011, we operated our business in three reportable segments: (i) Cell Therapy — United States; (ii) Regenerative Medicine — China; and (iii) Pharmaceutical Manufacturing — China. Effective March 31, 2012, we no longer operated in the Regenerative Medicine – China reportable segment, which is now reported in discontinued operations. We also continue to pursue the divestiture of the Pharmaceutical Manufacturing - China segment and anticipate it will have been exited by the close of 2012., 569487=During the three months ended March 31, 2012, we spent approximately $110,100 for property and equipment principally related to the construction of Erye’s new manufacturing facility., 203258=In addition to the policies below, our significant accounting policies are described in Note 2 of the Notes to Consolidated Financial Statements included in our Annual Report on Form 10-K for the year ended December 31, 2011. There were no changes during the three months ended March 31, 2012., 544640=For the three months ended March 31, 2012 interest expense was $1,096,100 compared with $852,200 for the three months ended March 31, 2011, an increase of $243,900. The increase was primarily due to an increase in amortization of debt discount related to the Series E Preferred Stock of $204,200., 562859=During the three months ended March 31, 2012, we met our immediate cash requirements through existing cash balances, private placements and a public offering of our common stock and warrants, which in total, raised an aggregate of approximately $9,050,000, the issuance of notes payable and bank loans providing $2,160,000 net, for our operations in China and the use of equity and equity-linked instruments to pay for services and compensation., 584928=We plan to devote our resources and management efforts to cell therapy manufacturing and development, and other related activities, including adult stem cell collection and storage. We believe the October 2011 acquisition of Amorcyte described elsewhere herein is in keeping with this strategic mission. We also believe that if we could monetize Erye, we would have additional capital needed to pursue the development of cell therapies. To that end, in June 2011, we engaged a financial advisor to lead the effort to pursue the possible divesture of our 51% interest in Erye. Marketing efforts have led to a few non-binding letters of intent., 504396=In 2009, Welman brought a copyright infringement lawsuit against Erye claiming the package inserts with respect to the Product infringed their copyright. Erye was enjoined from copying and using the package inserts on the Product and from selling the Product with the package inserts and Welman was awarded RMB 50,000. Erye has filed application for a retrial of the previous lawsuit brought by Welman to the Hunan High Court, which application filing was accepted by the court, with the court opening date for retrial not determined yet., 311224=The range of assumptions used in calculating the fair values of warrants issued for services during the three months ended March 31, 2012 and 2011 was as follows:, 583855=In connection with the Welman litigation, the Changsha Intermediate Court was applied to for property preservation and it issued a civil decision freezing Erye’s bank deposits of up to 50 million RMB, or approximately $7.9 million, or sealing up or detaining Erye’s other properties of equal value. Currently this case is pending. As of March 31, 2012, approximately 16,808,000 RMB (approximately $2.7 million) of cash had been frozen in six bank accounts, and is classified in Other Assets. As a result of this court action, Erye has been obligated to increase its bank borrowings to offset its reduction in liquidity, and may consider seeking additional bank loans. At March 31, 2012, Erye had bank borrowings of $15.8 million, and had cash balances in bank accounts not affected by the action totaling $14.8 million., 619327=The following material weakness has been identified by management in connection with its assessment as of December 31, 2011, which as of March 31, 2012, the Company has concluded the material weakness has not been fully remediated. The Company has determined that Erye does not have sufficient qualified accounting and finance personnel, which has resulted in the lack of appropriate (i) segregation of duties in certain areas, (ii) detailed records for long term assets, (iii) knowledge of certain complex aspects of Chinese tax code, and (iv) audit trails on certain transactions. During 2011, the Company took steps to strengthen Erye’s competency in the area of US GAAP, by hiring a director of international accounting with many years of US GAAP accounting and reporting experience, but recognized that it needed to do more to address the day to day needs of Erye’s accounting department. In April 2012, Erye established a separate internal controls department, which will focus on strengthening accounting policies, and performing sample audits. It will also ensure that staff members receive proper training and new policies are implemented appropriately. The Company intends to take further steps to add appropriate personnel to the Erye accounting department and to increase the number of qualified staff working in the department, and will reassess whether the material weakness is fully remediated by the end of the second quarter of 2012., 509950=On April 26, 2012 (the “Effective Date”), the Compensation Committee of the Board of Directors adopted a program (the “2012 Option Program”) whereby each participating officer was issued on April 26, 2012 an option (the “Option”) to purchase that number of shares of Common Stock equal to that portion of the participating officer’s gross salary (the “Participating Salary”) for the period May 1, 2012 – July 31, 2012 (the “Election Period”) elected by the participating officer divided by $0.25, the Black-Scholes value of an Option issued under the 2012 Option Program. The Option, the issuance of which is in lieu of payment of the Participating Salary, vests at the end of the month in which the Participating Salary to which it relates would have been paid and has a term of ten years despite any termination of employment of the participating officer. The per share exercise price is $0.36, the closing price of the Common Stock on the date of issuance of the Options. The gross Participating Salary for all participating officers is $181,309 and the total number of Options granted under the 2012 Option Program was 725,235., 573037=We are pursuing the divestiture of Erye and anticipate it will have been exited by the close of 2012. For so long as we own an interest in Erye, we expect to rely partly on dividends under the Joint Venture Agreement attributable to our 51% ownership interest in Erye, to meet some of our future cash needs with respect to continued operations in China. In addition, pursuant to the Joint Venture Agreement that governs the ownership and management of Erye, for 2011 and approximately the next year: 45% of the net profit after tax due to the Company, in the form of dividends, will be provided to Erye as part of the new facility construction fund, which will be characterized as additional paid-in capital for our 51% interest in Erye; and only 6% of the net profit will be distributed to us directly. To date, we have been paid from the 2010 distribution the amount of approximately $140,400., 459026=The Cell Therapy – United States revenues include approximately $1,106,900 and $489,300 for stem cell related services reimbursed expenses for the three months ended March 31, 2012 and 2011, respectively., 7579=Indicate by check mark whether the registrant (1) has filed all reports required to be filed by Section 13 or 15(d) of the Securities Exchange Act of 1934 during the preceding 12 months (or for such shorter period that the registrant was required to file such reports), and (2) has been subject to such filing requirements for the past 90 days.   Yes     x         No     o, 617954=As of the end of the Company’s first fiscal quarter ended March 31, 2012 covered by this report, the Company carried out an evaluation, with the participation of the Company’s management, including the Company’s Chief Executive Officer and Chief Financial Officer, of the effectiveness of the Company’s disclosure controls and procedures pursuant to Rule 13a-15 of the Exchange Act. Based on that evaluation, the Company’s Chief Executive Officer and Chief Financial Officer concluded that, because of the material weakness in internal control over financial reporting described below, the Company’s disclosure controls and procedures were not effective, at the reasonable assurance level, in ensuring that information required to be disclosed by the Company in the reports that it files or submits under the Exchange Act is recorded, processed, summarized and reported, within the time periods specified in the SEC’s rules and forms and is accumulated and communicated to management, including the Chief Executive Officer and Chief Financial Officer, as appropriate to allow timely decisions regarding required disclosure., 552162=The operations and cash flows of the Regenerative Medicine - China business will be eliminated from ongoing operations as a result of our exit decision. The Company will have no continuing involvement in this business going forward. The operating results of the Regenerative Medicine – China business for the three months ended March 31, 2012 and 2011, which are included in discontinued operations, were as follows (in thousands):, 491792=The Company leases office and laboratory facilities and certain equipment under certain noncancelable operating leases that expire from time to time through 2017. A summary of future minimum rental payments required under operating leases that have initial or remaining terms in excess of one year as of March 31, 2012 are as follows (in thousands):, 590058=We may not be able to materially enhance our liquidity through a sale of our interest in Erye. The challenging nature of the current China pharmaceutical market makes it a difficult time for us to be pursuing a divestiture of our 51% ownership interest in Erye, and we expect that any sale of this interest will result in our not recouping our original investment. A sale of our interest in Erye, if a sale can be consummated, would have a material effect on our business, results of operations and balance sheet. Factors that may impede a sale may include, but not be limited to, (i) EET’s right of first refusal and the significant time and money that exercise of such right could cause a potential purchaser, (ii) the need for any purchaser to negotiate a new Joint Venture Agreement and a $21 million shareholder loan repayment schedule with EET if EET does not wish to either sell its interest or exercise its right of first refusal, (iii) recent regulatory changes in China which reduce prices that may be charged for certain of Erye’s products and limit use of antibiotics, (iv) recent disappointing financial performance by Erye resulting at least in part from such regulatory changes, including a decrease in revenues in 2011 and a net loss for fourth quarter 2011, (v) tax or regulatory issues affecting Erye, including those described above and which will adversely affect Erye going forward, (vi) availability of financing for a potential purchaser, and (vii) the status of the remediation of the regulatory deficiencies discussed above, and (viii) other factors typical of any sale process. There can be no assurance that any sale of our Erye interest will be made, or will be made at a price that provides material additional capital for our cell therapy development efforts., 501292=Chinese regulatory approvals — The Company has determined that it did not obtain all Chinese regulatory approvals (and associated registrations) required to reflect the legal title of its interest in Erye as being held by the proper entity within our group which is its current beneficial owner as that term is used under U.S. law. The Company believes it has now determined what governmental approvals (and associated registrations) will need to be issued by the Suzhou Municipal Bureau of Foreign Investment and Commerce and the Suzhou Administration for Industry and Commerce to remediate these deficiencies and the Company has had counsel in China prepare these filings. The Company’s management believes these regulatory deficiencies can be remediated and should not delay a possible divestiture of the Company’s interests in Erye that is currently under evaluation. However, the Company requires the cooperation of the officers of Erye, as to which no assurance can be given, and we could be compelled to seek to replace those officers or to commence legal action to obtain the required consents or otherwise move forward with requisite filings. In addition, even if the filings are made, no assurance can be given that any unremediated regulatory deficiencies would not have an adverse effect on the operating results and liquidity of Erye and the Company and will not impede or delay efforts to divest the Company’s interest in Erye. In addition, the remediation process is expected to trigger certain tax liabilities and penalties, however the ultimate liability will be based on future discussions with the relevant Chinese authorities. The Company cannot reasonably assess the exposure as of March 31, 2012., 399442=At March 31, 2012, the outstanding options under the Non U.S. Plan by range of exercise prices were as follows:, 424328=During the three months ended March 31, 2012 and 2011, the Company issued restricted stock for services as follows ($ in thousands, except share data):, 443229=Since the year 2000, the Company has had several changes in ownership which has resulted in a limitation on the Company’s ability to apply net operating losses to future taxable income. As of December 31, 2011 the Company has lost $25,994,800 or $8,838,200 in tax benefits, of net operating losses applicable to Federal income taxes which expired due to these limitations and expiration of net operating loss carryforwards. At December 31, 2011, the Company had net operating loss carryforwards of approximately $47,427,300 applicable to future Federal income taxes. The tax loss carryforwards are subject to annual limitations and expire at various dates through 2030. The Company has recorded a full valuation allowance against its net deferred tax asset because it is more likely than not that such deferred tax assets will be realized., 208393=On October 17, 2011 (the “Closing Date”), Amo Acquisition Company I, Inc. (“Subco”), a newly-formed wholly-owned subsidiary of NeoStem, Inc. (“NeoStem” or the “Company”), merged (the “Amorcyte Merger”) with and into Amorcyte, Inc., a Delaware corporation (“Amorcyte”), in accordance with the terms of the Agreement and Plan of Merger, dated as of July 13, 2011 (the “Amorcyte Merger Agreement”), among NeoStem, Amorcyte, Subco, and Amo Acquisition Company II, LLC (“Subco II”). As a result of the consummation of the Amorcyte Merger, Amorcyte is now a wholly-owned subsidiary of NeoStem. Amorcyte is a development stage cell therapy company focusing on novel treatments for cardiovascular disease., 628557=The offer and sale by the Company of the securities described above were made in reliance upon the exemption from registration provided by Section 4(2) of the Securities Act of 1933, as amended (the “Securities Act”), for transactions by an issuer not involving a public offering. The offer and sale of such securities were made without general solicitation or advertising to “accredited investors” as such term is defined in Rule 501(a) of Regulation D promulgated under the Securities Act., 299985=Upon issuance, the Preferred Shares were convertible at an initial conversion price of $2.0004. The conversion price is subject to certain weighted average adjustments upon the occurrence of specific events, including stock dividends, stock splits, combinations and reclassifications of the Company’s common stock and if (with certain exceptions) the Company issues or sells any additional shares of common stock or common stock equivalents at a price per share less than the conversion price then in effect, or without consideration. As of March 31, 2012, the conversion price had been adjusted to $1.36., 539115=For the three months ended March 31, 2012, our research and development expenses were $2,714,500 compared to $2,755,200 for the three months ended March 31, 2011, representing an decrease of approximately $40,700 or 1%. Equity-based compensation included in research and development expenses for the three months ended March 31, 2012 was approximately $161,300, compared to approximately $260,100 for the three months ended March 31,2011. Overall, the decrease in research and development expenses for the three months ended March 31, 2012 compared to the prior year period was primarily due to the following:, 305717=The Company has issued common stock purchase warrants from time to time to investors in private placements and public offerings, and to certain vendors, underwriters, placement agents and consultants of the Company. A total of 52,695,366 shares of common stock are reserved for issuance upon exercise of outstanding warrants as of March 31, 2012 at prices ranging from $0.51 to $7.00 and expiring through October 2018., 490146=Effective March 10, 2011, Matthew Henninger entered into a consulting agreement with PCT, pursuant to which Mr. Henninger was engaged for a three month term to serve as an advisor to PCT with regard to the development of the “Family Plan,” a multi-generational stem cell collection and storage service. The agreement was subsequently amended and extended with the approval of the Audit Committee through December 31, 2011. The term was further extended to March 31, 2012 with the approval of the Audit Committee, in connection with which Mr. Henninger was granted an option to purchase 75,000 shares of NeoStem Common Stock under the 2009 Plan at $0.52 per share (Black Scholes value $20,696) vesting over the term of the extension, $10,000 per month for a three month period and continued insurance reimbursement. Mr. Henninger is in an exclusive relationship with the CEO of NeoStem., 616104=Disclosure controls and procedures are the Company’s controls and other procedures that are designed to ensure that information required to be disclosed in the reports that the Company files or submits under the Securities Exchange Act of 1934, as amended (the “Exchange Act”) is recorded, processed, summarized and reported within the time periods specified in the Securities and Exchange Commission’s rules and forms. Disclosure controls and procedures include, without limitation, controls and procedures designed to ensure that information required to be disclosed in the reports that the Company files under the Exchange Act is accumulated and communicated to management, including the Chief Executive Officer and Chief Financial Officer, as appropriate, to allow timely decisions regarding required disclosure. In designing and evaluating the disclosure controls and procedures, management recognizes that any controls and procedures, no matter how well designed and operated, can provide only reasonable assurance of achieving the desired control objectives. Due to the inherent limitations of control systems, not all misstatements may be detected. These inherent limitations include the realities that judgments in decision-making can be faulty and that breakdowns can occur because of a simple error or mistake. Additionally, controls can be circumvented by the individual acts of some persons, by collusion of two or more people, or by management override of the control. Controls and procedures can only provide reasonable, not absolute, assurance that the above objectives have been met., 562300=At March 31, 2012 we had a cash balance of approximately $21,771,400, working capital of approximately $5,840,400, and shareholders’ equity of approximately $63,371,100., 445403=The Company has provided deferred income taxes for the estimated U.S. federal and foreign income tax effects of earnings of subsidiaries expected to be distributed to the Company. Deferred income taxes have been provided on approximately $5,324,300 of undistributed earnings of certain foreign subsidiaries as of December 31, 2011 as such amounts are not considered to be permanently reinvested., 535684=For the three months ended March 31, 2012, our selling, general, and administrative expenses were approximately $9,452,200 compared to approximately $9,634,900 for the three months ended March 31, 2011, representing an decrease of approximately $182,700 or 2%. Equity-based compensation included in selling, general and administrative expenses for the three months ended March 31, 2012 was approximately $2,223,400, compared to approximately $1,638,800 for the three months ended March 31, 2011. Overall, the increase in selling, general and administrative expenses for the three months ended March 31, 2012 compared to the prior year period was primarily due to the following:, 546268=The income tax provision for the three months ended March 31, 2012 and 2011, were $122,300 and $592,600, respectively, and were related to foreign taxes in our Pharmacuetical Manufacturing – China reporting segment., 515715=In March 2011 PCT’s wholly owned subsidiary, Athelos, Inc. (Athelos), acquired rights and technology for a T-cell based immunomodulatory therapeutic in exchange for an approximate 20% interest in Athelos., 310604=The weighted average estimated fair value of warrants issued for services in the three months ended March 31, 2012 was $0.41. The fair value of warrants at the date of grant was estimated using the Black-Scholes option pricing model. The expected volatility is based upon historical volatility of the Company’s stock. The expected term is based upon the contractual term of the warrants., 291102=In November 2011, Erye obtained a bank loan of approximately $3,928,000 from Commercial Bank of China according to People’s Bank benchmark interest rates and is due in November 2012., 511672=The following Management’s Discussion and Analysis of Financial Condition and Results of Operations contains forward-looking statements that involve risks and uncertainties. Our actual results could differ materially from those anticipated in these forward-looking statements as a result of various factors, including those set forth under “Cautionary Note Regarding Forward-Looking Statements” herein and under “Risk Factors” in our annual report on Form 10-K for the year ended December 31, 2011. The following discussion should be read in conjunction with our consolidated financial statements and related notes thereto included elsewhere in this quarterly report and in our annual report on Form 10-K for the year ended December 31, 2011., 514775=The Company strengthened its expertise in cellular therapies, for its Cell Therapy — United States segment, with its January 19, 2011 acquisition of Progenitor Cell Therapy, LLC, a Delaware limited liability company (“PCT”). PCT is engaged in a wide range of services in the cell therapy market for the treatment of human disease, including, but not limited to contract manufacturing, product and process development, regulatory consulting, product characterization and comparability, and storage, distribution, manufacturing and transportation of cell therapy products. PCT’s legacy business relationships also afford NeoStem introductions to innovative therapeutic programs., 466217=In 2009, the Company began its Regenerative Medicine-China business in the People’s Republic of China (“China” or “PRC”) through its subsidiary, a wholly foreign owned entity (“WFOE”) and entered into contractual arrangements with certain variable interest entities (“VIEs”). Foreign companies have commonly used VIE structures to operate in the PRC, and while such structures are not uncommon, recently they have drawn greater scrutiny from the local Chinese business community in the PRC who have urged the PRC State Council to clamp down on these structures. In addition, in December 2011, China’s Ministry of Health announced its intention to more tightly regulate stem cell clinical trials and stem cell therapeutic treatments in the PRC, which has created uncertainty regarding the ultimate regulatory environment in the PRC. Accordingly, the Company has been taking steps to restrict, with the expectation of ultimately eliminating, its regenerative medicine business in the PRC. The Company has concluded that as a result of these steps, to discontinue operations in its Regenerative Medicine-China business. The Company has determined that any liability arising from the activities of the WFOE and the VIEs will likely be limited to the net assets currently held by each entity. As of March 31, 2012, the Company recognized the following loss on exit of the Regenerative Medicine-China business (in thousands):, 521799=For the three months ended March 31, 2012, total revenues were approximately $22,056,800 compared to $19,591,000 for the three months ended March 31, 2011. Revenues for each period were comprised of the following (in thousands):, 506151=A similar copyright infringement lawsuit was recently instituted by Welman against Erye in the Guangzhou Intermediate Court to (i) enjoin Erye from copying and using the package inserts from the Product and selling the drugs with the aforesaid package inserts; and (ii) award Welman economic losses of approximately RMB 2,000,000 (approximately $320,000) against Erye. Now the case was withdrawn by Welman. Welman made an application for preliminary injunction to prohibit Erye from copying and using the package inserts from the Product and selling the drugs with the aforesaid package inserts and Welman's application was denied by the Court on September 6, 2011. Welman subsequently obtained a preliminary injunction from a lower court Guangzhou Haizhu District Court on September 14, 2011. But on October 28, 2011, upon the appeal by Erye, the Haizhu District Court issued a decision withdrawing the preliminary injunction. Welman again applied for on April 13, 2012 and obtained on April 17, 2012 a preliminary injunction from another lower court Guangzhou Baiyun District Court. Erye has applied for court reconsideration on that granted preliminary injunction, during which period the said preliminary injunction is still in enforcement., 570223=The Company raised an aggregate of approximately $2.25 million in a private placement consummated in February 2012 in which three entities acquired an aggregate of 3,465,404 shares of Common Stock. On May 11, 2012, we consummated a private placement pursuant to which three persons and/or entities acquired an aggregate of 3,250,000 Units (the “Units”), each Unit consisting of one share of common stock and one warrant for an aggregate consideration of $1.3 million at $0.40 per Unit. The warrants have an exercise price of $0.51, expiring five years from the date of issuance and are exercisable after a period of six months. One of the investors included Martyn Greenacre (one of the company’s directors) (who purchased 250,000 Units)., 561525=The Convertible Redeemable Series E Preferred Stock calls for annual dividends of 7% based on the stated value of the preferred stock and we recorded dividends of approximately $107,800 and $186,600 for the three months ended March 31, 2012 and March 31, 2011 respectively., 240142=The fair value measurement of the contingent consideration obligations is determined using Level 3 inputs. The fair value of contingent consideration obligations is based on a discounted cash flow model using a probability-weighted income approach. The measurement is based upon unobservable inputs supported by little or no market activity based on our own assumptions and experience. The value of our contingent consideration is valued using a discount rate of 30%. We base the timing to complete the development and approval of this product on the current development stage of the product and the inherent difficulties and uncertainties in developing a product candidate, such as obtaining U.S. Food and Drug Administration (FDA) and other regulatory approvals. In determining the probability of regulatory approval and commercial success, we utilize data regarding similar milestone events from several sources, including industry studies and our own experience. These fair value measurements represent Level 3 measurements as they are based on significant inputs not observable in the market. Significant judgment is employed in determining the appropriateness of these assumptions as of the acquisition date and for each subsequent period. Accordingly, changes in assumptions could have a material impact on the amount of contingent consideration expense we record in any given period. Changes in the fair value of the contingent consideration obligations are recorded in our consolidated statement of operations. Contingent consideration was recognized on October 17, 2011 in connection with the Amorcyte merger (see Note 3). There were no changes in contingent consideration fair value as of March 31, 2012., 574186=Erye has substantially completed the construction of its new pharmaceutical manufacturing facility. Erye began transferring its operations to its new manufacturing facility in January 2010. The relocation and new production lines have been completed and have received cGMP certification. It was contemplated by the Joint Venture Agreement that the construction would continue for three years. As such, 45% of the dividend we would be entitled to by reason of our 51% ownership would remain in Erye through 2012 to complete the construction while EET would loan back their dividend during the same period at a prevailing bank interest rate. Upon a liquidity event of Erye, as contemplated in the joint venture agreement, the Company will be entitled to the return of its dividend reinvestments to the extent of the proceeds generated by the liquidity event. Repayment of such loans from EET would occur gradually after the construction is completed., 479191=The summary of the assets and liabilities related to discontinued operations as of December 31, 2011 was as follows (in thousands):, 213597=The total cost of the acquisition, which is still preliminary, has been allocated to the assets acquired and the liabilities assumed based upon their estimated fair values at the date of the acquisition. The final allocation is pending the receipt of this valuation work and the completion of the Company’s internal review, which is expected during fiscal 2012., 304256=In March 2012, the Company completed an underwritten offering of 15,000,000 units at a purchase price of $0.40 per unit, with each unit consisting of one share of Common Stock and a five year warrant to purchase one share of Common Stock at an exercise price of $0.51 per share (the “Offering”). The Company sold securities in the Offering under the Company’s previously filed shelf registration statement on Form S-3 (333-173855), which was declared effective by the Securities and Exchange Commission on June 13, 2011. The Company received gross proceeds of $6,000,000, prior to deducting underwriting discounts and offering expenses payable by the Company, for net proceeds of approximately $5,297,000. In April 2012, the underwriters in the Offering exercised their over-allotment option for an additional 2,000,000 units. The Company received additional gross proceeds of $800,000, prior to deducting underwriting discounts, for net proceeds of approximately $744,000., 485630=Pursuant to the terms and conditions of the October 2009 Erye Joint Venture Agreement, dividend distributions to EET and the Company’s subsidiary will be made in proportion to their respective ownership interests in Erye; provided, however, that for the three-year period commencing on the first day of the first fiscal quarter after the Joint Venture Agreement became effective distributions are made as follows: for undistributed profits generated subsequent to the acquisition date: (i) the 49% of undistributed profits (after tax) of the joint venture due EET will be distributed to EET and lent back to Erye to help finance costs in connection with its construction of and relocation to a new facility (to be repaid gradually after construction is completed); and (ii) of the net profit (after tax) of the joint venture due the Company, 45% will be provided to Erye as part of the new facility construction fund and will be characterized as additional paid-in capital for the Company’s 51% interest in Erye, and 6% will be distributed to the Company. For undistributed profits generated prior to the acquisition date: (i) the 49% of undistributed profits (after tax) of the joint venture due EET will be distributed to EET and lent back to Erye to help finance costs in connection with its construction of and relocation to a new facility (to be repaid gradually after construction is completed); and (ii) of the net profit (after tax) of the joint venture due the Company, 51% will be provided to Erye as part of the new facility construction fund and will be characterized as additional paid-in capital for the Company’s 51% interest in Erye. It was contemplated by the Joint Venture Agreement that the construction would continue for three years. As such, 45% of the dividend we would be entitled to by reason of our 51% ownership would remain in Erye through 2012 to complete the construction while EET would loan back their dividend during the same period at a prevailing bank interest rate. Upon a liquidity event of Erye, as contemplated in the joint venture agreement, the Company will be entitled to the return of its dividend reinvestments to the extent of the proceeds generated by the liquidity event. Repayment of such loans from EET would occur gradually after the construction is completed. In January 2011, a dividend totaling approximately $13,671,100 based on earnings for Fiscal Year 2009 was declared and approximately $6,698,800 was distributed to EET and lent back to Erye and approximately $6,972,300 due the Company was reinvested and re-characterized as additional paid-in capital in the business. In April 2011, a dividend totaling $10,259,700 based on earnings for Fiscal Year 2010 was declared and approximately $5,027,300 was distributed to EET and lent back to Erye, and approximately $5,232,400 due the Company was reinvested and re-characterized as additional paid-in capital in the business. A 10% withholding tax was required on dividends payable to the Company. As a result, Erye withheld approximately $1,220,500 in taxes related to the Company’s Fiscal Year 2009 and 2010 dividend amounts, and such amount has been paid to the local Chinese tax authorities as of December 31, 2011., 625643=The Company has agreed to issue equity to certain consultants and other service providers for services. Effective April 1, 2012, pursuant to a six month agreement for consulting services in investor relations and other specified related matters, the Company agreed to issue 72,000 shares of Restricted Common Stock, vesting ratably over the term of the agreement on a monthly basis. Also effective April 1, 2012, pursuant to an amendment to an agreement with a financial services consultant, the Company agreed to issue up to $7,500 of the consultant’s monthly invoices, in shares of Restricted Common Stock for the remaining eight months of the term. Effective April 11, 2012, the Company entered into a letter agreement with a service provider whereby the Company agreed to issue 34,406 shares of Restricted Common Stock as payment of services previously rendered. Effective April 12, 2012, pursuant to a three month agreement for consulting services in business and financial relations and other specified related matters, the Company agreed to issue 250,000 shares of the Company’s Restricted Common Stock, vesting as to 62,500 on the effective date and 62,500 on each of the first, second and third monthly anniversaries of the effective date. Effective April 25, 2012, pursuant to a six month agreement for consulting services in financial and investor public relations and other specified matters, the Company agreed to issue 120,000 shares of the Company’s Restricted Common Stock, vesting as to 20,000 shares on the effective date and 20,000 shares on each of the monthly anniversaries of the effective date throughout the term of the agreement. Effective April 30, 2012, pursuant to a one year agreement for consulting services in negotiation, drafting, the finalization of contracts and other specified matters, the Company agreed to issue a five year warrant to purchase 60,000 shares of Restricted Common Stock at $.36 per share, vesting ratably over the term of the agreement. The issuance of all such securities is or was subject to the approval of the NYSE Amex., 367375=At March 31, 2012, the outstanding options under the U.S. Equity Plan by range of exercise prices were as follows:, 484669=At March 31, 2012 and December 31, 2011, Erye owed EET, the 49% shareholder of Erye, approximately $21,293,100 and $20,862,700, respectively, which represents dividends paid and loaned back to Erye. At March 31, 2012 and December 31, 2011 the interest rate on this loan was 6.831% and 6.56% , respectively. In June 2011 Erye paid EET approximately $875,100 consisting of the net of the following: $1,115,000 of unpaid accrued interest at June 30, 2011, approximately $408,700 repayment of a non interest bearing loan due in 2011 and recovery of cash advances to EET of approximately $648,600. In December 2011 Erye paid EET approximately $125,100 of unpaid accrued interest with bank draft due in June 2012., 518386=We acquired our Pharmaceutical Manufacturing — China segment when on October 30, 2009, China Biopharmaceuticals Holdings, Inc. (“CBH”) merged with a wholly-owned subsidiary of NeoStem (the “Erye Merger”). As a result of the Erye Merger, NeoStem acquired CBH’s 51% ownership interest in Erye, a Sino-foreign joint venture with limited liability organized under the laws of the PRC. Erye was founded more than 50 years ago and represents an established, vertically-integrated pharmaceutical business. Historically, Erye has concentrated its efforts on the manufacturing and distribution of generic antibiotic products. In 2010, Erye began transferring its operations to its newly constructed manufacturing facility, as to which construction is now substantially completed. The relocation and the new production lines have been completed and received cGMP certification. As part of its plan to focus its business on capturing the paradigm shift to cell therapies following the January 2011 acquisition of PCT, the Company is pursuing strategic alternatives with respect to its interest in Erye., 292612=On October 31, 2007, PCT issued a note to borrow $3,120,000 (the “Note”) in connection with its $3,818,500 purchase of condominium units in an existing building in Allendale, New Jersey (the “Property”) that PCT uses as a laboratory and stem cell processing facility. The Note is payable in 239 consecutive monthly payments of principal and interest, based on a 20 year amortization schedule; and one final payment of all outstanding principal plus accrued interest then due. The current monthly installment is $20,766, which includes interest at an initial rate of 5.00%; the interest rate and monthly installments payments are subject to adjustment on October 1, 2017. On that date, upon prior written notice, the lender has the option to declare the entire outstanding principal balance, together with all outstanding interest, due and payable in full. The Note is secured by substantially all of the assets of PCT, including a first mortgage on the Property and assignment of an amount approximately equal to eighteen months debt service held in escrow. The Note matures on October 1, 2027 if not called by the lender on October 1, 2017. The note is subject to certain debt service coverage and total debt to tangible net worth financial covenant ratios measured semi-annually. PCT was not in compliance with such covenants at the measurement date of December 31, 2011, and obtained a covenant waiver letter from the lender for all periods through December 31, 2011. The outstanding balance was approximately $2,680,100 at March 31, 2012 of which $116,000 is payable within twelve months. On December 6, 2010 PCT Allendale, a wholly-owned subsidiary of PCT, entered into a note for a second mortgage in the amount of $1 million on the Allendale Property with TD Bank, N.A. This loan is guaranteed by PCT, DomaniCell (a wholly-owned subsidiary of PCT, now known as NeoStem Family Storage, LLC), Northern New Jersey Cancer Associates (“NNJCA”) and certain partners of NNJCA and is subject to a financial covenant starting December 31, 2011. PCT was not in compliance with such covenants at the measurement date of December 31, 2011, and obtained a covenant waiver letter from the lender for all periods through December 31, 2011. The loan is for 124 months at a fixed rate of 6% for the first 64 months. The loan is callable for a certain period prior to the interest reset date. The initial four months was interest only. The outstanding balance as of March 31, 2012 is $901,900 of which $77,700 is payable within twelve months. Both mortgages are classified as current liabilities as of March 31, 2012., 461099=In March 2011, the National Development and Reform Commission in China issued insurance reimbursement price cuts which impacted two of Erye products. The Company recognizes that there will be continuous pressure on Erye product pricing as a result of such actions., 592101=To support our liquidity needs, the Company raised an aggregate of approximately $9.1 million (or net proceeds of approximately $8.3 million) in 2012 through an underwritten public offering of common stock and warrants, and a private placement. In August 2011, the Department of Defense (DOD) Peer Reviewed Medical Research Program (PRMRP) of the Office of the Congressionally Directed Medical Research Programs (CDMRP) awarded NeoStem approximately $1.78 million to be applied towards funding the Company's VSEL TM Technology, which award will support an investigation of a unique stem cell population, Very Small Embryonic-Like (VSEL) stem cells, for its bone building and regenerative effects in the treatment of osteoporosis. In addition, in September 2011 we entered into the Purchase Agreement with Aspire Capital which provided that Aspire Capital is committed to purchase up to $20 million of shares of the Company’s common stock over the 24-month term of that Agreement, subject to certain terms and conditions, including a floor price, that is currently limiting its use. To date, the Company has not utilized this source of capital., 645456=Pursuant to the requirements of the Securities Exchange Act of 1934, the Registrant has duly caused this report to be signed on its behalf by the undersigned thereunto duly authorized., 597131=The following table reflects a summary of NeoStem’s significant contractual obligations and commitments as of March 31, 2012 (in thousands):, 581420=We anticipate that we will take further steps to raise additional capital in order to (i) fund the development of advanced cell therapies, particularly the development of AMR-001, and (ii) expand the PCT business, which may be used for certain aspects of the family banking business. To meet our short and long term liquidity needs, we currently expect to use existing cash balances and the growth of our revenue generating activities, and a variety of other means that could include, but not be limited to, the use of our current or other equity lines, potential additional warrant exercises, option exercises, issuances of other debt or equity securities in public or private financings, and/or sale of assets. We also continue to pursue strategic alternatives with respect to our 51% interest in Erye and anticipate we will have monetized our interests in Erye by the close of 2012, although no assurance can be given as to whether a sale will be consummated or the amount of funding such sale will provide. In addition, we will continue to seek as appropriate grants for scientific and clinical studies from the National Institutes of Health, Department of Defense, and other governmental agencies and foundations, but there can be no assurance that we will be successful in qualifying for or obtaining such grants. We also have $2.5 million recorded in other assets for restricted cash associated with our Series E Preferred Stock, which is held in escrow and will become available to meet current cash requirements in November 2012. The Series E also contains certain restrictive covenants that could limit our ability to use debt as a source of capital. Our history of operating losses and liquidity challenges, may make it difficult for us to raise capital on acceptable terms or at all. The demand for the equity and debt of small cap biopharmaceutical companies like ours is dependent upon many factors, including the general state of the financial markets. During times of extreme market volatility, capital may not be available on favorable terms, if at all. Our inability to obtain such additional capital could materially and adversely affect our business operations., 189782=NeoStem, Inc. (“NeoStem” or the “Company”) was incorporated under the laws of the State of Delaware in September 1980 under the name Fidelity Medical Services, Inc. The Company’s corporate headquarters are located at 420 Lexington Avenue, Suite 450, New York, NY 10170. The Company’s telephone number is (212) 584-4180 and its website address is www.neostem.com., 227980=The Company determined the fair value of funds invested in short term investments, which are considered trading securities, to be level 1 inputs measured by quoted prices of the securities in active markets. The short term investments are included within prepaids and other current assets on the balance sheet. The Company determined the fair value of funds invested in money market funds to be level 1. The Company determined the fair value of the embedded derivative liabilities and warrant derivative liabilities to be level 3 inputs. These inputs require material subjectivity because value is derived through the use of a lattice model that values the derivatives based on probability weighted discounted cash flows. The following table sets forth by level within the fair value hierarchy the Company’s financial assets and liabilities that were accounted for at fair value on a recurring basis as of March 31, 2012, and December 31, 2011 (in thousands):, 290213=In October 2011, Erye obtained a bank loan of approximately $8,641,600 from the CITIC Bank International according to People’s Bank benchmark interest rates with additional rate up to 10% and is due in October 2012., 496032=Expense incurred under operating leases was approximately $464,000 and $412,600 for the three months ended March 31, 2012 and March 31, 2011, respectively., 465212=Relevant PRC statutory laws and regulations permit payment of dividends by the Company’s PRC subsidiaries only out of their accumulated earnings, if any, as determined in accordance with PRC accounting standards and regulations. As a result of these PRC laws and regulations, the Company’s PRC subsidiaries are restricted in their ability to transfer a portion of their net assets either in the form of dividends, loans or advances. The restricted amount was $186,000 at March 31, 2012 and $185,000 at December 31, 2011., 350614=The Company’s results include share-based compensation expense of approximately $1,751,200 and $1,130,300 for the three months ended March 31, 2012 and 2011, respectively. Options vesting on the accomplishment of business milestones will not be recognized for compensation purposes until such milestones are deemed probable of accomplishment. At March 31, 2012 there were options to purchase 404,928 shares outstanding that will vest upon the accomplishment of business milestones and will be accounted for as an operating expense when such business milestones are deemed probable of accomplishment., 497362=In connection with the issuance to investors and service providers of many of the shares of the Company’s common stock and warrants to purchase common stock previously disclosed and described herein, the Company granted the holders registration rights providing for the registration of such shares of common stock and shares of common stock underlying warrants on a registration statement to be filed with the Securities and Exchange Commission (“SEC”) so as to permit the resale of those shares. Certain of the registration rights agreements provided for penalties for failure to file or failure to obtain an effective registration statement. With respect to satisfying its obligations to the holders of these registration rights, the Company has been in various situations. The Company had previously filed a registration statement as required for some of the holders, and in May 2011 filed a registration statement for all of the holders (except for holders whose shares of Common Stock were currently salable under Rule 144 of the Securities Act or who waived certain rights); such registration statement was declared effective by the SEC on September 30, 2011. The Company has certain obligations to maintain the effectiveness of this registration statement. Certain holders who had outstanding registration rights had previously waived their registration rights or were subject to lock-up agreements. No holder has yet asserted any claim against the Company with respect to a failure to satisfy any registration obligations. Were someone to assert a claim against the Company for breach of registration obligations, the Company believes it has several defenses that would result in relieving it from some or any liability, although no assurances can be given. The Company also notes that damage claims may be limited, as (i) most shares of Common Stock as to which registration rights attached are either now registered or currently salable under Rule 144 of the Securities Act or are otherwise currently subject to other restrictions on sale and (ii) the shares of Common Stock underlying warrants with registration rights are now registered, and during much of the relevant periods the warrants with registration rights generally have been out of the money, were subject to lock-up agreements and/or the underlying shares of Common Stock were otherwise subject to restrictions on resale. Accordingly, were holders to assert claims against the Company based on breach of the Company’s obligation to register, the Company believes that the Company’s maximum exposure would not be material., 437794=The following table summarizes the components of share-based compensation expense in the Consolidated Statements of Income for the three months ended March 31, 2012 and 2011 (in thousands):, 516173=The Company further strengthened its breadth in cellular therapies through its October 17, 2011 acquisition of Amorcyte, Inc. Amorcyte is a development stage cell therapy company focusing on novel treatments for cardiovascular disease. Amorcyte’s lead product candidate is AMR-001. In January 2012, Amorcyte commenced patient enrollment for its PreSERVE Phase 2 trial to investigate AMR-001’s ability to preserve heart function after a heart attack., 351446=The weighted average estimated fair value of stock options granted in the three months ended March 31, 2012 was $0.36. The fair value of options at the date of grant was estimated using the Black-Scholes option pricing model. The expected volatility is based upon historical volatility of the Company’s stock. The expected term is based upon observation of actual time elapsed between date of grant and exercise of options for all employees., 430501=The number of remaining shares authorized to be issued under the various equity plans at March 31, 2012 are as follows:, 422969=The total fair value of shares vested during the three months ended March 31, 2012 and 2011 was approximately $1,650,300 and $378,800, respectively., 210423=The preliminary fair value of assets acquired and liabilities assumed on October 17, 2011 is as follows (in thousands):, 243192=For those financial instruments with significant Level 3 inputs, the following table summarizes the activity for the three months ended March 31, 2012 by type of instrument (in thousands):, 533870=For the three months ended March 31, 2012 operating expenses totaled $12,166,700 compared to $12,390,100 for the three months ended March 31, 2011, representing an decrease of $223,400 or 2%., 297271=On November 19, 2010, the Company sold 10,582,011 Preferred Offering Units consisting of (i) one share (“Preferred Share”) of Series E 7% Senior Convertible Preferred Stock, par value $0.01 per share, of the Company, (ii) a warrant to purchase 0.25 of a share of Common Stock (consisting of at issuance an aggregate of 1,322,486 warrants, adjusted to an aggregate of 1,633,466 as of March 31, 2012); and (iii) 0.0155 of a share of Common Stock (an aggregate of 164,418 shares). Each Preferred Offering Unit was priced at $0.945 and total gross and net proceeds received by the Company were $10,000,000 and $8,876,700, respectively., 520293=Net loss for the three months ended March 31, 2012 was approximately $9,206,900 compared to $9,699,800 for the three months ended March 31, 2011. Our net loss from continuing operations for the three months ended March 31, 2012 and 2011 was approximately $7,483,200 and $8,771,000, respectively. Included in net loss are losses from discontinued operation of approximately $1,723,700 and $928,800 for the three months ended March 31, 2012 and 2011, respectively, related to the deconsolidation of our Regenerative Medicine – China segment in the first quarter of 2012. As a result, the results of the Regenerative Medicine – China segment are presented as discontinued operations for all periods presented., 11362=132,603,494 SHARES, $.001 PAR VALUE, AS OF May 4, 2012}",
    "textBeforeTable": "  The consolidated financial statements include the accounts of NeoStem, Inc. and its wholly owned and partially owned subsidiaries and affiliates as listed below:   Principles of Consolidation   The preparation of financial statements in conformity with generally accepted accounting principles in the United States of America requires management to make estimates and assumptions that affect the reported amounts of assets and liabilities and disclosure of contingent assets and liabilities at the date of the consolidated financial statements. Estimates also affect the reported amounts of revenues and expenses during the reporting period. Accordingly, actual results could differ from those estimates.   Use of Estimates   The accompanying unaudited Consolidated Financial Statements have been prepared in accordance with accounting principles generally accepted in the United States of America (“generally accepted accounting",
    "textAfterTable": "  8     Pursuant to the Joint Venture Agreement that governs the ownership and management of Erye, through 2012: (i) 49% of undistributed profits (after tax) will be distributed to Suzhou Erye Economy and Trading Co Ltd. (“EET”), the owner of the remaining 49% interest in Erye and loaned back to Erye for use in connection with its construction of the new Erye facility (to be repaid gradually after construction is completed); (ii) 45% of the net profit after tax due to the Company will be provided to Erye as part of the new facility construction fund, which will be characterized as paid-in capital for our 51% interest in Erye; and (iii) only 6% of the net profit will be distributed to us directly for our",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}