{
    "relation": [
        [
            "Patent application number",
            "20110166056",
            "20110175257"
        ],
        [
            "Description",
            "Injection Moulded Containers - A method of forming a water soluble container, comprising an injection moulded water soluble polymer, in which is present a fabric care, surface care or dishwashing composition, by injection moulding a thermoplastic material into a mould, wherein for or during the injection moulding process the mould is actively heated, the mould being at an elevated temperature, below the melting point of the thermoplastic material, throughout the injection moulding process.",
            "Injection Moulding Process - A method of forming an article by injection moulding a molten thermoplastic material into a mould, wherein for or during the injection moulding process the mould is actively heated, the mould being at an elevated temperature, below the melting point of the thermoplastic material, throughout the injection moulding process."
        ],
        [
            "Published",
            "07-07-2011",
            "07-21-2011"
        ]
    ],
    "pageTitle": "Huber, AT - Patent applications",
    "title": "",
    "url": "http://www.faqs.org/patents/inventor/huber-at-5/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042981856.5/warc/CC-MAIN-20150728002301-00339-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 435173201,
    "recordOffset": 435157235,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Markus Huber, Jagenbach AT 04-22-2010 GASIFIER - Described is a device for oxidizing a material comprising a material inlet port, a material outlet port and an oxidation zone extending therebeteween, the device comprising at least one nozzle unit ( 20100095592 Published Description Patent application number Marcel Bernard Huber, Flaurling AT 03-26-2009 METHOD AND INSTALLATION FOR THE PURIFICATION OF GAS - A method and an installation is provided for the purification of gas, in particular synthesis gas, from the gasification of sewage sludge. Scrubbing hydrogen sulfide and ammonia is performed successively from the gas in two gas scrubbers. 20090081094 Published Description Patent application number Marcel Huber, Flaurling AT 10-22-2009 Ski lift having an auxiliary conveyor floor - The present invention relates to a passenger transportation system, in particular a ski lift system in the form of a chair lift system or a circulating gondola lift system, having a main conveyor, in particular a chair lift or a circulating gondola lift, having a boarding/disembarking platform to board and/or alight from the main conveyor moving past the boarding/disembarking platform as well as having an auxiliary conveyor in the form of a conveyor floor for the conveying of persons to and/or from the boarding/disembarking platform. It is proposed in accordance with the invention that the conveyor floor describes a curved conveyor path which includes a first conveyor path",
    "textAfterTable": "Markus Huber, Sommerein AT Patent application number Description Published 20110162869 PROCESS FOR PRODUCING A POLYMER AND A POLYMER FOR WIRE AND CABLE APPLICATIONS - The invention relates to a process for producing a cable in a continuous vulcanization (CV) line, which cable comprises a conductor surrounded by one or more layers, 07-07-2011 20110168427 PROCESS FOR PRODUCING A POLYMER AND A POLYMER FOR WIRE AND CABLE APPLICATIONS - The invention relates to a method for producing a polymer using a chain transfer agents. In particular, the invention relates to a process for polymerizing a polymer in the presence of a mixture of at least two chain transfer agents, which mixture comprises 07-14-2011 Markus Huber, Wagrain AT Patent application number Description Published 20080219820 Work machine, preferably a wheeled loader - The present invention relates to a work machine, preferably a wheeled loader, having a bucket which is movable via lifting arms having at least one lift cylinder, on the one hand, and which is pivotable via a tilt mechanism actuable via at least one tilt cylinder, on the other hand, having a selectable fully automatic or semi-automatic bucket filling process in which the bucket is movable by a superimposition of the tilt movement of the bucket and of the lift movement of the lifting arm for the filling. In accordance with the invention, material-dependent target tilt cylinder",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}