{
    "relation": [
        [
            "Game",
            "Athletics",
            "Basketball",
            "Ball Badminton",
            "Football",
            "Hockey",
            "Cricket",
            "Chess",
            "Volleyball",
            "Table tennis",
            "Tennis",
            "Rowing, Boxing"
        ],
        [
            "Trophies",
            "4",
            "6",
            "1",
            "5",
            "3",
            "3",
            "6",
            "6",
            "5",
            "3",
            "1"
        ],
        [
            "University players",
            "15",
            "5",
            "4",
            "8",
            "6",
            "5",
            "3",
            "5",
            "4",
            "2",
            "6"
        ]
    ],
    "pageTitle": "Loyola Alumni Bulletin 2011",
    "title": "",
    "url": "http://www.loyolacollege.edu/AlumniBulletin2011.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042982745.46/warc/CC-MAIN-20150728002302-00278-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 566501430,
    "recordOffset": 566485036,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{40191=The year 2010-2011 has been another year of Loyola dominance in the sporting arena. The past year has seen all the teams from various disciplines, grow from strength to strength and in the process bring laurels to the college and all involved with sports in Loyola. There has been a conscious effort from the sports department to instil a very high level of professionalism, which today has become a pre-requisite to perform at the highest level. This approach has borne fruit and has resulted in Loyola College being one of the top sporting outfits in the country., 28458=REV. DR. FRANCIS P XAVIER, SJ has put in 18 years of service in the Department of Physics. He was our former Provincial of Madurai Jesuit Province (1999-2005) known for radical leadership. Option for the poor is his byline. During summer, he visits Boston College, USA as a visiting Scientist. He is much sought-after as resource person for many conferences and workshops. He is the founder-Director of Loyola Institute of Frontier Energy (LIFE) multidisciplinary facility started in 1995 at Loyola College. To top it all, currently he is the founder-director of Loyola-ICAM College of Engineering and Technology., 34808=Loyola Alumni Association (LAA) is one of the very active wings of the Loyola College. The total membership of the Association is 24,857 as on 12th August 2011. Nearly 2258 fresh graduates have become members of Alumni Association in the current academic year alone., 38396=We are extremely happy to invite you for the 13th South Zone Jesuit Alumni/ae Congress at St. Joseph's Boys' High School, Bangalore on 8th & 9th October 2011., 36058=JAAI: Sixth National Congress of JAAI was held in St. Xavier's High School, Patna from 4th to 6th Feb 2011. Rev Dr. G. Joseph Antony Samy SJ, Deputy Director, Loyola Alumni Association participated in it. \u0093 Public-Private Partnership for Better Education \u0094 was the theme of the Congress., 13211=The World Loyola Alumni/ae Congress in August 2010 has given an added impetus to and insight into the whole movement of our Alumni Association besides strengthening the local units in the respective states. This rejuvenation also has brought in lot more expectations and set your alma mater's goals still higher in terms of academic- research orientation, the need of preparing quality student leaders for the nation, the urgency of capacitating the staffs and also the importance of placing Loyola on a solid financial ground. On all fronts, I am sure, your continued support and encouragement by way of offering creative suggestions, innovative proposals and contribution will go a long way to empower your alma mater., 35452=World Loyola Alumni/ae Congress 2010: Loyola Alumni Association conducted Alumni Congress 2010 on 28th August 2010. Nearly 3200 alumni/ae participated in that mega event which was first of its kind., 35821=LOHO\u00962011: The usual gathering of the former Loyola Hostelites was held in Trichy with the theme 'REWIND @ ROCKFORT', on January 8th and 9th, 2011.  , 36836=Alumni Bulletin: The Bulletin was brought out in August 2010, it was circulated to all the life members and also it was sent by email to all the new graduates.  , 32276=2005, 31794=2011, 37370=Endowment Lecture: Rev. Fr. Jerome D' Souza, S.J. Endowment Lecture (2010-2011) was delivered by Mr. N. Vaghul, Former Chairman, ICICI Bank on 7th March 2011.  , 463=August 2011, 31233=Loyola College has continued to remain for the past 10 years in the list of the top 10 colleges in India ranked by India Today (see the issue of July 18 2011)., 13973=B.Com. Batch of 1967 in Dec. 2010, Botany Alumni Reunion in Feb.2011, LOHO Meet on January 8-9, 2011, Rev. Fr. Jerome D' Souza, SJ Endowment Lecture (2010-2011) on 7th March-2011 are some of the key events of Alumni Association. The Student Directory 2010 was released in the CD format on the Graduation Day held on 12th March 2011 and the same was distributed to the new graduates. Of course, the reach out of the Alumni to the poor and marginalized students is the best part of glimpses of \u0091hopes' and \u0091joys'. In deed such acts are ever more laudable in nature and content. Certainly each of you is kept in our prayers and is fondly remembered for these noble acts., 4213=It is our pleasure and privilege to thank Rev. Dr. Mudiappasamy Devadoss SJ. on behalf of the Loyola Alumni Association for his service as Provincial from Nov. 2005 till 28th May 2011. As a man of obedience he plunged himself into the task of governing the Province. He believed in the group process and called for frequent consultation; he set in motion a system of governing where in there was greater transparency and dialogue. He had endless patience in negotiations; he evinced deep respect for the mystery of each person. Together with offering our deep debt of gratitude to him we assure him of our prayers and good wishes that he continues to be ever available to God's Mission wherever he is ! The Loyola Alumni Association wishes him all the best in his new ventures., 31972=2009, 32124=2007, 24971=Prof. Lawrence Jayakumar HOD, Media Arts, 32048=2008, 32200=2006, 31408=India Today Ranking (2002 to 2011) Loyola College position, 32504=2002, 46972=The Chief Guest for the Inauguration of the Loyola Students' Union 2011-2012 was  Thiru. T. Rajendran,  ADGP \u0096 Intelligence, Govt. of TN, and a distinguished alumnus of our college. Thiru. T. Rajendran administered the oath to the newly elected members of the Students' Union for the year, 2011-2012, as given below:, 51032=May all the souls rest in peace., 37619=Student Directory 2010: On the Graduation Day 2010 (12th March 2011), the Student Directory 2010, was distributed to the new graduates in the CD form., 19354=I am very happy to speak to you through this Alumni Bulletin in August 2011. The World Loyola Alumni Congress organized on 28, August 2010 by the Loyola Alumni Association is still fresh in our memory. About 3000 alumni/ae attended the Alumni Congress and shared their experiences. Loyola College is proud of each and every one of you., 34387=Source: India Today Magazine, May - July 2002 to 2011, 46844=Students' Union 2010-2011, 21889=At the outset, Let me extend a heart-felt thanks to you all for your contributions to the growth of our college as well as to the Loyola Alumni Association in the academic year 2010-2011. My heart is filled with joy to share my vision for the academic year 2011-12. Every page of our life is like a matchstick in the matchbox. How sweet our life can be, if we can lead a quite life like these, matchsticks, always ready and willing to serve others. ''How blessed are we if we, instead of cursing darkness give light to others, atleast like a glow-worm. If we can not be a fire, we can be a candle in the darkness. This is my prayer for you,\", 32428=2003, 2636=From January 1998 to June 1999, he served as the National Secretary for the Apostolic Visitation of Seminaries, commissioned by the Holy See. In June 1999, he took over as the first Director of NISCORT (National Institute of Social Communication, Research and Training), run by CBCI. From January 2006 to May 2011, he was the Director of Xavier Institute of Management (XIMJ), Jabalpur, an Institute owned by the Jesuits of Madhya Pradesh., 32352=2004, 31883=2010}",
    "lastModified": "Tue, 19 May 2015 14:18:02 GMT",
    "textBeforeTable": "India Today Ranking (2002 to 2011) Loyola College position Loyola College has continued to remain for the past 10 years in the list of the top 10 colleges in India ranked by India Today (see the issue of July 18 2011). Loyola on Top Loyola Alumni Association takes this opportunity to thank them for their dedicated service at Loyola College and wishes them a happy retired life. We also welcome them to take active participation in the activities of Loyola Alumni Association. MR. M. THOMAS has put in 20 years of service as a gardener in our college. MR. K. S. GEORGE has put in 24 years of official service in our College. He served in the Department of Chemistry for more than 30 years, and promoted to our College Office. He is soft spoken, honest and sincere in his work. His loyalty to the College is highly commendable. He is a dedicated staff member, highly cooperative with all his colleagues. MR. D. JAMES has put in 39 years of service in our College Office. He retired as the Office Superintendent. He performed his duties always with a smile. He is a dedicated staff member, highly co-operative with all his colleagues. His sense of belonging and loyalty to the college is highly",
    "textAfterTable": "Loyola Alumni Association Loyola Alumni Association (LAA) is one of the very active wings of the Loyola College. The total membership of the Association is 24,857 as on 12th August 2011. Nearly 2258 fresh graduates have become members of Alumni Association in the current academic year alone. NEW FEATURES New Deputy Directors: Rev Dr. G. Joseph Antony Samy SJ and Rev. Fr. Joseph Antony Jacob, SJ have been appointed as Deputy Directors of LAA. World Loyola Alumni/ae Congress 2010: Loyola Alumni Association conducted Alumni Congress 2010 on 28th August 2010. Nearly 3200 alumni/ae participated in that mega event which was first of its kind. REGULAR FEATURES Meetings LOHO\u00962011: The usual gathering of the former Loyola Hostelites was held in Trichy with the theme 'REWIND @ ROCKFORT', on January 8th and 9th, 2011.   JAAI: Sixth National Congress of JAAI was held in St. Xavier's High School, Patna from 4th to 6th Feb 2011. Rev Dr. G. Joseph Antony Samy SJ, Deputy Director, Loyola Alumni Association participated in it. \u0093 Public-Private Partnership for Better Education \u0094 was the theme of the Congress. Reunions B.Com. Batch of 1967 held its Reunion on 18th December 2010, 25 members came for the gathering. Botany Alumni Reunion 2011 was held on 14th February 2011, 100 members attended the gathering. From Alumni",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}