{
    "relation": [
        [
            "Categories",
            "Great for these types of students",
            "Tips for prospective students",
            "Bang for the buck",
            "Am enjoying being here",
            "Am learning a lot"
        ],
        [
            "Comments",
            "If you are a student that loves to have a social life, yet have a good education this is great for you. Mostly African-Americans attend this school, but we welcome any and everybody.",
            "If you are able to get a car, it would be wise to do so if you are not a fan of walking. If you can't, save up money for gas if you know people that drive and cabs if they are unavailable.",
            "It may be a little expensive to attend VSU, especially if you're an out-of-state student like myself, but it is all worth it. You will have a great and traditional college experience, as well as earn a great education.",
            "I love it here and I'm so glad that I go to VSU! You meet great people here and in a lot of cases, some people become like family to you. I have made some mistakes, but that was all my fault and I am changing that. You just have to be focused here and do not be afraid to ask people for help. A lot of people are willing to help you any way that they can if you're willing to help yourself. I would not trade this experience for the world!",
            "I have learned so much while being here at VSU. You are able to get to know most of your professors and it is very easy to find help; all you have to do is ask. It is also easy to get distracted by the great party scene but that is up to you and you only. If you can balance your work and social life you will be fine."
        ]
    ],
    "pageTitle": "Virginia State University (VSU) Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Virginia-State-University/reviews",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042982745.46/warc/CC-MAIN-20150728002302-00074-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 896440943,
    "recordOffset": 896369853,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{265483=Don't ever step on the Trojan head. It brings bad luck., 312188=Never step on the Trojan Heads that are strategically placed around campus., 144398=You can go to Richmond and go shopping and partying. But there are parties on campus. The football games is always fun. Also the Trojan Explosion., 345776=Trojan corner is unique to me. I like that they use the phrase corner it shows a sense of gathering and coming together., 85951=One of the big traditions you will know about VSU is the Trojan heads. They were painted by the men of Omega Psi Phi inc. and they are dedicated the the fallen members of their organization. Now the tradition is to never step on a Trojan head, because if you do you will be delayed from graduation by a semester or up to a year. Now is is an urban myth but hey why mess with it?, 63369=i do not live on campus but only for the reason that i live close to the university. the school is currently expanded their dorm life and they will be done by summer 2012. the buildings look incredible and will hold thousands of students., 28479=You can step on the Trojan Head on campus. If your not in Betterment of Brothers and Sisters you cant say BBS. Football players come out like Greeks People hang condoms from the tree near the bookstore., 255281=1. When you get confused seek help from your R.A's and teachers, someone is always there to help. 2. Take advantage of the time brackets teachers and the university gives before things such as money or assignments are due. 3. Go to as many social events in the first week as you can, interact with your Trojan fam. 4. The library is your best friend ! especially the private rooms., 119911=Stepping on the Trojan head is a no no!, 327872=It is imperative that yo never step n the Trojan heads around campus. It is only 3 but you cannot step on them. Legend has it if you do, you will have to repeat a semester each time you step., 362577=There are a TON of organizations to join - academic and social. The most popular or active organizations on campus are the social orgs. Next, there are many activities hosted on campus mainly by TAB (Trojan Activities Board). They do comedy shows monthly and carnivals each semester. Next you have organizations such as SLOT (Student Liaison Outreach Team) and Kerojo and Urban Coture ( Modeling Orgs), as well as ABSTRAKT. These organizations also provide entertainment through a variety of events and forums. For example, SLOT hosts socials - which are basically on campus parties. There's always a great turn out., 22101=Virginia State University is a four-year Historically Black College University. This university offers over 30 majors and is well known around the states. Being a Trojan can be exciting and very beneficial. Everywhere I go I always see and V.S.U alumni and/or student., 181546=Virginia State University offers many opportunities to college students both academically as well as with entertainment. The professors are willing to help you if you need it. Trojan Pride!, 342435=Virginia State University deserves about four, and this is because no school is perfect. This school has spirit and motivation to anyone who steps foot on the Trojan ground. This school will successfully present thousands of career opportunities with each of the credited schools., 252530=Don't step on the Trojan heads. This was the first warning we received, no one usually purposely steps on them until they graduate. Also the plantation ( idk why they call it that ) behind VA hall is a hot spot for some tryna get away from the craziness of the campus., 255846=Virginia State is a great place to study, but if your the type of person to frazzled easy don't come. There is always going to be something that goes wrong, but for the most part you find people who can go through it with you. I love VSU, but its truly not for everyone; If you feel your a Trojan join the fam., 39001=Its not wise to step on the trojan head its a tradition every time you step on the head, you will be here an extra semester., 27050=Alpha Phi Alpha Fraternity, Founded 1906, Cornell University Alpha Kappa Alpha Sorority, Founded 1908, Howard University Kappa Alpha Psi Fraternity, Founded 1911, Indiana University Omega Psi Phi Fraternity, Founded 1911, Howard University Delta Sigma Theta Sorority, Founded 1913, Howard University Phi Beta Sigma Fraternity, Founded 1914, Howard University Zeta Phi Beta Sorority, Founded 1920, Howard University Sigma Gamma Rho Sorority, Founded 1922, Butler University Iota Phi Theta Fraternity, Founded 1963, Morgan State University, 259256=If you step on any of the Trojan heads, it will take an extra year to graduate!!!, 177113=Never step on the Trojan heads!, 262808=One of the best HBCUs in the country. Once you become a Trojan, you become a part of a close family at VSU. Definitely a place that strives to build a better world., 360116=Virginia State University is a beautiful campus with wonderful surroundings. The people there are respectful and accept you with open arms never have to feel out of place. Very warm environment I look forward to becoming a Trojan., 167118=Do not step on the Trojan head or you'll stay an extra year. Myth, 92648=There are plenty of Organizations on VSU's campus. We have Organizations such as The Betterment of Brothers and Sisters Inc, True Foundation, Selected Ones, A Movement Walking, and SLOT. All the organizations previously stated help promote shcool spirit and spread awareness throughout the campus. There are dance groups such as AbstraXt and Panic 2000. We also have greek organizations if you are interested in that as well., 172058=And unusual tradition for Virginia State would be to not step on the big Trojan heads painted on the ground by the dining area. It's been told that if u step on a Trojan head then you're going to be spending and additional semester on campus., 293546=I love being a member of the Trojan Family and attending all the different events held. I give our university a 5 out of 5 I am glad to be true to the Orange and Blue, 179510=Don't step on the Trojan Head., 359269=Fun activities to do at Virginia State University is seeing the Trojan explosion and going to the football games and watching the woo woo's perform also going to basketball games and homecomings, concerts and more., 19294=Lets go Trojan Pride! Virginia State University is an excellent school to attend. There are varies activities for any and everyone to be able to get involved. There are over 30 majors to choose from. This four year university has a lot to offer to every student who attend here. The faculty is the best. You can build a personal relationship with all your professors and other Trojans. There all kinds of things to do on campus so that you will not be bored. There is NO CURFEW.Here at Virginia State University our motto is Dream. Explore. Learn., 296238=Do not step on the Trojan heads its a rumor that you won't graduate on time, 371834=© 2015, Cappex.com, LLC, 79804=There are various Trojan heads painted on the campus grounds. Rumor has it that if you step on the heads then you will not graduate., 315785=Don't Step on the Trojan Head, or you'll be at VSU for another year., 122244=Dont be afraid to ask questions if your unsure about something... its i guess bad luck to step on the Trojan heads that painted on the grounds...Make sure you get validated early., 18745=Virginia State University has three Trojan Heads on the campus. It is said that if you step on any of the three you will be held back an extra semester. This myth has been tested and is true. Therefore students avoid stepping on any part of the Trojan Head., 290577=The school store has special deals on items for students and visitors alike. Around the school there are places that accept Trojan dollars (Money students usually use in the school store) as a way of payment.}",
    "textBeforeTable": "08/11/2009 Reviewer is A current student here. 32 out of 34 people found this review useful. 1 of 89 Jasmine from Springfield, NJ Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5",
    "textAfterTable": "Login to rate or flag the reviews Chasity from Midlothian , VA 07/25/2009 Reviewer is A current student here. 12 out of 13 people found this review useful. 2 of 89 Categories Comments Great for these types of students Minority Students, Intellectual students who are focused on their studies,Virginia and non-Virginia residents, and Athletes. Tips for prospective students Virginia State offers everything a prospective student is interested in. From the comfortable residence Halls to the amazing three story library that is useful for every course not just literature and essays. Make sure to take advantage of the resources available such as the sisip program and the academic support center. You will love Virginia State University! Bang for the buck Although I am an instate student I have many friends who pay out of state tuition and we all agree on one thing: Virginia State University is worth every penny that we pay. We are employed by campus departments we enjoy the food and rooms and as",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}