{
    "relation": [
        [
            "Categories",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "I love to go to PCC library and read. Their library is beautiful and clean!",
            "Pcc offers great food!",
            "They do not offer dorms",
            "Most teachers are good at explaining and very helpful.",
            "Meet up with a career counselor there, they are great at guiding you. Take advantage of the free online tutoring PCC. Also try to visit the reference library when needed. They are great at helping you plus most teachers will give extra credit just for visiting!",
            "Portland Community College is a great college. It is affordable and the professors are great. There are many great programs you can sign up for!"
        ]
    ],
    "pageTitle": "Portland Community College Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Portland-Community-College/reviews?_escaped_fragment_=/show/53011",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 125,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042981856.5/warc/CC-MAIN-20150728002301-00276-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 911259779,
    "recordOffset": 911162322,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{55336=not to sure what this means but i'm getting good grades and have not been to school before this since, 2005., 330534=I love the Winter Powwow that takes place every January in the Health Technology building (Sylvania campus). The energy of the event will no doubt have your feet tapping. Best of all is the delicious frybread!, 414099=PCC is the perfect college for anyone who wishes to save money, get a quality education or work while going to school. I graduated in 2010 from high school and have been working part-time while going to school full time. Only PCC would've made this possible for me., 543572=At 92 dollars a credit, PCC definitely comes out cheaper than 2 years at a regular college. Unfortunately, it is pretty expensive as far as Community Colleges go and the price is sure to continue to go up. It has been doing so consistently for the last decade. In 2004 the classes were 44 dollars a credit., 445591=Tuition for a full-time student is on average only a little over $1000. For the quality of faculty and facilities that come with this price I'd say it's well worth the cost., 571272=© 2015, Cappex.com, LLC}",
    "textBeforeTable": "10/18/2010 Reviewer is A current student here. 7 out of 7 people found this review useful. 1 of 141 Jakob from Portland, OR Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5",
    "textAfterTable": "Kathy from Portland, OR 12/02/2010 Reviewer is A current student here. 5 out of 5 people found this review useful. 2 of 141 Categories Comments Great for these types of students Students who are unsure about what major they want to focus on, Students looking to obtain an associates degree, Students looking to transfer to a 4-year college. Tips for prospective students Put your admissions application in early, always check on financial aide. They are a lot of students who attend PCC and admissions rate goes up every year. If there is ever something you are unsure of, don't hesitate to ask, any staff member would be gladly to assist - they always have a smile on their face whenever I ask questions. Bang for the buck Most of the teachers teach at Portland State University as well, so we have the same instructors teaching our classes at a much lower cost. Any science instructor I've had, has their PhD and has done a lot of research on their field of study - so",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}