{
    "relation": [
        [
            "Categories",
            "Campus Safety",
            "Greek Life",
            "Clubs and Activities",
            "Great for these types of students",
            "Share any unusual traditions or locations on campus",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "Security on duty all day everyday, patrol campus regularly, emergency call boxs on every building on campus. Wherever you are on campus you can see a blue light that shows where the emergency call boxes are located.",
            "We have four social soroities (Alpha Chi Omega, Sigma Sigma Sigma, Kappa Delta, and Alpha Sigma Alpha) and four social fraternities (Sigma Nu, Phi Delta Theta, Delta Sigma Theta, and Sigma Phi Epsilon)",
            "There is a club for anything and everything you can think of and if we don't have it, then you can make it happen.",
            "Learn best in smaller classes",
            "Beaver Point is an on campus cabin near the lake that students can go to study, throw horseshoes or play volleyball. The location is often reserved by clubs and organizations for events.",
            "There are a ton of on campus activities sponsored by the college. The college often has deals with local businesses so that students can also have a little free/cheap off campus fun. Such as, kings dominion trips, bowling nights, Hillcats games, etc.",
            "There are a lot of options as to where students can eat. The cafeteria has fresh food everyday and a make-your-own sandwich and salad bar with lunch meats from Boars Head. Westover, where students can use meal exchanges, have multiple meal options. Brewed Awakenings is a little cafe located in an academic building. The Hornet Shop, that also allows meal exchanges, have quick meals to grab in between classes. Finally, Rollie Polie, a local sandwich shop, serves wraps and stays open late.",
            "The dorm rooms are pretty big compared to the other colleges that I looked at. Cleaning people are really nice. There are a lot of options for where you can live. There are 2 freshman dorms, 4 upper-classman dorms, 2 apartment buildings and a lot of on campus houses that upper-classman can live in as well.",
            "Study a lot.",
            "Lynchburg College was the best choice for me. The professors are hands on and know you by name. It's easy to concentrate with less people in each class."
        ]
    ],
    "pageTitle": "Lynchburg College Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Lynchburg-College/reviews?_escaped_fragment_=/show/30656",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042981856.5/warc/CC-MAIN-20150728002301-00324-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 912765263,
    "recordOffset": 912728610,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{154207=© 2015, Cappex.com, LLC, 17939=LC has given me the opportunity to delve into different areas of study. Class ratios average 13:1 which makes for more individualized attention. Our professors are available outside of classtime to assist in areas we may be struggling in. We also have an awesome peer to peer tutoring program}",
    "textBeforeTable": "08/21/2009 Reviewer is A current student here. 11 out of 11 people found this review useful. 1 of 33 Charles from Danville, VA Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp",
    "textAfterTable": "Bang for the buck LC offers great scholarships, especially for in-state residents. Make sure you keep pushing the Financial Aid office looking for more scholarships; usually they will offer more if you insist. For the price of the school (or any price really), you are getting a great education. Am enjoying being here The people at LC are very friendly and open. Because the campus is relatively small (about 2,000 undergrads), it's hard to walk anywhere without seeing someone you know. Am learning a lot LC has some excellent faculty members who are really willing to work one-on-one with students as long as students are willing to put forth an effort. Login to rate or flag the reviews Caitlin from Springfield, VA 01/03/2011 Reviewer is A current student here. 5 out of 5 people found this review useful. 3 of 33 Categories Comments Great for these types of students",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}