{
    "relation": [
        [
            "Property",
            "User ID",
            "Enable User",
            "Username",
            "Change Password",
            "New Password",
            "Confirm New Password"
        ],
        [
            "Description",
            "Contains one of 16 preset User ID numbers. This field cannot be edited.",
            "When checked, indicates that the user's access to the iDRAC is enabled. When unchecked, user access is disabled.",
            "Specifies an iDRAC user name with up to 16 characters. Each user must have a unique user name. NOTE: User names on the iDRAC cannot include the / (forward slash) or . (period) characters. NOTE: If the user name is changed, the new name will not appear in the user interface until the next user login.",
            "Enables the New Password and Confirm New Password fields. When unchecked, the user's Password cannot be changed.",
            "Enables editing the iDRAC user's password. Enter a Password with up to 20 characters. The characters will not display.",
            "Retype the iDRAC user's password to confirm."
        ]
    ],
    "pageTitle": "Configuring the iDRAC Using the Web Interface: Integrated Dell\u0099 Remote Access Controller Firmware Version 1.2 User Guide",
    "title": "",
    "url": "https://stuff.mit.edu/afs/athena/dept/cron/documentation/dell-server-admin/en/idrac1/chap05.htm",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042982745.46/warc/CC-MAIN-20150728002302-00186-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 893286531,
    "recordOffset": 893264915,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{76255=The time, in seconds, that a connection is allowed to remain idle. The session is cancelled when the timeout is reached. Changes to the timeout setting take affect immediately and will reset the web server. Timeout range is 60 to 1920 seconds. The default is 300 seconds., 79760=The telnet idle timeout, in seconds. Timeout range is 60 to 1920 seconds. Enter 0 seconds to disable the Timeout feature. The default is 0., 78229=The secure shell idle timeout, in seconds. Timeout range is 60 to 1920 seconds. Enter 0 seconds to disable the Timeout feature. The default is 300.}",
    "lastModified": "Mon, 11 Aug 2008 10:43:16 GMT",
    "textBeforeTable": "Table 5-1. Network Settings  Click the appropriate button to continue. See Table 5-3. When you have completed entering the required settings, click Apply. Table 5-1 and Table 5-2 describe the Network Settings and IPMI LAN Settings on the Network page. Click the Network/Security tab to open the Network Configuration page. Click System® Remote Access® iDRAC. NOTE: Most DHCP servers require a server to store a client identifier token in its reservations table. The client (iDRAC, for example) must provide this token during DHCP negotiation. The iDRAC supplies the client identifier option using a one-byte interface number (0) followed by a six-byte MAC address. NOTE: You must have Configure iDRAC privilege to perform the following steps. Configuring the Network and IPMI LAN Settings This section assumes that the iDRAC has already been configured and is accessible on the network. See Configure iDRAC Networking for help with the initial iDRAC network configuration. Configuring the iDRAC NIC",
    "textAfterTable": "Use DHCP to obtain DNS server addresses Enable DHCP to obtain DNS server addresses by selecting the Use DHCP to obtain DNS server addresses checkbox. When not using DHCP to obtain the DNS server addresses, provide the IP addresses in the Static Preferred DNS Server and Static Alternate DNS Server fields. The default is off. NOTE: When the Use DHCP to obtain DNS server addresses checkbox is selected, IP addresses cannot be entered into the Static Preferred DNS Server and Static Alternate DNS Server fields. Static Preferred DNS Server Allows the user to enter or edit a static IP address for the preferred DNS server. To change this setting, first deselect the Use DHCP to obtain DNS server addresses checkbox. Static Alternate DNS Server Uses the secondary DNS server IP address when Use DHCP to obtain DNS server addresses is not selected. Enter an IP address of 0.0.0.0 if there is no alternate DNS server. Register iDRAC on DNS Registers the iDRAC name on the DNS server. The default is Disabled. DNS iDRAC Name Displays the iDRAC name only when",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}