{
    "relation": [
        [
            "Categories",
            "Campus Safety",
            "Greek Life",
            "Clubs and Activities",
            "Great for these types of students",
            "Share any unusual traditions or locations on campus",
            "Bang for the buck",
            "What to do for fun",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "Safety officers are always visible",
            "No Greek life",
            "Some sports, but there are many clubs based off of food and others that are not like Zumba and yoga",
            "Great for students looking to join the culinary industry and hospitality",
            "The school has classes that start at 1 in the morning. It's like a really restaurant or bakery.",
            "The best chefs teach our classes",
            "There is the mall, the Vanderbilt and FDR mansions, and a recreational center. There is plenty of dining around the campus as well",
            "The school is the top of its class. No other school can compare.",
            "I believe the school is great! It can get a little old fashioned at times but overall the experience is amazing. The school really prepares us for the culinary world"
        ]
    ],
    "pageTitle": "Culinary Institute of America (CIA) Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Culinary-Institute-of-America/reviews?_escaped_fragment_=/show/69097",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042981856.5/warc/CC-MAIN-20150728002301-00053-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 897068648,
    "recordOffset": 897016153,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{258278=© 2015, Cappex.com, LLC, 207781=Just try, I applied June 2nd and started school June 18th. It never hurts to try., 113726=I start on January 22 2013 but heard it was really good.}",
    "textBeforeTable": "07/06/2009 Reviewer is A current student here. 48 out of 48 people found this review useful. 1 of 57 Kristopher from Chesterbrook, PA Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code",
    "textAfterTable": "Bang for the buck For over $30,000 a year, it is a bit pricey. We are known to be The World's Premier Culinary College. We have the most Certified Master Chef/Bakers on campus, compared to any other location. The majority of the instructors/professors have industry experience which lend to lots of recommendations, suggestions, and networks. On the other hand it is quite inconvenient that in my dorm we only have one working washing machine out of three. Three are not even enough for the whole building. The internet service is sort of shotty, it is sometime very unreliable which is very annoying. For that price tag it should be fully functional 24/7. The meal plan is on and off for me. IT is great to have a bountiful cuisine choice for lunch and dinner, but the menus cycle every three weeks, which can become very boring. After externship we have a meal swipe which can be used at the Apple Pie Cafe or Courtside Cafe, which its great but at Apple Pie a swipe, which is equivalent to $8 it is not even enough to get a sandwich and a soda. Am enjoying being here I absolutely love being here. There is an awesome view and you are surrounded by nature with the Hudson River viewable from some dorms. It is very picturesque.",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}