{
    "relation": [
        [
            "Patent application number",
            "20080313471",
            "20100064158",
            "20110066785",
            "20110066795",
            "20110066812",
            "20110093640",
            "20110219272",
            "20110243568",
            "20110246681",
            "20110255873",
            "20120084469",
            "20120084471",
            "20120084485"
        ],
        [
            "Description",
            "ELECTRONIC SYSTEM AND DIGITAL RIGHT MANAGEMENT METHODS THEREOF - An electronic system is provided, in which a smart chip, a smart chip controller, a processor, a system memory, and an access management module is provided. The smart chip controller communicates with the smart chip. The processor performs a mutual authentication with the smart chip. The system memory is accessible to the smart chip and the processor. The access management module is coupled between the processor and the smart chip controller. The access management module prevents the processor accessing a certain range of the system memory according to a block command from the smart chip controller, in response of that the mutual authentication between the processor and the smart chip is failed.",
            "METHOD AND CONTROLLER FOR POWER MANAGEMENT - Resuming from a sleep state. A request may received to resume operation of a computer system from a sleep state to an executing state. A restoring process may be initiated to restore the computer system to an executing state. The restoring process may include loading information from a nonvolatile memory medium to a computer system memory medium. A request may be received from a processor of the computer system to access the computer system memory medium. The request may require access to a portion of the computer system memory medium in the executing state, and may be received prior to completion of the restoring process. It may be determined if the portion of the computer system memory medium has been restored. If the portion of the computer system memory medium has not been restored, the portion of the computer system memory medium may be restored from the nonvolatile memory medium ahead of other portions in the restoring process.",
            "Memory Management System and Method Thereof - A memory management system and method include and use a cache buffer (such as a table look-aside buffer, TLB), a memory mapping table, a scratchpad cache, and a memory controller. The cache buffer is configured to store a plurality of data structures. The memory mapping table is configured to store a plurality of addresses of the data structures. The scratchpad cache is configured to store the base address of the data structures. The memory controller is configured to control reading and writing in the cache buffer and the scratchpad cache. The components are operable together under control of the memory controller to facilitate effective searching of the data structures in the memory management system.",
            "STREAM CONTEXT CACHE SYSTEM - The present invention is directed to a stream context cache system, which primarily includes a cache and a mapping table. The cache stores plural stream contexts, and the mapping table stores associated stream context addresses in a system memory. Consequently, a host may, according to the content of the mapping table, directly retrieve the stream context that is pre-fetched and stored in the cache, rather than read the stream context from the system memory.",
            "TRANSFER REQUEST BLOCK CACHE SYSTEM AND METHOD - The present invention is directed to a transfer request block (TRB) cache system and method. A cache is used to store plural TRBs, and a mapping table is utilized to store corresponding TRB addresses in a system memory. A cache controller pre-fetches the TRBs and stores them in the cache according to the content of the mapping table.",
            "Universal Serial Bus Host Controller and Control Method Thereof - A USB host controller is provided. The USB host controller is capable of communicating with multiple USB apparatuses having endpoints and sends a request to a first endpoint. The USB host controller includes a first storage and a first control unit. The first control unit stores endpoint information from the first endpoint into the first storage when the first endpoint issues an unready transaction packet in response to the request. The unready transaction packet indicates that the first endpoint is not ready.",
            "Data Transmission System and Method Thereof - A data transmission system is provided. The data transmission system includes a first control circuit coupled to a first device, a translation circuit coupled to the first control circuit and a second control circuit coupled to the translation circuit. The first control circuit decodes a first format data packet sent by the first device. The translation circuit receives the decoded first format data packet and translates the decoded first format data packet into a second format data packet. The second control circuit transmits the second format data packet to a host. A data transmission rate of the first device is slower than that of a second device, and the data transmission system is backward compatible to the first device.",
            "BACKWARD COMPATIBLE OPTICAL USB DEVICE - An optical USB device includes an electro-optical converter configured to receive optical signals from an optical fiber and to convert them into first electrical signals and configured to receive second electrical signals and to convert them into optical signals for transmission to the optical fiber. A USB 3.0 pin-compatible connector is coupled to the electro-optical converter. The pin-compatible connector is configured for coupling to a USB 3.0 connector of another USB device. The pin-compatible connector includes a first pair of pins configured for transmitting the first electrical signals from the optical USB device. The pin-compatible connector also includes a second pair of pins configured for receiving the second electrical signals into the optical USB device. The pin-compatible connector also includes a third pair of pins configured for transceiving third electrical signals according to a non-USB serial bus interface protocol to control and configure the electro-optical converter.",
            "APPARATUS INTEROPERABLE WITH BACKWARD COMPATIBLE OPTICAL USB DEVICE - An apparatus configured to couple to a universal serial bus (USB) 3.0 connector. The apparatus includes a management controller configured to couple to the USB 3.0 connector. The management controller is configured to detect from behavior on the D+ and D− pins of the USB 3.0 connector whether a device plugged into the USB 3.0 connector is a conventional USB 3.0 device or an optical USB device.",
            "Optical Transceiver Modules and Systems and Optical Transceiving Methods - An optical transceiver module includes a receiving unit, a transmission driving unit, and a terminal control unit. The receiving unit outputs a receiver lost signal. The transmission driving unit includes a positive receiving signal terminal and a negative receiving signal terminal. The terminal control unit is coupled between the positive receiving signal terminal and the negative receiving signal terminal. The terminal control unit controls whether a differential terminator impedance is coupled between the positive receiving signal terminal and the negative receiving signal terminal according to the receiver lost signal.",
            "USB TRANSACTION TRANSLATOR AND A BULK TRANSACTION METHOD - The present invention is directed to a universal serial bus (USB) transaction translator and an associated IN/OUT bulk transaction method. A device interface is coupled to a device via a device bus, and a host interface is coupled to a host via a host bus, wherein the host USB version is higher than the device USB version. At least two buffers configured to store data are disposed between the device interface and the host interface. A controller stores the data in the buffers alternately. In a bulk-IN transaction, before the host sends an IN packet, the controller pre-fetches data and stores the data in the buffers until all the buffers are full or a requested data length has been achieved; the pre-fetched data are then sent to the host after the host sends the IN packet. In a bulk-OUT transaction, the controller stores the data sent from the host in the buffers, and the data are then post-written to the device.",
            "USB TRANSACTION TRANSLATOR AND A MICRO-FRAME SYNCHRONIZATION METHOD - The present invention is directed to a universal serial bus (USB) transaction translator and a micro-frame synchronization method. A device interface is coupled to a device via a device bus, and a host interface is coupled to a host via a host bus, wherein the host USB version is higher than the device USB version. At least two buffers configured to store data are disposed between the device interface and the host interface. A controller stores the data in the buffers alternately. A start-of-frame (SOF) counter is used to count the SOF packets, wherein the counting value of the SOF counter is compared to a predefined value. Specifically, the controller resets a SOF timer for sending the SOF packet when the counting value achieves the predefined value or is greater than the predefined value, such that the SOF packet and an isochronous timestamp packet (ITP) from the host are sent at the same time. Further, the controller delays the sending of the SOF packet for a period of time according to the ITP from the host.",
            "USB TRANSACTION TRANSLATOR AND AN ISOCHRONOUS-IN TRANSACTION METHOD - The present invention is directed to a universal serial bus (USB) transaction translator and an associated IN isochronous transaction method. A device interface is coupled to a device via a device bus, and a host interface is coupled to a host via a host bus, wherein the host USB version is higher than the device USB version. At least two buffers configured to store data are disposed between the device interface and the host interface. A controller stores the data in the buffers alternately. A register is used to record device bus information. Before the host sends an IN packet, the controller pre-fetches data from the device according to the device bus information and then stores the data in the buffers; the controller responds with the pre-fetched data to the host after the host sends the IN packet."
        ],
        [
            "Published",
            "12-18-2008",
            "03-11-2010",
            "03-17-2011",
            "03-17-2011",
            "03-17-2011",
            "04-21-2011",
            "09-08-2011",
            "10-06-2011",
            "10-06-2011",
            "10-20-2011",
            "04-05-2012",
            "04-05-2012",
            "04-05-2012"
        ]
    ],
    "pageTitle": "Lai, Taipei - Patent applications",
    "title": "",
    "url": "http://www.faqs.org/patents/inventor/lai-taipei-4/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042981856.5/warc/CC-MAIN-20150728002301-00231-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 433764971,
    "recordOffset": 433734330,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Jiin Lai, Taipei TW 05-24-2012 TELESCOPIC PROBE MONITORING SYSTEM FOR RIVERBEDELEVATION MONITORING AT BRIDGE PIERS - A telescopic probe monitoring system for riverbed elevation monitoring at a bridge pier is revealed. The system includes a measurement module for measuring riverbed elevation under water and a control module. The measurement module includes a housing, a multi-layer tube, a driving member with scales, a photographic unit for capturing images, and a sensing unit. The control module controls the driving member to extend the multi-layer tube. Thus the sensing unit on the bottom of the multi-layer tube contacts the riverbed and then sends a sensing signal to the control module for stopping pushing the multi-layer tube and controlling the photographic unit to capture images of the driving member. According to the images and movement of the measurement module, the control module learns the riverbed elevation and sends the riverbed elevation to a remote monitor unit for real-time monitoring of the riverbed elevation. 20120127300 Published Description Patent application number Jihn-Sung Lai, Taipei TW 01-20-2011 ASSEMBLY OF MAGNETIC CAPACITOR WITH PACKAGING - An assembly of an magnetic capacitor with a packaging comprises: a magnetic capacitor; two packing electrodes, one of the two end electrodes including an upper magnetic casing installed upon a top surface of the capacitor and a lower magnetic casing installed at a lower surface of the capacitor; each of the upper magnetic casing and the lower magnetic",
    "textAfterTable": "Patent applications by Jiin Lai, Taipei TW Jin-Mei Lai, Taipei TW Patent application number Description Published 20120302624 BIOMARKER FOR IDENTIFYING SUBGROUP OF EARLY-STAGE LUNG ADENOCARCINOMA PATIENTS - The preset invention relates to a biomarker for identifying the subgroup of early-stage lung adenocarcinoma patients in early-stage non-small cell lung cancer (NSCLC), which is T-lymphokine-activated killer cell-originated protein kinase (TOPK), and a therapeutic target for lung cancer. 11-29-2012 Jiunn-Yiing Lai, Taipei TW Patent application number Description Published 20080239411 IMAGE SCANNER HAVING MULTIPLE SCANNING WINDOWS - Systems and methods associated with image scanner are disclosed herein. In one embodiment, an image scanner comprises a first image-receiving end configured to move in a scanning direction and to receive image data of a first portion of the scanned object, a second image-receiving end disposed downstream of the first image-receiving end in the scanning direction and configured to move along the scanning direction and to receive image data of a second portion of the scanned object. The scanner can further comprise a first photoelectric conversion device configured to synchronously move with the first image-receiving end for converting the image data of the first portion of the",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}