{
    "relation": [
        [
            "Categories",
            "Share any unusual traditions or locations on campus",
            "Bang for the buck",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "There is this motion that we do to display our school spirit; we SWOOP! You will just have to see it for yourself!",
            "The school is the average cost of any other Florida state college, but with that tuition it includes many free facilities like the brand new state of the art gym they built in the last year. It is fantastic!",
            "There are many clubs and teams to join and there is always something going on. The beach is just a short drive away, St. Augustine is not too far away, and there is a huge plaza with hundreds of shops right outside the campus!",
            "They offer many small chain restaurants such as; chick fil a, starbucks, and many other shops. the main eating hall is huge two-story all-you-can eat buffet with an array of different stations of food selections.",
            "I have not yet stayed in the dorms, but they do offer a roommate search on their website that can help you find roommates that are compatible to your living habits.",
            "Regardless, no matter where you go, college is always going to be difficult. There will be easy, medium, and hard courses you can take depending on your major and class choices. As long as you put in the effort you will be just fine. they also offer many student academic aid such as tutors, and help from your professors.",
            "The more you put in, the more you will get out of this college, so be sure to try new things and join some clubs or teams or organizations, but just make sure you do not over extend yourself.",
            "As soon as I visited this school I fell in love! The campus is beautiful, the classes are small and personal, and the people are all about friendliness and making sure they go out of their way to help you. As soon as you step into the student services office, the environment is close and personal."
        ]
    ],
    "pageTitle": "University of North Florida (UNF) Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/University-of-North-Florida/reviews?_escaped_fragment_=/show/28281",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 125,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042982745.46/warc/CC-MAIN-20150728002302-00018-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 904142479,
    "recordOffset": 904007438,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{237783=UNF is currently building a new dining facility to be open in August of 2013. It will be four stories with different stations ranging from pizza to organic foods. Dining on campus is not just for freshman but something every student at UNF takes advantage of!, 476401=The food and dining options on campus are not bad. You have a few Starbucks and Outtakes to choose from as well as a Quiznos and a couple other small vendors located in the cafeteria. I've heard rumors of a Chick-fil-a coming to campus Spring 2013. Beware of high prices $$$ especially at Starbucks., 220256=There are multiple options for dining and living on campus that are acquainted with the students pockets. On campus living has great dorms that range from 1500 to 3500 dollars depending on the dorm. Food is the cheapest in the cafeteria and I enjoyed most of the dishes. On nights where I did not care for the food I would go to the multiple other restaurants in the student union and dorm lobby., 619734=After the first month, you get really accustomed with the type of food that the cafe will provide. Freshman year you'll gradually be more willing to spend your money on Chick-fil-A, Boathouse and DEFINITELY Ozzie's (located in the fountains and opened until 3:00 a.m. Therefore, if you're not going to spend majority of your time in the cafe, don't get a meal plan for more than 10 to 14 meals a week., 300195=The school is very small but planning to enlarge itself within the next few years. A new gym has been built, that people who have toured it says is awesome, as well as a new cafe, which we dont know about yet, all opening fall of 2012. The only downside is watching out for goose poop!, 236152=UNF is located on a nature preserve, we sit on 1300 acres, 350 of those acres will never be built on because those are what we call wetland areas. UNF is located in Jacksonville, which is the largest city in the nation by means of area the city covers, and yet UNF is able to maintain a quaint atmosphere even though the campus is surrounded by a huge city on the outside of campus., 202871=The only negative is tuition has been set to go up 15% in the coming 2012-2012 school year., 725817=© 2015, Cappex.com, LLC, 576197=Being located right outside of Jacksonville, there are plenty of things to do downtown like hit shows, clubs, or bars. The beach is conveniently located ten minutes away and there are multitudes of movie theaters and bowling allies to play at. Of course, there are always parties on the weekends and weekdays. Furthermore, I think the gym is fun and UNF has a state of the art gym built in 2012. For nature lovers, there are always kayaks available to rent for free if your a student not to mention the miles of nature trails located on campus. Then there is the game room which is well equipped to satisfy all of your gaming needs., 422153=There are emergency phones all over campus. The crime rate though varies. In 2011, there seemed to be a lot of crime that happened late at night., 87967=There are so many choices here from the meal plan to Outtakes which is a convenience store on-campus. Chick-Fil-A recently opened in the Fall 2013 but it's an express store so no options for gluten-free folk like myself (grilled nuggets) unless you want to eat salad. I brought my lunch for this reason and because eating on campus is pricey. They do have gluten-free stuff at the Osprey Cafe, I was told, but I haven't eaten there, yet., 283553=There are so many ways to have fun at UNF. There are concerts such as LMFAO and Cobra Starship, comedy shows and famous comedians such as Ralphie May, movie nights, free food cookouts, intramural sports, school sports games, and so much more! I love the on-campus environment so much. There is always something to do before class, in-between, or at night., 272121=Great for students who love a friendly and peaceful environment. There are new facilities opening in the Fall 2012 that are supposed to be wonderful., 577868=Dorm life at UNF is actually surprisingly good because it is such a new school. It was built around 30 years ago which is extremely young compared to ancient campuses like UF and FSU. Iv been to both the dorms in UF and FSU, who's dorms pale in comparison to UNF's. Only one building at UNF believes in public bathrooms while almost all dorms at UF and FSU use public bathrooms. Furthermore, a housing unit called the fountains was just built on UNF's campus in 2010 and just about the nicest dorm unit i have seen. The fountains contains its own lazy river, game room, and gym., 365123=The school has a three floor dining area that they are opening Fall 2012. I went to orientation for 2 days and the cafeteria food was amazing. I was hoping it was like High School food, and it's nothing like it!}",
    "textBeforeTable": "06/19/2009 Reviewer is Accepted here and planning to attend soon. Reviewer has been to campus. 32 out of 35 people found this review useful. 1 of 168 Kasey from Soddy Daisy, TN Check out reviews left by other students or leave your own review. You could win a free scholarship. University of North Florida Reviews University of North Florida › Florida › By State › Colleges › } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.create',",
    "textAfterTable": "Am enjoying being here Lazy River pool! Great people Several organized events AND concerts! Am learning a lot Take advantage of professor's office hours!! They are more than willing to sit down with you! Login to rate or flag the reviews Lindsay from Orange Park, FL 08/18/2011 Reviewer is A current student here. 19 out of 19 people found this review useful. 3 of 168 Categories Comments Great for these types of students Students who enjoy the rush of a busy campus life, and those who are dedicated to putting time away for study hours. Tips for prospective students Leave your house/dorm/apartment early enough to beat the morning class traffic. Parking is limited so if you do not have a premium parking pass, you will have to purchase a daily pass for $3.00 and park in the parking lots in the back. From there if you do not feel like walking you",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}