{
    "relation": [
        [
            "Categories",
            "Campus Safety",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "Great campus safety all day. Security is always near by anway on campus.",
            "Campus activities are plentiful.",
            "Food in the cafeteria is excellent. You have several choices to pick from. There is a variety of food for anyone who attends Chattanooga State.",
            "There are no campus dorms.",
            "Chattanooga State is very well academically challenging. There are many challanges in every program. In the end, hard work will pay off.",
            "Studying hard is always going to be the most important thing. Going to class is just as important though. Using other materials then the book and teacher are helpful.",
            "Chattanooga State is a great school to attend. It has amazing teachers, small classes, and great education programs. I love that it is not a overly crowded school."
        ]
    ],
    "pageTitle": "Chattanooga State Community College Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Chattanooga-State-Community-College/reviews?_escaped_fragment_=/show/118911",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042982745.46/warc/CC-MAIN-20150728002302-00279-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 894426243,
    "recordOffset": 894384713,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{169176=© 2015, Cappex.com, LLC}",
    "textBeforeTable": "08/05/2009 Reviewer is A current student here. 7 out of 7 people found this review useful. 1 of 40 Megan from Manchester, TN Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for",
    "textAfterTable": "Categories Comments Campus Safety prominent but never bothering students. it's a very safe campus. Greek Life none Clubs and Activities the school offers a lot of clubs and you can sign up to do all kinds of free activities with the school around chattanooga. Great for these types of students students pursuing nursing will really enjoy this campus. Share any unusual traditions or locations on campus the smoking shelter is a joke. its really little and in the mud haha. Bang for the buck book store located across the street sells our school books for so much cheaper. go there!! What to do for fun really big computer, it's an easy way to meet people. music is always playing outside. ping pong table is outside year round as well. racketball court and a gym. Food and Dining cannot complain about the food. breakfast is always a must if you get to the campus early. the food is very well priced",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}