{
    "relation": [
        [
            "Days",
            "30",
            "50",
            "150",
            "200"
        ],
        [
            "BSE",
            "164.33",
            "161.65",
            "160.01",
            "157.16"
        ],
        [
            "NSE",
            "164.37",
            "161.66",
            "159.92",
            "157.11"
        ]
    ],
    "pageTitle": "Omkar Speciality Chemicals Stock Price, Share Price, Live BSE/NSE, Omkar Speciality Chemicals Bids Offers. Buy/Sell Omkar Speciality Chemicals news & tips, & F&O Quotes",
    "title": "",
    "url": "http://www.moneycontrol.com/india/stockpricequote/chemicals/omkarspecialitychemicals/OSC01",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042981856.5/warc/CC-MAIN-20150728002301-00265-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 599006391,
    "recordOffset": 598956580,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{135060=28 July 2015, 221185=Omkar Special is in the Chemicals sector. The current market capitalisation stands at Rs 379.05 crore. The company management includes Pravin S Herlekar - Chairman & Managing Director, Omkar P Herlekar - Whole Time Director, Suhas M Rane - Ind. Non-Executive Director, Subhash P Mali - Ind. Non-Executive Director, Vikas N Telvekar - Ind. Non-Executive Director, Anjali P - Additional Director, Laxmikant Kabra - Addnl.Non Exe.Independent Director, Sitendu Sharma - Addnl. & Ind.Director, Sanjivani S Patare - Independent Director, Rishikesh P Herlekar - Executive Director, Prakash H Rao - Executive Director, Vikas G Gadre - Independent Director, Subhash N Ghalke - Independent Director. It is listed on the BSE with a BSE Code of 533317 and the NSE with an NSE Code of OMKARCHEM. Its Registered office is at B-34, MIDC, Badlapur (E), Thane,Maharashtra - 421503. Their Registrars are Bigshare Services Pvt. Ltd., 136278=JSWSteel Jul Fut, 219876=Zensar Technologies Recommended on Mar 24th 2015, 135571=UnitedBrewerie Jul Fut}",
    "textBeforeTable": "Edit Watchlist Have you invested in these stocks? You can track them better in your Portfolio close[x] Add to Watchist Account Optional Optional Optional Optional Add to Portfolio OR Add to watchlist } $('#mcpcp_addprof_info').hide(); { function close_info()",
    "textAfterTable": "Keep me signed in Forgot Password? New to Moneycontrol - Sign up now Its easy and FREE! Username Username should be atleast 4 characters Password Password should be 6 to 10 characters Confirm Password Email OR connect with LIVE",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}