{
    "relation": [
        [
            "Insider / Pro Group Participation:",
            "",
            "Name",
            "Wallington Investment Holdings Ltd."
        ],
        [
            "",
            "Insider=Y /",
            "ProGroup=P",
            "Y"
        ],
        [
            "",
            "",
            "# of Shares",
            "6,000,000"
        ]
    ],
    "pageTitle": "TSX Venture Exchange Daily Bulletins | news.sys-con.com",
    "title": "",
    "url": "http://news.sys-con.com/node/3044811",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042982745.46/warc/CC-MAIN-20150728002302-00103-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 175732903,
    "recordOffset": 175677276,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{851=88 CAPITAL CORP. (\"EEC\") BULLETIN TYPE:  Consolidation BULLETIN DATE:  April 4, 2014 TSX Venture Tier 2 Company, 310=Effective at the opening, Monday, April 7, 2014, the shares of 88 Capital Corp. will commence trading on TSX Venture Exchange on a consolidated basis. The Company is classified as a 'mineral exploration / development' company., 588=Pursuant to a special resolution passed by the board of directors on March 17, 2014, the Company has consolidated its capital on an eight (8) old for one (1) new basis.  The name of the Company has not been changed., 1063=VANCOUVER, April 4, 2014 /CNW/ -}",
    "TableContextTimeStampAfterTable": "{95293=Further to TSX Venture Exchange's Bulletin dated December 3, 2013, trading in the securities of the Resulting Issuer will resume at the opening on Monday, April 7, 2014., 22487=For further information please read the Company's news releases dated March 4, 2014 and March 14, 2014 which are available on SEDAR under the Company's profile., 30834=RESSOURCES FREYJA INC. (« FRA ») TYPE DE BULLETIN : Émission d'actions en paiement de primes DATE DU BULLETIN : Le 4 avril 2014 Société du groupe 2 de TSX croissance, 83942=SAHARA ENERGY LTD. (\"SAH\") BULLETIN TYPE:  Halt BULLETIN DATE:  April 4, 2014 TSX Venture Tier 2 Company, 23058=TSX Venture Exchange has accepted for filing documentation with respect to the first tranche of a Non-Brokered Private Placement announced January 23, 2014:, 3405=Pursuant to a resolution passed by the Directors on January 8, 2014, the Company has changed its name as follows.  There is no consolidation of capital., 114314=Hampton Securities Limited, BT Global Growth Inc. and RangerCap Inc. ont reçu collectivement une commission de 216 600 $, un remboursement des dépenses légales et de travail encourus d'environ 40 000 $, 381 200 bons de courtier non-transférables au prix d'exercice de 0,50 $ par action pendant 18 mois suivant la clôture du placement privé et 500 000 bons de courtier de performance au prix d'exercice de 0,50 $ par action jusqu'au 31 mars 2016, sur une base post-consolidation., 66224=These warrants were issued pursuant to a private placement of 8,185,165 shares with 8,185,165 share purchase warrants attached, which was accepted for filing by the Exchange effective October 23, 2013., 97932=Hampton Securities Limited, BT Global Growth Inc. and RangerCap Inc. collectively received a commission of $216,600, reimbursement of legal fees and work fees of approximately $40,000, 381,200 non-transferable broker warrants at an exercise price of $0.50 per share for 18 months following the closing date of the Private Placement and 500,000 broker performance warrants at an exercise price of $0.50 until March 31, 2016, on a post-consolidation basis., 71635=QUATTRO EXPLORATION & PRODUCTION LTD. (\"QXP\") BULLETIN TYPE:  Private Placement-Non-Brokered, Convertible Debenture/s BULLETIN DATE:  April 4, 2014 TSX Venture Tier 2 Company, 13123=TSX Venture Exchange has accepted for filing a subscription agreement dated November 13, 2013, as amended (the \"Agreement\") between Blue River Resources Ltd. (the \"Company\") and Global Resources Investment Trust plc (\"GRIT\"), an investment trust registered in England and Wales and listed on the London Stock Exchange's main market.  Under the Agreement the Company acquired 359,515 ordinary shares (the \"GRIT Shares\") in the capital of GRIT at a deemed price of £1.00 per GRIT Share in exchange for 10,000,000 common shares in the capital of the Company at a price of CDN$0.067 per common share., 61369=The above is in compliance with Trading Rule C.2.18 – Expiry Date: Trading in the warrants shall be for cash for the three trading days preceding the expiry date and also on expiry date. On the expiry date, trading shall cease at 12 o'clock noon E.T. and no transactions shall take place thereafter except with permission of the Exchange., 111573=Suite au bulletin de la Bourse de croissance TSX daté du 3 décembre 2013, la négociation des titres de l'émetteur résultant sera reprise à l'ouverture des marchés le lundi 7 avril 2014., 16403=CHLORMET TECHNOLOGIES INC. (\"CMT\") BULLETIN TYPE:  Halt BULLETIN DATE:  April 4, 2014 TSX Venture Tier 2 Company, 44021=RESSOURCES FREYJA INC. (« FRA ») TYPE DE BULLETIN: Placement privé sans l'entremise d'un courtier DATE DU BULLETIN : Le 4 avril 2014 Société du groupe 2 de TSX Croissance, 111929=Bourse de croissance TSX a accepté le dépôt de la documentation en vertu d'un placement privé par l'entremise d'un courtier, tel qu'annoncé 2 décembre 2013. Ce placement privé fut complété dans ThermoCeramix les 24 décembre 2013 et 13 février 2014. Les titres de ThermoCeramix émis en vertu de ce placement privé furent convertis en titres de l'émetteur résultant lors de la clôture de l'opération admissible, comme suit:, 125797=TSX Venture Exchange has accepted for filing documentation with respect to a Non-Brokered Private Placement announced April 22, 2013:, 7922=BARKER MINERALS LTD. (\"BML\") BULLETIN TYPE:  Private Placement-Non-Brokered BULLETIN DATE:  April 4, 2014 TSX Venture Tier 2 Company, 21297=DISCOVERY-CORP ENTERPRISES INC. (\"DCY\") BULLETIN TYPE:  Property-Asset or Share Purchase Agreement BULLETIN DATE:  April 4, 2014 TSX Venture Tier 2 Company, 30514=For more information regarding the debenture offering, please refer to the Company's press releases dated November 28, 2013, December 10, 2013, January 10, 2014 and March 3, 2014., 55558=RESSOURCES FREYJA INC. (« FRA ») TYPE DE BULLETIN : Convention d'achat de propriété, d'actif ou d'actions DATE DU BULLETIN : Le 4 avril 2014 Société du groupe 2 de TSX Croissance, 95087=For further information, please refer to the Company's Filing Statement dated March 26, 2014, available on SEDAR., 21573=TSX Venture Exchange has accepted for filing a subscription agreement dated November 13, 2013, as amended January 31, 2014 (the \"Agreement\") between Discovery-Corp Enterprises Inc. (the \"Company\") and Global Resources Investment Trust plc (\"GRIT\"), an investment trust registered in England and Wales and listed on the London Stock Exchange's main market.  Under the Agreement the Company will acquire 280,449 ordinary shares (the \"GRIT Shares\") in the capital of GRIT at a deemed price of £1.00 per GRIT Share in exchange for 3,000,000 common shares in the capital of the Company at a price of CDN$0.17 per common share., 43846=The Company has confirmed the closing of the above-mentioned Private Placement by way of a news release dated March 3, 2014., 22804=EQUITORIAL EXPLORATION CORP. (\"EXX\") BULLETIN TYPE:  Private Placement-Non-Brokered BULLETIN DATE:  April 4, 2014 TSX Venture Tier 2 Company, 77341=TSX Venture Exchange has accepted for filing documentation with respect to a Non-Brokered Private Placement announced March 13, 2014:, 66787=NORTHERN GOLD MINING INC. (\"NGM\") BULLETIN TYPE:  Private Placement- Non-Brokered BULLETIN DATE:  April 4, 2014 TSX Venture Tier 2 Company, 16035=For further information please read the Company's news releases dated November 14, 2013, January 23, 2014 and March 7, 2014 which are available on SEDAR under the Company's profile., 131229=The shares of the Company were listed on TSX Venture Exchange on May 4, 2012.  The Company, which is classified as a Capital Pool Company ('CPC'), is required to complete a Qualifying Transaction ('QT') within 24 months of its date of listing, in accordance with Exchange Policy 2.4., 92994=TSX Venture Exchange has accepted for filing the Company's Qualifying Transaction (\"QT\") described in its Filing Statement dated March 26, 2014.  As a result, at the opening on Monday, April 7, 2014, the Company will no longer be considered as a Capital Pool Company., 65698=October 18, 2016, 25182=FREYJA RESOURCES INC. (\"FRA\") BULLETIN TYPE: Shares for Bonuses BULLETIN DATE: April 4, 2014 TSX Venture Tier 2 Company, 58183=Pour de plus amples renseignements, veuillez-vous référer aux communiqués de presse émis par la société les 5 février et 3 mars 2014., 67070=TSX Venture Exchange has accepted for filing documentation with respect to a Non-Brokered Private Placement announced November 18, 2013:, 109278=L'opération admissible consiste en l'acquisition auprès de personnes sans lien de dépendance, via une fusion, de la totalité des titres émis et en circulation de ThermoCeramix, Inc. (« ThermoCeramix ») par l'émission de : (a) 26 274 409 actions ordinaires au prix réputé de 0,50 $ par action, (b) 2 637 945 options d'achat d'actions incitatives ayant des prix d'exercices variant entre 0,16 $ et 0,60 $ par action et des dates d'expiration ne dépassant pas le 14 novembre 2023, (c) 53 100 bons de souscription  au prix d'exercice de 0,50 $ par action jusqu'au 17 décembre 2015, (d) 381 200 bons de courtier ayant un prix d'exercice de 0,50 $ pendant 18 mois suivant la clôture du placement privé décrit ci-dessous et (e) 500 000 bons de courtier de performance ayant un prix d'exercice de 0,50 $ jusqu'au 31 mars 2016. Les titres décrits ci-dessus ont été émis sur une base post-consolidation. La transaction décrite ci-dessus inclut les titres émis en vertu du placement privé de ThermoCeramix décrit à la section « Placement privé par l'entremise d'un courtier » de ce bulletin., 92526=THERMOCERAMIX CORPORATION (\"TCX\") [formerly Springrock Capital Inc. (\"SGK.P\")] BULLETIN TYPE: Qualifying Transaction-Completed/New Symbol, Resume Trading, Private Placement-Brokered, Name Change and Consolidation BULLETIN DATE: April 4, 2014 TSX Venture Tier 2 Company, 93371=The QT consists of the arm's length acquisition, by way of merger, of all the issued and outstanding securities of ThermoCeramix, Inc. (\"ThermoCeramix\") through the issuance of: (a) 26,274,409 common shares  at a deemed price of $0.50 per share, (b) 2,637,945 incentive stock options at exercise prices varying between $0.16 and $0.60 per share with expiry dates up to November 14, 2023, (c) 53,100 warrants having an exercise price of $0.50 per share until December 17, 2015, (d) 381,200 broker warrants having an exercise price of $0.50 for 18 months following the closing date of the private placement described below, and (e) 500,000 broker performance warrants having an exercise price of $0.50 until March 31, 2016. The securities described above were issued on a post-consolidation basis. The above-described transaction includes the securities issued pursuant to a private placement of ThermoCeramix described at the section \"Private Placement-Brokered\" of this bulletin., 2511=282541 20 0, 125480=UNISERVE COMMUNICATIONS CORPORATION (\"USS\") BULLETIN TYPE:  Private Placement-Non-Brokered, Convertible Debenture/s BULLETIN DATE:  April 4, 2014 TSX Venture Tier 1 Company, 17421=TSX Venture Exchange has accepted for filing documentation with respect to a Non-Brokered Private Placement announced March 14, 2014:, 290913=Terms of Use & Our Privacy Statement - About Newsfeeds / Videofeeds. Copyright ©1994-2015 Ulitzer, Inc. All Rights Reserved. All marks are trademarks of Ulitzer, Inc. Reproduction in whole or in part in any form or medium without express written permission of Ulitzer, Inc. is prohibited., 8199=TSX Venture Exchange has accepted for filing documentation with respect to a Non-Brokered Private Placement announced February 17, 2014:, 85000=Further to the bulletin dated March 28, 2014, TSX Venture Exchange has accepted an amendment to the Non-Brokered Private Placement announced March 7, 2014 and March 18, 2014.  The amendment relates to the allocation of finder's fee warrants.  All other terms are unchanged:, 65105=October 23, 2013    , 84161=Effective at 5:00 a.m., PST, April 4, 2014, trading in the shares of the Company was halted at the request of the Company, pending news.  This regulatory halt is imposed by Investment Industry Regulatory Organization of Canada, the Market Regulator of the Exchange pursuant to the provisions of Section 10.9(1) of the Universal Market Integrity Rules., 89399=TSX Venture Exchange has accepted for filing documentation with respect to a Non-Brokered Private Placement announced March 12, 2014:, 88654=TSX Venture Exchange has accepted for filing the Company's proposal to issue 200,000 bonus shares at a deemed price of $0.05 per share to two lenders in consideration of unsecured loans totaling $50,000.  The loans are due on August 31, 2014 and bear interest at a rate of 10% per annum., 125207=Effective at 5:00 a.m., PST, April 4, 2014, shares of the Company resumed trading, an announcement having been made., 132132=Published April 4, 2014 \u0096 Reads 807 Copyright © 2014 SYS-CON Media, Inc. — All Rights Reserved. Syndicated stories and blog feeds, all rights reserved by the author., 130754=This private placement closed on September 3, 2013., 84707=SKYHARBOUR RESOURCES LTD. (\"SYH\") BULLETIN TYPE:  Private Placement-Non-Brokered, Amendment BULLETIN DATE:  April 4, 2014 TSX Venture Tier 2 Company, 131568=The records of the Exchange indicate that the Company has not yet completed a QT.  If the Company fails to complete a QT by its 24-month anniversary date of May 5, 2014, the Company's trading status may be changed to a halt or suspension without further notice, in accordance with Exchange Policy 2.4, Section 14.6., 36250=FREYJA RESOURCES INC. (\"FRA\") BULLETIN TYPE:  Private Placement-Non-Brokered BULLETIN DATE:  April 4, 2014 TSX Venture Tier 2 Company, 3066=AFTERMATH SILVER LTD. (\"AAG\") [formerly Full Metal Zinc Ltd. (\"FZ\")] BULLETIN TYPE:  Name Change BULLETIN DATE:  April 4, 2014 TSX Venture Tier 2 Company, 12820=BLUE RIVER RESOURCES LTD. (\"BXR\") BULLETIN TYPE:  Property-Asset or Share Purchase Agreement BULLETIN DATE:  April 4, 2014 TSX Venture Tier 2 Company, 35844=Pour de plus amples renseignements relativement à ce financement par débentures, veuillez référer aux communiqués de presse de la société datés du 28 novembre 2013, 10 décembre 2013, 10 janvier 2014 et 3 mars 2014., 115699=Les actions ordinaires de « ThermoCeramix Corporation » seront admises à la négociation à la Bourse de croissance TSX à l'ouverture des marchés le lundi 7 avril 2014, et les actions de « Springrock Capital Inc. » seront retirées de la cote., 17140=CRAILAR TECHNOLOGIES INC. (\"CL\") BULLETIN TYPE:  Private Placement-Non-Brokered BULLETIN DATE:  April 4, 2014 TSX Venture Tier 2 Company, 58462=GROUNDSTAR RESOURCES LIMITED (\"GSA\") BULLETIN TYPE:  Normal Course Issuer Bid BULLETIN DATE:  April 4, 2014 TSX Venture Tier 2 Company, 52627=FREYJA RESOURCES INC. (\"FRA\") BULLETIN TYPE:  Property-Asset or Share Purchase Agreement BULLETIN DATE:  April 4, 2014 TSX Venture Tier 2 Company, 52352=La société a confirmé la clôture du placement privé ci-avant mentionné par voie de communiqué de presse daté du 3 mars 2014., 89138=TEMBO GOLD CORP. (\"TEM\") BULLETIN TYPE:  Private Placement-Non-Brokered BULLETIN DATE:  April 4, 2014 TSX Venture Tier 1 Company, 95605=TSX Venture Exchange has accepted for filing the documentation with respect to a Brokered Private Placement announced on December 2, 2013.  The Private Placement was completed in ThermoCeramix on December 24, 2013 and February 13, 2014. The securities of ThermoCeramix issued pursuant to the Private Placement were converted into securities of the resulting issuer upon closing of the QT, as follows:, 3613=Effective at the opening, Monday, April 7, 2014, the common shares of Aftermath Silver Ltd. will commence trading on TSX Venture Exchange, and the common shares of Full Metal Zinc Ltd. will be delisted.  The Company is classified as a 'Mineral Exploration' company., 77028=RICHMOND MINERALS INC. (\"RMD\") BULLETIN TYPE:  Private Placement-Non-Brokered BULLETIN DATE:  April 4, 2014 TSX Venture Tier 2 Company, 99267=Effective at the opening of business on Monday, April 7, 2014, the common shares of \"ThermoCeramix Corporation\" will commence trading on TSX Venture Exchange, and the common shares of \"Springrock Capital Inc.\" will be delisted., 61846=LEGEND POWER SYSTEMS INC. (\"LPS\") BULLETIN TYPE:  Warrant Exercise Incentive Program BULLETIN DATE:  April 4, 2014 TSX Venture Tier 2 Company, 130932=WALMER CAPITAL CORP. (\"WAL.P\") BULLETIN TYPE:  Notice – QT Not Completed – Approaching 24 Months of Listing BULLETIN DATE:  April 4, 2014 TSX Venture Tier 2 Company, 58742=TSX Venture Exchange has been advised by the Company that pursuant to a Notice of Intention to make a Normal Course Issuer Bid dated April 3, 2014, it may repurchase for cancellation, up to 2,000,000 shares in its own capital stock.  The purchases are to be made through the facilities of TSX Venture Exchange or other recognized marketplaces during the period April 8, 2014 to April 7, 2015.  Purchases pursuant to the bid will be made by Questrade Inc. on behalf of the Company., 127362=April 30, 2014, 55378=For further information please read the Company's news releases dated February 5 and March 3, 2014., 111295=Pour de plus amples renseignements, veuillez vous référer à la déclaration de changement à l'inscription  datée du 26 mars 2014, disponible sur SEDAR., 7020=AVARONE METALS INC. (\"AVM\") BULLETIN TYPE:  Property-Asset or Share Purchase Agreement BULLETIN DATE:  April 4, 2014 TSX Venture Tier 2 Company, 98901=Pursuant to a special resolution passed by shareholders on March 7, 2014, the Company has consolidated its capital on a (two point five) 2.5 old shares for (one) 1 new share basis.  The name of the Company has also been changed from \"Springrock Capital Inc.\" to \"ThermoCeramix Corporation\"., 60901=April 8, 2014 - TO SETTLE – April 9, 2014 April 9, 2014 - TO SETTLE – April 10, 2014 April 10, 2014 - TO SETTLE – April 11, 2014 April 11, 2014 - TO SETTLE – April 11, 2014, 108718=Bourse de croissance TSX (la « Bourse ») a accepté le dépôt des documents de la société relativement à son opération admissible décrite dans sa déclaration de changement à l'inscription datée du 26 mars 2014. Conséquemment, à l'ouverture des marchés le lundi 7 avril 2014, la société ne sera plus considérée comme une société de capital de démarrage., 62132=TSX Venture Exchange has consented to a Warrant Exercise Incentive Program whereby the Company will issue an additional warrant (the 'Incentive Warrant') for each existing warrant exercised.  Each Incentive Warrant is exercisable into one common share at an exercise price of $0.30 until October 18, 2016., 108101=THERMOCERAMIX CORPORATION (« TCX ») [anciennement Springrock Capital Inc. (« SGK.P »)] TYPE DE BULLETIN : Opération admissible complétée/nouveau symbole, Reprise de la négociation, Placement privé par l'entremise d'un courtier, Changement de dénomination sociale et  regroupements d'actions DATE DU BULLETIN : Le 4 avril 2014 Société du groupe 2 de TSX Croissance, 88389=TASCA RESOURCES LTD. (\"TAC\") BULLETIN TYPE:  Shares for Bonuses BULLETIN DATE:  April 4, 2014 TSX Venture Tier 2 Company, 59703=Effective at the opening, April 8, 2014, the Share Purchase Warrants of the Company will trade for cash.  The Warrants expire April 11, 2014 and will therefore be delisted at the close of business, Friday, April 11, 2014., 115269=En vertu d'une résolution spéciale des actionnaires du 7 mars 2014, la société a regroupé son capital-actions sur la base de 2,5 anciennes actions pour 1 nouvelle action. La dénomination sociale de la société a été changée de « Springrock Capital Inc. » à « ThermoCeramix Corporation »., 59429=INFINITY MINERALS CORP. (\"IFN.WT\") BULLETIN TYPE:  Warrant Expiry-Delist BULLETIN DATE:  April 4, 2014 TSX Venture Tier 2 Company, 133739=Copyright © 2007 PR Newswire. All rights reserved. Republication or redistribution of PRNewswire content is expressly prohibited without the prior written consent of PRNewswire. PRNewswire shall not be liable for any errors or delays in the content, or for any actions taken in reliance thereon., 7308=TSX Venture Exchange has accepted for filing a Property Sale Agreement dated March 25, 2014 between the Company and Garmin Metals & Mining Corp. (Cora Chau) whereby the Company can earn a 100% interest in the McWilliams Lake Property that is located in Saskatchewan.  Consideration is 4,000,000 common shares to be issued within 5 days from Exchange approval and $1,000,000 in exploration expenditures within 4 years., 16630=Effective at 10:26 a.m., PST, April 4, 2014, trading in the shares of the Company was halted pending news. This regulatory halt is imposed by Investment Industry Regulatory Organization of Canada, the Market Regulator of the Exchange pursuant to the provisions of Section 10.9(1) of the Universal Market Integrity Rules., 124979=THE WESTAIM CORP. (\"WED\") BULLETIN TYPE:  Resume Trading BULLETIN DATE:  April 4, 2014 TSX Venture Tier 2 Company}",
    "lastModified": "Tue, 28 Jul 2015 21:50:10 GMT",
    "textBeforeTable": "2 placees Number of Placees: $0.10 for a five year period Warrant Exercise Price:  7,200,000 share purchase warrants attached to purchase 7,200,000 shares Warrants:  $0.05 per share Purchase Price:  7,200,000 common shares Number of Shares: TSX Venture Exchange has accepted for filing documentation with respect to a Non-Brokered Private Placement announced November 18, 2013: NORTHERN GOLD MINING INC. (\"NGM\") BULLETIN TYPE:  Private Placement- Non-Brokered BULLETIN DATE:  April 4, 2014 TSX Venture Tier 2 Company ________________________________________ Any existing warrants not exercised during the Warrant Exercise Incentive Program will remain outstanding and continue to be exercisable for common shares of the Company under the original terms of issue. These warrants were issued pursuant to a private placement of 8,185,165 shares with 8,185,165 share purchase warrants attached, which was accepted for filing by the Exchange effective October 23, 2013. October 18, 2016",
    "textAfterTable": "      (Pierre Caland) Pursuant to Corporate Finance Policy 4.1, Section 1.11(d), the Company has issued a news release announcing the closing of the private placement and setting out the expiry dates of the hold period(s). Note that in certain circumstances the Exchange may later extend the expiry date of the warrants, if they are less than the maximum permitted term. ________________________________________ QUATTRO EXPLORATION & PRODUCTION LTD. (\"QXP\") BULLETIN TYPE:  Private Placement-Non-Brokered, Convertible Debenture/s BULLETIN DATE:  April 4, 2014 TSX Venture Tier 2 Company TSX Venture Exchange has accepted for filing documentation with respect to a Non-Brokered Private Placement announced : Convertible Debenture  $500,000 Conversion Price: Convertible into common shares Maturity date: 3 years from the date of issuance Interest rate: 8% per annum Number of Placees:",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}