{
    "relation": [
        [
            "Categories",
            "Great for these types of students",
            "Share any unusual traditions or locations on campus",
            "What to do for fun",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "All students can fit in here.",
            "Stanley Park is right down the street!",
            "Attend events! There's at least 100 per month!",
            "Visit the University! Visiting is the best way to make a decision.",
            "Westfield State University is very welcoming. The university is clean, involved, and organized. Anyone could enjoy this place."
        ]
    ],
    "pageTitle": "Westfield State University Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Westfield-State-University/reviews?_escaped_fragment_=/show/8101",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042982745.46/warc/CC-MAIN-20150728002302-00121-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 929168671,
    "recordOffset": 929118361,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{22006=There is an annual club fair in September for all students to see what is going on around campus. If you like the club that you see there is a quick an easy sign up. Many students join clubs so they can meet and make new friends, or even step out of an evironment that they have previously been used to., 200073=© 2015, Cappex.com, LLC}",
    "textBeforeTable": "10/14/2010 Reviewer is A current student here. 11 out of 11 people found this review useful. 1 of 47 Kelsey from Templeton, MA Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5",
    "textAfterTable": "The classes are challenging and interesting. I do not feel over-whelmed at all. The classes in my major (Criminal Justice) are the most interesting. They are so fun to attend that it makes learing easy! Login to rate or flag the reviews Blessing from Springfield, MA 12/20/2010 Reviewer is A current student here. 6 out of 6 people found this review useful. 2 of 47 Categories Comments Great for these types of students If you like a small school and smaller class sizes you are in the right place. WSU also has plenty of chances for you to be a leader. Tips for prospective students Make use of all the opportunities available. And please don't be shy. You can make some great friends here. Bang for the buck The education, the campus, and the town of Westfield and everything it has to offer is well worth going to. There's also alot of support provided by tutors, academic advisers, and",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}