{
    "relation": [
        [
            "Number",
            "6",
            "3",
            "4"
        ],
        [
            "Type",
            "HQI",
            "HQI",
            "HO"
        ],
        [
            "Power and Color",
            "400-watt, 14,000 K",
            "1000-watt, 14,000 K",
            "140-watt, Philips 03 actinic"
        ],
        [
            "Time On",
            "8.00",
            "9.30",
            "7.30"
        ],
        [
            "Time Off",
            "22.30",
            "21.00",
            "23.00"
        ]
    ],
    "pageTitle": "Tank of the Month - February 2006 - Reefkeeping.com",
    "title": "",
    "url": "http://reefkeeping.com/issues/2006-02/totm/index.php",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042981856.5/warc/CC-MAIN-20150728002301-00062-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 201625231,
    "recordOffset": 201606907,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{22471=In May 2005, 900 kg of fresh live rock was imported from Indonesia and used without curing, along with 200 kg of live rock from the previous tank. The rock was attached to the PVC rods with cable binders, and to \"thread\" these rocks, small holes had to be drilled into them. After 18 hours of hard work by two people, the reef was starting to resemble the reef I had in mind. After the aquascape was created, the tank was filled with natural sea water. After one week, I began my planned schedule of water changes in order to minimize the levels of waste products. Additionally, some bacterial cultures were also added. One week later, both nitrite and nitrate levels were undetectable, and the first corals and fishes were then introduced to the tank, althoughthe bulk of the corals from the previous tank were stored in a temporary holding tank in the equipment room for about two months. Of course, the tank was far from biologically stable, and the corals lost some colour and the inevitable algae blooms also occurred. And after three weeks, the tank's recovery was clearly visible., 50911=Each week 1500 liters of water is replaced with fresh artificial salt water. Reef Crystals salt with reverse osmosis water is used to prepare this water. After the water change, bacteria in the form of Preis Baktoplan are added. Apart from that, no other supplements are used. When necessary, the sand bed is replaced with fresh calcium carbonate. I like the sand bed to look white, not green. I've also observed that the corals' colors develop better when the sand bed, together with the detritus in it, is removed every few weeks. It is quite a task, but the result is rewarding, in my opinion., 36845=Calcium is added by a Deltec PF 1000 calcium reactor filled with crushed coral and magnesium carbonate. Evaporated water is replenished by a Deltec KM 800 kalkwasser mixer filled with calcium hydroxide. Phosphates are removed by a Deltec fluidized bed filter containing activated carbon and two kilograms of ROWA®phos media. A separate Deltec fluidized bed filter is filled with ZEOvit zeolith media. The ZEOvit isn't fluidized, but the water flows in such a pattern that I don't expect any channels to be formed in the material., 7995=After a showroom reconstruction in March of this year, we decided to set up a new tank against the wall of the building. Tetterode Glas from Voorthuizen, Netherlands constructed the 6 m long bent front glass from safety glass, and it's the biggest size this company has ever bent. The radius of this sheet is 4,700 mm, with a depth of 900 mm. This was the largest size that could possibly be bent in this company's oven., 99985=Reefkeeping Magazine\u0099 Reef Central, LLC-Copyright © 2008, 43104=Two 1000-liter storage tanks make sure fresh saltwater is always available. All water is filtered by a ROWA® reverse osmosis unit which can produce 4000 liters over a 24 hour period. To avoid excessive humidity, the windows are opened, so evaporated water can be transported to the outside while fresh air replaces the old.Because of all the lamps and pumps, the water would get too hot if chillers were not used. There are two Aqua Medic SK4s processing up to 4000 liters each, which are located on the building's roof. When there is a power failure, a 4 KW diesel aggregate takes over the power supply to prevent any losses in the tank due to a power failure.}",
    "textBeforeTable": "Lighting Info: Artificial Light Of course, a tank this big needs lots of light and can't rely on natural lighting alone. Supplemental lighting consists of a number of metal halide and high output fluorescent lamps shown in the table below, controlled by an Aqua Medic Light computer. Moonlight is provide by three 50-watt bulbs controlled by the Aqua Medic. Natural Sunlight The tank stands against a wall, with three windows above it. In the morning, sunlight shines into the tank, and it produces a beautiful show that can't be recreated by artificial light. Lighting: Alf Nilsen is seen here photographing the tank. The tank exterior is constructed with a saltwater-proof",
    "textAfterTable": "Electrical panel. Equipment Room: The equipment room is located 10 meters from the tank and measures 4 by 5 meters. The sump is constructed from polyester; it measures 200 x 80 x 90 cm and is divided into two compartments. A pre-filter containing filter",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}