{
    "relation": [
        [
            "",
            "Entire Population",
            ""
        ],
        [
            "Question Choices",
            "Checked",
            "Not Checked"
        ],
        [
            "Estimated Percentage",
            "1.5",
            "98.5"
        ],
        [
            "95 Percent Confidence Interval",
            "0.4-3.9",
            "96.1-99.6"
        ]
    ],
    "pageTitle": "Survey of Education Programs Funded under the American Recovery and Reinvestment Act of 2009",
    "title": "",
    "url": "http://www.gao.gov/special.pubs/gao-11-885sp/results.htm",
    "hasHeader": true,
    "headerPosition": "MIXED",
    "tableType": "RELATION",
    "tableNum": 125,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042982745.46/warc/CC-MAIN-20150728002302-00206-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 477141659,
    "recordOffset": 477113188,
    "tableOrientation": "VERTICAL",
    "TableContextTimeStampBeforeTable": "{3075=The U.S. Government Accountability Office (GAO) is an independent, nonpartisan agency that works for Congress. We have been asked by Congress to conduct a study of the education programs funded under the American Recovery and Reinvestment Act of 2009 (Recovery Act) to evaluate how these funds were used at the local level and how they impacted education programs and district budgets. The Recovery Act was enacted in response to a serious economic crisis and it seeks to promote economic recovery, make investments, and to minimize and avoid reductions in state and local government services. As part of this study, we are conducting this survey of school district superintendents across the country whose districts have received Recovery Act funding for 3 education programs - Title I, Individuals with Disabilities Education Act (IDEA) and the State Fiscal Stabilization Fund (SFSF), to learn how these funds are being used. Our questionnaire asks about your district's use of the funding, your district's fiscal outlook, and how the level of service and education reform in your local educational agency (LEA) will continue when the funding ends. Your participation in this survey will help us inform the Congress about the impact of this legislation on school districts across the country. One of the analysts on our team would be glad to call you back if you want more information. If, in order to answer any question in this questionnaire, you need to confer with other individuals in your office or department to obtain the requested information, please feel free to do so. To determine if consultation is needed, it may be helpful to preview all questions before completing the questionnaire. We understand that there are many demands on your time. However, your participation is essential for us to provide nation-wide information to Congress about how Recovery Act funds are affecting educational reform efforts. In addition, your responses will help identify any problems that localities may have in understanding or implementing Recovery Act requirements. If you want to review our survey before completing it on line, click here. If you do not already have an Adobe Acrobat reader on your computer, click here to download this software. Thank you in advance for your assistance in taking part in our survey.}",
    "TableContextTimeStampAfterTable": "{140571=24. Do you currently anticipate your LEA having trouble meeting the Title I Maintenance of Effort (MOE) requirement corresponding to Title I funds made available for your LEA for either school year 2010-2011 or 2011-2012? (Check one per row.), 68434=14. Do you currently anticipate your LEA having trouble meeting the IDEA Maintenance of Effort (MOE) requirement for either school year 2010-2011 or 2011-2012? (Check one per row.), 141026=a. Title I MOE corresponding to 2010-2011 allocations, 367790=52. How likely or unlikely is it that your LEA will have to take any of the following actions in the upcoming 2011-2012 school year? (Please include any actions that you will take or any that you will continue to take. Check one per row.), 86336=20. Do you anticipate being able to obligate all of your Recovery Act funds for Title I, Part A by September 30, 2011?, 448039=57. Without the Education Jobs Fund, would the overall staffing levels in your LEA have increased, remained the same or decreased during the 2010-2011 and 2011-2012 school years?, 364406=51. Looking ahead to the 2011-2012 school year, what do you expect the total funding for your LEA will be compared to the 2010-2011 school year? (Answer based on your current assumptions of what the total funding for the 2011-2012 school year will be. Total funding includes combined federal, state, and local public education funds.), 158461=30. Do you anticipate being able to obligate all of your Recovery Act SFSF funds by September 30, 2011?, 325934=48. How did your LEA's total funding for the 2010-2011 school year compare to your total funding for the 2009-2010 school year? (Total spending includes combined federal, state and local public education funds.), 431116=a. 2010-2011 School Year, 421186=53. Does your LEA currently use or plan to implement any of the following for the 2010-2011 school year? (Check one per row.), 331024=50. Did your LEA take any of the following actions for the 2010-2011 school year? (Check one per row.), 142769=b. Title I MOE corresponding to 2011-2012 allocations, 70559=b. Trouble meeting IDEA MOE for 2011-2012, 430685=55. (If \"Yes\" to 54) Based on your plans, approximately what percentage of funds does your LEA plan to spend from the Education Jobs Fund over the 2010-2011 and 2011-2012 school years? (Check one per row.), 433824=b. 2011-2012 School Year, 8579=6. Do you anticipate being able to obligate all of your Recovery Act funds for IDEA by September 30, 2011?, 66278=13. For the 2010-2011 school year, did your LEA use IDEA, Part B funds for coordinated early intervening services (CEIS), excluding carryover funding from the prior year?, 1214=2. (If \"Yes\" to 1) Do you represent a charter school that was operating in school year 2010-2011?, 68827=a. Trouble meeting IDEA MOE for 2010-2011, 450177=58. For the Education Jobs fund quarterly reporting requirements, how many full-time equivalents (FTEs) did your LEA report to your state or SEA for the quarter ending December 2010? (Please provide us the number of FTEs to the nearest tenth of a point so that the number will appear as 10.5.)}",
    "textBeforeTable": "(View question) 1. Did your LEA or charter school (_____) receive American Recovery and Reinvestment Act (Recovery Act) funds for any of the following programs: Title I Part A, Individuals with Disabilities Education Act (IDEA), or State Fiscal Stabilization Fund (SFSF)? General Information (View question) The U.S. Government Accountability Office (GAO) is an independent, nonpartisan agency that works for Congress. We have been asked by Congress to conduct a study of the education programs funded under the American Recovery and Reinvestment Act of 2009 (Recovery Act) to evaluate how these funds were used at the local level and how they impacted education programs and district budgets. The Recovery Act was enacted in response to a serious economic crisis and it seeks to promote economic recovery, make investments, and to minimize and avoid reductions in state and local government services. As part of this study, we are conducting this survey of school district superintendents across the country whose districts have received Recovery Act funding for 3 education programs - Title I, Individuals with Disabilities Education Act (IDEA) and the State Fiscal Stabilization Fund (SFSF), to learn how these funds are being used. Our questionnaire asks about your district's use of the funding, your district's fiscal outlook, and how the level of service and education reform in your local educational agency (LEA) will continue when the funding ends. Your participation in this",
    "textAfterTable": "2. (If \"Yes\" to 1) Do you represent a charter school that was operating in school year 2010-2011? (View question)   Question Choices Estimated Percentage 95 Percent Confidence Interval Entire Population Yes 15.5 13.2-17.9   No 84.5 82.1-86.8 3. (If \"Yes\" to 2) Which of the following best describes the status of your charter school in relation to the local education agencies in your state? (View question)   Question Choices Estimated Percentage 95 Percent Confidence Interval Entire Population Charter school is a separate local education",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}