{
    "relation": [
        [
            "Release",
            "12.2(8)T",
            "12.3(11)T",
            "12.2(28)SB",
            "15.2(1)T"
        ],
        [
            "Modification",
            "This command was introduced.",
            "This command was modified. The file keyword was added.",
            "This command was integrated into Cisco IOS Release 12.2(28)SB.",
            "This command was modified. The number, refresh, and interval keywords and the number and minutes arguments were added."
        ]
    ],
    "pageTitle": "IP Addressing Services Command Reference, Cisco IOS XE Release 3SE (Catalyst 3850 Switches) - match reply prefix-list through utilization mark low [Cisco Catalyst 3850 Series Switches] - Cisco",
    "title": "",
    "url": "http://www.cisco.com/c/en/us/td/docs/ios-xml/ios/ipaddr/command/ipaddr-xe-3se-3850-cr-book/ipaddr-xe-3se-3850-cr-book_chapter_010.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042981856.5/warc/CC-MAIN-20150728002301-00013-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 355496115,
    "recordOffset": 355431272,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{17019=The following example specifies 10.12.1.99 as the IP address of the next server in the boot process:, 3577=This command was integrated into Cisco IOS XE Release 3.1S and implemented on the Cisco ASR 1000 Series Aggregation Services Routers., 28410=DHCP provides a framework for passing configuration information to hosts on a TCP/IP network. The configuration parameters and other control information are carried in tagged data items that are stored in the options field of the DHCP message. The data items themselves are also called options. The current set of DHCP options is documented in RFC 2131, Dynamic Host Configuration Protocol., 91941=The pattern itself, excluding the wildcard, must contain a whole number of bytes (a byte is two hexadecimal numbers). For example, 010203 is 3 bytes (accepted) and 01020 is 2.5 bytes (not accepted)., 303430=This command was modified. This command was implemented on the Cisco ASR 1000 Series Aggregation Services Routers.}",
    "textBeforeTable": "Syntax Description ipv6 prefix-list name match reply prefix-list no ipv6 prefix-list name match reply prefix-list To enable verification of the advertised prefixes in the Dynamic Host Configuration Protocol (DHCP) reply messages from the configured authorized prefix list, use the match reply prefix-list command in DHCPv6 guard configuration mode. To disable verification of the advertised prefixes in the DHCP reply messages from the configured authorized prefix list, use the no form of this command. match reply prefix-list utilization mark low utilization mark high trusted-port (DHCPv6 Guard) show ipv6 dhcp conflict show ip verify source show ip source binding show ip route dhcp show ip interface show ip dhcp snooping database show ip dhcp snooping binding show ip dhcp snooping show ip dhcp server statistics show ip dhcp pool show ip dhcp import show ip dhcp database show ip dhcp conflict show ip dhcp binding show ip arp show ip aliases show hosts show",
    "textAfterTable": "Command History Release Modification 15.2(4)S This command was introduced. Usage Guidelines This command enables verification of the advertised prefixes in DHCP reply messages from the configured authorized prefix list. If not configured, this check will be bypassed. A prefix list is configured using the ipv6 prefix-list command. An empty prefix list is treated as a permit. Examples The following example defines a DHCPv6 guard policy name as policy1, places the router in DHCPv6 guard configuration mode, and enables verification of the advertised prefixes in DHCP reply messages from the configured authorized prefix list:  Router(config)# ipv6 dhcp guard policy policy1 Router(config-dhcp-guard)# match reply prefix-list ipv6pre1 Related Commands Command Description",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}