{
    "relation": [
        [
            "Object Type",
            "LIBRARY, TABLESPACE, DIRECTORY",
            "Named objects and all objects dependent on named objects",
            "Schema Objects, Dependent Objects, Granted Objects, USER",
            "TABLE, CLUSTER, CONSTRAINT, INDEX, ROLLBACK_SEGMENT, MATERIALIZED_VIEW, MATERIALIZED_VIEW_LOG, TABLESPACE_QUOTA"
        ],
        [
            "Name",
            "REMAP_DATAFILE",
            "REMAP_NAME",
            "REMAP_SCHEMA",
            "REMAP_TABLESPACE"
        ],
        [
            "Datatype",
            "Text",
            "Text",
            "Text",
            "Text"
        ],
        [
            "Meaning",
            "Objects in the document will have their filespecs renamed as follows: any filespec matching old_value will be changed to new_value. Filespecs should not be enclosed in quotes. This parameter is additive. By default, filespecs are not renamed.",
            "Any named object in the document whose name matches old_value will have its name changed to new_value. Any dependent object whose base object name matches old_value will have its base schema name changed to new_value. This parameter is additive. By default, names are not remapped. (Use REMAP_TABLESPACE to remap the name of a TABLESPACE object.)",
            "Any schema object in the document whose name matches old_value will have its schema name changed to new_value. Any dependent object whose base object schema name matches old_value will have its base object schema name changed to new_value. Any granted object whose grantee name matches old_value will have its grantee name changed to new_value. Any user whose name matches old_value will have its name changed to new_value. This parameter is additive. By default, schemas are not remapped. NOTE: The mapping may not be 100 percent complete because there are certain schema references that Import is not capable of finding. For example, Import will not find schema references embedded within the body of definitions of triggers, types, views, procedures, and packages.",
            "Objects in the document will have their tablespaces renamed as follows: any tablespace name matching old_value will be changed to new_value. This parameter is additive. By default, tablespaces are not remapped."
        ]
    ],
    "pageTitle": "DBMS_METADATA",
    "title": "",
    "url": "http://docs.oracle.com/database/121/ARPLS/d_metada.htm",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042982745.46/warc/CC-MAIN-20150728002302-00103-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 74443943,
    "recordOffset": 74397186,
    "tableOrientation": "HORIZONTAL",
    "lastModified": "Thu, 02 Jul 2015 09:42:10 GMT",
    "textBeforeTable": "Table 94-25 SET_REMAP_PARAM: Transform Parameters for the MODIFY Transform Table 94-25 describes the object type, name, datatype, and meaning of the parameters for the MODIFY transform in the SET_REMAP_PARAM procedure. A number designating the object row for an object. The object in the document that corresponds to this number will be copied to the output document. This parameter is additive. By default, all objects are copied to the output document. NUMBER OBJECT_ROW All objects Meaning Datatype Name Object Type Table 94-24 SET_TRANSFORM_PARAM: Transform Parameters for the MODIFY Transform Table 94-24 describes the object type, name, datatype, and meaning of the parameters for the MODIFY transform in the SET_TRANSFORM_PARAM procedure. Specifies a table compression clause (for example, COMPRESS BASIC) to use when the table is created. Specify NONE to omit the table compression clause. The table will have the default compression for the tablespace. Specifying this transform changes",
    "textAfterTable": "Table 94-26 SET_TRANSFORM_PARAM: Transform Parameters for the SXML Transform Object type Name Datatype Meaning TABLE, TYPE OID Boolean If TRUE, include the OID clause in the SXML. If FALSE, omit it. Defaults to FALSE. TABLE, INDEX, CLUSTER, MATERIALIZED_VIEW, MATERIALIZED_VIEW_LOG. STORAGE Boolean If TRUE, include storage clauses in the SXML. If FALSE, omit them. (Ignored if SEGMENT_ATTRIBUTES is FALSE.) Defaults to TRUE. TABLE, INDEX, CLUSTER, MATERIALIZED_VIEW, MATERIALIZED_VIEW_LOG. TABLESPACE Boolean If TRUE, include tablespace clauses in the SXML. If FALSE, omit them. (Ignored if SEGMENT_ATTRIBUTES is FALSE.) Defaults to TRUE. TABLE REF_CONSTRAINTS Boolean If TRUE, include all",
    "hasKeyColumn": true,
    "keyColumnIndex": 1,
    "headerRowIndex": 0
}