{
    "relation": [
        [
            "Religion",
            "Catholic",
            "Evangelical Protestant",
            "Mainline Protestant",
            "Other",
            "Black Protestant",
            "Orthodox",
            "None"
        ],
        [
            "Adherents",
            "11,380",
            "10,560",
            "8,281",
            "1,974",
            "185",
            "-",
            "56,942"
        ],
        [
            "Congregations",
            "3",
            "41",
            "21",
            "9",
            "1",
            "-",
            "-"
        ]
    ],
    "pageTitle": "Lake Waukomis, Missouri (MO 64151) profile: population, maps, real estate, averages, homes, statistics, relocation, travel, jobs, hospitals, schools, crime, moving, houses, news, sex offenders",
    "title": "",
    "url": "http://www.city-data.com/city/Lake-Waukomis-Missouri.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042981856.5/warc/CC-MAIN-20150728002301-00063-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 365021335,
    "recordOffset": 364900176,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{125957=We are giving away $1200 in prizes - enter simply by sending us your own city pictures!, 6220=According to our research of Missouri and other state lists there was 1 registered sex offender living in Lake Waukomis, Missouri as of July 28, 2015. The ratio of number of residents in Lake Waukomis to the number of sex offenders is 891 to 1. The number of registered sex offenders compared to the number of residents in this city is smaller than the state average., 25043=Incorporated in 1956, 24943=Elevation: 1000 feet}",
    "TableContextTimeStampAfterTable": "{36133=Educational Attainment (%) in 2013, 50999=11.39% of this county's 2010 resident taxpayers moved to other counties in 2011 ($50,404 average adjusted gross income), 40738=Graphs represent county-level data. Detailed 2008 Election Results, 48792=11.72% of this county's 2011 resident taxpayers lived in other counties in 2010 ($47,292 average adjusted gross income), 39882=2004 Presidential Elections Results, 39310=1996 Presidential Elections Results, 36531=School Enrollment by Level of School (%) in 2013, 30759=Ozone [ppb] level in 2012 was 33.2. This is about average. Closest monitor was 2.6 miles away from the city center., 40454=2012 Presidential Elections Results, 70823=Recent home sales, price trends, and home value evaluator powered by Onboard Informatics © 2015 Onboard Informatics. Information is deemed reliable but not guaranteed.   City-data.com does not guarantee the accuracy or timeliness of any information on this site.  Use at your own risk. Website © 2015 Advameg, Inc., 32212=Particulate Matter (PM2.5) [µg/m3] level in 2012 was 9.88. This is about average. Closest monitor was 8.0 miles away from the city center., 27876=Air Quality Index (AQI) level in 2012 was 114. This is significantly worse than average., 28537=Carbon Monoxide (CO) [ppm] level in 2012 was 0.518. This is significantly worse than average. Closest monitor was 5.8 miles away from the city center., 15646=On 5/20/1957, a category F5 (max. wind speeds 261-318 mph) tornado 21.6 miles away from the Lake Waukomis city center killed 44 people and injured 207 people and caused between $500,000 and $5,000,000 in damages., 40168=2008 Presidential Elections Results, 15969=On 5/4/2003, a category F4 (max. wind speeds 207-260 mph) tornado 7.5 miles away from the city center killed 2 people and injured 30 people and caused $48 million in damages., 30016=Sulfur Dioxide (SO2) [ppb] level in 2012 was 6.42. This is significantly worse than average. Closest monitor was 2.6 miles away from the city center., 39596=2000 Presidential Elections Results, 69475=Total of 1 patent application in 2008-2015., 31458=Particulate Matter (PM10) [µg/m3] level in 2012 was 25.4. This is worse than average. Closest monitor was 8.0 miles away from the city center., 29272=Nitrogen Dioxide (NO2) [ppb] level in 2012 was 14.2. This is significantly worse than average. Closest monitor was 5.7 miles away from the city center.}",
    "textBeforeTable": "Religion statistics for Lake Waukomis city (based on Platte County data) Graphs represent county-level data. Detailed 2008 Election Results 2012 Presidential Elections Results 2008 Presidential Elections Results 2004 Presidential Elections Results 2000 Presidential Elections Results 1996 Presidential Elections Results 2012 2008 2004 2000 1996 Presidential Elections Results Electricity (12%) Utility gas (88%) Most commonly used house heating fuel:",
    "textAfterTable": "Source: Clifford Grammich, Kirk Hadaway, Richard Houseal, Dale E.Jones, Alexei Krindatch, Richie Stanley and Richard H.Taylor. 2012. 2010 U.S.Religion Census: Religious Congregations & Membership Study. Association of Statisticians of American Religious Bodies. Jones, Dale E., et al. 2002. Congregations and Membership in the United States 2000. Nashville, TN: Glenmary Research Center. Graphs represent county-level data Food Environment Statistics: Number of grocery stores: 13 Platte County: 1.53 / 10,000 pop. Missouri: 1.88 / 10,000 pop. Number of supercenters and club stores: 1 This county: 0.12 / 10,000 pop. State: 0.18 / 10,000 pop. Number of convenience stores (no gas): 1 Platte County: 0.12 / 10,000 pop. Missouri: 0.60 / 10,000 pop. Number of convenience stores (with gas): 24 Platte County: 2.83 / 10,000 pop. State: 4.34 / 10,000 pop. Number of full-service restaurants: 73 Here: 8.62 / 10,000 pop. State: 7.37 / 10,000 pop. Adult diabetes rate: This county:",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}