{
    "relation": [
        [
            "Release",
            "15.1(1)T",
            "15.1(4)M",
            "Cisco IOS XE Release 3.3S"
        ],
        [
            "Modification",
            "This command was introduced.",
            "This command was modified. Support was added for IPv6 addresses.",
            "This command was integrated into Cisco IOS XE Release 3.3S."
        ]
    ],
    "pageTitle": "Cisco IOS Security Command Reference: Commands M to R - mab through mime-type [Support] - Cisco",
    "title": "",
    "url": "http://www.cisco.com/c/en/us/td/docs/ios-xml/ios/security/m1/sec-m1-cr-book/sec-cr-m1.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 125,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042982745.46/warc/CC-MAIN-20150728002302-00101-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 367673391,
    "recordOffset": 367546791,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{94696=The range is 100 through 199 or 2000 through 2699 for an expanded range., 582211=ZLIB format defined in RFC 1950, ZLIB Compressed Data Format Specification Version 3.3, combined with the deflate compression mechanism described in RFC 1951, DEFLATE Compressed Data Format Specification Version 1.3., 7619=This command was introduced on the Cisco 12000 series Internet router., 488360=Use the match protocol h323-annexe command to inspect traffic based on Annex E of the H.323 protocol that uses the UDP diagnostic port or TCP port 2517. You can use this command in conjunction with the match access-group command to build sophisticated traffic classes., 879986=Maximum number of SSL VPN user connections. A number from 1 to 1000 can be entered for this argument., 491767=To enable the inspection of H.323 protocol Annex G traffic exchanged between border elements (BE) using User Datagram Protocol (UDP) diagnostic port or TCP port 2099, use the match protocol h323-nxg command in class-map configuration mode. To disable the inspection, use the no form of this command., 491087=Enables the inspection of H.323 protocol Annex G traffic exchanged between border elements (BE) using the User Datagram Protocol (UDP) diagnostic port or TCP port 2099., 211073=This command was implemented on the Cisco ASR 1000 series routers., 494938=Use the match protocol h323-nxg command to inspect traffic based on Annex G of the H.323 protocol that uses the UDP diagnostic port or TCP port 2099 to exchange traffic between border elements. You can use this command in conjunction with the match access-group command to build sophisticated traffic classes., 497697=Enables the inspection of H.323 protocol Annex E traffic which works on the UDP diagnostic port or TCP Port 2517., 880599=number : 1000, 364227=This command was introduced on Cisco ASR 1000 Series Routers., 262983=Start of MAIL FROM: Identifies sender of mail message. May be forged. May not correspond to the From: line in a mail message. Should be added in Return Path header. Address to send any undeliverable notifications (bounces). The NO OPeration (NOOP) does nothing, except keep the connection active and help synchronize commands and responses., 85379=Cisco ASR 1000 Series Routers do not support more than 16 match statements per class map. An interface with more than 16 match statements rejects the service policy., 463867=The following example configures the program number 2345 as a match criterion in the class map rpc-prog-nums:, 485202=To enable the inspection of H.323 protocol Annex E traffic which works on the User Datagram Protocol (UDP) diagnostic port or TCP port 2517, use the match protocol h323-annexe command in class-map configuration mode. To disable the inspection, use the no form of this command., 581460=Encoding format (specified in RFC 2616, Hypertext Transfer Protocol--HTTP/1) in which the body of the message is transferred in a series of chunks; each chunk contains its own size indicator., 823125=The following example shows how to configure the half-opened limit to 2380 for per-VRF firewall sessions:, 71068=A numbered ACL whose contents are used as the match criteria against which packets are checked to determine if they belong to the same class. The range is from 1 to 2699.}",
    "textBeforeTable": "Syntax Description mab no [eap] mab To enable MAC-based authentication on a port, use the mab command in interface configuration or template configuration mode. To disable MAC-based authentication, use the no form of this command. mab mime-type message retry interval message retry count max-users (WebVPN) max-users max-uri-length max-retry-attempts max-resp-pak max-request max-logins max-incomplete aggressive-aging max-incomplete (parameter-map type) max-incomplete max-header-length max-destination match user-group match url reputation match url-keyword urlf-glob match url category match (fqdn acl) match text-chat match start match service match server-response any match server-domain urlf-glob match sender address regex match security-group match search-file-name match response status-line regex match response body java-applet match response match request regex match request port-misuse match request not regex match request method match request length match request match req-resp protocol-violation",
    "textAfterTable": "Template configuration (config-template) Command History Release Modification 12.2(33)SXI This command was introduced. 15.2(2)T This command was integrated into Cisco IOS Release 15.2(2)T. 15.2(2)E This command was integrated into Cisco IOS Release 15.2(2)E. This command is supported in template configuration mode. Cisco IOS XE Release 3.6E This command was integrated into Cisco IOS XE Release 3.6E. This command is supported in template configuration mode. Usage Guidelines Use the mab command to enable MAC-based authentication on a port. To enable EAP on the port, use the mab eap command. Note If you are unsure whether MAB or MAB EAP is enabled or disabled on the switched",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}