{
    "relation": [
        [
            "Categories",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "Play on the computer at my friend's house, or hang out with friends.",
            "I get what I can, I am in the process of finding a job but it is hard so i go to the dollar store and buy tuna, spaghetti oh's. Something cheap but that will last.",
            "I live off campus.",
            "There will always be challenges in academics, but it's my job to push past that to become a better person financially and educational wise. I am trying to make something of myself and do what I love, I love biology.",
            "Just work hard and don't give up, every college is about the same, you have nice teachers and also mean teachers but they aren't you so just don't give up.",
            "I like the school, they work with you, the teachers are nice. The schools are built up nice and clean the staff is very friendly. Whenever I have an issue I can always call and get help right away."
        ]
    ],
    "pageTitle": "Bluegrass Community and Technical College Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Bluegrass-Community-and-Technical-College/reviews",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042982745.46/warc/CC-MAIN-20150728002302-00215-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 882401327,
    "recordOffset": 882367944,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{130597=© 2015, Cappex.com, LLC}",
    "textBeforeTable": "07/17/2009 Reviewer is Accepted here and planning to attend soon. Reviewer has been to campus. 3 out of 3 people found this review useful. 1 of 33 Kaitlyn from Louisville, KY Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); });",
    "textAfterTable": "Categories Comments Tips for prospective students The campus is slightly larger than you would think, so take a tour and see how you like it. The tour guide was extremely helpful and knowledgeable when I took the tour Bang for the buck BCTC is less expensive than a larger school here in Kentucky, but so many of the classes are the same. Am enjoying being here I have taken classes at 3 different BCTC campuses, and have liked every one of them. Am learning a lot The class sizes are much smaller than a large university, making things much more hands on and personal. You can learn a lot at this school and the professors are very helpful. Login to rate or flag the reviews Natasha from Lexington, KY 04/03/2012 Reviewer is A current student here. 1 out of 1 people found this review useful. 3 of 33",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}