{
    "relation": [
        [
            "Days",
            "30",
            "50",
            "150",
            "200"
        ],
        [
            "BSE",
            "619.53",
            "611.17",
            "647.08",
            "634.80"
        ],
        [
            "NSE",
            "621.28",
            "612.56",
            "648.19",
            "635.80"
        ]
    ],
    "pageTitle": "J. K. Cement Stock Price, Share Price, Live BSE/NSE, J. K. Cement Bids Offers. Buy/Sell J. K. Cement news & tips, & F&O Quotes",
    "title": "",
    "url": "http://www.moneycontrol.com/india/stockpricequote/cement-major/jkcement/JKC03?sc_did=JKC03",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042982745.46/warc/CC-MAIN-20150728002302-00255-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 595553243,
    "recordOffset": 595504401,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{209523=Astec LifeSciences Recommended on Mar 31st 2015, 134158=JSWSteel Jul Fut, 132940=28 July 2015, 210831=J. K. Cement is in the Cement - Major sector. The current market capitalisation stands at Rs 4,339.34 crore. The company management includes Yadupati Singhania - Chairman & Managing Director, Sushila Devi Singhania - Director, Achintya Karati - Director, Jayant Narayan Godbole - Director, K B Agarwal - Director, Kailash Nath Khandelwal - Director, Paul Heinz Hugentobler - Director, Raj Kumar Lohia - Director, Suparas Bhandari - Director. It is listed on the BSE with a BSE Code of 532644 and the NSE with an NSE Code of JKCEMENT. Its Registered office is at Kamla Tower , Kanpur,Uttar Pradesh - 208001., 133451=UnitedBrewerie Jul Fut}",
    "textBeforeTable": "Edit Watchlist Have you invested in these stocks? You can track them better in your Portfolio close[x] Add to Watchist Account Optional Optional Optional Optional Add to Portfolio OR Add to watchlist } $('#mcpcp_addprof_info').hide(); { function close_info()",
    "textAfterTable": "Keep me signed in Forgot Password? New to Moneycontrol - Sign up now Its easy and FREE! Username Username should be atleast 4 characters Password Password should be 6 to 10 characters Confirm Password Email OR connect with LIVE",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}