{
    "relation": [
        [
            "Patent application number",
            "20090244840",
            "20100247049"
        ],
        [
            "Description",
            "Electronic device - An electronic device is provided that includes a first component generating heat, a second component to be heated, a heating part configured to heat the second component, and a case containing the first component, the second component, and the heating part. The second component is heated with the heating part and the heat generated by the first component.",
            "OPTICAL FIBER MODULE AND METHOD OF MAKING OPTICAL FIBER MODULE - There is provided an optical fiber module including a reel having a flange on one side of both sides thereof, a first optical fiber being wound around the reel, a first adhesive being applied to a roll of the first optical fiber so that lines of the first optical fiber are fixed to each other and the roll of the first optical fiber is fixed to the flange of the reel, and a first sheet member being fixed to the roll of the first optical fiber with the first adhesive."
        ],
        [
            "Published",
            "10-01-2009",
            "09-30-2010"
        ]
    ],
    "pageTitle": "Yumoto, JP - Patent applications",
    "title": "",
    "url": "http://www.faqs.org/patents/inventor/yumoto-jp-5/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042982745.46/warc/CC-MAIN-20150728002302-00164-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 439820455,
    "recordOffset": 439799210,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Mitsuru Yumoto, Kawasaki JP //]]> BarDraw('4043612',['Patent applications by Miki Yumoto, Kanagawa JP'],[[1,1,1,3]],['2012','2013','2014','2015'],0); // <script type=\"text/javascript\"> </div> <div id=\"legend4043612\" align=\"center\"></div> </div> <canvas id=\"bg4043612\" style=\"max-width: 500px; width: 100%;\"></canvas> <div> <p align=\"center\">Patent applications by Miki Yumoto, Kanagawa JP</p> <div class=\"bar4043612\" style=\"max-width: 500px; width: 100%; float:left; \"> <div align=\"left\" style=\"padding-top:20px;\"> </table> </tbody> </tr> <td>05-07-2015</td> <td><a href=\"/patents/app/20150126024\">SEMICONDUCTOR DEVICE AND METHOD FOR MANUFACTURING THE SAME</a> - A semiconductor device of an embodiment includes a semiconductor layer formed of a III-V group nitride semiconductor, a first silicon nitride film formed on the semiconductor layer, a gate electrode formed on the first silicon nitride film, a source electrode and a drain electrode formed on the semiconductor layer such that the gate electrode is interposed between the source electrode and the drain electrode, and a second silicon nitride film formed between the source electrode and the gate electrode and between the drain electrode and the gate electrode and having an oxygen atom density lower than that of the first silicon nitride film.</td> <td>20150126024</td> <tr> </tr> <td>05-07-2015</td> <td><a href=\"/patents/app/20150123143\">SEMICONDUCTOR DEVICE AND METHOD FOR MANUFACTURING THE SAME</a> - A semiconductor device of an embodiment includes a semiconductor layer formed of a III-V group nitride semiconductor, a first silicon nitride film formed on the semiconductor layer, a gate electrode formed on the first silicon nitride film, a source electrode and a drain electrode formed on the semiconductor layer such that the gate electrode is interposed between the source electrode and the drain electrode, and a second silicon",
    "textAfterTable": "Natsuki Yumoto, Hiroshima-Shi JP Patent application number Description Published 20110227512 SLEWING CONTROL DEVICE AND WORKING MACHINE INCORPORATED WITH THE SAME - There is provided a slewing control device that enables to detect breakdown of a driving system of a mechanical brake, and generate a torque for holding a slewing body in a stopped state to thereby prevent movement of the slewing body when an anomaly has occurred. In a working machine for driving a slewing body by an electric motor 09-22-2011 20120224943 CONSTRUCTION MACHINE HAVING PLATFORM FOR MAINTENANCE WORK - A construction machine including: a lower propelling body; an upper slewing body having a rear region with an engine room; a slewing device for slewing the upper slewing body; and a platform cover. The slewing device includes a slewing electric motor having an electric-motor output shaft, and a speed reducer having a speed-reducer output shaft rotated more slowly than the electric-motor output shaft, the speed reducer installed forward of the engine room such that the speed-reducer output shaft points downward, the slewing electric motor disposed just above the speed reducer. The platform cover is provided on a top of the slewing electric motor, having an upper surface serving as a platform for maintenance of equipment in the engine room. The platform cover is lower than the engine cover and adjacent to a front side of the engine room. 09-06-2012 Ryoichi Yumoto, Saitama-Shi JP",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}