{
    "relation": [
        [
            "Patent application number",
            "20100161192",
            "20100246889",
            "20140330498"
        ],
        [
            "Description",
            "VEHICLE OPERATION SUPPORT SYSTEM AND NAVIGATION APPARATUS - A vehicle operation support system includes a navigation device, and a drive control device. The navigation device includes: part for storing road information including branch point information; and part for acquiring road curvature information with reference to the road information, and providing the drive control device with the road curvature information, before a vehicle reaches the branch point. The road curvature information includes information about curvature of first and second road sections extending forward from a branch point. The drive control device estimates entrance of the vehicle into one of the first and second road sections as a selected road section, and controls a driving state of the vehicle by operating an actuator with reference to information about curvature of the selected road section, in response to estimation of entrance of the vehicle into the selected road section.",
            "Vehicle Driving Assistance Apparatus - A vehicle driving assistance apparatus has an image capturing system capturing a road on which the vehicle travels, a white line type recognition section recognizing a type of a white line that defines a current traffic lane on which the vehicle is travelling on the basis of an image captured by the image capturing system, a white line type storage section storing the white line type recognized by the white line type recognition section, a white line type estimation section and a vehicle control system. When the white line type cannot be recognized by the white line type recognition section, the white line type estimation section estimates the white line type from white line types stored in the white line type storage section. The vehicle control system executes a vehicle control on the basis of the white line type estimated by the white line type estimation section.",
            "Vehicle Operation Support System and Navigation Apparatus - A vehicle operation support system includes a navigation device, and a drive control device. The navigation device includes: part for storing road information including branch point information; and part for acquiring road curvature information with reference to the road information, and providing the drive control device with the road curvature information, before a vehicle reaches the branch point. The road curvature information includes information about curvature of first and second road sections extending forward from a branch point. The drive control device estimates entrance of the vehicle into one of the first and second road sections as a selected road section, and controls a driving state of the vehicle by operating an actuator with reference to information about curvature of the selected road section, in response to estimation of entrance of the vehicle into the selected road section."
        ],
        [
            "Published",
            "06-24-2010",
            "09-30-2010",
            "11-06-2014"
        ]
    ],
    "pageTitle": "Ueyama, JP - Patent applications",
    "title": "",
    "url": "http://www.faqs.org/patents/inventor/ueyama-jp-5/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042982745.46/warc/CC-MAIN-20150728002302-00315-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 431865455,
    "recordOffset": 431834619,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Mikio Ueyama, Shimotsuga-Gun JP //]]> BarDraw('3666962',['Patent applications by Masayuki Ueyama, Takarazuka-Shi JP'],[[1,1,1,1]],['2007','2008','2011','2013'],0); // <script type=\"text/javascript\"> </div> <div id=\"legend3666962\" align=\"center\"></div> </div> <canvas id=\"bg3666962\" style=\"max-width: 500px; width: 100%;\"></canvas> <div> <p align=\"center\">Patent applications by Masayuki Ueyama, Takarazuka-Shi JP</p> <div class=\"bar3666962\" style=\"max-width: 500px; width: 100%; float:left; \"> <div align=\"left\" style=\"padding-top:20px;\"> </table> </tbody> </tr> <td>03-14-2013</td> <td><a href=\"/patents/app/20130065141\">Fuel Cell Device</a> - The fuel cell device is provided with: an electricity-generating unit having a fuel electrode (</td> <td>20130065141</td> <tr> </tr> <td>07-28-2011</td> <td><a href=\"/patents/app/20110181933\">OPTICAL SCANNER</a> - An optical scanner capable of preventing breakage of a shaft section due to stress concentration is provided. A mirror frame </td> <td>20110181933</td> <tr> </tr> <td>08-21-2008</td> <td><a href=\"/patents/app/20080198433\">MICROSCANNER AND OPTICAL EQUIPMENT WITH THE SAME</a> - An optical scanner including a mirror part for reflecting light, a main axis part for supporting the mirror part in a pivotable manner, and a deformable holding part for holding the main axis part. A torsion bar for converting a deformation of the holding part itself into a deformation in torsion is disposed adjacent to the main axis part and is formed in at least one of the holding part and the mirror part. The deformation in torsion generated in the torsion bar makes the mirror part tilt.</td> <td>20080198433</td> <tr> </tr> <th>Published</th> <th>Description</th> <th>Patent application number</th> <tr> <tbody> <table class=\"preltab\" id=\"inv_tab_3666962\"> <h2>Masayuki Ueyama, Takarazuka-Shi JP</h2> </table> </tbody> </tr> <td>05-16-2013</td> <td><a href=\"/patents/app/20130122554\">METHOD FOR TREATING LIGNOCELLULOSIC BIOMASS</a> - It is intended to provide a method for treating lignocellulosic biomass, which can reliably show the completion",
    "textAfterTable": "Mikio Ueyama, Ohira JP Patent application number Description Published 20080243389 Vehicle Collision Avoidance Equipment and Method - An object recognizing means obtains a relative physical value between a movable body and an object such as at least one of the other movable body, an object on the ground, a position on the ground, a topographical feature and a regional information around the movable body, and a safety keeping area calculator calculates an imaginary safety keeping area around the movable body from the relative physical value, and an object intrusion judging means decides as to at least one of whether or not the object is within the safety keeping area and whether or not the object will be within the safety keeping area to perform at least one of controlling for preventing a collision between the movable body and the object and outputting an alarm, when deciding the at least one of that the object is within the safety keeping area and that the object will be within the safety keeping area. 10-02-2008 20090088941 Vehicle Speed Control System - A vehicle speed control system includes a road shape recognition unit which recognizes a road shape, a target speed setting unit which sets a target speed according to the road shape, a speed control unit which controls the host vehicle's speed according to the target speed, a parameter detecting unit which detects at least one of parameters representing the driver's",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}