{
    "relation": [
        [
            "Patent application number",
            "20090036317",
            "20120009568"
        ],
        [
            "Description",
            "THERMOELECTRIC METHOD OF SEQUENCING NUCLEIC ACIDS - The present invention relates to a novel thermoelectric method for determining the sequence of nucleotides on a nucleic acid molecule through use of a thermopile and/or sequencing reagents flowing under the conditions of laminar flow. The methods disclosed herein involve the measurement of the heat generated by a deoxynucleotide incorporation event that can be accomplished without the need to control the temperature of any of a thermopile's junctions.",
            "THERMOELECTRIC METHOD OF SEQUENCING NUCLEIC ACIDS - The present invention relates to a novel thermoelectric method for determining the sequence of nucleotides on a nucleic acid molecule through use of a thermopile and/or sequencing reagents flowing under the conditions of laminar flow. The methods disclosed herein involve the measurement of the heat generated by a deoxynucleotide incorporation event that can be accomplished without the need to control the temperature of any of a thermopile's junctions."
        ],
        [
            "Published",
            "02-05-2009",
            "01-12-2012"
        ]
    ],
    "pageTitle": "Eric J. - Patent applications",
    "title": "",
    "url": "http://www.faqs.org/patents/inventor/eric-j-7/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042982745.46/warc/CC-MAIN-20150728002302-00156-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 442766671,
    "recordOffset": 442725886,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Eric J. Guilbeau, Ruston, LA US //]]> BarDraw('3188501',['Patent applications by Eric J. Grandich, Houston, TX US'],[[1,1,1]],['2008','2009','2013'],0); // <script type=\"text/javascript\"> </div> <div id=\"legend3188501\" align=\"center\"></div> </div> <canvas id=\"bg3188501\" style=\"max-width: 500px; width: 100%;\"></canvas> <div> <p align=\"center\">Patent applications by Eric J. Grandich, Houston, TX US</p> <div class=\"bar3188501\" style=\"max-width: 500px; width: 100%; float:left; \"> <div align=\"left\" style=\"padding-top:20px;\"> </table> </tbody> </tr> <td>11-07-2013</td> <td><a href=\"/patents/app/20130292623\">Balustrade Having Metal Balusters With Ornamental Ends</a> - A metal baluster is provided which has first and second metal segments, where each of these metal segments comprises a first end and a second end. The first ends of the first metal segments include extension portions from mating engagement with one another and the second end of each metal segment is adapted for attachment to the underside of an elongated handrail or to a tread or floor. The second end of each of the metal segments further comprises an ornamental portion which is proximate the elongated handrail or the tread or the floor. Connection apparatuses provided for securing the engagement of the extension portions of the first metal segment and the second metal segment. A balustrade is also provided which comprises a plurality of balusters as described above.</td> <td>20130292623</td> <tr> </tr> <td>12-31-2009</td> <td><a href=\"/patents/app/20090321702\">Metal Baluster With Ornamental Ends</a> - A metal baluster is provided which has first and second metal segments, where each of these metal segments comprises a first end and a second end. The first ends of the first metal segments include extension portions from mating engagement",
    "textAfterTable": "Eric J. Hamblen, Beaverton, OR US Patent application number Description Published 20100058996 Tether for use with autistic children - A tether for use with autistic children includes belts, one each for wear by an adult and a child for maintaining them side by side during a training session. Tether attached rings are confined by fabric closure members on the belts to maintain proximity of child and adult but can yield upon increased tensioning of the tether. The tether has spaced loops for adjusting tether length. A lock is provided to secure a tether end. 03-11-2010 Eric J. Heverly, Novi, MI US Patent application number Description Published 20100121658 DENTAL CHARTING SYSTEM - A computer-implemented dental charting system includes a computer storing tooth data for at least one patient and a display operable to display the tooth data. The computer is responsive to voice commands, and the display has a periodontal mode and a restorative mode. The display includes an exam overview window illustrating a plurality of tooth images, each tooth image corresponding to a patient tooth location, and an exam focus window. The exam focus window illustrates a magnified view of at least one of the plurality of tooth images, and illustrates data corresponding to the selected tooth location. The exam focus window may be displayed beside the exam overview window, as a floating window on top of the exam overview",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}