{
    "relation": [
        [
            "Categories",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "There are so many groups that pertain to majors and hobbies that it is hard to not belong to a group and have something going on daily.",
            "FVTC has food courts on their campus as well as being able to use UWO's food courts as well.",
            "FVTC offers dorms at UWO so you still get the big campus feeling without actually having to go to a big university.",
            "The classes here are hard but they are passable with effort, all you need to do is just make time to study and go to class and you will have a good GPA.",
            "I recommend attending here even if you do not have a set major in mind just taking classes helped me realize the program I wanted to be in.",
            "Fox Valley Tech is a vast school with professors who take the time to get to know you and help you through class and other life challenges."
        ]
    ],
    "pageTitle": "Fox Valley Technical College Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Fox-Valley-Technical-College/reviews?_escaped_fragment_=/show/22594",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042981856.5/warc/CC-MAIN-20150728002301-00072-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 897117367,
    "recordOffset": 897086160,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{105689=© 2015, Cappex.com, LLC}",
    "textBeforeTable": "06/22/2010 Reviewer is A current student here. 5 out of 5 people found this review useful. 1 of 27 Eugene from Appleton, WI Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for",
    "textAfterTable": "Elizabeth from De Pere, WI 10/27/2010 Reviewer is A current student here. 5 out of 5 people found this review useful. 2 of 27 Categories Comments Great for these types of students Fox Valley is a great place for new students, transfer students, and returning students. If you are a full time parent or employee, Fox Valley does its best to help you offering day classes, night classes, and online classes. If you have the drive to learn, Fox Valley is the place for you! Tips for prospective students Even if you are not looking to attend a technical school, check it out. There are so many opportunities that most people don't know about. Fox Valley can also earn you credits towards other 4-year colleges if you don't find a program there for you. Bang for the buck Compared to other universities in Wisconsin, Fox Valley is extremely affordable. I previously attended a university in Wisconsin and I feel as though my education at FVTC is equally valuable at about 1/2 of the price",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}