{
    "relation": [
        [
            "Patent application number",
            "20100004691",
            "20120239040",
            "20150032166"
        ],
        [
            "Description",
            "GROWTH CONTROL DEVICE - A growth control device includes a bone plate having a stepped profile defined by a first level, a second level and an intermediate ramp connecting the first and second levels. The first level includes a first threaded hole for receiving a first bone fastener and the second level includes a second threaded hole for receiving a second bone fastener. The bone plate includes a proximal pair of side female notches, a distal pair of side female notches, a proximal guide hole and a distal guide hole.",
            "GROWTH CONTROL DEVICE - A growth control device includes a bone plate having a stepped profile defined by a first level, a second level and an intermediate ramp connecting the first and second levels. The first level includes a first threaded hole for receiving a first bone fastener and the second level includes a second threaded hole for receiving a second bone fastener. The bone plate includes a proximal pair of side female notches, a distal pair of side female notches, a proximal guide hole and a distal guide hole.",
            "GROWTH CONTROL DEVICE - A growth control device includes a bone plate having a stepped profile defined by a first level, a second level and an intermediate ramp connecting the first and second levels. The first level includes a first threaded hole for receiving a first bone fastener and the second level includes a second threaded hole for receiving a second bone fastener. The bone plate includes a proximal pair of side female notches, a distal pair of side female notches, a proximal guide hole and a distal guide hole."
        ],
        [
            "Published",
            "01-07-2010",
            "09-20-2012",
            "01-29-2015"
        ]
    ],
    "pageTitle": "Amato, US - Patent applications",
    "title": "",
    "url": "http://www.faqs.org/patents/inventor/amato-us-5/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042981856.5/warc/CC-MAIN-20150728002301-00262-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 432159727,
    "recordOffset": 432143640,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Matthew F. Amato, Lawrenceville, NJ US 06-04-2015 IMPLANTABLE PROSTHESIS HAVING ACELLULAR TISSUE ATTACHMENTS - A prosthesis comprising a tissue expander and one or more samples of graft material, wherein the tissue expander is attached to the one or more samples of graft material in a manner that allows the tissue expander and the one or more samples of graft material to be implanted in a patient as a unitary prosthesis; and wherein tissue expander is attached to the one or more samples of graft material in a manner that will allow the tissue expander and the graft material to separate after a period of time following implantation to allow removal of the tissue expander from an implant sites while leaving the graft material within the implant site, the prosthesis comprises a tissue expander having molded grooves, slots, channels, or other shallow cavity spaces on a surface, and wherein the graft material is within the grooves, slots, channels, or other shallow cavity spaces, securing the graft material to the tissue expander. 20150150674 Published Description Patent application number Matthew Amato, Lawrenceville, NJ US 08-29-2013 TECHNIQUES FOR IMPROVING RELIABILITY OF A FAULT CURRENT LIMITING SYSTEM - Techniques for improving reliability of a superconducting fault current limiting system (SCFCL) are provided. In one particular exemplary embodiment, the techniques may be realized with a superconducting fault current limiting system (SCFCL) comprising: an input current lead and an output current lead,",
    "textAfterTable": "Patent applications by Matthew F. Amato, Lawrenceville, NJ US Michael Amato, Reston, VA US Patent application number Description Published 20140058970 DYNAMIC CHANGE OF ADDRESS NOTIFICATION - A method is described that provides a notification to the sender or mailer of a mailpiece when the addressee of the mailpiece has changed address. One step in the method includes creation of an updated delivery code that may comprise both the forwarding address of the addressee, the sender's address information, and corresponding barcodes. The postal delivery system sends the mailed item to the forwarding address and provides the sender with the updated information for the addressee. The notification can occur by electronic message systems or delivery of a physical notification. 02-27-2014 Michael J. Amato, Reston, VA US Patent application number Description Published 20120179622 SYSTEM AND METHOD FOR PREDELIVERY NOTIFCATION USING MAIL IMAGE - Methods and systems are provided for filtering of a mail item addressed to a recipient. In accordance with an embodiment, preference information about mail items form the recipient is obtained. The preference information is compared with information on the mail item and based on the comparison, it is",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}