{
    "relation": [
        [
            "",
            "World of Warcraft (2005)",
            "Total War: Shogun 2 (2011)",
            "Anno 2070 (2011)",
            "Diablo III (2012)",
            "Sleeping Dogs (2012)",
            "Torchlight 2 (2012)",
            "Hitman: Absolution (2012)",
            "Tomb Raider (2013)",
            "BioShock Infinite (2013)",
            "Metro: Last Light (2013)",
            "GRID 2 (2013)",
            "Company of Heroes 2 (2013)",
            "Total War: Rome II (2013)"
        ],
        [
            "low",
            "342",
            "252",
            "198",
            "153",
            "158",
            "155",
            "64",
            "196",
            "178",
            "86",
            "166",
            "54",
            "191"
        ],
        [
            "med.",
            "197",
            "99",
            "117",
            "119",
            "119",
            "108",
            "59",
            "118",
            "115",
            "73",
            "129",
            "47",
            "146"
        ],
        [
            "high",
            "149",
            "",
            "74",
            "103",
            "77",
            "",
            "52",
            "76",
            "101",
            "44",
            "100",
            "31",
            "121"
        ],
        [
            "ultra",
            "68",
            "42",
            "42",
            "65",
            "23",
            "102",
            "38",
            "36",
            "37",
            "24",
            "43",
            "15",
            "22"
        ],
        [
            "",
            "fps",
            "fps",
            "fps",
            "fps",
            "fps",
            "fps",
            "fps",
            "fps",
            "fps",
            "fps",
            "fps",
            "fps",
            "fps"
        ]
    ],
    "pageTitle": "MSI GT70-20Li716121B Workstation Review - NotebookCheck.net Reviews",
    "title": "",
    "url": "http://www.notebookcheck.net/MSI-GT70-20Li716121B-Workstation-Review.116332.0.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042981856.5/warc/CC-MAIN-20150728002301-00280-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 613600943,
    "recordOffset": 613539267,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{46708=The latest workstation models of MSI's GT70 are currently available in three different versions at retailers. The street prices range from 2200 Euros to 3000 Euros (~$3012 to ~$4108). The main differences, apart from the price design, are the CPU, GPU, and RAM configuration. The first thing that professional workstation users will look at is the installed graphics unit. Like most contenders, MSI prefers Nvidia's Quadro product line over AMD's FirePro. The three currently available GT70 models are equipped with either Nvidia's Quadro K3100M or Nvidia's Quadro K4100M as in our review sample., 68576=To be classified as a mobile workstation, a professional graphics solution like Nvidia's Quadro or AMD's FirePro is an essential piece of equipment because they are unambiguously designed for the professional field with their special capabilities. MSI's GT70-2OLi716121B is based on the \"standard\" GT70-MSI1763 barebone that will likely be a household name in the gaming community, but it has been furnished with the corresponding performance equipment. Nvidia's Quadro K4100M graphics can be seen as the core component, which ultimately turns the gaming machine into a workhorse. Intel's Core i7-4800MQ processor, 16 GB of RAM, a solid state drive, 17-inch Full HD screen, and Windows 8 Pro round off the configuration. As appropriate, a downgrade option to Window 7 Professional is also available., 67531=The current street price ranges just below 3000 Euros (~$4108) and undercuts the Quadro K4100M models in the forms of Dell's Precision M6800 or HP's ZBook 17 by about 400 to 1000 Euros (~$547 to ~$1369). We will not go in-depth about connectivity, input devices and other minor sections because there are no differences compared with the previously tested MSI GT70H 2PE-890US Gaming Notebook.}",
    "TableContextTimeStampAfterTable": "{40726=The core component of MSI's mobile workstation is the professional Nvidia Quadro K4100M graphics that we list in our Performance Class 1. It has received very good preconditions for meeting demanding tasks in the professional field with a core rate of 700 MHz, 4 GB of GDDR5 graphics memory, 256-bit memory interface, and 1152 Shader units. The high performance especially has an effect on processing-intensive 3D CAD programs, owing to special drivers that can benefit from exclusive optimizations particularly in OpenGL tasks., 187345=The battery runtimes benefit from the battery's capacity of just less than 80 Wh, and Nvidia's Optimus technology that enables switching between the integrated and dedicated graphics cards. We achieved a maximum runtime of 8:03 h in Battery Eater's Reader's test using the energy-saving profile, minimum screen brightness, Intel's graphics, and flight mode. Seen in total, that is not awesome but compared with the workstations tested to-date, quite impressive. The Wi-Fi and video tests both place a higher demand on the battery, and roughly halve the battery runtime. We used a screen brightness of 150 cd/m², energy-savings mode, Intel's graphics, and Wi-Fi for the first test. The user will only have a bit more than an hour in full load, ascertained with Battery Eater's Classic test using maximum brightness, all on, and Nvidia's Quadro. This runtime is also still quite flattering because the graphics card runs with a reduced clock and consequently lessens the total power consumption.}",
    "lastModified": "Tue, 28 Jul 2015 03:21:59 GMT",
    "textBeforeTable": "Although gamers are not the primary target group of professional workstations, we always look at the performance in different titles. The hardware requirements are good and do a similarly good job as comparable consumer chips. Nvidia's Quadro K4100M could easily cope with all tested games in high settings. A few games were first excluded in our ultra settings. Sleeping Dogs, Metro Last Light, Company of Heroes 2 and Total War Rome 2 were no longer fun. Gaming Performance 17081 \"> font-weight:bold; border: 1px solid #550000; color: #ffffff; text-align: right; line-height: 16px; padding-bottom:auto; padding-top:auto; padding: 3px; margin: 1px; width: 310px; height: 16px; background: #8a0101; MSI GT80-2QES32SR311BW (max)  4980HQ, GeForce GTX 980M SLI    ... 5178 \"> font-weight:bold; border: 1px solid #550000; color: #ffffff; text-align: right; line-height: 16px; padding-bottom:auto; padding-top:auto; padding: 3px; margin: 1px; width: 114.88027633043px; height: 16px; background: #8a0101; Acer Aspire V 17 Nitro (VN7-791G-759Q)  4710HQ, GeForce GTX 860M 5153 \"> font-weight:bold; border: 1px solid #550000; color: #ffffff; text-align: right; line-height: 16px; padding-bottom:auto; padding-top:auto; padding: 3px; margin: 1px; width: 114.47046425853px; height: 16px; background: #8a0101; Gigabyte P27G v2  4710MQ, GeForce GTX 860M 5152",
    "textAfterTable": "Emissions System Noise The review sample's operating noise is relatively high. It never dropped below a noise level of 34 dB(A). Consequently, the system is always present, and it clearly attracts attention even in the not very demanding office mode using the integrated Intel graphics. The fan drowned out both the optical drive and the conventional hard drive and thus could not be measured separately. The ascertained rate climbs to 41.8 dB(A) in medium load, and we measured 51.4 dB(A) during full load. The noise level even increased by approximately 6 dB(A) when the \"max fan\" option was selected via the sensor button. The fan then permanently ran at full speed. Noise Level Idle 34.9 / 34.9 / 34.9 dB(A)",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}