{
    "relation": [
        [
            "Pos",
            "1",
            "2",
            "3",
            "4",
            "5",
            "6",
            "7",
            "8"
        ],
        [
            "Car Number",
            "33",
            "97",
            "42",
            "80",
            "72.",
            "350",
            "8",
            "230"
        ],
        [
            "Name",
            "Tina Anderson",
            "Jacob Newman",
            "William Denny",
            "Bill McBride",
            "Bo Smith",
            "Terry Winstead",
            "Ken Dollarhite",
            "Mark Mantyla"
        ],
        [
            "Behind Leader",
            "",
            "0.103",
            "4.006",
            "--1 Lap--",
            "--2 Laps--",
            "3.516",
            "--3 Laps--",
            "5.978"
        ],
        [
            "Gap",
            "",
            "0.103",
            "3.903",
            "--1 Lap--",
            "--1 Lap--",
            "3.516",
            "--1 Lap--",
            "5.978"
        ]
    ],
    "pageTitle": "Spartan Speedway Recap Aug 4, 2006",
    "title": "",
    "url": "http://spartanspeedway.com/numbers/archives/2006/recap0804.php",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042982745.46/warc/CC-MAIN-20150728002302-00305-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 225918295,
    "recordOffset": 225906052,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{1301=Eight lucky drivers were chosen to chauffeur eight retired school busses around the Figure 8 track, August 4th, at Spartan Speedway. There was lots of beating and banging going on after the drop of the green, as Dane Long, Matt Schindewolf, Jimmy Scavarda, Chris Place, Doc Dutton, Scott Sigman, Jon McNett, and Lyndon Johnson (who looked suspiciously like Rob Newman) all wanted to lead lap one. Parts were flying and debris littered the track, and just five laps into the 15-lap feature, Long tipped his ?mid-length? bus over on its side, much to the pleasure of the rowdies in turn four. Place started shotgun on the field and muscled his way up through the field, often driving three-wide on Paul?s beloved grass. Schindewolf did a superb job of keeping Dutton behind him, after taking over the top spot, when the ?Disturbed One? dumped his bus. Schindewolf managed to hold off Dutton and ?crazy? Chris Place (the last driver to tip a bus over last season) for the win. Long and Dutton both won their heats. With horns honking and flashers flashing, the first school bus Figure 8 of the season proved to be a real crowd pleaser, entertaining one of the largest Friday night crowds of 2006. Some of the proud sponsors of the school bus Figure 8 special were Northside Towing, Kitsmiller RV, GLHBA, Chazlo Technologies, and Beacon Sales. On the subject of Figure 8?s, the Holiday Powersports Pony Stocks ran the ninth in their series of Figure 8 events, with John Ward taking yet another win, extending his streak to eight. Keith Holden, Bill Denny, Brent McCort, and Mark Mantyla rounded out the top five, with everyone but Holden and Denny getting lapped by Ward. Attrition claimed Bo Smith, Joe Bates, Terry Winstead, Trent Jenson, and Brian Beckner. These guys put on a whale of a show and are to be commended. The Wolverine Outlaw Winged Midgets made at stop at the fast, ¼-mile with Nick Mitchell setting fast time with a 12.792. With four different leaders, and much jockeying for position, Mitchell came out on top, after battling with Chris Randolph for 13 laps. Local driver, Derek Snyder was the first to lead in the early laps, with Gary Harrell putting his car up front on lap five. Randolph took over on lap six and led through lap 19, when Mitchell got around him on the backstretch. At the line, it was Mitchell, Randolph, Hettinger, Harrell, and Doug Dietsch. Hettinger and Harrell both took heat wins. The Holiday Powersports Pony Stock division saw eighteen competitors time in for their 20-lap feature. John Conroy set fast time for the evening with a 16.678. George Wyers and Keith Holden made up the front row, and Wyers was shown as the lap one leader. John Ward worked his way into fourth by lap two, from his ninth start position. Scavarda made his way around Ward and into third, and picked off Holden and Wyers, while bringing Ward along with him. Ward stuck a nose under Scavarda on lap 14 and Scavarda slammed the door. Wayne Beckner Jr. jumped into the mix, to sit in the fourth position. Beckner worked his way around Wyers into third, while Ward couldn?t get within striking distance of Scavarda, and had to settle for a second place finish. It was Scavarda?s ninth feature-win of the season. Ward, Beckner, Wyers, and Bryan Passick Jr. rounded out the top five. Dane Long is proving his might every week, and this week was no exception, as he qualified at a 14.309. Al Williams and Chuck Ammerman started on the front row, with C. Ammerman taking the top spot on lap one. Scott Sigman and Ron Heeney set sail for the front, with Sigman taking the number one position on lap two. Heeney made his way around Sigman, but Sigman wasn?t going without a fight. Heeney used a slower car as a pick to slow Sigman?s progress. Meanwhile, Long had worked his way into the third spot and he and Sigman went at it for second. Caution on lap 21 diminished Heeney?s 1.5 second lead. On the restart, Long was right behind Heeney, waiting for one little opportunity. Damon Place, sitting third, ahead of Sigman, was also waiting for his chance to advance. Quite a battle ensued, with Long sticking a fender under Heeney, but Heeney was able to drive away coming out of the turn, coming down to the checker. At the line, it was Heeney, Long, Place, Sigman, and Nate Moon. Sigman and Heeney won their heats. Evan Barrett scored his first-ever feature win in the Andrews Chevrolet Super Late Model division. Barrett was able to jump out to the early lead and put some distance between himself and the rest of the field. The pack behind him was caught up in side by side racing, with Doug Finley and Jon McNett using the second groove to make their move to the front. Finley worked his way into the second position by lap 12, with Jim Bailey and McNett in tow. Finley was methodically reeling in Barrett, as caution came out on lap 23. Barrett was able to outrun Finley on the restart, as Jimmy Gallagher made his way around Bailey, into fourth. Another caution brought Jeff Hackworth up into the top five and the heat was on. Barrett and Finley broke away from McNett and Gallagher, and on lap 35, Finley looked to the inside of Barrett. Barrett was able to hold him off and, at the line, it was Barrett, Finley, McNett, Gallagher, and Hackworth. Barrett also scored a heat win, along with Stan Perry. Please join us Friday, August 18, for the rescheduled ?Chargin? Charlie Ryan? Memorial Race, featuring a complete invert, for the Andrews Chevrolet Super Late Models, along with the WMMQ Classic Rock 94.9 MI Modifieds, Performance Automotive NW Street Stocks, Holiday Powersports Pony Stocks, and a ?Hot Dog Race.? Tony Stewart, Tim Fedewa, David Stremme, and Clint Bowyer will also be appearing, with no autograph session, due to their time constraints. The evening will be sponsored by B & L Truck Caps.}",
    "textBeforeTable": "Andrews Chevrolet Super Late Models Qualifying Results By: Michelle Sprague Eight lucky drivers were chosen to chauffeur eight retired school busses around the Figure 8 track, August 4th, at Spartan Speedway. There was lots of beating and banging going on after the drop of the green, as Dane Long, Matt Schindewolf, Jimmy Scavarda, Chris Place, Doc Dutton, Scott Sigman, Jon McNett, and Lyndon Johnson (who looked suspiciously like Rob Newman) all wanted to lead lap one. Parts were flying and debris littered the track, and just five laps into the 15-lap feature, Long tipped his ?mid-length? bus over on its side, much to the pleasure of the rowdies in turn four. Place started shotgun on the field and muscled his way up through the field, often driving three-wide on Paul?s beloved grass. Schindewolf did a superb job of keeping Dutton behind him, after taking over the top spot, when the ?Disturbed One? dumped his bus. Schindewolf managed to hold off Dutton and ?crazy? Chris Place (the last driver to tip a bus over last season) for the win. Long and Dutton both won their heats. With horns honking and flashers flashing, the first school bus Figure 8 of the season proved to be a real crowd pleaser, entertaining one of the largest Friday night crowds of 2006. Some of the proud sponsors of the school",
    "textAfterTable": "8 007 Dale Lewis 13.304 0.141 13.491 9 10. Stan Perry 13.308 0.145 13.311 10 34 John Ledwidge 13.393 0.230 13.473 11 2 Bob Bauer 13.404 0.241 14.842 12 94 Evan Barrett 13.417 0.254 13.456 13 6X Jim Bailey 13.459 0.296 13.487 14 T2 Doc Dutton 13.467 0.304 13.852 15 45 Carl Sodman 13.648 0.485 14.016 16 18. Dean Gassert 13.699 0.536 14.327 17 67 Tim Rugg 13.897 0.734 14.036 18 94w Fred Worden III -.--- -.--- -.---",
    "hasKeyColumn": true,
    "keyColumnIndex": 2,
    "headerRowIndex": 0
}