{
    "relation": [
        [
            "Thu, 10 Jun 2010, 6:54am",
            "keyoshikira Warrior Registered: Sep, 2008 Last visit: Sat, 14 Aug 2010 Posts: 62",
            "Offline"
        ],
        [
            "#25",
            "I added some pics, but they need to be edited. I have only PAINT XD Spoiler: Last edited Thu, 10 Jun 2010, 1:24pm by Sarin Char: Lolek Serv: Cancer http://hagendis.pl/",
            "Link Post Topic (x)"
        ]
    ],
    "pageTitle": "Missing Item Icons - Wonderland Online Database",
    "title": "",
    "url": "http://wlodb.com/topics/4008",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042982745.46/warc/CC-MAIN-20150728002302-00001-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 265717355,
    "recordOffset": 265694399,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{127752=(tall image) Dentist (Mayan Tribe) LV 96 Fire HP 1343 SP 514 STR 77 CON 78 INT 26 WIS 28 AGI 79, 94943=Last edited Sat, 20 Mar 2010, 7:38pm by xGh0stlyx, 47916=4/5/2010, 46866=3/23/2010, 11589=3/11/2010 - Thanks ret3, 34650=3/20/2010, 99901=Eagle (Deep Jungle of Hanging Garden) LV 150 Earth HP 2131 SP 1537 STR 87 CON 106 INT 84 WIS 84 AGI 89, 128367=Boy (Mayan Tribe) LV 126 Earth HP 1622 SP 934 STR 82 CON 85 INT 57 WIS 51 AGI 103, 130396=Last edited Sat, 27 Mar 2010, 1:53pm by ret3, 63913=Last edited Sun, 14 Mar 2010, 5:37pm by Hugomka, 12680=3/13/2010 - Thanks ret3, Sarin, 128065=Mannix (Mayan Tribe) LV 136 Earth HP 2065 SP 929 STR 102 CON 107 INT 45 WIS 49 AGI 105, 156044=Last edited Thu, 10 Jun 2010, 1:24pm by Sarin, 27339=3/16/2010, 138238=While going to Polo Island to get Superior Alchemy (finally! ;) ) I mistook Hezrou for Polo and I've landed there. I was surprised to meet some Tyrannosaurs there. Well, I added them to the database under the Hezrou Island, but I don't know their drops. Here are their images (version 1:1 and scaled to 96x96, whichever fits better): Valley Tyrannosaur lvl 77 Spraying Tyrannosaur lvl 78 Red Tyrannosaur lvl 77 Green Tyrannosaur lvl 78, 51949=Last edited Mon, 05 Apr 2010, 6:13pm by Sarin, 68626=Last edited Sun, 14 Mar 2010, 10:03pm by Hugomka, 149853=Last edited Fri, 23 Apr 2010, 2:09pm by Hugomka, 8614=Uploaded 3/10/2010 - Thanks ret3, 85486=Last edited Fri, 19 Mar 2010, 4:38am by ret3}",
    "textBeforeTable": "Link Post   Topic   (x) Offline COMPLETE QUEST LIST Noxuking lvl 18x Wind Noxuqueen lvl 19x Water Noxukau lvl 19x Fire Server: Capricorn Spoiler: Chars pic for Sun Badge ^^ http://wlodb.com/files/Sun_Badge.bmp Posts: 133 Last visit: Fri, 11 Nov 2011 Registered: Dec, 2009 Conqueror Noxukau1 #24 Wed, 02 Jun 2010, 3:52pm Link Post   Topic   (x) Offline Last edited Fri, 23 Apr 2010, 2:09pm by Hugomka @ #22: Just updated! @ #20: Oh, what a coincidence. Those monsters are already",
    "textAfterTable": "Thu, 10 Jun 2010, 10:20am #26 ret3 King Registered: Nov, 2009 Last visit: Sun, 03 Oct 2010 Posts: 446 keyoshikira wrote:I added some pics, but they need to be edited. I have only PAINT XD You should drag each item to a large \"white\" area on the screen before getting a screenshot. That gets rid of the number that blocks a corner of the image, and makes it easiear to erase the background. Offline Link Post   Topic   (x) Thu, 10 Jun 2010, 1:25pm #27 Sarin Administrator Registered: Apr, 2009 Last visit: Fri, 15 Mar 2013 Posts: 1522 Thanks for posting the images ^_^ I'll get them edited and posted this weekend when I have some time to sit down and work on them.",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}