{
    "relation": [
        [
            "Days",
            "30",
            "50",
            "150",
            "200"
        ],
        [
            "BSE",
            "1636.29",
            "1583.94",
            "1456.30",
            "1373.67"
        ],
        [
            "NSE",
            "1636.29",
            "1584.38",
            "1457.95",
            "1374.84"
        ]
    ],
    "pageTitle": "Bajaj Finserv Stock Price, Share Price, Live BSE/NSE, Bajaj Finserv Bids Offers. Buy/Sell Bajaj Finserv news & tips, & F&O Quotes",
    "title": "",
    "url": "http://www.moneycontrol.com/india/stockpricequote/finance-investments/bajajfinserv/BF04",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042981856.5/warc/CC-MAIN-20150728002301-00046-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 600158171,
    "recordOffset": 600110399,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{212511=Zensar Technologies Recommended on Mar 24th 2015, 135638=JSWSteel Jul Fut, 134420=28 July 2015, 134931=UnitedBrewerie Jul Fut, 213820=Bajaj Finserv is in the Finance - Investments sector. The current market capitalisation stands at Rs 27,369.53 crore. The company management includes Rahul Bajaj - Chairman, Nanoo Pamnani - Vice Chairman, Sanjiv Bajaj - Managing Director, Madhur Bajaj - Director, Rajiv Bajaj - Director, D J Balaji Rao - Director, S H Khan - Director, Naresh Chandra - Director, Gita Piramal - Director. It is listed on the BSE with a BSE Code of 532978 and the NSE with an NSE Code of BAJAJFINSV. Its Registered office is at Bajaj Auto Limited Complex, Mumbai - Pune Road,,Akurdi Pune,Maharashtra - 411035. Their Registrars are Karvy Computershare Private Ltd.}",
    "textBeforeTable": "Edit Watchlist Have you invested in these stocks? You can track them better in your Portfolio close[x] Add to Watchist Account Optional Optional Optional Optional Add to Portfolio OR Add to watchlist } $('#mcpcp_addprof_info').hide(); { function close_info()",
    "textAfterTable": "Keep me signed in Forgot Password? New to Moneycontrol - Sign up now Its easy and FREE! Username Username should be atleast 4 characters Password Password should be 6 to 10 characters Confirm Password Email OR connect with LIVE",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}