{
    "relation": [
        [
            "Date of Receipt",
            "3/20/2009",
            "3/20/2009",
            "5/1/2009"
        ],
        [
            "Date of review",
            "4/1/2009",
            "4/1/2009",
            "5/27/2009"
        ],
        [
            "Action Taken",
            "Comment Letter",
            "Comment Letter",
            "Approved Plans 05/28/09 Approval Number: 0934041"
        ]
    ],
    "pageTitle": "ISDH: Howard County Plan Review Project Status",
    "title": "Plan Status:",
    "url": "http://www.in.gov/isdh/23081.htm",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042982745.46/warc/CC-MAIN-20150728002302-00237-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 523183655,
    "recordOffset": 523170534,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{13155=For information on projects submitted before January 1, 2005, please contact the Environmental Public Health Division., 41699=Judson Baptist Storage Shed 1995 N 750 W Project Number: 3411056 Reviewer: Ed Miller, 24059=Community of Poor Clare Nuns 1175 N 300 W Project Number: 3415091 Reviewer:, 16789=Hainlen Orchard ALC 5588 N 1250 E Project Number: 3407125 Reviewer: Robert Synko, 65576=Woodland Estates MHP 2176 N. 250 E. Project Number: 3406332 Reviewer: Robert Synko, 64636=Woodland Estates 2176 N 250 E Project Number: 3406075 Reviewer: Robert Synko, 30665=First General Baptist Church 2940 East C.R. 50 N Project Number: 3408007 Reviewer: Dennis Ehlers (Retired), 47458=Maple Farms Office 3924 S 250 E Project Number: 3412224 Reviewer: Ed Miller, 17664=Hainlen Orchard Migrant Workers camp 5588 N 1250 E Project Number: 3405205 Reviewer: Robert Synko, 45197=Leslie-Fisher Eng., Inc. 2719 E Blvd Project Number: 3407244 Reviewer: Dennis Ehlers (Retired), 62093=Trine's Trackside Orchard Banq. Hall 1228 W 350 N Project Number: 3413176 Reviewer: Ed Miller}",
    "textBeforeTable": "Mound System Type: No Referred to LHD: Technical Data Sheet issued Action Taken: 8/15/2006 Date of Review: 8/3/2006 Soils Survey Received: Soils: Agri-Lawn CR 200 W Project Number: 3406252 Reviewer: Dennis Ehlers (Retired) Commercial On-Site Sewage Disposal Projects Approved Plans 03/20/07 Approval Number: 0734041 3/19/2007 3/1/2007 Approved Plans 3/19/2007 3/1/2007 Action Taken Date of review Date of Receipt Plan Status: Mound System Type: No Referred to LHD: Technical Data Sheet issued Action Taken: 12/27/2006 Date of Review: 12/27/2006 Soils Survey Received: Soils 2:   Flood-Dosed System Type: No Referred to LHD: Technical Data Sheet issued Action Taken: 6/2/2005 Date of Review: 5/2/2005 Soils Survey Received: Soils 1: Hainlen Orchard Migrant Workers camp 5588 N 1250 E Project Number: 3405205 Reviewer: Robert Synko",
    "textAfterTable": "Soils 1: Soils Survey Received: 4/7/2005 Date of Review: 6/23/2005 Action Taken: Referred to LHD: No System Type:   Soils 2: Soils Survey Received: 9/25/2005 Date of Review: 1/12/1930 Action Taken: Technical Data Sheet issued Referred to LHD: No System Type: Flood-Dosed Plan Status: Date of Receipt Date of review Action Taken 7/27/2006 9/8/2006 Called Engineer 7/27/2006 9/8/2006 Called Engineer 9/15/2006 9/21/2006 Approved Plans 9/15/2006 12/20/2006 Approved Plans 12/21/06 Approval Number: 0634162 Community of Poor Clare Nuns 1175 N 300 W Project Number: 3415091 Reviewer: Soils: Soils Survey Received: 4/24/2015 Date of Review: 5/21/2015 Action Taken: Technical Data Sheet issued Referred to LHD: No System Type: Mound EquiVenture Therapeutic Riding Cntr, Inc. 6086 W 250 S Project Number: 3406181 Reviewer: Ed Miller Soils:",
    "hasKeyColumn": true,
    "keyColumnIndex": 2,
    "headerRowIndex": 0
}