{
    "relation": [
        [
            "Channel",
            "ABC1 NSW",
            "SBS ONE Sydney",
            "Channel Seven Sydney",
            "Channel Nine Sydney",
            "Network TEN Sydney"
        ],
        [
            "TV show",
            "rage",
            "Japanese News",
            "NBC Today",
            "Good Morning America",
            "Home Shopping"
        ],
        [
            "Time",
            "5 am - 6 am",
            "5:40 am - 6:15 am",
            "4 am - 6 am",
            "4:30 am - 6 am",
            "5:30 am - 6 am"
        ]
    ],
    "pageTitle": "Sydney Morning Herald - Business & World News Australia | smh.com.au",
    "title": "Summary of what TV shows are on tonight",
    "url": "http://www.smh.com.au/am/2013/03/02/index.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042981856.5/warc/CC-MAIN-20150728002301-00305-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 709207235,
    "recordOffset": 709136616,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{59178=MEGAN DOHERTY Sarah Abbott, who turns 15 on March 12, Canberra's official birthday, comes from a family with long and proud links to the national capital., 47876=TONY MOORE Brisbane tunnel engineers believe they have come up with a plan to save $500 million on the $4.5 billion underground rail project and deliver it by 2018, two years early., 56334=Previous tenants included 1700 babies.}",
    "TableContextTimeStampAfterTable": "{252282=Lee, Mar 1, 2013, 11:18PM, 242298=Total votes: 1983., 102973=Victoria Beckham won't join any Spice Girls Australian tour in 2014., 79183=Here's our guide to what's on in Canberra March 1 to March 3., 7344=RICHARD GLOVER The 5:2 diet seems sensible: just model your eating on a period of history when obesity was uncommon. But surely there are other epochs for publishers to consider., 150100=Enter now for Australia's premier half marathon on Sunday, May 19., 127573=March 5 A progressive dinner at popular Perth eateries offers foodies 'A Taste of Middle Perth'., 123544=March 3 Aching to check out Prodigy, Stone Roses, PSY and Bloc Party?, 129677=March 24 The Freeway Bike Hike for Asthma returns for its ninth year., 128600=April 18 Following rave reviews on the east coast, Jersey Boys is set to light up Crown Theatre., 126650=March 1 Australia's hottest band The Rubens return to Perth in May., 238826=For sale: Nostalgic home with 1700 former tenants, 253252=Margot, Mar 1, 2013, 8:56PM, 249535=2010 rewind as pollies still play voters for mugs, 184006=The chef is set to leave Longrain at the end of June., 272197=March 01 2013, 130772=May 31 Former Spice Girl joins Tim Minchin for Australia tour., 246171=1088 views, 244766=Six Nations 2013}",
    "textBeforeTable": "7am 6:30am 6am 5:30am 5am 4:30am Skip to: The only problem with The Doctor Blake Mysteries is that in 1950s Australia, everybody smoked. The Doctor Blake Mysteries What's on TV Tonight Thought-provoking opinion pieces from guest bloggers. Times Square Our local experts give you the advice you ask for. Good Advice Opinion The philosphy behind Dog Point wines is simple and effective. Marlborough – On Point The Wine Punter Watch MasterChef: The Professionals for your chance to win. Win a Chrysler 300 Limited",
    "textAfterTable": "Summary of what TV shows are on tonight Channel TV show Time ABC1 QLD rage 5 am - 6 am SBS ONE Queensland Korean News 5:05 am - 5:40 am Channel Seven Brisbane NBC Today 4 am - 6 am Channel Nine Brisbane Good Morning America 4:30 am - 6 am Network TEN Brisbane Home Shopping 5 am - 5:30 am Summary of what TV shows are on tonight Channel TV show Time ABC1 QLD rage 5 am - 6 am SBS ONE Queensland Japanese News 5:40 am - 6:15 am Channel Seven Brisbane NBC Today 4 am - 6 am Channel Nine Brisbane Good Morning America 4:30 am - 6 am Network TEN Brisbane Home Shopping",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}