{
    "relation": [
        [
            "Categories",
            "Campus Safety",
            "Clubs and Activities",
            "Great for these types of students",
            "Share any unusual traditions or locations on campus",
            "Bang for the buck",
            "What to do for fun",
            "Food and Dining",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "involved, and there to protect!",
            "SGA, Intramural basketball, OCCurrence Newspaper",
            "Students who don't know they're career plans but want to get Gen Eds done at a fraction of the cost.",
            "Skokie campus' second floor library, you can get a lot of studying done.",
            "Best option for students not trying to get into debt!",
            "Intramural basketball, spanish club, and being part of the student government.",
            "EXPENSIVE!! But there are no other places near!",
            "Some classes are just like lecture classes at big universities, however some classes remain small and the teachers are active with students.",
            "Don't be afraid to get involved with oakton students/staff! Talk to your teachers, they are humans like everyone else and at Oakton they are way more down to earth!",
            "Great community college with even better staff that are only after you best interest. The school is close and has two campuses and offers a lot to students willing to emerge themselves in the school."
        ]
    ],
    "pageTitle": "Oakton Community College Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Oakton-Community-College/reviews?_escaped_fragment_=/show/17196",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042982745.46/warc/CC-MAIN-20150728002302-00335-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 906990203,
    "recordOffset": 906956086,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{135068=© 2015, Cappex.com, LLC}",
    "textBeforeTable": "10/05/2011 Reviewer is A current student here. 3 out of 4 people found this review useful. 1 of 32 Khandkar from Niles, IL Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5",
    "textAfterTable": "Am enjoying being here It's hard to socialize here because everyone has their own cliques from high school... Actually it feels like I'm still in high school sometimes, but for the most part people here are very agreeable and polite. Also, amazing burgers hahaha. Am learning a lot Though some of the general education courses can become tedious, some teacher profoundly want you to walk away with at least a new grain of knowledge by the end of their lecture. Courses like World Mythology and General Physics are great to take if you're curious on how the world works behind the scenes. Login to rate or flag the reviews Christina from Evanston, IL 04/17/2011 Reviewer is A current student here. 2 out of 3 people found this review useful. 3 of 32 Categories Comments Great for these types of students Anyone. I have seen so many different types of people, culturally, socially, and age-wise. Anyone who isn't a",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}