{
    "relation": [
        [
            "Categories",
            "Campus Safety",
            "Greek Life",
            "Clubs and Activities",
            "Share any unusual traditions or locations on campus",
            "Bang for the buck",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "Security is alert and responsive needs more members though",
            "One of the best things about the campus",
            "There are an endless amount of organizations and volunteer work that is offered.",
            "none",
            "none",
            "Hang out with friends, work with animals on campus and listen to music",
            "The food isnt too good and currently dinning area is under construction",
            "Not the best dorms, needs updates",
            "Study and be persistent, there is no time to waste. Always ask for help and use all resources possible.",
            "Great school, You learn a lot of history and there are so many programs to choose from. One of the Top HBCU's in the country and offers a lot of assistance to students."
        ]
    ],
    "pageTitle": "Tuskegee University Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Tuskegee-University/reviews?_escaped_fragment_=/show/20940",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042981856.5/warc/CC-MAIN-20150728002301-00145-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 903828663,
    "recordOffset": 903749585,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{379522=Homecoming week is the best week for fun. The university had Bill Cosby, Gary Owens, Migos and August Alsaina as celebrity guest. They also occasionally have music and movies on the yard., 97018=I will be an incoming Freshman of the class 2016. My visit was okay, despite the delay of my Flights for Los Angeles. Tuskegee is a very beautiful campus. The weather is kind of weird and its changes. The hottest mont is August and the coldest month is October. There people there are friendly and they welcome and treat you like your home. Its a big change if your a city girl like me., 168606=Can't comment since I'll start school in fall 2012., 241286=I went to Tuskegee because it was close to home (less than 45 minutes away); because my uncle is an alum and because my Mom wanted me to get a great education in an area that would afford me the opportunity to be self-paced. I have Aspberger's Syndrome and she has carefully navigated my path since I was 6 years old. This has been the best thing that I have ever done for myself and I hope to get my master's Degree when I graduate in May of 2013., 273179=Dorm life at Tuskegee University can be overwhelming and misleading. Not all dorms are the same; some are a lot better than others. In most dorms on campus, there is a public bathroom on each floor which contains about twenty people. There is one kitchen for the entire building and one microwave for each floor if the residence hall makes it available to the students. There is no curfew; however, opposite sex visitors are only allowed in the designated lounge between 4:00 p.m. and 12:00 midnight. Mandatory meetings come around eight times for each semester. Students who do not attend these meetings will be fined., 405953=© 2015, Cappex.com, LLC, 201294=The food is a 6 out of 10. At times the cafeteria has decent meals and other times they don't. Our cafeteria is in a temporary building due to the reconstruction of the old cafeteria, which should be ready Fall 2012}",
    "textBeforeTable": "01/14/2010 Reviewer is A current student here. 31 out of 32 people found this review useful. 1 of 100 A. Smith Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new",
    "textAfterTable": "Bang for the buck now dont get me wrong tuskegee is a great school but theres gonna be times where you get fed up with how much you have to pay compared to the service you get. but its all part of the experience and will make you better off in the long run Am enjoying being here I enjoy Tuskegee, but you gotta be prepared for the black college experience which is the best there is. be prepared to have a roommate, be prepared for cold showers sometimes. be prepared to wait in long lines at the cafeteria, caf its the top hbcu in alabama, and number 6 in the country. great school. if you can make it here and survive with black folks. you can make it anywhere and deal with anybody. Am learning a lot You learn soo much at Tuskegee, im a history major here, so my schedule is pretty easy. lots of room for electives. If you are a guy then you should try and stay in young as a freshman, thats the best male freshman dorm. the other one, bethune looks like garbage. plus young has won the freshman step show 5 years a row. (Young Hall is SMooth!)",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}