{
    "relation": [
        [
            "Payment method",
            "",
            "Money Order/Bank cheque",
            "Personal cheque",
            "Bank Deposit"
        ],
        [
            "Preferred/Accepted",
            "Accepted",
            "Accepted",
            "Accepted",
            "Accepted"
        ],
        [
            "",
            "",
            "",
            "",
            ""
        ]
    ],
    "pageTitle": "Vinyl LP 60'S Sequenced MIX 40 Original Hits BY 40 Original Artists | eBay",
    "title": "",
    "url": "http://www.ebay.com.au/itm/VINYL-LP-60s-SEQUENCED-MIX-40-ORIGINAL-HITS-BY-40-ORIGINAL-ARTISTS-/110918614387?pt=AU_Records&hash=item19d343bd73",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042981856.5/warc/CC-MAIN-20150728002301-00140-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 417993419,
    "recordOffset": 417951221,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{60818=RELEASED IN 1988 BY \"EMI RECORDS\"}",
    "textBeforeTable": "Payment details returns - opens in a new window or tab. Refunds by law: In Australia, consumers have a legal right to obtain a refund from a business for goods purchased if the goods are faulty, not fit for purpose or don't match description. More information at ALL MY CD'S ARE IN OUTSTANDING CONDITION AND COME FROM A FACTORY OUTLET THEREFORE SHOULDN'T BE ANY COMPLAINTS WHATSOEVER !! ANYWAY IF YOU NOT ENTIRELY HAPPY WITH YOUR ITEM PLEASE GET IN CONTACT AND WE ARRANGE A POSITIVE OUTCOME !! Return policy details The seller is responsible for return postage costs. Exchange 7 days after the buyer receives it Refund will be given as Item must be returned within Return policy",
    "textAfterTable": "Seller's payment instructions VERY IMPORTANT!IF YOU MAKE A BANK PAYMENT PLEASE MENTION YOUR USER ID OR ITEM NUMBER AS REFERENCE OTHERWISE JUST MAIL ME THE LOCATION NUMBER OF YOUR BANK TO GET THE DEAL DONE AS QUICK AS POSSIBLE.IF WE DONT HAVE ANY LEADS WE CANT SEND THE ITEM! WE WON'T TAKE ANY RESPONSE FOR\"LOST,DAMAGED OR STOLEN\"ITEMS SO\"REGISTERED MAIL\"IS OPTIONAL TO AVOID ANY NEGATIVE HICKUPS IF NO CONTACT IS MADE WITHIN 7 DAYS PAYMENT DISPUTE WILL FOLLOW AND NEGATIVE FEEDBACK IS THE END OF THE STORY. Current bid amount + + import charges (shown at checkout) time left ##2## left | Bid Count",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}