{
    "relation": [
        [
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            ""
        ],
        [
            "No.",
            "1",
            "2",
            "3",
            "4",
            "5",
            "6",
            "7",
            "8",
            "9",
            "10",
            "11",
            "12",
            "13",
            "14",
            "15",
            "16",
            "17",
            "18",
            "19",
            "20",
            "21",
            "22"
        ],
        [
            "Name",
            "Ruud Geels",
            "Arie Haan",
            "Wim van Hanegem",
            "Kees van Ierssel",
            "Rinus Israël",
            "Wim Jansen",
            "Theo de Jong",
            "Jan Jongbloed",
            "Piet Keizer",
            "René van de Kerkhof",
            "Willy van de Kerkhof",
            "Ruud Krol",
            "Johan Neeskens",
            "Johan Cruyff",
            "Rob Rensenbrink",
            "Johnny Rep",
            "Wim Rijsbergen",
            "Piet Schrijvers",
            "Pleun Strik",
            "Wim Suurbier",
            "Eddy Treytel",
            "Harry Vos"
        ],
        [
            "Position",
            "Striker",
            "Midfield",
            "Midfield",
            "Defender",
            "Defender",
            "Midfield",
            "Midfield",
            "Goalkeeper",
            "Striker",
            "Midfield",
            "Midfield",
            "Defender",
            "Midfield",
            "Striker",
            "Striker",
            "Striker",
            "Defender",
            "Goalkeeper",
            "Defender",
            "Defender",
            "Goalkeeper",
            "Defender"
        ],
        [
            "Date of Birth",
            "28/7/48",
            "16/11/48",
            "20/2/44",
            "6/12/45",
            "19/3/43",
            "28/10/46",
            "11/8/47",
            "25/11/40",
            "14/6/43",
            "16/9/51",
            "16/9/51",
            "24/3/49",
            "15/9/51",
            "25/4/47",
            "3/7/47",
            "25/11/51",
            "18/1/52",
            "15/12/46",
            "27/5/44",
            "16/1/45",
            "28/5/46",
            "4/9/46"
        ],
        [
            "Caps",
            "3",
            "10",
            "29",
            "4",
            "44",
            "25",
            "8",
            "2",
            "33",
            "5",
            "1",
            "20",
            "17",
            "28",
            "13",
            "5",
            "1",
            "5",
            "8",
            "27",
            "4",
            "0"
        ],
        [
            "Club",
            "Brugge",
            "Ajax",
            "Feyenoord",
            "Twente",
            "Feyenoord",
            "Feyenoord",
            "Feyenoord",
            "F.C. Amsterdam",
            "Ajax",
            "PSVEindhoven",
            "PSVEindhoven",
            "Ajax",
            "Ajax",
            "Barcelona",
            "Anderlecht",
            "Ajax",
            "Feyenoord",
            "Twente",
            "PSVEindhoven",
            "Ajax",
            "Feyenoord",
            "Feyenoord"
        ]
    ],
    "pageTitle": "Holland 1974 World Cup Squad",
    "title": "",
    "url": "http://easyweb.easynet.co.uk/~goldkeep/Holland74/Squad.htm",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042981856.5/warc/CC-MAIN-20150728002301-00245-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 81661200,
    "recordOffset": 81652998,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{36766=Back to top of this page. Forward to Uruguay game. Back to Holland 1974 Home Page., 12832=  In goal, PSV Eindhoven's Jan van Beveren was not fit enough to make the squad (he was, it's said, no favourite of Cruyff and Michels, and may not have been picked anyway), and Twente's Piet Schrijvers was also surprisingly overlooked, as Michels gave the start to Jan Jongbloed, a 34-year-old who had won a Dutch League medal with DWS Amsterdam as long as eleven years ago, and had genuinely believed he was going to Germany as third choice (it's said he packed his fishing gear), but who, given the fragility of the back four, was to find his interventionist methods exactly what was needed. Playing more or less as an extra sweeper, his forays off his line were to be better remembered than his efforts at stopping shots. Nevertheless, Holland's defensive record in the competition means he must have been doing something right. He was still playing top flight football in Holland eleven years later.   As mentioned, De Jong and Israël were both to find themselves called upon to make a string of appearances as substitute. However, other than these two, one token outing for Keizer and a substitute appearance by René van de Kerkhof, the team was to stay unchanged throughout the tournament., 7349=  Coach Rinus Michels's task was to strike a balance between the Ajax and Feyenoord factions, further complicated by (it's alleged) professional tension between the Ajax contingent and the former Ajax player Johan Cruyff and soon-to-be-former Ajax player Johan Neeskens.   Clearly, the team had to be built around the astonishingly talented Cruyff, nominally centre-forward but in practice given licence to roam at will, dropping into midfield or wandering out to the left wing or wherever he could find a gap to exploit. Johnny Rep, a relative newcomer to the Ajax team, was widely predicted to play up front as well, but the third member of the attack was, rather surprisingly, Rob Rensenbrink of Anderlecht rather than Ajax's Piet Keizer. Rensenbrink had been capped as long ago as 1968, as a young DWS player, but had been overlooked at international level for some years since his move to Belgium. He tended to operate on the left, and was a hard working front player, a target man if you prefer, a striker who enabled play to be built around him, while Rep, generally to be found on the right, was a deadly finisher., 33109=  The captain of the side was to be Cruyff - an obvious choice, you might think, but in fact he had only been given the job back in 1971 after Israël had lost it (due to some comment he made out of turn, apparently). Van Hanegem had briefly taken over, but had quickly been removed from the post due to events at his club, and Keizer had subsequently turned the job down! Cruyff himself had not replaced Keizer as captain of Ajax until the 1972-73 season, and, as mentioned elsewhere, had been deposed a year later. He was still however, first choice in that role for his country. A particularly illustrative story about Cruyff concerns the tale that he wouldn't wear the famous three Adidas stripes on his sleeve, and insisted on wearing a shirt, and even shorts, with just two stripes. This was an era in which kit manufacturers were just beginning to acquire something akin to the influence on the game which they enjoy today, and it would be nice to think Cruyff was striking a blow for traditionalists against the burgeoning corporate takeover of the game, but in reality it was surely more to do with his having a lucrative contract of his own with Puma. Nothing was ever easy with this bunch of players - they'd been arguing about bonuses, and threatening strike action, three days before the tournament kicked off!}",
    "lastModified": "Tue, 29 Aug 2006 12:55:29 GMT",
    "textBeforeTable": "  In goal, PSV Eindhoven's Jan van Beveren was not fit enough to make the squad (he was, it's said, no favourite of Cruyff and Michels, and may not have been picked anyway), and Twente's Piet Schrijvers was also surprisingly overlooked, as Michels gave the start to Jan Jongbloed, a 34-year-old who had won a Dutch League medal with DWS Amsterdam as long as eleven years ago, and had genuinely believed he was going to Germany as third choice (it's said he packed his fishing gear), but who, given the fragility of the back four, was to find his interventionist methods exactly what was needed. Playing more or less as an extra sweeper, his forays off his line were to be better remembered than his efforts at stopping shots. Nevertheless, Holland's defensive record in the competition means he must have been doing something right. He was still playing top flight football in Holland eleven years later.   As mentioned, De Jong and Israël were both to find themselves called upon to make a string of appearances as substitute. However, other than these two, one token outing for Keizer and a substitute appearance by René van de Kerkhof, the team was to stay unchanged throughout the tournament.",
    "textAfterTable": "  In another example of just how out there this Dutch team was, the players were numbered in alphabetic order. The exception was of course Cruyff, who, in the absence of Van Beveren, would have had number 1 under this system. He was allowed to wear the number 14 which he had made his own at Ajax - and, to his chagrin, hadn't been allowed to keep at Barcelona, Spanish authorities being a bit keener on tradition. The number 1 shirt ended up being allocated to reserve striker Ruud Geels.   The captain of the side was to be Cruyff - an obvious choice, you might think, but in fact he had only been given the job back in 1971 after Israël had lost it (due to some comment he made out of turn, apparently). Van Hanegem had briefly taken over, but had quickly been removed from the post due to events at his club, and Keizer had subsequently turned the job down! Cruyff himself had not replaced Keizer as captain of Ajax until the 1972-73 season, and, as mentioned elsewhere, had been deposed",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}