{
    "relation": [
        [
            "Categories",
            "Campus Safety",
            "Bang for the buck",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "With a dedicated security force and small campus size, you can't get much safer than Trine",
            "The downside of this university is that it is very expensive.",
            "Aside from hanging out with friends, there are plenty of things to do. There is a large golf course that is good for a walk in the summer, and sledding in the winter. there are plenty of wacky wednesday activities going on every week. and free movies every monday from a local theater.",
            "There are 3 main dining areas around the campus. Whitney Commons is the main one, it has you swipe a card to pay for a meal, then it is an all you can eat affair, where you can choose from a variety of food that changes every mealtime. Second, you have Centennial Station, this is a place where you can pick up a quick meal in between classes. and finally there is The Depot, a burger bistro in the middle of campus, they make their burgers fresh, but also serve chicken tenders after 7 pm.",
            "There are three choices for rooms. You have apartment suite style, which has you living in a room with 3 or 5 other people of similar majors along with enclosed bathrooms and a common area. There is also traditional dorms,which has you living with a roommate in a hallway with several other pairs sharing the building. and finally there is the Villas, they are only available to upperclassmen with 3.5 GPA or above, but it is a house with private rooms and a kitchen. Each of these living arrangements have RA's and RD's who are instructed to be approachable and have plenty of optional social activities.",
            "The classes are difficult, the professors will challenge you. They want you to learn, and you will, your grades will suffer at first, but hard work and perseverance will pay off well for you.",
            "There are a few places to eat, though most people go to Whitney Commons, you may get caught in a long line if you try to get in right after class. Also, if you are struggling, go into one of the academic lounges in the class buildings, it is more than likely that there will be someone there who will be happy to help.",
            "Trine is a small, close knit university. The professors are approchable and care about their students, and you can always find a time to talk to them. Campus life is lively and has plenty of stuff to do during a study break."
        ]
    ],
    "pageTitle": "Trine University Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Trine-University/reviews?_escaped_fragment_=/show/40822",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042982745.46/warc/CC-MAIN-20150728002302-00334-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 901459279,
    "recordOffset": 901423460,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{1558=Tuition at any college isn't going to be cheap. Though being a Private school some prospective students are turned away from it with the fear of tuition cost. This should not be the case. Trine is affordable. In 2010, 98% of students received $19 million in aid in the form of grants and scholarships. $19 million in financial aid is a huge factor in making Trine worth coming to., 137307=© 2015, Cappex.com, LLC}",
    "textBeforeTable": "02/24/2011 Reviewer is A current student here. 10 out of 10 people found this review useful. 1 of 30 Danielle Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest();",
    "textAfterTable": "Great for these types of students It is great for anyone considering a path in engineering, Mechanical Engineering specifically. Our metalogical program is one of the best. Tips for prospective students It's a good place to be if you like small towns and not so many people. Trine is a very small college - so everyone knows everyone. It makes for a friendly environment most of the time. Bang for the buck The attention we receive at this college is good, but the chances of landing internships and co-ops here seems to be increased from the larger schools. Not to mention from what I've seen Trine does well at competitions related to engineering. Am enjoying being here There is very little to do in this area, but the college does make events for the students, such as a free movie at the local movie theater every monday, as well as a movie shown on campus every wednesday, and other small events. The Campus tends to line up Commedians and other such acts to keep the students entertained - just not as frequently. Am learning a lot Small class sizes means that you get attention",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}