{
    "relation": [
        [
            "Month",
            "Jan",
            "Feb",
            "Mar",
            "Apr",
            "May",
            "Jun",
            "Jul",
            "Aug",
            "Sep",
            "Oct",
            "Nov",
            "Dec"
        ],
        [
            "Climate",
            "Very Cold",
            "Moderately Cold",
            "Moderately Hot",
            "Very Hot",
            "Very Hot",
            "Very Hot",
            "Rainy",
            "Rainy",
            "Pleasant",
            "Pleasant",
            "Moderately Cold",
            "Moderately Cold"
        ],
        [
            "Details",
            "Bhopal experiences cold climate during January. This month is often accompanied by fogs. Days are quite pleasing with decent amount of sunshine making it perfect for sightseeing activities. It is one of the best months for visiting Bhopal. You may require light warm garments for this season.",
            "The place offer mild cold weather, with sufficient amount of sunshine making the days suitable for enjoyable outings. It is an ideal time for sighting attractions of the place as well as enjoying other tourist activities.",
            "Temperature begins to rise as March enters but remains within the comfort hot zone. Days are accompanied by a plenty of sunshine and clear skies. The moderate hot climate during this month favors or enables to carry out tourist activities.",
            "Peak summer month with very hot weather. Days are sunny and dry. Travelling during this month is not encouraged as the climate is too uncomfortable for tourist activities.",
            "Climate remains extremely hot and dry in May. It is also the hottest month of the year. Sunstroke is a common occurrence. It is better to avoid visiting during hot season.",
            "The weather remains hot but monsoon sets in late June giving a relief from the hot summer. However, temperatures are still not suitable for carrying out any tourist activity. It is better to kept off tourist visits during this month.",
            "July is recorded with maximum rainfall. Temperature reduces to a certain level and the weather becomes quite comfortable but humidity level increases. This month is not considered as an ideal time for tourist visits in Bhopal.",
            "Rainfall continues to pour down in August making it the second wettest month of the year. Temperatures are pleasant but the level of humidity is very high. Sometimes, the month is accompanied by thunderstorms and floods are quite common during rainy season. Not the best time but if you enjoy rains, then you can visit the place.",
            "Frequent rainfalls occur in this month. The weather becomes quite pleasing but the level of humidity remains high. It may be a suitable time for tourist activities in Bhopal.",
            "The climate becomes pleasant, but the place receives intermittent rainfalls. The official tourist season starts from this month. It is an ideal time to plan for a visit and to enjoy what the city has to offer.",
            "November offers mild cold weather. Days are pleasant with beautiful sunshine making it perfect for enjoying sightseeing and other outdoor activities. It is one of the best months to visit Bhopal.",
            "The month has mild cold weather. Days are pleasing while nights can be a bit cold. It is an ideal month to enjoy sighting various attractions of the place. Light warm clothes are recommended for this period."
        ]
    ],
    "pageTitle": "BHOPAL Weather, Temperature, Best Season, Bhopal Weather Forecast, Climate",
    "title": "",
    "url": "http://www.mustseeindia.com/Bhopal-weather",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042982745.46/warc/CC-MAIN-20150728002302-00312-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 597921807,
    "recordOffset": 597890605,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Bhopal Weather Home  ›  Destinations  ›  Madhya Pradesh  ›  Bhopal  ›  Weather   var addthis_config = {services_compact: 'facebook,print,twitter,email,google,gmail,pinterest,blogger,stumbleupon,favorites,tumblr,more'}; register_onload(function(){hide_zedo_image()}); googletag.cmd.push(function() { googletag.display('div-gpt-ad-1325834386456-188'); }); }); googletag.enableServices(); googletag.defineSlot('/1008434/season-header-1-banner', [728, 90], 'div-gpt-ad-1325834386456-188').setTargeting('NetworkId', 'season').addService(googletag.pubads()); googletag.cmd.push(function() { add_comscore(); } el.parentNode.insertBefore(s, el); s.src = (document.location.protocol == \"https:\" ? \"https://sb\" :\"http://b\") + \".scorecardresearch.com/beacon.js\"; s.async = true; el = document.getElementsByTagName(\"script\")[0]; var s = document.createElement(\"script\"); function add_comscore(){ _comscore.push({ c1: \"2\", c2: \"15366170\" }); var _comscore = _comscore || [];  ",
    "textAfterTable": "View all photos Best Season: Oct - Mar Summer 23 to 47Â°C, Winter 6 to 26Â°C Best Season / Best time to visit Bhopal Bhopal has soaring summers and cooling winters. The best time to visit the place is from October to March. Winters (December to February) are pretty cold with minimum goes down to chilly 6Â°C. Light rains falls are noted during winter and the weather in winter remain misty and humid. Summers (March to May) are hot with temperature soaring to as high as 47Â°C and are typically above 24Â°C. Travelers typically keep off from outings during April and May. Monsoons (June to September) offer moderate rains due to southwest monsoon. Monsoons are not the ideal time to visit due to the humidity, but during this time, the natural beauty is at its prime. April and May are extremely hot and travel may be avoided. December to February is cool and pleasant and ideal for outings and sight-seeing. Note that heavy fog formation is observed during the winter season, especially during January month. June to September is good for tourists who like cool showers.",
    "hasKeyColumn": true,
    "keyColumnIndex": 1,
    "headerRowIndex": 0
}