{
    "relation": [
        [
            "Arms",
            "",
            ""
        ],
        [
            "Name",
            "Edward of Windsor, Prince of Wales (later King Edward III)",
            "John of Eltham, Earl of Cornwall"
        ],
        [
            "Life",
            "1312-1377",
            "1316-1336"
        ],
        [
            "Blazon",
            "Gules, three lions passant guardant Or, with a label of three points Azure[25]",
            "Gules, three lions passant guardant Or, within a bordure of France[24]"
        ],
        [
            "Notes",
            "Son of: King Edward II and Queen Isabella.",
            "Son of: King Edward II and Queen Isabella."
        ]
    ],
    "pageTitle": "List of coats of arms of the House of Plantagenet - Wikipedia, the free encyclopedia",
    "title": "",
    "url": "https://en.wikipedia.org/wiki/List_of_coats_of_arms_of_the_House_of_Plantagenet",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042982745.46/warc/CC-MAIN-20150728002302-00297-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 870479335,
    "recordOffset": 870431697,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{93047=Married to: King Edward I; 1299-1307, 59843=Married to: Empress Matilda; 1128-1151., 278734=Married to: Sir Henry Stafford; 1462-1471., 264414=Died at age 10 in 1484, Edward Plantagenet, Earl of Warwick nominated heir in his place., 239259=Declared king in 1461, usurping the crown from the weak King Henry VI., 203428=Later married to: Owen Tudor; 1428?-1437, progenitor of the House of Tudor., 255393=Executed in 1541 at the orders of King Henry VIII for treason., 101841=Married to: Edmund of Woodstock, Earl of Kent; 1325, 272239=Married to: John Beaufort, Earl of Somerset; 1399-1410, 121970=Married to: King Edward III; 1329-1369., 75581=Married to: King John; 1200-1216., 247985=Imprisoned in 1540 at the orders of King Henry VIII for treason. Died two days after receiving the news he was to be released., 243371=Married to: King Henry VII; 1486-1503., 280358=Half brother to King Henry VI, legitimated by Parliament in 1453., 221413=Executed in 1415 at the orders of King Henry V, for Treason., 205428=Throne usurped by Edward, Earl of March, who became King Edward IV in 1461., 241458=Married to: King Edward IV; 1464-1483., 103636=Married to: Edward of Woodstock, Prince of Wales; 1361-1376., 91566=Married to: King Edward I; 1254-1290, 228662=Defeated and killed at the Battle of Wakefield in 1460., 119344=In 1340, Edward III claimed the throne of France as an inheritance from his mother, Isabella, daughter of King Philip IV of France, and adopted new arms, Quarterly France and England.[1] Such arms are termed \"Arms of Pretension\", where a sovereign adopts arms illustrative of a claim de jure (by right) to the throne of another kingdom.[27], 255123=Married to: Sir Richard Pole; 1487-1505?., 132850=Married to: King Richard II; 1382-1394., 134221=Married to: King Richard II; 1396-1400., 151979=Married to: John of Gaunt, Duke of Lancaster; 1359-1369., 193351=Married to: King Henry IV; 1399-1413., 257175=Executed in 1499 at the orders of King Henry VII for treason., 262264=Married to: Edward of Westminster, Prince of Wales; 1470-1471., 81055=Married to: King Henry III; 1236-1272., 275541=Married to: Lionel de Welles, Baron Welles; 1447-1461., 112955=Married to: King of Edward II; 1308-1327, 138270=Married to: Lionel of Antwerp, Duke of Clarence; 1352-1363., 283069=Defeats King Richard III at the Battle of Bosworth Field in 1485, claims the throne as King Henry VII., 275416=Married to: Sir Oliver St John, of Bletsoe; 1425-1437., 278668=Married to: Edmund Tudor, 1st Earl of Richmond; 1455-1456., 257124=Nominated heir of King Richard III in 1484., 153531=Married to: John of Gaunt, Duke of Lancaster; 1371-1394., 103483=Married to: Thomas Holland, Earl of Kent; 1340-1360, 241347=Married to: Sir John Grey; 1452-1461., 207284=Married to: King Henry VI; 1445-1471., 144857=Married to: Roger Mortimer, Earl of March; 1388-1398., 154756=Married to: John of Gaunt, Duke of Lancaster; 1396-1399., 278784=Married to: Thomas Stanley, Earl of Derby; 1472-1504., 98770=Married to: Thomas of Brotherton, Earl of Norfolk; (1316?-1320?)-1326, 160551=Married to: Edmund of Langley, Duke of York; 1393-1402., 203384=Married to: King Henry V; 1420-1422., 63305=Married to: King Henry II; 1152-1189., 140539=Married to: Edmund Mortimer, Earl of March; 1368-1381., 272301=Married to: Thomas of Lancaster, Duke of Clarence; 1411-1421, 146679=Married to: Richard of Conisburgh, Earl of Cambridge; 1408-1411., 158929=Married to: Edmund of Langley, Duke of York; 1372-1392., 191808=Married to: Henry Bolingbroke (later King Henry IV); 1380-1394., 189506=In 1376, the kings of France altered the royal coat of arms, replacing the field semée fleurs de lys with three fleurs de lys, alluding to the Trinity. This new design is referred to as France Moderne, the previous one being France Ancien. From about 1400 the kings of England imitated this change. As modified, the monarchs of England continued to bear arms in this form until the crown union with Scotland in 1603.[1], 164583=Married to: Thomas of Woodstock, Duke of Gloucester; 1374-1397., 259555=Defeated and killed at the Battle of Bosworth Field in 1485, fighting against Henry Tudor, later King Henry VII., 223242=Married to: Richard of Conisburgh, Earl of Cambridge; 1408-1411., 262334=Married to: King Richard III; 1472-1485., 250712=Executed in 1478 at the orders of King Edward IV (his own brother), for having designs on the throne., 230411=Married to: Richard of York, Duke of York; 1429-1460., 275478=Married to: John Beaufort, Duke of Somerset; 1439-1444., 209210=Killed at the Battle of Tewkesbury 1471., 69980=Married to: King Richard I; 1191-1199., 252497=Married to: George Plantagenet, Duke of Clarence; 1469-1476.}",
    "lastModified": "Sat, 25 Jul 2015 10:24:18 GMT",
    "textBeforeTable": "Descendants of Geoffrey Plantagenet, Count of Anjou[edit]   Collaterals   Illegitimate descent   Consorts   Maternal descent   Paternal descent   Monarchs Colour key (Line of descent) House of Plantagenet[edit] Jasper Tudor, Duke of Bedford Edmund Tudor, 1st Earl of Richmond",
    "textAfterTable": "King Henry II 1133-1189 Gules, a lion rampant contourné Son of: Geoffrey of Anjou and Empress Matilda. In French blazoning, the lion rampant contourné was often termed a léopard. However, this usage was never widespread in England, and is long obsolete.[3] Queen Eleanor 1124?-1204 Gules, a lion passant guardant in pale Or[4] Daughter of: William X, Duke of Aquitaine, Duke of Aquitaine and Aenor de Châtellerault. Married to: King Henry II; 1152-1189. Arms Name Life Blazon Notes",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}