{
    "relation": [
        [
            "Language:",
            "Company:",
            "",
            "",
            "Phone:",
            "Fax:",
            "E-mail:",
            "Internet:",
            "ISIN:",
            "WKN:",
            "Listed:"
        ],
        [
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            ""
        ],
        [
            "English",
            "Hannover Rückversicherung AG",
            "Karl-Wiechert-Allee 50 30625",
            "Hannover Germany",
            "+49-(0)511-5604-1500",
            "+49-(0)511-5604-1648",
            "info@hannover-re.com",
            "www.hannover-re.com",
            "DE0008402215",
            "840 221",
            "Regulierter Markt in Frankfurt (Prime Standard), Hannover; Freiverkehr in Berlin, Düsseldorf, Hamburg, München, Stuttgart; Terminbörse EUREX"
        ]
    ],
    "pageTitle": "Hannover Rueckversicherung AG : Hannover Re Estimates Burden of Losses for Wrecked Costa Concordia | 4-Traders",
    "title": "",
    "url": "http://www.4-traders.com/HANNOVER-RUECKVERSICHERUN-444737/news/Hannover-Rueckversicherung-AG--Hannover-Re-Estimates-Burden-of-Losses-for-Wrecked-Costa-Concordia-13980418/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042982745.46/warc/CC-MAIN-20150728002302-00057-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 277765467,
    "recordOffset": 277744296,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{75442=Hannover Rückversicherung AG Corporate Communications: Karl Steinle tel. +49 511 5604-1500 e-mail: karl.steinle@hannover-re.com or Media Relations: Gabriele Handrick tel. +49 511 5604-1502 e-mail: gabriele.handrick@hannover-re.com or Investor Relations: Klaus Paesler tel. +49 511 5604-1736 e-mail: klaus.paesler@hannover-re.com, 69677=As already reported by Hannover Re on 16 January, the incident involving the Costa Concordia cruise ship will result in a major loss for the company. The loss expenditure from marine hull insurance will be in the region of EUR 30 million for the company's net account. Liability claims are difficult to assess at this point in time. The assumption is that a market loss running into triple-digit millions of euros could result. The total loss for Hannover Re - as a leading marine reinsurer - could therefore be in the mid-double-digit million euro range.}",
    "textBeforeTable": "Please note the disclaimer: www.hannover-re.com/misc/disclaimer-pr-050811 Hannover Re, with a gross premium of around EUR 11 billion, is the third-largest reinsurer in the world. It transacts all lines of non-life and life and health reinsurance and is present on all continents with around 2,200 staff. The rating agencies most relevant to the insurance industry have awarded Hannover Re very strong insurer financial strength ratings (Standard & Poor's AA- 'Very Strong' and A.M. Best A 'Excellent'). Please visit: www.hannover-re.com As already reported by Hannover Re on 16 January, the incident involving the Costa Concordia cruise ship will result in a major loss for the company. The loss expenditure from marine hull insurance will be in the region of EUR 30 million for the company's net account. Liability claims are difficult to assess at this point in time. The assumption is that a market loss running into triple-digit millions of euros could result. The total loss for Hannover Re - as a leading marine reinsurer - could therefore be in the mid-double-digit million euro range. *Required fields Message : (You can enter multiple email addresses separated by commas) To* :",
    "textAfterTable": "Hannover Rückversicherung AG Corporate Communications: Karl Steinle tel. +49 511 5604-1500 e-mail: karl.steinle@hannover-re.com or Media Relations: Gabriele Handrick tel. +49 511 5604-1502 e-mail: gabriele.handrick@hannover-re.com or Investor Relations: Klaus Paesler tel. +49 511 5604-1736 e-mail: klaus.paesler@hannover-re.com © Business Wire 2012",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}