{
    "relation": [
        [
            "Payment method",
            "",
            "Postal order/Banker's draft",
            "Personal cheque",
            "Bank transfer"
        ],
        [
            "Preferred/Accepted",
            "PayPal preferred",
            "Accepted",
            "Accepted",
            "Accepted"
        ],
        [
            "",
            "",
            "",
            "",
            ""
        ]
    ],
    "pageTitle": "2003 OUTER LIMITS: SEX, CYBORGS & SCIENCE FICTION 9 CARD FOIL CHASE SET | eBay",
    "title": "",
    "url": "http://www.ebay.co.uk/itm/2003-OUTER-LIMITS-SEX-CYBORGS-SCIENCE-FICTION-9-CARD-FOIL-CHASE-SET-/310702282382?pt=AU_CollectableTradingCards&hash=item48574c968e",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042982745.46/warc/CC-MAIN-20150728002302-00201-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 431107455,
    "recordOffset": 431064418,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Payment details Most purchases from business sellers are protected by the Consumer Contract Regulations 2013 which give you the right to cancel the purchase within 14 days after the day you receive the item. Find out more about your rights as a buyer - opens in a new window or tab and exceptions - opens in a new window or tab. I make every effort to describe items as accurately as possible and the scan forms part of the description. Items are packaged as securely as possible against damage. No responsibility accepted for items lost or damaged in transit. Return policy details The buyer is responsible for return postage costs. Money back 7 days Refund will be given as After receiving the item, cancel the purchase within Returns policy",
    "textAfterTable": "Seller's payment instructions Direct Deposit preferred from Australian buyers but will also accept personal cheques, money orders or Paypal. International buyers Paypal ONLY. If purchasing multiple items please wait for my invoice with combined postage. Current bid amount + + import charges (shown at checkout) time left ##2## left | Bid count",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}