{
    "relation": [
        [
            "Citing Patent",
            "US6473085 *",
            "US6542152 *",
            "US6593928 *",
            "US6677941 *",
            "US6731296 *",
            "US6826314 *",
            "US6900800 *",
            "US6943802 *",
            "US6954776 *",
            "US6992678",
            "US7116333 *",
            "US7212220 *",
            "US7224369",
            "US7372461 *",
            "US7554538 *",
            "US7616211 *",
            "US7868891",
            "US8818136 *",
            "US9008464 *",
            "US9058672 *",
            "US20010043759 *",
            "US20020070946 *",
            "US20020130863 *",
            "US20020135576 *",
            "US20040150637 *",
            "US20040179020 *",
            "US20100316286 *",
            "US20110081100 *",
            "US20130322780 *",
            "CN100533485C",
            "EP1570339A1 *"
        ],
        [
            "Filing date",
            "Dec 17, 1999",
            "Jan 19, 2001",
            "Feb 16, 2000",
            "Aug 6, 2001",
            "May 7, 1999",
            "Jan 17, 2001",
            "Feb 27, 2002",
            "Dec 13, 2002",
            "May 7, 2001",
            "Mar 16, 2005",
            "May 12, 2000",
            "Jun 16, 2003",
            "Mar 16, 2005",
            "Apr 21, 2003",
            "Apr 2, 2004",
            "Dec 13, 2005",
            "Sep 16, 2005",
            "Mar 18, 2011",
            "Jun 16, 2009",
            "Oct 5, 2010",
            "Jan 17, 2001",
            "May 7, 1999",
            "Feb 27, 2002",
            "Jan 19, 2001",
            "Nov 20, 2003",
            "Mar 24, 2004",
            "Jun 16, 2009",
            "",
            "Mar 18, 2011",
            "Jan 17, 2007",
            "Dec 6, 2003"
        ],
        [
            "Publication date",
            "Oct 29, 2002",
            "Apr 1, 2003",
            "Jul 15, 2003",
            "Jan 13, 2004",
            "May 4, 2004",
            "Nov 30, 2004",
            "May 31, 2005",
            "Sep 13, 2005",
            "Oct 11, 2005",
            "Jan 31, 2006",
            "Oct 3, 2006",
            "May 1, 2007",
            "May 29, 2007",
            "May 13, 2008",
            "Jun 30, 2009",
            "Nov 10, 2009",
            "Jan 11, 2011",
            "Aug 26, 2014",
            "Apr 14, 2015",
            "Jun 16, 2015",
            "Nov 22, 2001",
            "Jun 13, 2002",
            "Sep 19, 2002",
            "Sep 26, 2002",
            "Aug 5, 2004",
            "Sep 16, 2004",
            "Dec 16, 2010",
            "Apr 7, 2011",
            "Dec 5, 2013",
            "Aug 26, 2009",
            "Sep 7, 2005"
        ],
        [
            "Applicant",
            "International Business Machines Corporation",
            "Silicon Integrated Systems Corp.",
            "Silicon Motion, Inc.",
            "American Gnc Corporation",
            "Broadcom Corporation",
            "Fujitsu Limited",
            "David Robert Baldwin",
            "Sony Corporation",
            "Oracle International Corporation",
            "Sony Corporation",
            "Microsoft Corporation",
            "Silicon Motion, Inc.",
            "Sony Corporation",
            "Sony Corporation",
            "Nvidia Corporation",
            "Sony Computer Entertainment Inc.",
            "Nvidia Corporation",
            "Montage Technology (Shanghai) Co., Ltd.",
            "University-Industry Cooperation Group Of Kyung Hee University",
            "Nvidia Corporation",
            "Toru Eguchi",
            "Michael C. Lewis",
            "3Dlabs Inc., Ltd.",
            "Chung-Yen Lu",
            "Samsung Electronics Co., Ltd.",
            "Lewis Michael C.",
            "University-Industry Cooperation Group Of Kyung Hee University",
            "John Erik Lindholm",
            "Xiaodong Huang",
            "威盛电子股份有限公司",
            "Samsung Electronics Co., Ltd."
        ],
        [
            "Title",
            "System for dynamically adjusting image quality for interactive graphics applications",
            "Method and apparatus for culling",
            "Auto screen centering and expansion of VGA display modes on larger size of LCD display device",
            "Three-dimensional relative positioning and tracking using LDRI",
            "Method and system for providing programmable texture processing",
            "Image size transforming apparatus, method and record medium storing image size transform program therein",
            "Tile relative origin for plane equations",
            "Image processing apparatus and method of same",
            "Enabling intra-partition parallelism for partition-based operations",
            "Image processing apparatus and method of same",
            "Data retrieval method and system",
            "Auto screen centering and expansion of VGA display modes on larger size of LCD display device",
            "Image processing apparatus and method of same",
            "Image processing apparatus and method of same",
            "Video processing, such as for hidden surface reduction or removal",
            "Rendering processor, rasterizer and rendering method",
            "Load balancing",
            "Image interpolation method based on matrix and image processing system",
            "Media data customization",
            "Using a pixel offset for evaluating a plane equation",
            "Image size transforming apparatus, method and record medium storing image size transform program therein",
            "Method and system for providing programmable texture processing",
            "Tile relative origin for plane equations",
            "Method and apparatus for culling",
            "Method and apparatus for displaying markup document linked to applet",
            "Method and system for providing programmable texture processing",
            "Media data customization",
            "Using a pixel offset for evaluating a plane equation",
            "Image Interpolation Method Based On Matrix and Image Processing System",
            "Image describing method",
            "Method and apparatus for displaying markup document linked to applet"
        ]
    ],
    "pageTitle": "Patent US6377265 - Digital differential analyzer - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US6377265?dq=6,704,032",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042981856.5/warc/CC-MAIN-20150728002301-00198-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 466078687,
    "recordOffset": 466033540,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{50797=For simplicity, FIG. 2A shows an embodiment of a graphics subsystem that includes only one processor (e.g., color shading processor 214). Generally, each processor includes at least one digital differential analyzer (DDA) that performs the bulk of the mathematical computations required to render a primitive. Graphics subsystems typically include a number of processors, and the processors can be arranged in various configurations. An example of a more complex graphics subsystem is described in the aforementioned U.S. Pat. No. 5,594,854. Another graphics subsystem is described in the attached Exhibit A. A class of graphics processors, referred to as the GLINT processors, is described by Baldwin D. et al. in “GLINT 300SX Programmer's Reference Manual”, 3Dlabs Inc., 1993 and 1994, which is incorporated herein by reference. These various embodiments of graphics subsystems are within the scope of the invention., 35515=To display the graphical objects, the high-level description is transformed into a low-level description suitable for display on, for example, a CRT. This transformation process is generally referred to as “rendering.” The rendering process typically includes the decomposition of a high-level entity (or a graphical object) into a set of graphical primitives (e.g., lines and triangles) for further processing. Each primitive is decomposed into a series of fragments, with each fragment being a part of a primitive. Each fragment is further decomposed into a set of picture elements (or pixels) that can be displayed on the CRT. A fragment may, however, cover only part of a pixel. A more detailed description of the rendering process is provided in U.S. Pat. No. 5,594,854 entitled “GRAPHICS SUBSYSTEM WITH COARSE SUBPIXEL CORRECTION”, issued Jan. 14, 1997 (hereinafter, the '854 patent), and incorporated herein by reference. The rendering process is also described below.}",
    "textBeforeTable": "Patent Citations The foregoing description of specific embodiments is provided to enable any person skilled in the art to make or use the present invention. The various modifications to these embodiments will be readily apparent to those skilled in the art, and the generic principles defined herein may be applied to other embodiments without the use of the inventive faculty. For example, the DDA of the invention can be implemented within an integrated circuit. The integrated circuit can be incorporated within a circuit card that is then installed on a computer. Thus, the present invention is not intended to be limited to the embodiments shown herein but is to be accorded the widest scope consistent with the principles and novel features disclosed herein, and as defined by the following claims. Conclusion These various patents are incorporated herein by reference. 6. Printing mechanism of the pattern generation apparatus, such as that described in U.S. Pat. No. 5,533,170 issued to Teitzer, et al. 5. Accelerates and decelerates a stepping motor, such as that described in U.S. Pat. No. 3,805,138 issued to Hilker. 4. A spiral sweep generator for a rectangular Cartesian coordinate PPI display in a sonar system, such as that described in U.S. Pat. No. 3,751,712 issued to Murray. 3. A digital signal processor optimized for synthetic aperture radar (SAR) image formation, such as that described in U.S. Pat. No. 5,329,283 issued to Smith. 2. Numerical control of machine",
    "textAfterTable": "US6900800 * Feb 27, 2002 May 31, 2005 David Robert Baldwin Tile relative origin for plane equations US6943802 * Dec 13, 2002 Sep 13, 2005 Sony Corporation Image processing apparatus and method of same US6954776 * May 7, 2001 Oct 11, 2005 Oracle International Corporation Enabling intra-partition parallelism for partition-based operations US6992678 Mar 16, 2005 Jan 31, 2006 Sony Corporation Image processing apparatus and method of same US7116333 * May 12, 2000 Oct 3, 2006 Microsoft Corporation Data retrieval method and system US7212220 * Jun 16, 2003 May 1, 2007 Silicon Motion, Inc. Auto screen centering and expansion of VGA display modes on larger size of LCD display device US7224369 Mar 16, 2005 May 29, 2007 Sony Corporation Image processing apparatus and method of same US7372461 * Apr",
    "hasKeyColumn": true,
    "keyColumnIndex": 3,
    "headerRowIndex": 0
}