{
    "relation": [
        [
            "",
            "Pazopanib 800 mg",
            "Sunitinib 50 mg"
        ],
        [
            "Description",
            "Participants were administered pazopanib 800 mg (2 x 400 mg tablets) orally OD continuously. Pazopanib was to be taken at least one hour before or at least two hours after a meal. Participants received study treatment until disease progression, death, unacceptable toxicity, or withdrawal of consent for any other reasons.",
            "Participants were administered sunitinib 50 mg orally once daily in 6-week cycles (4 weeks of treatment, followed by 2 weeks without treatment). Participants received study treatment until disease progression, death, unacceptable toxicity, or withdrawal of consent for any other reasons."
        ]
    ],
    "pageTitle": "Pazopanib Versus Sunitinib in the Treatment of Locally Advanced and/or Metastatic Renal Cell Carcinoma - Study Results - ClinicalTrials.gov",
    "title": "",
    "url": "https://clinicaltrials.gov/ct2/show/results/NCT00720941?sect=Xl015&view=results",
    "hasHeader": true,
    "headerPosition": "MIXED",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042981856.5/warc/CC-MAIN-20150728002301-00275-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 862780263,
    "recordOffset": 862768629,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Reporting Groups Participants were stratified based on Karnofsky Performance Scale scores (70 or 80; 90 or 100), Baseline levels of lactate dehydrogenase (>1.5 versus <=1.5 times the upper limit of normal [ULN]), and previous nephrectomy (yes versus no) and were randomized in a 1:1 ratio to receive either pazopanib or sunitinib. Significant events and approaches for the overall study following participant enrollment, but prior to group assignment Pre-Assignment Details Per protocol amendment, the number of participants (par.) was increased to ~1100 (including all par. enrolled in Studies VEG108844 and VEG113078 [NCT01147822; a substudy in Asian par.]). This summary is a pooled analysis of both studies. 1110 par. were analyzed; 927 from VEG108844 (reflected in the protocol enrollment field), 183 from VEG113078. Key information relevant to the recruitment process for the overall study, such as dates of the recruitment period and locations Recruitment Details   Hide Participant Flow   Participant Flow",
    "textAfterTable": "Participant Flow:   Overall Study     Pazopanib 800 mg     Sunitinib 50 mg   STARTED     557     553   Ongoing     34     23   COMPLETED     144     138   NOT COMPLETED     413     415   Death                 334                 335   Protocol Violation                 0                 2  ",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}