{
    "relation": [
        [
            "Previous name",
            "Edit Delete View CVT Bell Globemedia",
            "Edit Delete View CVT CTVglobemedia"
        ],
        [
            "Start date",
            "2001",
            "2006"
        ],
        [
            "End date",
            "2006",
            "2011"
        ]
    ],
    "pageTitle": "Bell Media - Freebase",
    "title": "",
    "url": "http://www.freebase.com/en/bell_globemedia",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042981856.5/warc/CC-MAIN-20150728002301-00017-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 450623068,
    "recordOffset": 450595562,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{112139=Bell Media is the mass media subsidiary of BCE. Its operations include television broadcasting and production, radio broadcasting, Digital Media, and Internet properties including Sympatico.ca. Bell Media is the successor-in-interest to Baton Broadcasting, one of Canada's first private-sector television broadcasters. The company in its current form was originally established as Bell Globemedia by BCE and the Thomson family in 2001 combining CTV Inc., which Bell had acquired the previous year, and the operations of the Thomsons' The Globe and Mail. Bell sold the majority of its interest in 2006, but re-acquired the entire company, excluding the Globe, in 2011. [ - ]}",
    "lastModified": "Tue, 28 Jul 2015 010:40:15 UTC",
    "textBeforeTable": "Web Link(s) (deprecated) /common/topic/webpage View history Query by property Flag as reviewed Flag as having unknown values Flag as having no values Add new value Bell Media is the mass media subsidiary of BCE (also known as Bell Canada Enterprises, the... Article (deprecated) /common/topic/article View history Query by property Flag as reviewed -",
    "textAfterTable": "Edit Delete Edit localized... Radio station owner Freebase Commons Business /business Employer /business/employer x Add new value Flag as reviewed Query by property View history Employees and other personnel /business/employer/employees Person",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}