{
    "relation": [
        [
            "Patent application number",
            "20130225747",
            "20140357821"
        ],
        [
            "Description",
            "FLUORINE-CONTAINING ANTI-CORROSIVE COATING - A fluorine-containing anti-corrosive coating is prepared by using fluororubber as basic film-forming substance, adding auxiliary agent, reinforcing agent and additive, kneading to obtain fluorine mixed compound, dissolving in organic solvent to obtain component A solution of the mixed compound; and while using it, mixing the component A solution with silane coupling agent as component B at a certain proportion, curing at low temperature and obtaining the fluorine-containing coating.",
            "LOW-TEMPERATURE-RESISTANT FLUORINE-CONTAINING ELASTOMER AND PREPARATION METHOD THEREFOR - The present invention provides a low-temperature-resistant fluorine-containing elastomer formed through polymerization of the comonomers: 40-80 mol % 1,1-vinylidene fluoride, 2-10 mol % tetrafluoroethylene, 10-30 mol % perfluoro(alkyl vinyl ether), and 1-10 mol % vulcanization monomer. The present invention further provides a preparation method of the fluorine-containing elastomer. In the present invention, on basis of a large number of experiments, the contents of the comonomers of the fluorine-containing elastomer are adjusted, so that the low temperature performance thereof is significantly improved, and the low-temperature retraction temperature TR-10<−40. Moreover, the rate of the volume change of the fluorine-containing elastomer in methanol decreases, and the oil resistance and the solvent resistance are improved, thereby improving the oil resistant performance and solvent resistant performance of the fluorine-containing elastomer."
        ],
        [
            "Published",
            "08-29-2013",
            "12-04-2014"
        ]
    ],
    "pageTitle": "Bin Liu - Patent applications",
    "title": "",
    "url": "http://www.faqs.org/patents/inventor/bin-liu-2/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990112.50/warc/CC-MAIN-20150728002310-00316-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 435494875,
    "recordOffset": 435464686,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Bin Liu, Zigong CN 07-18-2013 SYSTEM AND METHOD FOR CALIBRATED SPECTRAL DOMAIN OPTICAL COHERENCE TOMOGRAPHY AND LOW COHERENCE INTERFEROMETRY - Systems and methods for enhancing spectral domain optical coherence tomography (OCT] are provided. In particular, a system and method for calibration of spectral interference signals using an acquired calibration signal are provided. The calibration signal may be logarithmically amplified to further improve the accuracy of the calibration. From the calibration signal, a series of more accurate calibration data are calculated. An acquired spectral interference signal is calibrated using these calibration data. Moreover, systems that include logarithmic amplification of the spectral interference signal and variable band-pass filtering of the spectral interference signal are provided. Such systems increase the dynamic range and visualization capabilities relative to conventional spectral domain OCT systems. 20130182259 Published Description Patent application number Bin Liu, Chestnut Hill, MA US 10-02-2014 MERCURY-FREE LEAD-FREE BUTTON BATTERY - A mercury-free lead-free button battery includes a negative cap, a cathode material, a gasket ring, a positive can, an anode material, and a diaphragm. The positive can and the negative cap are combined. The gasket ring is clamped between the positive can and the negative cap for separating the positive can from the negative cap. The cathode material is arranged on the bottom of the positive can. The diaphragm is arranged on the cathode material. The anode material is arranged between the negative cap and the diaphragm. A",
    "textAfterTable": "Bin Liu, Piscataway, NJ US Patent application number Description Published 20140108314 INTEGRATED APPROACH TO MODEL TIME SERIES DYNAMICS IN COMPLEX PHYSICAL SYSTEMS - A system and method for analysis of complex systems which includes determining model parameters based on time series data, further including profiling a plurality of types of data properties to discover complex data properties and dependencies; classifying the data dependencies into predetermined categories for analysis; and generating a plurality of models based on the discovered properties and dependencies. The system and method may analyze, using a processor, the generated models based on a fitness score determined for each model to generate a status report for each model; integrate the status reports for each model to determine an anomaly score for the generated models; and generate an alarm when the anomaly score exceeds a predefined threshold. 04-17-2014 20140108324 DATA ANALYTIC ENGINE TOWARDS THE SELF-MANAGEMENT OF COMPLEX PHYSICAL SYSTEMS - Systems and method for modeling system dynamics, including extracting features representative of a temporal evolution of a dynamical system, further including deriving one or more vector trajectories by performing sliding window segmentation of one or more time series; applying a linear test to determine whether the one or more vector trajectories are linear or nonlinear; and performing linear or nonlinear subspace decomposition on the vector trajectory based on the linear test. The system and method may generate a system evolution model from the extracted features of the",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}