{
    "relation": [
        [
            "type",
            "FR Doc.",
            "RIN",
            "Public Notice:"
        ],
        [
            "regulations.gov",
            "2014-26631",
            "1400-AD33",
            "8942"
        ]
    ],
    "pageTitle": "22 CFR Part 121 - THE UNITED STATES MUNITIONS LIST | US Law | LII / Legal Information Institute",
    "title": "",
    "url": "https://www.law.cornell.edu/cfr/text/22/part-121",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042982745.46/warc/CC-MAIN-20150728002302-00145-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 894030919,
    "recordOffset": 894014196,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{1020=Title 22 published on 2014-04-01.}",
    "TableContextTimeStampAfterTable": "{32931=112 Stat. 1920, 11631=On May 24, 2013, the Department of State published a rule (78 FR 31444) proposing to amend the International Traffic in Arms Regulations (ITAR) by revising Category XV of the U.S Munitions List (USML) as part of the President's Export Control Reform (ECR) effort. After review of comments to the proposed rule, on May 13, 2014, the Department published an interim final rule that allowed a final comment period until June 27, 2014. The Department is now making final the interim final rule and correcting the interim final rule that appeared in the Federal Register of May 13, 2014., 33996=Title 22 published on 2014-04-01, 32588=§ 2797 - Licensing, 16262=In an effort to streamline, simplify and clarify the recent revisions to the International Traffic in Arms Regulations (ITAR) made pursuant to the President's Export Control Reform (ECR) initiative, the Department of State is amending the ITAR as part of the Department of State's retrospective plan under Executive Order 13563 completed on August 17, 2011., 32482=§ 2778 - Control of arms exports and imports, 32379=§ 2752 - Coordination with foreign policy, 42369=As part of the President's Export Control Reform effort, the Department of State proposes to amend the International Traffic in Arms Regulations (ITAR) to revise Categories XIV (toxicological agents, including chemical agents, biological agents, and associated equipment) and XVIII (directed energy weapons) of the U.S. Munitions List (USML) to describe more precisely the articles warranting control on the USML. The revisions contained in this rule are part of the Department of State's retrospective plan under E.O. 13563 completed on August 17, 2011. The Department of State's full plan can be accessed at http://www.state.gov/documents/organization/181028.pdf., 25371=The Department of State is correcting a final rule that appeared in the Federal Register of January 2, 2014 (79 FR 34). The final rule amended the International Traffic in Arms Regulations (ITAR) as part of the President's Export Control Reform (ECR) effort., 7420=The Department of State is correcting a final rule that appeared in the Federal Register of July 1, 2014 (79 FR 37536) and making other, minor changes., 29882=As part of the President's Export Control Reform (ECR) effort, the Department of State is amending the International Traffic in Arms Regulations (ITAR) to revise Category XV (Spacecraft and Related Articles) of the U.S. Munitions List (USML) to describe more precisely the articles warranting control in that category. The revisions contained in this rule are part of the Department of State's retrospective plan under Executive Order 13563 completed on August 17, 2011. This rule is published as an interim final rule because the Department believes that substantial national security benefits will flow from the changes to the controls on spacecraft and related items, but acknowledges that additional analysis of and public comment on the control thresholds for remote sensing satellites are warranted.}",
    "lastModified": "Wed, 15 Jul 2015 18:19:07 GMT",
    "textBeforeTable": "Additional Documents GPO FDSys XML | Text 80 FR 37974 - Temporary Modification of Category XI of the United States Munitions List 2015-07-02; vol. 80 # 127 - Thursday, July 2, 2015 For a complete list of all Rules, Proposed Rules, and Notices view the Rulemaking tab. The following are only the Rules published in the Federal Register after the published date of Title 22. Title 22 published on 2014-04-01. 22 U.S.C. 2651a2797277822 U.S.C. 2752 58 FR 39287, July 22, 1993, unless otherwise noted. Source: ; Pub. L. 105-261, 112 Stat. 1920. ); E.O. 11958, 42 FR 4311; 3 CFR, 1977 Comp. p. 79; , , Secs. 2, 38, and 71, Pub. L. 90-629, 90 Stat. 744 ( Authority:",
    "textAfterTable": "DEPARTMENT OF STATE Final rule; notice of temporary modification. Amendatory instructions 1 and 2 are effective July 2, 2015. Amendatory instruction No. 3 is effective December 29, 2015. 22 CFR Part 121 Summary The Department of State, pursuant to its regulations and in the interest of the security of the United States, temporarily modifies Category XI of the United States Munitions List (USML). 2014-12-29; vol. 79 # 248 - Monday, December 29, 2014 79 FR 77884 - Amendment to the International Traffic in Arms Regulations: United States Munitions List Category XI (Military Electronics), Correction, and Other Changes GPO FDSys XML | Text Additional Documents type regulations.gov FR Doc. 2014-30232 RIN 1400-AD25 Public Notice 8979",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}