{
    "relation": [
        [
            "Series",
            "9-4",
            "9-4",
            "9-4",
            "9-4",
            "9-4",
            "9-4",
            "9-4",
            "9-4",
            "9-4",
            "9-4",
            "9-4",
            "9-4",
            "9-4",
            "9-4",
            "9-4",
            "9-4",
            "9-4",
            "9-4",
            "9-4",
            "9-4",
            "9-4"
        ],
        [
            "Box",
            "2",
            "2",
            "2",
            "2",
            "2",
            "2",
            "2",
            "2",
            "2",
            "2",
            "2",
            "2",
            "2",
            "2",
            "2",
            "2",
            "2",
            "2",
            "2",
            "2",
            "2"
        ],
        [
            "Folder",
            "6",
            "6",
            "6",
            "6",
            "6",
            "6",
            "6",
            "6",
            "6",
            "6",
            "6",
            "6",
            "6",
            "6",
            "6",
            "6",
            "6",
            "6",
            "6",
            "6",
            "6"
        ],
        [
            "Date",
            "6/3/2002",
            "6/3/2002",
            "6/4/2002",
            "6/5/2002",
            "6/5/2002",
            "6/5/2002",
            "6/6/2002",
            "6/6/2002",
            "6/6/2002",
            "6/6/2002",
            "6/6/2002",
            "6/10/2002",
            "6/13/2002",
            "6/13/2002",
            "6/13/2002",
            "6/14/2002",
            "6/15/2002",
            "6/15/2002",
            "6/18/2002",
            "6/19/2002",
            "6/19/2002"
        ],
        [
            "Press Release Title",
            "Study Shows Positive Results from Early Head Start Program",
            "HHS Study Shows Poverty, Welfare Dependence Drop",
            "HHS Awards $30 Million to Address Emerging Nurse Shortage",
            "The Compassion Capital Fund and the Faith- and Community- Based Initiative",
            "HHS Announces Availability of Funds to Assist Faith-Based and Community Organizations",
            "Statement by HHS Secretary Tommy G. Thompson Regarding the Tri-Partisan House-Senate Patient Safety Bills",
            "HHS Report Shows Teen Birth Rate Falls to New Record Low in 2001",
            "17 Critical Benchmarks for Bioterrorism Preparedness Planning",
            "Bioterrorism Preparedness Grants",
            "HHS Approves State Bioterrorism Plans So Building Can Begin",
            "Statement by HHS Secretary Tommy G. Thompson Regarding President Bush's Proposed Department of Homeland Security",
            "HHS Moves to Free Home Health Nurses to Focus on Patient Care",
            "Melissa Rose Chapman Named HHS Chief Information Officer",
            "HHS Issues New Medicaid Managed Care Regulation to Guarantee Strong Patient Protections",
            "HHS Career Executives Named to Leadership Positions",
            "HHS Announces Plans to Study Ephedra; Steps Up Enforcement of Illegal Ephedrine Marketing",
            "HHS Approves Wisconsin Plan to Extend Family Planning Services",
            "HHS Announces \"Urban Partnerships\" Initiative to Help More Families Achieve Economic Independence",
            "PDUFA Reauthorization Good for American Patients",
            "$11.4 Million Awarded for National Child Traumatic Stress Initiative",
            "HHS Urges Congress to Act This Year on Medicare Plan"
        ]
    ],
    "pageTitle": "Tommy G. Thompson Collection | Marquette Archives | Raynor Memorial Libraries | Marquette University",
    "title": "",
    "url": "http://marquette.edu/library/archives/Mss/TGT/TGT-series9-4.shtml",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042982745.46/warc/CC-MAIN-20150728002302-00040-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 165148271,
    "recordOffset": 165095696,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{593=Raynor Memorial Libraries \u0095 1355 West Wisconsin Avenue \u0095 Milwaukee, WI 53233 Information Desk: (414) 288-7556 Tell Us What You Think, 136=    © 2015 Marquette University       }",
    "textBeforeTable": "TGT Series 9-4 Medicare to Cover Surgical Procedure for Incontinence 6/29/2001 5 1 9-4 HHS Announces New and Continued Grants to Expand Alzheimer's Disease Demonstration Program 6/28/2001 5 1 9-4 HHS Calls on Congress to Reform Medicare Contracting Rules 6/28/2001 5 1 9-4 HHS Approves California Plan to Extend Medi-Cal Coverage Period 6/28/2001 5 1 9-4 HHS Approves Changes in Kansas SCHIP Program 6/27/2001 5 1 9-4 A Joint Statement by the Department of State and the Department of Health and Human Services 6/27/2001 5 1 9-4 Mortality Declines for Several Leading Causes of Death in 1999 6/26/2001 5 1 9-4 HHS Increases State Flexibility to Provide Insurance Coverage Under the State Children's Health Insurance Program",
    "textAfterTable": "7 8/4/2001 State Innovation in Medicaid and SCHIP Since Jan. 22 Expands Access to Health Care Coverage for 800,000 Americans 9-4 1 7 8/4/2001 Policy Academies Will Help Improve Access to Services for Homeless People 9-4 1 7 8/4/2001 HHS to Give States New Options for Expanding Health Coverage 9-4 1 7 8/6/2001 HHS Announces $53.7 Million in Grants to Improve HIV/AIDS Care for Women, Children, Youth and Families 9-4 1 7 8/8/2001 HHS Approves Colorado Medicaid Demonstration to Give Home-Bound Patients Greater Control of Their Care 9-4 1 7 8/8/2001 Diet and Exercise Dramatically Delay Type 2 Diabetes, Diabetes Medication Metformin Also Effective 9-4 1 7 8/8/2001 Remarks by HHS Secretary Tommy G. Thompson at Press Conference Announcing Results of Diabetes Prevention Program 9-4",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}