{
    "relation": [
        [
            "Tauren",
            "War Stomp",
            "Endurance",
            "Nature Resistance",
            "Cultivation"
        ],
        [
            "",
            "Stuns up to 5 enemies within 8yds for 2 seconds (2 min cooldown)",
            "Base health increased by 5%",
            "Reduces Nature damage taken by 1%",
            "Herbalism increased by 15 points and speeds the gathering process"
        ]
    ],
    "pageTitle": "Unholy DPS 5.4 - The Fun has been Doubled! - Death Knights - Elitist Jerks",
    "title": "",
    "url": "http://forums.elitistjerks.com/topic/131934-unholy-dps-54-the-fun-has-been-doubled/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042981856.5/warc/CC-MAIN-20150728002301-00085-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 101367715,
    "recordOffset": 101297538,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{10977=Last Updated 6/9/2014 By Mendenbarr 6/9/14 | Mists of Pandaria 5.4  , 11347=Posted 08 September 2013 - 04:28 PM}",
    "TableContextTimeStampAfterTable": "{162731=Posted 10 September 2013 - 07:45 PM, 156466=Posted 10 September 2013 - 07:39 PM, 184165=Posted 17 September 2013 - 03:46 PM, 110494=In regards to reforging your gear, start with the hit and expertise cap and manage your DPS stat priority as above. I’d recommend taking a look at Wow Reforge to help you make your reforging decisions outside of the game. When using Wow Reforge's site for Unholy, you will need to specify your hit & expertise caps for 'close to' 2550 or 2210 (if you have a +1% racial). By choosing 'close to', the calculator attempts to reforge your gear to the specified hit cap number but it also considers reforges in a tight threshold around the cap. It weighs the various configurations by the stats they provide and ranks them from highest to lowest in EP value. It may be that your optimum reforge puts you exactly at cap or it could put you a point over or under because the DPS is rated better. It will simply depend on your race and assortment of gear. Reforge calculators require a lot of complicated math so always double check your results for accuracy. Report any anomalies to the site owner to improve the reliability of the tool. Tips for Reforging:, 261262=Edited by Rankochan, 30 December 2013 - 05:09 AM., 251273=Posted 14 December 2013 - 12:33 PM, 148949=09/08/2013- Thread created., 203060=Posted 27 September 2013 - 09:10 PM, 267790=Posted 04 January 2014 - 08:34 AM, 148994=06/09/2014- Fixed broken talent compairson images (imageshack seems to have deleted everything I was hosting), removed incorrect BiS list, (I will not be adding a new one until WoD, and even then it's a maybe), and fixed a minor error with the CDR trinket effecting UF and not ERW.  Click here to view the guide, 246188=Posted 02 October 2013 - 04:16 PM, 190996=Posted 17 September 2013 - 10:04 PM, 165756=Posted 15 September 2013 - 06:16 PM, 226651=Posted 01 October 2013 - 07:55 PM, 152999=Posted 10 September 2013 - 02:25 AM, 260459=Posted 30 December 2013 - 05:06 AM, 181007=Posted 17 September 2013 - 06:02 AM, 263968=Posted 04 January 2014 - 07:28 AM, 173002=Posted 16 September 2013 - 02:56 PM, 107630=Hit Hit to cap is extremely important. Not only does it determine your melee hit, but it's now relied on for your spell hit too. If you miss a lot, that’s 0 damage on a frequent basis. Meters can't discriminate whether your damage suffered because of low hit rating or because you were too busy watching FiM reruns to pay attention to the boss (the latter is slightly more acceptable). Also keep in mind that your Ghoul inherits your stats (with hit rating no longer rounding down). At level 90, it takes 2550 hit rating to become hit capped for a raid boss (2210 for Draenei). There is a certain leniency for being slightly over or slightly under, but you want to negotiate this very carefully. When in doubt, test yourself on a target dummy for extended lengths of time or run your character’s paper doll through simulations for a very general idea of how it will affect your real performance. Expertise As stated at the beginning of the guide, expertise will negate dodge AND spell miss, then parry. Therefore whatever value you have for expertise will combine with hit to determine your spell hit. Expertise, as such, has become incredibly valuable for us. At level 90, it takes 2550 expertise rating to become expertise capped for a raid boss (2210 for races with 1% added expertise). Haste Your GCD is affected by various factors such as expertise, Heroism/Bloodlust effects, your connection speed and so forth. The best way to approach haste itemization is whether or not you personally experience GCD locks. If you have no trouble expending resources, haste remains highly favored, simple as that. Crit Crit makes abilities hit twice as hard. More crit makes it happen more often. Mastery Mastery boosts our shadow damage via Dreadblade and has a bit less parity than before. *A word on stats Unholy secondary stat weights are all very close right, so close in-fact that there are obtainable gearsets for every possible stat priority. This means there is no one \"right\" way to gear, as it will vary from person to person. You can use the above order as a rule of thumb, but it is highly suggested that you sim your own stat weights and try to get them as close as possible together, in order to maximize dps. In general, getting X stat makes Y and Z better, but doesn't change X. So if X is the best stat for you, get enough of X to bring Y or Z up, and then hold that balance., 176899=Posted 16 September 2013 - 11:05 PM, 206404=Posted 28 September 2013 - 02:53 PM, 169440=Posted 16 September 2013 - 10:35 AM, 187588=Posted 17 September 2013 - 05:01 PM}",
    "textBeforeTable": "        Verdict: The silence can be helpful when Mind Freeze is down or when you just want an ounce of free RP to Death Coil. Asides from that, you're basically joining this race for the hair: the superbly immaculate hair. Reduces Arcane damage taken by 1% Magic Resistance Enchanting increased by 10 Arcane Affinity Silence all enemies within 8yds for 2 seconds and gain 15 runic power (2 min cooldown) Arcane Torrent   Blood Elf         Verdict: Touch of the Grave's damage/heal scales with mastery and is more optimized than what Belfs and the moo cows have to offer. Your attacks and damaging spells have a chance to drain the target, dealing X amount of Shadow damage and healing you for the same amount. Touch of the Grave Reduces Shadow damage taken by 1% Shadow Resistance Regen 7% health every 2 seconds for 10 seconds (2 min cooldown) Cannibalize Removes charm, fear, and sleep (2 min cooldown) Will of the Forsaken   Forsaken         Verdict: A short haste bonus and a snare reduction isn't bad, but it's a downgrade in comparison to Orcs and Goblins.",
    "textAfterTable": "Verdict: Tauren are on par with Night Elves in regards to lacking useful PVE racials. \"The cow goes 'boooooo'.\"     Professions   When it comes to professions, the biggest question is, \"Which ones give the most strength?\". Alchemy, Leatherworking, Enchanting, Blacksmithing, Inscription, and Engineering are all on par by conveying 320 strength and are excellent choices as well. Engineering, as has been the case for a long while, provides us that strength via the Synapse Springs (Mark II) which can be used for 10s every 60s. It's slightly superior, as it allows you to stack cooldowns together for increased benefit, and gives you access to toys like goblin glider, rocket boots, and frag bomb. Blacksmithing is the second best choice by a small, small amount, as it let's you pick which secondary stats you want to take, unlike most of the other professions which are locked into strength, or in the case of JCing, give half the secondaries that BS gives. In terms of long term benefits, any of the aforementioned six tradeskills are great options. If you're looking to absolutely maximize your Death Knight's strength gains, you can relegate gathering to another character so that you have 640 bonus strength from crafting professions.       Name Benefit Alchemy Alchemists receive the [Alchemist's Flask] and",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}