{
    "relation": [
        [
            "First Name",
            "Marge",
            "Mary"
        ],
        [
            "Last Name",
            "Clark",
            "Georgevich"
        ],
        [
            "Suffix",
            "BVM",
            ""
        ],
        [
            "Covered Official Position (if applicable)",
            "",
            ""
        ],
        [
            "New",
            "",
            ""
        ]
    ],
    "pageTitle": "LD-2 Disclosure Form",
    "title": "",
    "url": "http://soprweb.senate.gov/index.cfm?event=getFilingDetails&filingID=AC215EA1-1A6A-4576-A941-6C25E7144A32&filingTypeID=60",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042981856.5/warc/CC-MAIN-20150728002301-00142-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 225122779,
    "recordOffset": 225106868,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{47228=NETWORK supports reductions in corporate subsidies, with use of savings used to address the deficit H.R.1124 Fairness in Taxation Act - NETWORK suppports these additional tax reates for the wealthies among us as a way to build a strong middle class and preserve Medicare and Medicaid, 12164=Continuing Appropriations, 2011 - NETWORK strongly opposes provisions to reduce funding for SNAP and other nutrition programs, particularly those affecting children and the elderly. NETWORK strongly opposes cuts to rural housing progrmas in the House Agricultural Appropriations bill for 2012, 1019=Lobbying Disclosure Act of 1995 (Section 5) - All Filers Are Required to Complete This Page, 15121=H.J. Res. 1 and all other Balanced Budget Amendments to the Constitution - NETWORK strongly opposes any Constitutional amendment for a balanced budget H.R. 1 House Budget for 2012 - NETWORK opposes all structural changes to means-tested programs, and cuts to domestic human needs programs, without significant increases in revenue from millionaires, corporations which shelter profits outside the country and utilize loopholes leading to very small effective tax rates paid. H.Con.Res.34 - Rep. Ryan's budget plan - NETWORK strongly opposes, same reasons as above NETWORK strongly opposes \"global spending caps\" as they are indescriminant and would exact the greatest pain on those who have the least means of support. NETWORK strongly opposes debt triggers which would affect spending, but not revenue increases. NETWORK strongly supports increased revenue as at least 50% of deficit reduction. NETWORK strongly supports significant cuts to Pentagon spending, particularly elimination of weapons systems and planes which are not wanted by the military, including the second engine for the F-35. 2012 Budget - NETWORK supports preservation and significant funding of the Supplemental Security Income program 2012 Budget - NETWORK supports continued funding of the Mentally Ill Offender Treatment and Crime Reduction Act (MIOTCRA) of 2012. NETWORK supports full funding for the International Affairs Budget for Fy 2012, as requested by the President NETWORK strongly supports a budget which will creates jobs with living wages, health care, retirement security and other benefits. H.R. 1473 - NETWORK opposes this budget plan., 40840=H.R.2341 - Direct Care Job Quality Improvement Act - NETWORK supports preparation of care workers Workfoce Investment Act - NETWORK STRONGLY supports this, as there are not persons trained for hundreds of thousands of existing jobs. S. 904, H.R.1745 - The JOBS Act of 2011 - NETWORK strongly opposes this bill, as it is an anti-jobs bill, stripping away insurance benefits to long-term unemployed, among other negative actions. H.R. 1440, H.R. 1876 - NETWORK strongly supports these bills which make it safer and more possible for low-wage workers to care for their own and family members' health, making workplaces safer and healthier. H.R. 1591, S. 797 - Paycheck Fairness Act of 2011 - NETWORK supports this act. It takes one more step in ensuring that women are not prejudiced against in the work place. NETWORK supports the funding of a mechanism to assist states in implementing a family paid medical leave act., 28836=H.H. 1121, H.R. 1315 - NETWORK strongly opposes these bills which would undermine the Consumer Financial Protection Bureau, 20203=NETWORK supports the reduction in Overseas Contingency Operations for Iraq and Afghanistan NETWORK strongly supports a sizeable and sustained reduction in forces from Afghanistan, allowing for a near end to that war supporting H.R. 1735 Bring the Troops Home, 37855=H.R.1477 - NETWORK strongly supports funding the National Housing Trust Fund from TARP warrents H.R. 2441 - NETWORK strongly opposes the Royce bill to de-authorize the National Housing Trust Fund S.961 Reconnecting Youth to Prevent Homelessness Act of 2011- NETWORK strongly supports this bill}",
    "textBeforeTable": "",
    "textAfterTable": "City WASHINGTON State DC Zip Code 20001 Country USA 3. Principal place of business (if different than line 2) City   State   Zip Code   Country   4a. Contact Name b. Telephone Number c. E-mail  Ms.  MARGE CLARK  2023479797  mclark@networklobby.org 5. Senate ID#  63495-12",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}