{
    "relation": [
        [
            "Date",
            "May 29, 2001",
            "Jul 26, 2004",
            "Apr 21, 2010",
            "Apr 2, 2014"
        ],
        [
            "Code",
            "AS",
            "AS",
            "FPAY",
            "FPAY"
        ],
        [
            "Event",
            "Assignment",
            "Assignment",
            "Fee payment",
            "Fee payment"
        ],
        [
            "Description",
            "Owner name: NETSCAPE COMMUNICATIONS CORPORATION, CALIFORNIA Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNORS:BOREHAM, DAVID W.;ROWLEY, PETER;SMITH, MARK C.;REEL/FRAME:011883/0735 Effective date: 20010524",
            "Owner name: SUN MICROSYSTEMS, INC., TEXAS Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNOR:NETSCAPE COMMUNICATION CORPORATION;REEL/FRAME:015601/0627 Effective date: 20020521",
            "Year of fee payment: 4",
            "Year of fee payment: 8"
        ]
    ],
    "pageTitle": "Patent US20030105742 - Method and system for grouping entries in a directory server by group ... - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US20030105742?dq=%223do%22+dna",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042982745.46/warc/CC-MAIN-20150728002302-00284-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 477665447,
    "recordOffset": 477604687,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{165048=[0245] Referring to FIG. 23, an indirect CoS scheme contains a CoS Definition Entry 2310, which contains a CoS specifier X and a list of attributes. This CoS specifier X is an attribute such as manager that points to another entry, which could be any entry or another target entry. This list of attributes could include, for example, a fax number attribute that is shared by all the persons in a particular group managed by that manager. Three target entries A, B and C are showin in FIG. 23. Of these entries, C could be a manager of the group. Entry A uses indirect CoS to take on the values for certain attirbutes, such as fax number, from A's manager, i.e., target entry C. Note that in order for this to be possible, the value given to the CoS specifier X in A's entry must be a valid DN, in this case, the DN of the manager entry C. FIG. 24 shows an example of an indirect CoS. In this example, each person's entry will inherit “accounting code” from their manager's entry. When an employee moves to another department, and thereby his manager changes, accounting codes automatically change to the correct new value when an employee's manager attrbute changes., 163040=[0243] Referring to FIG. 20, which shows a diagrammatic version of a pointer CoS in a Directory Information Tree (DIT), at a branch node 2000, a Pointer CoS is defined by two entries, the Pointer CoS Definition Entry 2010 and the Pointer CoS Template Entry 2020. Target entries 2030 that are within the scope of this pointer CoS are also shown. Any target entry within scope of the Pointer CoS definition of the branch node 2000 get the value provided by that template, if they are qualified to get any value. The difference between Classic CoS and Pointer CoS is that in the latter, there is no choice of what value a target entry may get for that CoS scheme. This important difference between Classic CoS and Pointer CoS can be appreciated with reference to a DIT depicting Classic CoS as shown in FIG. 21. An example of a pointer COS is as shown in FIG. 22. In this example, every target entry will inherit the organization's fax number, unless a particular target entry has its own fax number attribute., 59172=[0011] Entries are typically organized in a specified tree structure, and each entry is composed of attributes. In an LDAP-compliant directory server, each user and group in an organization or an enterprise is represented by a Distinguished Name (DN) attribute. As defined in Request for Comment (RFC) 1779, DN attribute is a text string that contains unambiguous identifying information for an associated user, group, or object. DNs are used when a change is made to a user or group directory entry. Directory server entries are typed by an objectclass attribute, which allows searching for those entries with a particular value to the objectclass attribute. To search a company's sales department of a United States corporation, for example, an Directory server query in the Uniform Resource Locator (URL) format:, 136069=[0192] <bind rule> identifies the circumstances under which the directory log in must occur in order for the ACI to take effect. Binding refers to logging in or authenticating to the directory. The circumstances under which binding occurs determine whether access to the directory is allowed or denied. Every permission set in an ACI has a corresponding bind rule that details the specific circumstance under which binding must occur for the ACI to be applied. Bind rules can be simple, for example, a bind rule can simply state that the person accessing the directory must belong to a specific group. Bind rules can also be more complex, for example, a bind rule can state that a person must belong to a specific group and must log in from a machine with a specific Internet Protocol (IP) address, during between 8 AM and 5 PM. Whether access is allowed or denied depends on whether an ACI's bind rule is evaluated to be true. Bind rules use one of the two following patterns: (a) <keyword>=“<expression>”; and (b) <keyword>!=“<expression>”, where equal (=) indicates that <keyword> and <expression> must match in order for the bind rule to be true, and not equal (!=) indicates that <keyword> and <expression> must not match in order for the bind rule to be true. Bind rules tell who can access the directory, when, and from where. More specifically, bind rules specify the users and groups that can access the directory, the location from which an entity must bind, the time or day on which binding must occur, or the type of authentication that must be in use during binding. Additionally, bind rules can be complex constructions that combine bind methods using Boolean operators. More on ACI syntax is located at http:fldocs.iplanet.com/docs/manuals/directory/admin30/adminix.htm, visited Feb. 8, 2001, which description is incorporated herein by reference in its entirety., 179667=[0284] In an embodiment, the Directory Server uses a format such as the LDAP Data Interchange Format (LDIF), which is a standard text-based format for describing directory entries. LDIF is defined in RFC 2849 and is available through sources such as the IETF. An LDIF-compliant directory has one or more directory entries separated by a blank line. An entry is a group of lines in the LDIF file that contains information about an object, such as a person in an organization or a printer on a network. Information about the entry is represented in the LDIF file by a set of attributes and their values. Each entry has an optional entry identifier (ID), a required distinguished name, one or more object classes, and one or more attribute definitions. The object class is attribute that specifies the kind of object the entry describes and defines the set of additional attributes it contains. Each attribute describes a particular trait of an entry., 62092=[0016] As an example, consider a web accounting application that needs to restrict the creation of purchase orders to purchasing department staff, unless the order value is less than $1000 in which case managers can place orders. With a traditional Directory Service the application can choose to store an attribute for each person entry which dictates the maximum value purchase order that person may create. This scheme has the disadvantage that the logic behind the assignment of order value to each person may be lost.}",
    "textBeforeTable": "Patent Citations [0335] Although the foregoing description includes some embodiments of the principles of a new and useful system, one skilled in the art will readily appreciate that modifications and rearrangements can be made to those set forth herein without departing from the spirit and scope of the disclosure or without undue experimentation. Accordingly, the following claims should be construed to encompass such modifications and rearrangements. }  }   redirect(“changepw.htm”);  else{   }    logs.”);}    write(“***ERROR*** Password change failed. Check error   else{   }    write(“<br><a href=\\“home.htm\\”>Login as a different user</a>”);    write(“Password changed for user: “+user);   if (didChange == true){   var didChange = changePW(project.ldap,user,user,newpw);   // changePW is actually a wrapper to that method.   // Change password will also test changeAttrib because  if (goodpw == true){  var goodpw = authenticate(project.ldap,user,oldpw); else{ }  redirect(“changepw.htm”); if (newpw != newpw2){ newpw2 = request.newpw2;",
    "textAfterTable": "US7114037 Jan 16, 2003 Sep 26, 2006 Oracle International Corporation Employing local data stores to maintain data during workflows US7206851 Dec 23, 2002 Apr 17, 2007 Oracle International Corporation Identifying dynamic groups US7428523 Jan 30, 2003 Sep 23, 2008 Oracle International Corporation Portal bridge US7428592 Jan 16, 2003 Sep 23, 2008 Oracle International Corporation Securely persisting network resource identifiers US7447701 * Jan 30, 2003 Nov 4, 2008 Oracle International Corporation Automatic configuration of attribute sets US7478407 Dec 20, 2002 Jan 13, 2009 Oracle International Corporation Supporting multiple application program interfaces US7647307 Nov 1, 2006 Jan 12, 2010 Red Hat, Inc. Reverse attribute pointers US7653688 * Nov 5, 2003 Jan 26, 2010 Sap Ag Role-based portal to a workplace system US7725563 * Feb 27, 2007 May",
    "hasKeyColumn": true,
    "keyColumnIndex": 2,
    "headerRowIndex": 0
}