{
    "relation": [
        [
            "Patent application number",
            "20100110558",
            "20100149821"
        ],
        [
            "Description",
            "COMPOSITE OPTICAL DIVIDING DEVICE - A composite optical-dividing component receives a light beam. There are mixed-bands in the light beam. The composite optical-dividing component includes a first optical-patch and a second optical-patch. The first optical-patch has multiple micro-structural lenses in an identical shape. Each micro-structural lens receives the light beam and generates a deflecting light in some degrees of condense. The second optical patch has multiple polygonal structures. Some polygonal structures are periodic and provide the function of deflection in order to receive the deflecting light and then separate multiple bands from the beam. In accordance with wavelengths in multiple bands, the bands are emitted to a target area (RGB) in a plane, respectively. Another part of the polygonal structures has the capability of light refraction, which receives the deflecting light and deflects and the rest of the bands in the beam. And it is emitted to a target area (W) in a plane.",
            "LIGHT SOURCE PACKAGE STRUCTURE - The present invention relates to a light source package structure, which comprises: an accommodating space for accommodating a light source, a first refraction surface, and at least a second refraction surface. The first refraction surface receives light discharging from the light source while refracting the same to form a first refracting light, the upper part of the first refraction surface further comprising a refracting structure for refracting the light emitted from the light source. The second refraction surface receives and refracts the first refracting light to form a discharging light being emitted out of the light source package structure. Wherein, an included angle is formed between the normal vector of a portion of the second refraction surface and the central axis of the light source package structure. It is noted that the aforesaid package structure can be used in various packaging for improving refraction. In a preferred embodiment, a light source of light emitting diode (LED) is packaged by the light source package structure of the invention for enabling the light emitted from the LED to be discharged out of the package structure by a large angle after being refracted multiple times, so that the LED package structure can be adopted as a flat light source for diverse purpose applied in industry."
        ],
        [
            "Published",
            "05-06-2010",
            "06-17-2010"
        ]
    ],
    "pageTitle": "Hsu, Tainan City - Patent applications",
    "title": "",
    "url": "http://www.faqs.org/patents/inventor/hsu-tainan-city-4/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042982745.46/warc/CC-MAIN-20150728002302-00201-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 452172159,
    "recordOffset": 452126889,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Hsiu-Chen Hsu, Tainan City TW 05-03-2012 CAPACITIVE TOUCH DEVICE CAPABLE OF DISTINGUISHING BETWEEN CONDUCTOR AND NONCONDUCTOR - A capacitive touch device capable of distinguishing conductor and nonconductor includes a flexible sensor layer receiving a first driving signal, an elastic insulation layer below the flexible sensor layer, and an electrically conductive layer below the elastic insulation layer and receiving a second driving signal synchronous but out of phase to the first driving signal. The flexible sensor layer generates a capacitance variation responsive to an object touching thereon, for identifying the object as a conductor or a nonconductor. 20120103779 02-02-2012 LINEARITY IMPROVEMENT OF A CAPACITIVE TOUCH PAD - A capacitive touchpad includes a first trace established by a string of first rhombic sensing cells successively in a first direction and a plurality of singular second rhombic sensing cells branched in a second direction from the string of first rhombic sensing cells, and a second trace established by a string of third rhombic sensing cells successively in the first direction and a plurality of singular fourth rhombic sensing cells branched in the second direction from the string of third rhombic sensing cells, and the second rhombic sensing cells are interleaved with the fourth rhombic sensing cells in the first direction. The capacitive touchpad is thus improved in its linearity. 20120026130 Published Description Patent application number Hsin-Fu Hsu, Tainan City TW 03-19-2009 Patch containing a medicament",
    "textAfterTable": "Patent applications by Hsiu-Chen Hsu, Tainan City TW Hsiung-Sheng Hsu, Tainan City TW Patent application number Description Published 20130161294 TRIAXIAL DRIVING DEVICE FOR AN ELECTRODISCHARGE MACHINE TOOL - A triaxial driving device for electrodischarge machine tools having a three-liners-axes mechanism and an electrode tool and has a connecting mount, a first axial rotator, a base, a supporting arm, a second axial rotator, a third axial rotator and an electrode holder. The connecting mount is connected securely to the three-liners-axes mechanism. The first axial rotator is mounted in the connecting mount and has a rotating head. The base is connected securely to the rotating head of the first axial rotator and has a space. The supporting arm is rotatably mounted in the space of the base and has a connecting frame. The second axial rotator is securely connected to the base and the supporting arm and has a rotating head. The third axial rotator is connected to the supporting arm and has a rotating head. The electrode holder is connected to the third axial rotator and the electrode tool. 06-27-2013 Hung-Min Hsu, Tainan City TW Patent application number Description Published 20130208975",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}