{
    "relation": [
        [
            "BugId",
            "6196991",
            "7118373"
        ],
        [
            "Category",
            "java",
            "java"
        ],
        [
            "Subcategory",
            "classes_nio",
            "classes_nio"
        ],
        [
            "Description",
            "(cs) Many character decoders fail to convert single-byte (e.g. ASCII) input",
            "(se) Potential leak file descriptor when deregistrating at around the same time as an async close"
        ]
    ],
    "pageTitle": "Java SE 5.0 Advanced",
    "title": "",
    "url": "http://www.oracle.com/technetwork/es/java/javasebusiness/documentation/index.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042982745.46/warc/CC-MAIN-20150728002302-00006-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 635891023,
    "recordOffset": 635847648,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{1=In December, 2008, Java SE 1.4.2 reached its end of service life with the release of 1.4.2_19. Future revisions of Java SE 1.4.2 (1.4.2_20 and above) are available to Java for Business subscribers.}",
    "TableContextTimeStampAfterTable": "{78439=In December, 2008, Java SE 1.4.2 reached its end of service life with the release of 1.4.2_19. Future revisions of Java SE 1.4.2 (1.4.2_20 and above) are available to Java for Business subscribers., 61380=This release contains fixes for security vulnerabilities. For more information, see Oracle Security Alert for CVE-2013-1493., 32883=See 8061765 (not public).}",
    "textBeforeTable": "Bug Fixes Changes in 5.0u35 b31 See 7175845. This regression affects the Solaris and other Unix platforms. It does not affect the Windows platform. Due to a regression, the permissions of any jar file updated with the jar command are changed to read and write by user only. The workaround is to use the chmod command on the affected file to allow access by other and world. Area: java/jar Synopsis: Regression - jar command changes file permissions. Known Issues -XX:CompileCommandFile=.hotspot_compiler for the .hotspot_compiler file. -XX:Flags=.hotspotrc will revert to old behavior for .hotspotrc. Command line options to support old behavior: This release contains changes to the default implicit loading of the .hotspot_compiler and .hotspotrc file. For existing deployments which rely on .hotspot_compiler (e.g. to exclude a method from hotspot compilation), an unsupported behavioral option has been provided to simulate the old loading behavior. Area: hotspot/runtime_arguments Synopsis: Improve VM configuration file loading. This release contains fixes for security vulnerabilities. For more information, see Oracle Java SE Critical Patch Update Advisory. Bug Fixes For more information about security baselines, see Deploying Java Applets With Family JRE Versions in Java Plug-in for Internet Explorer. 1.4.2_38 1.4.2 1.5.0_36 5.0 JRE Security Baseline (Full version String) JRE Family Version This update release specifies the following",
    "textAfterTable": "  Changes in 5.0u35 The full internal version number for this update release is 1.5.0_35-b02 (where \"b\" means \"build\"). The external version number is 5.0u35. Olson Data 2011l This release contains Olson time zone data version 2011l. For more information, refer to Timezone Data Versions in the JRE Software. Security Baseline This update release specifies the following security baseline: JRE Family Version Java for Business Security Baseline 5.0 1.5.0_34 1.4.2 1.4.2_36 In December, 2008, Java SE 1.4.2 reached its end of service life with the release of 1.4.2_19. Future revisions of Java SE 1.4.2 (1.4.2_20 and above) are available to Java for Business subscribers. For more information about security baselines, see Deploying Java Applets With Family JRE Versions in Java Plug-in for Internet Explorer. Version Name Changed The following changes were made to the output of the command java -version to releases starting from 5.0u35 and revision releases: The string \"rev\" was removed from the version name of the revision (for example, 1.5.0_35-b31). The text \"for Business\" was removed from the output of the command. In addition, the string \"fb\" was removed from the bundle name (the file name of the installer). Bug Fixes Bug fixes are listed in the following table: Bug ID Category Sub_Category Description 6981400 java classes_awt Tabbing",
    "hasKeyColumn": true,
    "keyColumnIndex": 1,
    "headerRowIndex": 0
}