{
    "relation": [
        [
            "Categories",
            "Campus Safety",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "The one thing I like about the campus safety is that no matter what time it is they allow safe ride. So if you feel uncomfortable to go home from the library late at night they will drive you home so that your safe.",
            "I can't really comment on what to do for fun around ODU because I am always working or in class. However, my roommates are always going out places to eat and events that the school hosts. They also go out to many clubs around here.",
            "The food and dining are okay. I personally do not try to eat on campus that much because it's the same food all day basically every day. But when I do eat on campus it's okay not disgusting.",
            "I was giving off campus housing at the District which isn't dorm life but feels like it. I would rather live on campus than over here because it's safer and less expensive to live on campus. It honestly though is personal opinion on if you like it or not.",
            "I believe that the academics at ODU are more challenging than other institutions. I transferred in from a community college in Pennsylvania and its so much different. The teacher staff here are more difficult and many of them seem to make it like they don't have the time for you to give you outside help.",
            "Some tips for prospective students that they should research all colleges before picking the one they think the really want to go to. Another thing is to analyze the area that you would be around in case for some reason on campus housing was not an option. Lastly when deciding your school pick the school that you like not what other people are influencing you by.",
            "I would describe Old Dominion University as a beautiful campus and many things to do. I would say that there are many opportunities that Old Dominion allows their students to take part in like clubs, organizations, etc."
        ]
    ],
    "pageTitle": "Old Dominion University Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Old-Dominion-University/reviews?_escaped_fragment_=/show/29549",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 125,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042981856.5/warc/CC-MAIN-20150728002301-00182-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 911036167,
    "recordOffset": 910865683,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{928640=The food in the Whitehurst cafeteria is inconsistent, and has its moments. There is a sandwich bar that is always open, a stir fry booth open for lunch and dinner, and its one of the more healthy options. Otherwise if you take to the small buffet, your taking a chance at eating a food that doesn't taste so great. The cafeteria located in the middle of the campus known as 1201 has the same food, however, it is much, much larger, and the chances of one showing up, and wanting food that is actually being served, is much higher., 302328=Cafe 1201 is often hit or miss. When the food is good you will be coming back for more but, when it is bad you will be running for the hills. Besides the cafe ODU has Chick-Fil-A, Panda Express, Starbucks, La Herradura, Sakura Sushi Bar, Raising Cane's, Pizza Hut, Delvec's and countless other places., 1022637=Cafe 1201 is my favor due to the size so their is more options. Honestly speaking, I wish the menu could be switched up a little better and offer more varieties., 295326=Old Dominion's gym is the best I've ever been to hands down. It has so many exercise and weight machines. You name it, the gym has it. Classes are given FOR FREE. Tiquando, Yoga, Pilates, Zumba, and many others are available!!!! ODU football and basketball games are awesome, and the environment will only get better since Old Dominion University will be joining the C-USA Division 1 conference on July 1, 2013!, 433243=A lot of people on campus say the food in Cafe 1201 sucks. I beg to differ. Some of the food may not be so good because it may be bland or not cooked the way you want. The only foods you may want to be more cautious about is its meat like steak and baked chicken. Other than that, the food in Cafe 1201 is pretty good (in my opinion). Besides Cafe 1201, they have in the House of Blues, Pizza Hut, Wing Street, Grille Works, Carolina Cupcakery (maybe), and the POD express. Nearby they have Quiznos and Starbucks. In the gym, they have Einstein Bagels and up in the Village apartments they have other restaurants too, not including some that are off campus nearby. There are abundant options available. Plus, ODU has shuttles that will take you to Walmart and Kroger., 598583=Many organizations and activities to choose from. October is homecoming right after fall break and in April is Campus Chaos which is like field day for college students., 794442=When I first attended ODU the food and dining choices were fantastic. There are conveniently placed cafes at the library and some major buildings for when you have time between classes or in need of something small to eat. Two major dining services, Legends and Cafe 1201, were initially great for expending meal plans. However, the food quickly becomes repetitive and there are only a few instances where they will completely change the selection such as theme events including International Day. As I now use most of my funds at the Subway in the WEB, food is not a high priced gem at this university., 746382=The on campus dining can be iffy at times. There are many fast food options such as Subway, Panda Express, Pizza Hut, Wing Street, etc. The other options that are mostly used by students with a meal plan are Raising Cane's, P.O.D, and Cafe 1201. There are a couple other cafeterias on campus but the food gets old quick., 495480=This isn't applicable to me since I never stayed on campus. However, they have upgraded their housing options over the past couple of years. In 2007, they built new dorms for students who planned to stay on campus., 197713=The food at Cafe 1201 when it's packed with students is not the greatest because they be rushing to feed everyone. But the food in Legends(Whitehurst Hall) is always good it;s the best food on campus., 594868=Cafe 1201 is the main cafeteria. There is a good choice of food, but the quality is not always top-notch., 875743=Cafe 1201, which is located in the Webb University Center, is not my favorite cafe but the food is okay. I believe Whitehurst has the best food., 828298=The food and choices you have everyday are top notch. From Chick-fil-a to Cafe 1201 (the dining hall for students), the choices are great and the taste even better., 229808=There are always security walking around the campus to look around the campus for any safety. students can take safe ride after 7:00 p.m till 3:00 in the morning. Students don't have to worry about walking late at night by him or her self., 1014180=The campus has suffered from many security issues in the past and still has a few flaws, as with everything in the world, but the University has recently installed more than 1000 cameras in various locations both on and around campus to ensure the highest quality of surveillance and crime prevention. Should something happen, there are many resources available at the school's Women's Center which is open to both men and women looking for information on different domestic issues, assistance, and counseling., 1031622=© 2015, Cappex.com, LLC, 296879=Living in a dorm for my first year was a great experience! I met so many great new friends and learned more about myself! Studying with other people definitely helps you understand topics before a big test. You will be close to all the great activities the school provides and the all day 1201 Cafe in the Webb is perfect for the students' convenience. Scotland Housing is a great place to live, although the competition for freshman is very competitive., 633611=The food at Cafe 1201 is excellent and there is much variety to choose form during peak hours of service. Legends is very decent as well, significantly smaller but caters to the needs of the freshman dorms and Powhatan apartment residents. There are also numerous restaurants such as Subway, Starbucks, Panda Express, Pizza Hut and Chik Fil A located on campus.}",
    "textBeforeTable": "12/21/2009 Reviewer is A current student here. 31 out of 31 people found this review useful. 1 of 240 Efrem from Chantilly, VA Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5",
    "textAfterTable": "Categories Comments Great for these types of students ~Outgoing ~Diverse ~ Fun Loving ~Involved With Organizations ~Determined ~ Organized(Time) Tips for prospective students ~Make Sure Applications & Paperwork Are Turned in on time. ~Fill Fafsa Out Early & make Sure its filled out correctly! ~ sit With Parents and Make sure Financial paperworks are together and correct. Bang for the buck The Money Spent At ODU is worth evey dime, you get your moneys worth. Am enjoying being here One of The Things I Can Say About ODU is, It is a very diverse school. We have Tons of School spirit and there is always something to do that involves everyone, especially the football games! A lot of the organizations here at ODU are great and fun, a lot are about community service. Am learning a lot Classes at ODU have their Students REALLY Involved! A student can walk out and say that they learned something. Login to rate or flag the reviews Malcolm from Hampton, VA",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}