{
    "relation": [
        [
            "",
            "Texas",
            "Oklahoma",
            "Nebraska",
            "Texas A&M",
            "Oklahoma State",
            "Missouri",
            "Texas Tech",
            "Colorado",
            "Kansas",
            "Kansas State",
            "Baylor",
            "Iowa State"
        ],
        [
            "AVG Recruiting Ranking",
            "1.7",
            "1.8",
            "4",
            "4.5",
            "5.8",
            "6.5",
            "7.5",
            "8",
            "8.2",
            "8.3",
            "10.7",
            "11"
        ],
        [
            "AVG Conference Finish",
            "4.2",
            "2.5",
            "3.6",
            "7.2",
            "4.5",
            "3.7",
            "6",
            "9.6",
            "8.7",
            "6.8",
            "8.8",
            "10"
        ],
        [
            "Differential",
            "-2.5",
            "-0.7",
            "+0.4",
            "-2.7",
            "+0.7",
            "+2.8",
            "+1.5",
            "-1.6",
            "-0.5",
            "+1.5",
            "+1.9",
            "+1.0"
        ]
    ],
    "pageTitle": "PowerMizzou.com - Recruiting means more in the SEC",
    "title": "",
    "url": "https://missouri.rivals.com/content.asp?CID=1420938&PT=4&PR=2",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042981856.5/warc/CC-MAIN-20150728002301-00235-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 872817671,
    "recordOffset": 872801202,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{1947=Rivals.com is your source for: College Football | Football Recruiting | College Basketball | Basketball Recruiting | College Baseball | High School | College Merchandise Site-specific editorial/photos © 2006 PowerMizzou.com. All rights reserved. This website is an officially and independently operated source of news and information not affiliated with any school or team. About | Advertise with Us | Contact | Privacy Policy | About our Ads | Terms of Service | Copyright/IP policy | Yahoo! Sports - NBC Sports Network Statistical information ©2014 STATS LLC All Rights Reserved.}",
    "TableContextTimeStampAfterTable": "{41484=October 11, 2012, 59384=Analysis: Buckeyes add 2017 DB}",
    "textBeforeTable": "Big 12: Recruiting Rankings vs League Finish Below are the average recruiting ranking and average league finish for each team. The final column is the difference between those two numbers for each team. 5. The \"quotient of change\" was finding the difference in between average recruiting ranking per team and average conference finish per team, and then adding those numbers together for the conference total over that span. 4. If teams jumped to new conferences in that span (Nebraska and Colorado), their conference standing average was determined over a five-year span, instead of six. Their recruiting rankings still were averaged over a six-year span. 3. If two teams from different divisions of a conference had the same conference record, the tie-breaker was overall record.  If two teams from the same division had the same conference record, the tie-breaker was head-to-head result. 2. The top team in both divisions were listed as conference co-champions. So, for the Big 12 in 2007, Missouri and Oklahoma were co-number ones. We did not count the winner of the conference championship into the equation because it skews the overall number of games played. 1. Recruiting rankings were averaged between 2005 and 2010. Conference standings were averaged between 2006 and 2011. The reason for this variation is that the bulk impact of",
    "textAfterTable": "Notes: The Big 12 had six teams exceed their recruiting rankings, compared to the SEC with four. The biggest difference is that the Big 12 had three teams exceed recruiting expectations while also finishing in the top half of the conference. The SEC had just one ... Missouri made the biggest leap with a quotient of change of 2.8 ... Texas and Texas A&M were the biggest fallers. Texas had a quotient of change of (-)2.5. The Aggies were just south of the Longhorns with a (-)2.7 quotient of change. SEC: Recruiting Rankings vs League Finish AVG Recruiting Ranking AVG Conference Finish Differential Florida 2.3 3.7 -0.6 Georgia 3.2 4 -0.8 Alabama 3.7 4.5 -0.8 LSU 3.7 3.3 +0.4 Tennessee 4.5 7 -2.5 Auburn 4.7 5.5 -0.8 South Carolina 6.5 6.5 0 Ole Miss 7.5 8.8 -1.3 Arkansas 8.7 5.2 +3.5 Mississippi State 10 9.3 +0.7 Kentucky 10.8 9 +1.8 Vanderbilt 12 10.2 +1.8 Notes: The same top four teams for average recruiting finish were also the top four teams for average conference finish ... The two biggest outliers were Arkansas, whose quotient of change was (+)3.5, and Tennessee, whose quotient of",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}