{
    "relation": [
        [
            "Categories",
            "Campus Safety",
            "Great for these types of students",
            "What to do for fun",
            "Food and Dining",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "I have not seen any security around at night, however the grounds are well lit up.",
            "Great for any student pursuing a degree.",
            "Make popcorn during break.",
            "Devry has a nice eating area at its facility, with vending machines and snacks for your service. There are local restaurants that are easy to access.",
            "Academics are substantial to any other university that you would attend.",
            "At DeVry you can accomplish your goals within a set frame of time.",
            "DeVry University is convenient for adult students who work full time and go can to school after work. Devry has a professional staff to take care of all your needs."
        ]
    ],
    "pageTitle": "DeVry University Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/DeVry-University/reviews?_escaped_fragment_=/show/20476",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 125,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042982745.46/warc/CC-MAIN-20150728002302-00040-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 914371183,
    "recordOffset": 914204231,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{337533=i have been attending devry university online since 2010 and i love it. from the enrollment counselors to the online instructors, they are stupendous. they have plenty of online resources to help you alone the way and the instructors are always a phone call/email away., 588054=DeVry has been my second home since 2009. I met my wife there. DeVry is a University for people that want to succeed in life., 635406=I went to school on campus in 2006 and enjoyed it, now im taking online classes at devry and enjoying them as well. Pretty simple and straight forward, 1090283=I am a 50 year old lady who has been attending Devry University since March 2009. It has been a big struggle but I believe and know that he didn't bring me this far to leave me. I stayed prayed up when the devil tried to bring me down and get me to quit. Now I am at the end of my classes and have to pay for my last class. I don't have a lot of money and need help in order to graduation. This obstacle is standing in my way. I was told i wouldn't have a balance, but after they adjusted my tuition I still have to pay some money. I know I will find away. I graduate in October and it's right around the corner., 182988=I start with this school in 2008 and I am planning to finish my degree here. Great customer service, and all teachers are ready to help with all the questions that arise., 322983=i am 40 years old grow up in a place called east chicago indiana. i had a good childhood life grow up catholic. moved here in 1997 with my daughter to start a new life and been here since. of course i had my ups and downs now adays more down then up. i am excited and scared but eager to start school since i haven't been in school in a long time. i hope to god that i will do well and complete and get my degree to make more money and more responsibility and i hope my daughter falls in my footsteps and age is just a number you can attend school at any time., 489578=Campus security personnel patrol the building on a regular basis (Monday through Friday from 7:00 a.m. to 11:00 p.m. and Saturdays from 7:30 a.m. to 7:00 p.m.) and are alert to any suspicious activity. Security personnel report any possible criminal activity to local law enforcement personnel, and any possible code of conduct violation to the Dean of Students. The Dean of Student Services also acts as the New York City Community Affairs Officer to aid in the monitoring of all crimes that occur on or around campus grounds., 904560=Hi my name is Janette Jordan. With the encouragement and coaching of my inside track coach, John King, I am presently a member of the Delta Upsilon Omega chapter of the Alpha Sigma Lambda Honor Society at DeVry University - Online. I am a 3 quarter student with a 3.8 GPA, in my sophomore year. My expected graduation date is February 2014. I am studying Graphic and Web Design as my Major. I am 47 yrs old with 4 children ages 25, 23, 16, and 9 yrs old. I have 5 grandchildren and 1 on the way. My 25 yrs old has 4 children and my 23 yrs old as 2. I live in Cary, NC. But, I was born and raised in Philadelphia, PA. I moved to Clayton, NC. in 2008. Then moved to Cary, NC. a year later in 2009, then Raleigh, NC in 2011, and back to Cary in 2012. I am presently a CNA and I am employed with Home Care Assistance in Raleigh, NC, working 3rd shift, 44 to 47 hours a week. I am very ambitious and I live life to the fullest, all in the name of my Lord Jesus Christ, whom I love with all my heart. I plan to learn till I can not learn anymore. Imagine that! I live a happy life. And would like to share it with everyone. Excited to be a part of DeVry University. They are helping me to become a success in life in so many ways.}",
    "textBeforeTable": "06/07/2009 Reviewer is Accepted here and planning to attend soon. Reviewer has been to campus. 41 out of 47 people found this review useful. 1 person found this inaccurate. 1 of 678 Terrell from Browns MIlls , NJ Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp =",
    "textAfterTable": "Bang for the buck It is more on the expensive side, but for all the benefits you get it is well worth it. Think of it as an investment in yourself. Login to rate or flag the reviews jessica from Hollywood, FL 07/06/2009 Reviewer is A current student here. 30 out of 32 people found this review useful. 3 of 678 Categories Comments Great for these types of students My first day was amazing I loved it. Tips for prospective students Be yourself, dont be shy and be active. Act mature its your first time to adult hood. Am learning a lot Earn some scholarships Login to rate or flag the reviews James from Sanger, CA 11/19/2010 Reviewer is A current student",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}