{
    "relation": [
        [
            "",
            "3.46",
            "(0.39)"
        ],
        [
            "",
            "-0.23",
            "(1.48)"
        ],
        [
            "",
            "5.67",
            "(0.84)"
        ]
    ],
    "pageTitle": "FRB: Finance and Economics Discussion Series: Screen Reader Version - Incorporating Vintage Differences and Forecasts into Markov Switching Models",
    "title": "Table 2B: Parameters for Current Quarterly Estimates, 1978Q1-2005Q4, Evaluated Using Probabilities Computed from Latest Available Data (Preliminary)",
    "url": "http://www.federalreserve.gov/Pubs/feds/2007/200723/index.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042982745.46/warc/CC-MAIN-20150728002302-00312-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 445010959,
    "recordOffset": 444979019,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{9458=The third application studies a bivariate Markov switching model estimated using GDP and gross domestic income (GDI), following Nalewaik (2007). The application incorporates vintage differences and appends each quarterly time series with forecasts based on higher-frequency indicators such as industrial production or unemployment insurance claims. This application uses real time data to track the performance of the model around the start of the 2001 recession, measuring the incremental impact of including the forecasts in the model. The results confirm that the forecasts do improve the timeliness of the model in recognizing the start of that recession., 15545=This application considers adding forecasts of GDP onto the end of the BEA's officially published time series. For example, at the end of March 1995, the BEA released its \"final\" current quarterly estimate of real GDP growth for 1994Q4. Plenty of data on 1995Q1 was available by the end of that March, so a forecast of 1995Q1 based on that data would likely be reasonably accurate, and a probability of recession estimated using that forecast quite informative. However, in all likelihood, the statistical properties of the forecast will differ from the statistical properties of the officially published data in prior quarters, as the officially published data are based on much more complete information. Assuming no the vintage differences, with for the forecast appended to the officially published time series, the likelihood is as in (3). Tacking on additional forecasts is an option as well - 1995Q2, 1995Q3, etc. The likelihood will be as in (10), with , , if the published time series is appended with forecasts.}",
    "TableContextTimeStampAfterTable": "{77718=The May 2001 \"preliminary\" release brings the BEA's first estimate of 2001Q1 real GDI growth, and its 0.1 value leads all the recession probabilities to jump up dramatically. Smoothed probabilities from the June \"final\" release are similar; these are plotted in the bottom panel of Figure 9. Although these May and June releases bring the first clear evidence of recession whether or not the forecasts are employed, the forecasts allow the model to give a clearer warning signal from January to April. Furthermore, Figure 10 shows probabilities of recession from the September \"final\" release of 2001Q2 data; it is notable that the probability of recession ticks down if we do not employ the forecasts, perhaps leading to some additional doubt about whether or not the economy is in recession. If we employ the forecasts, however, there is little doubt, with estimated probabilities of recession in the first three quarters of the year consistently above 80.11, 90737=Applications focused on a Markov switching model where the U.S. economy, as measured by GDP and its income-side counterpart GDI, switches between recession and expansion. One application shows how to treat differences across vintages of GDP, allowing early-vintage estimates that have not passed through many revisions to have different statistical properties than later-vintage estimates that have passed through a number of revisions. Perhaps more interesting, the techniques outlined here allow estimated probabilities of recession to reflect the information about the state of the economy embedded in forecasts. To do so, the forecasts are simply appended to the end of officially published time series, and the sample period is extended to include those additional periods. The statistical properties of the forecasts are, of course, allowed to differ in an arbitrary way from those of the official data, but to the extent that the forecasts are informative about the state of the economy in the forecast period, their incorporation will improve the accuracy of estimated probabilities of recession. Empirical results bear this out, as an application studying a bivariate model of GDP and GDI shows that the incorporation of forecasts improved the timeliness of the model in signalling that the economy was entering recession in early 2001., 142487=Although the in-sample values from the forecasting regressions over the full sample were not particularly high, ranging from 0.34 to 0.63, Figures 3 to 5 show that the predicted values track the declines in GDP and GDI growth during the recessions in the sample. In addition, with the exception of an episode in mid-1995, these predicted values do not turn down in expansions., 74875=The \"advance\" reading for 2000Q4 real GDP growth released in January 2001 was somewhat weak at 1.4, leading to a probability of recession of about 10 in the basic model with vintage differences but no forecasts. However the real time forecasts for 2001Q1 real GDP and GDI growth were weaker, predicting around-zero growth, as initial claims for unemployment insurance had already started to shoot up and the Business Outlook Survey was extraordinarily weak. The model incorporating these forecasts shows estimated probabilities of recession of 43 in 2001Q1 and 22 in 2000Q4., 48252=Having obtained each current quarterly growth rate of real GDP released by BEA since 1978Q1, my sample starts in that quarter. The two panels of table 1 show estimation results using (11) on the time series available at BEA's release of 2000Q3 and 2005Q4 data.3 Standard errors are below parameter estimates in parentheses. With a fairly short sample, the inclusion of an additional recession can swing around parameter estimates somewhat: the mean growth rate in recessions rises substantially when the relatively mild 2001 recession is included in the sample. Figure 1 shows smoothed probabilities from the second panel, the weights in (11) and (12). For the most part, these line up well with the NBER's start and end dates for recessions.4, 56801=Nalewaik (2007) uses real time data to show that since 1978, the growth rate of gross domestic income (GDI), deflated by the GDP deflator, has done a better job recognizing recessions than has the growth rate of real GDP. That paper recommends a bivariate Markov switching model employing both GDP and GDI; this next application studies such a model, but goes further in accounting for vintage differences in the current quarterly estimates as in application 1, and appending each BEA time series with forecasts as in application 2. Probabilities of recession are computed at different BEA release dates, with the appended forecast employing one of three different information sets depending on whether the release is an \"advance,\" \"preliminary,\" or \"final\"; the information set contains variables typically available at the time of that type of release. The forecasts are for the current quarter only: for example at the time of BEA's \"advance\" current quarterly release of 1994Q4 data - January 1995 - the published time series is appended with a forecast for 1995Q1. These forecasts employ real time data on industrial production, employment, initial claims for unemployment insurance, and the Federal Reserve Bank of Philadelphia's Business Outlook Survey; details of forecast computation are in Appendix B. The predicted values from the forecasts, made at the time of the \"advance,\" \"preliminary,\" and \"final\" releases of the previous quarter's data, respectively, are plotted with \"final\" vintage data in Figures 4 to 6. These forecasts track the business cycle variation in real GDP and real GDI growth reasonably well., 29645=The U.S. Bureau of Economic Analysis (BEA) releases a number of different vintages of quarterly real GDP growth for any given quarter. The first three, the \"advance\", \"preliminary\", and \"final\" current quarterly estimates, are released about a month, two months, and three months after the end of the quarter, respectively. The \"final\" current quarterly estimates then stand until the summer, when the BEA releases an annual revision. Any given quarter is revised at its first three annual revisions (so 1999Q4 is revised at the 2000, 2001 and 2002 annual revisions), and then subsequently at benchmark revisions that occur approximately every five years. These revisions incorporate previously unavailable data to produce improved estimates, and the cumulative magnitude of all the revisions can be sizeable; see Mankiw and Shapiro (1986) and Fixler and Grimm (2002)., 69178=The top panel of Table 4 shows estimation results on the latest available time series as of the BEA's release of 2005Q4 data. The inclusion of real GDI growth in the Markov switching model has interesting effects discussed in more detail in Nalewaik (2007): the mean duration of recessions increases, leading to greater, actually positive, estimated mean growth rates in recessions. Figure 7 plots smoothed probabilities of recession from this model, and the more expansive definition of recessions is evident: the 1980 recession includes most of 1979, the 1990-1991 recession includes most of 1989, and the 2001 recession includes part of 2000 and all of 2002. With these smoothed probabilities as weights, real GDI has a smaller conditional variance than real GDP, and the gap between its high- and low-growth means is larger, implying that GDI is a better indicator of the state of the economy in this model., 75923=Little changes with the BEA's \"preliminary\" 2000Q4 release in February. The BEA's March 2001 \"final\" release brings the first published value of real GDI growth in 2000Q4, an anemic reading of 0.3 growth. The bottom panel of Figure 8 shows smoothed probabilities for this release: the weak value for GDI growth brings the 2000Q4 recession probability computed without forecasts up to about the same level as the probability computed with the aid of the forecasts., 73614=Figures 8-10, show smoothed probabilities of recession at selected BEA data releases around the start of the 2001 recession, computed using real time data and the paper's new estimation techniques. Each graph shows two time series of smoothed probabilities using data from an \"advance\" or a \"final\" release for a quarter, starting with the \"advance\" 2000Q4 release in the top panel of Figure 8. The solid line, in black, shows smoothed probabilities that account for vintage differences but employs no forecasts of GDP or GDI or its components. In \"advance\" releases where GDI is unavailable, the probability of recession for that quarter is updated with respect to GDP alone using the two-stage updating procedure described in Nalewaik (2007). The dashed line in blue shows smoothed probabilities that account for vintage differences and employ the forecasts as well, extending the time series forward one additional quarter.10 To get a better sense of the timing involved here, written in the label for each time series is the month when that data release occured., 76531=Moving to Figure 9, the April 2001 release of \"advance\" 2001Q1 real GDP growth, 2.0, adds little information about whether or not the economy is in recession. The 2001Q2 forecasts for GDP and GDI growth of 1.2 and 1.4 are weaker, though again they do not give an unambiguous signal of recession: the 2001Q2 probability of recession from the model with forecasts is 54, and the smoothed 2001Q1 probability is 45, compared to the 27 probability of recession computed without the forecasts., 52929=The staff of the Board of Governors of the Federal Reserve System produces its Greenbook forecasts of important economic aggregates before each of the eight meetings of the Federal Open Market Committee each year. These Greenbook forecasts have been released to the public through the end of 2000 as of the writing of this paper; this application analyzes the second Greenbook forecast produced each quarter, typically produced before FOMC meetings in March, June, September and December.5 The top panel of Figure 2 plots the Greenbook forecast for the current quarter, the dashed green line, with the \"final\" estimate of GDP growth rate for that quarter, typically released by BEA about three months later.6 The first panel of table 3 shows parameters estimated as in (12), with smoothed probabilities computed from the univariate GDP model using the time series available with the \"final\" 2000Q3 release. Comparing with the first panel of table 1, the mean growth rate in expansions is underestimated somewhat, but the mean growth rate in recessions is quite accurate, and the conditional variance is smaller than the conditional variance of GDP growth., 54396=The second panel of Figure 2 shows one-quarter ahead Greenbook forecasts plotted again with the \"final\" growth rates (the one-quarter ahead forecast for 1995Q2 is reported in the March 1995 Greenbook, for example); the moments of these forecasts are shown in the second panel of Table 3. These one-quarter ahead forecasts pick up a considerable amount of business cycle variation in real GDP growth. The two- and three-quarter ahead forecasts are plotted in Figure 3, with estimated moments in the last two panels of Table 3. As expected, the gap between the recession and expansion mean growth rates diminishes at longer forecast horizons, as it becomes more difficult to forecast the state of the economy farther into the future. As this gap between the mean growth rates converges to zero, the updating (9) converges to no updating at all, as the forecasts are not informative about the future state of the world. To the extent that these forecasts are informative, though, the accuracy of the estimated probability of recession for the current quarter will be improved by smoothing using the information in forecasts for future quarters. So even if the goal is simply to estimate the probability of recession for the current quarter as accurately as possible, as opposed to estimating probabilities of recession for future quarters, forecasts may be informative. However it is clear from these tables that when appending published time series with forecasts several quarters ahead, the differential information content of the forecasts vis-a-vis official data needs to be taken into account when computing probabilities., 137838=Some components of GDI are missing in some BEA releases; before proceeding to the forecasts, this Appendix discusses computation of the predicted values for these missing components. Corporate profits is missing in the \"advance\" releases and fourth-quarter \"preliminary\" releases; to predict these, a time series consisting of the growth rates of \"final\" vintage corporate profits is regressed on the appropriate vintage (either \"advance\" or \"preliminary\" depending on which set of missing values we are trying to fill) of other available components of GDP and GDI.12 These explanatory variables are the growth rates of private consumption of fixed capital, and a couple of other cyclically sensitive variables - residential investment and personal consumption expenditures for durable goods.13 Since 1992, net factor income from abroad has been missing in the same releases as corporate profits, and from 1992 to 2002 net interest is missing in these releases as well. Predicted values for these two variables are computed in the same way in a similar fashion; for net factor income the explanatory variables are taxes on production and imports less subsidies and two lags of net factor income (\"final\" vintage), and for net interest the explanatory variables are one of its lags and employee compensation growth. These regressions are obviously somewhat ad hoc, and are just meant to be a rough attempt to fill in the missing data., 29247=The first two applications considered below show estimation results using (8), and the third application shows estimation results and a sequence of smoothed probabilities around the start of the 2001 recesssion, using (9) and the algorithm of Kim (1994).}",
    "lastModified": "Wed, 06 Jun 2007 17:25:30 GMT",
    "textBeforeTable": "Applications focused on a Markov switching model where the U.S. economy, as measured by GDP and its income-side counterpart GDI, switches between recession and expansion. One application shows how to treat differences across vintages of GDP, allowing early-vintage estimates that have not passed through many revisions to have different statistical properties than later-vintage estimates that have passed through a number of revisions. Perhaps more interesting, the techniques outlined here allow estimated probabilities of recession to reflect the information about the state of the economy embedded in forecasts. To do so, the forecasts are simply appended to the end of officially published time series, and the sample period is extended to include those additional periods. The statistical properties of the forecasts are, of course, allowed to differ in an arbitrary way from those of the official data, but to the extent that the forecasts are informative about the state of the economy in the forecast period, their incorporation will improve the accuracy of estimated probabilities of recession. Empirical results bear this out, as an application studying a bivariate model of GDP and GDI shows that the incorporation of forecasts improved the timeliness of the model in signalling that the economy was entering recession in early 2001. This paper outlines techniques to account for differences between the statistical properties of different time series observations, in the context of the class of Markov switching models discussed in Hamilton (1994). It focuses on the case where a",
    "textAfterTable": "--> 4.05 -1.41 7.60 0.95 0.73 1.00 (0.38) (1.52) (1.23) (0.03) (0.18) (1.55) Table 1B: Real Time Estimates of Markov Switching Model for GDP, 1978Q1-2005Q4 3.91 -0.40 7.04 0.95 0.76 1.00 (0.45) (1.47) (1.06) (0.03) (0.16) (1.55) Table 2A:",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}