{
    "relation": [
        [
            "Categories",
            "What to do for fun",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "go to the beach, or try to find a party at san diego state university",
            "stay on top of homework or you will fall behind quickly. look at the website http://www.ratemyprofessors.com/ to make sure that you get a teacher that matches your learning style.",
            "the classes are smaller than that of a four year institution. easy to get from class to class. teachers can be very personable."
        ]
    ],
    "pageTitle": "Grossmont College Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Grossmont-College/reviews?_escaped_fragment_=/show/86913",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042982745.46/warc/CC-MAIN-20150728002302-00279-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 894505091,
    "recordOffset": 894420458,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{198474=Grossmonts academic rigor is not as challenging as many Colleges. One thing grossmont knows is that many students are coming from high school, which means they are not used to hard work. Grammar is not a big deal, engagement is not a must, an most difficult classes allow curves which help out on transcripts but not as a student., 84561=the food and dining has changed a lot since i first started. i started school at grossmont college in the fall of 2005. things were not as they are now. they have recently remodeled and constructed a new cafeteria. but more than that, they have created a student center where students are able to go get food and still study. this new student center allows students in the food court to feel like they are home., 70371=As an out of state student tuition is of course a bit more expensive for me; however, I really can not complain. As a Veteran I will pay close to $2500 out of my pocket for 12 credit hours. I feel satisfied with the cost especially with the new campus being built., 262134=For only $1500 a semester, this is an amazing institution to start off at. The professors here are just as good at San Diego State and other big campuses, and a lot of the time work at different universities as well., 501810=© 2015, Cappex.com, LLC}",
    "textBeforeTable": "07/08/2009 Reviewer is A current student here. 10 out of 10 people found this review useful. 1 of 130 Grossmont Student Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new",
    "textAfterTable": "Am learning a lot Many of the teachers at Grossmont also teach at local schools like San Diego State. Login to rate or flag the reviews Autumn from Apollo Beach, FL 07/02/2009 Reviewer is A current student here. 3 out of 3 people found this review useful. 2 of 130 Categories Comments Great for these types of students student who think the four year universities might be overwhelming and for those who aren't sure if school is what they want to do. Tips for prospective students register for your classes as soon as registration opens classes go really fast Am learning a lot certain teacher will teach you more than you expect and then there are some that are just there to be funny . Login to rate or flag the reviews",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}