{
    "relation": [
        [
            "Patent application number",
            "20100076576",
            "20100178938",
            "20100225773",
            "20100267331",
            "20100268360",
            "20100269145",
            "20140148110",
            "20150056917"
        ],
        [
            "Description",
            "SYSTEMS, METHODS, AND DEVICES FOR PROVIDING BROADCAST MEDIA FROM A SELECTED SOURCE - A media device including a broadcast receiver that receives media from a broadcast source via a broadcast radio signal and a radio signal sensor that measures a signal characteristic of the received broadcast radio signal. The media device also includes a data transceiver that i) requests and retrieves a network address of a media server which provides the media via a network signal from a data network, ii) establishes a data connection with the media server, and iii) receives the media via the network signal from the media server. The media device further includes a selector that i) selects the broadcast radio signal when the signal characteristic satisfies a selection standard and ii) selecting the network signal when the signal characteristic does not satisfy the selection standard. The media device also includes a user interface that provides at least one of an audio and visual output based on the selected signal.",
            "SYSTEMS AND METHODS FOR CUSTOMIZING RADIO PRESETS - Systems and methods are provided for customizing radio presets. The radio presets can be customized based on one or more of geographic location and user preferences. For example, radio presets bookmarking particular radio frequencies can be associated with a particular location. When a user device is in the particular location, the associated radio frequencies can be used to populate “hot keys.” In some embodiments, if radio presets are not available for a particular location, recommended radio presets can be determined by, for example, comparing radio station information with user preferences. This radio station information can include, for example, a listing of available radio stations, the genre of these radio stations, and radio station names. User preferences can include, for example, preferred songs, preferred radio stations, preferred radio shows, and preferred genres. Recommended radio presets can be determined by identifying available radio stations that match the user preferences.",
            "SYSTEMS AND METHODS FOR CENTERING A PHOTOGRAPH WITHOUT VIEWING A PREVIEW OF THE PHOTOGRAPH - Systems and methods are providing for capturing images of objects or faces without previewing the image to be captured. In particular, systems and methods are provided for using a detection algorithm to determine when a camera lens of an electronic device is properly oriented to capture an item (e.g., a face in a self-portrait). The detection algorithm can be configured to identify specific faces or objects, and can direct the electronic device to automatically store a captured image in response to detecting objects or faces of interest. In some embodiments, a motion-sensing component can be used to help align the lens.",
            "IDENTIFYING RADIO STATIONS OF INTEREST BASED ON PREFERENCE INFORMATION - Systems and methods are provided for providing recommended radio stations to a user. In particular, an electronic device can compare media from a locally stored or accessed media library with media items provided as part of radio streams received by the device. The electronic device can identify the radio streams having the most media items overlapping with the local library, and recommend those streams as being most likely to be of interest to the user. The electronic device can further access a remote database of a large number of users' libraries, and receive recommendations based on the media items common to the user's library, other users' libraries, and radio broadcasts. This approach allows the electronic device to provide recommendations without requiring any monitoring of the user's listening habits or receiving preference information from the user.",
            "SEAMLESS SWITCHING BETWEEN RADIO AND LOCAL MEDIA - Systems and methods are provided for seamlessly switching media playback between a media broadcast, such as a radio broadcast, and media from a local media library. When an electronic device determines that an upcoming media item in a media broadcast is not of interest to a user, the electronic device can switch playback from the media stream to a media item from the electronic device local library. The selected local media item can be related to a previously broadcast media item to ensure continuity in the user's listening or viewing experience. The electronic device can switch away from the local media item and return to the media stream when the media stream again broadcasts media items or segments of interest to the user.",
            "ACCESSING RADIO CONTENT FROM A NON-RADIO SOURCE - Systems and methods are provided for accessing broadcast media items and segments from non-broadcast sources. In response to detecting that a user has not finished listening to a broadcast segment (e.g., a radio segment), an electronic device can automatically identify and access an alternate, non-broadcast source for the same broadcast segment (e.g., a corresponding podcast episode). Using the electronic device, a user can play back the segment from the non-broadcast source, starting playback at the last position of the broadcast segment when the user stopped listening to the broadcast. In some embodiments, the electronic device can update library counts (e.g., play counts and new/not new tags) based on media items and segments played back as part of a media broadcast.",
            "ACCESSING RADIO CONTENT FROM A NON-RADIO SOURCE - Systems and methods are provided for accessing broadcast media items and segments from non-broadcast sources. In response to detecting that a user has not finished listening to a broadcast segment (e.g., a radio segment), an electronic device can automatically identify and access an alternate, non-broadcast source for the same broadcast segment (e.g., a corresponding podcast episode). Using the electronic device, a user can play back the segment from the non-broadcast source, starting playback at the last position of the broadcast segment when the user stopped listening to the broadcast. In some embodiments, the electronic device can update library counts (e.g., play counts and new/not new tags) based on media items and segments played back as part of a media broadcast.",
            "MEDIA DEVICE WITH ENHANCED DATA RETRIEVAL FEATURE - A personal media device including a broadcast receiver that receives broadcast media and broadcast media data from a broadcast source where the broadcast media data includes a media identifier associated with the broadcast media. The media device also includes a data transceiver that sends a retrieval request to a media server for enhanced media data where the retrieval request includes the media identifier and receives the enhanced media data via a wireless data channel. The media device further includes a processor that performs a media device operation in response to the received enhanced media data."
        ],
        [
            "Published",
            "03-25-2010",
            "07-15-2010",
            "09-09-2010",
            "10-21-2010",
            "10-21-2010",
            "10-21-2010",
            "05-29-2014",
            "02-26-2015"
        ]
    ],
    "pageTitle": "Lee, Sunnyvale - Patent applications",
    "title": "",
    "url": "http://www.faqs.org/patents/inventor/lee-sunnyvale-4/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042982745.46/warc/CC-MAIN-20150728002302-00192-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 448359023,
    "recordOffset": 448328025,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Jeffery Lee, Sunnyvale, CA US 01-19-2012 Photoluminescence Spectroscopy - This invention relates to temperature-corrected photoluminescence spectroscopy which may be applied to semiconductors and, in particular, photovoltaic films. 20120012756 Published Description Patent application number Janice C. Lee, Sunnyvale, CA US //]]> BarDraw('2545912',['Patent applications by Jaebock Lee, Sunnyvale, CA US'],[[1,2,2,3]],['2006','2008','2011','2014'],0); // <script type=\"text/javascript\"> </div> <div id=\"legend2545912\" align=\"center\"></div> </div> <canvas id=\"bg2545912\" style=\"max-width: 500px; width: 100%;\"></canvas> <div> <p align=\"center\">Patent applications by Jaebock Lee, Sunnyvale, CA US</p> <div class=\"bar2545912\" style=\"max-width: 500px; width: 100%; float:left; \"> <div align=\"left\" style=\"padding-top:20px;\"> </table> </tbody> </tr> <td>06-12-2014</td> <td><a href=\"/patents/app/20140164331\">TECHNIQUES FOR BACKUP RESTORE AND RECOVERY OF A PLUGGABLE DATABASE</a> - A container database stores redo records and logical timestamps for multiple pluggable databases. When it is detected that a first read-write instance of the pluggable database is opened and no other read-write instances of the pluggable database are open, offline range data associated with the pluggable database is updated. When it is detected that a second read-write instance of the pluggable database is closed, and the second read-write instance is the last open read-write instance, the offline range data associated with the pluggable database is updated. The pluggable database is restored to a logical timestamp associated with a restore request based on the offline range data.</td> <td>20140164331</td> <tr> </tr> <td>04-03-2014</td> <td><a href=\"/patents/app/20140095546\">COMMON USERS, COMMON ROLES, AND COMMONLY GRANTED PRIVILEGES AND ROLES IN CONTAINER DATABASES</a> - Techniques for common users and roles, and commonly-granted privileges and",
    "textAfterTable": "Patent applications by Jeffery Lee, Sunnyvale, CA US Jeffery T. Lee, Sunnyvale, CA US Patent application number Description Published 20090064039 List item layouts system and method - A method of displaying list items is provided that includes defining a plurality of list items, defining a plurality of layouts, and linking each list item to a layout such that each layout can be linked to one or more list items. An electronic device is provided that includes a display and a user interface configured to display lists on the display, wherein the items of the lists are formatted based on a limited number of layout types such that the items having similar components share a common layout type. A user interface for an electronic device is also provided that includes a plurality of list items having properties defined by a layout, wherein each layout defines the properties for one or more list items and is stored in an object. 03-05-2009 20090064202 SUPPORT LAYER FOR ENABLING SAME ACCESSORY SUPPORT ACROSS MULTIPLE PLATFORMS - A support layer for enabling same accessory support across multiple platforms may be provided for supporting interactions of applications, operating systems, and accessory devices. Cross-platform use",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}