{
    "relation": [
        [
            "Rank",
            "Force Push",
            "Force Whirlwind",
            "Force Wave"
        ],
        [
            "Prerequisites",
            "Level 1",
            "Level 9",
            "Level 15"
        ],
        [
            "Effect",
            "Target is thrown, stunned, and takes damage Save versus reflex: No stun, half damage",
            "Target is trapped in a vortex, takes damage; other enemies are pushed away Save versus reflex: No immobilization or damage, but other enemies are still pushed",
            "All nearby enemies are repelled, take damage, and are stunned Save versus reflex: No stun, half damage"
        ]
    ],
    "pageTitle": "Star Wars: Knights of the Old Republic Walkthrough - GameSpot",
    "title": "",
    "url": "http://www.gamespot.com/articles/star-wars-knights-of-the-old-republic-walkthrough/1100-6084905/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042982745.46/warc/CC-MAIN-20150728002302-00327-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 467381595,
    "recordOffset": 467205626,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Note that flurry is only good for one extra attack per turn; if you use two weapons at once, the weapon in your main hand will be granted the extra attack, so that you'd have a total of three attacks during a round. However, you can combine flurry with Force speed to gain even more attacks, so that a character with two weapons, master flurry, and master Force speed will have an incredible five attacks per round. Flurry is the active combat feat to increase to its highest rank. At low levels, you'll want to have your character pursue passive feats that are always active, but when you begin looking for a useful active feat, this is the one that you'll almost always want to max out. Critical strike has its uses, but the defense penalty is a tremendous drawback, while power attack is, well, fairly useless in most cases. Flurry is just plain better than either of those feats when you compare all of them at their highest ranks. More attacks is a surefire way of increasing the rate that you deal out damage, and the attack penalty at the second and third ranks is negligible, as is the defense penalty. Once you hit the third rank, especially, you will be able to essentially replace your regular attack with a queue full of flurries. Sometimes quantity counts more than quality; at least, that's the premise behind flurry, which",
    "textAfterTable": "First Rank Level 1 Two attacks per round, both at -4 attack; -4 defense for three seconds Improved Rank Level 4 Two attacks per round, both at -2 attack; -2 defense for three seconds Master Rank Level 8 Two attacks per round, both at -1 attack; -1 defense for three seconds Power Attack If you're using a melee weapon, then power attack can greatly increase the damage a successful strike dishes out, but it unfortunately reduces your attack bonus, rendering said strikes more difficult to accomplish. This is of minor use against powerful opponents, against whom you will need as high a chance to hit as possible, but against less significant foes, the extra damage can end skirmishes quickly. Note that there are diminishing returns as you add a third rank to this skill; if you find that the improved rank helps you kill foes quickly enough, you might want to save your feat point for something more utilitarian. Prerequisites Effect First Rank Level 1 +5 damage per hit; -3 attack penalty Improved Rank Level 4 +8 damage per hit; -3 attack penalty Master Rank Level 8 +10 damage per hit; -3 attack penalty Power Blast Power blast is essentially the same as power attack, except that it can only be",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}