{
    "relation": [
        [
            "Name of Provision",
            "Pwll PRU",
            "",
            "2nd PRU (Location TBC)",
            "",
            "KS4 Project Programme"
        ],
        [
            "Type",
            "PRU",
            "",
            "PRU",
            "",
            ""
        ],
        [
            "Headteacher",
            "Mr P Williams",
            "",
            "Mr C Aplin",
            "",
            "TBC"
        ],
        [
            "Nature of Provision",
            "KS3",
            "",
            "KS3",
            "",
            "TBC"
        ],
        [
            "Capacity",
            "21",
            "",
            "21",
            "",
            "TBC"
        ],
        [
            "Gender",
            "Mixed",
            "",
            "Mixed",
            "",
            "TBC"
        ],
        [
            "Res/Day",
            "Day",
            "",
            "Day",
            "",
            "TBC"
        ],
        [
            "Contact Tel & Email",
            "01554 773548 pawilliams@carmarthenshire.gov.uk",
            "",
            "TBC",
            "",
            "TBC"
        ]
    ],
    "pageTitle": "Report - Education and Children's Services Scrutiny Committee Task and Finish Group - Review of Aspects of the Special Educational Needs Service and Social Care Provision for Children with Disability",
    "title": "",
    "url": "http://online.carmarthenshire.gov.uk/agendas/eng/EXEB20080722/REP03_01.HTM",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042982745.46/warc/CC-MAIN-20150728002302-00243-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 188349235,
    "recordOffset": 188311506,
    "tableOrientation": "VERTICAL",
    "TableContextTimeStampAfterTable": "{86445=6.8.2 It reviewed the findings of Special Needs Advisory Partnership, SNAP Cymru,9 Annual Report on Carmarthenshire Services 2007/08. SNAP Cymru reports on the key issues arising from service users who have contacted it (207 last year) and found that:, 30837=Ø The Inclusion and Integrated Disability Service net budget for 2008/09 is £7.0m (see para 6.3.2), 135984=01267 245300, 121619=01267 290517, 29652=6.2.4 Carmarthenshire is also the highest user in Wales of Direct Payments for children, currently made for 30 children; another 2 have been approved but are waiting for the contracts to be returned by the parent/carer. Direct payments range from 3.5 to 20 hours a week and the current projected cost for 2007/08 is £116,000., 67985=6.5.1 The National Service Framework, (NSF) for Children, Young People and Maternity Services in Wales, published in 2005, sets out the quality of services that, children, young people and their families have a right to expect and receive in Wales. There is a specific standard dealing with transitions which states:, 151258=6 The Complex Needs Panel is a multi-agency panel based on the Placement of Children in Wales 2007 Regulation, chaired by the Head of Children’s services which oversees requests for multi-agency funding and out of county placements., 98319=There is a projected co- location at St David’s Park, Carmarthen in 2009., 116604=01554 776168, 14923=5.7 It also invited the participation of the Director of Social Care and Housing, Bruce McLernon, who has led a review of Adult Learning Disabilities in 2007, to discuss the transition stage from childhood to adulthood., 21259=6.1.6 The Authority has already some experience of integrated team working through the long established Family Support Team within the social care provision. This team, which works with children with disabilities, was set up to meet the needs of children with a learning disability. Over the years the team has increased its involvement with children with learning and physical disabilities as well as children with complex health needs. In 2006/7 new eligibility criteria were agreed that reflected its wider remit. The learning from this team has contributed to the wider thinking about integration., 134857=01239 710447, 98580=In summer 2007 two additional specialist clubs were piloted at Llanelli and Carmarthen - 44 children with complex needs attended., 40259=6.3.4 Statementing or Statutory Assessment of Special Educational Needs: Statementing funding provides complementary resources for meeting the needs of pupils with the most complex needs. A statutory assessment or statement of need can be made under the Education Act 1996., 119347=01267 290444, 38626=R4: To review and report to the Education and Children’s Services Scrutiny Committee the progress made with the approach of focusing on pupil progress and their linked level of support in three years time, when the Children and Young People Plan 2008-11 is due to be reviewed (Medium term), 104059=01267 232626, 30650=6.3.1 The total of resources available to meet additional learning needs in 2008/09 is approximately £13.168m, which comprises:, 145309=The Complex Needs Panel is a multi-agency panel based on the Placement of Children in Wales 2007 Regulation, chaired by the Head of Children’s services which oversees requests for multi-agency funding and out of county placements., 47867=6.4.2.1 The Authority has obtained substantial funding from the WAG of £720,000 to develop a new regional Hub for children and young people with SEN at the Queen Elizabeth High School in Carmarthen. The Group visited the site which is due to open in September 2008. Although the development was not complete at the time of the visit, the Group was impressed by the range of facilities which will be available for children and young people with a large range of needs., 111766=01267 238298, 61783=6.4.6.7 Staff raised concerns to the Group members about the new regional SEN Hub being developed in QE High School, Carmarthen, (which is discussed in para 6.4.2) and its impact on Whitemill Unit. The new Hub is due to open in September 2008 and it is not intended to make any new placements into Whitemill Unit. Parents will be able to transfer their children to the new Unit although they can keep their children at Whitemill Unit if they prefer., 139215=01554 773548, 9034=2.3 At its meeting in November 2007, the Education and Children’s Services Scrutiny Committee therefore resolved to establish a Scrutiny Task and Finish Group to review this area., 66182=R11: To include the special schools and all specialist units in the school stock condition survey to be undertaken in 2008/09 and to prioritise the refinement and renewal of the current specialist provision within the Modernising Education Programme. (Medium term/ Financial Implications), 28571=6.2.3 The Group found, as can be seen above, that there are good levels of respite care within the Service in relation to the rest of Wales (119 children and families supported during 2006/07). Carmarthenshire is the biggest provider of respite care to children in wales. Not only does this have a beneficial effect in helping to keep families and children with disabilities together, it also has a financial benefit as evidenced by the low numbers of children in residential care and out of county placements. The 2006/07 annual performance evaluation of the Council’s social services also commented that the relatively low numbers of looked after children in the county were due to the investment in respite and family support services. The Group noted that these services are discretionary and not statutory services, but the “invest to save” evidence means they form a priority for service efficiency and effectiveness. Without these services the cost to the department of the long term care for children would be more., 102814=01269 592356, 66585=6.4.10 The Group felt that the site visits had been immensely beneficial as it had been able to experience the excellent care and support given to the children and young people it had seen. It witnessed the dedication of staff at all units and their commitment to providing the best possible care for the children and young people who attend. It also provided an opportunity to assess elements of the current provision and identify necessary improvements. The Group felt that an induction and development programme for key aspects of Education and Children’s Services, including relevant visits, would be of great benefit for future members of the main Scrutiny Committee and all members, in their role as corporate parents., 100968=Protocols have been established and circulated for consultation end of 2007. These are currently being re-circulated for final approval by the end of March 2008., 23968=6.1.10 Recommendation:, 10937=5.2 The Group held its first meeting in November 2007 at which it discussed the scope of the review. It recognised that the scope of learning and care services for children with disabilities was complex and extensive, and that the integration of services had only just begun. It agreed that, given the limited timescales available to do this body of work, this review would highlight areas that would need further investigation as the integration of services progresses., 19613=6.1.5 The Wales Assembly Government (WAG) intends making changes to statutory education assessment which are expected to be in place by 2012. In anticipation of these changes, the Service is seeking to develop a more integrated approach to assessment, planning, intervention and review in order to:, 39029=6.3.3.7 The Authority’s two special schools are funded differently. The delegated budget (£2.668m for 2008/09) is based on the planned number of pupil places or capacity of the school, as well as on pupil teacher ratios for different aspects of SEN. Whilst delegated funding for the two special schools in the county is the second highest in Wales (£20,292 per pupil compared to £15,156 Welsh average 2006/07), it does not take account of any oversubscription. Heol Goffa is currently slightly oversubscribed (see para 6.4.4.5) but its delegated budget has not been increased accordingly, which has an obvious impact on its capacity to support additional pupils attending., 129949=01269 841322, 26079=6.2.1 The Group found that Carmarthenshire is doing reasonably well in terms of meeting special educational needs, as evidenced by the benchmarking data 2006/07. It is the:, 36798=6.3.3.3 To support schools an Inclusion Handbook for schools was developed and introduced in 2004, establishing what schools should be doing for themselves and setting standards for the complimentary services (e.g. Educational Psychology, Advisors including Advisory Teachers) provided by the Authority. The Handbook emphasises the need for schools and the LEA to work in partnership and make the use of this funding clear and specific. This would help the planning of appropriate use of internal resources, monitoring of its effectiveness and meeting the needs of pupils with additional needs., 13674=Ø The new QE High School Regional SEN Unit, due to open September 2008, 82266=6.7.2 This Authority has been recognised as taking a lead in the area of disability discrimination requirements in relation to schools. The Local Education Authority (LEA) has now a duty to develop an accessibility strategy and each school has a duty to develop a detailed accessibility plan showing how children with disabilities are able to gain access to opportunities as well as a Disabilities Equalities Scheme. It is unclear what the timescales are for this, however the LEA is working to show how children, staff, parents and members of the community will have their disability equalities needs met. The school accessibility plans and Disabilities Equalities Scheme are to be revised in 2010., 126804=01554 759465, 30041=6.2.5 A multi-agency review of Services for Disabled Children and Children with Complex Health Needs was conducted during 2006/07. This involved Carmarthenshire County Council, Local Health Board and Trust and considered how many children were included in this client Group, what services were being provided, client views of the current provision as well the cost of the services. An action plan was developed and progress against the key actions is noted in Appendix 1., 131277=01558 823477, 124019=8 Jun, 145943=The Community Care Direct Payments Act 1996 and subsequent legislation allowed Local Authorities to make cash payments to disabled people, the parents of disabled children and carers in lieu of services. This means that once the client has been assessed by our social work staff as needing a service, and meets the criteria for Direct Payments, they can choose to have a cash payment and arrange their own services. Direct Payments can offer more choice, control and flexibility to people who would otherwise have to rely on others to arrange and provide their care and assistance., 83002=6.7.3 The county’s school buildings have particular problems in that many are old and in poor repair. Many schools have inadequate access and facilities. The LEA has prepared a Schools Asset Management Plan but this is intended for review and updating by December 2008., 7738=2.2 Since 1975 the number of children with a disability (an impairment of a substantial and permanent nature) has risen by 62% to approximately 772,000 (or 7% of children) in England and Wales. This equates to approximately 2000 school age children in this county. There is a need to provide the best possible care for such children and to recognise that every child has the right to achieve his or her potential in life. It is also vitally important to support the families or carers of children with disabilities. The recent Joint Review praised the emphasis given in this county to family support, particularly the comparatively large amount of respite care given, however the service operates in a heavily legislated area and must meet its statutory duties. Members of this Committee have for sometime expressed concerns about the potential for financial pressures to restrict or even reduce the amount of discretionary family support services given in the county. Education and Children’s Services are integrating in this Authority. There have been initial and self-evident gains, however the potential to enhance services for children with disabilities and their families through this integration will only be realised over the next three years., 150675=4 The WAO July 2007 Report “Good Practice in SEN Funding” highlights the unreliability and inadequacy of the current data collated by the Wales Assembly Government in relation to SEN expenditure, which does not provide a robust basis for comparison., 85306=6.7.8 There is a £750k budget for adaptations in 2008/09 as well as some funds not spent last year, which have been carried forward. A capital budget of £500k for school adaptations has been established up until 2010/11, however this will need to be reviewed as the Accessibility Strategy is developed, 142009=A Carer’s Account: December 2007, 14726=5.6 During the course of the review the Group referred to a multi-agency review of services for children with complex needs which was completed in January 2007., 133759=01269 833900, 24497=6.1.11 A Partnership Approach: The Group recognises the importance of working in partnership within this service area. The aim of the overarching Education and Children’s Service is to work with health services and the voluntary sector to provide coherent services for children and their families. This is evidenced within the Children’s and Young People Plan 2008-2011 which is currently in the process of being finalised. The approach to the provision of services is also to partner with parents; to consult and gather their views, as well as the views of their children, in order to tailor services to meet parents’ and their children’s needs wherever possible. A key element in this approach is to offer parental choice. Parental choice is where parents are given the opportunity to consider a number of ways in which their child’s needs could be met and so make an informed choice within the resources available. This will include making the option of access to mainstream education available to parents of children with even the most complex needs. Wherever reasonable the Service will endeavour to support them in making such choices a reality., 105321=01554 759 465, 25720=6.1.12 The development of parental choice will mean that many more children and young people will have their needs met in mainstream schools, wherever possible, or in a nearby specialist teaching and learning centre as part of a mainstream school closer to home., 16983=6.1.3 Social care and learning services for children with disabilities have now been integrated into a new service, the Inclusion and Integrated Disability Service. The integrated service formally came into being on January 1st 2008 and brought together the realms of:, 99166=Funding has been gained for British Sign Language training for more inclusion of hearing impaired and profoundly deaf children for 2008., 99012=A bespoke Group has been set up for those with Aspergers Syndrome for Duke of Edinburgh 2007/2008 - 12 children attend., 67354=6.4.11 Recommendation:, 137090=01269 593398, 98881=Funding has been provided for After School pilots at Ammanford, Carmarthen and Llanelli for 2008., 151073=5 Statutory Assessment and Statements of SEN: In need of Review? Audit Commission 2002, 106530=01267 231171}",
    "lastModified": "Mon, 28 Jul 2008 12:53:36 GMT",
    "textBeforeTable": "TABLE OF CONTENTS",
    "textAfterTable": "6.8 CONSULTATION RESULTS 28 7.0 CONCLUSION 30 APPENDIX 1: MULTI-AGENCY ACTION PLAN OF SERVICES FOR DISABLED CHILDREN AND CHILDREN WITH COMPLEX NEEDS 32 APPENDIX 2: LIST OF SPECIALIST PROVISION WITHIN THE COUNTY 33 APPENDIX 3: A CARER’S ACCOUNT 41 GLOSSARY OF TERMS 43 1.0 CHAIR’S FOREWORD It gives me great pleasure to present the final report and recommendations of the Education and Children’s Scrutiny Committee Task and Finish Group that has investigated learning and care services for children and young people with additional learning needs, disabilities and complex needs. These services have recently been integrated and are subject to increasing demand and budgetary pressures. The Group’s overarching objective has been to identify how these services should be developed to meet the needs of children and young people as well as their families and carers. Much work has been done in recent years to increase accessibility to services locally and the Group has been able to identify areas of good practice, as well as issues that require further development. On behalf of the Group, I would like to emphasize that its conclusions and recommendations have been agreed by all members involved,",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}