{
    "relation": [
        [
            "",
            "Timothy R. Baer",
            "Michael R. Francis",
            "John D. Griffith",
            "Beth M. Jacob",
            "Jodeen A. Kozlak",
            "Troy H. Risch",
            "Douglas A. Scovanner",
            "Terrence J. Scully",
            "Gregg W. Steinhafel",
            "Kathryn A. Tesija"
        ],
        [
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            ""
        ],
        [
            "",
            "Executive Vice President, General Counsel and Corporate Secretary since March 2007. Senior Vice President, General Counsel and Corporate Secretary from June 2004 to March 2007.",
            "Executive Vice President and Chief Marketing Officer since August 2008. Executive Vice President, Marketing from January 2003 to August 2008.",
            "Executive Vice President, Property Development since January 2005.",
            "Executive Vice President and Chief Information Officer since January 2010. Senior Vice President and Chief Information Officer from July 2008 to January 2010. Vice President, Guest Operations, Target Financial Services from August 2006 to July 2008. Vice President, Guest Contact Centers, Target Financial Services from September 2003 to August 2006.",
            "Executive Vice President, Human Resources since March 2007. Senior Vice President, Human Resources from February 2006 to March 2007. Vice President, Human Resources and Employee Relations General Counsel from November 2005 to February 2006. From June 2001 to November 2005 Ms. Kozlak held several positions in Employee Relations at Target.",
            "Executive Vice President, Stores since September 2006. Group Vice President from September 2005 to September 2006. Group Director from February 2002 to September 2005.",
            "Executive Vice President and Chief Financial Officer since February 2000.",
            "President, Target Financial Services since March 2003.",
            "Chief Executive Officer since May 2008. President since August 1999. Director since January 2007. Chairman of the Board since February 2009.",
            "Executive Vice President, Merchandising since May 2008. Senior Vice President, Merchandising, from July 2001 to May 2008."
        ]
    ],
    "pageTitle": "",
    "title": "",
    "url": "http://www.wikinvest.com/stock/Target_(TGT)/Filing/10-K/2010/F46621279",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042981856.5/warc/CC-MAIN-20150728002301-00182-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 837852935,
    "recordOffset": 837735512,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{1166419=Due fiscal 2015-2019, 975364=        Advertising costs are expensed at first showing or distribution of the advertisement and were $1,167 million in 2009, $1,233 million in 2008, and $1,195 million in 2007. Advertising vendor income that offset advertising expenses was approximately $130 million, $143 million, and $123 million 2009, 2008, and 2007, respectively. Newspaper circulars and media broadcast made up the majority of our advertising costs in all three years., 242947=        The sole purpose of this Amendment No. 1 to the Annual Report on Form 10-K for the fiscal year ended January 30, 2010, as originally filed with the Securities and Exchange Commission on March 12, 2010, is to correct the number of shares of Common Stock outstanding at March 10, 2010 reported on the cover page., 241085=1.    Portions of Target's Proxy Statement to be filed on or about April 29, 2010 are incorporated into Part III., 643123=        Our effective income tax rate for 2008 was 37.4 percent compared with 38.4 percent in 2007. The decrease in 2008 was primarily due to tax reserve reductions resulting from audit settlements and the effective resolution of other issues. The 2008 effective income tax rate was also lower due to a comparatively greater proportion of earnings subject to rate differences between taxing jurisdictions. These rate declines were partially offset by lower capital market returns on investments used to economically hedge the market risk in deferred compensation plans. Gains and losses from these investments are not taxable., 1141061=        Trade letters of credit totaled $1,484 million and $1,359 million at January 30, 2010 and January 31, 2009, respectively, a portion of which are reflected in accounts payable. Standby letters of credit, relating primarily to, 700167=        We have not included obligations under our pension and postretirement health care benefit plans in the contractual obligations table above. Our historical practice regarding these plans has been to contribute amounts necessary to satisfy minimum pension funding requirements, plus periodic discretionary amounts determined to be appropriate. Further information on these plans, including our expected contributions for 2010, is included in Note 27 of the Notes to Consolidated Financial Statements., 293161=        At January 30, 2010, we employed approximately 351,000 full-time, part-time and seasonal employees, referred to as \"team members.\" During our peak sales period from Thanksgiving to the end of December, our employment levels peaked at approximately 390,000 team members. We consider our team member relations to be good. We offer a broad range of company-paid benefits to our team members. Eligibility for, and the level of, these benefits varies, depending on team members' full-time or part-time status, compensation level, date of hire and/or length of service. These company-paid benefits include a pension plan, 401(k) plan, medical and dental plans, a retiree medical plan, short-term and long-term disability insurance, paid vacation, tuition reimbursement, various team member assistance programs, life insurance and merchandise discounts., 420376=The table above includes shares of common stock reacquired from team members who wish to tender owned shares to satisfy the tax withholding on equity awards as part of our long-term incentive plans or to satisfy the exercise price on stock option exercises. For the three months ended January 30, 2010, 11,960 shares were acquired at an average per share price of $50.17 pursuant to our long-term incentive plans., 715472=Corporation beginning in fiscal 2010 and adoption is not anticipated to affect our consolidated net earnings, cash flows or financial position., 719840=        This report contains forward-looking statements, which are based on our current assumptions and expectations. These statements are typically accompanied by the words \"expect,\" \"may,\" \"could,\" \"believe,\" \"would,\" \"might,\" \"anticipates,\" or words of similar import. The principal forward looking statements in this report include: For our Retail Segment, our outlook for sales, expected merchandise returns, comparable-store sales trends and EBIT margin rates; for our Credit Card Segment, our outlook for year-end gross credit card receivables, portfolio size, future write-offs of current receivables, profit, ROIC, and the allowance for doubtful accounts; on a consolidated basis, the expected effective income tax rate, the continued execution of our share repurchase program, our expected capital expenditures and the number of stores to be opened in 2010 and 2011, the expected compliance with debt covenants, our intentions regarding future dividends, the anticipated impact of new accounting pronouncements, our expected future share-based compensation expense, our expected contributions and benefit payments related to our pension and postretirement health care plans, and the adequacy of our reserves for general liability, workers' compensation, property loss, and team member medical and dental, the expected outcome of claims and litigation, and the resolution of tax uncertainties., 240578=Indicate the number of shares outstanding of each of registrant's classes of Common Stock, as of the latest practicable date. Total shares of Common Stock, par value $0.0833, outstanding at March 10, 2010 were 739,316,518., 382605=        We are the subject of an ongoing Environmental Protection Agency (EPA) investigation for alleged violations of the Clean Air Act (CAA). In March 2009, the EPA issued a Finding of Violation (FOV) related to alleged violations of the CAA, specifically the National Emission Standards for Hazardous Air Pollutants (NESHAP) promulgated by the EPA for asbestos. The FOV pertains to the remodeling of 36 Target stores that occurred between January 1, 2003 and October 28, 2007. The EPA FOV process is ongoing and no specific relief has been sought to date by the EPA. We anticipate that any resolution of this matter will be in the form of monetary penalties that are likely to exceed $100,000 but will not be material to our financial position, results of operations or cash flows., 647235=        During 2009, we repurchased 9.9 million shares of our common stock for a total cash investment of $479 million ($48.54 per share) under a $10 billion share repurchase plan authorized by our Board of Directors in November 2007. In 2008, we repurchased 67.2 million shares of our common stock for a total cash investment of $3,395 million ($50.49 per share)., 1161924=        At January 30, 2010, the carrying value and maturities of our debt portfolio, including swap valuation adjustments for our fair value hedges, was as follows:, 745855=         We also have audited, in accordance with the standards of the Public Company Accounting Oversight Board (United States), the consolidated statements of financial position of Target Corporation and subsidiaries as of January 30, 2010 and January 31, 2009, and the related consolidated statements of operations, cash flows and shareholders' investment for each of the three years in the period ended January 30, 2010, and our report dated March 12, 2010, expressed an unqualified opinion thereon., 1225738=        Rent expense on buildings is included in SG&A. Some of our lease agreements include rental payments based on a percentage of retail sales over contractual levels. Total rent expense was $174 million in 2009, $169 million in 2008, and $165 million in 2007, including immaterial amounts of percentage rent expense in 2009, 2008 and 2007. Certain leases require us to pay real estate taxes, insurance, maintenance and other operating expenses associated with the leased premises. These expenses are classified in SG&A consistent with similar costs for owned locations. Most long-term leases include one or more options to renew, with renewal terms that can extend the lease term from one to more than fifty years. Certain leases also include options to purchase the leased property., 646634=        Year-end inventory levels increased $474 million, or 7.1 percent from 2008, primarily due to unusually low inventory levels at the end of 2008 in response to the challenging economic environment. Inventory levels were also higher to support traffic-driving strategic initiatives, such as food and pharmacy, in addition to comparatively higher retail square footage. Accounts payable increased by $174 million, or 2.7 percent over the same period., 404688=        In November 2007, our Board of Directors authorized the repurchase of $10 billion of our common stock. In November 2008 we announced a temporary suspension of our open-market share repurchase program. In January 2010, we resumed open-market purchases of shares under this program. Since the inception of this share repurchase program, we have repurchased 103.6 million common shares for a total cash investment of $5,320 million ($51.36 per share)., 955085=Fiscal year    Our fiscal year ends on the Saturday nearest January 31. Unless otherwise stated, references to years in this report relate to fiscal years, rather than to calendar years. Fiscal year 2009 (2009) ended January 30, 2010 and consisted of 52 weeks. Fiscal year 2008 (2008) ended January 31, 2009 and consisted of 52 weeks. Fiscal year 2007 (2007) ended February 2, 2008 and consisted of 52 weeks., 657130=        At January 30, 2010 and January 31, 2009, there were no amounts outstanding under our commercial paper program. In past years, we funded our peak sales season working capital needs through our commercial paper program and then used the cash generated from that sales season to repay the commercial paper issued. In 2009 we funded our working capital needs through internally generated funds. Additionally and as described in Note 10 of the Notes to Consolidated Financial Statements, during 2008 we sold to JPMC an interest in our credit card receivables for approximately $3.8 billion. We received proceeds of approximately $3.6 billion, reflecting a 7 percent discount., 957250=        Revenue from gift card sales is recognized upon gift card redemption. Our gift cards do not have expiration dates. Based on historical redemption rates, a small and relatively stable percentage of gift cards will never be redeemed, referred to as \"breakage.\" Estimated breakage revenue is recognized over time in proportion to actual gift card redemptions and was immaterial in 2009, 2008, and 2007., 669813=        At January 30, 2010, our contractual obligations were as follows:, 718608=        We expect our 2010 capital expenditures to be in the range of $2 to $2.5 billion, reflective of projects we will complete in 2010 as well as initial spending for our 2011 and 2012 new store programs. Our expectation is that our 2010 new store program will result in approximately 13 new stores and that our 2011 new store program will be in the range of 20 to 30 stores., 497422=4 percentage points, compared with an inflationary impact of approximately 2 percentage points in 2008 and a deflationary impact of 2 percentage points in 2007., 384827=        The executive officers of Target as of March 10, 2010 and their positions and ages are as follows:, 1230819=2012, 647751=        We paid dividends totaling $496 million in 2009 and $465 million in 2008, an increase of 6.7 percent. We declared dividends totaling $503 million ($0.67 per share) in 2009, an increase of 6.8 percent over 2008. In 2008, we declared dividends totaling $471 million ($0.62 per share), an increase of 3.8 percent over 2007. We have paid dividends every quarter since our first dividend was declared following our 1967 initial public offering, and it is our intent to continue to do so in the future., 276094=        We operate Target general merchandise stores, the majority of which offer a wide assortment of general merchandise and a limited assortment of food items. During 2009 we increased the offering within some of our general merchandise stores to include a deeper food assortment, including perishables and an expanded offering of dry, dairy and frozen items. In addition, we operate SuperTarget stores with a full line of food and general merchandise items. Target.com offers a wide assortment of general merchandise including many items found in our stores and a complementary assortment, such as extended sizes and colors, sold only online. A significant portion of our sales is from national brand merchandise. In addition, we sell merchandise under private-label brands including, but not limited to, Archer Farms®, Archer Farms® Simply Balanced\u0099, Boots & Barkley®, Choxie®, Circo®, Durabuilt®, Embark®, Gilligan & O'Malley®, itso\u0099, Kaori®, Market Pantry®, Merona®, Play Wonder®, Room Essentials®, Smith & Hawken®, Sutton and Dodge®, Target Home, Vroom®, up & up\u0099, Wine Cube®, and Xhilaration®. We also sell merchandise through unique programs such as ClearRxSM, GO International®, Great SaveSM and Home Design Event. In addition, we sell merchandise under exclusive licensed and designer brands including, but not limited to, C9 by Champion®, Chefmate®, Cherokee®, Converse® One Star®, Eddie Bauer®, Fieldcrest®, Genuine Kids by Osh Kosh®, Kitchen Essentials® by Calphalon®, Liz Lange® for Target®, Michael Graves Design\u0099, Mossimo®, Nick & Nora®, Sean Conway\u0099, Simply Shabby Chic®, Sonia Kashuk®, Thomas O'Brien®. We also generate revenue from in-store, 1168289=Due fiscal 2025-2029, 657966=        An additional source of liquidity is available to us through a committed $2 billion unsecured revolving credit facility obtained through a group of banks in April 2007, which will expire in April 2012. No balances were outstanding at any time during 2009 or 2008 under this facility., 738912=         Our internal control over financial reporting as of January 30, 2010, has been audited by Ernst & Young LLP, the independent registered accounting firm who has also audited our consolidated financial statements, as stated in their report which appears on this page., 536348=January 30, 2010, 745536=         In our opinion, the Corporation maintained, in all material respects, effective internal control over financial reporting as of January 30, 2010, based on the COSO criteria., 718119=        We expect our 2010 book effective tax rate to approximate our long-term structural rate, likely in the range of 37.0 to 37.5 percent., 1190644=        During the first quarter of 2008, we terminated certain \"pay floating\" interest rate swaps with a combined notional amount of $3,125 million for cash proceeds of $160 million, which are classified within other operating cash flows in the Consolidated Statements of Cash Flows. These swaps were designated as hedges; therefore, concurrent with their terminations, we were required to stop making market value adjustments to the associated hedged debt. Gains realized upon termination will be amortized into earnings over the remaining life of the associated hedge debt., 723207=        Our exposure to market risk results primarily from interest rate changes on our debt obligations, some of which are at a LIBOR-plus floating rate, and on our credit card receivables, the majority of which are assessed finance charges at a Prime-based floating rate. To manage our net interest margin, we generally maintain levels of floating-rate debt to generate similar changes in net interest expense as finance charge revenues fluctuate. The degree of floating asset and liability matching may vary over time and in different interest rate environments. At January 30, 2010, the amount of floating-rate credit card assets exceeded the amount of net floating-rate debt obligations by approximately $1 billion. As a result, based on our balance sheet position at January 30, 2010, the annualized effect of a 0.1 percentage point decrease in floating interest rates on our floating rate debt obligations, net of our floating rate credit card assets and marketable securities, would be to decrease earnings before income taxes by approximately $1 million. See further description in Note 20 of the Notes to Consolidated Financial Statements., 999480=        Other comprehensive income/(loss) includes revenues, expenses, gains and losses that are excluded from net earnings under GAAP and are recorded directly to shareholders' investment. In 2009, 2008, and 2007, other comprehensive income/(loss) included gains and losses on certain hedge transactions, foreign currency translation adjustments and amortization of pension and postretirement plan amounts, net of related taxes. Significant items affecting other comprehensive income/(loss) are shown in the Consolidated Statements of Shareholders' Investment., 1068044=        Cash equivalents include highly liquid investments with an original maturity of three months or less from the time of purchase. Cash equivalents also include amounts due from credit card transactions with settlement terms of less than five days. Receivables resulting from third-party credit card sales within our Retail Segment are included within cash equivalents and were $313 million and $323 million at January 30, 2010 and January 31, 2009, respectively. Payables resulting from the use of the Target Visa at third-party merchants are included within cash equivalents and were $40 million and $53 million at January 30, 2010 and January 31, 2009, respectively., 1103276=        Goodwill and intangible assets are recorded within other noncurrent assets at cost less accumulated amortization. Goodwill totaled $59 million at January 30, 2010 and $60 million at January 31, 2009. Goodwill is not amortized; instead, it is tested at least annually or whenever an event or change in circumstances indicates the carrying value of the asset may not be recoverable. Discounted cash flow models are used in determining fair value for the purposes of the required annual impairment analysis. An impairment loss on a long-lived and identifiable intangible asset would be recognized when estimated undiscounted future cash flows from the operation and disposition of the asset are less than the asset carrying amount., 434157=        The graph above compares the cumulative total shareholder return on our common stock for the last five fiscal years with the cumulative total return on the S&P 500 Index and a peer group consisting of the companies comprising the S&P 500 Retailing Index and the S&P 500 Food and Staples Retailing Index (Peer Group) over the same period. The Peer Group index consists of 39 general merchandise, food and drug retailers and is weighted by the market capitalization of each component company. The graph assumes the investment of $100 in Target common stock, the S&P 500 Index and the Peer Group on January 29, 2005 and reinvestment of all dividends., 950927=Dividends declared per share were $0.67, $0.62, and $0.54 in 2009, 2008, and 2007, respectively., 292283=        The vast majority of our merchandise is distributed through our network of distribution centers. We operated 38 distribution centers, including 4 food distribution centers, at January 30, 2010. General merchandise is shipped to and from our distribution centers by common carriers. In addition, certain food items are distributed by third parties. Merchandise sold through Target.com is distributed through our own distribution network, through third parties, or shipped directly from vendors., 275493=        Due to the seasonal nature of our business, a larger share of annual revenues and earnings traditionally occurs in the fourth quarter because it includes the peak sales period from Thanksgiving to the end of December., 736335=         We also have audited, in accordance with the standards of the Public Company Accounting Oversight Board (United States), the Corporation's internal control over financial reporting as of January 30, 2010, based on criteria established in Internal Control\u0097Integrated Framework, issued by the Committee of Sponsoring Organizations of the Treadway Commission and our report dated March 12, 2010, expressed an unqualified opinion thereon., 525033=        In 2009, our gross margin rate was 30.5 percent compared with 29.8 percent in 2008. Our 2009 gross margin rate benefitted from rate improvements within categories, partially offset by the mix impact of faster, 956443=        Our retail stores generally record revenue at the point of sale. Sales from our online business include shipping revenue and are recorded upon delivery to the guest. Total revenues do not include sales tax as we consider ourselves a pass through conduit for collecting and remitting sales taxes. Generally, guests may return merchandise within 90 days of purchase. Revenues are recognized net of expected returns, which we estimate using historical return patterns as a percentage of sales. Commissions earned on sales generated by leased departments are included within sales and were $18 million in 2009, $19 million in 2008, and $17 million in 2007., 420917=The table above includes shares reacquired upon settlement of prepaid forward contracts. For the three months ended January 30, 2010, no shares were reacquired through these contracts. At January 30, 2010, we held asset positions in prepaid forward contracts for 1.5 million shares of our common stock, for a total cash investment of $66 million, or an average per share price of $42.77. Refer to Notes 24 and 26 of the Notes to Consolidated Financial Statements for further details of these contracts., 1077692=        We routinely enter into arrangements with vendors whereby we do not purchase or pay for merchandise until the merchandise is ultimately sold to a guest. Revenues under this program are included in sales in the Consolidated Statements of Operations, but the merchandise received under the program is not included in inventory in our Consolidated Statements of Financial Position because of the virtually simultaneous purchase and sale of this inventory. Sales made under these arrangements totaled $1,820 million in 2009, $1,524 million in 2008, and $1,643 million in 2007., 294414=        Because of the seasonal nature of our business, our working capital needs are greater in the months leading up to our peak sales period from Thanksgiving to the end of December. The increase in working capital during this time is typically financed with cash flow provided by operations and short-term borrowings., 1229997=2011, 714330=        In June 2009, the FASB issued SFAS No. 166, \"Accounting for Transfers of Financial Assets an amendment of FASB Statement No. 140\" (SFAS 166), codified in the Transfers and Servicing accounting principles, which amends the derecognition guidance in former FASB Statement No. 140 and eliminates the exemption from consolidation for qualifying special-purpose entities. This guidance will be effective for the, 737129=Minneapolis, Minnesota March 12, 2010, 741985=         We have audited Target Corporation and subsidiaries' (the Corporation) internal control over financial reporting as of January 30, 2010, based on criteria established in Internal Control\u0097Integrated Framework, issued by the Committee of Sponsoring Organizations of the Treadway Commission (the COSO criteria). The Corporation's management is responsible for maintaining effective internal control over financial reporting, and for its assessment of the effectiveness of internal control over financial reporting included in the accompanying Report of Management on Internal Control over Financial Reporting. Our responsibility is to express an opinion on the Corporation's internal control over financial reporting based on our audit., 1118812=        Amortization is computed on intangible assets with definite useful lives using the straight-line method over estimated useful lives that typically range from 9 to 39 years for leasehold acquisition costs and from 3 to 15 years for other intangible assets. Amortization expense for 2009, 2008, and 2007 was $24 million, $21 million, and $15 million, respectively., 1104707=        No material impairments related to goodwill and intangible assets were recorded in 2009, 2008, or 2007 as a result of the tests performed. Intangible assets by major classes were as follows:, 724513=        We record our general liability and workers' compensation liabilities at net present value; therefore, these liabilities fluctuate with changes in interest rates. Periodically, in certain interest rate environments, we economically hedge a portion of our exposure to these interest rate changes by entering into interest rate forward contracts that partially mitigate the effects of interest rate changes. Based on our balance sheet position at January 30, 2010, the annualized effect of a 0.5 percentage point decrease in interest rates would be to decrease earnings before income taxes by approximately $9 million., 414140=November 1, 2009 through November 28, 2009, 957794=        Credit card revenues are recognized according to the contractual provisions of each credit card agreement. When accounts are written off, uncollected finance charges and late fees are recorded as a reduction of credit card revenues. Target retail sales charged to our credit cards totaled $3,277 million, $3,883 million, and $4,139 million in 2009, 2008, and 2007, respectively. We offer new account discounts and rewards programs on our REDcard products. These discounts are redeemable only on purchases made at Target. The discounts associated with our REDcard products are included as reductions in sales in our Consolidated Statements of Operations and were $94 million in 2009, $114 million in 2008, and $110 million in 2007., 383526=        The American Jobs Creation Act of 2004 requires SEC registrants to disclose if they have been required to pay certain penalties for failing to disclose to the Internal Revenue Service their participation in listed transactions. We have not been required to pay any of the penalties set forth in Section 6707A(e)(2) of the Internal Revenue Code., 1153244=At February 2, 2008, 526453=        In 2008 our gross margin rate was 29.8 percent compared with 30.2 percent in 2007. Our 2008 gross margin rate was adversely affected by sales mix, which resulted in a 0.6 percentage point reduction in the gross margin rate. Sales in merchandise categories that yield lower gross margin rates outpaced sales in our higher margin apparel and home merchandise categories. This mix impact was partially offset by favorable supply chain expense rates, as well as higher gross margin rates within merchandise categories across our assortment, which had a combined impact on gross margin rate of an approximate 0.2 percentage point increase., 735540=         In our opinion, the financial statements referred to above present fairly, in all material respects, the consolidated financial position of Target Corporation and subsidiaries at January 30, 2010 and January 31, 2009, and the consolidated results of their operations and their cash flows for each of the three years in the period ended January 30, 2010, in conformity with U.S. generally accepted accounting principles. Also, in our opinion, the related financial statement schedule, when considered in relation to the basic financial statements taken as a whole, presents fairly in all material respects the information set forth therein., 596583=        In 2009, Credit Card Segment profit increased to $201 million from $155 million as a result of improved portfolio performance (Spread to LIBOR) and significantly lower funding costs. The reduction in our investment in the portfolio combined with these results produced a strong improvement in segment ROIC. Segment revenues were $1,922 million, a decrease of $143 million, or 6.9 percent, from the prior year. The decrease in revenue was driven by a lower Prime Rate, lower average receivables, higher finance charge and late-fee write-offs and lower late fees due to fewer delinquent accounts offset by the positive impacts of the terms changes implemented in late 2008 and April 2009. Segment expenses were $1,624 million, a decrease of $118 million, or 6.8 percent, from prior year driven by lower bad debt and operations and marketing expenses, on both a dollar and rate basis. Segment interest expense benefited from a significantly lower LIBOR rate compared to the prior year., 998693=        For the 2009, 2008, and 2007 EPS computations, 16.8 million, 10.5 million, and 6.3 million stock options, respectively, were excluded from the calculation of weighted average shares for diluted EPS because their effects were antidilutive. Refer to Note 26 for a description of the prepaid forward contracts referred to in the table above., 1193065=        Simultaneous to the de-designations during 2008, we entered into \"pay fixed\" swaps to economically hedge the risks associated with the de-designated \"pay floating\" swaps. These swaps are not designated as hedging instruments and along with the de-designated \"pay floating\" swaps are measured at fair value on a quarterly basis. Changes in fair value measurements are a component of net interest expense on the Consolidated Statements of Operations., 272141=        Target Corporation (the Corporation or Target) was incorporated in Minnesota in 1902. We operate as two reportable segments: Retail and Credit Card., 717579=        In our Credit Card Segment, we expect the lower consumer usage of credit and our risk management strategies to continue throughout 2010, resulting in a low double-digit percentage decline in gross credit card receivables by the end of the year. We also expect to maintain segment profit on a dollar basis at generally the level earned in 2009, generating a higher pretax segment ROIC in 2010 than in 2009., 1156456=At January 31, 2009, 1191919=        Additionally, during 2008, we de-designated certain \"pay floating\" interest rate swaps, and upon de-designation, these swaps no longer qualified for hedge accounting treatment. As a result of the de-designation, the unrealized gains on these swaps determined at the date of de-designation will be amortized into earnings over the remaining lives of the previously hedged items., 1150119=        An additional source of liquidity is available to us through a committed $2 billion unsecured revolving credit facility obtained through a group of banks in April 2007, which will expire in April 2012. No balances were outstanding at any time during 2009 or 2008 under this credit facility., 715702=        In June 2009, the FASB issued SFAS No. 167, \"Amendments to FASB Interpretation No. 46(R)\" (SFAS 167), codified in the Consolidation accounting principles, which amends the consolidation guidance applicable to variable interest entities. The amendments will significantly affect the overall consolidation analysis under former FASB Interpretation No. 46(R). This guidance will be effective for the Corporation beginning in fiscal 2010 and adoption is not anticipated to affect our consolidated net earnings, cash flows or financial position., 721439=        All such forward-looking statements are intended to enjoy the protection of the safe harbor for forward-looking statements contained in the Private Securities Litigation Reform Act of 1995, as amended. Although we believe there is a reasonable basis for the forward-looking statements, our actual results could be materially different. The most important factors which could cause our actual results to differ from our forward-looking statements are set forth on our description of risk factors in Item 1A to this Form 10-K, which should be read in conjunction with the forward-looking statements in this report. Forward-looking statements speak only as of the date they are made, and we do not undertake any obligation to update any forward-looking statement., 641568=        Net interest expense was $801 million at the end of 2009, decreasing 7.5 percent, or $65 million from 2008. This decline was due to a decrease in the annualized average portfolio interest rate from 5.3 percent to 4.8 percent partially offset by a $16 million charge related to the early retirement of long-term debt. In 2008, net interest expense was $866 million compared with $647 million in 2007, an increase of 33.8 percent. This increase was due primarily to higher average debt balances supporting capital investment, share repurchase and the receivables portfolio, partially offset by a lower average portfolio net interest rate., 321397=        At January 30, 2010, we had 1,740 stores in 49 states and the District of Columbia:, 496074=        Sales include merchandise sales, net of expected returns, from our stores and our online business, as well as gift card breakage. Refer to Note 2 of the Notes to Consolidated Financial Statements for a definition of gift card breakage. Total sales for the Retail Segment for 2009 were $63,435 million, compared with $62,884 million in 2008 and $61,471 million in 2007. All periods were 52-week years. Growth in total sales between 2009 and 2008 as well as between 2008 and 2007 resulted from sales from additional stores opened, offset by lower comparable-store sales. In 2009, deflation affected sales growth by approximately, 640463=        Our 2008 period-end gross credit card receivables were $9,094 million compared with $8,624 million in 2007, an increase of 5.4 percent. Average gross credit card receivables in 2008 increased 19.5 percent compared with 2007 levels. This growth was driven by the annualization of the prior year's product change from proprietary Target Cards to higher-limit Target Visa cards and the impact of industry-wide declines in payment rates, offset in part by a reduction in charge activity resulting from reductions in card usage by our guests, and from risk management and underwriting initiatives that significantly reduced credit lines for higher risk cardholders., 525939=sales growth in lower margin rate categories (generally product categories of household essentials and food). The impact of rate performance within merchandise categories on gross margin rate was an approximate 1.1 percentage point increase for 2009. This increase is the result of improved markups and reduced markdowns. The impact of sales mix on gross margin rate was an approximate 0.4 percentage point reduction., 403969=        Our common stock is listed on the New York Stock Exchange under the symbol \"TGT.\" We are authorized to issue up to 6,000,000,000 shares of common stock, par value $0.0833, and up to 5,000,000 shares of preferred stock, par value $0.01. At March 10, 2010, there were 17,562 shareholders of record. Dividends declared per share and the high and low closing common stock price for each fiscal quarter during 2009 and 2008 are disclosed in Note 29 of the Notes to Consolidated Financial Statements, included in Item 8, Financial Statements and Supplementary Data., 1167356=Due fiscal 2020-2024, 523175=        In fiscal 2009, the change in comparable-store sales was driven by a decline in the average transaction amount, primarily due to a decrease in the number of units per transaction. In 2008, the change in comparable-store sales was driven by a decline in the number of transactions, slightly offset by an increase in average transaction amount, which reflects the effect of a higher selling price per unit sold partially offset by a decrease in number of units per transaction. Transaction-level metrics are influenced by a broad array of macroeconomic, competitive and consumer behavioral factors, as well as sales mix, and comparable-store sales rates are negatively impacted by transfer of sales to new stores., 725279=        In addition, we are exposed to market return fluctuations on our qualified defined benefit pension plans. The annualized effect of a one percentage point decrease in the return on pension plan assets would decrease plan assets by $22 million at January 30, 2010. The value of our pension liabilities is inversely related to changes in interest rates. To protect against declines in interest rates we hold high-quality, long-duration bonds and interest rate swaps in our pension plan trust. At year end, we had hedged approximately 50 percent of the interest rate exposure of our funded status., 305158=        In addition to the impact of macroeconomic conditions on our retail sales, these same considerations impact the success of our Credit Card Segment, as any deterioration can adversely affect cardholders' ability to pay their balances and we may not be able to anticipate and respond to changes in the risk profile of our cardholders when extending credit, resulting in higher bad debt expense. The recent Credit Card Accountability, Responsibility and Disclosure Act of 2009 has significantly restricted our ability to make changes to cardholder terms that are commensurate with changes in the risk profile of our credit card receivables portfolio. Demand for consumer credit is also impacted by macroeconomic conditions and other factors, and our performance can also be adversely affected by consumer decisions to use debit cards or other forms of payment., 1125379=        We reclassify book overdrafts to accounts payable at period end. Overdrafts reclassified to accounts payable were $539 million at January 30, 2010 and $606 million at January 31, 2009., 1093181=        Long-lived assets are reviewed for impairment annually and also when events or changes in circumstances indicate that the asset's carrying value may not be recoverable. Impairments of $49 million in 2009, $2 million in 2008 and $7 million in 2007 were recorded as a result of the tests performed. Additionally, we wrote off $37 million in 2009, $26 million in 2008 and $4 million in 2007 of capitalized construction in progress costs due to project scope changes., 1169224=Due fiscal 2030-2034, 274290=        Our fiscal year ends on the Saturday nearest January 31. Unless otherwise stated, references to years in this report relate to fiscal years, rather than to calendar years. Fiscal year 2009 (2009) ended January 30, 2010, and consisted of 52 weeks. Fiscal year 2008 (2008) ended January 31, 2009 and consisted of 52 weeks. Fiscal year 2007 (2007) ended February 2, 2008 and consisted of 52 weeks., 717254=        In 2010 we expect to generally preserve our 2009 EBIT margin rate in our Retail Segment, which if achieved would result in our Retail Segment EBIT increasing in line with total sales growth., 1159633=At January 30, 2010, 597740=        Segment profit and dollar Spread to LIBOR measures in 2008 were significantly impacted on both a rate and dollar basis by bad debt expense. Segment revenues were $2,064 million, an increase of $168 million, or 8.9 percent, from the prior year, driven by a 19.5 percent increase in average receivables. On a rate basis, revenue yield decreased 2.4 percentage points primarily due to a reduction in the Prime Rate index used to determine finance charge rates in the portfolio and lower external sales volume contributing to the decline in third party merchant fees. This negative pressure on revenue yield was offset modestly by the positive impact of terms changes implemented in 2008 that increased our effective yield. Segment expenses were $1,742 million, an increase of $776 million, or 80.3 percent, from the prior year driven by an increase in bad debt expense of $770 million. The increase in bad debt expense resulted from the increase in our incurred net write-off rate from 5.9 percent in 2007 to 9.3 percent in 2008 and the increase in the allowance for doubtful accounts of $440 million for anticipated future write-offs of current receivables. Segment profit decreased from 16.3 percent in 2007 to 3.7 percent in 2008 primarily due to the effect of bad debt expense, the reduction in receivables owned and funded by Target, and the impact of a lower Prime Rate during 2008., 1150549=        As further explained in Note 10, we maintain an accounts receivable financing program through which we sell credit card receivables to a bankruptcy remote, wholly owned subsidiary, which in turn transfers the receivables to a Trust. The Trust, either directly or through related trusts, sells debt securities to third parties. The following summarizes this activity for fiscal 2008 and 2009., 1165502=Due fiscal 2010-2014, 416959=January 3, 2010 through January 30, 2010, 1140019=        Purchase obligations, which include all legally binding contracts, such as firm commitments for inventory purchases, merchandise royalties, equipment purchases, marketing-related contracts, software acquisition/license commitments and service contracts, were approximately $2,016 million and $570 million at January 30, 2010 and January 31, 2009, respectively. We issue inventory purchase orders, which represent authorizations to purchase that are cancelable by their terms. We do not consider purchase orders to be firm inventory commitments. We also issue trade letters of credit in the ordinary course of business, which are not firm commitments as they are conditional on the purchase order not being cancelled. If we choose to cancel a purchase order, we may be obligated to reimburse the vendor for unrecoverable outlays incurred prior to cancellation under certain circumstances., 878552=February 3, 2007, 659998=        Capital expenditures were $1,729 million in 2009 compared with $3,547 million in 2008 and $4,369 million in 2007. This decrease was driven by lower capital expenditures for new stores, remodels and technology-related assets. Our 2009 capital expenditures include $232 million related to stores that will open in 2010 and, 235816=Indicate by check mark whether the registrant (1) has filed all reports required to be filed by Section 13 or 15(d) of the Securities Exchange Act of 1934 during the preceding 12 months (or for such shorter period that the registrant was required to file such reports), and (2) has been subject to such filing requirements for the past 90 days. Yes ý No o, 1212293=        During 2007, we entered into a series of interest rate lock agreements that effectively fixed the interest payments on our anticipated issuance of debt that would be affected by interest-rate fluctuations on the U.S. Treasury benchmark between the beginning date of the interest rate locks and the date of the issuance of the debt. Upon our issuance of fixed-rate debt in fiscal 2007, we terminated these rate lock agreements with a combined notional amount of $2.5 billion for cash payment of $79 million, which is classified within other operating cash flows on the Consolidated Statements of Cash Flows. The loss of $48 million, net of taxes of $31 million, has been recorded in accumulated other comprehensive loss and is being recognized as an adjustment to net interest expense over the same period in which the related interest costs on the debt are recognized in earnings. During 2007, the amount reclassified into earnings was not material. During 2008 and 2009, the amount reclassified into earnings as an increase to interest expense from accumulated other comprehensive income was $3 million ($5 million pre tax) and $3 million ($5 million pre tax). The amount expected to be reclassified into earnings from accumulated other comprehensive income for 2010 is $3 million ($5 million pre tax)., 1189539=        Prior to 2009, the majority of our derivative instruments qualified for fair value hedge accounting treatment. The changes in market value of an interest rate swap, as well as the offsetting change in market value of the hedged debt, were recognized within earnings in the current period. We assessed at the inception of the hedge whether the hedging derivatives were highly effective in offsetting changes in fair value or cash flows of hedged items. Ineffectiveness resulted when changes in the market value of the hedged debt were not completely offset by changes in the market value of the interest rate swap. For those derivatives whose terms met the conditions of the \"short-cut method\", 100 percent hedge effectiveness was assumed. There was no ineffectiveness recognized in 2009, 2008, or 2007 related to our derivative instruments. As detailed below, at January 30, 2010, there were no derivative instruments designated as accounting hedges., 1192441=        In 2009, 2008, and 2007, total net gains amortized into net interest expense for terminated and de-designated swaps were $60 million, $55 million, and $6 million, respectively. The amount remaining on unamortized hedged debt valuation gains from terminated and de-designated interest rate swaps that will be amortized into earnings over the remaining lives totaled $197 million, $263 million, and $14 million, at the end of 2009, 2008, and 2007, respectively., 644296=        Our 2009 operations were entirely funded by internally generated funds. Cash flow provided by operations was $5,881 in 2009 compared with $4,430 million in 2008. This strong cash flow allowed us to fund capital expenditures of $1,729 million and pay off $1.3 billion of maturing debt with internally generated funds. In addition we accelerated the payoff of a $550 million 2010 debt maturity, restarted our share repurchase program earlier than expected and experienced a $1.3 billion increase in marketable securities at January 30, 2010., 240240=Aggregate market value of the voting stock held by non-affiliates of the registrant on August 1, 2009 was $32,739,208,053, based on the closing price of $43.62 per share of Common Stock as reported on the New York Stock Exchange- Composite Index., 1070148=        Under certain circumstances, we offer cardholder payment plans that modify finance charges and minimum payments, which meet the accounting definition of a troubled debt restructuring (TDRs). These concessions are made on an individual cardholder basis for economic or legal reasons specific to each individual cardholder's circumstances. As a percentage of period-end gross receivables, receivables classified as TDRs were 6.7 percent at January 30, 2010 and 4.9 percent at January 31, 2009. Receivables classified as TDRs are treated consistently with other aged receivables in determining our allowance for doubtful accounts., 532762=January 31, 2009, 815602=Common Stock  Authorized 6,000,000,000 shares, $0.0833 par value; 744,644,454 shares issued and outstanding at January 30, 2010; 752,712,464 shares issued and outstanding at January 31, 2009., 463003=        Our 2009 financial results in both of our business segments were affected by the challenging economy in which we operated. In light of that environment, performance in our Retail Segment was remarkable, as the segment generated the highest EBIT in the Corporation's history, in a year when comparable-store sales declined 2.5 percent. In the Credit Card Segment, disciplined management led to a 29.4 percent increase in segment profit in a year when Target's average investment in the portfolio declined about 32 percent, representing a near-doubling of segment pretax return on invested capital., 719118=        Due to the early repayment of an August 2010 debt maturity, the only significant remaining 2010 maturity, prior to our seasonal working capital peak (which typically occurs in October or November), is the $900 million public series borrowing collateralized by our credit card receivables due in October., 645000=        Our 2009 period-end gross credit card receivables were $7,982 million compared with $9,094 million in 2008, a decrease of 12.2 percent. Average gross credit card receivables in 2009 decreased 4.0 percent compared with 2008 levels. This change was driven by the factors indicated in the Credit Card Segment above. This trend and the factors influencing it are likely to continue into 2010. Due to the decrease in gross credit card receivables, Target Receivables Corporation (TRC), using cash flows from the receivables, repaid an affiliate of JPMorgan Chase (JPMC) $163 million during 2009 under the terms of our agreement with them as described in Note 10 of the Notes to Consolidated Financial Statements. To the extent the receivables balance continues to decline, TRC expects to continue to pay JPMC a prorata portion of principal collections such that the portion owned by JPMC would not exceed 47 percent., 708355=carrying value of the asset may not be recoverable. Impairment on long-lived assets of $49 million in 2009, $2 million in 2008 and $7 million in 2007 were recorded as a result of the tests performed., 639731=        Our 2009 period-end gross credit card receivables were $7,982 million compared with $9,094 million in 2008, a decrease of 12.2 percent. Average gross credit card receivables in 2009 decreased 4.0 percent compared with 2008 levels. This change was driven by tighter risk management and underwriting initiatives that have significantly reduced available credit lines for higher-risk cardholders, fewer new accounts being opened, and a decrease in charge activity resulting from reductions in card usage by our guests, partially offset by the impact of a decline in payment rates., 1229159=2010, 1067464=        The carrying amounts of credit card receivables, net of allowance, accounts payable, and certain accrued and other current liabilities approximate fair value at January 30, 2010., 658389=        Most of our long-term debt obligations contain covenants related to secured debt levels. In addition to a secured debt level covenant, our credit facility also contains a debt leverage covenant. We are, and expect to remain, in compliance with these covenants. Additionally, at January 30, 2010, no notes or debentures contained provisions requiring acceleration of payment upon a debt rating downgrade, except that certain outstanding notes allow the note holders to put the notes to us if within a matter of months of each other we experience both (i) a change in control; and (ii) our long-term debt ratings are either reduced and the resulting rating is non-investment grade, or our long-term debt ratings are placed on watch for possible reduction and those ratings are subsequently reduced and the resulting rating is non-investment grade., 661040=later years. Net property and equipment decreased $475 million in 2009 following an increase of $1,661 million in 2008., 528041=        SG&A expense rate was 20.5 percent in 2009 compared with 20.4 percent in both 2008 and 2007. The change in the rate was primarily driven by an approximate 0.4 percentage point impact from an increase in incentive compensation due to better than expected 2009 performance compared with 2008 results. The rate increase was partially offset by an approximate 0.2 percentage point impact from sustained productivity gains in our stores. Within SG&A expenses in 2008 and 2007, there were no expense categories that experienced a significant fluctuation as a percentage of sales, when compared with prior periods., 1069162=        Credit card receivables are recorded net of an allowance for doubtful accounts. The allowance, recognized in an amount equal to the anticipated future write-offs of existing receivables, was $1,016 million at January 30, 2010 and $1,010 million at January 31, 2009. This allowance includes provisions for uncollectible finance charges and other credit-related fees. We estimate future write-offs based on historical experience of delinquencies, risk scores, aging trends, and industry risk trends. Substantially all accounts continue to accrue finance charges until they are written off. Total receivables past due ninety days or more and still accruing finance charges were $371 million at January 30, 2010 and $393 million at January 31, 2009. Accounts are written off when they become 180 days past due., 870112=Cash paid for income taxes was $1,040, $1,399, and $1,734 during 2009, 2008, and 2007, respectively. Cash paid for interest (net of interest capitalized) was $805, $873, and $633 during 2009, 2008, and 2007, respectively., 381440=        We are one of many defendants in a lawsuit filed on February 13, 2008, by the State of California involving environmental matters that may involve potential monetary sanctions in excess of $100,000. The allegation, initially made by the California Air Resources Board in April 2006, involves a nonfood product (hairspray) that allegedly contained levels of a volatile organic compound in excess of permissible levels. We anticipate that the settlement, to be fully indemnified by the vendor, is likely to exceed $100,000 but will not be material to our financial position, results of operations or cash flows. In addition, we are a defendant in a civil lawsuit filed by the California Attorney General in June 2009 alleging that we did not handle and dispose of certain unsold products as a hazardous waste. The case is in its early stages. We anticipate that this lawsuit may involve potential monetary sanctions in excess of $100,000, but will not be material to our financial position, results of operations or cash flows., 593826=        Our primary measure of segment profit in our Credit Card Segment is the EBIT generated by our total credit card receivables portfolio less the interest expense on nonrecourse debt collateralized by credit card receivables. We analyze this measure of profit in light of the amount of capital we have invested in our credit card receivables. In addition, we measure the performance of our overall credit card receivables portfolio by calculating the dollar Spread to LIBOR at the portfolio level. This metric approximates overall financial performance of the entire credit card portfolio we manage by measuring the difference between EBIT earned on the portfolio and a hypothetical benchmark rate financing cost applied to the entire portfolio. The interest rate on all nonrecourse debt securitized by credit card receivables is tied to LIBOR. For the first quarter of 2009, the vast majority of our portfolio accrued finance charge revenue at rates tied to the Prime Rate. Effective April 2009, we implemented a terms change to our portfolio that established a minimum annual percentage rate (APR) applied to cardholder account balances. Under these terms, finance charges accrue at a fixed APR if the benchmark Prime Rate is less than 6%; if the Prime Rate is greater than 6%, finance charges accrue at the benchmark Prime Rate, plus a spread. Because the Prime Rate was less than 6% during 2009, the majority of our portfolio accrued finance charges at a fixed APR subsequent to this terms change. As a result of regulatory actions that impact our portfolio, effective January 2010, we implemented a second terms change that converted the minimum APR for the majority of our accounts to a variable rate, and we eliminated penalty, 642562=        Our effective income tax rate was 35.7 percent in 2009 and 37.4 percent in 2008. The decrease in the effective rate between periods is primarily due to nontaxable capital market returns on investments used to economically hedge the market risk in deferred compensation plans in 2009 compared with nondeductible losses in 2008. The 2009 effective income tax rate is also lower due to federal and state discrete items., 1073213=        In the second quarter of 2008, we sold an interest in our credit card receivables to JPMC. The interest sold represented 47 percent of the receivables portfolio at the time of the transaction. This transaction was accounted for as a secured borrowing, and accordingly, the credit card receivables within the Trust and the note payable issued are reflected in our Consolidated Statements of Financial Position. Notwithstanding this accounting treatment, the accounts receivable assets that collateralize the note payable supply the cash flow to pay principal and interest to the note holder; the receivables are not available to general creditors of the Corporation; and the payments to JPMC are made solely from the Trust and are nonrecourse to the general assets of the Corporation. Interest and principal payments due on the note are satisfied provided the cash flows from the Trust assets are sufficient. If the cash flows are less than the periodic interest, the available amount, if any, is paid with respect to interest. Interest shortfalls will be paid to the extent subsequent cash flows from the assets in the Trust are sufficient. Future principal payments will be made from JPMC's prorata share of cash flows from the Trust assets., 463749=        Cash flow provided by operations was $5,881 million, $4,430 million, and $4,125 million for 2009, 2008, and 2007, respectively. In 2009, we opened 76 new stores representing 58 stores net of 13 relocations and 5 closings. In 2008, we opened 114 new stores representing 91 stores net of 21 relocations and two closings., 733954=         We have audited the accompanying consolidated statements of financial position of Target Corporation and subsidiaries (the Corporation) as of January 30, 2010 and January 31, 2009, and the related consolidated statements of operations, cash flows, and shareholders' investment for each of the three years in the period ended January 30, 2010. Our audits also included the financial statement schedule listed in Item 15(a). These financial statements and schedule are the responsibility of the Corporation's management. Our responsibility is to express an opinion on these financial statements and schedule based on our audits., 405286=        The table below presents information with respect to Target common stock purchases made during the three months ended January 30, 2010, by Target or any \"affiliated purchaser\" of Target, as defined in Rule 10b-18(a)(3) under the Exchange Act., 903940=February 2, 2008, 1087823=        Property and equipment are recorded at cost, less accumulated depreciation. Depreciation is computed using the straight-line method over estimated useful lives or lease term if shorter. We amortize leasehold improvements purchased after the beginning of the initial lease term over the shorter of the assets' useful lives or a term that includes the original lease term, plus any renewals that are reasonably assured at the date the leasehold improvements are acquired. Depreciation expense for 2009, 2008, and 2007 was $1,999 million, $1,804 million, and $1,644 million, respectively. For income tax purposes, accelerated depreciation methods are generally used. Repair and maintenance costs are expensed as incurred and were $632 million in 2009, $609 million in 2008, and $592 million in 2007. Facility preopening costs, including supplies and payroll, are expensed as incurred., 738016=         Our management is responsible for establishing and maintaining adequate internal control over financial reporting, as such term is defined in Exchange Act Rules 13a-15(f). Under the supervision and with the participation of our management, including our chief executive officer and chief financial officer, we assessed the effectiveness of our internal control over financial reporting as of January 30, 2010, based on the framework in Internal Control\u0097Integrated Framework, issued by the Committee of Sponsoring Organizations of the Treadway Commission. Based on our assessment, we conclude that the Corporation's internal control over financial reporting is effective based on those criteria., 529021=        Our depreciation and amortization expense rate represents depreciation and amortization expense as a percentage of sales. In 2009, our depreciation and amortization expense rate was 3.2 percent compared with 2.9 percent in 2008 and 2.7 percent in 2007. The increase in the rate was primarily due to accelerated depreciation on assets that will be replaced as part of our 340-store 2010 remodel program. The comparative increase in 2008 was due to increased capital expenditures, specifically related to investments in new stores., 816100=Preferred Stock  Authorized 5,000,000 shares, $0.01 par value; no shares were issued or outstanding at January 30, 2010 or January 31, 2009., 659384=        Our interest coverage ratio represents the ratio of pretax earnings before fixed charges to fixed charges. Fixed charges include interest expense and the interest portion of rent expense. Our interest coverage ratio as calculated by the SEC's applicable rules was 5.1x in 2009, 4.3x in 2008, and 6.4x in 2007., 1170157=Due fiscal 2035-2037, 1141993=retained risk on our insurance claims, totaled $72 million and $64 million at January 30, 2010 and January 31, 2009, respectively., 1193678=        At January 30, 2010, a characteristic summary of interest rate swaps outstanding was:, 415558=November 29, 2009 through January 2, 2010}",
    "textBeforeTable": "FORM 10-K/A Amendment No. 1 UNITED STATES SECURITIES AND EXCHANGE COMMISSION Washington, D.C. 20549 Table of Contents Graphic Graphic Graphic Graphic Graphic Graphic Graphic Graphic Ex-32.(B) Ex-32.(A) Ex-31.(B) Ex-31.(A) Ex-24 Ex-23 Ex-21 Ex-12 Ex-10.(L) Ex-10.(I) Ex-10.(H) Ex-10.(G) Ex-10.(F) Ex-10.(E) 10-K/A Documents found in this filing: Target 10-K 2010",
    "textAfterTable": "Minnesota (State or other jurisdiction of incorporation or organization)   41-0215170 (I.R.S. Employer Identification No.) 1000 Nicollet Mall, Minneapolis, Minnesota (Address of principal executive offices)   55403 (Zip Code) Registrant's telephone number, including area code: 612/304-6073 Securities Registered Pursuant To Section 12(B) Of The Act: Title of Each Class   Name of Each Exchange on Which Registered Common Stock, par value $0.0833 per share   New York Stock Exchange Securities registered pursuant to Section 12(g) of the Act: None",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}