{
    "relation": [
        [
            "Days",
            "30",
            "50",
            "150",
            "200"
        ],
        [
            "BSE",
            "25.50",
            "25.31",
            "24.18",
            "24.23"
        ],
        [
            "NSE",
            "25.50",
            "25.31",
            "24.18",
            "24.23"
        ]
    ],
    "pageTitle": "SJVN Stock Price, Share Price, Live BSE/NSE, SJVN Bids Offers. Buy/Sell SJVN news & tips, & F&O Quotes",
    "title": "",
    "url": "http://www.moneycontrol.com/india/stockpricequote/power-generation-distribution/sjvn/S11",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042982745.46/warc/CC-MAIN-20150728002302-00089-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 592027815,
    "recordOffset": 591976176,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{131295=28 July 2015, 132513=JSWSteel Jul Fut, 209202=SJVN is in the Power - Generation & Distribution sector. The current market capitalisation stands at Rs 10,176.10 crore. The company management includes Mukesh Jain - Part Time Govt.Director, Raghunath Prasad Singh - Chairman & Managing Director, D V Dharmik - Independent Director, S K B S Negi - Nominee Director, Ramesh Narain Misra - Director, R N Misra - Chairman & Managing Director, Amarjit Singh Bindra - Director - Finance, Nand Lal Sharma - Director - Personnel, Rakesh Kumar Bansal - Director - Power, Rakesh Kumar Bansal - Director - Power, S K B S Negi - Nominee Director, Kamaljit Singh Gill - Independent Director, S M Lodha - Independent Director, Asha Swarup - Independent Director, Arun Mahajan - Independent Director, Arun Kumar Verma - Part Time Official Director. It is listed on the BSE with a BSE Code of 533206 and the NSE with an NSE Code of SJVN. Its Registered office is at Himfed Building, New Shimla, Shimla,Himachal Pradesh - 171009. Their Registrars are Link Intime India Pvt. Ltd., 131806=UnitedBrewerie Jul Fut, 207902=Astec LifeSciences Recommended on Mar 31st 2015}",
    "textBeforeTable": "Edit Watchlist Have you invested in these stocks? You can track them better in your Portfolio close[x] Add to Watchist Account Optional Optional Optional Optional Add to Portfolio OR Add to watchlist } $('#mcpcp_addprof_info').hide(); { function close_info()",
    "textAfterTable": "Keep me signed in Forgot Password? New to Moneycontrol - Sign up now Its easy and FREE! Username Username should be atleast 4 characters Password Password should be 6 to 10 characters Confirm Password Email OR connect with LIVE",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}