{
    "relation": [
        [
            "Play Type",
            "Substitution",
            "Walk",
            "Substitution",
            "Out",
            "Substitution",
            "Walk",
            "Single",
            "Walk",
            "Substitution",
            "Out"
        ],
        [
            "Play",
            "Jonathan Broxton starts the inning for the Dodgers, batting 8th.",
            "Ryan Spilborghs walked. Runner on first with none out and Paul Phillips due up.",
            "Eric Young Jr. is pinch-hitting for Paul Phillips, batting 8th.",
            "Pinch-Hitter Eric Young Jr. grounded into a double play, second to short to first. None on with two outs and Huston Street due up.",
            "Seth Smith is pinch-hitting for Huston Street, batting 9th.",
            "Pinch-Hitter Seth Smith walked. Runner on first with two outs and Dexter Fowler due up.",
            "Dexter Fowler singled to right center. Runners on first and third with two outs and Jonathan Herrera due up.",
            "Jonathan Herrera walked. Bases loaded with two outs and Carlos Gonzalez due up.",
            "George Sherrill enters the game for the Dodgers with the bases loaded and two outs, batting 8th.",
            "Carlos Gonzalez struck out swinging to end the inning."
        ]
    ],
    "pageTitle": "Sunday, September 19, 2010 Colorado Rockies - Los Angeles Dodgers Box Scores, Game Results & Summary - USATODAY.com",
    "title": "",
    "url": "http://content.usatoday.com/sportsdata/baseball/mlb/game/rockies_dodgers/2010/09/19",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042981856.5/warc/CC-MAIN-20150728002301-00219-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 52506151,
    "recordOffset": 52495626,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{2352=View all MLB box scores for 9/19/2010}",
    "textBeforeTable": "Top of the 1st Mike DiMuro  3B Bill Welke  2B Jim Reynolds  1B Tim Welke  H Umpires 6.29 3 4 1 0 0 0 0 0.1 George Sherrill (W, 2-2) 3.88 9 23 0 3 0 0 1 0.2 Jonathan Broxton  1.31 20 29 3 0 0 0 1 2 Hong-Chih Kuo  0.83 28 40 2 1 0 0 1 2 Kenley Jansen  4.99 16 24 2 0 0 0 0 2 Ronald Belisario  2.98 54 89 2 4 4 6 4 4 Clayton Kershaw  ERA Strikes Pitches SO BB ER R H IP Name 8.44 \" xmlns:fo=\"http://www.w3.org/1999/XSL/Format\" />Dodgers pitching http://i.usatoday.net/_common/_images/_sports/logos/mlb/dodgers_22t.png 10 18 0 1 1 1 3 0.1 Manny Delcarmen (L, 0-2) 3.65 19 30 0 1 1 1 3 2 Huston Street (BS, 5) 3.90 9 11 2 0 0 0 0 1 Rafael Betancourt (H, 23) 3.97 3 3 1 0 0 0 0 0.1 Octavio Dotel (H, 4) 2.08 5 7 0 0 0 0 0 0.2 Matt Reynolds (H, 2) 2.69 15 23 2 0 1 1 2 1 Matt Belisle (H, 21) 5.29 7 11 1 0 0 0 0",
    "textAfterTable": "Out Matt Kemp grounded out pitcher to first. None on with two outs and Andre Ethier due up. Home-run Andre Ethier two-out, solo Home Run (23) to right. Jay Gibbons due up. Out Jay Gibbons flied out to center to end the inning. Top of the 2nd Play Type Play Error-reached-base Paul Phillips reached first on Jay Gibbons's fielding error.. Runner on first with none out and Jason Hammel due up. Out Jason Hammel grounded into a fielder's choice, third to short. Runner on first with one out and Dexter Fowler due up. Single Dexter Fowler singled to left. Runners on first and second with one out and Jonathan Herrera due up. Double Jonathan Herrera doubled to right scored Jason Hammel. Runners on second and third with one out and Carlos Gonzalez due up. Single Carlos Gonzalez single to center scored Dexter Fowler. Runners on first and third with one out and Troy Tulowitzki due up. Out Troy Tulowitzki grounded into a fielder's choice, second to short scored Jonathan Herrera. Runner on first with two outs and Melvin Mora due up. Walk Melvin Mora walked. Runners on first and second with two outs and Jason Giambi due up.",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}