{
    "relation": [
        [
            "HM #",
            "HM01",
            "HM02",
            "HM03",
            "HM04",
            "HM05",
            "HM06"
        ],
        [
            "Move",
            "Cut",
            "Fly",
            "Surf",
            "Strength",
            "Waterfall",
            "Dive"
        ],
        [
            "Type",
            "Normal",
            "Flying",
            "Water",
            "Normal",
            "Water",
            "Water"
        ],
        [
            "Damage",
            "",
            "",
            "",
            "",
            "",
            ""
        ],
        [
            "Pwr",
            "50",
            "90",
            "95",
            "80",
            "80",
            "80"
        ],
        [
            "Acc",
            "95%",
            "95%",
            "100%",
            "100%",
            "100%",
            "100%"
        ],
        [
            "Effect",
            "Damages the target. (Striation City)",
            "On the first turn, the user flies into the air, becoming uncontrollable, and evades most attacks. Gust, Twister, Thunder and Sky Uppercut have normal accuracy against a mid-air Pokemon, with Gust and Twister also gaining doubled power. The user may also be hit in mid-air if it was previously targeted by Lock-On or Mind Reader or if it is attacked by a Pokemon with No Guard. On the second turn, the user attacks. (Driftveil City)",
            "Power doubles against a target who is in the middle of using Dive. (Twist Mountain)",
            "Damages the target. (Nimbasa City)",
            "Has a 20% chance to make the target flinch. (Route 18)",
            "On the first turn, the user dives underwater, becoming uncontrollable, and evades all attacks except for Surf and Whirlpool, which have doubled power; the user may also be hit underwater if it was previously targeted by Lock-On or Mind Reader or if it is attacked by a Pokemon with No Guard. On the second turn, the user attacks. (Undella Town)"
        ]
    ],
    "pageTitle": "Pokemon Black and White :: TM/HM List",
    "title": "",
    "url": "http://psypokes.com/bw/tmhm.php",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042982745.46/warc/CC-MAIN-20150728002302-00339-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 203520347,
    "recordOffset": 203502985,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "POKEMON BLACK AND WHITE TMs       TCG Anime Other Games Red Blue Yellow Gold Silver Crystal Ruby Sapphire Emerald FireRed LeafGreen Diamond Pearl Platinum HeartGold SoulSilver Pokemon",
    "textAfterTable": "TM07 Hail Ice N/A N/A Cancels all other weather moves. For 5 turns: Blizzard never misses and has a 30% chance to hit through Protect and Detect, each active Pokemon, even when protected by a Substitute, loses 1/16 of its max HP unless it is an Ice-type, the power of Solarbeam is halved, and the healing power of Morning Sun, Synthesis and Moonlight is halved. The effects of Hail will last for eight turns if its user is holding Icy Rock. (Mistralton City PokeCenter - P50000) TM08 Bulk Up Fighting N/A N/A Raises the user's Attack and Defense by 1 stage each. (Route 14 - From Plasma Sage Giallo) TM09 Venoshock Poison 65 100% Base Power doubles if the target is poisoned. (Route 15) TM10 Hidden Power Normal Var BP 100% Varies in",
    "hasKeyColumn": true,
    "keyColumnIndex": 1,
    "headerRowIndex": 0
}