{
    "relation": [
        [
            "Web Address",
            "http://www2.sec.state.ri.us/dar/regdocs/released/pdf/DOH/4819.pdf",
            "http://www2.sec.state.ri.us/dar/regdocs/released/pdf/DOH/DOH_3815.pdf",
            "http://www.health.ri.gov/hsr/professions/alr_admin.php"
        ],
        [
            "Content",
            "Rules",
            "Rule (administrator)",
            "Administrators"
        ]
    ],
    "pageTitle": "Residential Care and Assisted Living Compendium: 2007 Section 3",
    "title": "",
    "url": "http://aspe.hhs.gov/daltcp/reports/2007/07alcom3.htm",
    "hasHeader": true,
    "headerPosition": "MIXED",
    "tableType": "RELATION",
    "tableNum": 125,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042981856.5/warc/CC-MAIN-20150728002301-00233-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 18225115,
    "recordOffset": 17973300,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{888095=Changes in 2007 require that applications from facilities that serve special population a written description of the special care provided that includes: a statement of mission or philosophy that reflects the needs of the special population; admission criteria to the RCF, or part thereof, including screening criteria transfer and discharge criteria and procedures; a weekly staffing plan for the facility or part thereof; a description of activities offered, including frequency and type, and how the activities meet the needs of the type of residents; specialized staff training and continuing education practices; the process used for assessment and the provision of services, including the method for altering services based on changes in condition; if necessary, how the facility addresses the behavioral health care needs of residents; the physical environment and design features to support the functioning of residents in the facility or part thereof; the involvement of families and the availability of family support programs for residents in the facility., 5503=Sections of the regulations governing building requirements for ALFs and specialty care facilities were revised in July 2003. Revisions to incident investigations were effective in 2004. Other minor changes were made in 2005, 2006 and 2007. The regulations license three categories of facilities:, 927798=Assisted living center. All employees are subject to requirements for criminal arrest checks applicable to nurses aides under 63 O.S. Supp. 1997, §1-1950.1 and other regulations governing registered sex offenders or violent crime offenders, §1-1946. Employers must pay a fee of $10 to the Bureau of Investigation for checks. Reports are provided for felonies and misdemeanors for crimes against a person, public indecency or morality, domestic abuse, controlled substances, and crimes against property. Employees may not be hired if they have been convicted of crimes listed in the statute., 599019=HB 2416, enacted in 2007, defines an AFC facility as a home setting for vulnerable adults in the community who are unable to live independently due to physical, emotional, developmental or mental impairments, or in need of emergency and continuing protective social services for purposes of preventing further abuse or neglect and for safeguarding and enhancing the welfare of the abused or neglected vulnerable adult. AFC programs shall be designed to meet the needs of vulnerable adults with impairments through individual plans of care, which provide a variety of health, social and related support services in a protective setting, enabling participants to live in the community. AFC programs may be traditional, where the foster care provider lives in the residence and is the primary caregiver to clients in the home; corporate, where the foster care home is operated by a corporation with shift staff delivery services to clients; or shelter, where the foster care home accepts clients on an emergency short-term basis for up to 30 days. The Department of Health issued regulations in October 2007 to implement the law. The rules are available at: http://www.msdh.state.ms.us/msdhsite/_static/resources/2347.pdf., 394550=Residential care facilities. Rules require 100 square feet for single rooms and 80 square feet per bed for multiple occupancy rooms. For facilities licensed after 1984, no more than four people may share a room. One toilet and sink is required for every eight residents in facilities licensed after 1984., 277995=Personal Care Homes: Georgia Code Annotated §31-2-4 et seq.; §31-7-2.1 et seq.; Georgia Regulations §290-5-35.01 et seq. Community Living Arrangements: Georgia Code Annotated §31-7-1 et seq.; §37-1-22, et seq., Chapter 290-9-37, 981377=Prescription medication that is not self-administered by the resident must be administered by a licensed physician, physician\u0092s assistant, RN, nurse practitioner, LPN or licensed paramedic. A new medication administration train-the-trainer program developed by the Department of Public Welfare was instituted in April 2007. Staff who have completed the Department\u0092s medication administration program may also now administer oral prescription medications., 335774=Effective October 1, 2007, all applicants for licensure must submit a criminal history clearance as described in IDHW rules Title 05, Chapter 05. The rules include finger printing, FBI, National Criminal History Background Check System, state registries and Medicaid sanctions lists. Individuals pay $48 for the cost of the check., 715963=The rules define bounded choice, managed risk and managed risk agreements. \u0093Bounded choice\u0094 means limits placed on a resident\u0092s choice as a result of an assessment, in accordance with N.J.A.C. 8:36-4.17, which indicates that such resident\u0092s choices or preferences place the resident or others at a risk of harm or lead to consequences which violate the norms of the facility or program or the rights of others., 694540=New Hampshire implemented legislation in 2003 requiring disclosure of information to allow residents to compare ALRs, independent retirement communities and elder housing and make informed choices. Regulations and a standard form were issued by the licensing agency. The rules require disclosure of whether the facility is licensed, the amount of the basic rate, the services included in the rate (e.g., assistance with specific ADLs, monitoring and supervision of medications, administration of mediations, personal laundry services (number of loads per week), housekeeping services; meals provided, transportation services, recreation and leisure activities, amenities in the living unit, and staffing (24-hour availability, licensed nurse, personal care attendant, nursing assistant and maintenance staff availability; deposits/advance payment requirements and refundability; and services not included in the basic rate and their cost., 606775=Aging-in-place legislation passed in 2001 that allows residents who need skilled services to continue to reside in the facility, if approved in writing by a licensed physician. No more than two residents, or 10% of residents in the facility, whichever is greater, may receive skilled services., 866339=The registration fee for ALFs is $75 annually. Facilities must also pay a fee for a lodging license that ranges from $15 to $115 depending on the number of licensed beds. As of January 2004, basic care facilities must pay a $10 per bed licensing fee., 892423=The program served 235 beneficiaries in 60 ALFs in July 2007. Family supplementation is not permitted. Individuals on the assisted living waiver receive a PNA of $50.00. Room and board charges are limited to $573. A three tiered payment methodology was implemented (see table below). Tiers are assigned based on three levels of service and four categories (i.e., cognitive impairments, physical impairments, nursing, and medication management) and the amount and type of service(s) the assisted living provider is responsible for delivering to the consumer., 728686=Revisions to the regulations are expected to be issued and final by the end of 2007 or early in 2008. The key areas that will be changed are medication administration and requirements for administrators. A law expanding criminal history checks is being implemented. In 2006, the legislature passed funding to create a unit that will focus on inspections of adult residential care facilities. The added staff will allow the licensing agency to inspect facilities more frequently. Survey reports are being posted as links to each facility on the Department of Health\u0092s website., 339703=Legislation permitting issuance of a two year license and increasing the licensing fee is pending before the legislature. Rules governing assisted living establishments and shared housing establishments were amended in 2004. Legislation passed in 2005 that expands shared housing establishments from 12 to 16 residents; allows licensed health professionals to administer sliding scale insulin and requires all licensing applications to be complete within six months of the initial filing. SLF rules were amended in 2005 and 2006., 194476=A Request for Proposal (RFP) was issued in 1999 by the Connecticut Housing Finance Authority \u0093to test the extent to which subsidized assisted living communities are a viable and cost effective response for frail seniors facing inappropriate nursing facility admission.\u0094 The Assisted Living Demonstration Project began in September 2004. The project is a result of collaboration between key agencies such as the Connecticut Housing Finance Authority, the Department of Economic and Urban Development, Office of Policy and Management and, the Department of Social Service. The resulting program created four affordable living projects where clients pay the room and board and Connecticut Home Care Program provides the personal care services. Two hundred nineteen (219) subsidized units have been selected thus far. At least 40% of the units must be occupied by residents with less than 50% of the median income., 328302=Personal care in assisted living was added as a state plan service in 2000. Services under a Medicaid HCBS waiver using the waiver application definition and including medication administration and assistance with personal finances was implemented in 1999. Elders, people with disabilities, and people with mental retardation, traumatic brain injuries, or developmental disabilities are eligible. Coverage was phased in across the state. The HCBS aged and disabled waiver program serves 2,231 residents living in residential or ALFs. Individuals are eligible for the waiver using the 300% SSI eligibility criteria., 649013=In January 2004, Nevada amended their HCBS waiver for the Elderly in Group Care Homes to include an assisted living service., 832390=The maximum state/county special assistance payment for room and board (this is a state SSI supplemental benefit standard that is based on the federal SSI payment and any other sources of income according to established eligibility requirements) is $1,148 a month including a $65 PNA. The Medicaid payment varies with the needs of the residents. The payment methodology was first modified in January 2004. Medicaid pays for personal care, transportation, and therapeutic leave for all eligible residents. The payment includes a basic amount for personal care (the amount varies for small and large facilities) and an additional \u0093enhanced\u0094 payment for residents with heavy care needs. Heavy care means a resident needs extensive assistance or is totally dependent in eating or toileting, or both, and/or ambulation/locomotion. Eligibility for the additional payment is based on the adult care home\u0092s assessment, which is verified by a county case manager. Medicaid also provides payment for transportation services. Legislation passed in 2005 provides Medicaid funding for residents with the primary diagnosis of Alzheimer\u0092s or a related diagnosis residing in SCUs for persons with Alzheimer\u0092s and Related Disorders (SCU-A). Beginning October 2006, facilities received a maximum payment of $1,515 based on cost reports. The average payment for FY 2006 was $428.85 for a person on special assistance aged and the average for a special assistance disabled person was $502.55., 987883=The regulations were revised in 2004. The changes included a philosophy of care, new quality assurance requirements, staff training, additional requirements for Alzheimer\u0092s dementia care units, reporting requirements, and a full functional assessment prior to admission, completed by a RN. In 2002, the rules changed the licensing category from RCFs and ALFs to ALR, added a new section for the resident agreement, increased training requirements for administrators, and made other changes., 381140=State legislation passed during the spring of 1995 prohibits sheltered care facilities from knowingly hiring, employing, or retaining any individual in a position with duties involving direct care for residents who have been convicted of committing or attempting to commit designated criminal offenses, unless a waiver has been granted by the Illinois Department of Public Health. The legislation was expanded to include SLFs in 1999., 175804=Assisted living regulations issued by the health department were last revised in June 2001. The 2007 legislature considered but did not pass changes to the state\u0092s approach which would license both the service and the setting. The current regulations take a unique approach by allowing \u0093managed residential communities\u0094 (MRCs) to offer assisted living services through ALSAs. MRCs may obtain a license to also serve as an ALSA. Rules governing medication administration in RCHs were revised in March 2002. A workgroup will be established to revise the regulations., 906083=An amendment is being prepared to cover services in affordable assisted living centers under Medicaid. Changes in 2004 require the physical plant to be designed and constructed in conformity with requirements for accessibility to physically disabled persons as established by the IBC. Rules prohibiting smoking except in a designated area were issued in 2002. An Alzheimer\u0092s Disease Special Care Disclosure Act passed in 1999., 684136=Assisted living residence-residential care means a long-term care residence providing personal assistance at the supported residential care level pursuant to RSA 151:9, VII(a)(1)., 550400=Administrators. After January 2006, assisted living managers of programs with five or more beds must complete a management training course approved by the Department that includes 80 hours of course work and an examination and may include not more than 25 hours of Internet, correspondence courses, tapes or other methods that do not require direct interaction between faculty and participants. The curriculum must cover the philosophy of assisted living; the aging process and its impact; assessment and LOC waivers; serving planning; clinical management; admission and discharge criteria; nutrition and food safety; dementia, mental health and behavior management; end of life care; management and operations; emergency planning; quality assistance and the survey process. Managers must complete 20 hours of annual training., 351787=Supportive living facility. Free-standing sites must provide apartments with 300 square feet of living space, including closets and bathroom. Apartments for individuals wishing to share the unit must have 450 square feet of living space, including closets and bathroom. Units must have a full bathroom, lockable doors, emergency call system, heating and cooling controls, wiring for private telephone, access to cable television or satellite dish, a sink, microwave oven or stove, and refrigerator and a separate bedroom for each unrelated occupant for SLFs approved for participation on or after October 18, 2004. Nursing homes converting a portion of a facility must offer apartments with 160 square feet for single occupancy and 320 square feet if two people want to share a unit., 963484=Residential Care Facilities. Medicaid also pays for services for persons who meet the nursing home LOC criteria in Level 2 RCFs. In 2007, the RCF base service rate for all clients was $949 per month. Depending on impairment level, there are three add-on levels. Base plus one add-on is $1,181; base plus two add-ons is $1,413; base plus three add-ons is $1,645. The add-on is based primarily on how dependent a person is with ADLs., 312767=Regulations were revised in March 2006. The title and scope of the regulations describes the philosophy which is \u0093to provide choice, dignity and independence to residents while maintaining a safe, humane, and home-like living arrangement for individuals needing assistance with daily activities and personal care. These rules set standards for providing services that maintain a safe and healthy environment.\u0094 The state covers services in licensed facilities under the Medicaid state plan and the HCBS waiver. Revisions to the criminal background check requirements are being developed. All facilities must install sprinkler systems by 2010 if they serve individuals who cannot evacuate safely. Life safety code requirements for small facilities were strengthened in 2006., 151153=Significant revisions to the regulations were adopted in 2005 and additional changes were approved in 2006. The revisions changed the licensing category to ALRs and added intermediate sanctions. Additional attention may focus on the qualifications for administrators, the high percentage of residents in some facilities that receive hospice services and staffing., 701124=All applicants and staff must have a criminal background check from the Department of Safety. Facilities may not employ staff who have been convicted of sexual assault, other violent crime, assault, fraud, abuse, neglect or exploitation or otherwise pose a threat to health, safety or well-being of the residents. The Department may waive these requirements in certain instances. As of July 1, 2003 prior to a final offer of employment being made, the facility must have received and reviewed the results of criminal conviction record from the division of state police., 29142=A law centralizing licensing and procedures for multiple types of entities, including assisted living homes, became law in 2004. The Assisted Living Licensing Unit was transferred from the Division of Senior and Disability Services to the Division of Public Health in 2004. Changes in the safety and sanitation requirements were effective in 2006. The Alaska BCU was created in 2007 and provides centralized background check support for programs that provide for the health, safety, and welfare of persons who are served by the programs administered by DHSS., 702343=Assisted Living: Chapter NJAC 8:36, 52320=The Governor issued an Executive Order in January 2007 directing state agencies to develop a comprehensive three year strategy to improve quality of care in nursing homes, ALFs and community settings. Most of the focus is on nursing homes. The licensing rules, established in 1998, set requirements based on the size of the facility along with supplemental requirements depending on the level of service provided. A \u0093rules committee\u0094 that includes stakeholders may be formed early in 2008 to review changes to the regulations that are still being developed. The core requirements address facilities serving ten or fewer residents, 11 or more residents, and adult foster homes which serve 1-4 residents. Facilities are licensed to provide one of three levels of care (supervisory care services, personal care services, and directed care services) and must meet supplemental requirements., 135936=Facility staff may assist with self-administration of medications and, if authorized by law, administer injections. Medications may also be administered by licensed home health agency personnel. Beginning January 2008, the new law requires direct care staff in RCFEs, excluding licensed medical professionals, to meet specified training requirements, including passing an examination, in order to be able to assist residents with the self-administration of medications. It does not authorize unlicensed personnel to directly administer medications. This law requires 16 hours of initial training on specified topics relating to medications (including eight hours of hands-on shadowing and eight hours of other training or instruction) for staff who assist residents with the self-administration of medications in facilities licensed with a capacity of 16 or more residents, and six hours (including two hours of hands-on shadowing and four hours of other training or instruction) for staff in facilities with a licensed capacity of 15 or fewer residents. The training material and exam for all RCFEs must be developed by, or in consultation with, a licensed nurse, pharmacist or physician. Each employee who received the initial training and passed the required exam, and who continues to assist with the self-administration of medications, must also complete four hours of in-service training on medication-related issues in each succeeding 12-month period., 686310=ALR-SRHCs that admit or retain an individual who has a Stage III or higher pressure area the ALR-SRHC shall have a nurse available at the ALR-SRHC as necessary to meet the needs of the resident. Individuals who require 24-hour licensed nursing care or monitoring may be served only be if the resident requires short-term medical care, which is less than 21 days, and the resident remains capable of self evacuation; requires hospice care; or qualifies as allowed by RSA 151:2, IV5 and RSA 151:9, VII(a)(2)6., 719347=Elders and people with physical disabilities are served through a Medicaid Waiver in four settings:  ALR, CPCH, ALP, or the Adult Family Care program. A total of 162 facilities serve 2,996 participants. Most of the participants are in the facility based ALRs. A law was passed requiring that facilities licensed after September 2001, set aside 10% of their units to serve Medicaid residents within three years of licensing.  The requirement is waived if there is a waiting list for Medicaid waiver services. , 941020=Residential care facility. Resident units may have individual or shared living units Facilities must include a minimum of 80 square feet per resident and limit occupancy to two residents per unit. Centralized bathing facilities must be provided for every ten residents who do not have private bathing. Toilets must be provided for every six residents. Facilities licensed, constructed or renovated after April 1, 2004 will meet accessibility requirements of the ADA under Title III as a public accommodation and the OSSC, as enforced by the Oregon Building Codes Division and local jurisdictions having authority., 678059=New rules governing ALR-SRHC were issued in October 2006. Rules for ALR-RC, a social model of care, are being processed. The description below for RCFs is based on draft regulations developed prior to a public forum and are likely to be changed before they are promulgated., 477120=Adult residential care facility: Louisiana Revised Statutes Annotated §2151 et seq.; LA administrative code title 48, §8801 et seq., 465850=Assisted Living Community. Each living unit in an ALC shall have at least 200 square feet for single occupancy, or for double occupancy if the room is shared with a spouse or another individual by mutual agreement; include at least one unfurnished room with a lockable door, private bathroom with a tub or shower, provisions for emergency response, window to the outdoors, and a telephone jack; and have an individual thermostat control if the ALC has more than 20 units. Units may be shared only by choice. Any ALC that was open or under construction on or before July 14, 2000, is exempt from the requirement for each living unit to have a bathtub or shower, or for each living unit having 200 square feet for single occupancy, or for double occupancy if the room is shared with a spouse or another individual by mutual agreement. Such communities must have a minimum of one bathtub or shower for every five residents., 201570=The state added an assisted living category in 1997. No additional rest residential homes will be licensed and most have converted to ALFs. A Medicaid waiver was implemented in 1999., 583549=Services for low income residents have been covered through the Medicaid HCBS waiver program since 1993. Rates for services are negotiated between the county and the provider with limits based on the client\u0092s case-mix classification. Coverage through the state-funded Alternate Care Program was dropped in September 2005. The HCBS waiver program served 3,486 beneficiaries in 588 facilities in FY 2007., 381585=Rules implementing the \u0093Health Care Worker Background Check Code\u0094 were effective in 2004. Health care employers will be required to establish a policy concerning employment of individuals whose criminal history record checks indicate convictions for offenses that are not disqualifying. The employer is also required to develop a policy concerning employment of individuals who have been granted waivers. The rules require the establishment to check employee status with the Nurse Aide Registry. Establishments may be fined $100 for each failure to conduct a required criminal background check., 216590=The Medicaid waiver program coverage began late in 1999., 782016=Survey reports have to specify corrective action, and surveyors sometimes get into discussions with operators regarding ideas for corrective action. The state does offer training to operators and select staff, and offered training in 2004 regarding medication management in adult care facilities., 904934=Residential care homes: 63 Oklahoma statute §1-819 et. seq.; Oklahoma rules, §310:680:1:1 et seq. Continuum of care and assisted living: 63 O.S. Supp. 1997, Section 1-890.1. et seq.; Oklahoma rules, Chapter 310:663:1 et. seq., 702454=Licensing regulations for ALRs and CPCHs were revised in February 2007. The original rules took effect in December 1993 and were updated in 1999. The regulations are \u0093intended to promote \"aging-in-place\" in a home-like setting for frail elderly and disabled persons, including persons who require nursing home LOC. ALRs, CPCHs and ALPs assure that residents receive supportive health and social services as they are needed to enable them to maintain their independence, individuality, privacy, and dignity in an apartment-style living unit or, in the case of ALPs, a living unit in publicly subsidized housing. The assisted living environment actively encourages and supports these values through effective methods of service delivery and facility or program operation and promotes resident self-direction and personal decision making while protecting residents' health and safety.\u0094 The Department of Health and Senior Services permits medication administration by unlicensed personnel through the registered professional nurse delegation process., 299046=AFCHs are covered by adult RCH regulations. Type I homes serve five or fewer residents. Rules for Medicaid coverage are available at: http://www.hawaii.gov/dhs/main/har/har_current/17-1418.pdf., 28838=Assisted living homes: Alaska Statute §47.32.010 et seq.; §47.33.01 et. seq.; 7 Alaska Administrative Code §75.010 et seq.; 7 AAC 10.010; 7 ACC 43:1058(h) Medicaid waivers: Amounts of reimbursement for HCBS, 751228=Adult care facilities: NY Social Service Law (SSL) Article 7, Title 2 Adult homes: 18 NY Codes Rules & Regulations Part 487 Enriched housing programs: 18 NYCRR Part 488 Residences for adults: 18 NYCRR Part 490 Assisted living program: NY SSL §461-1.; 18 NYCRR Part 494 Assisted living residence: 18 NYCRR Part 1001, 881236=Adult care facilities must offer 80 square feet for single occupancy rooms and 60 square feet per person in multiple occupancy rooms. Beginning December 2006, no more than two people may share a room. Existing rooms occupied by more than two residents are grandfathered but residents who move cannot be replaced if they exceed the maximum. A toilet, sink, tub/shower is required for every eight residents., 696485=A Medicaid waiver was approved in 2000 that includes assisted living. The state also provides a state SSI supplement ($817 a month federal and state) for residents of ALFs to pay for room and board. The total payment includes a PNA of $56. Assisted living coverage is available in both non-licensed subsidized housing sites and licensed facilities. The state uses a flat Medicaid payment of $2,142 a month for services in licensed ALFs. Residents receive $50 per day in non-licensed elderly housing programs, including room and board paid by the resident. Family supplementation is allowed on a case by case basis, usually to allow a resident to live in a private room. In 2007, 75 facilities served 243 residents., 426521=ALPs may have private dwelling units with lockable doors and individual cooking facilities. In facilities built before July 2001, units must have at least one room with not less than 120 square feet of floor area. Other habitable rooms must have at least 70 square feet. Each single occupancy dwelling unit in buildings built after July 2001 must have at least 240 square feet of floor area, excluding bathrooms. Units used for double occupancy must have at least 340 square feet, excluding bathrooms. The space requirements are lower for dementia units., 382189=Rules passed in November 2003 changed the process for granting waivers of the health care worker criminal history background check requirements. The new rule specifies that waiver applicants must have met all court obligations (probation, adhering to a fine or restitution schedule) and satisfactorily completed a drug and/or alcohol recovery program, if applicable. Mitigating circumstances are expanded to reference drug/alcohol rehabilitation programs, anger management or domestic violence prevention programs, completion of court-ordered obligations, and nurse registry and criminal history status in other states., 905252=Rules for assisted living centers were updated in 2007. The changes affected requirements covering medication administration, staffing of special care facilities, the complaint procedures, incident reports, plans of correction, termination of placement, and other provisions. The revisions were based on survey experience, history of complaint allegations and investigations, and public meetings held by the Long-Term Care Facility Advisory Board. The Continuum of Care and Assisted Living Act authorized two types of health care or residential settings: the continuum of care facility and the assisted living center. The continuum of care facility provides more services than are available in a typical nursing facility. The assisted living center offers a level of services between current nursing facilities and RCHs., 156308=The rules allow no more than two people to share a room for facilities built after July 1, 1986. Single occupancy rooms must have at least 100 square feet and double occupancy rooms at least 60 square feet per person. One full bathroom is required for every six residents. Cooking is not allowed in bedrooms, and facilities provide access to a food preparation area for heating or reheating food or making hot beverages subject to \u0093house rules.\u0094 Cooking may be allowed in facilities that provide apartments rather than bedrooms. Facilities that are Medicaid certified are prohibited from cooking. However, microwaves can be used if the facility has assessed the resident for his or her ability to safely use the appliance., 541962=The state administers an HCBS waiver and a state-funded program that serves beneficiaries age 50 and older in residential settings. A waiver amendment included assisted living services as part of a broad package of services available to people 50 years of age or older in their own or in residential settings. Amendments to the waiver raised eligibility to 300% of the federal SSI benefit. Room and board, paid by the resident, is capped at $420 a month. Medicaid pays the lesser of the provider\u0092s usual and customary charge or $55.74 a day for Assisted Living Level II services ($41.81 if the resident receives medical day care services) and $70.31 a day for Level III services ($52.73 if the resident receives medical day care services). The Level I licensing LOC does not qualify for the Medicaid waiver. Non-SSI beneficiaries are allowed a PNA of $64 and all additional income is applied to the cost of care. SSI beneficiaries retain SSI benefits above the amount paid for rent and do not pay toward the cost of services. The Medicaid waiver program served 1,798 beneficiaries in 975 facilities, up from 1,473 beneficiaries in 763 facilities in 2004., 132388=Legislation enacted in 1994 allows hospice care provided the resident contracts individually with a hospice agency. Facilities must request a waiver to allow hospice care and be able to meet the resident\u0092s needs when the hospice agency is not present. If the resident shares a room, the other party needs to agree to allow hospice care in the shared living space., 881711=Residential care facilities. Except for residents receiving hospice care, no RCF shall admit or retain an individual who: requires skilled nursing care that is not authorized by Section 3721.011 of the Revised Code or is beyond that which the specific facility can provide; requires medical or skilled nursing care at least eight hours per day or 40 hours per week; requires chemical or physical restraints as defined in paragraph (L) of Rule 3701-17-59 of the Administrative Code; is bedridden with limited potential for improvement; has Stage III or IV pressure ulcers; or has a medical condition that is so medically complex or changes so rapidly that it requires constant monitoring and adjustment of treatment regimen on an on-going basis., 298721=The licensing agency is developing rules that will govern licensing fees that would be deposited into a special fund that could be used for training and other activities related to licensing. Revised rules for adult RCH and extended care adult RCHs were approved in 2006., 84601=Assisted living facilities: Arkansas Annotated Code §§20-10-1701 Residential long-term care facilities: Arkansas Annotated Code §§20-76-201(b)(3), 20-10-203, and 20-10-224, 593165=The SIS or 300% eligibility option, for all Elderly Waiver recipients during state FY 2007, is $1,869. The maintenance allowance that residents retain for their expenses is $816 which includes an $82 PNA (equal to the PNA for nursing facility residents), and the remaining $737 pays for room and board costs. Any income above the $816 maintenance allowance is applied toward the cost of waiver services. Elderly Waiver participants who have a gross monthly income which exceeds 300% of SSI may not use the SIS when determining their Medicaid budget but must pay a medical spend-down (all monthly income greater than the state\u0092s Medically Needy standard for aged, blind and disabled 75% of the federal poverty level, or $613) toward all incurred medical expenses., 527177=Assisted living programs: Title 10.07.14, 891699=Medicaid waiver coverage was implemented in 2006 for individuals who receive services under a HCBS waiver who would move to a nursing home in the absence of the ALP or who live in a nursing home and relocate to an ALR (RCF). This limitation which was included in statute has limited provider participation. Legislation to allow other individuals to be covered passed in 2007. The Department of Aging website -- http://www.goldenbuckeye.com/providers/al.html -- includes information on conditions of participation; the statutory definition of assisted living services; transition services that may be covered for beneficiaries moving from to assisted living; and questions and answers about provider certification., 543931=The program served 300 participants in 2007 and 350 in 2004. Participants with incomes no greater than 60% of the statewide median income and assets no greater than $11,000 for a single person and $14,000 for a couple apply their income (less a $64 needs allowance) toward the cost of care. State-funded subsidies may cover the difference between the participant\u0092s contribution and the monthly fee, up to a maximum of $650 a month., 359286=Sheltered care facility may provide personal care, group and individual activities, assistance with self administration of medications or administration by a physician or licensed nurse. Flue shots and language assistance services were added in 2005., 873792=Changes to the RCF rules were effective in 2007 that establish new requirements for facilities serving special populations, admission/retention, staffing, training, dietary standards and fire safety. Adult care facility rules were updated in 2006. Legislation authorizing a Medicaid HCBS waiver to cover services in assisted living was passed and implemented in 2006., 1002431=The state has two waivers covering assisted living. The Community Assisted Living Waiver covers a broad range of services and includes assisted living for residents who are relocating from nursing homes. Twenty-one facilities contract with Medicaid and serve 211 beneficiaries in January 2007. Facilities receive a prospective Medicaid payment based on their customary rate not to exceed $1,800 a month, including room and board covered by SSI. The room and board charge is set by the facility. The SSI benefit, including the state supplement, standard is $1,218 in 2007. Beneficiaries retain $100 a month as a PNA. Income supplementation is not permitted. Nursing home residents receive case management to assist with relocation to the community. Case managers use community resources to address transitional expenses., 968291=Revisions to the regulations for PCHs were final in April 2005., 22619=Administrators. Legislation passed in 2001 creates a Board of Examiners for Assisted Living Administrators. All administrators must be licensed which includes passing an examination and meeting education and training requirements. Existing rules require that administrators have six hours of continuing education annually. Administrators who are licensed nursing facility administrators are exempt., 106147=The state implemented the Living Choices not italics Assisted Living HCBS Waiver Program in January 2002. Waiver \u0093assisted living services\u0094 providers must be licensed as a Level II ALF or a licensed Class A Home Health Agency who has a contract with a licensed Level II ALF to provide waiver services and pharmacy consultant services., 780967=Adult Homes. In October 2002, the state implemented new policies regarding the oversight of adult homes. These new policies include: reinforcement of mandatory death reporting by homes and immediate investigations of such reports; multi-agency created profile of deaths at the homes to identify patterns; and increased surveillance, including multi-agency teams comprised of inspectors from Department of Health, OMH and Commission on Quality of Care to complete focused surveys. These strong actions serve to further protect adult home residents and serve to make homes more accountable for the care they provide., 807730=S 56 passed the legislature in 2007 and requires development of a rating system for adult care homes., 678386=An adult family care residence is licensed any individual, agency, partnership, association or other legal entity offering two residents adult family care consisting of social or health services in a home-like environment. Such services may include, but are not limited to, providing supervision, medical monitoring, including supervision of medications and assistance with daily living activities. Any necessary clinical services and supports required by the residents may be offered or obtained by the provider. The state is revising the program and plans to expand it statewide. These rules shall apply to adult family care residences through June 30, 2007 when the pilot program will terminate. Available at: http://www.gencourt.state.nh.us/rules/he-p800.html (scroll down to he-p813)., 240311=Licensed facilities are being encouraged to register on the Agency\u0092s Emergency Status System which contains information that can be used before, during and after a disaster. The state provides for several types of ALF licensing: standard, ECC, LNS, and limited mental health services. Training requirements were updated in 2005 and elopement standards were added in 2006. In July 2003, responsibility for training administrators and service staff was transferred from the Department of Elder Affairs to private organizations., 865423=Basic care facilities. On-site, unannounced surveys are conducted by the Department to determine compliance with regulations. Chapter 341 of the Acts of 2007 requires that all life safety code related surveys of all facilities must be announced inspections; 50% of the health portion of the survey must be announced; and all surveys based on complaints must be unannounced. The Department is directed to develop a two tiered system of identifying areas of non-compliance. Plans of correction must be developed by the facility if deficiencies are found. Corrections must be completed within 60 days of the survey completion date unless the Department has approved an alternative schedule. The Department will follow-up on all plans of correction. Enforcement actions include a ban or limitation on admissions, suspension or revocation of license, or denial of license., 933169=Effective August 1, 2004, ALFs and RCFs are required to develop and implement policies on the possession of firearms and ammunition within the facility. Such policies must be disclosed to residents., 559473=Further revisions to the regulations were issued in 2006. A consumer guide was prepared and is available at http://www.mass.gov/Eelders/docs/assisted_consumer_guide.pdf., 598658=Revisions to the rules were adopted in 2005 and 2007. Regulations covering Alzheimer\u0092s disease units were adopted July 2001. The rules create two types of PCHs: assisted living and residential living. Homes licensed after August 13, 2005 must have a sprinkler system. A Medicaid waiver has been implemented., 988384=Legislation changing requirements for administrators were revised in 2006., 249643=Facilities that do not have the ECC license and were licensed after October 1999 may offer shared rooms (maximum of two per room), a bathroom for every six residents, and bathing facilities for every eight residents. Facilities licensed prior to October 1999 may allow four people to share a room., 137447=The California Department of Health Services developed an Assisted Living Waiver Pilot Project (ALWPP) in three counties: Sacramento, San Joaquin and Los Angeles, and serve 1,000 people over three years in two different settings -- licensed RCFEs and conventional elderly housing sites. The legislature wanted to test ALPs as an effective alternative to long-term placement in a nursing home. In RCFEs, services are delivered to participants by staff and in elderly housing sites, services are delivered by home health agency staff. In the summer of 2007, there were 20 licensed ALFs participating in the pilot program serving 205 participants., 201763=The regulations were revised in July 2004. The definition of a reportable incident was revised to include all occurrences and events involving abuse, neglect or financial exploitation. The changes also require emergency electrical generators in ALFs and the prohibition against facilities serving an individual with a central line from an ALF was removed by creating an exception for subcutaneous venous ports., 863294=A conversion program was implemented in 2000. The state spent approximately $3.9 million from July 1, 1999 to June 30, 2003 to develop alternatives to nursing facility care. This includes both loans and grants to 20 facilities. The legislature did not provide any additional funds for the FY 2003-2005 biennium., 843772=Basic Care Facility: NDCC Chapter 23-09.3, NDAC Chapter 33-03-24.1 Assisted living residences: Chapter 50-32 (State Law); Chapter 75-03-34 (Administrative Rules), 609080=Rules were adopted in 2001 that define Alzheimer\u0092s disease as a \u0093chronic progressive disease of unknown causes that attacks brains cells or tissues.\u0094, 202183=Changes in October 2002 added a \u0093purpose\u0094 section that describes the goal of the regulations to \u0093promote and ensure the health, safety and well-being of all residents of ALFs \u0085 to ensure that service providers will be accountable to their residents and the Department and to differentiate assisted living from nursing facilities.\u0094 It replaces the purpose statement that directs that the \u0093services are provided based on the social philosophy of care and must include oversight, food, shelter and the provision or coordination of a range of services that promote quality of life of the individual. The social philosophy of care promotes the consumer\u0092s independence, privacy, dignity and is provided in a home-like environment.\u0094, 224220=Community Residence Facilities: DC Law 5-48; DC Code §32-1301 et seq.; Chapter 34, §3400 et seq. Assisted Living Residences: DC Law 13-127 §60847 of DC Register, p. 2647, 665089=Amendments effective January 2004 to the HCBS Waiver changed the name from Elderly in Group Care Homes to the \u0093Waiver for the Elderly in Adult Residential Care\u0094 (WEARC). An assisted living waiver was also approved in 2006 to provide augmented personal care and case management to a maximum of 54 participants. Participants must meet the criteria for placement in a group care home or ALF and meet the 300% SSI eligibility criteria. To participate in this waiver, individuals must be placed from a nursing facility, hospital, or have been a participant in one of three other waivers serving the Frail Elderly, People with Physical Disabilities, and Persons with Mental Retardation and Related Conditions. There is one ALF that opened in Las Vegas. There are plans to open a second facility with the projected opening date of March 2009., 643496=Administrator. After January 1, 2005, administrators must have completed at least 30 hours of training on topics such as: resident care and services; social services; financial management; administration; gerontology; and the rules, regulations, and standards relating to the operation of an ALF. These requirements do not apply if the administrator holds an active nursing home administrator\u0092s license. Administrators must have 12 hours of on-going training related to care and facility management of the population served., 528428=ALP rules were revised in 2002 to clarify medication administration requirements and to add disclosure provisions for facilities serving residents with Alzheimer\u0092s disease. The HCBS waiver has been expanded to include all ALFs., 191914=The state provides assisted living services through ALSAs to elders in 16 state-funded congregate housing projects and three HUD facilities that have been approved as MRCs. State general revenue and Medicaid waiver funds were made available January 1, 2003, for a pilot program that serves 75 people in private ALFs. State funds are available to residents who do not meet Medicaid financial eligibility standard or functional criteria for the HCBS waiver., 647617=Revisions to the regulations were adopted in 2005 and 2006. The rules set requirements for facilities seeking to provide assisted living services based on legislation that requires licensed facilities to obtain an endorsement on its license authorizing it to operate as a residential facility which provides \u0093assisted living services.\u0094 Facilities may not market themselves as providing assisted living services unless they obtain an endorsement from the licensing agency. Facilities will provide to any potential resident a full written disclosure describing what personalized care services will be available and the amount charged for those services. Physical plant standards require independent units to contain toilet facilities and a sleeping area or bedroom. In facilities with 11 or more residents, units will be able to be shared by consent only. New core principles are described including the promotion of resident quality of life, individualized needs, and personal choice; creative and innovative service provision; resident autonomy; fostering a community atmosphere; and facility operations that minimize the need for residents to move out of the facility as resident needs change over time. Application fees will be $200. Revised minimum staff training requirements for residential facilities which provide services to persons with Alzheimer\u0092s disease are being proposed., 53217=The directed care level serves people with Alzheimer\u0092s disease or dementia who cannot self-direct their care (e.g., cannot recognize danger, summon assistance, express need, or make basic decisions). Legislation expanding the Department of Health Services\u0092 enforcement authority for overseeing training programs passed in 2005 that allows the Department to grant, deny, suspend or revoke the approval of training programs and to impose civil penalties for violations of the training requirements., 837720=Staff. Staff in adult care homes of seven of more beds who directly provide personal care or who directly supervise those who do, must complete an 80-hour personal care training and competency evaluation program established by the state. Family care home staff must have a 25-hour training program. Training must be completed within six months after hiring for staff hired after September 2003. Licensed health professionals, staff listed on the Nurse Aide Registry, or staff who document completion of a 40-45 hours or 75-80 hour training program or competency evaluation program since 1996 are exempt from this training requirement., 224909=The HCBS Medicaid waiver was amended in June 2003 to include a new category of service for assisted living. The service will be implemented after licensure regulations for assisted living are developed., 719881=Rates have been developed for each of the three licensing settings. In January 2007, the payment methodology changes from a monthly to a per diem rate. Assisted living residences receive $680.55 for room and board from the resident\u0092s monthly income, and $70 a day for Medicaid services. Assisted living programs receive $50 a day for services. Residents are charged a percentage of their income for room and board. Comprehensive personal care homes receive $680.55 for room and board, and $60 a day for services., 683524=Supported Residential Health Care. ALR-SRHC means a long-term care residence providing personal assistance at the supported residential care level pursuant to RSA 151:9, VII(a)(2)4 and RSA 151:2 -- RCF, whether or not they are private homes or other structures built or adapted for the purpose of providing residential care, offering services beyond room and board to two or more individuals who may or may not be elderly or suffering from illness, injury, deformity, infirmity or other permanent or temporary physical or mental disability., 775906=The Medicaid rates do not include room and board. For residents who qualify, residential services (room, board, and some personal care) are covered by SSI which also varies by region. In 2007, the SSI and state supplement standard was $1,264 and the PNA was $200., 552486=Applicants must document any felony conviction of the applicant, assisted living manager, or household member (in small, owner-occupied facilities). Management must conduct either a criminal history records check or a criminal background check consistent with §19-1901 et seq. Annotated Code of Maryland., 114969=Assisted living facilities. Staff must receive orientation on the following topics: philosophy of independent living in an ALR; residents\u0092 rights; abuse, neglect, and exploitation; safety and emergency procedures; communicable diseases; communication skills; review of the aging process; dementia/cognitive impairment; resident health and related problems; job requirements; medication supervision/management, and incident reporting. A minimum of six hours of on-going training a year is required. As of June 2006, the number of training hours for CNAs increased from 75 hours to 90 hours with the requirement that the additional 15 hours be spent focusing on the issues that relate to caring for persons suffering from Alzheimer\u0092s and related dementia., 743444=The HCBS Disabled and Elderly Waiver that serves elders and people with disabilities was renewed in 2006. Facilities receive a flat rate of $49.99 per day (excluding room and board). Room and board charges are negotiated between the facility and the participant. The waiver sets eligibility at 300% of the federal SSI payment. Income supplementation is allowed but the state does not have an official policy., 527294=Significant revisions to the regulations are expected to be final in 2007. Several bills were enacted into law. Chapter 452 (2006) requires that ALPs have an emergency electrical power generator on the premises by October 2009. Chapter 356 (2006) requires a uniform assisted living disclosure statement which is posted on the Department of Health and Mental Hygiene website. The disclosure describes the purpose of the statement, what is assisted living, where to find the licensing regulations, facility contact information, sources of payment accepted, levels of care, what is a resident agreement, services provider, criteria for discharge or transfer, staff training requirements, staffing patterns and where to file a complaint. Another law makes operating or owning an unlicensed facility a felony., 338190=In 2004, the Department changed the survey focus from a pure regulatory compliance survey process to a survey process that combined compliance oversight with technical assistance. The Department regularly partners with the industry to present focused training based on trends identified through the survey process. The survey process rewards well performing facilities in that they are placed on a three year survey cycle. Facilities that do not have a track record of high performance are surveyed annually until they can establish a high performing track record and earn their way on to a three year survey cycle. When significant issues are found during survey, a plan of correction is required from the facility and once the facility has remedied the problems, a follow-up survey is conducted., 566832=The state registers housing with services establishments and licenses the service provider. Chapter 282, article 19 of the Acts of 2006 made changes in the licensing of service agencies. Health care services in housing with services establishments must be provided by a Class A professional home care agency or a Class F home care agency (previously called an assisted living home care provider). The law requires that only establishments that comply with MS 144 G may use the term assisted living. A template was developed to allow consumers to compare providers. Chapter 37 of the Acts of 2003 established training requirements for assisted living home care providers and housing with services establishments that serve people with Alzheimer\u0092s disease or related disorders., 419652=Responsibility for promulgating regulations was transferred to the Department of Inspections and Appeals from the Department of Elder Affairs in 2007 (SF 601) following the transfer of oversight in 2004. Revisions to the regulations were effective April 14, 2004. During the past few years, the LOC provided has received increased attention., 386940=RCFs are licensed under the licensure category for health facilities. This licensure category also includes rules for comprehensive care facilities, commonly known as nursing homes. Senate Enrolled Act 333 (2007) requires that administrators be licensed and the development of education, experience and training requirements by the Board of Health facility administrators. Regulations were readopted in 2007. Rules for housing with services establishments were filed in 2005., 420004=Legislation passed in 2005 (HF 617) directed the Department of Human Services to prepare a Medicaid HCBS waiver application to cover assisted living. ALPs currently provide attendant care services to waiver participants., 618257=Legislation (SB 616) passed in 2006 changed the name and requirements for two types of facilities: ALFs and RCFs. New regulations implementing the bill were effective April 30, 2007. The legislation also directed the Department of Health and Senior Services to develop a new tiered payment methodology under the Medicaid state plan. The Department is preparing an HCBS waiver application to cover services in ALFs., 274253=Rules adopted in 2001 allow facilities to voluntarily adopt an internal risk management and quality assurance program. Facilities are required to file preliminary and full adverse incident reports within one and 15 days respectively. The reports are confidential as provided by law and cannot be used in civil or administrative actions, except in disciplinary proceedings by the Florida Agency for Health Care Administration or appropriate regulatory board. Facilities must also report monthly liability claims filed. The quality assurance program is intended to assess care practices, incident reports, deficiencies, and resident grievances and develop plans of action in response to findings., 528665=The uniform assessment tool was revised in 2003. The previous tool did not adequately assess and determine a LOC for people with behavior problems and dementia. As a result, more residents are likely to be assigned to Level III., 66804=Services in ALFs are covered through the ALTCS program which operates under a §1115 waiver. Program administrators originally used rates set for AFC, nursing facilities, the Oregon ALP, and the Arizona HCBS program as guidelines in setting the rates. Three classes of rates are negotiated based on the LOC: low, intermediate, and high skilled. The rates include room and board which is paid by the resident. The monthly room and board amount is the resident\u0092s \u0093alternative share of cost\u0094 (spend-down) or 85% of the current SSI payment, whichever is greater. For residents who receive SSI, the payment rate is $623.00 a month of which $512.55 is paid to the residence to cover room and board charges and $90.45 is retained by the resident as a PNA. Rates are presented in the table below. The weighted average reflects participation among the program contractors by level., 814435=Assisted living residence means any group housing and services program for two or more adults, by whatever name it is called, which makes available, at a minimum, one meal per day and housekeeping services, and provides personal care services directly or through a formal written agreement with one or more licensed home care agencies. The Department may allow nursing service exceptions on a case by case basis. Settings in which services are delivered may include self-contained apartment units or single or shared room units with private or area baths. ALRs are to be distinguished from nursing homes subject to the provisions of G.S. 131E-102. Effective October 1, 2005, there are two types of ALRs: adult care homes and adult care homes that serve only elderly persons., 111590=Persons receiving assisted living waiver services may not receive Medicaid State Plan Personal Care. Reimbursement is for services only and may not pay for room and board. The room and board rate in 2007 is $566.00., 943037=Regulations set priorities for services based on the amount of assistance needed with a specified ADL or combination of specified ADLs and cognition. Due to recent budget constraints, the priority thresholds have been changed. Eligibility had been limited to Levels 1-11 but was expanded to Levels 12 and 13 July 1, 2004., 169462=Facilities must employ sufficient staff to ensure provision of services necessary to meet resident needs including services provided under the care plan and services provided under the resident agreement. Facilities contracting with Medicaid must maintain a 1:10 staff ratio during the day and a 1:15 ratio from 7 p.m. to 6 a.m., unless a lower ratio that does not jeopardize the health and safety of residents can be documented. Facilities that are Medicaid certified and provide a secure environment must have a 1:6 ratio and awake staff at all times., 968365=Legislation passed in 2007 (SB 704) creates a licensing category for assisted living services and authorizes a statewide Medicaid HCBS waiver covering assisted living services., 576265=Medicaid waiver and state program. Participants for the Alternative Care (AC) and Medicaid waiver programs must be screened by the county pre-admission screening team and must meet the nursing home LOC criteria. The AC program, funded solely with state revenues, was implemented in 1991 and supports certain home and community services for persons age 65 and over, who are at risk of nursing home placement, have low levels of income and assets, but do not meet Medicaid financial criteria., 647413=Residential Facilities for Groups: Nevada Revised Statutes §449.017 et seq.; Nevada administrative code §449.156-2766, 459929=Changes to the certification requirements have been proposed and will be completed by the end of 2007. An ALC must be certified by the state in order to operate and market itself as an ALC. ALCs are considered private business entities. There is no public funding. A Bill (HB 174) was passed in 2001 that requires coverage of services in ALFs by long-term care insurance policies. Regulations were promulgated in 2001., 84875=Regulations establishing two levels of ALFs were finalized in 2002 and updated in 2003 and require that any newly-constructed Level II facility must comply with the requirements for I-2 Groups as specified in the International Building Code (IBC) 2000, with exceptions as listed. This regulation formerly required \u0093I-1 Groups\u0094 compliance., 844203=ALR rules addresses facilities that were marketed as assisted living but were previously not licensed. Private facilities were not required to be licensed as basic care facilities, as they were viewed as landlord/admission/retention relationships. However, as more services were provided to individuals residing in such facilities, the state decided to promulgate regulations in 2001 in order to have some oversight of the industry. The state will continually review the regulations and make revisions as necessary as their knowledge of the industry grows., 932485=The moratorium on the licensing of new ALFs and RCFs was extended until June 30, 2009. Licenses may be issued to: applicants who submitted construction plans prior to August 16, 2001; facilities applying for a renewal license or changing ownership, but are not increasing capacity; facilities that are relocating within the service area; or a Continuing Care Retirement Community that provides care to residents within its closed system. New applicants requesting licensure must demonstrate that the proposed facility will serve a population for whom insufficient services exist in the service area. The rule now allows facilities to request an increase in capacity by 10%., 189=PDF Version: http://aspe.hhs.gov/daltcp/reports/2007/07alcom3.pdf (409 PDF pages), 860685=The state has revised the point system. Some point factors have decreased and others increased based upon a retrospective review of plans of care and determination that some services take more time than others. The state implemented the revised point system in mid 2004., 873466=Residential care facilities, Ohio Revised Code Annotated §3721 et seq.; Ohio administrative code §3701-17-50 et seq. Adult care facilities, Ohio Revised Code Annotated 3722 et seq.; Ohio Administrative Code Chapter 3701-20-01 et seq., 493613=Minor revisions to the regulations were made in 2006. Legislation is pending that would provide injunctive relief to intervene with unlicensed facilities and to set maximum fines that may be imposed for licensing violations., 716383=\u0093Managed risk\u0094 means the process of balancing resident choice and independence with the health and safety of the resident and other persons in the facility or program. If a resident\u0092s preference or decision places the resident or others at risk or is likely to lead to adverse consequences, such risks or consequences are discussed with the resident, and, if the resident agrees, a resident representative, and a formal plan to avoid or reduce negative or adverse outcomes is negotiated, in accordance with the provisions of N.J.A.C. 8:36-4.17., 39516=An assisted living home shall offer three balanced, nutritious meals and at least one snack daily at consistent times. A home shall ensure that the meals and snacks offered include the recommended number of servings of each food type set out in the USDA publication, The Food Guide Pyramid, as revised October 1996 and adopted by reference. The home shall offer a wide variety of food that includes fresh fruits and vegetables as often as possible. Additionally, the home shall consider each resident\u0092s health-related or religious restrictions, cultural or ethnic preferences in food preparation, and preference for smaller portions, as reflected in the resident\u0092s residential services contract., 224486=The Assisted Living Residence Regulatory Act was passed in June 2000. Licensing is expected to begin in 2007. The assisted living law includes a philosophy of care that emphasizes personal dignity, autonomy, independence, privacy, and freedom of choice. The services and physical environment should enhance a person\u0092s ability to age in place in a home-like setting by increasing or decreasing services as needed., 440414=Regulations are being reviewed in 2007. Minor revisions are expected to be made in 2008. Licensing rules were last amended in October 1999 and the recent focus has been on monitoring, training and improving outcomes. The licensing law creates an overall framework for adult care homes which includes nursing facilities, nursing facility for mental health, ICF-MR, ALF, residential health care facility, home plus, boarding care home, and ADC facility. The regulations differentiate among the categories of adult care homes., 90916=The Living Choices Assisted Living 1915(c) Waiver Program was implemented in 2002. Legislation revising Alzheimer\u0092s special care standards passed (HB 1407) in 2001. Personal care services are covered under the state plan for Medicaid beneficiaries., 616450=The administrator and all direct care staff must document that they are not listed on the Nurses Aide Abuse Registry. Effective October 2003, a criminal background check must be completed for all new employees who provide direct patient care or services and employees employed prior to July 2003 who have documented disciplinary action by the present employer. The regulations list 14 offenses for which a person may not be employed., 446741=Each facility must offer apartments which include areas for sleeping, living, storage, kitchen (with sink, refrigerator, stove or microwave, and space for storage of utensils and supplies), and bathroom. They must also offer at least 200 square feet of living space, excluding bathroom, closets, lockers, wardrobes, other built-in fixed items, alcoves, and vestibules. Facilities licensed prior to January 1, 1995, as an intermediate personal care facility, are not required to offer kitchens and private baths., 5292=Assisted Living: Chapter 420-5-4, Alabama Department of Public Health Specialty Care Assisted Living Facilities: Chapter 420-5-20, 164831=Changes adopted in 2006 allow ALRs to establish a policy, that meets the criteria in the regulations, to accept donated medications to be re-dispensed by a pharmacist., 618682=Legislation passed in 2007 (SB 952 and SB 674) requires facilities licensed or completing major renovations after August 28, 2007 to install a sprinkler system. Facilities that serve individuals who cannot evacuate the facility with minimal assistance must have a sprinkler system. A loan fund to install sprinklers was created to help facilities that serve Medicaid beneficiaries., 829225=Effective October 2000, medication aides who administer medications and staff supervising the administration of medications must successfully pass a written examination prior to or within 90 days of completing a clinical skills validation portion of a competency evaluation. Medication aides and their supervisors must complete six hours of continuing education related to medication administration annually. A licensed pharmacist, prescribing practitioner, or RN must perform at least a quarterly review of each resident\u0092s medications and the facility\u0092s medication policies and procedures, or more frequently as identified by the Department based on documentation of specific medication problems in the facility., 165052=Services in \u0093alternative care facilities,\u0094 the Medicaid term for assisted living, have been covered since 1984 under a 1915(c) waiver for elders, people with disabilities, MR/DD, and people with mental illness. Medicaid rules limit room and board charges for Medicaid recipients to $571 a month. The Medicaid rate for services is $47.58 a day. The rate covers oversight, personal care, homemaker, chore, and laundry services. A pilot program tested the impact of an enhanced rate to create incentives to retain people as their needs increased and to accept residents with greater needs from nursing homes and hospitals. An additional $400 per month was available for residents who have enhanced needs in three of four areas: personal care, mobility, incontinence, and behavior/confusion. A tiered rate methodology was developed but has not yet been adopted., 844951=Adult family foster care is covered by the Medicaid HCBS waiver and standards are set by the Department of Human Services. It is defined as an occupied private residence in which foster care for adults is regularly provided by the owner or lessee thereof, to four or fewer adults who are not related by blood or marriage to the owner or lessee, for hire or compensation. The rules are available at http://www.legis.nd.gov/information/acdata/pdf/75-03-14.pdf and http://www.legis.nd.gov/information/acdata/pdf/75-03-21.pdf., 968160=Personal care homes: 55 PC Chapter 2600 and Chapter 20, 502113=Level I-IV RCFs must offer 100 square feet for single rooms and 80 square feet for double rooms. Level IV facilities provide one toilet and sink for every six residents. Facilities licensed on or after May 30, 2002, must have one bathing facility for ten users (one for 15 residents for facilities licensed prior to May 30, 2002). No more than two residents may share a room., 437293=State rental assistance program. This program works like HUD\u0092s Section 8 program and pays rental expenses for low income beneficiaries who do are on a waiting list for a federal, state or local rent subsidy. Beneficiaries pay 30% of their income for rent. The program can pay the difference between the tenant\u0092s payment and the fair market rent set by HUD. Participants must be eligible for waiver services. The average duration of the subsidy is 12 months and the average payment is $152 per month. In FY 2007, 1,635 Medicaid beneficiaries received subsidy payments., 329995=State supplementation to the SSI program has been phased out. In 2002, the Legislature directed the transition of individuals who were receiving the supplemental grant to the Medicaid state plan. Supplementation for the room and board payment is allowed in all categories. A uniform assessment instrument is used to determine the unmet ADL needs for all applicants. The unmet needs are converted to a payment that is available to the beneficiary regardless of where he or she lives: in assisted living or their own home or apartment. The process was developed to eliminate differences in payment and service delivery depending on where a person lived., 981884=The SSI/state supplement payment in PCHs is $1,062.30, which includes a PNA of $60 a month. In July 2007, there were 8,818 SSI beneficiaries in 1,537 licensed PCHs., 410378=The Residential Care Assistance Program is a state-funded program that covers limited services for residents who are aged, blind, mentally ill or disabled, low income, and/or cannot live alone but do not qualify for nursing home care. Payments are based on a flat rate. County home (housing with services establishments) rates are $27 per day for room, board, laundry, housekeeping, and limited oversight. Private RCF rates are $39.35 per day. Nineteen county homes and 42 RCFs served 418 county home residents and 1,121 people in private RCFs respectively as of March 2004., 597173=Housing with services establishment registration fees were increased to $155 effective July 1, 2007. Chapter 282 requires a surcharge based on the capacity of the establishment to be determined by the Department of Health to pay for the costs of bringing actions for injunctive relief. Class F home care service agencies pay a graduated fee based on average census:, 583962=Coverage of services in residential settings was changed July 1, 2007 based on legislation passed in 2006 and 2007. Services in residential settings are now called \u0093customized living services\u0094 and \u009324-hour customized living services.\u0094 Rates are negotiated within caps based on the case-mix classification system (see table) and are based on the service to be delivered rather than a base rate. Customized living service is a package of component services individually designed to meet the assessed needs of a waiver participant living in a qualified setting.3 The components can include home management tasks, supportive services, home care aide tasks, home health aide-like tasks, central storage of medications, incidental nursing services and supervision., 488990=A four-year pilot program approved by the legislature in 1997 to test the feasibility of covering assisted living under Medicaid has been deferred by budget problems but is still under consideration. Legislation passed in 2000 extended authority for the project until 2005. The project intended to serve 60 people in two sites. The project will include two ALFs and serve elderly Medicaid beneficiaries who can no longer live at home because they need additional care with ADLs but do not require continuous nursing care and have no alternative under the traditional model except institutional care. The pilot \u0093shall maximize the independence of the elderly while providing the assistance that the special needs of this population require.\u0094 The Bill defines assisted living as \u0093a residential congregate housing environment combined with the capacity by in-house staff or others to provide supportive personal services, 24-hour supervision and assistance, whether or not such assistance is scheduled, social and health-related services to maximize residents\u0092 dignity, autonomy, privacy, and independence and to encourage facility and community involvement.\u0094 Residents must be offered a chance to live in private quarters with a lockable door, bedroom, kitchenette, and bathroom., 369127=A moratorium on new applications was removed. The program has 81 operating SLFs with 4,681 participants in 2007. The program targets \u0093lighter\u0094 care nursing home eligible residents with a DON score (see below) between 29 and 47 on a 100-point scale. Residents with scores above 47 may be served if the facility has the capacity to do so., 751658=Regulations implementing the law establishing ALRs are expected to be final in 2007. The regulations will license ALRs, special needs ALRs and enhanced ALRs. All three new categories must have an adult home license. No facility will be able to use the term assisted living unless they have a new license., 6067=The state implemented a system for rating facilities in 2004. Using survey findings, facilities are rated green if they have minor deficiencies; yellow if they have a problem that could pose a substantial risk to residents; or red if the survey found serious risk to residents. Facilities rated red receive full surveys. About 10% of the facilities receive a \u0093green\u0094 rating; 30% receive a \u0093red\u0094 rating and require further action and the rest are rated \u0093yellow.\u0094 Shorter surveys are conducted for facilities rated green or yellow. See sample at the end of the summary. General survey findings and a profile score are posted on the licensing agency\u0092s website., 409605=Medicaid contracting requirements provide for private apartments, shared only by choice, square footage, meal preparation, temperature controls, and door locks that differ from the licensing rules. A three-tiered payment system has been developed based on points from the assessment process. Rates have increased since 2004 (see table below). The rates do not include room and board. The SSI payment maximum is currently $623 (less a $52 PNA). The state has not issued a policy on family supplementation. The waiver uses the definition and covered services included in the HCBS waiver preprinted format: case management, RN oversight, personal care, homemaker, chore, attendant care, companion, medication oversight, and therapeutic and recreational programming., 341924=Changes to the sheltered care facility rules were made in 2006 and 2007 that modify requirements for criminal background and sex offender registry checks for residents., 107395=As of January 2006, an amendment made to Medicaid modified the waiver prohibiting the coverage of pharmaceutical drugs already covered under Medicare Part D., 318143=Facilities licensed after July 1, 1992, must not have more than two residents in each bedroom and provide 100 square feet of floor space per single-bed room and 80 square feet per resident in multi-bed rooms. There must be at least one toilet for every six persons, residents, or employees, and at least one tub or shower for every eight persons, residents, or employees. New construction must meet the requirements of the ADA Accessibility Guidelines and the Life Safety Code. Existing facilities must remove as many barriers as possible without creating an undue burden on the facility., 633266=A Medicaid HCBS waiver was implemented in July 1998. Waiver assisted living services are available to elders and people with disabilities. The state uses a flat rate system that varies for urban/rural facilities, trust fund facilities and single/double occupancy (see table below). The Assisted Living Waiver Standard of Need is $623 from which beneficiaries retain a PNA of $60 and $563 is paid for room and board. Family supplementation for a larger unit is not allowed., 703740=Regulations creating ALPs in subsidized housing sites were effective in August 1996 that permit licensed service agencies to deliver services in subsidized elderly housing projects. Creating this category allows nurses to delegate medication administration, which is not allowed for regular HCBS providers., 425387=\u0093Assisted living means provision of housing with services which may include, but are not limited to, health-related care, personal care and assistance with IADLs to six or more tenants in a physical structure which provides a home-like environment. Assisted living also includes encouragement of family involvement, tenant self-direction, and tenant participation in decisions that emphasize choice, dignity, privacy, individuality, shared risk, and independence. Assisted living includes the provision of housing and assistance with IADLs only if personal care or health-related care is also included\u0094 (96 Acts, Chapter 1192). SF 2193 modified the definition by including housing and IADLs only if personal care and health-related services are included., 262307=Coverage of ACS under the state plan was implemented in September 2001 in all ALFs and in AFHs in January 2002. ACS includes health support; assistance with ADLs; assistance with IADLs and assistance with self-administration of medication. This Medicaid program is optional state plan service for individuals in ALFs, AFCHs, and RTFs. The payment rate is $9.28 for each day the recipient was receiving services in the facility., 308902=Assisted living was added as a Medicaid waiver service in 2000 for elders and people with disabilities. ALFs and extended adult residential care homes (E-ARCH) may participate. One ALF contracts with Medicaid and serves five residents. Eighty E-ARCH homes serve approximately 1,400 Medicaid beneficiaries. The state offers a flat rate of $66.77 a day for services in ALFs. The monthly SSI payment is $623 for assisted living residents who qualify for SSI., 982058=SB 704, passed by the legislature in 2007, authorizes coverage of waivers services in ALRs with priority for prospective or current residents facing imminent admission to a nursing facility., 278330=ORS formed a workgroup to develop a system for profiling or rating facilities using survey findings. A five tiered rating will be tested that includes a rating for the most recent survey and a cumulative rating, most likely composed of the two most recent surveys, to show changes over time. The system will help compare facilities with very few but serious citations to those that may have multiple less serious citations. The rating system is expected to be available on the agency\u0092s website in early 2008. Rules for a new category, community living arrangements, were issued in 2002 and serve people with mental health needs, developmental disabilities and addictive diseases. The Department of Community Health administers a CON requirement for facilities with 25 or more residents., 477338=The regulations for adult residential care facilities, which include ALFs, were initially approved in 1999, and created core requirements for adult residential care facilities plus three modules for ALFs, PCHs, and shelter care facilities. The modules contain separate requirements for administrators, staff training, and living units. The rules state that the purpose of the regulations is to promote the availability of appropriate services for elderly and disabled persons in a residential environment; to enhance the dignity, independence, privacy, choice, and decision making ability of the residents; and to promote the concept of aging-in-place., 704194=All new construction is purpose-built, apartment-style units. Only facilities licensed by the Department of Health and Senior Services prior to December 1993, the effective date of the assisted living regulations, can convert to CPCHs and offer bedrooms rather than apartment-style units with a kitchenette. The state has adopted an expedited CON review for ALRs., 269107=Administrators must be at least 21 years old, have received a high school diploma or GED, or have been an administrator for one of the last three years of a licensed Florida ALF that met minimum standards. Effective July 1997, administrators must complete a competency exam following completion of ALF core training. Administrators must undergo Federal Bureau of Investigation (FBI) and Florida Department of Law Enforcement (FDLE) background screening., 526833=Chapter 1664 sets fees of $10 per bed for RCFs and $200 for ALPs., 123678=AB 609 was enacted into law in 2006 and requires additional training on assistance with self-administration of medications that will take effect in 2008. A series of changes are being implemented following passage of several bills by the legislature. The changes replace the exceptions requirements for facilities serving people with health conditions with requirements for documentation, staff training and oversight, add requirements for special care facilities, and admissions agreements., 924566=An amendment to cover assisted living under a Medicaid HCBS waiver is being prepared in 2007. A three tiered payment system is anticipated. Room and board would be limited to the SSI benefit. The maintenance allowance for individuals eligible under the 300% of SSI option would be set at 150% of the SSI benefit. Additional standards for waiver providers are being discussed with the Department of Health., 452387=Medicaid waiver services have been available since 1997 to elderly recipients who meet the nursing home LOC criteria and have income below 300% of the federal SSI payment. The room and board amount is negotiated between the facility and the resident. SSI beneficiaries retain a $30 PNA., 807842=Rules were amended in July 2005. Further revisions will be made by the spring of 2008 that will address assessment and care planning, staff training, staffing, SCUs and disclosure. SB 622, passed in 2005, required an initial six-month license, mandatory training for county monitoring agents and increased fines for violations. Licensing requirements adopted in 1995 and 1996 established the umbrella term of \u0093assisted living residences\u0094 for two types of long-term residential care settings: (1) adult care homes; and (2) multi-unit assisted housing with services which are not licensed, but must be registered with the state. Adult care homes are divided into different types based on size -- family care homes for 2-6 residents and adult care homes for seven or more residents. The legislative intent behind licensure for adult care homes is to ensure that facilities provide services that assist the residents in such a way as to assure the health and safety of residents, quality of life, and maximum flexibility in meeting individual needs and preserving individual autonomy., 236115=Assisted living residences. Medicaid HCBS waiver coverage will be implemented in 2007. The Assisted living services include PCA services, homemaker, chore aide, attendant care, medication administration, therapeutic social and recreational services, transportation and intermittent skilled nursing. Participating facilities will receive $60 a day for services. The SSI payment standard will be $1,869 and residents will retain $100 for personal needs., 21766=A Medicaid waiver to cover people with dementia in assisted living was approved in 2003 but was not implemented due to budget limitations., 955989=The state contracted with 172 ALFs and served 3,870 beneficiaries compared to 170 facilities and 3,731 beneficiaries in December 2004. The program also contracted with 156 RCFs and served 2, 113 residents in 2007. The state has an active program to identify and relocate nursing home residents to assisted living and other community settings. Beneficiaries relocating from nursing homes may receive cash grants or may be granted income exemptions to pay for transition expenses., 408887=In 2004, 14 facilities were approved for the waiver program and 71 beneficiaries were served. The number of participating facilities grew to 43 in the summer of 2007 after rates were increased. The number of participants was not reported. Licensed facilities must meet additional requirements for private bedrooms and baths, and a number of additional service requirements. Existing unlicensed ALFs that have submitted a disclosure form and are considered housing with services establishments and meet the waiver program requirements have not expressed an interest in becoming waiver providers because they would need to become licensed, and would need to serve a much higher acuity population than desired., 368251=Supportive living facilities. The state has implemented a program to serve elders and adults with disabilities who are Medicaid waiver beneficiaries in SLFs (see http://www.slfillinois.com). SLFs are certified. For Medicaid residents, participating facilities must be willing to accept the SSI rate, $623 a month in 2007 (less a $90 PNA) as payment for room and board. The service payment is based on 60% of the average nursing facility rate paid in the region. SLFs may be certified as eligible Food Stamp vendors and receive these benefits for eligible residents. Room and board charges are limited $533 for single occupancy and $377 per person for shared occupancy. Income supplementation is allowed. Funding for services is included in the Medicaid nursing home budget and is not part of a separate appropriation., 808932=Several pieces of legislation were enacted in 2001 requiring development of an adult care home QI consultation program; an assessment tool to measure quality of care; and separate cost reports for special care and non-SCUs for facilities with SCUs. The QI consultation program and assessment tool have not been implemented to date but are being piloted., 844016=The Department of Health establishes rules for basic care facilities. The Department of Human Services oversees licensing and rules for ALRs. Minor revisions were made in 2006., 658429=Residents are considered Care Category 1 (ambulatory) and Care Category 2 (non-ambulatory). Ambulatory residents are physically and mentally capable of moving unassisted from an unsafe area to an area of safety within four minutes. Non-ambulatory residents require the assistance of at least one other person to move to a safe area within four minutes. Facilities licensed prior to January 1, 1997, are not required to meet requirements for installing automatic sprinkler systems unless they seek to serve Category 2 residents. Sprinklers must be installed prior to a change of ownership, an increase in licensed beds, or admission of non-ambulatory residents. Requirements for hard-wired smoke detectors with battery back up are also waived for small homes unless the above changes are proposed., 611323=A Medicaid waiver was implemented as a pilot program in seven counties in 2001 to serve older adults, people with disabilities, and people with dementia. Services included in the payment are personal care; homemaker services; chore services; attendant care services; medication oversight; therapeutic, social and recreational programs; intermittent skilled nursing services; transportation and attendant call systems. In 2006, coverage was expanded statewide. Fourteen facilities contract with the Medicaid program and serve 200 residents. Facilities receive a per diem rate of $33.18. The rate was developed based on case-mix adjusted rates paid to nursing homes for less impaired residents (PA1 and PA2). Average rates were computed for four nursing home rate components: direct standard care, care related rate, administrative costs, and operating costs. The payment rate consists of 40% of the direct care standard, 10% of the care related rate, and 50% of the administrative and operating rates. The remaining nursing home costs were considered to apply to room and board costs which are not covered by the Medicaid service rate.}",
    "lastModified": "Thu, 14 Apr 2011 20:19:38 GMT",
    "textBeforeTable": "The Department of Human Resources, Adult Protective Services unit sets policy, standards and oversight for adult foster homes that serve one resident. Adult Foster Care The Department of Health is evaluating whether the regulations adequately address safety related issues (e.g., if residents have recurring problems with falls) should the rules limit admission/retention or should the staffing and training requirements be changed. The Department, Board of Nursing and Legislature are considering proposals to allow unlicensed staff to administer medications either through nurse delegation or creation of medication technician category. The state implemented a system for rating facilities in 2004. Using survey findings, facilities are rated green if they have minor deficiencies; yellow if they have a problem that could pose a substantial risk to residents; or red if the survey found serious risk to residents. Facilities rated red receive full surveys. About 10% of the facilities receive a \u0093green\u0094 rating; 30% receive a \u0093red\u0094 rating and require further action and the rest are rated \u0093yellow.\u0094 Shorter surveys are conducted for facilities rated green or yellow. See sample at the end of the summary. General survey findings and a profile score are posted on the licensing agency\u0092s website. Specialty care facilities must receive a separate certification from the Board of Health. Family ALFs serve 2-3 adults. Group ALFs serve 4-16 adults; and Congregate ALFs serve 17 or more adults; Sections of the regulations governing building requirements for ALFs and specialty care facilities were revised in July 2003.",
    "textAfterTable": "Supply Category 2007 2004 2002   Facilities   Units   Facilities   Units   Facilities   Units Assisted living facilities   219   7,021   241   7,260   302   9,140   Specialty care facilities 88 2,488 94 2,616 25 598 Definition \u0093Assisted living facility\u0094 means an individual, individuals, corporation, partnership, limited partnership, a limited liability company or any other entity that provides or offers to provide residence and personal care to two or more individuals who are in need of assistance with ADLs. Exceptions to this definition are: Individuals who provide residential and personal care services solely to persons to whom they are personally related, shall not be deemed to be an ALF. This exception is only for individuals, and does not apply to corporations, partnerships, limited partnerships, limited",
    "hasKeyColumn": true,
    "keyColumnIndex": 1,
    "headerRowIndex": 0
}