{
    "relation": [
        [
            "Patent application number",
            "20120158954",
            "20120215621",
            "20140194208",
            "20140250223"
        ],
        [
            "Description",
            "METHODS AND APPARATUS TO DETERMINE IMPRESSIONS USING DISTRIBUTED DEMOGRAPHIC INFORMATION - Example methods and apparatus to determine media impressions using distributed demographic information are disclosed. A disclosed example method to monitor media content exposure involves receiving, at a first internet domain, a first request from a client computer, the first request indicative of access to the media at the client computer, sending, from the first internet domain, a response to the client computer, the response to instruct the client computer to send a second request to an intermediary associated with a sub-domain of a second internet domain, the second request to be indicative of the access to the media at the client computer, the intermediary to transmit an indication of the second request to an entity of the second internet domain, and logging an impression of the media.",
            "METHODS AND APPARATUS TO DETERMINE MEDIA IMPRESSIONS USING DISTRIBUTED DEMOGRAPHIC INFORMATION - Example methods involve based on a first request to log a first media impression, generating a first identifier associated with a first client device that generated the first request, and sending a communication to the first client device. The communication includes the first identifier, and the communication is to cause the first client device to send the first identifier associated with the first client device to a database proprietor in association with a cookie identifier of the first client device. Second media impressions are logged in association with the first identifier of the first client device and second identifiers associated with second client devices based on second requests received from the first and second client devices. A batch including the second media impressions and the first and second identifiers is sent to the database proprietor. Demographic information associated with the second media impressions is received from the database proprietor.",
            "SYSTEMS AND METHODS TO IDENTIFY CANDIDATES FOR TARGETED ADVERTISING IN AN ONLINE SOCIAL GAMING ENVIRONMENT - Systems and methods to identify candidates for targeted advertising in an online social gaming environment are disclosed. Example methods include generating a network graph representative of relationships between users associated with an online social gaming environment, the relationships based on connections between the users. Example methods also include collecting first social gaming data corresponding to participation by a first user and a second user in the online social gaming environment during a first period of time. The example methods further include calculating a first degree of influence of the first user of the online social gaming environment on the second user of the online social gaming environment, the first degree of influence based on the first social gaming data.",
            "METHODS AND APPARATUS TO DETERMINE IMPRESSIONS USING DISTRIBUTED DEMOGRAPHIC INFORMATION - Methods and apparatus to determine media impressions using distributed demographic information are disclosed. An method includes sending to a client computer, via a processor serving a first internet domain, a response to a first request, the first request sent to the first internet domain and indicative of access to media at the client computer, the response to instruct the client computer to send a second request to an intermediary serving a sub-domain of a second internet domain, the second request to be indicative of the access to the media at the client computer, wherein the intermediary is to transmit first data about the second request to a data collection server of an audience measurement entity and second data about the second request to an entity of the second internet domain and logging an impression of the media."
        ],
        [
            "Published",
            "06-21-2012",
            "08-23-2012",
            "07-10-2014",
            "09-04-2014"
        ]
    ],
    "pageTitle": "Steven John - Patent applications",
    "title": "",
    "url": "http://www.faqs.org/patents/inventor/steven-john-7/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042981856.5/warc/CC-MAIN-20150728002301-00049-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 444270959,
    "recordOffset": 444252585,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Steven John Splaine, Tampa, FL US 12-08-2011 Microwave-Refrigerator Unit - Microwave-refrigerator units are disclosed. In one aspect, a microwave-refrigerator unit may include a weatherproof exterior. A microwave may be included within the weatherproof exterior. A refrigerator may also be included within the weatherproof exterior. The refrigerator may be coupled with the microwave. Other microwave-refrigerator units are also disclosed, as are methods of using microwave-refrigerator units. 20110300272 04-02-2009 Microwave-refrigerator unit - Microwave-refrigerator units are disclosed. In one aspect, a microwave-refrigerator unit may include a weatherproof exterior. A microwave may be included within the weatherproof exterior. A refrigerator may also be included within the weatherproof exterior. The refrigerator may be coupled with the microwave. Other microwave-refrigerator units are also disclosed, as are methods of using microwave-refrigerator units. 20090084778 Published Description Patent application number Steven John Smario, Walnut Creek, CA US 09-18-2014 METHOD AND SYSTEM FOR SPECIFYING THE LAYOUT OF COMPUTER SYSTEM RESOURCES - A method for specifying the layout of computing system resources includes receiving a request for a virtual machine, the request comprising a processor requirement and a memory requirement, gathering resource groupings, each resource grouping comprising a latency penalty between a processor and at least a memory. The method further includes calculating a proportionality for each resource grouping, wherein the proportionality comprises a minimum of: an amount of the processor requirement the resource grouping can satisfy and an amount of the memory",
    "textAfterTable": "Steven John Stoackley, Salisbury GB Patent application number Description Published 20100252690 AIRCRAFT - An unmanned aerial vehicle (UAV) in the form of a “tail sitter” flying wing adapted for vertical take off and landing and transitions between flight as a helicopter and wing-borne flight. The vehicle is electrically powered from onboard batteries and equipped with rotors on miniature helicopter rotor heads at the tips of the wing for both lift, during take off and landing, and forward thrust. In planform the wing comprises, to each side of its longitudinal axis, an inner section with swept back leading and trailing edges, and an outer section with a leading edge more perpendicular to the longitudinal axis, being only mildly swept back or substantially unswept, and a swept forward trailing edge. 10-07-2010 Steven John Suchting, Cambridge GB Patent application number Description Published 20120310203 APPARATUS AND METHOD - This invention relates to medical devices for labelling a syringe filled from an ampoule, and to safer devices for filling a syringe from an ampoule, and to associated methods. We describe a device for attaching to an ampoule to label a syringe filled from the ampoule, the device comprising: an ampoule-mounting portion for mounting the device to a filled ampoule; a syringe-fitting portion to enable the device to be fitted onto said syringe; and a label holder to hold a label for contents of said ampoule;",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}