{
    "relation": [
        [
            "Construct",
            "Intention",
            "Attitudinal beliefs",
            "Personal normative beliefs",
            "Social normative beliefs",
            "Facilitating conditions",
            "Habit"
        ],
        [
            "Number of items",
            "3",
            "7",
            "6",
            "6",
            "3",
            "4"
        ],
        [
            "Internal consistency (Cronbach's alpha)",
            "0.85",
            "0.81",
            "0.86",
            "0.82",
            "0.75",
            "0.87"
        ]
    ],
    "pageTitle": "Implementation Science",
    "title": "",
    "url": "http://www.pubmedcentral.nih.gov/oai/oai.cgi?verb=ListRecords&set=implemsci&metadataPrefix=pmc",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042982745.46/warc/CC-MAIN-20150728002302-00214-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 669362811,
    "recordOffset": 669155898,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{37821=During the survey period (May 2002 to 1st April 2005), which formed the final stage of a full process evaluation of EPP [6], a total of 1543 courses were run, with PCTs administering an average of five courses. Thirty PCTs (10%) had run more than eight courses, with 17 courses being the maximum number. The majority of PCTs (204, 68%) had run between four and eight courses. However, 65 PCTs (22%), a significant minority, had run less than the required four courses they had been funded to carry out. Further, of those 65 PCTs, 18 plan to run fewer than four courses in the present financial year. A total of 300 courses were cancelled during the survey period – 84 PCTs (29%) had to cancel two or more courses – with poor recruitment being by far the most commonly reported contributory factor (in 92% of cases), and appearing to be a universal problem., 3910=Searches were conducted in two data-bases (Pubmed, Cochrane Library) and in selected journals. Reviews were included, if these were based on a systematic search, focused on rigorous evaluations of organizational changes, and were published between 1995 and 2003.}",
    "TableContextTimeStampAfterTable": "{579774=Detailed planning for the intervention strategies will take place between February and July 2003. We will initiate each of the interventions in August, 2003 and conclude them in March, 2004., 107980=A national, postal survey of PCT EPP Leads was undertaken in order to examine both the evolvement of EPP during its pilot stage and future plans for the programme. A questionnaire was sent out to the 299 PCTs known to have committed to the EPP pilot, and an excellent 100% response rate was obtained over a 3-month period (April-July 2005). One marker of success of the Expert Patients Programme implementation is the actual running of courses by the Primary Care Trusts. This paper explores the extent to which the implementation of the pilot can indeed be viewed as a \"success,\" primarily in terms of the number of courses run, and considers the extent to which PCTs have carried out all that they were committed to do. Findings suggest that the more time an EPP Lead dedicates to the Programme, the more likely it is that EPP has run successfully in the past, and the more likely it is that it will continue to run successfully in the future. Other factors indicating future EPP success include collaborating across PCTs to share co-ordinators, tutors, and funding., 748718=We thank the opinion leaders named by the primary care physicians for this study (Drs. Paul Greenwood, Zaheer Lakhani, TK Lee, Michelle Graham, and Randall Williams) in the Edmonton region; Calgary opinion leaders are still being elicited as the survey was mailed to primary care physicians in the Calgary region in mid-March, 2006. FM and SM hold career salary support from the Alberta Heritage Foundation for Medical Research (AHFMR) and the Canadian Institutes of Health Research. FM and RT are supported by the Merck Frosst/Aventis Chair in Patient Health Management at the University of Alberta. WG is supported by the AHFMR and a Canada Research Chair., 578558=The parents of all children evaluated in, or admitted to each of the 24 hospitals with a diagnosis of croup between September and May during the baseline, intervention, and follow up periods will be approached to participate in a follow up telephone survey by a staff nurse. A log of all children diagnosed to have croup will be maintained to allow the comparison of those children enrolled to those not enrolled., 580972=We are just completing an audit of medical records of children diagnosed to have croup based on ICD9 coding from April 1st, 1994 to March 31st, 2000. By late 2006, we will repeat an identical audit of medical records of children diagnosed as having croup between April 1st, 2000 to March 31st, 2006. This timetable for extraction of data provides the above delineated advantages., 107494=The NHS' official Expert Patients Programme website presently states that, \"Pilot EPP courses began at 26 NHS PCT sites across England in May 2002, and by May 2004 approximately 300 PCTs had either actively implemented pilot courses or had committed to joining. The majority of PCTs are now coming to the end of the pilot phase, with many implementing plans to make EPP sustainable for the long-term.\" The NHS website heralds the pilot \"a success.\", 120750=A total of 1305 courses have been planned for the 2005–06 financial year, with a total budget of £1,565,085 being assigned to EPP. So, it would seem that the more time an EPP Lead dedicates to EPP, the more likely it is that EPP has run successfully in the past, and the more likely it is that it will continue to run successfully in the future., 714704=** Medications in use at the time of the cardiac catheterization (no data available on prescriptions in follow-up). [Colleen Norris, personal communication, August 2003], 732327=Randomization will take place 1:1:1 at the level of the practice (either individual physician for solo practitioners or clinic for those physicians who practice in a group setting) following the completion of the patient's coronary angiogram using a 'real-time' central randomization system with allocation concealment embedded in the APPROACH software. After a practice's first patient is randomized, all subsequent patients from that practice will be assigned to whatever treatment arm the first patient was randomized to., 391953=Both recommendations proposed a scoring system to assess patient priority on waiting lists for the targeted surgical procedures. The prioritisation systems for cataract surgery and hip and knee replacement were similar, although specific scoring items were used. Their utilisation by physicians practicing in the Catalan network of public hospitals was made mandatory through an instruction issued by the Servei Català de la Salut (the Catalan Health Service) in November 2004., 910448=Guideline adherence was measured via External Peer Review Program (EPRP) rankings. EPRP is a random chart abstraction process conducted by an external contractor to audit performance at all VA facilities on numerous quality of care indicators, including those related to compliance with clinical practice guidelines. We obtained data for fiscal year 2001 reflecting facility-specific adherence to guideline recommendations for six chronic conditions usually treated in outpatient settings: diabetes, depression, tobacco use cessation, ischemic heart disease, cardiopulmonary disease, and hypertension. Each condition is monitored via multiple performance indicators; in total, 20 performance indicators were used to describe compliance across the six conditions. Facilities were rank ordered from 1–15 (15 being the highest performer) on each performance indicator. HPF tended to rank consistently high across most disease conditions, and LPF tended to consistently rank low across most disease conditions; consequently, all 20 performance indicator ranks were summed to create an indicator rank sum (IRSUM) score [higher IRSUM scores indicate higher performance]. Facilities then were rank-ordered according to their IRSUM score to identify the three highest and the three lowest performing facilities, which were used for sample selection., 705522=Provision of proven efficacious therapies in patients with CAD, multi-centre studies since 1995, 3332=A review was included if it reported on its search strategy, if it focused (at least partly) on rigorous evaluations of organizational strategies (defined as planned re-arrangements of one or more aspects of the organization of patient care), and if it was published in 1995 or later. Rigorous evaluations comprised randomized trials, interrupted time-series, controlled before-and-after studies, and prospective comparative observational studies. Papers were included by the first author and the inclusion was checked by the second author. Some reviews also included studies on non-organizational strategies or non-rigorous studies; these sections in the reviews were not used. We did not include reallocation of services from hospital to primary care settings., 918217=Three pairs of interviewers were deployed into the participating sites during the spring of 2001. The interviewers were research investigators of various backgrounds (e.g., medicine, nursing, organizational psychology, clinical psychology, and sociology), with in-depth knowledge of the project, and most were involved with the project since its inception. None of the interviewers was affiliated with any of the participating facilities., 565768=As of Oct. 27th, 2002 we have recruited a total of 170 children into our baseline cohort and 95% have been contacted daily until resolution of symptoms. We will continue to recruit patients until April 30th, 2003. Given our rate of enrolment to date, we anticipate enrolling between 450 and 500 patients in the baseline cohort. The intervention and follow-up sample will be obtained over a total of 24 months, as opposed to the baseline in which we will have enrolled patients for only 13 months. Therefore, conservatively, enrolment should be ~ 900 patients in the follow-up cohort., 545833=Utilizing provincial administrative data, we have established health care utilization rates including the a) number of disease episodes, b) number of physician visits per disease episode, and c) number of hospital admissions and hospitals days per disease episode, for children with croup in Alberta for 6 years. Among the 107 Alberta hospitals, we found up to an 18 fold range in hospital admissions rates, ranging from16 to 287/1000 disease episodes. In general, those hospitals that evaluated larger numbers of children with croup had lower utilization rates. For example, the six largest volume hospitals diagnosed a total of 86,711 cases, and averaged 21 hospital admissions/1,000 disease episodes; and the 30 smallest volume hospitals diagnosed 13,750 cases and averaged 116 hospital admissions/1,000 disease episodes., 735377=Six months was chosen for the primary and secondary outcomes because the average number of physician visits in our audit of trial-eligible patients attending the University of Alberta cardiac catheterization laboratory in the 2003 year was 1.8 visits in six months. As we are assessing the impact of the Local Opinion Leader Statement and Unsigned Evidence Statement on physician practice patterns, for the purposes of this study we are interested solely in evaluating attempted practice change. In other words, if a patient is provided with a statin sample or a statin prescription, or the dosage is increased by any of the patient's physicians, it would still count as a positive outcome for the main study analysis, even if the patient cannot tolerate the medication and discontinues it or is noncompliant during follow-up. We recognize that patient (and physician) long-term compliance with preventive therapies is important, and will collect data on persistence rates with secondary prevention maneuvers over the six months of the study. We anticipate that this data will serve as pilot data for a planned future study on interventions to improve provider/patient persistence rates., 581622=The parents of children admitted to each of the 24 hospitals with a diagnosis of croup during \"croup season\" (Sept 1st to May 31st) from November 1st, 2001 and finishing March 31st, 2006, will be asked by a staff nurse to participate in a telephone survey., 580201=We have extracted data from administrative databases from April 1st, 1994 to March 31st, 2000, providing six years of data. In summer 2006, we will again extract data from administrative databases from April 1st, 2000 to March 31st, 2006. Extraction of data across these time periods will allow us to extend the baseline utilization rates from six to nine years. Most importantly, this will ensure no significant changes occur just prior to the study interventions. Extraction of data through March 31st, 2006 will provide utilization data for the intervention and two follow-up years.}",
    "textBeforeTable": "Organizational changes to improve patient care Table 1 ). Decision makers need an overview of the evidence for their organizational measures in order to chose effective interventions and avoid ineffective interventions, yet the research literature on these strategies is scattered over a large number of journals. This paper aims to provide a structured review of the research evidence from systematic literature reviews of organizational interventions with respect to their effects on professional performance, patient outcomes and costs. 1 Claims on the effectiveness of organizational strategies for improving the quality of care should be based on evidence from rigorous evaluations. While a number of reviews of specific organizational strategies have been published, no broad overview of research evidence on organizational strategies has been published. This paper focuses on organizational strategies, which could improve professional practice and health outcomes (Table ]. Organizational changes could therefore offer important mechanisms for quality improvement. 4 ]. While this change may be clinically and economically relevant, further improvements are needed. Many patient outcomes are not only influenced by the performance of individual care providers, but also by the functioning of clinical teams and by broader organizational and financial structures. Contextual factors, such as a high burden of work or poor co-ordination mechanisms, can be important barriers for wide-scale and sustainable improvement [ 3 ]. Examples of these strategies are audit and feedback, reminder systems, educational meetings and educational outreach visits. These strategies appear to",
    "textAfterTable": "1 ); this was consistent with other lists of organizational interventions such as that used by EPOC. Two researchers extracted from the reviews information on their focus, methodological quality, and main results. The number of studies reported in the table refers to the number of rigorous evaluations of organizational interventions; this may be lower than the total number of studies in the review as we focused only on rigorous studies of organizational interventions. Two authors independently assessed the methodological quality of the review, as opposed to the included studies, using a previously used 9-item scale (we did not use the summary assessment in the original scale) [ 7 ]. A score of 7 or more was taken to indicate good methodological quality. The summaries of the main results regarding effects on professional practice, patient outcomes and costs were based on the text in the original papers, derived from the abstract, results section or discussion section, focusing on quantitative summaries when available. Data synthesis We expressed effects in terms of average effect size (AES), standardized mean difference (SMD), weighted mean difference (WMD), adjusted odds ratio's (AOR), adjusted relative risk (ARR), median net change (MNC) or percentage studies with improvements (PSI). Except for PSI all figures were extracted from the papers. If a meta-analysis had been performed, we also recorded whether the effect was significant (S) or not (NS). If quantitative summary measures of effectiveness were not used, the range of effects across studies",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}