{
    "relation": [
        [
            "Days",
            "30",
            "50",
            "150",
            "200"
        ],
        [
            "BSE",
            "19.98",
            "20.09",
            "22.08",
            "21.04"
        ],
        [
            "NSE",
            "19.73",
            "19.80",
            "22.06",
            "20.96"
        ]
    ],
    "pageTitle": "Karma Energy Stock Price, Share Price, Live BSE/NSE, Karma Energy Bids Offers. Buy/Sell Karma Energy news & tips, & F&O Quotes",
    "title": "",
    "url": "http://www.moneycontrol.com/india/stockpricequote/miscellaneous/karmaenergy/KE9",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042982745.46/warc/CC-MAIN-20150728002302-00333-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 597737639,
    "recordOffset": 597691935,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{132514=28 July 2015, 133732=JSWSteel Jul Fut, 133025=UnitedBrewerie Jul Fut, 190343=Astec LifeSciences Recommended on Mar 31st 2015, 191651=Karma Energy is in the Miscellaneous sector. The current market capitalisation stands at Rs 20.83 crore. The company management includes Dharmendra G Siraj - Chairman, Ganesh N Kamath - Managing Director, Chetan D Mehra - Director, Neelkamal V Siraj - Director, Upkar Singh Kohli - Director, Vinesh N Davda - Director, Kishore N Vussonji - Director, Vishnu P Kamath - Director, Smita Vineshkumar Davda - Additional Director. It is listed on the BSE with a BSE Code of 533451 and the NSE with an NSE Code of KARMAENG. Its Registered office is at Empire House, 214, Dr. D N. Road,,Ent. A K Nayak Marg, Mumbai,Maharashtra - 400001. Their Registrars are Bigshare Services Pvt. Ltd.}",
    "textBeforeTable": "Edit Watchlist Have you invested in these stocks? You can track them better in your Portfolio close[x] Add to Watchist Account Optional Optional Optional Optional Add to Portfolio OR Add to watchlist } $('#mcpcp_addprof_info').hide(); { function close_info()",
    "textAfterTable": "Keep me signed in Forgot Password? New to Moneycontrol - Sign up now Its easy and FREE! Username Username should be atleast 4 characters Password Password should be 6 to 10 characters Confirm Password Email OR connect with LIVE",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}