{
    "relation": [
        [
            "Template Detail",
            "Template type",
            "Template name and version",
            "Template Dependencies",
            "Template JAR file and location"
        ],
        [
            "Information",
            "Extension",
            "Oracle WebCenter Spaces - 11.1.1.0",
            "Oracle WebCenter Framework + Oracle Enterprise Manager - 11.1.1.0 + Oracle WSM Policy Manager - 11.1.1.0 + Oracle WebCenter Spaces Applications - 11.1.1.0",
            "WC_ORACLE_HOME/common/templates/applications/oracle.wc_spaces_template_11.1.1.jar"
        ]
    ],
    "pageTitle": "Fusion Middleware Product Templates",
    "title": "",
    "url": "https://docs.oracle.com/cd/E17904_01/web.1111/e14138/fmw_templates.htm",
    "hasHeader": true,
    "headerPosition": "MIXED",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042981856.5/warc/CC-MAIN-20150728002301-00089-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 858323338,
    "recordOffset": 858307709,
    "tableOrientation": "VERTICAL",
    "lastModified": "Wed, 13 May 2015 05:16:47 GMT",
    "textBeforeTable": "Table 3-26 Oracle WebCenter Spaces Template Details The following table provides key information about this template. The Oracle WebCenter Spaces template adds the WC_Spaces Managed Server, and deploys the Oracle WebCenter Spaces application and required libraries. It also deploys the WebCenter Help application and adds JDBC data sources for accessing MDS and the WebCenter schema. Oracle WebCenter Spaces Oracle WebCenter Personalization Server Oracle WebCenter Pagelet Producer Oracle WebCenter Activity Graph Oracle WebCenter Analytics Oracle WebCenter Custom Services Producer Oracle WebCenter Custom Portal Oracle WebCenter Discussion Server Oracle Portlet Producers Oracle WebCenter Spaces This section describes the following Oracle WebCenter templates: Oracle WebCenter Templates WL_HOME/common/templates/applications/diameterdomain.jar Template JAR file and location None Template Dependencies WebLogic SIP Server Domain - Diameter Topology - 10.3.3.0 Template name and version Domain Template",
    "textAfterTable": "Oracle Portlet Producers The Oracle Portlet Producers template adds the WC_Portlet Managed Server, and deploys the Oracle WebCenter portlet producer applications (Portal Tools and WSRP Tools) and required libraries. It also adds a JDBC data source for accessing the Portlet schema. The following table provides key information about this template. Table 3-27 Oracle Portlet Producers Template Details Template Detail Information Template type Extension Template name and version Oracle Portlet Producers - 11.1.1.0 Template Dependencies Oracle Portlet Producers Applications - 11.1.1.0 Oracle WSM Policy Manager - 11.1.1.0 Template JAR file and location WC_ORACLE_HOME/common/templates/applications/oracle.producer_apps_template_11.1.1.jar Oracle WebCenter Discussion Server The Oracle WebCenter Discussion Server template adds the WC_Services Managed Server and deploys the Oracle WebCenter Discussion application. It also adds a",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}