{
    "relation": [
        [
            "Categories",
            "Clubs and Activities",
            "Share any unusual traditions or locations on campus",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "Regardless of what you're into, you are bound to find a club that matches you perfectly. Feel free to view the many clubs and activities offered at the university. Even if the school doesn't have a certain kind of club that you're interested in, start one yourself!",
            "To all incoming freshman, there is a new tradition starting this year, Fall 2013. Before every home football game, and yes we are a division 1 school, freshmen get to rush out onto the field with their own individual jerseys! THIS IS ONLY FOR FRESHMEN, so I suggest you get involved.",
            "There are a number of groups you can get involved with on campus, not to mention the Rec Center. UTSA is home to the tallest rock climbing wall currently. It is so much fun. The Rec Center is open late, so there is plenty of time to go and check it out! They even have a little cinema on campus that is free to students and you get to see some movies before they're released on DVD. There are just so many different things to do on campus!",
            "Get a meal plan! They come so in handy! You have many options for dining on campus, from Chick Fil A, all the way to Chilis. There are so many options and on your meal plan you get a certain amount to use in the various food areas on campus. And actually eat in the Roadrunner Cafe. It is unlimited food and they only ask that you wait 30 minutes in between visits. The food is not bad, it is actually quite good and you still get a variety there!",
            "I resided in Chaparral Village on campus and they are pretty nice. You're DAs are really cool and easy to get along with. Take advantage of a pool, for those of you residing it Chaparral the pool is great. The common areas are really open and have room for a number of people. Your dorms are set up like economy styled apartments, so it's really nice. The rooms however aren't always the quietest places. The walls are really thin, so you can sometimes here when someone has quest over, are cooking in the microwave, or even opening and closing their closet door. And sometimes laundry can be a real pain. I suggest not relying too much on the Laundry Alert website, it is not always accurate.",
            "The classes can be pretty challenging, but there isn't really too much to be done. Some professors have the expectation that you've already learned it, where as others take the time to teach you everything. Your professors will either be a great asset and friend to you, or can be your worse nightmare! Be friends with your professor!",
            "Incoming students, make sure you have a good idea what you want to do. It does get expensive if you keep changing your major. Try taking some summer classes at community colleges and transfer in credit hours. It is really cheap to do it that way. When you get on campus get involved. Go and participate in RoadRunner Days, they're a lot of fun and a great way to meet new people, even if you're on the quiet side.",
            "The campus is beautiful, and there are plenty of various activities here for whatever your interests are. However, some of the majors you maybe interested in are not offered here. Not to mention the fact that if you do not place into a particular class for your intended major there aren't too many other options for you when it comes to completing your graduation requirements and you're required to take many classes."
        ]
    ],
    "pageTitle": "The University of Texas at San Antonio (UTSA) Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/The-University-of-Texas-at-San-Antonio/reviews?_escaped_fragment_=/show/27948",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 225,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042982745.46/warc/CC-MAIN-20150728002302-00013-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 902899675,
    "recordOffset": 902721621,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{803943=There is a wide variety of clubs and activities to choose from and the Rec Center is always full of classes that range from martial arts to dancing. The activity that I absolutely fell in love with while at UTSA was quidditch. I was interested in it and attended practices and games but was not on the team because I knew I was transferring at the end of the year. The team has a great camaraderie and made it all the way to World Cup VI this year. This is a huge accomplishment because the team was created in the Fall semester of 2012. This group of people is filled with a combination of hard workers and laid back fun guys whose personalities blend wonderfully with each other. They take care of each other and have each otherâ??s back. UTSA quidditch has become part of the world wide community of quidditch and I am fortunate enough to be able to say that I was there when it began. It is fun, a great way to meet people and a surprising form of exercise. Do not expect to gain the freshman fifteen if you are working out with this team. I HIGHLY recommend joining this team to any and all students at UTSA., 845303=I hear that the parking lot at the 1604 Campus is usually packed. Like, people fight for parking lots. You don't have to worry about that if you are living on campus. But, if you live in San Antonio, and plan to reside somewhere else besides campus, remember that the parking is a disaster and the parking permit for a year is like eight hundred dollars. Just saying., 844700=Sign your contract soon like in January if you don't want to be living with random people., 314125=UTSA is one of the least expensive universities in San Antonio. As tuition rises, scholarships and grants offered by UTSA can be found through the financial aid office and are easier to find upon completing the FAFSA before April each year. Tuition costs rise as enrollment increases and academic requirements increase as Tier One Status approaches!, 380655=There are Hookah Bars everywhere. La Cantera shopping mall is right across 1604, also the theater is really close as well., 800321=Apply early, the earlier you apply the earlier you can get accepted and get the classes you want. Register for classes around a schedule you can handle. If you don't like being awake at 7 in the morning, don't register for a 7 o'clock class. That affects your learning., 40967=I am only here for a short while, both at the downtown campus and 1604 but I really like it. The downtown campus is located very conveniently in the heart of downtown, so if your not from San Antonio, a little sight seeing between classes could be something fun to do., 785181=The University of Texas at San Antonio looks like a great school (will be attending in the 2013-2014 year). The student life looks very lively. A great environment to learn in., 146330=a lot of the more exciting options in san antonio are downtown, which requires a fifteen/twenty minute drive from the 1604 campus. (the 1604 campus is the main campus, but there is another utsa campus downtown. i believe that many of the poli-sci and architecture classes take place downtown.) the riverwalk, of course, is a major tourist attraction. it can be a bit expensive, but it's a lovely place to visit, especially if you've never seen it before. during the winter holiday season, the riverwalk is lined with lots of beautiful lights, and it is dyed green for st. patrick's day. it's a pretty festive area with lots of great bars, restaurants, and shopping opportunities. first friday (an event which, appropriately enough, occurs on the first friday of the month) is an opportunity to go downtown to look at various art and music events and, of course, bar-hop. san antonio has a city orchestra which plays on a somewhat regular basis throughout the year, and various theaters offer chances to watch plays and musicals. there are three alamo drafthouses in san antonio, movie theaters which play a mix of the old and the new and allow you to buy meals and alcohol from waitresses while actually watching the movies. the drafthouses regularly have theme nights, so if you're an anime-nut, a rocky horror picture show fan, or ... well ... any number of other things, you'll like these movie theaters. the arts scene in san antonio is booming, and there are lots of great galleries downtown. the mcnay museum of modern art is also a wonderful place to visit, and it has free admission on thursday afternoons/nights and on the first sunday of the month. the san antonio museum of art is also worth a glance, though not quite as impressive as the mcnay, and it also has times that offer free admission. closer to the 1604 campus are lots of great cafes and a few good bars, including the best jazz bar in san antonio, chango's havana club, and flying saucer, which has the best beer selection in town (hundreds of different kinds). for thrill seekers, the six flags fiesta texas amusement park is really right down the street, as is sea world. san antonio's most famous shopping center, la cantera, is also very close to the 1604 campus. for those who like a little country in their lives, the hill country is a short drive away, featuring lots of lovely towns with various food and agricultural festivals, knitting and quilting events, and general small-town charm. to sum it all up, san antonio might seem a bit more quieter than other major cities at first glance, but there is really quite a lot to do in the city. whether you're interested in sports, the arts, community service, or nights out on the town, there are lots of wonderful options. if you can't find something to do on friday night (or even on wednesday night), you probably just haven't looked hard enough., 983565=Currently transferring to UTSA, starting on Jan 13. UTSA put together a fantastic 3 day transition workshop for new students. I was very impressed and learned a lot about college life at UTSA., 1088262=© 2015, Cappex.com, LLC, 876515=To all incoming freshman, there is a new tradition starting this year, Fall 2013. Before every home football game, and yes we are a division 1 school, freshmen get to rush out onto the field with their own individual jerseys! THIS IS ONLY FOR FRESHMEN, so I suggest you get involved., 1062503=The courses are challenging but as long as you put in the work they become easy. the professors are very understanding and all my classes are easy because i put in work.The only class that is very challenging is Biosciences 1404., 424608=This is not applicable to me as I have not lived int he dorms, but I do know that the majority of dorms are very new and the one old dorm was completely remodeled in 2005.}",
    "textBeforeTable": "07/14/2009 Reviewer is A current student here. 70 out of 71 people found this review useful. 2 people found this inaccurate. 1 of 274 Stephanie from san antonio, TX Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); });",
    "textAfterTable": "Tips for prospective students You may think college is all fun and parties, it is but then if you do not know where your priorities lie, you can get bad grades thus might getting on probation. A good tip is to remain focused, do your work, never fall behind and study! Parties will always be here and there and fun is all around, just manage it all carefully. Bang for the buck Yes, money is always an issue no matter what college you attend. Still, the faculty of financial aid are willing to help you get the most of your aid and help you out with payments. Plus, make sure you save up some money, or a lot of money for books and housing, that includes food. Am enjoying being here I love the environment, the people, the whole feeling of being here and doing what i want to do. Am learning a lot What is there to learn about U.T.S.A. ? For starters, how great the college is! I love the size of the college, not so big but then again not so small. I learned that U.T.S.A. offers a variety of degrees from the Arts to Engineering majors. I",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}