{
    "relation": [
        [
            "Device",
            "SONY GY-2120 Deprecated in Tivoli Storage Manager 7.1.",
            "Sony GY-8240 Deprecated in Tivoli Storage Manager 7.1."
        ],
        [
            "Capacity",
            "12 GB or 42 GB",
            "200 GB"
        ],
        [
            "AIX",
            "Base",
            "Base"
        ],
        [
            "HPUX",
            "Base",
            "Base"
        ],
        [
            "SOLARIS",
            "",
            "Base"
        ],
        [
            "WIN",
            "Base",
            "Base"
        ]
    ],
    "pageTitle": "IBM Software Support : IBM Tivoli Storage Manager Supported Devices for AIX®, HP-UX, Solaris, and Windows®",
    "title": "Sony DTF Tape Drives",
    "url": "http://www-01.ibm.com/software/sysmgmt/products/support/IBM_TSM_Supported_Devices_for_AIXHPSUNWIN.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042982745.46/warc/CC-MAIN-20150728002302-00179-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 266263515,
    "recordOffset": 266231688,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{348653=The maximum configuration has over 300,000 slots and up to 2048 drives., 159218=The IBM device driver is required. Not supported on Windows 2003., 161103=The IBM device driver is required. Not supported on Windows 2003, 156171=Deprecated in Tivoli Storage Manager 7.1. The IBM device driver is required. Not supported on Windows 2003.}",
    "textBeforeTable": "Base Up to 1 TB All RDX Removable Disk Drives WIN SOLARIS HPUX AIX Capacity Device Removable Media Devices Base Base Base Base 4 Drives 40 Slots Tandberg SLR Library 1440 Base Base Base Base 4 Drives 20 Slots Tandberg SLR Library 1420 Base Base Base Base 2 Drives 10 Slots Tandberg SLR Library 1210 Base Base Base Base 1 Drive 8 Slots Tandberg SLR Autoloader WIN SOLARIS HPUX AIX Capacity Device LAN-Free Client Data Transfer are compatible with these library changers.) Library Sharing and ( QIC Tape Libraries",
    "textAfterTable": "Sony DTF Tape Libraries ( Library Sharing and LAN-Free Client Data Transfer are compatible with these library changers.) Device Capacity AIX HPUX SOLARIS WIN Sony DMS-8400 Deprecated in Tivoli Storage Manager 7.1. 4 Drives 3274 Slots Base Base Base Base Sony DMS-B35 Deprecated in Tivoli Storage Manager 7.1. 2 Drives 70 Slots Base Base Sony DMS-B9 Deprecated in Tivoli Storage Manager 7.1. 1 Drive 9 Slots Base Base Sony Petasite DMSB150L Deprecated in Tivoli Storage Manager 7.1. 6 Drives 150 Slots Base Base Base Base Sony Petasite DMSB80L Deprecated in Tivoli Storage Manager 7.1. 4 Drives 81 Slots Base Base Base Sun StorageTek",
    "hasKeyColumn": true,
    "keyColumnIndex": 1,
    "headerRowIndex": 0
}