{
    "relation": [
        [
            "JUNIOR YEAR",
            "Approved electives. . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . .",
            "English courses chosen from general education humanities or Honors list. . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . .",
            "Foreign Language courses . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . .",
            "General Education arts course. . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . .",
            "Geology 3032 . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . .",
            "Geology 3041 . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . .",
            "Geology 3071 . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . .",
            "Physics 1202 or 2102 or 2002, and 1209 or 2109. . . . . . . . . . . . . . . . . . . . . . . .",
            ""
        ],
        [
            "SEM. HRS.",
            "0-3",
            "3",
            "10-8",
            "3",
            "3",
            "3",
            "3",
            "5-4",
            "30"
        ]
    ],
    "pageTitle": "LSU General Catalog 2007-2008",
    "title": "",
    "url": "http://www.lsu.edu/catalogs/2007/141basic.shtml",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042982745.46/warc/CC-MAIN-20150728002302-00280-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 570578791,
    "recordOffset": 570549698,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{95533=CHAIR • Anderson, Associate Professor OFFICE • E235 Howe-Russell Geoscience Complex TELEPHONE • 225-578-3353 FAX • 225-578-2302 WEB SITE • www.geol.lsu.edu, 29597=A second option for students interested in middle/high school science teaching is to pursue a traditional bachelor’s degree in science and then complete a master’s degree in the LSU College of Education. The master’s degree program (Holmes Program) begins in June and requires 15 months of course work and classroom experience leading to both the master’s degree and teaching certification. Information about the program and potential scholarship assistance is available through the College of Education., 120717=Send questions to webmaster@lsu.edu Copyright © 2007. Official Webpage of Louisiana State University., 18824=English • Nine semester hours including ENGL 2000 and six hours chosen from English courses on the general education humanities list or Honors 2002, 2004, 2012, 2013, 2202, 2204, 3001, 3003. Degree credit will not be allowed for ENGL 1001 or 1004., 98992=Honors courses offered are Geology 1002 and 1004., 19360=Foreign Language • Students may satisfy the college foreign language requirement by passing 8 to 10 semester hours in a single foreign language. Ordinarily, courses numbered 1001 and 1002, or 1101 and 1102, or 1001 and 2051 are chosen. For example, students choosing Latin will take LATN 1001 and 2051 (10 semester hours), but students choosing French will take FREN 1001 and 1002 (eight semester hours) and the additional two semester hours will be added to free electives., 69757=*With the dean's approval, CHEM 1202, 1212 may be substituted for CHEM 1422, 1431; CHEM 2002 may be substituted for CHEM 2003; and CHEM 2261, 2262, and 2364 may be substituted for CHEM 2461, 2462, and 2463., 118439=Medical Physics Required Courses (34 hrs.) • CHEM 1201, 1202, 1212, 2060;* MATH 2090; BIOL 2160; MEDP 2051, 4111, 4331, 4332, 4351; KIN 2500. * CHEM 2261 may be substituted for CHEM 2060., 56359=Required courses: EDCI 2001, 3001, 3002, 4003, 4004, 4005; BIOL 3001, 3002, 4003, 4004, and 17 hrs. chosen from the approved biological sciences electives numbered 3000 and higher., 66555=Chemistry majors must select one of nine areas of concentration, preferably in their sophomore year. Undecided majors and those who are considering chemistry as a possible major are strongly encouraged to take CHEM 1002 in their second semester. This course will alert them to the various career opportunities in chemistry in time to make an appropriate decision. The different concentrations can be grouped according to whether or not they prepare the student for an active career in chemistry or for another profession, such as medicine, dentistry, veterinary medicine, or education., 119306=Secondary Education Students may obtain an area of concentration in secondary education with an emphasis on secondary school teaching by meeting the requirements of the physics degree and incorporating the following courses in their program of study. In addition, the student should include EDCI 2001 as one of the general education social science courses offered for the degree. Some general education courses are taken in different years than in the standard curriculum. Students should plan their curriculum so that the second semester of the senior year can accommodate 15 hours that are required to be taken concurrently (EDCI 4004, 4005, and PHYS 4004). PHYS 4004 substitutes for PHYS 4125 in the physics major curricu-lum. Two 4000-level physics electives (6 sem. hrs.) substitute for PHYS 4098 and 4132 in the physic major curriculum. Approved electives are 5-7 hours for the major., 77677=Chemical Physics (29 hrs.) Students completing this concentration will receive American Chemical Society certification. Sophomore Year • MATH 2057, and 2065, 2085 or 2090 (6-7 sem. hrs). Junior Year • 3 hrs. of Physics electives. Senior Year • CHEM 3900 in an approved physical chemistry research project, 4552, 4553, and 4570 or 4571; BIOL 4087 or 4093 and 4094; 3 hours of chemistry electives; 3 hrs. of physics electives. (20-22 sem. hrs.) Physics electives: PHYS 2221, 2231, 2411, 4123, 4125, 4141, 4142, 4251, 4261. Chemistry electives: CHEM 4581, 4594, 4596, 4597., 81933=Secondary Education Students may obtain an area of concentration in secondary education leading to certification as a teacher in grades 7-12 by meeting the requirements of the chemistry degree and incorporating the following courses in their program of study. In addition, the student should include EDCI 2001 as one of the social science courses offered for degree. Students should plan their curriculum so that the second semester of the senior year can accommodate 15 hrs. that are required to be taken concurrently (EDCI, 4004, 4005, CHEM 4004). Junior Year • CHEM 3001, 3002, and EDCI 3001, 3002 (8 sem. hrs.) Senior Year • BIOL 4087, CHEM 4570 or 4571; 3 hrs. CHEM electives; CHEM 4003, 4004, and EDCI 4003, 4004, 4005 (29 hrs.) Chemistry electives: CHEM 4010, 4011, 4150, 4160, 4552, 4553, 4561, 4562, 4563, 4564, 4570 or 4571, 4581, 4594, 4597., 95122=Software Engineering (18 hrs.) Required courses (9 hrs.)—CSC 2000-level or above area elective; CSC 4351, 4402. Approved area electives (9 hrs.)—CSC 4304, 4370, 4890; EE 4760; IE 4461; ISDS (max. of 6 hrs.) from 4110, 4111, 4112, 4113, 4114, 4125, 4141, 4501, 4502, 4511; other electives subject to approval., 84179=Computer science students will not receive degree credit for the following courses: CSC 4602; ELRC 4006; EXST 2000, 2095, 2201, 3001, 4001; ISDS 2000, 2001, 3001, 3002; PSYC 2011, 4111; and SOCL 2201. Computer science students may not receive credit for both IE 3302 and ISDS 2000, or for both IE 4510 and ISDS 2001., 78349=Chemistry (25 hrs.) Recommended for preparation as a chemical professional or for entrance to graduate study in chemistry. Students completing this concentration will receive American Chemical Society certification. Sophomore Year • MATH 2065, 2085 or 2090 (3-4 sem. hrs.). Junior Year • BIOL 4087 or 4093 and 4094 (4- 6 sem. hrs.) Senior Year • CHEM 3900 in an approved chemistry project, 4552, 4553, 4564, and 4570 or 4571; 6 sem. hrs of chemistry electives. (18 sem. hrs.). Chemistry electives: CHEM 3900 (additional hrs.), 4010, 4011, 4160, 4561, 4562, 4563, 4570 or 4571, 4572, 4581, 4594, 4597., 120240=Required courses (37 hrs.): PHYS 2401, 3001, 3002, 4003; EDCI 3001, 3002, 4003, 4004, 4005; MATH 2090; ASTR 1101, 1102 or CHEM 1201, 1202., 81385=Preprofessional Chemistry (24 hrs.) Sophomore Year • 3 hrs. from preprofessional electives; Junior Year • BIOL 4093 (3 sem hrs.); Senior Year • CHEM 4552, 4553, and 4570 or 4571; BIOL 4094, 4385, 5 hours from preprofessional electives (18 sem. hrs.). Preprofessional Electives: BIOL 2051, 2153, 3156, 3152 or 4160; CHEM 3900 or BIOL 3999 in an approved project. This concentration also requires BIOL 1208 and 1209 to be taken in the freshman year., 19108=Mathematics • A minimum of five semester hours of calculus (Mathematics 1550). Some curricula require additional credits in mathematics. Degree credit will not be allowed for mathematics courses numbered below 1550., 36265=CHAIR • Bricker ASSOCIATE CHAIR • Moore, Professor ASSOCIATE CHAIR • Bruch, Associate Professor OFFICE • 202 Life Sciences Building TELEPHONE • 225-578-2601 FAX • 225-578-2597 WEB SITE • www.biology.lsu.edu, 39910=In addition to admission to the College of Basic Sciences, entry into any of the three majors (biochemistry, biological sciences, and microbiology) in the Department of Biological Sciences requires earned credit in BIOL 1201 and 1202; CHEM 1201; and MATH 1550., 39479=An undergraduate minor in biological sciences is available to students majoring in curricula outside the Department of Biological Sciences. Required courses are BIOL 1201, 1202, 1208, 1209, 2051, 2153, 4087, and at least three more hours of biological sciences in a course at the 3000-level (excluding BIOL 3999) or above (total of 23 hours)., 28485=Admission to any secondary education concentration requires a minimum gpa of 2.50 and passing scores on the PRAXIS I assessments or minimum ACT composite of 22 or minimum SAT composite of 1030. Students who might have an interest in middle and high school teaching should choose to take EDCI 2001 as one of their general education social sciences courses in the freshman or sophomore year. Details of the programs and requirements for admission, continuation, graduation and certification can be obtained from Student Services counselors in the College of Basic Sciences. The curriculum for each eligible major is listed in the departmental sections of this catalog as a secondary education concentration. Students are required to achieve passing scores on the PRAXIS I assessment or minimum composite of 22 or minimum SAT composite of 1030 prior to enrollment in 3000- level EDCI courses. They are expected to take the required PRAXIS II assessments during the last semester of course work prior to student teaching. They must pass all required sections of the PRAXIS II Series prior to graduation., 79881=Environmental Chemistry (24 hrs.) Students completing this concentration will receive American Chemical Society certification. Sophomore Year • MATH 2057 (3 sem. hrs.). Junior Year • BIOL 4087 or 4093 and 4094 (4- 6 sem. hrs.). Senior Year • CHEM 3900 in an approved environmental chemistry project, 4150, 4552, 4553, 4570 or 4571; and 6 hrs. chosen from environmental electives (17 sem. hrs.). Environmental Electives: EVEG 4135, ENVS 4500, 4477, OCS 4040, 4165., 34498=Founded in 1897 at the University of Maine, Phi Kappa Phi is the nation’s oldest, largest, and most selective honor society for all academic disciplines. Its chapters are on nearly 300 campuses in the United States, Puerto Rico, and the Philippines. Each year, approximately 30,000 members are initiated. Some of the organization’s more notable members include former President Jimmy Carter, writer John Grisham, NASA astronaut Wendy Lawrence, and Netscape founder James Barksdale. The LSU chapter was founded in 1930 as the 43rd chapter in the nation. At the present time, the national office is located on this campus in the French House., 109734=An undergraduate minor in physics is available. Required courses are PHYS 1201, 1202, 1208, 1209, (or PHYS 2101, 2102, 2108, 2109); PHYS 2221; and at least three courses in physics above 2200 (excluding PHYS 2401, 2995, 4399, and 4991) of which at least three hours must be at the 4000 level, and/or astronomy above 4000 (excluding ASTR 4997), for a total of 20-22 hours., 37963=The Department of Biological Sciences offers a comprehensive background in biology for teacher preparation, graduate studies, and for professional programs in medicine, dentistry, pharmacy, and veterinary medicine. The department offers bachelor of science degrees in biochemistry, biological sciences and microbiology. All degrees require a core of departmental courses that include BIOL 1201, 1202, 1208, 1209, 2051, 2153, and either 4087 or 4093 and 4094. In addition, all students are required to take 20-25 hours of electives from courses numbered 3000 and above in biological sciences that include two courses with laboratories and at least one course from three of four departmental groupings (described below). Students seeking the bachelor of science degree in biological sciences may fulfill the requirement for 20 hours of electives with courses from all areas of the department while students seeking the biochemistry and microbiology degrees take courses specific to those degrees. All students in the department may earn a maximum of six hours of BIOL 3999. A maximum of three hours of BIOL 3999 may be taken as advanced biochemistry, biological sciences, or microbiology electives. BIOL 3999 may not be used as a laboratory course. Students may earn more than one degree in the department but biological science courses numbered 3000 and above (excluding the core biochemistry courses) may only be applied to one degree. Majors in the department are ineligible for the departmental minor., 118288=Astronomy Required Courses (28 hrs.) • ASTR 1101, 1102, 4221, 4222, 4261; MATH 2090; PHYS 4123, 4135, 4141., 82910=CHAIR • Iyengar OFFICE • 298 Coates Hall TELEPHONE • 225-578-1495 FAX • 225-578-1465 WEB SITE • www.bit.csc.lsu.edu, 80927=Polymers (24 hrs.) Students completing this concentration will receive American Chemical Society certification. Sophomore Year • MATH 2065, 2085 or 2090 (3-4 sem. hrs.). Junior Year • BIOL 4087 or 4093 and 4094 (4- 6 sem. hrs.). Senior Year • CHEM 3900 in an approved polymer research project, 4010, 4011, 4552, 4553, 4564, and 4570 or 4571 (17 sem. hrs.)., 108440=CHAIR • McNeil, Professor ASSOCIATE CHAIR • Browne, Professor OFFICE • 202 Nicholson Hall TELEPHONE • 225-578-2261 FAX • 225-578-5855 WEB SITE • www.phys.lsu.edu, 27135=Students with a 3.00 gpa who have been enrolled as full-time students for at least one year at LSU-Baton Rouge prior to making application to medical or dental school are eligible to use the LSU Premedical/Predental Committee. The deadline for using the LSU Premedical/Predental Committee is May 1 of the year prior to entry. Information about using the committee may be obtained in the Dean’s office, 338 Choppin Hall, or by attending the Premedical/Predental Information meeting held in the fall semester., 118668=Physics Required Courses (28 hrs.) • CHEM 1201, 1202; MATH 2090; PHYS 4123, 4141, 4142, 4399, and two physics electives (4000 level or above)—with permission, a 4000-level mathematics course may be substituted for one., 76984=Biological Chemistry (28 hrs.) Students completing this concentration will receive American Chemical Society certification. Sophomore Year • MATH 2065, 2085 or 2090 (3-4 sem. hrs.). Junior Year • BIOL 2051 or 2153 (4 sem. hrs.). Senior Year • CHEM 3900 in an approved biological chemistry project or BIOL 3999 including a comprehensive written report filed with the Department of Chemistry’s Undergraduate Office; CHEM 4552, 4553, 4564, and 4570 or 4571; BIOL 4093, 4094, 4385 (21 sem. hrs.). This concentration also requires BIOL 1208 and 1209 to be taken in the freshman year., 80446=Materials (29 hrs.) Students completing this concentration will receive American Chemical Society certification. Sophomore Year • MATH 2065, 2085 or 2090; ME 2733 (6-7 sem. hrs). Junior Year • BIOL 4087 or 4093 and 4094 (4-6 sem. hrs.). Senior Year • CHEM 3900 in an approved area of materials research project; 4010, 4552, 4553, 4564, 4570 or 4571; ME 3701, 4723 (20 sem. hrs.)., 93957=Computer Science and Second Discipline (24 hrs.) In addition to three credit hours each from a CSC 2000-level or above elective, a CSC 3000-level or above, and a CSC senior elective, an approved second discipline concentration consists of 15 sem. hrs. of electives in one area outside of the Department of Computer Science. All courses must be taken from a single department except when a university minor is obtained. Courses in the second area are to form a coherent sequence; where possible students should take co urses required of a major in that department. Ordinarily, there should be at least two courses numbered 3000 or above. Courses chosen from Information Systems and Decision Sciences must be numbered ISDS 3100 or above. The approval form must be submitted no later than the sophomore year with the consent of the departmental advisor and the dean’s office., 84508=An undergraduate minor in computer science is available. Required courses are CSC 1253, 1254, 2259, 3102, 3501, and 3 hrs. of computer science electives 3000-level and above; and 4101 or 4103 (total of 21hours)., 98751=An undergraduate minor in geology is available (17 hrs.). Required courses are GEOL 1001, 1003, 1601, 1602. At least three of the additional hours must be taken at the 3000 or 4000 level (excluding GEOL 3909) and on this campus., 69976=**The biological chemistry, preprofessional, and secondary education concentrations also require Biological Sciences 1208 and 1209 laboratories.}",
    "textBeforeTable": "TOTAL SEM. HRS. • 125 CURRICULUM IN BIOCHEMISTRY In addition to admission to the College of Basic Sciences, entry into any of the three majors (biochemistry, biological sciences, and microbiology) in the Department of Biological Sciences requires earned credit in BIOL 1201 and 1202; CHEM 1201; and MATH 1550. Admission into the Department of Biological Sciences An undergraduate minor in biological sciences is available to students majoring in curricula outside the Department of Biological Sciences. Required courses are BIOL 1201, 1202, 1208, 1209, 2051, 2153, 4087, and at least three more hours of biological sciences in a course at the 3000-level (excluding BIOL 3999) or above (total of 23 hours). The Department of Biological Sciences offers a comprehensive background in biology for teacher preparation, graduate studies, and for professional programs in medicine, dentistry, pharmacy, and veterinary medicine. The department offers bachelor of science degrees in biochemistry, biological sciences and microbiology. All degrees require a core of departmental courses that include BIOL 1201, 1202, 1208, 1209, 2051, 2153, and either 4087 or 4093 and 4094. In addition, all students are required to take 20-25 hours of electives from courses numbered 3000 and above in biological sciences that include two courses with laboratories and at least one course from three of four departmental groupings (described below). Students seeking the bachelor of science degree in biological sciences may fulfill the requirement for 20 hours of electives with courses from all areas of the department while students seeking",
    "textAfterTable": "Chemistry 2001, 2261, 2262, 2364. . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 10 Physics 2001, 2002, 2108, 2109 . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 8 English 2000 . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 3 General education social science course . . . . . . . . . . . . . . . . . . . . . . . . . . . . .  3   32 JUNIOR YEAR SEM. HRS. Biological Sciences 4001, 4093, 4094. . .",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}