{
    "relation": [
        [
            "Days",
            "30",
            "50",
            "150",
            "200"
        ],
        [
            "BSE",
            "116.57",
            "113.75",
            "129.97",
            "136.45"
        ],
        [
            "NSE",
            "116.55",
            "113.72",
            "129.94",
            "136.44"
        ]
    ],
    "pageTitle": "BGR Energy Systems Stock Price, Share Price, Live BSE/NSE, BGR Energy Systems Bids Offers. Buy/Sell BGR Energy Systems news & tips, & F&O Quotes",
    "title": "",
    "url": "http://www.moneycontrol.com/india/stockpricequote/infrastructure-general/bgrenergysystems/BES",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042981856.5/warc/CC-MAIN-20150728002301-00276-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 606837891,
    "recordOffset": 606783802,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{135416=JSWSteel Jul Fut, 219375=BGR Energy is in the Infrastructure - General sector. The current market capitalisation stands at Rs 878.21 crore. The company management includes Swarnamugi Karthik - Director - Corporate, M S Sundara Rajan - Director, V R Mahadevan - Joint Managing Director, A Swaminathan - Joint Managing Director & CEO, Gnana Rajasekaran - Director, S A Bohra - Director, M Gopalakrishna - Director, S R Tagat - Director, Heinrich Bohmer - Director, Sasikala Raghupathy - Director. It is listed on the BSE with a BSE Code of 532930 and the NSE with an NSE Code of BGRENERGY. Its Registered office is at No. A-5, Pannamgadu Industrial Estate,,Ramapuram Post, Nellore District,Andhra Pradesh - 524401. Their Registrars are Link Intime India Pvt. Ltd., 134709=UnitedBrewerie Jul Fut, 218069=Zensar Technologies Recommended on Mar 24th 2015, 134198=28 July 2015}",
    "textBeforeTable": "Edit Watchlist Have you invested in these stocks? You can track them better in your Portfolio close[x] Add to Watchist Account Optional Optional Optional Optional Add to Portfolio OR Add to watchlist } $('#mcpcp_addprof_info').hide(); { function close_info()",
    "textAfterTable": "Keep me signed in Forgot Password? New to Moneycontrol - Sign up now Its easy and FREE! Username Username should be atleast 4 characters Password Password should be 6 to 10 characters Confirm Password Email OR connect with LIVE",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}