{
    "relation": [
        [
            "Days",
            "30",
            "50",
            "150",
            "200"
        ],
        [
            "BSE",
            "78.50",
            "78.44",
            "83.15",
            "86.85"
        ],
        [
            "NSE",
            "78.52",
            "78.43",
            "83.14",
            "86.84"
        ]
    ],
    "pageTitle": "Neyveli Lignite Corporation Stock Price, Share Price, Live BSE/NSE, Neyveli Lignite Corporation Bids Offers. Buy/Sell Neyveli Lignite Corporation news & tips, & F&O Quotes",
    "title": "",
    "url": "http://www.moneycontrol.com/india/stockpricequote/power-generation-distribution/neyvelilignitecorporation/NLC",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042982745.46/warc/CC-MAIN-20150728002302-00202-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 591248719,
    "recordOffset": 591200133,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{134105=UnitedBrewerie Jul Fut, 212795=Neyveli Lignite is in the Power - Generation & Distribution sector. The current market capitalisation stands at Rs 13,623.00 crore. The company management includes B Surender Mohan - Chairman & Managing Director, A K Dubey - Part Time Official Director, Sarat Kumar Acharya - Director, Rakesh Kumar - Director, S Rajagopal - Director, M B N Rao - Director, V Murali - Director, S Boopathy - Director - Projects, C V Sankar - Part Time Official Director, Subir Das - Director. It is listed on the BSE with a BSE Code of 513683 and the NSE with an NSE Code of NEYVELILIG. Its Registered office is at \"Neyveli House\", No 135, Periyar EVR High Road,,Kilpauk Chennai (Madras),Tamil Nadu - 600010. Their Registrars are Integrated Enterprises (India) Ltd., 133594=28 July 2015, 211484=Astec LifeSciences Recommended on Mar 31st 2015, 134812=JSWSteel Jul Fut}",
    "textBeforeTable": "Edit Watchlist Have you invested in these stocks? You can track them better in your Portfolio close[x] Add to Watchist Account Optional Optional Optional Optional Add to Portfolio OR Add to watchlist } $('#mcpcp_addprof_info').hide(); { function close_info()",
    "textAfterTable": "Keep me signed in Forgot Password? New to Moneycontrol - Sign up now Its easy and FREE! Username Username should be atleast 4 characters Password Password should be 6 to 10 characters Confirm Password Email OR connect with LIVE",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}