{
    "relation": [
        [
            "Categories",
            "Campus Safety",
            "Greek Life",
            "Clubs and Activities",
            "Great for these types of students",
            "Share any unusual traditions or locations on campus",
            "Bang for the buck",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "It appears to be a very safe campus.",
            "I'm not sure if there are any greek life activities.",
            "There many types of student clubs and activities.",
            "Yes, I believe it is great for many types of students.",
            "I don't have any unusual traditional experiences at the moment, but I look forward to some in the future.",
            "This is an affordable junior college for inner-county resident as well as inner-state residents. There programs are partnered with many of the universities.",
            "There are many after class activities and concerts.",
            "There dining hall appears to be very good.",
            "Off campus living",
            "Academics is at the forfront for each students needs.",
            "Get all the information you need to make the best decision for your future.",
            "This is a very informative college that has the best interest of the student in mind. I enyjoyed visiting their campus and the staff are very helpful. I believe they have the students geared up for every educational challenge."
        ]
    ],
    "pageTitle": "Prince George's Community College Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Prince-Georges-Community-College/reviews?_escaped_fragment_=/show/75963",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042981856.5/warc/CC-MAIN-20150728002301-00264-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 900632223,
    "recordOffset": 900567075,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{344425=© 2015, Cappex.com, LLC, 69080=the education is worth the tuitoin. For a full time student. if you going to be taking 12 credit coures, its about 1600. I rather pay $1600 than pay over $20,000 for a course.}",
    "textBeforeTable": "01/01/2010 Reviewer is A current student here. 5 out of 6 people found this review useful. 1 of 90 Courtney from Lanham, MD Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for",
    "textAfterTable": "Will learn a lot I know that i will learn a lot at PG because of the support of my counselors and professors. Already I have made lasting relationships with some of the recruiters Login to rate or flag the reviews George from New Carrollton, MD 05/29/2012 Reviewer is A past student here. 3 out of 3 people found this review useful. 3 of 90 Categories Comments Campus Safety The campus is very safe. The students aren't there to look for trouble just to learn and have fun. The campus police are always on Patrol especially in the parking lots. Greek Life There is no greek life. Alcohol is not allowed. Clubs and Activities There are so many events on campus. The school always have events, performances every week. One of the biggest events is The Global Cafe and Battle of the Sexes.",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}