{
    "relation": [
        [
            "SR#",
            "1",
            "2"
        ],
        [
            "Country",
            "India",
            "United States"
        ],
        [
            "Visitors",
            "4.9%",
            "92.1%"
        ],
        [
            "Rank",
            "177,072",
            "21,914"
        ]
    ],
    "pageTitle": "Heartlandamerica.com Heartland America: The Best Bargains, Closeouts and Special Buys on Brand Name Electronics, Hardware, Housewares, Jewelry, Computers, Gifts and More! - Web Analysis",
    "title": "",
    "url": "http://websiterecord.com/dm/heartlandamerica.com",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042981856.5/warc/CC-MAIN-20150728002301-00239-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 266569491,
    "recordOffset": 266553526,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{3165=This website's visitors contributed to build its alexa rank of 98,307. Main title of this domain is Heartland America: The Best Bargains, Closeouts and Special Buys on Brand Name Electronics, Hardware, Housewares, Jewelry, Computers, Gifts and More!. Page rank from Google is 4. A higher PR shows its a high backlinked and unique content filled site. Ip for this site is assigned as: 65.121.1.12 linking to a server in Heartland America whose company (isp) is Heartland America. Other scam check, analytics and advice may be checked below.}",
    "textBeforeTable": "  Popular Pages Analysis Why this?: Top pages as seen on google. These pages means highest ranked pages by google's algorithm. either sorted by ranking, PR, or by user interaction/liking. Many factors are involved in this calculation. Confidence Its Reputation in Child Safety is 82/100. 82 Reputation Child Safety Confidence Its Reputation in Privacy is 83/100. 83 Reputation",
    "textAfterTable": "4 Heartland America: Heartland America Gift Card http://www.heartlandamerica.com/giftcardterms/ 5 Heartland America: Household: Security, Furniture, lighting, grills, air ... http://www.heartlandamerica.com/household 6 Heartland America: Fashion & Accessories: Outerwear, Bed & Bath ... http://www.heartlandamerica.com/fashion 7 Fashion > Outerwear - Heartland America http://www.heartlandamerica.com/household/kitchenGet 8 Heartland America - Cleaning - Deals on Brand Name Cleaning at ... http://www.heartlandamerica.com/household/cleaning 9 Heartland America - Boots - Deals on Brand Name Boots at Bargain ... https://www.heartlandamerica.com/footwear/boots 10 Heartland America - Furniture - Deals on Brand Name Furniture at ... http://www.heartlandamerica.com/household/furniture   Subdomains of Heartlandamerica.com Why this?: Top pages as seen on google. These pages means highest ranked pages by google's algorithm. either sorted by ranking, PR, or by user interaction/liking. Many factors are involved in this calculation. SR# Subdomain Visitors Percentage 1 heartlandamerica.com 100.00%   10 Most Popular Keywords Why this?:",
    "hasKeyColumn": true,
    "keyColumnIndex": 1,
    "headerRowIndex": 0
}