{
    "relation": [
        [
            "Task",
            "Check to determine if the console is running and enabled.",
            "List console resources and properties.",
            "Determine if an application is a legacy application.",
            "List all registered applications.",
            "Register a legacy application with the Java Web Console.",
            "Unregister a legacy application from the Java Web Console.",
            "Register a current application with the Java Web Console.",
            "Unregister a current application from the Java Web Console.",
            "Enable remote Access to the Java Web Console.",
            "Change the console's internal passwords"
        ],
        [
            "Description",
            "Use the smcwebserver, wcadmin, and svcs commands to check if the console is running and enabled. This information is useful for troubleshooting problems.",
            "You might need to gather information about the console resources and properties for troubleshooting purposes.",
            "Current applications are registered and deployed with a single command while the console server is running. Legacy applications require the console server to be stopped during registration. If you need to register or unregister an application, you must first determine if the application is a legacy application",
            "You can list all applications that are registered with the Java Web Console. Listing all registered applications provides you with information that can be helpful in troubleshooting situations.",
            "If you need to use a legacy application, you must first register the application with the Java Web Console.",
            "If you do not want a legacy application registered with the Java Web Console, follow the procedure to unregister the legacy application.",
            "Before using a new application, you need to register the application with the Java Web Console.",
            "In some situations, you might need to unregister a current application from the Java Web Console.",
            "You can enable remote access only to the console, while leaving the other access restrictions in place.",
            "The Java Web Console uses internal passwords. To reduce the possibility of a security breach, you can change these passwords."
        ],
        [
            "For Instructions",
            "How to Check if the Console is Running and Enabled",
            "How to List Console Resources and Properties",
            "How to Determine if an Application is a Legacy Application",
            "How to List Deployed Applications",
            "How to Register a Legacy Application With the Java Web Console",
            "How to Unregister a Legacy Application From the Java Web Console",
            "How to Register a Current Application With the Java Web Console",
            "How to Unregister a Current Application from the Java Web Console",
            "How to Enable Remote Access to the Java Web Console",
            "How to Change the Console's Internal Passwords"
        ]
    ],
    "pageTitle": "Chapter??3 Working With the Sun Java Web Console (Tasks) (System Administration Guide: Basic Administration)",
    "title": "",
    "url": "http://docs.oracle.com/cd/E19082-01/819-2379/6n4m1vl8p/index.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042981856.5/warc/CC-MAIN-20150728002301-00261-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 75841667,
    "recordOffset": 75823319,
    "tableOrientation": "HORIZONTAL",
    "lastModified": "Wed, 28 Aug 2013 19:41:34 GMT",
    "textBeforeTable": "Getting Started With the Java Web Console (Task Map) Firefox (at least Version, 1.0) Netscape (at least Version, 6.2) Mozilla (at least Version, 1.4) The Java Web Console can be used in any of the following browsers while running the Solaris OS: Supported Web Browsers For more information about each command, see the smcwebserver(1M), wcadmin(1M), and the smreg(1M) man pages. The commands are used to perform various tasks that this chapter describes. smreg – If you are not running at least the Solaris Express 5/06release, this command is used to register all console applications. , use this command only to register legacy applications that were created for a version of the console that is not at least Java Web Console 3.0. wcadmin – Starting with the Solaris 10 11/06 release, this command is used to configure the console, and to register and deploy console applications. For more information, see the wcadmin(1M) man page. smcwebserver – This command starts and stops the console's web server. The Java Web Console includes the following management commands: Java Web Console Management Commands Standard, extensible authentication, authorization, and auditing mechanisms The Java Web Console supports Pluggable Authentication Module (PAM), role-based access control (RBAC) roles, and",
    "textAfterTable": "Enter your user name and password, and optionally your RBAC role. Roles contain authorizations and privileged commands. For more information about roles, see Configuring RBAC (Task Map) in System Administration Guide: Security Services. The console services check your credentials to authenticate them, and ensure that you are authorized to use the console and registered applications. Click the Start Each Application in a New Window check box if you want to run the application in a new window. If you do not select this option, the application will run in the default window, replacing the launch page. Click the link for the application that you want to run. Tip – You can also launch an individual application directly and bypass the launch page by using the following syntax: https://hostname.domain:6789/app-context-name where app-context-name is the name that is used when the application is deployed. To find the application context name, you can do one of the following: Read the application's documentation. Run the wcadmin list -a or the smreg list -a command to see a list of deployed web applications and their context names. Run the application from the web console's launch page and note the URL that is displayed in the address location field. You can type the URL directly the next time",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}