{
    "relation": [
        [
            "Categories",
            "Bang for the buck",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "So expensive to attend Syracuse. It is like anything, if you want the name, you will have to pay for it.",
            "To be honest, I really have no time for fun. There are so many options when it comes to joining an organization or club. Great sports (except football), but nobody wants to be outside doing anything from November until April because all it does is snow. If you are an outdoors lover, Syracuse is not the place for you.",
            "Marshall street provides students with about 7 options when it comes to dining, which gets old very very quickly. If you are on a meal plan, you are paying way too much for poor quality food that will cause you stomach aches constantly.",
            "Communal showers, old buildings, no air conditioning (in most places), over priced, small spaces, required on campus living. There is honestly nothing good about living in dorms at Syracuse.",
            "Of course, there are some courses that will not be very challenging. However, I can say that these past few years have been the most difficult years of my life. You will learn so much about yourself at Syracuse and your abilities will be tested no matter your field of study.",
            "I encourage any prospective students to be as well-rounded as possible in high school. Join clubs, be involved, do community service, and prove why you would actually make a difference.",
            "Syracuse is the coldest place I have been. It has great faculty who are all very accomplished in their field. There are great sports, lots of clubs and diversity, and really good financial aid packages."
        ]
    ],
    "pageTitle": "Syracuse University Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Syracuse-University/reviews?_escaped_fragment_=/show/2340",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042982745.46/warc/CC-MAIN-20150728002302-00146-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 888037495,
    "recordOffset": 887893414,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{113590=To be honest, I really have no time for fun. There are so many options when it comes to joining an organization or club. Great sports (except football), but nobody wants to be outside doing anything from November until April because all it does is snow. If you are an outdoors lover, Syracuse is not the place for you., 654471=Everything. There is always something going on. Be it a speaker, a large event, a sports game, a march, a gathering, a movie. There is always something., 194456=The greek life is amazing. If you are interested, rush is a great experience for both girls and guys even if you choose not to pledge. There are 20+ fraternities and 11 sororities as of May 2013. Being in a sorority is a great way to get to know people, to do volunteer services and to get connected., 325753=While Syracuse is the most expensive school I applied to I feel like it is worth it. I am getting a great education and having the time of my life. If I could go back to April 2010 when I was making my decision again I wouldn't do anything differently., 1359=- Plenty of students find SU to be the right fit for them socially and academically, but not financially. Make sure you feel fiscally comfortable with the choice. - Find a club -- and find one early! You will make invaluable friendships in a common interest activity, which can often help not only socially but academically too! - Winter approaches near the end of October, and won't quit often until March or April. Make sure you're comfortable with the climate, and although it gets only moderately cold, the snow really piles up. - Student employment opportunities vary -- foodservice to restaurants, clerical to tutoring. They disappear quickly, so apply ASAP! - If you don't like the color orange, SU may not be right for you., 85921=-For the first few months, food is great. There is a lot of variety in the dinning halls, however, the downside is how early dinning halls close (8:30 pm) in addition to their repetitiveness every week. There are other places to eat (i.e. Pizza Hut, The Varsity, Subway, etc.) off campus., 647675=Mayfest happens at the end of every April. It is so much fun. Everyone has would be outside playing games. There is music coming from all directions and there is a concert held later that day., 779193=© 2015, Cappex.com, LLC, 235377=Syracuse University has a very distinct atmosphere: it is very inviting, yet allows you to feel free in your individuality. Twenty inches of snow is common so snow days are basically non-existent; in order words, don't expect classes to be cancelled during the wintery months of October through March. SU will more than likely have this pull on you that will make you miss it when it is time to vacate for the breaks., 243729=It's 5:47, AND GEORGETOWN STILL SUCKS., 249608=Kissing bench, It's 08:24 and georgetown still sucks., 234809=When moving-in in August, bring a standard size fan. The dorms are not air-conditioned and the sun is working overtime to compensate for the long vay-cay starting in late October, early November. When preparing to trek through piles of slippery, icy snow, invest in a sturdy, reliable, thermo-lite pair of snow boots. Those boots will be as important as your laptop. Please buy some., 384366=The dorms at SU are terrible especially since the dorm fees are expensive. The best 2 dorms to live at are Lawrinson Hall and Ernie Davis Hall. Ernie Davis was completed in 2010 and is the newest dorm on campus. It is also the only dorm on campus that has air conditioning. Lawrinson Hall is the tallest dorm on campus. It has 20 floors and a pent house. The location of lawrinson is not that great but the building makes up for it because all of the floors and rooms are renovated with new carpets and new furniture. There is also a laundry room on each floor at both ernie davis and lawrinson unlike at any of the other dorms. The worst dorm on campus is delplain hall., 375931=A lot of hills! May seem awkward., 87824=1. Come with an open mind! College is a completely different experience and should be looked at as such. 2. Don't be nervous or scared because we were all in the same position once 3.When in doubt....just ask! 4. Get involved early! There are several clubs and student organizations that will most likely have what you are interested in! 5. Meet upperclassmen: they can help! 6. Befriend your professors and TA's! It will pay off! 7. Be sure to go to class! No one will be around to tell you to do so, and when you don't your grade will be affected! 8. Get ready for the winter! It gets pretty cold around October until mid April or May 9. Be prepared to witness a lot of school spirit! 10. Most of all, enjoy your first year! You will love all of your new experiences here at Syracuse, so make the most of them!, 739954=Food is average. You can often find people complaining, but it is really not that bad. Plenty of options. Most dining halls stay open till 7:30 but Ernie Davis stays open till 9!}",
    "textBeforeTable": "07/21/2009 Reviewer is A current student here. 46 out of 46 people found this review useful. 1 of 166 Angela from Syracuse, NY Check out reviews left by other students or leave your own review. You could win a free scholarship. Syracuse University Reviews Syracuse University › New York › By State › Colleges › } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.create', -->",
    "textAfterTable": "Categories Comments Great for these types of students The best thing about SU is that it's great for all students. There's a great blend of different people at SU, it doesn't just cater to one type of student so you get a bunch of different experiences. Tips for prospective students Syracuse may seem big - it's what worried me about the school, but it's really not as big as it seems. You will walk across the quad and know at least one person. Get involved in clubs, you'll make so many friends through them. Bang for the buck I would say Syracuse's price is the worst thing about it. They have a pretty good financial aid department, but the school itself is just incredibly expensive. However, though it is expensive your money is going to a good place as the dorms are relatively nice for dorms and there are tons of clubs and such paid for by your student fee. Am enjoying being here I love being at Syracuse. The first three weeks were hard to adjust, but that's normal for any freshman. After getting used to the campus I never wanted to leave. It's summer now and I am counting down the days",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}