{
    "relation": [
        [
            "RNK",
            "1",
            "2",
            "3",
            "4",
            "5",
            "6",
            "7",
            "8",
            "9",
            "10"
        ],
        [
            "SIRE",
            "Old Forester",
            "Where's the Ring",
            "Philanthropist",
            "Giant Gizmo",
            "Ghostzapper",
            "Invincible Spirit (IRE)",
            "Shamardal",
            "Candy Ride (ARG)",
            "Milwaukee Brew",
            "Elusive City"
        ],
        [
            "YB",
            "2001",
            "1999",
            "2001",
            "2004",
            "2000",
            "1997",
            "2002",
            "1999",
            "1997",
            "2000"
        ],
        [
            "Str",
            "71",
            "65",
            "64",
            "38",
            "22",
            "89",
            "66",
            "35",
            "51",
            "83"
        ],
        [
            "Sts",
            "193",
            "176",
            "148",
            "97",
            "53",
            "231",
            "154",
            "80",
            "146",
            "234"
        ],
        [
            "Wnr",
            "23",
            "19",
            "13",
            "13",
            "9",
            "26",
            "18",
            "14",
            "17",
            "29"
        ],
        [
            "SWnr",
            "1",
            "1",
            "1",
            "1",
            "2",
            "18",
            "10",
            "1",
            "1",
            "16"
        ],
        [
            "Wns",
            "28",
            "23",
            "16",
            "17",
            "11",
            "35",
            "31",
            "18",
            "19",
            "37"
        ],
        [
            "SWns",
            "1",
            "1",
            "1",
            "1",
            "3",
            "23",
            "19",
            "1",
            "1",
            "19"
        ],
        [
            "%WS",
            "15",
            "13",
            "11",
            "18",
            "21",
            "15",
            "20",
            "23",
            "13",
            "16"
        ],
        [
            "Earnings",
            "$990,701",
            "$947,007",
            "$802,484",
            "$788,745",
            "$764,128",
            "$702,346",
            "$693,681",
            "$683,571",
            "$622,526",
            "$530,753"
        ]
    ],
    "pageTitle": "Handicapper's Edge",
    "title": "LEADING ALL-WEATHER SIRES BY CURRENT YEAR EARNINGS",
    "url": "http://www.brisnet.com/cgi-bin/editorial/news/full_edition.cgi",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042981856.5/warc/CC-MAIN-20150728002301-00335-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 338245583,
    "recordOffset": 338218911,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{47705=Total and on-track year-over-year handle increased at the 2015 Belmont Park spring/summer meet which ran 59 days from April 29 to July 19, according to the New York Racing Association., 44867=A native of Chicago, Durkin studied drama at St. Norbert College in De Pere, Wisconsin. In 1971, he was hired as a race caller at Quarter Horse and Thoroughbred races at county fairs in Wisconsin, which he did each summer through 1975. The following year he was employed by Daily Racing Form as a call taker responsible for documenting the comments and statistics used in the official charts of the races at Cahokia Downs and Thistledown. Later, Durkin went on to work as a race caller at Florida Downs, Miles Park, Quad City, Balmoral Park, Hialeah Park, Meadowlands, and Gulfstream Park. In 1990 Durkin was hired to call races at the New York Racing Association's Aqueduct, Belmont Park, and Saratoga. Durkin has called races at more than 50 tracks in six countries., 44084=Tom Durkin is one of horse racing's most identifiable voices. He served as the chief TV voice for the Breeders' Cup, from its inception through 2005. He was a longtime broadcaster on NBC as part of the network's sports casting crew for horse races, providing analysis, commentary and features in addition to the descriptions of races. His work at NBC included coverage of the Triple Crown for a number of years., 47117=For the 59 days, there were 553 races run in 2015, compared to 509 for 54 days in 2014. Average betting interests per race in 2015 was 7.7 (4,231 total) compared to 7.5 (3,804 total) in 2014., 43664=Durkin retired in 2014 and, in recognition of his career-long dedication, he was awarded the Eclipse Award of Merit in January 2015. Durkin has continued to serve the industry, as master of ceremonies of various events, including the Hall of Fame inductions, the OwnerView Thoroughbred Owners' Conference, and the Pan American Racing Conference., 49696=The 1 3/16-mile Prince of Wales has attracted a field of seven, but all eyes will be on Shaman Ghost, who will try and follow in the hoof steps of Wando, the last horse to win both the Queen's Plate and Prince of Wales. That recently-deceased champion wound up sweeping the Canadian Triple Crown in 2003., 54134=Bet down to 6-5, Shore Runner got up at the last jump under Kendrick Carmouche to win his stakes debut in a time of 1:01 for 5 1/2 furlongs on the firm Mellon turf. He paid $4.70 and is now a potential candidate for the Breeders' Cup Turf Sprint (G1) in October., 47216=Attendance at Belmont Park this spring was 286,432, down 5.3 percent from 302,512 in 2014., 45426=Tom Durkin has been selected by the Board of Directors of the Thoroughbred Club of America as the 2015 Honored Guest, Club President Shannon Arvin announced Monday. Durkin will be honored by the Club at its 84th Testimonial Dinner at Keeneland on September 29., 52169=Judy the Beauty (Ghostzapper), the 2014 champion female sprinter, will maker her first outing since May in Wednesday's $200,000 Honorable Miss H. (G2) at Saratoga.}",
    "TableContextTimeStampAfterTable": "{73717=(North American statistics in above lists updated through July 26), 14883=HANDICAPPER'S EDGE is compiled by Bloodstock Research Information Services. This newsletter may not be reproduced or transmitted in any form or by any means, electronic or mechanical, without the prior written permission of the copyright owner. Copyright 2011, Bloodstock Research Information Services. Information as to the races, race results and earnings was obtained from Equibase Company LLC and is utilized herein with the permission of the copyright owner, Equibase Company LLC.}",
    "textBeforeTable": "Sire Lists (4th) Tranzip, 7-2     (2nd) Tippany, 3-1   Presque Isle Downs (7th) Gangstress of Love, 6-1     (4th) Dan and Sheila, 6-1   Parx Racing (9th) Diamond Dan, 6-1     (1st) Midnight Shine, 6-1   Mountaineer (6th) Red Zone, 7-2     (4th) El Coco Loco, 8-1   Indiana Grand (3rd) Sandeman, 5-1     (1st) Golden Abby, 6-1   Fort Erie (9th) Wise Awake, 3-1     (5th) Augie Dawgie, 6-1   Finger Lakes (5th) Noon Shadow, 10-1     (4th) Sophia's Night, 8-1   Delaware Park (RACE) HORSE, MORNING LINE   TRACK",
    "textAfterTable": "RNK SIRE YB Dms Sps/% Sts Wnrs SWs BSPI ABSPI Earnings 1 A.P. Indy 1989 275 76/27 421 175 23 2.01 0.80 $9,945,173 2 Storm Cat 1983 324 76/23 473 154 18 2.03 0.81 $8,734,980 3 Unbridled's Song 1993 261 65/24 403 166 13 1.65 0.85 $8,542,118 4 Sadler's Wells 1981 360 102/28 501 159",
    "hasKeyColumn": true,
    "keyColumnIndex": 1,
    "headerRowIndex": 0
}