{
    "relation": [
        [
            "Days",
            "30",
            "50",
            "150",
            "200"
        ],
        [
            "BSE",
            "266.90",
            "269.48",
            "249.47",
            "248.42"
        ],
        [
            "NSE",
            "267.08",
            "269.65",
            "249.62",
            "248.53"
        ]
    ],
    "pageTitle": "Bharat Heavy Electricals Stock Price, Share Price, Live BSE/NSE, Bharat Heavy Electricals Bids Offers. Buy/Sell Bharat Heavy Electricals news & tips, & F&O Quotes",
    "title": "",
    "url": "http://www.moneycontrol.com/india/stockpricequote/infrastructure-general/bharatheavyelectricals/BHE?sc_did=BHE",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042982745.46/warc/CC-MAIN-20150728002302-00113-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 599127911,
    "recordOffset": 599078926,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{213778=Astec LifeSciences Recommended on Mar 31st 2015, 215078=BHEL is in the Infrastructure - General sector. The current market capitalisation stands at Rs 68,104.47 crore. The company management includes B Prasada Rao - Chairman & Managing Director, P K Bajpai - Director - Finance, R Krishnan - Director - Human Resources, W V K Krishna Shankar - Director, Atul Sobti - Director - Power, S K Bahri - Part Time Official Director, Harinder Hira - Part Time Non Official Director, A N Roy - Part Time Non Official Director, Rajesh Kumar Singh - Part Time Official Director, T N Veeraraghavan - Director, Harinder Hira - Part Time Non Official Director, A N Roy - Part Time Non Official Director. It is listed on the BSE with a BSE Code of 500103 and the NSE with an NSE Code of BHEL. Its Registered office is at BHEL House, Siri Fort, New Delhi,Delhi - 110049. Their Registrars are Karvy Computershare Private Ltd., 135971=28 July 2015, 137189=JSWSteel Jul Fut, 136482=UnitedBrewerie Jul Fut}",
    "textBeforeTable": "Edit Watchlist Have you invested in these stocks? You can track them better in your Portfolio close[x] Add to Watchist Account Optional Optional Optional Optional Add to Portfolio OR Add to watchlist } $('#mcpcp_addprof_info').hide(); { function close_info()",
    "textAfterTable": "Keep me signed in Forgot Password? New to Moneycontrol - Sign up now Its easy and FREE! Username Username should be atleast 4 characters Password Password should be 6 to 10 characters Confirm Password Email OR connect with LIVE",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}