{
    "relation": [
        [
            "Institution",
            "University of Melbourne",
            "University of Western Australia",
            "University of Sydney",
            "University of Queensland",
            "McGill University",
            "University of British Columbia",
            "University of Toronto",
            "University of Waterloo",
            "Waseda University",
            "University of Auckland",
            "National University of Singapore",
            "Caltech",
            "Rensselaer Polytechnic Institute",
            "Rutgers, State University of New Jersey",
            "Johns Hopkins University",
            "University of Texas at Austin",
            "University of Washington"
        ],
        [
            "Demand",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            ""
        ],
        [
            "Country",
            "Australia",
            "Australia",
            "Australia",
            "Australia",
            "Canada",
            "Canada",
            "Canada",
            "Canada",
            "Japan",
            "New Zealand",
            "Singapore",
            "USA",
            "USA",
            "USA",
            "USA",
            "USA",
            "USA"
        ],
        [
            "Teaching Language",
            "English",
            "English",
            "English",
            "English",
            "English",
            "English",
            "English",
            "English",
            "Japanese",
            "English",
            "English",
            "English",
            "English",
            "English",
            "English",
            "English",
            "English"
        ],
        [
            "Web Address",
            "www.melbourne.edu.au",
            "www.uwa.edu.au",
            "www.usyd.edu.au",
            "www.uq.edu.au",
            "www.mcgill.ca",
            "www.ubc.ca",
            "www.utoronto.ca",
            "www.uwaterloo.ca",
            "http://www.waseda.jp",
            "www.auckland.ac.nz",
            "www.nus.edu.sg/",
            "www.caltech.edu",
            "www.rpi.edu",
            "www.rutgers.edu",
            "www.jhu.edu",
            "www.utexas.edu",
            "www.washington.edu"
        ]
    ],
    "pageTitle": "Options Guide",
    "title": "",
    "url": "http://www.ucl.ac.uk/studyabroad/options/options-guide",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990112.50/warc/CC-MAIN-20150728002310-00051-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 774420079,
    "recordOffset": 774394124,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{358388=© UCL 1999–2015, 357090=Page last modified on 24 apr 15 16:15}",
    "textBeforeTable": "To apply for the following Erasmus institutions, please contact your Study Abroad Tutor. Erasmus institutions The Departmental Information Sheet for Classics will be available shortly which outlines how studying abroad is structured for Classics students. Below is a list of the exchanges open to your programme. Please be advised that this list may be updated without notice. Once you have made a decision about where to go, you can find out how to apply for your preferred exchanges.  Exchange Programmes for Classics and Ancient World Studies Students Classics and Ancient World Studies Faculty of Arts & Humanities SHS MAPS Life Sciences Laws Engineering Bartlett Arts & Humanities If you have questions about institutions you would like to apply to, please email the Study Abroad Team. Our partners kindly ask that you do not contact them directly.  Please remember that you are advised not to list more than one High or Very High Demand institution on your application if at all possible. To help you make the best application, we have marked each institution on this list with a colour to denote the level of demand we generally experience for that institution. Levels of demand",
    "textAfterTable": "University of Washington USA English www.washington.edu European Social and Political Studies Exchange Programmes for ESPS Students Below is a list of the exchanges open to your programme. Please be advised that this list may be updated without notice. Once you have made a decision about where to go, you can find out how to apply for your preferred exchanges. Erasmus Exchanges Belgium Université Libre de Bruxelles France Ecole des Hautes Etudes en Sciences Sociales Institut d'Etudes Politiques de Bordeaux (Sciences Po) Institut d'Etudes Politiques de Paris (Sciences Po) Germany Freie Universität Berlin Humboldt-Universität zu Berlin Universität Hamburg Italy Sapienza – Università di Roma Università degli Studi di Milano Spain Universidad Pablo de Olavide, Sevilla Universidad de Sevilla SELCS Exchanges In addition to the ESPS exchanges listed above, ESPS students are eligible to apply for exchange placements at a range of European universities through the School of European Languages, Culture &",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}