{
    "relation": [
        [
            "Table 12",
            "(1)",
            "(2)",
            "(3)",
            "(4)",
            "(5)",
            "(6)",
            "(7)",
            "(8)",
            "(9)"
        ],
        [
            "",
            "talc",
            "muscovite",
            "flaky black bright pigment of Example 5",
            "pigment",
            "squalane",
            "cetyl 2-ethylhexanoate",
            "sorbitan sesquioleate",
            "preservative",
            "fragrance"
        ],
        [
            "",
            "21",
            "20",
            "40",
            "12",
            "4",
            "1.9",
            "0.8",
            "0.1",
            "0.2 (% by mass)"
        ]
    ],
    "pageTitle": "BLACK BRIGHT PIGMENT, AND COSMETIC, COATING COMPOSITION, RESIN COMPOSITION AND INK COMPOSITION COMPRISING THE SAME - Nippon Sheet, Glass Co Ltd",
    "title": "",
    "url": "http://www.freepatentsonline.com/EP1666541B1.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990112.50/warc/CC-MAIN-20150728002310-00341-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 449690923,
    "recordOffset": 449670500,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{11656=2002-30232 describes a metallic pigment comprising glass powder coated with a nickel alloy with a thickness of 0.04 µm or thinner and showing black appearance.}",
    "TableContextTimeStampAfterTable": "{25497=A proper amount of each flaky black bright pigment was added to an acrylic resin coating material (Acryl Auto Clear Super, manufactured by NIPPON PAINT Co. , Ltd. , solid matter about 50% by mass) so as to be 10% by mass in the resin, and well mixed and stirred, and then applied to a hiding power measurement paper by an applicator with intervals of 9 mil (9/1000 inch) and dried. The coated sheet was subjected to measurement of brightness L15 value at 15° angle, hue a value and b value by a multi-angle spectrocolorimeter (X-rite MA 68II, Color Techno System Corp.). As the brightness L 15 value is higher, the brightness is higher and gives more brightness., 89864=© 2004-2015 FreePatentsOnline.com. All rights reserved. Privacy Policy & Terms of Use. A SumoBrain Solutions Company, 40501=Flaky glass (Micro Glass Fine Flake RCXFFX-1040 (9507), manufactured by Nippon Sheet Glass Co., Ltd. , C glass composition, average thickness 1.3 µm, average particle diameter 38 µm) 1.2 kg was added to 4 L of ion exchange water and stirred by a stirrer to obtain a slurry. After an aqueous solution of 0.5% by mass of tin(II) chloride 0.3 L was added to the slurry at normal temperature, the mixture was stirred for 5 minutes. The flaky glass was recovered by vacuum filtration and washed with ion-exchange water. The flaky glass was suspended in 4 L of pure water to obtain a slurry, and an aqueous solution of 2% by mass of palladium(II) chloride 0.01 L was added to the slurry, followed by stirring for 5 minutes . The flaky glass was recovered by vacuum filtration and washed with pure water., 13668=As the thin film material for coating on the surface of the flaky glass base material in the present invention is used triiron tetroxide (black iron oxide, magnetite Fe3O4) or a low order titanium oxide (black titanium oxide, TiOx wherein x is less than 2 and generally 1.5 to 1.8). A mixture of triiron tetroxide and a low order titanium oxide may be used and a laminate of a thin film of triiron tetroxide and a thin film of a low order titanium oxide may be used. In view of the safety and effect of dark interference color development, triiron tetroxide is preferably used. Adjustment of the thickness of the thin film in the coating makes it possible to give interference color. The thickness is 10 nm to 1.0 µm (1000 nm). If the thickness is thinner than 10 nm, black coloration is weak, and if it exceeds 1.0 µm, problems that it takes a long time to produce or that the coating layer is cracked may occur. If the thickness of the coating layer is 30 to 300 nm, beautiful interference color can be seen. If it exceeds 300 nm, the light absorption is intensified and the interference color becomes weak, however, the black coloration is intensified and the hiding power is increased., 31069=Each flaky glass thus obtained (100 g) was added to and dispersed in 1 L of purified water, and kept under heating at 75°C in a thermostat water tank. The resulting solution was adjusted to a pH of about 3.2 with a diluted hydrochloric acid. After that, 10% iron (III) chloride solution was added. In this case, the pH was kept about 3.2 by a diluted sodium hydroxide solution, thereby to give a flaky glass of which surface was coated with Fe2O3. The addition amount of the 10% iron(III) chloride solution was adjusted so as to make the coating thickness approximately even. That is, in the case where the thickness of the mother flaky glass was 0.7 µm, the total addition amount of the 10% iron(III) chloride solution was adjusted to 2005 g; in the case the thickness was 1.3 µm, the total addition amount of the 10% iron(III) chloride solution was adjusted to 1080 g; and in the case the thickness was 5 µm, the total addition amount of the 10% iron(III) chloride solution was adjusted to 281 g. After completion of the addition, the flaky glass suspension solution was filtered, and the recovered residue was dried, the residue was previously fired at 600°C for 2 hours to obtain Fe2O3-coated flaky glass.}",
    "textBeforeTable": "Ten panelists were employed in the following sensory tests for cosmetics. The brightness and touch feeling were evaluated on the basis of the average value of the evaluation points of these ten panelists. Additionally, to make the evaluation results easy to be understood, the following symbols shown in Table 9 are marked for the evaluation results. rough touch feeling 5 slightly rough touch feeling 4 ordinal 3 rather smooth 2 smooth 1 Touch feeling Evaluation Table 8 no brightness 5 little brightness 4 brightness 3 intense brightness 2 very intense brightness 1 Brightness Evaluation Table 7 Next, each flaky black bright pigment produced in the above-mentioned Examples and Comparative Examples was used for producing cosmetics for trial, and sensory tests for the use feeling of them were carried out. The items of",
    "textAfterTable": "(3) glycerin 0.3 (4) polyethylene glycol with high polymerization degree (average molecular weight 2,000,000) 0.5 (5) pure water 65.0 (6) flaky black bright pigment of Example 4 3.0 (7) triethanolamine 3.0 (8) stearic acid 5.0 (9) beeswax 9.0 (10) carnauba wax 3.0 (11) paraffin wax 10.0 (% by mass) The components (1) to (5) were mixed and evenly dissolved by heating at 75°C. The black bright pigment of the component (6) was added to the mixture and evenly dispersed through a colloid mill. Further, the component (7) was mixed, dissolved, and heated at 75°C and further, the components (8) to (11) which are heated and evenly melted were added and the obtained mixture was emulsified and cooled to obtain an emulsion type mascara. (Comparative Example 5) An emulsion type mascara was produced in the same manner as Example 14, except that the iron oxide pigment of Comparative Example 1 was used in place of the black bright pigment (black iron oxide-containing flakes) of the component (6) in Example 16. The results of the sensory tests for Example 16 and Comparative Example 5 are shown in",
    "hasKeyColumn": true,
    "keyColumnIndex": 1,
    "headerRowIndex": 0
}