{
    "relation": [
        [
            "Patent application number",
            "20100314706",
            "20110079824",
            "20120313195",
            "20130170623",
            "20140124905"
        ],
        [
            "Description",
            "VARIABLE RING WIDTH SDD - A silicon drift detector (SDD) comprising electrically isolated rings. The rings can be individually biased doped rings. One embodiment includes an SDD with a single doped ring. Some of the doped rings may not require a bias voltage. Some of the rings can be field plate rings. The field plate rings may all use the same biasing voltage as a single outer doped ring. The ring widths can vary such that the outermost ring is widest and the ring widths decrease with each subsequent ring towards the anode.",
            "ALTERNATE 4-TERMINAL JFET GEOMETRY TO REDUCE GATE TO SOURCE CAPACITANCE - A 4-Terminal JFET includes a substrate having a first conduction type and an upper layer having a second, opposite, conduction type over the substrate. A gate and a source are embedded in the upper layer. A gate pad is electrically connected to the gate. A region, which has a first conduction type, is formed in the upper layer and separates the upper layer into two sections. This region reduces the overall capacitance between the gate pad and the source. Reduced overall gate to source capacitance can result in reduced noise amplification in the JFET.",
            "SEMICONDUCTOR MOS ENTRANCE WINDOW FOR RADIATION DETECTORS - A semiconductor detector device, such as a PIN diode or silicon drift detector, including a substrate with an entrance window. The entrance window comprises a conductive layer, and an insulating layer disposed between the conductive layer and the substrate. The insulating layer and conductive layer cover a center portion of the surface of the substrate.",
            "SMALL X-RAY TUBE WITH ELECTRON BEAM CONTROL OPTICS - An x-ray tube comprising an anode and a cathode disposed at opposing ends of an electrically insulative cylinder. The x-ray tube includes an operating range of 15 kilovolts to 40 kilovolts between the cathode and the anode. The x-ray tube has an overall diameter, defined as a largest diameter of the x-ray tube anode, cathode, and insulative cylinder, of less than 0.6 inches. A direct line of sight exists between all points on an electron emitter at the cathode to a target at the anode.",
            "VIBRATION NOISE SHIELD IN A SEMICONDUCTOR SENSOR - A semiconductor device comprises a substrate, a cathode, an outer ring, an anode, an electrically insulating layer, and an electrically conducting layer. The substrate includes a semiconducting material having a first conduction type. The substrate has a first face and a second face substantially parallel to the first face. A cathode is disposed at the second face and has the first conduction type. An outer ring, having the first conduction type, is disposed at an outer perimeter of the first face of the substrate. An anode, having the second conduction type, is disposed at the first face of the substrate within an inner perimeter of the outer ring. An electrically insulating layer is disposed over the outer ring. An electrically conducting layer is disposed over the electrically insulating layer and over the outer ring. The electrically conducting layer electrically is insulated from the outer ring by the electrically insulating layer."
        ],
        [
            "Published",
            "12-16-2010",
            "04-07-2011",
            "12-13-2012",
            "07-04-2013",
            "05-08-2014"
        ]
    ],
    "pageTitle": "Derek - Patent applications",
    "title": "",
    "url": "http://www.faqs.org/patents/inventor/derek-7/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042981856.5/warc/CC-MAIN-20150728002301-00024-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 444598876,
    "recordOffset": 444559737,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Derek Hullinger, Orem, UT US 10-06-2011 Antenna Apparatus with a Modified Surface - The invention is directed toward antenna apparatus of the type for use in receiving broadcast data signals, such as those transmitted from one or more satellites and also, in certain embodiments the antenna apparatus is capable of transmitting data signals. The antenna apparatus includes at least one component which is provided with a surface, typically an external surface, which is provided with hydrophobic properties such that the gathering of water, condensation and/or snow is reduced hence improving the performance of the antenna and reducing data loss from the data signals. 20110241952 07-21-2011 Data Receiving Apparatus - This invention is directed toward a data signal receiving means including an antenna and a plurality of Low Noise Blocks (LNB's). A reflective filtering means is provided and located with respect to the LNBs and antenna such that data signals received at a first frequency or frequency range pass through the reflective filter means to a first LNB and data signals at second frequency or frequency range are deflected by the reflective filtering means and do not pass therethrough and pass to the second LNB. In this way a single antenna can be used to receive and process multiple data signals received at different frequencies or frequency ranges. 20110175786 12-09-2010 ITEM MOUNTING SYSTEM - The invention relates to apparatus and a method to allow the adjustment of a position of an",
    "textAfterTable": "Patent applications by Derek Hullinger, Orem, UT US Derek Hung Kit Tam, Reston, VA US Patent application number Description Published 20090104922 Architecture and Methods for Inter-Carrier Multi-Media Messaging - Multi-Media Messaging (MMS) services so that numerous wireless operators can transmit MMS messages between them. The architecture also provides for delivery, at least of notification messages, to those wireless operators who are not part of the overall inter-carrier MMS infrastructure 04-23-2009 20090291697 System and Method for Providing Configurable, Dynamic Multimedia Message Service Pre-Transcoding - System and methods for providing multimedia message service (MMS) interoperability between an initiating carrier and a destination carrier. A transcoding facility receives an MMS message from an initiating carrier and accesses a number portability database to determine an identity of a destination carrier to which the MMS message is intended to be sent and a carrier profile repository to obtain a carrier profile for the destination carrier, the carrier profile including information regarding an MMS format acceptable to the destination carrier. The transcoding facility determines, based on the carrier profile and a format of the MMS message received from the initiating carrier, whether the format of the MMS message received from the initiating carrier",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}