{
    "relation": [
        [
            "Player",
            "Derrick Favors",
            "Ed Davis",
            "Al-Farouq Aminu",
            "John Henson",
            "Solomon Alabi",
            "Kyle Singler"
        ],
        [
            "Class",
            "Fr.",
            "Soph.",
            "Soph.",
            "Fr.",
            "Soph.",
            "Jr."
        ],
        [
            "School",
            "Georgia Tech",
            "North Carolina",
            "Wake Forest",
            "North Carolina",
            "Florida State",
            "Duke"
        ],
        [
            "Selection",
            "2nd",
            "6th",
            "8th",
            "9th",
            "13th",
            "16th"
        ]
    ],
    "pageTitle": "TigerBait.com - Wake Forest's Aminu sticking to his plan",
    "title": "",
    "url": "https://lsu.rivals.com/content.asp?CID=977085",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042981856.5/warc/CC-MAIN-20150728002301-00169-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 880349899,
    "recordOffset": 880326687,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{1923=Rivals.com is your source for: College Football | Football Recruiting | College Basketball | Basketball Recruiting | College Baseball | High School | College Merchandise Site-specific editorial/photos © 2006 TigerBait.com. All rights reserved. This website is an officially and independently operated source of news and information not affiliated with any school or team. About | Advertise with Us | Contact | Privacy Policy | About our Ads | Terms of Service | Copyright/IP policy | Yahoo! Sports - NBC Sports Network Statistical information ©2014 STATS LLC All Rights Reserved.}",
    "TableContextTimeStampAfterTable": "{42035=Expanding his game Another season of experience could prove particularly beneficial for Aminu. Although he arrived at Wake from Norcross (Ga.) High as the No. 7 prospect in the 2008 recruiting class, Aminu is younger than most of his classmates and won't turn 19 until Sept. 21. Aminu believed he needed another year of experience to gain the maturity to play in the NBA., 59872=Top 10 upsets: A November to remember, 38925=August 18, 2009, 41199=Wake emerged as one of the biggest surprises of the 2008-09 season when it won its first 16 games and soared to the No. 1 ranking. Instead of building on that success, the Deacons went 8-7 the rest of the season and fell to Cleveland State in the biggest upset of the NCAA tournament's opening round.}",
    "textBeforeTable": "No first-team All-ACC selection returns this season, but that doesn't necessarily mean the league will take a step back in 2009-10. In fact, the latest 2010 mock draft from draftexpress.com has six ACC players going in the first 16 picks. ACC'S next wave Knowing what it takes Aminu signed with Wake as part of a heralded recruiting class that also featured five-star prospects Tony Woods and Ty Walker. Aminu believed his class could help make the Deacons a national contender. He also didn't want to go to school near a big city that might offer too much temptation. \"He wants to have a long career.\" \"The thing with Farouq is he would have been a first-round draft pick this year,\" Wake Forest coach Dino Gaudio says. \"The question I asked him is did he want to get drafted or did he want to have a long career. He won't necessarily have those types of matchup advantages in the NBA. But if he can put on some muscle and add a 3-point shot to his arsenal, it would make him that much more valuable. If Aminu could add a consistent 3-point shot, it could make him one of the ACC's most complete players. Aminu's ability to play either",
    "textAfterTable": "Source: www.draftexpress.com \"It's a small school and it's not in the city, so there aren't a lot of distractions,\" says Aminu, who grew up in the Atlanta suburb of Norcross. \"We always say, 'It's so boring, you've got to be good.' \" While Wake played well early, the Deacons' immaturity was evident late in the year. Aminu says the team worked particularly hard before games with big-name opponents but occasionally went through the motions before facing unranked foes. He admitted they didn't take Cleveland State seriously enough. Aminu and Co. learned their lesson when they could only sit in their dorm rooms and watch as North Carolina won the national championship. Wake Forest had beaten North Carolina 92-89 in the only meeting between the two teams last season. \"They got better, and we didn't,\" Aminu says. \"We stayed the same, while they kept getting better. The year before that, they went to the Final Four, so they knew what it would take when they got into the tournament. That's why I don't see last year as a disappointment. I wish we would have gone a little farther, but just entering that tournament and seeing that atmosphere is going to help us a lot.\" Though Wake Forest lost its top two players from last season, Aminu says he believes this team has a realistic chance of at least advancing to the",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}