{
    "relation": [
        [
            "Days",
            "30",
            "50",
            "150",
            "200"
        ],
        [
            "BSE",
            "468.11",
            "459.57",
            "443.25",
            "447.31"
        ],
        [
            "NSE",
            "468.20",
            "459.74",
            "443.34",
            "447.41"
        ]
    ],
    "pageTitle": "Biocon Stock Price, Share Price, Live BSE/NSE, Biocon Bids Offers. Buy/Sell Biocon news & tips, & F&O Quotes",
    "title": "",
    "url": "http://www.moneycontrol.com/india/stockpricequote/pharmaceuticals/biocon/BL03",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042981856.5/warc/CC-MAIN-20150728002301-00080-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 585430195,
    "recordOffset": 585379282,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{225928=Biocon is in the Pharmaceuticals sector. The current market capitalisation stands at Rs 9,012.00 crore. The company management includes Kiran Mazumdar Shaw - Chairperson & Managing Director, John Shaw - Vice Chairman, Arun Chandavarkar - Joint Managing Director & CEO, Charles L Cooney - Director, Mary Harney - Director, Bala S Manian - Director, Ravi Mazumdar - Director, Suresh N Talwar - Director, Peter Bains - Director, Russel Walls - Director, Catherine Rosenberg - Director. It is listed on the BSE with a BSE Code of 532523 and the NSE with an NSE Code of BIOCON. Its Registered office is at 20th K M, Hosur Road, Electronic City P O, Bangalore,Karnataka - 560100. Their Registrars are Karvy Computershare Private Ltd., 135413=JSWSteel Jul Fut, 224626=Zensar Technologies Recommended on Mar 24th 2015, 134195=28 July 2015, 134706=UnitedBrewerie Jul Fut}",
    "textBeforeTable": "Edit Watchlist Have you invested in these stocks? You can track them better in your Portfolio close[x] Add to Watchist Account Optional Optional Optional Optional Add to Portfolio OR Add to watchlist } $('#mcpcp_addprof_info').hide(); { function close_info()",
    "textAfterTable": "Keep me signed in Forgot Password? New to Moneycontrol - Sign up now Its easy and FREE! Username Username should be atleast 4 characters Password Password should be 6 to 10 characters Confirm Password Email OR connect with LIVE",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}