{
    "relation": [
        [
            "Data Fields",
            "SHRP_ID",
            "State code",
            "Layer number",
            "Layer description",
            "Material code"
        ],
        [
            "GPS",
            "X",
            "X",
            "X",
            "",
            ""
        ],
        [
            "SPS1",
            "X",
            "X",
            "X",
            "X",
            "X"
        ]
    ],
    "pageTitle": "Index - Assessment of Selected LTPP Material Data Tables and Development of Representative Test Tables and Development of Representative Test Tables, - FHWA-RD-02-001",
    "title": "",
    "url": "http://www.fhwa.dot.gov/publications/research/infrastructure/pavements/ltpp/reports/02001/index.cfm",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042981856.5/warc/CC-MAIN-20150728002301-00091-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 425623935,
    "recordOffset": 425479144,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{15109=This report documents an evaluation of selected LTPP material data tables as of January 2000. Issues addressed include the availability, characteristics, and quality of the data in the selected tables. Anomalies in the data were identified and corrected where possible, and the \"cleaned-out\" data were used in developing representative data tables. Recommendations for adjustments in the current data collection process are also presented., 14627=12. Sponsoring Agency Name and Address: Office on Infrastructure Research and Development, Federal Highway Administration, 6300 Georgetown PikeMcLean, Virginia 22101-2296, 20384=Illumination: lux (lx) multiply by 0.0929 to get foot-candles (fc) candela/m2 (cd/m2) multiply by 0.2919 to get foot-Lamberts (fl), 55419=As of January 2000, over 775 GPS and SPS sites have been sampled as part of the material characterization program. Sampling from these sites included the extraction of almost 14,000 cores (200 tons of bulk samples), the excavation of over 450 test pits, and the performance of over 330 in situ nuclear density tests.(1), 1192392=The data in table TST_SS10 were evaluated for completeness at two levels. Level 1 data completeness consisted of determining the total number of tests records (at all levels A to E) in the data table, the percentage of the data at level E, and the number of analysis cells represented by the data at level E. Level 2 data completeness evaluation consisted of checking each analysis cell to determine whether the required number of tests had been performed with the test data at level E. Results of levels 1 and 2 data completeness are presented and discussed in the next few sections. The January 2000 release of table TST_SS10 was used for data evaluation. Analysis cells were defined using the fields presented in table 79., 20854=*SI is the symbol for the International System of Units. Appropriate rounding should be made to comply with Section 4 of ASTM E380. (Revised March 2002), 1185394=For LTPP material characterization, testing is performed using the guidelines provided in SHRP protocol P54--Unconfined Compressive Strength of Subgrade Soils and the test standard AASHTO T208--Unconfined Compressive Strength of Cohesive Soils (ASTM D2166--Standard Test Method for Unconfined Compressive Strength of Cohesive Soils).(2, 3, 4) The test results are stored in the LTPP database in table TST_SS10 after undergoing several levels of quality checks (levels A to E). Table TST_SS10 has the following fields of information:, 14395=9. Performing Organization Name and Address: ERES Consultants, 9030 Red Branch Road, Suit 210, Columbia, MD 21045, 889012=The first step in assessing data completeness was to link the CTE and related data in TST_PC03 (January 2000 release) in the LTPP database to tables TST_L05B and EXPERIMENT_SECTION for cross-referencing of layer information, experiment type, and other related data. (Data extraction and assembly was described in detail in the introductory chapters of this report.) Subsequently, data completeness was evaluated at two levels. The details of the data completeness assessment are provided below., 483567=The first step in assessing data completeness was the extraction and assembly of the data available in table TST_PC06 in the LTPP database (January 2000 release); this process was described in detail in the introductory chapters of this report., 17676=Mass: ounces (oz) multiply by 28.35 to get grams (g) pounds (lb) multiply by 0.454 to get kilograms (kg) short tons - 2000 lb (T) multiply by 0.907 to get megagrams or \"metric ton\" (Mg or \"t\"), 390517=Data completeness was evaluated at two levels. Level 1 data completeness consisted of assessing the total number of test records in table TST_AC04, the percentage at level E, and the number of analysis cells represented by the data at level E. For level 2 data completeness, the number of test results in each analysis cell was checked against the minimum required. Cells with at least the minimum required number of tests were classified as complete, whereas those with less than the minimum were classified as incomplete. The January 2000 release of table TST_AC04 was used in the analysis. Analysis cells are defined for GPS and SPS experiments, using the fields presented in table 30., 222=U.S. Department of Transportation Federal Highway Administration 1200 New Jersey Avenue, SE Washington, DC 20590 202-366-4000, 17190=Volume: fluid ounces (fl oz) multiply by 29.57 to get milliliters (mL) gallons (gal) multiply by 3.785 to get liters (L) cubic feet (ft3) multiply by 0.028 to get cubic meters (m3) cubic yards (yd3) multiply by 0.765 to get cubic meters (m3) NOTE: volumes greater than 1000 L shall be shown in m3, 96016=The data used in the study were obtained from the January 2000 release of the LTPP database. The selected material test data tables were merged (using SHRP identification number, construction number, and layer number) with other inventory and test data tables, such as EXPERIMENT_SECTION and TST_LO5B, to obtain information about the pavement structure, including layer descriptions, experiment type, and age. Data acquisition was facilitated by using Microsoft Access, Microsoft Excel.(10), 15669=18. Distribution Statement: No restrictions. This document is available to the public through the National Technical Information Service, Springfield, VA 22161., 142361=The AC core data completeness evaluation was conducted at two levels. The level 1 data completeness evaluation involved the determination of the amount of the total data available in table TST_AC01_LAYER, the percentage at level E, and the number of analysis cells represented by the level E data. Level 2 data completeness consisted of determining the percentage of analysis cells with the minimum required number of test results reported at level E. The January 2000 release of table TST_AC01_LAYER was used for the analyses., 19936=Mass: grams (g) multiply by 0.035 to get ounces (oz) kilograms (kg) multiply by 2.202 to get pounds (lb) megagrams or \"metric ton\" (Mg or \"t\") multiply by 1.103 to get short tons - 2000 lb (T), 16049=Form DOT F 1700.7 (8-72) Reproduction of completed page authorized, 1047312=Discussed below are the results of data completeness analyses for table TST_TB02. The January 2000 release to the LTPP database was used in determining the data completeness and other analyses described., 1098393=Data completeness was evaluated at two levels. Level 1 data completeness consisted of determining the total number of test records in table TST_UU04_SS03, the percentage at level E, and the number of analysis cells represented by the data at level E. Level 2 data completeness consisted of determining whether the analysis cells had the required number of test results present. The January 2000 release of table TST_UU04_SS03 was used in data analysis., 632336=The first step in assessing data completeness was to link the compressive strength data in TST_PC01 (January 2000 release) to tables TST_L05B and EXPERIMENT_SECTION for cross-referencing of layer information, experiment type, and other important data elements. Data extraction and assembly were described in detail in the introductory chapters of this report. Subsequently, data completeness was evaluated at two levels. The details of the data completeness assessment are provided below., 14812=13. Type of Report and Period Covered: Final Report, September 1999 to August 2001, 906919=The first step in assessing data completeness was to extract and assemble the flexural strength data available in table TST_PC09. This process was described in detail in the introductory chapters of this report.(37) Table TST_PC09 contained data from only the SPS experiments. The January 2000 release of table TST_PC09 was used for analyses., 249295=Level 2 data completeness consisted of determining the percentage of analysis cells with the minimum number of test results required and reported at level E. The minimum number of tests required by LTPP is summarized in tables 13 and 14. The January 2000 update of table TST_AC02 was used in data evaluation and analysis., 458827=Data completeness was evaluated at two levels. Level 1 data completeness consisted of determining all the test data in table TST_AC05 (levels A through E), the percentage at level E, and the number of analysis cells represented by the data at level E. Level 2 data completeness consisted of checking all the individual analysis cells to determine whether the minimum required testing has been performed and the results presented at level E. The January 2000 release of table TST_AC05 was used in the analysis., 319672=The January 2000 release of table TST_AC03 was used for the analyses., 1037144=The LTPP describes lean concrete, cement aggregate mixture (CAM), econocrete, and soils treated with cement, lime, cement- or lime-flyash, and other chemical products as \"other than asphalt-treated bases,\" or OTBs.(2) Treated layers are often used under pavement surface layers to provide uniform support and to reduce the potential for moisture- and fatigue-related pavement distresses. The compressive strength of a treated base is an important parameter in characterizing the material. Its primary use is in model development, in which performance characteristics are related to strength parameters, and for quality control during construction. It is also an indirect indicator of the durability of the material. Testing for compressive strength of OTB specimens in good condition is based on ASTM C39-86, as modified by SHRP protocol P32--Method A.(2,3) Testing of weak and crumbly specimens is based on ASTM D2166-85, as modified by SHRP protocol P32--Method B.(2,3)}",
    "textBeforeTable": "Table 1. Material data elements evaluated. Availability of significant amounts of the data in the LTPP database. Use of the data element in computing other data parameters. Importance and need of the data element in pavement analysis. Table 1 presents a list of the key material-related data elements selected for evaluation in this study. These data elements describe fundamental pavement characteristics and will be useful in pavement evaluation and research. The list was developed based on the following criteria: Usefulness for data analysis and pavement performance evaluation. Usefulness for computing other material parameters. Basic material characteristics used in assessing pavement behavior. The material characterization needs of pavement analysts are wide ranging--from standard simple index tests, such as Atterberg limits or gradation of soils, to more rigorous testing of varying complexity, such as coefficient of thermal expansion (CTE), used as input for mechanistic-based analysis. To focus the effort of this study on the most important aspects of the materials data, key data elements were selected to be studied in depth. Selection was based on the following criteria: Material Data Elements Evaluated for the Current Study The two important tables in the Materials module that describe the pavement structure and are used to link test results with the pavement layers are TST_L05A and TST_L05B. Other important tables that are necessary to describe",
    "textAfterTable": "P32 Unconfined compressive strength of treated base/subbase material TST_TB02 P41 Particle size analysis of granular base/subbase TST_UG01_UG02_SS01 P43 Determination of Atterberg limits (subgrade) TST_SS03 P54 Unconfined compressive strength of subgrade soils2 TST_SS10 P61 Determination of compressive strength of in-place concrete3 TST_PC01 P63 Coefficient of thermal expansion for PCC TST_PC03 P66 Visual examination and length measurement of PCC cores TST_PC06 P69 PCC flexural strength TST_PC09 1Recent research indicates this test may not be very reliable; however, it is currently the LTPP-designated test method for assessing AC susceptibility to moisture damage. 2Tests were conducted on both reconstituted",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}