{
    "relation": [
        [
            "Categories",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "there are several clubs and organizations to get involved in. also, the verizon wireless center houses sporting events, concerts, and other entertainment. shopping, restaurants, theaters, concerts, etc. are great options!",
            "the food could be improved. it's a very repetitive menu. i often find food is undercooked and portions are small.",
            "it's very different, there is not a lot of personal space. it's a huge adjustment, but at the same time it is where you meet a lot of people and make connections with your floor mates.",
            "classes are challenging. homework takes up a large amount of my time during the week.",
            "get involved with clubs, organizations, whatever it may be. it's a great way to meet people and make vital connections. put yourself out there; college is about discovering yourself and creating a legacy.",
            "mankato is a great school that offers a lot for students. the campus is the perfect size and easy to navigate. there is several organizations to get involved in."
        ]
    ],
    "pageTitle": "Minnesota State University-Mankato (MNSU) Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Minnesota-State-University-Mankato/reviews?_escaped_fragment_=/show/85447",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042981856.5/warc/CC-MAIN-20150728002301-00095-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 908768407,
    "recordOffset": 908691881,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{382051=© 2015, Cappex.com, LLC, 129622=Knowing that it was going to be pitch black outside when I would leave class at 9:45 p.m., I was always thinking about what if. Well I didn't need to worry about that on campus as the campus is really lit up at night and walking to my vehicle I always saw at least 1 or 2 security people checking out campus, so that was always a great feeling knowing that someone was out there keeping it safe., 356061=MNSU is a great school. I've been to the campus & its great.The students are relaxed & so nice. The faculty are willing to help with anything you need. Can't wait to start school Spring 2014.}",
    "textBeforeTable": "07/09/2009 Reviewer is A current student here. 13 out of 13 people found this review useful. 1 of 93 Antonio from Minneapolis, MN Check out reviews left by other students or leave your own review. You could win a free scholarship. Minnesota State University-Mankato Reviews Minnesota State University-Mankato › Minnesota › By State › Colleges › } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.create', -->",
    "textAfterTable": "Categories Comments Great for these types of students This school is great for students who like to do many activities and have many resources available to them. If you are a people person, this is the school for you. The school is about middle size, which is good because there are enough people where you can meet new people even towards the end of each semester or year. Coming here you might not expect a lot, but leaving you will leave with a book full of memories. Tips for prospective students The one thing you need to focus on is time management because there are tons of things to do and a lot of free time to do your class work. School comes first. So take care of it first, finish your class work then go out after. Do not think that you will never have the opportunity to do something again, because chances are you will. So never feel rushed, take your time and take care of what you have to do. There are so many resources available, which means you have to go out there and look for them. Once you have found them, use them wisely, they help you much more than you think. Bang for the buck The great thing about coming to Mankato",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}