{
    "relation": [
        [
            "Religion",
            "Catholic",
            "Evangelical Protestant",
            "Mainline Protestant",
            "Other",
            "Orthodox",
            "None"
        ],
        [
            "Adherents",
            "12,410",
            "6,029",
            "3,348",
            "263",
            "30",
            "41,825"
        ],
        [
            "Congregations",
            "8",
            "48",
            "22",
            "2",
            "1",
            "-"
        ]
    ],
    "pageTitle": "Portland, Michigan (MI 48875) profile: population, maps, real estate, averages, homes, statistics, relocation, travel, jobs, hospitals, schools, crime, moving, houses, news, sex offenders",
    "title": "",
    "url": "http://www.city-data.com/city/Portland-Michigan.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042981856.5/warc/CC-MAIN-20150728002301-00193-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 391282215,
    "recordOffset": 391151988,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{6607=According to our research of Michigan and other state lists there were 6 registered sex offenders living in Portland, Michigan as of July 28, 2015. The ratio of number of residents in Portland to the number of sex offenders is 649 to 1. The number of registered sex offenders compared to the number of residents in this city is near the state average., 128279=We are giving away $1200 in prizes - enter simply by sending us your own city pictures!}",
    "TableContextTimeStampAfterTable": "{64833=6.00% of this county's 2010 resident taxpayers moved to other counties in 2011 ($29,677 average adjusted gross income), 45404=2004 Presidential Elections Results, 44832=1996 Presidential Elections Results, 15330=On 4/11/1965, a category F4 tornado 12.9 miles away from the city center killed one person and injured 8 people and caused between $50,000 and $500,000 in damages., 33800=Particulate Matter (PM2.5) [µg/m3] level in 2012 was 8.64. This is about average. Closest monitor was 20.7 miles away from the city center., 41613=Educational Attainment (%) in 2013, 63018=5.24% of this county's 2011 resident taxpayers lived in other counties in 2010 ($31,176 average adjusted gross income), 32368=Sulfur Dioxide (SO2) [ppb] level in 2012 was 1.45. This is better than average. Closest monitor was 17.2 miles away from the city center., 71253=Fatal road traffic accident statistics for 1975 - 2013 (per 100,000 population), 97267=Total of 20 patent applications in 2008-2015., 45976=2012 Presidential Elections Results, 31640=Nitrogen Dioxide (NO2) [ppb] level in 2012 was 7.28. This is about average. Closest monitor was 19.8 miles away from the city center., 45690=2008 Presidential Elections Results, 27273=Hotels: Best Western American Heritage (1681 East Grand River Avenue), Best Western American Heritage Inn (1681 East Grand River Avenue)., 33100=Ozone [ppb] level in 2012 was 30.2. This is about average. Closest monitor was 17.6 miles away from the city center., 15049=On 4/21/1967, a category F4 (max. wind speeds 207-260 mph) tornado 6.7 miles away from the Portland city center injured 8 people and caused between $500,000 and $5,000,000 in damages., 30993=Air Quality Index (AQI) level in 2012 was 79.1. This is about average., 45118=2000 Presidential Elections Results, 42011=School Enrollment by Level of School (%) in 2013, 98583=Recent home sales, price trends, and home value evaluator powered by Onboard Informatics © 2015 Onboard Informatics. Information is deemed reliable but not guaranteed.   City-data.com does not guarantee the accuracy or timeliness of any information on this site.  Use at your own risk. Website © 2015 Advameg, Inc., 46260=Graphs represent county-level data. Detailed 2008 Election Results}",
    "textBeforeTable": "Religion statistics for Portland city (based on Ionia County data) Graphs represent county-level data. Detailed 2008 Election Results 2012 Presidential Elections Results 2008 Presidential Elections Results 2004 Presidential Elections Results 2000 Presidential Elections Results 1996 Presidential Elections Results 2012 2008 2004 2000 1996 Presidential Elections Results Bottled, tank, or LP gas (1%) Electricity (8%) Utility gas (90%) Most commonly used house heating fuel:",
    "textAfterTable": "Source: Clifford Grammich, Kirk Hadaway, Richard Houseal, Dale E.Jones, Alexei Krindatch, Richie Stanley and Richard H.Taylor. 2012. 2010 U.S.Religion Census: Religious Congregations & Membership Study. Association of Statisticians of American Religious Bodies. Jones, Dale E., et al. 2002. Congregations and Membership in the United States 2000. Nashville, TN: Glenmary Research Center. Graphs represent county-level data Food Environment Statistics: Number of grocery stores: 11 Ionia County: 1.72 / 10,000 pop. Michigan: 2.34 / 10,000 pop. Number of supercenters and club stores: 2 This county: 0.31 / 10,000 pop. State: 0.18 / 10,000 pop. Number of convenience stores (no gas): 15 Ionia County: 2.34 / 10,000 pop. Michigan: 1.52 / 10,000 pop. Number of convenience stores (with gas): 15 Ionia County: 2.34 / 10,000 pop. State: 2.99 / 10,000 pop. Number of full-service restaurants: 23 Here: 3.59 / 10,000 pop. State: 6.80 / 10,000 pop. Adult diabetes rate: This county:",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}