{
    "relation": [
        [
            "Fam #",
            "5",
            "12",
            "48",
            "47",
            "55",
            "53",
            "72",
            "169"
        ],
        [
            "Name",
            "Hines, Samuel",
            "Everts, Infant",
            "Millard, William",
            "Margeson, Mary",
            "Boyd, Huston",
            "Smith, Lydia M.",
            "Wise, Lot J.",
            "Pusce?, Jane"
        ],
        [
            "Age",
            "69",
            "01/12",
            "34",
            "62",
            "47",
            "42",
            "81",
            "10"
        ],
        [
            "Sex",
            "M",
            "M",
            "M",
            "F",
            "M",
            "F",
            "M",
            "F"
        ],
        [
            "Race",
            "W",
            "W",
            "W",
            "W",
            "W",
            "W",
            "W",
            "W"
        ],
        [
            "Md/Wd",
            "M",
            "",
            "M",
            "W",
            "M",
            "W",
            "M",
            ""
        ],
        [
            "Birthplace",
            "Massachusetts",
            "New York",
            "New York",
            "New York",
            "Ireland",
            "New York",
            "England",
            "Wisconsin"
        ],
        [
            "Parentage",
            "",
            "",
            "",
            "",
            "parents fb",
            "",
            "parents fb",
            ""
        ],
        [
            "Month Died",
            "Feb",
            "Aug",
            "Sept",
            "July",
            "Oct",
            "Dec",
            "Mch",
            "May"
        ],
        [
            "Occupation",
            "Farmer",
            "",
            "Farmer",
            "Keeping House",
            "Farmer",
            "Keeping House",
            "Farmer",
            ""
        ],
        [
            "Cause of Death",
            "Rheumatism",
            "Fits",
            "Spinal Disease",
            "Cancer",
            "Consumption",
            "Palsey",
            "Conjestion of Lungs",
            "Consumption"
        ]
    ],
    "pageTitle": "1870 Mortality Census - Allegany Co., New York",
    "title": "",
    "url": "http://www.rootsweb.ancestry.com/~nyallega/1870mort.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042981856.5/warc/CC-MAIN-20150728002301-00184-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 676917883,
    "recordOffset": 676897426,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{34343=Schedule 2. -- Perswons who Died during the Year ending 1st June, 1870, in Burns, in the County of Allegany, State of New York, enumerated by me, Chas. W. McIntosh, Ass't Marshal. p. 97, 111489=Created on ... December 02, 2001, 76388=Schedule 2. -- Persons who Died during the Year ending 1st June, 1870, in Hume, in the County of Allegany, State of New York, enumerated by me, John M. Hammond, Ass't Marshal. P. 115, 96134=Schedule 2. -- Persons who Died during the Year ending 1st June, 1870, in Town of West Almond, in the County of Allegany, State of New York, enumerated by me, Ezra P. Crandall, Ass't Marshall. p. 129, 93107=Schedule 2. -- Persons who Died during the Year ending 1st June, 1870, in the Town of Scio, in the County of Allegany, State of New York, enumerated by me, Wm. H. Withy, Ass't Marshall. p. 123, 67262=Schedule 2. -- Persons who Died during the Year ending 1st June, 1870, in the Town of Granger, in the County of Allegany, State of New York, enumerated by me, W. Moses, Ass't Marshal. p. 111, 107664=Schedule 2. -- Persons who Died during the Year ending 1st June, 1870, in the Town of Wirt, in the County of Allegany, State of New York, enumerated by me, Wm. H. Withey, Ass't Marshal. p. 133, 49970=Schedule 2. -- Persons who Died during the Year ending 1st June, 1870, in the town of Cuba, in the County of Allegany, State of New York, enumerated by me, H. H. Wakely, Ass't Marshall. p. 105, 85402=Schedule 2. -- Persons who Died during the Year ending 1st June, 1870, in the town of New Hudson, in teh County of Allegany, State of New York, enumerated by me, H. H. Wakely, Ass't Marshall. p. 119; FHL 1415132, 102269=Schedule 2. -- Pesons who Died during the Year ending 1st June, 1870, in the town of Wellsville, in the County of Allegany, State of New York, enumerated by me, S. Hackman?, Ass't Marshall. p. 127, 31931=Schedule 2 -- Persons who Died during the Year 1st June, 1870, in Bolivar, in the County of Allegany, State of New York, enumerated by me, ---, Ass't, Marshal. p. 95, 64323=Schedule 2. -- Persons who Died during the Year ending 1st June, 1870, in Genesee, in the County of Allegany, State of New York, enumerated by me, Walter Crandall, Ass't Marshal. p. 109, 2734=Persons who Died during the Year ending 1st June, 1870, in Town of Alfred, in the County of Allegany, State of New York, enumerated by me, --- Crandall, Ass't Marshall. p. 75, 82605=Schedule 2. -- Persons who Died during the Year ending 1st June, 1870, in Independence, in the County of Allegany, State of New York, enumerated by me, T. A. Crandall, Ass't Marshall, p. 117, 7679=Schedule 2. - Persons who Died during the Year ending 1st June, 1870, in the Town of Alma, in the county of Allegany, State of New York, enumerated by me, Wm. H. Withey, Ass't. Marshal. p. 79, FHL 1415132, 5236=Schedule 2.  Persons who Died during the Year ending 1st June, 1870 in the town of Allen, in the County of Allegany, Staet of New York, enumerated by me W. Moses, Ass't Marshal.  p. 77., 21935=Schedule 2. -- Persons who Died during the Year ending 1st June, 1870, in the Town of Angelica, in the County of Allegany, State of New York, enumerated by me, Ezra P. Crandell, Ass't Marshall, p. 89., 105952=Schedule 2. -- Persons who Died in the Year ending 1st June 1870, in the town of Willing, in the County of Allegany, State of New York, enumerated by me, F. H. Ackerman, Ass't Marshal. p. 131, 59121=Schedule 2. -- Persons who Died during the Year ending 1st June, 1870, in the town of Friendship, in the County of Allegany, State of New York, enumerated by me, David J. Finch, Ass't Marshal. p. 107, 88615=Schedule 2. -- Persons who Died during the Year ending 1st june, 1870, in Rushford, in the County of Allegany, State of New York, enumerated by me, John M. Hammond, Ass't Marshal. p. 121, 72227=Schedule 2. -- Persons who Died during the Year ending 1st June, 1870, in the town of Grove, in the County of Allegany, State of New York, enumerated by me, W. Moses, Ass't Marshall. p. 114, 29704=Schedule 2. -- Persons who Died during the Year ending 1st June, 1870, in the Town of Birdsall, County of Allegany, State of New York, enumerated by me, Charles W. McIntosh, Ass't Marshal. p. 93, 98797=Schedule 2. -- Persons Who Died during the Year ending 1st June, 1870, in Town of Ward, in the County of Allegany, State of New York, enumerated by me E--- Crandall, Ass't Marshall, p. 125, 27228=Schedule 2. -- Persons who Died during the Year ending 1st June, 1870, in the town of Belfast, in the County of Allegany, Stae of New York, enumerated by me, David J. Finch, Ass't Marshal. p. 91, 43497=Schedule 2. -- Persons who Died during the Year ending 1st June, 1870, in Centerville, in the County of Allegany, State of New York, enumerated by me, John M. Hammond, Ass't Marshal. p. 101, 14185=Schedule 2 -- Persons Died during the Year ending 1st June, 1870, in the Town of Amity, in the County of Allegany, State of New York, enumerated by me, ---, Ass't Marshal. p. 85, FHL 1415132, 18136=Schedule 2. -- Persons who Died during the Year ending 1st June, 1870, in Andover, in the county of Allegany, State of New YOrk, enumerated by me, J. A. Crandall, Ass't Marshall, p. 87, FHL 1415132, 10405=Schedule 2 -- Persons Died during the Year ending 1st June, 1870, in the Town of Almond, in the County of Allegany, State of New York, enumerated by me, Chas. W. McIntosh, Ass't Marshal. p. 83, FHL 1415132, 47010=Schedule 2. -- Persons who Died during the Year ending 1st June, 1870, in Clarksville, in the County of Allegany, State of New York, enumerated by me, Walter Crandall, Ass't Marshal. p. 103, 38698=Schedule 2. -- Persons who Died during the Year ending 1st June, 1870, in Caneadea, in the County of Allegany, State of New York, enumerated by me, John M. Hammond, Ass't Marshal. p. 99}",
    "textBeforeTable": "Persons who Died during the Year ending 1st June, 1870, in Town of Alfred, in the County of Allegany, State of New York, enumerated by me, --- Crandall, Ass't Marshall. p. 75 Alfred Wirt Willing Wellsville Ward West Almond Scio Rushford New Hudson Independence Hume Grove Granger Genesee Friendship Cuba Clarksville Centerville Caneadea Burns Bolivar Birdsall Belfast Angelica Andover Amity Almond Alma Allen Alfred Md/Wd = Married or Widowed fb - Foriegn Born Note:  Portions of this record were difficult to read.  To ensure accuracy, check against the original record. 1870 Mortality Census - Allegany Co., New York site. This Page is part of the Allegany County, New York GenWeb Vivian Karen Bush Transcribed by",
    "textAfterTable": "Fam # Name Age Sex Race Md/Wd Birthplace Parentage Month Died Occupation Cause of Death 17 Hooker, John 68 M W M Vermont   Oct. Farmer Dysentery 18 Chaffe, Ann M. 35 F W M New York   April Keep house Consumption 69 Bentley, Joseph 03/12 M W   New York   May   Croupe 106 Seeley, Eber 62 M W M Vermont mother fb May Farmer Congestion of Liver 106 Seeley, John H. 20 M W   New York   May School Teacher Consumption 118 Black?, Mary 79 F W W England parents fb Jany.   Pneumonia 137 Stockwell, Emma 38 F W   New York   July   Consumption Return to Top of Page Alma Schedule 2. - Persons who Died during the Year ending 1st June, 1870, in the Town of Alma, in the county of Allegany, State of New York, enumerated by me, Wm. H. Withey, Ass't. Marshal. p. 79, FHL 1415132 Fam # Name Age Sex Race Md/Wd Birthplace Parentage Month Died Occupation Cause of Death 23 Elliott, Ittai 89 M W W Vermont   Jan. Shoemaker Old Age 68 Murphy, Charlott 61 F W M Ireland parents fb June Keeping House Inflamation of Lungs 68 Daley, Bridget 26 F W M",
    "hasKeyColumn": true,
    "keyColumnIndex": 10,
    "headerRowIndex": 0
}