{
    "relation": [
        [
            "Categories",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "Atlanta has a great nightlife. Plus, there's plenty of surrounding areas, like Little Five Points and Atlantic Station, that have plenty of fun things to do. The campus also has a Rec Center (complete with pools,a rock climbing wall, and more) and a bowling alley.",
            "While the dining halls aren't exactly the best, there are plenty of off-campus options, such as The Varsity, Wingnuts, Goodfellas, J.R. Crickets (all within walking distance!). If you have a car or want to ride MARTA, you can go to restaurants in areas like Little Five Points and Atlantic Station.",
            "The Peer Leaders are amazing! They do everything they can to get students involved and show them that there's more to Tech than academics.",
            "There's a reason Georgia Institute is known as one of the hardest schools. Classes can be overwhelming, but just balance everything properly and you should do fine.",
            "Make sure you know what you're getting yourself into. Also, make sure you balance all of your classes correctly. Just because this is a school renowned for engineering doesn't mean you don't need to worry about English and History classes.",
            "Known as one of the hardest schools in the USA, Georgia Institute of Technology definitely lives up to its name. However, if you learn to balance fun experiences with hard work, you can easily succeed."
        ]
    ],
    "pageTitle": "Georgia Institute of Technology Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Georgia-Institute-of-Technology-Main-Campus/reviews?_escaped_fragment_=/show/19262",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 125,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042982745.46/warc/CC-MAIN-20150728002302-00094-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 897289551,
    "recordOffset": 897148566,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{363411=There is a sculpture commemorating the 1996 Olympics. It looks a lot like soft serve ice cream and students will put sticky note sprinkles on it., 360011=Don't let the classes take you by suprise. You were smart in High School, but so was everyone else at this place. You will discover quickly that your 4.0 in High School and your 2100 on the SAT does not take you very far when you get here. Study hard, study soon, don't procrastinate, and don't get Bellassard for Calc 2., 537011=Engineering students, and nerds who want to make an impact. (2013 Convocation speech: If you want to change the world, you can do that, you're at Georgia Tech. If you want to build the Ironman suit, you can do that, you're at Georgia Tech!), 417581=Freshman cupcake race: at roughly 6:45 in the morning, freshman are HIGHLY encouraged to participate in a semi-short race. Bright side: everyone gets a cupcake at the end, and the two top-finishers get a whole cake!, 720750=© 2015, Cappex.com, LLC, 644424=Stealing the T of tech tower has long been a tradition, but is now considered vandalism and is illegal. Over spring break 2014 the T was stolen, but the student was caught and had to face a judicial hearing. They were going to press charges but the alumni stopped it. It takes a lot of work to steal the T, as it has been wired with sensory detectors, and the climb up to get it is very dangerous., 500451=May not seem like the money is worth it at the time, but Tech has one of the highest return on investment rankings., 48480=Tech has an enormous list of ongoing traditions, and to name them all here would be impossible, but perhaps the week that is surrounded with the most tradition is of course Homecoming week. During this week, many events take place, such as the Mini 500, a tricycle race around Peters Parking Deck, which is led by the Ramblin Wreck, a 1930 Ford Model A Sport Coupe that is one of Tech's mascots. It also leads the football team out at every football game and has been doing so since 1961. Also during Homecoming week is the Freshman Cake race, a mad dash where the prize is an entire cake, as well as a kiss from the Homecoming Queen during the halftime of that week's football game. I'll close this section out with Clean, Old-Fashioned Hate, the name bestowed upon the Tech - uga rivalry. All you need to know right now is TO HELL WITH georgia! (yes, the lowercase georgia is necessary)., 138614=They have programs for Freshman that are always entertaining, and brand new (relatively) West Campus dorms that were built for the 1996 Olympians., 135246=i'd definitely recommend submitting your application by november 1st for those juniors considering applying to gatech. i found out about my admittance by december 16th!!! now i have a lot more time to plan towards next year :d}",
    "textBeforeTable": "07/28/2009 Reviewer is A current student here. 58 out of 58 people found this review useful. 1 of 157 Alexandria from Hoschton, GA Check out reviews left by other students or leave your own review. You could win a free scholarship. Georgia Institute of Technology-Main Campus Reviews Georgia Institute of Technology-Main Campus › Georgia › By State › Colleges › } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.create', -->",
    "textAfterTable": "Categories Comments Great for these types of students Georgia Tech is great for students that take their academics seriously and pride themselves on their effort. If you are someone that likes the big city life-style with a great athletic environment and hundreds of extra curricular activities than Georgia Tech is the school for you. Tips for prospective students I recommend that you take both the ACT and the SAT. Although it's not required to take both, it makes you stand out among the crowd. Also, the more community service and volunteer experience you have, the better your chances of being accepted. Make sure to apply as early as possible. This is the case with all colleges and universities but I can not stress this enough. Georgia Tech receives more applicants that it can handle each year so the review process is lengthy. Apply before the early deadline to guarantee a possible acceptance. Sometimes students that apply for the regular deadline don't get accepted due to the fact that too many have already been admitted. Make sure to apply via paper application as well. Online applications are less personal and can easily be overlooked. For those that have been accepted and are about to begin their first year, come prepared. Georgia Tech is not like high school and classes will be challenging no matter what it is. Come in with a ready attitude.",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}