{
    "relation": [
        [
            "Patent application number",
            "20100140987",
            "20100314918"
        ],
        [
            "Description",
            "ACTIVE MATERIAL ACTUATED HEADREST UTILIZING BAR LINKAGE DEPLOYMENT SYSTEM - An active headrest for selectively supporting the head of an occupant, includes a shell, and an actuator disposed within the shell, including a bar linkage system drivenly coupled to the shell, so as to adjust the distance or engagement between the shell and head when displaced, and an active material element drivenly coupled to the system, so as to cause or enable the displacement of the system, and preferably further including a ratchet sector/pawl and latch cooperating to present plural achievable deployment positions.",
            "ACTIVE HEAD RESTRAINT UTILIZING SOLENOID ACTIVATION AND BAR LINKAGE TRANSMISSION - An active head restraint for supporting the head of an occupant, includes a shell, and an actuator disposed within the shell, wherein the actuator further includes a spring-biased bar linkage system pivotally coupled to the shell, a radial ratcheting sector coupled to the linkage system, a pawl selectively engaging the sector, and a solenoid drivenly coupled to the pawl, and configured, when activated, to cause the pawl to disengage the sector."
        ],
        [
            "Published",
            "06-10-2010",
            "12-16-2010"
        ]
    ],
    "pageTitle": "Smith, MI - Patent applications",
    "title": "",
    "url": "http://www.faqs.org/patents/inventor/smith-mi-3/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042982745.46/warc/CC-MAIN-20150728002302-00078-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 445502095,
    "recordOffset": 445464961,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "James A. Smith, Armada, MI US 06-21-2012 PINCH GUARD FOR A VEHICLE SEAT - A pinch guard for a vehicle seat ( 20120153694 Published Description Patent application number James Smith, Troy, MI US 05-03-2012 ELECTRIC DRIVING RANGE CALCULATOR - A method of and device for determining driving range for a vehicle operating with a rechargeable energy storage supply. The method includes performing a calculation based on a limited number of input parameters, including a driving distance, average speed, location and time of day. Other determinations, such as the possibility of using a battery power-depleting climate control system, as well as battery capacity and climate data for various seasonal and location factors may also be used in the calculations. 20120109413 Published Description Patent application number Irvin T. Smith, Rochester Hills, MI US 09-06-2012 Self Diagnostic Armor Structure - A unit of modular armor. The module has a box-like, optically opaque outer shell of ballistic-protection material enclosed to exclude light from the module's interior. The shell contains transparent armor plates and the shell contains a self-diagnostic system for ascertaining whether the plates have been damaged. The self-diagnostic system includes a first PC board disposed along first edges of the plates, the board being divided into strips on which are mounted rows of lights. The self-diagnostic system further includes a second PC board at second, opposed edges",
    "textAfterTable": "Janet Smith, Swartz Creek, MI US Patent application number Description Published 20110274936 FLUORINE- AND SILICON-CONTAINING TREATMENT AGENT FOR CONCRETES - The present invention provides a surface treatment agent comprising a fluorine-containing polymer having repeating units derived from a monomer comprising a fluorine-containing monomer, wherein the fluorine-containing polymer has a silicone moiety possessed by a mercapto group-containing silicone. When a porous substrate is treated under drying at normal temperature, the surface treatment agent comprising the fluorine-containing acrylate polymer can impart the excellent water- and oil-repellency and soil resistance to the porous substrate. 11-10-2011 20110306713 METHOD OF PREPARING WATER- AND OIL-REPELLENT SOIL-RESISTANT COMPOSITION - The present invention provides a water- and oil-repellent soil-resistant composition comprising (A) a fluorine-containing polymer having repeating units derived from a monomer comprising a fluorine-containing monomer and (B) a silane compound. The water- and oil-repellent soil-resistant composition comprising the fluorine-containing acrylate polymer can impart the excellent water- and oil-repellency and soil resistance to the porous substrate and is free from an organic solvent. 12-15-2011 Janet Smith, Ann Arbor, MI US Patent application number Description Published 20110165624 PROTEIN PURIFICATION TAGS AND USES THEREOF - The present invention relates to fusion proteins. In particular, the present invention relates to protein tags for use in protein solubilization and purification. 07-07-2011 Jason Ronald Smith, Dearborn, MI US Patent application number Description",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}