{
    "relation": [
        [
            "",
            "Percent who are from out of state (exclude internat’l/nonresident aliens)",
            "Percent of men who join fraternities (pledging begins in January)",
            "Percent of women who join sororities (pledging begins in January)",
            "Percent who live in college-owned, -operated, or -affiliated housing",
            "Percent who live off campus or commute",
            "Percent of students age 25 and older",
            "Average age of full-time students (as of October 1)",
            "Average age of all students (full- and part-time)"
        ],
        [
            "% FR",
            "86%",
            "NA",
            "NA",
            "100%",
            "0%",
            "0%",
            "18.2",
            "18.2"
        ],
        [
            "% ALL",
            "88%",
            "82%",
            "74%",
            "61%",
            "39%",
            "0.2%",
            "19.6",
            "19.6"
        ]
    ],
    "pageTitle": "Common Data Set 1999-2000",
    "title": "",
    "url": "http://www2.wlu.edu/Documents/institutional_effectiveness/CDS/cds1999.htm",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042981856.5/warc/CC-MAIN-20150728002301-00171-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 842658995,
    "recordOffset": 842621956,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{97507=Degrees conferred between July 1, 1998 and June 30, 1999, 15966=B5. Of the initial 1993 cohort, how many did not persist and did not graduate for the following reasons: deceased, permanently disabled, armed forces, foreign aid service of the federal government, or official church missions; total allowable exclusions: __________0____________  (IPEDS GRS, Section II, Part C, line 45, sum of columns 15 and 16), 20030= Do you have a policy of placing students on a waiting list?   Yes: _X__  No: ___  If yes, please answer the questions below for fall 1999 admissions: Number of qualified applicants placed on waiting list _618____ Number accepting a place on the waiting list __204___ Number of wait-listed students admitted __40___, 16520=B7. Of the initial 1993 cohort, how many completed the program in four years or less (by August 31, 1997): ____350_______  (IPEDS GRS, Section II, Part A, line 19, sum of columns 15 and 16), 35276=C17. Reply policy for admitted applicants:  Must reply by May 1, 28986=C9. Percent and number of first-time, first-year (freshman) students enrolled in fall 1999 who submitted national standardized (SAT/ACT) test scores. Include information for ALL enrolled, first-time, first-year (freshman) degree-seeking students who submitted test scores, 59068=Provide 1999-2000 academic year costs for the following categories that are applicable to your institution., 18172=B22. For the cohort of all full-time bachelor’s (or equivalent) degree-seeking undergraduate students who entered your institution as freshmen in fall 1998 (or the preceding summer term), what percentage was enrolled at your institution as of the date your institution calculates its official enrollment in fall 1999? _____94_____ %  , 95886=Using the above definitions, please report for each of the following class-size intervals the number of class sections and class subsections offered in Fall 1999. For example, a lecture class with 800 students who met at another time in 40 separate labs with 20 students should be counted once in the “100+” column in the class section column and 40 times under the “20-29” column of the class subsections table., 17665=Retention Rates Report for the cohort of all full-time, first-time bachelor’s (or equivalent) degree-seeking undergraduate students who entered in fall 1998 (or the preceding summer term). The initial cohort may be adjusted for students who departed for the following reasons: deceased, permanently disabled, armed forces, foreign aid service of the federal government or official church missions. No other adjustments to the initial cohort should be made., 15693=B4. Initial 1993 cohort of first-time, full-time bachelor’s (or equivalent) degree-seeking undergraduate students; total all students: _______425___________  (IPEDS GRS, Section II, Part A, line 10, sum of columns 15 and 16), 101680=*Academic advisement: plan under which each student is assigned to a faculty member or a trained adviser, who, through regular meetings, helps the student plan and implement immediate and long-term academic and vocational goals. Accelerated program: Completion of a college program of study in fewer than the usual number of years, most often by attending summer sessions and carrying extra courses during the regular academic term. Admitted student: Applicant who is offered admission to a degree-granting program at your institution. *Adult student services: admission assistance, support, orientation, and other services expressly for adults who have started college for the first time, or who are re-entering after a lapse of a few years. American Indian or Alaska native: A person having origins in any of the original peoples of North America and who maintains cultural identification through tribal affiliation or community recognition. Applicant (first-time, first year): An individual who has fulfilled the institution’s requirements to be considered for admission (including payment or waiving of the application fee, if any) and who has been notified of one of the following actio ns: admission, nonadmission, placement on waiting list, or application withdrawn (by applicant or institution). Application fee: That amount of money that an institution charges for processing a student’s application for acceptance. This amount is not creditable toward tuition and required fees, nor is it refundable if the student is not admitted to the institution. Asian or Pacific Islander: A person having origins in any of the original peoples of the Far East, Southeast Asia, the Indian Subcontinent, or Pacific Islands. This includes people from China, Japan, Korea, the Philippine Islands, American Samoa, India, and Vietnam. Associate’s degree: An award that normally requires at least two but less than four years of full-time equivalent college work. Bachelor’s degree: An award (baccalaureate or equivalent degree, as determined by the Secretary, U.S. Department of Education) that normally requires at least four years but not more than five years of full-time equivalent college-level wor k. This includes ALL bachelor’s degrees conferred in a five-year cooperative (work-study plan) program. A cooperative plan provides for alternate class attendance and employment in business, industry, or government; thus, it allows students to combine act ual work experience with their college studies. Also, it includes bachelor’s degrees in which the normal four years of work are completed in three years. Black, non-Hispanic: A person having origins in any of the black racial groups of Africa (except those of Hispanic origin). Board (charges): Assume average cost for 19 meals per week or the maximum meal plan. Books and supplies (costs): Average cost of books and supplies. Do not include unusual costs for special groups of students (e.g., engineering or art majors), unless they constitute the majority of students at your institution. Calendar system: The method by which an institution structures most of its courses for the academic year. *Career and placement services: A range of services, including (often) the following: coordination of visits of employers to campus; aptitude and vocational testing; interest inventories, personal counseling; help in resume writing, interviewing, launching the job search; listings for those desiring students employment and those seeking permanent positions; establishment of a permanent reference folder; career resource materials Carnegie units: One year of study or the equivalent in a secondary school subject. Certificate: See Postsecondary award, certificate, or diploma. Class rank: The relative numerical position of a student in his or her graduating class, calculated by the high school on the basis of grade-point average, whether weighted or unweighted. College preparatory program: Courses in academic subjects (English, history and social studies, foreign languages, mathematics, science, and the arts) that stress preparation for college or university study. Common Application: The standard application form distributed by the National Association of Secondary School Principals for a large number of private colleges who are members of the Common Application Group. *Community service program: Referral center for students wishing to perform volunteer work in the community or volunteer activities coordinated by academic departments. Commuter: A student who lives off campus in housing that is not owned by, operated by, or affiliated with the college. This category includes students who commute from home and students who have moved to the area to attend college. Contact hour: A unit of measure that represents an hour of scheduled instruction given to students. Also referred to as clock hour. Continuous basis (for program enrollment): A calendar system classification that is used by institutions that enroll students at any time during the academic year. For example, a cosmetology school or a word processing school might allow students to enroll and begin studies at various times, with no requirement that classes begin on a certain date. Cooperative (work-study plan) program: A program that provides for alternate class attendance and employment in business, industry, or government. Cooperative housing: College-owned, -operated, or -affiliated housing in which students share room and board expenses and participate in household chores to reduce living expenses. Core curriculum: A specified number of courses or credits in the humanities, social sciences, life sciences, and/or physical sciences required of all students, regardless of major, to ensure a basic set of learning experiences. *Counseling service: Activities designed to assist students in making plans and decisions related to their education, career, or personal development. Credit: Recognition of attendance or performance in an instructional activity (course or program) that can be applied by a recipient toward the requirements for a degree, diploma, certificate, or other formal award. Credit course: A course that, if successfully completed, can be applied toward the number of courses required for achieving a degree, diploma, certificate, or other formal award. Credit hour: A unit of measure representing an hour (50 minutes) of instruction over a 15-week period in a semester or trimester system or a 10-week period in a quarter system. It is applied toward the total number of hours needed for completing t he requirements of a degree, diploma, certificate, or other formal award. Cross-registration: A system whereby students enrolled at one institution may take courses at another institution without having to apply to the second institution. Deferred admission: The practice of permitting admitted students to postpone enrollment, usually for a period of one academic term or one year. Degree: An award conferred by a college, university, or other postsecondary education institution as official recognition for the successful completion of a program of studies. Degree-seeking students: Students enrolled in courses for credit who are recognized by the institution as seeking a degree or formal award. At the undergraduate level, this is intended to include students enrolled in vocational or occupational pro grams. Differs by program (calendar system): A calendar system classification that is used by institutions that have occupational/vocational programs of varying length. These schools may enroll students at specific times depending on the program desired. For example, a school might offer a two-month program in January, March, May, September, and November; and a three-month program in January, April, and October. Diploma: See Postsecondary award, certificate, or diploma. Distance learning: An option for earning course credit at off-campus locations via cable television, internet, satellite classes, videotapes, correspondence courses, or other means. Doctoral degree: The highest award a student can earn for graduate study. The doctoral degree classification includes such degrees as Doctor of Education, Doctor of Juridical Science, Doctor of Public Health, and the Doctor of Philosophy degree in any field such as agronomy, food technology, education, engineering, public administration, ophthalmology, or radiology. For the Doctor of Public Health degree, the prior degree is generally earned in the closely related field of medicine or in sanitary engineering. Double major: Program in which students may complete two undergraduate programs of study simultaneously. Dual enrollment: A program through which high school students may enroll in college courses while still enrolled in high school. Students are not required to apply for admission to your college in order to participate. Early action plan: An admission plan that allows students to apply and be notified of an admission decision well in advance of the regular notification dates. If admitted, the candidate is not committed to enroll; the student may reply to the offe r under the college’s regular reply policy. Early admission: A policy under which students who have not completed high school are admitted and enroll full time in college, usually after completion of their junior year. Early decision plan: A plan that permits students to apply and be notified of an admission decision (and financial aid offer if applicable) well in advance of the regular notification date. Applicants agree to accept an offer of admission and, if admitted, to withdraw their applications from other colleges. There are three possible decisions for early decision applicants: admitted, denied, or not admitted but forwarded for consideration with the regular applicant pool, without prejudice. English as a Second Language (ESL): A course of study designed specifically for students whose native language is not English. Exchange student program-domestic: Any arrangement between a student and a college that permits study for a semester or more at another college in the United States without extending the amount of time required for a degree. See also Stud y abroad. External degree program: A program of study in which students earn credits toward a degree through independent study, college courses, proficiency examinations, and personal experience. External degree programs require minimal or no classroom atten dance. Extracurricular activities (as admission factor): Special consideration in the admissions process given for participation in both school and nonschool-related activities of interest to the college, such as clubs, hobbies, student government, athle tics, performing arts, etc. First professional certificate (postdegree): An award that requires completion of an organized program of study designed for persons who have completed the first professional degree. Examples could be refresher courses or additional units of study in a specialty or subspecialty. First professional degree: An award in one of the following fields: Chiropractic (DC, DCM), dentistry (DDS, DMD), medicine (MD), optometry (OD), osteopathic medicine (DO), rabbinical and Talmudic studies (MHL, Rav), Pharmacy (B.Pharm, Pharm.D), po diatry (PodD, DP, DPM), veterinary medicine (DVM), law (LLB, JD), divinity/ministry (BD, MDiv). First-time student: A student attending any institution for the first time at the level enrolled. Includes students enrolled in the fall term who attended a postsecondary institution for the first time at the same level in the prior summer term. A lso includes students who entered with advanced standing (college credit earned before graduation from high school). First-time, first-year (freshman) student: A student attending any institution for the first time at the undergraduate level. Includes students enrolled in the fall term who attended college for the first time in the prior summer term. Also includ es students who entered with advanced standing (college credits earned before graduation from high school). First-year student: A student who has completed less than the equivalent of 1 full year of undergraduate work; that is, less than 30 semester hours (in a 120-hour degree program) or less than 900 contact hours. Freshman: A first-year undergraduate student. *Freshman/new student orientation: Orientation addressing the academic, social, emotional, and intellectual issues involved in beginning college. May be a few hours or a few days in length; at some colleges, there is a fee. Full-time student (undergraduate): A student enrolled for 12 or more semester credits, or 12 or more quarter credits, or 24 or more contact hours a week each term. Geographical residence (as admission factor): Special consideration in the admission process given to students from a particular region, state, or country of residence. Grade-point average (academic high school GPA): The sum of grade points a student has earned in secondary school divided by the number of courses taken. The most common system of assigning numbers to grades counts four points for an A, three point s for a B, two points for a C, one point for a D, and no points for an E or F. Unweighted GPA’s assign the same weight to each course. Weighting gives students additional points for their grades in advanced or honors courses. Graduate student: A student who holds a bachelor’s or first professional degree, or equivalent, and is taking courses at the post-baccalaureate level. *Health services: Free or low cost on-campus primary and preventive health care available to students. High school diploma or recognized equivalent: A document certifying the successful completion of a prescribed secondary school program of studies, or the attainment of satisfactory scores on the Tests of General Educational Development (GED) or an other state specified examination. Hispanic: A person of Mexican, Puerto Rican, Cuban, Central or South American, or other Spanish culture or origin, regardless of race. Honors program: Any special program for very able students offering the opportunity for educational enrichment, independent study, acceleration, or some combination of these. Independent study: Academic work chosen or designed by the student with the approval of the department concerned, under an instructor’s supervision, and usually undertaken outside of the regular classroom structure. In-state tuition: The tuition charged by institutions to those students who meet the state’s or institution’s residency requirements. International student: See Nonresident alien. Internship: Any short-term, supervised work experience usually related to a student’s major field, for which the student earns academic credit. The work can be full or part time, on- or off-campus, paid or unpaid. *Learning center: Center offering assistance through tutors, workshops, computer programs or audiovisual equipment in reading, writing, math, and skills such as taking notes, managing time, taking tests. *Legal services: Free or low cost legal advice for a range of issues (personal and other). Liberal arts/career combination: Program in which a student earns undergraduate degrees in two separate fields, one in a liberal arts major and the other in a professional or specialized major, whether on-campus or through cross-registration. Master’s degree: An award that requires the successful completion of a program of study of at least the full-time equivalent of one but not more than two academic years of work beyond the bachelor’s degree. Minority affiliation (as admission factor): Special consideration in the admission process for members of designated racial/ethnic minority groups. *Minority student center: Center with programs, activities, and/or services intended to enhance the college experience of students of color.   Nonresident alien: A person who is not a citizen or national of the United States and who is in this country on a visa or temporary basis and does not have the right to remain indefinitely. *On-campus day care: Licensed day care for children of students (usually 3 and up); usually for a fee. Open admission: Admission policy under which virtually all secondary school graduates or students with GED equivalency diplomas are admitted without regard to academic record, test scores, or other qualifications. Other expenses (costs): Include average costs for clothing, laundry, entertainment, medical (if not a required fee), and furnishings. Out-of-state tuition: The tuition charged by institutions to those students who do not meet the institution’s or state’s residency requirements. Part-time student (undergraduate): A student enrolled for less than 12 credits per semester or quarter, or less than 24 contact hours a week each term. *Personal counseling: One-on-one or group counseling with trained professionals for student who want to explore personal, educational, or vocational problems. Post-master’s certificate: An award that requires completion of an organized program of study of 24 credit hours beyond the master’s degree but does not meet the requirements of academic degrees at the doctoral level. Post-baccalaureate certificate: An award that requires completion of an organized program of study requiring 18 credit hours beyond the bachelor’s; designed for persons who have completed a baccalaureate degree but do not meet the requirements of academic degrees carrying title of master. Postsecondary award, certificate, or diploma (at least one but less than two academic years): Requires completion of an organized program of study at the postsecondary level (below the baccalaureate degree) in at least one but less than two full-t ime equivalent academic years, or designed for completion in at least 30 but less than 60 credit hours, or in at least 900 but less than 1,800 contact hours. Private institution: An educational institution controlled by a private individual(s) or by a nongovernmental agency, usually supported primarily by other than public funds, and operated by other than publicly elected or appointed officials. Private nonprofit institution: A private institution in which the individual(s) or agency in control receives no compensation, other than wages, rent, or other expenses for the assumption of risk. These include both independent nonprofit schools a nd those affiliated with a religious organization. Proprietary institution: See Private nonprofit institution. Public institution: An educational institution whose programs and activities are operated by publicly elected or appointed school officials, and which is supported primarily by public funds. Quarter calendar system: A calendar system in which the academic year consists of three sessions called quarters of about 12 weeks each. The range may be from 10 to 15 weeks. There may be an additional quarter in the summer. Race/ethnicity: Category used to describe groups to which individuals belong, identify with, or belong in the eyes of the community. The categories do not denote scientific definitions of anthropological origins. A person may be counted in only on e group. Race/ethnicity unreported: Category used to classify students or employees whose race/ethnicity is not known and whom institutions are unable to place in one of the specified racial/ethnic category. Religious affiliation/commitment (as admission factor): Affiliation with a certain church or faith/religion, commitment to a religious vocation, or observance of certain religious tenets/lifestyle. *Religious counseling: One-on-one or group counseling with trained professionals for student who want to religious problems or issues. *Remedial services: Instructional courses designed for students deficient in the general competencies necessary for a regular postsecondary curriculum and educational setting. Required fees: Fixed sum charged to students for items not covered by tuition and required of such a large proportion of all students that the student who does NOT pay is the exception. Do not include application fees, registration fees, student activity, or health fees. Resident alien or other eligible noncitizen: A person who is not a citizen or national of the United States and who has been admitted as a legal immigrant for the purpose of obtaining permanent resident alien status (and who holds either an alien registration card [Form I-551 or I-151], a Temporary Resident Card [Form I-688], or an Arrival-Departure Record [Form I-94] with a notation that conveys legal immigrant status, such as Section 207 Refugee, Section 208 Asylee, Conditional Entrant Parolee o r Cuban-Haitian). Room and board (charges)—on campus: Assume double occupancy in institutional housing and 19 meals per week (or maximum meal plan). Secondary school record (as admission factor): Information maintained by the secondary school that may include such things as the student’s high school transcript, class rank, GPA, and teacher and counselor recommendations. Semester calendar system: A calendar system that consists of two semesters during the academic year with about 16 weeks for each semester of instruction. There may be an additional summer session. Student-designed major. A program of study based on individual interests, designed with the assistance of an adviser. Study abroad: Any arrangement by which a student completes part of the college program studying in another county. Can be at a campus abroad or through a cooperative agreement with some other U.S. college or an institution of another country. *Summer session: A summer session is shorter than a regular semester and not considered part of the academic year. It is not the third term of an institution operating on a trimester system or the fourth term of an institution operating on a quart er calendar system. The institution may have 2 or more sessions occurring in the summer months. Some schools, such as vocational and beauty schools, have year-round classes with no separate summer session. Talent/ability (as admission factor): Special consideration given to students with demonstrated talent/abilities in areas of interest to the institution (e.g., sports, the arts, languages, etc.). Teacher certification program: Program designed to prepare students to meet the requirements for certification as teachers in elementary and secondary schools. Transfer applicant: An individual who has fulfilled the institution’s requirements to be considered for admission (including payment or waiving of the application fee, if any) and who has previously attended another college or university and earne d college-level credit. Transfer student: A student entering the institution for the first time but known to have previously attended a postsecondary institution at the same level (e.g., undergraduate). The student may transfer with or without credit. Transportation (costs): Assume two round trips to student’s hometown per year for students in institutional housing or daily travel to and from your institution. Trimester calendar system: An academic year consisting of 3 terms of about 15 weeks each. Tuition: Amount of money charged to students for instructional services. Tuition may be charged per term, per course, or per credit. *Tutoring: May range from one-on-one tutoring in specific subjects to tutoring in an area such as math, reading, or writing. Most tutors are college students; at some colleges, they are specially trained and certified. Unit: a standard of measurement representing hours of academic instruction (e.g., semester credit, quarter credit, contact hour). Undergraduate: A student enrolled in a four- or five-year bachelor’s degree program, an associate’s degree program, or a vocational or technical program below the baccalaureate. *Veteran’s counseling: Helps veterans and their dependents obtain benefits for their selected program and provides certifications to the Veteran’s Administration. May also provide personal counseling on the transition from the military to a civili an life. *Visually impaired: Any person whose sight loss is sufficiently severe and not correctable, and adversely affects educational performance. Volunteer work (as admission factor): Special consideration given to students for activity done on a volunteer basis (e.g., tutoring, hospital care, working with the elderly or disabled) as a service to the community or the public in general. Wait list: List of students who meet the admission requirements but will only be offered a place in the class if space becomes available. Weekend college: A program that allows students to take a complete course of study and attend classes only on weekends. White, non-Hispanic: A person having origins in any of the original peoples of Europe, North Africa, or the Middle East (except those of Hispanic origin). *Women’s center: Center with programs, academic activities, and/or services intended to promote an understanding of the evolving roles of women. Work experience (as admission factor): Special consideration given to students who have been employed prior to application, whether for relevance to major, demonstration of employment-related skills, or as explanation of student’s academic and ext racurricular record.  , 16354=B6. Final 1993 cohort, after adjusting for allowable exclusions: ______425_________  (Subtract question B5 from question B4), 35181=C16. Notification to applicants of admission decision sent: By April 1, 28674=Provide percentages for ALL enrolled degree-seeking full-time and part-time, first-time, first-year (freshman) students enrolled in fall 1999, including students who began studies during summer, international students/nonresident aliens, and students admitted under special arrangements., 28190= Latest date by which SAT II scores must be received for fall-term admission: January, 93564=Report the Fall 1999 ratio of full-time equivalent students (full-time plus 1/3 part time) to full-time equivalent instructional faculty (full time plus 1/3 part time). In the ratio calculations, exclude both faculty and students in stand-alone graduate or professional programs such as medicine, law, veterinary, dentistry, social work, business, or public health in which faculty teach virtually only graduate level students. Do not count undergraduate or graduate student teaching assistants as faculty., 12568=B2. Enrollment by Racial/Ethnic Category.  Provide numbers of degree-seeking undergraduate students reported on IPEDS Fall Enrollment Survey 1999 as of the institution’s official fall reporting date or as of October 15, 1999. Refer to IPEDS EF-1 Part A or IPEDS EF-2 Part A surveys based on column and line numbers in grid for totals., 14784=B3. Number of degrees awarded by your institution from July 1, 1998, to June 30, 1999, 28072=C. Latest date by which SAT I or ACT scores must be received for fall-term admission: January, 59200=G1. Undergraduate full-time tuition, required fees, room and board. List the typical tuition, required fees, and room and board for a full-time undergraduate student for the FULL 1999-2000 academic year. A full academic year refers to the period of time generally extending from September to June; usually equated to two semesters or trimesters, three quarters, or the period covered by a four-one-four plan. Room and board is defined as double occupancy and 19 meals per week or the maximum meal plan. Required fees include only charges that all full-time students must pay that are not included in tuition (e.g., registration, health, or activity fees.) Do not include optional fees (e.g., parking, laboratory use)., 90021=I-1. Please report number of instructional faculty members in each category for Fall 1999., 17041=B9. Of the initial 1993 cohort, how many completed the program in more than five years but in six years or less (after August 31, 1998 and by August 31, 1999): ______4________  (IPEDS GRS, Section II, Part A, line 21, sum of columns 15 and 16), 15360=For Bachelor’s or Equivalent Programs Report for the cohort of full-time first-time bachelor’s (or equivalent) degree-seeking undergraduate students who entered in fall 1993. Include in the cohort those who entered your institution during the summer term preceding fall 1993., 17527=B11. Six-year graduation rate for 1993 cohort (question B10 divided by question B6): _____87_______ %  , 18662=C1. First-time, first-year (freshman) students: Provide the number of degree-seeking students who applied, were admitted, and enrolled (full- or part-time) in fall 1999. Include early decision, early action, and students who began studies during summer in this cohort. Applicants include all students who fulfilled the requirements for consideration for admission (including payment or waiving of the application fee, if any) and who have been notified of one of the following actions: admission, nonadmission, placement on waiting list, or application withdrawn (by applicant or institution). Admitted applicants should include wait-listed students who were subsequently offered admission., 94219=In the table below, please use the following definitions to report information about the size of classes and class sections offered in the Fall 1999 term., 66331=Indicate academic year for which data are reported: 1999-2000 actual  __   1999-2000 estimated __   1998-99 actual _X_  , 94095=Fall 1999 Student to Faculty ratio:  ___9.2_____ to 1., 16751=B8. Of the initial 1993 cohort, how many completed the program in more than four years but in five years or less (after August 31, 1997 and by August 31, 1998): ______14___________  (IPEDS GRS, Section II, Part A, line 20, sum of columns 15 and 16)}",
    "textBeforeTable": "Average class rank - %ile   C10. Percent of all degree-seeking, first-time, first-year (freshman) students who had high school class rank within each of the following ranges (report information for those students from whom you collected high school rank information).    0% below 6    0% 6-11    0% 12-17    0% 18-23  67% 24-29  33% 30-36 ACT Composite     0%   0% 200-299   0%   0% 300-399   1%   1% 400-499   7%   8% 500-599 51% 57% 600-699 42% 33% 700-800 SAT I Math SAT I Verbal   Percent of first-time, first-year (freshman) students with scores in each range   30    27 ACT Composite 720 640 SAT I Math 710",
    "textAfterTable": "C18. Deferred admission: Does your institution allow students to postpone enrollment after admission?  Yes. Maximum period of postponement: 1 year C19. Early admission of high school students: Does your institution allow high school students to enroll as full-time, first-time, first-year (freshman) students one year or more before high school graduation? No C20. Common Application: Will you accept the Common Application distributed by the National Association of Secondary School Principals if submitted?  Yes If \"yes,\" are supplemental forms required? No Is your college a member of the Common Application Group? Yes Early Decision and Early Action Plans C21. Early decision: Does your institution offer an early decision plan (an admission plan that permits students to apply and be notified of an admission decision well in advance of the regular notification date and that asks students to commit to attending if accepted) for first-time, first-year (freshman) applicants for fall enrollment?  Yes If \"yes,\" please complete the following : First or only early decision plan closing date - December 1 First or only early decision plan notification date - December 22 Number of early decision applications received by your institution -  378 (for Fall 1999) Number of applicants admitted under early decision plan -  206 (for Fall 1999)     Please provide significant details about your early decision plan: _____________________________________ C22. Early action: Do you have a nonbinding early",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}