{
    "relation": [
        [
            "Action",
            "NPRM",
            "Next Action Undetermined"
        ],
        [
            "Date",
            "06/16/11",
            ""
        ],
        [
            "FR Cite",
            "76 FR 35176",
            ""
        ]
    ],
    "pageTitle": "Federal Register | Unified Agenda of Federal Regulatory and Deregulatory Actions-Fall 2011",
    "title": "",
    "url": "https://www.federalregister.gov/articles/2012/02/13/2012-1664/unified-agenda-of-federal-regulatory-and-deregulatory-actions-fall-2011",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042982745.46/warc/CC-MAIN-20150728002302-00220-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 908590651,
    "recordOffset": 908510921,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{27181=A Proposed Rule by the Postal Regulatory Commission on 07/28/2015}",
    "TableContextTimeStampAfterTable": "{503502=Abstract: In 2010, the Commission released an Order and Further Notice of Proposed rulemaking which implemented certain pole attachment recommendations of the National Broadband Plan and sought comment with regard to others. On April 7, 2011, the Commission adopted a Report and Order and Order on Reconsideration that sets forth a comprehensive regulatory scheme for access to poles, and modifies existing rules for pole attachment rates and enforcement., 209526=Abstract: The Commission seeks comment on the proposed amendment of parts 2 and 25 of the Commission's rules to allocate spectrum for use with Vehicle-Mounted Earth Stations (VMES) in the Fixed-Satellite Service in the Ku-band uplink at 14.0-14.5 GHz and Ku-band downlink 11.72-12.2 GHz on a primary basis, and in the extended Ku-band downlink at 10.95-11.2 GHz and 11.45-11.7 GHz on a non-protected basis, and to adopt Ku-band VMES licensing and service rules modeled on the FCC's rules for Ku-band Earth Stations on Vessels (ESVs). The record in this proceeding will provide a basis for Commission action to facilitate introduction of this proposed service., 158288=The 7th Report and Order facilitates the introduction of Advanced Wireless Service (AWS) in the band 1710-1755 MHz—an integral part of a 90 MHz spectrum allocation recently reallocated to allow for such new and innovative wireless services. We largely adopt the proposals set forth in our recent AWS Fourth NPRM in this proceeding that are designed to clear the 1710-1755 MHz band of incumbent Federal Government operations that would otherwise impede the development of new nationwide AWS services. These actions are consistent with previous actions in this proceeding and with the United States Department of Commerce, National Telecommunications and Information Administration (NTIA) 2002 Viability Assessment, which addressed relocation and reaccommodation options for Federal Government operations in the band., 87761=Docket Number— assigned to a proceeding if the Commission has issued either a Notice of Proposed Rulemaking or a Notice of Inquiry concerning the matter under consideration. The Commission has used docket numbers since January 1, 1978. Docket numbers consist of the last two digits of the calendar year in which the docket was established plus a sequential number that begins at 1 with the first docket initiated during a calendar year (e.g., Docket No. 96-1 or Docket No. 99-1). The abbreviation for the responsible bureau usually precedes the docket number, as in “MM Docket No. 96-222,” which indicates that the responsible bureau is the Mass Media Bureau (now the Media Bureau). A docket number consisting of only five digits (e.g., Docket No. 29622) indicates that the docket was established before January 1, 1978., 257057=Agency Contact: Peter Doyle, Chief, Audio Division, Media Bureau, Federal Communications Commission, 445 12th Street SW., Washington, DC 20554, Phone: 202 418-2700, Email: peter.doyle@fcc.gov., 238174=Agency Contact: David Konczal, Policy Division, Media Bureau, Federal Communications Commission, 445 12th Street SW., Washington, DC 20554, Phone: 202 418-2228, Email: david.konczal@fcc.gov., 373033=Abstract: This proceeding explores the possible uses of the 1915-1920 MHz, 1995-2000 MHz, 2020-2025 MHz, and 2175-2180 MHz Bands (collectively AWS-2) to support the introduction of new advanced wireless services, including third generations as well as future generations of wireless systems. Advanced wireless systems could provide for a wide range of voice data and broadband services over a variety of mobile and fixed networks., 246426=Agency Contact: Mary Beth Murphy, DIvision Chief, Policy Division, Federal Communications Commission, Media Bureau, 445 12th Street SW., Washington, DC 20554, Phone: 202 418-2132, Email: marybeth.murphy@fcc.gov., 496484=Agency Contact: Melissa Kirkel, Attorney-Advisor, WCB, Federal Communications Commission, 445 12th Street SW., Washington, DC 20554, Phone: 202 418-7958, Fax: 202 418-1413, Email: melissa.kirkel@fcc.gov., 160759=The 9th Report and Order established procedures for the relocation of Broadband Radio Service (BRS) operations from the 2150-2160/62 MHz band, as well as for the relocation of Fixed Microwave Service (FS) operations from the 2160-2175 MHz band, and modified existing relocation procedures for the 2110-2150 MHz and 2175-2180 MHz bands. It also established cost-sharing rules to identify the reimbursement obligations for Advanced Wireless Service (AWS) and Mobile Satellite Service (MSS) entrants benefiting from the relocation of incumbent FS operations in the 2110-2150 MHz and 2160-2200 MHz bands and AWS entrants benefiting from the relocation of BRS incumbents in the 2150-2160/62 MHz band. The Commission continues its ongoing efforts to promote spectrum utilization and efficiency with regard to the provision of new services, including AWS. The Order dismisses a petition for reconsideration filed by the Wireless Communications Association International, Inc. (WCA) as moot., 446218=Agency Contact: Jeremy Miller, Deputy Chief, Industry Analysis and Technology Div., Federal Communications Commission, Wireline Competition Bureau, 445 12th Street SW., Washington, DC 20554, Phone: 202 418-1507, Fax: 202 418-1413, Email: jeremy.miller@fcc.gov., 224316=Abstract: Section 202(h) of the Telecommunications Act of 1996 requires the Commission to review its ownership rules every four years and determine whether any such rules are necessary in the public interest as the result of competition., 422280=On February 19, 2010, the Commission released an Order and Notice of Proposed Rulemaking that enabled schools that receive funding from the E-rate program to allow members of the general public to use the schools' Internet access during non-operating hours through funding year 2010 (July 1, 2010 through June 30, 2010) and sought comment on revising its rules to make this change permanent., 291240=Legal Authority: 47 U.S.C. 229; 47 U.S.C. 1001 to 1008, 142297=On October 14, 2010, the Commission released a Notice of Proposed Rulemaking proposing rules that would require mobile service providers to provide usage alerts and information that will assist consumers in avoiding unexpected charges on their bills., 410329=Agency Contact: John Borkowski, Attorney-Advisor, Federal Communications Commission, 2025 M Street NW., Washington, DC 20554, Phone: 202 634-2443., 474566=Abstract: Jurisdictional separations is the process, pursuant to part 36 of the Commission's rules, by which incumbent local exchange carriers apportion regulated costs between the intrastate and interstate jurisdictions. In 1997, the Commission initiated a proceeding seeking comment on the extent to which legislative changes, technological changes, and market changes warrant comprehensive reform of the separations process. In 2001, the Commission adopted the Federal-State Joint Board on Jurisdictional Separations' recommendation to impose an interim freeze of the part 36 category relationships and jurisdictional cost allocation factors for a period of five years, pending comprehensive reform of the part 36 separations rules. In 2006, the Commission adopted an Order and Further Notice of Proposed Rulemaking, which extended the separations freeze for a period of three years and sought comment on comprehensive reform. In 2009, the Commission adopted a Report and Order extending the separations freeze an additional year to June 2010. In 2010, the Commission adopted a Report and Order extending the separations freeze for an additional year to June 2011. In 2011, the Commission adopted a Report and Order extending the separations freeze for an additional year to June 2012., 145882=Abstract: The Commission's closed captioning rules are designed to make video programming more accessible to deaf and hard of hearing Americans. This proceeding resolves some issues regarding the Commission's closed captioning rules that were raised for comment in 2005, and also seeks comment on how a certain exemption from the closed captioning rules should be applied to digital multicast broadcast channels., 206614=Agency Contact: David Krech, Attorney Advisor, Federal Communications Commission, International Bureau, 445 12th Street SW., Washington, DC 20554, Phone: 202 418-1460, Fax: 202 418-2824, Email: david.krech@fcc.gov., 443097=Agency Contact: Nakesha Woodward, Program Support Assistant, Federal Communications Commission, 445 12th Street SW., Washington, DC 20554, Phone: 202 418-1502, Email: kesha.woodward@fcc.gov., 157576=The Third Notice of Proposed Rulemaking discusses the frequency bands that are still under consideration in this proceeding and invites additional comments on their disposition. Specifically, it addresses the Unlicensed Personal Communications Service (UPCS) band at 1910-1930 MHz, the Multipoint Distribution Service (MDS) spectrum at 2155-2160/62 MHz bands, the Emerging Technology spectrum, at 2160-2165 MHz, and the bands reallocated from MSS 91990-2000 MHz, 2020-2025 MHz, and 2165-2180 MHz. We seek comment on these bands with respect to using them for paired or unpaired Advance Wireless Service (AWS) operations or as relocation spectrum for existing services., 472406=Agency Contact: Douglas Slotten, Attorney-Advisor, Federal Communications Commission, Wireline Competition Bureau, 445 12th Street SW., Washington, DC 20554, Phone: 202 418-1572, Email: douglas.slotten@fcc.gov., 153339=Abstract: On October 14, 2010, the Commission released a Notice of Proposed Rulemaking which proposes rule that would require mobile service providers to provide usage alerts and information that will assist consumers in avoiding unexpected charges on their bills., 385441=Abstract: This action adopts rules that retain the current site-based licensing paradigm for the 900 MHz B/ILT “white space”; adopts interference protection rules applicable to all licensees operating in the 900 MHz B/ILT spectrum; and lifts, on a rolling basis, the freeze placed on applications for new 900 MHz B/ILT licenses in September 2004—the lift being tied to the completion of rebanding in each 800 MHz National Public Safety Planning Advisory Committee (NPSPAC) region., 457247=On June 16, 2005, the Commission published in the Federal Register notice that public information collections set forth in the First Report and Order were being submitted for review to the office of management and budget., 420941=Abstract: The goals of Universal Service, as mandated by the 1996 Act, are to promote the availability of quality services at just, reasonable, and affordable rates; increase access to advanced telecommunications services throughout the Nation; advance the availability of such services to all consumers, including those in low income, rural, insular, and high cost areas at rates that are reasonably comparable to those charged in urban areas. In addition, the 1996 Act states that all providers of telecommunications services should contribute to Federal universal service in some equitable and nondiscriminatory manner; there should be specific, predictable, and sufficient Federal and State mechanisms to preserve and advance universal service; all schools, classrooms, health care providers, and libraries should, generally, have access to advanced telecommunications services; and finally, that the Federal-State Joint Board and the Commission should determine those other principles that, consistent with the 1996 Act, are necessary to protect the public interest. More recently, modernization efforts for continuous improvements to the universal service programs are being realized consistent and in keeping with the goals envisioned by the National Broadband Plan., 120283=On January 4, 2008, the Commission released a Declaratory Ruling, clarifying that autodialed and prerecorded message calls to wireless numbers that are provided by the called party to a creditor in connection with an existing debt are permissible as calls made with the “prior express consent” of the called party., 186684=Agency Contact: James Burtle, Chief, Experimental Licensing Branch, Federal Communications Commission, 445 12th Street SW., Washington, DC 20554, Phone: 202 418-2445, Email: james.burtle@fcc.gov., 398873=Abstract: On April 14, 2009, American Bird Conservancy, Defenders of Wildlife, and National Audubon Society filed a Petition for Expedited Rulemaking and Other Relief. The petitioners request that the Commission adopt on an expedited basis a variety of new rules, which they assert are necessary to comply with environmental statutes and their implementing regulations. This proceeding addresses the Petition for Expedited Rulemaking and Other Relief., 159549=The Order requires Broadband Radio Service (BRS) licensees in the 2150-2160/62 MHz band to provide information on the construction status and operational parameters of each incumbent BRS system that would be the subject of relocation., 53633=On June 2, 2015, the Office of the Federal Register (OFR) hosted its 3rd Annual Federal Register Liaison Conference in the National Archives’ McGowan Theater. What exactly is a Federal... Continue reading →, 196619=Abstract: The Commission adopted a Notice or Proposed Rulemaking (NPRM) to streamline its procedures for reviewing satellite license applications. Before 2003, the Commission used processing rounds to review those applications. In a processing round, when an application is filed, the International Bureau (Bureau) issued a public notice establishing a cut-off date for other mutually exclusive satellite applications, and then considered all those applications together. In cases where sufficient spectrum to accommodate all the application was not available, the Bureau directed the applicants to negotiate a mutually agreeable solution. Those negotiations took a long time, and delayed provision of satellite services to the public., 499110=The Commission began implementing the electronic filing of tariffs on January 31, 1997, when it released the Streamlined Tariff Order. On November 17, 1997, the Bureau made this electronic system, known as the Electronic Tariff Filing System, available for voluntary filing by incumbent LECs. The Bureau also announced that the use of ETFS would become mandatory for all incumbent LECs in 1998., 455324=Agency Contact: Douglas Slotten, Attorney-Advisor, Federal Communications Commission, Wireline Competition Bureau, 445 12th Street SW., Washington, DC 20554, Phone: 202 418-1572, Email: douglas.slotten@fcc.gov., 488340=Abstract: In 2009, the FCC launched a public process to determine whether and what actions might be necessary to preserve the characteristics that have allowed the Internet to grow into an indispensable platform supporting our nation's economy and civic life. After receiving input from more than 100,000 individuals and organizations and several public workshops, this process has made clear that the Internet has thrived because of its freedom and openness—the absence of any gatekeeper blocking lawful uses of the network or picking winners and losers online. The Open Internet Order builds on the bipartisan Internet Policy Statement the Commission adopted in 2005. The Order requires that all broadband providers are required to be transparent by disclosing their network management practices, performance, and commercial terms; fixed providers may not block lawful content, applications, services, or non-harmful devices; fixed providers may not unreasonably discriminate in transmitting lawful network traffic; mobile providers may not block access to lawful Web sites, or applications that compete with their voice or video telephony services; and all providers may engage in “reasonable network management,” such as managing the network to address congestion or security issues. The rules do not prevent broadband providers from offering specialized services, such as facilities-based VoIP; do not prevent providers from blocking unlawful content or unlawful transfers of content; and do not supersede any obligation or authorization a provider may have to address the needs of emergency communications or law enforcement, public safety, or national security authorities., 177688=Petitions for Reconsideration have been filed in the Commission's rulemaking proceeding concerning Fixed and Mobile Services in the Mobile Satellite Service Bands at 1525-1559 MHz and 1626.5-1660.5 MHz, 1610-1626.5 MHz and 2483.5-2500 MHz, and 2000-2020 MHz and 2180-2200 MHz and published pursuant to 47 CFR 1.429(e). See 1.4(b)(1) of the Commission's rules., 308261=Agency Contact: David H. Siehl, Attorney, Federal Communications Commission, Public Safety and Homeland Security Bureau, 445 12th Street SW., Washington, DC 20554, Phone: 202 418-1313, Fax: 202 418-2816, Email: david.siehl@fcc.gov., 379972=The Commission also imposes a freeze on the filing of new license applications that seek to operate on any 700 MHz Band frequencies (698-806 MHz) after the end of the DTV transition, February 17, 2009, as well as on granting any request for equipment authorization of low power auxiliary station devices that would operate in any of the 700 MHz Band frequencies. The Commission also holds in abeyance, until the conclusion of this proceeding, any pending license applications and equipment authorization requests that involve operation of low power auxiliary devices on frequencies in the 700 MHz Band after the end of the DTV transition., 449325=On February 12, 2004, the Commission adopted a Second Report and Order resolving several issues on which the Commission sought comment in the FNPRM. First, the Commission modified the “all-or-nothing” rule to permit rate-of-return carriers to bring recently acquired price cap lines back to rate-of-return regulation. Second, the Commission granted rate-of-return carriers the authority immediately to provide geographically deaveraged transport and special access rates, subject to certain limitations. Third, the Commission merged Long Term Support (LTS) with Interstate Common Line Support (ICLS)., 263512=Abstract: Cable systems and other multichannel video programming distributors are not entitled to retransmit a broadcast station's signal without the station's consent. This consent is known as “retransmission consent.” Since Congress enacted the retransmission consent regime in 1992, there have been significant changes in the video programming marketplace. In this proceeding, comment is sought on a series of proposals to streamline and clarify the Commission's rules concerning or affecting retransmission consent negotiations., 227879=Agency Contact: Amy Brett, Asst. Div. Chief, Industry Analysis Div., Federal Communications Commission, Media Bureau, 445 12th Street SW., Washington, DC 20554, Phone: 202 418-2703, Email: amy.brett@fcc.gov., 470461=On February 8, 2011, the Commission adopted a Further Notice of Proposed Rulemaking seeking comment on proposed rule revisions to address access stimulation. The Commission sought comment on a proposal to require rate-of-return LECs and competitive LECs to file revised tariffs if they enter into or have existing revenue sharing agreements. The proposed tariff filing requirements vary depending on the type of LEC involved. The Commission also sought comment on other record proposals and on possible rules for addressing access stimulation in the context of intra-MTA call terminations by CMRS providers. Comments were filed on April 1, 2011, and reply comments were filed on April 18, 2011., 493741=Abstract: In 2007, the Commission released a Notice of Proposed Rulemaking in WC Docket No. 07-244. The Notice sought comment on whether the Commission should adopt rules specifying the length of the porting intervals or other details of the porting process. It also tentatively concluded that the Commission should adopt rules reducing the porting interval for wireline-to-wireline and intermodal simple port requests, specifically, to a 48-hour porting interval., 142591=On July 12, 2011, the Commission released an NPRM that would assist Consumers in detecting and preventing the placement of unauthorized charges on their telephone bills, an unlawful and fraudulent practice, commonly referred to as “cramming.”, 219208=Abstract: On January 18, 2001, the Commission adopted a Report and Order (R&O) and Further Notice of Proposed Rulemaking, addressing a number of issues related to the conversion of the nation's broadcast television system from analog to digital television. The Second Report and Order resolved several major technical issues including the issue of receiver performance standards, DTV tuners, and revisions to certain components of the DTV transmission standard. A subsequent NPRM commenced the Commission's second periodic review of the progress of the digital television conversion. The resulting R&O adopted a multi-step process to create a new DTV table of allotments and authorizations. Also in the R&O, the Commission adopted replication and maximization deadlines for DTV broadcasters and updated rules in recognition revisions to broadcast transmission standards., 224619=In 2002, the Commission undertook a comprehensive review of its broadcast multiple and cross-ownership limits examining: cross-ownership of TV and radio stations; local TV ownership limits; national TV cap; and dual network rule., 462545=On August 6, 2007, the Commission published in the Federal Register notice that it had extended Telecommunications Relay Services (TRS) regulations to interconnected VoIP providers and extended certain disability access requirements to interconnected VoIP providers and to manufacturers of specially designed equipment used to provide such service (72 FR 43546)., 154630=Agency Contact: Richard D. Smith, Special Counsel, Federal Communications Commission, Consumer and Governmental Affairs Bureau, 445 12th Street SW., Washington, DC 20554, Phone: 717 338-2797, Fax: 717 338-2574, Email: richard.smith@fcc.gov., 119541=On September 21, 2004, the Commission released an Order amending existing safe harbor rules for telemarketers subject to the do-not-call registry to require such telemarketers to access the do-not-call list every 31 days, rather than every 3 months., 378920=Abstract: In the Notice of Proposed Rulemaking and Order, to facilitate the DTV transition the Commission tentatively concludes to amend its rules to make clear that the operation of low power auxiliary stations within the 700 MHz Band will no longer be permitted after the end of the DTV transition. The Commission also tentatively concludes to prohibit the manufacture, import, sale, offer for sale, or shipment of devices that operate as low power auxiliary stations in the 700 MHz Band. In addition, for those licensees that have obtained authorizations to operate low power auxiliary stations in spectrum that includes the 700 MHz Band beyond the end of the DTV transition, the Commission tentatively concludes that it will modify these licenses so as not to permit such operations in the 700 MHz Band after February 17, 2009. The Commission also seeks comment on issues raised by the Public Interest Spectrum Coalition (PISC) in its informal complaint and petition for rulemaking., 225710=For the 2010 quadrennial review, five of the Commission's media are the subject of review: The local TV ownership rule; the local radio ownership rule; the newspaper broadcast cross-ownership rule; the radio/TV cross-ownership rule; and the dual network rule., 149156=Agency Contact: Eliot Greenwald, Consumer & Governmental Affairs Bureau, Federal Communications Commission, 445 12th Street SW., Washington, DC 20554, Phone: 202 418-2235, Email: eliot.greenwald@fcc.gov., 457539=On July 27, 2005, the Commission published in the Federal Register notice that the information collection requirements adopted in the First Report and Order were approved in OMB No. 3060-1085 and would become effective on July 29, 2005., 234305=Agency Contact: Amy Brett, Asst. Div. Chief, Industry Analysis Div., Federal Communications Commission, Media Bureau, 445 12th Street SW., Washington, DC 20554, Phone: 202 418-2703, Email: amy.brett@fcc.gov., 452535=Agency Contact: Douglas Slotten, Attorney-Advisor, Federal Communications Commission, Wireline Competition Bureau, 445 12th Street SW., Washington, DC 20554, Phone: 202 418-1572, Email: douglas.slotten@fcc.gov., 423835=On April 21, 2010, the Commission issued a Notice of Inquiry and Notice of Proposed Rulemaking, the first in a series of proceedings to kick off universal service support reform that is key to making broadband service available for millions of Americans who lack access. This NOI and NPRM sought comment on first steps to reform the distribution of universal service high-cost support., 141463=Abstract: In 1999, the Commission adopted truth-in-billing rules to address concerns that there is consumer confusion relating to billing for telecommunications services. On March 18, 2005, the Commission released an Order and FNPRM to further facilitate the ability of telephone consumers to make informed choices among competitive service offerings., 486666=Agency Contact: Carol Simpson, Deputy Chief, Policy Division, Federal Communications Commission, Public Safety and Homeland Security Bureau, 445 12th Street SW., Washington, DC 20554, Phone: 202 418-2391, Fax: 202 418-2816, Email: carol.simpson@fcc.gov., 114426=Abstract: These proceedings implement the provisions of sections 255 and 251(a)(2) of the Communications Act and related sections of the Telecommunications Act of 1996 regarding the accessibility of telecommunications equipment and services to persons with disabilities., 224893=The Report and Order replaced the newspaper/broadcast cross-ownership and radio and TV rules with a tiered approach based on the number of television stations in a market. In June 2006, the Commission adopted a Further Notice of Proposed Rulemaking initiating the 2006 review of the broadcast ownership rules. The further notice also sought comment on how to address the issues raised by the Third Circuit. Additional questions are raised for comment in a Second Further Notice of Proposed Rulemaking., 396756=Agency Contact: Paul D'Ari, Spectrum and Competition Policy Division, Wireless Bureau, Federal Communications Commission, 445 12th Street SW., Washington, DC 20554, Phone: 202 418-1550, Fax: 202 418-7447, Email: paul.dari@fcc.gov., 54241=Posted by Ben Jordi on June 1, 2015, 494271=In the Local Number Portability Porting Interval and Validation Requirements First Report and Order and Further Notice of Proposed Rulemaking, released on May 13, 2009, the Commission reduced the porting interval for simple wireline and simple intermodal port requests, requiring all entities subject to its local number portability (LNP) rules to complete simple wireline-to-wireline and simple intermodal port requests within one business day. In a related Further Notice of Proposed Rulemaking (FNPRM), the Commission sought comment on what further steps, if any, the Commission should take to improve the process of changing providers., 374042=Thereafter, the Commission released a Further Notice of Proposed Rulemaking (FNPRM), seeking comment on the Commission's proposed rules for the 1915-1920 MHz and 1995-2000 MHz bands. In addition, the Commission proposed to add 5 megahertz of spectrum (2175-80 MHz band) to the 2155-2175 MHz band, and would require the licensee of the 2155-2180 MHz band to provide—using up to 25 percent of its wireless network capacity—free, two-way broadband Internet service at engineered data rates of at least 768 kbps downstream., 369029=Thereafter, the Commission released a Further Notice of Proposed Rulemaking (FNPRM), seeking comment on the Commission's proposed AWS-3 rules, which include adding 5 megahertz of spectrum (2175-80 MHz) to the AWS-3 band, and requiring licensees of that spectrum to provide—using up to 25 percent of its wireless network capacity—free, two-way broadband Internet service at engineered data rates of at least 768 kbps downstream., 252309=Agency Contact: Peter Doyle, Chief, Audio Division, Media Bureau, Federal Communications Commission, 445 12th Street SW., Washington, DC 20554, Phone: 202 418-2700, Email: peter.doyle@fcc.gov., 262078=Agency Contact: Amy Brett, Asst. Div. Chief, Industry Analysis Div., Federal Communications Commission, Media Bureau, 445 12th Street SW., Washington, DC 20554, Phone: 202 418-2703, Email: amy.brett@fcc.gov., 306260=Abstract: This proceeding is separate from the Commission's proceeding on Enhanced 911 Emergency Systems (E911) in that it is intended to implement provisions of the Wireless Communications and Public Safety Act of 1999 through the promotion of public safety by the deployment of a seamless, nationwide emergency communications infrastructure that includes wireless communications services. More specifically, a chief goal of the proceeding is to ensure that all emergency calls are routed to the appropriate local emergency authority to provide assistance. The E911 proceeding goes a step further and is aimed at improving the effectiveness and reliability of wireless 911 dispatchers with additional information on wireless 911 calls., 120641=Following a December 4, 2007 NPRM, on June 17, 2008, the Commission released a Report and Order amending its rules to require sellers and/or telemarketers to honor registrations with the National Do-Not-Call Registry indefinitely, unless the registration is cancelled by the consumer or the number is removed by the database administrator., 280378=Abstract: In a series of orders in several related proceedings issued since 1996, the Federal Communications Commission has taken action to improve the quality and reliability of 911 emergency services for wireless phone users. Rules have been adopted governing the availability of basic 911 services and the implementation of enhanced 911 (E911) for wireless services., 422716=On March 18, 2010, the Commission issued a Report & Order and Memorandum Opinion & Order. In this order, the Commission addressed an inequitable asymmetry in the Commission's current rules governing the receipt of universal service high-cost local switching support (LSS) by small incumbent local exchange carriers (LECs). By modifying the Commission's rules to permit incumbent LECs that lose lines to receive additional LSS when they cross a threshold, the order provides LSS to all small LECs on the same basis. Nothing in the order is intended to address the long-term role of LSS in the Commission's high-cost universal service policies, which the Commission is considering as part of comprehensive universal service reform. April 16, 2010, the Commission issued an Order and NPRM addressing high-cost universal service support for non-rural carriers serving insular areas. In the NPRM, the Commission sought comment on amending its rules to provide additional low-income support in Puerto Rico., 461182=On December 13, 2007, the Commission announced the effective date of its revised CPNI rules (72 FR 70808)., 117956=Agency Contact: Cheryl J. King, Deputy Chief, Disability Rights Office, Federal Communications Commission, Consumer and Governmental Affairs Bureau, 445 12th Street SW., Washington, DC 20554, Phone: 202 418-2284, TDD Phone: 202 418-0416, Fax: 202 418-0037, Email: cheryl.king@fcc.gov., 458725=On June 8, 2007, the Commission published in the Federal Register notice that it had adopted on April 2, 2007, an item strengthening the Commission's rules to protect the privacy of customer proprietary network information (CPNI) that is collected and held by providers of communications services, and a further notice of proposed rulemaking seeking comment on what steps the Commission should take, if any, to secure further the privacy of customer information., 159147=The 8th Report and Order reallocated the 2155-2160 MHz band for Fixed and Mobile services and designates the 2155-2175 MHz band for Advanced Wireless Service (AWS) use. This proceeding continues the Commission's ongoing efforts to promote spectrum utilization and efficiency with regard to the provision of new services, including Advanced Wireless Services., 231366=Agency Contact: Shaun Maher, Attorney, Video Division, Federal Communications Commission, Mass Media Bureau, 445 12th Street SW., Washington, DC 20554, Phone: 202 418-2324, Fax: 202 418-2827, Email: shaun.maher@fcc.gov., 459258=On August 6, 2007, the Commission published in the Federal Register notice that it had adopted on May 31, 2007, and item extending the disability access requirements that currently apply to telecommunications service providers and equipment manufacturers under section 255 of the Communications Act of 1934, as amended, to providers of “interconnected voice over Internet Protocol (VoIP) services,” as defined by the Commission, and to manufacturers of specially designed equipment used to provide those services. In addition, the Commission extended the Telecommunications Relay Services (TRS) requirements contained in its regulations to interconnected VoIP providers., 460691=On November 1, 2007, the Commission gave notice that it granted in part, denied in part, and sought comment on petitions filed by the Voice on the Net Coalition, the United States Telecom Association, and Hamilton Telephone Company seeking a stay or waiver of certain aspects of the Commission's VoIP Telecommunications Relay Services (TRS) Order (72 FR 61813; 72 FR 61882)., 159827=The Notice of Proposed Rule Making requested comments on the specific relocation procedures applicable to Broadband Radio Service (BRS) operations in the 2150-2160/62 MHz band, which the Commission recently decided will be relocated to the newly restructured 2495-2690 MHz band. The Commission also requested comments on the specific relocation procedures applicable to Fixed Microwave Service (FS) operations in the 2160-2175 MHz band., 248227=Abstract: This proceeding was initiated to establish a new noncommercial educational low power FM radio service for non-profit community organizations and public safety entities. In January 2000, the Commission adopted a Report and Order establishing two classes of LPFM stations, 100 watt (LP100) and 10 watt (LP10) facilities, with service radii of approximately 3.5 miles and 1-2 miles, respectively. The Report and Order also established ownership and eligibility rules for the LPFM service. The Commission generally restricted ownership to entities with no attributable interest in any other broadcast station or other media. To choose among entities filing mutually exclusive applications for LPFM licenses, the Commission established a point system favoring local ownership and locally-originated programming. The Report and Order imposed separation requirements for LPFM with respect to full power stations operating on co-, first- and second-adjacent and intermediate frequency (IF) channels., 419410=Agency Contact: Jeremy Marcus, Asst. Division Chief, Broadband Div., Federal Communications Commission, Wireless Telecommunications Bureau, 445 12th Street SW., Washington, DC 20554, Phone: 202 418-1530, Fax: 202 418-1567, Email: jeremy.marcus@fcc.gov., 463585=On August 7, 2009, the Commission published a notice in the Federal Register that it had amended its rules so that providers of interconnected VoIP service must comply with the same discontinuance rules as domestic non-dominant telecommunications carriers. (74 FR 39551), 217371=Agency Contact: Brendan Murray, Attorney Advisor, Policy Division, Federal Communications Commission, Media Bureau, 445 12th Street SW., Washington, DC 20554, Phone: 202 418-1573, Email: brendan.murray@fcc.gov., 269582=Abstract: Section 9 of the Communications Act of 1934, as amended, 47 U.S.C. 159, requires the FCC to recover the cost of its activities by assessing and collecting annual regulatory fees from beneficiaries of the activities., 168374=Agency Contact: Ira Keltz, Electronics Engineer, Federal Communications Commission, Office of Engineering and Technology, 445 12th Street SW., Washington, DC 20554, Phone: 202 418-0616, Fax: 202 418-1944, Email: ikeltz@fcc.gov., 498520=Abstract: Section 402(b)(1)(A)(iii) of the Telecommunications Act of 1996 added section 204(a)(3) to the Communications Act of 1934, as amended, providing for streamlined tariff filings by local exchange carriers. On September 6, 1996, in an effort to meet the goals of the 1996 Act, the Commission released the Tariff Streamlining NPRM, proposing measures to implement the tariff streamlining requirements of section 204(a)(3). Among other suggestions, the Commission proposed requiring LECs to file tariffs electronically., 457978=On August 31, 2005, the Commission published in the Federal Register notice of the comment cycle for three Petitions for Reconsideration and/or Clarification of the First Report and Order., 266705=Abstract: The Twenty-First Century Communications and Video Accessibility Act of 2010 (“CVAA”) requires reinstatement of the video description rules adopted by the Commission in 2000. “Video description,” which is the insertion of narrated descriptions of a television program's key visual elements into natural pauses in the program's dialogue, makes video programming more accessible to individuals who are blind or visually impaired. This proceeding was initiated to enable compliance with the CVAA., 265037=Agency Contact: Diana Sokolow, Attorney, Policy Division, Federal Communications Commission, Media Bureau, 445 12th Street SW., Washington, DC 20554, Phone: 202 418-2120, Email: diana.sokolow@fcc.gov., 501728=Agency Contact: Lynne H. Engledow, Attorney, Federal Communications Commission, Wireline Competition Bureau, 445 12th Street SW., Washington, DC 20554, Phone: 202 418-1520, Fax: 202 418-1567, Email: lynne.engledow@fcc.gov., 458237=On July 10, 2006, the Commission published in the Federal Register notice that it had adopted on June 21, 2006, rules that make interim modifications to the existing approach for assessing contributions to the Federal universal service fund (USF or Fund) in order to provide stability while the Commission continues to examine more fundamental reform., 505823=[FR Doc. 2012-1664 Filed 2-10-12; 8:45 am], 249294=In a Further Notice issued in 2005, the Commission reexamined some of its rules governing the LPFM service, noting that the rules may need adjustment in order to ensure that the Commission maximizes the value of the LPFM service without harming the interests of full-power FM stations or other Commission licensees. The Commission sought comment on a number of issues with respect to LPFM ownership restrictions and eligibility., 144808=Agency Contact: Richard D. Smith, Special Counsel, Federal Communications Commission, Consumer and Governmental Affairs Bureau, 445 12th Street SW., Washington, DC 20554, Phone: 717 338-2797, Fax: 717 338-2574, Email: richard.smith@fcc.gov., 268200=Agency Contact: Lyle Elder, Attorney, Policy Division, Media Bureau, Federal Communications Commission, 445 12th Street SW., Washington, DC 20554, Phone: 202 418-2120, Email: lyle.elder@fcc.gov., 449970=The Commission also adopted a Second FNPRM seeking comment on two specific plans that propose establishing optional alternative regulation mechanisms for rate-of-return carriers. In conjunction with the consideration of those alternative regulation proposals, the Commission sought comment on modification that would permit a rate-of-return carrier to adopt an alternative regulation plan for some study areas, while retaining rate-of-return regulation for other of its study areas. Comments on the Second FNPRM were due on April 23, 2004, and May 10, 2004., 52934=Posted by Ben Jordi on June 22, 2015, 211549=Agency Contact: Howard Griboff, Deputy Chief, Federal Communications Commission, International Bureau, 445 12th Street SW., Washington, DC 20554, Phone: 202 418-0657, Fax: 202 418-1414, Email: howard.griboff@fcc.gov., 469258=Abstract: The Federal Communications Commission (Commission) is examining whether its existing rules governing the setting of tariffed rates by local exchange carriers (LECs) provide incentives and opportunities for carriers to increase access demand endogenously with the result that the tariff rates are no longer just and reasonable. The Commission tentatively concluded that it must revise its tariff rules so that it can be confident that tariffed rates remain just and reasonable even if a carrier experiences or induces significant increases in access demand. The Commission seeks comment on the types of activities that are causing the increases in interstate access demand and the effects of such demand increases on the cost structures of LECs. The Commission also seeks comment on several means of ensuring just and reasonable rates going forward. The NPRM invites comment on potential traffic stimulation by rate-of-return LECs, price cap LECs, and competitive LECs, as well as other forms of intercarrier traffic stimulation. Comments were received on December 17, 2007, and reply comments were received on January 16, 2008., 241014=Abstract: Congress has mandated that after February 17, 2009, full-power broadcast stations must transmit only in digital signals, and may no longer transmit analog signals. This proceeding is the Commission's third periodic review of the transition of the nation's broadcast television system from analog to digital television (DTV). The Commission conducts these periodic reviews in order to assess the progress of the transition and make any necessary adjustments to the Commission's rules and policies to facilitate the introduction of DTV service and the recovery of spectrum at the end of the transition. In this review, the Commission considers how to ensure that broadcasters complete construction of their final post-transition (digital) facilities by the statutory deadline., 183487=Agency Contact: Alan Stillwell, Deputy Chief, OET, Federal Communications Commission, Office of Engineering and Technology, 445 12th Street SW., Washington, DC 20554, Phone: 202 418-2925, Email: alan.stillwell@fcc.gov., 380655=On January 15, 2010, the Commission released a Report and Order that prohibits the distribution and sale of wireless microphones that operate in the 700 MHz Band (698-806 MHz, channels 52-69) and includes a number of provisions to clear these devices from that band. These actions help complete an important part of the DTV transition by clearing the 700 MHz Band to enable the rollout of communications services for public safety and the deployment of next generation wireless devices., 390439=Abstract: The Commission seeks comments on modifying its rules to authorize channels with bandwidths of as much as 30 MHz in the 6525-6875 MHz band. We also propose to allow conditional authorization on additional channels in the 21.8-22.0 and 23.0-23.2 GHz bands., 119142=Abstract: On July 3, 2003, the Commission released a Report and Order establishing, along with the FTC, a national do-not-call registry. The Commission's Report and Order also adopted rules on the use of predictive dialers, the transmission of caller ID information by telemarketers, and the sending of unsolicited fax advertisements., 462196=On February 21, 2008, the Commission published in the Federal Register notice that it sought comment on other changes to its LNP and numbering related rules, including whether to extend such rules to interconnected VoIP providers (73 FR 9507)., 402874=Agency Contact: Rodney P Conway, Engineer, Federal Communications Commission, Wireless Telecommunications Bureau, 445 12th Street SW., Washington, DC 20554, Phone: 202 418-2904, Fax: 202 418-1944, Email: rodney.conway@fcc.gov., 160307=The Office of Engineering and Technology (OET) and the Wireless Telecommunications Bureau (WTB) set forth the specific data that Broadband Radio Service (BRS) licensees in the 2150-2160/62 MHz band must file along with the deadline date and procedures for filing this data on the Commission's Universal Licensing System (ULS). The data will assist in determining future AWS licensee's relocation obligations., 367971=Abstract: This proceeding explores the possible uses of the 2155-2175 MHz frequency band (AWS-3) to support the introduction of new advanced wireless services, including third generations as well as future generations of wireless systems. Advanced wireless systems could provide for a wide range of voice data and broadband services over a variety of mobile and fixed networks., 494955=In the LNP Standard Fields Order, released on May 20, 2010, the Commission adopted standardized data fields for simple wireline and intermodal ports. The Order also adopts the NANC's recommendations for porting process provisioning flows and for counting a business day in the context of number porting., 448925=The Commission also adopted a Further Notice of Proposed Rulemaking (FNPRM) seeking additional comment on proposals for incentive regulation, increased pricing flexibility for rate-of-return carriers, and proposed changes to the Commission's “all-or-nothing” rule. Comments on the FNPRM were due on February 14, 2002, and reply comments on March 18, 2002., 192559=Abstract: In 1997, the Commission adopted service rules for the satellite digital audio radio service (SDARS) in the 2320-2345 MHz frequency band and sought further comment on proposed rules governing the use of complementary SDARS terrestrial repeaters. The Commission released a second further notice of proposed rulemaking in January 2008, to consider new proposals for rules to govern terrestrial repeaters operations. The Commission released a Second Report and Order on May 20, 2010, which adopted rules governing the operation of SDARS terrestrial repeaters, including establishing a blanket licensing regime for repeaters operating up to 12 kilowatts average equivalent isotropically radiated power., 141879=On August 28, 2009, the Commission released a Notice of Inquiry which asks questions about information available to consumers at all stages of the purchasing process for all communications services, including (1) choosing a provider; (2) choosing a service plan; (3) managing use of the service plan; and (4) deciding whether and when to switch an existing provider or plan., 140221=Agency Contact: Karen Peltz Strauss, Deputy Chief, Consumer and Governmental Affairs Bureau, Federal Communications Commission, 445 12th Street SW., Washington, DC 20554, Phone: 202 418-2388, Email: karen.strauss@fcc.gov., 121024=On January 22, 2010, the Commission released an NPRM proposing to require sellers and telemarketers to obtain express written consent from recipients before making prerecorded telemarketing calls, commonly known as “robocalls,” even when the caller has an established business relationship with the consumer. The proposals also, among other things, would require that prerecorded telemarketing calls include an automated, interactive mechanism by which a consumer may “opt out” of receiving future prerecorded messages from a seller or telemarketer., 165544=Agency Contact: Rodney Small, Economist, Federal Communications Commission, Office of Engineering and Technology, 445 12th Street SW., Washington, DC 20554, Phone: 202 418-2452, Fax: 202 418-1944, Email: rodney.small@fcc.gov., 329426=Agency Contact: Eric Ehrenreich, Attorney Advisor, Federal Communications Commission, 445 12th Street SW., Washington, DC 20554, Phone: 202 418-1726, Email: eric.ehrenreich@fcc.gov., 381186=On January 15, 2010, the Commission also released a Further Notice of Proposed Rulemaking seeking comment on the operation of low power auxiliary stations, including wireless microphones, in the core TV bands (channels 2-51, excluding channel 37). Among the issues the Commission is considering in the Further Notice are revisions to its rules to expand eligibility for licenses to operate wireless microphones under part 74; the operation of wireless microphones on an unlicensed basis in the core TV bands under part 15; technical rules to apply to low power wireless audio devices, including wireless microphones, operating in the core TV bands on an unlicensed basis under part 15 of the rules; and long term solutions to address the operation of wireless microphones and the efficient use of the core TV spectrum., 499549=On May 28, 1998, in the ETFS Order, the Bureau established July 1, 1998, as the date after which incumbent LECs would be required to use ETFS to file tariffs and associated documents. The Commission deferred consideration of establishing mandatory electronic filing for non-incumbent LECs until the conclusion of a proceeding considering the mandatory detariffing of interstate long distance services., 460232=On August 16, 2007, the Commission published in the Federal Register notice that it had adopted on August 2, 2007, an item amending the Commission's Schedule of Regulatory Fees by, inter alia, incorporating regulatory fee payment obligations for interconnected VoIP service providers, which shall become effective November 15, 2007, which is 90 days from date of notification to Congress., 190333=Agency Contact: Aamer Zain, Federal Communications Commission, 445 12th Street SW., Washington, DC 20554, Phone: 202 418-2437, Email: aamer.zain@fcc.gov., 343586=Christina Clearwater, Asst. Div. Chief, SCPD, WTB, Federal Communications Commission, Wireless Telecommunications Bureau, 445 12th Street SW., Washington, DC 20554, Phone: 202 418-1893, Email: christina.clearwater@fcc.gov., 173799=Agency Contact: Hugh Van Tuyl, Electronics Engineer, Federal Communications Commission, Office of Engineering and Technology, 445 12th Street SW., Washington, DC 20554, Phone: 202 418-7506, Fax: 202 418-1944, Email: hugh.vantuyl@fcc.gov., 459999=On August 7, 2007, the Commission published in the Federal Register a notice that a petition for reconsideration of the CPNI order described above had been filed., 119834=On April 5, 2006, the Commission adopted a Report and Order and Third Order on Reconsideration amending its facsimile advertising rules to implement the Junk Fax Protection Act of 2005. On October 14, 2008, the Commission released an Order on Reconsideration addressing certain issues raised in petitions for reconsideration and/or clarification of the Report and Order and Third Order on Reconsideration., 151933=Agency Contact: Eliot Greenwald, Consumer & Governmental Affairs Bureau, Federal Communications Commission, 445 12th Street SW., Washington, DC 20554, Phone: 202 418-2235, Email: eliot.greenwald@fcc.gov., 448090=Abstract: On October 11, 2001, the Commission adopted an Order reforming the interstate access charge and universal service support system for rate-of-return incumbent carriers. The Order adopts three principal reforms. First, the Order modifies the interstate access rate structure for small carriers to align it more closely with the manner in which costs are incurred. Second, the Order removes implicit support for universal service from the rate structure and replaces it with explicit, portable support. Third, the Order permits small carriers to continue to set rates based on the authorized rate of return of 11.25 percent. The Order became effective on January 1, 2002, and the support mechanism established by the Order was implemented beginning July 1, 2002., 461369=On December 6, 2007, OMB approved the public information collection pursuant to the Paperwork Reduction Act of 1995 for the Commission's CPNI rules (72 FR 72358)., 491935=Agency Contact: R. Matthew Warner, Attorney Advisor, Federal Communications Commission, 445 12th Street SW., Washington, DC 20554, Phone: 202 418-2419, Email: matthew.warner@fcc.gov., 463014=On May 15, 2008, the Commission's Consumer and Governmental Affairs Bureau (CGB) published in the Federal Register notice that it had granted interconnected VoIP providers an extension of time to route 711-dialed calls to an appropriate telecommunications relay service (TRS) center in certain circumstances (73 FR 28057). On July 29, 2009, CGB published notice in the Federal Register that it was granting another extension. (74FR 37624), 453765=Abstract: In a Notice of Proposed Rulemaking (NPRM) released on July 19, 2004, the Commission initiated a rulemaking proceeding to examine the proper number of end user common line charges (commonly referred to as subscriber line charges or SLCs) that carriers may assess upon customers that obtain derived channel T-1 service where the customer provides the terminating channelization equipment and upon customers that obtain Primary Rate Interface (PRI) Integrated Service Digital Network (ISDN) service., 235409=Abstract: The program access provisions of the Communications Act (sec. 628) generally prohibit exclusive contracts for satellite delivered programming between programmers in which a cable operator has an attributable interest (vertically integrated programmers) and cable operators. This limitation was set to expire on October 5, 2007, unless circumstances in the video programming marketplace indicate that an extension of the prohibition continues “to be necessary to preserve and protect competition and diversity in the distribution of video programming.” The October 2007 Report and Order concluded the prohibition continues to be necessary, and accordingly, retained it until October 5, 2012. The accompanying Notice of Proposed Rulemaking (NPRM) sought comment on revisions to the Commission's program access and retransmission consent rules. The associated Report and Order adopted rules to permit complainants to pursue program access claims regarding terrestrially delivered cable affiliated programming., 53573=Posted by Ben Jordi on June 4, 2015, 461612=On February 21, 2008, the Commission published in the Federal Register notice that the Commission adopted rules extending local number portability obligations and numbering administration support obligations to interconnected VoIP services. The Commission also explained it had responded to the District of Columbia Circuit Court of Appeals stay of the Commission's Intermodal Number Portability Order by publishing a Final Regulatory Flexibility Act (73 FR 9463; R 02/21/2008).}",
    "textBeforeTable": "Secretary, Federal Communications Commission. Marlene H. Dortch, Report and Order (R&O)—issued by the Commission to state a new or amended rule or state that the Commission rules and regulations will not be revised. Rulemaking (RM) Number—assigned to a proceeding after the appropriate bureau or office has reviewed a petition for rulemaking, but before the Commission has taken action on the petition. Memorandum Opinion and Order (MO&O)—issued by the Commission to deny a petition for rulemaking, conclude an inquiry, modify a decision, or address a petition for reconsideration of a decision. Further Notice of Proposed Rulemaking (FNPRM)— issued by the Commission when additional comment in the proceeding is sought. Notice of Proposed Rulemaking (NPRM)— issued by the Commission when it is proposing a specific change to Commission rules and regulations. Before any changes are actually made, interested parties may submit written comments on the proposed revisions. Notice of Inquiry (NOI)—issued by the Commission when it is seeking information on a broad subject or trying to generate ideas on a given topic. A comment period is specified during which all interested parties may submit comments. Docket Number— assigned to a proceeding if the Commission has issued either a Notice of Proposed Rulemaking or a Notice of Inquiry concerning the",
    "textAfterTable": "Rules and Regulations Implementing the Telephone Consumer Protection Act (TCPA) of 1991 (CG Docket No. 02-278) 3060-AI14 499 Rules and Regulations Implementing Section 225 of the Communications Act (Telecommunications Relay Service) (CG Docket No. 03-123) 3060-AI15 500 Consumer Information and Disclosure and Truth in Billing and Billing Format 3060-AI61 501 Closed Captioning of Video Programming (Section 610 Review) 3060-AI72 502 Accessibility of Programming Providing Emergency Information 3060-AI75 503 Empowering Consumers to Avoid Bill Shock (Docket No. 10-207) 3060-AJ51 Office of Engineering and Technology—Long-Term Actions Back to Top Sequence No. Title Regulation Identifier No. 504 New Advanced Wireless Services (ET Docket No. 00-258) 3060-AH65 505 Exposure to Radiofrequency Electromagnetic Fields 3060-AI17 506 Unlicensed Operation in the TV Broadcast Bands (ET Docket No. 04-186) 3060-AI52 507 Fixed and Mobile Services in the Mobile Satellite Service (ET Docket No. 10-142) 3060-AJ46 508 Innovation in the Broadcast Television Bands; ET Docket No. 10-235 3060-AJ57 509 Radio Experimentation and Market Trials Under Part 5 of the Commission's Rules and Streamlining Other Related Rules; ET Docket No. 10-236 3060-AJ62 510 Operation of Radar Systems in the 76-77 GHz Band; ET",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}