{
    "relation": [
        [
            "Team",
            "Rider",
            "Canisius",
            "Quinnipiac",
            "Siena",
            "Monmouth",
            "Marist",
            "Iona",
            "Fairfield",
            "Manhattan",
            "Niagara",
            "Saint Peter's"
        ],
        [
            "MAAC",
            "15-6",
            "16-8",
            "15-9",
            "13-8",
            "14-10",
            "12-12",
            "11-13",
            "9-15",
            "9-15",
            "8-16",
            "7-17"
        ],
        [
            "Pct.",
            ".714",
            ".667",
            ".625",
            ".619",
            ".583",
            ".500",
            ".458",
            ".375",
            ".375",
            ".333",
            ".292"
        ],
        [
            "Overall",
            "28-22",
            "34-30",
            "29-27",
            "23-28",
            "22-24",
            "19-27 -1",
            "20-33",
            "17-32",
            "18-34",
            "13-32 -2",
            "10-38 -1"
        ],
        [
            "Pct.",
            ".560",
            ".531",
            ".518",
            ".452",
            ".478",
            ".415",
            ".377",
            ".347",
            ".346",
            ".298",
            ".214"
        ]
    ],
    "pageTitle": "Siena's Dan Paolini Named 2010 MAAC Baseball Player of the Year - MAACSports.com - The Official Website of the Metro Atlantic Athletic Conference",
    "title": "",
    "url": "http://www.maacsports.com/ViewArticle.dbml?SPID=10443&DB_OEM_ID=17400&ATCLID=204950786",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 5,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988922.24/warc/CC-MAIN-20150728002308-00166-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 571947631,
    "recordOffset": 571911954,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{20925=Fairfield University's Anthony Hajjar was chosen as the 2010 MAAC Rookie of the Year.  Hajjar led all rookies in the league in hitting .380 (76-200) in his first season for the Stags.  He posted a .575 slugging percentage and a .429 on-base percentage in his rookie campaign.  Hajjar also recorded 37 runs scored, 46 RBI, 14 doubles, seven home runs and two triples., 22399=Fishkill, N.Y. - Siena College sophomore second baseman Dan Paolini has been named the 2010 MAAC Baseball Player of the Year and headlines the 2010 All-MAAC Teams, as voted on by the MAAC's head coaches., 21701=Rider University junior left-handed pitcher Mike Thomas has been selected as the 2010 MAAC Pitcher of the Year.  Thomas has an 8-2 record on the mound and a 3.19 ERA.  He has fanned 91 batters in 90.1 innings of work during the regular season, and has held opponents to a .247 batting average. , 21314=Manhattan College's John Soldinger earned the 2010 MAAC Relief Pitcher of the Year award.  Soldinger has recorded seven saves for the Jaspers this season.  He closed out the regular season with a 5-3 record and a 2.36 ERA.  The freshman right-handed hurler struck out 45 batters over 53.1 innings., 18329=2010 ALL-MAAC BASEBALL FIRST TEAM, 19077=Canisius College head coach Mike McRae has been named the 2010 Anaconda Sports MAAC Coach of the Year.  In his sixth season at the helm of the Golden Griffins' baseball program, McRae has led his squad to an overall record of 37-19 and a 19-5 mark in the MAAC, en route to winning the Regular Season title and the top seed in the 2010 MAAC Baseball Championship.  McRae previously won this award in 2008, and also in 2003 when he was the head coach at Niagara University.}",
    "textBeforeTable": "Baseball Championship Program Archive News Archive Record Book Information Archive Postseason History Championship History All-Time Standings All-Time All-MAAC Honors Tiebreaker Policy Players of the Week Standings Quick Links MAAC Baseball }(document, 'script', 'facebook-jssdk')); fjs.parentNode.insertBefore(js, fjs); js.src = \"//connect.facebook.net/en_US/all.js#xfbml=1\"; js = d.createElement(s); js.id = id; if (d.getElementById(id)) return; var js, fjs = d.getElementsByTagName(s)[0];",
    "textAfterTable": "Forgot Password?",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}