{
    "relation": [
        [
            "Crate Size",
            "X-Small",
            "Small",
            "Medium",
            "Intermediate",
            "Large",
            "X-Large"
        ],
        [
            "Series",
            "1000",
            "2000",
            "3000",
            "4000",
            "5000",
            "6000"
        ],
        [
            "Crate Dimensions",
            "19L x 12W x 14H inches",
            "24L x 18W x 19H inches",
            "30L x 19W x 21H inches",
            "36L x 23W x 25H inches",
            "42L x 28W x 30H inches",
            "48L x 30W x 32H inches"
        ],
        [
            "Product Weight",
            "9 lbs.",
            "15 lbs.",
            "18 lbs.",
            "26 lbs.",
            "67 lbs",
            "67 lbs."
        ],
        [
            "Weight Capacity",
            "10 lbs.",
            "25 lbs.",
            "40 lbs",
            "70 lbs.",
            "70 lbs.",
            "110 lbs."
        ]
    ],
    "pageTitle": "Precision ProValu Great Crate Single Door Dog Crate with FREE Pad - Dog Crates at Hayneedle",
    "title": "",
    "url": "http://www.hayneedle.com/product/precisionprovalugreatcratesingledoordogcratewithfreematblack.cfm",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 0,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986444.39/warc/CC-MAIN-20150728002306-00283-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 495561691,
    "recordOffset": 495510560,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{152422=Mar, 169103=2014, 146871=2015, 79548=About Precision Pet Products Precision Pet Products is an established and respected manufacturer supplying a wide variety of pet products to all facets of the pet industry since 1985. Located in Orange County, California, the Precision Pet Products team assures that their products are constructed from the strongest materials available and designed to withstand the wear and tear of the most active of pets and pet handlers., 163549=Jan, 169016=Dec, 189528=Nov, 146784=Apr}",
    "textBeforeTable": "The Precision ProValu Great Crate Single Door Dog Crate with FREE Pad gives you convenient access to your pet and a comfortable, safe place for him to stay. This wire cage features easy latches and rounded corners, and a plastic tray at the bottom that's easy to clean. The cage is electro-coated in black. It comes in a variety of sizes and assembled, so it's ready to set up and use!   Description Divider Panel What's Not Included Dog crate, faux sheepskin pad What's Included Several sizes available Rust-resistant finish FREE leak-proof ABS plastic pan included",
    "textAfterTable": "  About Precision Pet Products Precision Pet Products is an established and respected manufacturer supplying a wide variety of pet products to all facets of the pet industry since 1985. Located in Orange County, California, the Precision Pet Products team assures that their products are constructed from the strongest materials available and designed to withstand the wear and tear of the most active of pets and pet handlers. Videos Precision ProValu Great Crate Single Door Dog Crate with FREE Pad Learn more about the Great Crate Single Door Dog Crate in this video. Precision ProValu Great Crate Single Door Dog Crate with FREE Pad - Product Review Video",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}