{
    "relation": [
        [
            "Date",
            "Sep 1",
            "Sep 8",
            "Sep 15",
            "Sep 22",
            "Sep 29",
            "Oct 6",
            "Oct 13",
            "Oct 20",
            "Nov 3",
            "Nov 10",
            "Nov 17"
        ],
        [
            "Opponent",
            "Marist",
            "at Saint Francis U.",
            "Maine",
            "Duquesne",
            "at Wagner",
            "Albany",
            "Robert Morris",
            "at Monmouth",
            "Sacred Heart",
            "at Central Connecticut",
            "at Bucknell"
        ],
        [
            "Score",
            "L, 35-10",
            "L, 39-28",
            "L, 51-7",
            "L, 35-21",
            "L, 31-21",
            "L, 31-14",
            "W, 38-35",
            "W, 27-24",
            "W, 34-14",
            "W, 28-25",
            "L, 24-21"
        ],
        [
            "rec",
            "-",
            "-",
            "-",
            "-",
            "-",
            "-",
            "-",
            "-",
            "-",
            "-",
            "1"
        ],
        [
            "yds",
            "-",
            "-",
            "-",
            "-",
            "-",
            "-",
            "-",
            "-",
            "-",
            "-",
            "-7"
        ],
        [
            "y/r",
            "-",
            "-",
            "-",
            "-",
            "-",
            "-",
            "-",
            "-",
            "-",
            "-",
            "-7.0"
        ],
        [
            "lng",
            "-",
            "-",
            "-",
            "-",
            "-",
            "-",
            "-",
            "-",
            "-",
            "-",
            "0"
        ],
        [
            "td",
            "-",
            "-",
            "-",
            "-",
            "-",
            "-",
            "-",
            "-",
            "-",
            "-",
            "0"
        ],
        [
            "fum",
            "1",
            "1",
            "-",
            "-",
            "-",
            "-",
            "-",
            "-",
            "-",
            "1",
            "1"
        ],
        [
            "lost",
            "0",
            "1",
            "-",
            "-",
            "-",
            "-",
            "-",
            "-",
            "-",
            "1",
            "0"
        ]
    ],
    "pageTitle": "Mike Westerhaus - Bryant University Bulldogs",
    "title": "",
    "url": "http://www.bryantbulldogs.com/sports/fball/2012-13/bios/westerhaus%20mike%20df61",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 6,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988922.24/warc/CC-MAIN-20150728002308-00098-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 341283451,
    "recordOffset": 341259809,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{51414=As a junior: Put together one of the greatest offensive seasons for a quarterback in program history in his first year as a starter ... One of Bryant's six captains ... Started all 11 games, completing 167-of-327 passes for 2,384 yards, 19 touchdowns and 13 interceptions ... Set single-season program records for completions, attempts, yards, total offense and interceptions ... Led the NEC in touchdown passes and finished second in passing yards and average ... Became the first QB in Bryant history to throw for over 2,000 yards in a single season ... Recorded his best game of the season vs. Robert Morris (Oct. 13) ... Completed 22-of-35 for a program-record 350 yards and a program-record tying four touchdowns in Bryant's first victory of the year ... Followed that with a 321-yard performance against Monmouth (Oct. 20) the following week ... Eclipsed the 200-yard mark seven times during the season ... Threw for 251 yards and two scores vs. Sacred Heat (Nov. 3) ... Threw for 276 yards and two touchdowns vs. Duquesne (Sept. 22) ... Threw at least two touchdown passes in each of the final five games of the season., 53448=Before Bryant: Three-year starting quarterback for coach Biran Harvey ... Led team to first playoff appearance in 2008 ... Threw for 1,257 yards and 62.3 completion percentage plus 12 touchdowns ... Named All-League and All-Long Island Honorable Mention .. .Team Offensive MVP ... Single season leader in passing ... Three varsity letters in baseball earning Suffolk All-Star honors as a pitcher ... Volunteer member of the school's food drive and DECA Business Club. Personal: Son of Ray and Angela Westerhaus ... Born March 30, 1992 in Stony Brook, N.Y., 52605=As a sophomore: Appeared in four games and started two in place of the injured Mike Croce ... Finished the season 25-of-46 for 300 yards and two touchdowns ... Started his first career game against Maine on Sept. 3 ... Threw for 194 yards on 15-of-32 passing and threw two interceptions agains the Black Bears ... Earned his first-career victory on Sept. 10, leading the Bulldogs to a comeback victory over AIC, 27-16 ... Completed 10-of-13 passes for 106 yards and two touchdowns, including what proved to be the game-winning touchdown pass to Matt Tracey with 3:51 to play ... Named the Northeast Conference Rookie of the Week for his efforts against the Yellow Jackets., 210911=© 2012 Bryant University | All Rights Reserved 1150 Douglas Pike, Smithfield, RI 02917 sportcom@bryant.edu}",
    "textBeforeTable": "Mike Westerhaus 12 12 Related Bios Antione Hudson Shavoy Lawrence Elliott Sulkis Jeremy Woodson Gore Simervil Keaon Hobson Michael Perry Jordan Brown Dujuan Heath John Abutu Chad Ward Raamah Vaughn Matt Roncaioli Kyle Jennings Devin O'Connor Karl Sery Anthony Bolliter Ricardo McCray Kevin Gebon Jordan Harris Brian Testorf Tyriq DeShields Bobby Rutland Charles Wingate Mike Bennett Michael Johnson Brandon Dagnesses Brendan Murphy Sebastian Amedee Issac Whitworth Patrick Armenti Danny Basil Aaron Dixon Joe Usher Joe Foderaro Max Machado Sam Sammons Ryan Black Eloma Johnson Dominick Mitchell Dom Kozlowski Connor Champlin Ryan Ferguson Robert Ingebresten Jordan Horne Taylor Janoskie Brian Taylor Eric Pedroli Mark Hinkley Adrian Simpson Ian Bonner Ryan Caruso Colin Sullivan Alex Damore Robert Wallace Maduka Nwanekezi Dale Codrington Douglas Flink Justin Robinson-Howe Bryan Egolum Matt Lentz Ryan Schermerhorn Jordan Kelly Abe M'Bodj Ben Zats Paul Taylor Tyler Cardoze Jeffrey Synan Marko Piedmont Connor McNamara Charles Argast",
    "textAfterTable": "Yards 2384 1867 Yards per game 216.7 233.4 Yards per attempt 7.3 7.9 Touchdowns 19 17 Interceptions 13 11 Sacks 29 23 Yards lost 191 149 Passing Rushing Receiving Kicking Punting Returns All-Purpose Scoring Defense Date Opponent Score comp att pct yds y/a td int sac yds Sep 1 Marist L, 35-10 19 39 48.7% 212 5.4 0 0 1 6 Sep 8 at Saint Francis U. L, 39-28 10 24 41.7% 128 5.3 2 3 1 10 Sep 15 Maine",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}