{
    "relation": [
        [
            "Sun",
            "",
            "6",
            "13 Three Premieres by Acclaimed French Choregrapher Myriam Gourfink Three Premieres by Acclaimed French Choregrapher Myriam Gourfink",
            "20 Eat, Drink, DOULA! Little,Big Show",
            "27 5th Annual Chili Cook - off One Mighty Ugly Backpack Presents: One Year Anniversary Fest Weekend - Act Two!"
        ],
        [
            "Mon",
            "",
            "7",
            "14",
            "21",
            "28"
        ],
        [
            "Tue",
            "1 Boulevard Tavern's New Year's Eve Bash!",
            "8 Ronny Moo's World Tour / Record Night / Tuesdays at Adelina's",
            "15 Diaper Free In NY: Elimination Communication Meetup",
            "22 DRINK - N - DRAW TUESDAYS @ TNT",
            "29 Practically Pregnant: Info Night DRINK - N - DRAW TUESDAYS @ TNT The Masters of Social Gastronomy: One Year Anniversary! See More"
        ],
        [
            "Wed",
            "2",
            "9",
            "16",
            "23 Heavy Metal Lazer Plane: a comedy show",
            "30 Bernadette Mayer Benefit Reading"
        ],
        [
            "Thu",
            "3 Funky Warsaw",
            "10",
            "17",
            "24 WILD YAKS - UNSTOPPABLE DEATH MACHINES - HABIBI - VIOLENT BULLSHIT - KEN SOUTH ROCK - DJ DIRTYFINGER Big Easy Express LIVE BOSSA NOVA MUSIC AT ADELINA'S",
            "31 Brooklyn Label Winter Menu Kick - Off Party with FREE Samples Comics by C.F."
        ],
        [
            "Fri",
            "4 DJ Night with Pumpkin Patch Fitzgerald Jewelry Presents: From Cairo to Williamsburg Friday January 4, 2013 – First Friday Night Dinner of See More",
            "11 Fitzgerald Jewelry Presents: From Cairo to Williamsburg Willypoint Food Co - Op We're Starting a Movement Party! Three Premieres by Acclaimed French Choregrapher Myriam Gourfink See More",
            "18 Fitzgerald Jewelry Presents: From Cairo to Williamsburg Free Live Local Music at Milk and Roses BLUES CONTROL, SIGHTINGS, 1 - 800 - BAND @ COZY ROYALE!",
            "25 Fitzgerald Jewelry Presents: From Cairo to Williamsburg MOON CASALE Album Release w/The Sparrow, Jo Schornikow, Scott Rudd, and Paloma Gil Free Live Local Music at Milk and Roses See More",
            ""
        ],
        [
            "Sat",
            "5 DJ Night with Pumpkin Patch Greenpoint Hand Skills Presents :: Handmade Calendars",
            "12 Three Premieres by Acclaimed French Choregrapher Myriam Gourfink Three Premieres by Acclaimed French Choregrapher Myriam Gourfink Hello Phones play @ The Gutter See More",
            "19 Get the 411 on Childcare Little,Big Show",
            "26 One Mighty Ugly Backpack Presents: One Year Anniversary Fest Weekend - Act Two! Birthday Bash Dance Party @ t.b.d. Brooklyn!",
            ""
        ]
    ],
    "pageTitle": "Events | Greenpointers",
    "title": "",
    "url": "http://greenpointers.com/events/?dID=20130104",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 0,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988922.24/warc/CC-MAIN-20150728002308-00062-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 110187340,
    "recordOffset": 110179138,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "February Submit Your Event December Weekly View January 2013 Search Search for: blogroll shopping services restaurants pizzerias/take-out pets music/venues health/beauty fitness/wellness community cafe/deli/bakery bars art/galleries Directory Submit an Event Calendar What’s Happening? Events Style/Shopping",
    "textAfterTable": "About News Eat & Drink Culture Events Directory © 2015 Greenpointers website by Command C",
    "hasKeyColumn": true,
    "keyColumnIndex": 3,
    "headerRowIndex": 0
}