{
    "relation": [
        [
            "–",
            "Bag 1",
            "Bag 2",
            "Bag 3",
            "Bag 4",
            "Bag 5",
            "Bag 6",
            "Bag 7",
            "Bag 8",
            "Loose coins",
            "Hoard total"
        ],
        [
            "Silver radiates",
            "3737",
            "84",
            "2668",
            "2270",
            "747",
            "24",
            "20",
            "5",
            "–",
            "–"
        ],
        [
            "Bronze radiates",
            "44",
            "2947",
            "97",
            "6",
            "15",
            "0",
            "386",
            "247",
            "–",
            "–"
        ],
        [
            "Dinarii",
            "22",
            "2",
            "8",
            "26",
            "13",
            "1771",
            "0",
            "1",
            "–",
            "–"
        ],
        [
            "Total",
            "3803",
            "3033",
            "2773",
            "2302",
            "775",
            "1795",
            "406",
            "253",
            "2437",
            "17577"
        ],
        [
            "Date of latest coin (AD)",
            "272–274",
            "272–274",
            "271–274",
            "260–269",
            "260–269",
            "253–260",
            "272",
            "272–274",
            "–",
            "–"
        ]
    ],
    "pageTitle": "Beau Street Hoard - Wikipedia, the free encyclopedia",
    "title": "",
    "url": "http://en.wikipedia.org/wiki/Beau_Street_Hoard",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 1,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986444.39/warc/CC-MAIN-20150728002306-00257-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 80911296,
    "recordOffset": 80895628,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{7486=The Beau Street Hoard is the largest hoard ever found in the UK by a professional archaeologist.[8] The coins were found fused together into a large block.[8] It was secreted under the floor of a Roman building near the face of a masonry wall, within a small oval pit measuring about 40 cm × 30 cm (16 in × 12 in). The find's location makes it highly unusual, as hoards more typically come from rural locations.[4] It was thought initially that the hoard comprised up to 30,000 coins but the estimated number was subsequently reduced to around 17,400. The hoard appears to have been deposited towards the end of the 3rd century AD; coins spanning a period from 32 BC to 274 AD have been identified by British Museum conservators.[1], 5697=It was discovered in 2008 by archaeologists from Cotswold Archaeology on the site of what is to be a new pool for the Gainsborough Hotel and Thermal Spa.[4][5] The Grade II listed building was constructed in the 1820s by John Pinch the elder as the Bath United Hospital and later became part of Bath Technical College.[6] The site is approximately 150 metres (490 ft) from the Roman Baths and site of the original Temple of Minerva. The site had been excavated by James Irvin in the 1860s when the building had been expanded for a hospital extension by the architectural firm of George Phillips Manners and John Elkington Gill. Irvin had discovered a roman bathing complex with a hypocaust floor, on the site, but it is not known whether this was a private villa or public facility.[7], 17612=In March 2014 a grant of £372,500 was made by the Heritage Lottery Fund to enable the purchase of the hoard which will be on display at the Roman Baths from January 2015.[15], 17106=The Roman Baths Museum has launched a campaign to raise the money needed to buy the hoard. The museum's bid is being supported by the Heritage Lottery Fund and it is intended that a full catalogue of the finds will be published during 2013.[1], 2720=The Beau Street Hoard, found in Bath, Somerset, is the fifth-largest hoard ever found in Britain and the largest ever discovered in a British Roman town. It consists of an estimated 17,500 silver Roman coins dating from between 32 BC and 274 AD.[1][2] The hoard was found on Beau Street about 150 metres (490 ft) from the town's Roman Baths, built when Bath was a Roman colony known as Aquae Sulis.[3]}",
    "lastModified": "Sat, 25 Jul 2015 10:24:18 GMT",
    "textBeforeTable": "The specific contents of each bag were:[13] Three bags of debased (low-silver) radiates from the 3rd century, dating up to the 270s, consisting of coins which had been heavily debased (in some cases so much so that they were mostly bronze rather than silver).[1] Four bags of high-silver radiates from the 3rd century, dating up to the 260s. One bag of denarii dating from 32 BC to the 240s AD (the oldest being a coin issued by Mark Antony that was already 300 years old at the time of its deposition), plus a handful of radiates from the 250s. The most recent denarius was issued by Gordian III. The bags contained the following: Items discovered[edit] When the hoard was discovered it was believed that it had been deposited in a wooden box which had since rotted away.[9] The position of the hoard was recorded and then placed into a wooden crate as a single block so that it could be lifted out intact by a crane for later examination at the British Museum.[10] X-ray analysis of the block of coins by Southampton University found that the coins had been stored in a number of leather bags.[11] Six bags were visible",
    "textAfterTable": "Interpretation[edit] It is not known why it was buried but the period was one of great turmoil,[3] known as the Crisis of the Third Century, in which the Roman Empire nearly collapsed as Britain and Gaul broke away to form the short-lived Gallic Empire. There were 25 emperors in only 50 years.[9] Such hoards are thought to have been deposited with the intention of being recovered later once the troubles had passed, but for whatever reason the owners were unable to do so.[4] Nor is it known whether the hoard was deposited in one go in the 270s or whether it might have been built up over time. It appears to have been amassed over a period of several decades, perhaps being redeposited from somewhere else. The hoard represented a substantial amount of value, though the rampant inflation of the time would have eroded its worth rapidly. In the 230s it would have been equivalent to about the same as a year's pay for 18 Roman legionaries, but by 301 it would only have been the equivalent of two soldiers' annual salaries.[1] The find has been declared treasure trove and is estimated to be worth £150,000, though a formal valuation has yet to take place.[3] The British Museum",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}