{
    "relation": [
        [
            "Citing Patent",
            "US7636670 *",
            "US7711613 *",
            "US7908164 *",
            "US8046276 *",
            "US8055522 *",
            "US8112300 *",
            "US8170908 *",
            "US8965549 *",
            "US9043221",
            "US20040078253 *",
            "US20040103018 *",
            "US20140046467 *"
        ],
        [
            "Filing date",
            "Oct 17, 2002",
            "Dec 23, 2002",
            "Aug 9, 2005",
            "Feb 12, 2008",
            "Mar 4, 2008",
            "Apr 12, 2006",
            "",
            "Oct 14, 2013",
            "May 1, 2012",
            "Oct 17, 2002",
            "Nov 27, 2002",
            "Oct 14, 2013"
        ],
        [
            "Publication date",
            "Dec 22, 2009",
            "May 4, 2010",
            "Mar 15, 2011",
            "Oct 25, 2011",
            "Nov 8, 2011",
            "Feb 7, 2012",
            "May 1, 2012",
            "Feb 24, 2015",
            "May 26, 2015",
            "Apr 22, 2004",
            "May 27, 2004",
            "Feb 13, 2014"
        ],
        [
            "Applicant",
            "Sap Aktiengesellschaft",
            "Ricoh Company, Ltd.",
            "SignalDemand, Inc.",
            "Ricoh Company, Ltd.",
            "International Business Machines Corporation",
            "Air Liquide Large Industries U.S. Lp",
            "Vaughan Jr John Thomas",
            "Jda Software Group, Inc.",
            "John Thomas Vaughan, Jr.",
            "Woehler Christian Farhad",
            "Kim Edward D.",
            "Jda Software Group, Inc."
        ],
        [
            "Title",
            "Method and computer program product that determine values of characteristic value combinations for use in the production of products",
            "System and method, and computer program for managing product reserve",
            "Spot market profit optimization system",
            "System and method for managing product reserve",
            "Method, system, and storage medium for facilitating excess inventory utilization in a manufacturing environment",
            "Production optimizer for supply chain management",
            "Apparatus and method for processing agricultural materials and changing the proportions of output materials",
            "Continuous production planning using a transition matrix",
            "Method and apparatus for processing agricultural materials and changing the proportions of output materials",
            "Determining values for characteristic value combinations",
            "Methods and systems for demand forecasting of promotion, cannibalization, and affinity effects",
            "Continuous Production Planning Using a Transition Matrix"
        ]
    ],
    "pageTitle": "Patent US7117164 - System and method of demand planning for intermediate and by-products - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US7117164?dq=%235,519,867",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 7,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438043062635.98/warc/CC-MAIN-20150728002422-00130-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 474203163,
    "recordOffset": 474179448,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Patent Citations Although the present invention has been described with several embodiments, a number of changes, substitutions, variations, alterations, and modifications may be suggested to one skilled in the art, and it is intended that the invention encompass all such changes, substitutions, variations, alterations, and modifications that fall within the spirit and scope of the appended claims. illustrates an exemplary method 500 for identifying predicted demand for a by-product. The method 500 begins at step 502, where system 100 determines a quantity of the by-product that will be produced during production of the end product at step 502. This may include, for example, demand server 108 using manufacturing information 120 and the predicted demand for the end product to determine the amount of the by-product that will be produced. At step 504, system 100 determines a quantity of the by-product that will be produced during production of at least a portion of the excess intermediate product. This may include, for example, demand server 108 using manufacturing information 120 and the predicted amount of excess intermediate product to determine the amount of the by-product that will be produced. System 100 determines a total quantity of the by-product that will be produced by manufacturer 102 at step 506. This may include, for example, demand server 108 summing the first amount determined at step 502 and the second amount determined at step 504. The value represents the total amount",
    "textAfterTable": "US6535773 * Apr 17, 1998 Mar 18, 2003 Hitachi, Ltd. Device and method for calculating required quantity of material US6611726 * Sep 15, 2000 Aug 26, 2003 Carl E. Crosswhite Method for determining optimal time series forecasting parameters US6865542 * Jan 29, 2002 Mar 8, 2005 Thomas L. Cox Method and system for accurately forecasting prices and other attributes of agricultural commodities US20020072956 * Oct 5, 2001 Jun 13, 2002 Willems Sean P. System and method for determining the optimum configuration strategy for systems with multiple decision options US20020169657 * Oct 29, 2001 Nov 14, 2002 Manugistics, Inc. Supply chain demand forecasting and planning US20020188499 * Oct 29, 2001 Dec 12, 2002 Manugistics, Inc. System and method for ensuring order fulfillment * Cited by examiner Non-Patent Citations",
    "hasKeyColumn": true,
    "keyColumnIndex": 3,
    "headerRowIndex": 0
}