{
    "relation": [
        [
            "Citing Patent",
            "US5125841 *",
            "US5538426 *",
            "US5559063 *",
            "US6056547 *",
            "US6283752",
            "US6488501",
            "US6666684 *",
            "US6905336",
            "US7632095",
            "US7632096 *",
            "US8002547",
            "US8282395 *",
            "US8905757",
            "US20050019728 *",
            "US20110008752 *",
            "EP0727193A1 *",
            "EP0808609A2 *",
            "WO1993020774A1 *",
            "WO2001085048A2 *",
            "WO2004100822A2 *"
        ],
        [
            "Filing date",
            "Jan 16, 1991",
            "Apr 16, 1993",
            "Jul 12, 1995",
            "Mar 5, 1997",
            "Jul 13, 1999",
            "Jun 1, 1999",
            "May 1, 2000",
            "Jul 23, 2002",
            "Aug 13, 2007",
            "Oct 18, 2004",
            "May 3, 2004",
            "Sep 21, 2010",
            "Dec 3, 2012",
            "May 20, 2004",
            "Sep 21, 2010",
            "Feb 16, 1996",
            "Apr 15, 1993",
            "Apr 15, 1993",
            "May 1, 2001",
            "May 10, 2004"
        ],
        [
            "Publication date",
            "Jun 30, 1992",
            "Jul 23, 1996",
            "Sep 24, 1996",
            "May 2, 2000",
            "Sep 4, 2001",
            "Dec 3, 2002",
            "Dec 23, 2003",
            "Jun 14, 2005",
            "Dec 15, 2009",
            "Dec 15, 2009",
            "Aug 23, 2011",
            "Oct 9, 2012",
            "Dec 9, 2014",
            "Jan 27, 2005",
            "Jan 13, 2011",
            "Aug 21, 1996",
            "Nov 26, 1997",
            "Oct 28, 1993",
            "Nov 15, 2001",
            "Nov 25, 2004"
        ],
        [
            "Applicant",
            "Nobelpharma Ab",
            "Stewart Peter Harding",
            "Whip Mix Corporation",
            "Medentech, Inc.",
            "Nobel Biocare Ab",
            "Osteo-Ti Ltd",
            "Curtis D. Names",
            "Robert Summers",
            "Biomet 3I, Inc.",
            "Gittleman Neal B",
            "Biomet 3I Llc",
            "Pure Dental Logic Inc.",
            "E. Kats Enterprises Ltd.",
            "Acom S.R.L.",
            "Implant Ingenuity Inc.",
            "Dentsply International, Inc.",
            "Asher, George Brian",
            "George Brian Asher",
            "Curtis D Names",
            "Bruno Bompard"
        ],
        [
            "Title",
            "Impression top",
            "Method of forming a dental prosthesis for mounting in an implant, a method of forming a dental model for use therein, a dental formation mounting arrangement",
            "Refractory material",
            "Impression and foundation system for implant-supported prosthesis",
            "Universal impression coping system",
            "Transfer jig for dental implants and method for making a model",
            "Impression and foundation system for implant-supported prosthesis",
            "Impression support system for dental implants",
            "Method for forming a dental prosthesis",
            "Rotating winged low profile impression transfer cap",
            "Preparation coping for creating an accurate permanent post to support a final prosthesis and method for creating the same",
            "Method of installing a prosthesis in a jawbone of a patient",
            "Method and apparatus for measuring a location and orientation of a plurality of implants",
            "Method for the manufacture of dental prosthesis frameworks of the type screwed to a plurality of osteo-integrated implants in the mandibular or maxillary bone",
            "Method of installing a prosthesis in a jawbone of a patient",
            "Universal precision dental transfer for endosseous implants",
            "A range of dental prosthesis mounting cores",
            "Method of forming a dental prosthesis for mounting in an implant",
            "Impression and foundation system for implant-supported prosthesis",
            "Method and means which are used for the production of a support bar for prosthetic teeth"
        ]
    ],
    "pageTitle": "Patent US5055047 - Metal impression confirmation system for dental implants - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US5055047?dq=5920316",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 7,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987174.71/warc/CC-MAIN-20150728002307-00291-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 472043119,
    "recordOffset": 472019185,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{15375=Osseointegrated dental implants, an alternative to a single tooth, fixed bridge or removable dentures, have been developed as the result of the discovery by Dr. Branemark in Sweden of the ability of bone to make direct biological attachment to the surfaces of titanium implants. (See \"Dental Implants: Tissue-Integrated Prosthesis Utilizing the Osseointegration Concept\" published in the Mayo Clinic Proceedings, vol. 61 Feb. 1986, pp 91-97).}",
    "textBeforeTable": "Patent Citations As another example of modification, although the base in the Preferred Embodiment is cylindrical, a base having another shape, e.g., a rectangular block, could be used. Although the foregoing examples were illustrated by use with a Branemark implant, it will be understood that, with appropriate modification, the invention can be used with implants manufactured by other companies. The base must be modified to interface with the implant selected from those manufactured by the other companise. The essential feature of this invention is an elongated wing member with means for attaching one end of the wing to the implant such that the long dimension of the wing lies along the gum surface and thus provides that neighboring elements can be interconnected. Means other than the two piece element discussed above could include a one piece elongated element simply having a bore in the first end for inserting a guide pin. It should be understood that various modifications within the scope of this invention can be made by one of ordinary skill in the art without departing from the spirit thereof. In the foregoing paragraphs, a method for making an impression of a dental process with implants has been described which meet the objects of the invention. A rigid frame is constructed using an element attached to each implant and bonded to its neighboring element. The frame provides reinforcement of impression material molded to the frame and dental",
    "textAfterTable": "US8002547 May 3, 2004 Aug 23, 2011 Biomet 3I Llc Preparation coping for creating an accurate permanent post to support a final prosthesis and method for creating the same US8282395 * Sep 21, 2010 Oct 9, 2012 Pure Dental Logic Inc. Method of installing a prosthesis in a jawbone of a patient US8905757 Dec 3, 2012 Dec 9, 2014 E. Kats Enterprises Ltd. Method and apparatus for measuring a location and orientation of a plurality of implants US20050019728 * May 20, 2004 Jan 27, 2005 Acom S.R.L. Method for the manufacture of dental prosthesis frameworks of the type screwed to a plurality of osteo-integrated implants in the mandibular or maxillary bone US20110008752 * Sep 21, 2010 Jan 13, 2011 Implant Ingenuity Inc. Method of installing a prosthesis in a jawbone of a patient EP0727193A1 * Feb 16, 1996 Aug 21, 1996 Dentsply International, Inc. Universal precision dental transfer for endosseous implants EP0808609A2",
    "hasKeyColumn": true,
    "keyColumnIndex": 3,
    "headerRowIndex": 0
}