{
    "relation": [
        [
            "Date",
            "Feb 1, 1993",
            "Feb 12, 1997",
            "Apr 26, 2000",
            "Jan 4, 2001",
            "May 1, 2001",
            "Feb 21, 2003"
        ],
        [
            "Code",
            "FPAY",
            "FPAY",
            "AS",
            "AS",
            "FPAY",
            "AS"
        ],
        [
            "Event",
            "Fee payment",
            "Fee payment",
            "Assignment",
            "Assignment",
            "Fee payment",
            "Assignment"
        ],
        [
            "Description",
            "Year of fee payment: 4",
            "Year of fee payment: 8",
            "",
            "",
            "Year of fee payment: 12",
            ""
        ]
    ],
    "pageTitle": "Patent US4896458 - Door system with interlocking panels - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US4896458?ie=ISO-8859-1",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 8,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988840.31/warc/CC-MAIN-20150728002308-00082-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 467661780,
    "recordOffset": 467646133,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{17280=This is a continuation of application Ser. No. 197,956, filed May 24, 1988, now U.S. Pat. No. 4,819,383.}",
    "textBeforeTable": "Patent Citations Although particular embodiments have been chosen to illustrate the invention, it will be understood by those skilled in the art that various changes and modifications can be made therein without departing from the scope of the invention as defined in the appended claims. As an alternative to or in combination with the additional retaining means of FIG. 9, a staking operation can be performed on each tab 22, forming an indentation 110, as illustrated in FIG. 10. The tabs of one panel 12 or 14 are staked to the adjacent inner portion 42 of the other panel 14 or 12, after the two panels are assembled and tabs 22 have been folded over as illustrated in FIG. 10. These other retaining means engage the two panels and prevent lateral shifting of the panels to hold the door edges square with the door faces. To further ensure that hinge panel 12 and latch panel 14 are held in the proper relationship, the additional retaining means illustrated in FIG. 9 can be provided. The retaining means comprise at least one projection 106 formed in an outer portion 44 of hinge panel 12 and at least one mating opening 108 in an outer portion 44 of latch panel 14, equally spaced from the respective edges of the panels. Projection 106 is formed by making two parallel slits in the respective outer portion 44 and then deforming the material between",
    "textAfterTable": "US3455078 * Oct 19, 1966 Jul 15, 1969 American Welding Mfg Co Metal door and method of making US3512305 * Feb 20, 1968 May 19, 1970 Stanley Works Metal clad door US3633312 * Jun 12, 1970 Jan 11, 1972 American Welding Mfg Co Reinforced lock mounting US3786613 * Jun 9, 1972 Jan 22, 1974 Shepheard W Sheet metal door with foam plastic core US4327535 * Feb 21, 1980 May 4, 1982 Peachtree Doors, Inc. Door with glass panel US4438597 * Nov 27, 1981 Mar 27, 1984 Eljo Products, Inc. Adjustable hinge mount US4589240 * Sep 19, 1984 May 20, 1986 Raynor Manufacturing Company Foam core panel with interlocking skins and thermal break US4819383 * May 24, 1988 Apr",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}