{
    "relation": [
        [
            "Cited Patent",
            "US3791042 *",
            "US4253242 *",
            "US4557056 *",
            "US4565010 *",
            "SU1138647A1 *"
        ],
        [
            "Filing date",
            "Sep 13, 1971",
            "Jun 26, 1980",
            "Jun 29, 1983",
            "May 31, 1983",
            ""
        ],
        [
            "Publication date",
            "Feb 12, 1974",
            "Mar 3, 1981",
            "Dec 10, 1985",
            "Jan 21, 1986",
            ""
        ],
        [
            "Applicant",
            "Bell F",
            "Mcinerney Terrance M",
            "Sun Kim",
            "Herman Robert D",
            ""
        ],
        [
            "Title",
            "Pendulum type borehole deviation measuring apparatus",
            "Digital angle indicator",
            "Electronic angle indicator",
            "Electronic signaling level",
            "Title not available"
        ]
    ],
    "pageTitle": "Patent US4703315 - Level indicating device - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US4703315?ie=ISO-8859-1",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 5,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988840.31/warc/CC-MAIN-20150728002308-00329-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 474759131,
    "recordOffset": 474739873,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Patent Citations It will be apparent to those skilled in the art that various modifications and variations can be made in the level indicating device of the present invention, without departing from the scope or spirit of the invention. Thus, it is intended that the present invention cover the modifications and variations of this invention, provided they come within the scope of the appended claims and their equivalents. Moreover, the device of the present invention operates regardless of whether it is one of vertical exterior surfaces 14, 15 or horizontal exterior surfaces 12, 13, that is resting against the surface to be monitored by the operator. In other words, the device of the present invention is capable of indicating both a horizontal or a vertical condition of the device without requiring any adjustment of the device, such as the manual adjustment of the dial required of the device disclosed in Wright (U.S. Pat. No. 3,233,235) discussed above. In operation, one of the exterior surfaces, such as horizontal surfaces 12, 13 or vertical surfaces 14, 15 of housing 11 is placed against a surface which the operator of device 10 desires to monitor. For example, the operator can place the device at one end of a plank while raising or lowering the opposite end of the same plank at a considerable distance to the end where the device is resting. Assuming for purposes of this discussion that a vertical",
    "textAfterTable": "* Cited by examiner Referenced by Citing Patent Filing date Publication date Applicant Title US5083383 * May 2, 1991 Jan 28, 1992 Zircon International, Inc. Electronic capacitance level with automatic electrode selection US5180221 * Feb 4, 1991 Jan 19, 1993 Brant Yoder Apparatus and method for illuminating a liquid filled container US5574442 * Jul 11, 1994 Nov 12, 1996 Murata Manufacturing Co., Ltd. Inclination angle sensor US5920046 * Sep 1, 1998 Jul 6, 1999 Denso Corporation Inclination detector for vehicle capable of detecting inclination direction US5986559 * Sep 12, 1997 Nov 16, 1999 Rockwell International Corporation Infinitely adjustable position sensor with visual confirmation US6694631 * Feb 12, 2001 Feb 24, 2004 Black & Decker Inc. Alignment device utilizing components responsive to",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}