{
    "relation": [
        [
            "Date",
            "Apr 13, 1998",
            "Oct 1, 2002",
            "Jul 25, 2005",
            "Aug 2, 2005",
            "Jun 5, 2009",
            "Feb 21, 2013"
        ],
        [
            "Code",
            "AS",
            "CC",
            "AS",
            "FPAY",
            "FPAY",
            "FPAY"
        ],
        [
            "Event",
            "Assignment",
            "Certificate of correction",
            "Assignment",
            "Fee payment",
            "Fee payment",
            "Fee payment"
        ],
        [
            "Description",
            "Owner name: 1263152 ONTARIO INC., CANADA Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNORS:ENGELBRETH, DAN;MORTON, ROBERT;FOLEY, MARTIN;AND OTHERS;REEL/FRAME:009099/0019 Effective date: 19980324",
            "",
            "Owner name: TRUDELL MEDICAL INTERNATIONAL, CANADA Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNOR:1263152 ONTARIO INC.;REEL/FRAME:016561/0416 Effective date: 20010925",
            "Year of fee payment: 4",
            "Year of fee payment: 8",
            "Year of fee payment: 12"
        ]
    ],
    "pageTitle": "Patent US6345617 - Aerosol medication delivery apparatus and system - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US6345617?dq=6,163,776",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 9,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438043062635.98/warc/CC-MAIN-20150728002422-00297-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 469313871,
    "recordOffset": 469280257,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{58832=Among other things, the effect of high velocity contributes to a significant number of aerosol medication particles impacting and depositing in the patient's oropharynx and upper airway rather than continuing their pathway through the upper airway and into the lungs. Such impaction and deposition may result in a significant portion of the medication dose being systemically absorbed or ingested. As documented in the literature [J. L. Rau, “Respiratory Care Pharmacology”, 4th ed. (1994, Mosby) at pp. 256-261; K. Meeran, A. Hattersley, J. Burrin, R. Shiner, K. Ibbertson K., “Oral and Inhaled Corticosteroids Reduce Bone Formation as Shown by Plasma Osteocalcin Levels”, Am. J. Respir. Crit. Care Med 151:333-336], systemic absorption or ingestion of aerosol medication may cause a patient adverse side-effects, particularly when the aerosol medication is a corticosteroid. Some of these adverse side-effects include pharyngeal candidiasis, hoarseness, and adrenal suppression., 59850=The high velocity of the aerosol medication particles may also accentuate the difficulty of a significant number of patients, particularly the very young and elderly, to coordinate actuation of the pMDI with inhalation of the aerosol medication particles generated. Failure to coordinate the actuation and inhalation maneuvers and failure to inhale slowly, have been documented by the literature [S. P. Newman, “Aerosol Deposition Considerations in Inhalation Therapy” Chest/88/2/August, 1985/Supplement] as contributing to a significant reduction in the number of aerosol medication particles inspired and deposited in a patient's lungs.}",
    "textBeforeTable": "Patent Citations The invention may be embodied in other forms than those specifically disclosed herein without departing from its spirit or essential characteristics. The described embodiments are to be considered in all respects only as illustrative and not restrictive, and the scope of the invention is commensurate with the appended claims rather than the foregoing descriptions. The embodiment of FIGS. 21 and 22 may be used in a similar manner as the device disclosed in U.S. Pat. No. 5,012,804. The apparatus 710 may be positioned in the inspiratory flow path from the ventilator to the patient when the patient is initially placed on the ventilator. The apparatus 710 is then left in place until needed. Alternatively, the apparatus 710 may be positioned in the inspiratory flow path of the ventilator circuit just prior to when a dose of aerosol medication is to be delivered to a ventilated patient. A pMDI canister is positioned in the receptacle 722 and actuated. The medication from the pMDI canister is conveyed with the inspiratory flow from the ventilator to the patient. As in the previously described embodiments, the containment baffle 751 reduces on-axis non-respirable particles. Located at the downstream end 748 of the chamber 724 is a containment baffle 751. The containment baffle 751 may be located at the downstream end of the chamber housing 724 or along the extension 756. The containment baffle 751 includes an inhalation opening area 770 located",
    "textAfterTable": "Nov 7, 1977 Nov 20, 1979 Aktiebolaget Draco Device for use with medicinal inhalation devices US4292966 Feb 5, 1980 Oct 6, 1981 Aktiebolaget Draco Aerosol inhalation device US4470412 Mar 19, 1982 Sep 11, 1984 Trutek Research, Inc. Inhalation valve US4509515 * Feb 7, 1983 Apr 9, 1985 Fisons Plc Inhalation device US4637528 Jan 19, 1984 Jan 20, 1987 William H. Rorer, Inc. Articulated joint in aerosol medicament dispenser US4641644 * Sep 5, 1985 Feb 10, 1987 Aktiebolaget Draco Aerosol inhalation device US4796614 * Feb 26, 1987 Jan 10, 1989 Trutek Research, Inc. Collapsible inhalation valve US4846168 Dec 1, 1987 Jul 11, 1989 Mect Corporation Inhaler US4852561 * Jul 27, 1988 Aug 1, 1989 Sperry C R Inhalation device",
    "hasKeyColumn": true,
    "keyColumnIndex": 2,
    "headerRowIndex": 0
}