{
    "relation": [
        [
            "Date",
            "Jun 22, 1987",
            "Feb 1, 1989",
            "Apr 29, 1991",
            "Feb 1, 1993",
            "Sep 12, 1995",
            "Jan 31, 1997",
            "Jan 31, 2001"
        ],
        [
            "Code",
            "AS",
            "AS",
            "AS",
            "FPAY",
            "AS",
            "FPAY",
            "FPAY"
        ],
        [
            "Event",
            "Assignment",
            "Assignment",
            "Assignment",
            "Fee payment",
            "Assignment",
            "Fee payment",
            "Fee payment"
        ],
        [
            "Description",
            "Owner name: KENDALL COMPANY, THE, BOSTON, MASSACHUSETTS, A COR Free format text: ASSIGNMENT OF ASSIGNORS INTEREST.;ASSIGNOR:GROSS, JAMES R.;REEL/FRAME:004739/0631 Effective date: 19870618",
            "Owner name: MANUFACTURERS HANOVER TRUST COMPANY, AS AGENT Free format text: SECURITY INTEREST;ASSIGNOR:KENDALL COMPANY, THE;REEL/FRAME:005251/0007 Effective date: 19881027",
            "Owner name: MANUFACTURERS HANOVER TRUST COMPANY A CORPORATI Free format text: SECURITY INTEREST;ASSIGNOR:KENDALL COMPANY, THE A CORPORATION OF DELAWARE;REEL/FRAME:005681/0531 Effective date: 19910426",
            "Year of fee payment: 4",
            "Owner name: KENDALL COMPANY, THE, MASSACHUSETTS Free format text: RELEASE OF SECURITY INTEREST;ASSIGNOR:CHEMICAL BANK (THE SUCCESSOR BY MERGER WITH MANUFACTURER S HANOVER TRUST COMPANY);REEL/FRAME:007644/0328 Effective date: 19950102",
            "Year of fee payment: 8",
            "Year of fee payment: 12"
        ]
    ],
    "pageTitle": "Patent US4852563 - Multifunction connector for a breathing circuit - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US4852563?dq=5,815,488",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 8,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987174.71/warc/CC-MAIN-20150728002307-00339-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 477491703,
    "recordOffset": 477469786,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Patent Citations Thus there has been shown a breathing circuit system wherein a plurality of elements making up that system each have a mating array of lockable elements on each end thereof. Each lockable element alternates with respect to the particular end in that particular part of the system. Each component of the present invention will function satisfactorily with a nonlockable element of a component from a nonlockable system. That is to say even if the locking elements are not in use, the components will still frictionally engage one another in a manner that is common in the art because of their standard tapers. The present invention however includes the multiple safety backup locking arrangement permitting articulation of the particular components as well as a sampling port within any particular component which itself however necessitates the articulation of that component within the system. A similar circuit component is shown in FIG. 3, wherein a circuit component 60 is shown comprising a tubular member of linear configuration having a central conduit 61. The linear circuit component 60 has a locking clip 62 as described in the aforementioned embodiment shown in FIG. 2. The linear breathing circuit component 60 has a sampling port 64 extending into the hub of the component 60. The sampling port 64 has a cap 66 which mates over the top of the port so as to keep it sealed when the sampling port 64 is",
    "textAfterTable": "Action Technology Aquatic vacuum hose swivel cuff US4756670 * Oct 17, 1986 Jul 12, 1988 Andros Analyzers Incorporated Detecting method and apparatus using heat sensitive devices US4770445 * Apr 11, 1984 Sep 13, 1988 E. R. Squibb & Sons, Inc. Tube coupling US4774940 * Jun 15, 1983 Oct 4, 1988 Linder Gerald S Breathing circuit connector for use in anesthesiology US4787655 * Apr 24, 1986 Nov 29, 1988 The Kendall Company Airtight connection for breathing circuits US4905163 * Oct 3, 1988 Feb 27, 1990 Minnesota Mining & Manufacturing Company Intelligent optical navigator dynamic information presentation and navigation system DE2805416A1 * Feb 9, 1978 Sep 14, 1978 Gambro Ab Kupplungsvorrichtung GB1195896A * Title not available * Cited by examiner",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}