{
    "relation": [
        [
            "Date",
            "Dec 15, 1994",
            "Sep 30, 1997",
            "Sep 1, 1998",
            "May 22, 2000",
            "Apr 27, 2004",
            "May 29, 2008"
        ],
        [
            "Code",
            "AS",
            "CC",
            "CC",
            "FPAY",
            "FPAY",
            "FPAY"
        ],
        [
            "Event",
            "Assignment",
            "Certificate of correction",
            "Certificate of correction",
            "Fee payment",
            "Fee payment",
            "Fee payment"
        ],
        [
            "Description",
            "Owner name: SGS-THOMSON MICROELECTRONICS, S.R.L., ITALY Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNORS:GOLLA, CARLA MARIA;OLIVO, MARCO;REEL/FRAME:007300/0391 Effective date: 19941202",
            "",
            "",
            "Year of fee payment: 4",
            "Year of fee payment: 8",
            "Year of fee payment: 12"
        ]
    ],
    "pageTitle": "Patent US5581509 - Double-row address decoding and selection circuitry for an electrically ... - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US5581509?dq=7,177,838",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 8,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988840.31/warc/CC-MAIN-20150728002308-00175-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 485430223,
    "recordOffset": 485410382,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Patent Citations While various embodiments have been described in this application for illustrative purposes, the claims are not limited to these embodiments. Many modifications can be made to the structures shown and described herein that take advantage of the present invention and fall within the scope of the claims. For example, some circuits can be substituted for those disclosed and claimed herein to achieve this invention. This enable signal E is input to the redundancy circuit 7 to disable generating the signal DIS and to the row address decoding circuitry, as shown in FIG. 2. Any suitable circuit is acceptable to disable DIS, for example, a simple two input NOR gate with E and DIS as inputs is acceptable in the circuit 7, an RS flip-flop with E as the reset input, or many other simple logic combinations for E to prevent DIS from being generated even when a defective, row line address is on the ADD bus. The signal E is not generated during normal reading or writing, so the defective word lines are not addressed at these times. It is generated during preprogramming to permit preprogramming of the memory cells on a defective word line. Control circuitry 6 and redundancy circuitry 7 are known circuit elements in the prior art. According to the invention, such known circuitry 6 is modified slightly to generate, along with its standard preprogramming signals, a preprogramming enable signal E to indicate",
    "textAfterTable": "May 5, 1998 Sgs-Thomson Microelectronics S.R.L. EEPROM memory device with simultaneous read and write sector capabilities US5764587 * Jun 7, 1995 Jun 9, 1998 International Business Machines Corporation Static wordline redundancy memory device US5949713 * Jun 15, 1998 Sep 7, 1999 Stmicroelectronics, S.R.L. Nonvolatile memory device having sectors of selectable size and number US6021083 * Dec 5, 1997 Feb 1, 2000 Macronix International Co., Ltd. Block decoded wordline driver with positive and negative voltage modes US6184928 Apr 30, 1997 Feb 6, 2001 Eastman Kodak Company Method and apparatus for split shift register addressing * Cited by examiner Classifications U.S. Classification 365/200, 365/230.06, 365/185.09 International Classification G11C16/08, G11C8/12, G11C29/00, G11C17/00, G11C29/04, G11C16/06 Cooperative Classification",
    "hasKeyColumn": true,
    "keyColumnIndex": 2,
    "headerRowIndex": 0
}