{
    "relation": [
        [
            "Cited Patent",
            "US4010432 *",
            "US4263637 *",
            "US4412193 *",
            "US4521824 *",
            "US4574260 *",
            "US4578732 *",
            "US4595894 *"
        ],
        [
            "Filing date",
            "Oct 22, 1975",
            "Jun 14, 1977",
            "Sep 7, 1978",
            "Feb 13, 1984",
            "Dec 14, 1983",
            "Dec 14, 1983",
            "Apr 1, 1985"
        ],
        [
            "Publication date",
            "Mar 1, 1977",
            "Apr 21, 1981",
            "Oct 25, 1983",
            "Jun 4, 1985",
            "Mar 4, 1986",
            "Mar 25, 1986",
            "Jun 17, 1986"
        ],
        [
            "Applicant",
            "General Electric Company",
            "Square D Company",
            "Leviton Manufacturing Company, Inc.",
            "General Electric Company",
            "Square D Company",
            "Square D Company",
            "Leviton Manufacturing Co., Inc."
        ],
        [
            "Title",
            "Electrical receptacle equipped with ground fault protection",
            "Ground fault receptacle",
            "Resettable circuit breaker for use in ground fault circuit interrupters and the like",
            "Interrupter mechanism for a ground fault circuit interrupter",
            "Snap acting solenoid operated reset latch mechanism",
            "Ground fault circuit interrupter including snap-acting contacts",
            "Ground fault circuit interrupting system"
        ]
    ],
    "pageTitle": "Patent US4667263 - Ground fault module for ground fault circuit breaker - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US4667263?dq=5,987,610",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 5,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438043062635.98/warc/CC-MAIN-20150728002422-00026-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 474867591,
    "recordOffset": 474848829,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Patent Citations It has thus been shown that a ground fault circuit breaker subassembly consisting of the signal processor module and mechanical means for interacting with the circuit breaker operating mechanism as well as electrical means for interconnecting between the signal processor module and the circuit breaker terminals can be readily assembled within a ground fault module. The use of a single wire along with commerically available mechanically crimped plug-in electrical connectors greatly simplifies the assembly process and virtually eliminates the use of welds or soldered joints. This arrangement allows the components therein to be completely calibrated and tested before being connected to the ground fault module to complete the ground fault circuit breaker assembly. Although the ground fault module of the invention is described as being connected first with the signal processor module and then to the circuit breaker module, this is by way of example only. The circuit breaker module and ground fault modules could be preassembled prior to insertion of the signal processor module, if so desired. The completed ground fault module 37 is depicted in FIG. 3 with the cover 55 attached to the case 36 such that the terminal end 20 is exposed for electrical access and the wire turns 27 and exposed wire end 29 are readily accessible. As discussed earlier, the test button 54 extends below the ground fault module case 36 to within the circuit breaker module 60 which houses",
    "textAfterTable": "* Cited by examiner Referenced by Citing Patent Filing date Publication date Applicant Title US5095398 * Feb 12, 1990 Mar 10, 1992 Square D Company Electrical circuit breaker protection device US5293142 * Sep 11, 1992 Mar 8, 1994 Westinghouse Electric Corp. Ground fault circuit breaker with flat bus bars for sensing coils US5818671 * Oct 4, 1996 Oct 6, 1998 General Electric Company Circuit breaker with arcing fault detection module US5933306 * Jan 14, 1998 Aug 3, 1999 General Electric Company Circuit breaker with ground fault detection module US6128168 * Jan 14, 1998 Oct 3, 2000 General Electric Company Circuit breaker with improved arc interruption function US6141197 * Mar 10, 1998 Oct 31, 2000 General Electric Company Smart residential circuit breaker",
    "hasKeyColumn": true,
    "keyColumnIndex": 3,
    "headerRowIndex": 0
}