{
    "relation": [
        [
            "Citing Patent",
            "US6483830 *",
            "US6850770",
            "US8073445",
            "US8095136",
            "US8396478",
            "US8543653 *",
            "US8850005",
            "US20120124140 *",
            "EP1775981A1 *",
            "EP2247136A2 *",
            "WO2002093797A2 *",
            "WO2002093797A3 *"
        ],
        [
            "Filing date",
            "Oct 8, 1997",
            "May 17, 2001",
            "Sep 21, 2006",
            "Sep 7, 2010",
            "Nov 10, 2011",
            "Nov 11, 2010",
            "Sep 18, 2013",
            "",
            "Oct 13, 2005",
            "Oct 13, 2005",
            "Apr 19, 2002",
            "Apr 19, 2002"
        ],
        [
            "Publication date",
            "Nov 19, 2002",
            "Feb 1, 2005",
            "Dec 6, 2011",
            "Jan 10, 2012",
            "Mar 12, 2013",
            "Sep 24, 2013",
            "Sep 30, 2014",
            "May 17, 2012",
            "Apr 18, 2007",
            "Nov 3, 2010",
            "Nov 21, 2002",
            "Jun 3, 2004"
        ],
        [
            "Applicant",
            "Nokia Telecommunications Oy",
            "Nokia Corporation",
            "Mitsubishi Electric Corporation",
            "Mitsubishi Electric Corporation",
            "Mitsubishi Electric Corporation",
            "Sap Ag",
            "Sap Ag",
            "Ankur Bhatt",
            "Mitsubishi Electric Information Technology Centre Europe B.V.",
            "Mitsubishi Electric R&D Centre Europe B.V.",
            "Nokia Corp",
            "Nokia Corp"
        ],
        [
            "Title",
            "Data transmission method and base station system",
            "Transmit power control (TPC) pattern information in radio link (RL) addition",
            "Method for determining if a first cell managed by a first base station is neighbour of a second cell managed by a second base station",
            "Method for determining if a first cell managed by a first base station is neighbour of a second cell managed by a second base station",
            "First base station managing a neighboring condition and cell area operation of a cell area, and system for managing a neighboring condition and cell area operation of a cell area",
            "Systems and methods for business network management discovery and consolidation",
            "Systems and methods for business network management discovery and consolidation",
            "Systems and methods for business network management discovery and consolidation",
            "Method for determining if a first cell managed by a first base station is neighbour of a second cell managed by a second base station",
            "Method for determining if a first cell managed by a first base station is neighbour of a second cell managed by a second base station",
            "Transmit power control (tpc) pattern information in radio link (rl) addition",
            "Transmit power control (tpc) pattern information in radio link (rl) addition"
        ]
    ],
    "pageTitle": "Patent US6122262 - Protocol for self-adaptive intercommunication between fixed radio stations ... - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US6122262?ie=ISO-8859-1&dq=5359317",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 6,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988840.31/warc/CC-MAIN-20150728002308-00029-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 479786115,
    "recordOffset": 479765580,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{36014=As represented in FIG. 2a, the interconnection protocol forming the subject of the present invention consists in a step 1000 of assigning geographical coordinates to each fixed radio station of the cellular telephony network. The geographical coordinates may be coordinates in a three-dimensional space, for example, but in most cases this three-dimensional space x, y, z can be reduced to a two-dimensional space x, y without compromising the generality of the protocol forming the subject of the present invention., 38654=As represented in FIG. 2a, steps 1000 and 1001 actually correspond to a network initialization phase. The network initialization phase is then followed by a transmission phase, which consists in a step denoted 1002 subsequent to the aforementioned step 1001., 38221=As represented schematically and symbolically in FIG. 2a, it may be indicated that the step 1001 of forming a virtual-ring interconnection can advantageously consist in a step of determining the neighbouring stations, denoted 1001a, followed by a step 1001b consisting in correlating the coordinates of the neighbouring stations. Steps 1001a and 1001b will be described in further detail later in the description., 38932=Step 1002 consists in transmitting the management messages between neighbouring stations by means of the virtual-ring interconnection. Of course, the neighbouring stations are identified on the basis of the geographical coordinates on the virtual ring, identification of this type then making it possible to transmit management messages using self-adaptive intercommunication between all the neighbouring fixed radio stations in the network., 36804=The aforementioned step 1000 is then followed by a step 1001 consisting in forming a virtual-ring interconnection for any set of two successive fixed radio stations constituting neighbouring stations.}",
    "textBeforeTable": "Patent Citations Finally, it may be pointed out that the fineness of the spatial grid of the grid-type location network also makes it possible to vary the message processing load at each neighbouring fixed radio station, this processing load being associated with the communications between aforementioned neighbouring stations. Furthermore, as regards the identification of the stations using a grid-type network, it may be indicated that the repeat distance of the network can be defined as a function of the topology of the mobile radiotelephony network and, in particular, of the topology governing the set-up of the fixed radio stations. A description has thus been given of a protocol for interconnection between fixed radio stations of a cellular telephony network which makes it possible to transmit management messages for this network between these stations, this protocol being particularly efficient insofar as introducing the geographical coordinates of each station makes it possible to simplify and optimize the procedures such as the hand-over management, the incoming call management or the automatic assignment of radiotelephony resources for any set of neighbouring stations in question. At each neighbouring station, BFR1, BFR3, BFR4, this information then makes it possible to prevent the same resources, that is to say the same frequency as the one used by the future fixed radio station BFR2 and/or the corresponding time interval, from being used for the transaction with the radio transmitter/receiver ERR in question and in the application",
    "textAfterTable": "GB2290195A * Title not available WO1995035612A2 * Jun 13, 1995 Dec 28, 1995 Philips Electronics Nv Communication network * Cited by examiner Referenced by Citing Patent Filing date Publication date Applicant Title US6483830 * Oct 8, 1997 Nov 19, 2002 Nokia Telecommunications Oy Data transmission method and base station system US6850770 May 17, 2001 Feb 1, 2005 Nokia Corporation Transmit power control (TPC) pattern information in radio link (RL) addition US8073445 Sep 21, 2006 Dec 6, 2011 Mitsubishi Electric Corporation Method for determining if a first cell managed by a first base station is neighbour of a second cell managed by a second base station US8095136 Sep 7, 2010 Jan 10, 2012 Mitsubishi Electric Corporation Method for determining if a first cell managed by a first base station is",
    "hasKeyColumn": true,
    "keyColumnIndex": 3,
    "headerRowIndex": 0
}