{
    "relation": [
        [
            "Citing Patent",
            "US7339940 *",
            "US7594021 *",
            "US7835722 *",
            "US7899450",
            "US8090349",
            "US8340000",
            "US8515414",
            "US8520588 *",
            "US8713690 *",
            "US8751790",
            "US8774783 *",
            "US8971920 *",
            "US8971923 *",
            "US8983047",
            "US8984591",
            "US9002347",
            "US9043892",
            "US9088614",
            "US20040259551 *",
            "US20040259552 *",
            "US20090196218 *",
            "US20110145590 *",
            "US20120276869 *",
            "US20140045525 *",
            "US20140073347 *",
            "CN101983496B",
            "WO2010146541A1"
        ],
        [
            "Filing date",
            "May 18, 2001",
            "Apr 5, 2004",
            "Nov 4, 2004",
            "",
            "Nov 15, 2010",
            "Feb 23, 2009",
            "Jan 28, 2011",
            "Feb 1, 2008",
            "Feb 18, 2011",
            "Sep 14, 2012",
            "Jul 5, 2012",
            "Feb 27, 2013",
            "Oct 11, 2013",
            "Mar 20, 2014",
            "Dec 17, 2012",
            "Jul 30, 2013",
            "Mar 5, 2013",
            "Mar 7, 2014",
            "Apr 2, 2004",
            "Apr 5, 2004",
            "Feb 1, 2008",
            "",
            "Jul 5, 2012",
            "Oct 11, 2013",
            "Feb 27, 2013",
            "Jan 23, 2009",
            "Jun 15, 2010"
        ],
        [
            "Publication date",
            "Mar 4, 2008",
            "Sep 22, 2009",
            "Nov 16, 2010",
            "Mar 1, 2011",
            "Jan 3, 2012",
            "Dec 25, 2012",
            "Aug 20, 2013",
            "Aug 27, 2013",
            "Apr 29, 2014",
            "Jun 10, 2014",
            "Jul 8, 2014",
            "Mar 3, 2015",
            "Mar 3, 2015",
            "Mar 17, 2015",
            "Mar 17, 2015",
            "Apr 7, 2015",
            "May 26, 2015",
            "Jul 21, 2015",
            "Dec 23, 2004",
            "Dec 23, 2004",
            "Aug 6, 2009",
            "Jun 16, 2011",
            "Nov 1, 2012",
            "Feb 13, 2014",
            "Mar 13, 2014",
            "Mar 19, 2014",
            "Dec 23, 2010"
        ],
        [
            "Applicant",
            "Telefonaktiebolaget Lm Ericsson (Publ)",
            "Sony Corporation",
            "Research In Motion Limited",
            "Telecommunication Systems, Inc.",
            "Research In Motion Limited",
            "Sony Corporation",
            "Telecommunication Systems, Inc.",
            "Honeywell International Inc.",
            "Facebook, Inc.",
            "Facebook, Inc.",
            "Sybase 365, Inc.",
            "Qualcomm Incorporated",
            "Skyhook Wireless, Inc.",
            "Telecommunication Systems, Inc.",
            "Telecommunications Systems, Inc.",
            "Telecommunication Systems, Inc.",
            "Facebook, Inc.",
            "Telecommunications Systems, Inc.",
            "Sony Corporation",
            "Sony Corporation",
            "Honeywell International Inc.",
            "AOL, Inc.",
            "Sybase 365, Inc.",
            "Skyhook Wireless, Inc.",
            "Qualcomm Incorporated",
            "霍尼韦尔国际公司",
            "Opencode Systems O.O.D."
        ],
        [
            "Title",
            "Targeted messaging to end user terminal connected to a service node in a communications network",
            "Radio communication system, radio communication apparatus and method, and program",
            "System and method for over the air provisioning of a mobile communications device",
            "Cellular augmented radar/laser detection using local mobile network within cellular network",
            "System and method for over the air provisioning of a mobile communications device",
            "Radio communication system, radio communication apparatus and method, and program",
            "Cellular augmented radar/laser detection using local mobile network within cellular network",
            "Wireless system gateway cache",
            "Secure data exchange between data processing systems",
            "Secure data exchange based on request destination",
            "System and method for enhanced UAProfile management",
            "Enhanced LTE positioning protocol information transfer procedures for control plane LCS on LTE",
            "Methods of and systems for measuring beacon stability of wireless access points",
            "Index of suspicion determination for communications request",
            "Authentication via motion of wireless device movement",
            "Transmitter augmented radar/laser detection using local mobile network within a wide area network",
            "Secure data exchange",
            "User plane location services over session initiation protocol (SIP)",
            "Information communication system, information communication apparatus and method, and program",
            "Radio communication system, radio communication apparatus and method, and program",
            "Wireless system gateway cache",
            "Secure data exchange between data processing systems",
            "System and Method for Enhanced UAProfile Management",
            "Methods of and systems for measuring beacon stability of wireless access points",
            "Enhanced lte positioning protocol information transfer procedures for control plane lcs on lte",
            "Wireless system gateway cache",
            "Generic smart ussd client module embarked in a telecommunication terminal"
        ]
    ],
    "pageTitle": "Patent US7103018 - Method of and a network for handling wireless session protocol (WSP) sessions - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US7103018?dq=6,128,731",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 6,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988840.31/warc/CC-MAIN-20150728002308-00253-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 484650319,
    "recordOffset": 484625137,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{32025=The Session layer protocol family in the WAP architecture is called the Wireless Session Protocol, WSP. WSP provides the upper-level application layer of WAP with an interface for session services and management. One example of a session service is a connection-mode service that operates above a transaction layer protocol called Wireless Transport Layer (WTP), See also Wireless Application Protocol: Wireless Transport Protocol specification, version 30 Apr. 1998, by Wireless Application Protocol Transport Working Group., 32732=The Wireless Session Protocol comprises one protocol most suited for browsing applications (WSP/B). WSP/B provides HTTP 1.1 functionality and incorporates new features such as long-lived sessions, a common facility for data push, capability negotiation, and session suspend/resume. HTTP 1.1 is disclosed in Fielding, R., et. al., “Hypertext Transfer Protocol—HTTP/1.1”, RFC 2068, UC Irvine, January 1997. The protocols in the WSP family are optimized for low bandwidth bearer networks with relatively long latency., 36654=However, EP-1-0,851,696 uses the ID every time it retrieves a user PIN or user ID number. Thus, this procedure has to be repeated every time when the user sends a request to the server. This means that it will not be easier or faster when the user would like to establish another session. This is a major drawback since the cost for a call will then increase. Also, this document does not describe how it is possible to support different types of data formats/types, upon sending/receiving a request. One example of a data format/type supported by WAP is the MIME multipart format, which transports composite data objects (for example, multipart/mixed). See WAP WSP draft version 2 Apr. 1998, 7.4 Multipart data. WSP defines a compact binary form of the MIME multipart entity and the content type. Thus, there is a need to support different data formats of a WSP session, and to increase the speed to establish a session., 31221=The Wireless Application Protocol (WAP) is a result of continuous work to define an industry wide standard for developing applications over wireless communication networks. WAP is disclosed in the Wireless Application Protocol Architecture Specification; Version 30 Apr. 1998; by Wireless Application Protocol Architecture Working Group;}",
    "textBeforeTable": "Patent Citations The invention is not limited to the above described and in the drawing shown of an example of embodiments but can be varied within the scope of the appended claims. Once the communication terminal identification number has been stored, “STORE ID” 380, it can be possible for the communication terminal to initiate further sessions, by simply forwarding a request to the server which may include both an identification of the requested data and the communication terminal identification number received from the server. Then it would be possible for the server, upon reception of a request, to recall the header from the database memory which corresponds to the communication terminal identification number. If the identification of the terminal is not recognized, “ID UNKNOWN” 330, then the server upon receipt of the request generates a communication terminal identification number, “GENERATE ID” 350. Thereafter, the server stores the header associated with said communication terminal identification number, “STORE HEADER” 360. The server replies to the request by forwarding the requested data and the communication terminal identification number to the requesting communication terminal, “SEND REPLY+ID” 370. Finally, the communication terminal stores the communication terminal identification number in a memory, “STORE ID” 380. Thereafter, the user may choose to end the session, “END” 345. shows an example of the establishment of a session in accordance with the present invention. The session uses the Wireless Session Protocol, which is",
    "textAfterTable": "US9088614 Mar 7, 2014 Jul 21, 2015 Telecommunications Systems, Inc. User plane location services over session initiation protocol (SIP) US20040259551 * Apr 2, 2004 Dec 23, 2004 Sony Corporation Information communication system, information communication apparatus and method, and program US20040259552 * Apr 5, 2004 Dec 23, 2004 Sony Corporation Radio communication system, radio communication apparatus and method, and program US20090196218 * Feb 1, 2008 Aug 6, 2009 Honeywell International Inc. Wireless system gateway cache US20110145590 * Jun 16, 2011 AOL, Inc. Secure data exchange between data processing systems US20120276869 * Jul 5, 2012 Nov 1, 2012 Sybase 365, Inc. System and Method for Enhanced UAProfile Management US20140045525 * Oct 11, 2013 Feb 13, 2014 Skyhook Wireless, Inc. Methods of and systems for measuring beacon stability of wireless access points US20140073347",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}