{
    "relation": [
        [
            "Date",
            "Jun 2, 2000",
            "Jun 10, 2004",
            "Jun 27, 2008",
            "Aug 20, 2012",
            "Jan 9, 2013",
            "Feb 26, 2013"
        ],
        [
            "Code",
            "AS",
            "FPAY",
            "FPAY",
            "REMI",
            "LAPS",
            "FP"
        ],
        [
            "Event",
            "Assignment",
            "Fee payment",
            "Fee payment",
            "Maintenance fee reminder mailed",
            "Lapse for failure to pay maintenance fees",
            "Expired due to failure to pay maintenance fee"
        ],
        [
            "Description",
            "",
            "Year of fee payment: 4",
            "Year of fee payment: 8",
            "",
            "",
            "Effective date: 20130109"
        ]
    ],
    "pageTitle": "Patent US6172454 - FED spacer fibers grown by laser drive CVD - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US6172454?dq=3657699",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 10,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988840.31/warc/CC-MAIN-20150728002308-00053-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 485756251,
    "recordOffset": 485728652,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{31013=The pressure can be very low, i.e., much less than 1 bar, although higher pressures can be used to achieve faster growth rates, i.e., of up to 1100 microns per second for a small diameter (<20 microns) boron fiber., 22985=Cathode 21 may be formed on a backplate or it can be spaced from a separate backplate. In either event, cathode 21 and faceplate 24 are spaced very close together in a vacuum sealed package. In operation, there is a potential difference on the order of 1000 volts between conductive layers 12 and 26. Electrical breakdown must be prevented in the FED, while the spacing between the plates must be maintained at a desired thinness for high image resolution., 21512=This application is a divisional of application Ser. No. 08/773,022, filed Dec. 24, 1996, now U.S. Pat. No. 5,851,113, which is expressly incorporated herein by reference for all purposes., 34141=The aspect ratio, i.e., the ratio of the diameter to the height of the spacers, can be controlled precisely by the size of the laser spot and the distance of relative displacement of the spot and the spacer site on the substrate. The aspect ratio is preferably between 5:1 and 20:1, and more preferably about 10:1; in absolute figures, the spacer diameter should be about 20-25 microns, and the spacer height should be about 200-250 microns, the approximate distance between the faceplate and the cathode., 27078=Referring to FIGS. 2(a)-2(b), a method for growing a spacer on a substrate 40 is pictorially represented. In a chamber with appropriate gases, an energy beam, preferably a laser beam 42 from an argon laser or a Nd-YAG laser, is focused by a lens 44 to produce a focus spot 46 on a substrate 40. The laser provides heat at the spot to grow a rod with a chemical vapor deposition (CVD) process. Substrate 40 is moved relative to lens 44 to stimulate the CVD process to continue to grow spacer 48 outwardly from substrate 40. Laser-assisted CVD processes are described in more detail in Westberg, et al., “Proc. Transducers '91”, 1991; Boman, et al., “Helical Microstructures Grown By Laser-Assisted Chemical Vapour Deposition”, Micro Electro Mechanical Systems, 1992; and Wallenberger, “Rapid Prototyping Directly From the Vapor Phase”, Science, Mar. 3, 1995. These papers, which are incorporated herein by reference for all purposes, show generally that structures can be formed on a substrate using such a process.}",
    "textBeforeTable": "Patent Citations Having described a number of embodiments of the present invention, it should be apparent that other modifications can be made without departing from the scope of the invention as defined by the appended claims. In another embodiment, referring to FIGS. 9(a) and 9(b), a number of spacers can be made with an X-shaped cross section to help protect against shearing forces that are perpendicular to the elongated direction of the spacers. Furthermore, such spacers can be a formed in different ways at at different locations of the display. For example, the X-shaped spacers can have two orientations that are offset by 45? relative to each other. FIGS. 8(b) and 8(c) show spacers 130 and 132, respectively, with a T-shape and an inverted T-shape. All of these shapes help distribute forces by having one or more wider portions that can be formed by moving the spot in the x-y plane or with a larger spot and elongated portions along the direction perpendicular to the plates. Referring to FIGS. 8(a)-8(c), the present invention also includes a display device having a first plate 120 and a second plate 122 vacuum sealed close together in a package. To protect against forces from impacts against the display and particularly those directed along the direction of the elongated portion of the spacers, the spacers can be T-shaped or I-shaped to help distribute the force. To produce an I-shaped spacer, for example, and",
    "textAfterTable": "US4923421 Jul 6, 1988 May 8, 1990 Innovative Display Development Partners Method for providing polyimide spacers in a field emission panel display US4940916 Nov 3, 1988 Jul 10, 1990 Commissariat A L'energie Atomique Electron source with micropoint emissive cathodes and display means by cathodoluminescence excited by field emission using said source US5015912 * Jul 27, 1989 May 14, 1991 Sri International Matrix-addressed flat panel display US5070282 Dec 18, 1989 Dec 3, 1991 Thomson Tubes Electroniques An electron source of the field emission type US5136764 Sep 27, 1990 Aug 11, 1992 Motorola, Inc. Method for forming a field emission device US5151061 Feb 21, 1992 Sep 29, 1992 Micron Technology, Inc. Method to form self-aligned tips for flat panel displays US5205770 Mar 12, 1992 Apr 27, 1993 Micron Technology, Inc. Method to form high aspect ratio supports (spacers) for field emission display using micro-saw technology US5229691 Jul 15, 1991",
    "hasKeyColumn": true,
    "keyColumnIndex": 2,
    "headerRowIndex": 0
}