{
    "relation": [
        [
            "Date",
            "Apr 4, 1994",
            "May 2, 1997",
            "Dec 18, 2003",
            "Dec 18, 2003",
            "Dec 24, 2003",
            "Sep 14, 2007",
            "Sep 23, 2011"
        ],
        [
            "Code",
            "AS",
            "AS",
            "SULP",
            "FPAY",
            "REMI",
            "FPAY",
            "FPAY"
        ],
        [
            "Event",
            "Assignment",
            "Assignment",
            "Surcharge for late payment",
            "Fee payment",
            "Maintenance fee reminder mailed",
            "Fee payment",
            "Fee payment"
        ],
        [
            "Description",
            "Owner name: FORD MOTOR COMPANY, MICHIGAN Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNOR:STILES, ERNEST D.;REEL/FRAME:006916/0936 Effective date: 19931207",
            "Owner name: FORD GLOBAL TECHNOLOGIES, INC., MICHIGAN Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNOR:FORD MOTOR COMPANY;REEL/FRAME:008564/0053 Effective date: 19970430",
            "",
            "Year of fee payment: 4",
            "",
            "Year of fee payment: 8",
            "Year of fee payment: 12"
        ]
    ],
    "pageTitle": "Patent US6071370 - Fuel tank with integral heat shield - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US6071370?dq=system+for+measuring+web+traffic&ei=Lg8FT__TIIr-sQKzxaGRCg",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 8,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990611.52/warc/CC-MAIN-20150728002310-00034-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 492809336,
    "recordOffset": 492793421,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Patent Citations Various modifications and adaptations of the present invention are possible without departing from the spirit and scope of the attached claims. These modifications and adaptations are included in the present inventions. FIG. 3 illustrates an alternative embodiment of the present invention. In this alternative embodiment the locating means consists of a recessed area 38. Recess 38 is sized to receive heat shield 12'. Pad 14' is slightly larger than recess 38 and is retained within recess 38 through compression. Fuel tank 10' manufactured using this apparatus does not have a substantially flush exterior surface. Heat shield 12' extends beyond the exterior surface of the fuel tank wall and the perimeter of heat shield 12' is generally exposed. The final integrally molded tank has a substantially flush exterior surface. Parison 32 generally encircles pad 14. When insulation material 16 is selected from woven stock, the edge of insulation material 16 becomes incased within parison 32 and resistant to fraying. A large or small surface of fuel tank 10 may be protected with insulation material 16 in the manner described. Although not a primary purpose of the present invention, the laminated pad provides the tank with a margin of increased strength and protection from damage. After parison 32 has cooled for 30-60 seconds, fuel tank 10 is removed from apparatus 18 and left to cool. The cooled 10 parison functions as the fluid tight wall of fuel tank",
    "textAfterTable": "US5020687 * Feb 12, 1990 Jun 4, 1991 Solvay Automotive, Inc. Fabric reinforcement for plastic fuel tanks US5129544 * Nov 8, 1990 Jul 14, 1992 Jacobson Wendell L Laminated fuel tank structure US5186875 * Mar 11, 1991 Feb 16, 1993 Mazda Motor Corporation Method of manufacturing of a novel hollow multi-layer article US5188981 * May 28, 1991 Feb 23, 1993 Ford Motor Company Molded article with integral heat shield US5244615 * Dec 3, 1992 Sep 14, 1993 Air Products And Chemicals, Inc. Process for the production of permeation resistant containers US5344038 * Nov 1, 1993 Sep 6, 1994 The Budd Company Composite fuel tank JPS5871129A * Title not available JPS5981221A *",
    "hasKeyColumn": true,
    "keyColumnIndex": 2,
    "headerRowIndex": 0
}