{
    "relation": [
        [
            "Date",
            "Jun 11, 1999",
            "Mar 4, 2003",
            "May 1, 2006",
            "Apr 29, 2010",
            "Apr 29, 2014"
        ],
        [
            "Code",
            "AS",
            "CC",
            "FPAY",
            "FPAY",
            "FPAY"
        ],
        [
            "Event",
            "Assignment",
            "Certificate of correction",
            "Fee payment",
            "Fee payment",
            "Fee payment"
        ],
        [
            "Description",
            "Owner name: TELEFONAKTIEBOLAGET L M ERICSSON (PUBL)., SWEDEN Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNOR:PAULSRUD, TOMAS;REEL/FRAME:010034/0281 Effective date: 19990607",
            "",
            "Year of fee payment: 4",
            "Year of fee payment: 8",
            "Year of fee payment: 12"
        ]
    ],
    "pageTitle": "Patent US6473501 - Concurrent hunt group searching methods and arrangements - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US6473501?ie=ISO-8859-1",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 9,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990611.52/warc/CC-MAIN-20150728002310-00083-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 472815947,
    "recordOffset": 472791567,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Patent Citations Although some preferred embodiments of the methods and arrangements of the present invention have been illustrated in the accompanying Drawings and described in the foregoing Detailed Description, it will be understood that the invention is not limited to the embodiment disclosed, but is capable of numerous rearrangements, modifications and substitutions without departing from the spirit of the invention as set forth and defined by the following claims. Controller 36 is further depicted as receiving administrative user inputs through input 48. This allows controller 36 to be programmed and/or receive inputs. Thus, for example, an administrative user can establish various hunt groups, search orders, access lists, and/or otherwise provide updates to application 24. Controller 36 outputs one or more signals/indicators that operatively control switching mechanism 38. Switching mechanism 38 is configured to selectively connect one or more of lines 39A with one or more of lines 39B, in response to controller 36. Switching mechanism 38 can include, for example, a switch matrix, a crossbar switch, etc. Memory 40 is connected to controller 36, and accessed thereby. Memory 40 can include solid-state memory and/or other types of data storage devices and/or media, which are capable of storing information relating to, and/or including, application 24. As depicted, memory 40 is graphically shown as including hunt group information 42, search order information 44, and access list information 46. FIG. 4 is a block diagram depicting an exemplary switch 14, in",
    "textAfterTable": "Telephone routing system with queuing and voice messaging capabilities US5450488 Mar 2, 1994 Sep 12, 1995 Us West Advanced Tech Inc Multiple service voice messaging system US5517560 * Aug 8, 1995 May 14, 1996 At&T Corp. Call billing and measurement methods for redirected calls US5550905 Oct 26, 1994 Aug 27, 1996 Lucent Technologies Inc. Method and apparatus for delivering calls and caller identification information to multi-line users US5557667 * Mar 9, 1995 Sep 17, 1996 At&T Method and system for multi-channel data automatic call distribution for sequentially launched calls US5563937 * Mar 9, 1995 Oct 8, 1996 At&T Method and system for multi-channel data automatic call distribution US5579375 * May 2, 1995 Nov 26, 1996 Telefonaktiebolaget L M Ericsson Call transfer within cellular communications system US5590187 * Apr 21, 1995 Dec 31, 1996 Lucent Technologies Inc. Call",
    "hasKeyColumn": true,
    "keyColumnIndex": 2,
    "headerRowIndex": 0
}