{
    "relation": [
        [
            "Date",
            "Nov 16, 1995",
            "Jul 26, 2001",
            "Aug 12, 2004",
            "Jul 20, 2005",
            "Sep 21, 2009",
            "Feb 17, 2010",
            "Apr 6, 2010"
        ],
        [
            "Code",
            "AS",
            "FPAY",
            "AS",
            "FPAY",
            "REMI",
            "LAPS",
            "FP"
        ],
        [
            "Event",
            "Assignment",
            "Fee payment",
            "Assignment",
            "Fee payment",
            "Maintenance fee reminder mailed",
            "Lapse for failure to pay maintenance fees",
            "Expired due to failure to pay maintenance fee"
        ],
        [
            "Description",
            "Owner name: NEC CORPORATION, JAPAN Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNORS:TOGARI, SATOSHI;BABA, YOSHIMITSU;REEL/FRAME:007774/0328 Effective date: 19951110",
            "Year of fee payment: 4",
            "",
            "Year of fee payment: 8",
            "",
            "",
            "Effective date: 20100217"
        ]
    ],
    "pageTitle": "Patent US5719372 - Laser marking system and method using controlled pulse width of Q-switch - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US5719372?ie=ISO-8859-1&dq=6,424,354",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 8,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990611.52/warc/CC-MAIN-20150728002310-00205-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 473022355,
    "recordOffset": 472997800,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{36044=Laser marking has been widely used to mark an electronic part with a specific pattern such as classification characters. Of the laser marking methods, there is known a beam-scanning marking method in which a laser beam scans the surface of the part in the specific pattern, which is disclosed in Japanese Patent Unexamined Publication Nos. 59-45091 and 60-221721. Generally, a solid state laser such as Nd:YAG laser is used as a laser light source.}",
    "textBeforeTable": "Patent Citations Furthermore, since the emission period of the pulse laser beam is changed depending on a desired material of the workpiece, the optimal marking condition is easily set without decreasing the marking quality and performance regardless of the kind of a workpiece. Further, in cases where the workpiece comprises a resin film containing carbon, a plurality of laser emission pulses due to the relaxation oscillation cause the increased amount of carbon deposition on the surface of the workpiece, resulting in the improved visibility of the marking lines. As mentioned above, the laser marking system according to the present invention is capable of changing the emission period of the pulse laser beam on condition that the repetition rate and the scanning speed of the pulse laser beam are kept at constant. Since the relatively long emission period causes the CW-pumped Q-switch laser to emit a plurality of laser emission pulses with relatively low intensities due to the relaxation oscillation, the marking lines are formed at a relatively shallow depth on the surface of the workpiece without decreasing the marking performance. As illustrated in FIG. 8B, a hole 306 is formed at a relatively shallow depth due to the vaporization of the resin and the discoloration layer 307 is produced due to the melt of the resin, as mentioned above. The hole 306 and the discoloration layer 307 are formed by the pulse laser beam output from the CW-pumped",
    "textAfterTable": "Title not available JPS5945091A * Title not available JPS60196283A * Title not available JPS60221721A * Title not available * Cited by examiner Referenced by Citing Patent Filing date Publication date Applicant Title US5937270 * Jan 24, 1996 Aug 10, 1999 Micron Electronics, Inc. Method of efficiently laser marking singulated semiconductor devices US5977514 * Jun 13, 1997 Nov 2, 1999 M.A. Hannacolor Controlled color laser marking of plastics US5986235 * Jul 21, 1997 Nov 16, 1999 Micron Electronics, Inc. Method of efficiently laser marking singulated semiconductor devices US6022905 *",
    "hasKeyColumn": true,
    "keyColumnIndex": 2,
    "headerRowIndex": 0
}