{
    "relation": [
        [
            "Citing Patent",
            "US5671209 *",
            "US5808986 *",
            "US5907526 *",
            "US6028827 *",
            "US6111831 *",
            "US6137763 *",
            "US6314071",
            "US6341118 *",
            "US6366546 *",
            "US6584052",
            "US6822667 *",
            "US6985414",
            "US7403465",
            "WO2001027917A1 *",
            "WO2005055212A1 *",
            "WO2006129209A1 *",
            "WO2006129213A2 *",
            "WO2006131858A1 *"
        ],
        [
            "Filing date",
            "Nov 15, 1995",
            "Jan 8, 1996",
            "Feb 20, 1997",
            "Jan 27, 1998",
            "Dec 1, 1998",
            "Sep 24, 1998",
            "Feb 20, 1998",
            "Jun 2, 1998",
            "Mar 4, 1998",
            "Jun 2, 1998",
            "Jun 23, 2000",
            "Jan 8, 2002",
            "Oct 14, 2005",
            "Oct 13, 2000",
            "Nov 25, 2004",
            "May 15, 2006",
            "May 16, 2006",
            "Jun 1, 2006"
        ],
        [
            "Publication date",
            "Sep 23, 1997",
            "Sep 15, 1998",
            "May 25, 1999",
            "Feb 22, 2000",
            "Aug 29, 2000",
            "Oct 24, 2000",
            "Nov 6, 2001",
            "Jan 22, 2002",
            "Apr 2, 2002",
            "Jun 24, 2003",
            "Nov 23, 2004",
            "Jan 10, 2006",
            "Jul 22, 2008",
            "Apr 19, 2001",
            "Jun 16, 2005",
            "Dec 7, 2006",
            "Dec 7, 2006",
            "Dec 14, 2006"
        ],
        [
            "Applicant",
            "Matsushita Electric Industrial Co., Ltd.",
            "Vixel Corporation",
            "Zen Research N.V.",
            "Zen Research N.V.",
            "Zen Research N. V.",
            "Zen Research N.V.",
            "Zen Research (Ireland), Ltd.",
            "Science Applications International Corporation",
            "Fraunhofer-Gesellschaft Zur Forderung Der Angewandten Forschung E.V.",
            "Science Applications International Corporation",
            "Imation Corp.",
            "Dragsholm Wireless Holdings Llc",
            "Dragsholm Wireless Holdings Llc",
            "Tdk Corp",
            "Christopher Busch",
            "Koninkl Philips Electronics Nv",
            "Koninkl Philips Electronics Nv",
            "Koninkl Philips Electronics Nv"
        ],
        [
            "Title",
            "Focusing time period and power control of a multilaser diode array",
            "Multiple beam optical memory system with solid-state lasers",
            "Methods and apparatus for simultaneously reading multiple tracks of an optical storage medium",
            "Methods and apparatus for synchronizing read out of data from multiple tracks of an optical storage device",
            "Methods and apparatus for simultaneously reading multiple tracks of an optical storage medium",
            "Method and apparatus for buffering data in a multi-beam optical disk reader",
            "Method and apparatus for reading multiple tracks and writing at least one track of an optical disk",
            "Multiple channel scanning device using oversampling and image processing to increase throughput",
            "Output device for digitally stored data on a data carrier",
            "Method and apparatus for controlling the focus of a read/write head for an optical scanner",
            "Multi-channel optical recording using VCSEL arrays",
            "Method and apparatus for writing on an optical disk with beam spots aligned at an angle to data tracks",
            "Method and apparatus for writing on an optical disk with beam spots aligned at an angle to data tracks",
            "Optical recording medium, optical recording method, optical recorded medium reproducing method",
            "Optical disc storage with 2d-data-track and with guard band storing non-content information and reading device therefore",
            "An optical data recording/reproducing system picking up multiple tracks between guard bands",
            "Optical system",
            "An optical system with 3 spot radial tracking"
        ]
    ],
    "pageTitle": "Patent US5508990 - Optical recording and reproducing apparatus using optical recording medium - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US5508990?ie=ISO-8859-1&dq=5,664,133",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 6,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990611.52/warc/CC-MAIN-20150728002310-00118-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 479117159,
    "recordOffset": 479092279,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{45344=This is a division of application Ser. No. 08/100,064 filed Jul. 30, 1993, now U.S. Pat. No. 5,386,410 which is a continuation of Ser. No. 07/710,675, filed Jun. 5, 1991 (now abandoned).}",
    "textBeforeTable": "Patent Citations Additional advantages and modifications will readily occur to those skilled in the art. Therefore, the invention in its broader aspects is not limited to the specific details, and representative devices, shown and described herein. Accordingly, various modifications may be made without departing from the spirit or scope of the general inventive concept as defined by the appended claims and their equivalents. Furthermore, it is apparent that the present invention can use a material using an Al reflecting layer (CDROM), a Te-based material, a colorant-based material, a phase change material (write type), a photomagnetic material, a phase change material (reversible type), or the like as the recording material. In the pit recording method with modulation in the two- or three-dimensional direction described above, regarding the track width direction, laser diodes corresponding in number to the steps of multi-value recording are arranged. The light beams from the laser diodes are focused on a medium track to form a pit, thereby performing recording. Regarding the pit depth direction, recording can also be performed by, e.g., changing the power of the laser diodes. In the above embodiments, multi-value recording and reproduction by way of two-dimensional modulation of a track direction and a track width direction perpendicular to it are described. Three-dimensional modulation of multi-value recording and reproduction is possible if modulation recording is also performed in a pit depth direction (direction perpendicular to both the track direction and the track",
    "textAfterTable": "DE3837745A1 * Nov 7, 1988 May 24, 1989 Hitachi Ltd Optisches informationsmedium EP0245511A1 * Nov 5, 1986 Nov 19, 1987 Sony Corporation Optical card reader EP0350336A2 * Jul 10, 1989 Jan 10, 1990 Sharp Kabushiki Kaisha Optical memory system JPS6358627A * Title not available JPS59207433A * Title not available * Cited by examiner Referenced by Citing Patent Filing date Publication date Applicant Title US5671209 * Nov 15, 1995 Sep 23, 1997 Matsushita Electric Industrial Co., Ltd. Focusing time period and power control of a multilaser diode array US5808986 * Jan 8, 1996 Sep 15, 1998 Vixel Corporation",
    "hasKeyColumn": true,
    "keyColumnIndex": 3,
    "headerRowIndex": 0
}