{
    "relation": [
        [
            "Citing Patent",
            "US7596885",
            "US7601671 *",
            "US7862764",
            "US8020314 *",
            "US8729436",
            "US20120086153 *"
        ],
        [
            "Filing date",
            "Jul 28, 2006",
            "Oct 28, 2004",
            "Mar 28, 2008",
            "Oct 31, 2008",
            "May 28, 2009",
            "Sep 23, 2011"
        ],
        [
            "Publication date",
            "Oct 6, 2009",
            "Oct 13, 2009",
            "Jan 4, 2011",
            "Sep 20, 2011",
            "May 20, 2014",
            "Apr 12, 2012"
        ],
        [
            "Applicant",
            "Corning Incorporated",
            "Umicore Ag & Co. Kg",
            "Corning Incorporated",
            "Corning Incorporated",
            "Corning Incorporated",
            "Ibiden Co., Ltd."
        ],
        [
            "Title",
            "Microwave drying of ceramic structures",
            "Drying method for exhaust gas catalyst",
            "Method and applicator for selective electromagnetic drying of ceramic-forming mixture",
            "Methods and apparatus for drying ceramic green bodies with microwaves",
            "Drying process and apparatus for ceramic greenware",
            "Manufacturing methods of ceramic fired body, honeycomb structure, and exhaust gas converting device, and drying apparatus"
        ]
    ],
    "pageTitle": "Patent US6706233 - Method for processing ceramics using electromagnetic energy - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US6706233?dq=mezick",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 6,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990611.52/warc/CC-MAIN-20150728002310-00234-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 480190063,
    "recordOffset": 480167736,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{32369=Although, various methods of implementation have been proposed, it can be difficult to coordinate the respective microwave and conventional energy inputs to achieve optimal uniform heating of the ceramic article. Variations on microwave-assisted ceramic firing standard control methods are disclosed in PCT Applications WO 95/05058 and WO 93/12629 and U.S. Pat. No. 5,191,183. These documents generally disclose methods of independently controlling the quantities of heat generated in the ceramic article by the microwave energy and radiant heat by measuring the ambient temperature within an enclosure containing the ceramic article. Based on, and in response to, this ambient temperature measurement, the heat generated in the ceramic article is controlled by one or both of the microwave energy or radiant heat. Although this type of control method is an improvement over prior conventional control methods, the non-uniform mixing of kiln gases and the effects of chemical reactions that occur within the ceramic material make it difficult to accurately predict the ceramic article surface and internal temperatures., 19475=This application claims the benefit of U.S. Provisional Patent Application Serial No. 60/258,722, filed Dec. 29, 2000, entitled “Method for Microwave Processing of Ceramics”, by Araya et al. which is herein incorporated by reference in its entirety.}",
    "textBeforeTable": "Patent Citations It should be understood that while the present invention has been described in detail with respect to certain illustrative and specific embodiments thereof, it should not be considered limited to such. It is contemplated that numerous modifications are possible without departing from the broad spirit and scope of the present invention as defined in the appended claims. Commercial operation of the method of the present invention would involve placing the ceramic material in a microwave heating apparatus having a microwave cavity and subjecting the ceramic material to microwave radiation in combination with conventional heat energy according to a predetermined time-temperature profile. In operation, the ceramic material is subjected to an amount of heat energy by irradiating it with a combination of electromagnetic microwave radiation and by subjecting the ceramic article to conventional heat. The amount of microwave radiation and conventional heat are such that the ceramic article is heated according to a predetermined time-temperature profile. The time-temperature profile, ranging from room temperature to the sintering soak temperature, is determined so as to heat the ceramic article to its sintering soak temperature in the minimum time while still allowing for the production of a ceramic article that, following the subsequent hold at the sintering soak temperature, exhibits the required characteristics of the ceramic material, specifically, a crack-free, undistorted ceramic article. Further, core temperatures can be measured by a reflected power scheme. In a microwave unit the magnetron",
    "textAfterTable": "US5538681 * Sep 12, 1994 Jul 23, 1996 Corning Incorporated Drying process to produce crack-free bodies EP0500252A1 Feb 11, 1992 Aug 26, 1992 Ontario Hydro Method and apparatus for processing ceramics GB2262333A Title not available WO1993012629A1 Dec 9, 1992 Jun 24, 1993 Univ Staffordshire Entpr Ltd Microwave heating method and apparatus WO1995005058A1 Aug 8, 1994 Feb 16, 1995 Ea Tech Ltd Microwave-assisted processing of materials * Cited by examiner Referenced by Citing Patent Filing date Publication date Applicant Title US7596885 Jul 28, 2006 Oct 6, 2009 Corning Incorporated Microwave drying of ceramic structures US7601671 * Oct 28, 2004 Oct 13, 2009 Umicore Ag & Co. Kg Drying method for exhaust gas catalyst US7862764",
    "hasKeyColumn": true,
    "keyColumnIndex": 3,
    "headerRowIndex": 0
}