{
    "relation": [
        [
            "Location",
            "Edit Delete Edit localized... View CVT Watford",
            "Edit Delete Edit localized... View CVT Dronfield",
            "Edit Delete Edit localized... View CVT Radlett",
            "Edit Delete Edit localized... View CVT Los Angeles"
        ],
        [
            "Start date",
            "-",
            "-",
            "-",
            "-"
        ],
        [
            "End date",
            "-",
            "-",
            "-",
            "-"
        ]
    ],
    "pageTitle": "Vinnie Jones - Freebase",
    "title": "",
    "url": "http://www.freebase.com/en/vinnie_jones",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989790.89/warc/CC-MAIN-20150728002309-00313-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 460867075,
    "recordOffset": 460823686,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{200701=Vincent Peter \"Vinnie\" Jones is a British actor and former professional footballer who played as a midfielder from 1984 to 1999 notably for Wimbledon, Leeds United and Chelsea. Born in Watford, Hertfordshire, Jones represented and captained the Welsh national football team, having qualified via a Welsh grandparent. As a member of the \"Crazy Gang\", Jones won the 1988 FA Cup Final with Wimbledon, a club for which he played well over 200 games during two spells between 1986 and 1998. He also played for Chelsea, Leeds United, Sheffield United and Queens Park Rangers. Jones was a defensive midfielder who was especially noted for his very aggressive style of play, earning him a \"hard man\" image on the field. Since his retirement from football, he has capitalised on his tough man image and is now known as an actor for his aggressive and intimidating demeanour, often being typecast into roles as violent criminals and thugs. Jones appeared in Celebrity Big Brother 2010, where he finished in third place behind Dane Bowers and Alex Reid. [ - ]}",
    "lastModified": "Mon, 03 Aug 2015 010:07:03 UTC",
    "textBeforeTable": "Web Link(s) (deprecated) /common/topic/webpage View history Query by property Flag as reviewed Flag as having unknown values Flag as having no values Add new value Vincent Peter \"Vinnie\" Jones (born 5 January 1965) is an English actor and retired... Article (deprecated) /common/topic/article View history Query by property Flag as reviewed -",
    "textAfterTable": "Add new value Flag as having no values Flag as having unknown values Flag as reviewed Query by property View history Clicker.com ID (TV) /common/identity/clicker_tv_id - Add new value Flag as having no values Flag as having unknown values Flag as reviewed Query by property View history Guardian UK Tag /common/identity/guardian_uk_tag -",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}