{
    "relation": [
        [
            "Categories",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "Take Penn State Altoona seriously, even if you have graduated Altoona High and you are just going to PSU because it's in your hometown. Don't take it as a joke, and realize early that if you graduate from here, you get a Pennsylvania State University degree which will take you very far in life.",
            "This school is located in a beautiful part of Central Pennsylvania, close enough to the main campus so that students can participate in football games and other social activity while reaping the benefits of a smaller, quieter town. Classes are smaller resulting in more personal student-teacher relationships."
        ]
    ],
    "pageTitle": "Pennsylvania State University-Penn State Altoona Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Pennsylvania-State-University-Penn-State-Altoona/reviews?_escaped_fragment_=/show/25960",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989043.35/warc/CC-MAIN-20150728002309-00201-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 917816287,
    "recordOffset": 917766016,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{197929=The food and dining has gotten better since I came here Fall of 2011, and they have more choices so I have to say that I am pleased, but I live off campus and would much rather cook something for myself., 134292=The food on campus is delicious. During this past summer of 2012 the cafeteria on campus was completely remodeled. It looks very modern, but most importantly the food is really good. There is a salad station, a pasta station, an all day breakfast food station, a sandwhich station, a grill station, a coffee/tea/milkshake station, a pizza station, and a chef's choice table., 87493=The food and dining at Penn State Altoona is not the best. Port Sky, the only cafeteria on campus, serves the same food every week and closes at 10:30 PM. There are no fast food restaurants on campus., 143745=When I first started college I gave birth to my 1st son in the middle of a semester. I had him on a Thursday and went back into school the following Tuesday to take a liver exam. I graduated with my Associates Degree in Nursing. I always stress to my children that education is never wasted. I decided about a year ago to go back for my BSN then on to my MSN. When I made this decision my oldest son was starting at PSU at University Park. I remember when I took him to college, he looked at me and laughed and said Here we are again mom in college together. My middle child will be starting college this fall in 2013. My youngest child age 16 is starting to make plans for when she graduates. She has 5 colleges she is interested in and would like to see one or two this summer. I raised my children with respect for education and to absorb all it has to offer because it will never be wasted. I currently work full time as a charge nurse for a hospital in my area. I have been attending PSU in Altoona and have maintained a 3.63 GPA. With over 18 years of experience in nursing I plan on getting my MSN and teach nursing., 230215=© 2015, Cappex.com, LLC}",
    "textBeforeTable": "08/23/2009 Reviewer is A current student here. 11 out of 11 people found this review useful. 1 of 53 Kristen from Altoona, PA Check out reviews left by other students or leave your own review. You could win a free scholarship. Pennsylvania State University-Penn State Altoona Reviews Pennsylvania State University-Penn State Altoona › Pennsylvania › By State › Colleges › } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.create', -->",
    "textAfterTable": "Bang for the buck Yes of course you have to pay for your books; don't buy them from the book store though. Get them off of half.com you'll save atleast 300 dollars. Am enjoying being here I was intimidated my first semester, but trust me its not hard making new friends here! Everyone has great pride in the school, and loves meeting new people. Don't be afraid to introduce yourself to other students. Am learning a lot Its all about your professors!! So when you schedule your first classes, make sure you go to www.ratemyprofessors.com and look the professor up! Trust me, you'll thank me in the end. Login to rate or flag the reviews Marianna from Johnstown, PA 11/01/2009 Reviewer is A current student here. 3 out of 3 people found this review useful. 2 of 53 Categories Comments Great for these types of students",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}