{
    "relation": [
        [
            "Categories",
            "Campus Safety",
            "Greek Life",
            "Clubs and Activities",
            "Great for these types of students",
            "Share any unusual traditions or locations on campus",
            "Bang for the buck",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "Security is great and always doing their job.",
            "I'm not part of it.",
            "there are a tn of things to do, just be warned that new programs can be unorganized.",
            "students who like 1 on 1 talking with teachers. people who are social and want a close knit community",
            "everything is named after hawks (hawksnest, hawkslanding....) everyone learns all the hawkpride songs and sings them at the basketball games.",
            "Its pretty easy to get a scholarship, but UMES is cheap compared to others.",
            "There are lots of partys and school hosted events. The dances are really great!",
            "The caf has good food usually. They serve the same thing for lunch and breakfast everyday. hawksnest is good but they are slow during the lunch rush.",
            "The dorms are great and the RAs are wonderful. Murphy is great for freshmen females.",
            "UMES has a lot of hard classes but generally the teachers are very helpful and you can easily pass as long as you talk to your teachers. Math 109 is very hard.",
            "Dont buy your books until the first day of class because a lot of teachers will tell you that you do not need them. Be careful when walking at night because the frogs sit on the sidewalks.",
            "They are very unorganized with things like housing and keeping the grades updated. The campus is beautiful. The people are friendly."
        ]
    ],
    "pageTitle": "University of Maryland Eastern Shore (UMES) Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/University-of-Maryland-Eastern-Shore/reviews?_escaped_fragment_=/show/102203",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986423.95/warc/CC-MAIN-20150728002306-00304-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 901426023,
    "recordOffset": 901366610,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{291470=Greek life is 50-50, right now because the sororities are not active on campus just yet. All sororities will be back on campus Spring 2014 and everyone is so anxious for their return., 157734=As of 2012, we have 6 of the divine 9 at UMES. We have all the fraternities and only one of the sorority of the pan. We also have a couple of social fellowships and a christian based Greek organization., 108813=Homecoming is held in January rather than right when school starts., 325973=© 2015, Cappex.com, LLC, 216764=The School Cafeteria does not stay open late it closes early and if you do not eat by 7:45 you can't go in the cafeteria. You have to go to the Hawk's nest but it be too crowded. The food in the school cafeteria has laxative in it.}",
    "textBeforeTable": "12/12/2009 Reviewer is A current student here. 16 out of 16 people found this review useful. 1 of 82 DENEEN from Washington, DC Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {//",
    "textAfterTable": "Great for these types of students If you are into the Criminal Justice major, this is your place. The Criminal Justice here is amazing! As well as the Math and Computer Science department!...This is the best place to come if you really and truly are up for a change and a new beginning! Tips for prospective students Get to know people around...it can make your college experience best! Also, make sure that you study more than you party...it will pay off at the end! Bang for the buck Overall, i give the school an A..it has room for improvement! Am enjoying being here The campus is beautiful, the dorms are comfortable and the learning environment is perfect. Am learning a lot The Professors here at UMES are awesome they let you know step by step what it is that you need to know and they also are very accessible when you need to see them. Are there just some subjects you are so week in and you have to take? Tutoring is available everyday and they are an BIG HELP! Login to rate",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}