{
    "relation": [
        [
            "Date",
            "30 Sep 2003",
            "10 Apr 2007",
            "18 May 2007",
            "14 May 2010",
            "14 May 2014",
            "30 Oct 2014"
        ],
        [
            "Code",
            "AS",
            "AS",
            "AS",
            "FPAY",
            "FPAY",
            "AS"
        ],
        [
            "Event",
            "Assignment",
            "Assignment",
            "Assignment",
            "Fee payment",
            "Fee payment",
            "Assignment"
        ],
        [
            "Description",
            "Owner name: RELIANCE ELECTRIC TECHNOLOGIES, LLC, OHIO Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNOR:EL-IBIARY, YEHIA;REEL/FRAME:014565/0432 Effective date: 20030929",
            "Owner name: BNP PARIBAS, NEW YORK Free format text: SECURITY AGREEMENT;ASSIGNOR:RELIANCE ELECTRIC TECHNOLOGIES, LLC;REEL/FRAME:019140/0157 Effective date: 20070131",
            "Owner name: BNP PARIBAS, NEW YORK Free format text: SECURITY AGREEMENT;ASSIGNOR:RELIANCE ELECTRIC TECHNOLOGIES, LLC;REEL/FRAME:019312/0529 Effective date: 20070131",
            "Year of fee payment: 4",
            "Year of fee payment: 8",
            "Owner name: BALDOR ELECTRIC COMPANY, ARKANSAS Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNOR:RELIANCE ELECTRIC TECHNOLOGIES, LLC;REEL/FRAME:034113/0144 Effective date: 20100422"
        ]
    ],
    "pageTitle": "Patent US20050067991 - System and method for identifying operational parameters of a motor - Google Patents",
    "title": "",
    "url": "http://www.google.ca/patents/US20050067991?ie=ISO-8859-1",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989790.89/warc/CC-MAIN-20150728002309-00127-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 476399735,
    "recordOffset": 476352021,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{6316=The following equations for equivalent reactance Xe and equivalent resistance Re may be developed using FIG. 5 and data obtained at the two load points of the motor. The equation for the equivalent reactance Xe is given as follows: X e = - B 2 A + B 2 - 4 AC 2 A , ( 6 ) where A, B, and C are given by: A=1.05*0.05*sI 1 2;  (7) B=−1.1I 1 V 1i s; and  (8) C=V 1i 2 s+(sR 1 I 1 −sV 1R)(I 1 R 1 −V 1R).  (9) V1i is the imaginary portion of the voltage and is a function of the amplitude of the power source voltage V1 and the sine of the power factor angle. V1R is the real portion of the voltage and is a function of the amplitude of the power source voltage V1 and the cosine of the phase angle. In addition, the equivalent resistance Re is given by the following equation: R e = sX e ( V 1 j - .05 I 1 X e ) ( V 1 R - I 1 R 1 ) . ( 10 )}",
    "textBeforeTable": "Patent Citations While the invention may be susceptible to various modifications and alternative forms, specific embodiments have been shown by way of example in the drawings and have been described in detail herein. However, it should be understood that the invention is not intended to be limited to the particular forms disclosed. Rather, the invention is to cover all modifications, equivalents, and alternatives falling within the spirit and scope of the invention as defined by the following appended claims. In addition, the monetary analysis module 222 may function cooperatively with or separately from the energy analysis module 220. In this exemplary embodiment, the monetary analysis module 222 comprises a cost analysis module 240 and a savings analysis module 242. For example, the cost analysis module 240 may calculate the monetary cost of the motor 20 based on the output power, the cost per kilowatt-hour, and the number of hours per week of operation of the motor 20. Similarly, the savings analysis module 242 may calculate the monetary cost of a new/replacement motor and then calculate the monetary difference between the new/replacement motor and the existing motor 20. As result, a customer can make an informed decision whether to replace the motor 20 with a new/replacement motor. Turning now to the energy and monetary analysis modules 220 and 222, the system 200 may engage these modules to evaluate",
    "textAfterTable": "US6144924 * 20 May 1996 7 Nov 2000 Crane Nuclear, Inc. Motor condition and performance analyzer US6199018 * 4 Mar 1998 6 Mar 2001 Emerson Electric Co. Distributed diagnostic system US6236947 * 6 Jun 2000 22 May 2001 Crane Nuclear, Inc. Method of monitoring placement of voltage/current probes on motors US6262550 * 17 Dec 1999 17 Jul 2001 General Electric Company Electrical motor monitoring system and method US6281659 * 6 Mar 2000 28 Aug 2001 Fuji Electric Co., Ltd. Induction motor drive and a parameter estimation method thereof US6295510 * 17 Jul 1998 25 Sep 2001 Reliance Electric Technologies, Llc Modular machinery data collection and analysis system US6297742 * 6 May 1998 2 Oct 2001 Csi Technology, Inc. Machine monitor with status indicator US6308140",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}