{
    "relation": [
        [
            "Categories",
            "Great for these types of students",
            "Share any unusual traditions or locations on campus",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "Artsy people, not afraid of haunted places, education majors, and nerdy kids! Not to mention the socially awkward.",
            "Montevallo doesn't have a football team, so we don't have a 'Homecoming' We have what's known as College Night, where students write, act, compose and completely make a play for their respective side, Purple or Gold, and do tons of crazy stuff to rack up points for their side to win!",
            "Be sure to go to your adviser asap when it's time to pick new classes! Foreign languages go really fast.",
            "Montevallo is a great school for Education majors, business, or art/music majors! We have great teachers and getting involved on campus is very easy here. I couldn't have picked a better school."
        ]
    ],
    "pageTitle": "University of Montevallo Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/University-of-Montevallo/reviews?_escaped_fragment_=/show/15935",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986423.95/warc/CC-MAIN-20150728002306-00336-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 898947807,
    "recordOffset": 898892293,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{210099=Be open to alternative lifestyles and sexuality. 5:1 girl to guy ratio, so that's nice. Be open and friendly to other people or you'll never make friends! Pay attention in your classes, the professors will help if you need it., 87342=College Night is a major tradition. It is strange in that it is our version of a Homecoming. Other colleges have a rival that they interact with for Homecoming, Montevallo divides most of the student body for only late January to early February., 242951=© 2015, Cappex.com, LLC, 67517=College Night! The best homecoming tradition in the country. Two competing sides produce two musicals in one month and compete over one weekend in February. You form bonds, you meet people, you get involved in a compelling, humongous work of art that is entirely student-run. Not much sleep is had throughout the month for the people directly involved in the production. Also, King House on campus is reported to be the first building in Alabama that had pane-glass windows. So that's something., 38237=montevallo is home to the longest-running homecoming tradition in the united states, called college night. it has been taking place every year in february for the last 94 years. we even have our own jeopardy question!, 47424=we have the wonderful tradition of college night, a homecoming tradition that takes place in february. it features intramural sports and a theater competition.}",
    "textBeforeTable": "08/17/2011 Reviewer is A current student here. 16 out of 16 people found this review useful. 1 of 51 Catherine from Cropwell, AL Check out reviews left by other students or leave your own review. You could win a free scholarship. University of Montevallo Reviews University of Montevallo › Alabama › By State › Colleges › } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.create', -->",
    "textAfterTable": "Am learning a lot I am currently a sophomore at the University of Montevallo and am definitely learning a lot in my classes. Due to the small teacher to student ratio, all of the teachers will at least recognize you as one of their students, if not know you by name and major. They realize that all students learn in different ways and will help you try to understand, or direct you to someone that may help you more. Login to rate or flag the reviews Alexandria from Alabaster, AL 07/11/2011 Reviewer is A current student here. 8 out of 8 people found this review useful. 2 of 51 Categories Comments Great for these types of students If you like small classroom sizes this school is PERFECT for you. Plus, over 95% of the professors here have there doctorate in their fields of study. Tips for prospective students Get involved. Yes, this is a small campus but there is so much to do!",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}