{
    "relation": [
        [
            "Categories",
            "Bang for the buck",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor"
        ],
        [
            "Comments",
            "The school is very expensive, but the professors all seem to be extremely well at what they do. With financial aid, I would say it is pretty good bang for the buck.",
            "The dining hall Montgoris is not the best place to eat unless all you want is a lot of food. There are several other places on campus that serve much better food though. For example, there is a diner on campus as well as a Subway.",
            "The best part of dorm life is that you are only a five minute walk from any class. However, there are often very rowdy people in y building that sometimes makes it difficult to sleep at night. (though it is rare, it does happen)",
            "So far, my classes have had no real homework, all I have had to do is write essays. However, with a few days separating the deadlines, it was a very easy matter to complete them all on time without rushing to complete them the night before. That is not to say though, that the classes are easy. You do need to pay attention in class and study if you want to get good grades."
        ]
    ],
    "pageTitle": "St. John's University Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/St-Johns-University/reviews?_escaped_fragment_=/show/14553",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 125,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989043.35/warc/CC-MAIN-20150728002309-00206-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 911364551,
    "recordOffset": 911243273,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{50589=In st. John's, for freshman, there are regular dorms (st vincents, donovan) and the fairly new suites (hollis, dasilva, carey). now i thought like on other colleges you have to pay more to be in a suite but i got in a suite for free. but be mindful, no matter what dorm your in the elevators, or at least for the freshman, are a little slow and tends to break at least once a month. Sophmores are in the suites; century, henley and also carey. There are a million and one things to do on campus talent shows, business events, fashon shows, discussions, barbecues. There are also alot of clubs to join. be prepared for your school email account to be filled with constant messges of activities. A good amount of people go home on the weekend so sometimes the campus seems like a ghost town. party wise is tricky. St. John's University is a dry campus, meaning we aren't allowed to have alcohol or drugs on campus, but people drink, sell, and smoke weed anyways, just in secret. Mostly people go off campus to party. Nearby there are frat house parties, fun bars (Traditions, Cheapshots, McFaddens, etc), and some clubs. Farther off, i work at and attend manhattan clubs and have been to legit brooklyn raves. All are really fun. Now this is an undeniable fact. St. John's is nearby the big apple but it isn't right next door. Be prepared for 30-50 minute traveling, depending on where you are going. Thoug, to me, i've been to manhattan so often it doesn't even seem that far anymore. From the top of the Great Stairs and some buildings there is a perfect view of manhattan which i love sitting down and viewing. There are alot of beautiful landscaping and trees. The campus is escpecially beautiful in the springtime. If you don't live in New York, be prepared for it's wheather especially when it's transitioning between seasons, then things really start to get crazy. One week in February or March it was 70 degrees one day, 40 degrees after, snow the next, 60 the next, and rain with a violent random slushy thunderstorm for like two hours the next day. Spring didn't really begin to show itself til late April/early May When it's nice out, music is playing, some people are tanning on the lawn, and EVERYBODY is outside. A really social scene. the campus is green which i enjoy, recycle & trash cans everywhere Though there is no 100% safe campus i feel the university is really safe for queens. Public safety driving around, emergency stations, but personally i have walked off campus to 7/11 and Dunkin Donuts (a block away from the campus) in the middle of the nite, i was perfectly fine. we all get a free laptop, a fair amount of computer stations. Study Abroad is fantastic. St. John's has campuses in Rome, Italy and Paris, France. With a whole bunch of opportunities to visit many other countries. I attended the freshman Passport Program, in January. i was lucky enough to be in Italy for 2 weeks and enjoyed every second of it, especially since we had alot of free time to explore, travel, and shop on our own. What was interesting was that while i was there, some other big colleges, one being University of Delaware, were actually renting out our Rome campus and while my class were all freshmen, the students coming from the other colleges were Juniors and Seniors! If you are a singer like me, or some kind of musician, there are definately opportunities. Manhattan definately has music opportunities, and being so close to it has its advantages. I have a friend who had his first gig in manhattan, another friend, who is a musical prodigy, just got signed. Heck, J. Cole and Kris Payne were from St. John's. I'm not saying your gonna come and a record deal will fall on your lap you have to work hard, but like any other university nearby big recording studios, there are more opportunities., 230677=The main place where people like to hang out and relax is DAC (which is short for D'Angelo Center). It can get quite loud in here so don't expect to be able to study in here. If you want to study but the little whispers in the main library irk you, try Marillac Hall (it's one of the buildings where classes are held). You can usually find an empty classroom and go in there to study. I find studying fun which is why I added that. Besides hanging out on campus, you are about 25-40 minutes away from Flushing (a major Chinatown of sorts in Queens). If you like to karaoke or eat Asian food or get bubble tea, this area will suit you just great. If libraries are your type of fun there is also a library located in Flushing and it has a really great selection of books. If you have to do any printing it's free too! (as of May 2012). There are also several parks around campus (but those too take about 15-20 minutes to reach by bus). One of them is called Kissena Park and it's an open space that has a man-made lake, paths for jogging, and a basketball and bocce court., 630561=© 2015, Cappex.com, LLC, 343058=At 4:20 a.m you can find people smoking on campus or smell it in the dorm rooms.}",
    "textBeforeTable": "07/26/2009 Reviewer is A current student here. 40 out of 40 people found this review useful. 1 of 141 MusicStudent Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp",
    "textAfterTable": "Thanks to the professors, St. John's is a school that helps students for their particular career field. Many of the teachers have had experience in your field, so they are willing to give you tips that go a long way. This college is not for the slacker- expect to do work, but in the end it helps out. Many students go onto graduate school in the city or receive internships after they graduate. Some even participate in internships while they are in undergraduate school. Login to rate or flag the reviews Jasmine from Dallas, TX 08/26/2009 Reviewer is A current student here. 21 out of 21 people found this review useful. 2 of 141 Categories Comments Great for these types of students At SJU, you will find people of all different backgrounds. If you want to study somewhere where you will be accepted by all, this is the place for you! Tips for prospective students Don't pack too much, as the rooms aren't very big. You will love the diversity of the school-students",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}