{
    "relation": [
        [
            "Categories",
            "Campus Safety",
            "Greek Life",
            "Clubs and Activities",
            "Great for these types of students",
            "Share any unusual traditions or locations on campus",
            "Bang for the buck",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "Campus security is always just around the corner. The campus police are able to answer calls at any point around campus within minutes. There are conveniently located emergency stations everywhere around campus that provide a convenient means of summoning emergency responders.",
            "I am not certain.",
            "There are always upbeat events that are hosted by different clubs around the campus. There are a wide range of clubs that can be joined.",
            "Great for all types! Technology, Art, Business and many other students are all welcome and would feel at home in this community.",
            "The campus hosts many university pride days and it's popular to go support the Sun Devil team at the Sun Devil Stadium downtown!",
            "A very fun, upbeat campus!",
            "There are many options when it comes to ASU. The Phoenix area is a close metropolitan city surrounded by mountains. For those interested in the city, there are multiple options for large shopping, dining and entertainment centers. For the sportsman, there are the mountains which show off the desert beauty. If you don't like the desert, then pine forests are an hour and a half away.",
            "Lots of good food! ASU has many options when it comes to food and dining. There are usually many options as well.",
            "From what I have seen (which isn't much), dorm life seems pretty good. The dorms are generally conveniently located and have a number of options.",
            "The class will probably be somewhat rigorous, but not extreme!",
            "Read the books! The readings and (sometimes) the video lectures will be your only means of learning. There is not much in-class, face-to-face time with the teacher that enables you to get questions resolved quickly. If you send an email, teachers will often answer back very quickly, but it does not take the place of conversing with the teacher. Keep in touch with the system to see all of the announcements!",
            "This college is great for those who are trying to get a degree while working full time due to the flexible schedule and ease of access. Be prepared to put in a good deal of work and reading; teachers often have to make up for class times by inserting video, audio and power point lectures to supplement the chapters. Anyone who tries it will probably be on the computer for long periods, but overall it's a great way to go!"
        ]
    ],
    "pageTitle": "Arizona State University Online Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Arizona-State-University-Online/reviews?_escaped_fragment_=/show/76860",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989790.89/warc/CC-MAIN-20150728002309-00249-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 901593711,
    "recordOffset": 901556767,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{22382=I have not started classes yet as school starts in late August., 142946=© 2015, Cappex.com, LLC}",
    "textBeforeTable": "06/13/2012 Reviewer is Accepted here and planning to attend soon. Reviewer has not been to campus. 7 out of 7 people found this review useful. 1 of 39 Brandee from San Diego, CA Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new",
    "textAfterTable": "Login to rate or flag the reviews John from LAGUNA NIGUEL, CA 03/03/2012 Reviewer is A current student here. 5 out of 5 people found this review useful. 2 of 39 Categories Comments Food and Dining the dining around tempe is excellent Academic Rigor online course are harder because the course has been condensed to eight weeks, therefore, it requires much more discipline and better study habits. Tips for prospective students online university courses require discipline and good study habits to achieve success, especially if you are taking more than one course at a time. In three sentences i am currently working full time, so the online courses are excellent because of their flexible schedule. the classes are shorter in duration, so you can complete you degree much faster than going to courses on campus. the course selection and availability is excellent, preventing you from having to wait long periods to take",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}