{
    "relation": [
        [
            "Expert",
            "Mitty Plummer",
            "Hai Deng",
            "Perry R. McNeill",
            "Shengli Fu",
            "Hao Li"
        ],
        [
            "College",
            "College of Engineering",
            "College of Engineering",
            "College of Arts and Sciences",
            "College of Engineering",
            "College of Engineering"
        ],
        [
            "Department",
            "Engineering Technology",
            "Electrical Engineering",
            "Engineering Technology",
            "Electrical Engineering",
            "Computer Sciences"
        ]
    ],
    "pageTitle": "Experts Category | News| University of North Texas",
    "title": "Engineering",
    "url": "http://news.unt.edu/experts/category",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989043.35/warc/CC-MAIN-20150728002309-00342-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 173800047,
    "recordOffset": 173775339,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{16616=Site last updated on July 31, 2015}",
    "TableContextTimeStampAfterTable": "{193374=940-565-2000 news_service@unt.edu, 192318=University Service Building 2310 N. I-35E Denton, TX 76205, 193047=University of North Texas 1155 Union Circle #311070 Denton, Texas 76203-5017}",
    "lastModified": "Sun, 02 Aug 2015 12:19:20 GMT",
    "textBeforeTable": "- Choose -AccountingAdvertisingAnthropologyArt HistoryArts &amp; HumanitiesAutismBiologyBusinessBusiness AdministrationChemistryChoralCommunicationsCompositionComputer Information SystemsComputer ScienceConductingCounselingCraftsCriminal JusticeDesign ArtsDisordersEarly Childhood EducationEcologyEconomicsEducationEngineeringEnglishEnvironmentalFashion DesignFinance Insurance Real EstateFrenchGeographyGerontologyHealthHigher EducationHistoryHotel and RestaurantInformation SciencesInformation SystemsInstructionInterior DesignJazz StudiesJournalismLanguageLawLibrary and Information ScienceLinguisticsLiteratureManagementMarketingMaterials ScienceMathematicsMerchandising and HospitalityMusicMusic HistoryNeuroscienceNewsNutritionOrganPeople with DisabilitiesPerformancePhilosophyPhilosophy and ReligionPhotographyPhysical EducationPhysicsPianoPoetryPolitical SciencePsychologyPublic Administration and PlanningRadio Television and FilmRehabilitation and AddictionsSchool AdministrationScienceSecondary EducationSocial ScienceSocial WorkSociologySpanishSpecial EducationSpeech and HearingSportSportsTeacher EducationTechnical WritingTechnology and CognitionTheaterVisual ArtsVocal Affiliation Department Expert Category",
    "textAfterTable": "Frank W. and Sue Mayborn School of Journalism Strategic Communications Sheri Broyles Frank W. and Sue Mayborn School of Journalism Strategic Communications Anthropology Expert College Department Ann T. Jordan College of Public Affairs and Community Service Anthropology Pankaj Jain College of Arts and Sciences Philosophy and Religion Studies Douglas Henry College of Public Affairs and Community Service Anthropology Art History Expert College Department Amy Baxter College of Visual Arts Art Education and Art History Nada M. Shabout College of Visual Arts Art Education and Art History Kelly Donahue-Wallace",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}