{
    "relation": [
        [
            "",
            "Sham+Prompt Laser",
            "0.5 mg Ranibizumab+Prompt Laser",
            "0.5 mg Ranibizumab+Deferred Laser",
            "4 mg Triamcinolone+Prompt Laser"
        ],
        [
            "Description",
            "Sham injection at randomization plus focal photocoagulation 1 week post-injection. Injections are repeated every 4 weeks with focal photocoagulation given post-injection every 16 weeks. Retreatment starting at 16 weeks depends on visual acuity and OCT.",
            "0.5 mg intravitreal ranibizumab at randomization plus focal photocoagulation 1 week post-injection. Injections are repeated every 4 weeks with focal photocoagulation given post-injection every 16 weeks. Retreatment starting at 16 weeks depends on visual acuity and OCT.",
            "0.5 mg intravitreal ranibizumab at randomization, repeated every 4 weeks. Retreatment starting at 16 weeks depends on visual acuity and OCT. If improvement has not occured from injections alone, laser can be given starting at the 24 week visit.",
            "4 mg intravitreal triamcinolone at randomization plus focal photocoagulation 1 week post-injection, repeated every 16 weeks with sham injections at 4-week intervals in-between. Retreatment starting at 16 weeks depends on visual acuity and OCT."
        ]
    ],
    "pageTitle": "Laser-Ranibizumab-Triamcinolone for Diabetic Macular Edema - Study Results - ClinicalTrials.gov",
    "title": "",
    "url": "https://clinicaltrials.gov/ct2/show/results/NCT00444600?sect=Xj015&view=results",
    "hasHeader": true,
    "headerPosition": "MIXED",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989043.35/warc/CC-MAIN-20150728002309-00333-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 872905327,
    "recordOffset": 872890540,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Reporting Groups Participants with two study eyes enrolled each eye in a different treatment group. Therefore, each treatment group/arm includes no more than one study eye for a given participant, and thus the numbers of eyes is equal to the number of participants in each arm. Significant events and approaches for the overall study following participant enrollment, but prior to group assignment Pre-Assignment Details Fifty two academic and community based sites across the United States recruited 691 study participants from March 2007 to December 2008. Key information relevant to the recruitment process for the overall study, such as dates of the recruitment period and locations Recruitment Details   Hide Participant Flow   Participant Flow Drug: Triamcinolone Acetonide + laser Drug: Ranibizumab + laser Drug: Sham injection + laser Drug: Ranibizumab + deferred laser Interventions:",
    "textAfterTable": "Participant Flow:   Overall Study     Sham+Prompt Laser     0.5 mg Ranibizumab+Prompt Laser     0.5 mg Ranibizumab+Deferred Laser     4 mg Triamcinolone+Prompt Laser   STARTED     293 [1]   187 [1]   188 [1]   186 [1] COMPLETED     274 [1]   171 [1]   178 [1]   176 [1] NOT COMPLETED     19     16     10     10   Death              ",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}