{
    "relation": [
        [
            "Day",
            "Mon",
            "Tue",
            "Wed",
            "Thu",
            "Fri",
            "Sat",
            "Sun"
        ],
        [
            "Drink Special",
            "--",
            "--",
            "--",
            "--",
            "--",
            "--",
            "--"
        ],
        [
            "Food Special",
            "--",
            "--",
            "--",
            "--",
            "--",
            "--",
            "--"
        ]
    ],
    "pageTitle": "Hopleaf Bar: Chicago Bar Project",
    "title": "",
    "url": "http://www.chibarproject.com/Reviews/Hopleaf/Hopleaf.htm",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989790.89/warc/CC-MAIN-20150728002309-00114-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 372698040,
    "recordOffset": 372681646,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{28905=Opened in 1992, Hopleaf is located near the corner of Clark and Winona Street, just south of Foster Avenue. To find it, keep your eye out for the modest, hand-made Hopleaf sign depicting the three-leafed hop plant, or the smallish red neon Hopleaf sign both above the wooden door with plate glass. The best way to get there is via cab unless you don't mind a long walk from the Lawrence El stop on the Red Line or the slow boat to China, otherwise known as the Clark Street #22 bus. If you cab it, don't worry. Just because it's way up north you'll be able to find one going back south, which makes it easy to head directly over to the Lakeview Lounge, Carol's Pub or Nick's Uptown for some late-night action., 44006=Hopleaf is one of my favorite bars as it stands out for its relaxed vibe and is a paradise for beer lovers. Hopleaf was even one of only 12 bars in Chicago rated Four Mugs (highest) by The Official Chicago Bar Guide in 2001 and was ranked \"Top Tavern\" nationally by All About Beer. I would especially recommend the Hopleaf, both before and after, a viewing of Too Much Light Makes the Baby Go Blind (TMLMTBGB), which is a 15-year old, ever changing comedic masterpiece put on by the Neo Futurists (located on the southeast corner of Foster and Ashland, just above the Nelson Funeral Home). Just don't expect the locals to welcome you with open arms. For more information, check out the Hopleaf Bar website. Aviva!, 36919=Hopleaf Bites Not only does Hopleaf offer a most impressive array of beer, but they also offer an excellent menu of Belgian food. The dining room can be found up the ramp, past the bookcase in the front room. There you'll find a number of low-slung wooden tables within a high-ceilinged vault of exposed brick and long plate glass windows. The steamed mussels are the stand-out at Hopleaf. I once worked with a Walloon (French Belgian) who has great taste in food and he claimed Hopleaf's mussels to be the best you can find in Chicago. To my mind this \"official\" Belgian certification is tough to beat but, as the Chicago Bites girls point out, make sure you order extra bread up front! The best part about Hopleaf's mussels is dipping your French bread into the beer broth. In addition to the mussels, I've personally had the steak frites several times (hanger steak served with thinly cut french fries), and it is excellent \u0096 as good as I've had at Le Bouchon, my favorite French restaurant in the city. The Chicago Bites girls also point out, with myself in agreement, that the beef stew is very good (even with brussels sprouts) and the \"CB&J\" (cashew, butter & jelly sandwich) was surprisingly savory and good, but the carrot cake and apple fritter desserts were lacking in taste and a disappointment in general. While the dining room is the best spot to enjoy your meal, food is also served in the main barroom. The fare at Hopleaf is excellent for any pub, particularly when combined with a selection of the Belgian ale, so don't be surprised if there's a two-hour wait during primetime on the weekends. My advice: get there early on weekends (before 7pm) or head over to Hopleaf during the week. Though Manhattan's Spotted Pig claims to be the first gastropub in the U.S., Hopleaf predates it by at least six months having opened their kitchen in 2003., 42226=Hopleaf is located in the heart of Andersonville, the Swedish capital of Chicago. Prior to the Hopleaf, the building was operated as Clark Foster Liquors (specifically because of its proximity to that intersection), by owner, Hans Gotling. Hans is a big part of why the neighborhood is called Andersonville in the first place, as it is officially part of the Edgewater neighborhood. To combat the urban decay of the 1960s, Hans, as 47th Ward precinct captain together with the local chamber of commerce, created the area concept of \"Andersonville,\" named after the Swedish Andersonville School, run by Reverend Anderson. Andersonville was a way to celebrate their Swedish ancestry and to bring a renewed sense of pride to an area that suffered from vacant lots and overall neglect. Within just a few years, Andersonville blossomed and is now one of the more sought after residential neighborhoods in the city. In addition, Hans was well known for making homemade glögg—made from a combination of port wine blended with raisins, aquavit (Swedish vodka) and other spices, served hot and too good not to try. Sadly, Hans joined his Viking ancestors in December 2006, but his glögg tradition lives on at Hopleaf.}",
    "lastModified": "Mon, 30 May 2011 03:45:12 GMT",
    "textBeforeTable": "Hopleaf Bar 5148 N. Clark St. (5200N, 1500W) Chicago, IL 60640 (773) 334-9851 \"Friendliest bar on the North Side\" Written by Sean Parnell   © The Chicago Bar Project  ",
    "textAfterTable": "The secret is out: one of the best neighborhood taverns in Chicago is not in Lincoln Park, Bucktown or even Lakeview. It's in the far north Chicago hamlet of Andersonville, and its name is Hopleaf Bar. Locals know it simply as \"Hopleaf\" and desperately try to guard its eroding anonymity from those bar-hopping further south. Even though the weekend crowds pack the place, Hopleaf remains true to its design as a cool neighborhood joint that draws a loyal and increasing following from its laid-back vibe, tasteful decor, eclectic music, the best steamed mussels in the city, a most pleasant outdoor beer garden, and one of the best hop selections in the city with 41 beers on tap—mostly of the Belgian variety, including multiple trappist ales—and over 260 craft brews and imports in bottles. If that wasn't enough, Hopleaf is also one of the first gastropubs in the entire country when it opened its kitchen in 2003, helping to spur the Gastropub Revolution? Since the idea was conceived in the early 1960s, Andersonville has quietly become one of Chicago's most popular neighborhood enclaves. The area is clean, gang-free, easily accessible to the Loop (thanks to Lake Shore Drive and Clark Street buses), and has a unique character due to its Swedish roots and recent influence of older gay couples migrating from Boystown further south. The result is an interesting mix of kitschy boutiques, excellent restaurants like the original location of both Ann",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}