{
    "relation": [
        [
            "Outsourcer name",
            "Secretariat of the Convention on Biological Diversity",
            "Pearl Linguistics Ltd.",
            "TextAppeal / Text Appeal",
            "Wolfestone Translation",
            "Lanzillotta Localizations / L & P Lanzillotta GmbH / Lanzillotta Translations",
            "Freedman International"
        ],
        [
            "Country",
            "Canada",
            "United Kingdom",
            "United Kingdom",
            "United Kingdom",
            "Germany",
            "United Kingdom"
        ],
        [
            "LWA",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5"
        ],
        [
            "Comment",
            "Hidden",
            "Hidden",
            "Hidden",
            "Hidden",
            "Hidden",
            "Hidden"
        ],
        [
            "Outsourcer feedback",
            "...",
            "...",
            "...",
            "Hidden",
            "...",
            "..."
        ]
    ],
    "pageTitle": "Proz-Certified Arabic Translator/Journalist with Extensive Experience in UN, Marketing, Technical and Business Translation Since 1998",
    "title": "",
    "url": "http://www.proz.com/profile/81820",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989043.35/warc/CC-MAIN-20150728002309-00069-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 673935923,
    "recordOffset": 673907126,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Access to Blue Board comments is restricted for non-members. Click the outsourcer name to view the Blue Board record and see options for gaining access to this information. 6 entries Blue Board entries made by this user  PRO-level points: 92, Questions answered: 57, Questions asked: 3 KudoZ activity (PRO) Less More Human Resources Computers: Hardware Computers: Systems, Networks Engineering (general) Textiles / Clothing / Fashion Furniture / Household Appliances History Insurance Investment / Securities Linguistics Management Paper / Paper Manufacturing Patents Law: Patents, Trademarks, Copyright",
    "textAfterTable": "More Less Payment methods accepted Wire transfer, Skrill Year established 1999 Portfolio Sample translations submitted: 2 English to Arabic: Cisco Unveils Nexus 7000 Series Data Center-Class Platform General field: Tech/Engineering Detailed field: Computers: Systems, Networks Source text - English Cisco Unveils Nexus 7000 Series Data Center-Class Platform Cisco Delivers on Data Center 3.0 with Next-Generation Platform for Mission-Critical Data Centers • The Nexus 7000 can run 5 million concurrent trans-continental TelePresence Collaboration experiences which would save 6.75 million tons of CO2. • The data for all US Academic Research Libraries – estimated at over 2,000 Terabytes of Data – can be transmitted in 1.07 seconds using Cisco's newest class of data center networking. • With Cisco Data Center 3.0 technology you could copy the entire Wikipedia database in 10 milliseconds – 1/5 of the time it takes to blink. • With Cisco Data Center 3.0 technology you could copy the entire searchable Internet in 7.5 Minutes. SAN JOSE, Calif., Jan. 28, 2008 —Cisco® announced today an innovative family",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}