{
    "relation": [
        [
            "",
            "",
            "",
            ""
        ],
        [
            "Item",
            "Uncut dragonstone",
            "Uncut diamond",
            "Uncut ruby"
        ],
        [
            "Quantity",
            "1",
            "3",
            "3"
        ],
        [
            "Rarity",
            "Always",
            "Always",
            "Always"
        ],
        [
            "GE market price",
            "12,516",
            "11,730",
            "6,900"
        ]
    ],
    "pageTitle": "Crystal chest - The RuneScape Wiki",
    "title": "",
    "url": "http://runescape.wikia.com/wiki/Crystal_chest",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986423.95/warc/CC-MAIN-20150728002306-00320-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 214959879,
    "recordOffset": 214915191,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{79107=This chest was released with part 1 of Prifddinas on 22 September 2014 and is located in the Iorwerth Manor against the south wall. It has an improved drop table over the chest in Taverley. While the Voice of Seren is active for the Iorwerth clan, the chest provides an increased chance of Prifddinas-related items looted, including: corrupted ore, Crystal tree blossoms, and Crystal motherlode shards. At the least, the player should still wear a Ring of wealth when opening either crystal chest.}",
    "lastModified": "Tue, 28 Jul 2015 17:33:37 GMT",
    "textBeforeTable": "The expected value of Possibility 1 is 63,097, which is a profit/loss of 12,275 if buying the crystal key on the GE. Possibility 1 - Fruit tree seedEdit Possibilities - Taverley chestEdit It is a common misconception that you can obtain crystal weapons from the chest. The chest does not contain any of these items, as they are a quest reward. It is only possible to obtain rune platelegs if you are a male character, and a rune plateskirt if you are female character. After an update, wearing a ring of wealth will increase your chances of getting a better drop. The chest loot always includes an uncut dragonstone, together with a random reward generated from 13 possible reward tables. Below are the values of the chest's contents, based on current Grand Exchange prices. RewardsEdit [show] Contents The crystal key chest is a treasure chest located in",
    "textAfterTable": "Palm tree seed 1 Common[1] 150,619 ^ a b c With Possibility 1, you are guaranteed to get either a calquat tree seed, a papaya tree seed or a palm tree seed. Both the calquat and papaya tree seed have a probability of 5:11 (45.45%), and the palm tree seed has a probability of 1:11 (9%). Possibility 2 - Lantadyme seedsEdit The expected value of Possibility 2 is 24,578, which is a profit/loss of -26,244 if buying the crystal key on the GE. Item Quantity Rarity GE market price Uncut dragonstone 1 Always 12,516",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}