{
    "relation": [
        [
            "Name",
            "1.",
            "2.",
            "3.",
            "4.",
            "5.",
            "6.",
            "7.",
            "8.",
            "9.",
            "10.",
            "11.",
            "12.",
            "13.",
            "14.",
            "15.",
            "16.",
            "17.",
            "18.",
            "19.",
            "20.",
            "21."
        ],
        [
            "Date",
            "Unknown, 21",
            "Ismatov, Bobomurad",
            "Unknown Police Officer",
            "Unknown Soldier, 23",
            "Unknown",
            "Unknown Soldier, 23",
            "Unknown Soldier, 35",
            "Cuellar Beltran, Jorge Alberto",
            "Abdullah Salih al-Hajiri",
            "Avraham, Ezra, 19",
            "Yeong Sik Shin",
            "David, Ernesto, 28",
            "Lotero, Hector",
            "Lacsina, Ederlino L.",
            "Unknown Soldier, 26",
            "Cervantes, Richard, 20",
            "Marish Ali Al-Akhram, 30",
            "Mohammed Hassan al-Wajeeh, 30 (محمد حسن)",
            "Unknown Soldier",
            "Jung, Heidrun-Erika, 49",
            "Garcia, Rodolfo, 24"
        ],
        [
            "Year",
            "Nov. 2",
            "Feb. 7",
            "May 8",
            "May 1",
            "May 10",
            "Laos",
            "Laos",
            "Aug. 17",
            "Aug. 4",
            "Feb. 4",
            "May 18",
            "Dec. 2",
            "Aug. 17",
            "March 18",
            "1959",
            "Oct. 12",
            "Aug. 22",
            "Feb. 2",
            "Dec. 5",
            "Dec. 24",
            "May 10"
        ],
        [
            "Location",
            "1979",
            "1994",
            "1973",
            "1993",
            "1972",
            "8",
            "7",
            "1991",
            "1999",
            "1975",
            "1968",
            "1980",
            "1969",
            "1978",
            "Laos",
            "1996",
            "2003",
            "2008",
            "1954",
            "1996",
            "1969"
        ],
        [
            "Country",
            "Sakhon Nakhon province",
            "Kulyab",
            "Phitsanulok Province",
            "Nongmasaew",
            "Thailand",
            "12",
            "30",
            "Comasagua",
            "Sana’a",
            "Netanya",
            "Andong City",
            "Manila",
            "Apartadó",
            "Camarines Sur",
            "4",
            "Poblacion",
            "Hawth",
            "Sana’a",
            "Bou Amrane",
            "Frankfurt",
            "Maplas"
        ],
        [
            "Killed",
            "Thailand",
            "Tajikistan",
            "Thailand",
            "Thailand",
            "9",
            "Killed by the explosion",
            "Killed by the explosion",
            "El Salvador",
            "Yemen",
            "Israel",
            "South Korea",
            "Philippines",
            "Colombia",
            "Philippines",
            "20",
            "Philippines",
            "Yemen",
            "Yemen",
            "Tunisia",
            "Germany",
            "Philippines"
        ],
        [
            "Injured",
            "12",
            "12",
            "11",
            "9",
            "10",
            "[111]",
            "[111]",
            "6–8",
            "6–7",
            "6",
            "5–7",
            "5",
            "5",
            "5",
            "Arrested",
            "3",
            "2",
            "2",
            "2",
            "2",
            "2"
        ],
        [
            "Additional Notes",
            "40+",
            "28",
            "12–21",
            "23",
            "Arrested",
            "",
            "",
            "54–90",
            "40–43",
            "26",
            "43–52",
            "28–34",
            "25",
            "14",
            "[119]",
            "15",
            "34",
            "23–25",
            "13",
            "13",
            "11"
        ],
        [
            "Ref.",
            "Arrested",
            "Committed suicide",
            "Killed by the explosion",
            "Arrested",
            "[110]",
            "",
            "",
            "[112]",
            "Arrested",
            "Arrested",
            "Sentenced to death",
            "Arrested",
            "[117]",
            "Arrested",
            "",
            "Arrested",
            "Arrested",
            "Sentenced to death",
            "Shot by soldiers",
            "Killed by the explosion",
            "[125]"
        ],
        [
            "",
            "[106]",
            "[107]",
            "[108]",
            "[109]",
            "",
            "",
            "",
            "",
            "[113]",
            "[114]",
            "[115]",
            "[116]",
            "",
            "[118]",
            "",
            "[120]",
            "[121]",
            "[122]",
            "[123]",
            "[124]",
            ""
        ]
    ],
    "pageTitle": "Pistols | Pronk Palisades",
    "title": "",
    "url": "https://raymondpronk.wordpress.com/category/war/weapons/pistols/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986423.95/warc/CC-MAIN-20150728002306-00314-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 890282655,
    "recordOffset": 890093624,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{115327=http://hosted.ap.org/dynamic/stories/U/UN_UNITED_NATIONS_IRAN_NUCLEAR_DEAL?SITE=AP&SECTION=HOME&TEMPLATE=DEFAULT&CTIME=2015-07-20-12-04-13, 6679=1:48 AM, JUL 10, 2015 • BY BENJAMIN WEINTHAL AND EMANUELE OTTOLENGHI, 57261=Posted on July 11, 2015. Filed under: American History, Ammunition, Articles, Banking, Blogroll, Bomb, Bunker Busters, Business, Central Intelligence Agency (CIA), College, Communications, Congress, Constitution, Corruption, Crime, Culture, Dirty Bomb, Documentary, Drones, Economics, Education, Employment, Energy, Entertainment, Ethic Cleansing, Faith, Family, Federal Bureau of Investigation (FBI), Federal Government, Federal Government Budget, Fiscal Policy, Foreign Policy, Freedom, Friends, government, government spending, Health Care, history, Illegal, Immigration, Islam, Islam, Law, Legal, liberty, Life, Links, Macroeconomics, media, Missiles, Monetary Policy, Money, Money, Music, National Security Agency (NSA_, Natural Gas, Nuclear, Nuclear Power, Nuclear Proliferation, Obamacare, Oil, Oil, People, Philosophy, Photos, Pistols, Police, Political Correctness, Politics, Press, Psychology, Radio, Radio, Rants, Raves, Regulations, Religious, Resources, Rifles, Security, Shite, Space, Sunni, Talk Radio, Taxation, Taxes, Technology, Television, Terrorism, Unemployment, Video, War, Weapons, Weapons of Mass Destruction | Tags: 10 July 2015, America, articles, Audio, B-52s, Breaking News, Broadcasting, Bunker Busters, capitalism, Cartoons, Charity, Citizenship, Clarity, Classical Liberalism, Collectivism, Commentary, Commitment, Communicate, Communication, Concise, Convincing, Courage, Culture, Current Affairs, Current Events, Divine, Donald Trump, economic growth, economic policy, Economics, Education, Egypt, Evil, Experience, Faith, Family, First, fiscal policy, free enterprise, freedom, freedom of speech, Friends, Give It A Listen, God, Good, Goodwill, Growth, Hope, illegal immigration, Individualism, Iran, Iran's Nuclear Bomb Factories, Islamic Republic of Iran, Islamic State, Jordan, Keywords and Tags for Pronk Pops Show The Pronk Pops Show, Knowledge, Legacy, liberty, Life, Love, Lovers of Liberty, monetary policy, MPEG3, national debt, National Interest, National Security, Natural Gas, Negotiations, News, Nobel Peace Prize, Nuclear Proliferation, Nuclear weapons, Oil, Opinions, Peace, Photos, Podcasts, Political Philosophy, Politics, President Barack Obama, prosperity, Radio, Raymond Thomas Pronk, Representative Republic, Republic, Resources, Respect, rule of law, Rule of Men, Saudia Arabia, Secretary of State John Kerry, Show Notes, Talk Radio, terror, Terrorism, The Four Seasons, The Pronk Pops Show, The Pronk Pops Show 502, third party, Treason, Truth, Turkey, Tyranny, U.S., U.S. Constitution, U.S. Troops, Ultimatum, United States, United States of America, Videos, Virtue, Walk Like A Man, War, Wisdom, World Leading Terrorist Nation |, 81182=The third type of executive agreement is one adopted by the President without explicit approval of either the Senate or the Congress as a whole. The Supreme Court and modern practice embrace the idea that the President may under some circumstances make these so-called sole executive agreements. United States v. Belmont (1937); United States v. Pink (1942). But the scope of this independent presidential power remains a serious question. The Pink and Belmont cases involved agreements relating to the recognition of a foreign government, a power closely tied to the President’s textual power to receive ambassadors (Article II, Section 3). The courts have consistently permitted the President to settle foreign claims by sole executive agreement, but at the same time have emphasized that the Congress has acquiesced in the practice. Dames & Moore v. Regan (1981);American Insurance Ass’n v. Garamendi (2003). Beyond this, the modern limits of the President’s ability to act independently in making international agreements have not been explored. With respect to treaty termination, modern practice allows the President to terminate treaties on his own. In recent times, President James Earl Carter terminated the U.S.–Taiwan Mutual Defense Treaty in 1977, and President George W. Bush terminated the ABM Treaty with Russia in 2001. The Senate objected sharply to President Carter’s actions, but the Supreme Court rebuffed the Senate in Goldwater v. Carter (1979). President Bush’s action was criticized in some academic quarters but received general acquiescence. In light of the consensus early in Washington’s administration, it is probably fair to say that presidential termination does not obviously depart from the original understanding, inasmuch as the Framers were much more concerned about checks upon entering into treaties than they were about checks upon terminating them., 106615=Between 1946 and 1999, the United States completed nearly 16,000 international agreements. Only 912 of those agreements were treaties, submitted to the Senate for approval as outlined in Article II of the United States Constitution. Since the Franklin Roosevelt presidency, only 6% of international accords have been completed as Article II treaties.[1] Most of these executive agreements consist of congressional-executive agreements., 86596=The third view is that the Congress as a whole has the power to terminate treaties, based on an analogy between treaties and federal laws. When the United States first terminated a treaty in 1798 under John Adams, this procedure was adopted, but there was little discussion of the constitutional ramifications., 165191=Posted on July 20, 2015. Filed under: American History, Ammunition, Articles, Babies, Banking, Blogroll, Bomb, Books, British History, Bunker Busters, Business, Central Intelligence Agency (CIA), College, Communications, Congress, Constitution, Corruption, Crime, Crisis, Defense Intelligence Agency (DIA), Diasters, Dirty Bomb, Documentary, Drones, Economics, Education, Ethic Cleansing, European History, Faith, Family, Federal Bureau of Investigation (FBI), Federal Bureau of Investigation (FBI), Federal Communications Commission, Federal Government Budget, Fiscal Policy, Fraud, Freedom, Friends, Genocide, government, government spending, Illegal, Immigration, Islam, Language, Law, Legal, liberty, Life, media, Middle East, Missiles, Monetary Policy, Money, Music, National Security Agency (NSA_, Natural Gas, Non-Fiction, Nuclear, Nuclear Proliferation, Oil, Philosophy, Photos, Pistols, Police, Politics, Press, Public Sector, Radio, Rants, Raves, Regulations, Religious, Resources, Securities and Exchange Commission, Security, Speech, Talk Radio, Tax Policy, Taxation, Taxes, Terrorism, Unemployment, Union, Unions, Video, War, Wealth, Weapons, Weapons of Mass Destruction, Welfare, Wisdom, Writing | Tags: ' And Rewrote The Constitution's Treaty Provision, 20 july 2015, America, articles, Audio, Betrayal of Oath of Office, Breaking News, Broadcasting, capitalism, Cartoons, Charity, Citizenship, Clarity, Classical Liberalism, Collectivism, Commentary, Commitment, Communicate, Communication, Concise, Congress and President Betray The United States Constitution, Convincing, Courage, Culture, Current Affairs, Current Events, Democratic, Donald Trump, economic growth, economic policy, Economics, Education, Evil, Experience, Faith, Family, FEDERALIST NO. 75, First, fiscal policy, Four Tops, free enterprise, freedom, freedom of speech, Friends, General Patton, George Pataki: Iran deal is bad for civilized world, Give It A Listen, God, Good, Good Deal or Bad Deal, Goodwill, Growth, Hope, Independents, Individualism, Iran Nuclear Deal the Very Worst, Judge Napolitano, Just Walk Way From Both Political Parties, Knowledge, Levin: 'U.S. Senate Just Capitulated To Obama, liberty, Life, Love, Lovers of Liberty, monetary policy, MPEG3, Music, Never Again Fasicism, News, Obama The Tyrant, Opinions, Party, Peace, Photos, Podcasts, Political Philosophy, Politics, President Obama, prosperity, Radio, Raymond Thomas Pronk, Representative Republic, Republic, Republican Party, Resources, Respect, rule of law, Rule of Men, Senator Bob Corker, Show Notes, Songs, Story 1, Talk Radio, Ted Cruz, The Iran nuclear deal, The Pronk Pops Show, The Pronk Pops Show 508, The Traitorous Terrorist Treaty, Treaty Powers, Truth, Tyranny, U.S. Constitution, United Nations Security Council, United Nations Security Council Pass The Traitorous Terrorist Treaty Before Congress Votes It Down -- Congress and President Betray The United States Constitution -- Just Walk Way From Both Political , United States Constitution, United States of America, Videos, Virtue, War, Wisdom, world government |, 2189=Iran has had a long history of trying to obtain nuclear technology from German companies, particularly by seeking ways to transport merchandise in circumvention of international sanctions. Since November 2013, Tehran has sought industry computers, high-speed cameras, cable fiber, and pumps for its nuclear and missile program. It appears that Iran’s readiness to negotiate does not reflect any substantive policy change. Rather, it is a diplomatic tactic retreat forced by economic distress, not a strategic rethinking of its priorities., 88080=A third difficult question is whether the Treaty Clause implies a Senate power or role in treaty termination. Scholarly opinion is divided, and few Framers appear to have discussed the question directly. One view sees the power to make a treaty as distinct from the power of termination, with the latter being more akin to a power of implementation. Since the Constitution does not directly address the termination power, this view would give it to the President as part of the President’s executive powers to conduct foreign affairs and to execute the laws. When the termination question first arose in 1793, Washington and his Cabinet, which included Hamilton and Thomas Jefferson, embraced this view. All of them thought Washington could, on his own authority, terminate the treaty with France if necessary to keep the United States neutral., 5687=More evidence of Iranian violations has now surfaced. Two reports regarding Iran’s attempts to illicitly and clandestinely procure technology for its nuclear and ballistic missile programs have recently been published. They show that Iran’s procurement continues apace, if not faster than before the Joint Plan of Action was signed in November 2013. But fear of potentially embarrassing negotiators and derailing negotiations has made some states reluctant to report Tehran’s illegal efforts. If these countries have hesitated to expose Iran during the negotiations, it is more likely they will refrain from reporting after a deal is struck., 116387=She urged Iran to release three “unjustly imprisoned” Americans and to determine the whereabouts of Robert Levinson, a former FBI agent who vanished in Iran in 2007., 104281=In Goldwater v. Carter,[10] Congress challenged the constitutionality of then-president Jimmy Carter‘s unilateral termination of a defense treaty. The case went before the Supreme Court and was never heard; a majority of six Justices ruled that the case should be dismissed without hearing an oral argument, holding that “The issue at hand … was essentially a political question and could not be reviewed by the court, as Congress had not issued a formal opposition.” In his opinion, Justice Brennan dissented, “The issue of decision making authority must be resolved as a matter of constitutional law, not political discretion; accordingly, it falls within the competence of the courts”. Presently, there is no official ruling on whether the President has the power to break a treaty without the approval of Congress, and the courts also declined to interfere when President George W. Bush unilaterally withdrew the United States from the ABM Treaty in 2002, six months after giving the required notice of intent.[11], 100506=In 1972, Congress passed legislation requiring the president to notify Congress of any executive agreements that are formed.[13], 95887=http://www.breitbart.com/big-government/2015/03/28/alexander-hamiltons-warning-against-obama-and-the-iran-deal/}",
    "TableContextTimeStampAfterTable": "{34135=The proposal will effectively extend a limited series of concessions Iran made last November as part of a temporary deal to get negotiations started on a permanent accord. In return, Iran wants step-by-step relief from sanctions that have substantially weakened its economy., 250784=Police say they thought Roof was the lone gunman within hours of the bloody attack on the church, which was founded in 1816. Asked whether authorities believe Roof had acted alone, Mullen said: “We don’t have any reason to believe anyone else was involved.”, 119686=A satellite image of Natanz in 2007.GeoEye/SIME, via Associated Press, 7049=On 6 October 2009, ABC News reported that the Pentagon had requested and obtained permission from the U.S. Congress to shift funding in order to accelerate the project.[8][9] It was later announced by the U.S. military that “funding delays and enhancements to the planned test schedule” meant the bomb would not be deployable until December 2010, six months later than the original availability date.[10], 89186=After a brief spurt of optimism, talks between Iran and six world powers on its disputed nuclear program fail to produce a breakthrough in Baghdad. The United States, Russia, China, Britain, France and Germany wanted a freeze on Iranian production of uranium enriched to 20 percent purity, which is considered a short step from bomb grade. The Iranians wanted an easing of the onerous economic sanctions imposed by the West and a recognition of what they call their right to enrich. The countries agree to meet again in June, but talks were further slowed after a new regimen of harsh economic sanctions and a statement from the International Atomic Energy Agency that said Iran had made ”no progress” toward providing access to restricted sites it suspects of being used to test potential triggers for nuclear warheads., 37034=Iran and a group of six world powers complete a deal that will temporarily freeze much of Tehran’s nuclear program starting Jan. 20, in exchange for limited relief from Western economic sanctions., 10037=In 2012, the Pentagon requested $82 million to develop greater penetration power for the existing weapon.[1] A 2013 report stated that the development had been a success,[17] and B-2 integration testing began that year.[18], 19001=By SHREEYA SINHA and SUSAN CAMPBELL BEACHY UPDATED April 2, 2015, 13267=B-52 releases a MOP during a weapons test, 2009., 148250=JUN. 23, 2015, 171765=Posted on June 24, 2015. Filed under: American History, Articles, Blogroll, British History, Business, Chemistry, Communications, Constitution, Corruption, Crime, Crisis, Culture, Education, Entertainment, European History, Faith, Family, Freedom, Friends, Games, government, government spending, history, Homicide, Law, liberty, Life, Links, media, Medicine, Money, Music, Music, People, Philosophy, Photos, Pistols, Police, Politics, Press, Psychology, Radio, Radio, Rants, Raves, Regulations, Religion, Religious, Religious, Science, Speech, Talk Radio, Television, Television, Terrorism, Video, War, Weapons, Welfare, Wisdom, Writing | Tags: 19 June 2015, America, Antidepressants, Antidepressants Side Effects, Art, articles, Audio, Best 7 minutes on gun control, Black On Black Crime, Breaking News, Broadcasting, capitalism, Cartoons, Charity, Charleston, Charleston Church Shooter, Citizenship, Clarity, Classical Liberalism, Collectivism, Commentary, Commitment, Communicate, Communication, Concise, Convincing, Courage, Court Appearance, Culture, Current Affairs, Current Events, depression, Dr Susan Gratia-Hupp, Drug User, Dylann Roof, Dylann Storm Roof, economic growth, economic policy, Economics, Education, Evil, Evil Murderer, Experience, Faith, Family, First, fiscal policy, free enterprise, freedom, freedom of speech, Friends, Games, Give It A Listen, God, Good, Goodwill, Growth, Gun Free Zone, Gun Free Zones, Gun Grabbers, Homicide, Hope, Individualism, Jefferson Airplane, Knowledge, liberty, Life, Love, Lovers of Liberty, Luvox, Mass Shooting and Homicides, Medicated to Death, Mentally Disturbed, monetary policy, MPEG3, Murderer, Music, News, Nights In White Satin, Opinions, Paranoia, Pattern, Peace, Photos, Podcasts, Political Philosophy, Politics, President Barack Obama, prosperity, Prozac, Psychosis, Psychotropic Drugs, Racist, Radio, Raymond Thomas Pronk, Representative Republic, Republic, Resources, Respect, rule of law, Rule of Men, Selective Seratonin Reuptake Inhibitors (SSRI), Show Notes, Somebody to love, Songs, South Carolina, SSRI Withdrawals, SSRIs and Mass Killings, Suicide, Talk Radio, The Animals, The House of the Rising Sun, The Marketing of Madness, The Moody Blues, The Pronk Pops Show, The Pronk Pops Show 489, Truth, Tyranny, U.S. Constitution, U.S. Crime Statistics, United States of America, Video Games, Videos, Violent Behaviour, Violent Thoughts, Virtue, War, White Rabbit, Wisdom, Zoloft |, 123206=But doubts about the intelligence persist among some experts, in part because American officials, citing the need to protect their source, have largely refused to provide details of the origins of the laptop beyond saying that they obtained it in mid-2004 from a source in Iran who they said had received it from a second person, now believed to be dead., 230496=Divorce papers filed by Ms Paige in 2008 claim that Franklin Roof had hit her and that any hope Dylann had of a normal home left with her, it was reported by the Inquisitr., 87746=In January 2013, Iran’s oil minister, Rostam Qasemi, acknowledged for the first time that petroleum exports and sales had fallen by at least 40 percent in the previous year, costing the country $4 billion to $8 billion each month., 57972=Mr. Rouhani replaces his predecessors’ foreign minister with Mohammad Javad Zarif, an American-educated diplomat known for his understanding of the West, and makes him responsible for negotiations over Iran’s nuclear program. Mr. Rouhani also removes a hard-line nuclear scientists as head of Iran’s Atomic Energy Organization, and replaces him with the former foreign minister, Ali Akbar Salehi. In September, Iran’s longtime ambassador to the International Atomic Energy Agency will be replaced as well., 6184=Northrop Grumman announced a $2.5-million stealth-bomber refit contract on 19 July 2007. Each of the U.S. Air Force’s B-2s is to be able to carry two 14-ton MOPs.[6][7], 129993=Mohammad Khatami in 2009. Hasan Sarbakhshian/Associated Press, 140580=The shah is overthrown and flees the country, in what becomes known as the Islamic Revolution of 1979., 339029=Among those also at the event were January Jones, Ted Sarandos, Jason Collins and Matthew Weiner., 147113=JUL. 10, 2015, 12494=Mock up of MOP inside a bomb bay of a B-2 simulator, 2007.[6], 96320=After a dip in enriched uranium production in 2010 because of the cyberattacks, Iranian production recovers. While the United States and Israel never acknowledged responsibility for the cyberprogram, Olympic Games, some experts argue that it set the Iranians back a year or two. Others say that estimate overstates the effect., 11211=MOP being offloaded in preparation for its first explosive test, 2007., 94670=A stealth C.I.A. drone, the RQ-170 Sentinel, crashes near the Iranian town of Kashmar, 140 miles from the Afghan border. It is part of a stepped-up surveillance program that has frequently sent the United States’ most hard-to-detect drone into Iran to map suspected nuclear sites., 11798=MOP underground atWhite Sands Missile Range before its first explosive test, 2007., 7929=The project has had at least one successful Flight Test MOP launch.[11] The final testing will be completed in 2012.[3], 133117=Iran announces that it will sign an $800 million contract with Russia to complete construction on one of two light water reactors at the Bushehr nuclear plant within four years. After many delays, the project was completed in 2010., 206107=This updated site includes the stories from the previous site and new ones from 2011 to date.  We have used a new “category” classification system on the new stories.  We are working back through previously SSRI Stories to bring them into the new classification system.  In the meantime use the search box in the upper right column to search through both the old and the new stories., 79128=Speaking to air force commanders in Tehran on Feb. 6, Ayatollah Khamenei said Iran “will not negotiate under pressure.” Khamenei Official Web site, via European Pressphoto Agency, 141653=The Bushehr nuclear plant on Aug. 21, 2010, as its first fuel rod was loaded. Getty Images, 9028=On 14 November 2011, Bloomberg reported that the Air Force Global Strike Command started receiving the Massive Ordnance Penetrator and that the deliveries “will meet requirements for the current operational need”.[14] The Air Force now has received delivery of 16 MOPs as of November 2011.[15] And as of March 2012, there is an “operational stockpile” at Whiteman Air Force Base.[16], 46641=Iran and a group of six world powers say that they have engaged in “substantive” and “forward-looking” discussions on the disputed Iranian nuclear program and that they will reconvene on November 7., 8789=On 7 April 2011, the USAF ordered eight MOPs plus supporting equipment for $28 million.[13], 252093=http://www.usatoday.com/story/news/nation/2015/06/19/dylann-roof-charleston-police-charged–murder-black-church/28975573/, 325063=by PAUL JOSEPH WATSON | JUNE 18, 2015, 90821=President Mahmoud Ahmadinejad surveying the centrifuges at Iran’s underground complex at Natanz in March 2007.Office of the Iranian President, 126251=An Iranian missile displayed by the Revolutionary Guards under a portrait of the supreme leader, Ayatollah Khamenei, in September 2003. Henghameh Fahimi/Agence France-Presse, 70856=Iran’s president announces an expansion of the country’s uranium production and claims other atomic energy advances, striking a pugnacious tone in the aftermath of diplomatic talks thatended in an impasse with the big powers on April 6 in Kazakhstan., 145996=APRIL 13, 2012, 6637=The initial explosive test of MOP took place on 14 March 2007 in a tunnel belonging to the Defense Threat Reduction Agency (DTRA) at the White Sands Missile Range, New Mexico., 347605=http://townhall.com/columnists/johnhawkins/2013/03/05/5-things-the-gun-grabbers-apparently-dont-understand-n1525945/page/full, 109493=When the memo becomes public in April, Mr. Gates issues a statement saying that he wishes to dispel any perception among allies that the administration had failed to adequately think through how to deal with Iran., 270950=Posted on June 19, 2015. Filed under: American History, Articles, Biology, Blogroll, Business, Chemistry, Communications, Corruption, Crime, Crisis, Faith, Family, Federal Government, Freedom, Friends, government, government spending, history, Homicide, Law, liberty, Life, Links, media, Medicine, Money, Narcissism, People, Philosophy, Photos, Pistols, Police, Politics, Press, Psychology, Radio, Rants, Raves, Regulations, Religious, Science, Security, Speech, Talk Radio, Television, Terrorism, Video, Weapons, Welfare, Wisdom, Writing | Tags: 9 Killed, America, articles, Audio, Best 7 minutes on gun control, Black On Black Crime, Breaking News, Broadcasting, capitalism, Cartoons, Charity, Charleston, Citizenship, Clarity, Classical Liberalism, Collectivism, Commentary, Commitment, Communicate, Communication, Concealed Carry Weapons Permit, Concise, Convincing, Courage, Crime, Crime Statistics, Culture, Current Affairs, Current Events, Dr Susan Gratia-Hupp, Dylann Roof, economic growth, economic policy, Economics, Education, Evil, Experience, Faith, Family, First, fiscal policy, free enterprise, freedom, freedom of speech, Friends, Give It A Listen, God, Good, Goodwill, Growth, gun control, Homicides, Hope, Individualism, John Lott, Knowledge, liberty, Life, Love, Lovers of Liberty, Mass Shooting, Mass Shooting and Homicides, monetary policy, MPEG3, News, Opinions, Peace, Photos, Podcasts, Political Philosophy, Politics, President Barack Obama, prosperity, Radio, Raymond Thomas Pronk, Representative Republic, Republic, Resources, Respect, rule of law, Rule of Men, Second Amendment, Show Notes, South Carolina, Talk Radio, Texas Open Carry, The Pronk Pops Show, The Pronk Pops Show 488, Truth, Tyranny, U.S. Constitution, United States Constitution, United States of America, Videos, Virtue, War, Wisdom |, 118441=In November, Iran seeks international assistance to ensure safe operation for a 40-megawatt reactor it is building. Citing broader doubts about Iran’s nuclear ambitions, the United Nations atomic agency, the United States and European countries oppose offering help., 21199=Iran and European nations say they have reached an understanding about next steps, but key issues need to be resolved before a final agreement by June 30., 74430=President Obama traveled to Israel on March 20, in a symbolic two-day visit to the country, the first of his presidency., 121212=President Ahmadinejad offended Israel in his speech on the rule of law at a United Nations conference in 2012. Eduardo Munoz/Reuters, 340932=http://variety.com/2015/biz/news/president-obama-chuck-lorre-tyler-perry-fundraisers-1201523360/, 229971=Mr Roof’s manifesto, published online, shows how the 21-year-old’s views hardened after the shooting of Travyon Martin in Florida in 2012. Ms Paige claimed that it was only after her step-son began living with his mother over the past few years that he became a recluse., 224833=As a survivor of the Luby’s massacre, Hupp testified across the country in support of concealed-handgun laws. She said that if there had been a second chance to prevent the slaughter, she would have violated the Texas law and carried the handgun inside her purse into the restaurant. She testified across the country in support of concealed handgun laws, and was elected to the Texas House of Representatives in 1996. The law was signed by then-Governor George W. Bush., 8347=The Air Force took delivery of 20 bombs, designed to be delivered by the B-2 bomber, in September 2011. In February 2012, Congress approved $81.6 million to further develop and improve the weapon.[12], 143378=With the American-provided research reactor running, starting in 1967, Iran becomes one of 51 nations to sign the Nuclear Non-Proliferation Treaty, agreeing to never become a nuclear-weapon state., 132635=A Russian engineer checking equipment at the Bushehr nuclear plant in April 2007.Behrouz Mehri/Agence France-Presse — Getty Images, 142442=A year later, Kraftwerk Union, a West German company, agrees to construct two light water reactors to produce nuclear energy at the Bushehr complex, 470 miles south of Tehran. Construction begins in 1974 but the contract is not signed until 1976., 130529=He issues a joint statement with King Fahd expressing concerns about Israel’s nuclear weapons program and support for ridding the Middle East of nuclear weapons. In 2003, Iran supports such a proposal initiated by Syria., 296814=Charleston, S.C., shooting suspect Dylann Storm Roof, second from left, is escorted from the Shelby Police Department in Shelby, N.C., Thursday, June 18, 2015. Roof is a suspect in the shooting of several people Wednesday night at the historic The Emanuel African Methodist Episcopal Church in Charleston, S.C. (AP Photo/Chuck Burton), 3250=In 2002, Northrop Grumman and Lockheed Martin were working on the development of a 30,000-lb (13,600 kg) earth-penetrating weapon, said to be known as “Big BLU“. But funding and technical difficulties resulted in the development work being abandoned. Following the 2003 invasion of Iraq, analysis of sites that had been attacked with bunker-buster bombs revealed poor penetration and inadequate levels of destruction.[citation needed]This renewed interest in the development of a super-large bunker-buster, and the MOP project was initiated by the Defense Threat Reduction Agency to fulfill a long-standing Air Force requirement.[3], 139265=Any nuclear cooperation between Iran and the United States breaks down completely with the American Embassy hostage crisis from November 1979 until January 1981., 48993=President Obama says he has spoken by phone with President Hassan Rouhani, the first direct contact between the leaders of Iran and the United States since 1979. Mr. Obama, speaking in the White House briefing room, said the two leaders discussed Iran’s nuclear program and said he was persuaded there was a basis for an agreement., 101821=Shahram Amiri, an Iranian nuclear scientist who American officials say defected to the United States in 2009, provided information about Iran’s nuclear weapons program and then developed second thoughts, returning to Iran. (After a hero’s welcome, he was imprisoned on treason charges and tortured, according to reports from Iran.), 137707=The Iran-Iraq war, from 1980 to 1988, changes Iran’s thinking about the nuclear program. With Saddam Hussein pursuing a nuclear program in Iraq, Ayatollah Khomeini secretly decides to restart Iran’s program and seeks the assistance of German partners to complete the construction at Bushehr, which was damaged by bombs during the war., 69249=On March 14, The Treasury Department, which administers the government’s Iran sanctions, blacklisted a Greek shipping tycoon, Dimitris Cambis, over what it called his scheme to acquire a fleet of oil tankers on Iran’s behalf and disguise their ownership to ship Iranian oil., 13518=On 25 June 2010, USAF Lt. Gen. Phillip Breedlove said that the Next-generation Penetrator Munition should be about a third the size of the Massive Ordnance Penetrator so it could be carried by affordable aircraft.[19] In December 2010, the USAF had a Broad Agency Announcement (BAA) for the Next Generation Penetrator (NGP).[20], 146551=JUL. 10, 2015, 128451=The program includes a vast uranium enrichment plant at Natanz and a heavy water plant at Arak. In December, satellite photographs of Natanz and Arak appear widely in the news media. The United States accuses Tehran of an “across-the-board pursuit of weapons of mass destruction,” but takes relatively little action because it is focused on the approaching invasion of Iraq the next year., 1059342=Posted on June 13, 2015. Filed under: American History, Ammunition, Blogroll, Bomb, Books, British History, Central Intelligence Agency (CIA), Communications, Constitution, Corruption, Culture, Dirty Bomb, Documentary, Drones, Economics, Employment, Energy, Ethic Cleansing, European History, Faith, Family, Federal Government, Federal Government Budget, Fiscal Policy, Foreign Policy, Freedom, government, government spending, history, Illegal, Immigration, Inflation, Investments, IRS, Islam, Law, Legal, liberty, Life, Links, media, Middle East, Missiles, Money, National Security Agency (NSA), National Security Agency (NSA_, Natural Gas, Non-Fiction, Nuclear, Nuclear Power, Oil, People, Philosophy, Photos, Pistols, Politics, Radio, Radio, Rants, Raves, Religious, Rifles, Security, Speech, Talk Radio, Tax Policy, Taxes, Technology, Television, Terrorism, Unemployment, Video, War, Wealth, Weapons, Weapons of Mass Destruction, Welfare, Wisdom, Writing | Tags: 11 June 2015, Ambassador Robert Joseph, America, articles, Audio, Bernard Haykel, Breaking News, Broadcasting, capitalism, Cartoons, Charity, Christian Crusades Commences, Citizenship, Clarity, Classical Liberalism, Collectivism, Commentary, Commitment, Communicate, Communication, Concise, Congress Declares War, Congressman Ron Paul, Convincing, Courage, Culture, Current Affairs, Current Events, economic growth, economic policy, Economics, Education, Evil, Experience, Faith, Family, First, fiscal policy, free enterprise, freedom, freedom of speech, Friends, General Douglas MacArthur, General Michael Flynn, General Wesley Clark, Give It A Listen, Give Peace A Chance, Give Total War A Chance, God, Good, Goodwill, Growth, Hope, Individualism, Iran-Iraq War 1980 to 1988, Islamic Republic of Iran, Islamic State, Jack Devine, John Bolton, Knowledge, liberty, Life, Love, Lovers of Liberty, monetary policy, MPEG3, Neoconned, Neoconservative Strategy of Total War, News, Obama's DC (Delay and Contain) Strategy, Opinions, Part 2 of 2, Peace, Photos, Podcasts, Political Philosophy, Politics, President Barack Obama, prosperity, Radio, Raymond Thomas Pronk, Representative Republic, Republic, Resources, Respect, rule of law, Rule of Men, Satire of Henry Kissinger, Show Notes, Talk Radio, The Pronk Pops Show, The Pronk Pops Show 483, There Is No Substitute For Victory, Thomas Barnett, Truth, Tyranny, U.S. Constitution, United States of America, US Air Strikes, Videos, Virtue, War, Wikistrat, Wisdom |, 331261=“May God have mercy on your soul,” said the mother of the youngest victim, 26-year-old Tywanza Sanders, while Roof looked on, expressionless., 80818=After months of harsh, American-led sanctions, Iran’s currency, the rial, plunges 40 percent. The currency lost about half its value in 2012., 108855=Defense Secretary Robert M. Gates in 2011. Francois Lenoir/Reuters, 108003=The report also concludes that some Iranian weapons-related activity apparently continued “beyond 2004,” contradicting an American intelligence assessment published in 2008 that concluded that work on a bomb was suspended at the end of 2003., 140091=The deposed shah, with Empress Farah and two of their children, in the Bahamas in 1979, where they dodged questions from photographers. Associated Press, 131159=President Bill Clinton addressing reporters in July 1996. Joe Marquette/Associated Press, 301463=Nine people are dead after shooting which occurred 9pm on Wednesday at the Emanuel African Methodist Episcopal Church in Charleston, South Carolina. The congregation, established in 1816, is one of the oldest African American churches in the United States., 147676=JUL. 10, 2015, 136377=In 2005, the United Nations’ International Atomic Energy Agency is on the verge of reviewing Tehran’s nuclear program when Iranian officials admit to a 1987 meetingwith Dr. Khan’s representatives. But Tehran tells the agency that it turned down the chance to buy the equipment required to build the core of a bomb., 297882=Charleston, S.C., shooting suspect Dylann Storm Roof, center, is escorted from the Sheby Police Department in Shelby, N.C., Thursday, June 18, 2015. Roof is a suspect in the shooting of several people Wednesday night at the historic The Emanuel African Methodist Episcopal Church in Charleston, S.C. (AP Photo/Chuck Burton), 135413=The Pakistani scientist Abdul Qadeer Khan in Islamabad in 1988.B.K.Bangash/Associated Press, 130377=President Mohammad Khatami of Iran goes to Saudi Arabia, becoming the first Iranian leader since 1979 to visit the Arab world., 57772=The diplomat sheik played a key role in Iran’s voluntary suspension of uranium enrichment in 2004, which Western powers responded to by asking for more concessions from Iran., 224045=Hupp and her parents were having lunch at the Luby’s Cafeteria in Killeen in 1991 when the Luby’s massacre commenced. The gunman shot 50 people and killed 23, including Hupp’s parents. Hupp later expressed regret about deciding to remove her gun from her purse and lock it in her car lest she risk possibly running afoul of the state’s concealed weapons laws; during the shootings, she reached for her weapon but then remembered that it was “a hundred feet away in my car.” Her father, Al Gratia, tried to rush the gunman and was shot in the chest. As the gunman reloaded, Hupp escaped through a broken window and believed that her mother, Ursula Gratia, was behind her. Actually however, her mother went to her mortally-wounded husband’s aid and was then shot in the head.}",
    "textBeforeTable": "This section contains cases that occurred in Africa and the Middle East. Not included are school massacres, workplace killings, hate crimes or familicides, which form their own categories. Only the first 15 entries are shown here. For the entire list see:Africa and the Middle East Africa and the Middle East In the tables that follow, the “W” column indicates the weapon, or weapons, used. Details are listed in the Annotation section. Rampage killings with at least a dozen victims (dead plus injured) Rampage killings with at least four people killed and a double digit number of victims (dead plus injured) Rampage killings with six or more dead (excluding the perpetrator) This list should contain every case with at least one of the following features: This is a partial list of rampage killings. It is further divided into several subsections. 1315 Total 46 Other 21 Grenade 20 Vehicular 155 Familicides – Rest of world 103",
    "textAfterTable": "May 21/22 1997 Santo Antônio dos Barreiros  Brazil 14 3 F Committed suicide or shot by police [13] 5. Wong, Jiverly Antares, 41 April 3 2009 Binghamton, NY  USA 13 4 F Committed suicide 6. Unruh, Howard Barton, 28 Sep. 6 1949 Camden, NJ  USA 13 3 F Found mentally unfit to stand trial 7. Holmes, James Eagan, 24 (suspect) July 20 2012 Aurora, CO  USA 12 62 F E Suspect arrested, trial pending 8. Pough, James Edward, 42 June 17/18 1990 Jacksonville, FL  USA 11 6 F V Committed suicide 9. Lozano",
    "hasKeyColumn": true,
    "keyColumnIndex": 1,
    "headerRowIndex": 0
}