{
    "relation": [
        [
            "Job Title",
            "Research Recruitment Coordinator",
            "Analgesic Disease Modeling Fellowship - Center for Drug Evaluation and Research",
            "Clinical Research Associates (Nationwide)",
            "Clinical Research Coordinator",
            "Respiratory Therapist"
        ],
        [
            "Location",
            "Decatur, GA",
            "Oak Ridge, TN",
            "United States",
            "Chicago, IL",
            "Willmar, MN"
        ]
    ],
    "pageTitle": "Marketing - Entry Level Jobs, Internships, and Career Overview",
    "title": "",
    "url": "http://www.onedayonejob.com/jobs-internships/marketing/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989043.35/warc/CC-MAIN-20150728002309-00336-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 627257235,
    "recordOffset": 627134715,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{235145=HDMZ - HDMZ is a Chicago, IL and San Francisco, CA based healthcare and life science marketing agency that was founded in 1936., 285258=Copyright © 2007-2013 One Day, One Job. All rights reserved.}",
    "textBeforeTable": "web development telecommunications software development online marketing New York marketing engineering design business development all employers See the complete Lua profile Lua - Lua is an NYC based company focused on “empowering mobile workforces by giving them access to the people and information they need to get the job done.\" Companies with Entry Level Jobs and Internships in Marketing A degree in marketing or a related field is helpful to get started in marketing, but more useful than the major are your ability to think critically and communicate, both orally and in writing. Mathematical and computer literacy are also helpful, especially for research positions. Public Relations Associate Market Research Analyst Copywriter Online Marketing Specialist Marketing Associate Account Coordinator Marketing touches every product you use, from market research to selling the end product. Because of this marketing jobs are available in almost every industry out there that sells a product. Some of the big umbrellas of marketing you can get involved in include market research, public relations, and advertising. Internet marketing is also a growing field. While a lot of job titles",
    "textAfterTable": "See all 397 job postings Juvenile Law Center - Juvenile Law Center is a Philly based org that “plays a leadership role in shaping and using the law on behalf of children in the child welfare and justice systems.\" See the complete Juvenile Law Center profile advocacy all employers communications development law marketing non-profit Pennsylvania policy public policy Job Title Location Legal Internship Houston, TX Counseling Intern - Part-Time - Juvenile Probation Richmond, TX Policy Analyst, CSC New York, NY Volunteer/Intern Program Los Angeles County, CA Program Assistant, After School Kids Program, Washington, DC See all 187 job postings",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}