{
    "relation": [
        [
            "Parameter",
            "doc",
            "qname",
            "ns"
        ],
        [
            "Description",
            "DOMDOCUMENT",
            "New attribute qualified name",
            "Namespace"
        ]
    ],
    "pageTitle": "DBMS_XMLDOM",
    "title": "",
    "url": "http://docs.oracle.com/cd/E11882_01/appdev.112/e16760/d_xmldom.htm",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986423.95/warc/CC-MAIN-20150728002306-00067-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 76307055,
    "recordOffset": 76262633,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{1059=The implementation of this interface follows the REC-DOM-Level-1-19981001.}",
    "lastModified": "Tue, 19 May 2015 17:54:16 GMT",
    "textBeforeTable": "Table 171-26 CREATEATTRIBUTE Function Parameters Parameters RETURN DOMATTR; ns IN VARCHAR2) qname IN VARCHAR2, doc IN DOMDOCUMENT, DBMS_XMLDOM.CREATEATTRIBUTE(  Creates a DOMATTR with the specified name and namespace URI: RETURN DOMATTR; name IN VARCHAR2) doc IN DOMDOCUMENT, DBMS_XMLDOM.CREATEATTRIBUTE(  Creates a DOMATTR with the specified name: Syntax   DOMDocument Subprograms See Also:  This function creates a DOMATTR node. CREATEATTRIBUTE Functions        Cloning any other type of node simply returns a copy of this node.   Cloning an Attribute directly, as opposed to be cloned as part of an Element cloning operation, returns a specified attribute (specified is TRUE).   Cloning an Element copies all attributes and their values, including those generated by the XML processor to represent defaulted attributes, but this method does not copy any text it contains unless it is a deep clone, since the text is contained in a child Text node.   Usage Notes   Determines if children are to be cloned deep DOMNODE n",
    "textAfterTable": "CREATECDATASECTION Function This function creates a DOMCDATASECTION node. See Also: DOMDocument Subprograms Syntax  DBMS_XMLDOM.CREATECDATASECTION( doc IN DOMDOCUMENT, data IN VARCHAR2) RETURN DOMCDATASECTION; Parameters Table 171-27 CREATECDATASECTION Function Parameters Parameter Description doc DOMDOCUMENT data Content of the DOMCDATASECTION node CREATECOMMENT Function This function creates a DOMCOMMENT node. See Also: DOMDocument Subprograms Syntax  DBMS_XMLDOM.CREATECOMMENT( doc IN DOMDOCUMENT, data IN VARCHAR2) RETURN DOMCOMMENT; Parameters Table 171-28 CREATECOMMENT Function Parameters Parameter Description doc",
    "hasKeyColumn": true,
    "keyColumnIndex": 1,
    "headerRowIndex": 0
}