{
    "relation": [
        [
            "Relation",
            "A to A",
            "A to B1",
            "A to B",
            "A to C3",
            "A to C2",
            "A to C1",
            "A to C0",
            "A to C",
            "B1 to B1",
            "B1 to B",
            "B1 to C3",
            "B1 to C2",
            "B1 to C1",
            "B1 to C0",
            "B1 to C",
            "B to B",
            "B to C3",
            "B to C2",
            "B to C1",
            "B to C0",
            "B to C",
            "C3 to C3",
            "C3 to C2",
            "C3 to C1",
            "C3 to C0",
            "C3 to C",
            "C2 to C2",
            "C2 to C1",
            "C2 to C0",
            "C2 to C",
            "C1 to C1",
            "C1 to C0",
            "C1 to C",
            "C0 to C0",
            "C0 to C",
            "C to C"
        ],
        [
            "Co-channel",
            "115 (71)",
            "143 (89)",
            "178 (111)",
            "142 (88)",
            "166 (103)",
            "200 (124)",
            "215 (134)",
            "226 (140)",
            "175 (109)",
            "211 (131)",
            "175 (109)",
            "200 (124)",
            "233 (145)",
            "248 (154)",
            "259 (161)",
            "241 (150)",
            "211 (131)",
            "241 (150)",
            "270 (168)",
            "272 (169)",
            "274 (170)",
            "153 (95)",
            "177 (110)",
            "211 (131)",
            "226 (140)",
            "237 (147)",
            "190 (118)",
            "224 (139)",
            "239 (148)",
            "249 (155)",
            "245 (152)",
            "259 (161)",
            "270 (168)",
            "270 (168)",
            "281 (175)",
            "290 (180)"
        ],
        [
            "200 kHz",
            "72 (45)",
            "96 (60)",
            "113 (70)",
            "89 (55)",
            "106 (66)",
            "133 (83)",
            "152 (94)",
            "165 (103)",
            "114 (71)",
            "145 (90)",
            "114 (71)",
            "134 (83)",
            "161 (100)",
            "180 (112)",
            "193 (120)",
            "169 (105)",
            "145 (90)",
            "169 (105)",
            "195 (121)",
            "214 (133)",
            "217 (135)",
            "99 (62)",
            "117 (73)",
            "144 (90)",
            "163 (101)",
            "176 (109)",
            "130 (81)",
            "158 (98)",
            "176 (109)",
            "188 (117)",
            "177 (110)",
            "196 (122)",
            "209 (130)",
            "207 (129)",
            "220 (137)",
            "241 (150)"
        ],
        [
            "400/600 kHz",
            "31 (19)",
            "48 (30)",
            "69 (43)",
            "42 (26)",
            "55 (34)",
            "75 (47)",
            "86 (53)",
            "95 (59)",
            "50 (31)",
            "71 (44)",
            "50 (31)",
            "56 (35)",
            "77 (48)",
            "87 (54)",
            "105 (65)",
            "74 (46)",
            "71 (44)",
            "74 (46)",
            "79 (49)",
            "89 (55)",
            "105 (65)",
            "43 (27)",
            "56 (35)",
            "76 (47)",
            "87 (54)",
            "96 (60)",
            "58 (36)",
            "79 (49)",
            "89 (55)",
            "105 (65)",
            "82 (51)",
            "94 (58)",
            "105 (65)",
            "96 (60)",
            "105 (65)",
            "105 (65)"
        ],
        [
            "10.6/10.8 MHz",
            "10 (6)",
            "12 (7)",
            "15 (9)",
            "12 (7)",
            "15 (9)",
            "22 (14)",
            "25 (16)",
            "29 (18)",
            "14 (9)",
            "17 (11)",
            "14 (9)",
            "17 (11)",
            "24 (15)",
            "27 (17)",
            "31 (19)",
            "20 (12)",
            "17 (11)",
            "20 (12)",
            "27 (17)",
            "31 (19)",
            "35 (22)",
            "14 (9)",
            "17 (11)",
            "24 (15)",
            "27 (17)",
            "31 (19)",
            "20 (12)",
            "27 (17)",
            "31 (19)",
            "35 (22)",
            "34 (21)",
            "37 (23)",
            "41 (25)",
            "41 (25)",
            "45 (28)",
            "48 (30)"
        ]
    ],
    "pageTitle": "eCFR — Code of Federal Regulations",
    "title": "",
    "url": "http://www.ecfr.gov/cgi-bin/text-idx?c=ecfr&rgn=div5&view=text&node=47:4.0.1.1.2&idno=47",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986423.95/warc/CC-MAIN-20150728002306-00068-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 427737743,
    "recordOffset": 427552589,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{109013=(f) Stations on 1580, 1590 and 1600 kHz. In addition to the rules governing the authorization of facilities in the 535-1605 kHz band, stations on these frequencies seeking facilities modifications must protect assignments in the 1610-1700 kHz band. Such protection shall be afforded in a manner which considers the spacings that occur or exist between the subject station and a station within the range 1605-1700 kHz. The spacings are the same as those specified for stations in the frequency band 1610-1700 kHz or the current separation distance, whichever is greater. Modifications that would result in a spacing or spacings that fails to meet any of the separations must include a showing that appropriate adjustment has been made to the radiated signal which effectively results in a site-to-site radiation that is equivalent to the radiation of a station with standard Model I facilities (10 kW-D, 1 kW-N, non-DA, 90 degree antenna ht. & ground system) operating in compliance with all of the above separation distances. In those cases where that radiation equivalence value is already exceeded, a station may continue to maintain, but not increase beyond that level., 142992=[41 FR 36817, Sept. 1, 1976, as amended at 48 FR 38477, Aug. 24, 1983; 49 FR 49850, Dec. 24, 1984; 50 FR 32416, Aug. 12, 1985; 60 FR 55480, Nov. 1, 1995], 65558=AM broadcast channel. The band of frequencies occupied by the carrier and the upper and lower sidebands of an AM broadcast signal with the carrier frequency at the center. Channels are designated by their assigned carrier frequencies. The 117 carrier frequencies assigned to AM broadcast stations begin at 540 kHz and progress in 10 kHz steps to 1700 kHz. (See §73.21 for the classification of AM broadcast channels)., 960465=[28 FR 13660, Dec. 14, 1963, as amended at 37 FR 25842, Dec. 5, 1972; 44 FR 65765, Nov. 15, 1979; 47 FR 35990, Aug. 18, 1982; 50 FR 23698, June 5, 1985; 51 FR 44070, Dec. 8, 1986; 54 FR 14964, Apr. 14, 1989; 54 FR 16368, Apr. 24, 1989; 54 FR 35340, Aug. 25, 1989], 442865=See §§73.207, 73.220 and 73.1650., 90322=[56 FR 64857, Dec. 12, 1991], 650654=[42 FR 36828, July 18, 1977, as amended at 43 FR 39716, Sept. 6, 1978; 44 FR 65764, Nov. 15, 1979; 49 FR 10264, Mar. 20, 1984; 49 FR 19670, May 9, 1984], 137073=[38 FR 1917, Jan. 19, 1973, as amended at 49 FR 3999, Feb. 1, 1984; 49 FR 29069, July 18, 1984; 50 FR 32416, Aug. 12, 1985; 50 FR 47054, Nov. 14, 1985; 51 FR 2707, Jan. 21, 1986; 56 FR 64859, Dec. 12, 1991; 57 FR 43290, Sept. 18, 1992; 60 FR 55480, Nov. 1, 1995; 63 FR 36604, July 7, 1998; 66 FR 20755, Apr. 25, 2001], 269250=(i) Broadcast stations are licensed to operate unlimited time, limited time, daytime, share time, and specified hours. (See §§73.1710, 73.1725, 73.1720, 73.1715, and 73.1730.) Applications for new stations shall specify unlimited time operation only., 328294=Editorial Note: At 56 FR 64867, Dec. 12, 1991, §73.185 was amended by redesignating paragraphs (d), (e), (h), and (k) as (c), (d), (e), and (f), resulting in two consecutive paragraph (f)'s. These paragraphs will be correctly designated by a Federal Communication Commission document published in the Federal Register at a later date., 986640=Note to §73.616: When this rule was adopted, the filing freeze announced in an August 2004 public notice (19 FCC Rcd 14810 (MB 2004)) remained in effect. For a short period of time after the filing freeze is lifted, until a date to be announced by a Media Bureau public notice, applicants must protect Appendix B facilities in addition to any authorized facilities required to be protected pursuant to this rule section., 298394=It is desired to determine the distance to the 0.5 mV/m and 0.025 mV/m contours of a station on a frequency of 1000 kHz with an inverse distance field of 100 mV/m at one kilometer being radiated over a path having a conductivity of 10 mS/m for a distance of 20 kilometers, 5 mS/m for the next 30 kilometers and 15 mS/m thereafter. Using the appropriate curve in §73.184, Graph 12, at a distance of 20 kilometers on the curve for 10 mS/m, the field strength is found to be 2.84 mV/m. On the 5mS/m curve, the equivalent distance to this field strength is 14.92 kilometers, which is 5.08 (20−14.92 kilometers nearer to the transmitter. Continuing on the propagation curve, the distance to a field strength of 0.5 mV/m is found to be 36.11 kilometers., 221897=[36 FR 919, Jan. 20, 1971, as amended at 42 FR 36828, July 18, 1977; 49 FR 23348, June 6, 1984; 50 FR 32416, Aug. 12, 1985; 56 FR 64862, Dec. 12, 1991; 63 FR 33876, June 22, 1998; 66 FR 20756, Apr. 25, 2001; 73 FR 64561, Oct. 30, 2008], 81323=[56 FR 64856, Dec. 12, 1991], 649665=(b) Stations authorized as of September 10, 1962, which do not meet the requirements of paragraph (a) of this section and §73.511, may continue to operate as authorized; but any application to change facilities will be subject to the provisions of this section., 619838=(f) Stations installing multiplex subcarrier transmitting equipment must ensure the proper suppression of spurious or harmonic radiations. See §§73.317, 73.1590 and 73.1690. If the subcarrier operation causes the station's transmissions not to comply with the technical provisions for FM broadcast stations or causes harmful interference to other communication services, the licensee or permittee must correct the problem promptly or cease operation. The licensee may be required to verify the corrective measures with supporting data. Such data must be retained at the station and be made available to the FCC upon request., 699699=Note 2 to §73.561: See §§73.1705, 73.1715, and 73.1740., 941483=2Operation on this channel is subject to the conditions, terms, and requirements set out in the Report and Order in Docket No. 19075, RM-1645, adopted January 5, 1972, released January 7, 1972, FCC 72-19., 139872=[66 FR 20755, Apr. 25, 2001,as amended at 67 FR 13231, Mar. 21, 2002], 226733=E(φ,θ)aug = √{ E(φ,θ)std }2 + A{g(θ) cos (180 DA/S  }2, 548960=[28 FR 13623, Dec. 14, 1963], 163584=[28 FR 13574, Dec. 14, 1963, as amended at 56 FR 64859, Dec. 12, 1991], 967550=[28 FR 13660, Dec. 14, 1963, as amended at 32 FR 8814, June 21, 1967; 50 FR 23698, June 5, 1985; 51 FR 44070, Dec. 8, 1986], 175494=(k) A PSRA and PSSA does not require compliance with §§73.45, 73.182 and 73.1560 where the operation might otherwise be considered as technically substandard. Further, the requirements of paragraphs (a)(5), (b)(2), (c)(2), and (d)(2) of §73.1215 concerning the scale ranges of transmission system indicating instruments are waived for PSRA and PSSA operation except for the radio frequency ammeters used in determining antenna input power., 1174586=(4) UHF DTV stations may request an increase in power, up to a maximum of 1000 kW ERP, to enhance service within their authorized service area., 648480=[43 FR 39715, Sept. 6, 1978, as amended at 49 FR 10264, Mar. 20, 1984; 52 FR 47569, Dec. 15, 1987; 54 FR 16367, Apr. 24, 1989; 54 FR 19374, May 5, 1989], 65087=[47 FR 8587, Mar. 1, 1982], 89965=(b) Additionally, in Alaska, Hawaii, Puerto Rico, and the U.S. Virgin Islands the frequencies 1230, 1240, 1340, 1400, 1450, and 1490 kHz are designated as Regional channels, and are assigned for use by Class B stations. Stations formerly licensed to these channels in those locations as Class C stations are redesignated as Class B stations., 623510=[51 FR 17029, May 8, 1986], 1185350=(8) A DTV station that operates on a channel 14-59 allotment created subsequent to the initial DTV Table will be allowed a maximum ERP of 1000 kW if their antenna HAAT is at or below 365 meters. A DTV station that operates on a channel 14-59 allotment included in the initial DTV Table of Allotments may request an increase in power and/or antenna HAAT up to these maximum levels, provided the increase also complies with the provisions of paragraph (f)(5) of this section., 559897=[48 FR 28454, June 22, 1983, as amended at 48 FR 44805, Sept. 30, 1983; 49 FR 33663, Aug. 15, 1984; 50 FR 32416, Aug. 12, 1985; 57 FR 48333, Oct. 23, 1992], 666638=[65 FR 67299, Nov. 9, 2000], 145906=[41 FR 36817, Sept. 1, 1976, as amended at 48 FR 38477, Aug. 24, 1983; 49 FR 49850, Dec. 24, 1984; 50 FR 32416, Aug. 12, 1985; 51 FR 2707, Jan. 21, 1986; 53 FR 2498, Jan. 28, 1988; 63 FR 33876, June 22, 1998; 66 FR 20755, Apr. 25, 2001; 67 FR 13231, Mar. 21, 2002], 246722=[50 FR 30947, July 31, 1985], 133853=(iii) The accuracy with which the relative amplitudes of the applied signals is indicated, over a range in which the ratio of these amplitudes is between 2:1 and 1:1, shall be ±2 percent of the amplitude ratio, or better, and for amplitude ratios in excess of 2:1 and up to 5:1, ±5 percent of the ratio, or better., 503698=(d) Existing Class C stations below minimum antenna HAAT. Class C stations authorized prior to January 19, 2001 that do not meet the minimum antenna HAAT specified in paragraph (a)(2) of this section for Class C stations may continue to operate as authorized subject to the reclassification procedures set forth in Note 4 to §73.3573., 8079=e-CFR data is current as of July 27, 2015, 339085=(c) Interpolation factors. (1) Frequencies below 1000 kHz., 335359=[28 FR 13574, Dec. 14, 1963, as amended at 41 FR 44178, Oct. 7, 1976; 46 FR 11995, Feb. 12, 1981; 49 FR 49851, Dec. 24, 1984; 50 FR 18843, May 2, 1985; 50 FR 47055, Nov. 14, 1985; 51 FR 2707, Jan. 21, 1986; 52 FR 10570, Apr. 2, 1987; 66 FR 20757, Apr. 25, 2001], 588437=Effective Date Note: At 42 FR 25736, May 19, 1977, the effective date of §73.313 paragraphs (i) and (j) was stayed indefinitely., 93275=[ 56 FR 64857, Dec. 12, 1991], 181677=(1) The audio response of the main (L+R) channel shall conform to the requirements of the ANSI/EIA-549-1988, NRSC-1 AM Preemphasis/Deemphasis and Broadcast Transmission Bandwidth Specifications (NRSC-1)., 989993=(e) Each station shall furnish a nonprofit and noncommercial broadcast service. Noncommercial educational television stations shall be subject to the provisions of §73.1212 to the extent that they are applicable to the broadcast of programs produced by, or at the expense of, or furnished by others. No promotional announcements on behalf of for profit entities shall be broadcast at any time in exchange for the receipt, in whole or in part, of consideration to the licensee, its principals, or employees. However, acknowledgements of contributions can be made. The scheduling of any announcements and acknowledgements may not interrupt regular programming., 1170741=Note to paragraph (e)(2): During the transition, in cases where the assigned power of a UHF DTV station in the initial DTV Table is 1000 kW, the Grade B contour of the associated analog television station, as authorized on April 3, 1997, shall be used instead of the noise-limited contour of the DTV station in determining the DTV station's service area. In such cases, the DTV service area is the geographic area within the station's analog Grade B contour where its DTV signal strength is predicted to exceed the noise-limited service level, i.e., 41 dB, as determined using the Longley-Rice methodology., 88898=[28 FR 13574, Dec. 14, 1963, as amended at 33 FR 4410, Mar. 12, 1968; 35 FR 18052, Nov. 25, 1970; 47 FR 27862, June 28, 1982; 49 FR 43960, Nov. 1, 1984; 50 FR 24520, June 11, 1985; 52 FR 47568, Dec. 15, 1987; 53 FR 1031, Jan. 15, 1988; 54 FR 39736, Sept. 28, 1989; 56 FR 64857, Dec. 12, 1991], 309952=[28 FR 13574, Dec. 14, 1963, as amended at 50 FR 18823, May 2, 1985; 51 FR 45891, Dec. 23, 1986; 52 FR 36878, Oct. 1, 1987; 56 FR 64866, Dec. 12, 1991; 57 FR 43290, Sept. 18, 1992], 642432=(d) Each station shall furnish a nonprofit and noncommercial broadcast service. Noncommercial educational FM broadcast stations are subject to the provisions of §73.1212 to the extent they are applicable to the broadcast of programs produced by, or at the expense of, or furnished by others. No promotional announcement on behalf of for profit entities shall be broadcast at any time in exchange for the receipt, in whole or in part, of consideration to the licensee, its principals, or employees. However, acknowledgements of contributions can be made. The scheduling of any announcements and acknowledgements may not interrupt regular programming., 559454=(d) The station identification, delayed recording and sponsor identification announcements required by §§73.1201, 73.1208, and 73.1212 are not applicable to material transmitted under an SCA., 646809=[42 FR 36828, July 18, 1977], 664822=(a) Noncommercial educational FM stations other than Class D (secondary) which operate on Channels 221 through 300 but which comply with §73.503 as to licensing requirements and the nature of the service rendered, must comply with the provisions of the following sections of subpart B: §§73.201 through 73.213 (Classification of FM Broadcast Stations and Allocations of Frequencies) and such other sections of subpart B as are made specially applicable by the provisions of this subpart C. Stations in Alaska authorized before August 11, 1982, using Channels 261-300 need not meet the minimum effective radiated power requirement specified in §73.211(a). In all other respects, stations operating on Channels 221 through 300 are to be governed by the provisions of this subpart and not subpart B., 490349=[28 FR 13623, Dec. 14, 1963, as amended at 29 FR 14116, Oct. 14, 1964; 48 FR 29505, June 27, 1983; 52 FR 37788, Oct. 9, 1987; 52 FR 39920, Oct. 26, 1987; 54 FR 9806, Mar. 8, 1989; 57 FR 36020, Aug. 12, 1992; 58 FR 38537, July 19, 1993], 572510=[28 FR 13623, Dec. 14, 1963, as amended at 31 FR 10126, July 27, 1966; 32 FR 11471, Aug. 9, 1967; 52 FR 10570, Apr. 2, 1987; 54 FR 9802, Mar. 8, 1989], 72156=Model I facility. A station operating in the 1605-1705 kHz band featuring fulltime operation with stereo, competitive technical quality, 10 kW daytime power, 1 kW nighttime power, non-directional antenna (or a simple directional antenna system), and separated by 400-800 km from other co-channel stations., 625493=[28 FR 13623, Dec. 14, 1963, as amended at 35 FR 2591, Feb. 5, 1970; 40 FR 27679, July 1, 1975; 45 FR 28141, Apr. 28, 1980; 48 FR 29508, June 27, 1983; 49 FR 19670, May 9, 1984], 111156=(2) The only overlap involved would be that caused to a foreign station, in which case the provisions of the applicable international agreement, as identified in §73.1650, will apply. When overlap would be received from a foreign station, the provisions of this section will apply, except where there would be overlap with a foreign station with a frequency separation of 20 kHz, in which case the provisions of the international agreement will apply in lieu of this section., 1188652=(g) DTV stations operating on channels above an analog TV station. (1) DTV stations operating on a channel allotment designated with a “c” in paragraph (b) of this section must maintain the pilot carrier frequency of the DTV signal 5.082138 MHz above the visual carrier frequency of any analog TV broadcast station that operates on the lower adjacent channel and is located within 88 kilometers. This frequency difference must be maintained within a tolerance of ±3 Hz., 481598=[48 FR 29504, June 27, 1983, as amended at 49 FR 10264, Mar. 20, 1984; 49 FR 19670, May 9, 1984; 49 FR 50047, Dec. 26, 1984; 51 FR 26250, July 22, 1986; 54 FR 14963, Apr. 14, 1989; 54 FR 16366, Apr. 24, 1989; 54 FR 19374, May 5, 1989; 54 FR 35338, Aug. 25, 1989; 56 FR 27426, June 14, 1991; 56 FR 57293, Nov. 8, 1991; 62 FR 50256, Sept. 25, 1997; 65 FR 79776, Dec. 20, 2000], 491805=[43 FR 39715, Sept. 6, 1978 and 48 FR 29505, June 27, 1983; 54 FR 9802, Mar. 8, 1989; 65 FR 7640, Feb. 15, 2000; 65 FR 67299, Nov. 9, 2000], 161252=[38 FR 1918, Jan. 19, 1973], 571125=[28 FR 13623, Dec. 14, 1963, as amended at 39 FR 10575, Mar. 21, 1974; 44 FR 36038, June 20, 1979; 48 FR 28454, June 22, 1983; 48 FR 29507, June 27, 1983; 48 FR 37216, Aug. 17, 1983; 49 FR 45145, Nov. 15, 1984; 57 FR 48333, Oct. 23, 1992; 62 FR 51058, Sept. 30, 1997], 263283=(3) Class C stations operate on local channels, normally rendering primary service to a community and the suburban or rural areas immediately contiguous thereto, with powers not less than 0.25 kW, nor more than 1 kW, except as provided in §73.21(c)(1). Such stations are normally protected to the daytime 0.5 mV/m contour. On local channels the separation required for the daytime protection shall also determine the nighttime separation. Where directional antennas are employed daytime by Class C stations operating with more than 0.25 kW power, the separations required shall in no case be less than those necessary to afford protection, assuming nondirectional operation with 0.25 kW. In no case will 0.25 kW or greater nighttime power be authorized to a station unable to operate nondirectionally with a power of 0.25 kW during daytime hours. The actual nighttime limitation will be calculated. For nighttime protection purposes, Class C stations in the 48 contiguous United States may assume that stations in Alaska, Hawaii, Puerto Rico, and the U.S. Virgin Islands operating on 1230, 1240, 1340, 1400, 1450, and 1490 kHz are Class C stations., 652903=[65 FR 7640, Feb. 15, 2000], 101326=[50 FR 18821, May 2, 1985, as amended at 53 FR 1031, Jan. 15, 1988], 551002=[41 FR 36818, Sept. 1, 1976, as amended at 48 FR 44805, Sept. 30, 1983; 50 FR 32416, Aug. 12, 1985; 63 FR 33876, June 22, 1998; 67 FR 13231, Mar. 21, 2002], 260297=Note: In the Report and Order in MM Docket No. 83-807, the Commission designated 15 stations operating on U.S. clear channels as Alaskan Class A stations. Eleven of these stations already have Alaskan Class A facilities and are to be protected accordingly. Permanent designation of the other four stations as Alaskan Class A is conditioned on their constructing minimum Alaskan Class A facilities no later than December 31, 1989. Until that date or until such facilities are obtained, these four stations shall be temporarily designated as Alaskan Class A stations, and calculations involving these stations should be based on existing facilities but with an assumed power of 10 kW. Thereafter, these stations are to be protected based on their actual Alaskan Class A facilities. If any of these stations does not obtain Alaskan Class A facilities in the period specified, it is to be protected as a Class B station based on its actual facilities. These four stations may increase power to 10 kW without regard to the impact on co-channel Class B stations. However, power increases by these stations above 10 kW (or by existing Alaskan Class A stations beyond their current power level) are subject to applicable protection requirements for co-channel Class B stations. Other stations not on the original list but which meet applicable requirements may obtain Alaskan Class A status by seeking such designation from the Commission. If a power increase or other change in facilities by a station not on the original list is required to obtain minimum Alaskan Class A facilities, any such application shall meet the interference protection requirements applicable to an Alaskan Class A proposal on the channel., 153991=Note to paragraph (c): A public notice dated December 9, 1985 giving additional information on approval of antenna sampling systems is available through the Internet at http://www.fcc.gov/mb/audio/decdoc/letter/1985-12-09-sample.html., 120389=[51 FR 2707, Jan. 21, 1986], 212781=(b) For stations authorized to operate with simple directional antenna systems (e.g., two towers) in the 1605-1705 kHz band, the measurements to support pattern RMS compliance referred to in paragraphs (a)(1)(ii) and (a)(1)(iii) of this section are not required. In such cases, measured radials are required only in the direction of short-spaced allotments, or in directions specifically identified by the Commission., 646267=[52 FR 43765, Nov. 16, 1987], 301641=(b) The inverse distance field (100 mV/m divided by the distance in kilometers) corresponds to the groundwave field intensity to be expected from an antenna with the same radiation efficiency when it is located over a perfectly conducting earth. To determine the value of the groundwave field intensity corresponding to a value of inverse distance field other than 100 mV/m at 1 kilometer, multiply the field strength as given on these graphs by the desired value of inverse distance field at 1 kilometer divided by 100; for example, to determine the groundwave field strength for a station with an inverse distance field of 2700 mV/m at 1 kilometer, simply multiply the values given on the charts by 27. The value of the inverse distance field to be used for a particular antenna depends upon the power input to the antenna, the nature of the ground in the neighborhood of the antenna, and the geometry of the antenna. For methods of calculating the interrelations between these variables and the inverse distance field, see “The Propagation of Radio Waves Over the Surface of the Earth and in the Upper Atmosphere,” Part II, by Mr. K.A. Norton, Proc. I.R.E., Vol. 25, September 1937, pp. 1203-1237., 162809=[43 FR 32780, July 28, 1978, as amended at 56 FR 64859, Dec. 12, 1991], 445401=[29 FR 14116, Oct. 14, 1964, and 31 FR 10125, July 27, 1966, as amended at 48 FR 29504, June 27, 1983], 78801=(2) Class B station. A Class B station is an unlimited time station which is designed to render service only over a primary service area. Class B stations are authorized to operate with a minimum power of 0.25 kW (or, if less than 0.25 kW, an equivalent RMS antenna field of at least 141 mV/m at 1 km) and a maximum power of 50 kW, or 10 kW for stations that are authorized to operate in the 1605-1705 kHz band., 510440=(4) For stations covered by this paragraph (a), there are no distance separation or interference protection requirements with respect to second-adjacent and third-adjacent channel short-spacings that have existed continuously since November 16, 1964., 179214=[47 FR 25345, June 11, 1982, as amended at 49 FR 34015, Aug. 28, 1984; 51 FR 41629, Nov. 18, 1986; 51 FR 44478, Dec. 10, 1986], 102544=A petition for an allotment (See §73.30) in the 1605-1705 kHz band filed by an existing fulltime AM station licensed in the 535-1605 kHz band will be ranked according to the station's calculated improvement factor. (See §73.30). Improvement factors relate to both nighttime and daytime interference conditions and are based on two distinct considerations: (a) Service area lost by other stations due to interference caused by the subject station, and (b) service area of the subject station. These considerations are represented by a ratio. The ratio consists, where applicable, of two separate additive components, one for nighttime and one for daytime. For the nighttime component, to determine the numerator of the ratio (first consideration), calculate the RSS and associated service area of the stations (co- and adjacent channel) to which the subject station causes nighttime interference. Next, repeat the RSS and service area calculations excluding the subject station. The cumulative gain in the above service area is the numerator of the ratio. The denominator (second consideration) is the subject station's interference-free service area. For the daytime component, the composite amount of service lost by co-channel and adjacent channel stations, each taken individually, that are affected by the subject station, excluding the effects of other assignments during each study, will be used as the numerator of the daytime improvement factor. The denominator will consist of the actual daytime service area (0.5 mV/m contour) less any area lost to interference from other assignments. The value of this combined ratio will constitute the petitioner's improvement factor. Notwithstanding the requirements of §73.153, for uniform comparisons and simplicity, measurement data will not be used for determining improvement factors and FCC figure M-3 ground conductivity values are to be used exclusively in accordance with the pertinent provisions of §73.183(c)(1)., 626167=Source: 72 FR 45692, Aug. 15, 2007, unless otherwise noted., 108431=(e) An application for an authorization in the 1605-1705 kHz band which has been selected through the petition process (See §73.30) is not required to demonstrate compliance with paragraph (a), (b), (c), or (d) of this section. Instead, the applicant need only comply with the terms of the allotment authorization issued by the Commission in response to the earlier petition for establishment of a station in the 1605-1705 kHz band. Within the allotment authorization, the Commission will specify the assigned frequency and the applicable technical requirements., 151282=(d) In any other situation in which it might reasonably be anticipated that the operating parameters might vary out of tolerance (such as planned array repairs or adjustment and proofing procedures), the licensee shall, before such activity is undertaken, obtain a Special Temporary Authority (STA) in accordance with §73.1635 in order to operate with parameters at variance and/or with reduced power as required to maintain all monitoring points within their specified limits., 119356=[43 FR 53735, Nov. 17, 1978, as amended at 45 FR 28141, Apr. 28, 1980; 47 FR 8589, Mar. 1, 1982; 50 FR 32416, Aug. 12, 1985; 51 FR 2707; Jan. 21, 1986; 51 FR 26250, July 22, 1986; 63 FR 33875, June 22, 1998; 67 FR 13231, Mar. 21, 2002; 78 FR 66298, Nov. 5, 2013], 388598=Link to an amendment published at 78 FR 25591, May 2, 2013., 703185=[50 FR 27965, July 9, 1985], 667318=[65 FR 79779, Dec. 20, 2000], 693350=[50 FR 27963, July 9, 1985; 50 FR 30187, July 24, 1985; 50 FR 31379, Aug. 2, 1985, as amended at 51 FR 26250, July 22, 1986; 52 FR 25867, July 9, 1987; 62 FR 51059, Sept. 30, 1997], 611777=[28 FR 13623, Dec. 14, 1963, as amended at 34 FR 14222, Sept. 10, 1969; 37 FR 25841, Dec. 5, 1972; 43 FR 53738, Nov. 17, 1978; 48 FR 29508, June 27, 1983; 51 FR 17028, May 8, 1986; 54 FR 9804, Mar. 8, 1989; 56 FR 57294, Nov. 8, 1991; 62 FR 51058, Sept. 30, 1997; 63 FR 70047, Dec. 18, 1998; 78 FR 66298, Nov. 5, 2013], 982610=(1) For evaluating compliance with the requirements of this paragraph, interference to populations served is to be predicted based on the 2000 census population data and otherwise according to the procedure set forth in OET Bulletin No. 69: “Longley-Rice Methodology for Evaluating TV Coverage and Interference” (February 6, 2004) (incorporated by reference, see §73.8000), including population served within service areas determined in accordance with §73.622(e), consideration of whether F(50,10) undesired signals will exceed the following desired-to-undesired (D/U) signal ratios, assumed use of a directional receiving antenna, and use of the terrain dependent Longley-Rice point-to-point propagation model. Applicants may request the use of a cell size other than the default of 2.0 km per side, but only requests for cell sizes of 1.0 km per side or 0.5 km per side will be considered. The threshold levels at which interference is considered to occur are:, 561102=[48 FR 28454, June 22, 1983, and 48 FR 38479, Aug. 24, 1983], 358247=[28 FR 13574, Dec. 14, 1963, as amended at 31 FR 8069, June 8, 1966; 33 FR 15420, Oct. 17, 1968; 44 FR 36038, June 20, 1979; 50 FR 18844, May 2, 1985; 51 FR 2707, Jan. 21, 1986; 51 FR 4753, Feb. 7, 1986; 52 FR 10570, Apr. 2, 1987; 56 FR 64868, Dec. 12, 1991], 942760=[28 FR 13660, Dec. 14, 1963], 173997=(h) Operation under a PSRA or PSSA is not mandatory, and will not be included in determining compliance with the requirements of §73.1740. To the extent actually undertaken, however, presunrise operation will be considered by the FCC in determining overall compliance with past programming representations and station policy concerning commercial matter., 91658=(b) Engineering standards now in force domestically differ in some respects from those specified for international purposes. The engineering standards specified for international purposes (see §73.1650, International Agreements) will be used to determine:, 660239=[50 FR 27963, July 9, 1985, as amended at 50 FR 31379, Aug. 2, 1985; 54 FR 3602, Jan. 25, 1989], 546254=[43 FR 45845, Oct. 4, 1978, as amended at 46 FR 50376, Oct. 13, 1981, 47 FR 30068, July 12, 1982; 48 FR 29507, June 27, 1983; 70 FR 46676, Aug. 10, 2005], 648154=(b) Any noncommercial educational station except Class D may be assigned to any of the channels listed in §73.501. Class D noncommercial educational FM stations applied for or authorized prior to June 1, 1980, may continue to operate on their authorized channels subject to the provisions of §73.512., 337601=(i) The value radiated in such directions with facilities last authorized before November 30, 1959, or, 87383=(a) On each of the following channels, one Class A station may be assigned, operating with power of 50 kW: 640, 650, 660, 670, 700, 720, 750, 760, 770, 780, 820, 830, 840, 870, 880, 890, 1020, 1030, 1040, 1100, 1120, 1160, 1180, 1200, and 1210 kHz. In Alaska, these frequencies can be used by Class A stations subject to the conditions set forth in §73.182(a)(1)(ii). On the channels listed in this paragraph, Class B and Class D stations may be assigned., 337132=(3) A Class B or Class D station authorized before November 30, 1959, and subsequently authorized to increase daytime radiation in any direction toward the 0.1 mV/m contour of a co-channel U.S. Class A station (without a change in frequency or a move of transmitter site materially closer to such contour), may not, during the two hours after local sunrise or the two hours before local sunset, radiate in such directions a value exceeding the higher of:, 639895=(b) In Alaska, FM broadcast stations operating on Channels 200-220 (87.9-91.9 MHz) shall not cause harmful interference to and must accept interference from non-Government fixed operations authorized prior to January 1, 1982., 603423=[28 FR 13623, Dec. 14, 1963, as amended at 41 FR 22943, June 8, 1976; 49 FR 38131, Sept. 27, 1984; 49 FR 45146, Nov. 15, 1984; 51 FR 9965, Mar. 24, 1986; 52 FR 10570, Apr. 2, 1987; 65 FR 79778, Dec. 20, 2000], 702058=A noncommercial educational FM broadcast station may, without specific authority from the FCC, transmit stereophonic sound programs upon installation of stereophonic sound transmitting equipment under the provisions of §§2.977, 2.1001, 73.322, and 73.1590 of the FCC's Rules., 90675=Within the conterminous 48 states, the following frequencies are designated as local channels, and are assigned for use by Class C stations: 1230, 1240, 1340, 1400, 1450, and 1490 kHz., 620488=[48 FR 28455, June 22, 1983, as amended at 48 FR 37216, Aug. 17, 1983; 49 FR 15080, Apr. 17, 1984; 49 FR 38131, Sept. 27, 1984; 50 FR 1534, Jan. 11, 1985; 51 FR 17029, May 8, 1986; 57 FR 48333, Oct. 23, 1992], 91230=(a) The Commission will not make an AM station assignment that does not conform with international requirements and restrictions on spectrum use that the United States has accepted as a signatory to treaties, conventions, and other international agreements. See §73.1650 for a list of pertinent treaties, conventions and agreements, and §73.23 for procedural provisions relating to compliance with them., 1166076=(2) Notwithstanding paragraph (c)(1) of this section, an application may be filed for a channel or community not listed in the DTV Table of Allotments if it is consistent with the rules and policies established in the Third Report and Order in WT Docket 99-168 (FCC 01-25), adopted January 18, 2001. Where such a request is approved, the Media Bureau will change the DTV Table of Allotments to reflect that approval., 104551=[56 FR 64858, Dec. 12, 1991], 249267=[66 FR 20757, Apr. 25, 2001], 134196=(iv) The repeatability of indication of the relative amplitudes of the applied signals, over a range where the ratio of these amplitudes is between 5:1 and 1:1, shall be ±2 percent of the amplitude ratio, or better., 89530=(a) The following frequencies are designated as regional channels and are assigned for use by Class B and Class D stations: 550, 560, 570, 580, 590, 600, 610, 620, 630, 790, 910, 920, 930, 950, 960, 970, 980, 1150, 1250, 1260, 1270, 1280, 1290, 1300, 1310, 1320, 1330, 1350, 1360, 1370, 1380, 1390, 1410, 1420, 1430, 1440, 1460, 1470, 1480, 1590, 1600, 1610, 1620, 1630, 1640, 1650, 1660, 1670, 1680, 1690, and 1700 kHz., 72515=Model II facility. A station operating in the 535-1605 kHz band featuring fulltime operation, competitive technical quality, wide area daytime coverage with nighttime coverage at least 15% of the daytime coverage., 704224=[47 FR 21494, May 18, 1982], 992774=(a) General. The following table of allotments contains the digital television (DTV) channel allotments designated for the listed communities in the United States, its Territories, and possessions. The initial DTV Table of Allotments was established on April 3, 1997, to provide a second channel for DTV service for all eligible analog television broadcasters. Requests for addition of new DTV allotments, or requests to change the channels allotted to a community must be made in a petition for rule making to amend the DTV Table of Allotments. A request to amend the DTV table to change the channel of an allotment in the DTV table will be evaluated for technical acceptability using engineering criteria set forth in §73.623(c). A request to amend the DTV table to add a new allotment will be evaluated for technical acceptability using the geographic spacing criteria set forth in §73.623(d). DTV allotments designated with an asterisk are assigned for use by non-commercial educational broadcast stations only. Stations operating on DTV allotments designated with a “c” are required to comply with paragraph (g) of this section. Rules governing noncommercial educational TV stations are contained in §73.621. Where there is only one technically available channel available in a community, an entity that would be eligible to operate a noncommercial educational broadcast station may, prior to application, initiate a rulemaking proceeding requesting that an unoccupied or new channel in the community be changed or added as reserved only for noncommercial educational broadcasting upon demonstrating that the noncommercial educational proponent would provide a first or second noncommercial educational TV service to 2,000 or more people who constitute 10% of the population within the proposed allocation's noise limited contour., 557376=[51 FR 17028, May 8, 1986], 271516=(3) With respect to the root-sum-square values of interfering field strengths referred to in this section, calculation is accomplished by considering the signals on the three channels of concern (co- and first adjacencies) in order of decreasing magnitude, adding the squares of the values and extracting the square root of the sum. The 0% exclusion method applies only to the determination of an improvement factor value for evaluating a station's eligibility for migration to the band 1605-1705 kHz., 257988=(a) Sections 73.21 to 73.37, inclusive, govern allocation of facilities in the AM broadcast band 535-1705 kHz. §73.21 establishes three classes of channels in this band, namely, clear, regional and local. The classes and power of AM broadcast stations which will be assigned to the various channels are set forth in §73.21. The classifications of the AM broadcast stations are as follows:, 629461=(b) Emergency information. The emergency information requirements found in §73.1250 shall apply to all free DAB programming streams., 716971=[28 FR 13660, Dec. 14, 1963, as amended at 35 FR 11179, July 11, 1970; 39 FR 10576, Mar. 21, 1974; 47 FR 16789, Apr. 20, 1982; 47 FR 30068, July 12, 1982; 47 FR 35989, Aug. 18, 1982; 51 FR 18450, May 20, 1986; 70 FR 46676, Aug. 10, 2005], 99273=[58 FR 27949, May 12, 1993], 694993=(b) All stations, including those meeting the requirements of paragraph (a) of this section, but which do not operate 12 hours per day each day of the year, will be required to share use of the frequency upon the grant of an appropriate application proposing such share time arrangement. Such applications shall set forth the intent to share time and shall be filed in the same manner as are applications for new stations. They may be filed at any time, but in cases where the parties are unable to agree on time sharing, action on the application will be taken only in connection with the renewal of application for the existing station. In order to be considered for this purpose, such an application to share time must be filed no later than the deadline for filing petitions to deny the renewal application of the existing licensee, or, in the case of renewal applications filed by the existing licensee on or before May 1, 1995, no later than the deadline for filing applications in conflict with the such renewal applications., 333803=(5) The antenna power of the station shall be maintained at the authorized level during all field measurements. The power determination will be made using the direct method as described in §73.51(a) with instruments of acceptable accuracy specified in §73.1215., 181530=(c) Effective on December 20, 1994, stereophonic transmissions shall conform to the following additional modulation characteristics:, 980146=[50 FR 23698, June 5, 1985], 102148=[28 FR 13574, Dec. 14, 1963, as amended at 37 FR 25840, Dec. 5, 1972], 115546=(e) Licensees of stations complying with the ANSI/EIA-549-1988, NRSC-1 AM Preemphasis/Deemphasis and Broadcast Transmission Bandwidth Specifications (NRSC-1), prior to June 30, 1990 or from the original commencement of operation will, until June 30, 1994, be considered to comply with paragraphs (a) and (b) of this section, absent any reason for the Commission to believe otherwise. Such stations are waived from having to make the periodic measurements required in §73.1590(a)(6) until June 30, 1994. However, licensees must make measurements to determine compliance with paragraphs (a) and (b) of this section upon receipt of an Official Notice of Violation or a Notice of Apparent Liability alleging noncompliance with those provisions, or upon specific request by the Commission., 600248=[40 FR 27682, July 1, 1975; 40 FR 28802, July 9, 1975, as amended at 48 FR 29508, June 27, 1983], 227749=E(φ,θ)aug. is the field in the direction specified above, after augmentation., 629913=(a) The licensee of an AM or FM station, or the permittee of a new AM or FM station which has commenced program test operation pursuant to §73.1620, may commence interim hybrid IBOC DAB operation with digital facilities which conform to the technical specifications specified for hybrid DAB operation in the First Report and Order in MM Docket No. 99-325, as revised in the Media Bureau's subsequent Order in MM Docket No. 99-325. FM stations are permitted to operate with hybrid digital effective radiated power equal to one percent (−20 decibels below carrier (dBc)) of authorized analog effective radiated power and may operate with up to ten percent (−10 dBc) of authorized analog effective radiated power in accordance with the procedures set forth in the Media Bureau's Order in MM Docket No. 99-325. An AM or FM station may transmit IBOC signals during all hours for which the station is licensed to broadcast., 329788=[30 FR 13783, Oct. 29, 1965, as amended at 33 FR 15420, Oct. 17, 1968; 46 FR 11995, Feb. 12, 1981; 48 FR 42958, Sept. 20, 1983; 50 FR 18843, May 2, 1985; 56 FR 64867, Dec. 12, 1991], 353314=[28 FR 13574, Dec. 14, 1963, as amended at 49 FR 43962, Nov. 1, 1984; 56 FR 64868, Dec. 12, 1991], 87858=(b) To each of the following channels there may be assigned Class A, Class B and Class D stations: 680, 710, 810, 850, 940, 1000, 1060, 1070, 1080, 1090, 1110, 1130, 1140, 1170, 1190, 1500, 1510, 1520, 1530, 1540, 1550, and 1560 kHz., 616130=(c) A permittee collocating with one or more existing stations and beginning program tests on or after January 1, 1985, must assume full financial responsibility for remedying new complaints of blanketing interference for a period of one year. Two or more permittees that concurrently collocate on or after January 1, 1985, shall assume shared responsibility for remedying blanketing complaints within the blanketing area unless an offending station can be readily determined and then that station shall assume full financial responsibility., 979184=[28 FR 13660, Dec. 14, 1963, as amended at 42 FR 20823, Apr. 22, 1977; 42 FR 48881, Sept. 26, 1977; 47 FR 35990, Aug. 18, 1982; 50 FR 23698, June 5, 1985; 56 FR 49707, Oct. 1, 1991; 58 FR 51250, Oct. 1, 1993], 312457=(d) Example of the use of skywave curves and formulas: Assume a proposed new Class B station from which interference may be expected is located at a distance of 724 kilometers from a licensed Class B station. The proposed station specifies geographic coordinates of 40°00′00″ N and 100°00′00″ W and the station to be protected is located at an azimuth of 45° true at geographic coordinates of 44°26′05″ N and 93°32′54″ W. The critical angles of radiation as determined from Figure 6a of §73.190 for use with Class B stations are 9.6° and 16.6°. If the vertical pattern of the antenna of the proposed station in the direction of the existing station is such that, between the angles of 9.6° and 16.6° above the horizon the maximum radiation is 260 mV/m at one kilometer, the value of the 50% field, as derived from Formula 1 of §73.190, is 0.06217 mV/m at the location of the existing station. To obtain the value of the 10% field, the 50% value must be adjusted by a factor derived from Formula 2 of §73.190. The value in this case is 8.42 dB. Thus, the 10% field is 0.1616 mV/m. Using this in conjunction with the co-channel protection ratio of 26 dB, the resultant nighttime limit from the proposed station to the licensed station is 3.232 mV/m., 644456=[28 FR 13651, Dec. 14, 1963, as amended at 35 FR 7558, May 15, 1970; 47 FR 36178, Aug. 19, 1982; 49 FR 29069, July 18, 1984; 63 FR 33877, June 22, 1998; 65 FR 36378, June 8, 2000], 241999=[66 FR 20756, Apr. 25, 2001], 616915=[28 FR 13623, Dec. 14, 1963, as amended at 52 FR 25866, July 9, 1987], 336672=(i) Any Class B or Class D operation authorized before November 30, 1959; or, 440176=[30 FR 12711, Oct. 6, 1965], 86685=[28 FR 13574, Dec. 14, 1963, as amended at 38 FR 5874, Mar. 5, 1973; 49 FR 43960, Nov. 1, 1984; 50 FR 40014, Oct. 1, 1985; 52 FR 11654, Apr. 10, 1987; 53 FR 1031, Jan. 15, 1988; 56 FR 64857, Dec. 12, 1991], 517855=[52 FR 37789, Oct. 9, 1987, as amended at 54 FR 14964, Apr. 14, 1989; 54 FR 35339, Aug. 25, 1989; 56 FR 27426, June 14, 1991; 62 FR 50521, Sept. 26, 1997; 63 FR 33876, June 22, 1998], 294976=It is desired to determine whether objectionable interference exists between a proposed 5 kW Class B station on 990 kHz and an existing 1 kW Class B station on first adjacent channel, 1000 kHz. The distance between the two stations is 260 kilometers and both stations operate nondirectionally with antenna systems that produce a horizontal effective field of 282 in mV/m at one kilometer. (See §73.185 regarding use of directional antennas.) The ground conductivity at the site of each station and along the intervening terrain is 6 mS/m. The protection to Class B stations during daytime is to the 500 µV/m (0.5 Vm) contour using a 6 dB protection factor. The distance to the 500 µV/m groundwave contour of the 1 kW station is determined by the use of the appropriate curve in §73.184. Since the curve is plotted for 100 mV/m at a 1 kilometer, to find the distance of the 0.5 mV/m contour of the 1 kw station, it is necessary to determine the distance to the 0.1773 m/Vm contour., 176471=[56 FR 64860, Dec. 12, 1991; 57 FR 43290, Sept. 18, 1992, as amended at 58 FR 27950, May 12, 1993], 157117=[41 FR 7405, Feb. 18, 1976], 112399=[56 FR 64858, Dec. 12, 1991; 57 FR 43290, Sept. 18, 1992], 88107=Note: Until superseded by a new agreement, protection of the Bahama Islands shall be in accordance with NARBA. Accordingly, a Class A, Class B or Class D station on 1540 kHz shall restrict its signal to a value no greater than 5 µV/m groundwave or 25 µV/m-10% skywave at any point of land in the Bahama Islands, and such stations operating nighttime (i.e., sunset to sunrise at the location of the U.S. station) shall be located not less than 650 miles from the nearest point of land in the Bahama Islands., 504092=[53 FR 17042, May 13, 1988, as amended at 54 FR 16367, Apr. 24, 1989; 54 FR 19374, May 5, 1989; 54 FR 35339, Aug. 25, 1989; 65 FR 79777, Dec. 20, 2000], 228920=Note: “A” must be positive, except during the process of converting non-standard patterns to standard patterns pursuant to the Report and Order in Docket No. 21473, and in making minor changes to stations with patterns developed during the conversion. However, even when “A” is negative, “A” cannot be so negative that E(φ,α)aug is less than E(φ,θ)th at any azimuth or vertical elevation angle., 511028=(c) Short spacings involving at least one Class A allotment or authorization. Stations that became short spaced on or after November 16, 1964 (including stations that do not meet the minimum distance separation requirements of paragraph (c)(1) of this section and that propose to maintain or increase their existing distance separations) may be modified or relocated in accordance with paragraph (c)(1) or (c)(2) of this section, except that this provision does not apply to stations that became short spaced by grant of applications filed after October 1, 1989, or filed pursuant to §73.215. If the reference coordinates of an allotment are short spaced to an authorized facility or another allotment (as a result of the revision of §73.207 in the Second Report and Order in MM Docket No. 88-375), an application for the allotment may be authorized, and subsequently modified after grant, in accordance with paragraph (c)(1) or (c)(2) of this section only with respect to such short spacing. No other stations will be authorized pursuant to these paragraphs., 974770=[65 FR 3001, May 10, 2000], 503038=(c) Existing stations. Stations authorized prior to March 1, 1984 that do not conform to the requirements of this section may continue to operate as authorized. Stations operating with facilities in excess of those specified in paragraph (b) of this section may not increase their effective radiated powers or extend their 1 mV/m field strength contour beyond the location permitted by their present authorizations. The provisions of this section will not apply to applications to increase facilities for those stations operating with less than the minimum power specified in paragraph (a) of this section., 992154=[28 FR 13660, Dec. 14, 1963, as amended at 35 FR 7558, May 15, 1970; 47 FR 36179, Aug. 19, 1982; 48 FR 27068, June 13, 1983; 49 FR 29069, July 18, 1984; 50 FR 4664, Feb. 1, 1985; 50 FR 4684, Feb. 1, 1985; 61 FR 36304, July 10, 1996; 65 FR 36378, June 8, 2000; 66 FR 58982, Nov. 26, 2001], 388189=[28 FR 13623, Dec. 14, 1963, as amended at 30 FR 4480, Apr. 7, 1965; 52 FR 10570, Apr. 2, 1987], 615280=(b) After January 1, 1985, permittees or licensees who either (1) commence program tests, or (2) replace their antennas, or (3) request facilities modifications and are issued a new construction permit must satisfy all complaints of blanketing interference which are received by the station during a one year period. The period begins with the commencement of program tests, or commencement of programming utilizing the new antenna. Resolution of complaints shall be at no cost to the complainant. These requirements specifically do not include interference complaints resulting from malfunctioning or mistuned receivers, improperly installed antenna systems, or the use of high gain antennas or antenna booster amplifiers. Mobile receivers and non-RF devices such as tape recorders or hi-fi amplifiers (phonographs) are also excluded., 345990=(2) Frequencies above 1000 kHz., 143460=(a) Each AM broadcast station must be equipped with indicating instruments which conform with the specifications described in §73.1215 for determining power by the direct and indirect methods, and with such other instruments as are necessary for the proper adjustment, operation, and maintenance of the transmitting system. However, auxiliary transmitters with a nominal power rating of 100 watts or less are not required to be equipped with instruments to determine power by the indirect method provided that the licensee can determine the antenna input power at all times., 96866=Note 3: The Commission will periodically evaluate the progress of the movement of stations from the 535-1605 kHz band to the 1605-1705 kHz band to determine whether the 1605-1705 kHz band should continue to be administered on an allotment basis or modified to an assignment method. If appropriate, the Commission will later develop further procedures for use of the 1605-1705 kHz band by existing station licensees and others., 699958=[43 FR 39717, Sept. 6, 1978, as amended at 43 FR 45845, Oct. 4, 1978; 44 FR 3416, Jan. 19, 1979; 44 FR 65764, Nov. 15, 1979; 47 FR 54448, Dec. 3, 1982; 50 FR 13974, Apr. 9, 1985; 61 FR 18291, Apr. 25, 1996; 61 FR 28767, June 6, 1996; 63 FR 33877, June 22, 1998; 67 FR 13231, Mar. 21, 2002], 245168=[73 FR 64562, Oct. 30, 2008], 186325=[58 FR 66301, Dec. 20, 1993], 965387=[52 FR 11655, Apr. 10, 1987], 72905=Nominal power. The antenna input power less any power loss through a dissipative network and, for directional antennas, without consideration of adjustments specified in paragraphs (b)(1) and (b)(2) of §73.51 of the rules. However, for AM broadcast applications granted or filed before June 3, 1985, nominal power is specified in a system of classifications which include the following values: 50 kW, 25 kW, 10 kW, 5 kW, 2.5 kW, 1 kW, 0.5 kW, and 0.25 kW. The specified nominal power for any station in this group of stations will be retained until action is taken on or after June 3, 1985, which involves a change in the technical facilities of the station., 660704=(a) All Class D stations seeking renewal of license for any term expiring June 1, 1980, or thereafter shall comply with the requirements set forth below and shall simultaneously file an application on FCC Form 340, containing full information regarding such compliance with the provisions set forth below., 952953=[28 FR 13660, Dec. 14, 1963, as amended at 33 FR 15422, Oct. 17, 1968; 50 FR 23697, June 5, 1985; 51 FR 44070, Dec. 8, 1986], 77218=[47 FR 8587, Mar. 1, 1982, as amended at 47 FR 13164, Mar. 29, 1982; 47 FR 13812, Apr. 1, 1982; 50 FR 18821, May 2, 1985; 50 FR 47054, Nov. 14, 1985; 56 FR 64856, Dec. 12, 1991; 62 FR 51058, Sept. 30, 1997; 66 FR 20755, Apr. 25, 2001], 439648=(Sec. 316, 66 Stat. 717; 47 U.S.C. 316; sec. 5, 48 Stat., as amended, 1068; 47 U.S.C. 154, 155; secs. 2, 3, 4, 301, 303, 307, 308, 309, 315, 317, 48 Stat. as amended, 1064, 1065, 1066, 1081, 1082, 1083, 1084, 1085, 1088, 1089; (47 U.S.C. 152, 153, 301, 303, 307, 308, 309, 315, 317); secs 1, 201-205, 208, 215, 218, 313, 314, 403, 404, 410, 602; 48 Stat. as amended; 1070, 1071, 1072, 1073, 1076, 1077, 1087, 1094, 1098, 1102 (47 U.S.C. 151, 201-205, 208, 215, 218, 313, 314, 403, 404, 410, 602)), 968249=Note to §73.613(a): Licensees and permittees of TV broadcast stations that were authorized on November 29, 1999 (and applicants for new TV stations that had been cut-off without competing applications or that were the winning bidder in a TV broadcast station auction as of that date, or that were the proposed remaining applicant in a group of mutually exclusive applications for which a settlement agreement was on file as of that date) may continue to operate with facilities that do not protect Class A TV stations. Applications filed on or before November 29, 1999 for a change in the operating facilities of such stations also are not required to protect Class A TV stations under the provisions of this section., 469926=(3) Under the 1992 Mexico-United States FM Broadcasting Agreement, domestic U.S. assignments or allotments within 320 kilometers (199 miles) of the common border must be separated from Mexican assignments or allotments by not less than the distances given in Table C in this paragraph (b)(3). When applying Table C—, 595990=(1) Preparation for measurement. (i) The population (P) of the community, and its suburbs, if any, is determined by reference to an appropriate source, e.g., the 1970 U.S. Census tables of population of cities and urbanized areas., 545356=[54 FR 9802, Mar. 8, 1989, as amended at 54 FR 35340, Aug. 25, 1989; 56 FR 57294, Nov. 8, 1991; 57 FR 46325, Oct. 8, 1992; 65 FR 79777, Dec. 20, 2000; 66 FR 8149, Jan. 29, 2001], 179663=(a) An Am broadcast station may, without specific authority from the FCC, transmit stereophonic programs upon installation of type accepted stereophonic transmitting equipment and the necessary measuring equipment to determine that the stereophonic transmissions conform to the modulation characteristics specified in paragraphs (b) and (c) of this section. Stations transmitting stereophonic programs prior to March 21, 1994 may continue to do so until March 21, 1995 as long as they continue to comply with the rules in effect prior to March 21, 1994., 299804=[28 FR 13574, Dec. 14, 1963, as amended at 44 FR 36037, June 20, 1979; 48 FR 9011, Mar. 3, 1983; 50 FR 18822, May 2, 1985; 50 FR 24522, June 11, 1985; 51 FR 9965, Mar. 24, 1986; 54 FR 39736, Sept. 28, 1989; 56 FR 64866, Dec. 12, 1991; 57 FR 43290, Sept. 18, 1992], 588200=[28 FR 13623, Dec. 14, 1963, as amended at 40 FR 27678, July 1, 1975; 48 FR 29507, June 27, 1983; 52 FR 11655, Apr. 10, 1987; 52 FR 37789, Oct. 9, 1987; 57 FR 48333, Oct. 23, 1992; 63 FR 33877, June 22, 1998], 178570=(d) The station identification, delayed recording, and sponsor identification announcements required by §§73.1201, 73.1208, and 73.1212 are not applicable to leased communications services transmitted via services that are not of a general broadcast program nature., 495876=(2) Class C0 stations must have an antenna height above average terrain (HAAT) of at least 300 meters (984 feet). Class C stations must have an antenna height above average terrain (HAAT) of at least 451 meters (1480 feet)., 704619=[43 FR 32781, July 28, 1978], 181895=(2) The left and right channel audio signals shall conform to frequency response limitations dictated by ANSI/EIA-549-1988., 953937=Note: Licensees and permittees of television broadcast stations which were operating on April 14, 1952 pursuant to one or more separations below those set forth in §73.610 may continue to so operate, but in no event may they further reduce the separations below the minimum. As the existing separations of such stations are increased, the new separations will become the required minimum separations until separations are reached which comply with the requirements of §73.610. Thereafter, the provisions of said section shall be applicable., 556741=[29 FR 7471, June 10, 1964. Redesignated at 39 FR 38655, Nov. 1, 1974 and amended at 48 FR 28454, June 22, 1983], 257630=[46 FR 11993, Feb. 12, 1981], 336763=(ii) For Class B and Class D stations authorized before November 30, 1959, subsequent changes of facilities which do not involve a change in frequency, an increase in radiation toward any point on the 0.1 mV/m contour of a co-channel U.S. Class A station, or the move of transmitter site materially closer to the 0.1 mV/m contour of such Class A station., 488165=KPDlon=111.41513 cos(ML)−0.09455 cos(3ML)+0.00012 cos(5ML), 291540=[56 FR 64862, Dec. 12, 1991; 57 FR 43290, Sept. 18, 1992, as amended at 58 FR 27950, May 12, 1993], 990789=Note: Commission interpretation of this rule, including the acceptable form of acknowledgements, may be found in the Second Report and Order in Docket No. 21136 (Commission Policy Concerning the Noncommercial Nature of Educational Broadcast Stations), 86 F.C.C. 2d 141 (1981); the Memorandum Opinion and Order in Docket No. 21136, 90 FCC 2d 895 (1982), and the Memorandum Opinion and Order in Docket 21136, 49 FR 13534, April 5, 1984., 269525=(j) Section 73.24 sets out the general requirements for modifying the facilities of a licensed station and for establishing a new station. Sections 73.24(b) and 73.37 include interference related provisions that be considered in connection with an application to modify the facilities of an existing station or to establish a new station. Section 73.30 describes the procedural steps required to receive an authorization to operate in the 1605-1705 kHz band., 161003=(Secs. 4, 5, 303, 48 Stat., as amended, 1066, 1068, as amended, 1082, as amended; 47 U.S.C. 154, 303. Interpret or apply secs. 301, 303, 307, 48 Stat. 1081, 1082, as amended, 1083, as amended, 47 U.S.C. 301, 303, 307), 625699=Effective Date Note: At 42 FR 25736, May 19, 1977, in §73.333, the effective date of Figures 4 and 5 was stayed indefinitely., 634432=Source: 28 FR 13651, Dec. 14, 1963, unless otherwise noted. Redesignated at 72 FR 45692, Aug. 15, 2007., 704585=See §73.1010., 151780=[72 FR 44422, Aug. 8, 2007], 643406=Note to §73.503: Commission interpretation on this rule, including the acceptable form of acknowledgements, may be found in the Second Report and Order in Docket No. 21136 (Commission Policy Concerning the Noncommercial Nature of Educational Broadcast Stations), 86 FCC 2d 141 (1981); the Memorandum Opinion and Order in Docket No. 21136, 90 FCC 2d 895 (1982), and the Memorandum Opinion and Order in Docket 21136, 97 FCC 2d 255 (1984). See also, “Commission Policy Concerning the Noncommercial Nature of Educational Broadcast Stations,” Public Notice, 7 FCC Rcd 827 (1992), which can be retrieved through the Internet at http://www.fcc.gov/mmb/asd/nature.html., 129294=(Secs. 4, 5, 303, 48 Stat., as amended, 1066, as amended, 1068, 1082, as amended; 47 U.S.C. 154, 155, 303. Interpret or apply secs. 301, 303, 307, 48 Stat. 1081, 1082, as amended, 47 U.S.C. 301, 303, 307), 150814=(4) If operation pursuant to paragraph (c)(3) of this section is necessary, or before the 30-day period specified in paragraph (c)(2) of this §expires, the licensee must request a Special Temporary Authority (STA) in accordance with section 73.1635 to continue operation with parameters at variance and/or with reduced power along with a statement certifying that all monitoring points will be continuously maintained within their specified limits., 506345=[28 FR 13623, Dec. 14, 1963, as amended at 48 FR 29506, June 27, 1983], 296057=Using the 6 mS/m curve, the estimated radius of the 0.5 mV/m contour is 62.5 kilometers. Subtracting this distance from the distance between the two stations leaves 197.5 kilometers. Using the same propagation curve, the signal from the 5 kW station at this distance is seen to be 0.059 mV/m. Since a protection ratio of 6 dB, desired to undesired signal, applies to stations separated by 10 kHz, the undesired signal could have had a value of up to 0.25 mV/m without causing objectionable interference. For co-channel studies, a desired to undesired signal ratio of no less than 20:1 (26 dB) is required to avoid causing objectionable interference., 442476=[71 FR 76219, Dec. 20, 2006], 555612=[44 FR 58731, Oct. 11, 1979, as amended at 45 FR 28141, Apr. 28, 1980; 48 FR 38479, Aug. 24, 1983; 49 FR 4210, Feb. 3, 1984; 49 FR 49851, Dec. 24, 1984], 547952=[42 FR 16422, Mar. 28, 1977, as amended at 57 FR 48333, Oct. 23, 1992], 136387=Note: In paragraph (b)(1) of this section, the requirement that monitors be capable of operation in the 535-1705 kHz band shall apply only to equipment manufactured after July 1, 1992. Use of a monitor in the 1605-1705 kHz band which is not approved for such operation will be permitted pending the general availability of 535-1705 kHz band monitors if a manufacturer can demonstrate, in the interim, that its monitor performs in accordance with the standards in this section on these 10 channels., 672178=(b) Existing NCE-FM stations. (1) A NCE-FM station license authorized to operate on channels 201-220 as of December 31, 1984, or a permittee, granted a construction permit for a NCE-FM station as of December 31, 1984, are not subject to this section unless they propose either:, 129530=[37 FR 7516, Apr. 15, 1972, as amended at 42 FR 36827, July 18, 1977; 42 FR 61863, Dec. 7, 1977; 44 FR 36036, June 20, 1979; 47 FR 28387, June 30, 1982; 48 FR 38477, Aug. 24, 1983; 48 FR 44805, Sept. 30, 1983; 49 FR 3999, Feb. 1, 1984; 49 FR 4210, Feb. 3, 1984; 49 FR 49850, Dec. 24, 1984; 50 FR 24521, June 11, 1985; 52 FR 10570, Apr. 2, 1987], 116351=[47 FR 8588, Mar. 1, 1982, as amended at 49 FR 3999, Feb. 1, 1984], 944079=(b) Notwithstanding paragraph (a) of this section, an application may be filed for a channel or community not listed in the TV Table of Allotments if it is consistent with the rules and policies established in the Third Report and Order in WT Docket 99-168 (FCC 01-25), adopted January 18, 2001. Where such a request is approved, the Media Bureau will change the Table of Allotments to reflect that approval., 133429=(i) The accuracy with which any difference in the phases of the applied signals is indicated shall be ±1°, or better, for signal amplitude ratios of from 2:1 to 1:1, and ±2°, or better, for signal amplitude ratios in excess of 2:1 and up to 5:1., 494652=[52 FR 37788, Oct. 9, 1987; 52 FR 39920, Oct. 26, 1987, as amended at 54 FR 16367, Apr. 24, 1989; 54 FR 19374, May 5, 1989; 54 FR 35339, Aug. 25, 1989; 65 FR 79777, Dec. 20, 2000], 701702=[48 FR 26615, June 9, 1983], 65430=AM broadcast band. The band of frequencies extending from 535 to 1705 kHz., 136958=(Secs. 4, 5, 303, 48 Stat., as amended, 1066, 1068, 1082 (47 U.S.C. 154, 155, 303)), 238749=[44 FR 36037, June 20, 1979, as amended at 56 FR 64862, Dec. 12, 1991], 88738=(c) Class A, Class B and Class D stations may be assigned on 540, 690, 730, 740, 800, 860, 900, 990, 1010, 1050, 1220, 1540, 1570, and 1580 kHz., 640251=[43 FR 39715, Sept. 6, 1978, as amended at 47 FR 30068, July 12, 1982; 52 FR 43765, Nov. 16, 1987; 58 FR 44950, Aug. 25, 1993], 560381=(a) An FM broadcast station may, without specific authority from the FCC, transmit stereophonic (biphonic, quadraphonic, etc.) sound programs upon installation of stereophonic sound transmitting equipment under the provisions of §§2.1001, 73.322, and 73.1590 of the Rules. Prior to commencement of stereophonic sound broadcasting, equipment performance measurements must be made to ensure that the transmitted signal complies with all applicable rules and standards., 440609=2. At 77 FR 50053, Aug. 20, 2012, §73.202(b), the Table of FM Allotments under California, was amended; however, the amendment could not be incorporated due to inaccurate amendatory instruction., 92661=[28 FR 13574, Dec. 14, 1963, as amended at 29 FR 9499, July 11, 1964; 49 FR 32358, Aug. 14, 1984; 50 FR 18821, May 2, 1985; 54 FR 39736, Sept. 28, 1989; 56 FR 64857, Dec. 12, 1991], 510705=(b) Stations at locations authorized prior to May 17, 1989, that did not meet the IF separation distances required by §73.207 and have remained short-spaced since that time may be modified or relocated provided that the overlap area of the two stations' 36 mV/m field strength contours is not increased., 237767=[46 FR 11992, Feb. 12, 1981, as amended at 56 FR 64862, Dec. 12, 1991; 66 FR 20756, Apr. 25, 2001], 187900=[42 FR 16422, Mar. 28, 1977], 165891=(1) Between the first Sunday in April and the end of the month of April, Class D stations will be permitted to conduct pre-sunrise operation beginning at 6 a.m. local time with a maximum power of 500 watts (not to exceed the station's regular daytime or critical hours power), reduced as necessary to comply with the following requirements:, 658361=[50 FR 27962, July 9, 1985, as amended at 52 FR 43765, Nov. 16, 1987; 65 FR 79778, Dec. 20, 2000], 94095=(3) Statement as to whether or not AM stereo operation is proposed for the operation in the 1605-1705 kHz band., 634053=[72 FR 45692, Aug. 15, 2007, as amended at 75 FR 17877, Apr. 8, 2010], 1184747=ERPmax=97.35-33.24*log10(HAAT), 506745=(a) Stations at locations authorized prior to November 16, 1964, that did not meet the separation distances required by §73.207 and have remained continuously short-spaced since that time may be modified or relocated with respect to such short-spaced stations, provided that (i) any area predicted to receive interference lies completely within any area currently predicted to receive co-channel or first-adjacent channel interference as calculated in accordance with paragraph (a)(1) of this section, or that (ii) a showing is provided pursuant to paragraph (a)(2) of this section that demonstrates that the public interest would be served by the proposed changes., 357436=(6) The main element or elements of a directional antenna system shall meet the above minimum requirements with respect to height or effective field strength. No directional antenna system will be approved which is so designed that the effective field of the array is less than the minimum prescribed for the class of station concerned, or in case of a Class A station less than 90 percent of the ground wave field which would be obtained from a perfect antenna of the height specified by Figure 7 of §73.190 for operation on frequencies below 1000 kHz, and in the case of a Class B or Class D station less than 90 percent of the ground wave field which would be obtained from a perfect antenna of the height specified by Figure 7 of §73.190 for operation on frequencies below 750 kHz., 209054=[36 FR 919, Jan. 20, 1971, as amended at 37 FR 529, Jan. 13, 1972; 41 FR 24134, June 15, 1976; 46 FR 11991, Feb. 12, 1981; 48 FR 24384, June 1, 1983; 51 FR 2707, Jan. 21, 1986; 52 FR 36877, Oct. 1, 1987; 56 FR 64861, Dec. 12, 1991; 57 FR 43290, Sept. 18, 1992], 228000=A=E(φ, O)2aug−E(φ, O)2std in which φ is the central azimuth of augmentation. E(φ, O)aug and E(φ, O)std are the fields in the horizontal plane at the central azimuth of augmentation., 146513=(a) Each AM station using a directional antenna with monitoring point locations specified in the instrument of authorization must make field strength measurements as often as necessary to ensure that the field at each of those points does not exceed the value specified in the station authorization. Additionally, stations not having an approved sampling system must make the measurements once each calendar quarter at intervals not exceeding 120 days. The provision of this paragraph supersedes any schedule specified on a station license issued prior to January 1, 1986. The results of the measurements are to be entered into the station log pursuant to the provisions of §73.1820., 659330=[42 FR 36829, July 18, 1977], 966840=Note: The nature and extent of the protection from interference accorded to TV broadcast stations which were authorized prior to April 14, 1952, and which were operating on said date is limited not only as specified above but is further limited by any smaller separations existing between such stations on said date. Where, as a result of the adoption of the Table of Allotments or of changes in transmitter sites made by such stations after said date, separations smaller than the required minimum are increased but still remain lower than the required minimum, protection accorded such stations will be limited to the new separations., 633534=(10) A certification that the operation will not cause human exposure to levels of radio frequency radiation in excess of the limits specified in §1.1310 of this chapter and is therefore categorically excluded from environmental processing pursuant to §1.1306(b) of this chapter. Any station that cannot certify compliance must submit an environmental assessment (“EA”) pursuant to §1.1311 of this chapter and may not commence IBOC operation until such EA is ruled upon by the Commission., 664333=[43 FR 39716, Sept. 6, 1978, as amended at 44 FR 48226, Aug. 17, 1979; 47 FR 28388, June 30, 1982; 50 FR 8326, Mar. 1, 1985], 85924=(i) That, for all stations, the daytime 5 mV/m contour encompasses the entire principal community to be served. That, for stations in the 535-1605 kHz band, 80% of the principal community is encompassed by the nighttime 5 mV/m contour or the nighttime interference-free contour, whichever value is higher. That, for stations in the 1605-1705 kHz band, 50% of the principal community is encompassed by the 5 mV/m contour or the nighttime interference-free contour, whichever value is higher. That, Class D stations with nighttime authorizations need not demonstrate such coverage during nighttime operation., 688724=(iii) If any part of the predicted interference area is located outside the affected TV Channel 6 station's Area of Dominant Influence (ADI), outside the Grade A field strength contour (§73.683), and within the predicted city grade field strength contour (73.685(a)) of a TV broadcast station whose only network affiliation is the same as the only network affiliation of the affected TV Channel 6 station, the number of persons within that part will be subtracted. (For purposes of this provision, a network is defined as ABC, CBS, NBC, or their successors.) In addition, the ADI of an affected TV Channel 6 station and the program network affiliations of all relevant TV broadcast stations will be assumed to be as they were on the filing date of the NCE-FM application or June 1, 1985, whichever is later., 288015=4During nighttime hours, Class C stations in the contiguous 48 States may treat all Class B stations assigned to 1230, 1240, 1340, 1400, 1450 and 1490 kHz in Alaska, Hawaii, Puerto Rico and the U.S. Virgin Islands as if they were Class C stations., 944503=[51 FR 44070, Dec. 8, 1986, as amended at 66 FR 10208, Feb. 14, 2001; 67 FR 13232, Mar. 21, 2002], 987139=[73 FR 5682, Jan. 30, 2008], 442924=[49 FR 10264, Mar. 20, 1984], 1185184=ERPmax=62.34-17.08*log10(HAAT), 612424=(a) FM broadcast stations employing transmitters authorized after January 1, 1960, must maintain the bandwidth occupied by their emissions in accordance with the specification detailed below. FM broadcast stations employing transmitters installed or type accepted before January 1, 1960, must achieve the highest degree of compliance with these specifications practicable with their existing equipment. In either case, should harmful interference to other authorized stations occur, the licensee shall correct the problem promptly or cease operation., 575106=[28 FR 13623, Dec. 14, 1963, as amended at 31 FR 10126, July 27, 1966; 49 FR 48937, Dec. 17, 1984; 58 FR 44950, Aug. 25, 1993; 63 FR 33877, June 22, 1998], 369855=[28 FR 13574, Dec. 14, 1963, as amended at 30 FR 12720, Oct. 6, 1965; 33 FR 15420, Oct. 17, 1968; 48 FR 42959, Sept. 20, 1983; 49 FR 43963, Nov. 1, 1984; 50 FR 18844, May 2, 1985; 51 FR 4753, Feb. 7, 1986; 52 FR 36879, Oct. 1, 1987; 56 FR 64869, Dec. 12, 1991], 95865=Note 1: Until further notice by the Commission, the filing of these petitions is limited to licensees of existing AM stations (excluding Class C stations) operating in the 535-1605 kHz band. First priority will be assigned to Class D stations located within the primary service contours of U.S. Class A stations that are licensed to serve communities of 100,000 or more for which there exists no local fulltime aural service., 337799=(b) To obtain the maximum permissible radiation for a Class B or Class D station on a given frequency from 640 through 990 kHz, multiply the radiation value obtained for the given distance and azimuth from the 500 kHz chart (Figure 9 of §73.190) by the appropriate interpolation factor shown in the K500 column of paragraph (c) of this section; and multiply the radiation value obtained for the given distance and azimuth from the 1000 kHz chart (Figure 10 of §73.190) by the appropriate interpolation factor shown in the K1000 column of paragraph (c) of this section. Add the two products thus obtained; the result is the maximum radiation value applicable to the Class B or Class D station in the pertinent directions. For frequencies from 1010 to 1580 kHz, obtain in a similar manner the proper radiation values from the 1000 and 1600 kHz charts (Figures 10 and 11 of §73.190), multiply each of these values by the appropriate interpolation factors in the K′1000 and K′1600 columns in paragraph (c) of this section, and add the products., 1164118=(c)(1) Availability of channels. Applications may be filed to construct DTV broadcast stations only on the channels designated in the DTV Table of Allotments set forth in paragraph (b) of this section, and only in the communities listed therein. Applications that fail to comply with this requirement, whether or not accompanied by a petition to amend the DTV Table, will not be accepted for filing. However, applications specifying channels that accord with publicly announced FCC Orders changing the DTV Table of Allotments will be accepted for filing even if such applications are tendered before the effective dates of such channel change. An application for authority to construct a DTV station on an allotment in the initial DTV table may only be filed by the licensee or permittee of the analog TV station with which that initial allotment is paired, as set forth in Appendix B of the Memorandum Opinion and Order on Reconsideration of the Sixth Report and Order in MM Docket 87-268, FCC 98-24 (Memorandum Opinion and Order) adopted January 29, 1998. Copies of the Memorandum Opinion and Order may be inspected during normal business hours at the: Federal Communications Commission, Room CY-C203, 445 12th Street, SW., Reference Information Center, Washington, DC, 20554. This document is also available through the Internet on the FCC Home Page at http://www.fcc.gov. Applications may also be filed to implement an exchange of channel allotments between two or more licensees or permittees of analog TV stations in the same community, the same market, or in adjacent markets provided, however, that the other requirements of this section and §73.623 are met with respect to each such application., 290891=(t) The groundwave service of two stations operating with synchronized carriers and broadcasting identical programs will be subject to some distortion in areas where the signals from the two stations are of comparable strength. For the purpose of estimating coverage of such stations, areas in which the signal ratio is between 1:2 and 2:1 will not be considered as receiving satisfactory service., 665998=[47 FR 30068, July 12, 1982, as amended at 65 FR 36378, June 8, 2000], 549305=(a) Each FM broadcast station shall be equipped with indicating instruments which conform with the specifications described in §73.1215 for determining power by the indirect method; for indicating the relative amplitude of the transmission line radio frequency current, voltage, or power; and with such other instruments as are necessary for the proper adjustment, operation, and maintenance of the transmitting system., 660059=(c) Stations licensed before December 31, 1984, and operating above 50 kW in Zones I and I-A, and above 100 kW and in Zone II may continue to operate as authorized., 93665=(a) Any party interested in operating an AM broadcast station on one of the ten channels in the 1605-1705 kHz band must file a petition for the establishment of an allotment to its community of license. Each petition must include the following information:, 355277=(i) Class C stations, and stations in Alaska, Hawaii, Puerto Rico and the U.S. Virgin Islands on 1230, 1240, 1340, 1400, 1450 and 1490 kHz that were formerly Class C and were redesignated as Class B pursuant to §73.26(b), 45 meters or a minimum effective field strength of 241 mV/m for 1 kW (121 mV/m for 0.25 kW). (This height applies to a Class C station on a local channel only. Curve A shall apply to any Class C stations in the 48 conterminous States that are assigned to Regional channels.), 700712=[44 FR 58732, Oct. 11, 1979], 147784=[50 FR 47054, Nov. 14, 1985, as amended at 73 FR 64560, Oct. 30, 2008], 130499=(1) The monitor shall be designed to operate in the 535-1705 kHz band.}",
    "textBeforeTable": "(a) An application filed with the FCC for a new station or for an increase in power of an existing station shall specify nominal power rounded to two significant figures as follows: §73.31   Rounding of nominal power specified on applications. Back to Top [58 FR 27949, May 12, 1993] Note 5: The preference for AM stereo in the expanded band will be administered as follows: when an allotment under consideration (candidate allotment) conflicts with one or more previously selected allotments (established allotments) and cannot be accommodated in the expanded band, the candidate allotment will be substituted for the previously established allotment provided that: the petitioner for the candidate allotment has made a written commitment to the use of AM stereo and the petitioner for the established allotment has not; the difference between the ranking factors associated with the candidate and established allotments does not exceed 10% of the ranking factor of the candidate allotment; the substitution will not require the displacement of more than one established allotment; and both the candidate allotment and the established allotment are within the same priority group. Note 4: Other than the exception specified in note 1 of this section, existing fulltime stations are considered first for selection as described in note 2 of this section. In the event that an allotment availability exists for which no fulltime station has filed a relevant petition, such",
    "textAfterTable": "(2) A schematic diagram showing clearly all components of coupling circuits, the point of resistance measurement, the location of the antenna ammeter, connections to and characteristics of all tower lighting isolation circuits, static drains, and any other fixtures connected to and supported by the antenna, including other antennas and associated networks. Any network or circuit component used to dissipate radio frequency power shall be specifically identified, and the impedances of all components which control the level of power dissipation, and the effective input resistance of the network must be indicated. (d) AM stations using direct reading power meters in accordance with §73.51, can either submit the information required by paragraph (c) of this section or submit a statement indicating that such a meter is being used. Subsequent station licenses will indicate the use of a direct reading power meter in lieu of the antenna resistance value in such a situation. [66 FR 20755, Apr. 25, 2001,as amended at 67 FR 13231, Mar. 21, 2002] Back to Top §73.57   Remote reading antenna and common point ammeters. Remote reading antenna and common point ammeters may be used without further authority according to the following conditions: (a) Remote reading antenna or common point ammeters may be provided by: (1) Inserting second radio frequency current sensing device directly in the antenna circuit with remote leads to the indicating instruments. (2) Inductive coupling to radio frequency current sensing device for providing direct current",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}