{
    "relation": [
        [
            "The Associates",
            "Countries Statistics",
            ""
        ],
        [
            "Georgetown Dry Cleaner",
            "Yugo National Bank",
            "Watts A Loan"
        ],
        [
            "Convenience Store",
            "Survey",
            "US Senate"
        ]
    ],
    "pageTitle": "Microsoft Office Access 2007 Lessons - FunctionX",
    "title": "",
    "url": "http://www.yevol.com/access/index.htm",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986423.95/warc/CC-MAIN-20150728002306-00219-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 867928845,
    "recordOffset": 867920643,
    "tableOrientation": "VERTICAL",
    "TableContextTimeStampAfterTable": "{25187=These databases were part of Microsoft Access 97 installation. They were released again with Microsoft Access 2000 but without the sample values. Then, they were not released anymore. They are good databases for learning various things in database development (of course you can open them with Microsoft Office Access 2007 and convert them (you should Enable the security on each file))., 11814=This web site provides lessons on how to use Microsoft Office Access 2007 to create and manage databases. The lessons follow a step-by-step format with practical examples., 12026=To follow these lessons, you must have Microsoft Office Access 2007 installed on your computer. The lessons are listed on the left side of this page. Below, the lessons are presented as topics.}",
    "lastModified": "Wed, 30 Jan 2013 21:55:38 GMT",
    "textBeforeTable": "Microsoft Access is an application used to create small and midsize computer desktop databases for the Microsoft Windows family of operating systems. It can also be used as a database server for a web-based application. It is also supported by ADO, ODBC, and the .NET Framework, etc. This web site provides lessons on how to use Microsoft Office Access 2007 to create and manage databases. The lessons follow a step-by-step format with practical examples. To follow these lessons, you must have Microsoft Office Access 2007 installed on your computer. The lessons are listed on the left side of this page. Below, the lessons are presented as topics. The content of this web site is available for purchase as an ebook.   Sectional and Tabbed Forms Details on Data Relationships Introduction to Relationships Customizing Charts",
    "textAfterTable": "  General   Interface Design Objects Fundamentals The Ribbon The Properties Window Help The Navigation Pane Input Box MCAS Topics Message Box   Tables Forms Reports Queries Introduction Introduction Introduction Introduction Datasheet View Dialog Boxes Grouping Records As a Record Source Column in Datasheet Print Invoice Column in Design View   Data Import/Export Records Relationships MS SQL Server Data Entry Microsoft Excel Find/Replace",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}