{
    "relation": [
        [
            "Commenter",
            "driwancybermuseum",
            "hansvschaik",
            "H Djufri Mangkuto",
            "Ben",
            "nanang surya",
            "Myhashstory",
            "Martin"
        ],
        [
            "",
            "",
            "",
            "",
            "",
            "",
            "Follow",
            ""
        ],
        [
            "Comments",
            "507",
            "4",
            "3",
            "3",
            "3",
            "3",
            "3"
        ]
    ],
    "pageTitle": "Driwancybermuseum's Blog | Just another WordPress.com site",
    "title": "",
    "url": "https://driwancybermuseum.wordpress.com/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989043.35/warc/CC-MAIN-20150728002309-00001-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 878802471,
    "recordOffset": 878752343,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{4198=bILA DIPERLUKAN sAYA AKAN MENGHADAP SENDIRI KE sEMARANG SAAT PESTA PERNIKAHAN KEPONAKAN SAYA PADA BULAN SEPTEMBER 2015 YANG AKAN DATANG, 36904=1. The front of the homeoffice with Qillin staircase or tangga Killin as the protection of uniquecollection cybermuseum homeoffice, constist two Qillin stone statue,two Qillin wooden carving, three artifact Qillin late Ming ceramic , design by Dr Iwan S. built by Mr burhanuddin , the idea from Ming emperor palace forbidden city Beijing @copyright Dr Iwan S.2010 (ill. caption “Qillin decoration”), 24850=Setealh pensiun say mulai bertualang keliling asia untuk mengumpulkan postal history dan prangko thematik langka,saat kunjungan saya tahun 2008,saat singah di Bangkok,saya menemukan sebuah buku tentang prangko thematik yang memeroleh medali large Gold pada perlombaan International,karena buku sangat mahal hampir US $ 400,- say mencatat saja jenis thematik yang say jadikan dasar penyusuan buku elektronik CD-ROM ini., 30618=Collection terseburt growing up as I went on to study a master S2 Hospital Administration 1989-1990 and continued during sya duty in West Kalimantan 1990-1994, and served in the Police Headquarters of the Republic of Indonesia 1994-2001, 32233=KLIhatlah my profile with my teacher pack Sofyanto while in middle xekolah Upper Don Bosco Padang 1960-1963, 16392=These were made from 1920 to 1968. In the 18th century, porcelain was used to make perfume bottles, but glass is used exclusively to make perfume bottles today., 69358=Puji Sjukur Kehadirat Tuhan Allah Yang Mahakuasa, pada hari ini subuh jam tiga pagi tanggal 1 juli 2015 setelah melalui masa yang cukup lama, lebih kurang 50 tahun , sebagai seorang kolektor dan investor benda seni kreasi leluhur Umut manusia yang dititipkan Yang Mahakiasa dari Pilihan Mata da Perasaan AnugrahNya Kepada telah saya dapat terwujud dan dihimpun dalam suatu wadah Museum WANLI di Jakarta miliki Keluarga Besar , walaupun masih sederhana sekali tetapi tentunya akn segera akan berkembang dengan bantuan anda semua para pembaca dan pemirsa Web Blog Driwancybermuseum., 23979=Pada tahun 2010 saya membangun web blog sampai tiga, 79989=Obat dewa lain juga dapat untuk menghilangkan flek-flek pada muka, gatal-gatal dan kudisan di kaki atau selal kaki atau telapak kaki, obat untuk mengatasi diabetes, hipertensi, asam urat, obat menigkatkan Hemogloin (anemia karena bernagai penyebab0, sya jadi ingat waktu saya praktek di Solok, ada orang yang sudah tidak dapat berfjalan,sudah didoakan di mesjid, datang kepada saya, saya beri obat tiga biji,satu sehari, ia sembuh segera,sampai pendduk desa tersebut gempar,dan berduyunpduyun pas=en datang ke praktek sya,sehingga sya dapat beli rumah dan mobil dalam tiga tahun saja, saat n= ini mana ada anak mmuda umur tiga puluh tahun bis abeli mobil,sehingga mereka kira saya adalah KAPOLRI, karena saat itu mobil orang masih jelek-jelek, padahal saya naik Toyota Corona 1500 cc, yang harganya saat itu lima juta rupiah,sekarng sama dengan lima ratus juta rupiah, begitu juga rumah yang ada dua erdampingan. Seluruh harta ini sudah saya jual saat pindah kekota lain untuk melanjutkan studi Mgister Adminsitri Rumah sakit atau istilah saat ini Master Of Hopital Administration tahun 1990, maka jadilah saya Konsultan untuk pengembnagan RFumahSakit, saya telah merencanakan melaksanakan penegambangan rumah sakit atau tempat perwtan sementara di Polres Solok,Poldan Sumbar,Polda Kalimantan Barat, sesudah itu Pengembangan Laboratorium DNA dan Kedokteran Kepolisian, Pendidikan Pendidikan kejuruan kedokteran Kepolsiian, kemudian merencanakan organisasi Pusat kedokteran kepolisian dna terakhir mengumpulkan data dan menrencanakan pependirian rumah sakit Bhayangkara di sieluruh Indoensia, terakhir menrencanakan dan melaksnakaan evakuasi darurat setelah jajak pendpat di Dili Timor Timur. Anak Buah saya sudah jadi Jendral dua orang, teman-teman bersama saya jadi jendral semua, hanya saya kurang perhatian sehingga lupa mengusulkan kenaikan pangkat kehormatan terakhir jadi Brigardir Jenderal, begitulah saya terlalu ingat orag sampai lupa urus diri sndiri., 25337=KOleksi terseburt berkembang sampai saat saya melanjutkan studi S2 master Hospital Administration tahun 1989-1990 dan dilanjutkan saat sya bertugas di kalimatan Barat 1990-1994,dan bertugas di Markas Besar Kepolisian Negara Republik Indonesia 1994-2001 , 4018=demikianlah konsep surat yang akan say layangka ke museum muri, 6658=Copyright@Dr Iwan 2015, 63720=HAK CIPTA @ Dr Iwan 2015, 17021=JAkarta June 2015, 4399=JUMLAH ARETIKEL 1019, 16558=DeVilbiss Company has made atomizers of all types since 1888 but no longer makes the perfume bottle tops so popular with collectors., 22987=Jakarta Agustus 2010, 26979=KLIhatlah profile saya dengan guru saya pak Sofyanto saat di xekolah menengah Atas Don Bosco di Padang 1960-1963, 98105=Pada pagi yang cerah ,senin ,juni 2015 ini saya baru saja bangun dari suatu mimpi yang sangat indah,mimpi museum leluhur “Wan Li” yang berisi koleksi ciptaan para maestro yang ditemukan di Indonesia, seluruh koleksi asli , walaupun ada beberapa repro tetapi repro orisinil lama atau hanya berupa orisinil replica, karena sangat mustahil untuk dapat menemukan sleuruh karya orisinil., 77238=Untuk anda yang sering main computer,umumnya pad apakai kaca mata, karena mata anda jadi kering, untuk mencegah mata rusak tetes mata obat untuk melembabkan mata 1x sehari, jika mata perih terlalu lama nonton TV dan main games tetes obat mengurang pembengkakan mata satu tetes 3 X sehari ,juga ada obat untuk mencegah timbulnya katara(nama obat dirahasiakan harus pakai resep dokter), dan terakhir ada obat untuk mencegah perdarahn pada retina mata (nama obat EC soft cpasul buatan GW., 17247=Jakarta June 2015, 28002=I thank the various parties who telang emndukungd memebrikan an encouragement to me to be able to menyelesiakan paper electronic book preformance CRF-ROM. May be useful for philatelists koletor thematik in developing the collection so the highest award DAPT Large Gold medal., 30169=After retired  I start adventuring around asia for postal history and stamp collecting rare thematik, when my visit in 2008, when singah in Bangkok, say to find a book of stamps that acquiring thematik Large Gold medals in International competitions, because the book is very expensive at nearly U.S. $ 400 , – say the record just kind of say thematik breastfeeding use as the basis of electronic books CD-ROM., 31766=Pengetahuna philatelic collection thematik me about the first time when I followed the practice of medicine at the Faculty of the University of Indonesia in 1970-1972 kedoktera, 27521=saya mulai mengumpul prangko tahun 1955 pada usia sepuluh tahun, pertama kali memeroleh prangko dari pastor Italia Ganizaro berupa guntingan surat-surat lama, berdasarkan koleksi ini mulailah saya menyusu suatu koleksi prangko yang memiliki gambar yang indah terutama dari Swiss desain flora,fauna dan pemandangan alamnya, kemudian koleksi berkembang setelah memeperoleh katalogus dari Pasto italy mulailah mengumpulkan prangko Italia yang harganya tinggi berdasarkan katalogus Italia dan swiss tersebut, 8033=That’s it. That’s all I got.  It just makes me so mad I want to huck a handful of 1909-S V.D.B. Lincoln cents at someone., 98796=Jakarta Juni 2015, 74624=JIka ada kelainan pada ginjal dilihat dari kadar Creatine darah diatas 1,8 minum Pro R ditambah seluruh obat untuk mejaga keseimbangan asam urat (nama obat A),tensi (nama obat I),gula(nama Obat G), K dan Na darh (nama dirahasiakan sebab perlu resep dokter)., 72621=Hak Cipta @ 2015, 80737=Selama ini yang banyak kemajuan adalah tehnik diagnoss, begitu kata banyak dokter, ini tidka benar, ternyata dari penelitian yang saya laksnaakan, banyak kemajuan dibidang obat herbal dan traditional, hanya saying banyak disalah gi=unakan dengan mencampurnya dengan obat kimiawai kedokteran dan nayak yang berbahaya dan harus pakai resep doketr, syukur BPOM telah bayak menangkap obat tradisional seperti itu. Obat yang dimakan terus menerus, apalagi yang mengandung asam akan menyebabkan luka atau tukak lambung, dan yang bayak mengang kortisteroid atgau hormone akanmembuat kekacauan pada keeimbangan hormonal dengan beragai akibat yang tidak diinginkan, Makanya konsultasilah pada ahlinya,salah satu adalah saya., 8921=There has been some weak-ass legislation (H.R. 5977: Collectible Coin Protection Act) recently introduced by Texas Representative Lamar Smith to try and address this issue. However,  Govtrack.US gives it an 8% chance of being enacted, and if it was, it still would do nothing to effect China’s domestic production., 27688=September 2010, 20702=Copyright@2015, 20373=In 1995 I found in Jakarta some antique parfu (Aroma) bottle , Eu de cologne J.B>Plaat, when I seach in internet by google I cannot found the informations, but in Pinterest I get some amazing antique Parfum aroma bootles, I thinks fbeter I starting to search aboun the antique found in Indonesia., 29299=In 2010 I built a web blog for up to three, 89411=HAK CIPTA @ 2015, 64525=Jakarta 1 Juli 2015, 26507=Pengetahuna saya tentang koleksi filateli  thematik pertama kali saat saya mengikuti praktek kedokteran di Fakultas kedoktera Universitas indonesia tahun 1970-1972, 8186=But the actual open production of counterfeit US currency, which even pre-1949 is considered legal tender?  WTF…???, 10944=Posted by Brian Lund in Just for fun, TradingJuly 11, 2012, 9883=In China it is perfectly legal to produce pre-1949 US coins with no indication whatsoever that they are fake.}",
    "TableContextTimeStampAfterTable": "{97485=* Based on the 1000 most recent comments.}",
    "lastModified": "Sun, 02 Aug 2015 12:17:49 GMT",
    "textBeforeTable": "Summaries Yesterday Today Top Posts & Pages Today // 600 500 400 300 200 100 0 Jun 27 Jun 22 Jun 17 Jun 12 Jun 7 Jun 2     // Summaries Months Weeks Days Did you know you can view enhanced stats on WordPress.com? Show Me // Tip: Update your about page so your readers can learn a bit about you. June 27, 2015, 9:04 pm SITUASI WEB HARI INI bagi temabn-teman yang setuju dengan usulan saya harap bersedia memberikan komentar,sebab nanti komentar anda akan saya lampirkan juga terima kasi atas perhatiah para teman-teman demikianlah konsep surat yang akan say layangka ke museum muri tERIMA kAISIH bILA DIPERLUKAN sAYA AKAN MENGHADAP SENDIRI KE sEMARANG SAAT PESTA PERNIKAHAN KEPONAKAN SAYA PADA BULAN SEPTEMBER 2015",
    "textAfterTable": "May 31 Jun 5 Jun 10 Jun 15 Jun 20 Jun 25 0 100 200 300 400 500 600 // Today 196 views Best ever 3,272 views All time 934,538 views2,010 comments //   Referrers Today Yesterday Summaries Referrer   Views Search Engines   117 Google Search   96 google.co.id/search 22 google.com/search 20 google.com 10 google.com.ph 7 google.co.id 7",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}