{
    "relation": [
        [
            "Days",
            "30",
            "50",
            "150",
            "200"
        ],
        [
            "BSE",
            "60.25",
            "61.76",
            "69.50",
            "72.60"
        ],
        [
            "NSE",
            "60.29",
            "61.79",
            "69.49",
            "72.59"
        ]
    ],
    "pageTitle": "Steel Authority of India Stock Price, Share Price, Live BSE/NSE, Steel Authority of India Bids Offers. Buy/Sell Steel Authority of India news & tips, & F&O Quotes",
    "title": "",
    "url": "http://www.moneycontrol.com/india/stockpricequote/steel-large/steelauthorityindia/SAI",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986423.95/warc/CC-MAIN-20150728002306-00154-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 608714779,
    "recordOffset": 608663272,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{225621=SAIL is in the Steel - Large sector. The current market capitalisation stands at Rs 24,080.96 crore. The company management includes Rakesh Singh - Chairman & Managing Director, Anil Kumar Chaudhary - Director - Finance, S S Mohanty - Director - Technical, Kalyan Maity - Director, Binod Kumar - Director - Commercial, Upendra Prasad Singh - Government Director, Atmanand - Independent Director, J M Mauskar - Independent Director, Sunil Barthwal - Nominee Director, Bharathi S Sihag - Government Director, T S Suresh - Director - Projects, Kalyan Maity - Director, Vinod Kumar Thakral - Director, Upendra Prasad Singh - Government Director. It is listed on the BSE with a BSE Code of 500113 and the NSE with an NSE Code of SAIL. Its Registered office is at Ispat Bhawan, Lodi Road, New Delhi,Delhi - 110003. Their Registrars are M C S Ltd., 135582=JSWSteel Jul Fut, 224321=Astec LifeSciences Recommended on Mar 31st 2015, 134875=UnitedBrewerie Jul Fut, 134364=28 July 2015}",
    "textBeforeTable": "Edit Watchlist Have you invested in these stocks? You can track them better in your Portfolio close[x] Add to Watchist Account Optional Optional Optional Optional Add to Portfolio OR Add to watchlist } $('#mcpcp_addprof_info').hide(); { function close_info()",
    "textAfterTable": "Keep me signed in Forgot Password? New to Moneycontrol - Sign up now Its easy and FREE! Username Username should be atleast 4 characters Password Password should be 6 to 10 characters Confirm Password Email OR connect with LIVE",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}