{
    "relation": [
        [
            "Exhibit Number",
            "3.1(a)",
            "3.2(a)",
            "4.1(b)",
            "4.2(b)",
            "10.1(b)",
            "10.2(b)",
            "10.3(b)",
            "10.4(b)",
            "10.5(b)",
            "10.6(b)",
            "10.7(b)",
            "10.8(b)",
            "10.9(b)",
            "10.10(b)",
            "10.11(b)",
            "10.12(b)",
            "10.13(b)",
            "10.14(b)",
            "10.15(b)*",
            "10.16(b)",
            "10.17(b)",
            "10.18(b)",
            "10.19(b)",
            "10.20(b)",
            "10.21(b)",
            "10.22(c)"
        ],
        [
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            ""
        ],
        [
            "Description of Document",
            "Amended and Restated Certificate of Incorporation of the Registrant currently in effect.",
            "Amended and Restated Bylaws of the Registrant currently in effect.",
            "Form of specimen certificate for Overstock.com, Inc.'s common stock.",
            "Investor Rights Agreement, dated March 4, 2002.",
            "Form of Indemnification Agreement between Overstock.com, Inc. and each of its directors and officers.",
            "Amended and Restated 1999 Stock Option Plan and form of agreements thereunder.",
            "2001 Stock Purchase Plan and form of agreements thereunder.",
            "Gear.com, Inc. Restated 1998 Stock Option Plan and form of agreements thereunder.",
            "2002 Stock Option Plan, as amended, and form of agreements thereunder.",
            "Agreement and Plan of Merger dated November 3, 2000 by and between Overstock.com, Inc. and Gear.com, Inc.",
            "Form of Guaranty of Credit agreement entered into by John J. Byrne, John J. Byrne III, Patrick M. Byrne, J. Gregory Hale, and Cirque Property LC in connection with the Norwich Associates, LC $7.0 million line of credit established on September 17, 2001.",
            "Lease Agreement dated January 23, 2002 between Overstock.com, Inc. and Holladay Building East L.L.C.",
            "Lease Agreement dated November 27, 2001 between Overstock.com and Holladay Building East L.L.C.",
            "First Lease Extension Agreement dated January 25, 2002 by and between Overstock.com, Inc. and Holladay Building East L.L.C.",
            "Lease Agreement, as amended, between 2855 E. Cottonwood Parkway, L.C., and Discountsdirect, dated December 21, 1998.",
            "Lease Agreement by and between Overstock.com, Inc. and Marvin L. Oates Trust dated March 15, 2000.",
            "Severance Package Agreement with Douglas Greene dated June 17, 1999.",
            "Intellectual Property Assignment Agreement with Douglas Greene dated February 28, 2002.",
            "Strategic Alliance and Product Sales Agreement dated February 26, 2002 between Overstock.com, Inc. and Safeway, Inc.",
            "Irrevocable Letter of Credit dated August 24, 2001 from Wells Fargo Bank, N.A. for the account of Patrick M. Byrne in favor of Wells Fargo Merchant Services, LLC.",
            "Lease Termination Agreement dated March 27, 2002 by and between Overstock.com, Inc. and 2855 E. Cottonwood Parkway, L.C.",
            "Amendment No. 1, dated April 29, 2002 to Intellectual Property Assignment Agreement dated February 28, 2002 by and between Overstock.com, Inc. and Douglas Greene.",
            "Registration and Expenses Agreement dated May 3, 2002 among Overstock.com, Inc. and Amazon.com NV Investment Holdings, Inc.",
            "Form of Warrant to purchase Overstock.com, Inc. common stock",
            "Form of Series A Preferred Stock Purchase Agreement dated March 4, 2002 among Overstock.com, Inc., The Gordon S. Macklin Family Trust, Haverford Internet, LLC, John J. Byrne Jr., and twelve other purchasers of Series A Preferred Stock.",
            "Lease Amendment #1 by and between Overstock.com, Inc. and Marvin L. Oates Trust, dated August 28, 2000."
        ]
    ],
    "pageTitle": "",
    "title": "",
    "url": "http://www.sec.gov/Archives/edgar/data/1130713/000104746903006454/a2104052z10-k.htm",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986423.95/warc/CC-MAIN-20150728002306-00064-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 705420943,
    "recordOffset": 705320349,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{1=        Marketable securities consist of funds deposited into a capital management account managed by a financial institution. The financial institution has invested these funds in municipal, government and corporate bonds which are classified as available-for-sale and reported at fair value using the specific identification method. Realized gains and losses are included in earnings and were not significant during the year ended December 31, 2002. Unrealized gains and losses are excluded from earnings and reported as a component of other comprehensive income (loss), net of related estimated tax provisions or benefits.}",
    "TableContextTimeStampAfterTable": "{673628=        The Company was formed on May 5, 1997 as D2\u0097Discounts Direct, a limited liability company. On December 30, 1998, the Company was reorganized as a C Corporation in the State of Utah and reincorporated in Delaware in May 2002. On October 25, 1999, the Company changed its name to Overstock.com, Inc., 717695=        The average shares of stock options and warrants outstanding were not included in the computation of diluted earnings per share because to do so would have been antidilutive. However, the number of shares of stock options and warrants outstanding at each year-end was 1,537 shares, 2,283 shares and 2,535 shares for 2000, 2001 and 2002, respectively, of which 114 shares, 977 shares and 1,211 shares would have been included in the calculation of diluted earnings (loss) per share if the effect had been dilutive., 260709=        Cost of goods sold increased in absolute dollars from $27.8 million, or 109% of total revenue in 2000, to $34.6 million, or 87% of total revenue in 2001. The decrease in cost of goods sold as a percentage of total revenue in 2001 compared to 2000 was a result of economies of scale achieved through an increased number of sales transactions and efficiencies in operations. These efficiencies include, but are not limited to, efficiencies in the actual costs paid to suppliers for goods, freight and handling costs, the costs of customer service and returns. The decrease is also attributable to an increase in commission revenue as a percentage of total revenue (from 3% in 2000 to 10% in 2001), as commission revenue has higher gross margins than direct revenue. In 2001, cost of goods sold also includes $78,000 of stock-based compensation., 706739=        The weighted average grant-date fair value of options granted during 2000, 2001 and 2002 was $4.01, $5.97 and $8.21 per share, respectively, and was estimated using the assumptions discussed in Note 15., 58102=        Direct Fulfillment.    During 2002, we fulfilled approximately 45% of all orders through our leased 354,255 square foot Salt Lake City, Utah warehouse where we store approximately 16,000 products. We operate the warehouse with an automated warehouse management system that tracks the receipt of the inventory items, distributes order-fulfillment assignments to warehouse workers and obtains rates for various shipping options to ensure low-cost outbound shipping. Our Websites relay orders to the warehouse management system throughout each day, and the warehouse management system in turn confirms to our Websites shipment of each order. Customers track the shipping status of their packages through links we provide on our Websites. We guarantee order shipments within two business days of order placement, but most orders ship within one business day. The warehouse team ships between 10,000 and 50,000 orders each week using four overlapping daily shifts. We also process returns of direct merchandise in the Salt Lake City, Utah warehouse. We estimate we could increase our capacity in the warehouse by at least 3-5 times if necessary, through additional staffing on each shift and higher density racking., 148723=        Our common stock is traded on the Nasdaq National Market under the symbol \"OSTK.\" Prior to May 30, 2002, there was no public market for our common stock. The following table sets forth, for the periods indicated, the high and low closing prices per share for our common stock as reported on the Nasdaq National Market since May 30, 2002., 720821=        The Financial Accounting Standards Board issued SFAS No. 145, Rescission of FASB Statements No. 4, 44 and 64, Amendment of FASB Statement No. 13, and Technical Corrections. Among other things, SFAS No. 145 eliminates the requirement that gains and losses from the extinguishment of debt be classified as extraordinary items. SFAS No. 145 is effective for fiscal years beginning after May 15, 2002, with early adoption permitted. The Company does not expect the adoption of this standard to have a significant impact on its financial statements., 721538=        The Financial Accounting Standards Board issued SFAS No. 146, Accounting for Costs Associated with Exit or Disposal Activities. SFAS No. 146 addresses significant issues relating to the recognition, measurement, and reporting of costs associated with exit and disposal activities, including restructuring activities, and nullifies the guidance in Emerging Issues Task Force Issue No. 94-3, Liability Recognition for Certain Employee Termination Benefits and Other Costs to Exit an Activity (including Certain Costs Incurred in a Restructuring. SFAS No. 146 is effective for exit or disposal activities initiated after December 31, 2002, with earlier application encouraged. The Company does not expect the adoption of this standard to have a significant impact on its financial statements., 723482=        On June 4, 2002, the Company closed its initial public offering, pursuant to which it sold 2,155 shares of its common stock, and a selling shareholder sold 845 shares of common stock at a price of $13.00 per share. The offering resulted in proceeds to the Company of approximately $24,880, net of $2,014 of issuance costs. As part of the offering, the Company granted the underwriter the right to purchase up to 450 additional shares within thirty days after the offering to cover over-allotments. On June 27, 2002, the underwriter purchased an additional 101 shares of stock for $1,260. At the closing of the offering, all issued and outstanding shares of the Company's redeemable convertible preferred stock were automatically converted into common stock on a 1:1 basis., 510074=        As discussed in Note 2 to the consolidated financial statements, effective January 1, 2002, the Company changed its method of accounting for goodwill in accordance with Statement of Financial Accounting Standards No. 142, Goodwill and Other Intangible Assets., 760608=        Property and equipment included assets under capital leases of $831 and $856 at December 31, 2001 and 2002, respectively and accumulated amortization related to assets under capital leases of $359 and $691, respectively., 263191=        Amortization of goodwill.    Amortization of goodwill increased from $226,000, in 2000, to $3.1 million in 2001. This increase was due to a full year of amortization in 2001, compared to just one month's amortization in 2000. From November 28, 2000, the date of the Gear.com acquisition, to December 2001, $3.3 million of the total goodwill of $6.1 million was amortized. Effective January 2002, under Statement of Financial Accounting Standards (SFAS) No. 142, the remaining goodwill will no longer be amortized but will be evaluated periodically for impairment., 760377=        Depreciation of property and equipment totaled $684, $1,712, and $1,842 for the years ended December 31, 2000, 2001 and 2002, respectively., 255893=        General and administrative.    General and administrative expenses increased from $9.4 million in 2001, to $10.8 million in 2002 representing 24% and 12% of total revenue, respectively. The increase in absolute dollars was due primarily to new business development and the staffing necessary to manage and support our growth. General and administrative personnel increased from 65 employees at the end of 2001, to 84 employees at the end of 2002. The decrease in general and administrative expense as a percentage of total revenue was a result of economies of scale achieved through increased sales volume and the allocation of general and administrative expenses over a substantially larger revenue base., 787841=        At December 31, 2001 and 2002, the Company has classified $5,284 and $4,363, respectively, related to the rescission rights outside of shareholders' equity, because the redemption features are not within the control of the Company. However, management does not anticipate that holders of the redeemable common stock will exercise their rescission rights. Interest attributable to these securities is recorded as a deemed dividend and reflected as a deduction from net loss to arrive at net loss attributable to common shares in the Statements of Operations., 795060=        The Company's board of directors adopted the Amended and Restated 1999 Stock Option Plan and the 2002 Stock Option Plan (collectively, the \"Plans\"), in May 1999 and April 2002, respectively. Under these Plans, the Board of Directors may issue incentive stock options to employees and directors of the Company and non-qualified stock options to consultants of the Company. Options granted under these Plans generally expire at the end of five years and vest in accordance with a vesting schedule determined by the Company's Board of Directors, usually over four years from the grant date. As of the initial public offering, the Amended and Restated 1999 Stock Option Plan was terminated. Future shares will be granted under the 2002 Stock Option Plan. As of December 31, 2002, 890 shares are available for future grants under these Plans., 420102=        Financing activities provided cash of $27.9 million in the year ended December 31, 2000, primarily related to issuance of common stock for cash of $25.2 million and borrowings of $3.0 million from a bank. For the fiscal year ended December 31, 2001, financing activities provided net cash of $7.5 million principally from the issuance of common stock for cash of $6.3 million and borrowings of $4.5 million from a related party, offset by a $3.0 million repayment of a note payable. For the fiscal year ended December 31, 2002, financing activities provided cash of $28.2 million largely from the issuance of our common stock in our initial public offering and the issuance of our Series A redeemable, convertible, preferred stock, and borrowings from a related party of $1.2 million. This was offset by $5.7 million of repayments of notes payable to related parties., 850079=        On occasion, Haverford-Valley, L.C. and certain affiliated entities make travel arrangements for our executives and pay the travel related expenses incurred by our executives on Company business. In 2000, 2001, and 2002 we reimbursed Haverford-Valley L.C. $241, $251, and $273, respectively, for these expenses., 146854=        In January 2003, we received a letter from NCR Corporation claiming that certain of our business practices and information technology systems infringe patents owned by NCR. The letter further stated that NCR would vigorously protect its intellectual property rights if we did not agree to enter into licensing arrangements with respect to the asserted patents. On January 31, 2003, we filed a complaint in the United States District Court of Utah, Central Division, seeking declaratory judgment that we do not infringe any valid claim of the patents asserted by NCR., 846487=        In March 2001, the Company entered into a credit agreement with a related party, High Meadows Finance L.C. Under the terms of the agreement, High Meadows Finance L.C. was allowed to purchase 197 shares of common stock for $1,000. The fair value of this common stock was deemed to be $1,425. The excess of the fair value of the common stock over the price paid for the common stock of $425 was recorded as a debt discount, and was amortized over the term of the agreement. The Company recorded interest expense of $255 and $170 in 2001 and 2002, respectively, related to the debt discount., 790733=        In 2000, the Company issued warrants to certain shareholders in connection with the purchase of additional shares of common stock. At December 31, 2002, warrants to purchase 1,119 shares of common stock of the Company were outstanding, as follows:, 216405=        Our warehouse revenue is derived from sales that liquidate products that cannot be economically sold on our Websites due to their low price points, bulk, irregular size or other factors. Historically, we held our warehouse sales in various physical locations. We held our first warehouse sale from November 2000 to January 2001, primarily to liquidate residual products from the purchase of the entire inventory of a distressed toy retailer. We initiated a second warehouse sale in February 2002, primarily to liquidate residual products from our acquisition of Gear.com. Currently, we operate a warehouse store in our Salt Lake City warehouse facility for customers to buy certain products directly. Sales from our warehouse store in 2002 accounted for less than 2% of total revenue., 425073=        The following tables summarize our contractual obligations and other commercial commitments as of December 31, 2002, and the effect such obligations and commitments are expected to have on our liquidity and cash flows in future periods., 718362=        The Company expenses all costs incurred for the development of internal use software that relate to the planning and post implementation phases of the development. Direct costs incurred in the development phase are capitalized and recognized over the software's estimated useful life of 3 years. Software costs capitalized were $81 and $0 in 2001 and 2002, respectively. Research and development costs and other computer software maintenance costs related to software development are expensed as incurred., 251864=Comparison of Years Ended December 31, 2001 and 2002, 772784=        In March 2001, the Company entered into a credit agreement with a related party (Note 19), for working capital purposes, of which $4,500 was outstanding on December 31, 2001. The credit agreement matured in June 2002 and was not renewed by the Company. All amounts outstanding at December 31, 2001 were repaid during 2002., 257292=        Amortization of stock-based compensation.    Amortization of stock-based compensation was approximately $649,000 and $2.9 million in 2001 and 2002, respectively. We attribute this increase primarily to amortization of non-cash deferred stock-based compensation recognized relating to options grants during the respective periods., 442323=        The following table provides information as of December 31, 2002 with respect to shares of our common stock that may be issued under our existing equity compensation plans., 152452=        As of December 31, 2002, there were approximately 472 holders of record of our common stock. Because many of our shares of common stock are held by brokers and other institutions on behalf of shareholders, we are unable to estimate the total number of shareholders represented by these record holders., 437182=        In addition, on February 18, 2003, we closed a follow-on public offering pursuant to which we received approximately $24.1 million in cash, net of underwriting discounts, commissions, and other related expenses., 48006=        In addition, we have an agreement with Safeway Inc. to provide discounted merchandise to be sold within their stores. Safeway Inc. accounted for approximately $14.6 million, or approximately 15.9%, of our total revenues for the fiscal year ended December 31, 2002. Currently, we are supplying certain stores in the western and midwestern regions of the United States. During the term of our agreement with Safeway, we are prevented from selling the same or similar goods to any store that has more than 400 retail stores in the following categories: drug, mass merchandising, grocery, club or warehouse. We hope this relationship will expand to include more merchandise within more stores. In the future, we hope to develop similar relationships with other retailers., 414653=        The Financial Accounting Standards Board issued SFAS No. 145, \"Rescission of FASB Statements No. 4, 44 and 64, Amendment of FASB Statement No.13, and Technical Corrections.\" Among other things, SFAS No. 145 eliminates the requirement that gains and losses from the extinguishment of debt be classified as extraordinary items. SFAS No. 145 is effective for fiscal years beginning after May 15, 2002, with early adoption permitted. We do not expect the adoption of this standard to have a significant impact on our financial statements., 849419=        As indicated in Note 13, the Company sold shares of mandatorily redeemable convertible preferred stock in March 2002, for which a deemed dividend was recorded as a result of the beneficial conversion feature. The total deemed dividend recorded for the year ended December 31, 2002 was $6,607, of which $1,000 is attributable to preferred shares purchased by Haverford Internet, $1,200 is attributable to preferred shares purchased by members of the board of directors, and $1,500 is attributable to preferred shares purchased by family members of management., 125484=        In February 2002, Microsoft Corporation filed a complaint against us in the United States District Court for the Northern District of California alleging that we have distributed counterfeit and otherwise unauthorized Microsoft software in violation of federal copyright and trademark law and related state laws. The complaint seeks damages in an unspecified amount and injunctive relief. Although we believe we have defenses to the allegations and intend to pursue them vigorously, we do not have sufficient information to assess the validity of the claims or the amount of potential damages. Although this litigation matter is ongoing and unresolved it could result in settlement arrangements or an unfavorable outcome, including potential statutory damages., 61281=        We use our internally developed Websites and a combination of proprietary technologies and commercially available licensed technologies and solutions to support our operations. We use the services of XO Communications, Inc., Genuity Inc., Qwest Communications International, Inc. and SAVIS, Inc. to obtain connectivity to the Internet over four DS-3 lines. We currently store our data on an Oracle database running on Hewlett-Packard \"N Class' computer hardware, which is backed up by a high-speed redundant EMC Corporation storage system. Currently, we use twenty-six Dell PowerEdge servers for our Websites, which are connected to the Oracle database and operate in a multi-processing Linux environment designed to accommodate large volumes of Internet traffic. During the 2002 holiday shopping season, our Internet systems operated at 30% of their capacity. In addition, we have installed 12 Web servers and implemented \"relief valve\" functionality with technology provided by Akamai Technologies, Inc. to off-load transactions during extreme loads., 472084=        Pursuant to the requirements of the Securities Exchange Act of 1934, this report has been signed below by the following persons on behalf of the registrant and in the capacities and on the dates indicated., 785328=        In March 2002, the Company sold approximately 959 shares of mandatorily redeemable convertible preferred stock (\"preferred stock\") for approximately $6,582, net of issuance costs. The preferred stock automatically converted to common stock on a 1:1 basis in connection with the initial public offering. As the fair value of the common stock to be received upon conversion was greater than the conversion price of the preferred stock at the date the preferred stock was issued, a beneficial conversion feature resulted in the amount of $6,607, which was calculated in accordance with Emerging Issues Task Force No. 98-5 Accounting for Convertible Securities with Beneficial Conversion Features or Contingently Adjustable Conversion Ratios. This beneficial conversion feature was reflected as a deemed dividend in the statement of operations during the year ended December 31, 2002., 213718=        We are an online \"closeout\" retailer offering discount brand name merchandise, including bed-and-bath goods, kitchenware, watches, jewelry, electronics, sporting goods and designer accessories. Our company, based in Salt Lake City, Utah, was founded in 1997, and we launched our first Website through which customers could purchase products in March 1999., 440538=        The information required by this item with respect to identification of directors and officers is incorporated by reference from Overstock's definitive Proxy Statement (\"Proxy Statement\") for its Annual Meeting of Stockholders to be held on April 29, 2003 under the captions \"The Board\" and \"Executive Officers,\" respectively., 261741=        Sales and marketing.    Sales and marketing expenses decreased from $11.4 million in 2000, to $5.8 million in 2001. The decrease in marketing costs in both absolute dollars and as a percentage of total revenue as compared to 2000 was due to more effective and targeted marketing spending, reduced off-line spending and a decrease in online advertising rates. Sales and marketing expenses were 45% and 15% of total revenue for 2000 and 2001, respectively., 259285=        Total revenue grew from $25.5 million in 2000, to $40.0 million in 2001, representing growth of 57%. During this same period, direct revenue increased from $21.8 million to $35.2 million or a 61% growth, and commission revenue grew from $867,000 to $4.0 million representing growth of 361%. Warehouse revenue was $2.9 million in 2000 and $795,000 in 2001, resulting from a warehouse sale we held from November 2000 to January 2001. The decrease in warehouse revenue from 2000 to 2001 was due to the fact that two months of the warehouse sale occurred in 2000 compared to only one month during 2001. We initiated a second warehouse sale in February 2002, primarily to liquidate residual products from our acquisition of Gear.com. The increase in total revenue was due primarily to an increase in the number of both direct and commission orders and in the average order size. Also, since we began making commission sales in May 2000, there are four additional months of commission revenue in 2001 compared to 2000. The gross merchandise sales of goods sold directly by us and on behalf of third parties were $36.1 million in 2000 and $69.3 million in 2001, an increase of 92%., 508333=        In our opinion, the consolidated financial statements listed in the index appearing on page F-1 present fairly, in all material respects, the financial position of Overstock.com, Inc. and its subsidiary (the \"Company\") at December 31, 2001 and 2002, and the results of their operations and their cash flows for each of the three years in the period ended December 31, 2002, in conformity with accounting principles generally accepted in the United States of America. In addition, in our opinion the financial statement schedule listed in the index appearing on page F-1 presents fairly, in all material respects, the information set forth therein when read in conjunction with the related consolidated financial statements. These consolidated financial statements and financial statement schedule are the responsibility of the Company's management; our responsibility is to express an opinion on these consolidated financial statements and financial statement schedule based on our audits. We conducted our audits of these statements in accordance with auditing standards generally accepted in the United States of America, which require that we plan and perform the audit to obtain reasonable assurance about whether the financial statements are free of material misstatement. An audit includes examining, on a test basis, evidence supporting the amounts and disclosures in the financial statements, assessing the accounting principles used and significant estimates made by management, and evaluating the overall financial statement presentation. We believe that our audits provide a reasonable basis for our opinion., 413256=        Effective January 1, 2002, we adopted Statement of Financial Accounting Standards (\"SFAS\") No. 142 \"Goodwill and Other Intangible Assets\". SFAS 142 applies to all goodwill and identified intangible assets acquired in a business combination. Under this standard, all goodwill and long-lived intangible assets, including those acquired before initial application of the standard will not be amortized, but will be tested for impairment at least annually. Accordingly, we ceased amortization of goodwill associated with our acquisition of Gear.com in January 2002. We evaluated the $2.8 million of unamortized goodwill during 2002, and determined that no impairment charge should be recorded., 824571=        In connection with certain stock option grants to employees during the years ended December 31, 2001 and 2002, the Company recognized approximately $2,534 and $3,481, respectively, of unearned stock-based compensation for the excess of deemed fair value of shares of common stock subject to such options over the exercise price of these options at the date of grant. Such amounts are included as a reduction of stockholders' equity and are being amortized over the vesting period in accordance with FASB Interpretation Number 28, Accounting for Stock Appreciation Rights and Other Variable Stock Option or Award Plan. The Company recorded stock-based compensation expense of $727 and $3,276 during the year ended December 31, 2001 and 2002, respectively. No unearned stock-based compensation expense was recorded prior to 2001., 264866=        The following tables set forth our unaudited quarterly results of operations data for the eight most recent quarters for the period ended December 31, 2002, as well as such data expressed as a percentage of our total revenue for the periods presented. The information in the table below should be read in conjunction with the Consolidated Financial Statements and the Notes thereto included elsewhere in this Form 10-K. We have prepared this information on the same basis as the Consolidated Financial Statements and the information includes all adjustments, consisting only of normal recurring adjustments, that we consider necessary for a fair statement of our financial position and operating results for the quarters presented. Our quarterly operating results have varied substantially in the past and may vary substantially in the future. You should not draw any conclusions about our future results from the results of operations for any particular quarter., 789298=        In May 2002, the Company reincorporated in Delaware. As a result of the reincorporation, the Company is authorized to issue 100,000 shares of $0.0001 par value common stock and 5,000 shares of $0.0001 par value preferred stock. The Board of Directors may issue the undesignated preferred stock in one or more series and determine preferences, privileges and restrictions thereof., 90786=        During 2002, we had commission-based relationships with approximately 150 third parties whose products we offer for sale on our Websites. At December 31, 2002, these products accounted for approximately 67% of the products available on our Websites. We do not have any long-term agreements with any of these third parties. Our agreements with third parties are terminable at will by either party immediately upon notice. In general, we agree to offer the third parties' products on our Websites and these third parties agree to provide us with information about their products, honor our customer service policies and ship the products directly to the customer. If we do not maintain our existing or build new relationships with third parties on acceptable commercial terms, we may not be able to offer a broad selection of merchandise, and customers may refuse to shop at our Websites. In addition, manufacturers may decide not to offer particular products for sale on the Internet. If we are unable to maintain our existing or build new commission-based relationships or if other product manufacturers refuse to allow their products to be sold via the Internet, our business would suffer severely., 794456=        No warrants were exercised in 2000 or 2001, and 3 warrants were exercised in 2002., 59453=        Commission Fulfillment.    During 2002, approximately 55% of our orders were for inventory owned and shipped by third parties who pay us a commission for the sale of their products on our Websites. We currently manage approximately 150 entities that collect their orders through our Websites. These third parties perform essentially the same operations as our core warehouse: order picking, shipping, and reverse logistics processing. These third parties relay shipment confirmations to our Websites, where customers can review shipping and tracking information. From a customer's point of view, shipping from our warehouse or from the warehouse of one of these third parties is indistinguishable., 5949=        The aggregate market value of voting stock held by non-affiliates of the registrant as of February 18, 2003, was approximately $150 million based upon the last sales price reported for such date on The NASDAQ Stock Market's National Market. For purposes of this disclosure, shares of Common Stock held by persons who hold more than 5% of the outstanding shares of Common Stock and shares held by officers and directors of the registrant have been excluded in that such persons may be deemed to be affiliates. This determination is not necessarily conclusive., 51321=        B2B.    As of December 31, 2002, we had a dedicated sales force of 18 people who primarily interact with small, regional or local retailers by telephone or through email to alert them to the opportunity they have to purchase merchandise at prices that are below wholesale, and which we believe are often lower than the prices paid by the larger retailers with whom they compete., 6604=        As of February 18, 2003 there were 16,328,452 shares of the registrant's Common Stock outstanding., 510504=Salt Lake City, Utah January 27, 2003 (except as to Note 23 which is as of February 18, 2003), 827902=        The Company has a 401(k) defined contribution plan which permits participating employees to defer up to a maximum of 15% of their compensation, subject to limitations established by the Internal Revenue Code. Employees who have completed a half-year of service and are 21 years of age or older are qualified to participate in the plan. The Company matches 50% of the first 6% of each participant's contributions to the plan. Participant contributions are immediately vested. Company contributions vest based on the participant's years of service at 20% per year over five years. The Company's cash contribution totaled $32, $68 and $88 during 2000, 2001 and 2002, respectively., 678135=        The Company's accounts receivable are derived primarily from revenue earned from customers located in the United States. The Company maintains an allowance for doubtful accounts based upon the expected collectibility of accounts receivable. During the year ended December 31, 2002, the Company recorded sales to its most significant customer totaling $14,620. There were no sales to this customer during 2000 and 2001. At December 31, 2002, the Company had a receivable of $3,577 from this customer. No other customer accounted for greater than 10% of revenues or receivables during 2000, 2001 or 2002., 954806=        On February 18, 2003, the Company closed a follow-on public offering, pursuant to which it sold 1,500 shares of its common stock at a price of $15.00 per share. The offering resulted in net proceeds to the Company of approximately $20,935, net of $1,734 of issuance costs. As part of the offering, the Company granted the underwriter the right to purchase an additional 225 shares within thirty days after the offering to cover over-allotments. On February 18, 2003, the underwriter purchased all 225 shares of stock for $3,206., 214175=        Our revenue is comprised of direct revenue, commission revenue and warehouse revenue. During 2002 no single customer accounted for more than 2% of our total revenue other than Safeway, Inc., which accounted for 15.9% of our total revenue. Direct revenue includes sales made to individual consumers and businesses, which are fulfilled from our warehouse in Salt Lake City, Utah. We generate business-to-business (B2B) sales when we contact retailers by phone and email and offer them our merchandise below wholesale prices, allowing them an opportunity to be more price-competitive in their local markets. After we establish a relationship with a B2B client, the client sometimes places subsequent orders directly through our B2B Website. Our B2B calling effort began in October 2001, so our historical direct revenue has predominantly been based on individual consumer purchases made directly through our consumer Website. In February 2002, we implemented a policy intended to reduce the number of returned products. This new policy provides that we will not accept product returns initiated more than fifteen days after purchase., 421126=        On March 4, 2002, we sold 958,612 shares of our Series A redeemable, convertible, preferred stock at $6.89 per share for $6.6 million, net of issuance costs. As the fair value of the common stock received upon conversion of the preferred stock was greater than the conversion price of the preferred stock at the date the preferred stock was issued, a beneficial conversion feature resulted in a non-cash charge of approximately $6.6 million recorded in the first quarter of 2002. This non-cash charge was recorded as a deemed dividend, of which $3.7 million was attributable to shares sold to the following related parties; John J. Byrne Jr., the father of Patrick M. Byrne; Contex Limited, an entity controlled by Mark Byrne, a brother of Patrick M. Byrne; Haverford Internet LLC, an entity controlled by Patrick M. Byrne; The Gordon S. Macklin Family Trust, a trust of a director of Overstock; and Rope Ferry Associates, Ltd., an entity owned by John J. Byrne III and Dorothy M. Byrne, the brother and mother of Patrick M. Byrne. The remaining purchasers of our Series A preferred stock were unrelated parties that are friends and acquaintances of our officers and directors., 423560=        On June 7, 2002, we used approximately $3.0 million of the net proceeds of our initial public offering to repay, in full, all outstanding indebtedness under a line of credit with High Meadows Finance L.C., which matured on June 1, 2002 and bore a per annum interest rate equal to 3.5%, plus the rate of interest announced from time to time by Wells Fargo Bank & Company as its \"Prime Rate.\" High Meadows Finance, L.C. is owned by High Plains Investments, LLC, an entity controlled by Patrick M. Byrne, our president and Chief Executive Officer; John J. Byrne Jr., the father of Patrick M. Byrne; and Cirque Properties, Inc., an entity owned by John J. Byrne, III, the brother of Patrick M. Byrne., 736374=        The lease exit costs represented the remaining minimum payments on an office lease, less anticipated sublease revenue. The workforce reductions represented the termination of 45 Gear.com employees. The fulfillment contract termination cost represented the early termination penalty on a fulfillment contract which the Company terminated in October 2001. A final adjustment to the estimated lease exit costs of $94 was included in the allocation of the purchase price of Gear.com, as the adjustment was determined within the purchase price allocation period., 230267=        The following table sets forth our results of operations expressed as a percentage of total revenue for 2000, 2001 and 2002., 6883=        Portions of the Proxy Statement for the registrant's 2003 Annual Meeting of Stockholders are incorporated by reference into Part III of this Form 10-K., 745953=        All marketable securities mature between 2003 and 2005., 784290=        The Company is subject to various legal proceedings and claims that arise in the ordinary course of business. In February 2002, Microsoft Corporation filed a complaint against the Company alleging that the Company has distributed counterfeit and otherwise unauthorized Microsoft software in violation of federal copyright and trademark law and related state laws. The complaint seeks damages in an unspecified amount and injunctive relief. Although the Company believes it has defenses to the allegations and intends to pursue them vigorously, currently, management does not have sufficient information to assess the validity of the claims or the amount of potential damages. Company management currently believes, however, that resolution of such legal matters will not have a material adverse impact on the Company's financial position, results of operations or cash flows., 95532=        We have received in the past, and we anticipate we will receive in the future, communications alleging that certain items listed or sold through our Websites infringe third-party copyrights, trademarks and trade names or other intellectual property rights. For example, in February 2002, Microsoft Corporation filed a complaint against us alleging that we have distributed counterfeit and otherwise unauthorized Microsoft software in violation of federal copyright and trademark law and related state laws. This litigation matter is ongoing and unresolved. These and future claims could result in increased costs of doing business through legal expenses, adverse judgment or settlement or require us to change our business practices in expensive ways. In addition, litigation could result in interpretations of the law that require us to change our business practices or otherwise increase our costs., 259100=Comparison of Years Ended December 31, 2000 and 2001, 773218=        In September 2001, the Company entered into a separate $7,000 credit agreement with a related party (Note 19) for the purposes of acquiring inventory. As of December 31, 2001, the Company had no borrowings outstanding under the agreement. The agreement matured in June 2002 and was not renewed by the Company., 681872=        Goodwill represents the excess of the purchase price paid over the fair value of the tangible net assets acquired for the purchase of Gear.com (see Note 4). From November 28, 2000, the date of the Gear.com acquisition, through December 2001, the Company amortized its goodwill on a straight-line basis using a 2 year estimated life., 784063=        Rental expense for operating leases totaled $694, $1,180 and $1,639 for the years ended December 31, 2000, 2001 and 2002, respectively., 262341=        General and administrative.    General and administrative expenses increased from $7.6 million in 2000, to $9.4 million in 2001 representing 30% and 24% of total revenue, respectively. The increase in absolute dollars was due primarily to new business development and the staffing necessary to manage and support our growth. General and administrative personnel increased from 46 employees at the end of 2000, to 65 employees at the end of 2001. The decrease in general and administrative expense as a percentage of total revenue was a result of economies of scale achieved through increased sales volume and the allocation of general and administrative expenses over a substantially larger revenue base., 820774=        The weighted-average grant-date fair value of options granted during 2000, 2001 and 2002 was $4.01, $5.97 and $8.21 per share, respectively (see Note 2). The fair value for these options was estimated at the date of grant using a Black-Scholes option pricing model with the following weighted-average assumptions:, 794625=        The Company has reserved sufficient shares of common stock to meet its stock option and warrant obligations. As stated in Note 14, 185 of these warrants are subject to rescission. At December 31, 2001 and 2002, related parties held 850 of the total warrants outstanding., 69480=        In addition, in January 2003 we received a letter from NCR Corporation claiming that certain of our business practices and information technology systems infringe patents owned by NCR. The letter further stated that NCR would vigorously protect its intellectual property rights if we did not agree to enter into licensing arrangements with respect to the asserted patents. On January 31, 2003, we filed a complaint in the United States District Court of Utah, Central Division, seeking declaratory judgment that we do not infringe any valid claim of the patents asserted by NCR., 469761=        Pursuant to the requirements of Section 13 or 15(d) of the Securities Act of 1934, the registrant has duly caused this report to be signed on its behalf by the undersigned, thereunto duly authorized, on February 21, 2003., 228741=        Valuation of long-lived and intangible assets and goodwill.    Effective January 1, 2002, we have adopted SFAS No. 142 Goodwill and Other Intangible Assets. Under this standard, goodwill is no longer amortized, but must be tested for impairment at least annually. Other long-lived assets must also be evaluated for impairment when management believes that an asset has experienced a decline in value that is other than temporary. Future adverse changes in market conditions or poor operating results of underlying investments could result in losses or an inability to recover the carrying value of the asset that may not be reflected in an asset's current carrying value, thereby possibly requiring an impairment charge in the future. There were no impairments of goodwill or long-lived assets during 2000, 2001, or 2002. Net intangible assets, long-lived assets and goodwill amounted to $3.1 million as of December 31, 2002., 55105=        The number of total products we offer has grown from less than 100 in 1999, to more than 5,000 non-media products and over 100,000 media products (books, CDs, DVDs, video cassettes and video games) as of December 31, 2002. As the number of products and product categories change throughout the year, we periodically reorganize our departments and/or categories to better reflect our current product availability., 227120=        Overstock writes down its inventory for estimated obsolescence or damage equal to the difference between the cost of inventory and the estimated market value based upon assumptions about future demand and market conditions. If actual market conditions are less favorable than those projected by management, additional inventory write-downs may be required. Our inventory balance was $14.0 million, net of allowance for obsolescence or damaged inventory of $1.0 million as of December 31, 2002., 255019=        Sales and marketing.    Sales and marketing expenses increased on an absolute dollar basis from $5.8 million in 2001, to $8.7 million in 2002 primarily as a result of our increased online marketing expenditures, including fixed payment arrangements in connection with online marketing relationships. However, this represents a decrease as a percent of total revenue from 15% to 9%. The decrease in marketing costs as a percentage of total revenue as compared to 2001 reflects an effort by our management to focus advertising expenditures on campaigns that it believes are the most cost-effective to increase net sales, such as targeted online advertising, as well as negotiating reduced rates charged to us for online marketing., 126336=        In January 2003, we received a letter from NCR Corporation claiming that certain of our business practices and information technology systems infringe patents owned by NCR. The letter further stated that NCR would vigorously protect its intellectual property rights if we did not agree to enter into licensing arrangements with respect to the asserted patents. On January 31, 2003, we filed a complaint in the United States District Court of Utah, Central Division, seeking declaratory judgment that we do not infringe any valid claim of the patents asserted by NCR. Resolving this and any other litigation or claims regarding patents or other intellectual property, whether meritorious or not, could be costly, time-consuming, cause service delays, divert our management and key personnel from our business operations, require expensive or unwanted changes in our methods of doing business or require us to enter into costly royalty or licensing agreements, if available. As a result, these claims could harm our business., 419413=        Our investing activities resulted in net cash inflows of $236,000 for the year ended December 31, 2000, that resulted from $3.5 million received in the Gear.com acquisition, offset by $3.3 million in capital asset expenditures. Investing activities for the year ended December 31, 2001 resulted in net cash outflows of $1.7 million for capital and long-term asset expenditures. Investing activities for the year ended December 31, 2002 resulted in net cash outflows of $23.3 million, which was largely used to acquire marketable securities and property and equipment., 468952=        During the last quarter of 2002, we filed a Report on Form 8-K on October 25, 2002 (Items 5 and 9), announcing changes to our Board composition., 68383=        From time to time, we may be subject to legal proceedings and claims in the ordinary course of our business, including claims of alleged infringement of the trademarks and other intellectual property rights of third parties by our company. For example, in February 2002, Microsoft Corporation filed a complaint against us in the United States District Court for the Northern District of California alleging that we have distributed counterfeit and otherwise unauthorized Microsoft software in violation of federal copyright and trademark law and related state laws. The complaint seeks damages in an unspecified amount and injunctive relief. Although we believe we have defenses to the allegations and intend to pursue them vigorously, we do not have sufficient information to assess the validity of the claims or the amount of potential damages. This litigation matter is ongoing and unresolved and could result in settlement arrangements or an unfavorable outcome, including potential statutory damages., 147743=        No matters were submitted to a vote of security holders during the fourth quarter of 2002., 219302=        Amortization of goodwill during 2000 and 2001 resulted from the acquisition of Gear.com, Inc. in November 2000. We acquired Gear.com, an online sporting goods company that was based in Seattle, Washington in November 2000 for 2.1 million shares of our common stock, options to purchase 181,000 shares of our common stock and the assumption of $3.4 million in liabilities. The acquisition of Gear.com was accounted for using the purchase method of accounting, for which we recorded goodwill of approximately $6.2 million. The assets we acquired included cash, inventory, prepaid expenses and property and equipment of $3.5 million, $3.6 million, $495,000 and $787,000, respectively. Following the acquisition date, we directed the traffic from the Gear.com Website to the sporting goods section of the Overstock.com Website, the warehouse operations of Gear.com were closed and the inventory was moved to our warehouse facility in Salt Lake City, Utah. Subsequent to the acquisition date, the operations of Gear.com ceased, and Gear.com was dissolved. In June 2001, the Financial Accounting Standards Board (FASB) issued SFAS No. 142, Goodwill and Other Intangible Assets. SFAS No. 142 addresses the initial recognition and measurement of intangible assets acquired in a business combination and the accounting for goodwill and other intangible assets subsequent to their acquisition. SFAS No. 142 provides that intangible assets with finite useful lives be amortized and that goodwill and intangible assets with indefinite lives will not be amortized, but will rather be tested at least annually for impairment. We adopted SFAS No. 142 for the fiscal year beginning January 1, 2002. Under this pronouncement, the remaining goodwill is not amortized, but is evaluated at least annually for impairment., 724977=        On November 28, 2000, the Company completed the acquisition of Gear.com, Inc. (the \"Gear Acquisition\"), valued at $11,097. The purchase price included the issuance of 2,055 shares of the Company's common stock and 181 options to purchase common stock as well as the assumption of $3,405 in liabilities including $1,300 of acquisition integration costs. The Gear Acquisition was accounted for by the purchase method of accounting. Results of operations of Gear.com have been included in the Company's consolidated financial statements since the date of acquisition., 416229=        The Financial Accounting Standards Board issued SFAS No. 148, \"Accounting for Stock-Based Compensation\u0097Transition and Disclosure, an amendment of FASB Statement No. 123.\" SFAS No. 148 amends SFAS No. 123 to provide alternative methods of transition for an entity that voluntarily changes to the fair value based method of accounting for stock-based employee compensation. SFAS No. 148 also amends the disclosure provisions of SFAS No. 123 to require prominent disclosure about the effects on reported net income of an entity's accounting policy decisions with respect to stock-based employee compensation. We have adopted the disclosure provisions of this statement as of December 31, 2002., 682311=        Effective January 1, 2002, Overstock.com adopted Statement of Financial Accounting Standards No. 142 Goodwill and Other Intangible Assets. SFAS 142 applies to all goodwill and identified intangible assets acquired in a business combination. Under this standard, all goodwill and long-lived intangible assets, including those acquired before initial application of the standard will not be amortized, but will be tested for impairment at least annually. Accordingly, the Company ceased amortization of its goodwill in January 2002. The Company evaluated the $2,784 of unamortized goodwill during 2002, and determined that no impairment charge should be recorded., 435671=        We believe that the cash currently on hand will be sufficient to continue operations through 2003. While we anticipate that, beyond the next twelve months, our cash flows from operations will be sufficient to fund our operational requirements, we may require additional financing. However, there can be no assurance that if additional financing is necessary it will be available, or, if available, that such financing can be obtained on satisfactory terms. However, failure to generate sufficient revenues or raise additional capital could have a material adverse effect on our ability to continue as a going concern and to achieve our intended business objectives., 256744=        Amortization of goodwill.    Effective January 2002, we adopted SFAS No. 142, which requires that goodwill no longer be amortized. Hence, we did not record any goodwill amortization during fiscal year 2002. During 2001, $3.1 million was recorded as amortization of goodwill for the fiscal year ended December 31, 2001. Goodwill resulted from the acquisition of Gear.com in November 2000., 73576=        As of December 31, 2002, we had 194 full-time employees, including 49 in customer service, 34 in order fulfillment, 13 in information technology and Web store production, 9 in sales and marketing, 42 in merchandising, 10 in finance, 18 in B2B sales, 6 in business development and 13 in our executive and administrative department. We have never had a work stoppage, and none of our employees are represented by a labor union. We consider our employee relationships to be positive., 424382=        On February 18, 2003, we closed a follow-on public offering pursuant to which we sold approximately 1.5 million shares of our common stock at a price of $15.00 per share. The offering resulted in proceeds to us of approximately $20.9 million in cash, net of $1.7 million of issuance costs. As part of the offering, we granted the underwriter the right to purchase up to 225,000 additional shares within thirty days after the offering to cover over-allotments. On February 18, 2003, the underwriter purchased the 225,000 additional shares for approximately $3.2 million., 677350=        Accounts receivable consist of amounts due from customers and from credit cards billed but not yet received at period end. The Company recorded an allowance for doubtful accounts of $0 and $70 at December 31, 2001 and 2002, respectively., 722541=        The Financial Accounting Standards Board issued SFAS No. 148, Accounting for Stock-Based Compensation\u0097Transition and Disclosure, an amendment of FASB Statement No. 123. SFAS No. 148 amends SFAS No. 123 to provide alternative methods of transition for an entity that voluntarily changes to the fair value based method of accounting for stock-based employee compensation, SFAS No. 148 also amends the disclosure provisions of SFAS No. 123 to require prominent disclosure about the effects on reported net income of an entity's accounting policy decisions with respect to stock-based employee compensation. The Company has adopted the disclosure provisions of this statement as of December 31, 2002., 138336=        Our common stock has been publicly traded only since May 30, 2002. The market price of our common stock has been subject to significant fluctuations since the date of our initial public offering. These fluctuations could continue. It is possible that in some future periods our results of operations may be below the expectations of public market analysts and investors. If this occurs, our stock price may decline. Among the factors that could affect our stock price are as follows:, 788625=        On March 4, 2002, the Company's Board of Directors approved a proposal to amend the Company's certificate of incorporation to effect a reverse stock split. On April 15, 2002, the Company's Board of Directors approved a 1-for-28.34 reverse split. The authorized common shares have decreased from 450,000 to 100,000, effective May 20, 2002. All share amounts and per share data reflected in these consolidated financial statements are shown after giving retroactive effect to the 1-for-28.34 reverse stock split., 153404=        On May 29, 2002, a Registration Statement on Form S-1 (Commission File No. 333-83728) relating to our initial public offering was declared effective by the SEC. The net proceeds to us from the offering were approximately $26.1 million after deducting underwriting discounts and commissions and other expenses related to the offering. During the quarter ended December 31, 2002, we used approximately $20.25 million of such funds for inventory purchases. On February 12, 2003, a Registration Statement on Form S-1 (Commission File No. 333-102763) relating to a follow-on public offering was declared effective by the SEC. The net proceeds to us from the offering were approximately $24.1 million after deducting underwriting discounts and commissions and other expenses related to the offering., 683130=        The following table shows what the Company's net loss and net loss per common share would have been for the years ended December 31, 2000, 2001 and 2002 exclusive of the amortization expense:, 16730=        This Form 10-K contains forward-looking statements within the meaning of Section 27A of the Securities Act of 1933 and Section 21E of the Securities Exchange Act of 1934. These statements are therefore entitled to the protection of the safe harbor provisions of these laws. These forward-looking statements involve risks and uncertainties, and relate to future events or our future financial or operating performance. These statements include, but are not limited to, statements concerning:, 694721=        Revenue from commissions consists of sales of merchandise of third parties on our Website, and is recognized when services have been rendered (generally when verification of the shipment of the product is communicated to the Company from the third party that shipped the product). For commission revenue, the Company recognizes as revenue only the commission portion of the price its customers pay for the purchased products since the Company is acting as an agent in such transactions. Commissions are also reduced by the impact of returns, chargebacks and coupons redeemed by customers and other discounts to obtain such sales. Any portion of the sales of commission-based products that has not yet been remitted to the commission-based third party at period end is recognized as a liability and included in accrued liabilities. The Company sold commission-based products with total gross sales values of $7,627, $25,657 and $65,526 off its websites during 2000, 2001, and 2002, respectively; however, it recognized $867, $3,965 and $12,379 in related commission revenue during 2000, 2001 and 2002, respectively., 826862=        Effective January 24, 2001, the Company adopted an Employee Stock Purchase Plan (the \"ESPP\") to provide certain employees, directors and consultants an opportunity to purchase shares of its common stock annually, up to 5% of eligible compensation. During a specified open period as determined the Board of Directors, participants can purchase shares of stock at a value determined by the Company's board of directors which approximates the deemed fair market value of the stock. The ESPP expires in May 2011. A total of 353 shares were available for purchase under the ESPP. There were 14 and 6 shares issued under the ESPP during 2001 and 2002, respectively. The Company recognized approximately $63 and $51 of stock-based compensation for the excess of the fair value of the shares of common stock over the purchase price during 2001 and 2002, respectively., 882563=        The following tables set forth our unaudited quarterly results of operations data for the eight most recent quarters for the period ended December 31, 2002. We have prepared this information on the same basis as the Consolidated Statements of Operations and the information includes all adjustments, consisting only of normal recurring adjustments, that we consider necessary for a fair statement of our financial position and operating results for the quarters presented., 837907=        At December 31, 2002, the Company had net operating loss carryforwards of approximately $36,869 which may be used to offset future taxable income. An additional $14,386 of net operating losses are limited under Section 382 to $799 a year. These carryforwards begin to expire in 2019., 4584=        Indicate by check mark whether the registrant (1) has filed all reports required to be filed by Section 13 or 15(d) of the Securities Exchange Act of 1934 during the preceding 12 months (or for such shorter period that the registrant was required to file such reports), and (2) has been subject to such filing requirements for the past 90 days. Yes ý    No o, 253869=        Cost of goods sold increased in absolute dollars from $34.6 million to $73.4 million in 2002. This represents a decrease, as a percent of total revenue, from 87% in 2001 to 80% in 2002. The decrease in cost of goods sold as a percentage of total revenue in 2002 compared to 2001 was primarily a result of economies of scale achieved through an increased number of sales transactions and efficiencies in operations. These efficiencies include, but are not limited to, efficiencies in the actual costs paid to suppliers for goods, freight and handling costs, the costs of customer service and returns. The decrease is also attributable to an increase in commission revenue as a percentage of total revenue (from 10% in 2001 to 13% in 2002), as commission revenue has higher gross margins than direct revenue. Cost of goods sold also includes $78,000 and $373,000 of stock-based compensation for the years ended December 31, 2001 and 2002, respectively., 737781=        The Company's marketable securities consist of funds deposited into a capital management account managed by a financial institution. The financial institution has invested these funds in municipal, government, and corporate bonds at December 31, 2002, as follows:, 227715=        Accounting for income taxes.    Significant management judgment is required in determining our provision for income taxes, our deferred tax assets and liabilities and any valuation allowance recorded against our net deferred tax assets. As of December 31, 2002, we have recorded a full valuation allowance of $21.6 million against our net deferred tax asset balance due to uncertainties related to our deferred tax assets as a result of our history of operating losses. The valuation allowance is based on our estimates of taxable income by jurisdiction in which we operate and the period over which our deferred tax assets will be recoverable. In the event that actual results differ from these estimates or we adjust these estimates in future periods, we may need to change the valuation allowance, which could materially impact our financial position and results of operations., 410138=        Our direct revenue and commission revenue have increased in every quarter on a year-over-year basis. The general increase in total revenue is due to the expansion of our customer base as we attracted more visitors to our Websites, as well as repeat purchases from these customers. We have experienced significant seasonality in our business, reflecting a combination of seasonal fluctuations in Internet usage and traditional retail seasonality patterns. Internet usage and the rate of Internet growth may be expected to decline during the summer. Further, sales in the traditional retail industry are significantly higher in the fourth calendar quarter of each year than in the preceding three quarters. Commission revenue increased during the past several quarters due to the implementation and expansion of our commission program. We initiated a warehouse sale in the first quarter of 2002 to liquidate the remaining inventory from the Gear.com acquisition. Current warehouse revenue is received from sales in our warehouse store., 828733=        The components of the Company's deferred tax assets and liabilities as of December 31, 2001 and 2002 are as follows:, 675625=        Cash equivalents include short-term, highly liquid instruments with original maturities of 90 days or less. At December 31, 2001 and 2002, the Company's cash and cash equivalents were held by two banks. The Company does not believe that, as a result of this concentration, it is subject to any unusual financial risk beyond the normal risk associated with commercial banking relationships. The Company's financial instruments, including cash, cash equivalents, accounts receivable, and accounts payable are carried at cost, which approximates their fair value because of the short-term maturity of these instruments., 850555=        In February 2002, the Company relocated its corporate headquarters. At the time the Company relocated, it had 23 months remaining under the facilities lease for the former headquarters location. In March 2002, the Company settled its remaining obligation under the lease by paying the former landlord $340 and relinquishing the right to sublease the facilities. The settlement payment is recorded in the statement of operations for the year ended December 31, 2002 under general and administrative expenses., 257762=        Interest income, interest expense and other income (expense).    Interest income was $461,000 in 2001 compared to $403,000 in 2002. Interest expense decreased from $729,000 in 2001 to $465,000 in 2002, primarily as a result of the reduction in notes payable. Other income (expense) changed from income of $29,000 in 2001 to expense of $444,000 primarily because the company paid $439,000 of selling costs on behalf of the selling shareholder as part of the initial public offering., 75243=        We were originally organized in May 1997 and began posting a list of our merchandise on our Website in August 1998. In March 1999, we launched the first version of our Website through which customers could purchase products. Our limited operating history makes it difficult to evaluate our business and future operating results., 438508=        At December 31, 2002, we had $11.1 million in cash and cash equivalents and $21.6 million in marketable securities. A hypothetical 10% increase or decrease in interest rates would not have a material impact on our earnings or loss, or the fair market value or cash flows of these instruments., 418412=        Our operating activities resulted in net cash outflows of $22.4 million and $10.5 million for the years ended December 31, 2000 and 2001, respectively, and net cash inflows of $2.5 million for the year ended December 31, 2002. Uses of cash during the year ended December 31, 2000 were principally for net losses, as well as changes in accounts receivable, inventory and accounts payable. Uses of cash for the year ended December 31, 2001 were principally for net losses, offset by depreciation and amortization, and changes in inventory, prepaid expenses, accounts payable and accrued liabilities. Net cash inflows from our operating activities in 2002 resulted from increases in our accounts payables and our accrued liabilities which were offset by the funding of our normal operations, including net losses, changes in accounts receivable, inventories and prepaid assets., 116496=        Issuances of securities are subject to federal and state securities laws. From November 1999 through September 2000, we offered and sold common stock to investors in various states. Certain of those offerings may not have complied with various requirements of applicable state securities laws. In such situations a number of remedies may be available to regulatory authorities and the investors who purchased common stock in those offerings, including, without limitation, a right of rescission, civil penalties, seizure of our assets, a restraining order or injunction, and a court order to pay restitution and costs. As a result, certain investors in our common stock may be entitled to return their shares to Overstock and receive from us the full price they paid, plus interest, which we estimate to be an aggregate amount of approximately $4.4 million at December 31, 2002., 411258=        Cost of goods sold as a percentage of total revenue has generally decreased during the eight quarters ended December 31, 2002, from 89% of total revenue during the first quarter of 2001 to 78% of total revenue during the fourth quarter of 2002. Additionally, cost of goods sold as a percentage of total revenue for each quarter during 2002 was less than each corresponding period in the prior year. This improvement is a result of efficiencies in the cost paid to suppliers for products and the economies of scale resulting from the increased number of sales transactions as well as efficiencies in operations., 435169=        In July 2001, Patrick M. Byrne, our President and Chief Executive Officer, who is also a significant beneficial owner of our stock, agreed to personally guarantee our merchant account with a bank. The bank agreed to accept this personal guarantee in lieu of a demand deposit of $1,000,000 with the bank. If Dr. Byrne were to revoke his guarantee, we may be required to post a demand deposit with the bank., 847167=        In September 2001, the Company entered into a credit agreement with another related party, Norwich Associates L.C. Under the terms of the agreement, Norwich Associates L.C. was given 11 shares of common stock. The fair value of the common stock issued in conjunction with this agreement was deemed to be $108 and was recorded as a debt discount, and was amortized over the term of the agreement. The Company recorded interest expense of $36 and $72 in 2001 and 2002, respectively, related to the debt discount., 218148=        Sales and marketing expenses consist primarily of advertising, public relations and promotional expenditures, as well as payroll and related expenses for personnel engaged in marketing and selling activities. Advertising expense is the largest component of our sales and marketing expenses and is primarily attributable to expenditures related to online marketing activities. For example, our advertising expenses totaled approximately $10.8 million, $4.8 million and $7.0 million during the years ended December 31, 2000, 2001 and 2002, respectively. We expect our sales and marketing expenses to increase in future periods on an absolute dollar basis as we expect to continue to increase our online marketing efforts., 415314=        The Financial Accounting Standards Board issued SFAS No. 146, \"Accounting for Costs Associated with Exit or Disposal Activities\". SFAS No. 146 addresses significant issues relating to the recognition, measurement, and reporting of costs associated with exit and disposal activities, including restructuring activities, and nullifies the guidance in Emerging Issues Task Force Issue No. 94-3, \"Liability Recognition for Certain Employee Termination Benefits and Other Costs to Exit an Activity (including Certain Costs Incurred in a Restructuring).\" SFAS No. 146 is effective for exit or disposal activities initiated after December 31, 2002, with earlier application encouraged. We do not expect the adoption of this standard to have a significant impact on our financial statements.}",
    "lastModified": "Fri, 21 Feb 2003 21:41:05 GMT",
    "textBeforeTable": "OVERSTOCK.COM, INC. (Exact name of Registrant as Specified in its Charter) Commission file number 000-49799 FOR THE TRANSITION PERIOD FROM                              TO                              TRANSITION REPORT PURSUANT TO SECTION 13 OR 15(d) OF THE SECURITIES EXCHANGE ACT OF 1934 o OR For the fiscal year ended December 31, 2002 ANNUAL REPORT PURSUANT TO SECTION 13 OR 15(d) OF THE SECURITIES EXCHANGE ACT OF 1934 ý   (MARK ONE) FORM 10-K UNITED STATES SECURITIES AND EXCHANGE COMMISSION Washington, D.C. 20549 Use these links to rapidly review the document INDEX FINANCIAL STATEMENTS FORM 10-K a2104052z10-k.htm 1 10-K",
    "textAfterTable": "    Part IV. Item 15.   Exhibits, Financial Statement Schedules and Reports on Form 8-K Signatures and Certifications Exhibit Index Financial Statements         Overstock.com, Overstockb2b.com and Worldstock.com are trademarks of Overstock.com, Inc. The Overstock.com logo and Worldstock.com logo are also trademarks of Overstock.com, Inc.         Other service marks, trademarks and trade names referred to in this Form 10-K are property of their respective owners. PART I SPECIAL NOTE REGARDING FORWARD-LOOKING STATEMENTS         This Form 10-K contains forward-looking statements within the meaning of Section 27A of the Securities Act of 1933 and Section 21E of the Securities Exchange Act of 1934. These statements are therefore entitled to the protection of the safe harbor provisions of these laws. These forward-looking statements involve risks and uncertainties, and relate to future events or our future financial or operating performance. These statements include, but are not limited to, statements concerning: \u0095 the anticipated benefits",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}