{
    "relation": [
        [
            "Religion",
            "Evangelical Protestant",
            "Catholic",
            "Mainline Protestant",
            "Other",
            "Black Protestant",
            "Orthodox",
            "None"
        ],
        [
            "Adherents",
            "167,945",
            "44,615",
            "33,340",
            "18,928",
            "1,354",
            "120",
            "396,312"
        ],
        [
            "Congregations",
            "321",
            "8",
            "56",
            "42",
            "8",
            "1",
            "-"
        ]
    ],
    "pageTitle": "Trophy Club, Texas (TX 76262) profile: population, maps, real estate, averages, homes, statistics, relocation, travel, jobs, hospitals, schools, crime, moving, houses, news, sex offenders",
    "title": "",
    "url": "http://www.city-data.com/city/Trophy-Club-Texas.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986423.95/warc/CC-MAIN-20150728002306-00113-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 377268775,
    "recordOffset": 377139488,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{8263=According to our research of Texas and other state lists there were 2 registered sex offenders living in Trophy Club, Texas as of July 29, 2015. The ratio of number of residents in Trophy Club to the number of sex offenders is 4,814 to 1. The number of registered sex offenders compared to the number of residents in this city is a lot smaller than the state average., 128636=We are giving away $1200 in prizes - enter simply by sending us your own city pictures!}",
    "TableContextTimeStampAfterTable": "{15846=On 4/25/1990, a category F4 (max. wind speeds 207-260 mph) tornado 33.1 miles away from the Trophy Club town center caused between $500,000 and $5,000,000 in damages., 31040=Carbon Monoxide (CO) [ppm] level in 2012 was 0.260. This is about average. Closest monitor was 16.5 miles away from the city center., 35450=Lead (Pb) [µg/m3] level in 2008 was 0.121. This is significantly worse than average. Closest monitor was 8.7 miles away from the city center., 126017=Recent home sales, price trends, and home value evaluator powered by Onboard Informatics © 2015 Onboard Informatics. Information is deemed reliable but not guaranteed.   City-data.com does not guarantee the accuracy or timeliness of any information on this site.  Use at your own risk. Website © 2015 Advameg, Inc., 41458=School Enrollment by Level of School (%) in 2013, 44800=2004 Presidential Elections Results, 45372=2012 Presidential Elections Results, 41060=Educational Attainment (%) in 2013, 30379=Air Quality Index (AQI) level in 2012 was 124. This is significantly worse than average., 44514=2000 Presidential Elections Results, 32504=Sulfur Dioxide (SO2) [ppb] level in 2012 was 0.290. This is significantly better than average. Closest monitor was 8.7 miles away from the city center., 16096=On 5/4/1960, a category F3 (max. wind speeds 158-206 mph) tornado 12.0 miles away from the town center injured 12 people and caused between $50,000 and $500,000 in damages., 31758=Nitrogen Dioxide (NO2) [ppb] level in 2012 was 9.61. This is significantly worse than average. Closest monitor was 7.5 miles away from the city center., 61976=9.44% of this county's 2010 resident taxpayers moved to other counties in 2011 ($48,544 average adjusted gross income), 45656=Graphs represent county-level data. Detailed 2008 Election Results, 34700=Particulate Matter (PM2.5) [µg/m3] level in 2012 was 10.5. This is about average. Closest monitor was 16.5 miles away from the city center., 45086=2008 Presidential Elections Results, 33950=Particulate Matter (PM10) [µg/m3] level in 2012 was 20.5. This is about average. Closest monitor was 13.8 miles away from the city center., 59773=10.86% of this county's 2011 resident taxpayers lived in other counties in 2010 ($52,907 average adjusted gross income), 33251=Ozone [ppb] level in 2012 was 32.0. This is about average. Closest monitor was 7.5 miles away from the city center., 44228=1996 Presidential Elections Results, 124703=Total of 80 patent applications in 2008-2015.}",
    "textBeforeTable": "Religion statistics for Trophy Club town (based on Denton County data) Graphs represent county-level data. Detailed 2008 Election Results 2012 Presidential Elections Results 2008 Presidential Elections Results 2004 Presidential Elections Results 2000 Presidential Elections Results 1996 Presidential Elections Results 2012 2008 2004 2000 1996 Presidential Elections Results Utility gas (42%) Electricity (58%) Most commonly used house heating fuel:",
    "textAfterTable": "Source: Clifford Grammich, Kirk Hadaway, Richard Houseal, Dale E.Jones, Alexei Krindatch, Richie Stanley and Richard H.Taylor. 2012. 2010 U.S.Religion Census: Religious Congregations & Membership Study. Association of Statisticians of American Religious Bodies. Jones, Dale E., et al. 2002. Congregations and Membership in the United States 2000. Nashville, TN: Glenmary Research Center. Graphs represent county-level data Food Environment Statistics: Number of grocery stores: 52 Denton County: 0.85 / 10,000 pop. Texas: 1.47 / 10,000 pop. Number of supercenters and club stores: 10 This county: 0.16 / 10,000 pop. State: 0.14 / 10,000 pop. Number of convenience stores (no gas): 35 Denton County: 0.57 / 10,000 pop. Texas: 1.11 / 10,000 pop. Number of convenience stores (with gas): 164 Denton County: 2.67 / 10,000 pop. State: 3.95 / 10,000 pop. Number of full-service restaurants: 301 Here: 4.90 / 10,000 pop. State: 6.13 / 10,000 pop. Adult diabetes rate: This county:",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}