{
    "relation": [
        [
            "Semester",
            "Fall 2014",
            "Fall 2015"
        ],
        [
            "Instructor",
            "S. Anderson",
            "S. Anderson"
        ],
        [
            "Time",
            "T/Th 10:10AM-11:40AM",
            "M/W/F 12:00PM-1:00PM"
        ]
    ],
    "pageTitle": "Roanoke College | Campus Directory",
    "title": "",
    "url": "https://directory.roanoke.edu/course/hnrs/all",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989043.35/warc/CC-MAIN-20150728002309-00056-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 872531691,
    "recordOffset": 872515297,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{37438=Develops a sense of historical perspective and the ability to use the methodologies of the humanities or the fine arts by exploring a subject drawn from the period from 1500 to the present. Includes an engagement component that reaches beyond the classroom. Open to Honors students or non-Honors students with a cumulative GPA of at least 3.2. (Credit cannot be received fro both HNRS 271 and INQ 271.) 1 Unit, 35372=Develops a sense of historical perspective and the ability to use the methodologies of the humanities or the fine arts by exploring a subject drawn from the period before 1500. Includes an engagement component that reaches beyond the classroom. Open to Honors students or non-Honors students with a cumulative GPA of at least 3.2. (credit cannot be received for both HNRS 270 and INQ 270.) 1 Unit}",
    "textBeforeTable": "Offerings A year-long series of supplemental acti vities including regular meetings along with lectures, presentations, performanc es, exhibits, community service, discuss ions and written assignments. Satisfies the College requirement for co-curricula r learning. 1/4 Unit HNRS 101 Plenary Enrichment Program } margin-top:0px !important; p{ } color: #1894e5 !important; margin-top: 20px !important; padding-bottom: 0px !important; margin-bottom: 0px !important; h4{ } color: #1894e5 !important; margin-top: 20px !important; padding-bottom: 0px !important; margin-bottom: 0px !important; }h3{ color:#1894e5 !important; padding-bottom: 0px !important; margin-top:0px !important; margin-bottom: 2px !important; h2{",
    "textAfterTable": "Spring 2014 C. Sarisky Spring 2014 N. Wisnefske Spring 2014 M. Heller HNRS 102 Plenary Enrichment Program An annual series of supplemental activi ties, including lectures, presentations, performances, exhibits, community servi ce, discussions and written assignments. Required each term the student studies on campus. (graded; no credit) Offerings Semester Instructor Time Fall 2014 K. Anderson Fall 2014 C. Sarisky Fall 2014 N. Wisnefske Fall 2014 M. Heller Fall 2014 L. Pysh Fall 2014 M. Hakkenberg Spring 2014 M. Hakkenberg Spring 2014 L. Pysh Spring 2014 C. Sarisky Spring 2014 N. Wisnefske Spring 2014 J. Minton Fall 2015 M. Hakkenberg Fall 2015 K. Anderson Fall 2015 C. Sarisky Fall 2015 N. Wisnefske Fall 2015 M. Heller Fall 2015 L. Pysh Spring 2015 M. Hakkenberg Spring 2015 K. Anderson Spring 2015 C. Sarisky Spring 2015 N. Wisnefske Spring 2015 M. Heller Spring 2015 L. Pysh Spring 2016 M. Hakkenberg",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}