{
    "relation": [
        [
            "Categories",
            "Campus Safety",
            "Greek Life",
            "Clubs and Activities",
            "Great for these types of students",
            "Share any unusual traditions or locations on campus",
            "Bang for the buck",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "They are always on top of their game, and is run by an awesome officer liason with the local police force. Get emails/texts/calls from CS with any updates or problems on campus or even nearby campus, in addition to drills for almost any situation. CS cars are always driving routes to ensure that no strange activity is going on, and you can report via text or call 24-7, or by going to a strategically placed emergency booth that can be found intermittently about campus. I have never felt unsafe on campus.",
            "PLU does not have a greek life, but the residence halls serve as small communities that become family.",
            "If there isn't a club with what you want, you can make one! We have everything from a unicycling club to a Minnesota club. Campus abounds with life!",
            "Students who want to be really involved: in classes, in events, in opportunities. There is always the ability to interact with such a diverse set of people, and to really get to know your professors. There's an experience for every interest and PLU excels in satisfying personal growth. It's true- there really is a niche for everyone here.",
            "From skipping stones on Red Square because there is an old bomb shelter underneath to going up to the tower chapel in Eastvold to just sit and admire the beauty of the Rose Window (especially during finals week when everyone is stressed out, it's a great place to decompress).. PLU has a bevy of cultural aspects about it (like our Scandinavian center) as well as just quirky things that make campus so interesting.",
            "Amazing academic setting, tight-knit community of a campus, and plentiful scholarship money that make PLU such a wonderful collegiate experience. Just make sure you stay on top of your scholarships, because every college is expensive.",
            "There's a neat bowling joint down the street, alongside Garfield Commons where there are lots of small, local, family-run food joints (and the delicious Yummers 2 the 3rd Power cupcakes!). Even if you aren't a part of sports, attending games is super fun and there is also an active intramural division for you! The bus is 75 cents if you want to go off campus for a short ride to the wonderful Downtown Tacoma on the waterfront!",
            "Great variety in food with a rotating menu, with a good system so you aren't in line forever. Cafeteria style in the Commons, but also with two coffee shops/delis across campus and a bakery/deli set appropriately on lower campus. Also a great place to get an on-campus job!",
            "Lower campus tends to be the more rowdy crowd, but it's also central to all food locations. Upper campus is the more traditional, historically significant aspect of campus, but they still have a good time. PLU isn't a huge party school, but if you're looking to go out, you can find things to do. Living on campus does require a meal plan, so living off campus is traditionally cheaper.",
            "Like every school, you will have a rigorous schedule if you make it that way. The professors push you to learn more and are always happy to answers questions whether it is via email, phone, or office hours. The passion the professors have makes class interesting and a great experience.",
            "Wait until financial aid comes in to really decide- PLU was cheaper than going to a state school for me, and they give you a lot of scholarships you don't have to apply for! This school is great if you want a close-knit community where you can have best friends, but still be on friendly terms with everyone on campus! Get to know those professors!",
            "A small school that doesn't sacrifice academics because of size, with a united campus that embraces and advocates social justice issues and diversity. Great professors that are happy to sit down and have a coffee with you, or to help you out during office hours. Gives numerous scholarships and grants so that it really isn't much more than-if more at all-than most other state or private schools!"
        ]
    ],
    "pageTitle": "Pacific Lutheran University Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Pacific-Lutheran-University/reviews?_escaped_fragment_=/show/76416",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989790.89/warc/CC-MAIN-20150728002309-00221-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 900360219,
    "recordOffset": 900297744,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{230407=I am an avid surfer when visiting Hawaii and other countries and states. I am also very active in the Crossfit Community and entered the crossfit open in 2013. HIking, biking, and any other physical activity are appealing to me., 92263=I only was given the opportunity to live in the dorms during the January term at PLU but it was probably the best time of my life. For the most part, the dorms are very relaxed and quiet hours are respected. They aren't that new but they are much bigger rooms than other universities I've visited., 206720=PLU is pretty quirky, so I probably won't remember all of the quirks. If you visit, throw a rock across the bricks in Red Square; some sections are hollow underneath, and the rock makes a xylophone sound as it skitters across the square. Also spin the big rusty metal statues! Look for the diorama of the giant slug in Rieke, the science building. If you visit in February, you may be able to attend an annual performance of the Vagina Monologues, and look for a performance any time of the year by one of our excellent a cappella singing groups., 291436=© 2015, Cappex.com, LLC}",
    "textBeforeTable": "08/21/2009 Reviewer is A current student here. 18 out of 18 people found this review useful. 1 of 65 Tiffany from Buckley, WA Check out reviews left by other students or leave your own review. You could win a free scholarship. Pacific Lutheran University Reviews Pacific Lutheran University › Washington › By State › Colleges › } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.create', -->",
    "textAfterTable": "Categories Comments Great for these types of students Natural Sciences Those who want to study abroad (40% of PLU students study abroad, compared to the national average of 3%; PLU was also the first college to ever have students studying abroad on all seven continents simultaneously) Music/Art Tips for prospective students Don't look at the starting price tag for colleges: look at the financial aid you get and *then* compare schools. Also, know what you want from a school. If you want a great economics program or sports team...you might want to look elsewhere. But if you want to actually participate in sports, or lead a student group focused on economics, you might be in the right place. Bang for the buck The financial aid office went out of their way to help me find the money to attend. It was cheaper for me to attend PLU than a state school, and when you factor in the small class sizes, resources for students, and personal attention from professors-PLU is the easy choice. Am enjoying being here My classes are awesome, I love my job (office assistant for the Registrar), and it's super easy to get involved in clubs, sports, and other activities (Biology",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}