{
    "relation": [
        [
            "Categories",
            "Campus Safety",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "It's not in the safest locations and there has been a lot of sexual assault incidents.",
            "They have a lot of clubs and also offer inter mural sports.",
            "They have a small restaurant in the student center that provides a variety of foods, from a soup and sandwich bar to a grill and Asian food.",
            "no dorms.",
            "I recently had a professor that does not give out 4.0's. I found the teachers very helpful though, and they take a lot of time to help their students succeed.",
            "The professors are caring but push you hard. They will help you as much as they can, but don't expect easy A's.",
            "A beautiful campus, and caring teachers. The staff here challenge and push you to succeed. I love it here."
        ]
    ],
    "pageTitle": "Highline College Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Highline-College/reviews?_escaped_fragment_=/show/44753",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986423.95/warc/CC-MAIN-20150728002306-00055-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 898839683,
    "recordOffset": 898789809,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{207896=Campus Safety here is horrible. 1 star. I know they have revamped it recently but the violent crime rates in the parking lots are insane. In Fall of 2013 there were like 30 bi-weekly beatings and robberies with guns in the parking lots of naive students who are big soft targets for cash and computers and iPhones. I was honestly surprised nobody died. I was personally escorting girls in my classes to other classes and their cars at their requests. Armed security would make many feel better. For the rest of you, be your own security (paraphrase of what the president of the school advised us to do) and watch your back. This year there hasn't been hardly as many violent crimes, yet. There are still lots of break ins and car thefts but that isn't so much the fault of the school as it is the non-students who ride the A-line bus from the north to prowl. Just a sad fact of going to school here., 211031=I've gone to Highline on and off since 2009. I've had some really good professors and some not so good. I think Highline is what you make it and a great springboard to transfer to other schools., 225641=© 2015, Cappex.com, LLC}",
    "textBeforeTable": "08/04/2009 Reviewer is A past student here. 2 out of 2 people found this review useful. 1 of 53 Paul from Maple Valley, WA Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 }",
    "textAfterTable": "Categories Comments Great for these types of students ALL Tips for prospective students Ask the people around you for their opinions on teachers. Choosing what teachers you have makes all the difference in your experience in classes. Bang for the buck College is expensive.... but at Highline it is so so worth it. Am enjoying being here The teachers that I have had make the learning enjoyable. I am in the education department and they know that everyone has different ways of learning and adapt to those styles. I could have transferred to Central Washington University and finished my AA but I enjoyed being here and to keep costs down I stayed. There are so many different events on campus that gets everyone involved. Multi cultural, women's studies, MLK, Diversity and a plethora of others Am learning a lot I did running start through my high school and Highline was a great place to go. The administration was very helpful in making sure that I had me classes in order not only for my high school graduation but on track towards getting my AA.",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}