{
    "relation": [
        [
            "Patent application number",
            "20100315804",
            "20110272264"
        ],
        [
            "Description",
            "ELECTRIC POWER TOOLS - An electric power tool can include a switch and a lamp that is another member are incorporated in the housing, and the lamp is coupled to the case of the switch and assembled in the grip part integral with the switch,",
            "GRINDER - In a grinder, a terminal plate is projectingly provided on an upper surface of a controller. A connection portion, which accommodates a female terminal and includes a slit into which the terminal plate enters, is projectingly provided on a lower surface of a main body portion of a switch block. At the time of assembling of the switch block and the controller, the terminal plate that enters into the connection portion from the slit is inserted into and connected to the female terminal. First and second projections that cover a formation surface of the slit in the connection portion when the connection portion is inserted with and connected to the terminal plate are formed on the upper surface of the controller."
        ],
        [
            "Published",
            "12-16-2010",
            "11-10-2011"
        ]
    ],
    "pageTitle": "Muramatsu, JP - Patent applications",
    "title": "",
    "url": "http://www.faqs.org/patents/inventor/muramatsu-jp-5/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986423.95/warc/CC-MAIN-20150728002306-00043-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 445574191,
    "recordOffset": 445536853,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Kazuo Muramatsu, Anjo-Shi JP 06-02-2011 DIFFERENTIALLY CONTROLLABLE TWO-WAY CLUTCH - A differentially controllable two-way clutch including an outer wheel with a cam portion on an inner circumference, an inner wheel arranged apart from the outer wheel and toward an inner diameter of the two-way clutch as well as rotatably and concentrically with respect to the outer wheel, a torque transmission member located between the outer wheel and the inner wheel to transmit torque, a cage configured to hold the torque transmission member and to be slidable in a circumferential direction and which is differentially controlled, and a spring supported by the cage and configured to be capable of biasing the torque transmission member so that the torque transmission member engages with a cam surface. 20110127134 Published Description Patent application number Kazuhiko Muramatsu, Fukuroi-Shi JP 02-05-2009 Mobile radio communication system - A mobile radio communication system estimates the positional relationship between an own moving terminal and another moving terminal around a view obstruction. If the absolute value of the difference between detected reception power levels is lower than a first power threshold value, the own moving terminal determines that the other moving terminal is positioned within the visual range of the own moving terminal, the distance from the own moving terminal to the other moving terminal being shorter than a predetermined distance B 20090033518 Published Description Patent application number",
    "textAfterTable": "Keiichi Muramatsu, Osaka JP Patent application number Description Published 20080208706 Optical disc apparatus - When device information is transmitted from a DVD recorder to a server, the server transmits selectable function information that is selectable in the DVD recorder side to the DVD recorder. If a reproducing function for MP3, for example, is selected from the selectable function information, the DVD recorder transmits information of reproducing function for MP3 to the server. The server transmits amount billed for the reproducing function for MP3 and the like to the DVD recorder. A user makes the DVD recorder transmit a password when the user approves the amount billed. If the server judges that the password is correct, the server transmits a firmware related to the reproducing function for MP3 to the DVD recorder, then the DVD recorder rewrites an existing firmware that is stored in a flash memory to a firmware on which the firmware related to reproducing function for MP3 is added. 08-28-2008 20120307614 OPTICAL DISC APPARATUS - An optical disc apparatus comprising an optical disc drive for recording on and/or playing back an optical disc; a storage part for storing information; and a save control part for accumulating and saving error information in the storage part, the error information including information that indicates specific error contents in a case in which an error has been generated in the optical disc drive. 12-06-2012",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}