{
    "relation": [
        [
            "Age categories",
            "Age 40-49",
            "Age 50-59",
            "Age 60-69",
            "Age 70+",
            "Total"
        ],
        [
            "Less",
            "32.9",
            "34.1",
            "31.1",
            "24.0",
            "30.9"
        ],
        [
            "About the same",
            "21.0",
            "27.9",
            "26.8",
            "27.6",
            "25.8"
        ],
        [
            "More",
            "22.9",
            "20.0",
            "14.1",
            "10.9",
            "17.4"
        ],
        [
            "I don't have credit card debt now and I didn't 3 years ago.",
            "22.1",
            "17.2",
            "25.8",
            "35.8",
            "24.6"
        ],
        [
            "I don't know.",
            "1.1",
            "0.7",
            "2.2",
            "1.7",
            "1.4"
        ],
        [
            "Number of respondents",
            "368",
            "431",
            "331",
            "325",
            "1454"
        ]
    ],
    "pageTitle": "FRB: Insights into the Financial Experiences of Older Adults: A Forum Briefing Paper",
    "title": "",
    "url": "http://www.federalreserve.gov/econresdata/older-adults-survey/July-2013-Appendix-B-Older-Adult-Survey-Data-Tables.htm",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986423.95/warc/CC-MAIN-20150728002306-00087-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 451503591,
    "recordOffset": 451469581,
    "tableOrientation": "HORIZONTAL",
    "lastModified": "Tue, 30 Jul 2013 18:45:59 GMT",
    "textBeforeTable": "Table B.24. Is your total credit card debt today more or less than credit card debt 3 years ago? Percent, except as noted Note: Asked of all respondents who reported using a credit card in the last 3 years. 1,454 Number of respondents 1.4 I don't know. 24.6 I don't have credit card debt now and I didn't 3 years ago. 17.4 More 25.8 About the same 30.9 Less than credit card debt 3 years ago? \" id=\"F3E7A077\" class=\"pubtables\"> Note: Asked of all respondents who reported using a credit card in the last 3 years. Percent, except as noted 1,456 1.5 1.3 9.1 36.4 51.7 Total",
    "textAfterTable": "Note: Asked of all respondents who reported using a credit card in the last 3 years. Table B.25. In the last 3 years have you taken a cash advance on your credit card(s)? Percent, except as noted No 88.7 Yes, 1 time 5.1 Yes, 2 or 3 times 5.0 Yes, 4 or more times 1.1 Number of respondents 1,454 Note: Asked of all respondents who reported using a credit card in the last 3 years. Table B.26. Please select the statement which best describes your situation regarding payday loans and deposit advance products. Percent, except as noted I never considered getting a payday loan or deposit advance product. 87.7 I currently have a payday loan",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}