{
    "relation": [
        [
            "Categories",
            "Great for these types of students",
            "Tips for prospective students",
            "Bang for the buck",
            "Am enjoying being here",
            "Am learning a lot"
        ],
        [
            "Comments",
            "friendly want to have fun school spirited likes to learn",
            "go to class because some professors give you points towards your grade,pays off toards end of semester use all the services on campus because your paying for it. get involved have fun.",
            "everything your paying for your getting your money's worth for it. everything is up to date.",
            "on campus movie theatre-1 dollar movies for students weekly activies for students-there's always something to do Small campus so its eaasy to know every one. very school spirited campus.",
            "mostly small classes AARC(free tutoring service in Library) helps with yuur classes. professor provides one on one experiences for to can grasp the info your learning."
        ]
    ],
    "pageTitle": "Stephen F Austin State University (SFA) Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Stephen-F-Austin-State-University/reviews?_escaped_fragment_=/show/113144",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989043.35/warc/CC-MAIN-20150728002309-00016-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 917702839,
    "recordOffset": 917590338,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{145974=Not too bad. Meal plan is very expensive. (1550 a semester...ridiculous), 16858=If you want a huge school with lots of actions, you may want to look elsewhere. There are certainly parties and plenty of sororities, fraternities, and other organizations, but it's a very quiet, low-key school. I'm not a huge party-animal, and by that I mean for entertainment, I go to Marble Slab and the movies. Occasionally, I DO go to a bar or club or something active. But to be honest, if you're a serious student, you don't need an active party life. While the work load wasn't a killer, I was definitely spending at least half of my free time doing homework, if not more. The good thing about SFA and the small town of Nacogdoches is, if you need a few free hours and then to get back home soon to do school work, you don't have to go far. There are several forms of entertainment on campus. One being the student center, which has a pool table, Starbucks, and lots of eating options. Although most of these close early (with the exception of the pool table lounge), there is still a little store and lots of sitting areas if you need a new place to study and sip on a coke. The best thing to do on campus for fun is the gym. I know, I know, so many of us roll our eyes when we hear this, but you if you don't want to work out, the gym is still a place for you. Have you seen the pool? It's a pretty large space and, get ready for this, has a lazy river. It doesn't look like a hole in the concrete, either. It looks like a lagoon and is purely beautiful at night. Only an hour there and I feel greatly relaxed. If you DO want to work out, the gym is H-U-G-E. Machines, machines, machines, AND they have cable TVs on them, so you can watch and work out. Did I mention the rock climbing wall? As for the dorms, they aren't great, honestly. The most expensive ones, about $4800, have a kitchen, with a microwave and full-sized fridge, private bathroom with two sinks, living room with a couch, and two private bedrooms. They rock. But the cheapest, Hall 14&16, where I'm at, sadly enough, ha ha, is $1400 and I absolutely will be relocating ASAP. Not that I had huge troubles this past semester. The rooms are just big enough for a pack rat like me to live in, but the community bathrooms are only cleaned once a day, and if something happens after they clean in the morning, you have to look at it all day. Yeah, gross. Not to mention the halls look like an asylum, and there's not a pool table or ping pong table like every other dorm has. But there are meetings in the hall designed for study tips and other activities to help benefit you at school. My trips back and forth from buildings isn't bad, either. I can get anywhere in about five to ten minutes, and even if it is hot or cold or miserable, it's a beautiful walk. SFA spends more on landscaping (2 million a year) than any other Texan school. Everywhere you walk, there's flowers and beautiful, full green trees sheltering you and looking out at in the fall at the orange trees covering the huge hills is nothing short of breathtaking. Not to mention, I've no had no one act like they didn't want to help me. I'm the only person in my family to go to a university and I've been really overwhelmed by all that I have to do keep my funds coming in and such, and I've had ask some really basic questions that I should have known before, and no one has ever made me feel unwelcomed or like they didn't want to help. Considering that it's a pretty large student ratio, it's kind of amazing how helpful and patient everyone is., 561985=Stephen F. Austin State University Home of the Lumberjacks, Stephen F. Austin State University prides itself on its unique traditions and quality of education. I have never met someone who has attended SFA or is currently a student there who has not been satisfied with their college experience at SFA. Located in the oldest town in Texas, Nacogdoches, SFA makes you feel right at home in the middle of the Piney Woods. Surrounded by trees and smiling faces, the campus is just the right environment for a blooming college student. With endless amounts of student activities and organization, it is impossible for one not to get involved. From Greek Life to the Multicultural center, there is something for everyone at SFA. From their billboards that read anything from Â?Lumberjacks Make Great Teachers! to Lumberjacks Make Great Geologist!, anyone who lives between Dallas and Houston should know that SFA has a wide variety of majors to choose from and small class sizes to go with them. With one of the most sought after Teaching Programs in Texas, an aspiring teacher like me is guaranteed to get the best education. With an average class size of 27 and a 20:1 student to teacher ratio, Â?At SFA, you have a name; not just a number. Unlike larger state schools such as Texas A&M, the majority of classes at SFA are taught by the professors themselves, 80% of whom hold the highest degree in their field. The Academic Assistance and Resource Center or AARC is a peer-tutoring center set up to help those in higher level courses succeed. Stephen F. Austin's goal for their students is for them to be independent learners and succeed in whatever they choose to do with their life. From their welcoming campus life to their multitude of activities and majors, it is almost impossible to not feel at home., 71824=It's not a bad tuition rate. Sure it's a bit costly, but relatively speaking, for a good university, it's a decent price. The food could be a bit better for the price we pay, but the chocolate chip cookies they concoct make up for it. Plus, they offer a nice share of scholarships. :), 576668=All the dorms are in decent condition. The nicest, and most expensive, dorms for freshmen are in Lumberjack Landing. These are suite style dorms, but you have to apply really early for these because they fill up by December with athletes and honor students getting first choice. If you don't mind community bathrooms, then Hall 16 is great! There are frequent events going on and free food being given out on certain evenings., 606518=© 2015, Cappex.com, LLC}",
    "textBeforeTable": "07/13/2009 Reviewer is A current student here. 61 out of 61 people found this review useful. 1 person found this inaccurate. 1 of 144 Teal from Nacogdoches, TX Check out reviews left by other students or leave your own review. You could win a free scholarship. Stephen F Austin State University Reviews Stephen F Austin State University › Texas › By State › Colleges › } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.create',",
    "textAfterTable": "Login to rate or flag the reviews Andrea from Duncanville, TX 12/19/2009 Reviewer is A past student here. 22 out of 22 people found this review useful. 2 of 144 Categories Comments Great for these types of students Students who want small sized classes in order to have a lower student-to-teacher ratio, teachers who offer office hours where the students are able to go by and ask questions, students who want easy accessible classes, students who want to be able to get involved in multiple activities and organizations, students who want to attend a university but not pay the high prices. Tips for prospective students USE THE AARC! The AARC, in my opinion, is the best thing located on campus! Its free and you have help with classes. Also, go to SI study groups, they help a lot as well! Student Instructor are student who have taken the class and passed with an A. They talk to the professor and give study guides to the student and help you complete them. They answer any question that you might have during",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}