{
    "relation": [
        [
            "Rank",
            "1.",
            "2.",
            "3.",
            "4.",
            "5.",
            "6.",
            "7.",
            "8.",
            "9.",
            "10."
        ],
        [
            "Player",
            "Flash (T) (stats)",
            "Jaedong (Z) (stats)",
            "Bisu (P) (stats)",
            "Effort (Z) (stats)",
            "Stork[gm] (P) (stats)",
            "ZerO (Z) (stats)",
            "Inter.Calm (Z) (stats)",
            "Sea[Shield] (T) (stats)",
            "Fantasy (T) (stats)",
            "Kwanro[saM] (Z) (stats)"
        ],
        [
            "Prev",
            "0",
            "0",
            "+2",
            "+3",
            "-1",
            "-",
            "-4",
            "-",
            "-3",
            "-"
        ],
        [
            "High",
            "1",
            "1",
            "1",
            "1",
            "1",
            "2",
            "2",
            "1",
            "1",
            "7"
        ],
        [
            "Description",
            "Yes, Flash is still here at the top. Despite an embarrassing loss to Best in Proleague, the Little Monster kept batting for KT and stomped his OSL group in style with his now infamous FvZ, which is quickly becoming a matchup in itself. He is 5 - 1 this month, but that record says nothing about his play at the moment. It's simply top notch, and there's not a player in the world who can touch him right now. As the individual leagues warm up and Proleague goes into its second round, you can rest assured that Flash is going to be all up in everyone's grill. Watch out progaming, watch out.",
            "Anything naysayers have to say about Jaedong for the time being can be put to rest. He had a bit of an off month last time, and almost dropped down to three. This month, he sits safe at two not only due to his WCG massacre of Bisu and Stork, but also because Calm's performance dropped significantly, and to be fair, he did beat this month's #3 in a bo3. Complain all you like, but in November Jaedong showed us that he was nowhere near done with progaming and as the individual leagues get going we're sure we're going to see more and more of him. His PL loss to Savior? Well, that just goes to show that he's not up there with Flash at the moment. But then, who is?",
            "Anti-fans are going to rage hard about this entry, but the truth is Bisu is clearly #3 on the scene at the moment. While certainly below Jaedong's standard in most matchups right now, he is still playing great Starcraft. Despite a loss to Luxury early on, Bisu delivered the results needed for SKT T1, and though now out of the OSL, is still by far one of the strongest contenders for a MSL title this season. Simply put, Bisu just didn't play enough this month to justify putting him lower. His games haven't been spectacular, sure, but remember, that's all relative. This guy is still one of progaming's most consistent performers, and it shows.",
            "CJ fans are going to be pleased. Yes, Effort is once again in possession of a decent PR spot, and rightly so. However, though 7 - 2 is a great record to have this month, Darkelf, Frozean, Light, Jangbi and Free are not exactly top calibre caps to have. With a win over Zero and a loss to Shine, he's shown us that he's about fifty-fifty with players at his skill level this month. Though that's good enough for #4 in November, in a month with more games he'd have found it harder to get this high up. Of course, he definitely has the potential to step up his game, and as the leagues progress we'll get to see if he manages to or not.",
            "Stork performed well at WCG. He played a fantastic series against Jaedong and took a win on Colosseum 2 in what can only be described as a game worth telling your grandkids about. Then, he dropped his MSL group and that sucked. Despite all that, he was destined for a higher rank than this, and then, as I penned these words, he crashed and burned in Proleague. Sea, fine, it's Sea, and to be fair he has been playing well. Then, Hyun? Sorry Dinotoss, but, no way. No way.",
            "I can feel the hype bubbling as I write this. ZERO! Indeed sports fans, indeed, this Woongjin Zerg has had a fantastic month. Currently leading the PL individual rankings and going a stellar 9 - 1 in November, Zero moves quickly from CBNC to #6 this month. In fact, if his win list included a few bigger names he'd have most certainly broken into the top four. As it stands though his biggest caps are Pure, Hwasin and Savior, and that, coupled with his loss to EffOrt makes him stop short here. Can Zero go higher in December? Well, we'll have to wait and see, won't we?",
            "Let's face it, Calm has had an awful couple of days. Losing to Best, Light, Fantasy and Justin, his 2 - 6 record this month wouldn't even qualify him for CBNC. His loss to Justin in particular was shocking, but to be fair, the Hite Terran did play spectacular Starcraft that day. Thankfully, the PR has never been only about results. Calm is a great player. As I've mentioned time and time again, it is his versatility that makes him stand out - from 2 hatch lurker to 5 hatch hydra, he can play the gamut of Zerg builds and do so in style. While a bad record this month does make him drop towards the bottom of the rank, it's difficult to think of many players who can beat him in a bo5 at the moment. Calm had a terrible month, but a terrible month alone is not going to push a former #3 completely off the chart.",
            "Hello Sea! Good to have you back. Truth be told, I really wanted to put you higher than this. However, despite your fantastic Proleague run, I just couldn't justify a top position because nearly all your games have been TvT. Don't get me wrong, going 7 - 1 and destroying half the Terran population of Proleague is fantastic, and you are anything but a one matchup wonder. Also, your TvT style dismantlement of Stork was a treat to say the least. However, what's really messing with your rank here is the fact that you're out of both individual leagues. Having said that, I'm certain that you're going to go into PL R2 swinging, and if you do, and in doing so dispatch some big Z/P names, I will very gladly push you up further when I put the rank together next time. Do it, Sea. Do it.",
            "Fantasy hasn't had a great month. Of course, he hasn't had a terrible month either. From nuking Hoejja into submission in what can only be described as an crazy game in Proleague, he went on to lose to Flash's TvT, which to be fair is Flash's TvT, and some might say there's no shame in that. He returned of course to dispatch Calm on two separate occasions. In fact, the only reason he's here below Calm is that his play has been dropping the last few months and continued to dip slightly in November. Don't get me wrong, Fantasy is a great player. If he wants to stay on the PR though he's going to have to put up results, but more importantly, show in his games that he is truly playing at the level we expect our power rankers to play at. At the moment, he's nearing the bottom of the barrel and we all know that he's capable of much more than that.",
            "Our darkhorse MSL finalist, Kwanro is a curious character. Despite a lacklustre Proleague run after his move to Woongjin, the former CJ Zerg is in the Ro16 of both individual leagues and this month dispatched Shine, Movie and Hwasin in style. While his play is nothing close to stellar at the moment, I'm going to be watching his OSL/MSL bid closely and have to say that there is a good chance that he'll move up the PR next month, especially if he continues to be more consistent in PL."
        ]
    ],
    "pageTitle": "Power Rank",
    "title": "",
    "url": "http://www.teamliquid.net/powerrank/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986423.95/warc/CC-MAIN-20150728002306-00227-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 747803247,
    "recordOffset": 747583421,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Power Rank as of 04/14/2012 } .pr_rankheadtd,.pr_ranktd{ } border:1px solid #000000; .pr_img{ } border-right:none; .pr_rankheadtd,.pr_playerheadtd,.pr_prevheadtd,.pr_highheadtd,.pr_ranktd,.pr_prevtd,.pr_hightd{ } vertical-align:top; .pr_desctd{ } background-color:#E2E7E9; text-align:left; .pr_desctd{ } text-align:center; border-top:none; border:1px solid #808080; .pr_ranktd,.pr_prevtd,.pr_hightd,.pr_desctd{ } border-right:none; border-top:none; border:1px solid #808080; text-align:center; .pr_nametd{ } font-weight:bold; border:1px solid #808080; .pr_playerheadtd,.pr_rankheadtd,.pr_descheadtd,.pr_prevheadtd,.pr_highheadtd{ } width:748px; .pr_table{",
    "textAfterTable": "Comments (273) Power Rank as of 02/13/2012 Rank Player Prev High Description 1. Flash (T) (stats) 0 1 I'm not going to say Flash looks unbeatable--his game against Stork is evidence that he can be stopped... should an opponent exert an unfathomable amount of effort. 11 matches played, and 11 wins attained in dominating fashion. No discernible weaknesses against any race. Jaedong fell in minutes. EffOrt defended valiantly, but his efforts were not enough to stop the slowly advancing Maginot Line. Dear learned that \"one does not simply 12nexus God.\" And Light's proxy-into-wraith tactics proved fruitless against maphacksstarsense. Clutch play won't save you from Flash. Cheese won't save you from Flash. Impeccable standard play won't save you from Flash. So then, what will? Answer: John Connor Let's play a game. I say Flash won't lose in Proleague till Round 4. What say you? 2. Fantasy (T) (stats) +1 1 As I've always stated, Fantasy is an enigma. Will he go on a ten-game winning streak? Or will he inexplicably lose to B-team rookies? You",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}