{
    "relation": [
        [
            "Categories",
            "Campus Safety",
            "Greek Life",
            "Clubs and Activities",
            "Bang for the buck",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "This campus is very safe because it is located in such a good area - blue ash.",
            "Greek life is awesome while forming bonds of true friendships throughout the whole Greek community.",
            "There are clubs and activities that are available to participate in on the branch campus and also on main campus.",
            "Students get a lot more bang for the buck at this school because it is a branch campus.",
            "There is not much to do for fun simply because it is a branch campus, except for joining in activities on main campus, like joining a frat or sorority.",
            "There is food that is available on campus and off campus.",
            "There isn't really any dorm life at branch campuses.",
            "Academics are still challenging most of the time but it is a little bit easier because getting help from a teacher is a much easier task due to the small class sizes.",
            "Get on top of scholarships and loans in high school because ones school starts money is the last thing in mind between work, studying and different on campus activities.",
            "University of Cincinnati - Raymond Walters College is great for taking harder classes because there are smaller class sizes so it is easier to get any questions answered. Also, there is the option to take 49% of your classes at main campus for the price of being at the branch campus. Students at this college also gets all of the benefits as the students at main campus so joining different clubs or Greek life is still an option."
        ]
    ],
    "pageTitle": "University of Cincinnati-Blue Ash College Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/University-of-Cincinnati-Raymond-Walters-College/reviews?_escaped_fragment_=/show/24276",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989043.35/warc/CC-MAIN-20150728002309-00134-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 908568171,
    "recordOffset": 908539875,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{104013=© 2015, Cappex.com, LLC, 84675=This campus has recently renovated their cafe to a state of the art and aesthetically appealing area. There are quite a few food and drink options; however, prices can be a little expensive and the cafe is only open until 2:30 p.m. Monday through Friday and not open at all on the weekends.}",
    "textBeforeTable": "01/29/2012 Reviewer is A past student here. 1 out of 1 people found this review useful. 1 of 27 Danielle from Mason, OH Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {//",
    "textAfterTable": "Find a new school. All they want is your money and could care less about helping you learn. In three sentences Not so good Login to rate or flag the reviews Anonymous 09/28/2011 Reviewer is A current student here. 0 out of 1 people found this review useful. 2 people found this inaccurate. 3 of 27 Categories Comments Great for these types of students Non-vets Tips for prospective students The school itself is only decent., The cost is outrageous. My biggest issue is, if you are a vet DO NOT GO HERE. The vets registration office is stuck in the 1950's with everything done by hand. As a result they WILL eventually screw up your hard earned benefits for life. Just like they did mine. Go somewhere, anywhere else. Bang for the buck It's way over priced. Unless you got a GI bill or have a mommy and daddy to take",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}