{
    "relation": [
        [
            "Shipping and handling",
            "US $14.99",
            "US $40.00",
            "US $75.00",
            "US $10.00"
        ],
        [
            "Each additional item",
            "US $5.00",
            "US $10.00",
            "US $15.00",
            "US $5.00"
        ],
        [
            "To",
            "United States",
            "United States",
            "United States",
            "United States"
        ],
        [
            "Service",
            "Standard Shipping (UPS Ground)",
            "Expedited Shipping (UPS 2nd Day Air®)",
            "Express Shipping (UPS Next Day Air®)",
            "Expedited Shipping (USPS Priority Mail®)"
        ],
        [
            "Delivery*",
            "Estimated within 4-9 business days",
            "Estimated within 5-6 business days",
            "Estimated within 4 business days",
            "Estimated within 4-7 business days"
        ]
    ],
    "pageTitle": "Ducati 1098 Fender Eliminator KIT | eBay",
    "title": "",
    "url": "http://www.ebay.ca/itm/Ducati-1098-Fender-Eliminator-Kit-/251356181545?pt=Motorcycles_Parts_Accessories&hash=item3a85fef429",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989043.35/warc/CC-MAIN-20150728002309-00173-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 425570271,
    "recordOffset": 425524883,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Please enter 6 digits for the Postal Code. Please enter a valid Postal Code. Postal Code: Select a valid country. There are 3 items available. Please enter a number less than or equal to 3. -Select- Afghanistan Albania Algeria American Samoa Andorra Angola Anguilla Antigua and Barbuda Argentina Armenia Aruba Australia Austria Azerbaijan Republic Bahamas Bahrain Bangladesh Barbados Belarus Belgium Belize Benin Bermuda Bhutan Bolivia Bosnia and Herzegovina Botswana Brazil British Virgin Islands Brunei Darussalam Bulgaria Burkina Faso Burundi Cambodia Cameroon Canada Cape Verde Islands Cayman Islands Central African Republic Chad Chile China Colombia Comoros Congo, Democratic Republic of the Congo, Republic of the Cook Islands Costa Rica",
    "textAfterTable": "* Estimated delivery dates- opens in a new window or tab include seller's handling time, origin Postal Code, destination Postal Code and time of acceptance and will depend on shipping service selected and receipt of cleared payment- opens in a new window or tab. Delivery times may vary, especially during peak periods. Domestic handling time Will usually ship within 3 business days of receiving cleared payment - opens in a new window or tab. Return policy Item must be returned within Refund will be given as 14 days after the buyer receives it Money back or replacement (buyer's choice) The buyer is responsible for return shipping costs.",
    "hasKeyColumn": true,
    "keyColumnIndex": 3,
    "headerRowIndex": 0
}