{
    "relation": [
        [
            "Sl. No.",
            "1",
            "2",
            "3",
            "4",
            "5"
        ],
        [
            "Syllabus Reference No.",
            "B.A.,LL.B. 901",
            "B.A.,LL.B. 902",
            "B.A.,LL.B. 903",
            "B.A.,LL.B. 904",
            "B.A.,LL.B. 905"
        ],
        [
            "SUBJECT",
            "Civil Procedure Code and Law of Limitation",
            "Criminal Procedure Code, Law of Juvenile Justice and Probation of Offenders",
            "Law of Banking and Negotiable Instruments",
            "Alternate Dispute Resolution",
            "Professional Ethics and Professional Accounting System"
        ],
        [
            "Scheme of Instruction _________ Periods Per Week",
            "6 Periods",
            "6 Periods",
            "6 Periods",
            "6 Periods Theory + Practicals",
            "6 Periods Theory+ Practicals"
        ],
        [
            "Scheme of Examination Internal Assessment +UniversityExamination = Total marks",
            "20 80 100",
            "20 80 100",
            "20 80 100",
            "50 50 100",
            "50 50 100"
        ]
    ],
    "pageTitle": "UNIVERSITY COLLEGE OF LAW - OSMANIA UNIVERSITY",
    "title": "",
    "url": "http://oulawcollege.goforthelaw.com/index.php/welcome/studentfacilites/28.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989043.35/warc/CC-MAIN-20150728002309-00279-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 186748035,
    "recordOffset": 186660092,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{58780=Prevention and Settlement of Industrial Disputes in India -  The role of State in Industrial Relations – The Industrial Disputes Act 1947 -  Definition of industry - Industrial Dispute – Individual Dispute - workman- Lay off – Retrenchment - Closure -Award - Strike– Lockout, 76523=     5.     B.L. Wadhera: Intellectual Property Law, Universal Publishers, 2nd Ed. 2000., 245414=    7.  R.K.Bangia: Law of Torts, 14th edition, Allahabad Law Agency, Allahabad, 1999., 57817=     2.     Avtar Sing : Company Law, Eastern Book Company, 13th Edn. 2001., 314212=Securities Contracts (Regulation) Act, 1956 – Definition of Securities, 46124=                               1998., 75995=     3.     Dr. G.B. Reddy, Intellectual Property Rights and the Law 5th Ed. 2005 Gogia, 209783=B.A.,LL.B. 1003, 24797=    9.   Vivienne Harpwood: Law of Torts, 1st edition, Cavandish Publishing Ltd. London, 1993., 224311=                 Administration of Justice in the Presidency Towns (1600-1773) and the development of courts and judicial institutions under the East India Company., 228205=             The Government of India Act, 1935 -- the Federal Assembly and the Council of States, its composition, powers and functions — Legislative Assemblies in the Province., 236222=     6.      George Lich Theim: A Short History of Socialism, 1976., 51174=     4.     Mahajan V.D.: Legal Theory and Jurisprudence, Eastern Book Company, Lucknow, 5th Edn. 1977., 338067=                                                                Designs, Kamal Law House, 1999., 75297=     1.     P. Narayanan:  Patent Law, Eastern Law House, 1995., 227263=Unit-IV: The Indian Council Act, 1861 — Central Legislative Council and its    , 69892=            Ed., 2001., 86958=                                 Lucknow, 1997., 288825=Unit-II:    Divorce - Classification of divorce - different modes of Talaq - Legal consequences of divorce - Dissolution of Muslim Marriage Act, 1939 -  Maintenance, Principles of maintenance, Persons entitled to maintenance -  The Muslim Women (Protection of Rights on Divorce) Act, 1986 - Effect of conversion on maintenance and difference between Shia and Sunni Law.         , 37413=    8.   Hidyatullah :Mulla Principles of Mohammadan Law, 19th Edition, 1993,  4th reprint N.M. Tripati Pvt. Ltd., Bombay, 316136=Foreign Exchange Management Act, 1999 – Definitions – Regulation and Management of Foreign Exchange – Authorised Person Contravention – Penalties – Adjudication and Appeal – Directorate of Enforcement – Powers – Functions. , 256877=     1.     T.B. Botomore: Sociology, A Guide to Problems and Literature, London Allen and Unwin 1962., 292293=     10.   Prasad V.: The Indian Succession Act,  1982, Allahabad Law Agency, Allahabad, 17049=    2.   Paras Diwan : Family Law, 1994 Edition, Allahabad Agency, Delhi., 17648=Constitution-Meaning and Significance - Evolution of Modern Constitutions -Classification of Constitutions-Indian Constitution - Historical Perspectives - Government of India Act, 1919 - Government of India Act, 1935 - Drafting of Indian Constitution - Role of Drafting Committee of the Constituent Assembly, 263225=     2.     Economics-An Introductory Analysis (International Students Edition) 1961., 244925=    4.  Achutan Pillai: Law of Tort, VIII edition, Eastern Book Company, Luncknow, 1987., 263790=     6.     Myrdal, Gunnar: The Challenge of World Poverty, 1971. , 317129=3.  Avtar Singh:  Company Law, Eastern Book Company, 12th Edn, 1999., 334270=4.  Michael Parkington:  Insurance Law, 6th edn, 1975, Sweet and Maxwell, London., 272601=                                                                          1977., 229737=      2.    M.Y. Pylee: Constitutional History of India, 1600-1950., 80788=            1973., 290357=Unit-V :   Special Marriage Act, 1954 - Salient features of Indian Divorce Act, 1869 - Domicile - Maintenance to dependents/ Spouses - Intestate succession of Christians under the Indian  Succession  Act, 1925., 369509=Unit-II:    The Arbitration and Conciliation Act, 1996 — Historical Background and Objectives of the Act — Definitions of Arbitration, Arbitrator, Arbitration Agreement -- Appointment of Arbitrator — Termination of Arbitrator -- Proceedings in Arbitral Tribunal -- Termination of Proceedings — Arbitral Award -- Setting aside of Arbitral Award — Finality and Enforcement of Award — Appeals – Enforcement of Foreign Awards. Conciliation – Appointment of Conciliators – Powers and Functions of Conciliator -- Procedure – Settlement of disputes through conciliation., 314701=Securities and Exchange Board of India Act, 1992 - Definitions of Board, Collective Investment Scheme, Fund, Regulations & Securities -- Establishment of Securities and Exchange Board of India - Constitution, Powers and Functions of SEBI – Registration of Stock Brokers – Sub-brokers – Share Transfer Agents etc.- Prohibition of Manipulative and Deceptive Devices, Inside Trading and Substantial Acquisition of Securities or Control – Penalties and Adjudication – Appeals to Securities Appellate Tribunal – High Court and Supreme Court – Capital Markets Regulations., 22892=Unit-V    Consumer Laws: Common Law and the Consumer - Duty to take care and liability for negligence - Product Liability - Consumerism - Consumer Protection Act, 1986 - Salient features of the Act  -  Definition of Consumer - Rights of Consumers - Defects in goods and deficiency in services – Unfair trade practices-  Redressal Machinery under the Consumer Protection Act - Liability of the Service Providers, Manufacturers and Traders under the Act – Remedies., 386028=Cyber Crimes - Meaning of  Cyber Crimes –Different Kinds of Cyber crimes – Cyber crimes under IPC, Cr.P.C and Indian Evidence Law - Cyber crimes under the Information Technology Act,2000 - Cyber crimes under International Law - Hacking Child Pornography, Cyber Stalking, Denial of service Attack, Virus Dissemination, Software Piracy,Internet Relay Chat (IRC) Crime, Credit Card Fraud, Net Extortion, Phishing etc - Cyber Terrorism - Violation of Privacy on Internet - Data Protection and Privacy, 235732=     3.      Nishet R.A.: The Sociological Tradition, 1967., 300626=10. Dr. S.C. Tripathi :  Modern Company Law, Second edition , 2006, 294205=     4.     Kenny's: Outlines of Criminal Law, (1998 Edition)., 224854=                 Regulating Act of 1773 — The Supreme Court at Calcutta, its composition, power and functions and failure of the Court -- Act of 1781 - Supreme Court vis-a-vis Moffussil Courts., 229213=             Provision for enrolment of Advocates, Vakils and Attorneys under the Legal Practitioner's Act, 1853., 71471=Unit-V:     Laws relating to alienation — A.P. Scheduled Areas Land Transfer Regulation 1959 — A.P. Assigned Lands (Prohibition of Transfers) Act, 1977-Resumption of Lands to the Transferor/Government - A.P. Land Grabbing (Prohibition) Act., 42836=     2.     Achutan Pillai: Criminal Law, Butterworth Co., 2000., 80273=     3.     C.K. Takwani: Civil Procedure, 4th Edn. Eastern Book Co., Lucknow, 1974., 248692=Unit- III:     The Consumer Protection Act, 1986 – Aims and Objectives – Salient, 107265=5. S.V.Joga Rao, Computer Contract & IT Laws (in 2 Volumes), 2005 Prolific Law, 108990=Unit-III :  Special provisions relating to women under the Indian Evidence Act, 1872 — Offences against women under Indian Penal Code - outraging the modesty of women -sexual harassment – rape – bigamy - mock and fraudulent marriages – adultery - causing miscarriage - insulting women etc., 233390=     4.      David Green: Contemporary English Grammar, Structure and Composition (Chapters XLI and XLII)., 69264=     2.     Maxwell: Interpretation of Statutes, Butterworths Publications, 1976, 12th, 63227=1. S.N.Misra,  Labour and Industrial Laws, Central law publication-22nd edition. 2006., 61585=Bonus – concept - Right to claim Bonus – Full Bench formula -  Bonus Commission - Payment of Bonus Act 1965 - Application – Computation of gross profit, available, allocable surplus - Eligibility of Bonus - Disqualification of Bonus - set on – set off of allocable surplus- Minimum and Maximum Bonus-Recovery of Bonus., 307292=     2.     M. Munir: Principles and Digest of the Law of Evidence, 10th Edition (in 2 vols),                                             Universal Book Agency, Allahabad, 1994., 84085=     1.     Kelkar R.V.: Criminal Procedure, 3rd Edn. Eastern Book Co., Lucknow, 1993., 227619=                Government of India Act of 1900 — Government of India Act of 1919 —  , 307103=                              1998., 321911=     5.     Dias: Jurisprudence, Aditya Books, 5th Edn. 1985., 36753=    4.   Asaf A.A.Fyzee: Outlines of Mohammadan Law, 4th Edition, 1999, Oxford University Press, Delhi., 24643=    8.  J.N.Pandey: Law of Torts, 1st edition Central Law Publications, Allahabad, 1999., 73566=Unit-III :  Select aspects of the Law of Copyright in India — The Copy Right Act, 1957 -  Historical evolution — Meaning of copyright — Copyright in literary, dramatic and musical works, computer programmes and cinematograph films — Neighbouring rights — Rights of performers and broadcasters, etc. — Ownership and Assignment of copyright — Author's special rights — Notion of infringement — Criteria of infringement — Infringement of copyright in films, literary and dramatic works — Authorities under the Act — Remedies for infringement of copyright., 107919=10. S.V.Joga Rao, Law of Cyber Crimes and Information Technology Law, 2007,, 302616=Unit-V   International Environmental Regime - Transactional Pollution ­- State Liability - Customary International Law - Liability of Multinational Corporations/Companies - Stockholm Declaration on Human Environment, 1972 - The role of UNEP for the protection of environment - Ramsar Convention 1971 – Bonn Convention (Migratory Birds) 1992 -  Nairobi Convention, 1982 (CFCC) - Biodiversity Convention (Earth Summit), 1992 -  Kyoto Protocol 1997, Johannesburg Convention 2002., 11831=WITH EFFECT FROM 2009-2010, 33177=     11.   Chales D.Drale: Law of Partnership 3rd Ed. 1983, Sweet & Maxwell, London., 32651=     8.     A Ramaiah's Saleof Goods Act, 4th Ed. 1998, The Law Book Co., Allahabad., 16395=Unit-V :Succession – Intestate succession – Succession to the property of Hindu Male and Female; Dwelling House – Hindu Succession Act, 1956 as amended by the Hindu Succession (Andhra Pradesh Amendment) Act, 1986 & the Hindu Succession (Amendment) Act, 2005 – Notional Partition – Classes of heirs – Enlargement of limited estate of women into their absolute estate., 103658=Information Technology Act, 2000 - Aims and Objects — Overview of the Act – Jurisdiction -Electronic Governance – Legal Recognition of Electronic Records and Electronic Evidence -Digital Signature Certificates - Securing  Electronic records and secure digital signatures - Duties of Subscribers - Role of Certifying Authorities - Regulators under the Act -The Cyber Regulations Appellate Tribunal - Internet Service Providers and their Liability – Powers of Police under the Act – Impact of the Act on other Laws ., 271029=     1.     N.K.Bose: The Structure of Hindu Society, New Delhi, Orient Longman, 1975., 43344=Unit-I:      The Indian Evidence Act, 1872 — Salient features of the Act – Meaning and kinds of Evidence —Interpretation clause — May Presume, Shall presume and Conclusive proof - Fact, Fact in issue and Relevant facts —Distinction between Relevancy and Admissibility - Doctrine of Res Gestae — Motive, preparation and conduct — Conspiracy —When Facts not otherwise relevant become relevant — Right and custom — Facts showing the state of mind etc., 55950=     3.     De Smith: Judicial Review of Administrative Action, Sweet and Maxwell, 1998., 106982=3.  Chris Reed, Internet Law-Text and Materials, 2nd Edition, 2005, Universal Law, 63009=Child Labour - Rights of child and the Indian Constitution - Salient features of the Child Labour(Prohibition and Regulation) Act 1986., 293807=     1.     Ratan Lal and Dhiraj Lal: Indian Penal Code, Wadhwa & Co., 2000, 36199=     1.   Tahir Mahmood: The Muslim Law of India, 1980, Law Book Company,, 24005=    4.  Achutan Pillai: Law of Tort, VIII edition , Eastern Book Company, Luncknow, 1987., 71115=Unit-IV:   Laws relating to Ceiling on Land Holdings — A.P. Land Reforms (Ceiling on Agricultural Holdings) Act, 1973 — Effect of inclusion in the IX Schedule of the Constitution — Interpretation of Directive Principles of State Policy —  The Urban Land (Ceiling on Holdings) Act, 1976., 214641=     1.      Wren and Martin: English Grammar and Composition, 51013=     3.     Allen : Law in the Making, Universal Publishers 7th Edn. 2001., 14679=    3.  G.C.V. Subba Rao: Law of Contract, S.Gogia & Co., Hyderabad 1995., 32147=     5.     G.C.V. Subba Rao: Law of Contracts, S. Gogia & Co., Hyderabad, 1995., 216283=Unit-IV :  Impact of European Liberal Though on the Indian National Movement and Constitutional development in India up to 1947 — Study of Social Reform Movements in Modern India and its impact on Indian culture., 126368=                 Applicable to the students admitted from the academic year 2009-2010 onwards for B.A., LL.B. 5 Year Integrated Dual Degree Course in the faculty of law., 16177=Unit-IV:Concept of Adoption - Law of Maintenance - Law of Guardianship -  Hindu Adoption and Maintenance Act, 1956 – Hindu Minority and Guardianship Act 1956., 46793=     3.     Vepa P. Saradhi: Law of Evidence 4th Edn. Eastern Book Co., Lucknow, 1989., 46319=     2.     M. Munir: Principles and Digest of the Law of Evidence, 10th Edition (in 2 vols),                                                 Universal Book Agency, Allahabad, 1994., 61966=Employees Security and Welfare aspect - Social Security - Concept and meaning - Social Insurance - Social Assistance Schemes. Social Security Legislations - Law relating to workmen’s compensation - The Workmen’s Compensation Act 1923 – Definitions -Employer’s liability for compensation - Nexus between injury and employment - payment of compensation - penalty for default - Employees State Insurance Act 1948 – Application - Benefits under the Act - Adjudication of disputes and claims – ESI Corporation., 390199=Unit-V :   Relevant provisions relating to women under Maternity Benefit Act, 1961, Factories Act and other Labour & Industrial Laws — Position of Women under International instruments — Salient features of Convention for Elimination of all forms of Discrimination Against Women (CEDAW) — International Covenant on Civil and Political Rights — International Covenant on Social, Cultural and Economic Rights., 263919=     7.     Mahbub Ul Haq: The Poverty: Certain Choices for the Third World, 1976., 257521=                                                                                                                     1970., 115982=     8.   A.P. Protection of Depositors Act, 1999, Asia Law House Publications., 27314=Unit-V    International Environmental Regime - Transactional Pollution ­- State Liability - Customary International Law - Liability of Multinational Corporations/Companies - Stockholm Declaration on Human Environment, 1972 - The role of UNEP for the protection of environment - Ramsar Convention 1971 – Bonn Convention (Migratory Birds) 1992 -  Nairobi Convention, 1982 (CFCC) - Biodiversity Convention (Earth Summit), 1992 -  Kyoto Protocol 1997, Johannesburg Convention 2002., 102628=     6.     V.S. Datey : Law and Practice Central Sales Tax Act, 2003, Taxman, 72035=     2.    P.S. Narayana: Manual of Revenue Laws in A.P., Gogia Law Agency, 6th Ed. 1999, Hyderabad., 208464=B.A.,LL.B. 1001, 63660=6. K.D. Srivastava, Industrial Employment (Standing Orders) Act 1947, 83494=Unit-V:     Probation and Parole: Authority granting Parole — Supervision — Conditional release -- suspension of sentence — Procedure under Probation of Offenders Act, 1958 -- Salient features of the Act.  Juvenile Justice System -- Juvenile Justice (Care and Protection of Children) Act of 2000 -- Procedure under Juvenile Justice…Act — Treatment and Rehabilitation of Juveniles —— Protection of Juvenile Offenders — Legislative and Judicial Role., 62528=Employees Provident Fund and Miscellaneous Provisions Act 1952 – Contributions -Schemes under the Act - Benefits. The Maternity Benefit Act 1961 - Definitions-Application - Benefits. The Payment of Gratuity Act 1972 – Definitions – application - Payment of gratuity - eligibility – forfeiture – Nomination - Controlling authorities., 23530=    1.  Winfield & Jolowicz : Law of Tort, XII edition, Sweet and Maxwell, London , 1984., 109339=Unit-IV:   Socio-Legal position of women and the law — Dowry Prohibition Act, 1961, Medical Termination of Pregnancy Act — Law relating to the Pre Natal Diagnostic Techniques (Regulation and Prevention of Misuse) and Sex selection — Immoral Traffic (Prevention) Act -- Law relating to domestic violence., 67695=Unit-I:      Meaning and Definition of Statutes — Classification of Statues — Meaning and Definition of Interpretation — General Principles of Interpretation — Rules of Construction under the General Clauses Act, 1897., 315331= Depositories Act, 1996 - Definition of Depository Board and Beneficial Owner – Certificate of Commencement of Business – Rights and Obligations of Depositories, Participants, Issuers and Beneficial Owners – Enquiry and Inspection – Penalties – appeals., 376361=Unit-I:      Development of Legal Profession in India —  Advocates Act, 1961 — Right to Practice — a right or privilege? -- Constitutional guarantee under Article 19(1) (g) and its scope — Enrolment and Practice — Regulation governing enrolment and practice — Practice of Law — Solicitors firm — Elements of Advocacy., 24492=    7.  R.K.Bangia: Law of Torts, XIV edition, Allahabad Law Agency, Allahabad, 1999., 25105=          Butterworth, London, 1980., 114293=Unit-IV :  Basic features of the Security and Exchange Board of India Act, 1992 —  Basic features of the Act — Establishment of SEBI --  Functions and Powers of SEBI -- Powers of the Central Government under the Act -- Guidelines for disclosure  --   Investors Protection - SEBI Appellate Tribunal  -- Appeals., 37621=    9.   Tandon M.P.: Muslim Law in India, 10th Edition, 1996, Allahabad Law Agency, Allahabad., 99285=     (5)   Ramachandra Jha: Selected Judgements on Professional Ethics published by Bar Council of India Trust, 2002., 42958=     3.     Gour K.D.: Criminal Law - Cases and Materials, Butterworth Co., 1999., 105500=Cyber Crimes -Meaning of  Cyber Crimes –Different Kinds of Cyber crimes – Cyber crimes under IPC, Cr.P.C and Indian Evidence Law - Cyber crimes under the Information Technology Act,2000 - Cyber crimes under International Law - Hacking Child Pornography, Cyber Stalking, Denial of service Attack, Virus Dissemination, Software Piracy,Internet Relay Chat (IRC) Crime, Credit Card Fraud, Net Extortion, Phishing etc - Cyber Terrorism - Violation of Privacy on Internet - Data Protection and Privacy, 109707=Unit-V :    Relevant provisions relating to women under Maternity Benefit Act, 1961, Factories Act and other Labour & Industrial Laws — Position of Women under International instruments — Salient features of Convention for Elimination of all forms of Discrimination Against Women (CEDAW) — International Covenant on Civil and Political Rights — International Covenant on Social, Cultural and Economic Rights., 317342=                             India Private Limited, 2nd Edition, 1984, New Delhi., 316373= Non –banking finance Companies – Formation and regulation of NBFC’s Consumer Protection Act, 1986 – Salient Features – Definitions of complainant, Consumer, Manufacturer, Consumer Dispute, Service, Good, Unfair Trade Practices,- Liability of Companies to consumers etc. Corporate Governance – International dimensions of Company Law., 336685=Unit-IV:   Intellectual Property in Trademarks and the rationale of their protection - The Trade Marks Act, 1999 — Definition of Trademarks — Distinction between Trademark and Property Mark - Registration — Passing off —Infringement of Trademark — Criteria of Infringement — Remedies. The Designs Act, 2000 — Definition and characteristics of Design — Law in India — Protection and rights of design holders — Copyright in design — Registration — Remedies for infringement., 337222=Unit-V:    Patents — Concept of Patent — Historical overview of the Patents Law in India — Patentable Inventions — Kinds of Patents — Procedure for obtaining patent — The Patents Act, 1970 — Rights and obligations of a patentee — Term of patent protection — Use and exercise of rights — Exclusive Marketing Rights — Right to Secrecy — The notion of ‘abuse’ of patent rights — Infringement of patent rights and remedies available., 273874=     14.   David G.Madelmanm: Society in India, Bombay, Popular Prakasham, 1972., 15052=     5.    Avtar Singh: Law of Contract , Eastern Book Company, Lucknow, 1998., 14566=    2.  Krishnan Nair: Law of Contract , S.Gogia & Co., Hyderabad 1995., 75568=                                                                Designs,Kamal Law House, 1999., 316827=2.  Ramayya: Guide to the Companies Act, (in three volumes), 13th Edn.1995, Wadhwa , 36570=    3.   Prof. G.C.V. Subba Rao: Family Law in India, 6th Edition, 1993, S.Gogia & Company, Hyderabad., 32318=     6.     Krishnan Nair: Law of Contracts, S. Gogia & Co. Hyderabad, 1995., 334030=2.  Ravi Pulirani and Mahesh Pulirani : Manual of Insurance Law, 2001 Ed. Bharat Law House Ltd. New Delhi., 56096=     4.     S.P. Sathe: Administrative Law, Butterworths, 6th Edn. 1998., 228871=            Law practitioners in the Mayor's Courts established under the Charter of 1726., 69114=     1.     Vepa P. Sarathi: Interpretation of Statutes, Eastern Book Co, 4th Edition, 1976., 58071=     4.     Ramaiah: Company Law, Wadhwa & Co. 15th Edn. 2001., 32831=     9.     Benjamin's Saleof Goods, 1st Ed. 1978, Sweet & Maxwell, London., 72377=     4.    G.B. Reddy: Land Laws in A.P.,  Gogia Law Agency, Hyderabad, 1st Edition, 2001., 235350=     1.      Rajani Kothari - Democratic Policy and Social Change in India: Crisis and Opportunities, Allied Publishers, 1976., 81598=Unit-I :     The Code of Criminal Procedure, 1973 : The rationale of Criminal Procedure — The importance of fair trial — Constitutional Perspectives : Articles 14, 20 & 21 — The organization of Police, Prosecutor and Defence Counsel — Pre-trial Process — Arrest — Distinction between “cognizable” and “non-cognizable” offences — Steps to ensure presence of accused at trial  -- Warrant and Summons cases — Arrest with and without Warrant — The absconder status — Rights of arrested persons under Cr.P.C. and Article 22 (2) of the Constitution of India., 129347=4. Age on admission: The maximum age limit for admission into first year B.A., LL.B. Five Year Degree Course in the University College of Law and Post Graduate College of Law, Osmania University, shall be twenty years (twenty two years in case of candidates belonging to SC and ST categories) as on 1st July of the year of admission. For admission into the same course in other colleges affiliated to Osmania University the age limit shall be as prescribed by the Bar Council of India or any other competent authority., 24160=    5.  Durga Das Basu: The Law of Torts ,X edition, Prentice Hall of India, New Delhi, 1998., 354604=Citizenship after the commencement of the Constitution - Constitutional Provisions of Citizenship, Citizenship Act 1955 - Citizenship Rules 1956 - Citizenship under International Law -  Rights and Duties of Citizens and Non-Citizens under the Constitution and other enactments., 263513=     4.     C.T.Kurien: Planning, Poverty and Social Transformation , 1926., 37233=    7.   M.A. Qureshi: Text Book on Muslim Law, 1st Edition, 1997, Central Law Publications, Allahabad., 80039=            (StudentEdition) Edited by P.M. Bakshi, Bombay, 1985., 326006=Standing Orders -    Concept and Nature of Standing Orders – scope and coverage- Certification process – its operation and binding effect – Modification and Temporary application of Model Standing Orders – Interpretation and enforcement of Standing Orders and provisions contained in the Industrial Employment (Standing Orders ) Act 1946., 363731=Unit-V:    Probation and Parole: Authority granting Parole — Supervision — Conditional release -- suspension of sentence — Procedure under Probation of Offenders Act, 1958 -- Salient features of the Act.  Juvenile Justice System -- Juvenile Justice (Care and Protection of Children) Act of 2000 -- Procedure under Juvenile Justice…Act — Treatment and Rehabilitation of Juveniles —— Protection of Juvenile Offenders — Legislative and Judicial Role., 211636=B.A.,LL.B. 1005, 34364=Unit-II:     Divorce - Classification of divorce - different modes of Talaq - Legal consequences of divorce - Dissolution of Muslim Marriage Act, 1939 -  Maintenance, Principles of maintenance, Persons entitled to maintenance -  The Muslim Women (Protection of Rights on Divorce) Act, 1986 - Effect of conversion on maintenance and difference between Shia and Sunni Law.   , 89101=Unit-II:     The Arbitration and Conciliation Act, 1996 — Historical Background and Objectives of the Act — Definitions of Arbitration, Arbitrator, Arbitration Agreement -- Appointment of Arbitrator — Termination of Arbitrator -- Proceedings in Arbitral Tribunal -- Termination of Proceedings — Arbitral Award -- Setting aside of Arbitral Award — Finality and Enforcement of Award — Appeals – Enforcement of Foreign Awards. Conciliation – Appointment of Conciliators – Powers and Functions of Conciliator -- Procedure – Settlement of disputes through conciliation., 33347=     12.   Bowstead On Agency, 15th Ed. 1985, Sweet and Maxwell, London., 224593=                 Warren Hastings’ Plan of 1772 and the Adalat System of Courts; Reforms made under the Plan of 1774 and reorganization in 1780., 79477=Unit-V: Law of Limitation — Concept of Limitation — Object of limitation - General Principles of Limitation — Extension — Condonation of delay — Sufficient Cause — Computation of limitation -- Acknowledgment and Part-payment — Legal Disability — Provisions of the Limitation Act, 1963 (Excluding Schedule), 360983=            1973., 271173=     2.     Andre Beteille: The Backward Classes and the New Social Order, Delhi,                                             Oxford University Press, 1981., 31816=     3.     Cheshire & Fifoot: Law of Contract, Butterworth, London, 1976., 16865=    1.   Paras Diwan : Modern Hindu Law, 13th Edition 2000, Allahabad, 62916=The Factories Act 1948 - Chapters dealing with Health, Safety and Welfare of Labour., 216870=      2.    A.R.Desai: Social Background of Indian Nationalism, 1948., 126079= WITH EFFECT FROM 2009-2010, 210615=B.A.,LL.B. 1004, 226873=                 Legislative authority of the East India Company under the Charter of Queen Elizabeth, 1600 -- Changes under the Regulating Act, 1773 --  Act of 1781 -- Act of 1813 --  Act of 1833 — Establishment of Legislature of an all India character in 1834., 209118=B.A.,LL.B. 1002, 14455=    1. Anson: Law of Contract, Clarendon Press, Oxford, 1998., 230034=      4.    A.B. Keith: A Constitutional History of India, 1600-1935., 225174=                 Judicial measures of Cornwallis 1787, 1790, 1793 - Progress of Adalat System under Sir John Shore., 74732=Unit-V:     Patents — Concept of Patent — Historical overview of the Patents Law in India — Patentable Inventions — Kinds of Patents — Procedure for obtaining patent — The Patents Act, 1970 — Rights and obligations of a patentee — Term of patent protection — Use and exercise of rights — Exclusive Marketing Rights — Right to Secrecy — The notion of ‘abuse’ of patent rights — Infringement of patent rights and remedies available., 43097=     4.     Kenny's: Outlines of Criminal Law, (1998 Edition), 59611=Standing Orders -    Concept and Nature of Standing Orders – scope and coverage- Certification process – its operation and binding effect – Modification and Temporary application of Model Standing Orders – Interpretation and enforcement of Standing Orders and provisions contained in the Industrial Employment ( Standing Orders ) Act 1946., 74183=Unit-IV:   Intellectual Property in Trademarks and the rationale of their protection -  The Trade Marks Act, 1999 — Definition of Trademarks — Distinction between Trademark and Property Mark -  Registration — Passing off —Infringement of Trademark — Criteria of Infringement — Remedies. The Designs Act, 2000 — Definition and characteristics of Design — Law in India — Protection and rights of design holders — Copyright in design — Registration — Remedies for infringement., 76669=     6.     W.R. Cornish: Intellectual Property Law, Universal Publishers, 3rd Ed. 2001., 229537=      1.    Herbet Cowall: The History and Constitution of the Courts and Legislature Authorities in India, 1936., 201924=WITH EFFECT FROM 2009-2010, 72214=     3.    Land Grabbing Laws in A.P., Asia Law House, 3rd Ed. 2001, Hyderabad., 114693=Unit-V:     Non-Banking Financial Institutions - Classification and Law Relating to NFBCs - AP Protection of Depositors Act, 1999., 111100=             1998., 229054=            Organisation of Legal Profession under the Charter of 1874., 56226=     5.     I.P.Massey: Administrative Law, Eastern Book Company, 5th Edn. 2001., 35355=Unit-IV :  Waqf _ Definition - Essentials of Waqf - Kinds of Waqf – Creation of  Waqf -  - Revocation of Waqf - Salient features of the Waqf Act, 1995 – Mutawalli -  Who can be Mutawalli - Powers and duties of Mutawalli - Removal of Mutawalli and Management of Waqf property. Succession - Application of the property of a deceased Muslim - Legal position of heirs as representatives - Administration - Waqf Tribunals and Jurisdiction., 24319=    6.   Ratan Lal & Dhirajlal: The Law of Torts, 22nd edition, Wadhwa & Company Nagpur, 1992., 225407=Unit-II:    Indian High Courts Act, 1861-     Conflicts arising out of the dual judicial system - Tendency for amalgamation of the two systems of Courts - the Indian High Courts Act, 1911 - the Government of India Act, 1915 - High Courts under the Government of India Act, 1935 - High Courts under the Indian Constitution., 57950=     3.     Charlesworth: Company Law, Sweet and Maxwell, 1996., 51364=     5.     Dias : Jurisprudence, Aditya Books, 5th Edn. 1985., 37793=     10.   Prasad V.: The Indian Succession Act, 1982, Allahabad Law Agency, Allahabad, 31460=     1.     Anson's Law of Contract, 25th Ed. 1998, Oxford University Press, London., 271850=                                                                                                   1970., 15904=Unit-III: MatrimonialRemedies under the Hindu Marriage Act, 1955 - Restitution of Conjugal Rights – Nullity of marriage – Judicial separation – Divorce – Maintenance pendente lite – importance of conciliation., 245079=    5.  Durga Das Basu: The Law of Torts, 10th edition, Prentice Hall of India, New Delhi, 1998., 84440=     3.     Padala Rama Reddi: The Code of Criminal Procedure, 1973, Asia Law House,, 35866=Unit-V :    Special Marriage Act, 1954 - Salient features of Indian Divorce Act, 1869 - Domicile - Maintenance to dependents/ Spouses - Intestate succession of Christians under the Indian  Succession  Act, 1925., 263646=     5.     M.Dipton: Why Poor people stay poor Urban Bias in World Development, 1980., 50734=     1.     Salmond: Jurisprudence, Universal Publishers 12th Edn. 1966., 28660=     8.   Paras Diwan : Environmental Law and  Policy in India,1991, 70823=Unit-III:   Laws relating to acquisition of property — Land Acquisition Act of 1894 (Issue of notifications, Award enquiry, Payment of compensation & Reference to civil courts etc.) The Land Acquisition and Requisition Act., 99470=     (6)   Dr. G.B. Reddy: Practical Advocacy of Law, 2nd Ed. 2005. Gogia Law Agency. Hyderabad, 80415=     4.     B.B. Mitra: Limitation Act, 17th Edn. Eastern Law House, Calcutta, 1974,, 333887=1.  K.S.N. Murthy and KVS Sharma:  Modern Law of Insurance in India, 1995, edn. New Tripathi Pvt. Ltd. Bombay., 300514= 9.  Dr. N.V. Paranjape: Company Law 4th edition Central Law Agency, 2007, 36394=    2.   Aquil Ahmed: Text Book of Mohammadan Law, 5th Edition 1992, Central Law Agency, Allahabad., 55805=     2.     H.W.R.Wade: Administrative Law, Oxford Publications, 8th Edn. 2000, London., 31981=     4.     Mulla: The Indian Contract Act, N.M.Tripathi (P) Ltd. Bombay, 1984., 42698=     1.     Ratan Lal and Dhiraj Lal: Indian Penal Code, Wadhwa & Co., 2000., 352611=Unit-V:    Laws relating to alienation — A.P. Scheduled Areas Land Transfer Regulation 1959 — A.P. Assigned Lands (Prohibition of Transfers) Act, 1977-Resumption of Lands to the Transferor/Government - A.P. Land Grabbing (Prohibition) Act., 58468=Trade Unions: History of Trade Union Movement -  The Trade Union Act 1926 – Definitions -  Registration – Rights and Liabilities of Registered Trade Unions – Immunities – Amalgamation and dissolution of Unions – Reorganization of Trade Unions., 66510=     1.     J.G. Starke: Introduction to International Law, Aditya Books, 10th Edition, 1989., 33006=     10.   P.S.Atiyah: Saleof Goods Act, 9th Ed. 1997, Universal Book Traders, Delhi., 315669=Competition Act, 2002 - Applicability of the Act – Definitions – Prohibition of certain agreements – Abuse of dominant position and Regulation of combinations – Competition Commission of India – Establishment – Powers – Functions – Power of Central Government to supersede Commission – Restriction on disclosure of information – Overriding effect of the Act – Penalties – Appeals – Competition Advocacy. , 32485=     7.     Avtar Singh: Law of Contracts, Eastern Book Company, Lucknow, 1998., 235882=     4.      Bierstedt Robert: Power and Progress, 1974 (MC Graw - Hill), 93675=     7.    P.C. Rao : Alternate Dispute Resolution , 2001 Edition, Universal Book Traders,, 95847=Unit-I:      Development of Legal Profession in India — The Advocates Act, 1961 — Right to Practice — a right or privilege? - Constitutional guarantee under Article 19(1) (g) and its scope — Enrolment and Practice — Regulation governing enrolment and practice — Practice of Law — Solicitors firm — Elements of Advocacy., 61124=The Remunerative Aspects – Wages – Concepts of wages - Minimum, Fair, Living Wages - Wage and Industrial Policies - Whitley Commission Recommendations -Provisions of Payment of Wages Act 1936 - Timely payment of wages - Authorised deductions – Claims - Minimum Wages Act 1948 -  Definitions - Types of wages -Minimum rates of wages - Procedure for fixing and revising Minimum Wages – Claims -Remedy., 23689=    2.  Salmond and Heuston : Law of Torts, XX edition, 2nd Indian reprint, Universal Book traders, New Delhi,1994., 113995=Unit-III:   Basic features of the Security Contracts (Regulation) Act, 1956 — Recognition of Stock Exchanges – Regulation of Contracts and option in securities — Listing of securities -- Guidelines for listing of shares / debentures.}",
    "textBeforeTable": "   VII Semester 1. Labour Law-I 2. Public International Law 3. Administrative Law 4. Law of Insurance 5. Intellectual Property Law   VIII Semester 1. Labour Law-II 2. Interpretation of Statutes 3. Private International Law 4. Land Laws 5. Citizenship and Emigration Law   IX Semester   1.  Civil Procedure Code and Law of Limitation 2.  Criminal Procedure Code, Law of Juvenile Justice and Probation of Offenders 3.  Law of Banking and Negotiable Instruments 4.  Alternate Dispute Resolution 5.  Professional Ethics and Professional Accounting System   X Semester    1. Law of Taxation  2. Information Technology Law  3. Optional (The candidate should take any one of the following subjects)   (a) Law Relating to Women   (b) Human Rights Law 4. Drafting, Pleadings and Conveyancing   5. Moot Courts, Observation of Trial, Pre-trial Preparations and Internship       XI. AWARD OF PRIZES, DISTINCTIONS AND MEDALS   In order to be eligible for the award of Distinction, Prizes and Medals based upon merit list of First Class candidates at the University Examination, candidates shall be eligible for such awards only if they pass in all the papers at the end of each semester in the first attempt along with the regular candidates of their batch.  No candidate shall be eligible",
    "textAfterTable": "    B.A., LL.B. (5YDC) II SEMESTER SCHEME OF INSTRUCTION AND SCHEME OF EXAMINATION WITH EFFECT FROM 2009-2010   Sl. No. Syllabus Reference No. SUBJECT Scheme of Instruction _________ Periods Per Week Scheme of Examination   Internal Assessment +UniversityExamination = Total marks 1 B.A.,LL.B. 201 English - II   6 Periods 20         80               100 2 B.A.,LL.B. 202 Political Science - II   6 Periods 20         80               100 3 B.A.,LL.B. 203 Psychology 6 Periods 20         80               100 4      B.A.,LL.B. 204 Law of Torts  ",
    "hasKeyColumn": true,
    "keyColumnIndex": 2,
    "headerRowIndex": 0
}