{
    "relation": [
        [
            "Patent application number",
            "20090166178",
            "20120315698"
        ],
        [
            "Description",
            "METHODS FOR STERILIZING MATERIALS CONTAINING BIOLOGICALLY ACTIVE AGENTS - Provided are methods for sterilizing a material comprising a biologically-active agent comprising irradiating said material with ionizing radiation at a dose of about 5 kGy to about 25 kGy while maintaining said material in an atmosphere comprising at least 95% by volume inert gas and at a temperature of about 4° C. or lower. Also provided are sterilized materials comprising a biologically-active agent, wherein said materials exhibit substantially the same amount of biological activity as a non-sterilized control.",
            "METHODS FOR STERILIZING MATERIALS CONTAINING BIOLOGICALLY ACTIVE AGENTS - Provided are methods for sterilizing a material comprising a biologically-active agent comprising irradiating said material with ionizing radiation at a dose of about 5 kGy to about 25 kGy while maintaining said material in an atmosphere comprising at least 95% by volume inert gas and at a temperature of about 4° C. or lower. Also provided are sterilized materials comprising a biologically-active agent, wherein said materials exhibit substantially the same amount of biological activity as a non-sterilized control."
        ],
        [
            "Published",
            "07-02-2009",
            "12-13-2012"
        ]
    ],
    "pageTitle": "Bodnar, US - Patent applications",
    "title": "",
    "url": "http://www.faqs.org/patents/inventor/bodnar-us-5/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989043.35/warc/CC-MAIN-20150728002309-00333-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 440503937,
    "recordOffset": 440488284,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Stanko Bodnar, Whitehouse Station, NJ US 07-01-2010 PREPARATION OF ENVIRONMENTALLY ACCEPTABLE SCALE INHIBITORS - Alkyl phosphonates prepared from amino acids suitable for use in inhibiting scale. The phosphonates are obtained as reaction mixtures where the level of alkyl phosphonation is deliberately controlled to provide only partial alkyl phosphonation of the amino acid. The resulting alkyl phosphonates exhibit improved environmental properties compared to the fully substituted species, while still exhibiting acceptable efficacy in the control of scale. The compositions possess advantages over existing phosphonates in that they exhibit higher biodegradation by method OECD 306. They also offer lower toxicity to marine life compared to the fully substituted species and are not expected to bioaccumulate. 20100163494 Published Description Patent application number Scot H. Bodnar, Houston, TX US 12-05-2013 EMULSION BREAKERS INCLUDING POLYESTER FUNCTIONALITIES - An emulsion breaker composition, a method of making the emulsion breaker, and method of breaking an emulsion are disclosed. In one method, an emulsion is contacted with an effective amount of an emulsion breaker composition. The emulsion breaker is a linear or branched polymer having at least one branch, wherein each branch has a first polymer block having a backbone including a plurality of ester groups and a second polymer block including an alkoxylate, and wherein at least two of the ester groups are connected by a —CR1R2 group. The emulsion breakers are preferably formed by reacting a polyol with a cyclic ester",
    "textAfterTable": "Steven Bodnar, Austin, TX US Patent application number Description Published 20080228505 Client Deployment Optimization Model - A deployment optimization model that identifiers and categorizes issues (such as key cost and quality drivers) in information handling system deployment and provisioning. The deployment optimization model is used within a deployment and evaluation tool which provides based on this model, a set of processes and tools for evaluating information handling system deployment issues of customers. Based on information derived from the deployment and evaluation tool, it is possible to determine a customer's current cost to deploy information handling systems as well as a future cost if various recommendations are adopted. 09-18-2008 Volodymyr Bodnar, Kent, OH US Patent application number Description Published 20120038841 SOLAR POWERED VARIABLE LIGHT ATTENUATING DEVICES AND ARRANGEMENTS - A solar powered variable light attenuating device includes a liquid crystal cell, a photovoltaic cell in electrical communication with the liquid crystal cell, and a light concentrator having a light absorbing surface and a light emitting surface optically coupled to the photovoltaic cell. At least a portion of light impinging on the light absorbing surface of the light concentrator is concentrated and directed through the light emitting surface to a photon-absorbing portion of the photovoltaic cell to generate a voltage. The generated voltage is used to change the liquid crystal cell from a de-energized state to an energized state in response to",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}