{
    "relation": [
        [
            "Patent application number",
            "20110216260",
            "20110221727",
            "20110242443",
            "20110242468",
            "20120056858",
            "20120249940"
        ],
        [
            "Description",
            "DISPLAY DEVICE - A display device includes a plurality of gate lines arranged substantially parallel to each other in a first direction; a plurality of charge share gate lines arranged substantially parallel to each other in the first direction; a plurality of data lines arranged substantially parallel to each other in a second direction, wherein the second direction is substantially perpendicular to the first direction; and a plurality of pixels arranged in a matrix form in along the first direction and the second direction and each of the plurality of pixels which includes a first switching element and a second switching element, wherein the a first gate line of the plurality of gate lines is electrically connected to the first switching element included in one individual pixel of the plurality of pixels, and the a second gate line of the plurality of gate lines is electrically connected to the second switching element included in the individual pixel of the plurality of pixels.",
            "METHOD OF DRIVING DISPLAY PANEL AND DISPLAY APPARATUS FOR PERFORMING THE SAME - A display panel includes first and second data lines and a first pixel column containing pixels that are alternately connected to the first and second data lines. In a method of driving the display panel, a second data voltage having a first polarity is outputted to the second data line during an N-th horizontal period. A first data voltage having a second polarity phase-inverted with respect to the first polarity and a first compensating voltage having the second polarity are respectively outputted to the first data line during first and second intervals of the N-th horizontal period. The first data voltage having the second polarity is outputted to the first data line during an (N+1)-th horizontal period. The second data voltage having the first polarity and a second compensating voltage having the first polarity are respectively outputted to the second data line during first and second intervals of the (N+1)-th horizontal period.",
            "PIXEL ELECTRODE PANEL, A LIQUID CRYSTAL DISPLAY PANEL ASSEMBLY AND METHODS FOR MANUFACTURING THE SAME - A liquid crystal display panel, including: a first substrate including a common electrode; a second substrate including a plurality of pixels which are arranged in a matrix form and face the common electrode, wherein at least one of the pixels includes first and second subpixels; the first subpixel including a first subpixel electrode, wherein the first subpixel electrode includes a plurality of first micro branches, which are arranged at a first angle with respect to a polarization axis of a polarizer disposed adjacent to the first or second substrate; the second subpixel including a second subpixel electrode, wherein the second subpixel electrode includes a plurality of second micro branches, which are arranged at a second angle with respect to the polarization axis of the polarizer, wherein the first angle is different from the second angle by about 20° or less; and a liquid crystal layer interposed between the first and second substrates.",
            "PIXEL ELECTRODE PANEL, A LIQUID CRYSTAL DISPLAY PANEL ASSEMBLY AND METHODS FOR MANUFACTURING THE SAME - A liquid crystal display panel, including: a pixel electrode formed on a first substrate; an alignment layer formed on the pixel electrode, wherein the alignment layer includes an alignment layer material and aligns first liquid crystal molecules in a direction substantially perpendicular to the pixel electrode; and a photo hardening layer formed on the alignment layer, wherein the photo hardening layer includes a photo hardening layer material and aligns second liquid crystal molecules to be tilted with respect to the pixel electrode, wherein the alignment layer material and the photo hardening layer material have different polarities from each other.",
            "GATE DRIVING APPARATUS AND DISPLAY DEVICE INCLUDING THE SAME - Provided are a gate driving apparatus and a display device including the same. The gate driving apparatus includes a plurality of stages arranged sequentially, each stage is adapted to output a gate signal and including first output lines and a second output line, wherein the first output lines are electrically connected to a gate line corresponding to each of the stages and are adapted to transmit the gate signal to a plurality of pixels coupled to the gate line, the second output line is adapted to transmit the gate signal to a preceding stage of each of the stages, and the first output lines and the second output line share one contact pad.",
            "LIQUID CRYSTAL DISPLAY DEVICE, ALIGNMENT FILM, AND METHODS FOR MANUFACTURING THE SAME - A liquid crystal display device is provided, including a liquid crystal layer interposed between a first display panel and a second display panel; and an alignment film formed on at least one of the first and second display panels, the alignment film including first polysiloxanes and second polysiloxanes disposed on the first polysiloxanes, wherein a first portion of silicon atoms of the second polysiloxanes are bonded to vertical functional groups interacting with liquid crystal molecules in the liquid crystal layer, and to first pre-tilting functional groups aligning the liquid crystal molecules in the liquid crystal layer to be tilted with respect to at least one of the first and second display panels by being cross-linked. The bonding structure of the first and the second polysiloxanes being different."
        ],
        [
            "Published",
            "09-08-2011",
            "09-15-2011",
            "10-06-2011",
            "10-06-2011",
            "03-08-2012",
            "10-04-2012"
        ]
    ],
    "pageTitle": "Choi, Cheonan-Si - Patent applications",
    "title": "",
    "url": "http://www.faqs.org/patents/inventor/choi-cheonan-si-4/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986423.95/warc/CC-MAIN-20150728002306-00117-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 427287163,
    "recordOffset": 427258110,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Kyong Sik Choi, Cheonan-Si KR //]]> BarDraw('2515140',['Patent applications by Kwang-Wook Choi, Cheonan-Si KR'],[[2,2,2,6]],['2011','2012','2013','2014'],0); // <script type=\"text/javascript\"> </div> <div id=\"legend2515140\" align=\"center\"></div> </div> <canvas id=\"bg2515140\" style=\"max-width: 500px; width: 100%;\"></canvas> <div> <p align=\"center\">Patent applications by Kwang-Wook Choi, Cheonan-Si KR</p> <div class=\"bar2515140\" style=\"max-width: 500px; width: 100%; float:left; \"> <div align=\"left\" style=\"padding-top:20px;\"> </table> </tbody> </tr> <td>11-27-2014</td> <td><a href=\"/patents/app/20140347887\">BACKLIGHT ASSEMBLY</a> - A backlight assembly includes a plurality of point light sources, a light guide plate (“LGP”) and a printed circuit board (“PCB”). The LGP has a light incident face in which light is incident, a side surface extending from an edge portion of the light incident face, and a fixing groove which is formed from the side surface toward an inner portion thereof The PCB includes a point light source disposing portion in which the point light sources are disposed along a first direction, an extending portion extending from the point light disposing portion along a second direction substantially perpendicular to the first direction, and a protrusion which is fixed at an end portion of the extending portion. The protrusion of the PCB is coupled with the fixing groove of the LGP.</td> <td>20140347887</td> <tr> </tr> <td>06-19-2014</td> <td><a href=\"/patents/app/20140168534\">DISPLAY APPARATUS AND METHOD OF MANUFACTURING THE SAME</a> - A display apparatus includes a display panel including a protective electrode and a ground pad that is applied with a ground voltage, a conductive member electrically connecting the ground pad and the protective electrode, a backlight unit providing light to the display panel, a bottom",
    "textAfterTable": "Kyung Hyun Choi, Cheonan-Si KR Patent application number Description Published 20120141925 Photo-Mask and Method for Manufacturing Liquid Crystal Display Device Using the Same - A photo-mask is capable of preventing stain defects and a method for fabricating a liquid crystal display device using the photo-mask which achieves the same capability. The photo-mask includes a transparent substrate configured to transmit ultraviolet light and a light shielding layer configured to block ultraviolet light on a surface of the transparent substrate. The light shielding layer includes an absorption layer configured to absorb ultraviolet light. 06-07-2012 20150102314 ORGANIC LIGHT EMITTING DIODE DISPLAY - An organic light emitting diode display is provided including: a substrate including a display area and a non-display area positioned at a circumference of the display area; a thin film transistor formed on the substrate; a first electrode formed on the thin film transistor and electrically connected to the thin film transistor; a pixel definition layer formed on the first electrode and defining a pixel area; and an emission layer formed on the first electrode and contacting the first electrode in the pixel area, wherein the display area is divided into a first region, and a second region including a remainder of the display area except for the first region, and a cross-sectional area ratio of the pixel definition layer that a cross-section of the pixel definition layer occupies for a unit pixel is different in the first region",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}