{
    "relation": [
        [
            "Categories",
            "Campus Safety",
            "Greek Life",
            "Clubs and Activities",
            "Great for these types of students",
            "Share any unusual traditions or locations on campus",
            "Bang for the buck",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "The Mary Washington campus is really safe. The are police driving around the campus constantly. In my first year, there were never any safety problems.",
            "The Greek life doesn't play a major role in Mary Washington. We have one sorority that is approved by the school and two fraternity that are not approved by the school.",
            "There are various clubs and activities to do on campus. I joined the Asian Students Association club and it is very fun. There are great Asian food to eat and fun activities to do in this club.",
            "It is a great school for students who want a good education and fun college life but not a crazy party life.",
            "Mary Washington have the multicultural fair every year in spring which is really fun. The is a water fountain in the middle of the campus that I like to hangout at. Me and my friends also enjoy sitting under the cherry blossom trees in the spring.",
            "Mary Washington provides great academics and food services but I wish they could improve the dorm life.",
            "I enjoy hanging out with my friends in the dorms and sitting on the grass on a nice day. They are also clubs that you can join for fun. Sometimes we go eat at restaurants in downtown since there are many great restaurants there.",
            "I personally like the food on campus but many students didn't. There are various places to eat on campus and all of them serves very different type of food. Make sure that you eat some salad since many of the food served are not very healthy.",
            "I didn't really like my dorm because it was in the corner of the campus so it was far from almost everything like the library, dinning halls and academic buildings. It is also on the bottom of the hill so I had to walk the stairs everyday. There were people in my hall that were very rude and loud but the Residence Assistant did not do anything about it.",
            "There are classes that are very easy but there are also classes that are really tough. It depends mostly on the professors and your interest in the course. But in general if you work hard and do all the homework, projects and study for the test you will do just fine.",
            "Mary Washington doesn't have a football team so don't expected it to be highly spirited like many larger universities. Also, you will tend to not finish your meals so make sure that you use them before the last week of the semester so you are not wasting money. I would also recommend picking your dorms wisely because some of the dorms are in a very inconvenient location.",
            "I think University of Mary Washington is a good school for academics. It is different than many other universities since it is so small. But I like smaller schools so I enjoyed my first year there."
        ]
    ],
    "pageTitle": "University of Mary Washington (UMW) Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/University-of-Mary-Washington/reviews?_escaped_fragment_=/show/2186",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986423.95/warc/CC-MAIN-20150728002306-00294-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 903130459,
    "recordOffset": 903061593,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{295482=© 2015, Cappex.com, LLC, 8396=Although everyone wants to live in Alvey at first, due to its proximity to the gym and the fact that it has air conditioning, I would not recommend it. The rooms are actually very cold, you will wind up wearing sweatshirts in August. The dorm is isolated from the rest of campus, making it difficult to meet the rest of your class. I would recommend making Russell your first choice for dorms, it has the biggest rooms and closets, along with a lot of handy built in storage space. Try to avoid eating weekend meals at Seaco, with the exception of brunch, because the weekend food is worse than usual. The Nest is good to eat at for lunch, but the amount of food that constitutes a meal swipe there is not filling enough to be eaten for dinner. There are a lot of cheap places to eat within walking distance of the school. On campus jobs are great and extremely convenient, although not easy to come by once you are already a student due to the high amount of applicants. If you are offered a job with your admission, I advise that you take it if you think at some later point you would like to have a campus job., 201317=2005-2009 the food was eh. They were beginning to make improvements though., 1869=It has been said that Mary Washington is a boring campus with absolutely nothing to do. Not true. College is truly what you make of it. There are tons of things to do at UMW; all you have to do is look around. There are over 100 clubs and organizations on campus ranging from Photography Club to African Hand Percussion Club. There is a club or organization on campus that represents everyone’s interests. Even if UMW does not have an organization on campus that you would like, you can create it. UMW holds several dances on campus throughout the year. There is the Homecoming Dance, and the other dances are normally held be sports teams, the different dance organizations, or community service clubs. There are many places on campus to hangout. There is a place on campus called the Washroom, where everyone comes to watch television, play video games or board games, eat, study, or get on the computer. The school has just completed another area for students called The Underground, which is set to open in the fall of ’09. At the Underground, students can come and eat, hangout, and many events will be held there, such as dances, live music, etc. Cheap Seats, an organization on campus, plays movies on campus that are about to be released on DVD, usually every weekend. It only cost a dollar to go see each movie. There are many other events held on campus. Devil-Goat Day, a carnival event, and The Multicultural Fair are two major events held in April. Fredericksburg is about fifty miles between Washington D.C. and Richmond, so that provides some fun on the weekends. We are near Central Park, an area with a lot of stores, restaurants, the mall, movie theatres, an ice skating rink, and many more. Within walking distance is downtown Fredericksburg. There are antique stores, restaurants, ice-cream stores, and events that are held downtown. It’s a fun place to hangout. Also set to open in the fall is the University Café, located downtown. Students will not only come to eat there, but students will get to experience exhibits of art, literature, and music, a goal of the University Café., 7777=Those who like the small school feel will love it here. It's big enough that it doesn't feel like high school anymore, but you're able to recognize people and the teachers will get to know your name. There is not a high amount of diversity here, but if the 2009 freshman class is any indication, the rate is quickly increasing. The students here have any and all types of interests, making it very easy to connect with others., 22932=Devil/Goat day is a long-lived tradition at Mary Washington. Every year we have a huge festival with many games, lots of food, and free give-aways. The even graduation years (2012) are the Goats, and the odd graduation years (2013) are the devils. The tradition began in 1926.}",
    "textBeforeTable": "07/31/2009 Reviewer is A current student here. 19 out of 19 people found this review useful. 1 of 57 Breon from Stafford, VA Check out reviews left by other students or leave your own review. You could win a free scholarship. University of Mary Washington Reviews University of Mary Washington › Virginia › By State › Colleges › } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.create', -->",
    "textAfterTable": "Am learning a lot There are a wide variety of classes here, meaning that there is always something appealing to take. The classes get more specific and therefore, more interesting, the higher their level. The class sizes are small enough that you can get to know a lot, or in some cases all, of your classmates, and the teacher will remember your name. The teachers here are all very enthusiastic about their topics, which makes going to class a lot easier! Login to rate or flag the reviews William from Burke, VA 06/15/2009 Reviewer is Accepted here and planning to attend soon. Reviewer has been to campus. 7 out of 7 people found this review useful. 3 of 57 Categories Comments Great for these types of students Great for students who want to learn and relax in a beautiful setting while still having access to the big city. Tips for prospective students Excellent price, seemed to me to be a private education",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}