{
    "relation": [
        [
            "Reel",
            "5176",
            "5176",
            "5176",
            "5176",
            "5176",
            "5176",
            "5176",
            "5176",
            "5176",
            "5176",
            "5176",
            "5176",
            "5176",
            "5176",
            "5176",
            "5176",
            "5176",
            "5176",
            "5176",
            "5176",
            "5176",
            "5176",
            "5176",
            "5176",
            "5176",
            "5176",
            "5176",
            "5176",
            "5176",
            "5176",
            "5176",
            "5176",
            "5176",
            "5176",
            "5176",
            "5176",
            "5176",
            "5176",
            "5176",
            "5176",
            "5176",
            "5176",
            "5176",
            "5176",
            "5176",
            "5176",
            "5176",
            "5176",
            "5176"
        ],
        [
            "Frames",
            "2-194",
            "unfilmed",
            "195-210",
            "211-214",
            "215-227",
            "228-230",
            "231-234",
            "235-240",
            "241-247",
            "248-253",
            "254-257",
            "258-261",
            "262-267",
            "268-271",
            "272-301",
            "302-310",
            "311-322",
            "323-340",
            "341-397",
            "398-421",
            "422-424",
            "425-428",
            "429-447",
            "448-459",
            "460-464",
            "465-468",
            "469-472",
            "473-481",
            "482-484",
            "489-494",
            "495-627",
            "485-488",
            "628-631",
            "632-674",
            "675-678",
            "679-681",
            "682-685",
            "686-689",
            "690-697",
            "698-705",
            "706-717",
            "718-720",
            "721-808",
            "809-812",
            "813-815",
            "816-820",
            "821-1250",
            "1251-1430",
            "1431-1564"
        ],
        [
            "",
            "Duell, Sloan & Pearce, Inc., cont.",
            "Dues, Membership Cards, Receipts, etc., undated, 1937-1967 (for political, cultural, and civic associations, many honorary or complimentary)",
            "Dufty, William, 1965",
            "Dugan, James, 1950",
            "Duggar, Ben (Professional Art Quarterly), 1936 (correspondence about articles by Kent for publication in the Quarterly, and Kent's thoughts on commercial art)",
            "Dulman, Ruth, 1953",
            "Dumont Broadcasting Corporation, WABD 5, 1957",
            "Dundee Designs, 1955",
            "Durkin, James H., 1957, 1971",
            "E. P. Dutton & Co., Inc., 1947, 1952, 1967",
            "Duveen, Albert, 1947",
            "Dwight, Alice M., 1969-1970",
            "D, Unidentified (Eddie, 1970; Herbert and Nellie, 1970; Linda, 1970)",
            "Earle, Olive, 1920",
            "The East West Gallery of Fine Art (Mildred Taylor), 1928 (shipping and insurance arrangements for exhibition of Kent paintings)",
            "Eastern Airlines Incorporated, 1941, 1957",
            "Eastman, Ruth Cornell, 1966",
            "Eastman, Scott & Company, 1930-1931 (correspondence regarding commission for trademark)",
            "Eaton, Cyrus S. and Anne K., 1958-1966 (clippings; letters expressing Kent's admiration of Eaton's work toward building Soviet-American friendship; proposal for a periodical; requests to meet Eaton)",
            "Eaton, Margaret, 1955-1956",
            "Eckhardt, Margaret, 1969",
            "Eddy, Harriet G., 1962",
            "Edgerton, Marion, 1959-1960",
            "Edman, Dr. Irwin, 1951",
            "Edmonds, Mrs. Augustus, undated, 1951",
            "Edmunds, John, 1953",
            "Edwards, Alan, 1925",
            "Egbert, Donald Drew, 1951, 1960-1962",
            "Einstein, Albert, 1953",
            "Eiseman, Paul, 1941",
            "Eisen, Michela, 1961-1966",
            "The Eisenhower Foundation, 1956",
            "Eisenzimmer, Ike, 1969",
            "Eisler, Hilde and Gerhart, 1962-1969",
            "Fred Eldean Organizations Incorporated, 1948",
            "Electrolux Corporation, 1946",
            "Elliott, John, 1955",
            "Ellis, Ethel, 1965",
            "Ellis, Fred, 1958, 1960",
            "Ellis, Dr. Robert H., 1959-1960",
            "Ellison, Jerome, 1940-1941",
            "Elman, Mrs. Philip, 1959",
            "Elowitz, Gertrude, and Al Moss (see also: Moss, Al, and Gertrude Elowitz), 1951-1954",
            "Elwert, Philip F., 1969",
            "Elwyn, Betty, undated",
            "Elwyn, Frances H., 1941",
            "Embassies, 1948-1956, 1959-1970 (invitations, correspondence about exhibitions and cultural events)",
            "Embassy of the USSR, 1941-1947, undated (printed matter about art and culture; invitations to participate in conferences; invitations to receptions and social events; Artists for Victory; translations of Kent's books; loans of paintings and prints for exhibitions abroad; travel plans and passport case)",
            "Emergency Civil Liberties Committee, 1957-1967 (printed matter; letter of appointment to executive committee; request for medal designed by Kent; discussion of the organization's publications and activities; plans for an art exhibition; Kent's legal costs for passport lawsuit)"
        ]
    ],
    "pageTitle": "Detailed description of the Rockwell Kent papers, [circa 1840]-1993, bulk 1935-1961 - Digitized Collection | Archives of American Art, Smithsonian Institution",
    "title": "",
    "url": "http://www.aaa.si.edu/collections/rockwell-kent-papers-9557/more",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989043.35/warc/CC-MAIN-20150728002309-00327-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 273439067,
    "recordOffset": 273277457,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{6847=The collection was processed by Catherine Stover and Lisa Lynch in 1998 and microfilmed on reels 5153-5256. Sealed materials that became available in 2000 were microfilmed separately on reels 5740-5741. Funding for the processing, microfilming, and publication of the finding aid was provided by The Henry Luce Foundation. The finding aid was modified during EAD conversion by Stephanie Ashley in 2002. In 2008, the microfilm was digitized with funding provided by the Terra Foundation for American Art., 31452=Rockwell Kent (1882-1971), an energetic and multitalented man, pursued many interests and careers during his very long and active life. At various times he was an architect, draftsman, carpenter, unskilled laborer, painter, illustrator, printmaker, commercial artist, designer, traveler/explorer, writer, professional lecturer, dairy farmer, and political activist., 4744=This series contains Kent's personal and professional correspondence, along with business records of the dairy farm and associated enterprises; also included are printed matter on a wide variety of topics and promotional literature relating to organizations and causes of interest to him. Voluminous correspondence with his three wives, five children, and other relatives, as well as with literally hundreds of friends--both lifelong and of brief duration--illuminates Kent's private life and contributes to understanding of his complex character. Among the many correspondents of note are: his art teachers William Merritt Chase, Robert Henri, and Kenneth Hayes Miller; fellow artists Tom Cleland, Arthur B. Davies, James Fitzgerald, Hugo Gellert, Harry Gottleib, Marsden Hartley, Charles Keller, and Ruth Reeves; collectors Duncan Phillips and Dan Burne Jones; critics J. E. Chamberlain and Walter Pach; and dealers Charles Daniel, Felix Wildenstein, and Macbeth Galleries. Kent corresponded with such diverse people as Arctic explorers Peter Freuchen, Knud Rasmussen, and Vilhjalmar Steffanson; composer Carl Ruggles and songwriters Lee Hays and Pete Seeger; civil rights pioneers Paul Robeson and Dr. W. E. B. Du Bois; writers Bayard Boyesen, Scott and Helen Nearing, and Louis Untermeyer; and art historian and print curator Carl Zigrosser., 16932=Series 1: Alphabetical Files contain Kent's personal and professional correspondence, along with business records of the dairy farm and associated enterprises; also included are printed matter on a wide variety of topics and promotional literature relating to organizations and causes of interest to him. Voluminous correspondence with his three wives, five children, and other relatives, as well as with literally hundreds of friends, both lifelong and of brief duration, illuminates Kent's private life and contributes to understanding of his complex character. Among the many correspondents of note are: his art teachers William Merritt Chase, Robert Henri, and Kenneth Hayes Miller; fellow artists Tom Cleland, Arthur B. Davies, James Fitzgerald, Hugo Gellert, Harry Gottleib, Marsden Hartley, Charles Keller, and Ruth Reeves; collectors Duncan Phillips and Dan Burne Jones; critics J. E. Chamberlain and Walter Pach; and dealers Charles Daniel, Felix Wildenstein, and Macbeth Galleries. Kent corresponded with such diverse people as Arctic explorers Peter Freuchen, Knud Rasmussen, and Vilhjalmar Steffanson; composer Carl Ruggles and songwriters Lee Hays and Pete Seeger; civil rights pioneers Paul Robeson and Dr. W. E. B. Du Bois; writers Bayard Boyesen, Scott and Helen Nearing, and Louis Untermeyer; and art historian and print curator Carl Zigrosser., 28178=Kent wrote two autobiographies, This Is My Own (1940) and It's Me, O Lord (1955). In 1969, he was the subject of an oral history interview conducted by Paul Cummings for the Archives of American Art., 17473=Circumstances surrounding the acquisition of the papers are highlighted in an article by Garnett McCoy (\"The Rockwell Kent Papers,\" in the Archives of American Art Journal, 12, no. 1 [January 1972]: 1-9), recommended reading for researchers interested in the collection. The collection is remarkably complete, for in the mid 1920s Kent began keeping carbon copies of all outgoing letters, eventually employing a secretary (who became his third wife and continued her office duties for the remainder of Kent's life)., 29837=An avid traveler, Kent was especially fascinated by remote, Arctic lands and often stayed for extended periods of time to paint, write, and become acquainted with the local inhabitants. Between 1918 and 1935, he wrote and illustrated several popular books about his experiences in Alaska, Tierra del Fuego, and Greenland. In the 1930s and 1940s, Kent was much in demand as a lecturer, making several nationwide tours under the management of a professional lecture bureau; he spoke mainly about his travels, but among his standard lectures were some on \"art for the people.\", 11754=The collection is arranged into six series. Series 1 is arranged alphabetically. The arrangement of the remaining series is explained in each series description. Note that sealed materials that became available in 2000 were microfilmed separately on reels 5740-5741, but have integrated into this finding aid., 1442=Letters to Rockwell Kent from wives Frances and Sally (Shirley Johnstone), sealed during Sally's lifetime, became available for research in 2000 and were microfilmed later on reels 5740-5741., 13614=Series 2: Writings consists of notes, drafts, and completed manuscripts by Rockwell Kent, mainly articles, statements, speeches, poems, introductions, and reviews. The Kent Collection given to Friendship House, Moscow, in 1960, was augmented later by a set of his publications and the illustrated manuscripts of many of his monographs. Also included are a small number of manuscripts by other authors., 7362=In 1969, Rockwell Kent donated his papers to the Archives of American Art; textile samples were received in 1979, and his widow gave additional papers in 1971 and 1996. Letters to Rockwell Kent from wives Frances and Sally, sealed during Sally Kent Gorton's lifetime, became available for research after her death in 2000, and further material was donated to the Archives of American Art in 2001 by the Estate of Sally Kent [Shirley Johnstone] Gorton., 29029=As a young man, Kent met Rufus Weeks, became committed to social justice, and joined the Socialist Party. Throughout his life, he supported left-wing causes and was a member or officer of many organizations promoting world peace and harmonious relations with the Soviet Union, civil rights, civil liberties, antifascism, and organized labor. Kent was frequently featured as a celebrity sponsor or speaker at fund-raising events for these causes. In 1948, he ran unsuccessfully as the American Labor Party's candidate for Congress. Kent's unpopular political views eventually led to the dissolution of his dairy business, resulted in a summons to appear before the House Un-American Activities Committee, and prompted the U.S. State Department to deny him a passport, an action that subsequently was overturned by the U.S. Supreme Court., 17793=The Rockwell Kent papers measure 88 linear feet and date from circa 1840 to 1993 with the bulk of the collection dating from 1935 to 1961. The collection provides comprehensive coverage of Kent's career as a painter, illustrator, designer, writer, lecturer, traveler, political activist, and dairy farmer., 29239=In 1927, Kent purchased Asgaard Farm at AuSable Forks, New York, in the Adirondacks, where he lived for the remainder of his life, operating a modern dairy farm on a modest scale for many years., 5614=The microfilm of this collection was digitized in 2008 and is available via the Archives of American Art's website. Researchers should note that the legibility of some materials is poor due to the microfilm quality., 5309=Rockwell Kent papers, circa 1840-1993, bulk 1935-1961. Archives of American Art, Smithsonian Institution.}",
    "textBeforeTable": "The bulk of this series has been digitized. Material of very specialized or limited interest (e.g. banking records, dairy immunization records, employee tax records, dog licenses etc.) has not been digitized. Records are arranged chronologically within each file; brief summaries are provided for many titles, usually where there is a significant amount of material. Cross-referencing is supplied where possible to indicate areas of overlap, inconsistencies in filing, or name changes; references are to other file titles within this series. Material is arranged alphabetically, usually by the name of the individual or organization represented, though some file titles represent subjects or occasions (e.g., \"Spanish Causes\" and \"Birthday\"). File titles are, in most cases, those used by Rockwell and Sally Kent, with some minor changes for consistency. The Kents' filing system included a \"Miscellaneous\" designation for each letter of the alphabet, used for single items or small quantities not requiring separate folders. To facilitate access and for ease of microfilm use, contents of the miscellaneous folders have been interfiled in sequence. Letters to Rockwell Kent from wives Frances and Sally (Shirley Johnstone), sealed during Sally's lifetime, became available for research in 2000 and were microfilmed later on reels 5740-5741. Business records of Asgaard Farm include records of the dairy and transfer of ownership to its employees, tax and employee information, and documents concerning several related business ventures such as distributorships for grain, feed, and farm implements. Kent's professional correspondence documents exhibitions, sales, consignments, and reproduction of prints and paintings. He kept meticulous",
    "textAfterTable": "5153 unfilmed Alejos, Elidea Pinto (see also: Foster Parents' Plan), 1940-1944 (letters and drawings from foster child sponsored by the Kents) 5153 1423-1434 Alexander, Claude H., 1943-1957 5153 1435-1506 Alexander, Gross W. (see also American Russian Institute), 1959-1965 (about illustrations for his book, A Message to the American People [under the aegis of the Inter-Religious Committee for World Order and Peace], including a disagreement over adapting Michelangelo's Creation of Adam; health advice, with information about Kent's visit to a geriatric institute in Bucharest) Reel Frames 5154 2-8 Alfalfa Hill, 1941 5154 9-14 Alfred, Helen (Peace Publications), 1958-1959 5154 15-17 Alfred University, 1947 5154 24-28 All American Dinner and Bazaar, 1941 5154 18-23 All-American Editions, Inc., 1941 5154 29-83 Allen, Arthur S. and Family (see also: Greenland), 1915, 1927-1930, 1942, undated (family news; comments on Kent's book illustrations; commissions for advertising work; travel; color consulting) 5154 84-173",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}