{
    "relation": [
        [
            "",
            "Berry Petroleum Company",
            "Bill Barrett Corporation",
            "Cabot Oil & Gas Corporation",
            "Cimarex Energy Company",
            "Comstock Resources, Inc.",
            "Concho Resources Inc.",
            "Continental Resources, Inc.",
            "Denbury Resources Incorporated",
            "EXCO Resources, Incorporated"
        ],
        [
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            ""
        ],
        [
            "",
            "Forest Oil Corporation",
            "Penn Virginia Corporation",
            "Quicksilver Resources Inc.",
            "Range Resources Corporation",
            "Stone Energy Corporation",
            "Swift Energy Company",
            "Ultra Petroleum Corp.",
            "Whiting Petroleum Corporation",
            ""
        ]
    ],
    "pageTitle": "",
    "title": "",
    "url": "http://www.wikinvest.com/stock/St._Mary_Land_(SM)/Filing/DEF_14A/2012/F101169502",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986423.95/warc/CC-MAIN-20150728002306-00034-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 836502723,
    "recordOffset": 836382520,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{384307=Mr. Quintana is the President, Chief Executive Officer, and a director of TESCO, which designs, manufactures, and delivers technology based solutions for the upstream energy industry, including oilfield drilling and completion technology, services, and equipment. We have an agreement with TESCO for its provision of services to us in connection with our drilling and completion operations. This agreement continues until canceled by either us or TESCO on 30 days advance written notice. Pursuant to this agreement, we are obligated to pay TESCO only for services actually performed or equipment delivered, as the case may be. This agreement does not require us to make any other payments to TESCO. Mr. Quintana does not have any direct or indirect interest in the transaction, other than as a result of serving as an executive officer and director of TESCO. Prior to 2010, the services provided by TESCO and the amounts we paid did not exceed the threshold amount for review under our Related Person Policy. In 2010, we paid TESCO $346,683 for any services rendered. In 2011, we paid TESCO $1,029,665 for services rendered. As of March 31, 2012, we had paid TESCO $172,495 for services rendered during 2012. In accordance with our Related Persons Transaction Policy, based upon these amounts, the Audit Committee reviewed the relationship between us and TESCO and determined that the relationship is in our best interests and the best interests of our stockholders., 458352=        This section describes the compensation programs for our Chief Executive Officer, Chief Financial Officer and each of our three other most highly compensated executive officers employed at the end of the 2011 fiscal year, who we collectively refer to in this \"Executive Compensation\" section as our \"NEOs\" or \"Named Executive Officers.\" Our NEOs for fiscal 2011 are:, 568587=        The LTIP, which we implemented in the current form in 2008, is an equity compensation program that utilizes performance share units, or PSUs, and restricted stock units, or RSUs, to reward our executive officers and key employees for long-term growth in our net asset value, as reflected in our absolute and relative cumulative total stockholder return, which includes the effects of dividends (\"TSR\"). Our employees at the senior professional level and above are eligible to participate in the LTIP. Awards of PSUs and RSUs are issued pursuant to our stockholder-approved Equity Plan., 495035=        This peer group includes fourteen of the companies included in our 2010 peer group, plus three additional companies: Comstock Resources, Inc., Range Resources Corporation, and Stone Energy Corporation. Companies in the 2010 peer group excluded from the 2011 peer group were: Encore Acquisition Company and Petrohawk Energy Corporation., 925479=        Non-employee directors may participate in our matching charitable gift program, maintained for current and former employees to encourage financial support for charitable organizations that are exempt from federal income taxation. Our annual charitable gifts budget, which includes this matching program, is determined prior to the commencement of each year as a percentage of the average of the prior three years' total income, before taxes and charitable contributions, and all annually budgeted funds are expended for charitable purposes. Ms. Baumann, Mr. Seidl, and Mr. Sullivan participated in this program during 2011, and we matched a total of $19,200 in non-employee director contributions for 2011 under this program. We may suspend, change, revoke or terminate the program at any time., 906053=        Based on the respective annual base salaries and benefit levels of the NEOs as of December 31, 2011, under the change of control executive severance agreements, the total maximum severance payments for two and one-half years, the total minimum severance payments for one year, and the estimated value of continued benefits for one year after severance for each of the NEOs who were employed by us as of December 31, 2011, would be as follows:, 966754=        Ms. Baumann, Mr. Brand, Mr. Quintana and Mr. Sullivan served on our Compensation Committee during fiscal year 2011. None of the directors who served on the Compensation Committee during fiscal year 2011 has ever served as one of our officers or employees. During fiscal year 2011, there were no Compensation Committee interlocks., 1037334=2011 ANNUAL REPORT, 573184=        The performance matrix for the 2011-2014 performance period is shown below:, 241747=        Pursuant to United States Securities and Exchange Commission rules, we may provide you with access to our proxy materials via the Internet. As a result, many beneficial owners of our stock will be receiving a Notice of Internet Availability of Proxy Materials (the \"Notice\") instead of a paper copy of the accompanying Proxy Statement and our 2011 Annual Report to Stockholders. The Notice contains instructions on how to access those documents via the Internet. The Notice also contains instructions on how to request a paper copy of our proxy materials, including the accompanying Proxy Statement, our 2011 Annual Report to Stockholders, and a form of proxy card. We will mail printed proxy materials to all stockholders of record., 919670=        The annual service period for our directors is the period from one stockholders' annual meeting to the next. The current fiscal service period is the period from May 25, 2011, through May 23, 2012. Director compensation is primarily paid in the form of stock grants., 550149=        Finding and Development Costs\u0097Finding and development costs are a measure of the efficiency of our capital program in adding value. The finding and development costs target represents the estimated cost of proved developed reserve additions on a $/MCFE basis, as projected by our 2011 business plan. In 2011, our finding and development costs were lower than our target by slightly less than 2%., 610827=        Once vested, the participant receives a share of the distributable proceeds, in the form of annual cash payments, regardless of employment with us. The complex nature of the NPP and the delay and uncertainty in realization of compensation value until pool payout was reached made the NPP less attractive to newly recruited and highly marketable executives and employees. Accordingly, we discontinued the NPP in 2007 on a prospective basis, and the 2007 pool was the last NPP pool created. We will continue to make payments under the NPP for pool years established prior to 2008 for as long as a subject pool remains in payout status., 1043340=Using a black ink pen, mark your votes with an X as shown in this example. Please do not write outside the designated areas. X 01GAQB 1 U PX + . + A Proposals \u0097 The Board of Directors recommends a vote FOR all the nominees listed and FOR Proposals 2 and 3. For Against Abstain 1. The Nominating and Corporate Governance Committee of the Board of Directors has nominated the below eight persons to stand for election as directors. As of the date of the accompanying proxy statement, no one has been nominated to serve as director other than the nominees listed below. 2. The proposal to ratify the appointment by the Audit Committee of Deloitte & Touche LLP as our independent registered public accounting firm for 2012. For Against Abstain 3. To approve, on a non-binding advisory basis, the compensation of our Company\u0092s named executive officers, as disclosed in the accompanying Proxy Statement. Authorized Signatures \u0097 This section must be completed for your vote to be counted. \u0097 Date and Sign Below C Please sign exactly as name(s) appears hereon. Joint owners should each sign. When signing as attorney, executor, administrator, corporate officer, trustee, guardian, or custodian, please give full title. Signature 1 \u0097 Please keep signature within the box. Signature 2 \u0097 Please keep signature within the box. Date (mm/dd/yyyy) \u0097 Please print date below. Annual Meeting Proxy Card 01 - Barbara M. Baumann 04 - Stephen R. Brand 07 - John M. Seidl 02 - Anthony J. Best 05 - William J. Gardiner 03 - Larry W. Bickle 06 - Julio M. Quintana For Against Abstain For Against Abstain 08 - William D. Sullivan For Against Abstain IMPORTANT ANNUAL MEETING INFORMATION B Non-Voting Items Change of Address \u0097 Please print new address below. 1 3 5 3 8 3 1 MR A SAMPLE (THIS AREA IS SET UP TO ACCOMMODATE 140 CHARACTERS) MR A SAMPLE AND MR A SAMPLE AND MR A SAMPLE AND MR A SAMPLE AND MR A SAMPLE AND MR A SAMPLE AND MR A SAMPLE AND MR A SAMPLE AND C 1234567890 J N T 1234 5678 9012 345 000000000.000000 ext 000000000.000000 ext 000000000.000000 ext 000000000.000000 ext 000000000.000000 ext 000000000.000000 ext 000004 MR A SAMPLE DESIGNATION (IF ANY) ADD 1 ADD 2 ADD 3 ADD 4 ADD 5 ADD 6 ENDORSEMENT_LINE______________ SACKPACK_____________ C123456789 IF YOU HAVE NOT VOTED VIA THE INTERNET OR TELEPHONE, FOLD ALONG THE PERFORATION, DETACH AND RETURN THE BOTTOM PORTION IN THE ENCLOSED ENVELOPE. Electronic Voting Instructions You can vote by Internet or telephone! Available 24 hours a day, 7 days a week! Instead of mailing your proxy, you may choose one of the two voting methods outlined below to vote your proxy. VALIDATION DETAILS ARE LOCATED BELOW IN THE TITLE BAR. Proxies submitted by the Internet or telephone must be received by 1:00 a.m., MST on May 23, 2012. Vote by Internet \u0095 Go to www.investorvote.com/SM \u0095 Or scan the QR code with your smartphone \u0095 Follow the steps outlined on the secure website Vote by telephone \u0095 Call toll free 1-800-652-VOTE (8683) within the USA, US territories & Canada on a touch tone telephone \u0095 Follow the instructions provided by the recorded message, 484581=regarding the competitiveness of our executive compensation opportunities, compensation risk assessments and equity compensation practices of our peers. To facilitate the delivery of these services to the Compensation Committee, F. W. Cook interfaces with our management, in particular the Vice President\u0097Human Resources. F. W. Cook does not provide directly, or indirectly through affiliates, any non-executive compensation services, such as pension consulting or human resource outsourcing, to us or any other clients. The total consulting fees we pay to F. W. Cook are less than 1% of the total annual revenues of F. W. Cook, and F. W. Cook consultants working with us are prohibited from owning any of our shares of common stock directly, although such shares may be owned within mutual funds. In addition, no officer, director, stockholder or employee of F. W. Cook has any known personal relationship with any of our officers, directors, stockholders or employees that would present a potential conflict to their independence. F. W. Cook has agreed to advise the Compensation Committee if any potential conflict of interest arises that could cause F. W. Cook's independence to be questioned and not to undertake any project for our management, except at the request of the Compensation Committee and as agent for the Compensation Committee. In 2011, F. W. Cook did not provide any services to us other than those requested by the Compensation Committee and related to F. W. Cook's engagement as the independent consultant to the Compensation Committee., 405523=Baltimore, MD 21202, 569831=        Under our LTIP, participants were each awarded a target number of share units during the third quarter of 2011, for the performance measurement period beginning July 1, 2011, and ending June 30, 2014. Under the Equity Plan, 75% of the share units were granted as PSUs and 25% were granted as RSUs. RSUs are settled in common shares at the time of vesting, and PSUs are settled in common shares, depending on the extent to which we have satisfied the performance criteria, at the end of the three-year performance period. The actual number of shares of our common stock issued to settle PSUs at the end of the three-year performance period can range from 0% to 200% of the number of PSUs, depending on our absolute and relative TSR. TSR is measured on a compound annualized basis, and relative TSR is compared to the TSR of an equal weighted index of peer companies (the \"TSR Peer Group\"). The TSR Peer Group was constructed using the constituents of the Oil & Gas Exploration and Production Global Industry Classification System Sub-Industry Group in the S&P SmallCap 600 and S&P MidCap 400 Indices, excluding our company. For the 2011-2014 performance period, the index constituents of the TSR Peer Group as of December 31, 2011, include: Bill Barrett Corporation, Petroquest Energy Inc., Petroleum Development Corporation, Cimarex Energy Company, Comstock Resources, Inc., Contango Oil & Gas Company, Forest Oil Corporation, Gulfport Energy Corporation, Penn Virginia Corporation, Plains Exploration & Production Company, Quicksilver Resources Inc., Swift Energy Company, GeoResources, Inc., Northern Oil and Gas, Inc., Energen Corporation, Approach Resources, Inc., and Stone Energy Corporation. This TSR Peer Group is a custom index developed by Standard & Poor's Financial Services LLC for our company. The peer group participants may change, and change is independent of any action by us., 495492=        In May 2011, F.W. Cook conducted an analysis of competitive pay levels for the executive officers named in the most recently filed proxy statements of the peer group companies versus corresponding positions at our company. Competitive data generally reflected actual amounts paid for 2010 performance, although some information was available on 2011 target compensation levels. Findings from this analysis indicated that base salaries for our NEOs generally approximated the median of the peer group. Target annual cash compensation (base salary plus target annual bonus) was near the 25th percentile for Messrs. Best, Ottoson, and Pursell, and between the 25th percentile and median for other named executives. Target total direct compensation (base salary, plus target bonus, plus long-term incentive compensation) was near the 25th percentile for Mr. Best and approximated the peer group median for the other NEOs. This analysis excluded amounts paid in connection with our NPP because those amounts are earned compensation from prior years' grants., 1033728=        In addition to the requirements of Rule 14a-8, and as more specifically provided for in our By-Laws, in order for a nomination of persons for election to the Board or a proposal of business to be properly brought before the 2013 Annual Meeting of Stockholders, it must be either specified in the notice of the meeting given by our Corporate Secretary or otherwise brought before the meeting by or at the direction of the Board or by a stockholder entitled to vote and who complies with the notice procedures set forth in our By-Laws. A stockholder making a nomination for election to the Board or a proposal of business for the 2013 Annual Meeting of Stockholders must deliver proper notice to our Corporate Secretary not earlier than the close of business on the 105th day prior to the first anniversary of the date of the 2012 Annual Meeting nor later than the close of business on the 75th day prior to the first anniversary of the 2012 Annual Meeting. In other words, for a stockholder nomination for election to the Board or a proposal of business to be considered at the 2013 Annual Meeting of Stockholders, it should be properly submitted to our Corporate Secretary no earlier than February 7, 2013 and no later than March 9, 2013. If the date of our 2012 Annual Meeting of Stockholders changes by more than 20 days before or after May 25, 2012, then stockholder nominations and proposals must be received not earlier than the close of business on the 105th day prior to the date of the 2013 Annual Meeting of Stockholders and not later than the close of business on the later of the 75th day prior to the date of the 2013 Annual Meeting of Stockholders or, if the first public announcement of the date of the 2013 Annual Meeting of Stockholders is less than 85 days prior to the date of the meeting, the 10th day following the day on which public announcement of the date of the 2013 Annual Meeting of Stockholders is first made by us. For additional information about stockholder nominations and proposals, see \"Corporate Governance\u0097Director Nomination Process.\", 617617=        Pursuant to his employment agreement, Mr. Best received upon the commencement of his employment in June 2006 an award of 20,000 shares of restricted stock, a $50,000 cash bonus, and the opportunity to earn 20,000 RSUs over the next four years. Of the 20,000 RSUs, 5,000 RSUs vested in four equal annual installments beginning the first quarter of 2007, based on continued employment; 10,000 RSUs vested in four equal annual installments if annual net asset value growth exceeded 10%, and 5,000 RSUs vested in four equal annual installments if annual net asset value growth exceeded 15%. Mr. Best earned 1,250 RSUs in each of March 2007, February 2008, February 2009, and February 2010 associated with the service component of the award. Under the performance element of the award, Mr. Best earned 2,500 RSUs based on the results for 2007, but he did not earn any RSUs based on the results for 2006, 2008, and 2009, as our net asset value growth did not exceed 10%., 548973=        Production Volume\u0097The production volume target represents the volume of oil and gas estimated by our 2011 business plan to be produced and sold during 2011. This measure is important because proceeds from the sale of production volumes generate essentially all of our revenue. In 2011, our production volume exceeded the target by 17% and all five of our regions also exceeded their production targets for the year., 315596=        If you receive a single set of proxy materials as a result of householding and you would like to receive a separate copy of our Notice of Internet Availability, 2011 Annual Report or Proxy Statement, please submit a request to our Corporate Secretary at 1775 Sherman Street, Suite 1200, Denver, Colorado 80203 or call (303) 861-8140, and we will promptly send you what you have requested. You can also contact our Corporate Secretary at the address and phone number above if you receive multiple copies of our proxy materials and you would prefer to receive a single copy in the future, or if you would like to opt out of householding for future mailings. Beneficial owners can request information about householding from their bank, broker, or other nominee., 532716=        In order for the STIP bonus pool to be funded for executive officers, the 2011 STIP required that our 2011 cash flow, as described below, exceed a threshold level of $350 million. If our cash flow had not exceeded the threshold level, no STIP bonus would be paid regardless of the results of any other metric. Our actual cash flow was $865 million, resulting in full initial funding of the STIP bonus pool for executive officers. The Compensation Committee then examined our performance under five quantitative and two qualitative metrics to determine actual bonus payments to executive officers by reducing (but not increasing) the amounts funded through achievement of the cash flow threshold. Using this construct, bonus payments to our executive officers under the STIP are intended to be \"performance-based,\" as defined under Section 162(m) of the IRC, and therefore fully deductible for federal income tax purposes. The Compensation Committee evaluated our performance in the, 837398=2011 Option Exercises and Stock Vested, 435549=        We began granting PSUs under the Equity Plan to eligible officers and key employees on August 1, 2008., 387584=        The following table shows beneficial ownership of shares of our common stock as known by us as of March 15, 2012, by all beneficial owners of more than 5% of the outstanding shares of our common stock as of March 15, 2012, by each director, director nominee, and named executive officer, and all directors and executive officers as a group. Restricted stock units and performance share units are not included in this table as no actual shares have been issued with respect to our outstanding restricted stock units and performance share units. A supplemental table has been included later in this section describing the number of restricted stock units and performance share units owned by the individuals described below., 524096=        The STIP is designed to reward executives for their achievement of our annual business plan measured by certain performance objectives. These performance objectives are reviewed each year by management and the Compensation Committee, and after the approval of these objectives, are published as annual goals. These goals may be adjusted from time to time during the year due to significant changes in our business in the discretion of the Compensation Committee. For example, due to the transition in 2011 from reporting our production on a two-stream basis (oil and gas) to reporting our production on a three-stream basis (oil, gas and natural gas liquids), the Compensation Committee adjusted the goals for production volume, proved developed reserves and finding and development costs. Payments under the STIP are in the form of annual cash bonuses under our Cash Bonus Plan, which was approved by our stockholders in May 2008., 239140=April 13, 2012, 550661=        Cash Flow\u0097Our cash flow target is calculated based on our GAAP net income, as adjusted for miscellaneous gains and losses; depreciation, depletion and amortization; impairment and abandonment expense; exploration expense; deferred taxes; change in NPP liability; stock compensation expense; non-cash interest expense and unrealized derivative losses. This measure is important because our cash flow is the primary source of funding for our ongoing capital program and working capital needs, as well as a key factor in shareholder value creation. In 2011, our cash flow exceeded the 2011 business plan target by 29% due to higher than projected production volumes and lower than projected operating costs., 1003624=PROPOSAL 2\u0097RATIFICATION OF THE APPOINTMENT OF DELOITTE & TOUCHE LLP AS OUR INDEPENDENT REGISTERED PUBLIC ACCOUNTING FIRM FOR 2012, 286247=2011 Annual Report, 462218=        In 2011, our strong financial and operational performance significantly advanced our goal of long-term stockholder value creation. We exceeded our STIP annual targets with respect to four out of five quantitative metrics:, 1037824=        We filed our Annual Report on Form 10-K for the fiscal year ended December 31, 2011, with the SEC. It is available free of charge at the SEC's web site at www.sec.gov. Upon written request by a stockholder, we will mail, without charge, a copy of the Form 10-K, including the financial statements and financial statement schedules, but excluding exhibits to the Form 10-K. Exhibits to the Form 10-K are available upon payment of a reasonable fee, which is limited to our expenses in furnishing the, 470452=        On May 25, 2011, we held our 2011 Annual Meeting of Stockholders. At that meeting, our stockholders were provided the opportunity to cast non-binding advisory votes on (a) the compensation of our NEOs, and (b) the frequency with which our stockholders should be provided the opportunity to vote on the compensation of our NEOs in the future. Over 99% of votes cast by stockholders at the meeting were voted to approve the compensation of our NEOs, following the recommendation of our Board, and approximately 67% of votes cast were voted in favor of a one-year frequency for future advisory votes on compensation. Consistent with these results, our Compensation Committee applied a, 522859=        The salary increases approved in 2011 were based on the Compensation Committee's decision that our executive officers' individual performances, corporate performance, industry inflation, and the competitive aspects of the oil and gas industry justified the increases with individual adjustments, 897756=        We entered into an employment agreement with Mr. Best dated May 1, 2006. When his employment commenced, Mr. Best received an award of 20,000 shares of restricted stock, which vested immediately and was not subject to forfeiture, and a $50,000 cash bonus. Over the first four years of the agreement, Mr. Best was able to earn RSUs in varying amounts, earning in the first quarter of each year 1,250 RSUs if he was employed by us at that time, and an additional 2,500 RSUs if the net asset value growth from the prior year exceeded 10%, with a further 1,250 RSUs if such growth exceeded 15%. Mr. Best earned 1,250 RSUs in March 2007, February 2008, February 2009 and February 2010, associated with the service component of his award. Mr. Best earned 2,500 RSUs under the performance element of his employment agreement based on the results for 2007; however, he did not earn the performance based component of his employment agreement based on the results for 2009, 2008, or 2006. Mr. Best participates in the fringe benefits and other benefit plans and practices of ours in the same manner and to the same comparable extent as our other senior executives., 328246=        The Board welcomes questions or comments about our company and its operations. Interested parties and stockholders may contact the Board as a whole, non-management directors, or any one or more specified individual directors by sending a letter to the intended recipients' attention in care of SM Energy Company, Corporate Secretary, 1775 Sherman Street, Suite 1200, Denver, CO 80203. All such communications will be forwarded to the Chair of the NCG Committee, who shall facilitate the review of such communications., 614301=        Our 401(k) plan is a defined contribution plan also intended to be qualified under the IRC and subject to the Employee Retirement Income Security Act of 1974. The 401(k) plan allows eligible employees to contribute up to 60% of their income on a pretax basis through contributions to the 401(k) plan, subject to annual limits to amounts determined by IRC regulations ($16,500 for 2011). We match each employee's contributions in cash on a dollar for dollar basis, up to 6% of the employee's pretax income. Company contributions vest over an employee's first five years of employment., 1042182=April 13, 2012, 1054469=PLEASE FOLD ALONG THE PERFORATION, DETACH AND RETURN THE BOTTOM PORTION IN THE ENCLOSED ENVELOPE. Important Notice Regarding the Availability of Proxy Materials for the Annual Meeting of Stockholders to be held May 23, 2012. The Proxy Statement and our 2011 Annual Report on Form 10-K are available at: http://www.proxyease.com/sm-energy/2012. Proxy \u0097 SM Energy Company 1775 Sherman Street, Suite 1200 Denver, Colorado 80203 This proxy is solicited on Behalf of the Board of Directors For the Annual Meeting of Stockholders on May 23, 2012. The undersigned hereby appoints A. Wade Pursell, David W. Copeland, and Brent A. Collins, or any of them, each with the power to appoint his substitute, as proxies for the undersigned to vote all shares of SM Energy Company common stock which the undersigned is entitled to vote at the Annual Meeting of Stockholders to be held on May 23, 2012, and at any reconvened meeting after any adjournment thereof, as directed on the matters referred to on the reverse side and at their discretion on any other matters that may properly be presented at the meeting. This proxy when properly executed will be voted in the manner directed by the undersigned stockholder. If this proxy is properly executed but no voting direction is given, this proxy will be voted \u0093FOR\u0094 all director nominees in Proposal 1 and \u0093FOR\u0094 Proposals 2 and 3. This proxy also confers discretionary authority to the proxies to vote on any other matters that may properly be presented at the meeting. As of the date of the accompanying proxy statement, SM Energy Company\u0092s management did not know of any other matters to be presented at the meeting. If any other matters are properly presented at the meeting, this proxy will be voted in accordance with the recommendations of SM Energy Company\u0092s management., 321861=        In making its determination as to Mr. Quintana's independence, the Board considered our relationship with Tesco Corporation (\"TESCO\"), which is discussed in more detail in the \"Related Person Transactions\" section below. In 2006, we entered into an agreement with TESCO for which Mr. Quintana serves as an employee, executive officer, and director. Under our agreement, TESCO provides certain drilling and casing technology services to us. In 2011, we paid TESCO $1,029,665, which represented less than 1% of TESCO's total reported 2011 revenues of $513.0 million, and as of March 31, 2012, we had paid TESCO $172,495 for services in 2012. Mr. Quintana had no input or involvement in our selection of TESCO for these services, and our selection was based on TESCO's industry-recognized ability to supply specific high quality tools and services for drilling and casing needs, which are particularly well suited for certain of our operations., 241132=        You will also have the opportunity to hear reports on our operations and to ask questions of general interest. You can find other, more specific, information about the Annual Meeting in the accompanying Proxy Statement. You can find detailed information about our company in our 2011 Annual Report to Stockholders, which consists of our Annual Report on Form 10-K for the fiscal year ended December 31, 2011, and is available on our website, www.sm-energy.com., 508821=        The charts below show the 2011 target total direct compensation mix for our Chief Executive Officer and other NEOs. As the charts illustrate, 88% and 79% of total target compensation for our Chief Executive Officer and other NEOs, respectively, is attributable to the performance-based STIP and LTIP, and thus is variable and tied to performance (i.e., \"at risk\")., 372841=        Our Corporate Governance Guidelines and the Charter of the NCG Committee provide that the NCG Committee is responsible for identifying and recommending directors for nomination by the Board for election as members of the Board. The NCG Committee performed its evaluation and nominating functions during 2011 and early 2012. The NCG Committee selects a nominee based on the nominee's skills, achievements, and experience. As set forth in the director qualification standards included in our Corporate Governance Guidelines and reflected in the discussion below, the Board as a whole should have broad and relevant experience in high-level business policymaking and a commitment to represent the long-term interests of our stockholders. These standards also provide that each director should have experience in positions of responsibility and leadership, an understanding of our business environment, and a reputation for integrity. In addition, the Corporate Governance Guidelines provide that a director who retires or experiences a significant change in his or her professional or business responsibilities, including a change in his or her principal occupation, position or business affiliation, should, if requested by the NCG Committee, be prepared to offer his or her resignation from the Board. Upon tender of a resignation, the NCG Committee and the Board may review the continued appropriateness of Board membership under the circumstances., 925012=        Mr. Sullivan was paid a retainer for his service as non-executive Chairman of the Board of $75,000 for the 2011-2012 annual service period. The retainer was paid in the form of stock on May 26, 2011, which resulted in a grant of 1,122 shares of our common stock. The retainer was in addition to his basic non-employee director compensation., 691993=        Pursuant to our LTIP, and in accordance with the Equity Plan, we granted PSUs and RSUs to our NEOs on July 1, 2011 and September 6, 2011. The Compensation Committee approved these grants on July 1, 2011 and September 6, 2011, respectively. These grants are summarized in the table below., 628150=        The Compensation Committee of SM Energy Company has reviewed and discussed the disclosures contained under \"Compensation Discussion and Analysis\" with management and its compensation consultant and, based on such review and discussions, the Committee recommended to the Board of Directors that the disclosures set forth under the heading \"Compensation Discussion and Analysis\" be included in this Proxy Statement and incorporated by reference into SM Energy Company's Annual Report on Form 10-K for the fiscal year ended December 31, 2011., 1019718=        We paid the following fees to Deloitte & Touche LLP for the audit of the consolidated financial statements and for other services provided in the years ended December 31, 2011, and 2010. All services and fees, including tax service fees, were pre-approved by the Audit Committee., 610214=        Prior to 2008, our long-term incentive program for executives and key employees consisted of the NPP and an RSU program. The NPP was designed to reward the contributions made by our executive officers and key employees to our long-term financial success. Under the NPP, participants shared in the net profits derived from the investment made in all oil and gas activity from a specific pool of our properties in a given year after the capital costs associated with spending program were recouped., 1017042=        Based on the reviews and discussions referred to above, the Audit Committee recommended to the Board that the audited consolidated financial statements of SM Energy Company be included in SM Energy Company's Annual Report on Form 10-K for the year ended December 31, 2011., 1010402=\"RESOLVED, that the stockholders approve, on an advisory basis, the compensation philosophy, policies and procedures and the compensation of the named executive officers as disclosed in the Proxy Statement for SM Energy Company's 2012 Annual Meeting of Stockholders pursuant to the compensation disclosure rules of the Securities and Exchange Commission, including under the \"Compensation Discussion and Analysis\" section, and in the Summary Compensation Table and the other related tables and disclosures in the Proxy Statement.\", 927674=2011 Director Compensation, 1047716=Proxy \u0097 SM Energy Company 1775 Sherman Street, Suite 1200 Denver, Colorado 80203 This proxy is solicited on Behalf of the Board of Directors For the Annual Meeting of Stockholders on May 23, 2012. The undersigned hereby appoints A. Wade Pursell, David W. Copeland, and Brent A. Collins, or any of them, each with the power to appoint his substitute, as proxies for the undersigned to vote all shares of SM Energy Company common stock which the undersigned is entitled to vote at the Annual Meeting of Stockholders to be held on May 23, 2012, and at any reconvened meeting after any adjournment thereof, as directed on the matters referred to on the reverse side and at their discretion on any other matters that may properly be presented at the meeting. This proxy when properly executed will be voted in the manner directed by the undersigned stockholder. If this proxy is properly executed but no voting direction is given, this proxy will be voted \u0093FOR\u0094 all director nominees in Proposal 1 and \u0093FOR\u0094 Proposals 2 and 3. This proxy also confers discretionary authority to the proxies to vote on any other matters that may properly be presented at the meeting. As of the date of the accompanying proxy statement, SM Energy Company\u0092s management did not know of any other matters to be presented at the meeting. If any other matters are properly presented at the meeting, this proxy will be voted in accordance with the recommendations of SM Energy Company\u0092s management. Electronic Delivery of Future Proxy Materials If you would like to reduce the costs incurred by us in mailing proxy materials, you can consent to receiving all future proxy statements, proxy cards and annual reports electronically via e-mail or the Internet. To sign up for electronic delivery, please follow the instructions on the front of this card to vote using the Internet and, when prompted, indicate that you agree to receive or access proxy materials electronically in future years. Important Notice Regarding the Availability of Proxy Materials for the Annual Meeting of Stockholders to be held May 23, 2012. The Proxy Statement and our 2011 Annual Report on Form 10-K are available at: http://www.proxyease.com/sm-energy/2012. IF YOU HAVE NOT VOTED VIA THE INTERNET OR TELEPHONE, FOLD ALONG THE PERFORATION, DETACH AND RETURN THE BOTTOM PORTION IN THE ENCLOSED ENVELOPE., 346910=        As a result of the NCG Committee's annual review of the membership of each committee of the Board, the NCG Committee recommended certain changes to the membership of the Audit Committee, the Compensation Committee and the NCG Committee. The Board approved and adopted these changes, effective as of January 1, 2012., 294694=        Only stockholders of record at the close of business on the record date, March 26, 2012, are entitled to receive notice of the Annual Meeting and to vote shares of our common stock held on that date. As of March 26, 2012, there were 64,149,203 shares of our common stock issued and outstanding,, 619851=compensation assurances in the event of an executive's termination without cause, death, or incapacity have become common practice, especially when recruiting executives to join a new company. The post-termination payment provisions in our employment agreement with Mr. Best were an important factor in our ability to recruit Mr. Best to join us as President and Chief Operating Officer in 2006. We believe that the two-year period for post-employment compensation and insurance protection is appropriate to allow Mr. Best adequate time to obtain comparable employment in the event of a termination, and is reasonable in view of the terms offered by other companies in our industry who compete with us for executive talent., 288891=SM Energy Company 1775 Sherman Street, Suite 1200 Denver, Colorado 80203 (303) 861-8140, 967471=        Our directors are elected annually. At the Annual Meeting, eight directors are to be elected to serve for one year or until their successors are elected and qualified. Based on the recommendations of the NCG Committee, the Board has nominated the following individuals for re-election as directors to serve until the 2013 Annual Meeting of Stockholders and until their successors have been elected and qualified, or until their earlier resignation or removal:, 1036025=        Under Rule 14a-4(c) of the Exchange Act, the Board may exercise discretionary voting authority under proxies solicited by it with respect to any matter properly presented by a stockholder at the 2013 Annual Meeting of Stockholders that the stockholder does not seek to have included in our proxy statement if (except as described in the following sentence) the proxy statement discloses the nature of the matter and how the Board intends to exercise its discretion to vote on the matter, unless we are notified of the proposal on or before February 28, 2013, and the stockholder satisfies the other requirements of Rule 14a-4(c)(2). If we first receive notice of the matter after February 28, 2013, and the matter nonetheless is permitted to be presented at the 2013 Annual Meeting of Stockholders, the Board may exercise discretionary voting authority with respect to the matter without including any discussion of the matter in the proxy statement for the meeting. We reserve the right to reject, rule out of order or take other appropriate action with respect to any proposal that does not comply with the requirements described above and other applicable requirements., 738316=Outstanding Equity Awards at 2011 Fiscal Year-End, 247139=SM Energy Company 1775 Sherman Street, Suite 1200 Denver, Colorado 80203, 611577=        Certain of our executives participate in NPP pools that contribute significantly to their yearly realized compensation; however, due to attrition, not all executives participate in NPP pools, and certain executives that do participate have not received compensation because the NPP pools in which they participate have not reached payout status. Mr. Veatch is the only NEO that received NPP payments during 2011, with $309,131 paid to him. Two other NEOs participate in certain NPP pools, but currently receive no compensation since such pools have not reached payout status., 899721=        Based on Mr. Best's annual salary and level of insurance benefits in effect as of December 31, 2011, the total amount of cash payments that would have been made to Mr. Best for a period of two years after a termination on December 31, 2011, would have been $1,160,000, and the estimated value of insurance benefits to be paid over such period would have been approximately $43,660., 239722=        At the Annual Meeting, you and the other stockholders of record on March 26, 2012, will vote on:, 247616=        The 2012 Annual Meeting of Stockholders of SM Energy Company is to be held in the J.D. Hershner Room of Wells Fargo Bank located at 1700 Lincoln Street, Denver, Colorado, on Wednesday, May 23, 2012, at 3:30 p.m. local time. The purposes of the Annual Meeting are to:, 344935=Number of meetings held in 2011, 1015905=        In connection with these responsibilities, the Audit Committee reviewed and discussed with management and the independent registered public accounting firm the audited consolidated financial statements of SM Energy Company for the year ended December 31, 2011. The Audit Committee also discussed with the independent registered public accounting firm the matters required to be discussed by Statement on Auditing Standards No. 61, Communication with Audit Committees, as adopted by the Public Company Accounting Oversight Board in Rule 3200T. In addition, the Audit Committee received the written disclosures and the letter from the independent registered public accounting firm required by applicable requirements of the Public Company Accounting Oversight Board regarding the independent registered public accounting firm's communications with the Audit Committee concerning independence, and the Audit Committee discussed with the independent registered public accounting firm that firm's independence., 329108=        Our Board met 11 times during 2011. Each incumbent director participated in at least 90% of the Board meetings and 100% of his or her appointed committee meetings held during the director's tenure on the Board in 2011. It is our policy that each director is expected to attend the annual meeting of our stockholders, and each director attended the 2011 Annual Meeting of Stockholders., 224923=Proxy Statement Pursuant to Section 14(a) of the Securities Exchange Act of 1934 (Amendment No.          ), 469768=        With the exception of a supplemental executive retirement plan (the \"SERP\"), which is intended to provide benefits similar to those received by all employees but with respect to income above the Internal Revenue Code (\"IRC\") limit, the benefits provided to the NEOs are the same as those provided to all employees. Supplemental executive benefits, including disability and life insurance, were discontinued in July 2010., 960082=5/27/2010, 1003995=        Our stockholders are being asked to ratify the appointment by the Audit Committee of Deloitte & Touche LLP as our independent registered public accounting firm for 2012. Deloitte & Touche has served as our independent registered public accounting firm since 2001, and the Audit Committee plans to engage Deloitte & Touche to perform the audit of our financial statements as of and for the year ending December 31, 2012., 554400=The Compensation Committee viewed our performance with respect to our qualitative metric for exploration success and inventory growth as neutral, with substantial increases in acreage acquired, but with fewer exploration tests than expected. Accordingly, the Compensation Committee gave no credit, either positively or negatively, for this qualitative measure in 2011., 1051412=Using a black ink pen, mark your votes with an X as shown in this example. Please do not write outside the designated areas. X 01GARB 1 U PX + PLEASE FOLD ALONG THE PERFORATION, DETACH AND RETURN THE BOTTOM PORTION IN THE ENCLOSED ENVELOPE. + A Proposals \u0097 The Board of Directors recommends a vote FOR all the nominees listed and FOR Proposals 2 and 3. Authorized Signatures \u0097 This section must be completed for your vote to be counted. \u0097 Date and Sign Below B Please sign exactly as name(s) appears hereon. Joint owners should each sign. When signing as attorney, executor, administrator, corporate officer, trustee, guardian, or custodian, please give full title. Signature 1 \u0097 Please keep signature within the box. Signature 2 \u0097 Please keep signature within the box. Date (mm/dd/yyyy) \u0097 Please print date below. Annual Meeting Proxy Card IMPORTANT ANNUAL MEETING INFORMATION For Against Abstain 1. The Nominating and Corporate Governance Committee of the Board of Directors has nominated the below eight persons to stand for election as directors. As of the date of the accompanying proxy statement, no one has been nominated to serve as director other than the nominees listed below. 2. The proposal to ratify the appointment by the Audit Committee of Deloitte & Touche LLP as our independent registered public accounting firm for 2012. For Against Abstain 3. To approve, on a non-binding advisory basis, the compensation of our Company\u0092s named executive officers, as disclosed in the accompanying Proxy Statement. 01 - Barbara M. Baumann 04 - Stephen R. Brand 07 - John M. Seidl 02 - Anthony J. Best 05 - William J. Gardiner 03 - Larry W. Bickle 06 - Julio M. Quintana For Against Abstain For Against Abstain 08 - William D. Sullivan For Against Abstain 1 3 5 3 8 3 2, 959011=3/21/2011, 854512=        Our Qualified Pension Plan is a qualified, noncontributory defined benefit plan, which is available to substantially all employees. In addition, we sponsor the SERP to provide an equivalent benefit on earnings above the qualified plans IRC limits (the 2011 limit was $245,000) for certain executive officers with a senior management hierarchy title of at least Vice President. The SERP is an unfunded, non-qualified plan., 465747=        Our strong overall performance influenced the Compensation Committee to pay actual 2011 bonuses for the NEOs substantially above their target bonus amounts., 608782=in the form of stock based awards and other forms of ownership in our company) of our long term incentive compensation system compared to peer companies, input from F. W. Cook on expected trends in FVT for 2011, and shares available in the Equity Plan. The 2011 PSUs and RSUs have a three-year vesting schedule, with one-seventh vesting on the first anniversary of the award date, two-sevenths vesting on the second anniversary of the award date, and the remaining four-sevenths vesting on the third anniversary of the award date. We settle the RSUs with shares of our common stock as they vest. If an employee is terminated, voluntarily or involuntarily, prior to the third anniversary of the award date, he/she will retain all shares of common stock previously issued by us to settle the RSUs as they vest, but will forfeit all unvested RSUs. No settlement of vested PSUs occurs until the three-year performance period is concluded. However, if an employee is terminated, voluntarily or involuntarily, he/she retains vested PSUs, which would be settled at the end of the three-year performance period. All PSUs granted are also subject to a cap in value per unit calculated based on an absolute TSR of 50% for each year and an assumed multiplier of 2.0., 837520=        The following table provides information concerning the exercise of stock options and the vesting and settlement of RSUs and PSUs on an aggregated basis during calendar year 2011 for each NEO. All such stock options were granted under our Predecessor Plans described in this Proxy Statement. In May 2003, the Board amended the stock option plans to prohibit any repricing of outstanding options that would reduce the exercise price without stockholder approval. In 2004, our use of stock options was replaced by the use of RSUs under a performance based plan. We implemented the LTIP in its current form in 2008, and pursuant to that program we now grant PSUs and RSUs., 314315=        We have adopted a procedure approved by the SEC called \"householding.\" Under this procedure, stockholders of record who have the same address and last name will receive only one copy of our Notice of Internet Availability, 2011 Annual Report, and Proxy Statement until such time as one or, 482473=        In 2011, the Compensation Committee met nine times to review and administer the matters noted above and other related matters., 433691=        We began issuing RSUs on June 30, 2004, to eligible officers and key employees following the approval of our Restricted Stock Plan by our stockholders. Grants of RSUs were made annually under the Restricted Stock Plan in 2004 and 2005. In 2006 and 2007, RSU grants were made under our stockholder approved Equity Incentive Compensation Plan (the \"Equity Plan\"), subject to our performance criteria. These grants were made in the first quarter immediately following each year-end. In June 2008, we issued certain transitional RSUs in connection with the cessation of the Net Profits Interest Bonus Plan (\"NPP\"), and on August 1, 2009, as part of our Long Term Incentive Plan (\"LTIP\") under the Equity Plan, we issued a percentage of that year's awards as RSUs. In both 2010 and 2011, we also issued RSUs as part of our LTIP awards. Neither the transitional RSUs nor the LTIP RSU awards were subject to performance criteria. We have also issued RSUs to Mr. Best under the terms of his employment contract., 290046=        This Proxy Statement contains information about the 2012 Annual Meeting of Stockholders (the \"Annual Meeting\") of SM Energy Company to be held in the J.D. Hershner Room of Wells Fargo Bank located at 1700 Lincoln Street, Denver, Colorado, on Wednesday, May 23, 2012, at 3:30 p.m. local time. Our Board of Directors (\"Board\") is using this Proxy Statement to solicit proxies for use at the Annual Meeting. In this Proxy Statement, the terms \"we,\" \"us,\" and \"our\" refer to SM Energy Company, inclusive of its subsidiaries., 330789=        The following table identifies the members of each committee, as of December 31, 2011, and sets forth the number of meetings held in 2011:, 329609=        Our Board has an Audit Committee, a Nominating and Corporate Governance Committee, a Compensation Committee, and an Executive Committee. Our Board and each of its committees, other than our Executive Committee, which did not meet during 2011, separately evaluated their respective, 285428=Stockholder Proposals for the 2013 Annual Meeting of Stockholders, 323549=        Since February 2007, our Board's leadership structure has separated the roles of Chief Executive Officer and Chairman of the Board. Mr. Sullivan, an independent director with over eight years' experience serving on the Board, experience serving on several other public company boards, and over 30 years of experience working with oil and gas exploration and production companies, including as an executive officer, serves as our Chairman of the Board, and Anthony J. Best serves as our Chief Executive Officer., 486313=        Each year, the Compensation Committee performs a compensation risk assessment. In 2010 and again in 2011, the Compensation Committee has determined that risks arising from our compensation policies and practices for our employees are not reasonably likely to have a material adverse effect on us. The Compensation Committee conducts an annual review and evaluation of our compensation policies and practices for all employees to determine whether and to what extent, if any, our policies and practices of compensating our employees could result in risk taking incentives, and whether risks arising from our compensation policies and practices for our employees are reasonably likely to have a material adverse effect on us. In its most recent review and evaluation, the Compensation Committee considered a compensation risk assessment performed by F.W. Cook, in addition to its annual review of our compensation policies and practices. F.W. Cook and the Compensation Committee determined that our compensation policies and practices do not encourage behaviors that would create a material risk to us., 962272=5/21/2009, 489903=peer companies include standard measures such as revenues, assets, number of employees, and enterprise value, as well as several industry-specific criteria such as annual production volume, fiscal year-end reserves, total costs incurred in oil and gas activities, and the magnitude of each company's offshore and non-U.S.-based operations. Based upon these criteria, F. W. Cook, with input from the Compensation Committee, develops a peer group for us that includes the 15-20 companies that best fit the established selection criteria, without reviewing individual company salary data, and excludes companies from a peer group for a prior year that no longer satisfies one or more of F.W. Cook's selection criteria. The peer group used for 2011 compensation comparisons was approved in July 2010 and consisted of the following companies:, 316988=    The Notice of Annual Meeting of Stockholders, the Proxy Statement for the 2012 Annual Meeting of Stockholders, and the 2011 Annual Report to Stockholders, which includes the Annual Report on Form 10-K for the fiscal year ended December 31, 2011, are available at http:// www.proxyease.com/sm-energy/2012, 1039438=        Management does not know of any matters other than the election of directors, the ratification of the appointment by the Audit Committee of Deloitte & Touche LLP as our independent registered public accounting firm for 2012 and the advisory vote to approve the compensation of our named executive officers to be brought before the Annual Meeting. If any other matters not mentioned in this Proxy Statement are properly brought before the Annual Meeting, the individuals named in the enclosed proxy intend to use their discretionary voting authority under the proxy to vote the proxy in accordance with their best judgment on those matters., 573376=2011 PAYOUT MATRIX, 551482=        Net Income\u0097The GAAP net income target represents the amount of GAAP net income initially expected to be generated based on achieving projected 2011 business plan results. Net income is the end result of adjusting the operating cash flow of our company for all non-cash costs and non-recurring events. This measure is important because the rate at which non-cash costs are incurred is related to investment efficiency over time, and non-recurring events can be materially positive or negative relative to expectations. In 2011, our net income was less than our target by approximately 7%, primarily due to impairments driven by end-of-year gas prices, which broadly affected our industry., 1032861=STOCKHOLDER PROPOSALS FOR THE 2013 ANNUAL MEETING OF STOCKHOLDERS, 607628=        The total number of PSUs and RSUs awarded and individual allocations to participants were approved by the Compensation Committee during the third quarter of 2011. A total of 356,947 PSUs and RSUs were granted to 367 employees during the third quarter of 2011. In its determination of the total pool value for 2011, the Compensation Committee considered various factors including historical fair value transfer (\"FVT,\" or the percentage of market capitalization transferred to employees annually, 617272=        Mr. Best is the only executive that has a written employment agreement. Mr. Best's employment agreement became effective May 1, 2006, and continues in effect until either party gives 30-days' prior written notice., 249475=        Only stockholders of record at the close of business on March 26, 2012, may vote at the Annual Meeting., 471797=similar compensation philosophy when setting 2012 executive compensation and our Board determined to conduct annual advisory votes on compensation in the future., 290743=        The proxy materials, including this Proxy Statement, a proxy card or voting instruction card, and our 2011 Annual Report to Stockholders, which consists of our Annual Report on Form 10-K for the fiscal year ended December 31, 2011 (\"2011 Annual Report\"), are being distributed and made available on or about April 13, 2012. In accordance with rules and regulations adopted by the U.S. Securities and Exchange Commission (the \"SEC\"), we are furnishing our proxy materials to many beneficial owners of our stock via the Internet. A Notice of Internet Availability of Proxy Materials (the \"Notice\") will be mailed by intermediaries on or about April 13, 2012, to beneficial owners of our stock. Stockholders will have the ability to access the proxy materials on a website referred to in the Notice or request that we send them a printed set of the proxy materials by following the instructions in the Notice. The Notice will also provide instructions on how to vote your shares. The proxy materials are being mailed to all stockholders of record on or about April 13, 2012., 377389=        As noted above, the NCG Committee will consider stockholder recommendations for candidates for the Board. All stockholder recommendations must comply with the notice requirements contained in Section 4(g) of our By-Laws, which requires, among other things, detailed information concerning the stockholder making the proposal (and the beneficial owner on whose behalf the proposal is made, if any), the name and address of the stockholder and specific information concerning such stockholder's interests in our securities. In addition, the notice must include the recommended candidate's name, biographical data, qualifications, details regarding any material monetary agreements between the stockholder and the proposed nominee and a written questionnaire completed by the proposed nominee. We will furnish copies of our By-Laws to any person who requests them without charge. Requests for copies should be directed to our Corporate Secretary. For additional information about stockholder nominations, including nominations for the 2012 Annual Meeting of Stockholders, see \"Stockholder Proposals for the 2012 Annual Meeting of Stockholders.\" No stockholder director nominations were received in connection with the Annual Meeting., 330534=performance for 2011 and completed written evaluations. The performance evaluation process was directed by the NCG Committee and the evaluations were discussed and accepted by the Board., 631064=        In addition to base salaries and cash bonuses, the following table reflects RSUs and PSUs granted in 2009, 2010, and 2011 to our NEOs. Eligible NEOs participate in our STIP and LTIP, as described more fully in the \"Compensation Discussion and Analysis\" section of this Proxy Statement., 511222=        Base salary is intended to provide a foundation of executive compensation that recognizes the level of responsibility and authority of each individual executive and compensates for the individual executive's day to day contributions to our success. Based on competitive market data, individual performance and potential, internal equity considerations, and input from the Chief Executive Officer (for executives other than himself), the Compensation Committee approved the following salary adjustments on March 31, 2011, effective April 3, 2011, for the NEOs:, 326139=        In addition to having an independent Chairman of the Board, the Board has a separate lead independent director position, which is Mr. Bickle, who assumed such role on January 1, 2012, upon our Board's appointment of him as Chair of its NCG Committee. The lead independent director is responsible for presiding at executive sessions of non-management directors, which typically meet immediately before or after each regularly scheduled meeting of the Board or as deemed necessary. In the lead independent director's absence, the Chairman of the Board serves as lead independent director., 252124=Denver, Colorado April 13, 2012, 630665=Summary Compensation Table for 2009, 2010, and 2011, 874183=        Our Qualified Pension Plan in combination with the SERP for certain executives provide a benefit after 25 years of credited service to us equal to 35% of final average compensation. Final average compensation is the average of the highest three consecutive years of the ten years preceding termination of employment. For each NEO, the level of compensation used to determine benefits payable under the Qualified Pension Plan and the SERP is that officer's average base salary, excluding bonuses. We provide these plans to remain competitive in the hiring and retention of qualified personnel, and to support our succession planning objectives with a goal of providing retirement replacement income. As of December 31, 2011, no NEO was eligible for early retirement under the Qualified Pension Plan, and no NEO was eligible for early retirement (having reached the age of 55 and provided at least 10 years of service to us) under the SERP., 281244=Proposal 2\u0097Ratification of the Appointment of Deloitte & Touche LLP as our Independent Registered Public Accounting Firm for 2012, 525144=        Each STIP participant is assigned a target bonus as a percentage of base salary, based on the pay level that the Compensation Committee deems to be competitive and appropriate assuming all of our performance goals are achieved at the \"target\" level. Actual bonuses may range from 0 to 2 times the target level based on the Compensation Committee's assessment of our performance and that of each of our executive officers. Target bonuses for 2011 as percentages of base salary for the NEOs were the same as in 2010 and were as follows:, 549505=        Proved Developed Reserve Additions\u0097The proved developed reserve additions target represents the proved developed reserves estimated to be added by our capital program during 2011. This measure is important because proved developed reserves are the primary source of future production and cash flow for us and, as such, relate directly to the value of our company. In 2011, we generated 48% more proved developed reserve additions than our target amount or year-to-year growth in our actual performance under this metric of 70%., 247348=NOTICE OF ANNUAL MEETING OF STOCKHOLDERS TO BE HELD WEDNESDAY, MAY 23, 2012, 436305=        The following table shows the number of RSUs and PSUs owned by each of the directors, our named executive officers and all directors and executive officers as a group, as of March 15, 2012. The PSUs listed below represent the right to receive, upon settlement of the PSUs after the completion of the three-year performance periods ending June 30, 2012, June 30, 2013, and June 30, 2014, a number of shares of our common stock that may vary from zero to two times the number of PSUs indicated, which were granted on the respective award dates, depending on the extent to which we have achieved certain performance goals during a certain performance period and the extent to which the PSUs have vested., 553373=Our EHS performance, based on statistical industry measurements, improved in some aspects during 2011; however, we experienced some significant safety challenges in our operational activities where dramatic ramp-up in drilling and completion activity have strained the capabilities of our drilling and completion contractors. As a result, the Compensation Committee exercised its discretion with respect to this qualitative measure in 2011 and reduced the cash bonuses for our NEOs that it would have otherwise approved on the basis of the other quantitative and qualitative measures., 927273=        The following table sets forth the annual and long-term compensation paid during 2011 to our non-employee directors. The stock based component of the compensation reflects the grant date fair value. Cash based compensation is recorded based on the payments to the individual director., 455996=        Based solely on a review of reports furnished to us, and written representations from our officers and directors, all directors, executive officers, and 10% owners timely filed all reports regarding transactions in our securities required to be filed for 2011 under Section 16(a) under the Exchange Act, except that Mr. Pursell inadvertently failed to timely report one transaction involving a charitable gift of 267 shares of our common stock. A Form 4 reporting Mr. Pursell's gift was filed after the error was discovered., 466020=        Our current LTIP uses a combination of service-vesting restricted stock units (RSUs) and performance-based share units (PSUs). We believe these types of long-term incentives appropriately balance risk and reward, because such units have both upside potential and downside risk. The performance measures used in our LTIP balance our absolute total stockholder return, as well as our total stockholder return relative to our peers, over the long-term. We have outstanding stock options, but we discontinued granting stock options to employees after December 2003 and to directors after December 2004. We believe that long-term incentive programs that overemphasize stock options could contribute to both risk-taking and a disproportionate focus on short-term share price increases, especially if stock options become \"underwater\" (i.e., the option exercise price is above the then current share price). Underwater options could arguably encourage executives to take risks in attempts to increase share price; in such cases, options have upside opportunity, but no downside risk., 615911=        The purpose of the Employee Stock Purchase Plan (\"ESPP\") is to provide an opportunity for eligible employees to purchase shares of our common stock at a discount to the market price. The plan cycle consists of two periods annually, with plan periods for the six months ending June 30 and December 31 of each year. The ESPP allows employees to purchase our common stock through payroll deductions of up to 15% of their base compensation. The purchase price of the stock is 85% of the lower of the fair market value of the stock at the beginning or ending of the period. The maximum amount an employee can purchase through the plan is $25,000 per year, pursuant to IRC restrictions. In December 2009, the Board amended the ESPP to limit the number of shares that an employee could purchase in a six-month period to 2,500 shares to comply with final Internal Revenue Service regulations that require a fixed cap for the number of shares that could be purchased during a plan period., 625621=        Equity grants awarded as part of the LTIP and pursuant to the Equity Plan are made during the third quarter of each year. The Compensation Committee generally approves these grants at a meeting each July. The Compensation Committee has in the past, and may in the future, make limited grants of equity on other dates for newly hired executives as part of compensation packages designed to recruit such persons., 483264=        Since 2007, the Compensation Committee has engaged F. W. Cook as its independent executive compensation consultant. F. W. Cook reports directly to the Compensation Committee and the Compensation Committee may replace F. W. Cook or hire additional consultants or other advisors as it deems necessary. A principal of F. W. Cook attends Compensation Committee meetings, as requested, and communicates with the Compensation Committee between meetings. The services F. W. Cook provides include advising the Compensation Committee on the design of our executive compensation programs and the evolving best practices related thereto, providing market information and analysis, 1033148=        Pursuant to the various rules promulgated by the SEC, stockholders interested in submitting a proposal for inclusion in our proxy materials and for presentation at the 2013 Annual Meeting of Stockholders may do so by following the procedures set forth in Rule 14a-8 under the Exchange Act. In general, to be eligible for inclusion in our proxy materials, stockholder proposals must be received by our Corporate Secretary no later than December 15, 2012., 1012214=        The Board has adopted a policy providing for annual advisory votes on executive compensation. Unless the Board modifies this policy, the next advisory vote on compensation following this vote will be held at our 2013 Annual Meeting of Stockholders., 691874=Grants of Plan-Based Awards in 2011, 239329=        You are cordially invited to attend the 2012 Annual Meeting of Stockholders of SM Energy Company, which is to be held in the J.D. Hershner Room of Wells Fargo Bank located at 1700 Lincoln Street, Denver, Colorado, on Wednesday, May 23, 2012, at 3:30 p.m. local time., 316747=IMPORTANT NOTICE REGARDING THE INTERNET AVAILABILITY OF PROXY MATERIALS FOR THE ANNUAL MEETING OF STOCKHOLDERS TO BE HELD ON MAY 23, 2012, 955749=5/26/2011}",
    "textBeforeTable": "Proxy Statement Pursuant to Section 14(a) of the Securities Exchange Act of 1934 (Amendment No.          ) SCHEDULE 14A UNITED STATES SECURITIES AND EXCHANGE COMMISSION Washington, D.C. 20549 Table of Contents Use these links to rapidly review the document TABLE OF CONTENTS Graphic Graphic Graphic Graphic Graphic Graphic Graphic Graphic Graphic Graphic Def 14A Documents found in this filing: SM Energy Co DEF 14A 2012",
    "textAfterTable": "SM Energy Company (Name of Registrant as Specified In Its Charter)   (Name of Person(s) Filing Proxy Statement, if other than the Registrant) Payment of Filing Fee (Check the appropriate box): ý   No fee required. o   Fee computed on table below per Exchange Act Rules 14a-6(i)(1) and 0-11.     (1)   Title of each class of securities to which transaction applies:               (2)   Aggregate number of securities to which transaction applies:               (3)   Per unit price or other",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}