{
    "relation": [
        [
            "All NALP Law Firms",
            "Partners",
            "Associates",
            "Total"
        ],
        [
            "Proportion Women",
            "0.163",
            "0.424",
            "0.307"
        ],
        [
            "Proportion Minorities",
            "0.037",
            "0.143",
            "0.096"
        ],
        [
            "Total Number",
            "49,415",
            "61,141",
            "110,556"
        ]
    ],
    "pageTitle": "Diversity In Law Firms",
    "title": "",
    "url": "http://www1.eeoc.gov/eeoc/statistics/reports/diversitylaw/index.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986423.95/warc/CC-MAIN-20150728002306-00117-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 841692795,
    "recordOffset": 841654602,
    "tableOrientation": "VERTICAL",
    "TableContextTimeStampAfterTable": "{113969=43. Perceptions of Partnership: The Allure and Accessibility of the Brass Ring, National Association of Legal Placement, Foundation for Research and Education, 1999., 95895=Johnson, Alex M., Jr. \"The Underrepresentation of Minorities in the Legal Profession: A Critical Race Theorist's Perspective\", Michigan Law Review Volume 95, pp. 1005-1062, 1997., 119445=This page was last modified on October 22, 2003., 100487=8. For a general discussion of the factors affecting law firm attrition and their changes over time, see Rebecca L. Sandefur, 2003, \"Attrition from the Legal Profession and Mutable Labor Markets for American Lawyers, 1949-2000,\" unpublished manuscript prepared for presentation at the Annual Meetings of the American Sociological Association, Atlanta, Georgia., 95761=Heinz, John P., and Edward O. Laumann, Chicago Lawyers, New York: Russell Sage Foundation and American Bar Foundation, 1982., 51223=One must keep in mind that this simple analysis holds qualifications constant. Associates with ten years experience are handled the same as newly hired associates. Due to the recent increase in women and minorities in the legal profession, one would expect their experiences to be more limited than their White male counterparts. For example, in 1988 the median age (reflecting experience) for male attorneys was 42 but just 34 for women (p. 375).49 Further, it does not account for variations in the frequency of partnership decisions. However, these results are not necessarily inconsistent with empirical research that controls for such factors. For example, Hull and Nelson report that,, 10452=Most studies of legal employment have relied on public data sources or individual interviews with attorneys. With several notable exceptions (e.g., the continuing studies of the Chicago bar14 ), there have been relatively few systematic, large-scale sampling studies of American lawyers. Perhaps the most promising future development is the work currently being done by the After the JD (AJD) study. One of the strengths of the AJD study is the broad range of organizations supporting the project. In addition to the National Science Foundation, the AJD project obtained funding from a number of organizations interested in legal education and the profession, including Access Group, American Bar Foundation, Law School Admission Council, NALP and NALP Foundation, National Conference of Bar Examiners, and the Open Society Institute. The AJD project is based on a two-stage, scientific sampling design that first selects among geographic areas and then selects individual attorneys within those areas. The sample population consists of persons who first became members of a state bar in calendar year 2000 and who graduated from law school in the period July 1, 1998 through June 30, 2000. Approximately 9200 individuals received an initial questionnaire sent in March 2002, and a sample of these - about 20% -- are currently being interviewed face-to-face. Respondents will be re-contacted five and ten years after their admission to the bar. The forthcoming results of the AJD project will provide a rich and unparalleled source of data on attorney careers including first job after law school and all subsequent jobs as well as detailed descriptions of the current job such as partnership status, hours worked, and time devoted to different legal specialties., 105370=18. Charlotte Chiu and Kevin T. Leicht, \"When Does Feminization Increase Equality? The Case of Lawyers,\" 1999 Law and Society Review, vol.33, p. 557-590., 5839=Many studies find that women and minorities are likely to hold jobs in the public sector. For example, Payne and Nelson (2003), in a study of the Chicago bar as of 1995, report that 20.7 percent of white women lawyers were employed by government or the judiciary, compared to 7.6 percent of white men. The percentages for African-American lawyers and Hispanic lawyers in government and the judiciary are even higher, 43.8 percent and 37.5 percent respectively. (See their Table 2-2).5, 98313=Wilkins, David B., and G. Mitu Gulati, \"Why are there so Few Black Lawyers in Corporate Law Firms? An Institutional Analysis\", California Law Review , pp. 493- 618,1996., 7873=The 2003 NALP Foundation Study of entry-level hiring and attrition9 concluded that,, 96506=Leicht, Kevin T., and Mary L. Fennell, Professional Work A Sociological Approach, Malden, Massachusetts: Blackwell Publishers, 2001. Mills, C. Wright, The Power Elite, Oxford University Press, Inc.,1956., 86052=Appendix Table 10 attempts to answer the question, what can the NALP data tell us about the likely distribution of different occupational groups (such as partners, associates, and paralegals) in the EEO-1 professional category. As described earlier, the NALP data reports employment totals for a wide range of occupational groups, but it only reports diversity numbers for selected occupational groups (partners, associates, summer students, and auxiliary attorneys). The EEO-1 survey does not differentiate among different types of professional employees that might be present in law firms. Based on household occupation data from the 2002 Current Population Survey (CPS), we made rough estimates for the missing NALP diversity proportions among non-lawyer professionals and paralegals and then used these NALP diversity estimates to predict the overall diversity proportions among EEO-1 professional employees. Specifically, we proceeded as follows:, 8819=. . . compared male/female differences in earnings 15 years after graduation for two cohorts: (1) men and women who graduated from law school between 1972 and 1978, and (2) men and women who graduated from law school between 1979 and 1985. We find that the gender gap in earnings has remained relatively constant; 15 years after graduation, women in both cohorts earn approximately 60% of men's earnings. Penalties to part-time work and career interruptions11 also remain steady. While within occupation sex segregation has declined over time, sex differences in hours worked have increased and assume a more prominent role in explaining the sex gap in lawyers' earnings (p. 1).12, 95393=Domhoff, William, Who Rules America? Power and Politics in the Year 2000. 3rd Edition. Mountain View: CA: Mayfield Publishing, 1998., 27929=The 2002 NALP summary data on Women and Attorneys of Color at Law Firms20 suggests that law firm size is more strongly related to the percentage of minority associates than the percentage of women associates. The overall percentage of minority associates in the 2002 NALP survey is 14.3 percent which varies from 10.1 percent in law firms with less then 100 attorneys to 16.9 percent in law firms with 501 or more attorneys. The overall percentage of women associates is 42.4 percent which varies from 40.6 percent in firms with less than 100 attorneys to 43.4 percent in firms with 251 to 500 attorneys., 97091=Nelson, Robert L., \"The Futures of American Lawyers: A Demographic Profile of a Changing Profession in a Changing Society\", Case Western Reserve Law Review, Volume 44, pp 345-406, 1994., 21753=In 1982 Hispanics were earning law degrees at a rate (2.3 percent) exceeding their representation as professionals in Legal Services and as attorneys in the general work force. By the end of the period this disparity continues. However, the more interesting change for Hispanics over the last twenty years is their slow but steady growth in the large law firms required to file EEO-1 reports. Although still a relatively small portion of professionals at 2.9 percent, the rate of change over the period was high at 163 percent. This exceeded their growth in obtaining degrees, 148 percent and was much larger than their growth as attorneys in the general work force of 72 percent. See Figure 5., 109308=31. The F-probability values were computed with angular transformations of the proportional diversity values. Angular transformations are designed to achieve a constant error variance, i.e., they reduce the likelihood of a wider range of errors around 0.5 than around 0.01 or 0.99. See, for example, the discussion of variance-stabilizing transformations \"font-family: Times New Roman\">in Michael \"font-family: Times New Roman\">O. Finkelstein and Bruce Levin, Statistics forLawyers, 1990, p. 441., 97814=The Vault. 2002 http://www.vault.com/nr/lawrankings . Wilkins, David B. and G. Mitu Gulau, \"Reconceiving the Tournament of Lawyers: Tracking, Seeding, and Information Control in the Internal Labor Markets of Elite Law Firms\", Virginia Law Review Volume 84, pp. 1581-1705, 1998., 107517=25. The top ten legal markets were estimated by aggregating the number of EEO-1 legal professionals by city and then ranking the cities by the proportion of all legal professionals in the 2002 EEO-1 survey. The top ten cities, encompassing approximately 60 percent of all legal professions in the 2002 EEO-1 survey were New York, Washington, DC, Chicago, Los Angeles, Boston, San Francisco, Philadelphia, Houston, Dallas, and Atlanta., 115910=51. White R., Updated Tables for the 2001-02 AALS Statistical Report Including Revised Historical Data for the 1990-1991 through 2000-01, Association of American Law Schools forthcoming Association of American Law Schools Statistical Report on Law School Faculty and Candidates for Law Faculty Positions, 2001-2002., 25617=This section examines some issues related to firm size and geographic location that can be studied with the 2002 EEO-1 data on professionals in private legal service firms. The basic research problem can be posed as follows. There has been a substantial increase in the size of law firms over the last thirty years. As summarized by Chiu and Leicht (1999), \"Law firms grew dramatically in size and number. In the early 1960s, there were 38 firms with 50 or more lawyers … In 1991, there were 751 firms with more than 50 lawyers and 13% of all lawyers were employed in firms with at least 50 lawyers, up from 5% in 1980\" (p.569).18 Given this growth in the demand for new lawyers and the increased number of women and minorities graduated from law schools, many observers predicted that larger law firms should have a higher proportion of women and minorities than smaller and medium sized law firms. Yet the empirical results are somewhat mixed., 95536=\"Gender Equity in the Legal Profession - A Survey, Observation and Recommendations\", New York State Bar Association. Hagan, John, and Fiona Kay, Gender in Practice, New York: Oxford University Press, 1995., 107110=24. The list of the top 100 law firms, ranked by profits per partner, was taken from The American Lawyer, November 2002. The list of the top 100 law firms, ranked by prestige, was taken from \"The Top 100 Most Prestigious Firms - 2002\". The Vault. 2002. Firms on either list were assigned a value of \"1\", otherwise a value of \"0.\", 44081=An examination of the 2002 EEO-1 data on legal professionals in private law firms has several broad implications for civil rights enforcement. In large, national law firms, the most pressing issues have probably shifted from hiring and initial access to problems concerning the terms and conditions of employment, especially promotion to partnership. In smaller, regional and local law firms, questions about the fairness and openness of hiring practices probably still remain, particularly for minority lawyers. The next section will examine some general characteristics of promotion patterns in large private law firms., 94836=Beckman, Christine M., and Damon J. Phillips. \"Interorganizational Determinants of Promotion: Client Leadership and the Promotion of Women Attorneys\", unpublished manuscript, 2003., 99687=7. There are, however, several major articles with substantial data on minorities. These include the study of the members of the Michigan Law School classes of 1970-96 undertaken by Richard O. Lempert, David L. Chambers, and Terry K. Adams in \"Michigan's Minority Graduates in Practice: The River Runs Through Law School,\" 2000, \"font-family: Shruti\" style=Law and Social Inquiry, pp. 395-505 and the study of the New York University Law School classes of 1987-90 undertaken by Lewis A. Kornhauser and Richard L. Revesz in \"Legal Education and Entry into the Legal Profession: The Role of Race, Gender, and Educational Debt,\" 1995, \"font-family: Shruti\" style=New York University Law Review, vol. 70, pp. 829-964., 95212=Dixon, Jo, and Carroll Seron, \"Stratification in the Legal Profession: Sex, Sector, and Salary\" Law & Society Review Volume 29, Number 3, pp. 381-412, 1995., 25081=Since 1975, the representation of women, African Americans, Hispanics and Asian Americans as professionals in the larger Legal Service firms that are required to file EEO-1 reports has increased substantially. Even greater has been the increase in law degrees earned by minorities. Paralleling the finding regarding increased employment among large law firms are increases in the employment of these groups as attorneys in the general work force., 44937=. . . promotion to partner not only involves the greatest increase in income within the law firm, but the partnership includes membership to a professional elite with access to substantial social and political capital (Nelson 1988). More generally, partners of large corporate law firms are among the elite class in the U.S. (Mills 1956; Smigel 1969; Domhoff 1998). Given the power and influence that accompanies large law firm partnership, women's [and minorities] attainment within law firms has larger societal ramifications for access and opportunities (Hagan and Kay 1995, p. 6).40, 115349=48. Kay, Fiona M. and John Hagan, \"Cultivating Clients in the Competition for Partnership: Gender and the Organizational Restructuring of Law Firms in the 1990's,\" Law and Society Review, 33 (3) 1999, pp. 517-555., 98111=Wilkins, David B, \"Why Global Law Firms Should Care About Diversity: Five Lessons from the American Experience\". European Journal of Law Reform Volume 2 Number 4, pp. 415-438, 2000., 102431=12.Mary C. Noonan, Mary E. Corcoran, and Paul N. Courant, \"Pay Differences Among the Highly Trained: Cohort Differences in the Gender Gap in Lawyers' Earnings,\" unpublished revised manuscript based on presentation at the Population Association of America annual meeting in Atlanta, 2002., 104853=17. Data for women and total for 1982 obtained from 1982 Review of Legal Education, American Bar Assocation and the Law School Admission Council, 1982. Other data regarding total and women degrees conferred from www.abanet.org/legaled/statistics/jd.html. Data regarding minority degrees from www.abanet.org/legaled/statistics/mindegrees.html., 2708=The purpose of this report is to examine the employment status of women and minorities at law firms required to file EEO-1 reports. An employer is required to file an EEO-1 report if it employs 100 or more employees. Therefore, this study covers law firms which would be characterized as medium to large. Specifically, it examines employment status in a general sense to display the changes in the employment of minorities and women as attorneys since 1975. It also looks at the organizational characteristics of firms to explore the variations in the current employment of minorities and women. Finally, a major issue in law firms, the prospect of becoming a partner, is examined empirically to determine the relative likelihood of women and minorities being partners., 14969=In 1975 women represented just 14.4 percent of all professionals in the legal services industry based on their filing of EEO-1 reports. By 2002, this figure increases dramatically to 40.3 percent. See Figure 1. It is interesting to compare these results to the percent of women receiving law degrees and the percent of women lawyers in the entire workforce as reflected in the Current Population Survey. See Figure 2., 119044=59. Readers are reminded that the estimates for the average proportion of women among non-lawyer professionals and paralegals are based on the 2002 CPS data rather than the NALP sample. It also should be noted that the NALP predictions, described above, used the actual diversity numbers for partners and associates in each law firm rather than overall averages., 28554=These relationships are examined in greater detail using the 2002 EEO-1 data.21 The following organizational characteristics of law firms are likely to be important factors and are used in this analysis., 96335=Kay, Fiona, \"Flight from Law: A Competing Risks Models of Departures from Law Firms\", Law & Society Review Volume 31, Number 2, pp. 301-335, 1997., 80219=The next two tables summarize the proportion of women and minorities in the 2002-2003 NALP survey organized by associate and partner attorneys. Appendix Table 6 examines summary data for all firms, while Appendix Table 7 only looks at the sample of NALP reporting firms used in this report., 774=There were parallel increases in J.D. degrees from 1982 to 2002., 97551=Sterling, Joyce S., and Nancy J. Reichman, \"Recasting the Brass Ring,\" Forthcoming in Capital University Law Review. \"The Global 100 Rankings\", The American Lawyer, November 2002 \"The Top 100 Most Prestigious Firms - 2002\"., 96719=Nelson, Robert L., and Laura Beth Nielsen, \"Cops, Counsel, and Entrepreneurs: Constructing the Role of Inside Counsel in Large Corporations\", Law & Society Review Volume 34, Number 2, pp. 457-494, 2000., 97424=Smigel, Erwin O., The Wall Street Lawyer: Professional Organization Man? Bloomington: Indiana University Press,1969., 113507=41. Kay, F. and J. Hagan, \"Cultivating Clients in the Competition for Partnership: Gender and the Organizational Restructuring of Law Firms in the 1990's\", Law and Society Review, vol 33 no. 3, 1999, pp. 517-555., 100886=9. The NALP Foundation for Law Career Research and Education, Keeping the Keepers II: Mobility and Management of Associates, 2003, Washington., 60378=The EEO-1 Survey of Establishments in Private Industry is designed to cover a wide range of industries and job groups. To evaluate the accuracy of the EEO-1 information for law firms, we compared the 2002 EEO-1 data for selected law firms to the 2002-2003 National Association for Law Placement (NALP) Directory of Legal Employers. The analysis in this methodological appendix focuses on two main topics: the extent of agreement or disagreement in estimating the total number of attorneys, and the extent of agreement or disagreement in estimating the proportion of women and minorities. In particular, we compare the EEO-1 professional job group for legal services establishments to the NALP data on attorneys, paralegals, and other professionals. Before examining the results, we briefly summarize the instructions provided to EEO-1 and NALP respondents., 97296=Schultz, Ulrike, and Gisela Shaw ed., Women in the World's Legal Professions. Portland, Oregon: Hart Publishing, 2003., 115612=49. See Nelson R.,1988, cited above., 114173=44. NALP 2002-2003, Directory of Legal Employers, National Association of Legal Placement, 2002., 98512=1. Hagan J. and F. Kay, Gender in Practice: A Study of Lawyers' Lives, New York: Oxford Press, 1995, p. 3., 12936=Three different data sources are used to examine how the employment of women and minorities in the legal professional has changed over time. These three data sets provide different perspectives on the employment of attorneys. The Equal Employment Opportunity Commission's (EEOC's) own EEO-1 report is used to reflect employment in large private law firms. Private employers with 100 or more employees are required to file annual EEO-1 reports with EEOC. They are also required to file separate reports for each of their establishments with 50 or more employees. By and large when companies in the Legal Services industry file such reports the professional job group provides a fairly representative index of diversity among associate attorneys.15 Due to the filing threshold of 100 employees, the EEO-1 data best captures the employment practices of large private firms. Of course, not all lawyers are employed by these types of organizations. Therefore, a second data set, the Current Population Survey16 was used to obtain a perspective on the more general labor market for attorneys. Finally, to obtain a sense of the availability of women and minority attorneys, data on law degrees (J.D. degrees) conferred is examined.17 Two different time periods are examined. For EEO-1 data it is possible to construct a relatively long time period from 1975 to 2002. Due to the limitations of the other data sets, the period from 1982 to 2002 is examined when using all three types of data., 113295=40. Beckman, C. and D. Phillips, \"Interorganizational Determinants of Promotion: Client Leadership and the Promotion of Women Attorneys\", draft manuscript, August 26, 2003., 79681=The first row represents all law firms in the 2002 EEO-1 survey (a total of 1,231 observations), and the second row represents the law firms in random sample with corresponding values in the NALP survey (a total of 92 observations). The proportions of women and minorities from the two EEO-1 sources have similar values, between 0.403 and 0.417 for women and between 0.122 and 0.128 for minorities. This suggests that the random sample accurately reflects the proportion of women and minorities among EEO-1 law firms as a whole., 102758=13.Cynthia Fuchs Epstein, and Robert Saute, Bonnie Oglensky, and Martha Gever, \"Glass Ceilings and Open Doors: Women's Advancement in the Legal Profession,\" A Report to the Committee on Women in the Profession, The Association of the Bar of the City of New York, 1995,Fordham Law Review, vol. 64, p. 291-449., 89260=As expected, the NALP diversity estimates, derived from the appropriate legal sub-groups, provide a close approximation to the diversity proportions reported to the EEOC. The EEO-1 proportion of women is 0.4023 compared to an NALP estimate of 0.3826, a difference of 0.0197. The EEO-1 proportion of minorities is 0.1246, compared to an NALP estimate of 0.1152, a difference of 0.0094. Neither of these proportional differences is statistically significant., 113768=42. Dixon, J. and C. Seron, \"Stratification in the Legal Profession: Sex, Sector, and Salary\", Law and Society Review, vol. 29 no. 3, 1995, pp. 381-412., 24707=Over the past twenty years, the proportion of Native Americans receiving law degrees and reported as professionals by Legal Service firms on their EEO-1 report has increased but still remains less than one percent. By 2002, Native American represented 0.2 percent of the relevant professional work force and 0.7 percent of law degrees conferred., 96094=Kay, Fiona, and John Hagan, \"Cultivating clients in the Competition for Partnerships: Gender and the Organizational Restructuring of Law Firms in the 1990s\", Law & Society Review Volume 35, Number 3, pp. 517-555,1999., 6381=Almost all studies find a substantial increase in the employment of women and minorities in private sector law firms. For example, in a study of ninety-seven elite law firms in Chicago, Los Angles, New York, and Washington, Elizabeth Chambliss (1997) states that \" . . . the lawyers who work in elite law firms historically have been white Protestant men who graduated from prestigious law schools such as Harvard, Columbia, and Yale. As recently as 1970, women and people of color were almost completely excluded. Since 1970, the gender and race composition of elite law firms has changed considerably at the associate level. By 1980, 23.2% of the associates in the sample were women; by 1990, 36.2% of associates in the sample were women. Although the level of racial diversity is much lower, it too has increased. By 1980, 3.6% of associates in the sample were minorities; by 1990, 6.5% of associates were minorities\" (pp.695-696).6, 20135=Further, unlike the employment patterns for women, the proportion of African Americans employed as lawyers in the general labor market and as professionals in law firms as captured by the EEO-1 data is fairly consistent. However, there is a slight difference in the manner in which these rates have changed over time. At the beginning of the period African Americans make up 2.9 percent of professional employment in the EEO-1 reports filed by Legal Service firms and climb to 4.4 percent in 2002. In the general work force figures captured by the CPS, African Americans start lower in 1982 at 2.7 percent and at the end of the period reaches 4.6 percent which slightly exceeds the EEO-1 figure. Rates of change based on these percentages reflect the same dynamics but produce much larger disparities in rates of change. From 1982 to 2002 the African American percentage of EEO-1 reported professionals in legal services increased 51.7 percent and employment of African American attorneys in the general work force increased at a rate of 70.4 percent. The increase in EEO-1 employment of African Americans as professionals in Legal Services did not keep pace with the change in law degrees earned by African Americans(a rate of change of 71.4 percent), but the CPS based rate of change and degrees conferred is similar. Thus, changes in the employment of African American professionals in private sector firms required to file EEO-1 reports lagged behind their increase as lawyers in the general work force and in their increased rate of receiving law degrees over the past twenty years., 78745=This section examines the relationship between diversity proportions for law firms in the EEO-1 survey and diversity proportions for law firms in the NALP survey. Appendix Table 5 summarizes the overall proportion of women and minorities for law firms in the 2002 EEO-1 survey., 110572=34. These EEO-1 results are generally consistent with the 2002 NALP results., 26593=Among lawyers in private practice, the Payne and Nelson study (2003, Table 2-2) of the Chicago bar in 1995 finds a higher percentage of white women attorneys than African American attorneys working for firms with 100 or more lawyers (44.9 percent and 28.0 percent respectively).19 For the 1990s cohort of Michigan Law School graduates, Lempert, Chambers, and Adams (2000, Tables 11 and 14) find significant differences in the proportion of white and minority alumni taking first jobs in firms with 151 or more lawyers (55.9 percent and 35.7 percent respectively), but no significant differences between white and minority alumni in holding current jobs in firms with 151 or more lawyers (37.9 percent and 31.0 percent respectively). Chiu and Leicht (1999, p. 569) report that in \" … Chiu's (1996) analysis of the 1990 National Survey of Lawyers' Career Satisfaction, women were more likely to work in large law firms than men, but this difference was not statistically significant once years since graduation was controlled.\" The Chambliss study of elite law firms (1997, Tables 11a and 11b) finds a statistically significant negative relationship between firm size the proportion of female partners, but no statistically significant relationship between firm size and the proportion of female associates., 16208=In 1982 the percent of women reported as professionals in Legal Services on the EEO-1 is nearly identical to the percent of women receiving law degrees in that year. However, by 2002 the employment of women as professionals in these larger law firms is eight percentage points below degrees conferred. Employment of women lawyers reported in the Current Population Survey falls behind both the employment of women professionals in legal services as reported on the EEO-1 and law degrees obtained by women. Rates of change were computed for women over this time period in order to obtain a better sense of the relative differences over time. (Because the raw numbers in the three data sources differ in magnitude, the percentages are used to compute these rates.) The percent of women professionals in legal services on the EEO-1 increased by 23.6 percent during the period, while the rate of change for J.D. degrees conferred was 46.4 percent. CPS employment of women attorneys exhibit a rate of change of 112 percent over the period. This suggests the employment of women in the larger law firms required to file EEO-1 reports may not have kept pace with law degrees obtained by women or the employment of women attorneys in the general work force. Despite this, the employment of women in these firms remained higher than in the more general work force., 335=Since 1975, the representation of women, African Americans, Hispanics and Asian Americans as professionals in larger Legal Service firms has increased substantially., 103115=14. See John P. Heinz and Edward O. Laumann, Chicago Lawyers, 1982, Russell Sage Foundation and American Bar Association, and Kathleen E. Hull and Robert L. Nelson, \"Assimilation, Choice or Constraint? Testing Theories of Gender Differences in the Careers of Lawyers,\" 2000 Social Forces, vol. 79:1, pp. 229-264. \"font-family: Times New Roman\">, 99275=5. Monique R. Payne and Robert L. Nelson, \"Shifting Inequalities: Stratification by Race, Gender, and Ethnicity in an Urban Legal Profession, 1975-1995,\" 2003, unpublished manuscript., 101066=10.For a detailed discussion of attrition among Black associates, including scarce training opportunities and access to good work assignments, see David B. Wilkins and G. Mitu Gulati, \"Why are There So Few Black Lawyers in Corporate Law Firms: An Institutional Analysis,\" 84 California Law Review, May 1996, pp. 493-618., 98656=2. Nelson, R. \"The Futures of American Lawyers: A Demographic Profile of a Changing Profession in a Changing Society\", Case Western Reserve Law Review, vol 44, 1994, pp. 345-406., 118857=58.The Z score for women is 0.2197 (a two-sided probability value of 0.826), and a Z score for minorities is 0.3294 (a two-sided probability value of 0.742)., 47386=In order to analyze the NALP data it was necessary to enter the data manually from the hard copy directory. Therefore, a sample of firms was utilized. The EEO-1 data base was used to select the sample firms. The sample was drawn from a population of all headquarter facilities in the Legal Service industry filing EEO-1 reports in 2002. There were 1,231 total establishments but just 508 headquarters reports from which the sample could be drawn. Seeking at least a ten percent sample and recognizing that not all firms that file an EEO-1 report would necessarily file a report from the NALP, a random sample of 125 was drawn from the EEO-1 data subset.45 Of these 33 were not included in the NALP Directory making the actual sample size, 92., 99497=6.Elizabeth Chambliss, \"Organizational Determinants of Law Firm Integration,\" 1997, The American University Law Review, vol. 46, pp. 669-746., 63891=To compare the corresponding information from the EEO-1 and NALP surveys, we retrieved all establishments from the 2002 EEO-1 Survey with a Standard Industrial Classification code of \"81\" (Legal Services), a total of 1,231 establishments. (This sample did not include Hawaii, as race/ethnic data is not collected there.) We restricted the population to 782 establishments by only including those with more than one hundred total employees and more than fifteen professional employees. Finally, we restricted the analysis to headquarters firms only, excluding all auxiliary field units. From this universe of 508 establishments, we drew a random sample of 125 establishments from the 2002 EEO-1 survey. By matching firm names and address, we were able to identify 92 law firms in the 2002-2003 NALP Directory of Legal Employers (using NALP data as of February 1, 2002). This represents 73 percent of the original sample and 18 percent of the EEO-1 reporting firms meeting the criteria for analysis. Since NALP is a fee-charging listing service, designed to provide information to potential job seekers, it seems likely that the unmatched firms either had other means of recruiting attorneys or chose not to hire attorneys in 2002-2003., 23272=As reported above, the growth in Asian attorneys is so rapid that by 2002, the percentage of Asian professionals in Legal Services, 5.3 percent, as reported on the EEO-1 exceeds the percentage of African Americans, 4.4 percent. (Current Population Survey data on the general work force is not available for Asians.) Degrees conferred to Asians also increases during the twenty year study period. In 1982 just 1.3 percent of all law degrees are awarded to Asians but by 2002, they earn 6.5 percent of all degrees. See Figure 6., 96945=Nelson, Robert L., Partners with Power, The Social Transformation of the Large Law Firm. Berkeley: University of California Press,1988., 115678=50. Hull, K. and R. Nelson, \"Assimilation, Choice, or Constraint? Testing Theories of Gender Differences in the Careers of Lawyers\", Social Forces, September 2000, 79 (1) pp. 229-264., 98882=3. Johnson, Jr. A., \"The Underrepresentation of Minorities in the Legal Profession: A Critical Race Theorist's Perspective\", Michigan Law Review, vol 95, February 1997 pp. 1105-1062., 9706=Women have fared poorly under the ‘up and out' system. Using data supplied by the firms and the Martindale-Hubbell Law Directory, we tracked cohorts of first-year associates in the eight firms in periods beginning in 1973-74 and 1985-86 for a ten-year period to see how many associates had been elevated to partner. (The last cohort, those hired in 1985-86, were followed until 1994) . . . For each cohort except the first, where one-quarter of women associates (five of twenty) made partner, men associates gained partnership at a higher rate than women. For the entire period, 19% (362 of 1878) of men attainted partnership while only 8% (60 of 754) of women made partner\" (p. 358).13, 17595=African Americans represented 2.3 percent of these employees in 1975 and 4.4 percent in 2002. However, the percent of Asian professionals in Legal Services reported on the EEO-1 exceeds African American professionals by 2002. Starting at just 0.5 percent in 1975, Asians represent 5.3 percent in 2002. Hispanics increased from 0.7 percent to just less than 3 percent. Native American Alaskan Natives are poorly represented among these workers. See Figure 3., 95037=Chambliss, Elizabeth, \"Organizational Determinants of Law Firm Integration,\" The American University Law Review, Volume 46, pp. 695-696, pp. 669-746, 1997., 4852=Patterns of stratification with the legal profession are important in their own right . . . but they are of particular concern to legal scholars and legal educators because principles of inequality among lawyers may suggest much about whether access to justice in our society is fairly distributed. If race, gender, and social class are determinants for entry into the profession and for the attainment of certain positions within the profession, it may imply that these same attributes affect the sorts of treatment individuals will receive by legal institutions, in part because they do not have access to lawyers who share a similar social background (Nelson, 1988, p. 368).4, 104250=16. Current Population Survey data is a national monthly survey of approximately 60,000 households conducted by the Bureau of the Census for the Bureau of Labor Statistics. The data used is \"Household Data, Annual Averages, Employed Persons by Detailed Occupation, Sex, Race and Hispanic Origin. The 2002 data is available at www.bls.gov/cps/cpsaat11.pdf. Data for other years was obtained directly from the Bureau of Labor Statistics. Data for 1982 is not available so data from the 1980 Census data is substituted for those figures.}",
    "lastModified": "Mon, 19 Oct 2009 21:42:19 GMT",
    "textBeforeTable": "FIGURE 1: EMPLOYMENT OF WOMEN EEO-1, 1975-2002 Three different data sources are used to examine how the employment of women and minorities in the legal professional has changed over time. These three data sets provide different perspectives on the employment of attorneys. The Equal Employment Opportunity Commission's (EEOC's) own EEO-1 report is used to reflect employment in large private law firms. Private employers with 100 or more employees are required to file annual EEO-1 reports with EEOC. They are also required to file separate reports for each of their establishments with 50 or more employees. By and large when companies in the Legal Services industry file such reports the professional job group provides a fairly representative index of diversity among associate attorneys.15 Due to the filing threshold of 100 employees, the EEO-1 data best captures the employment practices of large private firms. Of course, not all lawyers are employed by these types of organizations. Therefore, a second data set, the Current Population Survey16 was used to obtain a perspective on the more general labor market for attorneys. Finally, to obtain a sense of the availability of women and minority attorneys, data on law degrees (J.D. degrees) conferred is examined.17 Two different time periods are examined. For EEO-1 data it is possible to construct a relatively long time period from 1975 to 2002. Due to the limitations of the other data sets, the period from 1982 to 2002 is examined when using all three",
    "textAfterTable": "1982 1987 1992 1997 2002 LEGAL PROFESSIONALS EEO1 32.6 35.9 37 38.1 40.3 LAWYERS CPS 13.8 19.6 21.4 26.6 29.2 JD DEGREES 33 40 42.7 43.8 48.3 In 1982 the percent of women reported as professionals in Legal Services on the EEO-1 is nearly identical to the percent of women receiving law degrees in that year. However, by 2002 the employment of women as professionals in these larger law firms is eight percentage points below degrees conferred. Employment of women lawyers reported in the Current Population Survey falls behind both the employment of women professionals in legal services as reported on the EEO-1 and law degrees obtained by women. Rates of change were computed for women over this time period in order to obtain a better sense of the relative differences over time. (Because the raw numbers in the three data sources differ in magnitude, the percentages are used to compute these rates.) The percent of women professionals in legal services on the EEO-1 increased by 23.6 percent during the period, while the rate of change for J.D. degrees conferred was 46.4 percent. CPS employment of women attorneys exhibit a rate of change of 112 percent over the period. This suggests the employment of women in the larger law firms required to file EEO-1 reports may not have kept pace with law degrees obtained by women or the employment of women attorneys in the general work force. Despite",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}