{
    "relation": [
        [
            "TPM Used",
            "Profit split",
            "Interbranch allocation (using indirect evidence of CUPs)"
        ],
        [
            "Number",
            "≤ 3",
            "≤ 3"
        ]
    ],
    "pageTitle": "Announcement 2006-22, April 17, 2006",
    "title": "",
    "url": "http://www.unclefed.com/Tax-Bulls/2006/ann06-22.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986423.95/warc/CC-MAIN-20150728002306-00332-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 806972595,
    "recordOffset": 806933503,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{251750=The various term lengths for APAs executed in 2005 are set forth in Table 28 below:, 90737=Tables 7 and 8 below show how long each APA request pending at the end of 2005 has been in the system as measured from the filing date of the APA submission. We believe that reporting the age of both completed cases and pending cases reflects more accurately the APA Program’s success or failure in moving cases and improves the public’s ability to evaluate the current timeliness of the APA process. (The numbers in Tables 7 and 8 for pending unilateral and bilateral cases differ from the numbers in Table 1 because whereas Table 1 includes any case for which a user fee has been paid, Tables 7 and 8 reflect only cases for which submissions have been received.), 248333=Nineteen Covered Transactions reflected on Table 26 specified a single, specific result. Four of these Covered Transactions involved a CPM in which the taxpayer agreed to a “point.” Some APAs specify not a point or a range, but a “floor” or a “ceiling”. When a floor is used, the tested party’s result must be greater than or equal to some particular value. When a ceiling is used, the tested party’s result must be less than or equal to some particular value. Four APAs executed in 2005 used a floor and none used a ceiling., 11523=The APA application can be a relatively modest document for small businesses. Section 9 of Rev. Proc. 2006-9 describes the special APA procedures for Small Business Taxpayers. For most taxpayers, however, the APA application is a substantial document filling several binders. The APA Program makes every effort to reach an agreement on the basis of the information provided in the taxpayer’s application., 248938=Some APAs look to a tested party’s results over a period of years (multi-year averaging) to determine whether a taxpayer has complied with the APA. In 2005, rolling multi-year averaging was used for eleven Covered Transactions. Ten of those used three-year averages. Three or fewer Covered Transactions used a cumulative multi-year average, while eight Covered Transactions used term averages and three or fewer Covered Transactions used partial term averages., 5219=Following these hearings, a number of steps were announced in May 2005 to strengthen APA Program operations. These steps include (i) new case management procedures designed to minimize delays in case processing; (ii) the formation of industry/issue coordination teams within the APA Office to promote efficiency, quality, and consistency; (iii) enhancement of APA Office resources; and (iv) improving the APA Program’s ability to monitor compliance by requiring disclosure of standardized summary information as part of the annual report process. These steps have been implemented or are being implemented currently., 23068=In 2005, the APA office consisted of four branches with Branches 1 and 3 staffed with APA team leaders and Branch 2 staffed with economists and a paralegal. Branch 4, the APA West Coast branch, is headquartered in Laguna Niguel, California, with an additional office in San Francisco, and is presently staffed with both team leaders and economists., 152782=The nature of the relationships between the related organizations, trades, or businesses covered by APAs executed in 2005 is set forth in Table 12 below:, 207556=If a critical assumption has not been met, the APA may be revised by agreement of the parties. If such an agreement cannot be achieved, the APA may be canceled. If a critical assumption has not been met, it requires taxpayer’s notice to and discussion with the Service, and, in the case of a bilateral APA, competent authority consideration. Rev. Proc. 2006-9, § 11.05., 221419=At the core of most APAs are comparables. The APA Program works closely with taxpayers to find the best and most reliable comparables for each Covered Transaction. In some cases, CUPs or CUTs can be identified. In other cases, comparable business activities of independent companies are utilized in applying the CPM or a profit split method. Generally, in the APA Program’s experience since 1991, CUPs and CUTs have been most often derived from the internal transactions of the taxpayer., 166686=The general descriptions of the business functions performed and risks assumed by the organizations, trades, or businesses whose results are tested in the Covered Transactions in the APAs executed in 2005 are set forth in Tables 15 and 16 below:, 4284=On December 19, 2005, the IRS again updated the procedural rules for processing and administering APAs with the release of Rev. Proc. 2006-9, 2006-2 I.R.B. 278 (Jan. 9, 2006). Rev. Proc. 2006-9 supersedes Rev. Proc. 2004-40 and is effective for all APA requests filed on or after February 1, 2006., 255499=The number of rollback years to which an APA TPM was applied in 2005 is set forth in Table 29 below:, 206343=APAs include critical assumptions upon which their respective TPMs depend. A critical assumption is any fact (whether or not within the control of the taxpayer) related to the taxpayer, a third party, an industry, or business and economic conditions, the continued existence of which is material to the taxpayer’s proposed TPM. Critical assumptions might include, for example, a particular mode of conducting business operations, a particular corporate or business structure, or a range of expected business volume. Rev. Proc. 2006-9, § 4.05. Failure to meet a critical assumption may render an APA inappropriate or unworkable., 23440=Overall, the APA staff increased by one, to 33 from 32, from the end of 2004 to the end of 2005. A second Special Counsel was added to the Program, while the number of APA team leaders stayed constant at 17, and the number of APA economists stayed constant at five., 9232=The APA team generally includes an economist, an international examiner, LMSB field counsel, and, in a bilateral case, a U.S. Competent Authority analyst who leads the discussions with the treaty partner. The economist may be from the APA Program or the IRS field organization. As of December 31, 2005, the APA Program had five economists. The APA team may also include an LMSB International Technical Advisor, other LMSB exam personnel, and an Appeals Officer., 247003=Under Treas. Reg. § 1.482-1(e)(2)(i), such a range is normally derived by considering a set of more than one comparable uncontrolled transaction of similar comparability and reliability. If these comparables are of very high quality, as defined in the § 482 regulations, then under Treas. Reg. § 1.482-1(e)(2)(iii)(A), the arm’s length range includes the results of all of the comparables (from the least to the greatest). However, the APA Program has only rarely identified cases meeting the requirements for the full range. If the comparables are of lesser quality, then under Treas. Reg. § 1.482-1(e)(2)(iii)(B), “the reliability of the analysis must be increased, when it is possible to do so, by adjusting the range through application of a valid statistical method to the results of all of the uncontrolled comparables.” One such method, the “interquartile range,” is ordinarily acceptable, although a different statistical method “may be applied if it provides a more reliable measure.” The “interquartile range” is defined as, roughly, the range from the 25th to the 75th percentile of the comparables’ results. See Treas. Reg. § 1.482-1(e)(2)(iii)(C). The interquartile range was used 52 times in 2005., 238857=The adjustments made to comparables or tested parties in APAs executed in 2005 are reflected in Table 24 above., 200158=The CPM was also used regularly with services as the Covered Transactions in APAs executed in 2005. There were at least 12 services Covered Transactions using the CPM method with various PLIs according to the specific facts of the taxpayers involved. Table 19 reflects the methods used to determine the arm’s length results for APAs involving services transactions., 26749=In 2005, the APA office continued to emphasize training. Training sessions addressed APA-related current developments, new APA office practices and procedures, and international tax law issues. The APA New Hire Training materials were updated, as necessary, throughout the year. The updated materials are available to the public through the APA internet site at http://www.irs.gov/businesses/corporations/article/0,,id=96221,00.html. These materials do not constitute guidance on the application of the arm’s length standard., 200554=In 2005, six APAs involving tangible or intangible property used the Residual Profit Split Method, Treas. Reg. § 1.482-6(c)(3). In residual profit split cases, routine contributions by the controlled parties are allocated routine market returns, and the residual income is allocated among the controlled taxpayers based upon the relative value of their contributions of non-routine intangible property to the relevant business activity., 155332=The controlled transactions covered by APAs executed in 2005 are set forth in Table 13 and Table 14 below:, 274695=2006 Document Types | 2006 Weekly IRBs, 268901=The statistics for the review of APA annual reports are reflected in Table 31 below. As of December 31, 2005, there were 350 pending annual reports. In 2005, 146 reports were closed., 273910=You can either: Search all IRS Bulletin Documents issued since January 1996, or Search the entire site. For a more focused search, put your search word(s) in quotes., 201019=Profit splits have also been used in a number of financial product APAs in which the primary income-producing functions are performed in more than one jurisdiction. Three or fewer financial product APAs executed in 2005 applied a profit split method., 194930=The TPMs used in APAs completed during 2005 were based on the section 482 regulations. Under Treas. Reg. § 1.482-3, the arm’s length amount for controlled transfers of tangible property may be determined using the Comparable Uncontrolled Price (CUP) method, the Resale Price Method, the Cost Plus Method, the Comparable Profits Method (CPM), or the Profit Split Method. Under Treas. Reg. § 1.482-4, the arm’s length amount for controlled transfers of intangible property may be determined using the Comparable Uncontrolled Transaction (CUT) method, CPM, or the Profit Split Method. An “Unspecified Method” may be used for both tangible and intangible property if it provides a more reliable result than the enumerated methods under the best method rule of Treas. Reg. § 1.482-1(c). For transfers involving the provision of services, Treas. Reg. § 1.482-2(b) provides that services performed for the benefit of another member of a controlled group should bear an arm’s length charge, either deemed to be equal to the cost of providing the services (when non-integral, see Treas. Reg. § 1.482-2(b)(3)) or which should be an amount that would have been charged between independent parties., 239416=The types of ranges and adjustment mechanisms used in APAs executed in 2005 are described in Table 26 and 27 below., 7235=A unilateral APA is an agreement between a taxpayer and the IRS establishing an approved TPM for U.S. tax purposes. A unilateral APA binds the taxpayer and the IRS, but does not prevent foreign tax administrations from taking different positions on the appropriate TPM for a transaction. As stated in § 7.07 of Rev. Proc. 2006-9, should a transaction covered by a unilateral APA be subject to double taxation as the result of an adjustment by a foreign tax administration, the taxpayer may seek relief by requesting that the U.S. Competent Authority consider initiating a mutual agreement proceeding, provided there is an applicable income tax treaty in force with the other country., 4605=Also in 2005, the Office of Chief Counsel held two days of public hearings to solicit comments on the state of, and ideas for improving, the APA Program. These hearings were announced in IRS Announcement 2004-98, 2004-2 C.B. 983 (December 13, 2004), and were held on February 1 and February 22, 2005. Twenty-three persons representing corporations, taxpayer groups, and professional firms spoke. Written comments from these and other persons are available on the IRS website at http://www.irs.gov/businesses/corporations/article/ 0,,id=134735,00.html., 10804=In many APA cases, the taxpayer’s application is preceded by a pre-file conference with the APA staff in which the taxpayer can solicit the informal views of the APA Program. Pre-file conferences can occur on an anonymous basis, although a taxpayer must disclose its identity when it applies for an APA. Taxpayers must file the appropriate user fee on or before the due date of the tax return for the first taxable year that the taxpayer proposes to be covered by the APA. Many taxpayers file a user fee first and then follow up with a full application later. The procedures for pre-file conferences, user fees, and applications can be found in §§ 3 and 4 of Rev. Proc. 2006-9., 208459=The sources of comparables, selection criteria, and rationale used in determining the selection criteria for APAs executed in 2005 are described in Tables 22 through 24 below. Various formulas for making adjustments to comparables are included as Attachment B., 751=This Announcement is issued pursuant to § 521(b) of Pub. L. 106-170, the Ticket to Work and Work Incentives Improvement Act of 1999, which requires the Secretary of the Treasury to report annually to the public concerning Advance Pricing Agreements (APAs) and the APA Program. The first report covered calendar years 1991 through 1999. Subsequent reports covered calendar years 2000, 2001, 2002, 2003 and 2004. This seventh report describes the experience, structure and activities of the APA Program during calendar year 2005. It does not provide guidance regarding the application of the arm’s length standard., 23729=As of December 31, 2005, the APA staff was as follows:, 258447=APAs executed in 2005 required that taxpayers provide various documents with their annual reports. These documents are described in Table 30 below:, 267847=As described in Rev. Proc. 2006-9, § 11.01, APA taxpayers are required to file annual reports to demonstrate compliance with the terms and conditions of the APA. The filing and review of annual reports is a critical part of the APA process. Through annual report review, the APA program monitors taxpayer compliance with the APA on a contemporaneous basis. Annual report review provides current information on the success or problems associated with the various TPMs adopted in the APA process., 196849=In reviewing the TPMs applicable to transfers of tangible and intangible property reflected in Table 18, the majority of the APAs followed the specified methods. However, several points should be made. The § 482 regulations note that for transfers of tangible property, the Comparable Uncontrolled Price (CUP) method will generally be the most direct and reliable measure of an arm’s length price for the Controlled Transaction if sufficiently reliable comparable transactions can be identified. Treas. Reg. § 1.482-3(b)(2)(ii)(A). It was the experience of the APA Program in 2005, that in the cases that came into the APA Program, sufficiently reliable CUP transactions were difficult to find. In APAs executed in 2005, no Covered Transaction used the CUP method., 198162=The Cost Plus Method (tangibles only) and Resale Price Method were applied in 2005 in zero and five APAs, respectively. See Treas. Reg. § 1.482-3(c), (d)., 223179=Comparables used in APAs can be U.S. or foreign, depending on the relevant market, the type of transaction being evaluated, and the results of the functional and risk analyses. In general, comparables have been located by searching a variety of databases that provide data on U.S. publicly traded companies and on a combination of public and private non-U.S. companies. Table 22 shows the various databases and other sources used in selecting comparables for the APAs executed in 2005., 185366=The TPMs used in APAs executed in 2005 are set forth in Tables 18-20 below:, 267151=During 2005, there were 32 tested parties that faced financial risks, including interest rate and currency risks. In appropriate cases, APAs may provide specific approaches for dealing with currency risk, such as adjustment mechanisms and/or critical assumptions., 1834=Internal Revenue Code (IRC) § 482 provides that the Secretary may distribute, apportion, or allocate gross income, deductions, credits, or allowances between or among two or more commonly controlled businesses if necessary to reflect clearly the income of such businesses. Under the § 482 regulations, the standard to be applied in determining the true taxable income of a controlled business is that of a business dealing at arm’s length with an unrelated business. The arm’s length standard has also been adopted by the international community and is incorporated into the transfer pricing guidelines issued by the Organization for Economic Cooperation and Development (OECD). OECD, TRANSFER PRICING GUIDELINES FOR MULTINATIONAL ENTERPRISES AND TAX ADMINISTRATORS (1995). Transfer pricing issues by their nature are highly factual and have traditionally been one of the largest issues identified by the IRS in its audits of multinational corporations. The APA Program is designed to resolve actual or potential transfer pricing disputes in a principled, cooperative manner, as an alternative to the traditional examination process. An APA is a binding contract between the IRS and a taxpayer by which the IRS agrees not to seek a transfer pricing adjustment under IRC § 482 for a Covered Transaction if the taxpayer files its tax return for a covered year consistent with the agreed transfer pricing method (TPM). In 2005, the IRS and taxpayers executed 53 APAs and amended 1 APA., 3369=Since 1991, with the issuance of Rev. Proc. 91-22, 1991-1 C.B. 526, the IRS has offered taxpayers, through the APA Program, the opportunity to reach an agreement in advance of filing a tax return on the appropriate TPM to be applied to related party transactions. In 1996, the IRS issued internal procedures for processing APA requests. Chief Counsel Directives Manual (CCDM), ¶¶ 42.10.10 — 42.10.16 (November 15, 1996). Also in 1996, the IRS updated Rev. Proc. 91-22 with the release of Rev. Proc. 96-53, 1996-2 C.B. 375. In 1998, the IRS published Notice 98-65, 1998-2 C.B. 803, which set forth streamlined APA procedures for Small Business Taxpayers. Then on July 1, 2004, the IRS updated and superseded both Rev. Proc. 96-53 and Notice 98-65 by issuing Rev. Proc. 2004-40, 2004-2 C.B. 50 (July 19, 2004), effective for all APA requests filed on or after August 19, 2004., 10074=The APA process is voluntary. Taxpayers submit an application for an APA, together with a user fee as set forth in Rev. Proc. 2006-9, § 4.12. The APA process can be broken into five phases: (1) application; (2) due diligence; (3) analysis; (4) discussion and agreement; and (5) drafting, review, and execution., 251071=Where a taxpayer’s actual transactions do not comply with the TPM, a taxpayer must nonetheless report its taxable income in an amount consistent with the TPM (an APA primary adjustment), as further discussed in § 11.02 of Rev. Proc. 2006-9., 8639=An IRS team headed by an APA team leader is responsible for the consideration of each APA. As of December 31, 2005, the APA Program had 17 team leaders. The team leader is responsible for organizing the IRS APA team. The IRS APA team leader arranges meetings with the taxpayer, secures whatever information is necessary from the taxpayer to analyze the taxpayer’s related party transactions and the available facts under the arm’s length standard of IRC § 482 and the regulations thereunder (Treas. Reg.), and leads the discussions with the taxpayer., 273704=Internal Revenue Bulletin 2006-16, 179686=The related organizations, trades, or businesses whose prices or results are tested to determine compliance with TPMs prescribed in APAs executed in 2005 are set forth in Table 17 below:, 197654=Similar to the CUP method, for transfers of intangible property, the CUT method will generally provide the most reliable measure of an arm’s length result if sufficiently reliable comparables may be found. Treas. Reg. § 1.482-4(c)(2)(ii). It has generally been difficult to identify external comparables, and APAs using the CUT method tend to rely on internal transactions between the taxpayer and unrelated parties. In 2005, six Covered Transactions utilized the CUT TPM., 6234=An APA generally combines an agreement between a taxpayer and the IRS on an appropriate TPM for the transactions at issue (Covered Transactions) with an agreement between the U.S. and one or more foreign tax authorities (under the authority of the mutual agreement process of our income tax treaties) that the TPM is correct. With such a “bilateral” APA, the taxpayer ordinarily is assured that the income associated with the Covered Transactions will not be subject to double taxation by the IRS and the foreign tax authority. It is the policy of the United States, as reflected in §§ 2.08 and 7 of Rev. Proc. 2006-9, to encourage taxpayers that enter the APA Program to seek bilateral or multilateral APAs when competent authority procedures are available with respect to the foreign country or countries involved. However, the IRS may execute an APA with a taxpayer without reaching a competent authority agreement (a “unilateral” APA)., 20379=Once the IRS and the taxpayer reach agreement, the drafting of the final APA generally takes little time because the APA Program has developed standard language that is incorporated into every APA. The current, recently revised version of this language is found in Attachment A. APAs are reviewed by the Branch Chief and the APA Director. In addition, the team leader prepares a summary memorandum for the Associate Chief Counsel (International) (ACC(I)). On March 1, 2001, the ACC(I) delegated to the APA Director the authority to execute APAs on behalf of the IRS. See Chief Counsel Notice CC-2001-016. The APA is executed for the taxpayer by an appropriate corporate officer., 201687=Critical Assumptions used in APAs executed in 2005 are described in Table 21 below:}",
    "lastModified": "Thu, 05 Feb 2009 18:38:22 GMT",
    "textBeforeTable": "As of December 31, 2005, the APA staff was as follows: Overall, the APA staff increased by one, to 33 from 32, from the end of 2004 to the end of 2005. A second Special Counsel was added to the Program, while the number of APA team leaders stayed constant at 17, and the number of APA economists stayed constant at five. In 2005, the APA office consisted of four branches with Branches 1 and 3 staffed with APA team leaders and Branch 2 staffed with economists and a paralegal. Branch 4, the APA West Coast branch, is headquartered in Laguna Niguel, California, with an additional office in San Francisco, and is presently staffed with both team leaders and economists. The Current APA Office Structure, Composition, and Operation Attachment A contains the current version of the model APA language. As part of its continuing effort to improve its work product, the APA Program recently revised the model language to reflect the program’s collective experience with substantive and drafting issues. The most significant revisions are designed primarily to clarify how TPMs typically employed in APAs, and adjustments that may be necessary to conform to such TPMs, are to be applied and reflected in the taxpayer’s tax returns. Other significant revisions include those intended (a) to clarify that the common parent of a US consolidated return group is the appropriate signatory for APAs",
    "textAfterTable": "1 Branch Chief 1 Secretary 1 Paralegal 1 Secretary 1 Secretary 6 Team Leaders 3 Economists 8 Team Leaders 3 Team Leaders       2 Economists APA Training In 2005, the APA office continued to emphasize training. Training sessions addressed APA-related current developments, new APA office practices and procedures, and international tax law issues. The APA New Hire Training materials were updated, as necessary, throughout the year. The updated materials are available to the public through the APA internet site at http://www.irs.gov/businesses/corporations/article/0,,id=96221,00.html. These materials do not constitute guidance on the application of the arm’s length standard. APA Program Statistical Data [§ 521(b)(2)(C) and (E)] The statistical information required under § 521(b)(2)(C) is contained in Tables 1 and 9 below; the information required under § 521(b)(2)(E) is contained in Tables 2 and 3 below: TABLE 1: APA APPLICATIONS, EXECUTED APAs, AND PENDING APAs",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}