{
    "relation": [
        [
            "Categories",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "In three sentences"
        ],
        [
            "Comments",
            "There are plenty of things to do for fun around. Here on campus, we have a game room in the student life center. There are a variety of events that the school provides such as outdoor movies and cultural events, like plays and art shows. Campus is located at the foot of the mountains so there are plenty of outdoor things to do, like biking, rafting, hiking, etc.",
            "On campus, there are three locations to eat. The main one is the cafeteria. In the cafeteria, there are several options. There is always a homestyle option, the entree varies from day to day. Also, there is a pizza and pasta station, a sandwich station, a grill, a salad station, cereal station and of course, the dessert bar. Downstairs from the cafeteria, is the '63/'64 grill (otherwise known as the 'stud'). They offer a variety of options, much like a fast food restaurant. The third option is Einstein's. Einstein's is a small coffee shop which offers breakfast and lunch items like bagels and sandwiches.",
            "Campus is pretty small so most of the dorm buildings are located near all the academic buildings. The dorm building i live in is beautiful. All the rooms come with a microfridge, so that's a plus. On our hall, is a laundry room. All the girls on my hall are super nice, as are most people on campus.",
            "The class sizes here are small. In most of my classes, there have been about 15-25 students with a professor. The Professors are always willing to help because their goal is to make sure we actually learn something from their class. On campus, there are different labs that you can attend to get extra help in classes you may be struggling in. There are also free tutors for those who need them.",
            "Coming to North Greenville University was one of the best decisions i have ever made. I truly feel at home here."
        ]
    ],
    "pageTitle": "North Greenville University Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/North-Greenville-University/reviews?_escaped_fragment_=/show/41459",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989790.89/warc/CC-MAIN-20150728002309-00313-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 897589763,
    "recordOffset": 897557220,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{118926=© 2015, Cappex.com, LLC, 15698=I absolutely love being a student here at North Greenville. I'm currently a freshman and will be sophomore in the fall 2011. I have made some of the best friends while being here and everyone here, whether it's faculty or students, is so friendly and welcoming. I've felt right at home since the day I moved into my dorm. Everyone here wants the students to feel like they're at home and wants them to be comfortable.}",
    "textBeforeTable": "07/10/2009 Reviewer is A current student here. 12 out of 12 people found this review useful. 1 of 30 Samantha from North Charleston, SC Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for",
    "textAfterTable": "Comments Great for these types of students Christ-serving, easy-going, students who do not like big schools. NGU is a lot like high school, without the dramatics and with much more freedom. Tips for prospective students Do not come to NGU if you are not willing to follow the rules listed in the handbook. You will not enjoy yourself, and you will probably get kicked out. Bang for the buck Though there are many generous scholarships for residents of South Carolina, the tuition at NGU is not unreasonable for a private, Christian university. The dorm rooms are nice, and many are new. The education is good, and the cafeteria holds a variety of tasteful food for every meal. NGU students receive free access to every home athletic event. Am enjoying being here Almost everyone is really friendly! Students are polite and have no problem helping you find anything you need. The smaller size of the campus promotes unity among the student body. When you recognize people, it helps in feeling comfortable. The dorms are nice, and the rules are not overly strict. Christianity is emphasized at NGU, which creates a pleasant atmosphere. Am learning a lot",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}