{
    "relation": [
        [
            "",
            "",
            "",
            "",
            "",
            "Computer hardware and software",
            "Equipment under capital lease",
            "",
            "",
            "",
            "",
            "",
            "",
            "Computer hardware and software",
            "Equipment under capital lease",
            ""
        ],
        [
            "",
            "",
            "",
            "Cost",
            "",
            "$ 32,900",
            "15,723",
            "$ 48,623",
            "",
            "",
            "",
            "Cost",
            "",
            "$ 25,000",
            "15,723",
            "$ 40,723"
        ],
        [
            "",
            "",
            "Accumulated",
            "depreciation",
            "",
            "$ 25,057",
            "13,430",
            "$ 38,487",
            "",
            "",
            "Accumulated",
            "depreciation",
            "",
            "$ 23,351",
            "9,499",
            "$ 32,850"
        ],
        [
            "",
            "2011",
            "Net book",
            "value",
            "",
            "$ 7,843",
            "2,293",
            "$ 10,136",
            "",
            "2010",
            "Net book",
            "value",
            "",
            "$ 1,649",
            "6,224",
            "$ 7,873"
        ]
    ],
    "pageTitle": "VALIDIAN CORP - FORM 10-K - April 16, 2012",
    "title": "",
    "url": "http://www.getfilings.com/sec-filings/120416/VALIDIAN-CORP_10-K/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989043.35/warc/CC-MAIN-20150728002309-00322-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 473158683,
    "recordOffset": 473063594,
    "tableOrientation": "VERTICAL",
    "TableContextTimeStampAfterTable": "{1017730=Year ending December 31:, 195193=Sales and Marketing Plans:  We started our marketing process during the second quarter of 2000, with our original focus being potential customers located in the United States and Western Europe.  The potential customers and our current marketing program are more fully described in \u0093Part 1. Item 1: Description of Business - Target Market.\u0094  , 1060250=During the year ended December 31, 2011, the Corporation issued 266,666 shares of its common stock, valued at $6,652, in settlement of $8,000 in accounts payable.  A gain of $1,348 on the settlement of accounts payable was recognized in connection with this transaction.  Also during the year ended December 31, 2011, the Corporation transferred fully depreciated office furniture in satisfaction of $4,377 in accounts payable.  A gain of $4,377 on settlement of accounts payable was recognized in connection with this transaction., 153048=193,813 shares of our common stock to an accredited investor pursuant to the $39,012 in principal amount of the 10% senior convertible note, which was issued December 31, 2011;, 209770=Depreciation of property and equipment: Depreciation of property and equipment was $5,637 during the year ended December 31, 2011, an increase of $31 (1%), from the $5,606 charged to depreciation expense during the year ended December 31, 2010.  Some of our capital assets became fully depreciated during the year ended December 31, 2011, which eliminated the periodic depreciation charges associated with those assets; the addition of $7,900 of new computer equipment increased depreciation charges associated with those assets, resulting in very little change in the overall depreciation expense for the year., 212926=Gain on extinguishment of debt and accrued liabilities:  During the year ended December 31, 2011, we recorded a net gain on extinguishment of debt and accrued liabilities in the amount of $5,725, on the issuance of our common stock, and on the transfer of fully depreciated, unused capital assets, in settlement, 1119335=On March 21, 2012, holders of the Corporation\u0092s convertible promissory notes exercised the conversion feature of the notes and converted $10,000 in principal in exchange for 961,538 shares of the Corporation\u0092s common stock., 149194=1,007,077 shares of our common stock to an accredited investor pursuant to the conversion on December 31, 2011 of $25,000.00 in principal amount plus $5,212 in accrued interest of our 10% senior convertible notes issued November 30, 2009 at a conversion rate of $0.03 per share;, 203158=The fiscal year ended December 31, 2011 compared to the fiscal year ended December 31, 2010, 68256=Year ended December 31,, 267075=1999 to, 373262=Balances at December 31,, 13125=The aggregate market value of the voting and non-voting common equity held by non-affiliates computed by reference to the average between the closing bid ($0.02) and asked ($0.02) price of the registrant’s Common Stock as of June 30, 2011, the last business day of the registrant\u0092s most recently completed second fiscal quarter, was $1,890,758, based upon the average between the closing bid and asked price ($0.02) multiplied by the 94,537,914 shares of the issuer\u0092s Common Stock held by non-affiliates. (In computing this number, issuer has assumed all record holders of greater than 5% of the common equity and all directors and officers are affiliates of the registrant.), 886160=2010, 774145=  2009, 1015241=At December 31, 2011, the fair value of the stock issuable to fully convert the convertible promissory note principal was $364,651, which exceeds the principal amount by $251,651., 1093303=2027, 984229=During the year ended December 31, 2011, the Corporation issued an aggregate of $1,903,810 of its 10% senior convertible notes, and settled an aggregate of $1,670,695 of these notes.  $161,500 of the notes issued during the year, were issued for cash; $89,584 were issued in settlement of accounts payable; $303,847 were issued as consideration for the repayment of $289,658 in 12% convertible notes, plus $14,189 in accrued interest thereon; $95,681 were issued as consideration for the repayment of $83,356 in promissory notes, plus $12,325 in accrued interest thereon;  and $1,253,199 of the notes were issued as consideration for the repayment of $1,035,248 in previously issued 10% senior convertible notes, plus $217,951 in accrued interest thereon., 1120903=The report of KPMG regarding our financial statements for the last two fiscal years ended December 31, 2009 did not contain any adverse opinion or disclaimer of opinion and was not qualified or modified as to uncertainty, audit scope or accounting principles, except to indicate that there is substantial doubt about our ability to continue as a going concern., 239386=2011, 878750=  2011, 153881=190,384 shares of our common stock to an accredited investor pursuant to the $63,461 in principal amount of the 10% senior convertible note, which was issued December 31, 2011;, 1093961=2029, 223302=Sources of Capital:    Our principal sources of capital for funding our business activities have been the private placements of debt and equity securities.  During the year ended December 31, 2011, we issued $161,500 of our 10% senior convertible notes, and $185,500 in convertible promissory notes, which generated cash for funding operations.  We issued a further $1,253,199 in 10% senior convertible notes in settlement of previously issued 10% senior convertible notes and accrued interest thereon; $95,681 in settlement of promissory notes payable and accrued interest thereon; $89,584 in settlement of accounts payable; and $303,847 in settlement of 12% convertible notes and accrued interest thereon, all of which reduced the cash which would otherwise have been required to settle these liabilities.  We also issued 7,682,556 common shares pursuant to the terms of 10% senior convertible notes issued during the year, and 4,668,845 common shares pursuant to the terms of the 12% convertible notes issued during the year, which reduced the rate of coupon interest which would otherwise have been reflected in these transactions.  In addition to these financing activities, we issued an aggregate of 6,000,000 shares of our common stock to consultants, as consideration for services rendered and to be rendered, which reduced the amount of cash which would otherwise be required to engage these personnel; and we issued 266,666 shares of our common stock in settlement of accounts payable, which reduced the amount of cash which would otherwise have been required to settle this liability., 157354=2,250,000 shares of our common stock to an accredited investor on February 1, 2012 pursuant to terms of an Advisory Agreement as payment for services;, 335935=   2000, 158736=1,000,000 shares of our common stock to an accredited investor on March 1, 2012 pursuant to terms of an Advisory Agreement as payment for services;, 1004844=$40,000 of the convertible promissory notes had a maturity date of November 18, 2011, and could be prepaid during the period from issuance to August 15, 2011, in whole or in part, at various rates ranging from 130% to 145% of the principal balance plus accrued interest to the date of prepayment.  The holder had the option to convert any balance of principal and interest which was unpaid at August 15, 2011 or thereafter, into common stock of the Corporation.  The rate of conversion was calculated as the average of the lowest three trading prices during the ten day period immediately preceding such conversion, discounted by 42%.   The holder of these notes exercised the conversion feature, and converted $40,000 of principal plus $1,600 of accrued interest into an aggregate of 2,461,098 common shares of the Corporation.    , 1140133=Effective May 6, 2005, the Board of Directors of the Company appointed Bruce I. Benn to the positions of President and Chief Executive Officer of the Company.  Effective July 11, 2008, the Board of Directors of the Company appointed Bruce I. Benn also to the positions of Chief Financial Officer and Treasurer of the Company.  Mr. Benn has served as a Director, Executive Vice President and Secretary of the Company since February 2004.  From 1999 until February 2004, he provided services to the Company through Capital House Corporation.  Mr. Benn plays a major role in making key management and strategic decisions and oversees all aspects of corporate finance for the Company.  He has been principally responsible for arranging in excess of $20 million of capital investment for the Company from 1999 to date. Since 1989, Mr. Benn has been the President, Director and co-founder of Capital House Corporation, a boutique investment bank that has provided and/or arranged early and mid stage venture capital and hands-on managerial assistance to a portfolio of leading technology software companies. Mr. Benn was also a founder, Director and Officer of DevX Energy, Inc. from 1995 until October 2000. From 1980 to 1993, he was with Corporation House Ltd., where he was a Vice President and a Director from 1985 to 1993. He is an attorney and holds a Masters of Law degree from the University of London, England, a Baccalaureate of Laws from the University of Ottawa, Canada, and a Bachelor of Arts in Economics from Carleton University in Ottawa, Canada., 198811=We will improve and further develop our products based on responses from potential customers.  The costs associated with our product development activities are primarily those currently planned and thus are subject to a high degree of control.  Subject to our ability to obtain adequate funding, we estimate that the cost of our product development program during the year ending December 31, 2012 will be $260,000., 130609=We may have difficulty implementing in a timely manner the internal controls procedures necessary to allow our management to report on the effectiveness of our internal controls, and we may incur substantial costs in order to comply with the requirements of the Sarbanes-Oxley Act of 2002., 351497=For the period from inception on August 3, 1999 to December 31, 2011, 1038590=2010, 1021574=During the year ended December 31, 2011, the Corporation issued an aggregate of 2,500,000 shares of its common stock as incentives for consultants to enter into consulting agreements with the company.  $102,400, representing the aggregate fair value of the stock at issuance, was allocated to shares and additional paid in capital, and was charged to expense., 211433=The $1,507,054 in interest and financing costs we incurred during the year ended December 31, 2011 is comprised of $662,813 of interest paid and payable to the holders of our debt; $838,297 of accretion on our 10% senior convertible notes, 12% convertible notes, and convertible promissory notes; $5,640 of financing costs; and $305 in interest on the capital lease.  The $679,675 in interest and financing costs we incurred during the year ended December 31, 2010 was comprised of $628,129 of interest paid and payable to the holders of our debt; $50,398 of accretion on our 10% senior convertible notes; $597 of financing costs; and $551 in interest on the capital lease., 150595=61,501 shares of our common stock to an accredited investor pursuant to the $20,500 in principal amount of the 10% senior convertible note, which was issued December 31, 2011;, 1092316=2024, 998150=At December 31, 2011, $2,865,025 of the 10% senior convertible notes were secured by a first position lien on all of the assets of the Corporation; the remaining $3,601,240 were unsecured.  As a result of the event of default noted above, holders of the secured notes have the right to exercise their lien on all of the assets of the Corporation., 123867=As of March 31, 2012, our current executive officer and director, and holders of 5% or more of our outstanding common stock together beneficially owned approximately 18% of the outstanding common stock if they exercised all of the options held by them.  These stockholders are able to significantly influence all matters requiring approval by stockholders, including the election of directors and the approval of significant corporate transactions. This concentration of ownership may also have the effect of delaying, deterring or preventing a change in control and may make some transactions more difficult or impossible to complete without the support of these shareholders., 268070=2011, 257878=   In 2011 and 106,554,038 shares in 2010 (note 9(a)), 926892=If the Corporation obtains further financing and generates revenue, it expects to incur operating expenditures of approximately $719,000 for the year ending December 31, 2012. In the event the Corporation cannot raise the funds necessary to finance its research and development and sales and marketing activities, it may have to cease operations., 443901=    2004, 49617=We expect that individual sales cycles will be from four to eight months in duration.  The territories where most potential customers reside are expected to be in North America, Europe and Asia Pacific.  At March 31, 2012 we had two sales representatives., 204854=We did not make any commercial sales during the year ended December 31, 2011., 228150=The cost to implement appropriate controls and procedures to ensure compliance with Section 404 of the Act is included in our budget for 2012., 1021144=In connection with the issuance of the Corporation\u0092s 10% senior convertible notes during the year ended December 31, 2011, the Corporation issued 7,682,556 shares of its common stock, with a relative fair value of $187,530, to the holders of the notes (note 5)., 1121945=On March 29, 2011, the Company retained Seale & Beers, CPAs as the Company\u0092s Independent Auditor, who audited our year-end 2010., 199364=General and Administrative Expenses:  Subject to our ability to obtain adequate funding, we expect to spend $329,000 on general and administrative activities during the year ending December 31, 2012., 72660=As at December 31, 2011, we had seven employees and contractual personnel, including one executive officer, two sales and marketing staff, three in research and development and one in administration.  Six are located in Ottawa, Canada and one is located in Memphis, TN.  We also regularly engage technical consultants and independent contractors to provide specific advice or to perform certain marketing or technical tasks., 970775=Included in interest and financing costs for the year ended December 31, 2011 is $23,847 (2010: $16,057) of interest on the promissory notes.  Interest on the promissory notes paid in cash during the year ended December 31, 2011 was $11,950 (2010:  $1,105).  , 1030770=June, 2011, 985144=Under the terms of the notes issued during the year ended December 31, 2011, the holders are permitted, at any time, to convert all or a portion of the outstanding principal plus accrued interest thereon into common stock of the company, at a rate of one common share for each $0.03 of debt converted.  The Corporation has the option of pre-paying all or any portion of the balance outstanding on the notes at any time, without penalty or bonus, with the permission of the holders.  Interest on the notes is accrued until the notes are either repaid by the Company or converted by the holders; holders of $60,000 of the notes are also entitled to receive payment of accrued interest on submission to the Corporation of a written request.  At the Corporation\u0092s option, interest may be paid either in cash or in common shares of the Corporation.  If interest is paid in common shares, the number of shares required for settlement will be calculated at the rate of conversion in effect for the conversion of the note principal.  $303,847 of the notes matured on December 31, 2011; $336,099 of the notes mature on December 31, 2012; and $1,263,864 of the notes are payable on demand.  , 196192=We will continue to focus our marketing efforts on identifying potential customers by presenting technical seminars, participating in trade shows, using the services of public relations firms, market research, the creation and dissemination of technical and commercial collateral materials, the maintenance and periodic re-design of our website, and the placement of advertisements in print and electronic publications.  Subject to our ability to obtain adequate funding, we plan on spending $30,000 on our marketing efforts during the year ending December 31, 2012., 1074097=The carrying value of cash and cash equivalents, amounts receivable, accounts payable and accrued liabilities approximates fair value due to the short term to maturity of these instruments.  The carrying value of the promissory notes, 10% senior convertible notes, 12% convertible notes and convertible promissory notes approximates fair value due to the issuance of new debt instruments having similar terms and conditions subsequent to December 31, 2011.  The fair value of the obligation under capital lease at December 31, 2010 was approximately $2,009, based on the present value of future cash flows as of the balance sheet date, discounted at market rates., 157742=582,281 shares of our common stock to an accredited investor pursuant to the $194,094 in principal amount of the 10% senior convertible note, which was issued February 1, 2012;, 187947=Until we acquired our former subsidiary, Graph-O-Logic, S.A. in August 1999, we had no material or substantive business operations.  Since then, our business has been as more fully described in \" Part I, Item 1: Description of Business\".  Accordingly, in this section we focus solely on the historical business operations of the subsidiary and our current business plan and operations., 237239=50 S. Jones Blvd. Suite 202 Las Vegas, NV 89107 Phone: (888)727-8251 Fax: (888)782-2351, 998667=Included in interest and financing costs for the year ended December 31, 2011 is $605,902 (2010:  $612,071) in coupon rate interest accrued on the 10% senior convertible notes, and $644,784 (2010:  $50,398) in accretion related to the relative fair value of the equity components of the 10% senior convertible notes at issuance., 1090635=2019, 1034649=$4,142, representing the fair value of 375,000 options issued during 2009, and earned by non-employees during the year ended December 31, 2010, was included in expense for that year.  The fair value of these options was determined using the following weighted average assumptions:  expected dividend yield 0%; risk-free interest of 0.6% - 2.0%; expected volatility of 178% - 195%; and an expected life of 3.0 \u0096 3.75 years., 1023080=On various dates during the year ended December 31, 2011, holders of the convertible promissory notes exercised the conversion feature of the notes, and converted an aggregate of $72,500 in principal and $2,900 in accrued interest, in exchange for 6,979,230 common shares of the Corporation (note 7).  , 238916=December 31, 2011 and 2010, 1007710=$32,500 of the convertible promissory notes mature on September 3, 2012, and may be prepaid during the period from issuance to May 26, 2012, in whole or in part, at various rates ranging from 130% to 145% of the principal balance plus accrued interest to the date of prepayment.  The holder has the option to convert any balance of principal and interest which is unpaid at May 26, 2012 or thereafter, into common stock of the Corporation.  The rate of conversion is to be calculated as the average of the lowest three trading prices during the ten day period immediately preceding such conversion, discounted by 42%.   , 784553=Balances at December 31, 2009, 1034083=$2,235, representing the fair value of 75,000 options issued during 2009, and earned by non-employees during the year ended December 31, 2011, has been included in expense.  The fair value of these options was determined using the following weighted average assumptions:  expected dividend yield 0%; risk-free interest of 1.93%; expected volatility of 191%; and an expected life of 4 years., 3743=ANNUAL REPORT PURSUANT TO SECTION 13 OR 15 (d) OF THE SECURITIES EXCHANGE ACT OF 1934, 1023555=On March 21, 2011, the Corporation issued 266,666 shares of its common stock in settlement of $8,000 in accounts payable.  A gain of $1,348 was recognized on this transaction., 139277=January 1 to March 31, 14725=SEC 2337 (3-10), 1118280=During the period from January 1, 2012 to April 12, 2012, the Corporation issued an aggregate of 1,150,000 shares of its common stock in respect of consulting services rendered., 999171=At December 31, 2011, the fair value of the stock issuable to fully convert the 10% senior convertible note principal, was $7,010,009, which exceeds the principal amount by $543,744., 150118=243,242 shares of our common stock to an accredited investor pursuant to the conversion on December 31, 2011 of $8,513 in accrued interest on our 10% senior convertible note issued November 30, 2009 at a conversion rate of $0.03 per share;, 144747=Holders -- There were approximately 207 holders of record of our common stock as of March 31, 2012, inclusive of those brokerage firms and/or clearing houses holding our securities for their clientele, with each such brokerage house and/or clearing house being considered as one holder.  The aggregate number of shares of common stock outstanding as of March 31, 2012 was 151,652,724 shares.  , 233376=We have audited the accompanying balance sheets of Validian Corporation (A Development Stage Company) as of December 31, 2011 and 2010, and the related statements of operations, stockholders\u0092 equity (deficit), and cash flows for each of the years in the two-year period ended December 31, 2011 and 2010 and since inception of development stage on August 3, 1999 through December 31, 2011. Validian Corporation\u0092s management is responsible for these financial statements. Our responsibility is to express an opinion on these financial statements based on our audits., 1004307=During the year ended December 31, 2011, the Corporation issued $185,500 of its convertible promissory notes for cash.  The notes bear interest at the rate of 8% until they mature, or until there is an event of default; thereafter, any portion of the principal or interest which has not been settled will be subject to interest at the rate of 22% per annum.  , 373347=    2002, 47228=During the year ended December 31, 2011, we utilized the services of industry specialists in the health care, government and entertainment sectors. Their mandate was to identify specific areas and a limited number of organizations where our products would facilitate secure communication and the implementation of a strong security infrastructure with ease of deployment and management., 1091660=2022, 347812=   2001, 147495=2,000,000 shares were issued on November 11, 2011, as bonuses to consultants, 205532=Selling, general and administrative expenses: Selling, general and administrative expenses consist primarily of personnel costs, professional fees, communication expenses, occupancy costs and other miscellaneous costs associated with supporting our research and development, sales and marketing and investor relations activities.  During the year ended December 31, 2011 we incurred a total of $664,550, as compared to $500,780, during the year ended December 31, 2010.  There was an overall increase in selling, general and administrative expenses of $163,770 (28%)., 218982=As discussed elsewhere in this report, we have added an explanatory paragraph to our consolidated financial statements for the year ended December 31, 2011.  It states that our economic viability is dependent on our ability to finalize the development of our principal products, generate sales and finance operational expenses, and that these factors, together with our lack of revenues to date, our negative working capital, our loss for the year, as well as negative cash flow from operating activities, and our accumulated deficit, raise substantial doubt regarding our ability to continue as a going concern.  At December 31, 2011, we had negative working capital of $9,806,562 and an accumulated deficit during the, 153462=3,099,523 shares of our common stock to an accredited investor pursuant to the $1,033,174 in principal amount of the 10% senior convertible note, which was issued December 31, 2011;, 1121392=During the two most recent fiscal years and during any subsequent interim period prior to March 29, 2011, there were no disagreements with KPMG on any matter of accounting principles or practices, financial statement disclosure or auditing scope or procedures that, if not resolved to the satisfaction of KPMG, would have caused it to make reference to the subject matter thereof in connection with its report., 1024783=In connection with the issuance of the Corporation\u0092s 10% senior convertible notes during the year ended December 31, 2010, the Corporation issued 1,436,685 of its common shares, with a relative fair value of $29,501, to the holders of the notes (note 5)., 193544=We are a development stage enterprise.  As such, our historical results of operations are unlikely to provide a meaningful understanding of the activities expected to take place during the period through December 31, 2012.  Our major initiatives through December 31, 2012 are:, 214134=Other income (expense):  Other income (expense) is comprised of realized and unrealized gains and losses on foreign currency translations, the majority of which relate to accounts payable and accrued liabilities, and obligations under our promissory notes, denominated in Canadian dollars.  During the year ended December 31, 2011, the Canadian dollar lost strength in relation to the United States dollar, resulting in an $18,433 net gain on foreign currency translations.  During the year ended December 31, 2010, the Canadian dollar gained strength in relation to the United States dollar, resulting in a $56,873 net loss on foreign currency translations., 1156248=2008, 1037442=Following is a summary of stock options outstanding at December 31, 2011 and 2010:, 1033179=The Corporation has two incentive equity plans, under which a maximum of 10,000,000 options to purchase 10,000,000 common shares may be granted to officers, employees and consultants of the Corporation.  The granting of options, and the terms associated with them, occurs at the discretion of the board of directors, who administers the plan.   As of December 31, 2011, a total of 7,700,000 options were granted under these plans, all with an exercise price of $0.04.  2,975,000 of the options expire on June 19, 2012; 4,725,000 expire on dates between May 12, 2013 and December 31, 2013.  All of the options are fully vested.  2,300,000 options remained available for grant under these plans as of December 31, 2011.  , 212239=Total interest and financing costs increased by $827,379 (102%) during the year ended December 31, 2011 as compared with 2010.  Charges to interest as a result of accretion increased by $787,899 (156%), as a result of the equity components of notes issued during 2011 having a higher relative fair value than those issued during 2010.  There was also an increase of $16,862 (3%) in coupon rate interest charges, which occurred as a result of an overall net increase of $344,153 in the principal balance interest-bearing notes during the year.  , 296326=For the period from inception on August 3, 1999 to December 31, 2011, 1082620=Income tax expense attributable to loss before income taxes was $nil (2010 - $nil) and differed from the amounts computed by applying the U.S. federal income tax rate of 34% (2010 - 34%) to the net loss as a result of the following:, 15624=December 31, 2011, 1001548=Also during the year ended December 31, 2011, $289,658 of the notes and $14,189 in accrued interest thereon were settled through the issuance of $303,847 in 10% senior convertible notes., 96040=Some of our Internet security products utilize and incorporate encryption technology.  Exports of software products utilizing encryption technology are generally restricted by the United States and various other governments, particularly in response to the terrorist acts of September 11, 2001.  If we do not obtain the required approvals, we may not be able to sell some of our products in international markets, which could materially adversely affect our results of operations., 1124704=There were no changes in our internal controls over financial reporting during the quarter ended December 31, 2011 that have materially affected, or are reasonably likely to materially affect, our internal control over financial reporting., 1006902=$53,000 of the convertible promissory notes mature on June 19, 2012, and may be prepaid during the period from issuance to March 13, 2012, in whole or in part, at various rates ranging from 130% to 145% of the principal balance plus accrued interest to the date of prepayment.  The holder has the option to convert any balance of principal and interest which is unpaid at March 13, 2012 or thereafter, into common stock of the Corporation.  The rate of conversion is to be calculated as the average of the lowest three trading prices during the ten day period immediately preceding such conversion, discounted by 42%.   , 1092645=2025, 1153008=2010, 113252=We have two existing stock option plans, one of which had 7,302 shares remaining for issuance as of March 31, 2012, the second of which had 2,292,698 shares remaining for issuance as of March 31, 2012.  Future options issued under these plans may have further dilutive effects., 1102082=The Corporation paid no income taxes during the year ended December 31, 2011, nor during the year ended December 31, 2010.  Interest paid in cash during the years ended December 31, 2011 and December 31, 2010 were $12,254 and $1,656, respectively., 1012617=$144,618, representing the relative fair value of the beneficial conversion feature of the notes, was allocated to additional paid in capital.  The convertible promissory notes are being accreted to their face value over the term of the notes, through periodic charges to interest expense, using the effective interest rate method.  During the year ended December 31, 2011, accretion of $65,900 (2010: $nil)  was recognized, through charges to interest and financing costs, leaving a balance of $78,720 to be accreted over the remaining term of the notes.  , 75882=We incurred a net loss of $2,278,744 and negative cash flow from operations of $299,165 during the year ended December 31, 2011.  During the year ended December 31, 2010, we incurred a net loss of $1,358,341 and negative cash flow from operations of $367,000.  We expect operating losses and negative cash flow from operations to continue for the foreseeable future., 197828=Cost of Sales and Services:  In the event that our sales efforts are successful, we will need to assist our customers in the implementation of our products.  Depending on the success of our sales efforts, and subject to our ability to obtain adequate funding, we expect to spend $10,000 on training and related activities during the year ending December 31, 2012., 885584=December 31,, 140989=2011, 1094652=2031, 267656=December 31,, 884996=1999 to, 1123263=An evaluation was carried out under the supervision and with the participation of our management, including our Chief Executive Officer and Chief Financial Officer, of the effectiveness of the design and operation of our disclosure controls and procedures (as defined in Rules 13a-15(e) and 15d-15(e) under the Securities Exchange Act of 1934, as amended (the \u0093Exchange Act\u0094)) as of the end of the period covered by this report. Based on the evaluation of our disclosure controls and procedures, our Chief Executive Officer and our Chief Financial Officer have concluded that our disclosure controls and procedures were not effective, as a result of the material weaknesses noted below, to ensure that the information required to be disclosed by us in the reports that we file or submit under the Exchange Act was recorded, processed, summarized and reported within the time periods specified in the SEC\u0092s rules and forms and that such information required to be disclosed is accumulated and communicated to management, including our Chief Executive Officer and Chief Financial Officer, to allow timely decisions regarding required disclosure., 239554=2010, 1131388=Lack of segregation of duties.  Since commencing the development phase of our operations in August 1999, our size has prevented us from being able to employ sufficient resources to enable us to have an adequate level of supervision and segregation of duties within our internal control system.  Effective July 2008, we have had only two individuals, our controller and our chief financial officer, involved in the accounting functions of the Corporation, including the processing of accounting entries and generating interim and year-end financial reports.  Additionally, our chief financial officer is also our chief executive officer and sole officer and director.  We are therefore inadequately staffed at this time to ensure a sufficient level of segregation of duties.  As a result, this significant internal control deficiency had not been remediated as of the end of the period covered by this report, nor do we know if we will be able to remediate this weakness in the foreseeable future.  However, we will continue to monitor and assess the costs and benefits of additional staffing., 1128985=In connection with the audit of our consolidated financial statements for the year ended December 31, 2011, our management identified the existence of certain significant internal control deficiencies that they considered to be material weaknesses.  In particular, we identified the following weaknesses in our internal control system at December 31, 2011:  (1) a lack of segregation of duties; (2) the lack of timely preparation of certain back up schedules; (3) finance staff\u0092s lack of sufficient technical accounting knowledge; (4) a lack of independent Board oversight; and (5) signing authority with respect to corporate bank accounts.  The independent registered public accounting firm indicated that they considered these deficiencies to be reportable conditions as that term is defined under the standards established by the American Institute of Certified Public Accountants.  Notwithstanding the material weakness identified by our independent registered public accountants, we believe that the financial statements, and other financial information included in this report, fairly present in all material respects, the financial condition, results of operation and cash flows of the Corporation as of, and for, the periods represented in this report., 187534=In this section, we explain our consolidated financial condition and results of operations for the years ended December 31, 2011 and December 31, 2010. As you read this section, you may find it helpful to refer to our Consolidated Financial Statements in Item 8 of this annual report., 304101=Balances at December 31,, 1068417=$139,373 (2010 - $84,698) in accrued interest charges relating to these notes is included in accrued liabilities; $64,166 (2010 - $75,152) in coupon-rate interest on these notes is included in interest and finance costs., 1022106=During the year ended December 31, 2011, the Corporation issued an aggregate of 3,500,000 shares of its common stock to consultants as partial consideration for services rendered. $63,800, representing the fair value of the stock at issuance, was allocated to shares and to additional paid in capital, and was charged to expense., 1038360=2011, 237113=April 11, 2012, 1024381=In connection with the issuance of the Corporation\u0092s 12% convertible notes during the year ended December 31, 2011, the Company issued 4,668,845 shares of its common stock, with a relative fair value of $94,503, to the holders of the notes (note 6)., 1022603=On various dates during the year ended December 31, 2011, holders of the 10% senior convertible notes exercised the conversion feature of the notes, and converted an aggregate of $224,332 in principal and $58,918 in accrued interest, in exchange for 9,441,669 common shares of the Corporation (note 5).  , 155654=1,500,000 shares of our common stock to an accredited investor on January 15, 2012 pursuant to terms of an Advisory Agreement as payment for services;, 230796=Years ended December 31, 2011 and 2010, 990719=Under the terms of the notes issued during the year ended December 31, 2010, the holders are permitted, at any time, to convert all or a portion of the outstanding principal plus accrued interest thereon into common stock of the company, at a rate of one common share for each $0.03 of debt converted.  The Corporation has the option of pre-paying all or any portion of the balance outstanding on the notes at any time, without penalty or bonus, with the permission of the holders.  Interest on the notes is accrued until the notes are either repaid by the Company or converted by the holders; holders of $430,083 of the notes are also entitled to receive payment of accrued interest on submission to the Corporation of a written request.  At the Corporation\u0092s option, interest may be paid either in cash or in common shares of the Corporation.  If interest is paid in common shares, the number of shares required for settlement will be calculated at the rate of conversion in effect for the conversion of the note principal.  $325,469 of the notes matured on December 31, 2010; $265,729 of the notes are payable on demand.  Notwithstanding the stated maturity dates, all of the notes issued during the year ended December 31, 2010 are payable on demand, pursuant to the default provisions of the notes, as described below., 68654=2010, 925775=The consolidated financial statements have been prepared assuming that the Corporation will continue as a going concern.  The Corporation has no revenues, has negative working capital of $9,806,562, has accumulated a deficit of $37,627,290 as at December 31, 2011, and has incurred a loss of $2,278,744 and negative cash flow from operations of $299,165 for the year then ended.  Furthermore, the Corporation failed to settle certain of its promissory notes and 10% senior convertible notes when they matured on various dates during the years 2007 through 2010, resulting in a condition of default for all of the 10% senior convertible notes and $36,250 of the promissory notes; a significant portion of these notes remain in default as at December 31, 2011.  In addition, the Corporation expects to continue to incur operating losses for the foreseeable future, and has no lines of credit or other financing facilities in place.  , 1005879=$32,500 of the convertible promissory notes matured on January 30, 2012, and could be prepaid during the period from issuance to October 24, 2011, in whole or in part, at various rates ranging from 130% to 145% of the principal balance plus accrued interest to the date of prepayment.  The holder has the option to convert any balance of principal and interest which is unpaid at October 24, 2011 or thereafter, into common stock of the Corporation.  The rate of conversion was calculated as the average of the lowest three trading prices during the ten day period immediately preceding such conversion, discounted by 42%.   The holder of these notes exercised the conversion feature, and converted $32,500 of principal plus $1,300 of accrued interest into an aggregate of 4,518,134 common shares of the Corporation.    , 2150=Expires: April 30, 2012, 159463=961,538 shares of our common stock to an accredited investor pursuant to the conversion on March 21, 2012 of $10,000 in principal amount of our convertible promissory note issued September 15, 2011 at a conversion rate of $0.0104 per share;, 208507=Research and development expenses: Research and development expenses consist primarily of personnel costs, consulting fees and travel expenses directly associated with the development of our software applications.  During the year ended December 31, 2011, we spent $125,661 developing our software applications, compared to $115,407 during the year ended December 31, 2011.  There was an overall increase in research and development expenses of $10,254 (9%)., 199710=In summary, provided we are able to obtain adequate funding, we expect to spend a total of $719,000 for all expenses during the year ending December 31, 2012, subject to our ability to generate revenues from the licensing of our products and our ability to raise additional capital., 149710=105,000 shares of our common stock to an accredited investor pursuant to the 10% senior convertible note, principal amount of $35,000, which was issued December 31, 2011;, 256936=Common stock ($0.001 par value.  Authorized 700,000,000 shares in 2011, 961524=The following table sets forth the financial statement presentation of the promissory note proceeds on issuance, and the changes in the financial statement presentation of the balance allocated to the notes as at and for the years ended December 31, 2011 and 2010:, 986869=Holders of the notes issued during the year ended December 31, 2011 were granted 7,682,556 common shares of the Corporation upon issuance of the notes; $187,530, representing the relative fair value of the common shares at the issuance date, was allocated to the common shares par value and additional paid in capital., 990091=During the year ended December 31, 2010, the Corporation issued an aggregate of $591,198 of its 10% senior convertible notes, and settled an aggregate of $336,455 of these notes.  $235,000 of the notes issued during the year, were issued for cash; $597 were issued in settlement of finance fees; and $355,600 of the notes were issued as consideration for the repayment of $336,455 in previously issued 10% senior convertible notes, plus $19,146 in accrued interest thereon., 1116540=During the period from January 1, 2012, to April 12, 2012, the Corporation issued an aggregate of $689,111 of its 10% senior convertible notes.  $174,000 of the notes were issued for cash; $321,745 of the notes were issued in settlement of previously issued 10% senior convertible notes and accrued interest thereon; and $193,366 of the notes were issued in settlement of previously issued 12% convertible notes and accrued interest thereon.  The notes permit the holders, at any time, to convert all or a portion of the outstanding principal plus accrued interest into common stock of the Corporation at a ratio of one common share for each $0.03 of debt converted; the Corporation may pre-pay all or any portion of the balance outstanding on the note at any time without penalty or bonus, with permission from the holder; interest is payable on conversion of the notes, and may, at the Corporation\u0092s option, be paid in either cash, or in common shares of the Corporation at the rate of one common share for each $0.03 of interest paid.  The Corporation issued an aggregate of 1,919,515 shares of its common stock to the holders pursuant to the terms of these notes., 1144434=To our knowledge, based solely on a review of such materials as are required by the Securities and Exchange Commission, none of our officers, directors or beneficial holders of more than ten percent of our issued and outstanding shares of common stock failed to timely file with the Securities and Exchange Commission any form or report required to be so filed pursuant to Section 16(a) of the Securities Exchange Act of 1934, during the year ended December 31, 2011., 560575=Balances at December 31, 2006, 1144247=Compliance with Section 16(a) of The Securities Exchange Act of 1934, 1068109=Included in promissory notes payable (note 4) is $71,649 (2010 - $90,754) payable to the director and to a company controlled by the director., 4075=For the fiscal year ended December 31, 2011, 179178=December 31, 188649=We prepare our financial statements in accordance with generally accepted accounting principles in the United States of America.  The preparation of financial statements in conformity with generally accepted accounting principles requires management to make estimates and assumptions that affect the reported amounts of assets and liabilities and related disclosures of contingent assets and liabilities at the date of the financial statements, and the reported amounts of revenues and expenses during the reporting period.  Significant accounting policies and methods used in preparation of the financial statements are described in note 2 to our 2011 Consolidated Financial Statements included with this Annual Report on Form 10-K for the year ended December 31, 2011.  We evaluate our estimates and assumptions on a regular basis, based on historical experience and other relevant factors.  Actual results could differ materially from these estimates and assumptions.  The following critical accounting policies are impacted by judgments, assumptions and estimates used in preparation of our December 31, 2011 Consolidated Financial Statements., 159941=72,000 shares of our common stock to an accredited investor pursuant to the $24,000 in principal amount of the 10% senior convertible note, which was issued April 2, 2012., 725691=Balances at December 31, 2008, 132950=Our Canadian office is located at 6 Gurdwara Rd., Suite 100, Ottawa, Canada, K2E 8A3. The telephone number is (613) 230-7211.  Our United States office is located at 4651 Roswell Road, Suite B-106, Atlanta, Georgia 30342, telephone number (404) 256-1963., 1120699=On March 29, 2011, the Company dismissed its Independent Auditor from KPMG., 1013346=$13,000 in finance fees were incurred in relation to the convertible promissory notes, and are being charged to interest and financing costs over the term of the notes, using the effective interest rate method.  During the year ended December 31, 2011, $5,640 (2010:  $nil) was charged to interest and financing costs in relation to these finance fees, leaving a balance of $7,360 to be amortized to expense over the remaining terms of the notes, which range from one month to 9 months., 478021=    2005, 134653=During 2010, the Company entered into legal proceedings against Mobile Secure, Inc. over the failure of Mobile Secure, Inc. to deliver certain software it had contracted with the Company to develop and deliver versus payment of the balance of the contracted amount to be paid to Mobile Secure, Inc. by the Company against that delivery to, and testing and acceptance by, the Company., 1061243=As the Corporation incurred a net loss during the years ended December 31, 2011 and 2010, the loss and diluted loss per common share are based on the weighted-average common shares outstanding during the year.  The following outstanding instruments could have a dilutive effect in the future:, 1002482=At December 31, 2011, the fair value of the stock issuable to fully convert the 12% convertible note principal, was $206,764, which exceeds the principal amount by $29,538., 1091333=2021, 235956=The accompanying financial statements have been prepared assuming that the Company will continue as a going concern.  As discussed in Note 2a to the financial statements, the Company has no revenues, has negative working capital at December 31, 2011, has incurred recurring losses and recurring negative cash flow from operating activities, and has an accumulated deficit which raises substantial doubt about its ability to continue as a going concern.  Management\u0092s plans concerning these matters are also described in Note 2a.  The financial statements do not include any adjustments that might result from the outcome of this uncertainty., 322067=   1999, 225076=During the period from January 1 to April 12, 2011, we issued $174,000 of our 10% senior convertible notes, the proceeds of which were used to fund operations.  We also issued a further $321,745 of our 10% senior convertible notes in settlement of previously issued 10% convertible notes and accrued interest thereon, and $193,366 of these notes in settlement of previously issued 12% convertible notes and accrued interest thereon, both of which reduced our requirement for cash settlement.  In connection with these, 151395=25,611 shares of our common stock to an accredited investor pursuant to the $8,537 in principal amount of the 10% senior convertible note, which was issued December 31, 2011;, 140130=July 1 to September 30, 1117888=During the period from January 1, 2012 to April 12, 2012, the Corporation issued an aggregate of 6,000,000 shares of its common stock to consultants in respect of contract initiation fees relating to three separate contracts., 140558=October 1 to December 31, 806810=  2010, 152221=41,573 shares of our common stock to an accredited investor pursuant to the $13,858 in principal amount of the 10% senior convertible note, which was issued December 31, 2011;, 4657=TRANSITION REPORT PURSUANT TO SECTION 13 OR 15 (d) OF THE SECURITIES EXCHANGE ACT OF 1934, 163328=Year Ended December 31, 196891=Our sales representatives, who are compensated on a base compensation plus commission basis, will follow up with potential customers identified through our marketing efforts, with the objective of more fully explaining the benefits of our products and negotiating the terms of the licensing of our products.  Subject to our ability to obtain adequate funding, we expect to spend approximately $90,000 on our sales initiatives, including compensation and travel expenses, during the year ending December 31, 2012.  , 2484= per response:  2100, 948398=The Corporation does not recognize adjustments in the liability for unrecognized income tax benefits.  As of December 31, 2011, the Corporation had approximately $9,050,000 of unrecognized tax benefits, all of which would affect the Corporation\u0092s effective tax rate if recognized., 68483=2011, 144436=On March 31, 2012, the closing price of our common stock was $0.0218 per share., 1119016=On March 9, 2012, the Corporation paid $6,029 as full settlement of accounts payable of $42,062.  A gain of $36,033 was realized on the transaction., 1091987=2023, 662140=Balances at December 31, 2007, 885976=2011, 132402=We were incorporated in Nevada on April 12, 1989 as CCC Funding Corp. to seek out one or more potential business ventures.  On January 28, 2003, we changed our name from Sochrys.com Inc. to Validian Corporation., 924739=Since August 3, 1999, the efforts of the Corporation have been devoted to the development of a high speed, highly secure method of transacting business using the internet, and to the sale and marketing of the Corporation\u0092s products.  , 146084=Sales of Unregistered Securities--During the three months ended December 31, 2011, we issued the following:, 1027125=On June 21, 2011, the 3,120,000 Series I warrants expired., 1001902=Included in interest and financing costs for the year ended December 31, 2011 is $28,572 (2010:  $nil) relating to accrued coupon-rate interest on the 12% convertible notes; also included in interest and financing costs for the year ended December 31, 2011 is $127,614 (2010:  $nil) relating to the accretion of the relative fair value of the equity components of the 12% convertible notes at issuance., 216836=General:  Since inception, we have funded our operations from private placements of debt and equity securities.  In addition, until September 1999, we derived revenues from consulting contracts with affiliated parties, the proceeds of which were used to fund operations.  Until such time as we are able to generate adequate revenues from the licensing of our software applications, we cannot assure that we will be successful in raising additional capital, or that cash from the issuance of debt securities, the exercise of existing warrants and options, and the placements of additional equity securities, if any, will be sufficient to fund our long-term research and development and selling, general and administrative expenses., 923649=Years ended December 31, 2011 and 2010, 772817=Balances at December 31,, 1067643=Included in 10% senior convertible notes (note 5) is $611,887 (2010 - $611,887) payable to the director and to a company controlled by the director, and $47,558 (2010 - $39,632) payable to an individual related to the director and a company controlled by an individual related to the director.  , 214942=Net loss: We incurred a loss of $2,278,744 ($0.02 per share) for the year ended December 31, 2011, compared to a loss of $$1,358,341 ($0.01 per share) for the year ended December 31, 2010.   Our revenues and future profitability and future rate of growth are substantially dependent on our ability to:, 1127774=Under the supervision and with the participation of management, including its principal executive officer and principal financial officer, our management assessed the design and operating effectiveness of internal control over financial reporting as of December 31, 2011 based on the framework in Internal Control \u0097 Integrated Framework issued by the Committee of Sponsoring Organizations of the Treadway Commission (COSO)., 999688=During the year ended December 31, 2011, the Corporation issued an aggregate of $446,884 of its 12% convertible notes in settlement of $411,115 of its 10% senior convertible notes which matured on December 31, 2010, plus $55,769 in accrued interest thereon.  The notes permit the holders, at any time, to convert all or a portion of the outstanding principal plus accrued interest into common stock of the Corporation at a ratio of one common share for each $0.03 of debt converted.  The Corporation may pre-pay all or any portion of the balance outstanding on the note at any time without penalty or bonus.  Interest is payable either on payment of the principal amount, or on conversion, pro rata on the converted principal amount.  At the holder\u0092s option, interest may be paid in either cash or in common shares of the Corporation at the rate in effect for conversion of the principal.  The notes are payable on demand., 205059=Since August 1999, we have directed all of our attention towards the completion, and sales and marketing of our software applications.  We believe that if we are successful in our development and sales and marketing efforts, we will generate a source of revenue in the future from sales and/or licensing of our software applications.  , 210521=Interest and financing costs:  Interest and financing costs during the year ended December 31, 2011 consisted of interest and financing costs associated with our 10% senior convertible notes, our 12% convertible notes, our convertible promissory notes, our promissory notes and interest on the capital lease.  Interest and financing costs during the year ended December 31, 2010 consisted of interest and financing costs associated with our 10% senior convertible notes, our promissory notes and interest on the capital lease.  During the year ended December 31, 2011, we incurred $1,507,054 in interest and financing costs, an increase of $827,379 (102%) over the $679,675 in interest and financing costs incurred during the year ended December 31, 2010.  , 264615=Years ended December 31, 2011 and 2010 and the period from August 3, 1999 to December 31, 2011, 945537=In adopting ASC Topic 718, the Corporation applied the modified-prospective transition method.  Under this method, the Corporation has recognized compensation costs for all share-based payments granted, modified, or settled after January 1, 2006, as well as for any awards that were granted prior to January 1, 2006 for which the requisite service had not been provided as of that date (unvested awards).  , 992238=Holders of the notes issued during the year ended December 31, 2010 were granted 1,436,685 common shares of the Corporation upon issuance of the notes; $29,501, representing the relative fair value of the common shares at the issuance date, was allocated to the common shares par value and additional paid in capital., 1013995=Also during the year ended December 31, 2011, $4,493 (2010:  $nil) in coupon rate interest relating to the convertible promissory notes was charged to interest and financing costs., 227012=Uses of Capital:  Over the past several years, we have scaled our development activities to the level of available cash resources.  Research and development expenses for the year ended December 31, 2011 increased by approximately 9% as compared to the year ended December 31, 2010.  Selling, general and administrative expenses for the year ended December 31, 2011 increased by approximately 33% as compared to the year ended December 31, 2010, due to several factors, including the engagement of several new consultants to assist us in identifying potential funding sources, and as explained more fully under \u0093Results of Operation.\u0094, 1151610=2011, 256030=   shares; issued and outstanding Nil shares in 2011, 1132645=Lack of timely preparation of back up schedules.  Throughout 2011 and 2010, we were able to complete most of our back up schedules prior to the arrival of our independent registered public accountants\u0092 audit staff, however, during this time we consistently experienced a lack of complete preparedness.  As such, we believe that this material weakness had not been remediated as of the end of the period covered by this report.  Inasmuch as this deficiency is related to our lack of adequate staffing, which is a condition which our size prohibits us from remediating, we do not know if we will be able to remediate this weakness in the foreseeable future.   We will continue to review our procedures, and to make changes wherever practicable which will assist in remediating this deficiency., 156042=100,667 shares of our common stock to an accredited investor pursuant to the conversion on January 30, 2012 of $3,020 in accrued interest of our 10% senior secured convertible note issued February 10, 2011 at a conversion rate of $0.03 per share;, 151807=125,068 shares of our common stock to an accredited investor pursuant to the $39,584 in principal amount of the 10% senior convertible note, which was issued December 31, 2011;, 235282=In our opinion, the financial statements referred to above present fairly, in all material respects, the financial position of Validian Corporation (A Development Stage Company) as of December 31, 2011 and 2010, and the related statements of operations, stockholders\u0092 equity (deficit), and cash flows for each of the years in the two-year period ended December 31, 2011 and 2010 and since inception of development stage on August 3, 1999 through December 31, 2011  in conformity with accounting principles generally accepted in the United States of America., 1093632=2028, 884406=August 3,, 304187=   1998, 160359=The foregoing securities were issued in reliance upon the exemption provided by Sections 3(a)(9) or 4(2) under the Securities Act of 1933 and the rules promulgated thereunder, 1008518=$27,500 of the convertible promissory notes mature on September 14, 2012, and may be prepaid during the period from issuance to June 8, 2012, in whole or in part, at various rates ranging from 130% to 145% of the principal balance plus accrued interest to the date of prepayment.  The holder has the option to convert any balance of principal and interest which is unpaid at June 8, 2012 or thereafter, into common stock of the Corporation.  The rate of conversion is to be calculated as the average of the lowest three trading prices during the ten day period immediately preceding such conversion, discounted by 42%.   , 1014317=The discount to market conversion feature of the convertible promissory notes causes a theoretical possibility that the Corporation may be required to settle the notes by issuing more shares than are authorized.  Furthermore, this feature causes the notes to fall within the FAS 133 definition of a derivative liability.  Management has calculated that the maximum number of shares required to convert the principal plus accrued interest on the convertible notes at December 31, 2011 was 10,565,420, which represents less than 1% of the authorized, unissued shares at that date, and has also estimated that the fair value of the notes at December 31, 2011 approximates face value, therefore no adjustment for fair value restatement has been made., 162010=The selected financial data set forth below with respect to our consolidated statements of operations and cash flows for each of the two fiscal years ended December 31, 2011 and with respect to the consolidated balance sheets as at December 31, 2011 and 2010, are derived from our audited consolidated financial statements included in Item 8 of this report.  The following selected financial data should be read in conjunction with our consolidated financial statements and the notes thereto., 151008=500,000 shares of our common stock to an accredited investor on December 31, 2011 pursuant to terms of an Advisory Agreement as payment for services;, 206244=The increase in this expense occurred primarily as a result of our engaging several consultants during the year.  The remuneration pursuant to these contracts resulted in $189,567 of expense, of which $117,900 was stock-based, and $71,776 was cash based, for which there was no comparable expense during the year ended December 31, 2010.  We also issued a bonus in the form of 1,000,000 common shares, to a consultant, which resulted in a further $18,300 in remuneration expense for which there was no comparable cost during the year ended December 31, 2010.  The increase in fees associated with these contracts was partially offset by a decrease in both marketing and administration remuneration, as a result of the termination of two consulting contracts in September 2011, and by a reduction in audit and related fees., 1137550=The following table sets forth certain information concerning our director and executive officer as of December 31, 2010:, 1128336=Based on its evaluation under the framework in Internal Control \u0097 Integrated Framework, our management concluded that our internal control over financial reporting was not effective as of December 31, 2011, as a result of the material weaknesses noted below. The effectiveness of our internal control over financial reporting as of December 31, 2011 has not been audited by Seale & Beers, CPA's, an independent registered public accounting firm, as stated in their report which is included herein., 209110=During the year ended December 31, 2011, we engaged consultants to perform evaluation, testing and debugging of our software as we introduced a new version of our software in preparation for installations of our products under evaluation licences.  This goal was met, and these installations provided us with feedback required to identify weaknesses and areas for improvement in our software.  During 2010, we met several development goals, but these did not require the same level of development as our 2011 goals.  , 973683= 2011, 993111=The following table summarizes information regarding the 10% senior convertible notes outstanding at December 31, 2011:, 266492=August 3,, 1027317=Following is a summary of stock purchase warrants outstanding at December 31, 2011 and 2010:, 1018097=  2012, 714857=Balances at December 31, 2008, 125694=Certain of our 10% senior convertible notes are secured by a general assignment of all of the assets of the Company, and also provide collateral to the note holder.  The security agreements further provide that in the event of a default, the secured party would have the right to take possession of the collateral and operate the Company.  As of March 31, 2012, all of the 10% senior convertible notes are in default.  If the secured parties were to choose to exercise their rights in accordance with the security agreements, we could lose ownership and or control over our assets, which could have a negative effect on our business operations and the trading price of our common stock., 114440=As of March 31, 2012, we had outstanding 151,652,724 shares of our common stock, of which approximately 26,128,468 shares were \"restricted securities\" as that term is defined under Rule 144 promulgated under the Securities Act of 1933.  These restricted shares are eligible for sale under Rule 144 at various times, upon the expiry of the applicable holding period.  No prediction can be made as to the effect, if any, that sales of shares of common stock or the availability of such shares for sale will have on, 112557=We have issued options to acquire common stock to our employees and certain other persons at various prices, some of which have, or may in the future have, exercise prices at or below the market price of our stock.  As of March 31, 2012, we have outstanding options to purchase a total of 7,700,000 shares of our common stock, all of which have exercise prices at or above the recent market price of $0.02 per share (as of March 31, 2012).  If exercised, these options and warrants will cause immediate and possibly substantial dilution to our stockholders., 138841=2010, 1118623=On January 30, 2012, the Corporation settled $30,000 of its 10% senior convertible notes with a cash payment of $30,000, plus the issuance of 100,667 of its common shares in settlement of $3,020 in accrued interest on the note., 394642=For the period from inception on August 3, 1999 to December 31, 2011, 655633=For the period from inception on August 3, 1999 to December 31, 2011, 197543=Subject to our ability to obtain adequate funding, our sales and marketing expenditures for the year ending December 31, 2012 are expected to total $120,000., 143137=2012, 1023903=Effective April 11, 2011, pursuant to a vote of the common shareholders, the Corporation\u0092s articles of incorporation were amended to increase the authorized share capital from a maximum of 350,000,000 to 750,000,000 shares, including 50,000,000 preferred shares and 700,000,000 common shares, par value $0.001., 13994=The number of shares outstanding of each of registrant\u0092s classes of common equity as of April 9, 2012: 151,724,724., 1054707=The following table presents the total of stock-based compensation included in the expenses of the Corporation for the years ended December 31, 2011 and 2010:, 390487=    2003, 156940=965,234 shares of our common stock to an accredited investor pursuant to the $321,745 in principal amount of the 10% senior convertible note, which was issued February 1, 2012;, 259856=Treasury stock (7,000 shares in 2011 and 2010 at cost), 1154658=2009, 986505=Notwithstanding the stated maturity dates, all of the notes issued during the year ended December 31, 2011 are payable on demand, pursuant to the default provisions of the notes, as described below., 1091006=2020, 6703=58-2541997, 156526=300,000 shares of our common stock to an accredited investor pursuant to the $100,000 in principal amount of the 10% senior convertible note, which was issued January 23, 2012;, 148805=1,000,000 shares of our common stock to an accredited investor on December 31, 2011 pursuant to terms of an Advisory Agreement as payment for services;, 402343=   2003, 139704=April 1 to June 30, 989319=The Corporation failed to settle certain of its 10% senior convertible notes plus accrued interest thereon when they matured on various dates between October 1, 2008 and December 31, 2010.  At December 31, 2011, a significant portion of these notes remained in default for non payment.  As a result of these non-payment defaults, all of the 10% senior convertible notes are in default at December 31, 2011, in accordance with the default provisions of the notes, and consequently are payable on demand.  Interest is accrued at the coupon rate on all notes outstanding past the maturity date., 1094290=2030, 956811=2010, 360075=    2001, 117483=that are not traded on a national securities exchange that has been continuously registered since April 20, 1992 and has maintained quantitative initial and continued listing standards that are substantially similar to or stricter than the listing standards in place at January 8, 2004;, 155324=During the period from January 1 to April 9, 2011, we issued the following:  , 131025=The Sarbanes-Oxley Act of 2002 has introduced many new requirements applicable to us regarding corporate governance and financial reporting.  Among many other requirements is the requirement under Section 404 of the Act for management to report on our internal controls over financial reporting.    Although our management has begun the necessary processes and procedures for issuing its report on our internal controls, we cannot be certain that we will be successful in complying with Section 404, due to the limitations imposed by our size and resultant inadequate staffing, as is more fully described under \u0093Item 9a.  Controls and Procedures\u0094.  We expect to devote substantial time and to incur costs to implement appropriate controls and procedures to ensure compliance, at such time as our size permits us to do so.  If we are not able to timely comply with the requirements set forth in Section 404, we might be subject to sanctions or investigations by regulatory authorities.  Any such action could adversely affect our business and financial results., 217723=Our cash and cash equivalents increased by $13,843 during the year ended December 31, 2011, from a balance of $(1,877) at December 31, 2010, to $11,957 at December 31, 2011, primarily as a result of our financing activities, which generated $315,782 in net cash proceeds from the issuance of our promissory notes, 10% senior convertible notes and convertible promissory notes, net of repayments and finance fees. This increase in cash was substantially offset by our net loss of $2,278,744 for the year, which resulted in net cash used in operations of $299,165, and our acquisition of computer equipment for $7,900.  Our cash and cash equivalents decreased by $38,566 during the year ended December 31, 2010, from a balance of $36,689 at December 31, 2009, to $(1,877) at December 31, 2010, primarily as a result of our net loss of $1,358,341 for the year, and resulting cash used in operations of $367,000, which was substantially offset by an increase in cash resulting from the issuance of our 10% senior convertible notes and our promissory notes, which generated proceeds, net of repayments during the year, of $326,590., 148292=2,323,529 shares of our common stock to an accredited investor pursuant to the conversion on December 2, 2011 of $14,500.00 in principal amount plus $1,300 in accrued interest on our convertible promissory note issued April 27, 2011 at a conversion rate of $0.0068 per share;, 147809=1,369,863 shares of our common stock to an accredited investor pursuant to the conversion on November 28, 2011 of $10,000.00 in principal amount of our convertible promissory note issued April 27, 2011, at a conversion rate of $0.0073 per share;, 924335=Validian Corporation (the \u0093Corporation\u0094) was incorporated in the State of Nevada on April 12, 1989 as CCC Funding Corp.  The Corporation underwent several name changes before being renamed to Validian Corporation on January 28, 2003., 1047812=The following table summarizes information regarding stock options outstanding and exercisable at December 31, 2011:, 1142002=The SEC has adopted rules to implement certain requirements of the Sarbanes-Oxley Act of 2002 pertaining to public company audit committees. One of the rules adopted by the SEC requires a company to disclose whether it has an \u0093audit committee financial expert\u0094 serving on its audit committee. We do not have an audit committee financial expert.  The Company and its Board of Directors have experienced difficulties in identifying a suitable candidate to serve as its audit committee financial expert because of the size of the Company, the perceived additional liability to the public by prospective candidates and the excessive additional costs associated with the selection of a candidate, including director fees for the audit committee financial expert and director liability insurance., 204296=During the year ended December 31, 2010, we entered into an agreement with a VAR, pursuant to which we granted the VAR a license to sell our software to the VAR\u0092s customers for a period of one year.  A nonrefundable deposit of $165,000 was received in connection with this contract; revenue will be recognized under this contract as the conditions for recognizing revenue as set out in our accounting policies have been met., 650338=Balances at December 31, 2007, 220809=We anticipate commercial sales during the second or third quarter of 2012, however we cannot be assured that this will be the case.  During the year ended December 31, 2011, there was a reduction of two contractual staff.  We engaged three additional consultants over the course of the year; we did not hire any new employees.  We do not expect to hire any additional personnel during the next six months unless we are successful in raising significant funds through the issuance of our debt or equity securities.  We have not made, nor do we expect to make, any material commitments for capital equipment expenditures during the next twelve months., 1143065=We have adopted a code of ethics that applies to our officers, directors and employees in accordance with applicable federal securities laws. We have filed a copy of our code of ethics as an exhibit to our Annual Report on Form 10-K as filed on April 15, 2011. This document may be reviewed by accessing our public filings at the SEC\u0092s web site at www.sec.gov. In addition, a copy of the code of ethics will be provided without charge upon request to us. We intend to disclose any amendments to or waivers of certain provisions of our code of ethics in a Current Report on Form 8-K, 972767=The following table sets forth the financial statement presentation of the 10% senior convertible note proceeds on issuance, and the changes in the financial statement presentation of the balance allocated to the notes as at and for the years ended December 31, 2011 and 2010:, 213878=of accounts payable and accrued liabilities.  There were no comparable transaction during the year ended December 31, 2010., 220340=development stage of $37,627,290; we incurred a net loss of $2,278,744, and negative cash flow from operations of $299,165 for the year then ended; and note 2(a) to our consolidated financial statements for the year ended December 31, 2011 also discusses the continuing substantial doubt regarding our ability to continue as a going concern., 203345=Revenue:  On January 1, 2006 we entered into an agreement with a Value Added Reseller (\u0093VAR\u0094), pursuant to which we granted the VAR a license to sell our software to the VAR\u0092s customers for a period of three years.  As a result of subsequent delays in completing certain of our software products to a market ready stage, and in consideration of the general market decline during 2009, we have agreed to extend the expiry of this agreement, with terms to be negotiated upon completion of our current development initiatives.  Our fee for this license, excluding applicable sales taxes, was $155,000, of which $151,650 has been collected.  We will recognize revenue in connection with this sale once all of the criteria required for us to do so as set out in our accounting policies, have been met., 882351=Years ended December 31, 2011 and 2010 and the period from August 3, 1999 to December 31, 2011, 152634=201,615 shares of our common stock to an accredited investor pursuant to the $67,205 in principal amount of the 10% senior convertible note, which was issued December 31, 2011;, 268290=2010, 951379=2011, 1092974=2026, 147015=824,742 shares of our common stock to an accredited investor pursuant to the conversion on November 4, 2011 of $8,000.00 in principal amount of our convertible promissory notes issued April 27, 2011, at a conversion rate of $0.0097 per share;, 997629=The maximum number of shares issuable on conversion of all 10% senior convertible notes outstanding at December 31, 2011 was 200,285,984.  Interest is payable in stock or in cash, at the discretion of the Corporation, therefore the potential conversion of the interest portion has not been included in our calculated issuance requirement (note 9(a)).}",
    "textBeforeTable": "FORM 10-K Washington, D.C. 20549 SECURITIES AND EXCHANGE COMMISSION UNITED STATES Estimated average burden hours  per response:  2100 Expires: April 30, 2012 OMB Number: 3235-0420 OMB APPROVAL ex31b.htm EX-31 - CERTIFICATION - VALIDIAN CORP ex32a.htm EX-32 - CERTIFICATION - VALIDIAN CORP ex31a.htm EX-31 - CERTIFICATION - VALIDIAN CORP ex32b.htm EX-32 - CERTIFICATION - VALIDIAN CORP ex23.htm EX-23 - CONSENT - VALIDIAN CORP Financial_Report.xls EXCEL - IDEA: XBRL DOCUMENT - VALIDIAN CORP filename file Attached files (adsbygoogle = window.adsbygoogle || []).push({});",
    "textAfterTable": "SEC 2337 (3-10) Persons who potentially are to respond to the collection of information contained in this form are not required to respond unless the form displays a currently valid OMB control number. 1 VALIDIAN CORPORATION Form 10-K December 31, 2011 Table of Contents PART I 4 Item 1.  Description of Business. 4 Item 1A.  Risk Factors 10 Item 2.  Description of Properties. 19 Item 3.  Legal Proceedings. 20 Item 4.  Mine Safety Disclosures 20 PART II 21 Item 5.  Market for Common Equity and Related Stockholder Matters. 21",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}