{
    "relation": [
        [
            "Categories",
            "Clubs and Activities",
            "Bang for the buck",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "If you are a student athlete looking for a close tight family, that will help you strive to meet your potential, DC might be the place for you. With being small and not as crazy as some big time universities can be, the athletic student body does a great job at supporting one another as well as their own team.",
            "Financial aid can be helpful to those who need it. Also, there are work study jobs that help pay for school and that can work around your class schedule and athletics if you play a sport.",
            "Other than hanging out with friends or teammates, majority of the students live pretty close to DC so they may go home on the weekends. Yes others who stay off campus have parties, but another place people go is to Bowling Green or the local bars downtown.",
            "The food is definitely not like home cooking, lets put that out first. However, the cooks do a good job at providing the best quality of food with what they have. A few selections that I like are the meatloaf, lasagna, chicken patty sandwiches, and subs. We also have a snack bar are where you can get burgers, fries, smoothies, and other little snacks for those late study nights.",
            "Home away from home, the dorm life at DC is pretty good. Mostly everyone knows each other, so by living in the dorms and seeing one another on a daily basis makes it more fun. You may have people playing music in the room, people laughing in the hallways, or students having a movie marathon in the lobby.",
            "Depending on the classes you take and the major you want to pursue, the classes are not all that hard. However, some professors can take it to the extreme when it comes to assignments or papers. Overall, the faculty is helpful whenever you need it, you just have to ask for it. Another good thing is that there are tutors who can work around busy schedules to help make sure students stay on the right track in class work.",
            "Before choosing Defiance, make sure you visit the campus and area. Don't go by what people tell you and get a first hand feel for the college atmosphere. Also, if you're coming from a big school or city like I did, make sure you can stand the slow pace of a small town and college.",
            "Even though it is not as big as other schools, DC is pretty well rounded. The student body is relatively friendly, as well as the faculty members. Students usually make the best out of Defiance."
        ]
    ],
    "pageTitle": "Defiance College Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Defiance-College/reviews",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989043.35/warc/CC-MAIN-20150728002309-00326-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 910127655,
    "recordOffset": 910096180,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{51606=Our classes are based on one on one teaching with staff and students with classes 12:1 teaching., 70087=If you are a student that needed personal attention in classes, Defiance is a great place to get enrolled into. If paying for college is an issue, the business office is very helpful in finding ways to assist you with paying for school. The science and criminal justice majors are very popular here but the class sizes are still around the ratio of 25:1., 1011=1. Make sure to schedule a visit as soon as possible, no one can experience DC well through a pamphlet or website. 2. Prepare for the weather: it is frequently windy year round, cold in the winter, and warm in August-September. 3. Talk to DC students, if you ask an admissions director for a student's e-mail or phone number they'll be happy to help. 4. Don't fret about freshman year., 118300=© 2015, Cappex.com, LLC}",
    "textBeforeTable": "08/01/2009 Reviewer is A current student here. 9 out of 9 people found this review useful. 1 of 26 Bryan from Defiance, OH Check out reviews left by other students or leave your own review. You could win a free scholarship. Defiance College Reviews Defiance College › Ohio › By State › Colleges › } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.create', -->",
    "textAfterTable": "Great for these types of students DC is great for students who like small class sizes and personal attention. Also, if you like to be a part of anything and everything, this is definitely the kind of college for you because of the several different groups on campus. Tips for prospective students Try to get involved in something, anything. This helps to make meet new friends and start the networking process. Also, go to the cafeteria on visit days because that's when the best food is served! Bang for the buck Defiance College is making progress in keeping up with other colleges and universities its size. Upper class dorms have been remodeled with new furniture, a lobby, an exercise room, a kitchen, and a study lounge. The freshman dormitory is on the list of things to do. The athletic complexes are not up to par in most circumstances, but there is a plan in order for a new field house to be developed. The cafeteria does its best to serve a variety of meals, however, there are some meals you may not find something you'll want to eat. Am enjoying being here The friendly atmosphere is what DC so enjoyable. Everybody knows everybody, for better or worse. The",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}