{
    "relation": [
        [
            "Patent application number",
            "20100064828",
            "20100207007"
        ],
        [
            "Description",
            "ROTOR ASSEMBLY INCLUDING STRAIN RELIEF FEATURE - A rotor assembly is provided for deployment within the inner gimbal assembly of a control moment gyroscope (CMG). In one embodiment, the rotor assembly includes a rotor shell, a rotor shaft fixedly coupled to the rotor shell, and a rotor rim. The rotor rim includes an annular body and a strain relief member. A first end portion of the strain relief member is fixedly coupled to the annular body, and a second end portion of the strain relief member is fixedly coupled to the rotor shell to form a rim-shell joinder interface. The strain relief member has a flexibility sufficient to reduce the mechanical stress experienced by the rim-shell joinder interface during operation of the CMG.",
            "VIBRATION ISOLATION MOUNTING ASSEMBLY - A mounting assembly is provided. The mounting assembly comprises an outer ring having a plurality of insert portions, each of the plurality of insert portions extending toward the center of the outer ring and having an insert cavity, a plurality of vibration isolation assemblies, each of the vibration isolation assemblies disposed in one of the insert cavities, each of the plurality of vibration isolation assemblies comprising a first bellows portion and a second bellows portion, a passageway formed therein and connecting the first and second bellows portions, and a contact portion adapted to receive a force, an inner ring having a plurality of contact cavities, each contact cavity adapted to receive a contact portion from one of the plurality of vibration isolation assemblies, and a central ring coupled to the outer ring by the plurality of insert portions, and to the inner ring by a plurality of bridge portions."
        ],
        [
            "Published",
            "03-18-2010",
            "08-19-2010"
        ]
    ],
    "pageTitle": "Davis, AZ - Patent applications",
    "title": "",
    "url": "http://www.faqs.org/patents/inventor/davis-az-3/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989043.35/warc/CC-MAIN-20150728002309-00264-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 446985059,
    "recordOffset": 446966244,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Porter Davis, Anthem, AZ US //]]> BarDraw('3863657',['Patent applications by Porter Davis, Phoenix, AZ US'],[[1,2,1]],['2011','2013','2014'],0); // <script type=\"text/javascript\"> </div> <div id=\"legend3863657\" align=\"center\"></div> </div> <canvas id=\"bg3863657\" style=\"max-width: 500px; width: 100%;\"></canvas> <div> <p align=\"center\">Patent applications by Porter Davis, Phoenix, AZ US</p> <div class=\"bar3863657\" style=\"max-width: 500px; width: 100%; float:left; \"> <div align=\"left\" style=\"padding-top:20px;\"> </table> </tbody> </tr> <td>01-30-2014</td> <td><a href=\"/patents/app/20140026688\">CONTROL MOMENT GYROSCOPES INCLUDING TORSIONALLY-STIFF SPOKED ROTORS AND METHODS FOR THE MANUFACTURE THEREOF</a> - Embodiments of control moment gyroscopes (CMGs) are provided, as are embodiments of a method for fabricating CMGs. In one embodiment, a CMG includes a stator housing, an inner gimbal assembly (IGA), and a torque motor coupled to the stator housing and configured to rotate the IGA housing about a gimbal axis to selectively generate a desired output torque during operation of the CMG. The IGA includes, in turn, an IGA support structure housing rotatably coupled to the stator housing, a monolithic CMG rotor rotatably mounted to the IGA support structure housing, and a spin motor coupled to the IGA support structure housing and configured to rotate the monolithic CMG rotor about a spin axis.</td> <td>20140026688</td> <tr> </tr> <td>11-21-2013</td> <td><a href=\"/patents/app/20130305850\">CONTROL MOMENT GYROSCOPES INCLUDING ROTORS HAVING RADIALLY-COMPLIANT SPOKES AND METHODS FOR THE MANUFACTURE THEREOF</a> - Embodiments of control moment gyroscopes (CMGs) are provided, as are embodiments of a method for fabricating CMGs. In one embodiment, a CMG includes a stator housing, an inner gimbal assembly (IGA), and a torque motor coupled to the stator housing and configured to",
    "textAfterTable": "Ralph H. Davis, Arivaca, AZ US Patent application number Description Published 20120086242 Chair with gun holder - The present invention relates to holding rack for a rifle comprising of a dining chair, a first hook attached to the backrest and extending rearward, and a second hook attached to the stretcher and offset laterally from the first hook, with both hooks being covered with a soft material to protect the rifle. The preferred embodiment of the present invention includes a dining chair having a seat, a stretcher and a backrest, a first hook attached to the back rest and extending rearward thereform; and a second hook attached to the stretcher and extending rearward therefrom, the second hook offset laterally from the first hook; whereby the rifle is engaged in suspension by the first hook through its trigger guard and its barrel rests against the second hook. Both the first and second hooks are covered with a soft material to protect the rifle. The spacing and angle of the hook themselves and the angle at which the hooks attach to the chair being critical for the rifle to rest safely. The chair legs preferable have a glide or cap attached to them with said glide or cap comprised of heavy duty specially formulated k-resin designed for military use, and the angle of the back legs of said chair is critical to stabilize weight when a rifle is mounted into said apparatus. 04-12-2012",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}