{
    "relation": [
        [
            "Product Category",
            "Portable Computers",
            "Desktop/Countertop Computer",
            "Computer & Video Gaming Peripherals",
            "Display Devices",
            "Non-Cellular Telephones & Answering Machines",
            "Cellular Devices & Pagers",
            "Desktop Printers, Scanners, Fax Machines, Copiers & Multi-Function Devices (MFDs)",
            "Home Audio/ Video Systems",
            "Personal/Portable Audio/Video Systems",
            "Home Theatre in a Box (HTB) Systems"
        ],
        [
            "Examples",
            "Laptop computers Notebook computers Tablet computers Netbook computers Microcomputers",
            "Computer terminals Desktop computers used as a server Thin client or Nettop Computers Desktop/tower servers Blade servers installed in a rack-mount frame",
            "Computer mouse & keyboards Trackballs Keypads Touchpad mouse Media readers Routers/Modems Speakers All hard drives including external hard drives Numeric keypads Graphic tablets without display HDMI switches Joysticks Video game console controllers, balance boards, sensors and other input devices Hard drive duplicators Network-Attached Storage devices (NAS) Embedded Multimedia Terminal Adapters (EMTA)",
            "Televisions Computer monitors Professional display monitors Closed circuit monitor screens All-in-One (AIO) computers: a display device with an embedded computer Smart boards Graphic tablets with display greater than 10 inches Portable display devices greater than 10 inches",
            "Telephones (corded & cordless, VoIP, satellite phones) Speaker/conference phones Telephone line answering machines (cassette & digital)",
            "Cellular phones, including those offering camera, video recording and/or audio functions Smart phones (cell-enabled) Cell-enabled PDAs utilizing touch-screen technology Cell-enabled handheld devices Pagers",
            "Desktop printers Desktop scanners Desktop MFDs Camera dock printers Desktop label, barcode, card printers Desktop fax machines Desktop computer scanners Desktop business card scanners Desktop cheque scanners Desktop photo & negative scanners Thermal printers",
            "Video cassette players (VCRs) /video projectors Digital projectors Digital Video Recorders (DVRs) Personal Video Recorders (PVRs) Non-portable Disc players/ recorders (DVD, Blu-ray, etc.) Laser Disc players/recorders Cable & satellite digital receivers /Set-top boxes Converters Non-portable AM/FM and satellite radios Non-portable combination multimedia players Analog & digital video cameras for home security or other closed circuit home use Amplifiers Frequency equalizers Turntables/record players Audio speaker systems Other digital music recorders/players Non-portable combination cassette Karaoke machines Non portable multimedia projectors Multimedia players/recorders Audio speaker systems packages Non portable video game consoles (TV or screen required)",
            "Portable AM/FM and satellite radios Clock radios Portable stereos, including those enabled to connect to wireless Internet Portable tape players/recorders Portable disc (CD, DVD, VHS, Blu-ray, etc.) players/ recorders MP3 players Portable digital players Docking stations for portable digital players, smart phones and other portable devices Portable docking/ compact/folding speakers (wired and wireless including Wi-Fi or Bluetooth) Portable cassette or digital audio/voice recorders Headphones, earphones and microphones Headsets (wired and wireless, including Bluetooth) Digital cameras Digital photo key chains Video cameras/ camcorders Personal Digital Assistants (PDAs) Multi-function satellite radios that include CD, MP3, FM radio or other audio functions Portable scanners (business card/photo negative scanners) Portable printers (e.g., portable photo printers ) Web cameras Digital frames Portable displays – screen size < 10\" Mini laptop computers Sound, image and wave storage devices Handheld barcode scanners Portable two-way radios/FRS radios /GMRS radios/walkie-talkies/CB radios Handheld video game systems E-book readers Handheld satellite radio receivers Portable multimedia projectors Handheld GPS receivers HD antennas",
            "Home theatre image, audio and video equipment sold as a package/bundle with a single point-of-sale SKU supplied from one OEM. Peripheral audio devices. Audio and video equipment sold as a package/bundle that is used in residential and non-residential locations."
        ],
        [
            "EHF/Levy",
            "$0.90",
            "$1.10",
            "$0.20",
            "≤29\": $5.50 30\"-45\" = $9.00 >46\": $24.00",
            "$0.45",
            "$0.07",
            "$1.25",
            "$0.80",
            "$0.25",
            "$0.80"
        ]
    ],
    "pageTitle": "Sears Customer Support & Customer Care | Sears Canada",
    "title": "",
    "url": "http://www.sears.ca/content/customer-support",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989790.89/warc/CC-MAIN-20150728002309-00262-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 686955683,
    "recordOffset": 686876552,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{50651=You are now at the Sign In page. If you are a registered user, you are prompted to enter your \"Email address\" and \"Password\". If you are not already registered, you can do so by clicking on the \"Create an Account\" button. Or, should you not wish to register, click on the \"Continue without sign-in\" link to bypass this page. If you need assistance, please contact a Customer Service Specialist toll-free at 1-888-473-2772., 3319=Effective April 1, 2013 GST (5%) and PST (7%) will apply to orders delivered in BC., 58152=To speak with a Sears representative call 1-888-473-2772 8:00 am - 10 pm EST. It's currently 10:59 AM in our offices., 3688=Effective April 1st, 2013, new Harmonized Sales Taxes (HSTPE) will apply to orders delivered in PE (14%)., 51512=You are now at the Sign In page. If you are a registered user, you are prompted to enter your \"Email address\" and \"Password\". If you are not already registered, you can do so by clicking on the \"Create an Account\" button. Or, should you not wish to register, click on the \"Continue without sign-in\" link to bypass this page. If you need assistance, please contact a Customer Service Specialist toll-free at 1-888-473-2772., 96680=Please speak with one of our departments during operation hours. It's currently 3:48 PM in our offices., 3985=Effective July 1st, 2010, new Harmonized Sales Taxes (HSTON) and (HSTNS) will apply to orders delivered in ON (13%) and NS (15%) respectively., 8794=Unless otherwise stated, \"Lowest Prices of the Season\" and \"Lowest Prices of the Year\" refer to Sears Retail stores, catalogue and website prices, during the time period stated. When we say \"Lowest Prices of the Season\" or \"Lowest Prices of the year\", that means that we have not offered, and will not offer, a lower price for that season or year. The Spring season runs from February 1 to April 30. The Summer season runs from May 1 to July 31. The Fall season runs from August 1 to October 31. The Winter Season runs from November 1 to January 31. The year runs from January 1 to December 31. These statements do not include offers promoted during ‘Black Friday' and ‘Cyber Monday' events, After Christmas Boxing Day/Week sales starting December 25, clearance prices, store closing/moving sales or Outlet/Liquidation store prices., 3213=Effective July 1, 2013 GST (5%) and PST (8%) will apply to orders delivered in MB., 3820=Effective January 1, 2013 QST (9.975%) will apply to orders delivered in PQ. This is in addition to GST (5%).}",
    "TableContextTimeStampAfterTable": "{20281=Starting August 1st, 2012, residents of Manitoba will be able to recycle their old or broken computers and audio/video equipment at convenient drop-off locations in the province. The Electronic Products Recycling Association (EPRA), a non-profit organization, is responsible for managing the program. The program is funded by environmental handling fees (EHF)/ environmental levies applied to the sale of new electronics equipment. These fees help pay for the safe disposal of old electronic products that would otherwise end up in landfill., 50439=As of July 1st 2012, the small appliance program is expanding to include most products that have a plug and/or use batteries – these include: test and measurement tools, power tools, sewing machines, exercise equipment, sports/leisure, and hobby arts & crafts devices., 73841=As of August 1, 2013, Administrative Program Fees (APFs) will be applied to sale and supply of new major appliances in British Columbia. The Major Appliance Recycling Roundtable, a non-profit organization, is responsible for managing the program. These fees help pay for the safe disposal of old major appliance products that would otherwise end up in a landfill., 13789=Copyright 2013. Sears Canada Inc., Sears® and VoyageTM are registered trademarks of Sears, licensed for use in Canada. MasterCard® and the MasterCard Brand Mark are registered trademarks & PayPass is a trademark of MasterCard International Incorporated. Sears Financial credit cards are also known as Sears Card, Sears® MasterCard®, and Sears® VoyageTM MasterCard®) and are issued by JPMorgan Chase Bank, N.A., 62508=Starting July 1st, 2012, residents of British Columbia can recycle their old or broken outdoor power equipment at convenient drop-off locations across the province. The Outdoor Power Equipment Institute of Canada, a non-profit organization, is responsible for managing the program. EHFs/Environmental Levies applied to the sale of new outdoor power equipment finance the collection and recycling costs of these waste products., 44503=Since October 1st, 2011, residents of British Columbia have been able to recycle their old or broken small appliances at more than 100 drop-off locations in the province. The Canadian Electrical Stewardship Association, a non-profit organization, is responsible for managing the program., 55708=Since August 1st, 2007, residents of British Columbia have been able to recycle their old or broken computers and audio/video equipment at more than 110 drop-off locations in the province. The Electronic Products Recycling Association, a non-profit organization, is responsible for managing the program. The program is funded by environmental handling fees/environmental levies applied to the sale of new electronics equipment. These fees help pay for the safe disposal of old electronic products that would otherwise end up in landfill. As of July 1st, 2012, the computers and audio/video program is expanding to include additional items, such as musical instruments, GPS and e-book readers, see the examples below:, 50734=Additional Items as of July 1st 2012, 85619=As of August 1st, 2013, residents of Newfoundland & Labrador will be able to recycle their old or broken computers and audio/video equipment in the province. The Electronic Products Recycling Association, a non-profit organization, is responsible for managing the program. The program is funded by environmental handling fees/environmental levies applied to the sale of new electronics equipment. These fees help pay for the safe disposal of old electronic products that would otherwise end up in landfill., 142295=Copyright © 2015, Sears Canada Inc. All rights reserved, 66158=Since October 1st, 2010, residents of British Columbia have been able to recycle their end-of-life lightbulbs at 195 locations throughout the province. Product Care, a non-profit organization, is responsible for managing the program. As of October 1st, 2012, the program includes all types of bulbs, ballasts and fixtures. All program costs are funded by Environmental Handling Fees (EHF) applied to the sale of new lightbulbs, fixtures and equipment. EHFs cover the cost associated with the safe and responsible disposal of lighting products that would otherwise end up in landfill., 71200=As of August 1, 2013 residents of British Columbia have been able to recycle their electronic toys and battery powered ride-on toys in the province. The Electronic Products Recylcing Association, a non-profit organization, is responsible for managing the program. The Program is funded by environmental handling fees applied to the sale of new electronics equipment. These fees help pay for the safe disposal of old electronic products that would otherwise end up in a landfill.}",
    "textBeforeTable": "Starting August 1st, 2012, residents of Manitoba will be able to recycle their old or broken computers and audio/video equipment at convenient drop-off locations in the province. The Electronic Products Recycling Association (EPRA), a non-profit organization, is responsible for managing the program. The program is funded by environmental handling fees (EHF)/ environmental levies applied to the sale of new electronics equipment. These fees help pay for the safe disposal of old electronic products that would otherwise end up in landfill. Manitoba Environmental Levy on Electronics Manitoba A: Yes, applicable PST will be charged on the amount of the levy. Q: Is there PST on the levy/EHF? A: Yes, applicable GST/HST will be charged on the amount of the levy. Q: If I have Native Indian status, do I have to pay the levy/EHF? A: If the product is purchased, but the pickup or final purchase is in another province that has no levy, you will not be required to pay the levy. Q: What if I buy the product for delivery to another province that has no levy/EHF? A: The levy is applied to all designated products that are delivered to the provinces of Alberta, Saskatchewan, British Columbia, Ontario, Nova Scotia or PEI, regardless of where the item was purchased. Q: What if I buy the product outside the province and have it delivered to the provinces of Alberta, Saskatchewan, British Columbia, Ontario, Nova Scotia or PEI? A: If",
    "textAfterTable": "Exchanges - If a product with a tire levy is exchanged for another product with a tire levy, the final charge will be based on the levies applicable to the final product purchased. GST/PST Applicability - HST/PST applies to the amount of the levy. For Questions and Answers relating to Ontario Environmental Levy on tires, click here Alberta Alberta Environmental Levy on Electronics Environmental levies are collected on electronics sold in Alberta. These levies are used to fund the collection, transport and recycling of unwanted electronics. The levy rates depend on the product category and are listed below. The Levy is: Product Category EHF/Levy Desktop Computers (CPUs & Servers) $4.40 Printers & Printing Combination Devices $4.80 Portable Computers (Laptop, Notebook & Tablet Computers) $1.20 Visual Display Devices with <30\" Screen (Televisions and Monitors) $4.00 Visual Display Devices with >30\" Screen (Televisions and Monitors) $10.00 For orders shipped to Alberta, the Alberta Environmental Levy will appear in the 'PST' field in your Shopping Basket. This charge is not a tax. Sales - The levy will be charged on all sales on CPUs, Laptop Computers, Computer Monitors, Televisions and Printers in Alberta or shipped into Alberta. If the product is purchased in Alberta, but shipped to another province that has no Environmental Levy, no",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}