{
    "relation": [
        [
            "Item:",
            "DHPN115",
            "",
            ""
        ],
        [
            "Type: Socketed Harpoon Tip",
            "A fairly small (for type) somewhat rustic socketed Harpoon Tip made from",
            "a fossilized Walrus tusk and having slight old time damage to it's tip",
            "Era: Inuit/Eskimo 2800 B.P. - Historic Period (early 1800's)"
        ],
        [
            "Provenance:",
            "Recovered from",
            "Point Barrow, Alaska",
            ""
        ],
        [
            "Price",
            "30.00",
            "",
            ""
        ]
    ],
    "pageTitle": "Ancient Native American Indian Artifacts, Relics and Arrowheads - Pacific Northwest Page 1",
    "title": "",
    "url": "http://westernartifacts.com/pacificnw.htm",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986423.95/warc/CC-MAIN-20150728002306-00322-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 272207583,
    "recordOffset": 272194864,
    "tableOrientation": "HORIZONTAL",
    "lastModified": "Sat, 11 Jul 2015 00:58:07 GMT",
    "textBeforeTable": "  Click on the Photo set above for an enlarged photo Shishmaref in Nome, Alaska is in perfect condition, as it was initially made. 150.00 Recovered near the city of A very attractive, medium-sized double-drilled bone Line Sinker which PN3 Price Provenance: Type: Drilled Bone Line Sinker Item:   Click on the Photo set above for an enlarged photo Shishmaref in Nome, Alaska is in perfect condition, as it was initially made. 140.00 Recovered near the city of A fairly large double-drilled bone Line Sinker which PN2 Price Provenance: Type: Drilled Bone Line Sinker Item:",
    "textAfterTable": "Click on the Photo set above for an enlarged photo   Item: Type: 2 Walrus Tusk Ivory Scrapers Provenance: Price DHPN103 A nice pair of Scrapers made from a fossilized Walrus tusk, Recovered from 50.00 one of which is slotted for suspension Point Barrow, Alaska Era: Inuit/Eskimo 2800 B.P. - Historic Period (early 1800's) Click on the Photo set above for an enlarged photo   Item: Type: Harpoon Point Provenance: Price DHPN104 A somewhat rustic, quite aged single-barbed Harpoon Tip Recovered from",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}