{
    "relation": [
        [
            "Categories",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "In three sentences"
        ],
        [
            "Comments",
            "Getting better, but still room to grow. Mainly, hours and options need enhanced for a school of this size.",
            "Dorm placement could be a lot better, and facilities need updated, but they are tolerable until you can move off campus.",
            "You can skate through here with a little effort as possible, or you can apply yourself and face academic challenges. Do the latter.",
            "A quality education for the price. Millersville is a good deal if you can't afford a private school and still want a good education. Many professors are willing to go the extra mile ."
        ]
    ],
    "pageTitle": "Millersville University of Pennsylvania Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Millersville-University-of-Pennsylvania/reviews",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989790.89/warc/CC-MAIN-20150728002309-00335-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 905192783,
    "recordOffset": 905127599,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{226634=People are very friendly around here, I can walk around campus and say hi to many people passing by. The dorms are decent, some of them are very old and falling apart and others are almost luxury. There are plans to knock down the older dorms and build newer ones that will begin after the Fall 2013 semester., 130956=It really isn't that difficult to get accepted. Just make sure you have a decent GPA (the average student has about a 3.0 in high school) and don't blow off the SATs (they usually like a score in the 1200 combined range)., 283781=© 2015, Cappex.com, LLC, 159895=I did not live on campus, but I hear a lot of people complain about the dorms. I hear that they are building new suite style dorms, but they will not be completed until 2015.}",
    "textBeforeTable": "12/29/2009 Reviewer is A current student here. 13 out of 13 people found this review useful. 1 of 61 Aida from Philadelphia, PA Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for",
    "textAfterTable": "Millersville Universities professor provide you with an the tools you need to succeed. The professors strive to build a relationship with you so that they get to learn the type of student that you are. Also because the classroom settings are small you get that chance to be seen as more than just another student. All of the text books are up to date and the resources are impeccable. Login to rate or flag the reviews Laura from Mechanicsburg, PA 10/16/2010 Reviewer is A current student here. 5 out of 5 people found this review useful. 2 of 61 Categories Comments Great for these types of students The school is excellent for any type of education major. Tips for prospective students When applying to Millersville be sure to apply early and send in all of your paperwork as soon as possible. If considering coming to Millersville be aware that there is serious construction going on that will take 10 years to finish all of the plans.",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}