{
    "relation": [
        [
            "Timestamp",
            "2009-05-23",
            "2009-05-23",
            "2009-05-21",
            "2009-05-21",
            "2009-05-21",
            "2008-05-13",
            "2008-05-12",
            "2007-08-09",
            "2007-08-09",
            "2004-04-21",
            "2002-11-27"
        ],
        [
            "Action",
            "Deleted",
            "Added",
            "Deleted",
            "Added",
            "Added",
            "Added",
            "Deleted",
            "Added",
            "Deleted",
            "Added",
            "Added"
        ],
        [
            "Category",
            "DEFINITION",
            "DEFINITION",
            "DEFINITION",
            "DEFINITION",
            "SYNONYM",
            "DEFINITION",
            "DEFINITION",
            "SYNONYM",
            "SYNONYM",
            "SYNONYM",
            "DEFINITION"
        ],
        [
            "Detail",
            "A contractile actin filament bundle that consists of shortnactin filaments with alternating polarity, cross-linked by alpha-actinin and possibly other actin bundling proteins, and with myosin present in a periodic distribution along the fiber.",
            "A contractile actin filament bundle that consists of short actin filaments with alternating polarity, cross-linked by alpha-actinin and possibly other actin bundling proteins, and with myosin present in a periodic distribution along the fiber.",
            "Bundle of microfilaments and other proteins found in fibroblasts.",
            "A contractile actin filament bundle that consists of shortnactin filaments with alternating polarity, cross-linked by alpha-actinin and possibly other actin bundling proteins, and with myosin present in a periodic distribution along the fiber.",
            "actin cable",
            "Bundle of microfilaments and other proteins found in fibroblasts.",
            "Bundle of microfilaments and other proteins found in fibroblasts.",
            "stress fibre",
            "stress fibre",
            "stress fibre",
            "Bundle of microfilaments and other proteins found in fibroblasts."
        ]
    ],
    "pageTitle": "GO:0001725 stress fiber",
    "title": "",
    "url": "http://www.ebi.ac.uk/QuickGO/GTerm?id=GO:0001725",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986423.95/warc/CC-MAIN-20150728002306-00242-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 423030395,
    "recordOffset": 423009842,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{126457=Copyright (c) EMBL-EBI 2013 | EBI is an Outstation of the European Molecular Biology Laboratory | Privacy | Cookies | Terms of use, 126324=EMBL-EBI, Wellcome Trust Genome Campus, Hinxton, Cambridgeshire, CB10 1SD, UK +44 (0)1223 49 44 44}",
    "textBeforeTable": "icon for more details. Synonyms are alternative words or phrases closely related in meaning to the term name, with indication of the relationship between the name and synonym given by the synonym scope. Click on the Synonyms GO:0001725 Wiki Page GONUTS A contractile actin filament bundle that consists of short actin filaments with alternating polarity, cross-linked by alpha-actinin and possibly other actin bundling proteins, and with myosin present in a periodic distribution along the fiber. PMID:16651381 Definition Cellular Component Ontology stress fiber Name GO:0001725 ID Term Information Dataset Web Services P06727 tropomyosin Search for proteins by name Term Basket",
    "textAfterTable": "GO IDs ShowHide Term box width Term box height Slim colours ShowHide Show children ShowHide Image size limit (in megapixels) Note that setting the limit too high may result in images being generated slowly; it may even cause the browser to crash. The maximum limit is 20 megapixels. Child Terms This table lists all terms that are direct descendants (child terms) of GO:0001725: Term has no children Protein Annotation Display ID Mapping Filter Statistics",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}