{
    "relation": [
        [
            "Categories",
            "Bang for the buck",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "Like a private school education.",
            "All off-campus.",
            "Food choices - not much available",
            "Nice apartments, but most of the partying is off-campus.",
            "Live on campus!",
            "Campus closes too early. Housing is great. Resources are great."
        ]
    ],
    "pageTitle": "University of Washington-Bothell Campus Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/University-of-Washington-Bothell-Campus/reviews",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986423.95/warc/CC-MAIN-20150728002306-00004-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 910895987,
    "recordOffset": 910861563,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{28130=Personally, I've never lived in the dorms. However, they are not your typical student housing. The dorms at UW Bothell are relatively new: I believe they first made them available to students during the 2009-2010 school year. I've heard great things about them, and they seem to be a great place for students to spend their first year. They're all converted apartments, so as far as I know there are private bathrooms and kitchens. This is quite a step up from traditional dorms, but is in turn a bit more expensive., 133315=© 2015, Cappex.com, LLC}",
    "textBeforeTable": "10/10/2011 Reviewer is Accepted here and planning to attend soon. Reviewer has been to campus. 2 out of 2 people found this review useful. 1 of 27 Maggie from Ridgefield, WA Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464",
    "textAfterTable": "Brenda from Redmond, WA 03/03/2012 Reviewer is A current student here. 2 out of 2 people found this review useful. 2 of 27 Categories Comments Food and Dining i live off campus. Dorm Life nb/a Academic Rigor it's a solid academic environment with heavy emphasis on research. Tips for prospective students if you attend uw bothell, be sure to take advantage of the wonderful academic support such as the writing center and library assistance. develop a relationship with each professor outside of classroom by scheduling time during their office hours. In three sentences uw bothell is a wonderful, small learning environment with supportive professors and staff. i love that there are plentiful computers around campus for student use. the library connects with the main campus of uw and provides wonderful online connection to extensive academic research! Login",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}