{
    "relation": [
        [
            "Poster",
            "Glenn",
            "Quite a regular Joined: 2006/2/17 From: Chicago, IL Posts: 45",
            ""
        ],
        [
            "Thread",
            "Posted: 2009/1/12 9:26 Updated: 2009/1/12 9:26",
            "Re: Chrysler Announces Patriot EV! The sport wheels and tires pretty much tell the tale - it's a generic soccer mom car with a Jeep logo. I guess the 7 slot grill and brand name help boost sales, but it's certainly not a vehicle intended for trail use. If I had anything to do with the bailout money, it would be given only on the condition that the Jeep name were used exclusively on \"trail-rated\" vehicles. Chrysler's bastardizing Jeep's reputation by putting the name on these so-called \"lifestyle vehicles\". What a shame...",
            ""
        ]
    ],
    "pageTitle": "mike's totally free jeep news now - News",
    "title": "",
    "url": "http://www.jeepnewsnow.com/modules/news/article.php?storyid=3078",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989043.35/warc/CC-MAIN-20150728002309-00135-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 534655188,
    "recordOffset": 534638794,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{4973=In a bit of a surprise, Chrysler today unveiled the Jeep Patriot EV in Detriot at the North American International Auto Show. The vehicle has a 400-mile range, with a 40-mile all-electric range with zero fuel emissions - similar to the Wrangler EV. As a Range-extended Electric Vehicle, the Jeep Patriot EV combines the electric-drive components of an Electric Vehicle with a small gasoline engine and integrated electric generator to produce additional energy to power the electric-drive system when needed. This provides the positive attributes of an Electric Vehicle with the driving range equivalent to today\u0092s gasoline-powered vehicles. \"The Jeep Patriot EV expands our portfolio of ENVI electric-drive vehicles and is just one more example of what is possible through the technology Chrysler is developing,\u0094 said Lou Rhodes, President, \u0096 ENVI, and Vice President, Advance Vehicle Engineering, Chrysler LLC. \u0093Moreover, the Patriot EV provides socially responsible, advanced electric technology in the industry\u0092s most capable compact SUV.\" The Jeep Patriot EV features a refined and clean front appearance to match the refined and clean powertrain. The signature Jeep grille features vertical accents, and the front fascia is a separate component to help set the grille apart. The use of body-color paint, blended with matte black B- and C-pillars, visually creates a smooth and elongated profile. The unique wheel design and size gives the Jeep Patriot EV a wide stance which combines with the paint treatment to produce a sporty form. The interior of the Jeep Patriot EV features all of the elements introduced in the refreshed 2009 Jeep Patriot. The Jeep Patriot EV uses an electric-drive motor, advanced lithium-ion battery system and a small gasoline engine with an integrated electric generator to produce additional energy to power the electric-drive system when needed. Range-extended Electric Vehicles provide customers a no-compromise means of dramatically reducing their gasoline use and carbon footprint. The Jeep Patriot EV has a range of 400 miles, including 40 miles of zero fuel-consumption, zero-emissions, all-electric operation. The Jeep Patriot EV features a new ENVI Green Pearl exterior with a prominent \"EV\" graphic adorning both sides \u0096 top-to-bottom \u0096 of the vehicle.}",
    "textBeforeTable": "I have my '99 Cherokee Sport 4x4 that I have modified for moderate trails and since it is still in great shape there is no reason to get rid of it. That being said while gas is fairly cheap now we all know it won't last so my next vehicle purchase will be some kind of fuel efficient vehicle. The Patriot EV is very interesting to me for several reasons. Since I live just two miles from work I could according to Chrysler drive back and forth to work for two weeks on one charge. Or as someone here has already mentioned I could use it as a hybrid and get maybe 40-45 miles per gallon. When I look around at the other vehicles out there that could give me the mpg, interior volume and possible 4x4 capability of the Patriot it looks even better. As far as a $30,000 price tag I look at it this way. There are a lot of choices out there in that price range but it all depends on what you want for your money. Some would want Rubicon others a full size PU or a decent performance car or a nice SUV or mid size. One thing the anti hybrid skeptics always throw out there is the fact it will take",
    "textAfterTable": "Poster Thread myhotwheels22981 Posted: 2009/1/14 20:00   Updated: 2009/1/14 20:00 Home away from home Joined: 2002/3/22 From: Posts: 247  Re: Chrysler Announces Patriot EV! I would like to think that the solar and wind alternative companies would profit from the production of EV's because you would most likely plug in at night, when the sun is down, (but the wind could be very breezy), and drive during the day when the sun is usually out (unless it's cloudy, but again, if it's cloudy but breezy) and generate some sort of electricity from mother nature. Most people put their alternative power back into the electric grid and draw on it later. I would guess that the south face of the typical garage roof holding a few solar panels and a small wind turbine generator (residential sized) would generate enough electricity to (almost) break even when charging the EV. Charge the car at night, and charge the grid during",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}