{
    "relation": [
        [
            "Channel",
            "ABC1 NSW",
            "SBS ONE Sydney",
            "Channel Seven Sydney",
            "Channel Nine Sydney",
            "Network TEN Sydney"
        ],
        [
            "TV show",
            "rage",
            "Japanese News",
            "NBC Today",
            "Good Morning America",
            "Home Shopping"
        ],
        [
            "Time",
            "5:58 am - 10:01 am",
            "5:40 am - 6:15 am",
            "4 am - 6 am",
            "4:30 am - 6 am",
            "5:30 am - 6 am"
        ]
    ],
    "pageTitle": "Sydney Morning Herald - Business & World News Australia | smh.com.au",
    "title": "Summary of what TV shows are on tonight",
    "url": "http://www.smh.com.au/am/2012/03/24/index.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986423.95/warc/CC-MAIN-20150728002306-00106-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 717861839,
    "recordOffset": 717791691,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{15304=Reports emerge that an al-Qaeda-trained killer shot dead after a siege in Toulouse had been on the US no-fly list since 2010., 76947=Toulouse killer had been on a US flight ban list since 2010., 85069=With the Australian swim team announced for the 2012 Olympics, we highlight 10 swimmers worth following., 18194=In 2007 Vice tried and failed to get into Gaza through the Israeli-controlled Erez Crossing. Back then the rival Palestinian factions of Hamas and Fatah were engaged in a bloody war for control of this tiny strip of land. Hamas won. When the post-Mubarak government of Egypt decided to start letting small numbers of folks into Gaza through their Rafah Crossing, they knew it was our chance to finally get a rare glimpse of the embattled Gaza Strip and to see what life was like under the rule of Hamas.}",
    "TableContextTimeStampAfterTable": "{246403=Wales v Australia in June, 254357=Oz, Mar 23, 2012, 10:58PM, 129818=April 20: At some stage in your nightclub life, you've come face to face with Sanchez's driving tunes., 126394=March 22 This weekend is packed, especially for a jaunt down south., 130716=March 29 Perth artists band together to raise funds for burns victim., 128104=April 7 Electric love child of Van She, this rocking duo are known for their elegant, wacked out remixes., 128929=April 18 -21 This unique stage show explores the raw experience of online relationships through dance., 127371=April 5: Ditch your beverage for some baked goodness this Easter., 255361=Gerson, Mar 23, 2012, 4:54PM, 265659=March 23 2012, 248401=2202 views}",
    "textBeforeTable": "7am 6:30am 6am 5:30am 5am 4:30am Skip to: Tonight's double episode takes us to the end of series three and lives are unravelling. Mad Men What's on TV Tonight Read more now Get this for only $299 - save 76% Phuket Nirvana Resort Family Escape to Phuket Living SocialBrisbanePartner site Why you should see this show, no joke. Asher Treleaven: Matador About town He turns trivial facts into fascinating subject matter - but how? Living on Stephen Fry’s planet 3Screens How our fashion blogger fell in love with all shades of eyewear.",
    "textAfterTable": "Summary of what TV shows are on tonight Channel TV show Time ABC1 QLD rage 4:59 am - 5:58 am SBS ONE Queensland Korean News 5:05 am - 5:40 am Channel Seven Brisbane NBC Today 4 am - 6 am Channel Nine Brisbane Good Morning America 4:30 am - 6 am Network TEN Brisbane Home Shopping 5 am - 5:30 am Summary of what TV shows are on tonight Channel TV show Time ABC1 QLD rage 5:58 am - 10:01 am SBS ONE Queensland Japanese News 5:40 am - 6:15 am Channel Seven Brisbane NBC Today 4 am - 6 am Channel Nine Brisbane Good Morning America 4:30 am - 6 am",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}