{
    "relation": [
        [
            "Categories",
            "Tips for prospective students",
            "Bang for the buck",
            "Am enjoying being here",
            "Am learning a lot"
        ],
        [
            "Comments",
            "I highly encourage prospective students to apply for the Honors College, a college within the college. You can find out more about it at UNLV's website. Also, students who do enroll at UNLV should look out for the Financial Aid office. They are almost impossible to get a hold of and scholarships may take FOREVER to process.",
            "I do not live on campus, so all I have to pay for is tuition. It is fairly cheap and manageable. Payment plans are available!",
            "To be honest, this was my last choice on my list. However, you have to make the most of your college experience. If you are a Las Vegas resident who is unable to go out of state for college, try UNLV and try to make it an enjoyable experience for yourself. It wouldn't hurt to try!",
            "Of course, depending on the professors you have and the courses you take, you will get an enjoyable and enriching experience at UNLV. I have taken summer courses at UNLV and I will be an incoming freshman this fall. My teachers for those courses were, for the most part, very helpful and knowledgeable."
        ]
    ],
    "pageTitle": "University of Nevada-Las Vegas (UNLV) Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/University-of-Nevada-Las-Vegas/reviews?_escaped_fragment_=/show/81969",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989043.35/warc/CC-MAIN-20150728002309-00055-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 894132771,
    "recordOffset": 893947381,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{90000=Here is UNLV's shining area. It is cheap. No, it is dirt cheap. That is, if you went to high school in Las Vegas. If you are an out of state student, avoid this school like the plague. However, if you go to a Las Vegas high school and qualify for the Guinn Millennium Scholarship, you will pay only 1500-2500 dollars per semester, which is far below average. In other words, if you are local, have that scholarship, and only care about getting a degree so you can go to grad school, this is the place. But don't expect to have a exceptional learning environment., 745531=Apply early! There are MANY benefits offered for those who apply to UNLV by February. For example, there are a lot of scholarships that can pay for most, if not all, of your tuition. Talk to the financial aid office about grants offered by the school as well as other scholarships awarded by the program you're majoring in. Either way, you will be able to have at least some of your tuition paid off at UNLV., 1058196=Excited to be joining UNLV to study hospitality management with a concentration in PGA Golf. Attended an excellent and well organized orientation in June., 27451=I am already enrolled at UNLV to begin my first semester in the Spring of 2011. I have many friends who attended UNLV for the Fall semester & from what I have heard, the classes are packed full of learning experiences. They require much work, focus & concentration. The professors are very knowledgeable on the subjects which they teach, & they are willing help if you get lost. Overall, students at UNLV undoubtedly learn a lot in their time spent at the university., 470645=I feel that they do not support their Geology program very well, There on-campus housing needs to be remodeled. They do not treat everyone equally I know this as I worked in the Enrollment and Student Services office and I was able to see what goes on behind the scenes. I rate them a 4 out of 10 I am currenlty finishing my last semester with UNLV online this fall and starting with Metropolitan College of Denver Spring 2013, 217404=If you are a commuter and willing to stay on campus until 6:30 PM for a meeting, once a month, then I would say the clubs are a great thing. To those living on campus it is definitely more convenient because they are within walking distance., 1060679=© 2015, Cappex.com, LLC, 1023468=There's plenty of people on campus throughout the whole entire day. I have a class that doesn't end until 7:30 at night and there's still plenty of other students walking around campus. However, if there isn't a lot of people around, there are security guards constantly patrolling the campus, and there are emergency call boxes on every corner for students to pick up and it will notify campus police that they need help.}",
    "textBeforeTable": "08/19/2009 Reviewer is A current student here. 28 out of 30 people found this review useful. 1 of 245 Adam from Las Vegas, NV Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code",
    "textAfterTable": "The classes offer an incredible amount of insight and new information. Classes tend to start off a little slow in my experience, but when they did get going they got going quickly and I learned a lot in short amounts of time. In addition, classes don't have lazy setups; that is, professors go into detail on each subject and don't simply list things for you to write down and memorize for the exams. Instead, they will actually take the time to explain and talk about each bit of content that comes up. Most professors also dedicate specific periods of class just for discussion about either the current or previous day's content. This allows for better material retention, especially after a semester ends when many students tend to forget things that during the semester they had only memorized. Login to rate or flag the reviews Joan from Henderson, NV 10/20/2010 Reviewer is A current student here. 24 out of 24 people found this review useful. 2 of 245 Categories Comments Great for these types of students",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}