{
    "relation": [
        [
            "Categories",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "Unfortunately, there are not a lot of extra activities for students to do on campus but the school itself is not too far from many sources of entertainment within the city itself.",
            "Students are limited to one source of food on campus, the limited hours often cause student-athletes, like myself, to miss meals regularly.",
            "The dorm life on campus is somewhat lacking in comparison to the rest of the campus. Many residents, myself included, have noticed several improvements that could be made to the areas of the school set aside for student living.",
            "As a transfer student, I have found a noticeable difference in the level of difficulty related to the courses I have completed. These courses, however, are taught by very knowledgeable instructors with a great deal of detail and passion.",
            "All prospective students should take into consideration each and every potential college that meets their base needs in areas relating to their intended major, the vicinity of the school as related to how close or far they wish to be from their home/family, and the amount of money that they are willing to be accountable for paying on tuition.",
            "The school is a small private, religious college. Its located on a very small, but beautiful campus in Chicago. The level of academic excellence in the classroom is held to a high, but realistic, standard."
        ]
    ],
    "pageTitle": "North Park University Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/North-Park-University/reviews?_escaped_fragment_=/show/65913",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986423.95/warc/CC-MAIN-20150728002306-00143-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 906444155,
    "recordOffset": 906407750,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{4865=This school really does give you a lot more than what your paying for. For instance, the work-out facility, Helwig, was completed in the fall of 2006 Helwig Recreation Center houses a state-of-the-art workout facility, 200-meter indoor track, 35-yard practice football turf, basketball and volleyball courts, a climbing wall, coaches' offices, and classroom space. There are many things that a person or group of people could do here and not get bored. Also, every Tuesday and Thursday, there are ab work outs and yoga that is available for no extra charge., 121214=© 2015, Cappex.com, LLC, 100152=The night is April 1st... the scene is the bridge over the North Branch of the Chicago River... the sight is approximately twenty naked freshman boys dashing along at midnight while a giant crowd cheers. This is The Streak. Enough said., 1224=Because North Park is in an urban setting they received a lot of funding from the city. Instead of using the money for the campus they gave the money to the students. In 2008 the tuition for north park actually decreased., 72863=Freshman streak! In April fool's day, all freshman guys get naked and run around the campus in front of whole student body at midnight. People come out to watch them, yes. Neighborhood complains annually but every time they call the police, oh well, what's done is done.}",
    "textBeforeTable": "07/13/2009 Reviewer is A current student here. 20 out of 20 people found this review useful. 1 of 29 Shellye from las vegas, NV Check out reviews left by other students or leave your own review. You could win a free scholarship. North Park University Reviews North Park University › Illinois › By State › Colleges › } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.create', -->",
    "textAfterTable": "Tariq from Hainesville, IL 06/30/2011 Reviewer is A current student here. 3 out of 3 people found this review useful. 2 of 29 Categories Comments Great for these types of students North Park University is a great school for any and all kinds of people. It is a school with a lot of diversity among the students, as well as the professors. Tips for prospective students Here is a tip for students that are thinking about coming here, when you come to the school for your visit ask your tour guide about the location of the OLDEST tree in Chicago. (It is right on campus, in the middle of the green space). Also, if you do decide to attend this university, make sure that you know all of your professor's names and try and make sure they remember yours for good reasons. Bang for the buck This school really does give you a lot more than what your paying for. For instance, the work-out facility, Helwig, was completed in the fall of 2006 Helwig",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}