{
    "relation": [
        [
            "Days",
            "30",
            "50",
            "150",
            "200"
        ],
        [
            "BSE",
            "3.70",
            "3.82",
            "3.98",
            "4.21"
        ],
        [
            "NSE",
            "3.69",
            "3.81",
            "3.97",
            "4.21"
        ]
    ],
    "pageTitle": "Electrosteel Steels Stock Price, Share Price, Live BSE/NSE, Electrosteel Steels Bids Offers. Buy/Sell Electrosteel Steels news & tips, & F&O Quotes",
    "title": "",
    "url": "http://www.moneycontrol.com/india/stockpricequote/steel-medium-small/electrosteelsteels/EI13",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986423.95/warc/CC-MAIN-20150728002306-00242-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 592941691,
    "recordOffset": 592890425,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{132848=28 July 2015, 133359=UnitedBrewerie Jul Fut, 196609=Electrosteel St is in the Steel - Medium & Small sector. The current market capitalisation stands at Rs 869.73 crore. The company management includes Jinendra Kumar Jain - Director, Naresh Pachisia - Director, Amrendra Prasad Verma - Director, Sunil V Diwakar - Director, Umang Kejriwal - Director, Rajkumar Khanna - Chairman, Rama Shankar Singh - Whole Time Director, Lalit Kumar Singhi - Director, Rishu Kumari - Addnl. & Ind.Director. It is listed on the BSE with a BSE Code of 533264 and the NSE with an NSE Code of ESL. Its Registered office is at 801, Uma Shanti Apartments, Kanke Road., Ranchi,Jharkand - 834008. Their Registrars are Karvy Computershare Private Ltd., 195298=Astec LifeSciences Recommended on Mar 31st 2015, 134066=JSWSteel Jul Fut}",
    "textBeforeTable": "Edit Watchlist Have you invested in these stocks? You can track them better in your Portfolio close[x] Add to Watchist Account Optional Optional Optional Optional Add to Portfolio OR Add to watchlist } $('#mcpcp_addprof_info').hide(); { function close_info()",
    "textAfterTable": "Keep me signed in Forgot Password? New to Moneycontrol - Sign up now Its easy and FREE! Username Username should be atleast 4 characters Password Password should be 6 to 10 characters Confirm Password Email OR connect with LIVE",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}