{
    "relation": [
        [
            "Date",
            "Nov 6, 1998",
            "Jan 24, 2001",
            "Feb 1, 2001",
            "Sep 7, 2004",
            "Mar 29, 2005",
            "Aug 20, 2007",
            "Sep 15, 2008",
            "Jan 15, 2009",
            "Jan 20, 2009",
            "Mar 3, 2009",
            "Mar 3, 2009",
            "Oct 15, 2012",
            "Feb 25, 2013",
            "Feb 25, 2013"
        ],
        [
            "Code",
            "AS",
            "AS",
            "AS",
            "FPAY",
            "AS",
            "AS",
            "REMI",
            "AS",
            "AS",
            "FPAY",
            "SULP",
            "REMI",
            "SULP",
            "FPAY"
        ],
        [
            "Event",
            "Assignment",
            "Assignment",
            "Assignment",
            "Fee payment",
            "Assignment",
            "Assignment",
            "Maintenance fee reminder mailed",
            "Assignment",
            "Assignment",
            "Fee payment",
            "Surcharge for late payment",
            "Maintenance fee reminder mailed",
            "Surcharge for late payment",
            "Fee payment"
        ],
        [
            "Description",
            "Owner name: JOHN COSTANZA INSTITUTE OF TECHNOLOGY, COLORADO Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNOR:COSTANZA, JOHN R.;REEL/FRAME:009572/0619 Effective date: 19981104",
            "",
            "",
            "Year of fee payment: 4",
            "",
            "Owner name: SILICON VALLEY BANK, DISTRICT OF COLUMBIA Free format text: SECURITY INTEREST;ASSIGNOR:DEMANDPOINT, INC.;REEL/FRAME:019733/0462 Effective date: 20070629",
            "",
            "Owner name: INVERNESS CAPITAL PARTNERS, L.P., PENNSYLVANIA Free format text: SECURITY AGREEMENT;ASSIGNOR:DEMANDPOINT, INC.;REEL/FRAME:022109/0151 Effective date: 20070709 Owner name: INDUSTRIAL TECHNOLOGY VENTURES, L.P., GEORGIA Free format text: SECURITY AGREEMENT;ASSIGNOR:DEMANDPOINT, INC.;REEL/FRAME:022109/0151 Effective date: 20070709 Owner name: UNITED PARCEL SERVICE GENERAL SERVICES COMPANY, GE Free format text: SECURITY AGREEMENT;ASSIGNOR:DEMANDPOINT, INC.;REEL/FRAME:022109/0151 Effective date: 20070709",
            "Owner name: INVERNESS GRAHAM INVESTMENTS, L.P., PENNSYLVANIA Free format text: SECURITY AGREEMENT;ASSIGNOR:DEMANDPOINT, INC.;REEL/FRAME:022117/0860 Effective date: 20090116 Owner name: INDUSTRIAL TECHNOLOGY VENTURES, L.P., GEORGIA Free format text: SECURITY AGREEMENT;ASSIGNOR:DEMANDPOINT, INC.;REEL/FRAME:022117/0860 Effective date: 20090116",
            "Year of fee payment: 8",
            "Year of fee payment: 7",
            "",
            "Year of fee payment: 11",
            "Year of fee payment: 12"
        ]
    ],
    "pageTitle": "Patent US6198980 - System and method for designing a mixed-model manufacturing process - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US6198980?ie=ISO-8859-1&dq=5636223",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989790.89/warc/CC-MAIN-20150728002309-00220-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 474810991,
    "recordOffset": 474753264,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{223270=Process 1 is assembly 1101 (main path);, 148473=23) determining y by balancing the amount of components outputted by the feeder path with the amount of product required in the product path to which the feeder path outputs (i.e., if the feeder path must supply 4 components for each unit of finished goods at the EOL, then y is calculated such that 4 components are produced for each unit of product in the main path at the insertion path), which in this example (with a 1:1 correspondence assumed) is 0.78x=0.73y (see steps 9, 13 and 22) or y=1.07x=2.29., 223822=Table VIII shows a product definition as generated in steps 15 through 60 of FIG. 3. Additionally, the system inputs that from process 6 (test 1106), 20% of products 1 through 6 are routed to process 7 (test rework 1107) and 5% of products 7 through 9 are routed to scrap 1110., 223336=Process 2 is worm shaft 1102 (feeder path 2);, 222467=FIG. 11 shows a schematic drawing of a manufacturing line for producing products 1 through 9 listed above. In FIG. 11, two feeder paths feed assembly 1101. Feeder path 1 1111 includes a cover assembly 1103, drill and tap 1104 and deburr 1105 step. Feeder path 2 includes worm shaft 1102. Assembly 1101, test 1106, and pack 1108 comprise a main path terminating at EOL 1109. Test 1106 initiates a scrap 1110 fallout and a rework path that includes rework 1107., 223760=Process 8 is pack 1108 (main path)., 223689=Process 7 is test rework 1107 (rework path);, 293140=Table XIV indicates the demand at capacity for each product at each process. Note that products 7-9 require that worm shaft 1102 produce two worm shafts for each gearbox instead of one and that products 7 through 9 do not utilize rework 1107, directing 5% of products 7-9 to scrap 1110 instead. Therefore, starting with x units at assembly 1101, x units of product are input to test 1106. From test 1106, 5% of product (0.05x) is directed to scrap 1110 while 95% (0.95x) of product is input to pack 1108 to yield 0.95 x at EOL. Therefore, to yield a demand at capacity for product 7 of 5 units, x=5.26 units of product 7., 223559=Process 5 is deburr 1105 (feeder path 1);, 223627=Process 6 is test 1106 (main path);, 291305=In step 87 (FIG. 5), the demand at capacity for each product at each process Dcij is calculated. The demand at capacity for a product at a process depends on the process yield, rework, option and scrap factors. In the present example, there is one rework process, one instance of scrap and no option process. Consider product 1, the 2″ gearbox. Following the procedures that have previously been outlined for calculating Dcij, if we start with x units of product 1 at the beginning of the main path, assembly 1101. There is no scrap or diversion of product into option or rework paths at assembly 1101 and therefore x amount of product leaves assembly 1101. The amount of product that is input to test 1106 is x+z where z is the output of product from rework 1107. At the conclusion of test 1106, 20% of product 1 is diverted to rework 1107. Therefore, the amount of product input to rework 1107 is 0.2(x+z). The output of rework 1107, therefore, is also 0.2(x+z) which is z. Therefore, z=0.25x. None of product 1 is diverted to scrap 1110. The amount of product that is input to pack 1108, therefore, is 0.8(x+z)=0.8(1.25)x=x. Therefore, the amount of product 1 that is output from pack 1108 to EOL 1109 is x. Normalizing x so that the demand at capacity Dc of product 1 is 10 indicates that x=10., 223484=Process 4 is drill and tap 1104 (feeder path 1);, 292750=Because product 1 requires one worm shaft to be produced by worm shaft 1102, then the demand at capacity for product 1 at worm shaft 1102 is also 10. Additionally, feeder path 1111 has no losses or rework paths. As such, the demand at capacity for product 1 at cover assembly 1103, drill and tap 1104 and deburr 1105 is also 10., 223408=Process 3 is cover assembly 1103 (feeder path 1);}",
    "textBeforeTable": "Patent Citations The above-described examples of this invention are demonstrative only. Those skilled in the art will recognize a plethora of variations based on these examples, all of which are intended to be included within the scope of this description. As such, the invention is limited only by the following claims. In operations balancing 450, indexing may be applied to each operation within the cell. Additionally, imbalances in timing are recognized and non-value added work is eliminated, work is reallocated, additional resources are assigned, or other actions are taken in order to balance the flow of product through each cell. In operational balance 400, steps 401 through 415 of FIG. 9, operations within each cell are defined according to the takt time for the cell. Referring to cells 1 and 2 and the sequence of events shown in Table IX, cells 1 and 2 can be divided into two operations. Operation 1 includes tasks 10 through 50 and operation 2 includes tasks 60-100. 0/1 0/1 2/2 0/4 2/2 0/1 0/3 0/2 0/2 Res. L: 0.5 L: 0.4 L: 1.4",
    "textAfterTable": "US7346413 * May 9, 2005 Mar 18, 2008 International Business Machines Corporation Productivity for tool having plurality of processing modules US7454260 * Oct 13, 2006 Nov 18, 2008 Sap Ag Systems and methods for production planning with sequence independent setup activities US7512455 * Mar 29, 2004 Mar 31, 2009 Palo Alto Research Center Incorporated Method for self-synchronization of modular production systems US7536427 * Jun 20, 2005 May 19, 2009 Sap Ag Comparing process sizes US7551974 * Sep 15, 2006 Jun 23, 2009 Jtekt Corporation Processing method of workpieces using combined processing machines US7636670 * Oct 17, 2002 Dec 22, 2009 Sap Aktiengesellschaft Method and computer program product that determine values of characteristic value combinations for use in the production of products US7848946 Jan 12, 2005 Dec 7, 2010 Jda Software Group, Inc. Sales history decomposition",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}