{
    "relation": [
        [
            "Chapter",
            "Ottawa",
            "Calgary",
            "Manitoba",
            "Montreal",
            "Regina",
            "Toronto",
            "Vancouver"
        ],
        [
            "Date",
            "31 May",
            "17 May",
            "24-25 May",
            "17 May",
            "10 May",
            "6 May",
            "8 May"
        ],
        [
            "Speaker / Topic",
            "Marc-André Valiquette",
            "Bruce W. Gowans",
            "\"Films Take Flight\" Film Festival",
            "Major Jean-Paul Peart",
            "",
            "",
            "Dr. Ilya Grinberg (Prof. at N.Y State Collge at Buffalo) & Hugh M. Neeson (Development Director - Niagara Aerospace Museum)"
        ],
        [
            "Details",
            "Debut of his new bilingual history of 425 \"Alouette\" Squadron (*Note, meeting also includes the Ottawa Chapter's Annual General Business Meeting",
            "The history of the Canadian-built twin-engine Avro trainer in its wartime and civilian roles",
            "Featuring The Arrow (miniseries excerpts), For the Moment, and more (see below for details)",
            "Pilot training, electronic warfare requirements, and mission planning of the F-35 project",
            "",
            "",
            "\"Bell P-39 Airacobra Comes Home to Buffalo\""
        ]
    ],
    "pageTitle": "2012 | Newsletters | Public Area",
    "title": "",
    "url": "http://cahs.ca/2012",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986423.95/warc/CC-MAIN-20150728002306-00332-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 37347507,
    "recordOffset": 37149732,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{768343=Airshows and Aviation Events: July - August 2012, 1302754=Copyright © 2015 CAHS - Canadian Aviation Historical Society CAHS, PO Box 2700 Station D, Ottawa, Ontario, K1P 5W7 Site Customization and Hosting by Real Magic Online, 1066616=Canada Aviation and Space Museum The Canada Aviation and Space Museum will be hosting \"A Time to Remember\" in honour of Remembrance Day. Visit the museum on November 3-4, 10-11 to participate in commemorations activities for both children and adults. Sunday 4 November will se a range of guest speakers and lectures. See the program and speaker schedule on their website here. Canadian Bushplane Heritage Centre, 789520=The Canadian Warplane Heritage Museum will host its third Fly-In Day on 19 August. landing fees are waived and all visitors occupying an aircraft receive free admission to the Museum!, 340746=CWH also has some March Break programs for kids including workshops on building aircraft models and woodworking., 741775=23 July 1913 H. W. Blakeley makes the first night flight in Canada at the Dominion Livestock Show and Fair at Brandon, Man., 42656=2012 will bring about some (positive) changes to the CAHS, one being this e-publication! I was taken by surprise when upon the announcement of my appointment as newsletter editor the congratulatory e-mails began to flow in. I was struck by all the warm greetings: “WELCOME ABOARD, CAITLIN!” they exclaimed, “Best wishes for success with CAHS!!” they cried. I sincerely appreciate all of the kind words and I know that this newsletter will be a great way to meet many of the individuals who contribute to this generous and enthusiastic organization., 1059982=On 11 November at 10:45am, their website will host a live Remembrance Day webcast from the museum's Memorial Hall. Light will shine through a single window to frame the headstone representing Canada’s Unknown Soldier. You can access the webcast by going here on their website. A limited number of visitors to the museum on that day will be permitted to attend the ceremony. Visit their website for more information., 744110=1 July 1938 Lucille Garner and Pat Eccleston are Trans-Canada Airlines’ first flight attendants., 741510=15 July 1910 The first airplane flight in Manitoba takes place., 1293298=  December 2012 - Issue 26, 633052=The Mynarski Memorial Lancaster is housed at the Canadian Warplane Heritage museum, and is one of two airworthy Avro Lancaster bombers in existence. In a ceremony on 24 September 1988, the restored bomber (detailed with Mynarski's Lancaster markings) took flight carrying the fire axe Mynarski used in trying to free Pat Brophy., 1144231=Robin Higham, a CAHS member from Manhattan, Kansas, U.S.A., published two titles of interest this year: \"Two Roads to War: The French and British Air Arms from Versailles to Dunkirk\" and \"Unflinching Zeal: The Air Battles over France and Britain, May–October 1940.\", 1036162=15 October 1936 - \"The Flying Seven,\" Canada's first all female flying club, is established, 1178316=We also recently received the news that Alan J. Grant, CAHS National Member No. 5228 and RCAF veteran, passed away in June., 1176148=CAHS National Member No. 948, Charles F. Vaughn of St. Catharines, passed away in October at the age of 86. He was a pilot and one of his famous aerial adventures was when he flew a twin engine airplane in the London (UK) to Victoria (BC) Air Race in 1971. He later spoke to the Toronto Chapter on the details of the two Atlantic crossings as a race participant., 1060782=Visitors to the museum on 11 November can also sit in the LeBreton Gallery Theatre to watch the broadcast of the official Remembrance Day ceremony at the National War Memorial on a jumbo screen. More details can be found here. (Photo from CWM website), 443573=2012 Canada's Aviation Hall of Fame Induction Gala, 811808=July 2012 - Issue 21, 1206474=1 December 1945: A.V. Roe Canada Ltd is Formed, 1181001=November 2012 - Issue 25, 498643=April 2012 - Issue 18, 1007874=September 2012- Issue 23, 1032824=11 November is Remembrance Day, and I have noted just a few events taking place at aviation-related venues. Get in touch with your local legion or check your community's website to find out where and when services are taking place in your area. Feel free to share them with me at This email address is being protected from spambots. You need JavaScript enabled to view it. for inclusion in the next newsletter!, 1040956=The group did not disband after the war, though their lives went in different directions. Margaret Fane-Rutledge died in 2004, and a foundation providing scholarships for business students was established in her memory., 418078=This year we have an excellent line-up of presentations as well as a potential companion’s program for those spouses who don’t share our same level of passion for aviation history. We will make the registration forms available by the end of April through the next issue of the Journal, Chapter Presidents, and the website. The Maritimes in fall will be exceptional and the convention well worth the trip “out East!”, 1121603=11 November 1940: Air Cadet League of Canada Formed, 909969=August 2012 - Issue 22, 1032401=Although the Spitfire discovery is an incredible one, I think the possibility of bringing the Hurricane back to Canada sounds pretty neat. I guess we will have to wait until December to find out where it will call home next!, 348056=As of 4 March the Canadian Air and Space Museum is only open to members, volunteers, and staff who are helping with packing the facility as it prepares to be evicted. According to their website, \"the Museum will be closed until further notice as we are in the process of dismantling aircraft and packing artifacts for storage.\", 1301001=Canadian Aviation Historical Society PO Box 2700 Station D Ottawa, ON K1P 5W7 www.CAHS.ca, 271600=I hope you enjoy your March 2012 e-newsletter. If you are having problems viewing it in your e-mail, visit the online archive at the CAHS website here to view in your browser, 1087514=October 2012 - Issue 24, 1137321=Visit cahs.ca to view our rotating blog feature. This month, Mathias Joost looks at \"Bombing the South Saskatchewan River in 1951.\", 448021=National Archives, UK - Air Ministry Records Online Attention all researchers! You can now search and download Air Ministry Squadron operation records from the United Kingdom’s National Archives website. These records provide a daily record of events and include information including aircraft type and number, names and rank of flight crew, names of passengers, weather conditions and flight details. The database can be searched here. To get an idea of what the records look like, here are the Records of Events of 101 Squdaron for December 1943. If you need help with your research you may find their Royal Air Force operations research guide useful. This guide covers all the major series for operational records from 1914 up to 1945 and also post war operations. It also contains guidance for records associated with RAF operations., 573971=The museum is hosting the first of four fly-in days on 27 May. Download the poster here! Be sure to keep updated on the CWHM through their regular e-flyer, available here., 409077=2012 also marks the 95th anniversary of the Battle of Vimy Ridge where Canadians manned aerial reconaissance and fighter aircraft over No-Mans Land. In one example, the soon-to-be-famous Billy Bishop, of RFC Number 60 Squadron, won the Military Cross on April 7 for shooting down a balloon near Vimy., 1069193=The Windsor International Airport, including the Canadian Historical Aircraft Association, held its first public open house in October. Tours of the aircraft and facilities, an air show and plane rides made the event a great success. Read a Windsor Star article about the open house here., 1188578=Canadian Aviation Historical Society PO Box 2700 Station D Ottawa, ON K1P 5W7 www.CAHS.ca, 261537=February 2012 - Issue 15, 663769=George Fuller wrote in to let us know that a Parks Canada National Historic Site plaque will be unveiled on Saturday morning, 30 June, adjacent to the active airport and floatplane facility at Lac-à-la-Tortue, near Grand'Mère, Shawinigan, Québec. It will commemorate the birth in 1919 of Canadian bush flying at this, the country's first commercial air harbour. For further information please contact him at This email address is being protected from spambots. You need JavaScript enabled to view it. \">This email address is being protected from spambots. You need JavaScript enabled to view it., 404406=100th Anniversary of the Royal Flying Corps The Royal Flying Corps (RFC) was established on 13 April 1912 and operated until 1 April 1918 when Britian’s air operations were amalgamated into the Royal Air Force (RAF). 25,000 Canadians served with the RFC as pilots, observers and mechanics. They earned more than 800 decorations and awards for valour. Three noteworthy Canadians who served with the RFC and received the Victoria Cross were William Avery (Billy) Bishop, William George (Billy) Barker, and Alan Arnett McLeod., 1166897=The National Air Force Museum of Canada continues to undergo construction but is still open! Read about their progress in their November e-newsletter, available on their website here. The document also details the Museum's recent awards, Ad Astra Ceremony, new acquisitions, and upcoming events., 493383=An American veteran of the air show circut was recently killed in a tragic accident. On 4 April, Howard Pardue and his vintage Grumman F8F Bearcat crashed just after takeoff from his home airport in Breckenridge, Texas. The aircraft burst into flames after impact not far from the departute end of the runway. He was 77. Click here to view the prelimiary report on the crash, and here to read a news report of the accident. The EAA has published this brief summary of Pardue's stellar career as a warbird pilot., 742662=7 July 1919 For the first time in Canada, a forest fire is spotted from the air—by Stuart Graham and W. Kahre, aboard a Curtiss HS-2L. (Click to read about their later life adventures)., 136864=Canadian Aviation Historical Society PO Box 2700 Station D Ottawa, ON K1P 5W7 www.CAHS.ca, 717211=June 2012 - Issue 20, 503699=Canadian Aviation Historical Society PO Box 2700 Station D Ottawa, ON K1P 5W7 www.CAHS.ca, 132049=January 2012 - Issue 15, 1069902=The Canadian Warplane Heritage Museum will hold an indoor Remembrance Day ceremony on 11 November, hosted by Ted Barris from 10:30am until noon. Along with the service will be a flyover by the museum's Lancaster (weather permitting). Admission is free (donations accepted) and there is limited seating for several hundred, so arrive early! Details can be found on their website here. Note that the service will be broadcast live by television station CHCH., 741146=Below are some notable events that occurred in July during early days of Canadian aviation (note some great pioneering ‘firsts’!). Click highlighted text to read some descriptive news articles about the landmark event or the individuals' later career., 1162362=The Canadian Aviation Heritage Centre in Ste Anne's de Bellevue, Quebec, has unveiled a replica of 1926 Fairchild Model FC-2 \"Razorback.\" the twelve-year long project was finished in October by volunteers at the Centre who used sketches and photographs from the era. More about the process is outlined this news story., 411342=A reminder that your membership expiry date is listed on the mailing label of the envelope your Journal arrives in. If the expiry date says \"31 Dec 2011,\" then your membership is valid until the end of 2011 and you will receive all four of the volume 49 Journals. We will be including your 2012 renewal form with the upcoming Journals. You can also renew for 2012 (and beyond) at any time on our website by clicking here. CAHS - A labour of love you just can't quit!, 766642=\"The Turnbull Chapter of the Canadian Aviation Historical Society cordially invites you to attend the ceremony commemorating the centennial of powered aviation in New Brunswick with the dedication of the Wade-Myles Park and Cenotaph and the reaffiliation of 410 (City of Saint John) Squadron, RCAF, with the City of Saint John. Thursday, 6 September 2012 [coinciding with the CAHS convention].\" Contact This email address is being protected from spambots. You need JavaScript enabled to view it. for more information or to RSVP., 743493=July 1937 Flying a Lockheed Electra, J. H. Tudhope and J. D. Hunter complete the first dawn-to-dusk trans-Canada flight, between Montréal and Vancouver, in 17 hours and 35 minutes., 942451=Be sure to visit the Canada Aviation and Space Museum's new photographic exhibit, \"People, Places and Planes: Air Canada at 75.\" Bonus fact: The museum is home to an Air Canada Douglas DC-9 which flew in on 26 September 2002. Read more here., 1049325=Ottawa Chapter Director Tim Dubé will be speaking on \"Canadian Airmen of the First World War\" on 16 November at the Great War Auction, Forum, & Militaria Show. Click here for more information., 686480=Canada Aviation and Space Museum The Canada Aviation and Space Museum has lots of family activities for June and July!, 570620=Canada Aviation and Space Museum During the month of May, the Canada Aviation and Space Museum is remembering Operation \"Manna\" through its exhibits and children's programs. Speakers include author of \"A Bad Penny Always Comes Back,\" Glen Mitchell., 1062970=The museum recently received the the C.A.P.A National Award for an Outstanding Outreach Program at the 2012 Canadian Aeronautical Preservation Association conference. The award recognizes the museum's program to support a team of Edmonton-area Royal Canadian Air Cadets at the 2012 Schools Aerospace Challenge in Cranfield, England. Read more here., 472048=In addition, Minister of Veterans Affairs Steven Blaney has announced Canada's contribution of $100,000 toward the creation of the Memorial, as well as support for the Bomber Command Veterans travelling to London for the official unveiling of the Memorial in June of this year., 1038366=To wear the grey uniform of The Flying Seven you had to have a flying licence. Elianne Roberge stated in the interview found here that “we wouldn’t take learners. All the girls were experienced. I started flying in 1929 and stopped in 1963. My licence is No. 678, and I still have it. You won’t find many people in Canada with a lower number.”, 736170=I hope you enjoy your July e-newsletter. Make sure to send in your early-bird registration forms for the 2012 CAHS Convention by 25 July!, 1077227=Harold E. Wright is seeking the minutes and correspondence of the McKee Trophy committee for the 1939-1944 period. He would also like any information on a Saint John pilot, Harry Hayter, who was flying out of Edmonton and other areas north in the 1930s. Please contact Harold at This email address is being protected from spambots. You need JavaScript enabled to view it. ., 1159726=The Bomber Command Museum of Canada is co-supporting the upcoming book launch and speaking event, “Wings Over High River – Conversations with A. Gordon Jones” Mr. Jones is a former BCATP pilot instructor and Tiger Moth pilot for seventy years. The event will be held at the Museum of Highwood in High River, Alberta on 1 December., 1201575=Below you will find the last National e-newsletter of 2012. The CAHS has big plans for 2013 including - among many things - a revamped and interactive website, our Journal caught up to cover date, and our 50th anniversary celebration! In the coming year we are also exploring ways to expand the accessibility, reach, and exposure of the CAHS. If you have suggestions or ideas on how to build on these components, the Executive would love to hear from you!, 742101=31 July 1913 Alys McKey Bryant becomes the first woman pilot to fly in Canada, over Vancouver, in a Curtiss-type pusher biplane., 556248=Airshows and Aviation Events: May - June 2012, 684831=Join the Bomber Command Museum of Canada as it pays tribute to former RCAF pilots Bruce and Douglas Warren. The identical twins were born in Nanton and became two of the most outstanding of Nanton's citizens who served in the Royal Canadian Air Force during and after World War II. On 7 July, the museum will honour them with the official opening of a new, permanent display in the museum, Lancaster Engine Runs, and the Dedication of a beautiful Memorial Garden. Read more here., 387296=March 2012 - Issue 17, 605387=May 2012 - Issue 19, 1137928=Mathias writes: \"Bombing ice jams was nothing new. In 1929, the Canadian government decided to bomb the ice in the St. Lawrence to speed the opening of the river. Canadian Airways pilot D.S. Bondurant, flying a Fairchild 71, dropped explosive charges onto the ice which produced a lot of ice chips and dead fish but no expedited break-up of the ice. [...] The efforts to dislodge the ice jams became Operation Floodhat, as the RCAF named it.\", 450755=On 26 April the National Museum of the Marine Corps in Reston, Virgina will hold the Mutual Concerns of Air and Space Museums Conference. The 4-day event includes panel presentions and fields trips, and is sponsored by the Smithsonian National Air and Space Museum. Program details and full schedule is located on their website here., 1160528=Canada Aviation and Space Museum Starting in December 2012 (in time for Christmas?) the Canada Aviation and Space Museum will begin selling Canadian Space Agency (CSA) products in its museum boutique and online store., 1047034=Marc writes:\"During the First World War, the Royal Flying Corps (RFC) 1912–1918 is a British Army Corps in which Canadian troops operate independently. The RFC has a firm Army support focus - air photos, liaison, operating air observation posts (AOP) and close air support of troops on the ground. The first direction of artillery by an air observer occurs on 13 September 1914.\", 446633=The first promo photo, taken by Katsu Tokunaga, has been released of the 2012 Discovery Air Hawk One., 1133271=RAPCAN's Retired Airline Pilots Database (2006 edition) can be purchased in PC CD format from CAHS National for $10 each (includes postage). Contact CAHS National Treasurer Rachel Lea Heide to place an order (This email address is being protected from spambots. You need JavaScript enabled to view it. )., 1067991=There is lots going on in the Sault Ste. Marie area at the Canadian Bushplane Heritage Centre! Aviation author Gary Tracy will be doing a book signing and read on 1 November. On 16 November, join them for their 3rd Annual Myster Dinner where all proceeds go to support the Centre., 1030369=It is expected that bids could reach $2.6 million. According to the above news article, the sale has piqued the interest of David Rohrer, CEO of the Canadian Warplane Heritage Museum near Hamilton, Ontario. You may recall that, as the story notes, the museum's own Hurricane was lost in a fire in 1993. The sale of the Hurricane comes as dozens of buried Spitfires are scheduled to be excavated from a site in Burma and brought back to England. Each plane is said to be crated and buried (click to see a photo of the crate) and likely preserved in immaculate condition., 743178=12 July 1927 For the first time in Canada, airplanes are used to dust crops with fungicide to control wheat rust., 1171761=On 29 November, the Western Canada Aviation Museum will be working with the Manitoba Chapter of the CAHS to host a presentation by Col. Gary Solar and Bill MacDonald on \"The Spy Intrepid\" – Sir William Stephenson. This goes along with their event theme for November, \"Pilots, POW's, and Peril.\" Next month, catch one of their free \"One-of-a-Kind\" themed tours, revolving around their collection's more unique aircraft., 613097=Canadian Aviation Historical Society PO Box 2700 Station D Ottawa, ON K1P 5W7 www.CAHS.ca, 447007=From the media release by D.V. Dempsey, Team Leader: \"You will note that the 100th anniversary logo has been replaced by the tail livery that the RCAF Golden Hawks flew in 1963 and 1964 up until their disbandment. The scheme also features the RCAF serial number 23314 below the Red Ensign. We have now identified 78 former RCAF pilots who flew this aircraft in service between 1954 and 1968, including seven former Golden Hawk pilots. Of interest, we have also identified two legendary friends in the United States who flew the aircraft back in the 1970's for its American owners, Bob Hoover and Steve Hinton.\", 443715=The organizing committee of Canada’s Aviation Hall of Fame invites you to attend the Annual Gala dinner to induct this year's aviation pioneers into Canada's Hall of Fame. The event will take place in Montréal at Le Windsor, June 14th, 2012. The biographies of inductees for 2012 can be read on their website here, and includes the following gentlemen:, 1155121=The Commonwealth Air Training Plan Museum is erecting a memorial to recognize members of the RCAF and all Canadians serving in any Commonwealth air force who lost their lives during the Second World War. Their names - over 19,000 compiled so far - and ages will be etched on an impressive granite wall about 300 feet long, situated on the Museum grounds at McGill Field in Brandon, Manitoba, Canada. The project has been ongoing since 2012 and with a cost of over one million dollars, the Museum is looking for public support. Its tentative unveiling deadline of August 2014. View the media and donation pamphlet in its entirety here., 467685=Potentially great developments in the Canadian Air and Space Museum's case against eviction! The Chairman of the Canadian Air & Space Museum in Toronto recently posted a message on the Museum web site on March 30, 2012:, 466408=On Sundays in April, the Western Canada Aviation Museum will be conducting tours focusing on the exciting \"outside of the box thinking that has been accomplished in the world of Canadian aviation.\" Tours will showcase the aircraft in their collection that were inspired by a new way of seeing the world, including the Dynavert, the Freobe Helicopter, and the Avrocar!, 420188=The Fall 2011 issue is at the printers and should be in the mail by the end of April. The Winter Journal is hot on its heels and we expect to be back on schedule this summer through some changes to the editorial team and process. Our current editor, Major Bill March, has been exceedingly busy this last year with his full-time job with the Armed Forces and a deployment to Afghanistan for several months. 2012 is turning out to be just as busy, so Major March will temporarily be turning over the controls to our excellent graphics manager (and publisher of Aviaeology), Terry Higgins., 416387=An update from the New Brunswick Convention office: Our 2012 Convention will be held at the Delta Brunswick (click to view in Google Maps) in Saint John, New Brunswick from Wednesday, September 5 through Saturday, September 8. The hotel has a block of rooms at the rate of $100/night. When you call (1-888-890-3222) simply mention you are with the CAHS to get the discounted rate., 1245822=Visit cahs.ca to view our rotating blog feature. This month, Bruce McLeod and Mark Whittaker offer insight into the Canadian Aviation Heritage Centre and its recently finished replica of a 1926 Fairchild Model FC-2 \"Razorback.\", 1065068=Following their last run-up of the season, the Bomber Command Museum of Canada's Lancaster #2 Merlin was started for the first time (minus the prop). The association hopes that in 2013 they will perform Lancaster run-ups with all four engines operational! Read more about their progress in their Museum Bulletin here., 963163=11 Oct}",
    "textBeforeTable": "  Full meeting details are available on our website at www.cahs.ca or click below on the city name.   Upcoming Chapter Meetings Read the full story on the blog! Note: All featured blogs are available as downloadable PDF's for easy reading on your smartphone or tablet.   In his preface Wayne writes: \"The name Beverly ‘Bev’ Shenstone",
    "textAfterTable": "Remember: Your local Chapter needs YOU! Are you a student working on an interesting research paper? An aspiring author? Pilot? Veteran? World traveller? Astronaut? If you have something unique and aviation-related to share, contact your local CAHS chapter and inquire about becoming a speaker! Member News It's a boy! The CAHS extends its congratulations to VP Danielle Metcalfe-Chenail on the birth of the CAHS's newest member, Andre Barrett Pagnutti. He was born 17 April 2012 and weighed in at 7 lbs 2 oz. Here he is on a lovely blanket made by President Gary Williams' wife, Wendy. Congratulations Danielle; he's adorable! Events and Announcements Films Take Flight: Canadian Aviation History on Film",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}