{
    "relation": [
        [
            "Opponent",
            "Coppin State",
            "UMBC",
            "FGCU",
            "Marist",
            "Marist",
            "Siena",
            "Geo. Wash.",
            "The Mount"
        ],
        [
            "Run",
            "10-1, 4:26",
            "16-4, 8:08",
            "22-5, 6:53",
            "9-0, 1:50",
            "15-3, 5:47",
            "13-0; 4:27",
            "17-0; 3:58",
            "9-0, 1:55"
        ],
        [
            "Start",
            "31-32, 1:36 (1)",
            "35-31, 19:16 (2)",
            "15-16, 8:08 (1)",
            "47-48, 11:16 (2)",
            "61-57, 6:03 (2)",
            "0-2, 19:28 (1)",
            "18-19, 6:28 (1)",
            "24-26, 1:59 (1)"
        ],
        [
            "Finish",
            "41-33, 17:11 (2)",
            "51-34, 11:08 (2)",
            "37-21, 1:11 (1)",
            "56-48, 9:26 (2)",
            "76-60, :16 (2)",
            "13-2; 15:35 (1)",
            "34-19, 2:30 (1)",
            "33-26, :04 (1)"
        ]
    ],
    "pageTitle": "George Washington News Archives - Page 3 of 7 - We Never Stop Talking Baltimore Sports",
    "title": "",
    "url": "http://wnst.net/tag/george-washington/page/3/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986423.95/warc/CC-MAIN-20150728002306-00050-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 271599567,
    "recordOffset": 271554898,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{77476=With wins in five of its first six Metro Atlantic Athletic Conference games this season, Loyola is off to its best start in league play since opening 7-1 in 2006-2007. That year, the Greyhounds lost their conference opener and then reeled off seven in a row., 77750=The 5-1 mark is tied for the best start to MAAC play through six games, matching that of the 2006-2007 team., 25596=Robert Olson scored seven points in a 23-second stretch versus Fairfield, going on a 7-0 run by himself. Fairfield led 62-55 when Olson pulled up for an 18-foot jumper with 1:42 left in regulation. He then hit a shot with his foot on the 3-point line 15 ticks later to make it a 3-point Stags lead. The junior guard tied the game at 62-62 with 1:19 on the clock with a three from the right side., 192707=Posted on 02 January 2012 by WNST Staff, 26007=Olson finished with 15 points, 13 coming in the second half. Earlier in the stanza, an Olson three at the 14:38 mark cut Fairfield’s largest lead of 15 to 12, and he then knocked one down with 10:04 on the clock., 114584=Olson scored the next seven points, his three pushing the Loyola lead to 64-53 with 7:28 to go before Washington momentarily stemmed the tide with a bucket at 7:11. Cormier, however, knocked down a three for Loyola to put its lead in double digits for good in a 77-62 win., 39332=Loyola’s 31 free throws made rank 11th on the school single-game chart and were the most since making 32 on January 14, 2009, versus NJIT., 41031=The Greyhounds embark on a two-game road trip next weekend when they travel to Western New York. Loyola plays at Niagara on Friday, January 27, and Canisius on Sunday, January 29., 117008=Meanwhile, teammate Erik Etherly has moved into the school’s all-time top 10 and is tied for ninth with Michael Tuck (2003-2008) with 51., 46600=The Greyhounds and Saints played on December 3, 2011, at the Times-Union Center in Albany with Loyola coming out on top of a 66-59 decision. Loyola went up 13-2 early in the game and led 30-19 at halftime., 198012=Loyola held Bucknell to just three points in the game’s final 4:10 to defeat the preseason pick to win the Patriot League, 72-67, on its home court. The Greyhounds trailed 64-61 after a Steven Kasper free throw, but layups by Justin Drummond and Dylon Cormier in the next 46 seconds put Loyola in front for good., 226303=After scoring fewer than 10 points for back-to-back games at Mount St. Mary’s and St. Bonaventure, the first time he was in single digits since January, Erik Etherly posted a double-double at Kentucky with team highs of 14 points and 11 rebounds., 36583=Last season, Patsos moved into third-place all time at Loyola in victories, trailing only Lefty Reitz (349 wins, 1937-44, 1945-61) and Nap Doherty (165, 1961-74)., 109548=The start is the best since 1970-1971 when Nap Doherty’s Greyhounds had the same 11-4 mark and went on to finish 19-7 and win the Mason-Dixon Conference Championship., 202900=Latham is a new addition to the Loyola side this season after transferring during the offseason from Xavier. He was granted an NCAA waiver and will be immediately eligible to play for the Greyhounds in 2011-2012 rather than having to sit out the typical year-in-residency., 108772=With wins in four of its five Metro Atlantic Athletic Conference games this season, Loyola is off to its best start in league play since opening 7-1 in 2006-2007. That year, the Greyhounds lost their conference opener and then reeled off seven in a row., 160249=Loyola heads out on the road for a pair of games next weekend, playing Friday, January 13, at Fairfield on ESPNU and at Iona on Sunday, January 15., 77909=Loyola’s 12-4 start through its first 16 games of the season ranks as the fourth best start during in that many games in program history. It is the best 16-game start since the Greyhounds moved up to NCAA Division I for the 1981-1982 season, improving on the 11-5 mark that Jimmy Patsos’ 2005-2006 team put together., 170881=Drummond was 3-of-3 form the field, and 3-of-4 from the free-throw line during the run, while the rest of the Greyhounds were 0-2 from both. He also had a big defensive rebound after a Cameron Ayers missed jumper that led to a Dylon Cormier layup to put Loyola in front for good at 3:36., 281415=The Greyhounds are on an eight-day break this week to take final exams. They resume play on Sunday when they travel to Olean, N.Y., for a 2:30 p.m. game at St. Bonaventure University., 109041=The 4-1 mark is tied for the best start to MAAC play through five games, matching that of the 2005-2006 and 2006-2007 teams., 106495=Loyola University Maryland returns to the road for the first of two games this weekend when it takes on Fairfield University on Friday, January 13, at 9 p.m., in Bridgeport, Conn., 224261=Loyola snapped the skid against the Bison with a 55-49 win in Lewisburg on December 28, 2009., 116678=With 114 during his three-year tenure as a Greyhound, Walker is three swats from tying George Sereikas (1989-1993) for second with 117. Brian Carroll (1997-2001) is the all-time leader with 213., 109730=The best start through 15 games came in 1930-1931 when the team coached by Walter Comerford played just 15 total games and finished the year 14-1. Two squads led by Emil ‘Lefty’ Reitz went 12-3 through 15. The 1940-1941 team finished 19-4, and the following year’s team ended the season 18-4 as Mason-Dixon champions., 189162=Loyola continues play at home with a 12 noon game on Saturday, January 9, against Canisius., 224122=The teams played in 1986-1987 and 1987-1988, and then twice during the 1992-1993 campaign, with Bucknell winning each time., 193966=The new year dawns on Sunday, and the Loyola University Maryland men’s basketball team will open play in 2012 the following day when it hosts Niagara University at 7:30 p.m. on Monday, January 2, in Reitz Arena., 45934=After a pair of road contests last week, Loyola University Maryland returns to Reitz Arena on Thursday, January 19, for a 7:30 p.m. game against Siena College., 107559=As one of 28 Jesuit Catholic universities around the nation, Loyola is a proud participant in the Jesuit Basketball Spotlight again this season. The Greyhounds defeated Canisius in its last game, and in addition to today’s game, they will also face fellow MAAC Jesuits Fairfield (home, February 12) and Saint Peter’s (home, January 22; away, February 5) and Canisius (away, January 29)., 166021=The Greyhounds won both meetings between the teams last season, defeating Manhattan, 82-67, on January 7 in Riverdale, and 62-50 on January 20 in Reitz Arena., 108307=The teams split a pair of games last season, each winning on its home floor. The Greyhounds edged Fairfield in a 66-65 thriller on January 14, 2011. J’hared Hall had 17 points off the Loyola bench and knocked down the go-ahead 3-pointer with just over two minutes left to break a 61-61 tie., 194193=The home game is the first for Loyola in over a month since the Greyhounds defeated Marist College on December 1., 48529=With wins in five of its first seven Metro Atlantic Athletic Conference games this season, Loyola is off to its best start in league play since opening 7-1 in 2006-2007. That year, the Greyhounds lost their conference opener and then reeled off seven in a row., 276615=The Greyhounds continue their current six-game road trip with one more game before Christmas. Loyola will face the nation’s current No. 3 team, Kentucky, in Rupp Arena on Thursday, December 22, at 1 p.m. in a game that will be televised on Fox Sports South and air on many Fox Sports affiliates nationwide., 225506=The Wildcats’ No. 3 rankings matches the highest-ranked opponent Loyola has faced in program history, equalling that of Kansas in January 2008., 71539=Loyola hosts Saint Peter’s on Sunday, January 22, at 12 p.m. in Reitz Arena., 15770=Loyola University Maryland will round off a two-game homestand on Sunday, January 22, when it hosts Saint Peter’s College at 12 noon in Reitz Arena., 253745=Since falling at Wake Forest on November 11 in the season-opener, the Greyhounds have reeled off eight-straight victories. The winning streak is the longest in the school’s NCAA Division I history (since 1981-82), and it is the longest since the 1964-1965 team won eight in a row during January and February., 141983=The Greyhounds were encouraged by the contributions of senior co-captain J’hared Hall who made a pair of 3-pointers off the bench, one in each half. The treys were the first and second of the season for Hall who was the MAAC Sixth Player of the Year in 2010-2011., 109216=Loyola’s 11-4 start through its first 15 games of the season ranks as the fourth best start during in that many games in program history. It is the best 15-game start since the Greyhounds moved up to NCAA Division I for the 1981-1982 season, improving on the 10-5 mark that Jimmy Patsos’ 2005-2006 team put together., 147966=The Greyhounds also won their conference opener for the first time since 2005-2006, marking just the fourth time in 23 seasons they were 1-0 in the MAAC., 252521=Loyola University Maryland will return to the court, after taking the week off for final exams, on Sunday, December 18, to take on St. Bonaventure University at 2:30 p.m., 184070=Shane Walker’s block of a Kevin Cantinol layup 1:25 into the second half against Florida Gulf Coast was the 100th rejection of his Loyola career. He is now one of three Greyhounds all-time to log 100 or more blocked shots, joining Brian Carroll (217, 1997-2001) George Sereikas (117, 1989-1993)., 101504=The Greyhounds return to Reitz Arena for a pair of MAAC games in the next week. Loyola hosts Siena on Thursday night at 6:30 p.m., and it then hosts Saint Peter’s on Sunday at 12 noon., 24707=The 15-point deficit overcome was the largest erased by a Loyola team since the Greyhounds came back from a 20-point Coppin State lead in the first half on December 10, 2008, to defeat the Eagles, 73-70., 74835=Posted on 15 January 2012 by WNST Staff, 150104=Justin Drummond put together a career-high scoring effort in the Greyhounds’ loss at St. Bonaventure, finishing with 26 points to eclipse the 22 he scored last February against Canisius., 17389=Loyola’s 13-5 start through its first 18 games of the season ranks as the fourth-best start during in that many games in program history. It is the best 18-game start since the Greyhounds moved up to NCAA Division I for the 1981-1982 season, improving on the 11-7 mark that Jimmy Patsos’ 2005-2006 and 2006-2007 team, and Skip Prosser’s 1993-1994 squad puts together., 27993=Walker now has 117 blocks in his career, matching the total of George Sereikas from 1989-1993. Brian Carroll (1997-2001) holds the school record with 213., 279469=The Greyhounds are also ranked for the first time this season in the CollegeInsider.com Mid-Major Top 25, checking in at 24th.Loyola is ranked in the poll for the first time since the end of the 2007-2008 season when it finished the year 19-14, the most wins in Loyola’s Division I history., 105172=Posted on 13 January 2012 by WNST Staff, 152962=The Greyhounds had not had the same three players score 10 or more in four-straight games since Gerald Brown, Marquis Sullivan and Michael Tuck did it against Rider, UC-Davis, Canisius and Marist from February 18-March 2, 2008. Loyola was 3-1 during that stretch., 19052=With wins in six of its first eight Metro Atlantic Athletic Conference games this season, Loyola is off to its best start in league play since opening 7-1 in 2006-2007. That year, the Greyhounds lost their conference opener and then reeled off seven in a row., 226780=Etherly has scored in double figures in 20 of the Greyhounds’ last 22 games, going back to January 28, 2011, against Siena. In those 22 games, Etherly has averaged 14 points per contest., 165642=Thursday’s game will mark just the second time this season that Loyola has played back-to-back games in Reitz Arena, the first coming November 27 and December 1., 14491=Posted on 22 January 2012 by WNST Staff, 30743=At Bucknell on December 28, Loyola never led by more than five, and the Bison were only up three on occasions. In November, the Greyhounds defeated New Hampshire on the road in a contest separated by no more than seven., 245970=It marked the first time since January 3, 2009, a stretch of 80 games, that a pair of Greyhounds scored 20 in the same game. On that date, Jamal Barney poured in 41 at Canisius, while Brett Harvey had 22., 27771=Shane Walker blocked two Fairfield shots in the first three minutes of the game, and he then swatted a Maurice Barrow layup with 13:58 on the clock, tying him for second all-time at Loyola in blocked shots., 280054=This year, the Greyhounds fell by 12 points in their season-opener at Wake Forest University, but they have reeled off eight wins in a row, the most since the school elevated to NCAA Division I status in 1981-1982. The 8-1 start also has eclipsed the previous mark for the best start in the same time span. The 2005-2006 team won five in a row to start the year and was 7-2 after nine games., 278971=Posted on 13 December 2011 by WNST Staff, 168999=Loyola’s six road wins in November and December have them tied for second in all of NCAA Division I for victories away from its home court., 143334=Loyola, which led by six with more than seven minutes to play after two Cormier free throws, took a 58-57 advantage on a Walker free throw with 2:08 left. Michael Alvarado, however, put the Jaspers up a point with a pull-up jumper in the lane with 56 ticks remaining., 257644=Mount St. Mary’s pulled within five points, 46-41, with 9:01 left in the second half last Saturday, but the Greyhounds defense keyed their next run., 131419=The Greyhounds continue their road swing with a 3:30 p.m. game on Sunday in New Rochelle, N.Y., at Iona College., 28801=In its first MAAC loss of the season, a 66-61 defeat on January 2 against Niagara, the Greyhounds shot just 4-of-20 from 3-point range, its worst effort from behind the arc since going 2-of-14 at UMBC on November 17., 62127=Etherly has scored in double-figures in 21 of the Greyhounds’ last 23 games, going back to January 2011. He has averaged 14.1 in those contests., 23142=Moreover, they scored 66 in both outings against the Saints. In December, the Greyhounds made eight 3-pointers versus Siena, compared to five on Thursday. But, on Thursday, they sank 15 free throws as opposed to 12 in Albany., 223494=Loyola University Maryland will play its final game of 2011 on Wednesday, December 28, when it takes on Bucknell University at 7 p.m. in Lewisburg, Pa., at Sojka Pavilion., 36281=Head Coach Jimmy Patsos became the third coach in Loyola history to win 100 games when the Greyhounds defeated UMBC, 73-63, on the road. Patsos, who is in his eighth season, took over a team that finished 1-27 during the 2002-2003 season. He won his 100th game in his 215th career game., 77047=Six Loyola players scored in double figures in the game – Brian Rudolph (19), J’hared Hall (15), Justin Drummond (14), Dylon Cormier (12), Erik Etherly (12) and Olson (12). It was the first time that a Loyola team had six players score in double figures since December 6, 1991, when the Greyhounds matched the feat in a 98-84 overtime home victory against Mount St. Mary’s., 261725=Up to and including that game, Etherly scored in double-figures for 19-straight games, starting January 28, 2011, against Siena. In those 19 games, Etherly averaged 14.3 points per game., 252990=The teams first met on the hardwood in March 1927, a 33-18 St. Bonaventure victory. The sides met again in 1936-1937 and then not again until Nap Doherty’s Greyhounds took on the Bonnies on December 22, 1967. They met again during the 1969-1970 and 1970-1971 seasons when St. Bonaventure was ranked No. 5 and No. 19 by The Associated Press. Bona’s 1969-1970 team, a squad that advanced to the Final Four with future Basketball Hall of Famer Bob Lanier in his senior year, was the highest-ranked team Loyola would face until playing No. 3 Kansas on January 8, 2008., 39112=As a team, Loyola went to the free-throw line 46 times at UMBC, making 31. The 46 attempts are the sixth-most all-time and most since the 2004-2005 squad attempted 53 on December 5, 2004, against Niagara., 227019=Entering the December 22 game against the Greyhounds, Preseason All-SEC and Dick Vitale Solid Gold selection Doron Lamb was leading the Wildcats at 16.7 points per game., 138199=On a baseline out-of-bounds play, Shane Walker found Cormier in the low right corner, and Cormier knocked down his first three since the 15:49 mark in the December 28 game at Bucknell., 51349=Robert Olson scored seven points in a 23-second stretch Friday night, going on a 7-0 run by himself. Fairfield led 62-55 when Olson pulled up for an 18-foot jumper with 1:42 left in regulation. He then hit a shot with his foot on the 3-point line 15 ticks later to make it a 3-point Stags lead. The junior guard tied the game at 62-62 with 1:19 on the clock with a three from the right side., 194770=Loyola snapped a nine-game losing skid to the Purple Eagles in the teams’ second meeting last year, winning a 75-63 decision in Western New York on February 25, 2011., 141203=Manhattan’s 21 turnovers tied for Loyola’s opponent season-high, matching that of UMBC in the November 17 game., 19363=Loyola used its largest run of the season to rally from seven down and defeat Siena, 66-55. The Saints took a 47-40 advantage with 10:35 to play, but a Dylon Cormier three 25 ticks of the clock later, after a Justin Drummond offensive rebound, sparked a 22-2 run that saw the Greyhounds take a 62-49 lead with under three minutes remaining., 108613=Fairfield defeated Loyola, 65-55, on December 5, 2010, the Greyhounds’ most recent trip to Harbor Yard., 85194=Robert Olson scored seven of his 15 points during a 23-second stretch in the second half, erasing a 62-55 Fairfield advantage and tying the game with a three with 1:19 to play., 110847=Much of Loyola’s improved 3-point shooting over its last two games is thanks to Robert Olson. Entering last Thursday’s game against Manhattan, Olson had made just 4-of-18 threes (.222) dating back to the December 18 game at St. Bonaventure., 226565=The double-double was Etherly’s fifth this season and ninth of his career. His most recent feat came on December 7 at George Washington when he scored 12 and matched his career-best with 15 rebounds., 32408=Loyola sophomore guard Dylon Cormier picked up a couple of awards for his recent play, earning Metro Atlantic Athletic Conference Player of the Week and Jesuit Basketball Spotlight National Player of the Week honors on December 12, both for the first time in his career., 137213=Both teams won on its home court last year with the Greyhounds defeating Canisius, 72-57, on February 13, 2011, behind 22 points from Justin Drummond and 18 from Erik Etherly. The Golden Griffins returned the favor, topping Loyola, 75-58, 14 days later in Buffalo., 173725=For the only time this season, Loyola faced teams that appeared in the 2011 NCAA Tournament in consecutive games, No. 3 Kentucky and Bucknell., 196778=One of the Greyhounds’ accomplishments on their recent road trip came Wednesday when they snapped Bucknell’s 18-game winning streak on its home floor. The streak was the 11th-longest in NCAA Division I at the time and spanned 394 days to November 2010., 239982=In the Greyhounds’ January 30 victory last year over Iona, six players scored in double-figures, and the team’s top two scorers at the time did not even dress for the contest. It was the first time that a Loyola team had six players score in double figures since December 6, 1991, when the Greyhounds matched the feat in a 98-84 overtime home victory against Mount St. Mary’s., 251223=Posted on 18 December 2011 by WNST Staff, 267683=Four of Williams’ assists came in the final 11:16 of the game as Loyola outscored Marist, 29-15, during that stretch., 165351=Loyola University Maryland plays the second of three home games this week on Thursday, January 5, when it hosts Manhattan College at 7:30 p.m., 166195=Loyola has won seven of the last nine meetings between the schools dating back to the 2007-2008 season., 54634=Ryan Olander made a three with 18:12 to go in the second half for the Stags, giving them a 14-point lead, but they did not make a shot from the field for nearly eight minutes until Rakim Sanders’ jumper at 10:19., 136411=As one of 28 Jesuit Catholic universities around the nation, Loyola is a proud participant in the Jesuit Basketball Spotlight again this season. The Greyhounds will also face fellow MAAC Jesuits Fairfield (away, January 13; home, February 12) and Saint Peter’s (home, January 22; away, February 5), as well as a return date to Buffalo to take on Canisius on January 29., 120190=Loyola’s previous best for wins in November and December was seven, a number Jimmy Patsos-led teams totaled during the 2005-2006 and 2009-2010 seasons., 194322=Monday’s game is the tail end of doubleheader. The Loyola women host Niagara at 4:30 p.m., 113530=Canisius cut Loyola’s one-time 15-point lead to just four with 10:14 to play, but Robert Olson scored the next seven points, and Dylon Cormier added a three after a Golden Griffins’ bucket to put Loyola up 12., 15934=The game is the first of two over the next two weeks the teams will play. The Greyhounds travel to Jersey City, N.J., for a Super Bowl Sunday contest against the Peacocks on Sunday, February 5, at 2 p.m., 222230=Posted on 28 December 2011 by WNST Staff, 174951=Drummond spread his 26 points evenly between the two halves, scoring 13 in each. He scored six-straight points as Loyola held the Bonnies scoreless for over two minutes in the second half, trimming St. Bonaventure’s advantage from 12 to six with 4:06 to play., 17772=The start is the best since 1970-1971 when Nap Doherty’s Greyhounds had the same 14-4 mark and went on to finish 19-7 and win the Mason-Dixon Conference Championship., 21598=In the Greyhounds’ last four games, dating back to the January 7 contest against Canisius, Etherly is averaging 12.8 points and 8.0 rebounds., 224949=For the only time this season, Loyola will be facing teams that appeared in the 2011 NCAA Tournament in consecutive games., 176610=His only sub 10-point outing came one game earlier when he scored just four points at George Washington. Both of his field goals against the Colonials were big ones, however. The first came after George Washington cut Loyola’s one-time 20-point advantage to just eight with 5:18 to play, and the momentum appeared to have shifted to the Colonials. On the ensuing possession, R.J. Williams misfired on a jumper, but Walker came from the weak side to grab the rebound and lay it off the glass for his first points., 152688=The last time three Loyola players scored 10 or more over a six-game stretch was the 1997-1998 season when Mike Powell, Jason Rowe and Roderick Platt accomplished the task in consecutive games from January 25-February 15, 1998. Loyola was 5-1 in those games., 61329=Erik Etherly led Loyola in four statistical categories at Bucknell: points (18), rebounds (8), assists (4) and blocked shots (4). While it was atypical to lead the Greyhounds in all of the categories, Etherly has routinely topped the team in at least one category this season. He was named the Metro Atlantic Athletic Conference Co-Player of the Week on January 2., 223681=Both the Greyhounds and Bison are coming off six-day layoffs for Christmas after they both played on December 22, Bucknell at Boston University and Loyola at the third-ranked Kentucky Wildcats., 224408=Wednesday’s game will close a six-game road swing for the Greyhounds. They have not played at Reitz Arena since defeating Marist in the Metro Atlantic Athletic Conference opener on Thursday, December 1., 47719=The start is the best since 1970-1971 when Nap Doherty’s Greyhounds had the same 12-4 mark and went on to finish 19-7 and win the Mason-Dixon Conference Championship., 141601=Twice, Olson’s treys gave Loyola the lead, at 11:30 and 3:18 in the second half, and his bomb with 7:37 to go put the Greyhounds ahead by four., 267161=Freshman R.J. Williams made the first start of his collegiate career on November 20 at New Hampshire and has started the four games since then, playing 31 or more minutes in each., 33234=The 19 steals are the second-most in school history, one more than the Greyhounds posted in a November 29, 1997, game at Kent State. It is also the most Loyola has recorded against a Division I opponent. The school single-game record of 20 came on February 28, 1996, when the team closed the regular-season against St. Mary’s (Md.)., 40228=Since taking over as head coach in 2004, Jimmy Patsos has put an emphasis on recruiting locally, and it has never shown as much as on this year’s roster. Three players – sophomore guard Dylon Cormier (Cardinal Gibbons), sophomore forward Jordan Latham (City) and freshman guard R.J. Williams (St. Frances) are products of schools within the city limits., 117205=The Greyhounds were encouraged by the contributions against Manhattan of senior co-captain J’hared Hall who made a pair of 3-pointers off the bench, one in each half. The treys were the first and second of the season for Hall who was the MAAC Sixth Player of the Year in 2010-2011., 24453=Loyola trailed by 15 points with 16:42 to play in the second half when two Keith Matthews free throws gave Fairfield a 45-30 lead last Friday night. The Greyhounds, however, outscored the Stags 36-18 from that point forward to win, 66-63., 17954=The best start through 18 games came in 1940-1941 when the squad led by Emil ‘Lefty’ Reitz went 15-3 through 18. The 1940-1941 team finished 19-4., 44665=Posted on 19 January 2012 by WNST Staff, 224763=The Greyhounds return to Baltimore for the first of three-straight home games on Monday, January 2, to play Niagara., 165509=The Greyhounds are playing three games in the span of six days for the only time during the 2011-2012 regular-season., 194952=Niagara holds a 33-15 advantage in the previous 48 meetings between the teams and had won nine in a row dating back to the January 12, 2007, when Loyola last won a home game in the series. That was a thrilling, 96-95, overtime victory in Reitz Arena., 194427=It will also be the first of 14-straight Metro Atlantic Athletic Conference contests for the Greyhounds. The lone remaining non-conference match-up on Loyola’s regular-season slate will be on the weekend of February 17-19 when the Greyhounds will host an opponent in Bracketbuster action., 47902=The best start through 16 games came in 1940-1941 when the squad led by Emil ‘Lefty’ Reitz went 3-3 through 16. The 1940-1941 team finished 19-4., 168384=Erik Etherly put Loyola ahead 61-57 with a fast-break dunk at 3:35, but Juan’ya Green made a three just over a minute later, and Antoine Mason’s layup with 61 ticks left gave Niagara the lead for good., 76576=Loyola and Iona will meet for the 54th time in series history when the teams take the court on Sunday. The Gaels hold a 40-12 advantage in the series, although Loyola won the most recent meeting, an overtime thriller on January 30, 2011., 114266=Canisius, which trailed by 15 after an Anthony Winbush offensive rebound and putback, cut the Greyhounds’ lead to four, on an Alshwan Hymes three with 10:14 to play. The Golden Griffins had a chance to make it a two-point game on their next possession, but Harold Washington’s jumper went off the mark., 151183=Loyola’s victory against Siena on December 3 moved the Greyhounds’ record to 6-1 and gave the 2011-2012 team the best start in school Division I history, improving on the 5-1 start the Greyhounds achieved in 2005-2006., 170597=Justin Drummond scored nine-straight Loyola points over a 4:09 stretch that helped the Greyhounds stay close to Bucknell when the Bison were rallying. Bucknell outscored Loyola 13-9 during the span, but Drummond’s play kept the Bison from getting too far out in front., 39764=Cormier’s 15 free throws made are tied for sixth in Loyola single-game history, matching the total made by Mike Powell at Saint Peter’s on December 6, 1997, and Donovan Thomas against Marist on February 23, 2003. The 15 makes were the most by a Loyola player since Jamal Barney set the school record with 18 on January 14, 2009, against NJIT. His 17 attempts rank tied for sixth all-time., 164091=Posted on 05 January 2012 by WNST Staff, 47371=Loyola’s 12-5 start through its first 17 games of the season ranks as the fourth best start during in that many games in program history. It is the best 17-game start since the Greyhounds moved up to NCAA Division I for the 1981-1982 season, improving on the 11-6 mark that Jimmy Patsos’ 2005-2006 and 2006-2007 team puts together., 255060=It is the first time Loyola has been ranked in the CollegeInsider.com poll since late in the 2007-2008 season., 54139=The junior forward had not posted a double-double this calender with his last coming on December 22, 2011, at then-No. 3 Kentucky., 31115=Justin Drummond topped the 20-point plateau for the second time in four games when he led all players with 23 points on Monday night against Niagara. The 23 points were his second-most in a game during his career at Loyola, three behind the 26 he scored on December 18 at St. Bonaventure., 31956=The roadtrip is the longest in school Division I history (since 1981-1982), stretching longer than multiple five-game swings, the most recent coming from December 21, 2008-January 5, 2009. That trip took Loyola from Northern California (UC-Davis) to North Carolina (Duke and North Carolina State) and Western New York (Canisius and Niagara). The Greyhounds went 2-3 against those teams., 168172=Loyola overcame a 12-point Niagara lead to go up by four on two occasions in the second half, but the Purple Eagles held the Greyhounds scoreless for the last 3:24 of the game for a 66-61 victory., 38289=Brigham Young finished the 1996-1997 season with a 1-25 record. Steve Cleveland took over the following season and tallied 138 wins until his departure for Fresno State after the 2004-2005 season., 50220=Loyola trailed by 15 points with 16:42 to play in the second half when two Keith Matthews free throws gave Fairfield a 45-30 lead Friday night. The Greyhounds, however, outscored the Stags 36-18 from that point forward to win, 66-63., 134711=Posted on 06 January 2012 by WNST Staff, 62536=The winning streak was the longest in the school’s NCAA Division I history (since 1981-82), and it is the longest since the 1964-1965 team won eight in a row during January and February., 38562=Loyola University Maryland is one of just 26 mid-major schools that has men’s and women’s basketball coaches with 100 or more victories at their current school after Greyhound women’s coach Joe Logan got his 100th on December 18 in a win at George Washington., 76094=Loyola University Maryland wraps up a two-game road trip on Sunday, January 15, when it takes on Iona College at 3:30 p.m. in New Rochelle, N.Y. The game is the second part of a doubleheader, as Iona’s women take on Manhattan College at 1 p.m., 218646=The Greyhounds play two more games at Reitz Arena this week, hosting Manhattan on Thursday, January 5, at 7:30 p.m., before welcoming Canisius on Saturday, January 7, at 12 noon., 225314=Loyola took on Kentucky on December 22 in Rupp Arena when the Wildcats were ranked No. 3 in both the Associated Press and USA Today polls., 23967=Kyle Downey made two free throws with 10:35 to play, but 25 seconds later Dylon Cormier made a 3-pointer from the left side that sparked a 15-0 run, and Loyola extended that stretch to 22-2, in a 66-55 win over Siena Thursday night., 229326=Twice in the first half, Kentucky appeared ready to break the game wide open. The Wildcats scored nine straight after Dylon Cormier’s opening bucket, but Loyola then reeled off six-straight to make it a 9-8 game. Later, Marquis Teague made two free throws to put Kentucky up 33-23 only to see Loyola pull within a pair, 33-31, on an Etherly dunk with 4:30 remaining in the half., 253584=Sunday’s game will be the first meeting between the teams since January 27, 1975, a 98-73 St. Bonaventure win., 178688=He recorded his third 20-point effort of the season on December 3 at Siena, scoring 22, and he set another career-high one game later with a game-best 26 in the win over George Washington.}",
    "textBeforeTable": "Posted on 22 January 2012 by WNST Staff Loyola Hosts Saint Peter’s in Sunday Matinee Tags: Albany, Baltimore, Bucknell, California, Canisius, city, connecticut, coppin, Coppin State, duke, eagles, Fairfield, George Washington, greyhounds, Hounds, iona, jimmy patsos, Kentucky, Lehigh, loyola, loyola university, Loyola University Maryland, MAAC, Manhattan, Marist, maryland, Metro Atlantic Athletic Conference, morgan, Morgan State, Mount St. Mary's, NCAA, New Hampshire, New Jersey, new york, niagara, North Carolina, north carolina state, patsos, Player of the Week, reitz arena, saints, siena, St. Frances, St. Mary's, super bowl, UMBC Tag Archive | \"George Washington\" Learn More › Show Support When You Shop ›",
    "textAfterTable": "Justin Drummond grabbed four offensive rebounds on Thursday, and the Greyhounds scored following each one. Drummond immediate put the ball back up and in after two of his rebounds for four of his nine points. He also kicked the ball out to R.J. Williams who found Dylon Cormier on the left side for a three after a long Drummond rebound with just over 10 minutes to left in the game. Drummond also grabbed an offensive rebound after a missed free throw, and following a Loyola timeout, Robert Olson scored a driving layup with 54 seconds remaining. In all, the Greyhounds scored nine of their 17 second-chance points off Drummond rebounds. Bench Press Loyola played just three players – Julius Brooks, Justin Drummond and Anthony Winbush – off its bench on Thursday, but the Greyhounds outscored Siena’s subs, 17-0. Drummond scored nine, and Winbush matched his season-high with eight. 12 Plus 12 Equals Number 24 Erik Ethelry turned in a combined point-rebound performance worthy of his number 24 on Thursday night. He logged his seventh double-double of the year with 12 points and a game-high 12 rebounds versus the Saints. Etherly, who also had three blocked shots and three steals, secured five of his rebounds on the offensive end. Loyola is 6-1 this season when Etherly had a double-double performance, the only loss coming when Etherly had 14 points and 11 rebounds at then-No. 3 Kentucky. In the Greyhounds’ last four games, dating back to the January 7 contest against Canisius,",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}