{
    "relation": [
        [
            "Item",
            "1",
            "2",
            "3",
            "4",
            "5",
            "6",
            "7",
            "8",
            "9",
            "10",
            "11",
            "12",
            "13",
            "14",
            "15",
            "16",
            "17",
            "18",
            "19",
            "20",
            "21"
        ],
        [
            "Line",
            "1",
            "1",
            "1",
            "2",
            "3",
            "4",
            "5",
            "6",
            "6",
            "6",
            "7",
            "8",
            "8",
            "9",
            "9",
            "10",
            "10",
            "11",
            "12",
            "12",
            "13–21"
        ],
        [
            "Position",
            "1–5",
            "7–18",
            "31–34",
            "43–60",
            "43–60",
            "43–60",
            "43–60",
            "16–18",
            "41–49",
            "68–75",
            "27–44",
            "10–12",
            "27–44",
            "10–12",
            "27–44",
            "10–12",
            "27–44",
            "27–44",
            "19–26",
            "52–59",
            ""
        ],
        [
            "Description",
            "CC—ICOMP",
            "TIN and File Source",
            "Name Control",
            "IDRS Module Balance. Right Justified.",
            "Accrued Interest. Right Justified.",
            "Accrued FTP. Right Justified.",
            "Total Balance Due. Right Justified.",
            "Total Payments. Right Justified.",
            "Down Payment Date.",
            "First Payment Date.",
            "Down Payment. Right Justified.",
            "Number of Payments from the first payment date.",
            "First Payment Amount.",
            "Number of Payments from the second payment date.",
            "Second Payment Amount.",
            "Number of Payments from the third payment date.",
            "Third Payment Amount.",
            "Final Payment Amount.",
            "Second Payment Date.",
            "Third Payment Date.",
            "Line 13 may be repeated as many times as necessary thru line 21. The character position immediately following TXPD on lines 13 thru 21 may be a #."
        ]
    ],
    "pageTitle": "Internal Revenue Manual - 2.3.29 Command Codes INTST, ICOMP, and COMPA",
    "title": "",
    "url": "http://www.irs.gov/irm/part2/irm_02-003-029.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986423.95/warc/CC-MAIN-20150728002306-00199-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 530174739,
    "recordOffset": 530146103,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{110806=Valid Response: Output of COMPAC, COMPAD, COMPA2, COMPA4, COMPA5 or COMPA6. See Exhibit 2.3.29-13., 104577=Valid Response: Output of COMPAE See Exhibit 2.3.29-11., 13136=COMPAP, to be used with dates after 12/31/1984, has the same capabilities as COMPA except that the interest rate is 120 percent of the regular rate., 142550=Transfer-In Doc-Code 51 Transaction other than DLN Blocking Series 100–159, which posted 1-1-1973 or later (IMF)., 10392=COMPAD can accommodate 21 lines of input (21 amounts); for each line (or amount), COMPAD displays the detail used to compute the interest. The appropriate percent(s), the to and from dates used to compute the elapsed time, the factor used and the amount computed as the result is displayed and then accumulated into a total for all screens. COMPAD computes in the same manner as COMPA and is designed to be used with one tax module. COMPAD computes DEBIT interest before 1-1-1999. 01-01-1999 and Subsequent for \"Non-Corporate\" taxpayers, COMPAD will compute CREDIT and DEBIT interest (since the interest rate for \"Non-Corporate\" taxpayers will be the same for CREDIT & DEBIT)., 10041=COMPAC is used to compute credit interest before 1-1-1999. From 1-1-1999 on COMPAC will compute credit interest for \"Corporate\" taxpayers only. Input and output formats are the same as COMPAD., 17069=COMPA6 is used to compute interest for Military personnel based on IRM 5.1.7.12.2 where the interest can only be charged at a maximum of 6 percent., 121784=COMPAF       08061987 05051987    08221987 100.00 This input would generate the INVAL START-DT error message because the program is then actually computing to the end of the month, which in this example will always be the 5th of the month. Because the To Date is past the 5th of the month, the program actually will compute to 09051987, thereby charging the taxpayer with the FTP penalty at the 1/1% rate. Since 09051987 is past 08061987, there will be no computation at the 1% rate. The operator should either re-input the screen without the 1% Start Date or consult the IRM 20.1 to be certain that they have computed the correct 1% Start Date. The invalid data elements can be corrected and re-entered., 141945=Status Code 14 (Form 1041 Installment) is present in the Status History Section (BMF)., 142691=Non-Delinquent Form 1120, Form 990C, Form 990T where current 23c date earlier than the return due date plus 80 days (BMF)., 122588=Valid Response: Output of COMPAF. See Exhibit 2.3.29-15., 142347=Transfer-In Doc-Code 51 Transaction prior to January 1983 (BMF)., 143287=Audit/DP Tax Adjustment posted prior to 1/1/1970., 9306=The input of CC COMPA causes IDRS to compute the interest on a specified amount for a specified period of time. Each screen display (page) can accommodate up to 21 amounts. CC COMPA computes and displays a line amount for each line of input. The line amounts are accumulated and displayed on line 23 as the page total. CC COMPA also has the capability of accumulating page totals for display on subsequent page(s). It is important that the interest periods input not overlap. COMPA computes debit interest before 1-1-1999. From 01-01-1999 and subsequent, COMPA will compute CREDIT and DEBIT interest (since the interest rate for \"Non-Corporate\" taxpayers will be the same for CREDIT & DEBIT)., 12476=COMPAM is used for multiple independent credit interest calculations on the same input page. It is possible to input eleven computations on one screen, provided that each input line is associated with a separate tax module. COMPAC will have to be used if the computation from one module requires more than one input line. COMPAM, like its debit interest counterpart, COMPAR, will accept overlapping dates. Line amounts will be displayed and a page total accumulated, which may be carried over onto subsequent pages. Computes Credit interest before 01-01-1999. 01-01-1999 and subsequent Credit interest for Corporate taxpayers only., 4585=(1) This transmits revised IRM 2.3.29, IDRS Terminal Input, Command Codes INTST, ICOMP and COMPA., 117334=Use the Command Code COMPA with the definer F to compute failure to pay penalty. Beginning January 1, 1987, a 1% Start Date may be entered (See Item 3 listed below) on the screen. User can enter up to 21 lines of data on the screen. If the computation is to be continued on a second screen format for the same module, the continuation indicator must be present on the subsequent input for a correct computation of FTP penalty. Due to program complexities and limitations FTP computations involving additional assessments, such as TC290, TC298, TC300, and TC308, must be entered on a separate screen from the original Tax liability., 4514=June 19, 2015, 54930=MFT 58 - 64 PRIOR TO 1968 — Self Explanatory., 142841=Form 1120, Form 990C, Form 990T or Form 1041A (BMF)., 11810=COMPAR is used when several independent debit interest calculations are desired on the same page of input. For example, up to eleven computations can be checked on one input screen, provided that each input line is from a separate tax module. If more than one input line is needed for one module's interest computation, COMPA will have to be used. Overlapping dates may be used in COMPAR. Line amounts will be displayed and a page total accumulated, which may be carried over onto subsequent pages. Computes Debit interest before 01-01-1999. 01-01-1999 and subsequent Debit and Credit (for \"Non-Corporate taxpayers\" ) interest., 139802=TOO MANY PAYMENTS — 1000 or payments to be applied to module balance.}",
    "textBeforeTable": "COMPA, COMPAF, COMPAS, COMPA4 and COMPAP are designed to be used for only one module per input. For example, a module with the following transactions: COMPAP, to be used with dates after 12/31/1984, has the same capabilities as COMPA except that the interest rate is 120 percent of the regular rate. COMPAM is used for multiple independent credit interest calculations on the same input page. It is possible to input eleven computations on one screen, provided that each input line is associated with a separate tax module. COMPAC will have to be used if the computation from one module requires more than one input line. COMPAM, like its debit interest counterpart, COMPAR, will accept overlapping dates. Line amounts will be displayed and a page total accumulated, which may be carried over onto subsequent pages. Computes Credit interest before 01-01-1999. 01-01-1999 and subsequent Credit interest for Corporate taxpayers only. COMPAR is used when several independent debit interest calculations are desired on the same page of input. For example, up to eleven computations can be checked on one input screen, provided that each input line is from a separate tax module. If more than one input line is needed for one module's interest computation, COMPA will have to be used. Overlapping dates may be used in COMPAR. Line amounts will be displayed and a page total accumulated, which may be carried over onto subsequent pages. Computes Debit interest before 01-01-1999.",
    "textAfterTable": "6 DEFINER (blank, A, B, N, V, or D) 3* 1 7–18 TIN and File Source       If the preceding command code updates the header then enter INTST and definer as usual, and do not enter the TIN. On line 2 enter the compute to date in positions 1–8 and do not enter the MFT, Tax Period and Name Control. 4* 2 1–2 MFT 5* 2 4–9 Tax Period (YYYYMM) 6** 2 11–18 To Date (MMDDYYYY) (must be subsequent to Return Due Date) 7* 2 20–23 Name Control 8*** 3 1–2 INTSTA To Date Plus 10 (blank or nn) 9*** 4 1–2 INTSTA To Date Plus 15 (blank or nn) 10*** 5 1–2 INTSTA To Date Plus 21 (blank or nn) 11 V v–v Entry Code — See IRM 2.3 Chapter 9  ",
    "hasKeyColumn": true,
    "keyColumnIndex": 3,
    "headerRowIndex": 0
}