{
    "relation": [
        [
            "type",
            "FR Doc.",
            "RIN",
            "T.D.",
            ""
        ],
        [
            "regulations.gov",
            "2014-23323",
            "1545-BL90",
            "9697",
            "CMS-9946-F"
        ]
    ],
    "pageTitle": "26 CFR 54.6695-1 - Other assessable penalties with respect to the preparation of tax returns for other persons. | US Law | LII / Legal Information Institute",
    "title": "",
    "url": "https://www.law.cornell.edu/cfr/text/26/54.6695-1",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989043.35/warc/CC-MAIN-20150728002309-00263-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 928707547,
    "recordOffset": 928679895,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{980=Title 26 published on 2013-04-01.}",
    "TableContextTimeStampAfterTable": "{67432=This document contains proposed rules that would amend the regulations regarding excepted benefits under the Employee Retirement Income Security Act of 1974, the Internal Revenue Code (the Code), and the Public Health Service Act related to limited wraparound coverage. Excepted benefits are generally exempt from the requirements that were added to those laws by the Health Insurance Portability and Accountability Act and the Patient Protection and Affordable Care Act., 42769=This document contains final regulations regarding coverage of certain preventive services under section 2713 of the Public Health Service Act (PHS Act), added by the Patient Protection and Affordable Care Act, as amended, and incorporated into the Employee Retirement Income Security Act of 1974 and the Internal Revenue Code. Section 2713 of the PHS Act requires coverage without cost sharing of certain preventive health services by non-grandfathered group health plans and health insurance coverage. Among these services are women's preventive health services, as specified in guidelines supported by the Health Resources and Services Administration (HRSA). As authorized by the current regulations, and consistent with the HRSA guidelines, group health plans established or maintained by certain religious employers (and group health insurance coverage provided in connection with such plans) are exempt from the otherwise applicable requirement to cover certain contraceptive services. These final regulations simplify and clarify the religious employer exemption. These final regulations also establish accommodations with respect to the contraceptive coverage requirement for group health plans established or maintained by eligible organizations (and group health insurance coverage provided in connection with such plans), as well as student health insurance coverage arranged by eligible organizations that are institutions of higher education. These regulations also finalize related amendments to regulations concerning Affordable Insurance Exchanges., 26548=These final regulations implement the 90-day waiting period limitation under section 2708 of the Public Health Service Act, as added by the Patient Protection and Affordable Care Act (Affordable Care Act), as amended, and incorporated into the Employee Retirement Income Security Act of 1974 and the Internal Revenue Code. These regulations also finalize amendments to existing regulations to conform to Affordable Care Act provisions. Specifically, these rules amend regulations implementing existing provisions such as some of the portability provisions added by the Health Insurance Portability and Accountability Act of 1996 (HIPAA) because those provisions of the HIPAA regulations have become superseded or require amendment as a result of the market reform protections added by the Affordable Care Act., 37454=This document contains final rules implementing the Paul Wellstone and Pete Domenici Mental Health Parity and Addiction Equity Act of 2008, which requires parity between mental health or substance use disorder benefits and medical/surgical benefits with respect to financial requirements and treatment limitations under group health plans and group and individual health insurance coverage. This document also contains a technical amendment relating to external review with respect to the multi-state plan program administered by the Office of Personnel Management., 20908=These final regulations clarify the maximum allowed length of any reasonable and bona fide employment-based orientation period, consistent with the 90-day waiting period limitation set forth in section 2708 of the Public Health Service Act, as added by the Patient Protection and Affordable Care Act (Affordable Care Act), as amended, and incorporated into the Employee Retirement Income Security Act of 1974 and the Internal Revenue Code., 89297=This document proposes a change to the definition of an eligible organization that can avail itself of an accommodation with respect to coverage of certain preventive services under section 2713 of the Public Health Service Act (PHS Act), added by the Patient Protection and Affordable Care Act, as amended, and incorporated into the Employee Retirement Income Security Act of 1974 and the Internal Revenue Code. Section 2713 of the PHS Act requires coverage without cost sharing of certain preventive health services by non-grandfathered group health plans and health insurance coverage. Among these services are women's preventive health services, as specified in guidelines supported by the Health Resources and Services Administration (HRSA). As authorized by the current regulations, and consistent with the HRSA Guidelines, group health plans established or maintained by certain religious employers (and group health insurance coverage provided in connection with such plans) are exempt from the otherwise applicable requirement to cover certain contraceptive services. Additionally, under current regulations, accommodations are available with respect to the contraceptive coverage requirement for group health plans established or maintained by eligible organizations (and group health insurance coverage provided in connection with such plans), and student health insurance coverage arranged by eligible organizations that are institutions of higher education, that effectively exempt them from this requirement. The regulations establish a mechanism for separately furnishing payments for contraceptive services on behalf of participants and beneficiaries of the group health plans of eligible organizations that avail themselves of an accommodation, and enrollees and dependents of student health insurance coverage arranged by eligible organizations that are institutions of higher education that avail themselves of an accommodation. These rules propose and seek comments on potential changes to the definition of “eligible organization” in the Departments' regulations in light of the Supreme Court's decision in Burwell v. Hobby Lobby Stores, Inc., 134 S. Ct. 2751 (2014), to ensure that participants and beneficiaries in group health plans (and enrollees and dependents in student health insurance coverage arranged by institutions of higher education) obtain, without additional cost, coverage of the full range of Food and Drug Administration (FDA) approved contraceptive services, as prescribed by a health care provider, while respecting certain closely held for-profit entities' religion-based objections to contraceptive coverage. These proposed rules also seek comments on any additional steps the government should take to help ensure coverage of the full range of FDA-approved contraceptives, as prescribed by a health care provider, without cost sharing, for participants and beneficiaries in group health plans of such entities (and enrollees and dependents in student health insurance coverage arranged by such entities that are institutions of higher education)., 13852=This document contains interim final regulations regarding coverage of certain preventive services under section 2713 of the Public Health Service Act (PHS Act), added by the Patient Protection and Affordable Care Act, as amended, and incorporated into the Employee Retirement Income Security Act of 1974 and the Internal Revenue Code. Section 2713 of the PHS Act requires coverage without cost sharing of certain preventive health services by non-grandfathered group health plans and health insurance coverage. Among these services are women's preventive health services, as specified in guidelines supported by the Health Resources and Services Administration (HRSA). As authorized by the current regulations, and consistent with the HRSA Guidelines, group health plans established or maintained by certain religious employers (and group health insurance coverage provided in connection with such plans) are exempt from the otherwise applicable requirement to cover certain contraceptive services. Additionally, under current regulations, accommodations are available with respect to the contraceptive coverage requirement for group health plans established or maintained by eligible organizations (and group health insurance coverage provided in connection with such plans), and student health insurance coverage arranged by eligible organizations that are institutions of higher education, that effectively exempt them from this requirement. The regulations establish a mechanism for separately furnishing payments for contraceptive services on behalf of participants and beneficiaries of the group health plans of eligible organizations that avail themselves of an accommodation, and enrollees and dependents of student health coverage arranged by eligible organizations that are institutions of higher education that avail themselves of an accommodation. These interim final regulations augment current regulations in light of the Supreme Court's interim order in connection with an application for an injunction in Wheaton College v. Burwell, 134 S. Ct. 2806 (2014) ( Wheaton order). These interim final regulations provide an alternative process that an eligible organization may use to provide notice of its religious objections to providing contraceptive coverage, while preserving participants' and beneficiaries' (and enrollees' and dependents') access to coverage for the full range of Food and Drug Administration (FDA)-approved contraceptives, as prescribed by a health care provider, without cost sharing., 107391=These proposed regulations would clarify the maximum allowed length of any reasonable and bona fide employment-based orientation period, consistent with the 90-day waiting period limitation set forth in section 2708 of the Public Health Service Act, as added by the Patient Protection and Affordable Care Act (Affordable Care Act), as amended, and incorporated into the Employee Retirement Income Security Act of 1974 and the Internal Revenue Code., 53013=Title 26 published on 2013-04-01, 3415=This document contains final regulations that amend the regulations regarding excepted benefits under the Employee Retirement Income Security Act of 1974, the Internal Revenue Code, and the Public Health Service Act to specify requirements for limited wraparound coverage to qualify as an excepted benefit. Excepted benefits are generally exempt from the requirements that were added to those laws by the Health Insurance Portability and Accountability Act and the Affordable Care Act., 62272=This document contains proposed regulations regarding the summary of benefits and coverage (SBC) and the uniform glossary for group health plans and health insurance coverage in the group and individual markets under the Patient Protection and Affordable Care Act. It proposes changes to the regulations that implement the disclosure requirements under section 2715 of the Public Health Service Act to help plans and individuals better understand their health coverage, as well as to gain a better understanding of other coverage options for comparison. It proposes changes to documents required for compliance with section 2715 of the Public Health Service Act, including a template for the SBC, instructions, sample language, a guide for coverage example calculations, and the uniform glossary., 84095=Elsewhere in this issue of the Federal Register , the IRS is issuing temporary regulations (TD 9690) under the provisions of the Patient Protection and Affordable Care Act (the Affordable Care Act) that provide an alternative process that an eligible organization may use to provide notice of its religious objections to providing contraceptive coverage. The IRS is issuing the temporary regulations at the same time that the Employee Benefits Security Administration of the U.S. Department of Labor and the Office of Consumer Information and Insurance Oversight of the U.S. Department of Health and Human Services are issuing substantially similar interim final regulations with respect to group health plans and health insurance coverage offered in connection with a group health plan under the Employee Retirement Income Security Act of 1974 and the Public Health Service Act. The temporary regulations provide guidance to employers, group health plans, and health insurance issuers providing group health insurance coverage. The text of those temporary regulations also serves as the text of these proposed regulations., 8433=This document contains final regulations that amend the regulations regarding excepted benefits under the Employee Retirement Income Security Act of 1974, the Internal Revenue Code (the Code), and the Public Health Service Act. Excepted benefits are generally exempt from the health reform requirements that were added to those laws by the Health Insurance Portability and Accountability Act and the Patient Protection and Affordable Care Act. In addition, eligibility for excepted benefits does not preclude an individual from eligibility for a premium tax credit under section 36B of the Code if an individual chooses to enroll in coverage under a Qualified Health Plan through an Affordable Insurance Exchange. These regulations finalize some but not all of the proposed rules with minor modifications; additional guidance on limited wraparound coverage is forthcoming., 117271=This document contains proposed rules that would amend the regulations regarding excepted benefits under the Employee Retirement Income Security Act of 1974, the Internal Revenue Code, and the Public Health Service Act. Excepted benefits are generally exempt from the health reform requirements that were added to those laws by the Health Insurance Portability and Accountability Act and the Patient Protection and Affordable Care Act.}",
    "lastModified": "Wed, 03 Jun 2015 08:07:24 GMT",
    "textBeforeTable": "Additional Documents GPO FDSys XML | Text 80 FR 13995 - Amendments to Excepted Benefits 2015-03-18; vol. 80 # 52 - Wednesday, March 18, 2015 For a complete list of all Rules, Proposed Rules, and Notices view the Rulemaking tab. The following are only the Rules published in the Federal Register after the published date of Title 26. Title 26 published on 2013-04-01. 73 FR 78459, Dec. 22, 2008] [T.D. 9436, This section is applicable to returns and claims for refund filed after December 31, 2008. Effective/applicability date. (b) A person who is a tax return preparer of any return or claim for refund of tax under chapter 43 of subtitle D of the Internal Revenue Code (Code) shall be subject to penalties for failure to furnish a copy to the taxpayer under section 6695(a) of the Code, failure to sign the return under",
    "textAfterTable": "DEPARTMENT OF HEALTH AND HUMAN SERVICES, DEPARTMENT OF LABOR, DEPARTMENT OF THE TREASURY, Internal Revenue Service, Employee Benefits Security Administration Final rules. These final regulations are effective on May 18, 2015. 26 CFR Part 54 Summary This document contains final regulations that amend the regulations regarding excepted benefits under the Employee Retirement Income Security Act of 1974, the Internal Revenue Code, and the Public Health Service Act to specify requirements for limited wraparound coverage to qualify as an excepted benefit. Excepted benefits are generally exempt from the requirements that were added to those laws by the Health Insurance Portability and Accountability Act and the Affordable Care Act. 2014-10-01; vol. 79 # 190 - Wednesday, October 1, 2014 79 FR 59130 - Amendments to Excepted Benefits GPO FDSys XML | Text Additional Documents type regulations.gov",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}