{
    "relation": [
        [
            "Item",
            "Milk",
            "Fuelwood",
            "Labour",
            "Part time"
        ],
        [
            "Quantity",
            "1337",
            "1365 kg",
            "Rs.60/- × 2",
            "7 days/month"
        ],
        [
            "Cost in Rs.",
            "18720",
            "5460",
            "3600",
            "700"
        ]
    ],
    "pageTitle": "Asia Industrial and Institutional Stove Compendium",
    "title": "",
    "url": "http://www.fao.org/docrep/006/AD095E/AD095E02.htm",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989043.35/warc/CC-MAIN-20150728002309-00026-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 448765931,
    "recordOffset": 448730924,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{4113=Air required = 0.2401 kmol, 4723=Product = 0.0351 CO2 + 0.0546 H2O + 0.1897 (1+X) N2 + 0.0504 × O2, 14247=Qs = 32398.60 kcal/batch, 15051=Then, referring to the graph given in figure 4.9 of ‘Process Heat Transfer’ book by Kern and Krause, for the above two ratios, the view factor (VF) works out to be 0.085. With fuel bed temperature ( Tbb ) of 1300 °C (1573 °K), the radiation heat loss through oven opening becomes, 3491=C = 0.4217 kg = 0.0351 kmol H = 0.1012 kg = 0.0506 kmol O = 0.3205 kg = 0.0100 kmol, 42922=The steam boiling system was invented by Mr. Taryono. His former job was to repair trains or locomotives. He began making tahu in 1996. He estimated a 5 kg loss for every 100 kg of soya bean processed due to burnt solution at the bottom of the wok. From his experience as a mechanic working with steam engines, he reasoned that if the soya bean solution was boiled with steam, there would be no losses due to burning. He developed steam boiling cookstove for tahu production that is the first of its kind., 15460=Qo = 8402.9 kcal/hr = 42014.66 kcal/batch, 17279=Qm,rhs = 2547 63 kcal/batch, 50297=Milk, the raw material, is bought from the community in the vicinity of the villages. The cost of the milk depends upon its fat content as that determines how much khuwa can be produced. In general, the supply of milk is met regularly. However, supply is better during August to November and is worse during April to July., 13115=Hc = 0.46653 Btu/hr ft2°F = 2.2766 kcal/hr m2°C, 48548=The working hours are from 7:00 to 15:00. Looking at the total working hours, the steam boiling system seems to work faster.₦}",
    "textBeforeTable": "Production Cost per Month Rs.2,400. -  Labour cost for 7 days   Rs.1,400. -  Fuelwood for 7 days   b) Variable cost  Rs.1,900.       Rs. 400. -  Rent (shade)   Rs.   50. -  Bowls   Rs. 150. -  Stirrer   Rs. 900. -  Pans   Rs. 400. -  Stove production   a) Fixed cost  : Rs.3,900. Total Investment   : 350 days Working days   : 11 hours per day Operation   : Three Employment   : Sal (Shorea robusta); Chilaune (Schima wallichi); Katus (Castonopsis sp), Fuel type   : Three-pot hole stove Stove type   Khuwa Industry Sudal Village, Bhaktapur District 6.5. Economic Analysis of Small Scale Khuwa Industry Remarks: Pan balance is used for the tests. Fuelwood with 12% moisture content was used. Stove A: Water Boiling Test (WBT) gave 16.08 HU with 37.59 m/min. Stove B: WBT - 18.21 HU with 25..9 gm/min Burning Rate (BR) 07.39 27.06    7.6",
    "textAfterTable": "Total monthly production cost = Rs.28,480. Total weight of khuwa produced per month = 351 kg Average cost of khuwa per kg = 100 Total revenue per month = Rs.35,100. Total profit per month (excluding tax) = Rs.6,620. Profit %, of the production cost = 23.2 Profit % of total investment = 169.1 VII. SUGGESTIONS FOR FUTURE DEVELOPMENT Khuwa production is impaired by the lack of reliable, affordable fuelwood. Therefore a more efficient stove may be needed by the khuwa producers Based on analysis of stove used, same suggestions for future development are recommended as follows: The one-pot-hole stove, should be made into a three-pot-hole stove and the pot holder should be converted into an inverted cone shape as done in Sudal village of Bhaktapur District. This will help to use waste heat and to make the work environment more comfortable. In three-pot-hole stove, the combustion chamber should be reduced, baffles should be introduced. During the summer, the cooks suffer excess heat while they use the stove. They also suffer from smoke, thus a smoke extractor is recommended. The smoke extractor will not be directly coupled with the stove. The smoke extractor offers many advantages not generally associated with chimney stoves. The smoke extractor works on the principle that sufficient waste heat is available to rise up a chimney supported above the",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}