{
    "relation": [
        [
            "Date",
            "24 Sep 2001",
            "27 Jul 2006",
            "14 Dec 2006",
            "21 Jan 2010",
            "11 Apr 2014",
            "29 Aug 2014",
            "21 Oct 2014"
        ],
        [
            "Code",
            "AS",
            "AS",
            "AS",
            "FPAY",
            "REMI",
            "LAPS",
            "FP"
        ],
        [
            "Event",
            "Assignment",
            "Assignment",
            "Assignment",
            "Fee payment",
            "Maintenance fee reminder mailed",
            "Lapse for failure to pay maintenance fees",
            "Expired due to failure to pay maintenance fee"
        ],
        [
            "Description",
            "Owner name: UNICORN SOLUTIONS, INC., DELAWARE Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNORS:HELLMAN, ZIV;SCHREIBER, ZVI;YUVAL, TOM;REEL/FRAME:012192/0315;SIGNING DATES FROM 20010809 TO 20010909",
            "Owner name: 2006 TRIDENT COMPANY,MASSACHUSETTS Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNOR:UNICORN SOLUTIONS, INC.;REEL/FRAME:018012/0908 Effective date: 20060505",
            "Owner name: INTERNATIONAL BUSINESS MACHINES CORPORATION,NEW YO Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNOR:2006 TRIDENT COMPANY, INC.;REEL/FRAME:018627/0913 Effective date: 20061117",
            "Year of fee payment: 4",
            "",
            "",
            "Effective date: 20140829"
        ]
    ],
    "pageTitle": "Patent US20030163597 - Method and system for collaborative ontology modeling - Google Patents",
    "title": "",
    "url": "http://www.google.ca/patents/US20030163597",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986423.95/warc/CC-MAIN-20150728002306-00140-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 483553951,
    "recordOffset": 483492662,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{99481=[0057] A general reference on ontology systems is Sowa, John F., Knowledge Representation, Brooks/Cole, Pacific Grove, Calif., 2000., 190156=[0346] Shown in FIG. 15B is a window 1530 with instance icons 1531, 1532, 1533 and 1534 for carriers. Preferably, window 1530 pops up when a user right-clicks on folder icon 1513., 190428=[0347] Shown in FIG. 15C is a list 1540 of options relating to a specific carrier, UPS. List 1540 includes an item 1541 for properties of the UPS carrier, an item 1542 for processes for the UPS carrier, an item 1543 for help, an item 1544 for search and an item 1545 for view page., 97208=[0054] Another prior art system is the Resource Description Framework (RDF), developed by the World Wide Web Consortium. Information about RDF is available on the Internet at http://www.w3.org/RDF/. RDF is distributed and contains a grammar for subject-verb-object constructs, but does not contain an ontological model., 187473=[0343] Reference is now made to FIGS. 13A and 13B, which are illustrations of processes associated with instances of classes, in accordance with a preferred embodiment of the present invention. FIG. 13A indicates an icon used to represent a process. FIG. 13B illustrates cascaded menus for processes associated with an instance of a book from the collection of Restaurant Cooking Books (FIG. 12F). The processes include (i) buy a similar book (1310), (ii) contact the author (1320), (iii) contact the publisher (1330), (iv) join a discussion board (1340), (v) sell your copy (1350), and (vi) submit your recipe (1360). The icon of FIG. 13A appears adjacent to each of the processes 1310-1360., 247665=[0431] <Ontology xmlns:xsi=“http://www.w3.org/1999/XMLSchema-instance”xsi:noNamespaceSchlemaLocation=“\\\\Calvin\\ABC-Files\\Departments\\R-D\\Releases\\Release 0.1 Documents\\OntSchema1.xsd”, 184464=[0336]FIG. 11A illustrated an easy-to-implement non-scaleable architecture, and FIG. 11B illustrates a scaleable architecture. Shown in FIG. 11A is an object database 1110, and a Java virtual machine 1120 including a Java representation of the ontology model 1130, including access control and version models, according to the UML class hierarchies described hereinabove. Also shown is a Java applet or application 1140 serving as a graphical user interface (GUI), and a Java/web server 1150 communicating with Java virtual machine 1120 using a remote method invocation (RMI) protocol. It may be appreciated that use of an object database allows persistence with little coding, and obviates the need for XML syntaxes for parts of the model., 186952=[0342]FIG. 12E indicates an icon for a collection of books. FIG. 12F illustrates the collection of books corresponding to tie icon of FIG. 12E. That is, the icon of FIG. 12E illustrates a collection of books that is iconized by a user, and FIG. 12F illustrates a collection that has been opened. It is noted in FIG. 12F that the collection is referred to as Restaurant Cooking, and the specific books in the collection are indicated by icons 1210 for instances of books., 190802=[0348] Shown in FIG. 15D is a further list 1550 of properties for carrier UPS. Preferably, list 1550 pops up when a user clicks on item 1541 in list 1540 (FIG. 15C), requesting to view properties of the UPS carrier. As seen in FIG. 15D, displayed properties include name 1551, location 1552, employees 1553, credit rating 1554, volume 1555 and rates 1556., 185290=[0337]FIG. 11B shows a similar block diagram as FIG. 11B, with a relational database 1160 instead of object database 110, a web application server cluster 1170 instead of Java virtual machine 1120, and an enterprise Java Beans (EJB) model 1180 instead of Java object model 1130., 189340=[0345] Reference is now made to FIGS. 15A-15E, which are illustrations of a graphical user interface for navigation through class and relation definitions, in accordance with a preferred embodiment of the present invention. Shown in FIG. 15A are windows containing instances of classes, and collections of instances of classes. Individual instances are depicted by photo-realistic icons, and collections of instances are depicted by folders. A window 1510 contains folder icons 1511, 1512 and 1513 for collections of instances of suppliers, subcontractors and carriers, respectively. Window 1520 contains instance icons 1521, 1522, 1523, 1524, 1525 and 1526 for departmental staff., 188265=[0344] Reference is now made to FIGS. 14A and 14B, which are illustrations of a page containing links to various classes, in accordance with a preferred embodiment of the present invention. A page is a generalization of an HTML page with the additional capability of embedding icons representing classes, instances and collections that are relevant to contents of the page. FIG. 14A indicates an icon used to represent a page. FIG. 14B illustrates a page for a book entitled “Top Secret Restaurant Recipes.” The page includes (i) a process icon 1410 for accessing processes associated with the illustrated book, such as the processes shown in FIG. 13B; (ii) an attribute icon 1420 (cf. FIG. 12C), for requesting information about the attributes of the illustrated book; (iii) an icon for a collection of books 1430 (cf. FIG. 12E) entitled “Restaurant Cooking” and (iv) an icon for a collection of books 1440 (cf. FIG. 12E) entitled “Exotic Cookery.” Both collections are related to the illustrated book., 191271=[0349] Shown in FIG. 15E is a list 1560 of UPS locations. Preferably, list 1560 pops up when a user clicks on item 1552 in list 1550 (FIG. 15D), requesting to view locations of the UPS carrier. Each location in list 1560 itself an instance of a class for locations, and can be further identified by clicking on it. It is thus apparent that the user interface illustrated in FIGS. 15A-15E can be continued recursively.}",
    "textBeforeTable": "Patent Citations",
    "textAfterTable": "International Business Machines Corporation Method, system and article of manufacturing for converting data values quantified using a first measurement unit into equivalent data values when quantified using a second measurement unit in order to receive query results including data values measured using at least one of the first and second measurement units US7287041 * 24 Mar 2004 23 Oct 2007 Siebel Systems, Inc. Data modeling using custom data types US7293010 15 Apr 2005 6 Nov 2007 Ontoprise Gmbh Enterprise information integration platform US7454743 * 23 Dec 2002 18 Nov 2008 Sun Microsystems, Inc. Java to SNMP MIB mapping US7480673 * 6 Jul 2005 20 Jan 2009 International Business Machines Corporation Optimized computer diagramming method US7493333 5 May 2005 17 Feb 2009 Biowisdom Limited System and method for parsing and/or exporting data from one or more multi-relational ontologies US7496593 5 May 2005 24 Feb 2009 Biowisdom Limited Creating a multi-relational ontology having a predetermined structure",
    "hasKeyColumn": true,
    "keyColumnIndex": 2,
    "headerRowIndex": 0
}