{
    "relation": [
        [
            "Categories",
            "Great for these types of students",
            "Tips for prospective students",
            "Bang for the buck",
            "Am enjoying being here",
            "Am learning a lot"
        ],
        [
            "Comments",
            "From what I've heard, the Pharmacy Department of URI is one of the best on the East Coast. And from first hand experience, the Engineering Department is great as well. The Business, Nursing, and Music Departments are also quite extraordinary. Honestly, URI is for any student looking for a rural area, with some of the biggest thinkers in the world.",
            "I would suggest actually going to your classes rather than skipping and sleeping in. Don't miss out on the opportunities available on campus, whether they be making friends, joining a club, becoming engaged with campus life, or creating a better environment. Get the most out of your education and start your life out correctly.",
            "URI is a bit pricey whether you live in-state or out-of-state. However, the teachers, staff, and students alike, the experiences, knowledge, and information gathered over the course of your time there will make everything worth while.",
            "URI is a fantastic school. The campus is just the right size, not too overwhelmingly large and not cramped. The diversity and extracurricular activities always keep you engaged while on campus.",
            "The classes I am taking at the University of Rhode Island are worth while. Some are life changing even, that is if you really enjoy the class. I learn so much from going to class and the Supplemental Instruction hours during the week. Altogether, I know I'm going to succeed from what I learned here at URI."
        ]
    ],
    "pageTitle": "University of Rhode Island (URI) Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/University-of-Rhode-Island/reviews?_escaped_fragment_=/show/15659",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986423.95/warc/CC-MAIN-20150728002306-00200-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 909434631,
    "recordOffset": 909335909,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{305559=There is a various number of dorm building for students. The Ra's are quite nice and always there for you. You may have a few problems, such as the bathroom, with hall mates if you have a community bathroom. The quiet hours are always occurs after 11 o'clock. If you have a problem with your dorm building or roommate, you can request to switch rooms or dorms., 73242=Ive changed my mind about attending here because they obviously do a poor job of teaching business ethics. I researched the Frank Navarro scholarship and found that the fund was set up by his son/URI alum, Ben Navarro. He operates a company called LVNV Funding. Google LVNV Funding and you'll see an endless amount of unethical trash that comes up about this company. My application is cancelled since this school failed to research where they get their scholarship money from. http://advance.uri.edu/quadangles/sum2005/story10.htm, 448531=They have a nearly naked mile every year in early december and local businesses set up food carts and games on the quad for students during the day., 528674=© 2015, Cappex.com, LLC, 12863=I love it at the URI Kingston campus. It is a beautiful campus filled with Rhody pride! The great thing about this school is that all the students WANT to be there, and that makes the experience even better. I love going to class, spending time with friends, and kicking a soccer ball around in the quad. Everything on this campus is enjoyable, even the food! URI has one of the best food services in the state hands down, I have not heard one person complain about the food. There are so many organizations that you can join from sports clubs to Greek Life. I have enjoyed ballroom dancing myself, it is loads of fun and the best thing is that I have gotten to meet so many people. The weather is not too bad either. A bit of rain and snow, but that is everywhere in the north east. However, the sun still shines often and it is very comfortable living at school. I also enjoy the classes because the class are not too big and the teachers are so well trained, I could not ask for a better atmosphere. Walking to class is also a great way to exercise because the campus is on a hill, which makes it better because you do get a little workout on the way to class. Meeting friends has also been a blast because the school sets up so many events where you get to meet all different kinds of people. I even went to a comedy night where I saw Ralphie May perform and I cannot even explain how hard I laughed! This school has been so enjoyable, I don't know why people would decide not to go to URI., 76670=FRESHMAN Make plans for living OFF CAMPUS. We have a location for a Student /Parent Resort 5 miles from Campus. Yearly bedrooms priced at 1050 each monthly all utilities included. ****Seeking a 25% cash (75-100K) Investor to finalize the deal. **** Resort can house 6-8 Same Gender (Female)students 10 room 6 bed -4 bath house. Paid in advance deposits 5500 down 5000 over 6 months Will be set up as a study first house. With Housemother. Summers included. Car service available. Fantastic Location for parents wishing for safe secure higher learning for the student. Plus a Parent /student vacation B&B June -Sept! contact jerusalemRI@gmail DONT WAIT.}",
    "textBeforeTable": "07/17/2009 Reviewer is A current student here. 19 out of 19 people found this review useful. 1 of 120 Paige from Nashua, NH Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code",
    "textAfterTable": "Mary from Wakefield, RI 01/12/2010 Reviewer is A current student here. 11 out of 11 people found this review useful. 2 of 120 Categories Comments Great for these types of students From my interaction with some of the student body, the people who attend URI cover a wide spectrum. There are the crazy, outgoing partiers; the studious students who are spend most of their time at the library; the indie-rocknroll kids who run the 198° coffee shop; the preppy, well-dressed, perfectly manicured girls (and boys); and everyone in between. Trust me, you will find friends that will accept you just the way you are. Tips for prospective students URI is overall a great institution that can give students a good education and offer them opportunities that other colleges could not. If you are planning on attending the University take advantage of these opportunities provided for you. Establish a relationship with the teachers and staff and you can look forward to a rewarding college experience. Bang for the buck The University of Rhode Island is",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}