{
    "relation": [
        [
            "Days",
            "30",
            "50",
            "150",
            "200"
        ],
        [
            "BSE",
            "368.80",
            "351.85",
            "350.91",
            "352.71"
        ],
        [
            "NSE",
            "368.92",
            "352.04",
            "351.01",
            "352.80"
        ]
    ],
    "pageTitle": "Zee Entertainment Enterprises Stock Price, Share Price, Live BSE/NSE, Zee Entertainment Enterprises Bids Offers. Buy/Sell Zee Entertainment Enterprises news & tips, & F&O Quotes",
    "title": "",
    "url": "http://www.moneycontrol.com/india/stockpricequote/media-entertainment/zeeentertainmententerprises/ZEE",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986423.95/warc/CC-MAIN-20150728002306-00111-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 601269095,
    "recordOffset": 601214644,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{219548=Astec LifeSciences Recommended on Mar 31st 2015, 136460=UnitedBrewerie Jul Fut, 135949=28 July 2015, 220857=Zee Entertain is in the Media & Entertainment sector. The current market capitalisation stands at Rs 38,422.75 crore. The company management includes Subhash Chandra - Non Executive Chairman, Subodh Kumar - Executive Vice Chairman, Punit Goenka - Managing Director & CEO, Ashok Kurien - Non Executive Director, Lord Gulam K Noon - Independent Director, Sunil Sharma - Independent Director, Neharika Vohra - Independent Director, Manish Chokhani - Addnl. & Ind.Director. It is listed on the BSE with a BSE Code of 505537 and the NSE with an NSE Code of ZEEL. Its Registered office is at Continental Building, 135, Dr Annie Besant Road,, Worli Mumbai,Maharashtra - 400018. Their Registrars are Sharepro Services (India) Pvt.Ltd., 137167=JSWSteel Jul Fut}",
    "textBeforeTable": "Edit Watchlist Have you invested in these stocks? You can track them better in your Portfolio close[x] Add to Watchist Account Optional Optional Optional Optional Add to Portfolio OR Add to watchlist } $('#mcpcp_addprof_info').hide(); { function close_info()",
    "textAfterTable": "Keep me signed in Forgot Password? New to Moneycontrol - Sign up now Its easy and FREE! Username Username should be atleast 4 characters Password Password should be 6 to 10 characters Confirm Password Email OR connect with LIVE",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}