{
    "relation": [
        [
            "",
            "A1",
            "A2",
            "B1",
            "B2",
            "C1",
            "C2"
        ],
        [
            "Exercise",
            "Chin-Up or Supinated Grip Pulldown (wide grip)",
            "Barbell Skull Crusher (use decline bench if available)",
            "Dumbbell Military Press (standing)",
            "Front Squat or Hack Squat (narrow stance)",
            "Standing Calf Raise (feet angled out)",
            "Hanging Leg Raise"
        ],
        [
            "Sets",
            "2",
            "2",
            "2",
            "2",
            "2",
            "2"
        ],
        [
            "Reps",
            "14",
            "14",
            "14",
            "14",
            "14",
            "14"
        ],
        [
            "Load",
            "16RM",
            "16RM",
            "16RM",
            "16RM",
            "16RM",
            "16RM"
        ],
        [
            "Rest",
            "75 sec.",
            "75 sec.",
            "75 sec.",
            "75 sec.",
            "75 sec.",
            "75 sec."
        ]
    ],
    "pageTitle": "Bodybuilding's Next Frontier | T Nation",
    "title": "",
    "url": "https://www.t-nation.com/workouts/bodybuildings-next-frontier",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986423.95/warc/CC-MAIN-20150728002306-00279-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 937593455,
    "recordOffset": 937570098,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{7400=The bodybuilding testimonials don't end with Arnold. Bob Gajda, the 1966 Mr. Universe, also used high frequency training to build up his lagging body parts. I could go on and on.}",
    "TableContextTimeStampAfterTable": "{79853=Plazma: Pre-load 500 ml prior to your workout. Consume an additional 1000 ml during the workout.}",
    "textBeforeTable": "Day 1 Phase I Keep in mind that you'll need to lower the load to cater to incomplete rest periods from performing straight sets. If you must, substitute exercises with a similar variation. However, switching from back squat to leg extension isn't a viable option; switching from back squat to front squat or hack squat is. You get the idea. Most of the sessions involve exercise pairings. If you absolutely can't alternate between exercises, perform all of the prescribed parameters before moving on to the next exercise. The Program Duration: 2 weeks Purpose: To force your muscular and nervous systems to recover from training in less than 24 hours. Phase V:  Peak Frequency Stimulus Duration: 1 week Purpose: To recruit even more high-threshold motor units than Phase 2. This phase will set you up for big gains in Phase V since you'll have enhanced your ability to recruit muscle fibers. Phase IV:  Max Motor Unit Recruitment 2 Duration: 2 weeks Purpose: To reestablish a moderately high frequency plan in order to force the muscles to recover more quickly between workouts. Phase III:  Augment Frequency Stimulus Duration: 1 week Basically, you'll recruit your entire muscle fiber population (minus the emergency reserve that's virtually untouchable without a life-or-death scenario). This phenomenon is based on Henneman's size priniciple. Purpose: To retrain your nervous system to recruit the high-threshold motor",
    "textAfterTable": "Day 2   Exercise Sets Reps Load Rest A1 Deadlift (narrow stance) 3 12 14RM 75 sec. A2 Dip or Decline Dumbbell Bench Press (palms facing each other) 3 12 14RM 75 sec. B1 Chin-Up or Pulldown (palms up grip) 3 12 14RM 75 sec. B2 Dumbbell Triceps Extension 3 12 14RM 75 sec. C1 Seated Calf Raise or Donkey Calf Raise (feet angled out) 3 12 14RM 75 sec. C2 Reverse Crunch 3 12 14RM 75 sec. Day 3 Off from weight training. No more than 20 minutes of medium intensity cardio (if desired). Day 4   Exercise Sets Reps Load Rest A1 Back Squat (wide stance) 3 12 14RM 75 sec. A2 Bentover Row or Seated Cable Row (palms up grip) 3 12 14RM 75 sec. B1",
    "hasKeyColumn": true,
    "keyColumnIndex": 1,
    "headerRowIndex": 0
}