{
    "relation": [
        [
            "Field",
            "Intf Name",
            "Client ethernet server id",
            "Client process id",
            "Description"
        ],
        [
            "Description",
            "Identifies the Ethernet interface.",
            "Identifies the Ethernet server for the specified interface.",
            "Identifies the client process running on the specified interface.",
            "Describes the backplane client application."
        ]
    ],
    "pageTitle": "Cisco ASR 9000 Series Aggregation Services Router Interface and Hardware Component Command Reference, Release 4.2.x - Internal Ethernet Control Network Commands on the Cisco ASR 9000 Series Router [Cisco ASR 9000 Series Aggregation Services Routers] - Cisco",
    "title": "Table 6 show controllers backplane ethernet location clients Field Descriptions",
    "url": "http://www.cisco.com/c/en/us/td/docs/routers/asr9000/software/asr9k_r4-2/interfaces/command/reference/b_interfaces_cr42asr9k/b_interfaces_cr42asr9k_chapter_01000.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986423.95/warc/CC-MAIN-20150728002306-00332-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 372730035,
    "recordOffset": 372706122,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{64436=Tx Frames 541417}",
    "textBeforeTable": "Syntax Description statistics node-id location ethernet backplane controller clear To delete the aggregate statistics of traffic sent and received over the control Ethernet, use the clear controller backplane ethernet location statistics command in EXEC mode. clear controller backplane ethernet location statistics show controllers switch stats show controllers switch ports show controllers backplane ethernet location multicast groups show controllers backplane ethernet location detail show controllers backplane ethernet location clients show controllers backplane ethernet location brief show controllers backplane ethernet local multicast groups show controllers backplane ethernet local detail show controllers backplane ethernet local clients show controllers backplane ethernet local brief clear controller backplane ethernet location statistics This module provides command line interface (CLI) commands for configuring internal ethernet control on your router. Internal Ethernet Control Network Commands on the Cisco ASR 9000 Series Router show controllers switch stats show controllers switch ports show controllers backplane ethernet location multicast groups show controllers backplane ethernet location detail",
    "textAfterTable": "Release 3.7.2 This command was introduced. Usage Guidelines To use this command, you must be in a user group associated with a task group that includes appropriate task IDs. If the user group assignment is preventing you from using a command, contact your AAA administrator for assistance. Examples The following example shows how to clear all client statistics on the node at 0/1/1:  RP/0/RSP0/CPU0:router# clear controller backplane ethernet location 0/1/1 clients all statistics show controllers backplane ethernet local brief To display brief information about the Ethernet interface that connects the node to the router control Ethernet, use the show controllers backplane ethernet local brief command in EXEC mode. show controllers backplane ethernet local brief Syntax Description This command has no keywords or arguments. Command Modes EXEC Command History Release Modification",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}