{
    "relation": [
        [
            "Categories",
            "Great for these types of students",
            "Bang for the buck",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "Their online degree program works very well with working adults.",
            "This is definitely a great value for the low cost of attending school.",
            "I find it less demanding than Engineering in the Business school. The professors are definitely looking for critical thinking and analysis of the issues. The MBA program has us working with real world businesses to solve issues and grow them.",
            "Take the Technical Writing course as soon as possible. It will make your workload much easier overall.",
            "This University is very student oriented. The advisers genuinely care about your progress and advancement. The instruction is excellent and challenging."
        ]
    ],
    "pageTitle": "East Carolina University (ECU) Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/East-Carolina-University/reviews?_escaped_fragment_=/show/81210",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 125,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986423.95/warc/CC-MAIN-20150728002306-00187-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 898178167,
    "recordOffset": 898012200,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{9743=I love waking up in my apartment everyday knowing that I am a pirate. I bleed purple and gold! I have LOVED ECU since stepping on campus in August of 2008, and have made and met unforgettable friendships that will definitely last a lifetime. The atmosphere is amazing, the town locals are VERY kind, and the attitude of success here at East Carolina is alive, as each and every student knows just what it means to study hard, and excel in the classroom!, 708065=There are many traditions at ECU. Firstly, we are the pirates, and what do pirates say? ARGH! If someone yells PURPLE!, you yell GOLD! (our school colors). A football tradition that started in 2008 is the raising of the No Quarter flag during the fourth quarter of a football game. Real pirates would raise a no quarter flag to show the other ship that they will take no prisoners and give no quarter (or mercy). That is exactly what the ECU pirates do in the fourth quarter, give no mercy. Fans in the stands participate by holding up their arms in the air crossed, like a skull and cross bones. There is also one strange tradition that I know of. People will tell you that walking under the cupola in the mall (a small dome/gazebo looking thing in a grass field in central campus) will cause you to not graduate on time. I do not know if this is true or not, but I would not try it in any case., 888819=Take the COAD 1000 class. Learn to manage your time wisely. Do not over fill your daily schedule. Take at least two hours a day to do homework. Have as much fun as possible because senior year comes fast!, 672359=Most of the dorms are really nice. The one dorm that hasn't been renovated recently is being torn down and rebuilt December 2013! They are a great place to be and a great place to make some of the best friends you will ever have!, 748708=ECU offers the perfect student life on campus. While I am not an on campus student, I am an online student, I have toured ECU and my step daughter will be attending ECU and living on campus in the Fall of 2013. We love ECU and are determined to reach our educational goals., 723254=Great college! Really nice professors there. Great orientation session and looking forward to starting in late August., 219494=It depends on what you are studying but so far my classes have been challenging yet not too challenging. Communications 1001 is easy if you show up to class and study for tests. Make sure you study., 939730=The dorm life is not the best but not the worst either. It depends on where you want to live. West End is probably the most convenient to everything. Central Campus is closest to classes. College Hill is closest to the stadium, so if you are planning on being in the band or color guard, that would be the best place for you. They are building a new dorm on the hill that will open fall of 2015., 827931=There are so many chants and cheers. It is not unusual to hear a person yell Purple! from one side of campus, only to be greeted with a Gold! from the other side. There is the annual Polar Plunge every year, where people jump into the outdoor pool (which is frigid to say the least) in the middle of January. Insane but so much fun! Also, we have a cupola in the middle of central campus. No student walks underneath the cupola, because if you do so, it's said that you won't graduate. Keep that in mind! ;), 158953=I have made many great friends through the different things I have been involved with. I have loved the atmosphere and don't want to leave in May., 961103=© 2015, Cappex.com, LLC, 456223=Make sure you look up your professors on ratemyprofessor.com! Try not to have 8:00 AM classes if possible!! Make sure to always carry an umbrella!, 913602=The Polar Bear Plunge is a tradition that takes place in January. Cubes of ice are then poured into the outdoor pool. People gather in groups to jump into the freezing water. At the conclusion, students are given a towel and a t-shirt. The indoor pool is opened, and the canoes and boogie boards are brought out. There is also food and cake provided for everyone.}",
    "textBeforeTable": "06/09/2009 Reviewer is A current student here. 48 out of 51 people found this review useful. 1 of 218 Purple and Gold, Greenville NC Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for",
    "textAfterTable": "Categories Comments Great for these types of students If your going into the medical field choose ECU. Such as Biology, Chemistry, Forensics majors are very intense but well worth it! Tips for prospective students If your a Biology major, GOOD LUCK! It is a hard major especially the A&P classes! However, ECU is growing into more and more medical fields and also has a number 1 Criminal Justice program. Also, beware on Halloween, because they close some streets down and it is like a major party that everyone goes out in the streets with their horrifying costumes and police are everywhere! One more thing: DO NOT BUY YOUR BOOKS ON CAMPUS!! They are a rip off. I recommend buying off ebay, Chegg.com, amazon or any other book stores online because you can get them so much cheaper and then sell them back to ECU. Bang for the buck It is not as expensive as Chapel Hill or Wake Forest, but with all the transportation to anywhere on campus, and the free movies, it is so worth going to a four year college. Am enjoying being here The campus is soo beautiful, and the overall people are really down to earth. Am",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}