{
    "relation": [
        [
            "Categories",
            "Campus Safety",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "The security staff at USF is amazing. Tom,who is in charge of security, is really interactive with students. On the first day of orientation he will tell students to put the number for security in their phone. He cares about safety of students and holds seminars and presentations to educate the students. One thing that is unusual for security at a school to do is offer rides to the bus station and to certain areas outside of the school. The security will walk students to there car any time of day and will come if you need them even if it is for something silly.",
            "There is always some activity going on on campus. Tons of posters and flyers are hung throughout the campus with various meetings and opportunities. Living on campus puts those students at an advantage of knowing what is going on on campus. Clubs are great for passing time. There are events clubs set up outside campus and hold on campus as well. Students can take advantage of the rec center and the free gym membership at Inwood. On weekends the university holds movie nights which is all free. There's never a boring day on campus, students just need to look and keep an open mind.",
            "Sodexo Foods has been doing marvelous with meals at USF. School lunches always worry students because school meals have acquired a negative connotation during school years. The food is always made fresh and there are many options. There are different meals every time of day, so there is never the same old food everyday. The lines go by pretty quick because the arrangement is like a buffet in a way. Students pay with cash or meal plans before they get there food so it is an in-and-out ordeal. A great addition to the campus is the variation in food shops. After cafeteria hours the Bistro is opened, and once the Bistro closes the Pub opens. It offers a change of scenery and brings the campus to life.",
            "Living on campus is really an added bonus of going to USF. Waking up late or weather conditions are less likely to effect students from going to class. There's more freedom and privacy in a dorm. Students experience what it would be like living on their own and gain life skills like time and stress management. There are general rules for the dorms and some vary depending on the Hall a student lives in. For instance, Motherhouse allows students of the drinking age to bring in alcohol, whereas, Marian Hall is a dry building which means no alcohol is allowed in the building. Each floor has gender based bathroom facilities, laundry room, and study lounges. Each floor has two RA's for the wings to regulate over any problems and to be an aide to students.",
            "The University of Francis really focuses on academics but also wants to prepare students to be better people in life. There are many study abroad and other academia enhancement programs to add to the quality of your education. Tutors are offered in every major, so there is always help to those who need it. Teachers are fair with grading; you earn the grade you deserve. Grades really depend on how much time and effort you put into assignments, tests, and studies.",
            "One thing I would say is to have great communication with staff, especially teachers, because they are the ones determining your grade and preparing you to graduate. Staying focused on studies is important because even on a small campus social life can interfere with studying. Put aside time to study for classes. For classes make sure to pay attention and understand the material so that for midterms you are prepared. Get help if you need it because the teachers do not know if you do not understand something. Apply for scholarships and stay updated on your student account for any alerts or items you need to complete. The most important piece of advice I could offer would be to have money put aside for college, even if it is a small amount, because even with scholarships and financial aid there is always a chance there will be a remaining balance on your tuition bill that could prevent registration for class terms and prevent graduation.",
            "The University of Saint Francis is a wonderful school. The staff and students are very friendly and welcoming. Being a freshman, it was very accommodating to have such a warm feeling entering college. The architecture is remarkable. The quad is gorgeous with benches,lawn chairs chairs, fountains, gardens, sport courts. Food options are simple and are almost similar to a home cooked meal. The teachers are really understanding and want to help out their students as much as possible. Classes are challenging, but in a good way to enhance your learning. If a student is having trouble with their work there are tutors for every subject. There are hundreds of opportunities to get involved on campus with numerous clubs. The social aspect is a great way to network."
        ]
    ],
    "pageTitle": "University of St Francis Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/University-of-St-Francis/reviews?_escaped_fragment_=/show/17428",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986423.95/warc/CC-MAIN-20150728002306-00127-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 903327759,
    "recordOffset": 903294715,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{118010=© 2015, Cappex.com, LLC, 106103=The University has been around since 1920 and considering that it used to be an all girls college, there are many antique but yet traditional places on campus that are really neat to take notice of. We have a grand stair cause in Tower Hall that was used by the nuns for lining up the girls and taking attendance. There is also a newly renovated chapel on the third floor of Mother House. Places like these on campus really makes the University that much special., 109351=The University of St. Francis has a bery rigoreous academia in every major that is offered. Each major of course has its hard moments, but it is important to note that every professor at USF tries extremely hard to accomate the needs of the students. With having a 17:1 ratio between students to professor, makes the ability to create a relationship with the professor easy.}",
    "textBeforeTable": "07/16/2009 Reviewer is A current student here. 11 out of 12 people found this review useful. 1 of 27 Monica from Oak Forest, IL Check out reviews left by other students or leave your own review. You could win a free scholarship. University of St Francis Reviews University of St Francis › Illinois › By State › Colleges › } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.create', -->",
    "textAfterTable": "Bang for the buck It is an expensive school but worth it, a very prestige school that employers look for. What to do for fun There are some attractions within the city such as Slammers baseball and Speedway but Chicago is about 45 minutes away. Food and Dining Meal swipes! Great sandwiches in the Mother-house building. Dorm Life There a lot of activities, it can become a conflict to your studying if not your not organized. Academic Rigor It is not easy! You have to study and apply yourself. Tips for prospective students Students should research the teachers before selecting a course. Be open-minded and friendly to have a good college experience. Enjoy your breaks, it helps relieve stress! In three sentences A school that has a strong Catholic foundation, promoting a great college experience, within the inviting city. The teachers are very helpful and experts in the area of teaching. The class sizes are small which allows for an easy learning environment.",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}