{
    "relation": [
        [
            "Categories",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "go clubbing, partying, and all that good stuff.",
            "the foods not so great, so be sure to go out to eat (:",
            "the dorms are very nice and its fun to live there.",
            "some of the courses are bery rigourous and demanding depending on your major. do not get behind in classes because it will hurt you.",
            "always be on time to classes. dont skip any classes because most of the time you will get behind.",
            "angelo state is a great school. its in a small community with not much crime. its a fun place to live."
        ]
    ],
    "pageTitle": "Angelo State University (ASU) Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Angelo-State-University/reviews?_escaped_fragment_=/show/59660",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989790.89/warc/CC-MAIN-20150728002309-00176-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 907834991,
    "recordOffset": 907766649,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{195287=Dorm life is good, However you can't have friends over after 8:00 pm which is a pain but other then that it was great., 136479=I've noticed a lot of foreign students during the summer semester for 2012. I'm sure it is a sign of an excellent foreign exchange program, 322321=© 2015, Cappex.com, LLC, 295165=Angelo State University is greate for students who are wanting to get away from the big city for awhile then I would most definitely recommend coming here. If you are looking for an affordable public school besides Lamar University and Tarleton State University, then I would suggest coming to ASU as well. The actual location of San Angelo may not be to your liking but I can honestly say that it is a great school filled with great opportunities and resources.}",
    "textBeforeTable": "11/11/2010 Reviewer is A current student here. 16 out of 16 people found this review useful. 1 of 73 Vanessa Ramirez Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp",
    "textAfterTable": "Hector from San Angelo, TX 06/03/2009 Reviewer is A current student here. 8 out of 12 people found this review useful. 2 of 73 Categories Comments Great for these types of students Premed, communications, physical therapy, physics, biology... those are the big ones. Tips for prospective students This school is mainly recognised in science for its biology and physics programs, not to mention pre-medicine, and they are ranked among the top in the state. The exceptions are Chemistry and Biochemistry - From the Chemistry and Biochemistry Department. All of the department professors are... hmm... let's just say they're not the best teachers and they don't really care about how much you learn, they just want to get the class over with. Login to rate or flag the reviews Cala from Coleman , TX 07/13/2009 Reviewer is A current student here. 8 out of 11 people found this review useful. 3 of",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}