{
    "relation": [
        [
            "Categories",
            "Campus Safety",
            "Greek Life",
            "Clubs and Activities",
            "Great for these types of students",
            "Share any unusual traditions or locations on campus",
            "Bang for the buck",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "Very safe campus. There are blue lights are around campus and security walking around all the time.",
            "We have a few Fraternities and Sororities on campus. There's no Greek row, or large Greek life, but there are some.",
            "There are lots of clubs!",
            "Study bugs Partiers Athletic types Social butterflies Lone wolves",
            "LOTS OF BARS, SPRINGFEST, QUADSTOCK, ETC",
            "Yes, it's a pricey school. But it's worth the money you spend. Plus we give out pretty good financial aid.",
            "It's New York City, there is so much to do for fun! You can never really be bored! Around campus there are LOTS of bars, restaurants, some clubs, golf course, tennis courts. Steps from campus there is the 1 train that takes you right into Manhattan or wherever! Our school offers deals on Broadway shows, concerts,Yankee/Mets games, Rangers, Knicks/Nets, we also offer weekend trips into the city with planned itineraries (you can always stray away though).",
            "Average college food. 4 dining halls. Hot meals, salad bar, pizza, sushi, gluten free, allergen free, coffee/tea station, tex-mex, soft serve machine, etc. All the food your stomach desires! There is a Starbucks on campus as well as a sit down restaurant that serves higher class dining hall food. Also a small school grocery store with cereal, granola bars, candy, Gatorade, milk, juice, ice cream, etc.",
            "The dorms are clean and nice. Chrystostom- the freshman dorm (if you want the freshman experience), very close knit groups, communal bathrooms, VERY small rooms. same sex floors. Jasper- anyone can live there. close knit groups as well. communal bathrooms. communal bathrooms are cleaned every day except for the weekends. same sex floors. large rooms. Horan/East Hill- anyone can live here. suite style living. 2 bedrooms to 1 bathroom. either can have 4 people or sometimes 5. floors are co-ed. Overlook- the senior/junior apartment style living with kitchen, living room, bathroom, bedroom. There is laundry in each building, FREE! Also, common rooms with couches, chairs, tables, tv, microwave, etc.",
            "It really depends on your major. Different majors have it harder than other majors. Of course engineering majors probably have it the toughest. But to each their own.",
            "As long as you have an average GPA and average SAT scores you should be fine. If you love to go out or hate to go out there are LOTS of things for both sides to do. We also have a good athletic program, but no football, so if you're looking for that Division 1 football feel you're out of luck. But basketball games are fun! It's a great small campus with anything your heart desires.",
            "Manhattan College is a great school if you want to be near the city but not in the hustle and bustle of Manhattan. The school has a lot to offer club wise and stuff to do. But there's also a GREAT social aspect and places to go out to."
        ]
    ],
    "pageTitle": "Manhattan College (Manhattan) Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Manhattan-College/reviews?_escaped_fragment_=/show/56131",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986423.95/warc/CC-MAIN-20150728002306-00271-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 892920711,
    "recordOffset": 892884813,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{122904=One main dining hall buffet style. There are grab n go options available at Danteâ??s den and Leo cafe. Cafe 1853 is a good place to study and order food which is brought out to your table., 132547=© 2015, Cappex.com, LLC, 5865=3 1/2 The price is high, in my opinion, and though you are in an excellent area (in a great neighborhood, so conveniently close to the city), the price isn't quite worth it. I feel I'm getting a very good education and I love being able to visit the city. I also have a nice room and my building is well-maintained. However, I am forced to pay for a mandatory dining plan, which I barely ever use. They also have a spring consolidation process in which students who are currently without a roommate have to find someone else without a roommate to consolidate with (ie. one of you has to move in with the other). The only other two options are to be forced to move out of your room into someone else's who doesn't have a roommate or pay over $1500 to remain as a single. I really can't understand the point of this other than to make more money., 90341=There is a quad , where people would sprawl out and take in sun. There was mass at 7:30 every Sunday., 44480=hey my name is daba and i want to study abroad but my family have not money for register me as the result i want and hope to get scholarships from you in the fall 2012 and spring 2013 thank you to accept me}",
    "textBeforeTable": "11/18/2010 Reviewer is A current student here. 8 out of 8 people found this review useful. 1 of 29 Gabrielle from Old Bethpage, NY Check out reviews left by other students or leave your own review. You could win a free scholarship. Manhattan College Reviews Manhattan College › New York › By State › Colleges › } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.create', -->",
    "textAfterTable": "Am learning a lot My professors have been really excellent, especially my the those in my education program. They are extremely experienced and caring people with so much to offer. One of my professors, for example, has had decades of experience as a teacher, principal, and as head of education for the Catholic school he worked at. Every single one of my education professors this semester have had years and years of experience both as educators and as leaders in their school system. I feel extremely confident that my teacher know what they are talking about. They are also very accessible and care about each individual student. I am learning so much about education from people I trust.` Login to rate or flag the reviews Jackie from Mount Kisco, NY 11/02/2011 Reviewer is A current student here. 1 out of 1 people found this review useful. 3 of 29 Categories Comments Great for these types of students Highly recommend to anyone who likes making connections with teachers rather than just being another",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}