{
    "relation": [
        [
            "Categories",
            "Campus Safety",
            "Clubs and Activities",
            "Great for these types of students",
            "Bang for the buck",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "Except for the deer and crazy squirrels, there is not much to worry about as far as safety goes at W&M.",
            "W&M has lots and lots of opportunities to get involved on campus. The great number and range of clubs and activities at school are a great chance to find a passion outside of school work which is practically necessary to being fulfilled by the academics. Academics separated from the true cares of the students limits what they offer. For students that are strong academically but not sure what they are passionate about, W&M is great for that self-discovery.",
            "William and Mary is first and foremost great for the academically oriented. Among the academically oriented, W&M is perfect for those looking for a fairly small and tight-knit school. Anonymity is hard to find at William and Mary, and those that are pushed by their being visible will do well at W&M.",
            "The academic strength, the physical environment and the resources provided at W&M all make it a great place well worth the money. As an in-state public school attending student, William and Mary is a bargain. Most institutions of a comparable caliber would be much higher priced. Virginia residents are lucky to have William and Mary as an in-state option.",
            "William and Mary's location next to Colonial Williamsburg and in the wilderness creates provides lots of space to take a break from work and have some fun. The Crim Dell is a beautiful location for relaxing and enjoying nature; it provides a peace that is greatly welcomed after the myriad of stresses that one experiences in college. There are also great art students at William and Mary whose work is a great resource to go to let out emotion and be fulfilled by culture.",
            "William and Mary's food is not great, but this is the case at many colleges. The quantities being produced limit the quality of each individual meal. Nevertheless, the food is not terrible, and while one might get tired or bored of it the level of disgust will most likely not be reached. Students will find themselves missing their mother's home cooking, but that's a caliber of food that is hard to reach when a cafeteria is producing for thousands. Apart from meals purchased with plans, Williamsburg offers many options for dining that can help break up the monotony of cafeteria food.",
            "William and Mary's dorm life is close and well-connected. In the case of freshman dorms, the halls harbored close relationships and strong support systems which were ideal for individuals away from home for their first time. Independence can be freeing and scary, but the dorms helped the students through their transition. The dorms provide a situation in which meaningful and lasting relationships can be developed and cultivated. These are the relationships that will help students get through the stresses, ups and downs of their college experience as well as the relationships that will allow for the fullest enjoyment of the good times. Being around other driven students in the dorms fosters a place of academic prowess which diffuses into the individual students that enter into the environment. The dorms push their residents to do well academically and provide the place for students to enjoy their breaks from work to the fullest.",
            "W&M's academics are certainly challenging, and the student population is there to study. This creates an environment very academically focused and a compelling reason for individual students' lives to be academically centered. This strength of focus upon academics drives the whole character of the school. There is a perpetual sense of energy derived from the concentration exuded by the W&M population. This energy can sweep up students and bring them along with it. The pressure can be high, which is a great thing for those up for a challenge. There can be a lot of stress that comes from the pressure, but it's well-rewarded. During mid-terms or finals, these stress levels are evident across campus, but its a stress resulted from responsibility and it feels full, rather than a meaningless stress derived from confusion. W&M is a place to work, to strive and to develop; it takes strength and drive to do so there.",
            "When deciding to attend W&M a student should evaluate their desire and drive to work and learn. Having purpose, as in any situation, will help allow for a full and rich experience. Uncertainty is okay, as long as a student is willing to commit to a struggle to learn and find themselves. W&M provides the environment; the student brings the desire to learn.",
            "The College of William and Mary is an ideal location for academic challenge as well as personal and social growth. The caliber of the students is a positive influence on the whole population, compelling every individual to push themselves. W&M is a great place for challenge and discovery."
        ]
    ],
    "pageTitle": "College of William & Mary Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/College-of-William-Mary/reviews?_escaped_fragment_=/show/67786",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989043.35/warc/CC-MAIN-20150728002309-00325-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 903219383,
    "recordOffset": 903121363,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{53871=for people who are accepted: Attend Admitted Students Day . It was what convinced me about William and Mary- I hadn't been too impressed on the tours or other visits, but they had really good programs at their admitted students day and they gave me a much better understanding of what William and Mary is really like. for people who decide to go: Visit the Cohen Career Center your freshman year and definitely sign up for the various listservs that the Center offers. Make an appointment to get advice on your resume, or to look in to possible internship/ job opportunities, even if you aren't interested in applying for any yet. Make yourself known there and start that relationship with them, because they'll end up offering you opportunities you might not have known to even look for otherwise. Be thoughtful when answering the questions about the dorm you'll live in. Your freshman hall is really what makes the difference between a good freshman year and an invaluable freshman year. Buy a cider mug from the Bake Shop on dog (duke of Gloucester) street in January. For $11 you get free cider, soda, coffee, ice cream (possibly more...) for an entire year, so if you buy it in January you'll have it for two semesters instead of one. Orientation is not at all what college is actually like, but bear with the sleep deprivation and awkward mixers because it definitely keeps you from being homesick and will prove to have been a worthwhile experience by the end of the week., 61150=i am vp of club tennis and it is amazing and awesome and marvelous i've met some of my best friends through the club, and i know many people have similar experiences with other sports clubs. we got fourth place in sectionals and are going to nationals in april., 10732=Complete an optional submission - it can be anything! I submitted a DVD of a short film that I had completed during my time at the 2007 Virginia Summer Governor's School for the Humanities. It required no extra effort on my part except burning another DVD. I know other people who submitted essays written for other college applications. This is your chance to stand out!, 68263=11 sororities and around 18 fraternities, around 30% of the student body is in a Greek organization. A great way to meet people, greek organizations have special housing and lots of events. New fraternity houses will open in fall 2013., 436786=© 2015, Cappex.com, LLC, 429749=I stayed in the dorms here for crew camp during the summer of 2013, and while the dorms are just basic college dorms, everyone on your hall will bond., 304170=The dorms on campus are average. Definitely nothing special, but not terrible either. Remember, this college is over 300 years old. Some of the buildings aren't exactly high tech. Great roommates and suitemates will make things 1000 time better., 4727=As a prospective, I had been told of the sporadic weather that Williamsburg was blessed with, but I had not planned accordingly. The end of August was scorchingly hot, especially without an A/C unit in my room. The random downpours were also quite inconvenient for getting to class, as I had failed to bring both an umbrella and waterproof shoes. I ended up wearing flipflops in the rain and went to the study lounge whenever it got too hot. Just a thought: bring an umbrella and a fan/air conditioning unit., 276431=Some of the dorms are old; after all, the College has been around since 1693. However, at least for me, the community on my freshman hall made up for it. Furthermore, some of the dorms have sinks in the rooms which may not seem like a big deal, but when you don't have to go to the hall bathroom to brush your teeth, you'll be thanking me., 18932=Learning is a relative term- it is said that it is impossible to stop learning. This is especially true at William and Mary. Learning isn't limited to the classroom. Walking from one’s dorm room to the cafeteria, a William and Mary student can learn about the history of America by passing various colonial buildings. For example, the Brafferton Building, built in 1723 was one of the first Indian schools and it is right in the middle of William and Mary campus. Students are constantly in a learning environment - whether in an academic building or in a freshman dorm. Students learn how to become adults, to test their limits, and to grow intellectually., 318656=There are three dining halls on campus, but plenty of other chains that do not take meal plan money. The food at the dining halls is not spectacular, but it is not that bad either. Starting with the Class of 2016, students will be required to have meal plans (which can only be used at the three dining halls) until they graduate., 273851=My favorite annual tradition is the Yule Log Ceremony. Every year before finals in December, the campus community gathers at the Wren Chapel (another tradition: every student should have a class in Wren before they graduate!) and shares all of the different holiday traditions (Christmas, Hanukkah, Kwanzaa, Diwali, etc.). Santa Claus (who looks suspiciously like President Reveley...) also turns up. Then, everyone burns a sprig of holly in the Great Chapel to symbolize the end of worries for the year (and especially finals). It's just a really great tradition that brings the entire campus together., 128524=The College of William & Mary is a great college with an incredible student atmosphere. The College offers a plethora of clubs and other opportunities to meet people and do fun things. Finally, the College is filled with many traditions and history stretching back all the way to 1693.}",
    "textBeforeTable": "07/10/2009 Reviewer is A current student here. 43 out of 44 people found this review useful. 1 of 87 Anna from MI Check out reviews left by other students or leave your own review. You could win a free scholarship. College of William & Mary Reviews College of William & Mary › Virginia › By State › Colleges › } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.create', -->",
    "textAfterTable": "Bang for the buck Paying in-state tuition, I feel that I am definitely getting a bang for the buck. Even for those coming from out-of-state, tuition at WM is close to ten thousand less than tuition at a similar private school. The reason I would give WM 4/5 stars is due to the fact that it is a state school and cannot provide much financial aid beyond what the government is providing. Besides that, this is my greatest monetary investment, and that includes the rain boots I just bought. Am enjoying being here College life is overall, the best experience ever. There is always something going on on campus, whether it is a concert hosted by students activities or a school-wide activity hosted by Greek life. The people you meet at WM are generally smart and can mix work with play pretty well. Learning to do that is probably the hardest aspect of living on campus, and even that is enjoyable. Am learning a lot The professors at WM have what's called office hours, which is time dedicated to helping students who decide to visit. The average size of classes is small, so professors are able to spend time with you if you want to. For instance, I missed a class",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}