{
    "relation": [
        [
            "Patent application number",
            "20110067362",
            "20120024870"
        ],
        [
            "Description",
            "Container Bottom and Methods - A method of loading a plurality of articles in a container. The method can include providing a container having a body and defining an interior chamber, providing a stack of articles comprising snack pieces having a convex surface, inserting the stack of articles at least partially into the interior chamber, and reorienting the leading article by forcing the leading article against the inner surface such that the convex surface of the article cooperates with the inner surface.",
            "Container Bottom and Methods - Substantially triangular shaped container bottoms include a bottom wall with a concave surface. The container bottom can be used with a container body having an interior chamber for receiving at least one article. Exemplary embodiments include a container bottom attached to a container body wherein the container bottom includes a central surface area that is inwardly concave towards an interior chamber of the container body. Methods of loading a plurality of articles in a container are also provided."
        ],
        [
            "Published",
            "03-24-2011",
            "02-02-2012"
        ]
    ],
    "pageTitle": "Mcintyre, US - Patent applications",
    "title": "",
    "url": "http://www.faqs.org/patents/inventor/mcintyre-us-5/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989043.35/warc/CC-MAIN-20150728002309-00078-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 454591439,
    "recordOffset": 454552422,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "James Calvin Mcintyre, Arlington Heights, IL US //]]> BarDraw('3343495',['Patent applications by James A. Mcintyre, Midland, MI US'],[[1,1,1,1]],['2005','2008','2009','2012'],0); // <script type=\"text/javascript\"> </div> <div id=\"legend3343495\" align=\"center\"></div> </div> <canvas id=\"bg3343495\" style=\"max-width: 500px; width: 100%;\"></canvas> <div> <p align=\"center\">Patent applications by James A. Mcintyre, Midland, MI US</p> <div class=\"bar3343495\" style=\"max-width: 500px; width: 100%; float:left; \"> <div align=\"left\" style=\"padding-top:20px;\"> </table> </tbody> </tr> <td>03-22-2012</td> <td><a href=\"/patents/app/20120071737\">Breath Delivery System and Method</a> - Some embodiments of the invention provide a mouthpiece for use with an electronic analyzer for breath analyte detection in an individual. The mouthpiece includes a biosensor and a hydration system. The biosensor includes a chemically active area where a chemical reaction takes place and the hydration system delivers a liquid to the chemically active area of the biosensor to at least one of enhance, enable, and facilitate the chemical reaction. The mouthpiece further includes hardware to transmit breath analyte data.</td> <td>20120071737</td> <tr> </tr> <td>08-06-2009</td> <td><a href=\"/patents/app/20090196796\">Breath Delivery System and Method</a> - Some embodiments of the invention provide a mouthpiece for use with an electronic analyzer for breath analyte detection in an individual. The mouthpiece includes a biosensor and a hydration system. The biosensor includes a chemically active area where a chemical reaction takes place and the hydration system delivers a liquid to the chemically active area of the biosensor to at least one of enhance, enable, and facilitate the chemical reaction. The mouthpiece further includes hardware to transmit breath analyte data.</td> <td>20090196796</td> <tr> </tr> <th>Published</th> <th>Description</th> <th>Patent application number</th> <tr> <tbody>",
    "textAfterTable": "Patent applications by James Calvin Mcintyre, Arlington Heights, IL US James P. Mcintyre, Aliso Viejo, CA US Patent application number Description Published 20100211928 Supervisory Process Control And Manufacturing Information System Application Having An Extensible Component Model - A template-based supervisory process control and manufacturing information application development facility is disclosed that includes a number of time-saving application development tools that significantly enhance design productivity and allow re-using of previously developed application building blocks. The development facility includes an application object template library that stores a set of previously defined application object templates. The template library is accessed by developers through a configuration utility that facilitates specifying instances of the set of previously defined application object templates to be included in an application. Thereafter, application objects are instantiated from the selected ones of the set of previously defined application object templates in a build of the specified application. 08-19-2010 20110172965 Remotely Monitoring/Diagnosing Distributed Components Of A Supervisory Process Control And Manufacturing Information Application From A Central Location - A centralized diagnostics management tool is disclosed that facilitates centralized monitoring of distributed components of a supervisory process control and manufacturing information application. The centralized diagnostics management tool",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}