{
    "relation": [
        [
            "method/model",
            "DGP 1: restricted",
            "DGP 1: unrestricted",
            "DGP 1: opt. combination: known",
            "DGP 1: opt. combination:",
            "DGP 1: opt. combination: Stein",
            "DGP 1: simple average",
            "DGP 2: restricted",
            "DGP 2: unrestricted",
            "DGP 2: opt. combination: known",
            "DGP 2: opt. combination:",
            "DGP 2: opt. combination: Stein",
            "DGP 2: simple average",
            "DGP 3: restricted",
            "DGP 3: unrestricted",
            "DGP 3: opt. combination: known",
            "DGP 3: opt. combination:",
            "DGP 3: opt. combination: Stein",
            "DGP 3: simple average"
        ],
        [
            "horizon=1, =1",
            ".773",
            "1.004",
            ".995",
            ".999",
            ".999",
            ".995",
            ".678",
            "1.009",
            ".984",
            ".992",
            ".993",
            ".984",
            ".780",
            "1.012",
            ".974",
            ".983",
            ".985",
            ".974"
        ],
        [
            "horizon=1, =20",
            ".775",
            "1.002",
            ".994",
            ".998",
            ".998",
            ".994",
            ".678",
            "1.003",
            ".983",
            ".989",
            ".990",
            ".982",
            ".752",
            "1.009",
            ".974",
            ".982",
            ".983",
            ".974"
        ],
        [
            "horizon=1, =40",
            ".771",
            "1.000",
            ".994",
            ".997",
            ".998",
            ".994",
            ".677",
            ".999",
            ".982",
            ".987",
            ".989",
            ".982",
            ".747",
            "1.003",
            ".973",
            ".980",
            ".981",
            ".973"
        ],
        [
            "horizon=1, =80",
            ".764",
            ".998",
            ".993",
            ".996",
            ".997",
            ".993",
            ".672",
            ".993",
            ".980",
            ".984",
            ".987",
            ".980",
            ".740",
            ".994",
            ".970",
            ".976",
            ".978",
            ".970"
        ],
        [
            "horizon=4, =1",
            ".818",
            "1.029",
            ".995",
            "1.007",
            "1.005",
            ".992",
            ".635",
            "1.004",
            ".959",
            ".972",
            ".975",
            ".958",
            ".843",
            "1.058",
            ".972",
            ".993",
            ".987",
            ".974"
        ],
        [
            "horizon=4, =20",
            ".816",
            "1.011",
            ".986",
            ".996",
            ".996",
            ".984",
            ".632",
            "1.004",
            ".962",
            ".974",
            ".976",
            ".960",
            ".822",
            "1.050",
            ".973",
            ".991",
            ".985",
            ".974"
        ],
        [
            "horizon=4, =40",
            ".808",
            "1.006",
            ".985",
            ".993",
            ".994",
            ".983",
            ".627",
            ".996",
            ".960",
            ".971",
            ".973",
            ".959",
            ".817",
            "1.037",
            ".971",
            ".987",
            ".983",
            ".972"
        ],
        [
            "horizon=4, =80",
            ".796",
            ".998",
            ".982",
            ".989",
            ".991",
            ".981",
            ".620",
            ".983",
            ".956",
            ".964",
            ".967",
            ".956",
            ".805",
            "1.020",
            ".967",
            ".980",
            ".978",
            ".967"
        ]
    ],
    "pageTitle": "FRB: Finance and Economics Discussion Series: Screen Reader Version - Combining Forecasts From Nested Models *",
    "title": "Table 1. Monte Carlo Results from Signal = Noise Experiments: Average MSEs (for restricted model, average MSE; for other forecasts,ratio of average MSE to restricted model's average MSE)",
    "url": "http://www.federalreserve.gov/Pubs/feds/2007/200743/index.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989790.89/warc/CC-MAIN-20150728002309-00070-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 443259519,
    "recordOffset": 443214789,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{10543=Following the basic approach of Stock and Watson (1999, 2003), among others, we treat inflation as having a unit root, and forecast a measure of the direct multi-step change in inflation as a function of lags of the change in quarterly inflation and lags of other variables. In particular, using the notation of the last section, we make the log difference of the quarterly core PCE price index (scaled by 400 to make an annualized percentage change); is then the change in quarterly inflation. The predictand is , where denotes the average annual rate of price change from to . The variables denote the output gap, relative food and energy price inflation, and the set of common factors included in the model (with the number ranging from 1 to 5). The restricted model is autoregressive -- the multi-step change in inflation is a function of just lags of the one-period change in inflation. The unrestricted model adds lags of variables to the set of regressors. In particular, the competing forecasting models take the forms of section 4's equations (13) and (14). All models include four lags of the change in inflation ( ). For the output gap and the factors, the models use one lag. For food-energy inflation, the models include two lags.}",
    "TableContextTimeStampAfterTable": "{53442=In light of the considerable practical interest in the out-of-sample predictability of inflation (see, for example, Stock and Watson (1999, 2003), Atkeson and Ohanian (2001), Orphanides and van Norden (2005), and Clark and McCracken (2006)), we present results for DGPs based on estimates of quarterly U.S. inflation models. In particular, we consider models based on the relationship of the change in core PCE inflation to (1) lags of the change in inflation and the output gap, (2) lags of the change in inflation, the output gap, and food and energy price inflation, and (3) lags of the change in inflation and five common business cycle factors, estimated as in Stock and Watson (2005).7 We consider various combinations of forecasts from an unrestricted model that includes all variables in the DGP to forecasts from a restricted model that takes an AR form (that is, a model that drops from the unrestricted model all but the constant and lags of the dependent variable)., 153406=Clark, T.E., and McCracken, M.W. (2006), \"The Predictive Content of the Output Gap for Inflation: Resolving In-Sample and Out-of-Sample Evidence,\" Journal of Money, Credit, and Banking, 38, 1127-1148., 90797=To evaluate the empirical performance of our proposed forecast methods compared to some related alternatives (described below), we consider the widely studied problem of forecasting inflation with Phillips curve models. In particular, we examine forecasts of quarterly core PCE (U.S.) inflation. In light of the potential for the benefits of forecast combination to rise as the number of variables and, in turn, overall parameter estimation imprecision increases, we consider a range of applications, including between one and five predictors of core inflation. In a first application, patterned on analyses in such studies as Stock and Watson (1999, 2003), Orphanides and van Norden (2005), and Clark and McCracken (2006), the unrestricted forecasting model includes lags of inflation and the output gap. In a second application, the unrestricted forecasting model is augmented to include lags of food and energy price inflation, following Gordon's (1998) approach of including supply shock measures in the Phillips curve. In another set of applications, patterned on such studies as Brave and Fisher (2004), Stock and Watson (2002, 2005), and Boivin and Ng (2005), the unrestricted forecast model includes lags of inflation and 1, 2, 3, or 5 common business cycle factors, estimated as in Stock and Watson (2005). This section proceeds by detailing the data and forecasting models, describing some additional forecast methods included for comparison, and presenting the results., 215769=Table 5a. Application Results: 1985-2006 Forecasts of Core PCE Inflation (RMSE for restricted forecast, and MSE ratios for other forecasts), 92542=Inflation is measured in annualized percentage terms (as 400 times the log change in the price index).10 The output gap is measured as the log of real GDP less the log of CBO's estimate of potential GDP. Following Gordon (1998), the food and energy price inflation variable is measured as overall PCE inflation less core PCE inflation. The common factors are estimated with the principal component approach of Stock and Watson (2002, 2005), using a data set of 127 monthly series nearly identical to Stock and Watson's (2005).11 Following the specifications of Stock and Watson (2005), we first transformed the data for stationarity, screened for outliers, and standardized the data, and then computed principal components at the monthly frequency. Following Stock and Watson (2005) and Boivin and Ng (2005), the factors are estimated recursively for each month of the forecast sample, applying the factor estimation algorithm to data through the given month. Quarterly data on factors used in model estimation ending in quarter are within-quarter averages of monthly factors estimated with data from the beginning of the sample through the last month of quarter}",
    "lastModified": "Tue, 18 Sep 2007 20:38:24 GMT",
    "textBeforeTable": "Wright, J.H. (2003), \"Forecasting U.S. Inflation by Bayesian Model Averaging,\" manuscript, Board of Governors of the Federal Reserve System. Timmermann, A. (2006), \"Forecast Combinations,\" in Handbook of Forecasting, eds. G. Elliott, C.W.J. Granger, and A. Timmermann, North Holland, 135-196. Theil, H. (1971), Principles of Econometrics, New York: John Wiley Press. Stock, J.H., and Watson, M.W. (2005), \"An Empirical Comparison of Methods for Forecasting Using Many Predictors,\" manuscript, Harvard University. Stock, J.H., and Watson, M.W. (2003), \"Forecasting Output and Inflation: The Role of Asset Prices,\" Journal of Economic Literature, 41, 788-829. Stock, J.H., and Watson, M.W. (2002), \"Macroeconomic Forecasting Using Diffusion Indexes,\" Journal of Business and Economic Statistics, 20, 147-162. Stock, J.H., and Watson, M.W. (1999), \"Forecasting Inflation,\" Journal of Monetary Economics, 44, 293-335. Orphanides, A., and van Norden, S. (2005), \"The Reliability of Inflation Forecasts Based on Output Gap Estimates in Real Time,\" Journal of Money, Credit, and Banking, 37, 583-601. Newey, W.K., and West, K.D. (1987), \"A Simple, Positive Semi-Definite, Heteroskedasticity and Autocorrelation Consistent Covariance Matrix,\" Econometrica, 55, 703-708. Litterman, R.B. (1986), \"Forecasting with Bayesian Vector Autoregressions -- Five Years of Experience,\" Journal of Business and Economic Statistics, 4, 25-38. Koop, G., and Potter, S. (2004), \"Forecasting in Dynamic Factor Models Using Bayesian Model Averaging,\" Econometrics Journal, 7, 550-565. Jacobson, T., and Karlsson, S. (2004), \"Finding Good Predictors for Inflation: A Bayesian Model Averaging Approach,\" Journal of Forecasting, 23, 479-496. Hendry, D.F., and Clements,",
    "textAfterTable": "Notes: 1. DGPs 1-3 are defined in, respectively, equations (10), (11), and (12). In all experiments, the coefficients are scaled such that the null and alternative models are (in population) expected to be equally accurate in the first forecast period. For DGP 1, . For DGP 2, . For DGP 3, . 2. The forecasting approaches are defined as follows. The restricted forecast is obtained from OLS estimates of the model omitting terms (equation (13)). The unrestricted forecast is obtained from OLS estimates of the full model (equation (14)). The opt. combination: known forecast is computed as restricted + unrestricted, with",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}