{
    "relation": [
        [
            "Part #",
            "dsPIC33FJ128MC804",
            "dsPIC33FJ128MC802",
            "dsPIC33FJ64MC802"
        ],
        [
            "Distributor",
            "Microchip Technology, Inc.",
            "Microchip Technology, Inc.",
            "Microchip Technology, Inc."
        ],
        [
            "Manufacturer",
            "Microchip Technology, Inc.",
            "Microchip Technology, Inc.",
            "Microchip Technology, Inc."
        ],
        [
            "Product Category",
            "Not Provided",
            "Not Provided",
            "Not Provided"
        ],
        [
            "Description",
            "mode. . Hardware Real-Time Clock/Calendar (RTCC): - Provides clock, calendar, and alarm functions. Interrupt Controller: . 5-cycle latency. . 118 interrupt vectors. . Up to 53 available interrupt sources. . Up to three external interrupts. . Seven programmable priority levels. . Five processor...",
            "mode. . Hardware Real-Time Clock/Calendar (RTCC): - Provides clock, calendar, and alarm functions. Interrupt Controller: . 5-cycle latency. . 118 interrupt vectors. . Up to 53 available interrupt sources. . Up to three external interrupts. . Seven programmable priority levels. . Five processor...",
            "PWM mode. . Hardware Real-Time Clock/Calendar (RTCC): - Provides clock, calendar, and alarm functions. Interrupt Controller: . 5-cycle latency. . 118 interrupt vectors. . Up to 53 available interrupt sources. . Up to three external interrupts. . Seven programmable priority levels. . Five processor..."
        ]
    ],
    "pageTitle": "CAN Controller Chip | Products & Suppliers | IHS Engineering360",
    "title": "",
    "url": "http://www.globalspec.com/industrial-directory/can_controller_chip",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986423.95/warc/CC-MAIN-20150728002306-00237-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 489023871,
    "recordOffset": 488992177,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{63806=Description: The MAX1955/MAX1956 are dual-output, fixed-frequency, voltage-mode, pulse-width modulated (PWM) step-down controllers with 0.5% output accuracy. Each controller switches at a constant 600kHz and is 180° out-of-phase with the other controller, reducing input ripple current and the number, 57374=Description: The 72125 is a 1K x 16 dedicated, parallel-to-serial FIFOs. The ability to buffer wide word widths (x16) make this FIFO ideal for laser printers, FAX machines, local area networks (LANS), video storage and disk/tape controller applications. Expansion in width and depth can be achieved using, 67818=Description: to use miniature external components. The MAX1649/MAX1651 have dropout voltages less than 0.3V at 500mA and accept input voltages up to 16V. Output voltages are preset at 5V (MAX1649), or 3.3V (MAX1651). They can also be adjusted to any voltage from 1.5V to the input voltage by using two resistors, 83835=Description: The PCI Mini-ACE Mark3/Micro-ACE TE family of MIL-STD-1553 terminals provides a complete interface between a 32-Bit/33Mhz 3.3V signaling PCI Bus and a MIL-STD-1553 bus. These terminals integrate dual transceiver, protocol logic, and 4K words or 64K words of RAM, all of which can be powered from, 60177=Description: delivers true multi parameter measurements i.e.: Mass flow, volume flow, density, temperature and fraction. The MASS 6000 19\" transmitter can be connected to all sensors of types MASS 2100/MC2/FC300 and are available in different versions depending of number of output facilities, Ex protection, 136430=Description: controller chip. Thus, the NAT7210 can perform all the interface functions defined by the ANSI/IEEE Standard 488.1-1987, and meets the additional requirements and recommendations of ANSI/IEEE Standard 488.2-1987. The NAT7210 performs complete IEEE 488 Talker, Listener, and Controller functions., 103741=Description: and universal touch screen controller chip solution. The AR1000 Series has sophisticated proprietary touch screen decoding algorithms to fully process all touch data and save the host from this overhead. More than the usual “preprocessing” features of other low cost devices, the AR1000 delivers, 93390=Description: The MAX1584/MAX1585 provide a complete power-supply solution for slim digital cameras. They improve performance and lower component count and size compared to conventional multichannel controllers in 2-cell AA, 1-cell Li+, and dual-battery designs. On-chip MOSFETs provide up to 95% efficiency, 87574=Description: Cambridge Technology’s EC1000 is the next generation in galvo-steered laser control systems. This compact, fully integrated dual system-on-a-chip (SoC) control system is ideal for deployment into modern factory environments with distributed automation. In this environment, a single host}",
    "textBeforeTable": "Parts by Number Top",
    "textAfterTable": "Conduct Research Top Atmels' USB Wireless LAN Media Access Controller Atmel's AT76C503A is a single- chip USB controller that provides all the processing and functionality required for the Media Access Control (MAC) protocol of wireless LANs at up to 11 Mbps. It focuses on, but is not limited to the IEEE 802.11b (Wi-Fi) standard. The AT76C503A provides a glueless MICRO: Using an integrated controller to manage wafer-handling systems . Equipment also must run longer without failure, experience less downtime, and be more efficient with consumable materials than the systems used in today's 200-mm fabs. This article describes the BX controller, a single integrated process control system from Berkeley Process Control (Richmond, CA), which Bigger Role for 16-bit Chips Bigger role for 16-bit chips by managing multiple serial interfaces such as Controller-area networks (CAN), Local-interconnect network (LIN) buses, and Serial-peripheral interfaces (SPI). These processes also have the horsepower to handle large control programs written in high-level languages. Even seemingly simple control nodes can Self-testing chips take a load off ATE BIST controller. It should come as no surprise that Moore's Law of regularly doubling chip capacity is having an impact on automatic test equipment (ATE) for ICs.",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}