{
    "relation": [
        [
            "Categories",
            "Great for these types of students",
            "Tips for prospective students",
            "Am enjoying being here",
            "Am learning a lot"
        ],
        [
            "Comments",
            "it has a great nursing program i heard it was the best in Idaho.",
            "Don't procrastinate and do study when your are suppose to it helps",
            "everyone gets along and if we don't know each other sooner or later we will. i made lots of friends in my first semester",
            "yes i have trouble but i actually learn a lot"
        ]
    ],
    "pageTitle": "Idaho State University Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Idaho-State-University/reviews?_escaped_fragment_=/show/100545",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989043.35/warc/CC-MAIN-20150728002309-00101-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 922692219,
    "recordOffset": 922617634,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{1574=Another thing I love about ISU is that it is inexpensive in general, but there is no loss in education. An Associate’s degree or Bachelor’s degree from ISU is the same, if not better than other schools. Tuition costs about $2284 and then there is housing and textbooks and such, but don't forget that there are scholarships and financial aid (which is great! go to fafsa.ed.gov). ISU is the best school to go to if you want an affordable, great education., 143711=It's a good school to get started at. The Academic services are most excellent in helping students finding free tutoring. The only Problem is the Math 1108 course has a low success rate because it is online., 22678=Literally everyday I look to the sky and think, it's so beautiful here. I am originally from Washington so Idaho weather is so different. It's already October and it has only rained a maximum of 3 days in the 2 months I've been here. The temperatures have been in the 80's and the weather is just wonderful. The people here seem so happy to be here, which in turn makes me happy too. Pocatello is the smile capital of the world and the people here prove that. Lastly, the campus is beautiful. Except for the many squirrels wandering the campus, I love it, my roommate says the squirrels are cute but I feel that they are a tad bit scary. Other than that the beauty of the campus is shown through the many trees and mountains (which the people of Idaho call hills)., 3397=I am a second year at ISU and am a junior. Each semester in college is different but the first few seem to be pretty similar all across the board. I started college in August of 2008. ISU is a great school, the teachers care and there is always something going on for the new and current students. To start, go to orientation. I met people there that I am still in contact with. Get involved; the first year of college is important to establish yourself and experience. My advice is to apply for the Honors program. There are a lot of benefits to being in the Honors program: automatic $500 housing scholarship, living in the newer and nicer dorms, smaller class sizes, etc. And to be honest, the classes aren’t harder. The classes I am taking challenge me but I do not find them impossible to get an A in if I put in the time that each class needs. The experts suggest that for every credit in a class you should study three times as many hours in a week. So if a class is three credits, study about nine hours a week... but that hardly ever happens. Just give each class enough time to get everything done, and done well. That is what I have done and I am a straight A student., 248357=You do get GREAT medical coverage. On campus medical center is awesome and mostly free. There are many things to do that are free including discounts around town. A great new gym and facilities and an excellent education. Beautiful scenery and campus. Friendly people. Just remember we have all 4 seasons here and starting in October it starts to get cold. You will need winter gear till about March. There is a bus that stops every 15 minutes at most places around campus. But you will do a lot of walking., 377956=ISU has many traditions both endorsed by the school such as the homecoming parade and bonfire, March through the Arch, powderpuff football, and true bengal, and student lead traditions such as taming the bengal (where students mount the bengal statue naked)., 231720=March through the Arch! Freshman walk through before school starts and you walk back through the opposite way when you graduate!, 10576=I love the class size for ISU. Students to professors ratio is 17:1, what could be better? There are a variety of classes as well to choose from, Physical Education Activity such as bowling or even fly fishing to add some spice to your general education class.es, 321108=March through the Arch occurs every year where Freshman climb to the top of Redhill and walk under our arch as initiation., 436562=© 2015, Cappex.com, LLC, 165764=March though the arc is for all freshman True bangal a night where you kiss someone at the pilars at midnight of spirit week., 326616=Remember deadlines if you plan to be admitted. Also FAFSA needs to be submitted before February 15 for financial support in the from of grants and scholarships. Also visit the campus if you have the chance., 305701=March through Arch when you enter the school., 88816=There are multiple things to do on campus that don't require you to pay anything: the rock wall, the ISU Bengal Theater, the gym, and sporting events. These all give something to do because the Bengal is always having a movie playing. If you like plays the campus has a nice auditorium which is fun to go watch them in but they do cost some money but as long as you bring your student ID it is a decent price. Pocatello itself isn't very impressive. It gives you some amazing food options but the shopping isn't very good but a 45 min drive away is Idaho Falls which makes up for the shopping pretty well. If you are going there to stay up late pretty much everything closes at 9 o'clock during the week and around 5 on Sunday so be prepared that Pocatello does not have many place to go after midnight.}",
    "textBeforeTable": "01/06/2010 Reviewer is A current student here. 21 out of 22 people found this review useful. 1 of 107 Sarah from Eagle, ID Check out reviews left by other students or leave your own review. You could win a free scholarship. Idaho State University Reviews Idaho State University › Idaho › By State › Colleges › } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.create', -->",
    "textAfterTable": "Am learning a lot I am a second year at ISU and am a junior. Each semester in college is different but the first few seem to be pretty similar all across the board. I started college in August of 2008. ISU is a great school, the teachers care and there is always something going on for the new and current students. To start, go to orientation. I met people there that I am still in contact with. Get involved; the first year of college is important to establish yourself and experience. My advice is to apply for the Honors program. There are a lot of benefits to being in the Honors program: automatic $500 housing scholarship, living in the newer and nicer dorms, smaller class sizes, etc. And to be honest, the classes aren’t harder. The classes I am taking challenge me but I do not find them impossible to get an A in if I put in the time that each class needs. The experts suggest that for every credit in a class you should study three times as many hours in a week. So if a class is three credits, study about nine hours a week... but that hardly ever happens. Just give each class enough time to get everything done, and done well. That is what I have done and I am a straight A student.",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}