{
    "relation": [
        [
            "type",
            "FR Doc.",
            "RIN"
        ],
        [
            "regulations.gov",
            "2012-12907",
            "0584-AE26"
        ]
    ],
    "pageTitle": "7 CFR Part 274 - ISSUANCE AND USE OF PROGRAM BENEFITS | US Law | LII / Legal Information Institute",
    "title": "",
    "url": "https://www.law.cornell.edu/cfr/text/7/part-274",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986423.95/warc/CC-MAIN-20150728002306-00300-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 906046003,
    "recordOffset": 906029994,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{32523=§ 2018 - Approval of retail food stores and wholesale food concerns, 32230=§ 2015 - Eligibility disqualifications, 34339=§ 2035 - Simplified supplemental nutrition assistance program, 32651=§ 2019 - Redemption of program benefits, 32835=§ 2021 - Civil penalties and disqualification of retail food stores and wholesale food concerns, 33761=§ 2029 - Workfare, 32329=§ 2016 - Issuance and use of program benefits, 11874=The Food and Nutrition Service (FNS) is adopting as a final rule, without substantive changes, the proposed rule that amends the Supplemental Nutrition Assistance Program (SNAP) regulations to implement Section 4121 of the Food, Conservation, and Energy Act of 2008 (the Farm Bill), which requires adequate system testing before and after implementation of a new State automated data processing (ADP) and information retrieval system, including the evaluation of data from pilot projects in limited areas for major systems changes, before the Secretary approves the system to be implemented more broadly. The rule also provides that systems be operated in accordance with an adequate plan for continuous updating to reflect changed policy and circumstances, and for testing the effects of the system on access by eligible households and on payment accuracy. This final rule specifies the requirements for submission of a test plan, and changes the due date of an Advance Planning Document Update (APDU) from 90 days after to 60 days prior to the expiration of the Federal financial participation (FFP) approval, and revises language regarding the federal share of costs in consolidated information technology (IT) operations to specify that the threshold for service agreements applies to federally aided public assistance programs, rather than to SNAP alone. In addition, this rule amends SNAP regulations relating to the establishment of an ADP and information retrieval system and to provide clarifications and updates, which have occurred since this section was last updated in 1996., 32991=§ 2022 - Disposition of claims, 33532=§ 2027 - Appropriations and allotments, 17454=The rule entitled Supplemental Nutrition Assistance Program: Trafficking Controls and Fraud Investigations was published on August 21, 2013. The ICR for this rule approved the creation of a new information collection, which has been assigned the OMB Control Number 0584-0587. The Office of Management and Budget cleared the associated ICR on September 23, 2013. This document announces the approval of the ICR., 32013=§ 2013 - Establishment of supplemental nutrition assistance program, 32435=§ 2017 - Value of allotment, 33082=§ 2023 - Administrative and judicial review; restoration of rights, 33631=§ 2028 - Consolidated block grants for Puerto Rico and American Samoa, 34023=§ 2032 - Automated data processing and information retrieval systems, 32141=§ 2014 - Eligible households, 32751=§ 2020 - Administration, 33209=§ 2024 - Violations and enforcement, 33422=§ 2026 - Research, demonstration, and evaluations, 33839=§ 2030 - Repealed., 34231=§ 2034 - Assistance for community food projects, 31713=§ 2011 - Congressional declaration of policy, 34461=§ 2036 - Availability of commodities for emergency food assistance program, 3035=In accordance with the Paperwork Reduction Act of 1995 (PRA), the Food and Nutrition Service (FNS) is announcing the Office of Management and Budget's (OMB) approval of information collection requirements contained in a final rule published in the Federal Register ., 31818=§ 2012 - Definitions, 33305=§ 2025 - Administrative cost-sharing and quality control, 33918=§ 2031 - Minnesota Family Investment Project, 34152=§ 2033 - Repealed.}",
    "lastModified": "Mon, 29 Jun 2015 17:28:31 GMT",
    "textBeforeTable": "Additional Documents GPO FDSys XML | Text 79 FR 28606 - Automated Data Processing and Information Retrieval System Requirements: System Testing 2014-05-19; vol. 79 # 96 - Monday, May 19, 2014 For a complete list of all Rules, Proposed Rules, and Notices view the Rulemaking tab. The following are only the Rules published in the Federal Register after the published date of Title 7. Title 7 published on . 75 FR 18381 271.8274 7 U.S.C. 2011-203 § 274.8 — Functional and technical EBT system requirements. , Apr. 12, 2010, unless otherwise noted. Source: . are contained in § OMB control numbers relating to this part Editorial Note: 6. Authority:",
    "textAfterTable": "DEPARTMENT OF AGRICULTURE, Food and Nutrition Service Final rule; notice of approval of Information Collection Request (ICR). The ICR associated with the Automated Data Processing and Information Retrieval System Requirements: System Testing rule published in the Federal Register on January 2, 2014 (79 FR 5), was approved by OMB on April 7, 2014. 7 CFR Parts 271, 272, 274, 276 and 277 Summary In accordance with the Paperwork Reduction Act of 1995 (PRA), the Food and Nutrition Service (FNS) is announcing the Office of Management and Budget's (OMB) approval of information collection requirements contained in a final rule published in the Federal Register . 2014-04-24; vol. 79 # 79 - Thursday, April 24, 2014 79 FR 22766 - Supplemental Nutrition Assistance Program: Trafficking Controls and Fraud Investigations GPO FDSys XML | Text Additional Documents type regulations.gov",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}