{
    "relation": [
        [
            "Sr. No.",
            "1.",
            "2."
        ],
        [
            "CAUSES",
            "Rapid Drying",
            "High solution viscosity"
        ],
        [
            "REMEDIES",
            "Use mild drying conditions",
            "Use additional solvents to decrease viscosity of solution."
        ]
    ],
    "pageTitle": "Pharmaceutical info: Problems in tablet manufacturing",
    "title": "",
    "url": "http://niazi-pharmaceuticalinfo.blogspot.com/2010/09/problems-in-tablet-manufacturing.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989043.35/warc/CC-MAIN-20150728002309-00117-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 163863231,
    "recordOffset": 163834664,
    "tableOrientation": "HORIZONTAL",
    "lastModified": "Tue, 30 Jun 2015 08:20:36 GMT",
    "textBeforeTable": "TABLE.27. THE CAUSES AND REMEDIES OF CAPPING RELATED TO ‘FORMULATION’ (GRANULATION) Reason: Capping is usually due to the air–entrapment in a compact during compression, and subsequent expansion of tablet on ejection of a tablet from a die. ‘Capping’ is the term used, when the upper or lower segment of the tablet separates horizontally, either partially or completely from the main body of a tablet and comes off as a cap, during ejection from the tablet press, or during subsequent handling. Capping(1,5) Further, in this section, each problem is described along-with its causes and remedies which may be related to either of formulation (granulation) or of machine (dies, punches and entire tablet press). ix)DOUBLE IMPRESSION: It is due to free rotation of the punches, which have some engraving on the punch faces. The defect related to Machine viii) MOTTLING: It is either due to any one or more of these factors: Due to a coloured drug, which has different colour than the rest of the granular material? (Excipient- related); improper mixing of granular material (Process-related); dirt in the granular material or on punch faces; oil spots by using oily lubricant. The defect related to more than one factor: These problems (v, vi, vii) are due to more amount of binder in the granules or wet granules. vii) BINDING",
    "textAfterTable": "3. Not thoroughly dried granules. Dry the granules properly. 4. Insufficient amount of binder or improper binder. Increasing the mount of binder OR Adding dry binder such as pre-gelatinized starch, gum acacia, powdered sorbitol, PVP, hydrophilic silica or powdered sugar. 5. Insufficient or improper lubricant. Increase the amount of lubricant or change the type of lubricant. 6. Granular mass too cold to compress firm. Compress at room temperature. TABLE.28. THE CAUSES AND REMEDIES OF CAPPING RELATED TO ‘MACHINE’ (DIES, PUNCHES AND TABLET PRESS) Sr. No. CAUSES REMEDIES 1. Poorly finished dies Polish dies properly. Investigate other steels or other materials. 2. Deep concave punches or beveled-edge faces of punches. Use flat punches. 3. Lower punch remains below the face of die during ejection. Make proper setting of lower punch during ejection. 4. Incorrect adjustment of sweep-off blade. Adjust sweep-off blade correctly to facilitate proper ejection. 5.",
    "hasKeyColumn": true,
    "keyColumnIndex": 1,
    "headerRowIndex": 0
}