{
    "relation": [
        [
            "Days",
            "30",
            "50",
            "150",
            "200"
        ],
        [
            "BSE",
            "3710.71",
            "3746.10",
            "3786.92",
            "3858.55"
        ],
        [
            "NSE",
            "3710.30",
            "3746.00",
            "3787.48",
            "3858.97"
        ]
    ],
    "pageTitle": "Lakshmi Machine Works Stock Price, Share Price, Live BSE/NSE, Lakshmi Machine Works Bids Offers. Buy/Sell Lakshmi Machine Works news & tips, & F&O Quotes",
    "title": "",
    "url": "http://www.moneycontrol.com/india/stockpricequote/textiles-machinery/lakshmimachineworks/LMW",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986423.95/warc/CC-MAIN-20150728002306-00285-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 597301871,
    "recordOffset": 597249058,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{135716=UnitedBrewerie Jul Fut, 136423=JSWSteel Jul Fut, 135205=28 July 2015, 219393=Lakshmi Machine is in the Textiles - Machinery sector. The current market capitalisation stands at Rs 3,971.78 crore. The company management includes Sanjay Jayavarthanavelu - Chairman & Managing Director, M V Subbiah - Director, S Pathy - Director, Basavaraju - Director, Aditya Himatsingka - Director, Mukund Govind Rajan - Director, Chitra Venkataraman - Director, R Rajendran - Director - Finance, V Sathyakumar - Nominee Director. It is listed on the BSE with a BSE Code of 500252 and the NSE with an NSE Code of LAXMIMACH. Its Registered office is at Unit - I: Perianaickenpalayam, Coimbatore,Tamil Nadu - 641020. Their Registrars are SKDC Consultants Ltd., 218082=Astec LifeSciences Recommended on Mar 31st 2015}",
    "textBeforeTable": "Edit Watchlist Have you invested in these stocks? You can track them better in your Portfolio close[x] Add to Watchist Account Optional Optional Optional Optional Add to Portfolio OR Add to watchlist } $('#mcpcp_addprof_info').hide(); { function close_info()",
    "textAfterTable": "Keep me signed in Forgot Password? New to Moneycontrol - Sign up now Its easy and FREE! Username Username should be atleast 4 characters Password Password should be 6 to 10 characters Confirm Password Email OR connect with LIVE",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}