{
    "relation": [
        [
            "Category",
            "Syntax",
            "Default",
            "Example"
        ],
        [
            "Value",
            "PlsqlInfoLogging InfoDebug",
            "Empty",
            "PlsqlInfoLogging InfoDebug"
        ]
    ],
    "pageTitle": "Understanding Oracle HTTP Server Modules",
    "title": "",
    "url": "http://docs.oracle.com/cd/E23943_01/web.1111/e10144/under_mods.htm",
    "hasHeader": true,
    "headerPosition": "MIXED",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989043.35/warc/CC-MAIN-20150728002309-00283-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 71155243,
    "recordOffset": 71122842,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{41089=01077 — background process initialization failure, 100787=To define daily frequency, the keyword Everyday is used. The cleanup starts every day at the time defined. For example, Everyday 2:00 causes the cleanup to happen everyday at 2:00 a.m. (local time)., 29739=PlsqlBindBucketWidths 2000, 101038=To define weekly frequency, the days of the week, (Sunday, Monday, Tuesday, Wednesday, Thursday, Friday, Saturday) are used. For example, Wednesday 15:30 causes the cleanup to happen every Wednesday at 3:30 p.m. (local time)., 26520=After the higher configured value, mod_plsql starts auto-generating bucket sizes of larger values by doubling the last value, as needed. Therefore, after 400, the next bucket value becomes 800, then 1600, and so on., 40994=01041 — internal error. hostdef extension doesn't exist, 112277=20971520 (bytes), 102934=PlsqlCacheCleanupTime Monday 20:00, 40833=01033 — ORACLE initialization or shutdown in progress, 29377=32,128,1450,2048,4000, 41378=01091 — failure during startup force, 40758=01014 — ORACLE shutdown in progress, 101394=To define monthly frequency, the keyword Everymonth is used. The cleanup starts on the Saturday of the month at the time defined. For example, Saturday Everymonth 23:00 causes the cleanup to happen the first Saturday of every month at 11:00 p.m. (local time)., 40926=01034 — ORACLE not available, 102675=Saturday 23:00, 41454=01092 — ORACLE instance terminated. Disconnection forced, 41870=12571 — TNS: packet writer failure, 41178=01089 — immediate shutdown in progress- no operations permitted, 78444=1000, 41796=12570 — TNS: packet reader failure, 72337=By default, the mod_plsql module attempts to fetch 200 response lines of output where each line is of 255 bytes. In situations where the response bytes are single-bytes, the response buffer is populated to the maximum and can pack 255*200=51000 bytes for each round trip. For responses containing multi-byte data, the byte packing for each row could be less than ideal resulting in lesser bytes getting transferred for each round trip. If your application generates large pages frequently and the response does not fit in one round trip, then consider setting this parameter higher. The memory usage for the mod_plsql module will increase., 41281=01090 — shutdown in progress- connection is not permitted, 112530=PlsqlCacheTotalSize 20971520}",
    "lastModified": "Wed, 13 May 2015 05:20:20 GMT",
    "textBeforeTable": "InfoDebug mode: This logs more information to the Apache's error_log. This is used in conjunction with Apache's info logging level. If the Apache's logging level is not at least set to this high, this setting will be ignored. Specifies what mode the mod_plsql module should use to do extra performance logging. PlsqlInfoLogging The character set in use is multi-byte, and you want to compensate for the problem of get_page or get_page_raw fetching fewer bytes for each row. Calculations in the PL/SQL Web ToolKit are character-based and in the case of multi-byte characters, OWA packages assume a worst-case character byte size and do not attempt to pack each row to its maximum. The average response page is large and you want to reduce the number of round-trips the mod_plsql module makes to the database to fetch the response. Change this parameter only under the following circumstances: This parameter is changed only for performance reasons. The minimum value for this parameter is 28, but it is seldom reduced. PlsqlFetchBufferSize 256 Example 200 Default PlsqlFetchBufferSize number Syntax Value",
    "textAfterTable": "The logging setting is useful for debugging problems in your PL/SQL application. PlsqlMaxRequestsPerSession Specifies the maximum number of requests a pooled database connection should service before it is closed and re-opened. Category Value Syntax PlsqlMaxRequestsPerSession number Default 1000 Example PlsqlMaxRequestsPerSession 500 This parameter helps relieve memory and resource problems that may occur due to prolonged session reuse by a PL/SQL application. This parameter should not need to be changed. The default is sufficient in most cases. Setting this parameter to a low number can degrade performance. A case for a lower value might be an infrequently-used DAD whose performance is not a concern, and for which limiting the number of requests provides some benefit. PlsqlNLSLanguage Specifies the NLS_LANG variable for this DAD. This parameter overrides the NLS_LANG environment variable. When this parameter is set, the PL/SQL Gateway uses the specified NLS_LANG to connect to the database. Once connected, an alter session command is issued to switch",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}