{
    "relation": [
        [
            "Count",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1"
        ],
        [
            "Component",
            "",
            "",
            "",
            "",
            "",
            ""
        ],
        [
            "DateTime",
            "2004-09-01T00:00:00",
            "2004-09-30T00:00:00",
            "2005-02-01T00:00:00",
            "2005-02-01T00:00:00",
            "2013-09-19T00:00:00",
            "2013-10-17T00:00:00"
        ],
        [
            "Description",
            "The digital orthophotography was produced in natural color at a natural ratio of 1 to 2,400 with a 1 ft pixel resolution. A step-by-step breakdown of the digital orthophoto production process follows. 1. A representative number of raster image files were visually checked for image quality on the workstation. 2. The digital image files were oriented on the digital orthophoto production workstation. The following information was then loaded onto the workstation. - The camera calibration parameters and flight line direction - Ground control and pass point locations - The exterior orientation parameters from the aerotriangulation process - ASCII file containing the corner coordinates of the orthophotos - The digital elevation model in a MGE format - Project-specific requirements such as final tile size and resolution. -Orientation parameters developed from the aerotriangulation solution. A coordinate transformation based on the camera calibration fiducial coordinates was then undertaken. This transformation allowed the conversion of every measured element of the plates to a sample/line location. Each pixel in an image was then referenced by sample and line (its horizontal and vertical position) and matched to project control. 3. The newly resected image was visually checked for pixel drop-out and/or other artifacts that may degrade the final orthophoto image. 4. DTM data were imported and written to the correct subdirectory on disk. 5. The DTM file was re-inspected for missing or erroneous data points. 6. A complete differential rectification was carried out using a cubic convolution algorithm that removed image displacement due to topographic relief, tip and tilt of the aircraft at the moment of exposure, and radial distortion within the camera. Each final orthophoto was produced at a natural scale of 1 to 2,400 with a 1ft pixel resolution. At this point in the process, the digital orthophotos covered the full aerial frame. 7. Each digital orthophoto image was visually checked for accuracy on the workstation screen. Selected control points (control panels or photoidentifiable points) that are visible on the original film were visited on the screen, and the X and Y coordinates of the location of the panel or photoidentifiable point were measured. This information was cross-referenced with the X and Y information provided by the original ground survey. If the orthophoto did not meet or exceed NMAS standards, the rectification was regenerated. The digital orthophotos were then edge-matched using proprietary software that runs in Z/I Imaging OrthoPro software package. Adjoining images were displayed in alternating colors of red and cyan. In areas of exact overlap, the image appears in gray-scale rendition. Offsets were colored red or cyan, depending on the angle of displacement. The operator panned down each overlap line at a map scale to inspect the overlap area. Any offset exceeding accuracy standards was re-rectified after the DTM and AT information was rechecked. 8. Once the orthos were inspected and approved for accuracy, the files were copied to the network and downloaded by the ortho finishing department. This production unit was charged with radiometrically correcting the orthophotos prior to completing the mosaicking and clipping of the final tiles. The image processing technician performed a histogram analysis of several images that contained different land forms (urban, agricultural, forested, etc.) and established a histogram that best preserves detail in highlight and shadow areas. EarthData International has developed a proprietary piece of software called \"Image Dodging.\" This radiometric correction algorithm was utilized in batch and interactive modes. Used in this fashion, this routine eliminated density changes due to sun angle and changes in flight direction. A block of images were processed through image dodging, in batch mode and displayed using Z/I Imaging OrthoPro software. At this point the images have been balanced internally, but there are global differences in color and brightness that were adjusted interactively. The technician assigned correction values for each orthophoto then displayed the corrected files to assess the effectiveness of the adjustment. This process was repeated until the match was considered near seamless. The files then were returned to digital orthophoto production to mosaic the images. 9. The processed images were mosaicked using the Z/I Imaging software. The mosaic lines were set up interactively by the technician and were placed in areas that avoided buildings, bridges, elevated roadways, or other features that would highlight the mosaic lines. File names were assigned. 10. The finishing department performed final visual checks for orthophoto image quality. The images were inspected using Adobe Photoshop, which enabled the technician to remove dust and lint from the image files interactively. Depending on the size and location of the flaw, Photoshop provided several tools to remove the flaw. Interactive removal of dust were accomplished at high magnification so that repairs are invisible. 11. The final orthophoto images were written out into TIFF format with the corresponding georeference files for ESRI platforms.",
            "New ground control was established to control and orient the photography, and included both photo-identifiable features and artificial targets. The ground control network and airborne GPS data was integrated into a rigid network through the completion of a fully analytical bundle aerotriangulation adjustment. 1. The original aerial film was scanned at a resolution of 1,210 DPI. The scans were produced using Z/I Imaging PhotoScan flatbed metric scanners. Each unit has a positional accuracy of 1.5 microns and a radiometric resolution of 1,024 gray levels for each of three color layers. 2. The raster scans were given a preliminary visual check on the scanner workstation to ensure that the raster file size is correct and to verify that the tone and contrast were acceptable. A directory tree structure for the project was established on one of the workstations. This project was then accessed by other workstations through the network. The criteria used for establishment of the directory structure and file naming conventions accessed through the network avoids confusion or errors due to inconsistencies in digital data. The project area was defined using the relevant camera information that was obtained from the USGS camera calibration report for the aerial camera and the date of photography. The raster files were rotated to the correct orientation for mensuration on the softcopy workstation. The rotation of the raster files was necessary to accommodate different flight directions from one strip to the next. The technician verified that the datum and units of measurement for the supplied control were consistent with the project requirements. 3. The photogrammetric technician performed an automatic interior orientation for the frames in the project area. Thesoftcopy systems that were used by the technicians have the ability to set up predefined fiducial templates for the aerial camera(s) used for the project. Using the template that was predefined in the interior orientation setup, the software identified and measured the eight fiducial positions for all the frames. Upon completion, the results were reviewed against the tolerance threshold. Any problems that occurred during the automatic interior orientation would cause the software to reject the frame and identify it as a potential problem. The operator then had the option to measure the fiducials manually. 4. The operator launched the point selection routine which automatically selected pass and tie points by an autocorrelation process. The correlation tool that is part of the routine identified the same point of contrast between multiple images in the Von Gruber locations. The interpolation tool can be adjusted by the operator depending on the type of land cover in the triangulation block. Factors that influence the settings include the amount of contrast and the sharpness of features present on the photography. A preliminary adjustment was run to identify pass points that had high residuals. This process was accomplished for each flight line or partial flight line to ensure that the network has sufficient levels of accuracy. The points were visited and the cause for any inaccuracy was identified and rectified. This process also identified any gaps where the point selection routine failed to establish a point. The operator interactively set any missing points. 5. The control and pass point measurement data was run through a final adjustment on the Z/I SSK PhotoT workstations. The PhotoT program created a results file with the RMSE results for all points within the block and their relation to one another. The photogrammetrist performing the adjustments used their experience to determine what course of action to take for any point falling outside specifications. 6. The bundle adjustment was run through the PhotoT software several times. The photogrammetrist increased the accuracy parameters for each subsequent iteration so, when the final adjustment was run, the RMSE for the project met the accuracy of 1 part in 10,000 of the flying height for the horizontal position (X and Y) and 1 part in 9,000 or better of the flying height in elevation (Z). The errors were expressed as a natural ratio of the flying height utilizing a one-sigma (95%) confidence level. 7. The accuracy of the final solution was verified by running the final adjustment, placing no constraints on any quality control points. The RMSE values for these points must fall within the tolerances above for the solution to be acceptable. 8. The final adjustment generates three files. The .txt file has all the results from the adjustment with the RMSE values for each point measured. The .XYZ file contains the adjusted X, Y, Z,coordinates for all the measured points and the .PHT file contains the exterior orientation parameters of each exposure station.",
            "EarthData has developed a unique method for processing lidar data to identify and remove elevation points falling on vegetation, buildings, and other aboveground structures. The algorithms for filtering data were utilized within EarthData's proprietary software and commercial software written by TerraSolid. This software suite of tools provides efficient processing for small to large-scale, projects and has been incorporated into ISO 9001 compliant production work flows. The following is a step-by-step breakdown of the process. 1. Using the lidar data set provided by EarthData, the technician performs calibrations on the data set. 2. Using the lidar data set provided by EarthData, the technician performed a visual inspection of the data to verify that the flight lines overlap correctly. The technician also verified that there were no voids, and that the data covered the project limits. The technician then selected a series of areas from the dataset and inspected them where adjacent flight lines overlapped. These overlapping areas were merged and a process which utilizes 3-D Analyst and EarthData's proprietary software was run to detect and color code the differences in elevation values and profiles. The technician reviewed these plots and located the areas that contained systematic errors or distortions that were introduced by the lidar sensor. 3. Systematic distortions highlighted in step 2 were removed and the data was re-inspected. Corrections and adjustments can involve the application of angular deflection or compensation for curvature of the ground surface that can be introduced by crossing from one type of land cover to another. 4. The lidar data for each flight line was trimmed in batch for the removal of the overlap areas between flight lines. The data was checked against a control network to ensure that vertical requirements were maintained. Conversion to the client-specified datum and projections were then completed. The lidar flight line data sets were then segmented into adjoining tiles for batch processing and data management. 5. The initial batch-processing run removed 95% of points falling on vegetation. The algorithm also removed the points that fell on the edge of hard features such as structures, elevated roadways and bridges. 6. The operator interactively processed the data using lidar editing tools. During this final phase the operator generated a TIN based on a desired thematic layers to evaluate the automated classification performed in step 5. This allowed the operator to quickly re-classify points from one layer to another and recreate the TIN surface to see the effects of edits. Geo-referenced images were toggled on or off to aid the operator in identifying problem areas. The data was also examined with an automated profiling tool to aid the operator in the reclassification. The data were separated into a bare-earth DEM. A grid-fill program was used to fill data voids caused by reflective objects such as buildings and vegetation. The final DEM was written to an ASCII XYZ and LAS format. 7. The reflective surface data were also delivered in ASCII XYZ and LAS format. 8. Final TIN files are created and delivered.",
            "This process describes the method used to compile breaklines to support the lidar digital elevation model data. Around the perimeter of the lidardata set to complete the surface model, breaklines were photogrammetrically derived . The following step-by-step procedures were utilized for breakline development. The breakline file contains three dimensionally accurate line strings describing topographical features. The relationship of lidar points to breaklines will vary depending on the complexity and severity of the terrain. Breaklines were collected where necessary to support the final product. Examples of some such locations include along the edges of roads, stream banks and centerlines, ridges, and other features where the slope of the terrain changes. 1. Using the imagery provided by EarthData Aviations, breakline data was captured in the MicroStation environment, which allowed the photogrammetrist to see graphically where each lidar X, Y, and Z point and any breaklines fall in relation to each other. This unique approach allowed for interactive editing of the breakline by the photogrammetrist. The technician generated a set of temporary contours for the stereo model in the ZI work environment to provide further guidance on the breakline placement. The technician added and/or repositioned breaklines to improve the accuracy as required. Once these processes were completed, the temporary guidance contours were deleted, and the data were passed to the editing department for quality control and formatting. 4. The breakline data set was then put into an ESRI shape file format 5. The 1 foot contours were generated in Microstation (using 2 foot specifications) with an overlay software package called TerraSolid. Within TerraSolid, the module Terramodler was utilized to first create the tin and then a color relief was created to view for any irregularities before the contour generator was run. The contours were checked for accuracy over the DTM and then the Index contours were annotated. At this point the technician identified any areas of heavy tree coverage by collecting obscure shapes. Any contours that were found within these shapes do not meet Map Accuracy Standards and are coded as obscure. The dataset was viewed over the orthos before the final conversion. The contours were then converted to Arc/Info where final QC AMLs were run to verify that no contours were crossing. The contours were delivered in shp format as a merged file.",
            "The NOAA Coastal Services Center (CSC) received the files in ascii format. The files contained LiDAR elevation (x,y.z). The data were in state place Florida West (0902, feet) coordinates and NAVD88 (Geoid03) vertical datum (feet). CSC performed the following processing for data storage and Digital Coast provisioning purposes: 1. The ascii files were parsed to LAS format. 2. The LAS files were retiled to a larger geographic footprint and all points were reclassified to class 2 (ground) 3. The points were convereted from State Plane Florida West (0902) coordinates to geographic coordinates. 4. The data were converted from NAVD88 (orthometric) heights to GRS80 (ellipsoid) heights using Geoid03. 3. The data were sorted by time. 4. The data were converted to LAZ format.",
            "The NOAA National Geophysical Data Center (NGDC) received lidar data files via ftp transfer from the NOAA Coastal Services Center. The data are currently being served via NOAA CSC Digital Coast at http://www.csc.noaa.gov/digitalcoast/. The data can be used to re-populate the system. The data are archived in LAS or LAZ format. The LAS format is an industry standard for LiDAR data developed by the American Society of Photogrammetry and Remote Sensing (ASPRS); LAZ is a loseless compressed version of LAS developed by Martin Isenburg (http://www.laszip.org/). The data are exclusively in geographic coordinates (either NAD83 or ITRF94). The data are referenced vertically to the ellipsoid (either GRS80 or ITRF94), allowing for the ability to apply the most up to date geoid model when transforming to orthometric heights."
        ]
    ],
    "pageTitle": "Docucomp ISO19115Components-HTMLTable",
    "title": "",
    "url": "http://www.ngdc.noaa.gov/docucomp/page?xml=NOAA/NESDIS/NGDC/MGG/Lidar/iso/xml/fl2004_swfwmd_citruscounty_be_m2553.xml&view=ISO19115Components-HTMLTable&altview=none",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989043.35/warc/CC-MAIN-20150728002309-00129-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 605170747,
    "recordOffset": 605154545,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "MD_DataIdentification Aggregation Info | Bands | Citations | Constraints | Coverage Descriptions | Dimensions | Extents | Formats | Geographic Bounding Box Georectified Information | Georeferenceable Information | Identifiers | Instruments | Mediums | OnlineResources | Operations Platforms | Process Steps | Range Elements | Reference Systems | Responsible Parties | Series | Sources | Spatial Grids | Temporal Extents Metadata Identifier: gov.noaa.csc.maps:fl2004_swfwmd_citruscounty_be_m2553Get DataFAQHTML, 19139 XML Assess Metadata For: Completeness, DOI Readiness, CSW Readiness, Components ISO Table ViewBack to Collection NOAA/NESDIS/NGDC/MGG/Lidar View Metadata As: , , } background-color:#F0F0F0; th{ } empty-cells:show; table{",
    "textAfterTable": "LIDAR Acquisition of Citrus County, FL 2004-03-16 2 None 1 North American Datum 1983 2007-01-19 1 Report of Survey - SWFWMD, Citrus County, FL 2004-04-21 Top CI_Series none found Top CI_ResponsibleParty Count Component Individual Organization Position Email Role Linkage 1 resourceProvider http://www.epsg-registry.org/export.htm?gml=urn:ogc:def:crs:EPSG::4269 1 NOAA CSC (originator) DOC/NOAA/NOS/OCM > Office for Coastal Management, National Ocean Service, National Oceanic and Atmospheric Administration, U.S. Department of Commerce coastal.info@noaa.gov originator http://coast.noaa.gov 1 NOAA CSC (publisher) DOC/NOAA/NOS/OCM > Office for Coastal Management, National Ocean Service, National Oceanic and",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}