{
    "relation": [
        [
            "Categories",
            "Great for these types of students",
            "Tips for prospective students",
            "Bang for the buck",
            "Am enjoying being here",
            "Am learning a lot"
        ],
        [
            "Comments",
            "Students that actually know how to balance fun and school work.",
            "Please take the placement test seriously if you need to take it. I did not take it serious and had to take pre-tech classes and had to learn about things I already learned about in high school. Also study AT LEAST two days before an exam to make sure you know the material well enough to pass.",
            "You will gain a great deal from your Towson University experience. From the classroom to events and activities outside of campus you will learn a lot and have a great time doing it.",
            "I had no idea that Towson University would be as fun of a campus as I did once I actually found out. They send you emails about activities and events they have on campus and they are actually pretty fun!",
            "I am impressed with the education I received so far as a student. I am getting a good deal of information from my classes. I also have not had too many problems with professors since I do my work and listen closely. As for professors with foreign accents, if they say something I do not understand I just ask them to repeat it."
        ]
    ],
    "pageTitle": "Towson University Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Towson-University/reviews?_escaped_fragment_=/show/22522",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986423.95/warc/CC-MAIN-20150728002306-00221-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 890932187,
    "recordOffset": 890835226,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{322746=Like any school, Towson has their minor crime incidents, but it is never anything too serious. Towson has their own Police department and they are very helpful if you need them. Between the hours of 2:30-6:30 Towson Police Department, or TUPD, offers a point to point campus transportation service called 'Safe Ride'., 7588=I would suggest taking a tour or visiting the campus before enrolling, that will really tell you if you belong. Also i would suggest going to the on campus events, at least for the first month. In September they have a month with things to do everyday. Freshman are given a carnival which is fun to go to for at least a little while. And although many freshman don't want to take part in the planned activities on their Dorm Floor i would suggest going. I had a lot of fun on my floor and is how i made my first friends., 42613=This campus is beautiful. Period. The construction that has been taking place on Towson University since 2008 have turn this campus from a historical landmark to the cutting edge of new architectures and pleasant environments. IN the fall, the campus comes to life with the colors of the changing season. In the winter, Towson transforms to a cool snowy paradise. In the spring and summer, Towson comes to life with activities and new and interesting people to meet. There is never a dull moment on this campus!, 111280=i hope soooo. im supposed to attend a tour on Oct.29th!, 304312=Towson looks like the perfect fit for me, im visiting the open house on october 20th, anyone else going?, 396948=Lot's of Greek Life on campus. I plan to pledge next September., 327168=Most of the dorm rooms at Towson are very large. They just opened a new dormitory and are opening another in the Fall of 2013. On another side of campus called West Village, there are dorms which are built to resemble Hotel style living. Whichever dorm you live in, your overall experience will depend on what you make it out to be., 63743=Towson offers small class sizes; usual student to faculty ratio is about 30:1. Most of the buildings are very close together, which makes for a (somewhat) easy trek between classes. It also offers helpful facilities for students to explore. As a business major, I would recommend Towson. Overall, teachers are encouraging, the CBE is AACSB accredited, but facilities (like parking and computers) are horrible.When in doubt, check out the school for yourself., 541132=© 2015, Cappex.com, LLC}",
    "textBeforeTable": "07/09/2009 Reviewer is A past student here. 35 out of 35 people found this review useful. 1 of 130 Brittany from Chesapeake City, MD Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 }",
    "textAfterTable": "Great for these types of students Students that love to be apart of campus life and work hard academically. Tips for prospective students Definitely check out the campus and talk to current students and faculty. That will help make your decision right on the spot. Bang for the buck It is a little expensive compared to my former college but that is considering I am out of state. But not too overly expensive that I am having trouble paying for tuition. Will enjoy being here Absolutely. I already met a few people from my orientation that I have kept in touch with through facebook. The campus is absolutely gorgeous and is in walkable distances to the local strip where there is a starbucks, movie theater, mall, and over 100 restaurants. Also only 20 minutes away from downtown baltimore. The harbor is so nice and many great activities to do. I am also living in the apartments which have a full kitchen/ living room and 1 and a half bathrooms. Will learn a lot I recently transferred from a 4 year public college closer to my home, to Towson University mainly because of their Business Program.",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}