{
    "relation": [
        [
            "Categories",
            "Campus Safety",
            "Clubs and Activities",
            "Share any unusual traditions or locations on campus",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "I feel campus is really safe. Right between the two freshmen dorms is where Public Safety is located. They also patrol the area and have these things where if you're walking and don't feel safe, you just press a button and public safety will come to that location and either drive you or walk with you to where you need to go.",
            "There are lots of clubs but if you want to be a part of one, you definitely have to search for them. Most of them are involved in a lot of things and regularly plan activities.",
            "One tradition is that if the BSU football team wins their homecoming game, they all jump in the lake right after the game. It was really fun to watch them do it.",
            "For fun I go to hockey games or hang out with friends in the dorms. There are also other sporting events you can attend but I haven't yet.",
            "The food at the Northwoods Dining Center (aka Wallies) is pretty good. They have pretty much anything you want to eat plus a homecooked meal each lunch and dinner and a special bar type thing each day. It's also a buffet. There's a convenience store in the same building that has pretty much anything you would expect a convenience store to have. Lakeside food court is also good. There are multiple places you can go and get food; like I said, it's a food court. They just added two new places this semester, actually.",
            "I personally don't like the dorm life. The rooms and bathrooms are nice, there's a kitchen on each floor and the FYRE (first year residential experience) program is great. They plan activities for freshmen throughout the year and they're all free except for hockey games. The floors can get noisy sometimes but that's to be expected. The rooms are small, too, but it's just something you get used to. No freshman dorm room is big. The RA's are great and are there if you need anything!",
            "It's definitely college work but if you did your stuff in high school and are serious about your college education, you'll do just fine.",
            "Visit! Definitely visit and do it twice if you feel you need to or if you're not sure. Ask lots of questions about everything; financial aid, jobs, dorm life, food, classes, etc. Stay on top of things like financial aid and registering for classes. Apply for scholarships; there are a lot you can get through the school. If you don't understand the website or can't find something, call admissions or the department you're trying to get information from.",
            "I would rate BSU as a four out of five."
        ]
    ],
    "pageTitle": "Bemidji State University Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Bemidji-State-University/reviews?_escaped_fragment_=/show/75865",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989043.35/warc/CC-MAIN-20150728002309-00173-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 917207007,
    "recordOffset": 917165884,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{157755=© 2015, Cappex.com, LLC, 27587=Make sure you like the cold or can withstand it. Don't rely on the heated underground tunnels if you don't like the cold...one section is closed this year and there is one spot where there is no tunnel, so you do get exposed to the cold some if you walk between Tamarack and Linden or between Decker and the class buildings. If you were coming here for arts, consider all other options or make sure your major is still offered since many arts are being cut or combined into one major...theatre is gone after spring 2012. Bemidji accepts most applicants so there is no fear of being rejected. Don't rely on emailing anyone for stuff...if people don't answer your questions, bug them in person or call until they respond. And don't assume you can skip, because these teachers are serious and some take attendance or hand out in-class assignments that you can't make up if you miss them. Also, and this is super important: DON'T GET A MEAL PLAN--GET BEAVER BUCKS. The place you can use your meal plan is too far from class buildings, and you'll find yourself eating at the food court or buying things from the C3 and wasting your meal plan and buying more beaver bucks. Just save yourself the hassle and get beaver bucks, please.}",
    "textBeforeTable": "10/18/2009 Reviewer is A current student here. 6 out of 6 people found this review useful. 1 of 34 Kayetoinette from Bemidji, MN Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5",
    "textAfterTable": "Tips for prospective students If you are looking at Bemidji State make sure before you commit that the small school atmosphere is what you want. Some students complain about not having stuff to do and they are always bored, but if you are willing to make friends with new people and find stuff to do then what you get out of your experience relies on what you put in. Bang for the buck One of the reasons I was so attracted to Bemidji State when I was looking at schools was the fact that for a state university they offer all the qualities of big state schools in this neat little package that is Bemidji. Sometimes I do feel like I'm at a private college because the campus is so small and interconnected. Am enjoying being here I LOVE Bemidji State. I've met the coolest people through classes and playing intramurals. I'd say about 90% of the campus population is from Minnesota which makes it easy to find friends from the same area as you. Am learning a lot In each of my classes I picked for fall semester there was a different tone of learning in the class. My math class",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}