{
    "relation": [
        [
            "Categories",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "We have loads of clubs and activities to get involved in. There is something here for everyone.",
            "Goudy food is hit or miss. There are days when it's great but other days....",
            "I really like my dorm. I've met some great people here and I can't think of any people who are horrible to live near.",
            "It basically depends on your professors and what classes you are going to take.",
            "The professors really do care about their students and work with them to make sure they succeed. It's a lovely campus and Salem is a nice town to go explore.",
            "Willamette University is a really gorgeous campus and it has some great professors. The tuition is a bit expensive but the financial aid offers balance the expense out pretty well."
        ]
    ],
    "pageTitle": "Willamette University Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Willamette-University/reviews?_escaped_fragment_=/show/97747",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986423.95/warc/CC-MAIN-20150728002306-00249-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 908569947,
    "recordOffset": 908524796,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{108308=Mill Streaming: people get dumped into the stream that cuts through campus on their birthdays. Sorry for those Winter Babies! Don't Step on the Seal in front of the Library: You will fail your next test! Star Trees: apparently these trees are the tallest trees on NW campuses. There's a Star Tree Lighting ceremony every December, and if you kiss someone under the star trees, you will get married. Rumored to be true., 163304=© 2015, Cappex.com, LLC, 83453=On your birthday watch out! Your friends will try and throw you into the Mill Stream which runs through campus and it can be awfully cold! Also, if you are around on Spring Preview Day in April, expect to see student streakers, mostly seniors, welcoming you to the university at lunchtime.}",
    "textBeforeTable": "07/16/2009 Reviewer is A current student here. 8 out of 8 people found this review useful. 1 of 38 Aaron from Salem, OR Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp",
    "textAfterTable": "Tips for prospective students The best advice I can give to a student is to come check out the campus. Willamette has many visiting days, where there will be many prospective students as well as the experience to come at any time of the year and spend the day with a student and experience life here at Willamette. Bang for the buck Although the main drawback for coming to Willamette for me personally was money, I feel that every cent spent here is well worth it. There has not been a single moment at my time here that I have thought that I had made the wrong decision, and that, combined with my education and experiences, makes Willamette truly worthwhile. Am enjoying being here The community at Willamette is simply amazing. I find enjoyable people everywhere I go. Friends can be found in all sorts of places, from our over 100 clubs, classes, or simply hanging out at the Bistro or in a lounge at one of the dorms. Am learning a lot Each day at Willamette I have anywhere from two to five hours of class, at least this semester, and for each class I come out learning something new. Of course",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}