{
    "relation": [
        [
            "Categories",
            "Campus Safety",
            "Greek Life",
            "Bang for the buck",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "campus is pretty safe, nothing bad really ever happens here. as i stated before it's a really quiet peacefull environment, and besides everyone is typically friendly here.",
            "there are multiple greek organizations on campus. they have a strict no-hazing policy to abide by, so that will not be much of a problem. if you are someone who is definitely outgoing and personable, then i would consider joining a fraternity or a sorority",
            "things are pretty cheap here in daytona, so being on a budget will not be a problem. plus, everything is in close range of the campus.",
            "they are mutiple student organization on campus that holds events during the semester, primarily for freshman enjoyment. there is also the beach that is close by and a board walk with rides. there are also a few theme parks around along with the daytona nascar center. restaurants, movies, shopping, clubs, are all at your service.",
            "food here is not the best i must say. the best meals of the day would be breakfast and lunch; dinner has it moments. if your not a morning person like me, then you definitely want to try and catch lunch, or if you do not like the gourmet services that they provide you can always buy food from restaurants or the grocery store and store it inside your room.",
            "dorm life is ok, it can be tricky at times depending on the type of dorm you stay in. the best dorm would be the newly renovated dorms which will cost a little more than the regulars ones but it will be worth it. some dorms have community bathroom while others have a suite bathroom which simply means four persons to one bathroom. the rooms are pretty decents but they are not that big, so keep that in mind.",
            "professor can be really strict and adamant about student involvement in their academic work. classes can be really demanding at times, such as buying the right materials for the course, homework, labs, and depending on the professor you have outside involvement such as community services and other required forums; but as long as you try your best it will be fine.",
            "a really important tip would be, focus on your school work. always try and get your assignments done on time and handed in early, because it is so easy to slack off and be procrastinator. at bethune-cookman they are strict enforcer of students academic progression.",
            "if you are looking for a school with diversity and charisma, then this is definitely the school for you. the students and staff are extremely respectful and welcoming. it’s as if you’re away from home, but you are still at home, with such a cool laid back atmosphere you’re bound to fit right in."
        ]
    ],
    "pageTitle": "Bethune-Cookman University (B-CU) Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Bethune-Cookman-University/reviews?_escaped_fragment_=/show/100557",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986423.95/warc/CC-MAIN-20150728002306-00126-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 913214063,
    "recordOffset": 913120439,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{458503=The food is up there with Momma Nem, excuse my poor grammar but its just that good., 531360=Freshman have a certain time that you to be in your hall or else youll get fined $1000 and you dont want that on your school records. You share with a roomate depened on which dorm your stay in there only one co-ed dorm hall but thats for all the 4.0 students who has good grade., 551578=© 2015, Cappex.com, LLC, 246020=Well Founded in 1904 by Dr. Mary McLeod Bethune, B-CU has become a leading institution of higher education, so I think that qualifies as a tradition to college students being allowed the right to higher their education and better themselves., 320268=ill tell you when i get there in the spring of 2013, 184115=The food has made a major turn around. Fall semester 2012-2013 the food wasn't too good but came fall semester we had a new dining company and a new addition called wow cafe, which is open passed cafeteria hours and offers different food. Also in the fall our school added a starbucks, which is awesome since i'm a big starbucks fan. I school is private so its doing the best that it can and with that i am highly appreciative., 243804=I received several forms about the greek life at Bethune.Membership in a fraternity or sorority is a good step toward enjoying all the benefits that college life has to offer. A fraternity or sorority chapter is also a way to make the campus feel more like a home. Collectively, fraternities and sororities constitute one of the largest student groups on campus. Fraternities and sororities are about friendships, scholarship, community service, brotherhood, sisterhood and leadership. It's about bettering the B-CU community and the city of Daytona Beach through service and social functions. It's about traditions, learning valuable lessons, and establishing life-long friendships. It's about shaping the identity of a continued greek life presence since 1948., 510585=There are many events to look forward to. For example, there is the Florida Blue Classic in November. This game is held against Florida A&M and is something you would not want to miss., 246553=I am a very positive Teenager and my family doesn't have the greatest of incomes with both my parents being on disability so I am struggling to pay for school and apply for scholarships. I haven't received one scholarship left but as Jesus stated never lose your faith in God. So I keep trying, I hear alot about how amazing Bethune Cookman college is and I look forward to attending their school in august. Thank you for your time and God bless, 266937=Bethune-Cookman University is a dream school i've always wanted to attend since my childhood days. My aunt is a Bethune-Cookman Alumni she graduated their in 2000 she gives me facts and opinion about this instituion and how i'll enjoy myself and education is great at this college also theirs great fields of study that will grasp my interest. They also offer everything that i need of a major., 10755=If your a penny pincher, Bethune Cookman is not the place for you, at all. I believe the reason to it being a private school makes Bethune-Cookman $12,000+ not including your everyday personal commmitments, necessities, or wants per semester. Multipliying that by two EASILY towers over the $24, 000 dollar mark for tuition. Thankfully, my financial aid covers atleast 95% of that which leaves me to cover about 2000 dollars on a payment plan per full school year which is a little, but still a lot paying out the pocket especially with a SINGLE mother still at home taking care of another child. Unfortunately, this is not the case for everyone attending The Great Bethune Cookman, I've already lost many easily met, close friends due to financial cituations, whos aid didn't cover as much as mine or any at all., 321419=An C school from what i heard but i will be attending in the spring of 2013, 466381=walk of faith every day at 10:20 church every wednesday party before games, 242733=To better inform you on campus safety I took the liberty of typing out word for word the safety form I received about Bethune.Campus Security Mission and Vision Bethune-Cookman University (B-CU) Office of Safety and Security will provide a safe and secure campus environment through collaborative, innovative, proactive and professional law enforcement and security initiatives that follow a community policing model of law enforcement. Services Available The B-CU Office of Safety and Security Department has a Crime Prevention Outreach Specialist that conducts crime prevention programs for students, faculty, staff and the community. Some of the most popular programs include: conflict resolution and intervention, residence halls and campus crime watch, and safety tips programs. For information about any prevention programs or activities, call the Crime Prevention Office at (386) 481-2466.}",
    "textBeforeTable": "07/12/2009 Reviewer is A current student here. 44 out of 45 people found this review useful. 1 of 132 Johnua from Jacksonville, FL Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp",
    "textAfterTable": "Tips for prospective students Bethune Cookman University is a school that can be sort of easy to get distracted from your school work especially if you are a freshman. So the best thing you can do is come in and focus on your books. Its alright to have fun just make sure that you are get your school work done first because it is hard to bounce back once you fall off in your books. Bang for the buck Bethune Cookman University is a little bit expensive being that it is a private institution. This is what causes a lot of student to change their minds about attending, but there are many scholarships and grants available to help you pay for school here at Bethune Cookman. You just have to apply for them. Yeah I admit when I saw the price of tuition I almost fainted too but advisers at Bethune helped me find solutions to help me pay for the expenses of college and after I got help I realized that it wasn't too bad. Am enjoying being here I am really enjoying my experience there. The campus life is awesome. The students interact well with each other and there is always something going on if you ever get bored or need something to do.",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}