{
    "relation": [
        [
            "Team",
            "Broadbent&Associates",
            "Game Over",
            "Just For Fun",
            "BP",
            "Goin Postal",
            "Shenanigans",
            "No Mercy (Rule)",
            "No Glove No Love"
        ],
        [
            "W",
            "11",
            "10",
            "6",
            "6",
            "5",
            "5",
            "2",
            "2"
        ],
        [
            "L",
            "1",
            "2",
            "5",
            "6",
            "6",
            "7",
            "10",
            "10"
        ],
        [
            "T",
            "0",
            "0",
            "1",
            "0",
            "1",
            "0",
            "0",
            "0"
        ]
    ],
    "pageTitle": "COMMUNITY SPORTS - 04/07/10 | Las Vegas Review-Journal",
    "title": "",
    "url": "http://www.reviewjournal.com/sports/community-sports-040710",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986423.95/warc/CC-MAIN-20150728002306-00297-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 680887259,
    "recordOffset": 680857015,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{85294=TENNIS USTA Super Senior League Intermountain Section Championships At Las Vegas The champions from each division will compete in the national championships. 6.0 Women Champions: Highlands Ranch, Colorado – The Recreation Center At Northridge Finalist: Boise, Idaho – Moses/Wikstrom 6.0 Men Champions: Boise, Idaho – Miller/Davis Finalist: Thornton, Colorado – Eastlake Village CTA 7.0 Women Champions: Denver Colorado – Gates Tennis Center Blue Finalist: Las Vegas, Nevada – CSGV 7.0 Men Champions: Bozeman, Montana Finalist: Henderson, Nevada – MacDonald Ranch 8.0 Women Champions: Denver, Colorado – Gates Tennis Center Blue Finalists: Nampa, Idaho – Spin 8.0 Men Champions: Las Vegas, Nevada – Spanish Trails Finalist: Great Falls, Montana Signups CLARK COUNTY Free Youth Basketball Leagues Four Clark County Parks and Recreation centers recently received a donation by WalMart to offer free basketball leagues to children ages 6 to 8 and 9 to 11. Cambridge Recreation Center, 3930 Cambridge St.; Whitney Recreation Center, 5712 Missouri Ave. near Boulder Highway; Robert “Bob” Price Recreation Center, 2050 Bonnie Lane in northeast Las Vegas and Walnut Recreation Center, 3075 N. Walnut Road, near Cheyenne Avenue and Las Vegas Boulevard North, will host a seven-team league in each age group. League registration began March 1 and has been extended until leagues are full. Parents must register in person and bring a copy of their child’s birth certificate for proof of age. Participants will be treated to two weeks of skills clinics and assessments followed by a seven-week developmental league. The goal is for athletes to develop self-esteem and learn teamwork, commitment, work ethic, leadership and good sportsmanship in addition to the physical benefits of being involved in sports. Participating centers also are currently recruiting for volunteer coaches. Coaches must pass a background check and will be required to attend a National Youth Sport Coaches Association clinic to become certified. Those interested in practice days, registration and locations can call Cambridge at 455-8169, Whitney at 455-7576, Price at 455-7600 or Walnut at 455-8402. Recreation center locations also can be found online at accessclarkcounty.com/parks. Clark County Parks and Recreation also can be found on social networking sites such as Twitter and Facebook by visiting http://tinyurl.com/l87c4l. Adult Spring Softball, Flag Football and Basketball Leagues Adults who want to enjoy the weather and stay active can join one of four leagues this spring. The 2010 Spring II Adult Softball League, Spring Adult Softball Casino League, the Bombs Away Flag Football League and the Spring Basketball League will begin taking registrations in April for play beginning in April and May. General public registration for the Spring II Adult Softball League begins April 8 until filled. Returning teams from the previous season register prior to the open registration. The doubleheader league begins play the week of April 19. Play will take place at Sunset Park, Eastern Avenue and Sunset Road; Warm Springs Fields, Warm Springs Road and Eastern Avenue; and Paradise Recreation Center and Park, between McLeod Drive and Harrison Avenue just north of Tropicana Avenue. Co-ed teams are available for most skill sets. Cost is $460 for the season with a $13 per game umpire fee paid at the start of each game. Early risers, or severe night owls may like to enter the Adult Softball Casino League. Teams play at 6 a.m. on Mondays, Tuesdays and Wednesdays beginning the week of April 19. Registration for all begins at 9 a.m. April 5. Cost is $425 per team with a $13 per game umpire fee paid at the start of each game. Schedules can be picked up from 9 a.m. to 5 p.m. on April 15. Those who miss football season can test out their flag football skills with the Bombs Away Flag Football League. Registration for all teams begins at 9 a.m. April 15. Play will take place on Wednesday and Saturday evenings and Saturday mornings beginning May 3. Cost is $190 per team for an eight-week, nine-game program plus the tournament. Games are held at 45 minutes. The payment of a $20 per game, per team referee fee is required at the start of each game. Players can celebrate the end of March Madness with a little time under the hoops. The Spring Basketball League begins play on April 26. The 10-week session includes one weekly game on either Monday and Wednesday evenings at Paradise Recreation Center, or Thursday evenings at Cambridge Recreation Center, 3930 Cambridge St. near UNLV. Registration is $260 per team. Those interested in additional rules or information can contact the Sports Office at 455-8241 or visit the Web site at ccsportsnet.com. BASEBALL Las Vegas Coyotes The Las Vegas Coyotes Baseball Club is looking for a few select players for their 10- and 12-year-old teams. The Coyotes play baseball year-round in local leagues and tournaments throughout the southwest. For more information, or to request a tryout, visit the club’s Web site at lvcoyotes.com or call Frank at 419-5717. Peccole Phantoms Baseball Club The Peccole Phantoms competitive baseball club will be holding tryouts for its U8 division winter team. The boundaries for the program are consistent with Peccole Little League and will play Peccole Spring and Fall seasons, as well as club winter season. The Peccole Phantoms are seeking serious 7 and 8 year old players to add to its competitive little league baseball club team. For more information on tryout dates, schedules and locations, or club dues, contact Coach Warren at 885-8121. Private Hitting Instruction with UNLV coaches The UNLV baseball coaching staff is offering private hitting lessons to local players. For more information, call 895-2475. Las Vegas Sky Wolves Adult Baseball Program An 18+ adult wood bat team is currently looking for pitchers for the 2010 spring season. If you are interested in playing, please e-mail your information to wolves_baseball@yahoo.com. BIG LEAGUE DREAMS SOFTBALL AND SOCCER The new sports park is forming softball and indoor soccer leagues at its location on the east side of Freedom Park. Teams play $100 per team, plus $25 per player, which includes regular season, postseason, softballs and umpires. The facility is also registering indoor soccer teams. The cost is $100 per team, plus $25 per player, which includes nine games, playoffs and referees. For more information, call 642-4448, ext. 102. BASKETBALL Southern Nevada Basketball Association The SNBA is accepting registrations for its upcoming adult basketball leagues. The leagues are open to men, women, and high school-aged players. You may register as an individual or as part of a team. There are morning leagues on Saturdays and evening leagues on Tuesdays and Thursdays. Leagues are starting now and registration is ongoing. For more information, call Hank at 521-4638. FOOTBALL Wild West Football League Adult Tackle Football Several teams in the WWFL are looking for players. The league is an adult tackle football league that plays games at Fountain Park. For more information on the Cobras, call Coach Mike at 624-9004. For more information on the Henderson Wolverines, call Coach Kelly at 834-2025. GOLF Women’s SNGA Senior Amateur Championship The Women’s Southern Nevada Golf Association’s Senior Amateur Championship will be played May 3 and 4 at Boulder Creek Golf Club. The format is 36-hole stroke play, and limited to the first 60 paid entries. A $110 entry fee includes golf, cart, range balls, awards luncheon and prizes. The tournament is open to women at least 50 years of age as of May 3, with a verifiable Southern Nevada issued handicap. There is no handicap index limit, however, the maximum handicap strokes will be 36. Players will be flighted by age, but first place gross and net may come from any flight. Prize fund will pay at least 1/3 of each flight. Entries must be received by April 16. For more information, contact Sherry at 451-0745 (before 9 p.m.) or SherryJackson1@embarqmail.com, or visit the WSGNA Web site at wsnga.org. RUNNING TENNIS International Tennis Center The newly opened $15 million indoor facility offers tennis enthusiasts a chance to play even on the hottest days of the year. The facility offers locals court time for just $20 per person for singles and $10 per person for doubles players. Cardio tennis is also offered at the ITC. The group activity features drills that give players or all abilities a high energy workout. The first class is free to locals. The facility is located at the corner of Topaz and Oquendo, just a block east of Eastern. For more information, call 685-6038. TRACK AND FIELD Southwest Stallions The youth track and field club is looking for participants to join its cross country team. Runners should be between 11 and 18 years old. Practices are held at 6 p.m. at Desert Breeze Park on Tuesdays and Thursdays. For more information, call Coach O’Neal at 683-5085., 63541=GOLF Southern Nevada Golf Association MetLife Boulder City Team Amateur Net Division *—Won Tiebreaker *Trik Caspary/Eric Conway 132 Gerald Gates/Andreas Verzilli 132 Terry Henslee/Leo May 136 Frank Austin/Gregory Ladner 137 Tom Wieme/Robert Nelson 139 Scratch Division Steven Fink/Douglas Pool 133 Tyler Mays/Scott Wingfield 134 Alex Lyon/Mark Scott 143 Nick Roman/Chris Viravongsa 145 Eric Fitzsimmons/Jay Grybowski 145 Senior Net Division Jimmy Bradley/George Yocum 139 Jeff Critcher/Tim Heffner 140 Ed Beslow/Paul Francis 140 John Garrett/Kevin Parrish 141 Tony Caiazzo/Rex Reese 142 Senior Scratch Division Bob Martin/Jim Massey 143 John Garrett/Kevin Parrish 146 Tony Caiazzo/Rex Reese 146 Gary Lanzen/Allen Richardson 148 Ed Beslow/Paul Francis 148 Super Senior Net Division Dennis Gomez/Bill Scheer 128 Mike Bridges/Russell Gard 133 Sev Leoffler/Joe Mierau 137 Dave Delacy/Tom Khamis 138 Roy Smith/Joe VanRhyn 140 Super Senior Scratch Division Sev Leoffler/Joe Mierau 144 Mike Bridges/Russell Gard 147 Dave Delacy/Tom Khamis 150 Richard Mazur/Bill Montgomery 157 Dennis Gomez/Bill Scheer 161}",
    "lastModified": "Wed, 29 Jul 2015 11:49:13 GMT",
    "textBeforeTable": "BASKETBALL Southern Nevada Basketball Association Winter Men’s Basketball At Trinity City Impact Sports Center Western Conference Superleague COMMUNITY SPORTS - 04/07/10 Posted April 7, 2010 - 2:00am CLARK TOPS WESTERN IN GIRLS... Today at Santa Anita   Print           Sports Home » You are here   App Best of LV Nifty Nickel Shopping Holiday directory Service Directory Deals Coupons Legals Classifieds Homes Autos",
    "textAfterTable": "Young Money (John) 4 5 Legends (E.J.) 3 5 Bulldogs (Howard) 1 2 T-Baggers (Kyle) 2 6 Next (Don/Jasen) 1 4 Mayas (Angel) 1 7 Man-up (Dana) 1 7 Rebels (Gonzales) 0 3 Fast Break (Kasey) 0 7 Ballers (Dante) 0 7 Scores Young Money 51, Next 45 Legends 63, T-Baggers 61 Mob 67, No Mercy 66 HDMD 58, Pole Low54 Free Agents 89, Goose Neck 87 Mob 73, Free Agents 72 Next 73, Legends 65 Campbell 65, T-Baggers 61 Game Changers 53, HDMD 52 No Mercey 58, Pole Low 57 Old Timers 58, Bulldogs 41 Aria 49, Rebels 35 D-up 46, Mob 44, 2OT Game Changers 71, Campbell 54 Legends 48, Young Money 46 No Mercy 58, Handown Mandown 56 D-up 46, Legends 44 Handown Mandown 73, Legends 54 Young Money 60, Free Agents 50 Pole Low 70, T-baggers 45 Individual Scores Young Money 51 Next 45 YOUNG MONEY (51) C. Fairman 0, J. Wade 3, J. Jefferson 13, M. Caldwell 8, C. Spencer 14, D. Cole 6, C. Jordan 2. NEXT (45) D. Thomas 25, J. Taylor 8, R. Griffin 4, S. Chambers 7, E. Marshall 1, R. Heidelberg 0, A. Moore 0, B. Slatkin",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}