{
    "relation": [
        [
            "Towns.",
            "Caraccas",
            "Nueva Barcelona",
            "Portocabello",
            "(Paris"
        ],
        [
            "Years.",
            "1799",
            "1800",
            "1800",
            "1819"
        ],
        [
            "Population.",
            "45,000",
            "16,000",
            "9,000",
            "714,000"
        ],
        [
            "Oxen.",
            "40,000",
            "11,000",
            "7,500",
            "70,800)"
        ]
    ],
    "pageTitle": "Humboldt, Alexander von. 1819-1829. Personal narrative of travels to the equinoctial regions of the New Continent, during the years 1799-1804. By Alexander de Humboldt, and Aimé Bonpland; with maps, plans, &c. written in French by Alexander de Humboldt, and trans. into English by Helen Maria Williams. 7 vols. London: Longman, Hurst, Rees, Orme and Brown. Vol. 6, part 1.",
    "title": "",
    "url": "http://darwin-online.org.uk/content/contentblock?itemID=A597.6a&basepage=1&hitpage=107&viewtype=text",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989043.35/warc/CC-MAIN-20150728002309-00149-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 62241403,
    "recordOffset": 62007478,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{1=† This expression surely indicates the facility with which a canal might be traced. A slow ascent of from 40 to 50 toises may, indeed, become at length insensible. I found the great square of Lima 88 toises above the waters of the South Sea, yet, in going from Callao to Lima, this difference of level is scarcely perceived on a distance half as great as that from Cupica to the embarcadador of the Rio Naipi. The geographical position of Cupica is quite as uncertain as the position of the confluence of the Naipi with the Atrato; and this uncertainty appears less strange when we recollect that it extends over the whole southern coast of the isthmus of Panama, and that no mariners, furnished with exact instruments, ever run along the shore in sight of land, between the Capes of Charambira and San Francisco Solano. Cupica is a port of the province of Biruquete, which is but little known, and which the maps of the Deposito de hydrografico of Madrid place between Darien and the Choco de Norte. It took its name from that of a Cacique called Birù or Biruquete, who reigned over lands in the neighbourhood of the gulf of San Miguel, and who fought, in 1515, as an ally of the Spaniards (Herera, Dec., Vol. ii, p. 8). I have not seen the port of Cupica marked in any Spanish map, but have found Puerto Quemado ò Tupica, at 7° 15′ lat. (Carta del Mar de las Antillas, 1805. Carta de la costa occidental de la America, 1810.) A manuscript sketch in my possession of the province of Choco, confounds Cupica and Rio Sabaleta, lat. 6° 30′, yet, Rio Sabaleta is placed in the maps of the Deposito, south, and not north of Cape San Francisco Salano, consequently, 45′ south of Puerto Quemado. According to the map of the province of Carthagena, by Don Vicenti, London, 1816, the confluence of the Rio Napipi (Naipi ) is 6° 40′ lat. It is to be hoped that these uncertainties of position will soon be removed by observations taken on the spot.}",
    "TableContextTimeStampAfterTable": "{670031=Atlantic, the Alleghany Mountains, the course of the Mississipi, the Rocky Mountains, and the coasts of the South Sea, that divide the confederation into four natural sections. If the general maps that have hitherto been traced, had no other errors than those of absolute longitude, and in preserving the differences of relative longitude, they displaced equally with regard to Europe (for instance to the meridians of Paris or Greenwich), the five great lines we have just named, the area of the partial divisions would not be altered. In order to estimate the effects of these unequal displacings, I have compared on every map used for the calculation of surfaces, the longitude of New York, Pittsburg, the confluence of the Ohio and the Mississipi; and of Taos, a village of New Mexico, situated, so to speak, on the prolongation of the Rocky Mountains, and the bay of Nootka. The three first points are founded on the excellent observations of M. Ferrer. New York is 8° 22′ 34″ east of Morro of the Havannah, and this point being 84° 42′ 33″ by my observations of the satellites, and according to the occulations of M. Ferrer, 84° 42′ 43″ west of Paris, we may admit, for the absolute longitude of New York,76° 20′ 9″ (Conn. des temps, 1817, p. 320 and 339; and my Astr. Obs. Vol. 2, p. 108). The well determined longitudes of Pittsburg (82° 18′ 30″), of Albany (76° 4′ 45″), and of Lancaster (78° 39′ 30″) serve, by the proximity of these three points to the mountains; to contain within just limits the chain of the Alleghanies. The line of the Mississipi is fixed by observations made at the mouth of the Ohio (91° 22′ 45″), and at New Orleans (92° 26′ 15″). The chain of the Rocky Mountains which divides the country west of the Mississipi into two great sections, is not yet so accurately determined as to its longitude as the three preceding lines. I suppose Taos of New Mexico at 106° 50′; Lewis and Clarke place the central chain of the mountains in the parallel 45°, at 114° 46′; but, 15310=† The proteaceæ are not, like the araucaria, an exclusively southern form. (Kotzebue, Reise, vol. iii, p. 13.) We found the rhopala complicata, and the r. obovata, in 2° 30′ and in 10° of north latitude. See our Nov. Gen., vol. ii, p. 153., 610024=1° State of the Missions of Piritu in the province of Nueva Barcelona in 1799., 348645=Coffee. The small table-lands of from 250 to 400 toises high, that are frequent in the provinces of Caraccas and Cumana (in the Cordilleras of the shore and of Caripe), contain temperate situations extremely favourable to this plant. When it had been cultivated only 28 years, in 1812, the produce amounted to nearly 60,000 quintals. (See, on the consumption of coffee in Europe, Vol. iv, pp. 65—72)., 408483=* (See my Political Essay on New Spain, Vol. iv, p. 127). During the 25 years that preceded the year 1820, gold and silver were coined at Mexico to the value of 429,110,008 piastres. See above, p. 129., 294244=In that part of the viceroyalty occupied by the Brazilians on the east of the Uruguay, we must distinguish* between the limits recognized before the occupation of the Province of the Missions, on the north of the Rio Ibicuy, in 1801, and the boundaries established by the treaty concluded in 1821, between the Cabildo de Montevideo and the Captain-generalship of Rio Grande. The Province of the Missions is contained between the left bank of the Uruguay, the Ibicuy, the Toropi, a tributary stream of the latter, the Sierra de Saint Xavier, and the Rio Juy (a tributary stream of the Uruguay). Its, 370538=* The meat on the back is cut in slices of moderate thickness. An ox or cow, of the weight of 25 arrobes, produces only 4 to 5 arrobes of tasajo or tasso. In 1792, the port of Barcelona alone, exported 98,017 arrobes to the Island of Cuba. The average price is 14 realés de plata, and varies from 10 to 18. (There are 8 realés in a piastre.) Mr. Urquinasa estimates the total exportation of Venezuela in 1809, at 200,000 arrobes of tasajo., 561795=voyage of Madoc-ap-Owen, which took place in 1170! John Filson, in his history of Kentucky, has revived these tales of the first travellers; according to him, Captain Abraham Chaplain saw Indians arrive at the post of Kaskasky, and converse in the Welsh language with some soldiers who were natives of Wales. He also believes, that \"far off, to the west, on the banks of the Missouri, there exists a tribe which, besides the Celtic language, has also preserved some rites of the Christian religion.\" (Hist. of Kent. p. 122.) Captain Isaac Stewart asserts, that on the Red River of Natchitotches, at the distance of 700 miles above its mouth, in the Mississipi, near the confluence of the river of Post (?) he discovered Indians with a fair skin and red hair, who conversed in Welsh, and possessed the titles of their origin. \"They produced, in proof of what they said of their arrival on the eastern coast, rolls of parchment carefully wrapt up in otter-skins, and on which great characters were written in blue, which neither Stewart, nor his fellow-traveller Davey, a native of Wales, could decypher.\" (Mercure de France du 5 Nov. 1785.) These are, no doubt, the Welsh books recently mentioned again in the French journals. (Revue encyclopédique, No. 4, p. 162; and article Homme in the Dict. des sciences nat., Vol. xxi, p. 392.) We may observe first, that all these testimonies are extremely vague for the indication of places. The last letter of Mr. Owen, repeated in the journals of Europe (of the 11th February, 1819), places the posts of the Welsh Indians on the Madwaga, and divides them into two tribes, the Brydones and the Chadogians. \"They speak Welsh with greater purity than it is spoken in the principality of Wales (!) since it is exempt from anglicisms; they profess Christianity strongly mixed with Druidism.\" We cannot read such assertions without recollecting that all those fabulous stories which flatter the imagination are renewed periodically under new forms. The learned and judicious geographer of the United States, Mr., 64081=* William von Humboldt, on the comparative Study of Languages, and the different Epochs of their Development, 1821 (in German), p. 13. See also, vol. iii, p. 272; and vol. v, p. 295., 221896=PERU. The estimate of the population indicated in the table is not too high. The works printed at Lima (Guia politica del Vireynato del Perù parà el año 1793, publicada por la Sociedad academica de los Amantes del pays) estimated the population, thirty years ago, at a million of inhabitants, of which 600,000 were Indians, 240,000 mestizoes, and 40,000 slaves. The inhabited part of the country has a surface of only 26,220 square leagues; and a large and fertile part of Upper Peru has belonged ever since 1778 to the vice-royalty of Buenos Ayres., 18433=On the 13th of July we arrived at the village of Cari†, the first of the Caribbee missions, that are under the monks of the Observance of the college of Piritu‡. We lodged as usual at the convent, that is with the clergyman. We had, beside our passports from the captain-, 491889=* This small fort, taken by the English in 1665, is vulgarly called El Castillo del Rio San Juan. It is placed, according to Mr. Juarros, at 10 leagues distance from the eastern extremity of the laguna de Nicaragua. Another small fort was constructed in 1671, on a rock at the mouth of the river. It bears the name of Presidio del Rio de San Juan. Even in the 16th century, the Desaguadero de las Lagunas, had fixed the attention of the Spanish government, who ordered Diego Lopez Salcedo to found the town of Nueva Jaen, near the left bank of the Desaguadero, or Rio San Juan; but it was soon abandoned, like the town of Brussels (Bruselas), near the gulph of Nicoya., 76530=We arrived on the 15th of July at the Fundacion or Villa del Pao, founded in 1744, and placed very favourably to serve as a commercial station between Nueva Barcelona and Angostura. It's real name is el Concepcion del Pao. Alcedo, La Cruz Olmedilla, and many other geographers, have mistaken it's situation; confounding this small town of the Llanos of Barcelona either with San Juan Bauptisto del Pao of the Llanos of Caraccas, or with El Valle del Pao de Za-, 430705=the Caledonian canal, admit merchant vessels of heavy tonnage, and thirty-two gun frigates. It is, however, the practicability of this passage which is discussed in the project of cutting an isthmus in America. The pretended junction of the two seas, by the canal of Languedoc, has not spared the navigation a circuit of more than 600 leagues round the Spanish Peninsula; and, however admirable this hydraulic work may be which receives annually 1900 flat-boats, carrying from 100 to 120 tons each, it can only be considered as a means of inland carriage: since it very little diminishes the number of vessels that pass through the straits of Gibraltar. It cannot be doubted, that if at any given point of equinoctial America, either in the isthmus of Cupica, or in those of Panama, Nicaragua, or even Huasacualco, two neighbouring ports were joined by a canal of small dimensions, (of from 4 to 7 feet deep), it would produce great commercial activity. This canal would act like a rail-way, and small as it might be, would enliven and abridge the communications between the western coasts of America and those of the United States and of Europe. If even in time of war, the long and dangerous passage round Cape Horn has been generally preferred for the exportation of the copper of Chili, bark, the wool of the vigogne of Peru, and the cacao of Guayaquil, to the commercial, 510846=* It is 5,800 leagues from London to Canton, by Cape Horn; 1400 leagues more than by the Cape of Good Hope. From Boston to Canton by Cape Horn, is 5000 leagues., 353535=* The term Venezuela was employed in this sense at the installation of the congress at Angostura, February 15th, 1819, at which the deputies of Caraccas, Barcelona, Cumana, Varinas and Guyana were assembled. The maps of La Cruz and of Lopez use the terms, Province of Caraccas, and Venezuela, as synonimous. The captain-general, residing at Caraccas, and governing the country from the mouth of the Oroonoko as far as the Rio Tachira, was called Capitan general de la Provincia de Venezuela y Ciudad de Caracas. M. Depons, in his statistics, distinguishes the Capitania-general of Caraccas from the government of Venezuela, which, according to him, comprehends only the province of Caraccas. The Republic of Venezuela, founded July 5th, 1811, and restored August 16th, 1813, was united to the Republic of Cundinamarca (Dec. 17th, 1819), by the name of Columbia, and since that union the name of Venezuela has been again officially restrained (Feb. 1822) to a department comprehending the provinces of Caraccas and Varinas. Amidst these fluctuations there is a risk of confounding a country twice as large as Spain, with another less than the state of Virginia, if the precise sense in which the word Venezuela is employed, be not determined. Regarding this name as identical with that of Capitania-general of Caraccas, we obtain a collective designation for the whole eastern part of Columbia, and we may say Venezuela, as we do Mexico, Chili, or Peru., 69896=* Among the Hurons (Wiandots) and the Natchez, the succession to the magistracy is continued by the women: it is not the son who succeeds, but the son of the sister, or of the nearest relation in the female line. This mode of succession is said to be the most certain, because the supreme power remains attached to the blood of the last chief; it is a practice that ensures legitimacy. (Filson, p. 183.) I have found ancient traces of this strange mode of succession, so common in Africa and in the East Indies, in the dynasty of the kings of the West India islands. \"In testamentis autem quam fatue sese habeant intelligamus: ex sorore prima primogenitum, si insit, relinquunt regnorum hæredem; sin minus, ex altera, vel tertia, si ex secunda proles desit: quia a suo sanguine creatam sobolem eam certum est. Filios autem uxorum suarum pro non legitimis habent. Uxores ducunt quotquot placet. Ex uxoribus chariores cum regulo sepeliri patiuntur.\" Petr. Mart. Ocean., Dec. 3, lib. ix, p. 63, B., 321495=* The superficial extent of France, not comprehending Corsica, was estimated by the direction of the Cadastre, in 1817, at 51,910,062 hectares, or 5190 square myriameters, or 26,278 square leagues, 25 to a degree. M. Coquebert de Montbret reckons 442 square leagues for Corsica; consequently France with Corsica now contains 26,720 common square leagues, or 17,101 square leagues (20 to a degree). The population in 1820, having been 30,407,907, we find 1778 inhabitants to every square marine league. The average extent of a department of France is 198 square marine leagues; the mean population is 353,600. The number of inhabitants to the square league is, in most of the departments, 1000, 1200, 2400, and 2600. In taking the average of the five most and least peopled departments and governments of France and Russia, we obtain the proportion of the minimum and maximum of the relative population; in the former of these countries = 1:3,7; in the latter = 1:12,2., 437723=pica, on the coast of the South Sea, and the Rio Naipa, which empties itself into the Atrato, fifteen leagues above its mouth. A biscayan pilot, M. Gogueneche, called the attention of government to this point in the year 1799. Persons worthy of credit, who had made the passage with him from the Pacific Sea to the Embarcadere of Naipi, assured me that they saw no hill in that isthmus of alluvial earth, which they were ten hours in crossing. A merchant of Carthagena, South America, deeply interested in all that regards the statistics of New Grenada, Don Ignacio Pombo*, wrote to me in the month of February 1803:—\"Since yon ascended the Rio Magdalena to Santa-Fe, and Quito, I have never ceased to take informations respecting the isthmus of Cupica; there are, 300049=CHILI. The limits of Chili on the north are the desert of Atacama, on the east the Cordillera of the Andes, where the road of the couriers passes between Mendoza and Valparaiso, at the height, according to barometric measures taken in 1794 by M. d'Espinosa and Bauza, of 1987 toises* above the level of the sea. I took for the southern limit† the entrance of the gulf of Chiloè, where the fort of Maullin (lat. 41° 43′) is the most southern possession of Spanish America on the continent. The bays of Ancud and Reloncavi no longer present any fixed settlements of European colonists; there begin the Juncos, who are independent, not to say wild Indians. From these statements it results, that the European settlements extend much farther to the south,, 530=REVISION HISTORY: Transcribed (single key) by AEL Data, corrections by John van Wyhe 3.2011. RN2, 175097=America form together a population twice as numerous as that of English race. The French, Dutch, and Danish possessions of the new continent are of small extent; but, to complete the general view of the nations, which may have an influence on the destiny of the other hemisphere, we ought not to forget the colonies of Scandinavian origin, who are trying to form settlements from the peninsula of Alashka as far as California; and the free Africans of Hayti, who have accomplished the prediction of the Milanese traveller Benzoni in 1545. The situation of the Africans, in an island more than three times as big as Sicily, in the middle of the Mediterranean of the West Indies, augments their political importance. Every friend of humanity prays for the developement of a civilization, which advances in so calm and unexpected a manner. Russian America hitherto less resembles an agricultural colony, than the factories which the Europeans have established on the coast of Africa, to the great misfortune of the natives, presenting only military posts, stations of fishermen, and Siberian hunters. It is no doubt a striking phenomenon, to find the rites of the Greek church established in one part of America; and to see two nations, which inhabit the eastern and western extremities of Europe, the Russians and Spaniards, thus bordering on each other on a continent where they, 67136=‡ Views of the Cordilleras, and American Monuments, vol. i, p. 168; ii, p. 146. On the quippoes found at the Oroonoko, among the Tamanacks, see Gili, vol. ii, p. The quippoes of strings of the nations of Upper Louisiana are called wampum. (John Filson, Hist. of Kentucky, p. 102; Charlevoix, Hist. de la Nouv. France, vol. v, p. 308; Lepage de Prats, Hist. de la Louisiana, vol. ii, p. 196.) Anghiera relates (Ocean., Dec. 3, lib. 10, p. 65, D.) a very curious fact, which seems to prove, that the travelling Caribbees had some idea of bound books, like those of the Mexicans and our own. I have elsewhere made known (Views of the Cordilleras, vol. i, p. 174.) the curious discovery of rolls of paintings found on the banks of the Ucayale, among the Panoes. The Peruvians had also, beside the quippoes, hieroglyphical paintings similar to those of Mexico, but ruder. (Garcia, Origen de los Indios, p. 91.) Since the conquest painted pages have been used by them for confession. Perhaps the fugitive Caribbee, who came to Darien from the inland country, and of whom Anghiera makes mention, had had an opportunity of seeing at Quito, or at Cundinamarca, some Peruvian book. I employ, like the first Spanish travellers, the word book, since it by no means presumes the use of alphabetical writing., 2695=1826., 46655=† Arouaques. The missionary Quandt (Nachricht von Surinam, 1807, p. 47) calls them Arawackes., 73746=† \"The Caribbees are tall and plump; but are little disposed to be liberal, for they like to feed on human flesh, lizards, and crocodiles.\" (Descript. gén. de l' Amérique par Pierre d'wity, Seigneur de Montmartin, 1660, p. 118.), 264345=peaceful possession between bordering nations. It is customary to consider the whole southern bank of the Japura as Spanish, from the Salto Grande as far as the inland delta of the Abatiparana, where, on the northern bank of the Amazon, a marco de limites is placed, a stone which the Portuguese astronomers found in lat. 2° 20′, and long. 69° 32′. (Manuscript Map of the Amazon, by Don Francisco Requena, commissary of limits to his Catholic Majesty, 1783.) The Spanish missions of Japura or Caqueta, commonly called missions des Andaquies, extend no farther than Rio Caguan, a tributary stream of the Japura, below the destroyed mission of S. Francisco Solano. All the west of the Japura, south of the equator, from the Rio de los Enganos and the Great Cataract, is in the possession of the natives and the Portuguese. The latter have some small settlements at Tabocas, S. Juaquin de Cuerana, and Curatus; the second of which is on the south of the Japura, the third on it's northern tributary stream, the Apoporis*. According to the Portuguese astronomers, it was at the mouth of the Apoporis, in lat. 1° 14′ south, long. 17° 58′, (west of the meridian of Paris), that the Spanish commissioners were willing to place the stone of the limits in 1780, which denoted an intention of not preserving the marco of Abatiparana. The Portuguese commissaries opposed taking the Apoporis for the frontier, asserting, that, in order to cover the Brazilian possessions on the Rio Negro, the new marco ought to be placed at the Salto Grande del Japura (south lat. 0° 33′, long. 75° 0′). In Putumayo or Iça, the most southern Spanish missions (missiones baxas), governed by the ecclesiastics of Popayan and Pasto, do not extend as far as the confluence of the Amazon, but only to 2° 20′ of south latitude, where the small villages of Marive, S. Ramon, and Asumpcion, are situate. The Portuguese are masters, 486923=* In the collected locks we must add the floating prison, or the volume of water in which the ship floats, or is suspended in its passage from one lock to another. (Prony, in the works of M. Huene dc Pommeuse, p. 23.) The consumption of water is therefore greater in going up than descending. The distribution of the falls, or the height of the successive basins, have also an influence on the waste of water in a canal, as M. Gérard has recently shewn. (Annales de Physique et de Chimie, 1823, Tom. xxiv, p. 137, and Ducros, Memoires, p. 39.), 349065=Cotton. That of the vallies of Aragua, Maracaybo, and the gulf of Cariaco, is of a very fine quality, but the average exportation was not more than 2½ millions of pounds. (Vol. ii, pp. 69, 101, 191; Vol. iv, pp. 123—126; and Urquinaona, Relacion de la Revol. de Venezuela, 1820, p. 31.), 35264=† Fern. Col., Cap. 34; in Churchill's Coll., vol. 2, p. 536. Herera, Dec. I, p. 34., 408975=‡ The following is the series of anchorage, roads, and ports with which I am acquainted, from Cape Paria as far as Rio del Hacha; Ensenada de Mexillones; the mouth of the Rio Caribes; Carupano; Cumana (See above, Vol. ii, page 211); Laguna Chica, on the south of Chuparuparu (Vol. vi, p. 97); Laguna grande del Obispo (Vol. iii, p. 21; Vol. vi, p. 108); Cariaco, (Vol. iii, p. 198); Ensenada de Santa-Fe; Puerto Escondido; Port de Mochima (Vol. iii, p. 358; Vol. vi, p. 108); Nueva Barcelona (Vol. iii, p. 361; Vol. vi, p. 77); the mouth of the Rio Unare; Higuerote (Vol. iii, p, 370; Chuspa; Guatire; La Guayra (Vol. iii, p. 382); Catia; Los Arecifes; Puerto la Cruz; Choroni; Sienega de Ocumare; Turiamo; Burburata; Patenebo (Vol. iii, p. 402); Porto Cabello (Vol. iv, p. 201); Chichiribiche (Vol. iv, p. 204); Puerto del Manzanillo; Coro; Maracaybo; Bahia Honda; El Portete et Puerto Viejo; the island of Marguerita has three good ports, Pampatar, Pueblo de la Mar, and Bahia de Juan Griego. (Those printed in Italics are the ports most frequented.), 526421=1777. This union, which will be always indispensable for external safety, this centralization of powers in a country six times larger than Spain, has had political combinations for its motive. The calm progress of the new government has justified the wisdom of those motives, and the Congress will find still fewer obstacles in the execution of its beneficent projects for national industry and civilization, in proportion as it can grant more liberty to the provinces, and make them feel the advantages of institutions which they have purchased at the price of their blood. In every form of government, in republics as well as in tempered monarchies, ameliorations in order to be salutary must only be progressive. New-Andalusia, Caraccas, Cundinamarca, Popayan, and Quito, are not confederated states like Pensylvania, Virginia, and Maryland. Without juntas, or provincial legislatures, all those countries are directly subjected to the congress and government of Columbia. According to the constitutional act (art. 152), the intendants and governors of the departments and provinces are named by the president of the republic. It may be naturally supposed that such dependence has not always appeared favorable to the liberty of the communes, which tend to discuss themselves their local interests, and that it has sometimes occasioned debates which may be, 77=RECORD: Humboldt, Alexander von. 1819-1829. Personal narrative of travels to the equinoctial regions of the New Continent, during the years 1799-1804. By Alexander de Humboldt, and Aimé Bonpland; with maps, plans, &c. written in French by Alexander de Humboldt, and trans. into English by Helen Maria Williams. 7 vols. London: Longman, Hurst, Rees, Orme and Brown. Vol. 6, part 1., 240538=† As at the point where the Rio Jauru enters the Paraguay. See the Patriota de Rio Janeiro, 1813, N° 2, p. 54., 387404=III. TRADE OF LA GUAYRA, in 1794., 652392=state of barbarism which has long been erroneously believed to characterize the infancy of nations; all have fixed grammatical forms, for the parts essentially organic in an idiom are formed at the same time. (William de Humboldt, on the progressive development of languages, in the Memoirs de l'Académie Royale de Prusse, 1823.) The further we penetrate into the structure of a great number of idioms, the more we distrust the great divisions of tongues (by bifurcation) into synthetic and analytic. These classes, somewhat like the great divisions of organized bodies, present a deceitful simplicity, to which the naturalist begins to substitute a distribution by small numerous groupes, connected as if interwoven together. To ask if this multiplicity of idioms is primitive, or the effect of progressive deviation, is to enquire if that variety of plants that embellish the earth has always existed, or if (according to the hypothesis of the great naturalist of Upsal) the species have been diversified by mutual fecundation. Questions of this kind do not belong to history, but to the cosmogonic fables of nations., 342991=The most cultivated part of the province of Caraccas, the basin of the lake of Valencia, vulgarly called los Valles de Aragua*, counted, in 1810, nearly 2000 inhabitants to the square league; now, supposing a relative population three times less, and taking off from the whole surface of the Capitania-general nearly 24,000, 655601=(See Brackenridge, Voyage to South America, 1820, vol. ii. p. 47. Mr. Rodney, by different calculations, finds either 489,000, or 523,000. Message to the fifteenth Congress, 1818, p. 54.), 622536=This state of the population of 1799, was communicated to me, at Nueva Barcelona, by the president of the missions of Piritu. Among 24,778 inhabitants there are only about 1,500 whites (Espanoles) and mulattoes: all the rest of the population is of pure Indian race. An enumeration of 1792, believed to be more exact, yielded in 16 pueblos de mission:, 568661=Do the characteristic features of colossal stature, and white colour, attributed to nations now destroyed, owe their origin to the ideas of power and physical force in general, to the feeling of the intellectual preponderance of the Europeans, or are those features linked with the fables of white men, legislators, and priests, which we find among the Mexicans, the inhabitants of New-Grenada, and so many other American nations? The skeletons contained in the tumuli, of the trans-alleghanian country, belong, for the most part, to a stunted race of men, of lower stature than the Indians of Canada and the Missouri. (Archœologia Americana, Vol. i, p. 209.) The bodies found on the banks of the Merrimack, have even renewed in some authors, the fable of the pygmies, (Morse, Modern Geography, 1822, p. 211.), 110627=* \"Los lanos son como un mar de yerbas.\", 474076=* East India Shipping—return to the order of the House of Commons, London, 1823. I have reduced the English into French tonnage, the latter being 10 p. c. less., 405168=I shall add to these considerations some statistical statements little known, taken from a very recent memoir of the Consulado de la Vera Cruz. This document shews that Venezuela by its entire want of manufactures, and the small number of its indian inhabitants, presents in proportion to the respective population, a greater consumption of foreign articles than New Spain. In a period of twenty-five years, from 1796 to 1820, the importation* from the, 48347=consequence of an altercation on their religious rites, the Confachite-Caribbees were driven from Florida. They went first to the Yucayas or Lucayes islands (to Cigateo and the neighbouring islands); thence to Ayay (Hayhay, now Santa Cruz), and to the little Caribbee islands; and lastly to the continent of South America*. It is believed, that this event took place toward the year 1100 of our æra; but in this estimation it is supposed, as in certain fables of the east, \"that the sobriety and innocent manners of savages\" augment the mean term of a generation to one hundred and eighty or two hundred years, which renders the indication of a fixed epoch altogether imaginary. In the course of this long migration, the Caribbees had not touched at the larger islands; the inhabitants of which however, believed also, that they came originally from Florida†. The islanders of Cuba, Haïti, and Boriken (Portorico), were, according to the uniform testimony of the first conquistadores, entirely different from the Caribbees; and at the period of the discovery of, 497233=† Warden. Description of the United States, Vol. ii. p. 197. Morse, Modern. Geogr. 1823, p. 122. This canal, 294,590 toises long, is only 4 feet deep, (2/3 of that of Languedoc, of which the length is 123,730 toises.) The lake Erie is 88 times above the mean waters of the river Hudson. The boats first descend uniformly, by 25 locks, from Buffalo on the lake Erie, to Montezuma, on the river Seneca (passing by Palmyra and Lyon on a length 166 English miles), 30 toises of perpendicular fall; they then ascend 8 toises from Montezuma to Rome, on the Mohawk, for 77 miles, and finally, descend again 66 toises without discontinuing, by means of 46 locks, on a length of 113 miles, from Rome to Albany, on the river Hudson, passing by Utica. This latter descent is consequently 9 toises less than that made by the boats of the basin of partition of the canal of Languedoc in the Mediterranean. I shall again mention on this occasion, the maximum of the slope which I went up on a natural navigable line, in the bed of one of the greatest rivers of South America, destitute of cataracts and rapids. You go by rowing on the Rio Magdalena, from Carthagena to Honde, after having vanquished 135 toises of fall, which is one half more than the fall of the lake Erie to the river Hudson, and by the Magdalena, a navigable line, one third longer. In reflecting on the small slope of the Rio Magdalena de Morales at its mouth, we may conceive that without locks, a boat may proceed, by a natural navigable line, 80 marine leagues, on a table-land of 100 toises, which will give 44 of fall by 1000 toises of current., 57776=nent. They extend this assertion event to the independant hordes who wander on the east of the Esmeralda, between the sources of the Rio Branco and the Essequibo. We may conceive, that the fury and despair, with which the unhappy Caribbees defended themselves against the Spaniards, when in 1504 a royal decree* declared them slaves, may have contributed to the reputation they have acquired of ferocity. The first idea of attacking this nation, and depriving it of liberty and of it's natural rights, is owing to Christopher Columbus†, who, being a man of the fifteenth century, was not always so humane, as he is said to be in the eighteenth from hatred of his detractors. Subsequently the licenciado Rodrigo de Figueroa was appointed by the court in 1520, to decide which of the tribes of South America might be regarded as of Caribbee race, or as cannibals; and which were Guatiaos‡, that is, Indians of peace, and, 145839=We again passed some agreeable days, from the third to the fifth of November, at the peninsula of Araya, situate beyond the gulf of Cariaco, opposite to Cumana, and of which I have already described the pearls*, the sulphurous deposits, and the submarine springs of liquid and colourless petroleum. We were informed, that the Indians carried to the town from time to time considerable quantities of native alum, found in the neighbouring mountains. The specimens which were shown to us sufficiently indicated, that it was neither alunite†, similar to the rock of Tolfa and Piombino, nor those capillary and silky salts of alcaline sulphat of alumin and mag-, 669649=The population of free coloured people, in 1810, was 186,443; in 1820 it was 238,149, increase of 27½ p. cent., 495667=† L. c. p. 308. The keeping of this canal, from 1686 to 1791, has cost besides, the sum of 23 millions of francs, (Andreossy), Deber. du Canal du Midi, p. 289)., 499392=coast of the South Sea. In the year 1607, a subterraneous canal was dug 3400 toises long, and 12 feet high, on the north of Mexico, on the other side of the hill of Nochistongo. The viceroy, Marquis of Solinas, passed along half its length on horseback. The open trench (tajo de Huehuetoca) which now leads the waters out of the valley, is 10,600 toises long, of which a considerable part is dug in a moveable earth; it has 140 and 180 feet of perpendicular depth, and, towards the upper part, is from 250 to 330 feet broad. The expence of these hydraulic works* of the Desague of Mexico, amounted, from the year 1607, to the time when I visited them, in January, 1804, to the sum of 6,200,000 piastres. It is little to be apprehended that sufficient money would not be collected for opening an oceanic canal, when we recollect that the family of the Count de la Valenciana alone, had the resolution to dig four shafts† at Guanaxuato, which cost altogether more than 2,200,000 piastres. Even supposing that during a certain number of years, the annual expence, 62680=* Ocean., Dec. 3, lib. ix, p. 63, D. See also above, vol. v, p. 394., 523319=* Don Jose Maria del Castillo, in his report to the Congress of Bogota (5th May, 1823) estimates las rentas ordinarías at present, at only 5 millions of piastres., 472861=canal projected in central America, it might, I think, be even less than the depth of the Caledonian canal. Such is the change which the new systems of commerce and navigation have produced within 15 years, in the capacity or the structure of the ships most commonly employed in the intercourse with India and China, that in examining with attention the official list of vessels, which during two years (from July 1821 to June 1823), have traded from London and Liverpool to those two countries, we find, on a total of 216 vessels, two-thirds below 600 tons, one-fourth between 900 and 1400 tons, and one-seventh below 400 tons*. In France, the mean tonnage in the ports of Bordeaux, Nantes, and Havre, of vessels trading to India, is 350 tons. The nature of the operations undertaken in the most distant latitudes, determines the capacity of the vessels employed; for instance, to bring indigo from Bengal, it may appear sufficient, and even preferable, to send a vessel of 150 to 200 tons. The system of small expeditions is preferably adopted in America, where all the advantages are felt of prompt lading, and a rapid circulation of capital. The average size of the American vessels, 446649=ledge of the heights of the isthmus of Panama, the last labours of M. Fidalgo, and other Spanish navigators, have at least furnished more precise statements on its configuration, and the minimum of its breadth. This minimum is not 15 miles, as the first maps of the Deposito hydrografico indicate, but 25¾ miles (60 to a degree), that is, 8 2/3 marine leagues, or 24,500 toises; for the dimensions of the gulf of San Blas, called also Ensenada de Mandinga, on account of the small river of that name which flows into it, have given rise to great errors. This gulf penetrates into the land 17 miles less than was supposed in 1805, in taking the plan of the archipelago of the Islas Mulatas*. Whatever credit the last astronomical observations appear to merit, and on which the map of the isthmus is founded, published by the Royal Deposit of the Marine of Madrid in 1817, we must not forget that these operations comprehend only the northern coast, which appears never yet to have been connected either by a chain of triangles, or chronometrically (by the transport of time), with the southern coast., 496745=* Description de l'Egypt (Etat moderne), 1808, Tom. i, 50, 60, 81, 111. The ancient canal from the Red Sea to the Nile, (Canal des Rois), navigable, if not under the Ptolemies, at least under the Khalifs, was only a derivation of the pelusiac branch, near Bubaste; it had a developement of 25 leagues. Its depth was sufficient for ships of great bur-then, and that could navigate on the sea; it appears to have been at least from 12 to 15 feet., 453919=Atrato, and the Rio San Juan de Charambira. Persons accustomed to take accurate observations, if furnished only with barometers, instruments of reflection, and time-keepers, might in a few months solve problems, which, during, centuries, have interested all the commercial nations of both worlds. If, in the enumeration of the countries which present advantages for the junction of the two seas, I have not passed over in silence the Isthmus of Choco, that is the platiniferous soil, extending from the river San Juan de Charambira to the Rio Quibdo, it is on account of its being the sole point on which a communication exists since the year 1788, between the Atlantic Ocean and the South Sea. The small canal of Raspadura, which a monk, the curate of Novita, caused to be dug by the Indians of his parish, in a ravine periodically filled by natural inundations, facilitates the inland navigation on a length of 75 leagues, between the mouth of the Rio San Juan, below Noanama, and that of the Atrato, which bears also the names of Rio Grande del Darien, Rio Dabeiba, and Rio del Choco*. During the, 299025=† The real name of this river, the banks of which were heretofore inhabited by the Abipons, is Rio Iñate. (See Dobrizhofer, Hist. de Abiponibus, 1784, Tom. ii, p. 14)., 152036=We set sail the 4th of November, at one in the morning, in search of the mine of native alum. I took with me the timekeeper, and my large Dollond telescope, to observe at the Laguna chica, east of the village of Maniquarez, the immersion of the first satellite of Jupiter; this design however was not accomplished, contrary winds having prevented our arrival before, 302278=† See above, vol. v, p. 842. The Brazilian limits, in the government of the Rio Negro, were examined by the astronomers José Joaquim Victorio da Costa, José Simoens de Carvalho, Francisco José de Lacerda, and Antonio Luiz Pontes; and in the government of Grand Para, especially between the Araguari and the Calsoene (Rio Carsewens of the Map of the Coast of the Guyana, published by the Depot of the Marine in 1817), by the astronomer Jozé Simoens de Carvalho, and the Colonel of Engineers Pedro Alexandrino de Souza. The French have long extended their pretensions beyond the Calsoene, near Cape Nord. The boundary is now thrown back as far as the mouth of the Oyapok. The principal tributary stream of that river, the Canopi, and the Tamouri, which is a tributary stream of the Canopi, draw near each other at a league distant (lat. 2° 30′?) from the source of the Maroni, or rather from one of its branches, the Rio Araoua, near the village of the Aramichaun Indians. The Portuguese being desirous of tracing the limits between the Oyapok and the Araguari (Araouari), caused the latitude of the source of the latter river to be carefully examined by Colonel de Souza; it was found to be further north than the mouth, which has placed the frontier in the parallel of Calsoene. The name of the Rio de Vicente Pinçon, become celebrated in the annals of diplomatic disputes, has disappeared on the new maps. According to an ancient manuscript Portuguese map in my possession, and where the coast is marked between San Josè de Macapa and the Oyapok, the Pinçon must be identical with the Calsoene. I suspect that the unintelligible terms of the 8th article of the treaty of Utrecht (\"the line of the river Japoc or Vincente Pinçon, which ought to cover the possessions of the cape and of the north\") are founded on the denomination of Cape North, sometimes given to Cape Orange. (See Laet Nov. Orb. 1633, p. 636). M. de la Condamine, whose sagacity nothing escapes, has already said, in the Relation de son Voyage à l' Amazone, p. 199, \"the Portuguese have their reasons for confounding the bay (?) of Vincent Pinçon, near the western mouth of the Rio Arawari (Araguari), lat 2° 2′, with the river Oyapok, 4° 15′ lat. The peace of Utrecht makes it one river.\" This latitude 2° 2′ would bring the imaginary river of Pinçon near the Majacari and the Calsoene, and remove it nearly one degree from the Araguari, which is in lat. 1° 15′. Mr. Arrowsmith, whose map furnishes excellent materials for tracing the mouth of the Amazon, places the Rio de Vicente Pinçon on the south of Majacarè, where the Matario loses itself in a bay, opposite which the small isle Tururi is situated, lat. 1° 50′. As the Araguari, communicating with the Matario, forms a sort of delta on the north-west around the inundated lands of Carapaporis, M. de la Condamine perhaps considered the small river which flows opposite the isle Tururi as the western branch of the Araguari, 524842=* Recherches statistiques sur la ville de Paris, 1823, Introd. p. 1 et 5., 396819=* The following are the principal epochas of that revolution. The supreme Junta of Venezuela, who declared they would maintain the rights of Ferdinand VII, and who banished the captain-general and the members of the Audiencia, assembled 19th April, 1810. The congress which succeeded the supreme Junta, 2d March, 1811, declared the independance of Venezuela, 5th July, 1811. The congress held its sittings at Valencia, in the vallies of Aragua, in March, 1812. The earthquake that destroyed the greater part of the town of Caraccas, on the 26th March, 1812 (Vol. iv, p. 12), rendered the Spaniards again masters of the country in August, 1812. General Simon Bolivar retook Caraccas, and entered it in triumph, August 16th, 1813. The royalists became masters of Venezuela in July, 1814, and of Bogota, in June,1816. In the same year, General Bolivar disembarked at the island of Marguerita, at Carupano, and at Ocumare. The second congress of Venezuela was installed at Angostura, February 15th, 1819. The fundamental law that unites Venezuela to New Grenada, by the name of the republic of Columbia, was proclaimed December 17th, 1819. The armistice, concluded between the Generals Bolivar and Morillo, is dated November 25th, 1820. The constitution of the Republic of Columbia dates August 30th, 1821. The government of the United States recognized that Republic, March 8th, 1822., 183777=It appeared to me proper to state these general considerations on the future connection of the two continents, before I traced the political sketch of the provinces of Venezuela, of which I have made known the different races of men, the spontaneous and cultivated productions, the inequalities of the soil, and the interior communications. These provinces, governed till 1810 by a captain general residing at Caraccas, are now united to the ancient viceroyalty of New Grenada, or Santa Fé, by the name of the Republic of Columbia. I shall not anticipate the description, which I must give hereafter of New Grenada; but, in order to render my observations on the statistics of Venezuela more useful to those, who would judge of the political importance of the country, and the advantages it may offer to the trade of Europe, even in it's present little advanced state of cultivation, I shall describe the United Provinces of Venezuela in their intimate relations with Cundinamarca, or New Grenada, and as forming part of the new state of Columbia. This sketch will necessarily comprehend five divisions; the extent, population, productions, trade, and public revenue. A part of the statements, which will serve to form this view, having been indicated in the preceding chapters, I shall be concise in noting the general results. Mr. Bonpland and I passed nearly three years in the country, which, 678688=δ Between the Rocky Mountains and the coast of the Pacific Ocean: 288,400 square miles, or 24,091 square marine leagues. This is the territory of Columbia, of Oregon or the west, which must not be confounded either with the territory of the north-west, between lake Superiour and lake Michigan, now comprehended in the territory of Michigan, nor with the English western territory, which the members of the North West Company pass over. I have found on different maps, for this fourth great division of the United States, 286,034; 288,391; 284,925; and 290,400 square English miles. The territory of Oregon (Columbia), Arkansas, and Missouri, comprehending the state of this latter name, furnishes, according to my calculation, an area of 1,107,000 square miles, an immense region, which in 1820 did not contain 83,000 inhabitants of European origin., 627828=3° Missions of Carony in, Spanish Guyana, in 1797., 579643=Among the Caramares also, who call themselves of Carib race, we find some traces of foreign cultivation. \"Architecti pererrantes a littore parumper in frusto candidi marmoris se incidisse dixerunt. Putant peregrinos ad eas terras venisse quondam qui marmora e montibus aliquando scinderent et putamina illa in plano reliquerint.\" In a country almost entirely destitute of historical traditions, we feel an interest in a period anterior to the barbarism in which the Europeans found the hot regions of America, on the east of the Andes. These nations of Cauchieto, near Coro or Curiana, of Caramairi (near Cathagena), Caribana and Cariari, were rich in gold that came from the inland mountains. A part of this gold was mixed with 1/6 of silver. It was the electrum of the ancients, the native auriferous silver, or as the Conquistadores, called it, from a word of the language of Haiti, guanin. (Petr. Mart. Oc., p. 22.) In this passage quanini or rather nini, for qua is a form affixed, is falsely translated by aurichalcum.) Herera, in his Decades, (i. p. 79), gives the name of quanines to all sorts of necklaces made of gold of mean alloy. (See the words of the Haitian tongue that have not been collected by Gili, vol. iii. p. 224, in Petr. Mart. p. 59, 61.) In my sketch of the Carib nations I have not spoken of this custom attributed to the men, of stretching themselves on a hammock, and undergoing a long fast, after the delivery of their wives. It appears that this strange practice belonged to a small number of Carib tribes, and was more common among the other nations of the Oroonoko and the Amazon. (Garcia, p. 172. Southey, vol. i. p. 642). This custom was found heretofore among the Iberians, the Corsicans, and the Tibareni. (Apollon. Rhod. Argonaut., Lib. 2, v. 1009-1014.) In several provinces also of the south of France, husbands faisoient couvade at the birth of a child. The tall stature of the Caribs of the continent sufficiently confirms their northern origin; the first travellers were struck by the extraordinary height of the na-, 292695=* The extent of territory comprised between the sea, the Rio de la Plata, the Uruguay, the Missions, and the Brazilian captaincy of Rio Grande. (Auguste de Saint-Hilaire, Aperçu d'un voyage dans l'interieur du Bresil, 1823, p. 1.), 54868=* These unhappy remains of a people heretofore powerful were banished, in 1795, to the island of Rattam, in the bay of Honduras, because they were accused by the English government of having connexions with the French. An able minister, Mr. Lescallier, had proposed (1760) to the court of Versailles, to invite the red and black Caribbees from Saint Vincent to Guyana, and employ them as free men in the cultivation of the land. I doubt if their number at that period amounted to six thousand; the island of Saint Vincent containing in 1787 not more than fourteen thousand inhabitants of all colours. (Lescallier, sur la Guyane francaise, p. 47.), 550986=Vol. i. p. 275, Vol. iii. 342; Pike, p. 274; Lewis and Clarke, p. 146); 2dly. To the relations of construction or of geographical position observed between the monuments of the United States, the banks of the Ohio, and the Missoury, and the Mexican mouments of Gila and Nabajoa. The country between the 33° and 41° of latitude, parallel to the mouth of the Arkanzas and the Missoury, is considered by the Azteque historians, as the ancient dwelling of the civilized nations of Anahuac. These historians place the first station of the Mexicans, in the course of their migration from north to south, on the banks of the lakes (fabulous?) of Teguayo, and Timpanogos; the second station is marked by the ruins of the Casas-Grandes of Rio Gila, which the fathers Garces and Font have described in detail (Political Essay, II. Vol. i. p. 254, and in my Mexican Atlas, maps 1 and 2). These edifices, which occupy a square league, are placed exactly at the four cardinal points, and, like the ancient Kara-Korum, the capital of the Monguls, are surrounded with lines of fortification. The vestiges of great towers are recognized, which are connected by walls built of clay. (This system of defence recalls to mind the military monuments of the United-States; there is, however, a distance of more than 600 leagues from the Casas-Grandes on the Rio Gila to the ancient fortifications of Black-River, a tributary stream of the lake Ontario; 3dly. To the traditions and moral state of the nations which inhabit the country between the right bank of the Mississipi, and the coast of the Pacific Ocean. From Upper Louisiana towards the Rio Columbia, we observe civilization augmenting progressively on the west of the Rocky-Mountains, which are joined by la Sierra Verde and la Sierra de las Grallas, to the Mexican Andes of Anahuac. (Brackenbridge, Views of Louisiana, p. 173, M'Culloch's Researches on America, p. 203.) The fathers of the seraphic college of Queretaro, found in the year 1773, in the Moqui, traversed by the Rio Yuquesila, a well-peopled., 555391=In reading the first Spanish historians with attention, it would appear that the two countries are situated west of the Rocky Mountains; but Cornado states clearly, that in going to the north, the rivers are found to flow, as far as the Cibola, towards the west; and beyond Cibola, as far as Quivira, towards the east. There is no question however, in any of these expeditions to the north, of a passage across the mountains; Quivira is described as an immense plain, where it is difficult to mark the way. Whatever opinion may be formed of the abrupt lowering of the mountains, north of New Mexico, it is difficult to figure, between the Rocky Mountains and the Sierra Verde, a point of partition of the waters, divortia aquarum, situated in a plain. Francisco Vasquez de Cornado, in his letter to the viceroy, complains of the falsehoods of the monk Marcos de Niza; and to justify his return, paints the country through which he had passed, as poor and savage: he is, however, so much struck with the grandeur of the edifices at Cibora and Quivira, several stories high, built of stone and clay, that he doubts if the natives, who he says are intelligent but little industrious, could have constructed them. This testimony of a man of veracity is well worthy of attention. Does it indicate a people relapsed into barbarism, and who had preserved some knowledge of the mechanic arts? Every house in Quivira having a flat roof, or a terrace (azotea), Cornado calls the whole country \"la tierra de las azoteas.\" Terraces of the same kind were found in 1773, by Father Garces, in the villages of the present Indians of Moqui. Did the nations of the Mexican race, in their migrations to the south, send colonies towards the east, or do the monuments of the United States pertain to the autocthone nations? Perhaps we must admit in North America, as in the ancient world, the simultaneous existence of several centres of civilization, of which the mutual relations are not known in history. The very civilized nations of New-Spain, the Tol-, 249864=the preceding table, and that calculated by Mr. Oltmanns in 1806, results only from the exclusion of the countries not submitted to the governance of the whites. The ancient estimates are all necessarily less than the new, which present the total area. In reducing common leagues to nautical leagues, I reckoned in the Essai politique sur la Nouvelle-Espagne (Tom. ii, p. 851) 299, 810 square leagues (twenty to a degree) for the whole of Spanish America; 30,628 for Venezuela, or the ancient capitania general of Caraccas; 41,291 square leagues for New Grenada; 19,449 for inhabited Peru (according to the frontiers indicated in the Map of Intendancies, published at Lima in 1792, by Don Andrew Baleato); 14,447 square leagues for Chili; and 91,528, for the United Provinces of Rio de la Plata, or the ancient viceroyalty of Buenos Ayres. What I have just stated on the calculations of the surfaces of Spanish America, and the causes from which these calculations vary, may be equally applied to the territory of the United States, which on the west has been terminated at different periods by the Mississipi, the stony Mountains, and the coast of the Pacific Ocean. The territory of Missouri, and that of Arkansas, have been long in some sort without frontiers toward the west; they resemble in this point of view the province of the Chiquitos of South America. In the following tables I have adopted a different method of calculation from that which I had hitherto observed; I have estimated the extent of land, which the increasing population of each state will fill in the lapse of ages. The lines of division (lineas divisorias) adopted are such as they are found according to received traditions, and the rights acquired by long and peaceable possession, on the manuscript Spanish and Portuguese maps in my collection. Where the maps of the two nations differed considerably, these differences have been attended to, and the medium taken as the results. The numbers on which I have fixed in the preceding table consequently indicate the maximum of surface furnished to the, 395368=In comparing these statements, which are taken from the registers of the custom-house at La Guayra, with those of the ports of Spain in my possession (Vol. iv, p. 240), we see that according to the declarations of the vessels, less cacao has entered Spain from Caraccas than from La Guayra. The diminution of the imports and exports in 1797, indicate no decline of national industry; it is the consequence of the renewal of maritime war, Spain having till then, since its peace with the French republic, enjoyed a happy neutrality. The registers of the Custom-house, which I have just stated, during four years, 1789, 1792, 1794, and 1796, give, for the average of the imports of La Guayra, which is the principal port of Venezuela,2,678,000 piastres; and for the average of the exports, 2,317,000 piastres. If we fix on the years, 214112=With respect to the kingdom of New Grenada, I refer to the numberings of 1778, which gave 747,641 for the audiencia of Santa Fè; and 531,799 for that of Quito. Now, supposing only one seventh omitted, and adding only 0·018 of annual increase, we find in 1800, from the most moderate suppositions, above two millions. Mr. Caldas, well informed of the political state of his native country, reckoned three millions in 1808 (Semanario de Santa-Fe, No. 1, p. 2—4). But it is to be feared, that this learned writer greatly exaggerated the number of independent Indians. I find, after mature examination of the materials I possess, the population of the republic of Columbia to be 2,785,000. This estimate is less than that of the president of the congress, who, in the proclamation of the 10th of January, 1820, reckons 3½ millions; and it is rather more than that which was officially published in the Gazeta de Colombia of the 10th of February, 1822, and which I know only from the journals of Buenos Ayres., 667975=4thly, In order to calculate the actual increase, we must include, not only the acquisition of Lousiana, but also the emigrations from Europe. With respect to the white population, we may, I think, assert, that the annual mean of the emigrants arriving in the United States is nearly 10,000, or rather between 7,000 and 14,000; for although there have been years of 22,000 and of 5,000, the average of the emigration from Europe is not above 14,000, nor below 7000. The increase of the black population is entirely natural, with the exception of the period from 1800 to 1810, during which we must include, not only the number of blacks found in Louisiana, but also nearly 39,000 Africans, imported during the years 1804 to 1807, the period to which South Carolina permitted the importation of slaves. We should always consider in these calculations the whole of the black population, free and enslaved., 425437=The most northern isthmus, that of Tehuantepec, which Hernan Cortez, in one of his letters to the Emperor Charles 5th (of the 30th October, 1520), calls the secret of the strait, has so much the more, of late years, fixed the attention of navigators, that during the political troubles of New Spain, the trade of Vera Cruz was divided between the small ports of Tampico, Tuxpan, and Huasacualco*. It has been calculated that the navigation from Philadelphia to Nootka, and the mouth of the Rio Columbia, which is nearly 5000 marine leagues, taking the ordinary way round Cape Horn, would be, 323031=* In continental France, excluding Corsica; for the department of the Liamone is still worse peopled than that of the Upper Alps. The department of the North had, in 1804, on 178 square leagues (20 to a degree) a population of 774,500; and in 1820, of 904,500. The department of the Upper Alps had, in 1804, on 160 square leagues, a population of 118,322, and in 1820, of 121,400. There are, therefore, in these two departments, 5082, and 758 inhabitants to the square league., 583599=In order to facilitate the comparison of the late political associations formed on the new continent, with the ancient states of Europe, I shall here give a sketch of the surfaces, and their population. The different countries are ranged according to their extent, which is the least variable statistical element. Every member has been the object of a particular discussion, and I have consulted every statistical work to which I could find access. When the estimates of the area differed considerably, I calculated anew the surfaces according to the best maps. The area of the Iberian peninsula, for instance, is estimated at 18,155 square leagues, and not, as M. Antillon asserts, at 18,443; Spain, which was heretofore believed to contain 16,097, or 15,363 square leagues, has only 15,005. (Principios de Geografia, p. 135. Elementos de la Geogr. de Espana, 1815, p. 141, 143.) For the area of Portugal (3,150 square leagues), I have followed the calculation of colonel Franzini (Balbi, Essai statist. sur le Portugal, Tom. i. p. 67). The population in my sketch is chiefly applicable to the years 1820 and 1822. That of France is founded on the enumeration of 1820, published by M. Coquebert de Montbret, and comprehending the army. The population of England is conformable to the enumeration of 1821. (See Rickman, Enumeration of Parish Registers, 1823, p. 33 and 35). For the population, and the area of Egypt, I am indebted to the unpublished researches of M. Jomard., 500636=† Tiro Viejo, Santo Christo de Burgos, Tiro de Guadalupe, and Tiro general, their depth is 697, 460, 1061 and 1581 feet, (ancient French measure). See Political Essay, vol. iii, p. 196., 674361=north-east States (from the Delawar to the Maine), and in the south-east states (from Maryland to Florida), we find for the former 110,991 square miles; and for the latter 213,009 square miles. The Atlantic Slave-States (states with slaves situated on the east of the Alleghanies) exceed a little the area of France. The whole of Florida contains, according to my calculations, 59,187 square miles, of which 52,310 are on the east of Apalachicola, and 6,877 on the west of that river. MM. Carcy and Lea estimate Florida at 57,750 square miles. The division of Alleghanies into several parallel chains renders the partition of the United States situated on the left bank of the Mississipi, a little arbitrary, in two portions, on the east and west of the mountains. The 15 Atlantic States (from Georgia to the Maine, consequently without the Floridas) occupy, on the two sides of the mountains, according to Mr. Warden, 386,000 square miles; according to Mr. Morse, 377,446, and according to M. Melish, 366,000. In adopting the latter number, and in estimating at 97,071—6,877=90,194 square miles, the 15 states lying on the west of the Alleghanies, we find the territory of the United States comprehended between the Atlantic Ocean and the mountains, without Florida, to be 275,806 square miles, and with Florida, 328,116; which results agree with those I found from direct measures. Mr. Gallatin, in 1804, estimated this division; without comprehending Florida, at 320,000 square miles, which seems to prove that this statesman, so well versed in the statistics of his country, had allowed more than 386,000 square miles, for the total area of the Atlantic States, or, that he had traced the line of division by a chain less easterly than the Alleghanies., 323533=† Europe, bounded by the Jaik, the mountains of the Oural and the Kara, contains 304,700 square marine leagues. In supposing the inhabitants to be 195 millions, a relative population is formed of 639 to the square league, a little less than that of the department of the Upper Alps, and a little more than that of the inland provinces of Spain. In comparing the total mean of 639 with the partial mean of European countries that do not contain less than 600 square leagues, we obtain, excluding Laponia only, and four governments of Russia (Archangel, Olonez, Wologda, and Astrakhan), 160 for the most desert regions of Europe; and for the most peopled, 2400 souls to the square league. These numbers give the relation of the extremes = 1:15. America contains, according to my last calculations, 1,184,800 square marine leagues, from Cape Horn to the 68° of north lat., comprehending the West Indies; and in estimating the population as we have done above, at 34,284,000, we scarcely obtain 29 inhabitants to the square league. Now to find a continuous surface of 600 square leagues, and which is at the same time the most peopled of all America, we must have recourse to a part of the table-land of Mexico, or of New England, where three contiguous states, Massachusets, Rhode Island, and Connecticut, contained in 1820, an entire population of 881,594, on 12,504 square English miles, consequently nearly 840 souls to the square marine league. We can only select among the West India Islands, of which the population is extremely concentrated, the Great Antilles; for the Little Antilles (or the Eastern Caribbean Isles), from Culebra and St. Thomas to Trinidad, contain altogether but 387 square leagues. Jamaica has nearly the same relative population as the three states of New England, which we have just mentioned; but its surface does not extend to 500 square leagues. St. Domingo (Haïti), which is five times larger than Jamaica, has only 266 inhabitants to the square league. Its relative population scarcely reaches that of New Hampshire. I shall not venture to indicate the fraction which we may suppose to be the minimum of the relative population of the New World; for instance, in the savannahs between the Meta and the Guaviare, or in Spanish Guyana, between the Esmeralda, the Rio Erevato, and the Rio Caura, or finally, in North America, between the source of the Missouri and the Slave Lake. It is probable that the relation of the extremes, found in Europe to be as 1:15, is, in the New World, even excluding the Llanos or Pampas, at least 1:8000., 165336=* Gay-Lussac, in the Annales de Chimie (old series), Tom. 55, p. 266. Descotils in the Annales des Mines, 1816, p. 374. Cordier, in the Annales de Chimie et de Physique, Tom. 9, p. 71—88. Beudant, Voyage en Hongrie, tom. 3, p. 446—471., 205558=CUBA and PORTORICO. The population of the great island of Portorico is little known; it has much increased since the year 1807, when it was computed at 136,000 inhabitants, of which 17,500 were slaves. The census of the island of Cuba gave in 1811, as we have said above, 600,000 inhabitants, of which 212,000 were slaves. (Documentos de que hasta ahora se compone el expediente sobre los negros de la isla de Cuba, Madrid, 1817, p. 139.) In another official document much more recent (Reclamazion hecha por los Representantes de Cuba contra le ley de aranceles, Madrid, 1821, p. 6), the total population is computed at 630,980 souls., 687401=The population in the English possessions in the neighbourhood of the United States, is now perhaps one-seventh greater than I supposed, in the table p. 142. It was computed in 1814, in Lower Canada, 335,000; in Upper Canada, 95,000; in New Scotland, 100,000; in New Brunswick, 60,000; in Newfoundland and at Cape Breton, 18,000; in all, 608,000 inhabitants. (Carey and Lea, Historical, Chronological, and Geographical Atlas of America, 1822, N° 4.), 577344=chantresses. \"Quando aggionsi, (he writes to the king and queen of Castile,) incontinente mi mandarono due fanciulle ornate di richi vestimenti: la più di tempo non saria di etá di anni undici, l'altra di sette; tutte due con tanta pratica con tante atti et tonto vedere che saria bastato, se fossero state puttane publiche vinti anni. Portovano con esse loro polvere di incantamenti e altre cose della loro arte.\" The admiral resisted all these arts of seduction, and hastened to send the young girls on shore. (Lettera rar., p. 9.25. Petr. Martyr. Oc., p. 53. A. Her. Dec. I, p. 132.) The name of Cariari appears a second time in the north-east part of South America. Gomara, in describing the coast from west to east, adds, \"De Sant Roman al golfo triste (entre Punta Tucacas et Portocabelo) ay 50 leguas en que cac Curiana (Coro el pais de los Curianas. Per. Nar. vol. iii. p. 526.) Del golfo triste al golfo de Cariari ai 100 leguas de costa, puesta en 10 grados y que tiene a puerto de Canafistola Chiribichi y Rio de Cumana, y punta de Araia.\" (Hist. de las Indias, fol. viii.) From this ancient Portulan it results, that, if the golfo di Cariari is not identical with the gulph of Cariaco, it is but at a small distance. Is this repetition of the same geographical denominations on the coast of Veragua, and that of Cumana, connected with the ancient migrations of the nations of Carib race? What I stated in the text, of the knowledge the Caribs of Uraba had of hieroglyphic paintings, is founded on the following passage: \"Legum peritus dictus Corrales, Dariensium (Futeracæ et Caribanæ) prætor urbanus, inquit se occurrisse cuidam fugitivo ex internis occidentalibus magnis terris qui ad regulum repertum a se profugerat. Is legentem cernens prætorem insilivit admirabundus atque per interpretis, qui reguli hospitis sui linguam callebant: en quid et vos libros habetis, en et vos characteris quibus absentes vos intelligat assequimini? Oravit una ut apertus sibi libellus ostenderetur, putans se literas patrias visurum. Dissimiles reperit eas esse.\" (Petr. Mart. Oc., p. 65. D.), 509748=by going round Cape Horn. These distances are from 3000 to 5000 leagues for a vessel going from London. From these statements, there results a shortening for the Americans of the United States of 3,100 leagues; and for the English of 2000 leagues; without including the chance of contrary winds, and the dangers of a navigation so different in the two ways which we are contrasting. The comparison is much less favourable across central America, with respect to space and time, for a direct trade with India and China. From London to Canton, going round the Cape of Good Hope, and passing the equator twice, is usually a voyage of 4,400 leagues; from Boston to Canton, 4,500; if the canal of Nicaragua were dug, the length of way would be 4,800, and 4,200 marine leagues*. Now, in the present improved state of navigation, the ordinary duration of a voyage from the United States, or from England, to China, round the extremity of Africa, is from 100 to 130 days†. In founding the calculations on the analogy of the voyages from Boston and Liverpool to the coast of the Mosquito Indians,, 494442=project. Steam-engines for feeding the basins of partition, subterraneous tunnels, as they were proposed in the mountainous part of the isthmus of Panama, and like those of the canal of Saint Quentin, which has one of 2900 toises in length*, belong preferably to inland lines of navigation. It is sufficient for me to have shewn the practicability of an oceanic canal in central America; the estimate of the expence of its construction, of the labor of clearing the ground, and forming banks, locks, basins, and feeding trenches, must depend on the choice of the localities. The Caledonian canal, the most admirable work hitherto executed, cost nearly 3,900,000 piastres, which is 2,700,000 piastres less than the canal of Languedoc†, reducing the mark of silver to the present currency of money. The sketch of the general expence of the works of the canal of Suez, projected by M. Le Pere at the period of the expedition of Buonaparte to Egypt, amounted to 5 or 6 millions of piastres, of which a third would have belonged to the subsidiary canals of Cairo and Alexandria. The isthmus of Suez, reckoning that part which has never been, 361425=Not having visited with Mr. Bonpland the cold region of the province of Varinas, the declivity of the Sierra Nevada of Merida, and the Paramos at the north of Truxillo, which, according to the analogy of the observations I made in the Andes of Pasto and Quito, must be 1700 and 2100 toises high, I cannot judge of the extent of the vallies and table-lands which the western regions of Venezuela may one day furnish for the culture of the cerealia of Europe. It is not, as we have observed above, the knowledge of the absolute height of the peaks which can enlighten us respecting the problems of agriculture. Where the spots lying beneath the benign influence of a temperate or cold climate are on declivities too steep to be easily ploughed, the price of native flour would be too high to be brought into competition with the flour of the United States, of Mexico, and Cundinamarca. As in our Mediterranean, Italy and Greece have long drawn their corn from the opposite coast of Mauritania and Egypt, so also in the Mediterranean of America, Venezuela and the shore of New Grenada now receive their supply of flour from the opposite coast of the United States†. Don Manuel Torres., 422187=* I except the useful information given by Mr. Davis Robinson, on the anchorage of Huasacualco, Rio San Juan and Panama. Memoirs on the Mexican Revolution, 1821, p. 263. (See also Edinb. Rev., Jan. 1810. Walton in the Colonial Journal, 1817, March and June. Bibl. Universelle de Genève, Jan. 1823, p. 47; Bibliotica Americana, Vol. i, p. 115—129.) \"The bar at the mouth of the Rio Huasacualco has 23 feet of water; there is good anchorage, and the port can admit the largest ships. The bar of the Rio San Juan, on the eastern coast of Nicaragua, has 12 feet of water; on one point only there is a narrow pass 25 feet deep. In the Rio San Juan there is from 4 to 6 fathoms, and in the lake of Nicaragua from 3 to 8, English measure. The Rio San Juan is navigable for brigs and sloops.\" Mr. Davis Robinson also says \"the western coast of Nicaragua is not so stormy as it was represented to me during my navigation in the South Sea, and a canal issuing at Panama would have the great disadvantage of being contiuued at a distance of two leagues in the sea, because there are only some feet of water as far as the isles Flamengo and Perico.\", 347326=Cacao. Total production, 193,000 fanegas of 110 Spanish pounds, of which Venezuela exported (inclusive of the contraband trade) 145,000 fanegas. Total value, more than five millions of piastres. Number of trees in 1814, nearly 16 millions. This part of Terra Firma has hitherto derived its greatest celebrity from cacao: the cultivation of it diminishes in proportion as that of coffee, cotton, and sugar increases; it advances progressively from west to east. Ca-, 568279=hills. Other monuments not less curious, are the commodious roads of immense length, which the natives have traced from time immemorial, and which lead from the banks of the Arkansa, near Littlerock, to Saint-Louis on the right, and by the settlement of Mont Prairie as far as Nachitoches, on the left. (Journal of Travels in the Arkansa territory, 1821, p. 28.), 59150=‡ I had some trouble in discovering the origin of this denomination, become so important from the fatal decrees of Figueroa. The Spanish historians often employ the word guatiao to designate a branch of nations. \"La isla Margarita entre las islas de Caribes y de Indios Guatiaos, amigos de los Castellanos, que estan mas adelante de la isla Española. En lo mas arriba de la costa de Tierra firme havia una provincia que se decia Parucuria, la qual era de Guatiaos que no son Caribes.\" Herera, Dec. 2, p. 258; Dec. 3, p. 210. Becoming a guatiao of any one appears to me, to have signified in the language of Haïti concluding a treaty of friendship. In the West India Islands, as well as in the archipelago of the South Sea, names were exchanged as a token of alliance. \"Juan de Esquivel (1502) se hice Guatiao de Cacique Cotubanama; el qual desde adelante se llamó Juan de Esquivèl, porque era liga de perpetua amistad entre los Indios trocarse los nombres: y trocados quedaban Guatiaos, que era tanto como confederados y hermanos en armas. Ponce de Leon se hice Guatiao con el poderoso Cacique Agueinaha.\" Herera, Dec. 1, p. 129, 159, 181. One of the Lucayes islands, inhabited by a mild and pacific people, was heretofore called Guatao (Laet, p. 20); but we will not insist on the etymology of this word, because, as was observed above, the languages of the Lucayes islands differed from those of Haïti., 704240=IN making known to the learned of Europe the physical properties of the cow-tree (see above, Vol. iv, p. 212, 226, 261; Vol. vi, p. 211), I had compared its nourishing milk, not with the juice of plants that abound in caoutchouc, like the juice of the Hevea, but with the milk of the Papayer. I had tried some chemical experiments on the latter, which appeared to me a strongly animalized substance. Two of my friends, MM. Boussingault and Rivero, whose important labours I have already had occasion to mention (Vol. vi, p. 219, and 253), and who are much better versed in chemistry than I was at the period of my voyage, have recently made the chemical composition of the juice of the Palo de Vaca, completely known. The following is an extract of the analysis sent to me by those chemists in a letter from Maracay (between Caraccas and Nueva Valencia), dated February 13th, 1823., 508201=different routes round the Cape of Good Hope, round Cape Horn, or across a cut of the isthmus of central America, we must carefully distinguish between the objects of trade, and the nations engaged in it. The problem respecting the way presents itself in a manner altogether different to an English merchant, and to an Anglo-American; as the problem regarding Chili, must be differently solved by those who trade directly with India and China, or those whose speculations are directed either towards northern Peru and the western coast of Guatimala and Mexico, towards China, after having visited the north-west coast of America, or towards the fishery of Cachelot in the Pacific Ocean. These three latter objects of the navigation of the nations of Europe and of the United States, would be the most indubitably benefited by the cutting of an American isthmus. From Boston to Nootka*, the antient centre of the fur-trade in otter skins, on the north-west coast of America, across the projected canal of Nicaragua, will be 2100 marine leagues; the same voyage is 5,200 leagues, if made, as it has been hitherto,, 377646=the Rio Negro, the Uaupes and the Iquiare; the other, between the sources of the Essequebo, the Caroni, and the Rupunuri. I flatter myself that if the government of Venezuela should ever make a thorough examination of the principal metallic beds of its soil, the persons to whom those researches are confided, will find in the 13th, 16th, 17th, 24th, and 27th chapters of this work, geognostic notions which may be useful to them, because they are founded on a detailed knowledge of the localites*. Hitherto only one working is found in Venezuela, that of Aroa; it furnished, in 1800, near 1500 quintals of copper of an excellent quality. The green-stone rocks of the passage mountains of Tucutunemo (between Villa de Cura and Parapara) contain veins of malachite and copper pyrites. The indications of both ocherous and magnetic iron in the coast chain, the native alum of Chuparipari, the salt of Araya, the kaolin of Silla, the jade of the Upper Oroonoko, the petrolium of Buen-Pastor, and the sulphur of the eastern part of New Andalusia, equally merit the attention of the administration†., 202117=births to the population appeared to be one to seventeen; and that of deaths one to thirty. In admitting for eighteen years only an increase of a million of inhabitants, I believe I have estimated high enough the effects of those popular commotions, which have interrupted the working of mines, commerce, and agriculture. Researches made in the country itself have recently proved, that the estimates I formed twelve years ago are not far from the truth. Don Fernando Navarro y Noriega has published at Mexico the results of an extensive inquiry into the number of curatos y missiones of Mexico; he estimates the population of the country in 1810 at 6,128,000. (Catalogo de los curatos que tiene la Nueva España, 1813, p. 38; and Rispuesta de un Mexicano al n° 200 del Universal, p. 7). The same author, enabled by his office in the finances (Contador de los ramos de arbitrios) to examine the statistic statements on the spot, thinks (Memoria sobre la poblacion de Nueva España, Mexico 1814, and Semanario politico y literario de la Nueva España, n°. 20, p. 94) that in 1810 the population of New Spain, without including the provinces of Guatimala, was composed of the following elements:, 91231=We rested on the night of the 16th of July in the Indian village of Santa Cruz de Cachipo. This mission was founded in 1749 by the union of several Caribbee families; who inhabited the inundated and unhealthy banks of the Lagunetas de Auache, opposite the confluence of the Zir Puruay with the Oroonoko. We lodged at the house of the missionary*; and, on examining the registers of the parish, we saw how rapid a progress the prosperity of the community, 61418=was arbitrarily declared of Caribbee race. The inhabitants of Uriapari (of the peninsula of Paria) were named Caribbees; the Urinacoes (settled on the banks of the Lower Oroonoko, or Urinucu), Guatiaos. All the tribes designated by Figueroa as Caribbees were condemned to slavery; and might at will be sold, or exterminated by war. In these bloody struggles, the Caribbee women, after the death of their husbands, defended themselves with such desperation, that, Anghiera says*, they were taken for tribes of Amazons. The odious declamations of a Dominican monk (Thomas Hortiz) contributed to prolong the misfortunes, that weighed on whole nations. However, amid the cruelties exercised toward the Caribbees, it is consoling to find, that there existed some courageous men, who caused the voice of humanity and justice to be heard. Some of the monks embraced an opinion different from that which they had at first adopted†. In an age when there could be no hopes of founding public liberty on civil institutions, an attempt was made to defend at least individual liberty. \"That is a law most holy (ley sanctissima),\" says Gomara, in 1551, \"by which our emperor has prohibited the reducing of the Indians to slavery. It is just,, 264211=* Columbia, from Humboldt and other recent authorities, London, 1823., 713146=Citation: John van Wyhe, editor. 2002-. The Complete Work of Charles Darwin Online. (http://darwin-online.org.uk/), 201152=MEXICO. I believe I have proved in another place from positive data, that the population of the Viceroyalty of New Spain in 1804, including the provincias internas and Yucatan, but not the capitania general of Guatimala, contained at least 5,840,000 inhabitants, of which 2,500,000 are natives of copper-coloured race; 1,000,000 of Mexican Spaniards, and 75,000 Europeans. I even announced (Essai politique, Tom. i, p. 65—76), that the population in 1808 would be nearly 6,500,000, two or three fifths of it, or 3,250,000, being Indians. The intestine wars, which have long agitated the governments of Mexico, Vera Cruz, Valladolid, and Guanaxuato, have no doubt retarded the progress of the annual increase of the Mexican population, which at the time of my stay in the country was probably more than 150,000 (Essai pol. tom. i, p. 62—64). The proportion of, 669537=The slave population, in 1810, was 1,191,364; in 1820 it was 1,537,568; increase 28 p. cent., 418873=* The title of a book that has recently appeared (Journal of an Expedition 1400 miles up the Oroonoko, and 300 up the Arauca, by H. Robinson, 1822), singularly exaggerates the length of the Lower Oroonoko, and its western tributary streams. A voyage of 1700 English miles would have led the author far into the South Sea. A much more extraordinary geographical error is found in a work composed almost entirely of passages extracted from my Personal Narrative, and accompanied with a map which bears my name, although I there search in vain for the town of Popayan. In this Geographical, statistical, agricultural, commercial, and political account of Columbia, (1822), it is said Vol. ii, p. 28, that \"the Cassiquiarè, long believed to be an arm of the Oroonoko, has been found by M. de Humboldt to be an arm of the Rio Negro.\" The same assertion is repeated in the Vollstándige, Hondbuch der neueren Erdbeschreiung, Vol. xvi, p. 48, written by a man of great merit, Mr. Hassel. Yet, nearly 23 years ago I went up the Cassiquiare, in the direction of from south to north., 403095=her industry. Such is the state of dawning society in South America, that the population of Venezuela, which at most equals the mean population of two departments of France*, stands in need annually, for its interior consumption, of merchandize and foreign articles to the amount of 35 millions of francs. More than four-fifths of those articles come by different ways, from the markets of Europe. Yet, the population of Venezuela is poor, frugal, and little advanced in civilization. If, according to the statements of imports, it appears to have a great consumption, and feeds the industry of commercial nations by its wants, this arises from its being entirely destitute of manufactures, and that the most simple mechanical arts have scarcely begun to be practised there. The maroquins and curried hides of Carora, the hammocks of the Island of Marguerita, and the blankets of Tocuyo, are objects of very small importance even for the inland trade. All the fine tissues and coloured linens used at Venezuela come from foreign ports. When the commerce of France with the American colonies was most flourishing, before the year 1789, she exported to them to the amount of 80 millions of francs, in the productions of the French soil and industry. This amount is little more than that of the total value of the foreign consump-, 44916=* Vespucci says: \"Charaibi magnæ sapientiæ viri.\" Gryn. Nov. Orb., p, 145. On the word cannibal, see vol. v, p. 425., 206537=terials which I collected. These materials are not a total enumeration made by the secular power, but partial estimates only, founded partly on the statements of the clergy and missionaries, and partly on considerations of the consumption, and the greater or less advanced state of cultivation. Persons employed in the government of Caraccas, and particularly a man well informed in financial matters, don Manuel Navarete, an officer of the royal treasury at Cumana, assisted me in this task. The period to which it goes up renders it highly interesting. It is a point from which the increase of the population since the acquisition of liberty and independence, may some day be estimated. This increase, we may presume, cannot be felt, till those fine countries are restored to internal tranquillity. Possibly at the time when this work appears, the population may be somewhat less than in 1800. The armies have not been numerous, but they have desolated the best cultivated countries on the coast, and the neighbouring valleys. The earthquake of the 26th of March, 1812 (See above, vol. iv, p. 12), the epidemic fevers that prevailed in 1818 (vol. v, p. 761), the arming of the blacks, so imprudently favoured by the royalist party, the emigration of many wealthy families to the West India islands, and a long stagnation of trade, have augmented the public misery., 542389=clay, but stone. 3dly, Marietta. Two great squares, with twelve doors; the walls of earth are 21 feet high, and 42 feet at their base. 4thly, Circleville; a square with eight doors, and eight small works for their defence, connected with a circular foot, surrounded with two walls and a moat. 5thly. Paint-Creek, at the confluence of the Scioto and the Ohio; the fortifications are partly irregular; one of them contains 62 acres. 6thly. Portsmouth, opposite Alexandria. Vast ruins, disposed on parallel lines, denote that this spot heretofore contained a numerous population. 7thly. Little Miami and Cincinnati, a wall of 7 feet high, and 6300 toises long; it goes from the Great to the Little Scioto. (Journ. of General Clinton; Western Gazetteer, p. 108; Warden, Description of the United States, Vol. iv. p. 137; Weekly Recorder of the Ohio, Vol. ii. No. 42, p. 324; Med. Repos. Vol. xv. p. 147; New Series of the Med. Repos. Vol. iii. p. 187; Harris's Tour, p. 149; Drake's Picture of Cincinnati, p. 204; Mease's Geolog. account of the United States, p. 478; Caleb Atwater, in the Archœologia Americana, or Transactions of the American Antiquarian Society of Worcester, Massachusetts, 1820, p. 122, 141, and 147.) All these square forts are placed as exactly to the east as the Egyptian and Mexican pyramids; when the forts have only one opening, it is directed towards the rising sun. The walls of these lines of fortification are most frequently of earth; but two miles from Chillicothe, in the state of Ohio, we find a wall constructed in stone, from 12 to 15 feet high, and from 5 to 8 feet thick, forming an inclosure of 80 acres. It is not yet precisely known how far those works extend to the west, along the course of the Missouri and the river la Plata; but they are not found on the north of the lakes Ontario, Erie and Michigan, neither do they pass the chain of the Alleghanies. Some circumvallations discovered on the east of that chain on the banks of the Chenango, near Oxford, in the state of New York, may be considered as a very remark-, 79839=* The population, in 1754, was only one hundred and twenty souls. Caulin, p. 352., 446507=† Lionel Wafer, Description of the Isthmus of America, 1729, p. 297., 335193=These calculations yield 6219 square leagues of steppes, or savannahs, of which 130 are to the westward of the Rio Portugueze. Now the Llanos of Varinas, between that river, the Apure, and the mountains of Pamplona, Merida, and Parame de las Rosas, contain 1664 square leagues; it thence results, that the immense basin of the Llanos comprehended between the Sierra Nevada de Merida, the delta of the Bocas Chichas, inhabited by the Guaraon Indians, and the northern banks of the Apure and the Oroonoko, present a superficies of 7753 square leagues, equal to half the extent of Spain. The actual population of the savannahs of Caraccas, Barcelona, and Cumana, appears to me, on account of their populous cities, to be now above 70,000 souls., 255846=* Juarros, Compendio de la Hist. de Guatemala, printed at Guatimala, 1809, vol. i, p. 5, 9, 31, 56; vol. ii, p. 39. Jose Cecilio Valle, Periodico de la Sociedad economica de Guatemala, vol. i, p. 38., 701546=nounced the line of demarcation, and promised to recognize no other limits between Brazil, Buenos Ayres, and Peru, than the ridge of some mountains, and the course of the rivers. This convention declared formally \"that it was impossible to fix by observations of longitude the line of demarcation on the coast, and in the interior;\" a confession the more singular, as Don Jorge Juan, and Don Antonio de Ulloa, had proved, in a learned memoir (Dissertacion historica y geografica sobre el meridiano de demarcacion entre los dominios de Portugal y de España), published after their return from Quito, in 1749, that the limit ought to be fixed by the tenor of the treaty of Tordesillas, and according to two modes of interpretation of which that treaty is susceptible, either 1° 50′, or 3° 14′, on the east of the town of Grand Para. The convention of 1750 was renewed and confirmed at Madrid, October 11th, 1777; but the execution of stipulations made without local knowledge, and in consulting only very imperfect maps, was attended with greater difficulties. Nothing more was attempted on the side of the Oroonoko, and the Rio Negro; the whole attention of the two courts was directed towards the limits of Paraguay, and the banks of the Caqueta, the Rio Blanco, and the Amazon. The Brigadier Don Jose Varela, was sent (1782—1789) to Montevideo, M. d'Azara to Paraguay, and M. Requeña to Maynas. However incomplete the labours of the commissaries have remained, it cannot be doubted that astronomical geography will derive great advantages, if not the results only of their investigation are made public, but the observations on which those results are founded. The map by Azara of Paraguay, and those of Brazil, executed at Rio Janeiro, by order of the minister of marine, Don Rodrigo de Souza Coutinho, in 1804, by the captain of a frigate, Don Antonio Pères da Silva Pontes Lemos, have been rectified according to a part of those observations; but the longitudes being all chronometrical, the discordance in the time pieces of the Spanish, 624392=Must we conclude from the comparison of the states of 1792, and 1799, that the Indian population of the province has diminished, or does not the difference proceed from the negligence of the last enumeration and the exclusion of the dispersos?, 362804=in an official letter addressed to the Secretary of State at Washington, estimates the exportation of North American flour for Columbia at 20,000 barrels a year. (Message from the President of the United States, 1822, p. 48. See also Above, Vol. iv, p. 104, 105, and 111, 112.) In a state of free trade, the immense progress of the art of navigation exposes the native cultivation to a dangerous rivalry with that of the most distant countries. The fields of the Crimea supply the markets of Leghorn and Marseilles; the United States furnish Europe with corn, and in times of scarcity the table-land of Mexico sends its produce to Spain, Portugal, and England. Regions, some of which scarcely produce the 6th or 7th, and others the 20th or 25th grain, are placed in competition with each other, and the problem of the utility of a production is complicated by the variable effects of the fertility of the soil, and the price of labour. The western part of Columbia (New Grenada), will always possess great advantages with respect to the production of the cerealia, by the magnitude of its mountains, and the extent of its table-lands, over the eastern part of Columbia (Venezuela); it thence results that the rivalry of the flour of Socorro and of Bogota, which goes down by the Meta, will be to be divided by the regions north of the Oroonoko. Where temperate regions are in the vicinity of hot, between 300 and 500 toises high (as in the temperate spots of the provinces of Cumana and Caraccas), the cultivation of sugar, of coffee, and of the cerealia is equally practicable, and experience proves, pretty generally, that the cultivation of the two former is preferred as being the most lucrative., 58723=* \"Dati erant in prædam Caribes ex diplomate regio. Missus est Johannes Poncius qui Caribum terras depopuletur et in servitutem obscœnos hominum voratores redigat.\" Petr. Mart. Ocean., Dec. 1, lib. p. 26, A; te Dec. 3, lib. vi, p. 57, C. Gomara, Hist. de Ind. fol. cxxix., 221184=ber 1822, p. 3, and Colombia, being a statistical account of that Country, 1822, vol. i, p. 375). The congress not having been able to consult the deputies of Quito, the population of that presidencia has probably been estimated too low. It is given in the official Gazette nearly the same as it was found in 1778, while the estimate of the audiencia of Santa Fé gives an increase in 43 years of more than 70/100. It is to be hoped, that an enumeration made with precision will soon dissipate the doubts we entertain on the statistics of Columbia. It appears to me probable, that, notwithstanding the devastations of war, the population will be found above 2,900,000., 366619=* See above, Vol. iii, p. 29, 30; Vol. iv, p. 248; Vol. v. p. 767. Lambert, Illustration of the genus Cinchona, 1821, p. 57. The pretended Cinchona Brasiliensis of the herbal of Willdenow, with a calico of the length of the corolla, and vegetating in the hot regions of Grand Para, is perhaps only a Machaonia., 307419=from the Atlantic Ocean to the Pacific is estimated by very recent authors at 125,400, at 137,800, at 157,500, at 173,400, at 205,500, and at 238,400 square marine leagues, 20 to a degree: and it appeared to me impossible from those varying statements, of which the difference amounts to more than 100,000 square leagues, that is to six times the super-fices of France, to find a result with which we might compare the surfaces of the new free states of Spanish America. In some instances the same author has, at different periods, given very different estimates of the same territory, bounded by the two seas between Cape Hatteras and the Hio Columbia, between the mouth of the Mississipi and the lake des Bois. Mr. Mellish, in his map of 1816, has estimated the United States at 2,459,350 square miles (69·2 to a degree), of which the territory of the Missouri alone is made 1,580,000. In his Travels through the United States of America, 1818, p. 561, he fixes the contents at 1,883,806 square miles, of which the territory of the Missouri is estimated at 985,250. Still later, in his Geographical description of the United States, 1822, p. 17, he again increases the calculation to 2,076,410 square miles. These fluctuations of opinion respecting the extent of the surface of the United States cannot be attributed to the various ways in which the limits are traced: the errors for the most part which affect the extent of the territory between the Mississipi and the Rocky Mountains, and between those mountains and the coast of the Pacific, arise from mere mistakes of calculation. I find in taking the average of several estimates, on the maps of Arrowsmith, Mellish, Tardieu, and Brué:—, 282312=comprehending New Grenada, properly so called, (Cundinamarca) and Quito. The western limits of the provinces of Maracaybo, Varinas, and Guayana, bound the territory of the viceroyalty on the east: the frontiers on the south and west are those of Peru and Guatimala. We shall only add here, in order to rectify the errors of the maps, that the Valle de Upar, or Villa de Reyes, Salazar de las Palmas, El Rosario de Cucuta, celebrated as the residence of the constituent assembly of Columbia, in the month of August 1816, San Antonio de Cucuta, la Grita, San Christoval, and la Villa de Arauca, as also the confluence of the Casanare and the Meta, the Inirida and the Gaviare, belong to New Grenada. The province of Casanare, dependent on Santa Fe de Bogota, extends towards the north beyond the Ori-, 347867=cao is important, not merely as an object of external trade, but also as food for the inhabitants. The interior consumption will consequently increase with the population, and it is to be hoped that the proprietors of the cacao plantations will soon find new encouragement in the increase of national prosperity. (See above, Vol. iii, pp. 191—195; Vol. iv, pp. 231—242.) The cacao of the provinces of Caraccas, Barcelona, and Cumana, of which the finest quality is found at Uritucu (near San Sebastian), Capiriqual, and San Bonifacio, is far superior to the cacao of Guayaquil; it yields only to that of Soconusco (Juarros, Compendio de la hist. de Guatimala, 1818, Tom. ii. p. 77) and of Gualan, near Omoa, which scarcely enters into the commerce of Europe., 666282=2dly, Three counties of the state of Alabama have been omitted in the estimate of 1820, but it is known that they contained more than 12,000 inhabitants, of which nearly 8000 were whites, 4000 slaves, and 50 free blacks., 57632=* Dec. 3, lib. 3, p. 49, B., 319238=* The superficial extent of European Russia, without Finland and the Grand Duchy of Warsaw, was in 1805, according to the statistical tables of Mr. Hassel (Umriss der Europ. Staaten, Tom. 1, p. 10), 138,000 square leagues, 20 to a degree, with a population of 36,400,000 souls; according to the same tables, the extent of the whole Russian monarchy was 603,160 square leagues, with 40 millions of population. These estimates of 1805 would give but 264, and 66 inhabitants to the square league. In supposing with Mr. Balbi (see his interesting researches on the population of Russia, in the Compendio di Geografia universale, pp. 143, and 163, and the Statistical Essay on Portugal, Vol. ii, p. 253), the superficial extent of European Russia with Finland and the kingdom of Poland, to be 169,400 square leagues, the super-fices of the whole Russian monarchy in Europe and in Asia, 686,000 square leagues, and the actual population in 1822 to be from 48 to 54 millions, we find 283 and 78 inhabitants to the square league. According to researches which I have recently made relative to the extent of Russia. I fix, for the whole empire, comprehending Finland and Poland, 616,000 square leagues; for the European part, comprehending the ancient kingdoms of Kasan and Astrakhan, with the exception of the government of Perme, 150,400 square leagues, which yields the relative population of 318 and 87, stated in the text. (See also Gaspari, Vollft. Hand. der Erdb. B. xii, p. 210., 300822=* This is, however, 440 toises less than the culminant point of the road of Assuay, between the towns of Quito and Cuenca, of which I took the level in 1802. See my Obs. astron. Tom. i, p. 312, No. 209., 605710=The surface of Indostan, and its political divisions, have been calculated with the greatest care by M. Mathieu, and myself, from a map bearing the title; \"New improved map of India, 1822, by Allen, Kingsbury, and Parbury.\" We found 109,190 square marine leagues, or 1,307,180 square English miles, in assigning the following limits to the peninsula of India: the mouth of the Indus and its course as far as 35° 20′ of lat. at the N. W. of Cashemere; the chain of the Himalaya nearest the lake Manasorovar, to the river Tistah; the Borampouter at 90° of longitude; the sea of Bengal, south of the isle of Mascal, and east of the river Sankar. I am surprised that Mr. Hamilton marks for the whole peninsula 1,020,000 square English miles, or 85,120 square marine leagues, an estimation one fifth too little. The statements of Playfair, which I have followed in my work on Mexico, and of MM. Balbi, Tempelman, and Hassel, (162,827 square leagues, 25 to a degree; 62,500 square geographical leagues; 69,750 square geographical leagues; 73,460 square geographical leagues), approach nearly the result on which I have fixed., 122239=I have spoken above† of the importance of the trade of Nueva Barcelona. This small town, which in 1790 had scarcely ten thousand inhabitants, and in 1800 more than sixteen thousand, was founded‡ by a Catalonian con-, 482309=‡ See above, Vol. ii, p. 248, 344, 743. The mean quantity of rain that falls annually at Kendal, on the western side of England, is 57 inches; at Bombay 72 and 106 inches; at St. Domingo 113 inches. (Arago Annuaire du Bur. des Long., 1824, p. 165.) M. Antonio-Bernardino Pereira Lago, colonel of infantry of the corps of engineers, at Brazil, thinks he found, in the year 1821 only, at San Luis do Maranhao, (lat. 2° 29′ south), 23 feet 4 inches, 9·7 lines, English measure, which make near 260 French inches. We might be inclined to doubt this prodigious quantity of rain; yet I am in possession of the barometric, thermometric, and ombrometric observations which M. Pereira Lago affirms were made by him, day by day at those different periods. These Brazilian observations are published in the Annaes das Sciencias das Artes et das Letras, p. 54—79; and the observer who describes the instruments he employed, says expressly, in the resumo das observacoes meteorologicas, that the plane on which the rain fell was exactly of the same diameter as the cylinder which contained the scale; this diameter was only 6 inches (English). I wish this important observation may be verified at Maranhao, and repeated in other parts of the tropics, where the rains are abundant; for instance, at Rio Negro, Choco, and the Isthmus of Panama. The quantity indicated by M. Pereira Lago, is 2 1/6 times greater than what has been observed at the mean term, at the Isle of St. Domingo; but the quantity of water that falls on the western coast of England also exceeds three times that which is collected annually at Paris. There exists very considerable differences in latitudes, that are near each other. Captain Roussin relates that 151 inches of rainwater fell at Cayenne, in the month of February only., 624655=2° State of the Missions of the Oroonoko, the Cassiquiare and the Rio Negro, in the province of Spanish Guyana, in 1796., 396248=1793—1796 only, we have for the exports 3,060,000 piastres, while the years of war, comprehended between 1796 and 1800, furnish an average of only 1,610,000 piastres. (Depons, Vol. ii, p. 439.) In the year 1809, and consequently only a short time before the revolution of Caraccas*, the balance of trade at La Guayra ought to have been little different from what it was in 1796. I discovered in a journal of Santa Fe de Bogota (Semanurio, Vol. ii, p, 324), an official extract of the registers of the custom-house, for the first six months of, 357001=It is not the province of Caraccas alone that, in Venezuela, contains regions of temperate elimates; that is, countries where the centigrade thermometer falls at night below 16° or 14°, and even to 12·5°. The province of Cumuna has also its mountainous districts, which, though little visited hitherto, may yet become important for some new branched of equinoctial agriculture. Having passed through a great part of Venezuela with the barometer in my hand, I think it proper to state here succinctly the countries that merit the name of tierras templadas*, many of which, well-fitted for the production of cerealia, are too cold for the culture of coffee. This enumeration having merely an agricultural view, we shall mark only the high vallies or table-lands of a considerable extent. The Paramo of Mucuchies, which belongs to the Sierra nevada of Merida, the Silla of Caraccas, in the Cordilleras of the shore, and the Duida, in the missions of the Upper Oroonoko, are 2100,1340, and 1280 toises high, but, 298659=* This town, according to M. Redhead (Memoria sobre la dilatacion del aire atmosferico; Buenos Ayres, 1819, p. 8 and 10), is situated 700 toises above the level of the sea. The absolute height of the town of San Miguel del Tucuman is, according to the barometric measurement of the same author, (an inhabitant of Salta) 260 toises., 228372=The whole of these returns not having been made at the same period, this state of the population may be considered as relative to the years 1816 and 1818. The population of Brazil, however, must have augmented considerably during the last four or five years. According to documents presented to the house of commons at London in 1821, we see, that the port of Bahia received from January the 1st 1817, to January the 7th 1818, 6070 slaves, and that of Rio Janeiro, 18,032. In the course of the year 1818, the latter port received 19,802 Negroes. (Report made by a committee to the directors of the African Institution, on the 8th of May, 1821, p. 37.) I have no doubt, that the population of Brazil is at present more than four millions. It was consequently estimated very high in 1798 (Essai polit. sur le Mexique, vol. ii, p. 855.) Mr. Correa de Serra believes, from the ancient returns which he was enabled to examine with care, that the population of Brazil in 1776, was 1,900,000 souls; and the authority of this statesman is of great weight. A table of the population, brought home by Mr. de Saint-Hilaire, correspondent of the Institute, estimates the population of Brazil, in 1820, at 4,396,132; but in this table, as the learned traveller well observes, the number of wild and catechised Indians (800,000) and of free men (2,488,743) is singularly exaggerated; while the number of slaves (1,107,389) is much too small. (See Veloso de Oliveira, Statistique da Brazil, in the Annaes Fluminenses de sciencias, 1822, tom. i, §. 4.), 226021=This last enumeration gives 7,862,282 whites; 1,537,568 slaves; and 238,149 free men of colour. According to a very interesting work published by Mr. Harvey (Edinb. Philos. Journal; January, 1823, p. 41), the decennial augmentation of the population of the United States was, from 1790 to 1820, successively, 35, 36·1, and 32·9, per cent. The retardation felt in the increase therefore is yet only 2 or 3 per cent for ten years, or one eleventh of the total increase*., 120308=We arrived, July the 23d, at the town of Nueva Barcelona, less fatigued by the heat of the llanos, to which we had been long accustomed, than by the winds of sand, which occasion painful chaps in the skin. Seven months before, in going from Cumana to Caraccas, we had rested a few hours at the Morro de Barcelona, a fortified rock, which, toward the village of Pozuelos, is joined to the continent only by a neck of land. We were received in the most affectionate manner, and with the kindest hospitality, in the house of a wealthy merchant of French extraction, don Pedro Lavié. Accused of having given an asylum to the unfortunate España, when he was a fugitive on these coasts in 1796, Mr. Lavié was arrested by the orders of the Audiencia, and dragged as a prisoner to Caraccas. The friendship of the governor of Cumana, and the remembrance of the services he had rendered to the dawning industry of those, 49855=† Herera, Dec. 1, p. 235; Dec. 2, p. 163., 34959=* Petr. Mart. Epist. ad Pomp. Letum (Non. Dec. 1494) Lib. VII, No. 147, fol. xxxv; and Ocean., Lib. I, fol. 2, A. According to the Caribbee pronunciation, balana and parana, the sea, are confounded together., 238150=* Nova Coimbra (lat. 19° 55′) is a presidio founded in 1775, and is probably the most southern Portuguese settlement on the Rio Paraguay. In different Spanish and Portuguese maps, the Yaguary (Menici, Monici), a large tributary stream of the Parana, is usually fixed on as the frontier between Parana and Paraguay toward the east; toward the west sometimes the Chichuy (Xexuy) and Ipane, near the ancient mission of Belen (lat. 23° 32′), sometimes the Mboimboy (lat. 20° 27′), opposite the destroyed mission of Itatiny, and sometimes (lat. 19° 35′), the Rio Mondego or Mbotetey, near the destroyed town of Xerez; all three tributary streams of the Paraguay on it's eastern side. The boundary nearest Nova Coimbra, that of Rio Mboymboy, has been pretty generally adopted provisionally between Brazil and the ancient viceroyalty of Buenos Ayres., 356190=* At 900 and 1100 toises elevation, the fields of wheat and rye disappear in the maritime Alps and in Provence. See the researches on the temperature required for cultivated plants, in my work on Distributions geog. plant. 1817, p. 161., 256617=CUBA and PORTORICO. The area for Portorico is calculated from the maps of the Hydrographic Depot at Madrid; for the island of Cuba, from the map, which I constructed in 1820, from my own astronomical observations, and from the whole of the data hitherto published by Messrs. Ferrer, Robredo, Lemaur, Galiano, and Bauza., 559634=physiognomy which Mexican civilization presents, in so many other respects, seem to indicate the antique existence of an empire in the north of America, between the 36° and 42° of latitude. We cannot reflect on the military monuments of the United States, without recollecting the first country of the civilized nations of Mexico. It is in rising to more general historical considerations, in examining with more care than has been hitherto done, the languages, and the osteologic conformation of different tribes, in exploring the immense country bounded by the Alleghanies, and the coast of the western ocean, that means Will be obtained of throwing light upon a problem so worthy of exercising the sagacity of historians. In these researches there can be no question either respecting the first inhabitants of America (real history does not go back so far), or of a very advanced civilization, superior, for instance, to that of so many nations of Tartar or Mongul race in central Asia; nor, finally, respecting the fortuitous analogy of some sounds, some syllables that are again found, with significations altogether different, in the Tschoude, Indo-pelasgic, Iberian or Basque, and Welsh or Celtic tongues. (Wilhelm von Humboldt, über die Urbewohner Hispaniens, p. 95.) It is from vague and unphilosophical views that Indians have occasionally been believed to be discovered who speak Irish, Bas Breton, or the Celtic of Scotland. The fable of Welsh Indians, having preserved the Welsh, or Celtic language, is of very old date. In the time of Sir Walter Raleigh, a confused report was spread over England, that on the coast of Virginia the Welsh salutation had been heard; hao, houi, iach. Owen Chapelain relates, that in 1669, by pronouncing some Celtic words, he saved himself from the hands of the Indians of Tuscorora, by whom he was on the point of being scalped! The same thing, it is pretended, happened to Benjamin Beatty, in going from Virginia to Carolina. This Beatty asserts that he found a whole Welsh tribe, who preserved the tradition of the, 18733=* What are those worms (loul in Arabic), which captain Lyon, the fellow-traveller of my brave and unfortunate friend Mr. Ritchie, found in the pools of the desert of Fezzan, which served the Arabs for food, and which have the taste of caviare? Are they not insects' eggs, resembling the aguautle, which I saw sold in the market at Mexico, and which are collected on the surface of the lakes of Texcuco? (Gazeta de Litteratura de Mexico, 1794, vol. iii, No. 26, p. 201.), 662035=These estimates of the population are incomplete for the lower regions of the Audiencia of Buenos Ayres; for instance, for Salta, Sante Fe, Banda oriental and Entre Rios, the calculation is perhaps too low; it amounts from the years 1817 to 1820, for the Audiencia of Charcas, with Santa Cruz, Moxos, and Chiquitos to 1,716,000, comprehending the natives; for the Audiencia of Buenos Ayres, without the Indians, 655,000, total 2,371,000. M. Schmidtmeyer, in his interesting Voyage to Chili, reckons 1,100,000 inhabitants for the basin of La Plata, and 1,300,000 for the provincias de la Sierra. It appears to me probable that before the revolution, the white, copper-coloured, and mixed population of the whole vice-royalty, previously to the dismembering of the Cisplatine province by the Brazilian Portuguese, and of Paraguay by Doctor Franzia, exceeded 2½ millions, of whom 1,200,000 were Indians., 669314=The total population in 1810, was 7,239,903; in 1820 it was 9,637,999; increase 33 p. cent., 273910=b.) SPANISH GUAYANA; such as it was administered before the revolution of the 5th of July, 1811, by a governor resident at Angostura (Santo Tomè de la Nueva Guayana.) It contains more than 225,000 English square miles, and consequently exceeds the area of all the Atlantic Slave States, Maryland, Virginia, the two Carolinas, and Georgia. More than nine-tenths of this province are uncultivated, and almost uninhabited. The limits on the east and south, from the principal mouth of the Oroonoko to the island of San Jose de Rio Negro, have been indicated in describing the general configuration of the republic of Columbia. The limits of Spanish Guayana on the north and west are, first the Oroonoko, from Cape Barima to San Fernando de Atabapo, and then a line stretching from north to south, from, 141787=* Casa de don Pasqual Martinez, on the north-east of the great square, near which I had made observations from July the 28th to November the 17th, 1799. All the astronomical observations, and those of mirage (vol. iii, p. 542), which are posterior to August the 29th, 1800, were made in the house of don Martinez. I relate these circumstances, because they may be interesting at some future period to those, who may wish to examine the precision of my labours, 223557=From these statements it results, that in some districts the returns had included the whole population; and in others the number of whites, mulattoes, and mestizoes only, excluding the natives of copper-coloured race. Now, confining ourselves to the eight provinces of the first description only (namely, Buenos Ayres, Cordova, Cochabamba, Potosi, Charcas, Santa Cruz, la Paz, and Paraguay), we obtain 1,805,000 souls. The provinces and districts of Tucuman, Santiago del Estero, the Valley de Catamarca, Rioja, San Juan, Mendoza, San Luis, Jujuy, and Salta, are wanting in this amount. As they contain, according to other returns, near 330,000 souls, exclusive of the Indians, we cannot doubt, that the total population of the ancient vice-royalty of Buenos Ayres, or la Plata, already comprises two millions and a half of inhabitants of all descriptions. (Message from the President of the United States at the commencement of the session of the fifteenth Congress, Washington, 1818, p. 20, 41, and 44). The very particular estimates* obtained by Mr. Brackenridge, secretary to the mission of the United States at Buenos Ayres, and published in a work replete with philosophic views, give to Upper Peru alone, that is, to the four intendencies of Charcas, Potosi, La Paz, and Cochabamba, a population of 1,716,000., 682995=A surface of 2,086,800 square miles furnished to the industry of a laborious people wisely governed, is ten times larger than France. It need not be augmented by substituting, as some American engineers have seemed recently to desire (on occasion of the rectification of the limits of Canada), geocentric latitudes (the angle formed by the inclination of the earth with the equator) for ordinary latitudes. (Quart. Journ. of Sciences, 1823, Jan., p. 412.), 210434=Perhaps, even at the period at which I stop, the population of the two provinces of Caraccas and Maracaybo, and that of the island of Margaretta (Brown's Narrative, 1819, p.118), were somewhat exaggerated; Mr. Depons, however, who had alike access to the returns made by the vicars to the bishops, estimates the province of Caraccas only, including the province of Varinas, at 500,000 (Voyage à la Terre Ferme, tom. i, p. 177). The villages are extremely po-, 608682=According to the great imperial geographical map of China, the number of taxable persons amounted in 1790, to 143 millions. M. de Klaproth, thinks that 700,000 may be added for the army, and the persons exempted from taxation; so that China, properly so called, probably contains 150 millions. For Tartary, 6 millions may be reckoned (with the exception of Thibet and Coréa.), 685124=It results from these calculations, in which the errors in the estimate of surfaces can have no sensible influence on the relative population, that the United States on the east of the Mississipi (without comprehending the Floridas) contained in 1820, on an area of 77,700 square marine leagues, or 730,000 square English miles, an absolute population of 9,403,760, and a relative population of 122 inhabitants to the square marine league. If the relative population of the whole territory of the United States, from the Pacific to the Atlantic Ocean, was in 1820, 55 inhabitants to the square league, it must have been at the end of the year 1822, (when I find, in supposing an uniform increase, a total population of 10,220,800), a little above 58. The immense augmentation of the population on the east of the Mississipi becomes little sensible if, according to a simply mathematical abstraction, we divide the whole population over the entire surface of the territory., 534785=* See the article of Innovations, in Bacon's Essays civil and moral, No. 25. (Opera omnia, 1730, vol. iii, p. 335.), 284730=* See a scarce map of the Missiones de Mojos de la Compania de Jesus, 1713. The Rio Maniqui, to which modern geographers have given so much importance, by the fable of the lake Rogagualo, and the bifurcations of the Beni, joins the Yacuma, by which Mr. Haenke went from Pueblo de Reyes to the Rio Mamore., 204460=GUATIMALA. This country, which has been hitherto designated as a kingdom, comprises the four bishoprics of Guatimala, Leon de Nicaragua, Chiapa or Ciudad Real, and Comayagua or Honduras. A numbering made in 1778 by the secular government, which was kindly communicated to me by Mr. Del Barrio (deputed to the Cortes of Madrid before the declaration of the independence of Mexico), gave only a populution of 797,214 inhabitants; but don Domingo Juarros, the learned author of the Compendio de la historia de Guatemala, published successively in 1809—1818, has proved, that this result is very inacourate (vol. i, p. 9 and 91). The numberings made at the same period by order of the bishops gave above a third more. During my stay at Mexico, the population of Guatimala, where the Indians are extremely numerous, was computed from official documents at 1,200,000; and it is now estimated by persons, to whom the localities are well known, at two millions. Being always desirous of stopping at numbers erring on the deficient side, I have reckoned the population only at 1,600,000., 158472=of the waters. The capital of the island, la Asuncion*, the port of Pampatar, and the villages of Pueblo de la Mar, Pueblo del Norte, and San Juan, belong to the second and most easterly of these groups. The western group, the Macanao, is almost entirely uninhabited. The isthmus, that divides these large masses of micaslate, was scarcely visible; it appeared disfigured by the effect of the mirage, and we recognized this intermediate part, cut by the Laguna grande, only by two small hills†, in the form of a sugarloaf, in the meridian of the Punta de Piedras. Nearer, we look down on the small desert archipelago of the four Morros del Tunal, the Caribbee, and the Lobos islands., 226523=BRAZIL. It has hitherto been fixed at three millions†; but the estimate which I give in the table is founded on official unpublished pieces, which I owe to the kindness of Mr. Adrien Balbi, of Venice, who was enabled by a long stay at Lisbon, to throw great light on the statistics of Portugal and the Portuguese colonies. According to the report made to the king of Portugal in 1819, on the population of his possessions beyond sea, and according to different statements furnished by the captains general, governors of provinces (conformably to the decrees of Rio Janeiro of the 22d of August and the 30th of September, 1816), Brazil, about the year 1818, had a population of 3,617,900 inhabitants; namely,, 430353=* Andreossi, Description of the canal of Languedoc, p. 138. Huerne de Pommeuse, on Navigable Canals, 1822, p. 64, 264, 309. Dupin, Mem. on the Marine, and the Bridges and Highways of France and England, p. 65 and 72. Dutens, Mem. on the Public Works of England. p. 295., 222701=BUENOS AYRES. According to the official documents communicated to Mr. Rodney, one of the commissioners sent by the president of the United States to Rio de la Plata in 1817, the population was two millions. At that period it was found to be 965,000, exclusive of the Indians. The number of natives is extremely considerable in Upper Peru, that is, in the Provincias de la Sierra, which belong to the, 379988=* In 1800, a day-labourer (peon) employed in working the ground, gained, in the province of Caraccas, 15 sols, exclusive of his food. (Vol. iv, p. 128.) A man who hewed building timber in the forests on the coast of Paria, was payed at Cumuna, 45 to 50 sols a day, without his food. A carpenter gained daily from 3 to 6 francs, in New Andalusia. Three cakes of Cassara (the bread of the country), 21 inches in diameter, 1½ line thick, and 2¼lb. weight, cost at Caraccas, a half-real de plata or 6½ sols. A man eats daily not less than 2 sols worth of cassara, that food being constantly mixed with bananas, dried meat (tassajo), and papelon, or unrefined sugar. Compare for the price of provisions, Vol. iv, p. 242, 388; Vol. v, 152., 426047=* Balanza del comercio maritimo de Vera Cruz correspondiente el año de 1811, p. 19, N° 10., 161799=When, in 1785, after an earthquake, a great rocky mass was broken off in the Aroyo del Robalo, the Guaykeries of los Serritos collected fragments of alum five or six inches in diameter, extremely pure and transparent. It was sold in my time at Cumana to the dyers and shoemakers, at the price of two reals (one quarter of a piastre) a pound, while alum from Spain cost twelve reals. This difference of price was much more the effect of prejudice, and the shackles of trade, than of the inferior quality of the alum of the country, which is used without undergoing any purification. It is also found in the chain of micaslate and clayslate on the north-west coast of the island of Trinidad, at la Margaretta, and near cape Chuparuparu, north of the Cerro del Distiladero*. The Indians, naturally addicted to, 349890=Indigo. The growth of this very important article decreased much more from 1787 to 1798 than that of cacao. It is maintoined with advantage only in the province of Varinas,(for instance, between Mijagual and Vega de Flores), and on the banks of the Tichira. The value of the indigo of Caraccas amounted, in the most prosperous times, to 1,200,000 piastres. The exportation to La Guayra, in 1794, was 900,000 pounds, and in 1809, 7000 zurrones. (Vol. 1, pp. 62, 63; Vol. iv, pp. 119, 187., 665551=1st. The inhabitants of the countries situated on the north of the Ohio, (States of the Ohio, Indiana, and the Illinois, and the territory of Michigan), and also the inhabitants of the territory forming at present the state of Mississipi, were not numbered in 1790, and they ought to be added to the enumeration of that year. I calculate that they were at that period:, 253197=* In the declaration of the congress of Venezuela, of the date of December 17th, 1819, a declaration which is regarded as the fundamental law of the republic of Columbia, the territory is estimated (article 2) at 115,000 square leagues, without adding the value of these leagues. If they be nautical leagues, which is very probable, the estimate is 25,000 leagues too great (once and a half the area of France). Maps must have been consulted, which were not corrected according to the astronomical observations made at the southern and eastern frontiers. All the estimates of area hitherto published in the new states of America are very inexact. I except the partial statements of the Abeja argentina (1822, N° i, p. 8), an interesting journal published at Buenos Ayres., 408719=† Balanza del Comercio reciproco hecho por el puerto de Vera Cruz coo los de Espuña y de America en los ultimos 25 años. (De orden del Consulado de Vera Cruz, el 18 de Abril 1821.), 669425=The white population, in 1810, was 5,862,093; in 1820 it was 7,856,082; increase 34 p. cent., 572748=p. 54); Anguilla, Maliouana; Domingo, Ouaitouconbouli; Barbadoes, Ouahomoni; Marigalante, Aichi; Saint-Christopher, Liamaigana; Guadaloupe, Calancacura, (of which Petrus Martyr Oc., Lib. ix, fol. 63, has made Caraqueira); the Cape land only Balaorcone; the low-land only Kaerebone; Portorico, or San Juan, Borriken or Oubouemoin. I have collected these names because the knowledge of them becomes indispensable to those who would study the geography of America at the beginning of the 16th century. I shall add some other names of islands, which, however, are not Carib: Guadaloupe, Guacana. (Gomara, Hist. fol. xxiii); Saint Domingo, or Isla Española, Haïti and Quizqueja. The first of these names signifies, in the language of the country, asperity, or mountainous place; the second, Great Land. (Gomara, fol. xvi); Cuba or Fernandina; Jamaica, Santiago; Trinidad, Cairi. The appearance of the Caribs is every where the same. Laet described those of the banks of the Marwina (Marony), two hundred years ago, exactly as I found the Caribs of the Llanos of Cari. \"Mares sunt procero et obeso corpore, capillis in orbem detonsis, instar coronæ sacerdotalis et cutem rubro colore tincti; velant pudenda panniculo quodam unum palmum lato et duos longo, cætera, nudi: fœminæ pusillo sunt corpore.\" (Descript. of the West Indies, p. 647. See also Archœol. Americana, Vol. i, p. 365—433.) The geographical denominations of Caribana, Carini, and Cariari merit some investigation. The gulph of Uraba, (gulph of canoes, for uru signifies canoe, Petr. Mart. p. 32 C.), into which the great Rio Atrato throws itself, (Rio San Juan or Rio Dabeiba), did not bear the name of the gulph of Darien in the 16th century. A province situated between the mouth of the Rio Sinu (Zenu), and that of the Atrato, was then called Caribana. Gomara (Hist. de las Indias, 1553, fol. 30) names the following places from east to west: \"Caribana, Zena, Carthagena, Zamba y Santa Marta.\" The cape that bounds the gulph of Darien, 84337=tening of the Earth. When a more intimate connexion is established between the free governments of La Plata and Venezuela, advantage will no doubt be taken of the public tranquillity, to execute, on the north and south of the equator, in the llanos and the pampas, the measurements we propose. The llanos of Pao and Calabozo are nearly under the same meridian as the pampas south of Cordova; and the difference of latitude of these plains, as smooth as if they had been levelled by a long abode of the waters, is forty-five degrees. These geodesic and astronomical observations would cost little, on account of the nature of the places. In 1734 La Condamine* showed how much more useful and expeditious it would have been, to have sent the academicians into the plains (perhaps somewhat too woody and marshy), that extend on the south of Cayenne toward the confluence of the Rio Xingu and Amazon, than to have compelled them to struggle, on the table-land of Quito, with cold, with tempests, and with the eruptions of volcanoes., 225145=the commencement of the year 1823, to 10,220,000, of these 1,623,000 being slaves. It was found in, 19264=† Nras Sra del Socorro del Cari, founded in 1761., 341016=after the province of Guipuscoa, and the kingdom of Valencia*, reckon the greatest number of inhabitants to the square league in all Spain; the maximum of America is, however, below the relative population of the whole of France (1778 to the square league), and would in the latter country be considered as a very thin population. If on the entire surface of America we direct our views to the object which engages our special attention in this chapter, the Capitania-general of Venezuela, we find that the most populous of these subdivisions, the province of Caraccas, considered as a whole, with-, 520674=quillity shall be re-established, we must go back again to the period which preceded the revolution. The annual average of the clear receipts of the whole contributions, from 1793 to 1796, without comprehending the farm of tobacco, was 1,426,700 piastres. In adding to this, 586,300 piastres as the net product of the farm (the average of the same period), we find the revenue of the Capitania general de Caracas, deducting the expence of collecting, to be 2,013,000 piastres. This revenue has gone on diminishing, on account of the difficulties of maritime trade, in the last years of the 18th, and the first years of the 19th century; but from 1807 to 1810 it rose to more than 2,500,000 piastres (of which 1,200,000 piastres arose from the customs, 700,000 from the farm of tobacco, and 400,000 from the alcavala of land and sea). All these receipts were absorbed by the expence of the administration; sometimes a surplus of 200,000 piastres was poured into the treasury of Madrid, but these examples were extremely rare. Since Caraccas has no longer received the situado of New-Spain, resources have from time to time been drawn from the no less impoverished bank of Santa-Fe. The gross revenue of all the provinces which now form the republic of Columbia, amounted, according to my researches, at the moment of the revolution,, 663069=The rapid increase of the population of the United States has been the basis of so many calculations of political economy in Europe, that it becomes highly interesting to know with precision the principal statements. In order to compare the numbers, and fix them with exactness, we must have recourse to the first sources, that is, to the tables printed by the Congress, and cleared of the typographical errors by which they are sometimes disfigured. The population of 1800, which was 5,306,032, is stated by Mr. Mellish (Travels, p. 566), at 5,308,844; by Mr. Seybert (Statist. Annals, p. 72), at 5,319,762; by Mr. Harvey (Edin. Phil. Journ. 1823, p. 42), at 5,309,758. I shall here transcribe a note, which I owe to the kindness of M. Gallatin, who long occupied the place of minister of the public treasure at Washington, and whose departure from Europe has recently caused so much regret to those who know how to appreciate talents, and generous sentiments., 313027=* Antillon, Geografia astronomica, natural y politica, 1815, p. 145., 699479=could not openly oppose the projects of his mother Queen Barbara, and the Portugueze party; the treaty, it was known, would be hostile to the interests of Spain, and all that remained was to gain time in creating obstacles. The craft constructed to convey the remainder of the troops beyond the cataracts, on the frontier of the Capitania general of Grand Para, were ready to sail, and the orders of King Ferdinand the 6th were precise. Yturiaga, caused a Te Deum to be sung at Muitaco (Vol. v, p. 689, &c.) and during the ceremony, set fire clandestinely to the fleet, which was said to have been burnt accidentally. But so little pains had been taken to conceal this stratagem, that it was instantly discovered. The Portugueze commissaries offered to send their own boats for Yturiaga, but he answered that he would wait for orders from Madrid. Ferdinand 6th, wearied of the expence and the delays of Yturiaga, recalled the expedition. Solano and Albarados embarked, I believe in 1761, at La Guayra, for San Sebastian. Yturiaga, after having long inhabited the small town of Muitaco, where he hoped to re-establish his health, died at the island of Marguerita. The complaints made against him by the monks, and by his colleagues the other commissaries of the boundaries, embittered the latter part of his life. Don Apollinario Diez de la Fuente returned from Spain to the Oroonoko with the pompous titles of Capitan poblador del Alto-Orinoco y Cabo militar del Fuerte de Cassiquiare; he was afterwards made governor of the province of Quixos, and Cosmografo de la real Expedicion de limites del Marañon. If we may judge from his manuscripts, the cosmographers assembled at the congress of Puente de Caya, in 1524, were better informed than this emissary., 517811=upon a more solid testimony than that of general Don Josè de Espeleta, who was viceroy of New-Grenada till 1796. This experienced officer, in a manuscript memoir, which is addressed to his successor, the viceroy Don Pedro de Mendinueta*, thus expresses himself on the defence of the isthmus of Panama: \"Your Excellency is informed that the king has caused his vast possessions in America to be visited by the Brigadier Cramer. That celebrated engineer has calculated the dangers to which we are still exposed, and indicated the fortifications which must be erected for defence. The isthmus of Panama is of the highest military importance, of which your Excellency ought not to lose sight for one instant. Its importance is founded on its geographical configuration, and its proximity to the South Sea; it presents three points of defence, Portobello, and the small fort of San Lorenzo de Chagre towards the north, and the town of Panama towards the south. The heights which command Portobello render it impossible to fortify to any good purpose that poor and ill-peopled town; the batteries of San Fernando, Santiago, and San Geronimo, appear to me sufficient for the defence of the port. The small fort of Chagre, at the mouth of the, 42088=† Petr. Mart., Dec. 2, lib. 1, p. 26 B, Dec. 3, lib. 5, p. 54 A., 358074=* I should here mention that in adopting the somewhat vague denominations of tierras, calientes, templadas, and frias, I fix the first between the coast and the elevation of 300 toises; the second, between 300 and 1100 toises; and the third, between 1100 and 2460 toises. The last number, that of the limit of perpetual snows, indicates, in the equinoctial region, the cessation of vegetable life., 369228=ceed each other in Venezuela from the north to the south along the coast towards the equator. Advancing in this direction, we may be said to traverse, in point of space, the different stations by which the human race has passed in the lapse of ages, in its progress towards cultivation, and in laying the foundations of civil society. The region of the shore is the centre of agricultural industry; the region of the Llanos serves only for the pasturage of the animals which Europe has given to America, and which live there in a half-savage state. Each of those regions contains from seven to eight thousand square leagues; further south, between the delta of the Oroonoko, the Cassiquiare, and the Rio Negro, lies a vast extent of land as large as France, inhabited by hunting nations, horrida sylvis, paludibus fœda. The productions of the vegetable kingdom which we have just enumerated belong to the zones at each extremity; the intermediary savannahs into which oxen, horses, and mules have been brought, since the year 1548, feed some millions of those animals. At the period of my travels, the annual exportation of Venezuela to the West India islands amounted to 30,000 mules, 174,000 ox hides, and 140,000 arrobes (of 25 pounds) of tasajo* or dried meat a little, 289136=latter river and the Guaporè, which is a tributary stream of the Madeira, the boundaries are disputed by the Portuguese; and it is uncertain if they ought to be extended on the south beyond the Rio Colorado as far as the Rio Negro, which receives the waters of the Rio del Diamante (Abeja Argentina 1822, N° 1, p. 8, and N° 2, p. 55). Amidst these uncertainties, which are augmented by the partition of Paraguay and the Cisplatine Province, I have calculated the dimensions of the vast territory of the viceroyalty, according to the limits traced on the Spanish maps before the revolution of 1810. Those limits are, on the east, the Marco, a little to the northward of the fort of Santa Teresa, at the mouth of the Rio Tahym; from thence they stretch to the N. N. W. by the sources of the Ibicuy and of the Juy (cutting the Uruguay in latitude 27° 20′) to the confluence of the Parana and the Yguazu; on the north along the left bank of the Parana as far as 22° 42′ south lat.; on the N. W. following the Ivineima, towards the presidency of Nova Coimbra (lat. 19° 55′), founded in 1775; on the N. N. W. near Villa Bella and the isthmus which separates the waters of the Aguapchy (a tributary of the Paraguay) and those of the Guaporè towards the junction* of the latter river with the Mamorè, below the fort of Principe (11° 54′ 46″ south lat); on the S. W. ascending the Mamorè and the Maniqui, as we, stated above when we traced the limits of Peru and the viceroyalty of Buenos Ayres. Between the 21° 26′ and 25° 54′ of south lat. (between the Rio de Loa and Punta de Guacho), the territory of the viceroyalty reaches beyond the Cordillera of the Andes, and occupies for a distance of ninety leagues the coast of the South Sea. Here lies the desert of Atacama, in which is situated the small port of Cobija, which might, 322602=the Atlantic states, considered together, is 240. The extremes (North Carolina and Massachusets) are only in the relation of 1 to 7, nearly as in France*, where the extremes, in the department of the Upper Alps and of the North, are also in the relation of 1:6,7. The oscillations from the mean number, which we generally find restricted to narrow limits in the civilized countries of Europe†, exceed, so to speak, all, 149417=* The map de la Isla Margarita y de sus canales, published by Mr. Fidalgo in 1816, indicates very clearly these geognostic relations., 351863=* Between 800 and 1600 toises above the level of the sea. It may appear surprising that in equinoctial America, countries are called cold, of which the temperature of the year rises above that of Milan and Montpellier; but it must not be forgotten that in those cities the mean temperature of the summer is 22·8° and 24·3°; while at Quito, for instance, the days are generally during the whole year, between 15·6° and 19·3°, and the nights between 9° and 11°. The heat never rises beyond 22°; and the cold +6° of the centigrade thermometer. The tierras frias, at the, height of Santa-Fe (1365 toises), and Quito (1492 toises), have, during the whole year, the temperature of Paris in the month of May. As the division of heat at various times of the year is so different in the torrid and the temperate zones, in order to give an exact idea of the climate of any spot situated in the neighbourhood of the equator, the surest method is to compare it with the temperature of a month in the temperate region of Europe., 683479=In comparing the area of the great divisions with the number of inhabitants which the enumeration of 1820 yields, we find:, 471151=* This point, near the openings of the wood of Campeche, (Cortes de Madera) had attracted the attention of the commercial world long before the publication of the excellent work on Jamaica, by Mr. Bryan Edwards. See La Bastide, Mem. sur le passage de la mer du Sud à la Mer du Nord, p. 7. There is a triple possibility of forming the canal of Nicaragua (as I have already stated in the Political Essay) either from the lake of Nicaragua to the gulf of Papagayo, or from that lake to the gulf of Nicoya, or from the lake de Leon, or Managua, to the mouth of the Rio de Tosta (and not from the lake de Leon to the gulf of Nicoya, as is asserted by the usually well-informed editor of the Biblioteca Americana, 1823, Agosto, p. 120.) Does there exist a river that flows from the lake of Leon to the Pacific Ocean? Of this I doubt, although ancient maps mark the communications between the lakes and the sea (Political Essay, Vol. i, p. 25). The distance from the south-east extremity of the lake of Nicaragua to the gulf of Nicoya, is very differently indicated (from 25 to 48 miles) in Arrowsmith's map of South America, and in the fine map of the depot of Madrid, bearing the title of Mar de las Antillas, 1819. The breadth of the isthmus between the eastern shore of the lake of Nicaragua, and the gulf of Popagayo is from 4 to 5 marine leagues. The Rio San Juan has three mouths, of which the two smallest are called Taure and Caño Colorado. In one of the isles of the lake of Nicaragua, that of Ometep, there is a volcano, said to be still burning., 456562=* Relacion del estado del Nuevo Reyno de Grenada que hace et Arzobispo Obispo de Cordova a su sucesor el Exc. Sr. Fray, Don Francisco Gil. y Lemos 1789, fol. 68. (A manuscript written by the Secretary of the Archbishop-Viceroy, Don Ignacio Cavero.) Representacion que dirigio Don Jose Ignacio Pombo al Consulado de Cartagena en 14 de Mayo 1807, sobre el reconocimiento del Atratoes Zinù y San Juan, fol. 38 (MS.) The ravine of Raspadura, or Bocachica, now receives only the waters of Quebradas de Quiadocito, Platanita, and of Quiado. According to the ideas I acquired at Honda and Vilela, near Cali, from persons in the trade of (rescate) the gold dust of Choco, the Rio Quibdo, which communicates with the canal of the Mina de Raspadura, joins the Rio Zitura and the Rio Andageda, near the village of Quibdo, vulgarly called Zitura; but in a manuscript map which I have just received from Choco, and on which the canal of Raspadura (lat. 5° 20′?) joins both the Rio San Juan and the Rio Quibdo, a little above the Mina de las Animas, the village of Quibdo is placed at the confluence of the small river of that name, with the river Atrato, which has received three leagues higher the Rio Andagueda, near Lloro. The grand Rio San Juan receives successively from its mouth (lat. 4° 6′) at the south of the Punta de Charambira, in going up towards the N.N.E., the Rio Calima, the Rio del Nò (above the village of Naonama), the Rio Tamana, which passes near the Novita, the Rio Irò, the Quebrada de San Pablo, and finally, near the village of Tadò, the Rio de la Platina. The province of Choco is inhabited only in the vallies of those rivers: it has three trading communications; in the north with Carthagena by the Atrato, the banks of which are entirely desert from 6° 45′ of latitude; in the south with Guayaquil, and, before 1786, with Valparaiso, by the Rio San Juan; in the east with the province of Popayan, by the Tambo de Calima, and by Cali. From Tadò to Noanama, in going down the Rio San Juan, takes one day; to the Tambo de Calima (lat. 4° 12′) 4 days; and from the Tambo to Cali (lat. 3° 25′), in the valley of Cauca, 5 days; during which you cross the Rio Dagua, or San Buenaventura, and the western Cordillera of the Andes of Popayan. I have entered into these local details, because the maps confound the ravine of Respadura, which serves as a canal, with the portages of Calima and San Pablo. The arastradero of San Pablo leads also to the Rio Quibdo, but several leagues above the mouth of the canal of Raspadura. The road of the arastradero of San Pablo is usually taken for the conveyance of merchandize (generos) sent from Popayan, by Cali, Tambo de Calima, and Novita, to Choco del Norte, that is to Quibdo (Zitara). The geographer La Cruz, calls the whole isthmus between the sources of the Rio Atrato and the Rio San Juan, Arastradero del Torò. (On the height of the Zone of Gold, Semanario de Santa Fe, Vol. i, p. 19.), 47947=* The province of Confachiqui, subject in 1541 to a woman, is become celebrated by the expedition of Hernando de Soto to Florida. (Her. Dec. 7, p. 21.) Among the nations of the Huron tongue, and the Attakapas, the supreme authority was also often confided to women. Charlevoix, vol. v, p. 397; Filson, p. 185.), 254073=NEW SPAIN. The surface of this vast country has been calculated with great care by Mr. Oltmanns, according to the limits marked on my large map of Mexico. There will soon probably be some changes on the north of San Francisco and beyond the Rio del Norte, between the mouth of the Rio Sabina and that of the Rio Colorado de Texas. The assertions made on my map of Mexico, drawn in 1804, and published in 1809, relative to the identity of the Rio Napestle and the Rio de Pecos, with the rivers which bear the names of Arkansas, and the Red River of the Natchitotches in Louisiana, have been fully justified by the journey of major Pike, which appeared at Philadelphia in 1810., 405640=* In the commercial register published at Vera-Cruz, the imports and exports made on account of the government are not included. For instance, in the year 1802, the extent of trade (the same of the exports and imports), is indicated at 60,445,955 piastres. If to this had been added the amount of 19½ millions of piastres embarked on the king's account, and the value of mercury and paper for cigares, received on account of the Real Hacienda, the extent of trade, in 1802, would have been 82,077,000 piastres; and in 1803, it would have been 43,897,000 piastres instead of 37,379,637., 373636=The consumption at Mexico, of which the population is four or five times less than that of Paris, does not exceed 16,300 oxen; consequently it does not appear much greater than at Paris; but we must not forget, 1st, that Mexico is situated on a table-land cultivated with corn, and far from pasturage; 2d, that this town reckons nearly one-fourth of copper-coloured Indians among its inhabitants, who eat little meat; and 3d, that the consumption of sheep is 273,000, and of hogs at Mexico is 30,000; while at Paris, notwithstanding the enormous difference of population, it was in 1819 only 329,000 of the former, and 65,000 of the latter. See above, Vol. iii, p. 464, 465; Vol. vi. p. 76, and my Political Essay on New Spain, Vol. ii, p. 68†. Recherches stat. sur la ville de Paris, par le comte de Chabrol; 1823, tableau 72., 689259=The discussions concerning the boundaries between the courts of Madrid and Portugal, have lasted during three centuries. They at first touched only on maritime interests, the possession of islands and coasts; by degrees they have extended to the interior of South America. The celebrated bull of pope Alexander 6th (May 4th, 1493) in favor of Spain, was made in the same spirit as the less known bull of the year 1445, issued by pope Nicolas 5th in favor of Portugal. The former places the line of demarcation an hundred leagues east of the Islands of Azores and Cape Vert, and gives to the Spaniards all that on the west of that line had not been occupied before Christmas in the year 1492. It says confusedly enough, centum leucas a qualibet insularum quœ vulgariter nuncupantur de las Azores y Cabo Verde. Cardinal Bembo, who, in his classical style, proscribes all new denominations, simply says, Gorgonum insulœ, no doubt (Pliny according to Xenophon de Lampsaeo, lib. 6, c. 31, Meta, lib. 3, c. 9,) the Gorgades (domus, ut aiunt, aliquando Gorgonum) opposite the Byssadium Promontarium. The island of Saint Anthony is, no doubt, in the meridian of the island of San Michael, but there are 8° of longitude from the meridian of the most western island to the meridian of the most eastern of the Azores. A new bull of the 24th November, 1493, leaves the same doubts; but in the treaty of Tordesillas (June 7, 1494), the meridian of the demarcation was carried to 370 leagues, instead of 100, from the Cape Vert islands. The measure of the leagues not having been indicated, the, 2040=DURING THE YEARS 1799—1804,, 123932=* Plaza Mayor. This is only the result of six circummeridian heights of Canopus, taken in the same night. Las Memorias d'Espinosa (vol. ii, p. 80) give 10° 9′ 6″. Mr. Ferrer found (Conn. des Tems, 1817, p. 322) 10° 8′ 24. I know not where these observations were made, but I believe they give the latitude too far north. For, at Caraccas, Guyana, and the Havannah, my observations differed only a few seconds from those of Mr. Ferrer. The difference of latitude between the town and the Morro appeared to me to be 3′ 40″. I have elsewhere discussed the longitude of Nueva Barcelona, and the results of my chronometrical determinations compared with those of Messrs. Fidalgo and Ferrer (Observ. Astr. Tom. ii, p. 80). On the banks of the Rio Unare, and farther west on the Rio Ucheri, near the beautiful valley of Cupira, so abundant in cacao, there existed two other towns in the seventeenth century, by the names of Tarragona and San Miguel de Batei., 407576=mixed race*, and that the manufacturing industry of that fine country is already so much advanced that the value of its home fabrics in wool and cotton, in 1821, amounted to 10 millions of piastres per annum†. In deducting the indian population, whose wants are almost entirely restricted to the productions of the soil, from the total population of Venezuela and Mexico, we find in the former country, that the consumption of the productions of foreign industry, amount to 10 piastres, and in the latter, to 8 piastres for every individual of all ages and both sexes. These results shew, that when we consider the great masses only, the state of society appears nearly the same in the most distant parts of Spanish America, notwithstanding the varying influence of physical and moral causes., 399453=* I communicated many details respecting the merchandize registered in the custom houses of Spain, for the ports of Terra Firma, in 1795, to M. Dauxion-Lavaysse, which he inserted in his Voyage à la Trinité, Tom. ii, p. 464, I drew my information from a very instructive memoir of the Count de Casa Valencia, on the means of vivifying the trade of Caraccas. M. Urquinaona (Relac. docum., p. 13), estimates the total of the exports of Venezuela, in 1809, at eight millions of piastres., 701284=The labors of the commission of the boundaries of the Oroonoko which I have just related, were also as fruitless as the treaty signed January 12th, 1750, at Madrid, by which the Portugueze and Spanish nations re-, 230017=Having continued during some years to make laborious researches concerning the population of the new states of Spanish America, of the West Indian Islands, and of the wandering Indian tribes in both Americas, I think I may attempt afresh to trace a sketch of the total population of the New World for the year 1823., 239243=between the little Portuguese fort of San Juaquim and the sources of the Rio Carony* (lat. 3° 0′—3° 45′). Some stones (piedras de marco) have been placed to mark the limit between Spanish and Portuguese America; and are decorated† with the following pompous inscription: Pax et Justitia osculatæ sunt. Ex pactis finium regundorum Madridi Idibus Jan. 1750; but the connexion of these points, very distant from one another, the definitive fixation of the limits, and their solemn recognition, have never been obtained. All that has hitherto been done is regarded only as provisional, and in the meantime the two neighbouring nations, without relinquishing the extension of their rights, maintain a state of peaceable possession. We have mentioned above, that, if a canal of 5,300 toises long‡ were substituted for the portage of Villa Bella (15½°), between the Rio de la Madeira and the Rio Paraguay, an inland navigation would be opened between the mouth of the Oroonoko and that of the Rio de la Plata, between Angostura and Montevideo. The course of the great rivers in the direction of the meridians would perhaps afford a natural boundary between the, 318899=empire 87; Sweden with Norway, 90; European Russia*, 320; Spain, 763; and France, 1778. But these estimates of relative population, when applied to countries of immense extent, and of which a great part is entirely uninhabited, furnish mathematical abstractions that afford little instruction. In countries uniformly cultivated,, 79992=which flows into the Oroonoko above the confluence of the Carony, and which D'Anville (I know not on what authority) has marked in the first edition of his great map as issuing from the lake of Valencia, and receiving the waters of the Guayra, could never have served as a natural canal between two basins of rivers. No bifurcation of this kind exists in the steppe. A great number of Caribbee Indians, who now inhabit the missions of Piritoo, were settled formerly at the north and east of the table-land of Amana, between Maturin, the mouth of the Rio Arco, and the Guarapiche; it was by the incursions of don Joseph Careno, one of the most enterprising governors of the province of Cumana, that a general migration of independant Caribbees toward the banks of the Lower Oroonoko in 1720 was occasioned., 339806=* Is there a part of the United States, from 600 to 1000 square leagues in extent, of which the relative population exceeds the maximum of New Spain, which is 1300 inhabitants to the square league, or 109 to the square mile, 69·2 to a degree? The relative population of Massachusets, which is 75·5 to the square mile, and is regarded as very considerable, has hitherto led me to doubt this. In order to examine the question we must be able to compare the superficies of a certain number of bordering provinces with the registers of population published by the congress of Washington. The relative population of the States of New York, Pensylvania, and Virginia, appear so small (240, 204, and 168, to the square marine league) only because in distributing the population uniformly over the whole extent of territory, we must include the regions partly desert, possessed by each state on the west of the Alleghanis, regions which have an influence on the total average, nearly in the same manner as the Llanos of Caraccas and Cumana. Egypt contains 11,000 square leagues, of which only 1408 are inhabited., 122878=quistador, Juan Urpin, in 1637. A fruitless attempt was then made, to give the whole province the name of New Catalonia. As our maps often mark two towns, Barcelona and Cumanagoto, instead of one, and the two names are considered as synonimous, it may be useful to clear up the cause of this error. Anciently at the mouth of the Rio Nevers, there was an Indian town, built in 1588 by Lucas Faxardo, and named San Cristoval de los Cumanagotos. This town was peopled solely by natives who came from the saltworks of Apaicuare. In 1637, Urpin founded, two leagues farther inland, the Spanish town of Nueva Barcelona, which he peopled with some of the inhabitants of Cumanagoto and many Catalonians. For thirty-four years quarrels were incessantly arising between the w o neighbouring communities, till 1671, when the governor Angulo succeeded in persuading them, to unite on a third spot, where the town of Barcelona now stands; the latitude of which, according to my observations*, is 10° 6′ 52″., 581869=tives of Florida. Luis Velasquez de Ayllon found in his expedition (1520), on the coast of Chicora and at the mouth of Rio Jordan (between Savannah and Charlestown, in south Carolina), a race of Indians as tall as the Caribs, but with long hair, \"Por aqella casta arriba hombres hai mui altos y que parecian gigantes.\" (Gomara, fol. 22. Herera, Dec. ii, p. 250. Læt., p. 96.) The travellers of the 16th century, who, like modern travellers, had the rage of explaining every thing, believed that the Indians of Chicora softened their bones by taking the juice of herbs, and lengthened their members by stretching them out from time to time. With respect to the Asiatic origin (Araméenne) of the Caribs, we shall only mention further the Pheuician and Roman money, which it is asserted has been found in the United-States; it was pretended that this money was of the 3rd century, and had been discovered in a cavern near Nashville; but it is now known (Archœologia, vol. i. p. 119.) that they were buried there either to deceive, or accidentally, with English money, by European planters. The Carthaginian money of Louisiana is fit to be placed by the pretended inscriptions of Dighton, found in the bay of Naraugaset, and on which Count de Gebelin has founded such absurd hypotheses. (View of the Cordilleras, vol. i. p. 60.) Is it very certain that the fine shell, 9 inches long and 7 broad, discovered in a tumulus near Cincinnati, is identical with the Cassis cornutus of the archipelago of the Asiatic islands? (Long's Exped. vol. i. p. 64)., 485788=† Ducros Memoires sur les quantités d'eau qu'exigent les canaux de navigation, 1800, No. II. p. 41., 447802=* See my Political Essay, Vol. iv, p. 348. In comparing the two maps Deposito hydrografico de Madrid, bearing the title Carta eserica del Mar de Antillas y de las Costas de Tierra Firme desde la isla de la Trinidad hasta el golfo de Honduras, 1806, and the Quarto Hoja que comprehende la provincia de Cartagena, 1819, we see how well founded were the doubts I announced fifteen years ago, on the relative position of the most important points of the southern and northern coasts of the isthmus. Panama was anciently believed (Don Jorge Juan. Travels in South America, Vol. i, p. 99), to be 31′ to the west of Portobello. La Cruz (1775), and Lopez (1785) have followed this supposition, founded only on a plan of the direction of the route, taken with a compass. But in 1802, Lopez (Mapa del Reyno de Tierra Firme y sus provincias de Veragua y Darien) began to place Panama 17′ to the east of Portobello. In the map of the Deposito of 1805, this difference of meridians was reduced to 7′; finally, the map of the Deposito of 1817 places Panama 25′ east of Portobello. The following are other differences of latitude on which the breadth of the isthmus depends:—, 350406=Tobacco. The tobacco of Venezuela is not only very superior to that of Virginia, but yields in quality only to the tobacco of the island of Cuba and the Rio Negro. The establishment of the royal farm in 1777, has prevented the opening of this important branch of commerce to the trade of Varinas, and of the vallies of Aragua and Cumanacoa. The total produce of the sale of tobacco at the beginning of the 19th century, was 600,000 piastres. (Vol. i, p. 57; Vol. iv, p. 168, and Vol. v, p. 368.) When the king of Spain, during the ministry of Don Diego Gardoqui, declared, by his cédule of September 30, 1792, that he would consent to deliver the country of the farm (estanco), it was proposed to substitute a general capitation on the monopoly of the fabrication of brandy from the sugar cane, (aguardiente de cana) or other taxes not less vexatious. These projects failed, and the farm of tobacco was continued., 78568=Nueva Barcelona. As we advanced, the sky became more serene, the soil more dusty, and the atmosphere more fiery. The heat, from which we suffered, is not entirely owing to the temperature of the air, but is produced by the fine sand mingled with it, that darts in every direction, and strikes against the face of the traveller, as it does against the ball of the thermometer. I never observed however the mercury rise in America, amid a wind of sand, above 45·8° cent. Captain Lyon, with whom I had the pleasure of an interview on his return from Mourzouk, appeared to me also inclined to think, that the temperature of fifty-two degrees, which is so often felt in Fezzan, is produced in great part by the grains of quartz suspended in the atmosphere. Between Pao, and the village of Santa Cruz de Cachipo, founded in 1749, and inhabited by five hundred Caribbees*, we passed the western elongation of the little table-land, known by the name of Mesa de Amana. This table-land forms a point of partition between the Oroonoko, the Guarapiche, and the coast of New Andalusia. It's height is so inconsiderable, that it would scarcely be an obstacle to the establishment of an inland navigation in this part of the Llanos. The Rio Mano however,, 222495=CHILI. An enumeration, made in 1813, gave 980,000 souls, Mr. d'Yrisarri, who fills an important office in the government of Chili, thinks, that the population may already have attained 1,200,000., 342038=out excepting the Llanos, has, as yet, only the relative population of Tennesée; and that this province, without the Llanos, furnishes in the northern part, on more than 1800 square leagues, the relative population of South Carolina. Those 1800 square leagues, the centre of agriculture, are twice as well peopled as Finland, but still a third less than the province of Cuenca, the least populous of all Spain. We cannot dwell on this result without a painful feeling. Such is the state in which colonial politics, and the folly of the public administration, have, during three centuries, left a country of which the natural riches may vie with all that is most wonderful on earth, that in order to find one equally desert, we must look either towards the frozen regions of the north, or to the westward of the Alleghani mountains, towards the forests of Tennesee, where the first clearings have only begun within the last fifty years!, 467899=canal. The former of those works, constructed from 1777 to 1784, joins the Baltic with the North Sea, between Kiel and Tonningen; having only six locks, and passing over a bar of 28 feet. It separates the continental part of Denmark from Germany, and enables vessels of an ordinary size to avoid the dangerous passage of the Cattegat and the Sound. It receives ships of from 140 to 160 tons*, coming from the ports of Russia and Prussia, and going to England, the Mediterranean, Philadelphia, the Havannah, and the western coast of Africa. These vessels draw only from 8 to 10 feet of water†. Being generally constructed in Holland or in the Baltic, the ribs are very flat, and they are consequently spacious without drawing much water. The Caledonian canal, not the most useful, but unquestionably the most magnificent hydraulic work hitherto undertaken, is an oceanic canal in the strictest sense of the terms. It unites the eastern and western seas of Scotland, between Inverness and Fort William, in a neck of land across which nature, 187285=I am not ignorant, that travellers, who have recently visited America, regard this progress as far more rapid than the numbers on which I have fixed in my statistical researches seem to indicate. For the year 1913 they promise one hundred and twelve millions of inhabitants in Mexico, of which they believe that the population is doubled every twenty-two years; and for the same epocha one hundred and forty millions in the United States*. These numbers, I confess, do not affright me from the motives, that would alarm the zealous disciples of the system of Malthus. Two or three hundred millions of men may very possibly find subsistence one day in the immense extent of the new continent, 295047=territory extends even beyond the Juy, towards the plains where the most northern mission of San Angel is placed; farther on, are forests inhabited by independent Indians. When, in consequence of the alliance between Spain and France, England, in February 1801, made the Portuguese declare war against Spain, the Spanish province of the Missions was easily invaded. The hostilities did not last long; and although the court of Madrid disputed the legality of the occupation, the Missions remained in the hands of the Portuguese. The treaty of 1777 ought to constitute the basis of the limits between the viceroyalty of Buenos Ayres, and the captain-generalship of Rio Grande. Those limits were formed by a line extending first to the Rio Guaray (the Guaney of Arrowsmith), and the sources of the small rivers Ibirapuita, Nanday and Ibycuimerim, that empty themselves into the Ibicuy, (lat. 29° 40′) at the confluence of the Rio de Ponche Verde with the Ibicuy, then continuing towards the south-east, to the source of the Rio Negro, (a tributary stream of the Uruguay), it crosses the lake Merin, towards the mouth of the Itahy, vulgarly called Tahym. The most southern Portuguese marco is found at the mouth of this river, on the sea coast. The country between the Tahym and the Rio Chuy, a little north of Santa Teresa, was neuter, and bore the name of Campos neutraes; but, notwithstanding the diplomatic conventions, it was in 1804 already occupied for the most part by Portuguese cultivators. The invasion of Spain by the French, and the revolutions of Buenos Ayres, have given the Brazilians facility to push their conquests as far as the mouth of the Uruguay, so that the new interior limits, between antient Brazil and the countries recently occupied, were fixed in 1821, without the intervention of the congress of Buenos Ayres, by the deputies of the cabildo of Montevideo, and of the captain-generalship of Rio Grande. It was agreed that the Cisplatine Province of Brazil (the Oriental Band, according to the geo-, 41638=* The map of Hondius, of 1599, which accompanies the Latin edition of the narrative of Raleigh's voyage. In the Dutch edition (Nieuwe Caerte van het goudrycke landt Guiana), the Llanos of Caraccas, between the mountains of Merida and the Rio Pao, bear the name of Caribana. We may remark here, what we observe so often in the history of geography, that the same denomination has spread by degrees from west to east., 429174=passing by Chihuitan and Petapa. This road was opened in 1798 and 1801, and the indigos of Guatimala, as well as cochineal and salt provisions, have long been conveyed by that route to Vera Cruz and the island of Cuba., 533852=Bacon* has said, in his Political Aphorisms, that \"it would be happy if nations would always follow the example of time, the greatest of all innovators, but who acts calmly, and almost without being perceived.\" This happiness does not belong to colonies when they reach the critical period of their emancipation; and least of all to Spanish America, engaged in the struggle at first, not to obtain its complete independence, but to escape from a foreign yoke. May the agitations of party be succeeded by a double calm! May the germ of civil discord, disseminated during three centuries to secure the dominion of the mother country, be stifled by degrees; and productive and commercial Europe become more persuaded, that to perpetuate the political agitations of the New World would be to impoverish itself, in diminishing the consumption of its productions, and depriving itself of a market which already amounts, 532118=tems or groupes of states, confederations variously graduated would result. I here only touch on the relations that arise from this singular assemblage of colonies on an uninterrupted line of 1600 leagues in length. We have seen in North America, an old atlantic state divided into two, and each having a different representation. The separation of the Maine and the Massachusets, in 1820, was made in the most peaceable manner. Schisms of this kind will no doubt frequently occur in the Spanish colonies; but their moral state will, it may be feared, render such changes turbulent. When a people of European race naturally incline towards provincial and municipal independence, while the copper-colored natives have a no less decided taste for political divisions of territory, and the liberty of small communes, the best form of government is that which, without openly struggling against a national predilection, renders it the least hurtful to the general interest, and the unity of the whole body. It may be observed further, that the importance of the geographical divisions of Spanish America, founded at the same time on the relations of local position, and the habits of several centuries, have prevented the mother-country from retarding the separation of the colonies by attempting to establish Spanish princes in the New World. In order to rule such vast pos-, 198548=I FOUND the whole extent of South America, taking for the limit the eastern extremity of the Province of Panama, to be 571,290 square leagues; of which the Spanish part, that is Columbia (without the isthmus of Panama and the province of Veragua), Peru, Chili, and Buenos Ayres (without the Magellanic lands), comprise 271,774 square leagues; the Portuguese possessions, 256,990 square leagues; the English, Dutch, and French Guyana, 11,320 square leagues; and the lands of Patagonia, south of Rio Negro, 31,206 square leagues. The following numbers, indicating great extents of surface, may serve as terms of comparison*. Europe, 304,700 square leagues; Russian empire in Europe and Asia, 603,160 square leagues; European part of the Russian empire, 138,116 square leagues; United States of America, 174,310 square leagues. The whole of these estimates are made in square leagues of twenty to an equatorial degree, or 2853 toises. I have adopted this measure in the Personal Narrative of my voyage, because nautical leagues, of three miles each, would be more easily adopted uniformly, as a geographical measure, among the commercial nations of Spanish America, than the leguas legales and leguas communes of Spain, which are twenty-six and a half, and nineteen to a degree. In the Political Essay on the, 306721=UNITED STATES, I have already remarked in another place (Political Essay, Vol. i, p. 13), that it became difficult to estimate the surface of the territory of the United States, in square leagues, since the acquisition of Louisiana, of which the northern and eastern boundaries long remained undetermined. They are now fixed by the convention concluded in London, October 20th, 1818, and by the treaty of the Floridas, signed at Washington, February 22d, 1819. I have therefore thought I might make this question the subject of fresh researches. I have devoted myself to this task with the greater care, as the surface of the United States, 553142=Indian village, with two public squares, houses with several stories, as in the Casas Grandes, and streets in parallel lines. The natives of these countries, near which the first station of the Mexican nations is placed, have long beards, like the Ainos (inhabitants of Tarakai) of eastern Asia. These are the Yabipais, whose language differs essentially from that of the Asteques. This analogy of construction among the present and the ancient inhabitants, whatever may be the superiority of the latter in their civilization, is a very curious phenomenon. I know how little confidence can be placed in the narratives of Fray Marcos de Niza; but it cannot be doubted that in the middle of the 16th century, a small centre of civilization was still preserved in the regions, situated on the north of New Mexico, at Cibora, and at Quivira. When well-informed travellers shall one day have explored the plains between the Rio Colorado and the Rio Colombia, those plains which the ecclesiastic Escalante went partly over in 1777, it will be important to compare the present state of the country, and above all the names of places, with the detailed journals we possess of the expedition of Francisco Vasquez de Cornado (1540). The Spanish historians give strange variations to the names of places and men in this Mexican Dorado; (Harac, Tinhex, Cicuic, Acuc, Huex, Tutonteac, and the name of that king Tatarax, Señor de las siete ciudades, who was made a kind of Prester-John; \"Hombre barbudo, que rezava en oras, que adorava una cruz de oro, y una imagen de muger, Señora del cielo.\" (Gomara, Hist. de las Indias, 1553, fol. cxvii; Herera Decad. vi, p. 157, 204; Laet, p. 297—304; Viaje al Estrecho de Fuca, p. 27; Political Essay, ii. 277; View of the Cordilleras and Monuments, Vol. i, p. 307, 318; Personal Narrative, Vol. v. p. 844.) The Conquistadores placed Cibora, no doubt vaguely (according to the name of the bisons, cibolas, or cows with humps, and long hair, vacas carcobadas), in lat. 30° 30′; Quivira, in latitude 40°., 210967=pulous in the provinces of Maracaybo, both around the lake, and in the mountains of Merida and Truxillo. Among the 780,000, or 800,000 inhabitants, which we may suppose in the Capitania general of Caraccas in 1800, there were probably nearly 120,000 Indians of pure race. The official documents* give 25,000 for the province of Cumana (15,000 of them for the missions of Caripe alone); 30,000 for the province of Barcelona (of which 24,700 are in the missions of Piritoo); 34,000 for the province of Guayana (that is, 17,000 in the missions of Carony, 7000 in that of the Oroonoko, and nearly 10,000 living in a state of independance in the Delta of the Oroonoko and in the forests). These statements suffice to prove, that the number of copper-coloured Indians in the Capitania general is neither 72,800 nor 280,000, as it has recently been erroneously asserted. (Depons, tom. i, p. 178; Malte-Brun, Geogr., tom. v, p. 549). The first of these authors, who estimates the total population at only 728,000, instead of 800,000, has singularly exaggerated the number of slaves. He reckons 218,400 (tom. i, p. 241). This number is almost four times too great (See above, vol. iii, p. 433). According to partial estimates, made by three persons to whom the localities were well known, don Andres Bello, don Louis Lopez, and don Manuel Palacio Faxardo, in 1812, there existed 62,000 slaves at the utmost, of whom there were, 666513=3dly, Louisiana having been acquired only in 1803, could not be comprehended in the enumerations of 1790 and 1800. According to the enumerations made in 1799–1802 by the Spanish government, the population of Louisiana was in 1800:, 341643=* We find in the kingdom of Valencia 1860, and in the Guipuscoa, 2009, to the square league; but the latter province, containing only 53 square leagues, should be excluded, according to the principle which I have adopted in these researches. Galicia has an actual population of 1,400,000, and the kingdom of Valencia of 1,200,000., 121322=countries, contributed to procure for him his liberty. We had endeavoured to soften his captivity by visiting him in his prison; and we had now the satisfaction of finding him in the midst of his family. His physical complaints had been aggravated by confinement; and he has sunk into the grave, without having seen the light of those days of independance, which his friend, don Joseph España, had predicted at the moment of his execution. \"I die,\" said this man formed for the accomplishment of grand projects*, \"I die an ignominious death; but my fellow citizens will soon piously collect my ashes, and my name will reappear with glory.\" These remarkable words were uttered in the public square of Caraccas, on the 8th of May, 1799; they were repeated to me the same year by persons, some of whom abhorred the projects of España, as much as the others deplored his fate., 693102=century, the establishment of la Colonia de San Sacramento, near the mouth of the Rio de la Plata, gave rise to disputes respecting the Brazilian limits. The Spaniards destroyed this settlement, and a new congress of cosmographers assembled at Puente de Caya, which lasted from the 4th of November [1681], to the 22d of January, 1682. It had been stipulated at the beginning of the negociations, that if they were not settled in the space of three months, they should be submitted to the decision of the Sovereign Pontiff. When we consider the state of the world an hundred years before the declaration of independence of the United States, we are tempted to doubt what is proved by the most authentic documents preserved in the archives. It was uselessly discussed, whether the 370 leagues mentioned in the treaty of Tordesillas, formed 22° 14′, or a less number of degrees, and whether that distance ought to be reckoned in the archipelago of Cape Vert, from the centre of the island of Saint Nicolas, or (as the Portugueze insisted), from the western extremity of the island of Saint Anthony. According to these detached arguments, the cosmographers of Lisbon sought to carry the meridiano de demarcacion 13 leagues west of the reconstructed settlement of San Sacramento. The congress of la Puente de Caya separated without having decided any thing, and the points in litigation were not submitted to the sovereign Pontiff as had been agreed. During the feeble reign of Charles 2d, the Portuguese gained every where upon their neighbours in America, on the side of Paraguay, on the banks of the Amazon, and on the Rio Negro. By the peace of Utrecht, Spain renounced the possession of San Sacramento. Nearly forty years passed in the most complete inactivity on the part of the ministry of Madrid, when Queen Barbara, daughter of John 5th of Portugal, sought to avail herself of the extreme weakness of her husband Ferdinand 6th, king of Spain, in order to be useful to her country, and terminate the struggle respecting the limits in South, 283160=vante. On the north-east, the easternmost province of New Grenada, called Provincia del Rio Hacha, is separated by the Rio Enea from the province of Santa Marta. In 1814 the Rio Guaytara divided the province of Popayan from the presidency of Quito, to which belonged the province of Los Pastos. The isthmus of Panama and the province of Veragua have at all times been dependent on the Audiency of Santa Fe., 40254=* Labat, Voy., vol. vi, p. 129. Rochefort, p. 326. Bibl. Univ., 1817, p. 355. Is the word Igneris (Iyeris?) a corruption of Eyeris, which, as we have just seen, signifies man in the dialect of the Caribbee women? This employment of the word man is very common in ethnographic names., 170825=fortnight. Having lost all hope of the arrival of a packet from Cumana, we availed ourselves of an American vessel, laden at Nueva Barcelona with salt provision for the Isle of Cuba. We had now passed sixteen months on this coast, and in the interior of Venezuela. Although we had still more than fifty thousand francs left in bills of exchange on the first houses at the Havannah, we should have felt a very distressing want of funds, if the governor of Cumana had not made us all the advances we wished. The delicacy of Mr. d'Emparan's conduct toward strangers, who were entirely unknown to him, claims the highest praise, and the warmest gratitude. I mention these personal incidents, in order to warn travellers not to trust too much to the communications between the different colonies of the same country. In the state of commerce at Cumana and Caraccas in the year 1799, it would have been easier to make use of a draught upon Cadiz or London, than upon Carthagena, the Havannah, or Vera Cruz. We parted from our friends at Cumana on the 16th of November, to make the passage for the third time across the gulf of Cariaco to Nueva Barcelona. The night was cool, and delicious. It was not without emotion, that we saw for the last time the disk of the Moon illuminating the summit of the cocoa-trees, that surround the, 575105=on the east, still bears the name of Punta Caribana, as I have already mentioned in the text. In speaking of Alonzo de Ojeda, Gomara says, \"Saliò a tierra en Caribana (solar de Cariben como algunos quieren) que esta a la entrada del golfo de Uraba. Del golfo de Uraba cueutan 70 leguas hasta Cartagena. Otro golfo esta en medio del Rio Zenù y Caribana de donde se nombran los Caribes.\" (L. c., fol. ix et xxxi.) Further eastward, the Caramares Indians (Caramairi), inhabitants of the coast where the port of Carthagena is now situated, believed also that they were of Carib origin. (Petr. Mart. Oc. p. 26, Her. Dec. 1, p. 179.) Herera, generally very exact in his geographical information, calls a bay on the eastern coast of Veragua, Caribaco, a circumstance the more fitted to fix attention, as the nations termed Caribs of Uraba, placed their first dwellings beyond the Rio Darien or Atrato. \"Decian los Indios de esta region que havia tido su naturaleça pasado el Gran Rio de Darien.\" (Dec. 1, p. 202.) But the most ancient name of the bay of Caribaco, between Cartago and the Laguna Chiriqui, is Caravaro, or Corobaro. (Gomara Hist., fol. viii. Her. Descr., p. 29. Læt, p. 345.) There existed no doubt to the west, anthropophagic nations, who, as Christopher Columbus has said (in the Lettera rarissima del 7 di Junio 1503) \"mangiavano uomini como noi mangiamo oltre animali.\" Cariari or Cariai, which I erroneously confounded (vol. v, p. 606) with Caribana, was situated at the south of cape Gracias a Dios and the isle of Quiribiri, probably near the mouth of the Rio San Juan, which is the desaguadero of the lake of Nicaragua, and one of the most important points for the projected communication between the two seas. It was at Cariai that Columbus, by an illusion of his ardent imagination, thought he heard mention made of China, (Catay), and the river Ganges. The inhabitants were not of Carib race, but very mild, and given to commerce. Columbus speaks ill of the women only of this country, whom he calls licentious en-, 695243=America, in favor of the court of Lisbon. The chief of a squadron, Don Josef de Yturiaga, was named director (primer commissario), of an expedition intended to sail along the northern frontier of the Capitania general of Grand Para, enter the Amazon by the Oroonoko and the Rio Negro, and go up the Amazon as far as the province of Maynas, and perhaps even pass by land to the confines of Paraguay. (See the correspondence of Loefting with Linnæus, in Jotri Loeftingi Her Hispanicum eller Resa, til Spanoza Lándërna uti Europa och America, 1758, p. 84—90). The expedition set sail from Cadiz, February 15th, 1754, having on board a chemist, a naturalist, and a geographer. The naturalist was the celebrated Loefting, who, after having examined the country round Cumana and Nueva Barcelona, the missions of Piritu and Caroni, died the victim of his zeal, at Santa Eulalia de Murucuri, (Linnæus calls this village Merecuri, Surville, Mucururi,) a little to the south of the confluence of the Oroonoko with the Rio Caroni, the 22d of February, 1756. Eturiago made the necessary preparations for the projected navigation on those rivers, in the island of Trinidad. He entered the mouth of the Oroonoko, at the end of July, 1754, with 53 small craft. (Golitas, Lanchas, Piroguas, and Changunas.) Dysenteries and fevers made great ravages among the troops, and even several hundred Indians fell sick. The fortress of la Vieja Guyana could only be reached on the fifteenth day. (See above, vol. v, p. 756 and 831, &c.) They went up no less slowly as far as Cabruta, near the mouth of the Rio Apure. Several barks imprudently exposed to the sun on the beach, split; the fevers continued, and rowers (bogas), boats, and money were at the same time wanting. Two of the commissaries, Don Eusebio de Albarada, and Don Joseph Solano, went to Santa Fe de Bogota in search of funds; they came back after six months' absence, in 1756. Solano alone, with a small part of the expedition, passed over the great cataracts of Atures and May-, 244031=* I estimate the errors of relative longitudes only, for instance, the differences of longitude between the coast, and the valley of the Rio Mamore, or of the Upper Javari. I do not speak of the errors of absolute longitude, which sometimes exceed 3° or 4°, without influencing the measure of surfaces. The longitude of the city of Quito ascertained by me (81° 5′ 30″ west of Paris) has caused a considerable change of the western part of America, in the most recent maps. This differs 0° 50′ 30″, from the longitude adopted till my return to Europe (Connoiss. des Temps pour l'année 1808, p. 236). The breadth of South America, between Cayenne and Quito, according to d' Anville, is 30 nautical leagues too little. It is the inequality of partial displacements, that occasions the errors of relative longitude which alter the calculation of the area. La Cruz Olmedilla, whose great map has been successively copied and disfigured, placed Santa Fe de Bogota half a degree too far to the east; San Carlos del Rio Negro 2½°; and the mouth of the Apure a quarter of a degree. The distance of Cumana from the mission of Esmeralda on the Upper Oroonoko, is estimated by La Cruz 2¼° too little. In general, before my voyage, the whole system of the rivers Oroonoko and Rio Negro was placed from 1° to 1½° of latitude too far south, and 2° of longitude too far east., 535427=* I have shewn in another work (Political Essay, vol. iv, p. 129), that in 1805, making the most moderate calculations, Spanish America already stood in need of an importation of foreign merchandize to the amount of 59,000,000 piastres, a value nearly three times greater than that required by the United States, eight years after their independence had been recognized by Great Britain. To give a view of comparative numbers, I shall state the imports and exports of the two most commercial nations of the world, the English of Europe, and of America. The annual value of the imports of Great Britain, from 1621 to 1823, amounted to 30,203,000 pounds sterling; the value of the exports to 50,636,800 pounds sterling. The exports of the United States, in 1820, were 69,974,000 dollars; the imports 62,586,000 dollars. At an anterior period, from 1802 to 1804, the exports were, mean year, 68,461,000 dollars, and the imports 75,306,000 dollars; whence it results that the imports of the United States, and of Spanish America, immediately before the political agitations of the latter country, were alike considerable. It must not be forgotten, that what is imported to Spanish America, is there used, and not re-exported. The exports and imports of France in 1821, were respectively 404,764,000, and 394,442,000 franks., 690929=linea divisoria reaches, according to different hypotheses, the mouth of the Rio Francisco, or Rio Janeiro, or the meridian of Saint Paul, which is still placed 1° to the east of Grand Para. Pope Julian sanctioned the treaty of Tordesillas by a bull issued January 24th, 1506; but the daring voyage of Magellan, and the discoveries (1500—1504) of the mouth of the river Amazon, by Vicente Janez Pinson, of Cape San Augustin, by Amerigo Vespucci, and the ports of Santa Cruz and of the Bahia of Todos Santos, which had preceded that voyage, engaged the courts of Madrid and Lisbon to assemble in 1524, the congress of pilots and cosmographers at the bridge of Rio Caya, between Yelves and Badajoz. The Spaniards accused the Portugueze of having altered the distance from Gilolo to the coast of Brazil, and prove victoriously that the Moluccas belonged to the Castillian domains. The celebrated mathematician Faleiro, had taught the pilots the lunar methods by which they might determine the distance of a ship from the line of demarcation, considered as a first meridian. This line contributed no doubt powerfully to the ardor with which at that period the proper methods were sought, of finding the longitude by precise means. The congress of cosmographers at Puente de Caya went on slowly, and the disputes between the two nations respecting the possessions of the archipelago of India, only concluded by a treaty at Saragossa, the 22d of April, 1529. (Don Juan y don Antonio de Ulloa, Dissert. historica y geographica sobre el meridiano de demarcacion. Madrid, 1749, Salazar de los progressos de la hydrografia en España, 1809, p. 115. Cespades, Hydrografia, cap. 4, p. 128, 143, 152). Spain ceded the Moluccas for the sum of 350,000 ducats, reserving the right of again possessing itself of the property of those islands whenever the amount of the purchase should be returned. The union of the two crowns under Philip 2d, calmed for some time national hatred, or rather compelled it to appear to be appeased; but from the end of the 17th, 360634=the Truxillo; namely, Montana de Santa Maria, west of Torito, el Picacho de Nirgua, el Altar, and the vicinity of Quibor, Barquesimeto, and Tocuyo: 8th. the table-land of Truxillo (above 420 toises); and the tierras frias of Paramos de las Rosas, Boconò and Niquitao, between the sources of the Rio Motatan, and those of the Portuguesa and the Guanare: 9th. the whole mountainous land that surrounds the Sierra nevada of Merida, between Pedraza, Lavellaca, Santo Domingo, Macuchies, the Paramo de los Conejos, Bayladores, and La Grita (700–1600 toises): 10th. some spots, perhaps of the Cordillera de Parime, which separates the basin of the Lower Oroonoko from that of the Amazon; the groupe of the granitic mountains of Sipapo and the Sierra Maraguaca*., 33490=† These skeletons were discovered in 1805 by Mr. Cortez, whose interesting geological observations. I have already bad occasion to mention (vol. iv, p. 41, 42). They are enchased in a formation of madrepore breccia, which the Negroes call with great simplicity the masonry of God almighty; and which, as recent as the travertin of Italy, envelopes fragments of vases and other works of man. Mr. Dauxion Lavaysse, and Dr. Kœnig, first made known in Europe this phenomenon, which has so much excited the attention of geologists. (Phil. Tr. 1814, plate 3; Cuvier, Ossem. foss., vol. 1, p. lxvi.), 492745=nean, and the Red Sea*, it would not less favor the establishment of an oceanic junction. The winds blow with sufficient force on the lake of Nicaragua, to render it unnecessary to tow the ships which pass from one sea to the other, by means of steam-boats; but the employment of the moving power of steam would be of the greatest utility in the passage from Rialexo and Panama to Guayaquil†, where, during the months of August, September, and October, calms alternate with winds that blow in a contrary direction., 54126=* I shall only mention as an example a plate drawn by the illustrious anatomist Peter Camper: Viri adulti cranium ex Caraibensium insula Sancti-Vicentii in Museo Clinii asservat, 1785., 90417=heated may not disfigure or displace the summits of mountains seen under angles of too little altitude. Signals by firing gunpowder, the reflection of which toward the sky is distinguished at such a distance, will be of considerable assistance. I thought it might be useful to mention in this place what I had derived from my knowledge of the localities, and my study of the geography of America. Mr. Lanz, a distinguished geometrician, who unites with an extensive knowledge of every branch of mathematics the practical use of astronomical instruments, is at present employed in improving the geography of those countries; and in executing, under the auspices of the free government of Venezuela, a part of the projects, to which in the year 1799 I in vain called the attention of the Spanish ministry., 607665=The population of England, according to the enumeration of 1377, was 2,300,000. The city of London then contained only 35,000. (Lowe, Present State of England, Ap. p. 3). The following is, according to Mr. Cleveland, the increase of the population of Great Britain within twenty-years: in 1801, the population amounted to 10,942,642; in 1811, to 12,596,803; and in 1821, to 14,353,800. In estimating the population of the Russian empire with Poland, at 54 millions, I reckoned 2 millions for the Asiatic part only. Official statements (Petersbuger Zeitschrift, June, 1823, p. 294), give 1,606,195 to Siberia; namely, Tobolski, 572,471; Tomsk, 340,000; Jeniseisk, 135,000; Irkutsk, 400,500; Jakutsk, 147,015; Ochotsk, 6,703, and Kamtschatka, 4,506; I add for the parts situated on the east of the Oural Mountains, that is, for ¼ of the government of Perm, 1/7 of the government of Orembourg, and the Kirgises, 1,606,195 inhabitants; Siberia, properly so called, 450,000 inhabitants.}",
    "textBeforeTable": "BOOK IX. OF VOL. VI. PART I. CONTENTS [page vii] [page vi] With this volume are given, a general map of the Republic of Columbia, drawn from the latest scientific observations and discoveries; and a map of the Geography of the Plants of Chimborazo, indicating the elevation at which they are respectively found. [page] V The present volume comprehends, besides the Personal Narrative of the travellers, The History of the Nations of Carib race; a general view of the Population of Spanish America, arranged according to difference of colour, of languages, and of religion; a discussion of the great problem of an Oceanic Canal, or of a Water Communication between the South Sea and the Atlantic Ocean, with reference both to its utility and the obstacles which local circumstances may present to its execution; a comparison of the more ancient Monuments of the Aboriginal Inhabitants of both Americas; a Geological View of South America on the north of the river of the Amazons, with a general account of the ramifications of the knots of mountains which occur in the Andes from Cape Horn to the Polar Circle; a memoir on the Horary Variations of the Barometer within the Tropics, both at the level of the ocean, and on the summit of the Cordillera of the Andes; and a compressed view of thermometric, hygrometric, cyanometric, and electrometric observations made in the low equinoctial regions. [page] iv THE scene to which this volume chiefly relates—the",
    "textAfterTable": "Commerce and Public Revenue 219 The Practicability of a Water Communication between the Atlantic and Pacific Oceans discussed 239 NOTES TO THE NINTH BOOK. A—Antiquities, &c. of the Aboriginal Inhabitants of America 315 B—Relative Population by the Square League of the American States, and the States of Europe, Asia, and Africa 335 C—State of the Catholic Missions in Spanish America Sketch of the Native Tribes of ditto 347 D—Population of Buenos Ayres 363 E—Population of the United States, N. A. 367 F—On the Boundaries of the Spanish and Portuguese States 378 G—On the Physical Properties of the Cow Tree 386 [page viii] [page] 1 JOURNEY TO THE EQUINOCTIAL REGIONS OF THE NEW CONTINENT. BOOK IX. CHAPTER XXV. Llanos Del Pao, or the eastern part of the Plains (Llanos) of Venezuela. Missions of the Caribbees. Last abode on the coast of Nueva Barcelona, Cumana, and Araya. IT was night when we crossed for the last time the bed of the Oroonoko. We purposed to rest near the little fort of San Rafael, and the next morning at daybreak to begin our journey through the steppes of Venezuela. Nearly six weeks had elapsed since our arrival at Angostura; and we earnestly",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}