{
    "relation": [
        [
            "Categories",
            "Great for these types of students",
            "Tips for prospective students",
            "Bang for the buck",
            "Am enjoying being here",
            "Am learning a lot"
        ],
        [
            "Comments",
            "Biola is an amazing school for students who want a Christ centered education and feel that going to school is about developing character for when you're actually on your own.",
            "If you want to go here try to get decent grades because they give out many academic scholarships which help a lot since the school is so expensive.",
            "It's an extremely expensive school, I am not sure any school should be worth more than $20,000 a year and Biola is double that!",
            "I love being at Biola everyday. The people are so kind, the teachers care a ton, and the campus is beautiful. I personally play a sport and I really recommend either getting involved in a sport at Biola or trying to get involved in clubs or such to get to know people because everyone is just so great!",
            "I have never learned as much about life and about myself as I have in college. I know this sounds like a comment about any and every college, however at Biola you learn so much more. Biola is a religious centered school and it's focus on God is very obvious. I have learned so much from every teacher and every student about how to be a better person and how to live a life that is more full and less focused on partying and achievements."
        ]
    ],
    "pageTitle": "Biola University Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Biola-University/reviews?_escaped_fragment_=/show/86998",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989790.89/warc/CC-MAIN-20150728002309-00097-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 910911015,
    "recordOffset": 910813699,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{503623=© 2015, Cappex.com, LLC, 101998=Take advantage of early action deadlines in November and January. They won't just let you get the application out of the way, but they also give you a better chance at acceptance and scholarships.}",
    "textBeforeTable": "07/09/2009 Reviewer is A current student here. 35 out of 35 people found this review useful. 1 of 106 Christine Check out reviews left by other students or leave your own review. You could win a free scholarship. Biola University Reviews Biola University › California › By State › Colleges › } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.create', -->",
    "textAfterTable": "Login to rate or flag the reviews Meg from NH 07/07/2009 Reviewer is A current student here. 24 out of 25 people found this review useful. 2 of 106 Categories Comments Great for these types of students Those who want to be stretched mentally and relationally and who want to have an impact on the world. Not great for those who are being made to attend school and would rather party. Tips for prospective students Biola has said that they'll never turn away a student who fits the basic qualifications (one is that the student be a Christian) and genuinely wants to go. So apply! Bang for the buck Biola is very expensive. However, the quality of education is good and the community is wonderful. Get scholarships, get financial aid, but don't be afraid to go. Am enjoying being here I get homesick being three thousand miles from home, but not as",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}