{
    "relation": [
        [
            "Object",
            "Key Material",
            "Recommended Curve",
            "Q String"
        ],
        [
            "Encoding",
            "Structure",
            "Enumeration, see 9.1.3.2.5",
            "Byte String"
        ],
        [
            "REQUIRED",
            "",
            "Yes",
            "Yes"
        ]
    ],
    "pageTitle": "Key Management Interoperability Protocol Specification Version 1.2",
    "title": "",
    "url": "http://docs.oasis-open.org/kmip/spec/v1.2/csd01/kmip-spec-v1.2-csd01.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989043.35/warc/CC-MAIN-20150728002309-00129-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 75174971,
    "recordOffset": 75087797,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{44958=2.1.10 Data. 29, 44320=2.1.13 MAC Data. 30, 44751=2.1.11 Data Length. 29, 53719=Key Management Interoperability Protocol Specification Version 1.2. 31 October 2013. OASIS Committee Specification Draft 01. http://docs.oasis-open.org/kmip/spec/v1.2/csd01/kmip-spec-v1.2-csd01.html., 44537=2.1.12 Signature Data. 29, 62021=·         Key Management Interoperability Protocol Specification Version 1.0. 01 October 2010. OASIS Standard. http://docs.oasis-open.org/kmip/spec/v1.0/os/kmip-spec-1.0-os.html., 65220=31 October 2013, 61504=·         Key Management Interoperability Protocol Specification Version 1.1. 24 January 2013. OASIS Standard. http://docs.oasis-open.org/kmip/spec/v1.1/os/kmip-spec-v1.1-os.html., 44109=2.1.14 Nonce. 30, 53143=Copyright © OASIS Open 2013. All Rights Reserved.}",
    "TableContextTimeStampAfterTable": "{44001=[SP800-38C]            M. Dworkin, Recommendation for Block Cipher Modes of Operation: the CCM Mode for Authentication and Confidentiality, NIST Special Publication 800-38C, May 2004, http://csrc.nist.gov/publications/nistpubs/800-38C/SP800-38C_updated-July20_2007.pdf., 678823=Enumeration, see 9.1.3.2.19, 55259=[RFC6151]               S. Turner and L. Chen, Updated Security Considerations for the MD5 Message-Digest and the HMAC-MD5 Algorithms, IETF RFC6151, March 2011, http://www.rfc-editor.org/rfc/rfc6151.txt., 34964=[RFC3447]               J. Jonsson, B. Kaliski, Public-Key Cryptography Standards (PKCS) #1: RSA Cryptography Specifications Version 2.1, IETF RFC 3447, Feb 2003, http://www.ietf.org/rfc/rfc3447.txt., 30972=[RFC1421]               J. Linn, Privacy Enhancement for Internet Electronic Mail: Part I: Message Encryption and Authentication Procedures, IETF RFC 1421, February 1993, http://www.ietf.org/rfc/rfc1421.txt., 53761=[KMIP-UG]              Key Management Interoperability Protocol Usage Guide Version 1.2 Working Draft 06, August 22, 2013, https://www.oasis-open.org/apps/org/workgroup/kmip/download.php/50409/kmip-ug-v1%202-wd06.pdf., 37650=[RFC4211]               J. Schaad, Internet X.509 Public Key Infrastructure Certificate Request Message Format (CRMF), IETF RFC 4211, September 2005, http://www.ietf.org/rfc/rfc4211.txt., 361449=Enumeration, see 9.1.3.2.16, 39442=[RFC5208]               B. Kaliski, Public Key Cryptographic Standards (PKCS) #8:  Private-Key Information Syntax Specification Version 1.2, IETF RFC5208, May 2008, http://www.rfc-editor.org/rfc/rfc5208.txt., 41161=[RFC5755]               S. Turner, D. Brown, K. Yiu, R. Housley, T. Polk, Updates for RSAES-OAEP and RSASSA-PSS Algorithm Parameters, IETF RFC5755, January 2010, http://www.rfc-editor.org/rfc/rfc5756.txt., 38113=[RFC4868]               S. Kelly, S. Frankel, Using HMAC-SHA-256, HMAC-SHA-384, and HMAC-SHA-512 with IPsec, IETF RFC 4868, May 2007, http://www.ietf.org/rfc/rfc4868.txt., 88593=Enumeration, see 9.1.3.2.36, 49420=[X.509]                    International Telecommunication Union (ITU)–T, X.509:  Information technology – Open systems interconnection – The Directory:  Public-key and attribute certificate frameworks, November 2008, http://www.itu.int/rec/recommendation.asp?lang=en&parent=T-REC-X.509-200811-1., 53247=[ISO/IEC 9945-2]     The Open Group, Regular Expressions, The Single UNIX Specification version 2, 1997, ISO/IEC 9945-2:1993, http://www.opengroup.org/onlinepubs/007908799/xbd/re.html., 762832=Enumeration, see 9.1.3.2.34, 41587=[RFC6402]               J. Schaad, Certificate Management over CMS (CMC) Updates, IETF RFC6402, November 2011, http://www.rfc-editor.org/rfc/rfc6402.txt., 29746=[RFC1319]               B. Kaliski, The MD2 Message-Digest Algorithm, IETF RFC 1319, Apr 1992, http://www.ietf.org/rfc/rfc1319.txt., 28605=[PKCS#7]                RSA Laboratories, PKCS#7 v1.5: Cryptographic Message Syntax Standard, November 1, 1993, http://www.rsa.com/rsalabs/node.asp?id=2129., 33294=[RFC2315]               B. Kaliski, PKCS #7:  Cryptographic Message Syntax Version 1.5, IETF RFC2315, March 1998, http://www.rfc-editor.org/rfc/rfc2315.txt., 39846=[RFC5272]               J. Schaad and M. Meyers, Certificate Management over CMS (CMC), IETF RFC 5272, June 2008, http://www.ietf.org/rfc/rfc5272.txt., 101744=Enumeration, see 9.1.3.2.13, 48287=[SP800-67]              W. Barker and E. Barker, Recommendation for the Triple Data Encryption Algorithm (TDEA) Block Cipher, NIST Special Publication 800-67 Revision 1, January 2012, http://csrc.nist.gov/publications/nistpubs/800-67-Rev1/SP-800-67-Rev1.pdf., 32437=[RFC2104]               H. Krawczyk, M. Bellare, R. Canetti, HMAC: Keyed-Hashing for Message Authentication, IETF RFC 2104, February 1997, http://www.ietf.org/rfc/rfc2104.txt., 910459=Derivation Method, see 9.1.3.2.21, 590598=Enumeration, see 9.1.3.2.31, 51493=[X9.62]                    ANSI, X9.62: Public Key Cryptography for the Financial Services Industry, The Elliptic Curve Digital Signature Algorithm (ECDSA), 2005., 40689=[RFC5649]               R. Housley, Advanced Encryption Standard (AES) Key Wrap with Padding Algorithm, IETF RFC 5649, Aug 2009, http://www.ietf.org/rfc/rfc5649.txt., 39066=[RFC4949]               R. Shirey, Internet Security Glossary, Version 2, IETF RFC 4949, August 2007, http://www.ietf.org/rfc/rfc4949.txt., 46366=[SP800-56A]            E. Barker, L. Chen, A. Roginsky and M. Smid, Recommendation for Pair-Wise Key Establishment Schemes Using Discrete Logarithm Cryptography, NIST Special Publication 800-56A Revision 2, May 2013, http://nvlpubs.nist.gov/nistpubs/SpecialPublications/NIST.SP.800-56Ar2.pdf., 25554=[FIPS198-1]             The Keyed-Hash Message Authentication Code (HMAC), FIPS PUB 198-1, July 2008, http://csrc.nist.gov/publications/fips/fips198-1/FIPS-198-1_final.pdf., 52728=[X9 TR-31]              ANSI, X9 TR-31: Interoperable Secure Key Exchange Key Block Specification for Symmetric Algorithms, 2010., 34144=[RFC2986]               M. Nystrom and B. Kaliski, PKCS #10:  Certification Request Syntax Specification Version 1.7, IETF RFC2986, November 2000, http://www.rfc-editor.org/rfc/rfc2986.txt., 28996=[PKCS#8]                RSA Laboratories, PKCS#8 v1.2: Private-Key Information Syntax Standard, November 1, 1993, http://www.rsa.com/rsalabs/node.asp?id=2130., 54182=[KMIP-TC]               Key Management Interoperability Protocol Test Cases Version 1.2 Working Draft 02, August 07, 2013, https://www.oasis-open.org/apps/org/workgroup/kmip/download.php/50188/kmip-testcases-v1.2-wd02.docx., 608433=Enumeration, see 9.1.3.2.18, 31601=[RFC1424]               B. Kaliski, Privacy Enhancement for Internet Electronic Mail: Part IV: Key Certification and Related Services, IETF RFC 1424, Feb 1993, http://www.ietf.org/rfc/rfc1424.txt., 36347=[RFC3686]               R. Housley, Using Advanced Encryption Standard (AES) Counter Mode with IPsec Encapsulating Security Payload (ESP), IETF RFC 3686, January 2004, http://www.ietf.org/rfc/rfc3686.txt. [RFC4055] J. Schadd, B. Kaliski, and R, Housley, HHAdditional Algorithms and Identifiers for RSA Cryptography for use in the Internet X.509 Public Key Infrastructure Certificate and Certificate Revocation List (CRL) Profile, IETF RFC 4055, June 2055, http://www.ietf.org/rfc/rfc4055.txt., 47014=[SP800-56B]            E. Barker, L. Chen, A. Regenscheid, and M. Smid, Recommendation for Pair-Wise Key Establishment Schemes Using Integer Factorization Cryptography, NIST Special Publication 800-56B, August 2009, http://csrc.nist.gov/publications/nistpubs/800-56B/sp800-56B.pdf., 27684=[PKCS#1]                RSA Laboratories, PKCS #1 v2.1: RSA Cryptography Standard, June 14, 2002, http://www.rsa.com/rsalabs/node.asp?id=2125., 41928=[RFC6818]               P. Yee, Updates to the Internet X.509 Public Key Infrastructure Certificate and Certificate Revocation List (CRL) Profile, IETF RFC6818, January 2013, http://www.rfc-editor.org/rfc/rfc6818.txt., 780082=Enumeration, see 9.1.3.2.35, 34518=[RFC3394]               J. Schaad, R. Housley, Advanced Encryption Standard (AES) Key Wrap Algorithm, IETF RFC 3394, September 2002, http://www.ietf.org/rfc/rfc3394.txt., 24434=[FIPS186-4]             Digital Signature Standard (DSS), FIPS PUB 186-4, July 2013, http://csrc.nist.gov/publications/FIPS/NIST.FIPS.186-4.pdf., 45216=[SP800-38E]            M. Dworkin, Recommendation for Block Cipher Modes of Operation: The XTS-AES Mode for Confidentiality on Block-Oriented Storage Devices, NIST Special Publication 800-38E, January 2010, http://csrc.nist.gov/publications/nistpubs/800-38E/nist-sp-800-38E.pdf., 24990=[FIPS197]               Advanced Encryption Standard, FIPS PUB 197, November 2001, http://csrc.nist.gov/publications/fips/fips197/fips-197.pdf., 392706=Accredited Standards Committee X9, Inc. - Financial Industry Standards (www.x9.org) contributed to Table 56. Key role names and descriptions are derived from material in the Accredited Standards Committee X9, Inc.'s Technical Report \"TR-31 2010 Interoperable Secure Key Exchange Key Block Specification for Symmetric Algorithms\" and used with the permission of Accredited Standards Committee X9, Inc. in an effort to improve interoperability between X9 standards and OASIS KMIP. The complete ANSI X9 TR-31 is available at www.x9.org., 51133=[X9.57]                    ANSI, X9.57: Public Key Cryptography for the Financial Services Industry: Certificate Management, 1997., 716936=Enumeration, see 9.1.3.2.20, 28103=[PKCS#5]                RSA Laboratories, PKCS #5 v2.1: Password-Based Cryptography Standard, October 5, 2006, http://www.rsa.com/rsalabs/node.asp?id=2127., 47641=[SP800-57-1]           E. Barker, W. Barker, W. Burr, W. Polk, and M. Smid, Recommendations for Key Management - Part 1: General (Revision 3), NIST Special Publication 800-57 Part 1 Revision 3, July 2012, http://csrc.nist.gov/publications/nistpubs/800-57/sp800-57-part1-rev3_general.pdf., 52372=[X9.102]                  ANSI, X9.102: Symmetric Key Cryptography for the Financial Services Industry - Wrapping of Keys and Associated Data, 2008., 35864=[RFC3647]               S. Chokhani, W. Ford, R. Sabett, C. Merrill, and S. Wu, Internet X.509 Public Key Infrastructure Certificate Policy and Certification Practices Framework, IETF RFC 3647, November 2003, http://www.ietf.org/rfc/rfc3647.txt., 35440=[RFC3629]               F. Yergeau, UTF-8, a transformation format of ISO 10646, IETF RFC 3629, November 2003, http://www.ietf.org/rfc/rfc3629.txt., 48855=[SP800-108]            L. Chen, Recommendation for Key Derivation Using Pseudorandom Functions (Revised), NIST Special Publication 800-108, Oct 2009, http://csrc.nist.gov/publications/nistpubs/800-108/sp800-108.pdf., 42851=[SP800-38A]            M. Dworkin, Recommendation for Block Cipher Modes of Operation – Methods and Techniques, NIST Special Publication 800-38A, December 2001, http://csrc.nist.gov/publications/nistpubs/800-38a/sp800-38a.pdf., 360462=Enumeration, see 9.1.3.2.15, 364385=Enumeration, see 9.1.3.2.13, 26474=[ISO16609]              ISO, Banking -- Requirements for message authentication using symmetric techniques, ISO 16609, 2012., 33647=[RFC2898]               B. Kaliski, PKCS #5: Password-Based Cryptography Specification Version 2.0, IETF RFC 2898, September 2000, http://www.ietf.org/rfc/rfc2898.txt., 491426=The Digest attribute is a structure (see Table 77) that contains the digest value of the key or secret data (i.e., digest of the Key Material), certificate (i.e., digest of the Certificate Value), or opaque object (i.e., digest of the Opaque Data Value). If the Key Material is a Byte String, then the Digest Value SHALL be calculated on this Byte String. If the Key Material is a structure, then the Digest Value SHALL be calculated on the TTLV-encoded (see Section 9.1) Key Material structure. The Key Format Type field in the Digest attribute indicates the format of the Managed Object from which the Digest Value was calculated. Multiple digests MAY be calculated using different algorithms listed in Section 9.1.3.2.16 and/or key format types listed in Section 9.1.3.2.3. If this attribute exists, then it SHALL have a mandatory attribute instance computed with the SHA-256 hashing algorithm. For objects registered by a client, the server SHALL compute the digest of the mandatory attribute instance using the Key Format Type of the registered object. In all other cases, the server MAY use any Key Format Type when computing the digest of the mandatory attribute instance, provided it is able to serve the object to clients in that same format. The digest(s) are static and SHALL be set by the server when the object is created or registered, provided that the server has access to the Key Material or the Digest Value (possibly obtained via out-of-band mechanisms)., 23390=[ECC-Brainpool]     ECC Brainpool Standard Curves and Curve Generation v. 1.0.19.10.2005, http://www.ecc-brainpool.org/download/Domain-parameters.pdf., 125326=Enumeration, see 9.1.3.2.32, 87555=Structure, see 2.1.14, 43423=[SP800-38B]            M. Dworkin, Recommendation for Block Cipher Modes of Operation: The CMAC Mode for Authentication, NIST Special Publication 800-38B, May 2005, http://csrc.nist.gov/publications/nistpubs/800-38B/SP_800-38B.pdf., 26096=[IEEE1003-1]           IEEE Std 1003.1, Standard for information technology - portable operating system interface (POSIX). Shell and utilities, 2004., 51927=[X9.63]                    ANSI, X9.63: Public Key Cryptography for the Financial Services Industry, Key Agreement and Key Transport Using Elliptic Curve Cryptography, 2011., 32074=[RFC1945]               T. Berners-Lee, R. Fielding, H. Frystyk, Hypertext Transfer Protocol -- HTTP/1.0, IETF RFC 1945, May 1996, http://www.ietf.org/rfc/rfc1945.txt., 27152=[KMIP-Prof]            Key Management Interoperability Protocol Profiles Version 1.2 wd02, June 27, 2013, https://www.oasis-open.org/apps/org/workgroup/kmip/download.php/49689/kmip-profiles-v1.2-wd02.doc., 54683=[KMIP-UC]              Key Management Interoperability Protocol Use Cases Version 1.2 Working Draft 10, June 20, 2013, https://www.oasis-open.org/apps/org/workgroup/kmip/download.php/49644/kmip-usecases-v1.2-wd10.doc., 45882=[SP800-38F]            M. Dworkin, Recommendation for Block Cipher Modes of Operation:  Methods for Key Wrapping, NIST Special Publication 800-38F, December 2012, http://nvlpubs.nist.gov/nistpubs/SpecialPublications/NIST.SP.800-38F.pdf., 298237=Enumeration, see 9.1.3.2.10, 55628=[RFC6712]               T. Kause, and M. Peylo, Internet X.509 Public Key Infrastructure – HTTP Transfer for the Certificate Management Protocol (CMP), IETF RFC6712, September 2012, http://www.rfc-editor.org/rfc/rfc6712.txt., 333430=Enumeration, see 9.1.3.2.12, 50339=[X9.31]                    ANSI, X9.31: Digital Signatures Using Reversible Public Key Cryptography for the Financial Services Industry (rDSA), September 1998., 50002=[X9.24-1]                 ANSI, X9.24 - Retail Financial Services Symmetric Key Management - Part 1: Using Symmetric Techniques, 2009., 362432=Enumeration, see 9.1.3.2.17, 38560=[RFC4880]               J. Callas, L. Donnerhacke, H. Finney, D. Shaw, and R. Thayer, OpenPGP Message Format, IETF RFC 4880, November 2007, http://www.ietf.org/rfc/rfc4880.txt., 341145=Enumeration, see 9.1.3.2.13, 44636=[SP800-38D]            M. Dworkin, Recommendation for Block Cipher Modes of Operation: Galois/Counter Mode (GCM) and GMAC, NIST Special Publication 800-38D, Nov 2007, http://csrc.nist.gov/publications/nistpubs/800-38D/SP-800-38D.pdf., 40204=[RFC5280]               D. Cooper, S. Santesson, S. Farrell, S. Boeyen, R. Housley, W. Polk, Internet X.509 Public Key Infrastructure Certificate, IETF RFC 5280, May 2008, http://www.ietf.org/rfc/rfc5280.txt., 359451=Enumeration, see 9.1.3.2.14, 95027=·         RSA keys are typically 1024, 2048 or 3072 bits in length., 325706=Enumeration, see 9.1.3.2.11, 37194=[RFC4210]               C. Adams, S. Farrell, T. Kause and T. Mononen, Internet X.509 Public Key Infrastructure Certificate Management Protocol (CMP), IETF RFC 2510, September 2005, http://www.ietf.org/rfc/rfc4210.txt., 32889=[RFC2119]               S. Bradner, Key words for use in RFCs to Indicate Requirement Levels, IETF RFC 2119, March 1997, http://www.ietf.org/rfc/rfc2119.txt., 29375=[PKCS#10]              RSA Laboratories, PKCS #10 v1.7: Certification Request Syntax Standard, May 26, 2000, http://www.rsa.com/rsalabs/node.asp?id=2132., 23952=[FIPS180-4]             Secure Hash Standard (SHS), FIPS PUB 186-4, March 2012, http://csrc.nist.gov/publications/fips/fips18-4/fips-180-4.pdf., 56044=[w1979]                   A. Shamir, How to share a secret, Communications of the ACM, vol 22, no. 11, pp. 612-613, November 1979., 30154=[RFC1320]               R. Rivest, The MD4 Message-Digest Algorithm, IETF RFC 1320, April 1992, http://www.ietf.org/rfc/rfc1320.txt., 50717=[X9.42]                    ANSI, X9.42: Public Key Cryptography for the Financial Services Industry: Agreement of Symmetric Keys Using Discrete Logarithm Cryptography, 2003., 30563=[RFC1321]               R. Rivest, The MD5 Message-Digest Algorithm, IETF RFC 1321, April 1992, http://www.ietf.org/rfc/rfc1321.txt., 26786=[ISO9797-1]             ISO/IEC, Information technology -- Security techniques -- Message Authentication Codes (MACs) -- Part 1: Mechanisms using a block cipher, ISO/IEC 9797-1, 2011.}",
    "lastModified": "Thu, 31 Oct 2013 16:00:00 GMT",
    "textBeforeTable": "When an Attribute structure is used to specify or return a particular instance of an Attribute and the Attribute Index is not specified it SHALL be assumed to be 0. An Attribute object is a structure (see Table 2) used for sending and receiving Managed Object attributes. The Attribute Name is a text-string that is used to identify the attribute. The Attribute Index is an index number assigned by the key management server. The Attribute Index is used to identify the particular instance. Attribute Indices SHALL start with 0. The Attribute Index of an attribute SHALL NOT change when other instances are added or deleted. Single-instance Attributes (attributes which an object MAY only have at most one instance thereof) SHALL have an Attribute Index of 0. The Attribute Value is either a primitive data type or structured object, depending on the attribute. 2.1.1 Attribute These objects are used within the messages of the protocol, but are not objects managed by the key management system. They are components of Managed Objects. 2.1 Base Objects Structures are composed of ordered lists of primitive data types or sub-structures. ·         Interval – a length of time expressed in seconds ·         Date-Time – date and time, with a granularity of one second ·        ",
    "textAfterTable": "Attribute Value Varies, depending on attribute. See Section 3 Yes, except for the Notify operation (see Section 5.1) Table 2: Attribute Object Structure 2.1.2 Credential A Credential is a structure (see Table 3) used for client identification purposes and is not managed by the key management system (e.g., user id/password pairs, Kerberos tokens, etc.). It MAY be used for authentication purposes as indicated in [KMIP-Prof]. Object Encoding REQUIRED Credential Structure  ",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}