{
    "relation": [
        [
            "Code",
            "29",
            "30",
            "31",
            "32",
            "33",
            "34",
            "35",
            "37",
            "38",
            "39",
            "40",
            "42",
            "44",
            "45",
            "46",
            "47",
            "49",
            "50",
            "51",
            "52",
            "53",
            "55",
            "56",
            "57",
            "58",
            "59",
            "61",
            "62",
            "63",
            "65",
            "66",
            "67",
            "68",
            "69",
            "70",
            "71",
            "72",
            "73",
            "74",
            "75",
            "76"
        ],
        [
            "Explanation",
            "Field 08FTC is present and Form 1118 is not attached.",
            "Field 03ABL is 001 and Schedule 1120-PH is not attached.",
            "Investment Credit claimed and Form 3468 is not attached.",
            "Field 0508 is present and Schedule D is not attached.",
            "Field 08TRI is present and Form 4255 is not attached.",
            "Field 08AMT is present and Form 4626 is not attached.",
            "Field 0509 is present and Form 4797 is not attached.",
            "Field 08ASE has an entry and Form 5735 is not attached (TY2006–2009 only).",
            "Work Opportunity Credit claimed and Form 5884 is not attached.",
            "Field 08AFT is present and Form 6478 is not attached.",
            "Field 08RES has an entry and Form 6765 is not attached.",
            "Field 2401H has an entry of $500 or more and Form 8820 is not attached. Exception: If an EIN is present on Form 3800, Page 3, Column (b), do not edit MSC or correspond. The credit is from a pass-through entity and the form is not required.",
            "Field 08LIH has an entry and Forms 8586 has an entry of $500 or more. Exception: If an EIN is present on Form 3800, Page 3, Column (b), do not correspond. The credit is from a passthrough entity and the form is not required.",
            "Field 08RLI has and entry and Form 8611 is not attached.",
            "Field 08PYM is present and Form 8801 or 8827 is not attached.",
            "Field 23O1E has an entry and Form 8826 is not attached.",
            "Field 08ASE is present and Form 8834 is not attached.",
            "Field 08EPC is present and Form 8835 is not attached.",
            "Field 2401G has an entry and Form 8845 is not attached.",
            "Field 2504F has an entry and Form 8846 is not attached.",
            "Field 08CDC has an entry and Form 8847 is not attached.",
            "Field 08WTW has an entry and Form 8861 is not attached.",
            "Field 08QZA has an entry and Form 8860 is not attached.",
            "Field 08NMC has an entry and Form 8874 is not attached.",
            "Field 2401J has an entry and Form 8881 is not attached.",
            "Field 2401K has an entry and Form 8882 is not attached.",
            "Field 08BFC has an entry and Form 8864 is not attached.",
            "Field 08LSP has an entry and Form 8896 is not attached.",
            "Field 2401/2504G has an entry and Form 8900 is not attached.",
            "Field 2401N has an entry and Form 8906 is not attached.",
            "Field 08NSF has an entry and Form 8907 is not attached.",
            "Field 08EEH has an entry and Form 8908 is not attached.",
            "Field 2401R has an entry and Form 8910 is not attached.",
            "Field 08AFV has an entry and Form 8911 is not attached.",
            "Field 08ERC has an entry and Form 5884-A is not attached.",
            "Field 08EEA has an entry and Form 8909 is not attached.",
            "Field 08CEB is present and Form 8912 is not attached.",
            "Field 2401V has an entry and Form 8931 is not attached.",
            "Field 2401W has an entry and Form 8932 is not attached.",
            "Field 251AA has an entry and Form 5884–B is not attached.",
            "Field 2504H has an entry and Form 8941 is not attached."
        ]
    ],
    "pageTitle": "Internal Revenue Manual - 3.12.251 Corporation Income Tax Returns (Cont. 1)",
    "title": "",
    "url": "http://www.irs.gov/irm/part3/irm_03-012-251r-cont01.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989043.35/warc/CC-MAIN-20150728002309-00093-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 525985803,
    "recordOffset": 525953532,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{164756=Form 8621, Return by a Shareholder of a Passive Foreign Investment Company or Qualifying Electing Fund, is attached and Part V, Distributions Form and Dispositions of Stock of a Section 1291, Lines 15a through 16f, have an entry ≡ ≡ ≡ ≡ ≡ ≡ ≡ ≡ ≡ ≡ ≡ ≡ . *(Part IV, Lines 10a through 11f for 2011 and prior), 7465=Homeowners Associations may file on Form 1120. When they do so, they are to be taxed at the normal corporate tax rate., 47401=The tax will be claimed on line 9, Schedule J, Form 1120., 177358=Field 03K12 is transcribed from the Form 1120, Schedule K, line 12. This is a POSITIVE only and DOLLARS only field., 6805=When reprocessing an original efiled (MeF) Form 1120S as Form 1120, ensure that the received date is properly edited on the return. The received date is the same as the original DLN Julian date. Do not subtract ten days., 147135=The Penalty and Interest Code is edited to and transcribed from the margin to the left of “Deductions” section of the return following “4-”. Field 03PIC should be coded \"≡ \" ≡ ≡ ≡ ≡ ≡ ≡ ≡ ≡ ≡ ≡ ≡ ≡ ≡ ≡ ≡ ≡ ≡ ≡ ≡ ≡ ≡ ≡ ≡ ≡ ≡ ≡ ≡ ≡ ≡ ≡ ≡ ≡ ≡ ≡ ≡ ≡ ≡ ≡ ≡ ≡ ≡ ≡ ≡ ≡ ≡ ≡ ≡ , and an amount for precomputed penalty and interest is shown on the return. See IRM 3.12.251.24.13, for more information., 148849=Reserve Code \"3\" is generated if a valid amount for Orphan Drug Credit is present (Form 1120 only). It causes Error Code 164 to generate., 165389=Form 1120, Schedule M-3 is attached and any entry on Part II, Column (c) lines 2-5 or 10 ≡ ≡ ≡ ≡ ≡ ≡ ≡ ≡ ≡ ≡ ≡ ≡ ≡ ≡ ≡ ≡ ≡ ≡ ≡ ≡ ≡ Any entry Part III, Column (c), lines 5-7 ≡ ≡ ≡ ≡ ≡ ≡ ≡ ≡ ≡ ≡ ≡ ≡ ≡ ≡ or The sum of Columns (b) plus (c), lines 9, 23, 24 or 25 ≡ ≡ ≡ ≡ ≡ ≡ ≡ ≡ ≡ ≡ ≡ ≡ ., 31020=The Received Date is edited in YYYYMMDD format. The Received Date must be present on all Forms 1120. This field will show on the return in MMDDYY format. On the ERS Screen it will display as YYYYMMDD., 165725=Form 1120, Schedule N, is attached and any box other than question 6 is checked \"yes\", 179470=Field 03Q16 is transcribed from Form 1120, Pg 4, Sch K, line 16., 55403=Section 847 Special Estimated Tax Payments are identified on Form 1120, Page 3, Schedule J, Part II, Line 13 (with notation such as SETP or 8816); and/or Form 1120-L, Page 1, Lines 29b and/or 29d; and/or Form 1120-PC, Page 1, Lines 14b and/or 14d., 170660=If no code applies, delete Field 03ADC., 165220=Form 1118, Foreign Tax Credit, Corporations is attached ≡ ≡ ≡ ≡ ≡ ≡ ≡ ≡ ≡ ≡ ≡ ≡ ≡ ≡ ≡ ≡ ≡ , and reported on line 5a, Schedule J., 42067=Write Letter 105C, Claim Disallowed, using the open paragraph. Tell the taxpayer the applicable claim for Form (8834, 8910 and/or 8936) credit was disallowed because the vehicle was placed in to service prior to (02/17/2009 For Form 8834 or Form 8910 and/or 01/01/2009 for Form 8936 as applicable.), 58692=The North American Industry Classification System Code (NAICS) is transcribed from Form 1120, Schedule K, line 2a., 165104=Form 1116, Foreign Tax Credit is attached ≡ ≡ ≡ ≡ ≡ ≡ ≡ ≡ ≡ ≡ ≡ ≡ ≡ ≡ ≡ ≡ ≡, 33569=U.S. or Foreign Country postmark date on envelope or a postmark established by an acceptable designated private delivery service. See IRM 3.10.72, Receiving, Extracting and Sorting, for more details., 239452=Field 07FIR - Any Form 1120 with this credit must be transferred to OSPC., 73135=This section provides instructions for correcting Form 1120 Section 02 Field Errors., 101117=This section contains instructions for correcting Section 03 Field Errors on Form 1120., 153676=It is other than blank, 1, 2 or 3 for Form 1120, 181928=Field 03Q18 is transcribed from Form 1120, Pg 4, Sch K, line 18., 159841=The Foreign Country Code is transcribed from page 4, right margin of question 7b, Form 1120. (For 1999 – page 3, right margin of question 10b, Form 1120), 123779=The box on line 2, Schedule J, page 3 is checked (line 3 2005 and prior), or, 6366=Do not enter any tax data on the \"blank\" Form 1120. No conversion to a Form 1120 should be attempted., 149311=Code \"4\" will be used if Form 2220 is attached and the taxpayer has checked the box on line 8, Part II, Form 2220, \"Large Corporations.\", 180693=Field 03Q17 is transcribed from Form 1120, Pg 4, Sch K, line 17., 6015=Code-and-Edit must ensure that only the name control, CCC \"3\" (if applicable), Received Date, North American Industry Classification System Code (NAICS), Tax Period and Audit Code 4 are edited to the Form 1120., 121514=For additional guidance on this field IRM 3.12.251.24.34., 177738=Form 1120 amount exceeds the maximum length (12), 55161=Annualized income is computed on Form 1125–A, Pages 3 and/or 4 of Form 2220, or Form 2220, Part II Box 6 or Box 7 (prior year Part I, Box 1 or Box 2) is checked., 22862=The tax period is located in the upper right corner of the return. It is the ending month and year of the tax period covering the return. If the tax period is not the current calendar year, it is edited in year/month (YYYYMM) format. For example, December 31, 2014 is edited as \"201412. \", 8238=Form 1120 contains Sections 01 through 12, 14 through 18 and 20 through 25., 226803=Section 07 contains the tax, credits and payments section of Form 1120., 161489=Any code is other than blank or 1-4 or 6–8 for Form 1120., 166354=Form 8832 is attached and either box 6(d), (e), or (f) is checked (Box 2(d), (e) or (f) for 2006 and earlier), 178414=Field 03K7C is transcribed from the Form 1120, Pg 4, Sch K, line 7. This is a numeric only fields that can contain only 3 characters., 5746=If a taxpayer had filed Form 1120S and the Entity Control Unpostable Unit has determined the taxpayer does not have a valid Form 2553, Small Business Election on file, the Form 1120S must be converted to Form 1120 in order to be processed., 198110=If the income or deductions amount is blank, or if lines 10 and 11 or 26 and 27 constitute the only entries, C&E should enter the appropriate transcription lines. Exception: If the return does not require a transcription of the Balance Sheet (Section 11), editing may be restricted to lines 10, 11, 26, 27, Form 1120 (refer to C&E IRM 3.11.16, Corporate Income Tax Returns, for Minimum Edit guidelines)., 5200=In left margin on the first page of the return, edit the preparation of any letter sent and Form 2275 if applicable., 73833=The fields listed below are in Section 02, Form 1120. From left to right are the field designator, maximum field length, title of field and the location where the data is obtained from the return., 120984=The Control Group Code is edited on the dotted portion of line 1, Schedule J, Page 3, Form 1120., 166089=Form 8621 is attached and any line in Part V, Distributions Form and Dispositions of Stock of a Section 1291, ≡ ≡ ≡ ≡ ≡ ≡ ≡ ≡ ≡ ≡ ≡ ≡ ≡ ≡ ≡ ≡ ≡ ≡ ≡ ≡ ≡ ≡ ≡ ≡ ≡ ≡ ≡ ≡ ≡ ≡ . *(Part IV, Lines 10a through 11f for 2011 and prior), 241974=Form 1120, page 3, Schedule J,}",
    "textBeforeTable": "Correctable Section 01 fields are listed below: 3.12.251.5.1  (01-01-2015) Section 01 Field Errors Section 01 contains Remittance, Received Date, processing codes, entity data, and miscellaneous information. Computer generated fields are described under the appropriate Error Code(s). This section provides instructions for correcting Section 01 Field Errors. 3.12.251.5  (01-01-2015) Section 01 Data - Form 1120 Information related to ERS screen displays, invalid conditions and correction procedures are included in each section description. Form 1120 contains Sections 01 through 12, 14 through 18 and 20 through 25. 3.12.251.4  (01-01-2015) Form 1120 Sections and Fields If the taxpayer indicates Section 277 or states \"minimum amount of tax\" when there is no amount for taxable income present, accept the taxpayer's figures by using one or more verified fields. Homeowners Associations may file on Form 1120. When they do so, they are to be taxed at the normal corporate tax rate. 3.12.251.3.25  (01-01-2015) Homeowners Association Filing on Form 1120",
    "textAfterTable": "SSPND with Action Code \"351.\" 3.12.251.5.4  (01-01-2015) Field 01TXP - Tax Period (XREF EC 007 or 026) The tax period is located in the upper right corner of the return. It is the ending month and year of the tax period covering the return. If the tax period is not the current calendar year, it is edited in year/month (YYYYMM) format. For example, December 31, 2014 is edited as \"201412. \" Invalid Condition - Field 01TXP is invalid if: It is not all numeric, The last two digits (month) are not 01 through 12, The tax period is equal to or after the current year and month, The tax period is blank. Correction Procedures: Correct coding and transcription errors and misplaced entries. Check the upper right corner of page one of the return for a correct tax period. If Then",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}