{
    "relation": [
        [
            "Category",
            "Size",
            "Speed",
            "Athleticism",
            "Footwork",
            "Intangibles",
            "Overall"
        ],
        [
            "N.C.",
            "- X -",
            "",
            "- X -",
            "- X -",
            "",
            ""
        ],
        [
            "S.C.",
            "",
            "- X -",
            "- X -",
            "- X -",
            "- X -",
            "- X -"
        ]
    ],
    "pageTitle": "Panther-lair.com - Shrine Bowl Breakdown",
    "title": "",
    "url": "https://pittsburgh.rivals.com/content.asp?CID=68881",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986423.95/warc/CC-MAIN-20150728002306-00299-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 878502504,
    "recordOffset": 878485357,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{1929=Rivals.com is your source for: College Football | Football Recruiting | College Basketball | Basketball Recruiting | College Baseball | High School | College Merchandise Site-specific editorial/photos © 2006 Panther-Lair.com. All rights reserved. This website is an officially and independently operated source of news and information not affiliated with any school or team. About | Advertise with Us | Contact | Privacy Policy | About our Ads | Terms of Service | Copyright/IP policy | Yahoo! Sports - NBC Sports Network Statistical information ©2014 STATS LLC All Rights Reserved.}",
    "TableContextTimeStampAfterTable": "{39392=December 14, 2001, 39883=More than 30 of the nation's top football prospects will be participating in the annual Shrine Bowl game between North Carolina and South Carolina this Saturday, Dec. 15th at Rock Hill's District Three Stadium. South Carolina has dominated this battle recently handing back-to-back losses to North Carolina with a combined score of 90-17. Things will not get easier for N.C. in 2001. Five players the likes of WR Mario Raley and OL Brandon Jeffries will be missing from Saturday's game due to state playoffs conflicts.}",
    "textBeforeTable": "Size: North Carolina - Morgan and Inman will tower over the South Carolina defensive line. The Breakdown: Even without Morgan, this line will create several problems for North Carolina. Though he's listed at 6-4, 255 pounds, Thompson plays more like 6-5, 330 pound noseguard with the speed of a 6-2 230 linebacker. Thompson, who is also the No. 34 ranked tight end in the country, will have to be accounted for on every play or N.C. will have a hard time moving the ball. Beside him, the big and agile Littlejohn surprised onlookers with his athleticism at 6-1, 290 pounds. Littlejohn confirmed that despite having offers from Auburn, South Carolina and Tennesse, he has not set any visits. Rice, a 6-1 320 pound tackle with offers from South Carolina and Tennessee, is simply immovable on the inside. The first line of defense for S.C. features big Moe Thompson, Mickey Rice and the athletic Anthony Littlejohn (pictured). Noticeably missing is arguably the top d-lineman in S.C., Marlboro County's Antwan Morgan; The Bulldogs, sent two other worthy players, OL Frederick Townsend and DB Quinton Teal, instead. Although South Carolina's defensive line did not stand out in practice as much as NC's offensive line, it wasn't because they're not a talented bunch. In fact, they may be more talented than their northern counterparts, but the skills displayed at linebacker, quarterback and wide receiver for the Palmetto State took some of",
    "textAfterTable": "Speed: South Carolina - No doubt that the Palmetto State has a definite edge in this category Athleticism: Push - Sheer individual athleticism would go to South Carolina without a doubt. But when looking at the athleticism displayed for the positions that they play, it's a push. Footwork: Push - You don't get much better than the front line for North Carolina, but to give them an edge in this category would be a miscarriage of justice to their opponents. Intangibles: South Carolina - When you put everything together, the Palmetto State gets the edge. S.C. combines the size, athleticism and speed necessary to stop the run and rush the pass. Overall: South Carolina - North Carolina will hang for a little while, but expect South Carolina to have a significant edge in this battle by halftime. Match-ups to Watch: DL Moe Thompson versus Tackles Derek Morris and Daniel Inman DT Anthony Littlejohn versus Guard Whit Efrid Talk about it in Between Fifth And Forbes FEATURED PRODUCT Nike Pitt Panthers Navy Blue Logo Cotton Long Sleeve T-Shirt",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}