{
    "relation": [
        [
            "Unit",
            "UK Nautical Miles conversion",
            "Miles conversion",
            "Furlongs conversion",
            "Chains conversion",
            "Yards conversion",
            "Feet conversion",
            "Inches conversion",
            "US Leagues conversion",
            "Nautical Leagues conversion",
            "Microinches conversion",
            "US Nautical Miles conversion",
            "Nautical Miles conversion",
            "UK Leagues conversion",
            "UK Nautical Leagues conversion"
        ],
        [
            "Abbreviation",
            "n.m. (UK)",
            "mi.",
            "furlong",
            "chain",
            "yrd",
            "ft",
            "in",
            "us leaguge",
            "us-leagues",
            "micro in",
            "n.m. (US)",
            "n.m.",
            "uk leagues",
            "uk nautical leagues"
        ],
        [
            "Description",
            "Nautical miles measure distance. 1 nautical mile is the angular distance of 1 minute of arc on the earth's surface. As these differ slightly (6108' at pole c.f. 6046' at equator) 6080 was adopted (this being it's approximate value in the English Channel). The International nautical mile is 1852 metres, so is very slightly different from the UK nautical mile.",
            "a unit of length equal to 1760 yards",
            "a unit of length equal to 220 yards still used widley in horse racing",
            "Unit of length equal to 66 feet, used especially in the U.S. public land surveys. The original measuring instrument (Gunter's chain) was literally a chain consisting of 100 iron links, each 7.92 inches long. Steel-ribbon tapes began to supersede chains around 1900, but surveying tapes are often still called \"chains\" and measuring with a tape is often called \"chaining\". The chain is a convenient unit in cadastral surveys because 10 square chains equal 1 acre.",
            "a unit of length equal to 3 feet; defined as 91.44 centimeters; originally taken to be the average length of a stride",
            "a linear unit of length equal to 12 inches or a third of a yard",
            "a unit of length equal to one twelfth of a foot",
            "A unit of distance equal to 3.0 statute miles (4.8 kilometers). Note that there also Nautical Leagues, UK Leagues and UK Nautical Leagues which all differ.",
            "A nautical league was 6,080 yards - or three nautical miles (each league being 6,080 feet). Note that there also US Leagues, UK Leagues and UK Nautical Leagues which all differ.",
            "One thousand micro inches make up an inch.",
            "A unit of length used in marine navigation that is equal to a minute of arc of a great circle on a sphere. One international nautical mile is equivalent to 1,852 meters or 1.151 statue miles. Please not that this is different to a UK Nautical mile.",
            "A unit of length used in marine navigation that is equal to a minute of arc of a great circle on a sphere. One international nautical mile is equivalent to 1,852 meters or 1.151 statue miles. Please not that this is different to a UK Nautical mile.",
            "Note that UK leagues differ from Nautical Leagues, UK Nautical Leagues and US Leagues.",
            "Note that UK leagues differ from Nautical Leagues, UK Leagues and US Leagues."
        ]
    ],
    "pageTitle": "Length converter - online metric conversions for length units",
    "title": "",
    "url": "http://www.metric-conversions.org/length/length-conversions.htm",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989043.35/warc/CC-MAIN-20150728002309-00171-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 581638047,
    "recordOffset": 581629845,
    "tableOrientation": "HORIZONTAL",
    "lastModified": "Fri, 26 Sep 2014 11:55:06 GMT",
    "textBeforeTable": "metric units",
    "textAfterTable": "chain Unit of length equal to 66 feet, used especially in the U.S. public land surveys. The original measuring instrument (Gunter's chain) was literally a chain consisting of 100 iron links, each 7.92 inches long. Steel-ribbon tapes began to supersede chains around 1900, but surveying tapes are often still called \"chains\" and measuring with a tape is often called \"chaining\". The chain is a convenient unit in cadastral surveys because 10 square chains equal 1 acre. Yards conversion yrd a unit of length equal to 3 feet; defined as 91.44 centimeters; originally taken to be the average length of a stride Feet conversion ft a linear unit of length equal to 12 inches or a third of a yard Inches conversion in a unit of length equal to one twelfth of a foot US Leagues conversion us leaguge A unit of distance equal to 3.0 statute miles (4.8 kilometers). Note that there also Nautical Leagues, UK Leagues and UK Nautical Leagues which all differ.",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}