{
    "relation": [
        [
            "Domain Created On",
            "2007-11-22",
            "7 years, 248 days old"
        ],
        [
            "Last Modified On",
            "2007-11-22",
            "7 years, 248 days ago"
        ],
        [
            "Expires On",
            "2015-11-22",
            "0 years, 117 days from today"
        ]
    ],
    "pageTitle": "drmax-lekarna.cz Lékárna online - Dr. Max Lékárna - léky, doplňky stravy, kosmetika | SEOCert",
    "title": "",
    "url": "http://www.seocert.net/analyzer.drmax-lekarna.cz",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986423.95/warc/CC-MAIN-20150728002306-00141-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 698103071,
    "recordOffset": 698081950,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{3670=IP address of drmax-lekarna.cz is : 217.16.184.84. The domain drmax-lekarna.cz was created on 2007-11-22 and it is 7 years, 248 days old. It will expire on 2015-11-22 which is 0 years, 117 days from today. The homepage of website drmax-lekarna.cz has a size of 126873 bytes, and a text size of 17615 bytes, its Text to Code Ratio is 16.12% Homepage of drmax-lekarna.cz has 421 links, 372 link to internal pages, while 49 link to pages on other websites. It takes 0.56 s ( 227.68 Kb/s ) to load the website drmax-lekarna.cz.}",
    "textBeforeTable": "Lékárna online - Dr. Max Lékárna - léky, doplňky stravy, kosmetika Words count: 17    Unique Words: 12    Length: 72 characters [ To optimize the page title, Use this SEO Title Optimizer ] : Title Content Analysis Register To View All >> the 44 recommended tasks to improve your SEO performance. ... Implement browser caching for your site. Host the site closer to the geo location where most of your site visitors come from. Engage more social activities with Facebook, Twitter, LinkedIn and others.. Create more back-links from root domains. Get rid of the 167 errors and 83 warnings from W3C validation. Create blog entries. Reduce number of links to other pages. Configure the server so that your site IP http://217.16.184.84 is redirected to the site domain name drmax-lekarna.cz. Move the 15 inline css components to an external style sheet file. Edit the title tag, ensure it contains 1-12 words, and with 10-70 characters. Recommended Tasks List",
    "textAfterTable": "2 2 The title is too long! It has more than 70 characters. The title will be displayed in search engine results in the form of a direct link to the site. Tips: 1. ideally, the title should contain 10 to 70 characters, including spaces. (Google displays up to 70 characters in the title, and takes into account only the first 12 words.) 2. put the most important and relevant keywords in the title, try not to repeat any word. 3. each individual page should have a unique title. Description : Drmax-lekarna.cz - Dr. Max Lékárna Vám nabízí přehledný výběr a trvale nízké ceny volně prodejných léků, potravinových doplňku, kosmetiky, dětského zboží a ostatních přípravků lékárenského sortimentu, které si můžete objednat z pohodlí Vašeho domova či kanceláře. Words count: 59    Length: 300 characters [ To optimize the page description, Use this SEO Meta Description Optimizer ] The description is too long! It has more than 160 characters Meta Descriptions provide concise explanations of the contents of web pages, that are commonly used by search engines on search result pages to display preview snippets for a given page. Tips: 1. it is best to keep meta descriptions between 70-160 characters.",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}