{
    "relation": [
        [
            "Property",
            "@label?",
            "@rel?",
            "@uri?",
            "@primary?",
            "text()"
        ],
        [
            "Type",
            "xs:string",
            "xs:string",
            "xs:string",
            "xs:boolean",
            "xs:string"
        ],
        [
            "Description",
            "A simple string value used to name this phone number. In most cases, @label is not necessary as @rel uniquely identifies a number and allows UIs to display a proper label such as \"Mobile\", \"Home\", \"Work\", etc. However, in the case where one person has (for example) multiple mobile phones, this property can be used to disambiguate them.",
            "A programmatic value that identifies the type of phone number; see below for details.",
            "An optional \"tel URI\" used to represent the number in a formal way, useful for programmatic access, such as a VoIP/PSTN bridge. See RFC 3966 for more information on tel URIs.",
            "When multiple phone number extensions appear in a contact kind, indicates which is primary. At most one phone number may be primary. Default value is \"false\".",
            "Human-readable phone number; may be in any telephone number format. Leading and trailing whitespace is insignificant. Newlines within the string are also insignificant, and may be removed or flattened out to a single space."
        ]
    ],
    "pageTitle": "Common Elements: \"Kinds\"   |   Google Data APIs   |   Google Developers",
    "title": "",
    "url": "https://developers.google.com/gdata/docs/1.0/elements?csw=1",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986423.95/warc/CC-MAIN-20150728002306-00153-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 868612631,
    "recordOffset": 868588459,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{117086=Last updated April 27, 2012., 43353=All categories below are in the http://schemas.google.com/g/2005 scheme., 92845=If a particular instance of a recurring event is deleted, then that instance appears as a <gd:recurrenceException> containing a <gd:entryLink> that has its <gd:eventStatus> set to \"http://schemas.google.com/g/2005#event.canceled\". (For more information about canceled events, see RFC 2445.), 87702=Specifically, the string usually begins with a DTSTART property that indicates the starting time of the first instance of the event, and often a DTEND property or a DURATION property to indicate when the first instance ends. Next come RRULE, RDATE, EXRULE, and/or EXDATE properties, which collectively define a recurring event and its exceptions (but see below). (See section 4.8.5 of RFC 2445 for more information about these recurrence component properties.) Last comes a VTIMEZONE component, providing detailed timezone rules for any timezone ID mentioned in the preceding properties., 22770=The collection of elements that together describe a contact is called the Contact \"kind.\" Some of the elements in the Contact kind are ordinary Atom or RSS elements; others are defined by Google in a namespace called the \"Google Data namespace.\" By convention, the Google Data namespace is usually referred to in XML code using the gd: alias; for example, the element that contains a telephone or fax number is <gd:phoneNumber>. The schema URL for the Google Data namespace is http://schemas.google.com/g/2005., 103654=A two-day event (on June 6 and June 7) with a string description:, 75807=Equivalent to the Recurrence ID property specified in section 4.8.4.4 of RFC 2445. Appears in every instance of a recurring event, to identify the original event., 91926=For example, say you have a meeting every Tuesday and Thursday at 2:00 p.m. If you change the attendance list for this Thursday's meeting (but not for the regularly scheduled meeting), then it becomes an exception. If you change the time for this Thursday's meeting (but not for the regularly scheduled meeting), then it becomes specialized., 89789=A recurring event that takes place every morning from 6:00 to 7:00 a.m., Pacific time, from March 14 through March 21, 2006:}",
    "lastModified": "Fri, 27 Apr 2012 20:51:10 GMT",
    "textBeforeTable": "Properties Category element: <atom:category scheme=\"http://schemas.google.com/g/2005#kind\" term=\"http://schemas.google.com/contact/2008#contact\"/> Represents a contact: a person, a venue such as a club or a restaurant, or an organization. Contact kind Elements and attributes are presented in standard XPath notation. Optional element, multiple instances allowed elementName* Optional element elementName? Required element elementName In the tables in this document, we use the following conventions for required and optional elements: Typographical conventions The information in this document doesn't cover all possible properties and attribute values for kinds. Services may extend kinds, so a particular service may use properties and values not included in this document. Extensibility One approach that might help is to use the client libraries we provide rather than to try to construct kinds by hand. The client libraries provide various methods for adding and changing data in an entry of a given kind; see the client library documentation for details. It may be hard to figure out exactly what information you need to include when creating an entry of a particular kind, especially because some elements in the kinds contain other kinds. Creating kinds We also don't include information about standard Atom elements that would be meaningless in the given context; for example, <atom:summary> isn't used in the Contact kind, and although <atom:author> is a required element in an entry (unless it's specified in the parent feed), it doesn't have a useful meaning in the Contact kind. We don't",
    "textAfterTable": "gd:postalAddress* Postal addresses. gd:organization* Organization. gd:extendedProperty* Extended property. gContact:groupMembershipInfo* Group membership information. gd:deleted* Deleted state of contact entry. Examples <entry xmlns='http://www.w3.org/2005/Atom' xmlns:gd='http://schemas.google.com/g/2005'> <category scheme='http://schemas.google.com/g/2005#kind' term='http://schemas.google.com/contact/2008#contact'/> <title>Elizabeth Bennet</title> <content>My good friend, Liz. A little quick to judge sometimes, but nice girl.</content> <gd:email rel='http://schemas.google.com/g/2005#work' primary='true' address='liz@gmail.com'/> <gd:email rel='http://schemas.google.com/g/2005#home' address='liz@example.org'/> <gd:phoneNumber rel='http://schemas.google.com/g/2005#work' primary='true'> (206)555-1212 </gd:phoneNumber> <gd:phoneNumber rel='http://schemas.google.com/g/2005#home'> (206)555-1213 </gd:phoneNumber> <gd:phoneNumber rel='http://schemas.google.com/g/2005#mobile'> (206) 555-1212 </gd:phoneNumber> <gd:im rel='http://schemas.google.com/g/2005#home' protocol='http://schemas.google.com/g/2005#GOOGLE_TALK' address='liz@gmail.com'/> <gd:postalAddress rel='http://schemas.google.com/g/2005#work' primary='true'> 1600 Amphitheatre Pkwy Mountain View, CA 94043 </gd:postalAddress> <gd:postalAddress rel='http://schemas.google.com/g/2005#home'> 800 Main Street Mountain View, CA 94041 </gd:postalAddress> <gd:organization> <gd:orgName>Google, Inc.</gd:orgName> <gd:orgTitle>Tech Writer</gd:orgTitle> </gd:organization> </entry> Event kind Represents a calendar event. The event location is represented by a Contact kind embedded in (or linked from) a <gd:where> element; the event planners and attendees are represented as Contact kinds embedded in (or linked from) <gd:who> elements. Category element: <category scheme=\"http://schemas.google.com/g/2005#kind\" term=\"http://schemas.google.com/g/2005#event\"/> Properties Property Description atom:author Person who created this event. atom:category* Categories. Instances with the @label attribute are treated as tags. For information on using the @scheme attribute, see note at beginning of this section. atom:content Longer description of the event. atom:link* Links. Specifically, atom:link[@rel='alternate'] provides a link to an HTML page describing the event. atom:title Brief title for the event. gd:comments? Comments feed. gd:eventStatus? Extensible enum documented below. gd:recurrence?",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}